[{"title":"The shooting never ends, literally.","rating":5,"date":"10 April 2015","review":"Audiences should be aware that The Marine 4 is the epitome of B-movie, it has a simple premise and is designed to entertain with least amount of effort. To its credit, the movie does serve that purpose. It offers lots of shooting spree as well as decently choreography melee combat, even though some of its logic are admittedly flawed and the protagonists wear magical plot armors.<br><br>Jake Carter (Mike Mizanin or The Miz) is starting a new job as a security guard for high value target, a whistle-blower by the name of Olivia Tanis (Melissa Roxburgh). Soon he realizes that the implication Olivia could do is far reaching, and he must do his best to keep her safe. Acting from The Miz is surprisingly good. He's a pretty suitable lead, creating the disheartened veteran persona well. This is better than most exaggerated roles of action genre, although he does look a bit confused at times.<br><br>Matthew MacCaull as the antagonist is above the rest. He presents a conniving personality that presentably irritating. Melissa Roxburgh as the female lead however, is distinctly bad. Her character is supposed to be a brash woman with brave attitude, but it turns out to be an annoying and highly unsympathetic bickering damsel. The rest of cast is your typical mercenaries. Summer Rae makes an appearance as well, while she has so few lines, she does look the part of fit femme fatale.<br><br>Plot and action are severely unrealistic. People are shooting for half of the movie, it's not even a hyperbole. Scenes are basically Jake and random mercs spraying bullets at each other, without the need of reloading and unsurprisingly Jake has far better accuracy. The fisticuffs are marginally better as the fights are choreographed with good impact.<br><br>The Marine 4 is, as expected, ninety minutes of mindless shooting and punching, nothing more. It's not Bourne, but it will do for mindless fun.","user":"quincytheodore","rank":[26,31]},{"title":"What, no reloading?","rating":3,"date":"11 April 2015","review":"OK, granted I love shoot em up movies for the mindless entertainment on rainy days curled up with popcorn and no expectations for great performances. But this is a waste of talent and nothing more than proving script writers without talent can ruin an actor's career.. The Miz, a better actor than this movie deserves, struggles with the poor plot and Summer, well I am not sure why she is even in this movie other than to mumble a few lines. I would have refused the role as it is a career buster and not career enhancer. She could have had a real role other than jumping into and out of scenes cocking a gun. I am a WWE fan and have seen what good movie scripts and talented wrestlers can do together. This is not one of them. Sorry, no spoiler as the movie is so predictable and lame, it gives itself away. I hope Miz and Summer ( I am a huge fan of both ) find better movie opportunities despite their contract obligations to appear in such trash.","user":"williamrehovot","rank":[11,18]},{"title":"Should Be: The Marine 4: Out Of Ideas","rating":3,"date":"16 April 2015","review":"The Marine 4 is a by the numbers and straight to DVD action flick starring some Wrestling stars and a relatively unknown rest of the cast. It concerns an ex-Marine called Jake Carter (Mike Mizanin) who has become a bodyguard. On his first assignment his team is tasked with protecting a young whistleblower called Olivia (Melissa Roxburgh) who has information regarding corruption in the defense industry. Predictably there is a squad of mercenary assassins who are trying to kill her or capture her. Even more predictable is the fact that the mercenaries eliminate everyone other than Jake Carter and the whistleblower he is protecting. Of course there is a traitor in the group who has betrayed them. No shocker there. <br><br>From the first attack the movie becomes a non-stop bullet fest with a lot of shooting and no reloading. The script is unimaginative and the dialogue bad. The acting is cringe worthy at times and there are action scenes which seem borrowed from other action movies like The Terminator (attack on the police station by the mercenaries), and First Blood (chase through the woods, with a lot of deadly traps set by the hero). <br><br>Overall The Marine 4 is a mediocre movie with implausible scenes and no character development. Some of the characters are annoying and their actions and behavior makes no sense, like Olivia knocking out Jake even though he saved her life but she still doesn't know whether to trust him or not. Another annoying thing is that in a course of one night, the hero manages to set so many traps in the forest where they are making their stand that the film looses any believability, not that it had that much to begin with. The fact that the villains in the film seem uncertain as to whether they want to capture or eliminate their target is also annoying. If they want her captured they shouldn't be shooting thousands of rounds at her. If they want to eliminate her, why do they loose the ability to shoot when they are in range of her.<br><br>Overall a lame effort and a waste of time. 3/10","user":"nebk","rank":[6,9]}]