[{"title":"Strong and compelling medieval adventure-drama","rating":8,"date":"25 June 2017","review":"In the early 13th century a group of monks are tasked to transport an ancient holy relic from their remote monastery in Ireland to Rome. They have organised assistance along the way in the form of some French soldiers but events do not pan out in a straightforward way.<br><br>This Irish adventure-drama is one which manages to capture its period feel while retaining a contemporary edge. The problem with these types of movies is often the characters spout dialogue which is overly dramatic and false feeling, like a bunch of modern actors pretending to be from medieval times. In this case, it didn't feel like this so much, with performances being universally convincing and understated enough to feel considerably more authentic than is usual. The choice of using different languages of the day assisted in this, with Gaelic, French and English (the latter of which being used as a substitute for Latin, which the film-makers decided could not be spoken naturally nowadays so an artistic compromise was to substitute that for English). The gloomy Irish landscape was very evocative and atmospheric and captured very well cinematically, and like other adventure-dramas like the Amazon films of Werner Herzog, the landscape is to all intents and purposes another character too, given its visual potency. There is an excellent low-key atmospheric score underpinning the imagery and events which serves the tension and drama very well also. The story itself is very minimalistic and straightforward with a quest narrative that actively allows for a variety of different events to unfold, which includes a couple of dynamic action scenes – a brutal and intense ambush in a forest and a finale on a beach. The story is clever enough to allow for a religious interpretation while offering up rationale explanations for all events too. In this way, it has a modern feel to it while playing off the mysteries inherent in the religious side of things. Overall, I found this to be a very compelling bit of work, with a great atmospheric setting and interesting characters. And because it is an Irish production, it does have a more authentically Celtic feel to it, which served the material well.","user":"Red-Barracuda","rank":[76,84]},{"title":"Who is a devil? Who is an angel?","rating":11,"date":"11 November 2017","review":"Out of the creeping faerie mist of a dark age comes an intensely suspenseful tale about why we choose our allegiances. This is the heart of the story - our reasons make no sense.<br><br>The drama revolves around a lump of rock. That any other lump could replace it at any time and no-one would notice is openly stated in the dialogue. It's the stark question woven through the plot - is faith taken on faith alone really worth fighting for?<br><br>It's a tense film, beautifully written and exquisitely acted. Each viewer decides what the film's about - it doesn't explain itself, it falls silent. Everyone will see something different. Some might conclude we're all compelled towards war whether we like it or not. Some might decide we're all in league with the Devil whether we know it or not. Some might believe we're all still lost in the creeping faerie mist clutching for something to save us.<br><br>Some reviewers didn't rate it highly as an action thriller but it's not a superficial movie and maybe doesn't fit into that genre. There's far more being shown in the subtext and the themes than being told in the action. As for the excessive violence, I felt it merely conveyed the grim reality of melee combat. After all, hidden in the word 'Pilgrimage' is the word 'grim'.<br><br>It's a mark of a brilliant film when after seeing it once you must see it again. On the second viewing, it bit me deeper on the neck and made me more its thrall.<br><br>For me, the main highlight was Jon Bernthal's acting. It was haunting. He played a voiceless man who served the monks as the lowliest of their group and I fell in love with his tragic integrity. He reminded me of another tormented anti-hero of contemporary myth - Angel from 'Buffy The Vampire Slayer': the vampire cursed with a soul, plagued by a weight of remorse for a hellish past. Both crave absolution and will do anything to receive it.<br><br>I loved 'Pilgrimage'. It was a strangely beguiling hybrid of superstitious medievalism clashing with an ancient landscape alive with pre-existing belief. And the ending was satisfyingly unsatisfying - like all good fairy tales are.","user":"Aviva21","rank":[16,16]},{"title":"Much better than expected based on its trailer.","rating":7,"date":"3 July 2017","review":"PILGRIMAGE (2017)<br><br>This is the new film from the Irish director of the excellent 2009 flick called SAVAGE about an assault on a news reporter in Dublin (and it's aftermath) and I gotta say, if Werner Herzog had made this film rather than one about an Amazonian trek he wudda been quite happy. <br><br>The film is set in the early 1200s in Ireland where superstition and the struggle for Christian domination of the country are rife and there, an envoy from Rome is sent to collect a supposedly sacred relic from some rural monks and bring it back to the holy city. <br><br>The movie is grim, and conveys the horrible conditions people existed/lived in back then perfectly (the bloody weather looks the same as Ireland has now though haha). It's highly atmospheric, with bleak Irish landscapes, and the acting is top notch with the film basically being a dangerous road trip carrying the relic to a ship that's waiting for them in Waterford (to sail across to France and onward to Rome). <br><br>The fact that the film is recorded in Irish, French, and English adds a brilliant realism to proceedings which echoes the situation at the time with Ireland being infringed upon from all sides, and along the way things get very messy and bloody (one death is particularly gruesome).<br><br>I'm sure there wasn't a huge Hollywood budget for PILGRIMAGE but they've kept things really concentrated and its certainly exceeds what you might expect to be straight to video cheese. <br><br>This is the third film I've seen by Brendan Muldowney and I think the guy has some talent. I will be looking out for his next film and if you haven't already caught SAVAGE Id check that out too.","user":"horizon2008","rank":[51,59]}]