[{"title":"Not a Mockery, It's a Celebration of Two Men Pursuing Their Dream","rating":8,"date":"24 December 2017","review":"Going into the theater, I was under the impression that this was a silly James Franco and Seth Rogen movie that made fun of The Room, a legendary bad movie. That's not what the Disaster Artist is at all. Instead, it celebrates The Room. It celebrates Tommy Wiseau, Greg Sestero, their passion, and their pursuit of a dream. <br><br> Sure, The Disaster Artist comments on how The Room bombed terribly; it had to acknowledge this. It comments on the utter lack of acting talent that Tommy and Greg possessed; it had to acknowledge this too. But it handles these details with such delicacy and care that I never felt that it was putting down the characters. Actually, it seemed that the film admired them. Even when the world told them to quit, they never gave up on themselves or each other. The message is surprisingly inspiring. <br><br> The movie becomes something more than mere mockery because of the way it handles the relationship between Tommy and Greg with such care and affection. The two genuinely liked each other and saw each other in ways that no one else did. Greg certainly did not understand all of Tommy's methods and decisions, but he understood Tommy's good intentions. Establishing this buddy connection is crucial later in the movie. <br><br>After Tommy writes The Room and they begin filming, Tommy expresses his idiosyncrasies in full force. While the film crew sees him as a confusing weirdo, we know there's something more. Despite his utter incompetence in directing and acting and all aspects of filmmaking, we still root him. And we still root for Greg, ever the supportive friend. Tommy makes absurd and confounding choices that don't make sense to Greg and they don't make sense to anyone else either. Even one of Tommy's explanations was simply \"people do crazy things.\" Still, Greg remains loyal. <br><br>With as strange as Wiseau behaves, capturing his eccentricities would clearly prove challenging. Give James Franco credit for capturing Wiseau's weirdness in character without ever devolving into derisive mockery. Franco captures his gait, stiff shoulders, hunched posture, indeterminable and inconsistent accent, and his laugh. Watching The Room and hearing Tommy Wiseau laugh, I thought that it sounded completely fake. I chalked it up to another instance of poor acting. But after seeing Wiseau in interviews, I realized that it was his real laugh. To him, the laugh wasn't poor acting because that's what he thinks a genuine laugh sounds like. <br><br> Seeing and hearing Wiseau behaving as himself explains a lot about his behavior in The Room. He's just an interesting and very unusual guy. His acting and the acting of others in his movie is still atrocious, but it shifts from startlingly and confusingly bad to understandably bad. And more importantly, seeing the real Tommy makes his movie all the more fun. <br><br> You don't need to see The Room to enjoy The Disaster Artist. Would it help? Sure. Seeing The Room first makes many of the inside jokes made in The Disaster Artist funnier and gives a clearer sense of how confoundingly weird the movie truly is. Words cannot do it justice. To understand, you have to see The Room for yourself. I recommend seeing both.","user":"Jared_Andrews","rank":[151,179]},{"title":"James Franco breaks new ground","rating":8,"date":"8 December 2017","review":"Ed Wood was Stanley Kubrick compared to Tommy Wiseau but James Franco treats him with such loving care that we can connect with his humanity without letting his eccentricities pull us away from him. That, I think, was the most moving aspect of this outrageous true life tale. James Franco is spectacular keeping it true and real in a character that lent itself for caricature. Dave Franco, James's brother in real life is the most believable instant soulmate of the James Dean wannabe. Seth Rogen is also perfect as the one knows that they're in for a major disaster and yet sees the whole thing to the bitter end. I must confess I hadn't heard of The Room but now it's on top of my list of films I want to see next.","user":"danielledecolombie","rank":[191,236]},{"title":"A funny, sincere and heartfelt story of chasing your dreams.","rating":8,"date":"18 November 2017","review":"Having been lucky enough to get tickets to the Australian premiere of The Disaster Artist with Greg Sestero himself in attendance, I was excited and eager to watch this amazing story. A comprehensive look at the making of what might be the most perplexing piece of cinema ever. I was not disappointed. James Franco is so spot on in his portrayal of Tommy's quirks and character its actually surreal. His first scene having him enter an acting class with the confidence of a rockstar but the talent of a fingerless piano player. Almost all of his endearingly strange lines had the audience laughing their heads off. I tip my hat to him and hopefully the Oscars come calling. He deserves to be nominated. <br><br>That presents a problem as well. He makes Tommy too likeable. While he was humanised to a certain extent and some solid insight was given into his motivations and feelings, it has to be acknowledged the real Tommy was far more obnoxious, manipulative and plain nasty. It was hard to present an accurate portrait of him as James Franco focuses more on his quirks and his charm and his tyrannical side was a bit glossed over. Nonetheless I gave him a pass and still loved watching him. And hey, you can't say Tommy isn't sincere. Other changes were made to the story and some plot points fictionalised, but that's the case in nearly every adaptation so that was to be expected. It did capture the spirit of the story and was never boring or slow paced, though it wouldn't have hurt to be a little longer either. Dave Franco does an excellent job as Greg, playing him a little more naive and optimistic than his real life counterpart (the real Greg knew he was not making a good movie, while this Greg seems a little more deluded.) but like the real Greg was so likeable and warm you just wanted him to succeed. <br><br>The film's supporting characters are perfectly cast as well, with Seth Rogen playing a straight man role as Sandy the stunned script supervisor along with several comedians and famous actors popping up left right and centre. The making of the movie is the most enjoyable part and is seriously funny. One of the biggest laughs in the cinema was Josh Hutcherson's first appearance as the room's most peculiar character, Denny, goofy haircut and shirt intact. It was also great to see that Ari Graynor and Jacki Weaver, playing Juliette Danielle's Lisa and Carolyn Minnott's Claudette from the movie respectively, are portrayed as strong willed and thick skinned people who nobly put up with some of the worst working conditions for an actor imaginable. No water or air conditioning combined with gratuitous belly button sex would have probably broken others but they soldiered on.<br><br>Overall it's a hilarious and genuinely moving account of an insane true story. It softens the darker edges a bit too much and I would have loved it to have included some even crazier parts of the book that didn't make the cut but what we're left with is still an excellent and enjoyable movie. OH HI MARK!","user":"jackcwelch23","rank":[93,124]}]