[{"title":"A cracking watch","rating":10,"date":"20 February 2020","review":"Huge fan of this feature. What struck me most was the production quality and in particular the shooting that gives it a 'could be happening down the street' feel.<br><br>The action looks and feels very real, brutal and not over egged. No unnecessary and tired \"was one a special forces operative' is used which is refreshing.<br><br>The dialogue is fairly minimal but what's said is impactful and had a real edge to it<br><br>The lead is great but I was really impressed with the main villain. He came across as slick and heartless. If anything I'd like to have seem more of him.<br><br>The pace keeps you focused and it certainly doesn't play out as you expect.<br><br>A hidden gem.","user":"allansweenie","rank":[6,6]},{"title":"Dark and uncomfortable, but interesting","rating":7,"date":"29 October 2018","review":"Definitely worth staying with. Although there isn't much character development in the conventional sense, Dan gradually shows himself to be driven by complex motives and I was at least satisfied with the outcome. Most of the characters are lowlifes who we are quite happy to see dispatched. The hit man, however, is very scary, although put in the shade by the usually civilised Guy Henry as.... well, you'll have to watch it. Very dark, very violent although not graphic. The sort of film which makes the viewer thankful for a humdrum existence. Quite disturbing, stays with you. Full marks to the team for pulling this off on a low budget. Outstanding photography.","user":"gburrows711","rank":[9,10]},{"title":"Excellent Indie Thriller","rating":9,"date":"18 February 2020","review":"This little gem of a movie is a master class in how to use and work with a limited budget. The directors wisely chose to tell a small, contained story. The result is something very tightly focused that actually manages to grasp well beyond its expected reach.<br><br>It's quick off the mark and snappily paced, drawing the viewer in with no time wasted. The movie exudes confidence, and never falters, striding to its grim conclusion. The excellent cinematography makes it very easy on the eyes on the journey there. Whilst dark, brooding and occasionally surprisingly brutal, our protagonist also gradually reveals some deeper motivations, something to help the audience invest further in his story.<br><br>Performances range from admittedly only acceptable, to very good, with the stand out for me being the hitman. Scary guy, very unsettling. Dan Richardson also nails it in the lead role. There is some clunky dialogue here and there (looking at you inept police officers), and moments of exposition that could be trimmed down, but these are minor issues in a movie that far exceeds expectation. It's a cliché', but these writer/directors could be 'ones to watch'. I wonder what they could achieve with a larger budget?","user":"VaderGravy","rank":[5,5]}]