[{"title":"Thoughtful Chekhovian Drama","rating":25,"date":"25 May 2019","review":"There is a famous play by Anton Chekhov called \"The Cherry Orchard\" that is a great wellspring for thoughtful dramas like \"The Middle Distance.\" Chekhov focuses on the leave-taking of a family that is forced to sell its home and vacate the premises. There was a similar simplicity to \"The Middle Distance\" that elicited the same compelling human touch as Chekhov.<br><br>The film has a symmetry with the character Neil traveling from Los Angeles across country to help settle the estate of his diseased father, sell the family home, and then to return the meat-grinder mentality of a workaholic in L.A. Neil starts as an arrogant and jaded man moving into middle age. He reunites with his younger brother James, who has a perky girlfriend named Rebecca. It is the chance meeting with Rebecca that changes Neil, and the transformation that comes over him is the major thrust of the drama.<br><br>Rebecca is a photographer, and she has been commissioned to capture images of the local landscape in conjunction with the memorial of the father of Neil and James. The filmmakers dynamically convey the winter landscape of the Midwest through their own compositional touches that serve as the prism for Rebecca's photographs.<br><br>There is a turning point in the film when, after consuming too much booze, Neil crashes his rental car into the snow. He and Rebecca then use a golf cart to travel around the community as they make last-minute repairs on the house. He guides her to some of places of his past that would make for good photography. In the wake of the car crash, Neil has the wake-up call through in his bonding with Rebecca and his journey into his past.<br><br>The film sidesteps issues of love and sex to portray the human potential of transformation. Somehow, Rebecca found a way to draw out Neil to recognize his own humanity. This was the kind of drama which a master writer like Chekhov would have been proud.","user":"lavatch","rank":[3,3]},{"title":"Pretty Phenomenal Indie Work","rating":10,"date":"2 May 2019","review":"Most of the time, when I watch a \"festival film\" there's always something that gives it away. This one, however, has no tell-tales. Acting is good. Style is absolutely mind-blowing. Character progression is heartwarming. A great watch!","user":"ckresch-47300","rank":[3,3]},{"title":"a perfect lenght of film","rating":9,"date":"8 February 2019","review":"This was like swimming in smooth water, a lovely near romantic story about a man that goes through some final closures of life. its a close to love- story at a place , were it snows so much,you cant wait for a touch of sun and sand. what only misses is the bling moment of love that were there,but the humble male and the humble female doesnt come further than scratching the surface.....my oh my, dear director who has written this story also, make a sequel to this with the same actors,preferably finding love, that would have been a cinderella story,if you ask me.<br><br>that was a lot of bragging over the film, but it is good, i love to watch american films with real and propper snow, great scenerys, a easy story without exhageration, the filmography and editing are spot on, and the good direction is shown through free and relaxed acting. the music are not fitting my tastebuds, but i shall admit that well in to the story,i relaxed and really enjoyed the float that the score gave to the film.<br><br>as an old grumpy man i am very squemish on the drama genre, but this was great and therefore recommended.","user":"ops-52535","rank":[5,6]}]