[{"title":"Obviously held back by it's minimal budget.","rating":7,"date":"7 December 2016","review":"'BLOOD BROTHERS': Three and a Half Stars (Out of Five)<br><br>The new low-budget psychological horror film, from writer/director Jose Prendes. The story is loosely based on the notorious Leopold and Loeb murder case, from 1924. It revolves around two wealthy brothers, that devise a psychotic plan of murder; in order to prove their superiority, and satisfy their insane urges. When the brothers finally go through with their plan, it causes serious troubles in their relationship. The movie stars Graham Denman and Jon Kondelik (who have both worked with the director before); and it costars Hannah Levien, Barbara Crampton and Ken Foree. It's definitely an ambitious film, and it has some pretty memorable scenes, but it's also obviously held back by it's minimal budget. <br><br>Charles Brubaker (Denman) and Thomas Lo Bianco (Kondelik) are half- brothers; that come from a rich family, and are well educated. They believe they're superior, to most others, because of it. They also suffer from severe psychological problems, including fantasies of murder, and they've been abused all their lives by their sadistic mother (Crampton). They've finally decided to carry through with a devious plot, and feed their psychotic desires, but things don't go exactly as they had planned. Foree plays a detective, with special abilities, that's investigating the duo.<br><br>The film feels pretty amateurish at times, but it's also pretty effective; in a disturbing B-horror movie way. The performances are decent, and the script has a lot of good ideas. It's definitely not memorable enough to ever be thought of as a cult classic, or a superior quality slasher flick (in any way); but it's also definitely better than a lot of other genre films, with a similar budget. I think it's worth watching, at the very least.<br><br>Watch our movie review show 'MOVIE TALK' at: https://youtu.be/bryytrjyDdI","user":"Hellmant","rank":[7,15]},{"title":"Not bad zero budget horror","rating":6,"date":"14 January 2020","review":"To be honest I didn't expect much of this movie , especially after a bit pretentious introduction but after a while it became quite engaging. The two characters of the title are more thought-over than one would expect and keep the whole movie on their shoulders. Help comes from the beautiful Barbara Crampton who was great as usual and the legendary Ken Foree who appears in a small role, while there is gore and violence to satisfy the modern horror fans. Surely it could have been better but even so it is a worthy 100 minutes and surely not for a 3/10 rating","user":"kastrino","rank":[1,1]},{"title":"Low budget with great acting","rating":7,"date":"5 December 2016","review":"It is always challenging to make a movie with low budget but highly entertaining with drama, suspense, tension and surprises. Blood Brothers managed to do that: Loosely base on a real murder case, actors are good, the director delivers how creepy, narcissistic, cold-blood and arrogant psychopaths are, with a different kind of creepiness with Hitchcock films. Although the budget is obviously low, I am also not a fan of horror or cult movie, it grabbed my attention from the beginning to the end. If the detective can crack the case with Sherlock Holmes style, rather than the easy way used in the movie, fix some inconsistency of the characters, I would give it a higher score.","user":"nanagodzilla-763-761395","rank":[3,12]}]