[{"title":"Mesmerizing and visceral","rating":8,"date":"22 September 2015","review":"A slice of the lives of two vagabond gunfighters, the stories that brought them together, and their inevitable spiral as each chooses the degree of violence that must rule their existence. The haunting soundtrack (mostly Kid Dakota, veteran of minimalist-core label Chairkickers Union) punctuated a perfect Foley which provides the crunch of beer cans and a rattling rolling lead pipe in place of the jangling cowboy spurs and whistling wind of earlier gunfighter films. When the story slowed, it never felt stilted or awkward, and the ride was totally worth every minute of building tension. Yes, there is a parallel to Fight Club, but Blunt Force Trauma has none of that film's self-consciousness or absurdity and it's hard to believe that there isn't an underground dueling circuit after watching.","user":"rbeckring","rank":[15,23]},{"title":"The draw of modern high noon standoff","rating":6,"date":"3 March 2016","review":"Pistol duel in wild west is always enigmatically and brutally interesting, \"Blunt Force Trauma\" transitions that rugged charm to the modern era with Kevlar and Colt. This is one simple theme used in pretty exciting way, also delivered by adequately dependable leads, yet the pacing isn't as rapid as the flying bullets.<br><br>John (Ryan Kwanten) is a participant in underground pistol duel, he rises up in ranks fast in order to challenge the legendary Zorringer (Mickey Rourke). Along the way he meets up with Colt (Freida Pinto), a woman trying to avenge his brother against a man allegedly cheated in the duel. The set-up is good, the unique game-like quality gives an roguish appeal to the character and South American setting.<br><br>Ryan Kwanten is a capable lead, he looks psychically impressive and certainly brings the rowdy cowboy persona. Freida Pinto as his counterpart is a good match, they have a nice chemistry and quite believable as two person taking a hazardous trip together. The romance angle works out fine as well, not undermining the serious tone or become too cheesy. The rest of the cast, sadly, are not given too much screen time, including Mickey Rourke, and it makes the scale seems too small.<br><br>Dialogues can be rough around the edges, it tries to be poetically engaging but only succeeds half of the time. Some of the lines are too awkwardly put together, not to mention the momentum halts in the midway point. Its gunslinging parts are intriguing, mostly because it's simple and effective in grabbing people's attention. This could've been done more stylish by introducing outlandish characters, but the movie feels a bit restrained to capitalize on its premise.<br><br>The act of two persons in duel is primal and basic, a nifty way to engage viewers and the leads cater to such effort, however the pace is unable to reach the full velocity.","user":"quincytheodore","rank":[5,6]},{"title":"Very poetic","rating":8,"date":"4 December 2015","review":"For a movie with gun violence as the core activity, this is a very quiet, reflective piece. It is well scripted, well directed and well acted with no filler (no witty banter, ridiculous stunts, little humor, no f/x, etc). They do a good job of -not- glorifying the fights and maintaining suspense; at no point do I want to be in the main character's shoes. Along with Freida Pinto's character, I'm rooting for him to survive and work through his hopefully fleeting passion/obsession, not win the fights. Most of the time the positions he puts himself in just look like pointless death traps that I would rather not see him walk into (contrasted with a Jason Statham or Bond movie where it's fun to see how the protagonist manages to spectacularly untangle bad situations). The final fight is perfect - two accomplished warriors meet with nowhere to go and nothing to do but everything to prove. <br><br>Kwanten did an outstanding job - his character was nothing like I've seen him do before but I doubt Eastwood in his prime could have done better. And Rourke was his character; it may not have been a creative leap for him but it served the story well which is all that matters.<br><br>The weaknesses of the movie are also it's strengths: it has a very small # of relevant cast members and a very simple (but nearly perfect) story and script. So if it's not exactly your type of movie there's not going to be much in it for you.","user":"Fennris","rank":[8,11]}]