[{"title":"Your Guess is as Good as Mine","rating":4,"date":"6 August 2016","review":"Observance starts out promising, making you think it's going to be some type of Rear Window, Body Double, Blow-Up or Blow Out type of suspense mystery. Instead, about halfway through, it turns into a confusing, \"plotless\" experiment in body horror and dream imagery. This is when the minutes start going by ever so slowly as, if you're like me, you start moaning and groaning, wishing something would happen already, wishing some plot would develop, wishing something would be explained or at least make a lick of sense. About two thirds through, if you're like me, you'll start looking at your watch wondering if you should even bother continuing; but you'll hang in there because the camera work is awfully nifty, the music is haunting, the lighting is creepy and there are a handful of jump scares after all. Then the credits will roll and, if you're like me, you'll shrug your shoulders and ask yourself, \"What the heck was that?\"","user":"chicagopoetry","rank":[31,38]},{"title":"Major disappointment","rating":1,"date":"12 May 2018","review":"Although there was so much promise to this movie, the director left out so much information as to what was going on. Comparing it to Rear Window is a criticism of Rear Window. Too many pieces of incident that didn't connect. Why was he getting sick. Why was he throwing up 'tar', as it were. Why is he even monitoring this woman? Who was the child? Why go back and forth to the ocean view and chat with his friend? What's with the jar on the shelf? Who was the male visitor? Just not good enough for me to watch again to pick up what I missed...and I always miss something in movies that I watch more than once. Why end the movie the way he did? Sorry....thumbs down!","user":"hsschwartz","rank":[16,19]},{"title":"Decent plot let down by pretentiousness","rating":5,"date":"19 October 2015","review":"\"When I first saw this film\", said the London Film Festival luminary who introduced it, \"I was haunted by it for weeks\". I can't say I had the same reaction: I was mildly annoyed for a few minutes, perhaps.<br><br>The plot is actually pretty decent: Parker, a surveillance operative, is hired to spy on a young woman. He moves into a dilapidated building opposite her flat, from where he takes pictures and listens in on her telephone conversations. But strange things are happening in his building: the shower water suddenly runs scalding hot, blocked-up windows mysteriously unblock, and there's a jar full of an ever-increasing amount of black liquid in the corner. All this - plus strange visions of his deceased young son - seems to be having an effect on Parker's health...<br><br>But the film has the feel of a student project that somehow metamorphosed into a full-length production. It's very arty-farty - the washed-out shots of isolated clifftops had me expecting to see Death with a chess board at any moment. No effort is made to explain many happenings - such as the bear's head, or the faceless woman, or that jar of black liquid - giving the impression the producers thought they'd be really cool things to put on screen but couldn't be bothered to work out why they should be there. And that's before we consider the mistakes: the energetic sex scene where Parker is obviously still wearing his underpants, and the woman supposedly just stepped out of a shower who is, in fact, bone dry. But in the scenes where Parker is roaming around his claustrophobic house, the film-makers have unquestionably successfully created a dark and threatening atmosphere, and some the close-up camera-work of, for example, carpet threads or drops of blood is pretty good.<br><br>In the lead role, Lindsay Farris is a near-constant presence on screen; as such it's fortunate that he's easy on the eye, nicely filling his white T-shirt and black jeans. But there are too many shots of him leaping backwards in surprise, and his American accent wavers all over several States (and becomes Irish at one point). In fact, although the cast is largely Australian - and this is an Australian film - they all use American accents - an emerging trend in Australian cinema? (see also 'Infini').<br><br>I like to end reviews on a good note, so here's one: when Parker awakens from a nightmare, does he do the usual thing of sitting bolt upright in bed, panting heavily? No he does not! His eyes snap open in surprise, but he stays laying down. A definite plus point in the film's favour - some film clichés really should be laid to rest.","user":"euroGary","rank":[35,48]}]