[{"title":"Overly complex and riddled with vain symbolisms","rating":4,"date":"2 August 2015","review":"This is a prime example where less is more. The movie executes multiple perspectives and subplots to the point of exhaustion. It follows John Doe (Vinnie Jones) as he sets intricate plans for revenge by hiring six different conmen or assassins. Each of them reveals a facet of the target, along with occasional flashback and branching story, all of which ultimately end in an uninspiring conclusion.<br><br>With six hit men following their own respective plot, this is basically six short stories woven together, but not in consistent fashion. It's not an intersecting story like Snatch or even Smokin' Aces, there are many perspectives and timelines, yet they don't mesh together that well. It even feels fragmented since each hit-man has limited screen time, not enough to establish their character for overall continuity.<br><br>Cinematography is done with too much focus on style, the movie repetitively pans over to the same shots of night club, flashback or slow motion gun shot. Prepare to see these scenes again and again throughout the movie as though it wants to be edgy so badly, instead it becomes tiresome later on.<br><br>The cast is pretty presentable, action fans would be pleased to see the Vinnie Jones or Vivica A. Fox. The characters are made to cater flamboyant lifestyle with extravagant personalities and attractive ladies. This might appeal to viewer who like exaggerated hit-man or noir style, although the movie could've worked better with lighter tone or more constructed plot.<br><br>It tries to produce intense display of a revenge tale as it delves into different aspects of the target's life, yet it's gradually becoming shallower as it progresses. Furthermore, the ending feels forced, making it a needlessly complicated and boring spectacle.","user":"quincytheodore","rank":[19,23]},{"title":"so bad","rating":2,"date":"27 November 2015","review":"I love movies, even bad ones but this was SO BAD. Tom Sizemore was in it, it can't be that bad I thought. He wouldn't have made a bad movie, he was in it for like 3 minutes. I feel stupider for having sat through the whole thing. I never write reviews but I had to warn everyone else. Don't bother... It is almost like some guy in high school watched the Usual Suspects, Pulp Fiction and a few other modern gangster movies and thought, gee, I can do this. Nothing to it... Just mash up all the cliché plot themes, scatter the time-line and have a big secret at the end and it will be so good. Maybe he thought it would launch his career and he would be so famous. Instead he has to live with the shame of knowing his friends, family and future girlfriends knowing that he was the one that wrote this god-awful story. Back to washing dishes...they say its better to try and fail than not at all. This movie is a great argument against that point.","user":"mdamiano-77387","rank":[11,13]},{"title":"An amateur trying to make a Tarantino movie and failing miserably","rating":4,"date":"4 August 2015","review":"I rarely rate a movie so low because... let's face it, there are few movies worse that this out there that I try to watch. I chose 6 Ways to Sundown because of Vinnie Jones and Bai Ling. Love them both, but guys, why did you do this to me?<br><br>From the very start one feels that something is not quite right. The dialogue is overly pompous, without adding anything to the story, the film is divided in chapters, the chapters are presented in a reverse order, there are flashbacks that need other flashbacks to explain and so on. The film is screeching \"Wait for the twist! It's going to blow your mind\". If you got this far into the review, trust me, it is not going to blow your mind.<br><br>Then everything is really really badly made. The people dancing in the club of the \"most notorious drug dealer in North America\" are dancing worse than I do. That's bad! The productions values are low. The acting is bad. Vinnie Jones spends all of his 5 minutes of acting in a car, Bai Ling is beautiful as ever, but she barely does anything, Tom Sizemore (which I really dislike anyway) dies in the first few minutes and Vivica A. Fox... why are they hiring her anymore is beyond me. And these are the best actors in the movie.<br><br>Bottom line: a complete and utter waste of time. It's always risky to watch something written and directed by the same guy, but this is not even so bad it's funny, like The Room.","user":"siderite","rank":[14,18]}]