[{"title":"Hilarious and so much fun to watch!","rating":9,"date":"15 August 2017","review":"I had been anticipating watching this movie since I first saw the trailer. I love this movie!! I saw it with my closest girl friends and we laughed out loud throughout the entire movie. I will definitely watch this again and again. The story was great and the characters were a lot of fun to watch. The cast was absolutely perfect and I don't think they could've done a better job casting this movie. I had no idea Tiffany Haddish was so funny! I appreciate a great FEEL GOOD story like this one and I love that the bond of the characters is one that inspires women to stick together and support one another. Well done!","user":"ahill-47433","rank":[67,119]},{"title":"Check out the other reviews","rating":1,"date":"23 August 2017","review":"After witnessing what can only be described as a 'car crash' of a movie, I was surprised to find so many glowing reviews?! However, clicking onto the majority of these profiles reveals they are new members whose accounts were coincidentally created around the time of the films release, or appear to be used to push specific movie titles with a political agenda. Why? This is a Movie Database not a platform for terrible politics.<br><br>One of them even goes so far as to mention her son by name (and highlights this) in every review, regardless of whether or not he saw the film.<br><br>Anyway, The movie is terrible, technically it is average looking and it would be hard to fault the quality of the medium, given that most people have HD built into their smartphone now.<br><br>Each scene was as desperate as it was cringe-worthy, using every common, overplayed cliché and trope from last year. People getting covered in urine is not comedy, And I think it's fair to say the ignorantly confident and 'sassy' girl power thing has been done to death. The story failed to convey any moral or real emotional weight. Uncomfortably, the cast was almost entirely and purposely 'Blackwashed' with the exception of some 90's Spike Lee style reverse tokens if you look hard enough. Just why? Shameful.","user":"kepeb","rank":[164,323]},{"title":"Awful","rating":1,"date":"24 July 2017","review":"I have walked out of 2 movies in my entire life. This is the 2nd. considering how expensive going to the movies has become it takes a lot for me to get up out of my seat and say my time is more valuable than my investment. <br><br>I stayed a little over an hour thinking somehow it might get better. The people in the audience I was in all laughed at every joke so I came to realize that I was not the target audience and the jokes would continue on this level. <br><br>This was the story of a \"girls trip\" with old college friends. The trailer looked pretty cute and I always liked Queen Latifah, Jayda Pinket Smith...so I thought this could be another Bridesmaids or something vulgar but cleverly vulgar (I'm not against vulgarity).<br><br>This movie was unbelievably juvenile. And not like that's such a bad thing. Juvenile humor CAN be quite hilarious (if it's clever), which imho this was definitely not. <br><br>In Bridesmaids \"Annie\" took valium chased with hard liquor and questioned the flight attendant as to why his name was \"Stove\" (even though it was Steve) and drunkenly told him that \"this is the 90's. It's civil rights\" and he told her \"you're in the wrong decade\". Yeah, this was juvenile too, but imo it was very clever and hilarious. <br><br>The \"spoiler\" was when Jada's character got into a harness (though she revealed that she had to pee) in New Orleans to zip line from one building to another with thousands below her. Her zip line got stuck halfway across and big surprise she projectile peed on the people below. Of course the audience laughed hysterically. I was not amused. Instead I was pretty depressed that this is what people find funny.","user":"missyjoy25","rank":[96,184]}]