[{"title":"The end was missing","rating":5,"date":"31 May 2018","review":"Seriously, this movie ended without any destination being reached. \nIt set it up quite well, but there was no point, no conclusion, no deep reveal, no destination traveled to, \nI really enjoyed the scenery and some of the dialog, it was like a class on marine biology, and some average concepts on life, but then it just left it there, nothing......\nBit of a waste of the journey if you either don't have anything to say or you don't know how to convey it.","user":"Rob-O-Cop","rank":[50,55]},{"title":"It didnt work for me.","rating":4,"date":"2 February 2018","review":"I watched it at Göteborg film festival som days ago. I really wanted to like this but its just didnt click for me. <br><br>The actors fail to sell the love story, they dont connect on the screen and that technobabble from Alicia Vikanders character doesnt make it better. <br><br>Two parallell stories at once. For this to work the love story need to be sold, but it just doesnt work. I dont belive it when the main characters get outburst, the reaction feels to theatric and it becomes a make belive reaction for show. <br><br>To really make the terrorist look bad and evil they put in things that just oversell the evilness of the terrorist. Yes I get it, they are the badguys but it becomes a bit to much. <br><br>Sorry. I really wanted to enjoy this but it didnt work for me.","user":"zolizolidus-35734","rank":[80,107]},{"title":"What a waste....","rating":16,"date":"16 April 2018","review":"The arrangement of allowing these two people met at an old but grand hotel on the beach was kind of awkward, and staying there so long was another thing that didn't look possible, and she should be just called a Dr. instead of a professor, because she didn't look like someone who taught a specialized subject in a college classroom. What we saw and heard were just a lot of terminology words out of her mouth, it felt more like they were forcefully memorized to make her look more like a scientist, but somehow it didn't work either. The special agent of the British anti-terrorism scenario was also not quite selling well. There's no way he could not be spotted as a suspicious white westerner trying to infiltrate the terrorist organization in Somali, so no wonder he would be immediately kidnapped and thrown into the prison. <br><br>There were too many scenes showing these two lovebirds flashed back to when they spent the short but long stay in that hotel on the beach. But when it was played so many times and again, it just numbed the viewers since there's not too much and too many stuff there to continue the on-going story.<br><br>The movie gradually lost its steam in the end by showing us a lukewarm deep sea probe, then gave us some sudden power shortage in the sub, then the problem was just miraculously fixed by flipped off all the switches and then flipped them on. What a joke! Then again, when he dive into the ocean before the attack and bombing from the air by the American chopper, he was supposed to be the only survivor during that attack since he was already far away from the target area, because it was him who activated the transponder device in his teeth to broadcast his whereabouts, so he got enough time to walk into the ocean, swam and dived to avoid the strikes from the air. But what we saw was just a guy facing down in the ocean and died, just to comply with the movie title \"Submergence\", by going down but never resurfaced. They both sunk, but only the so-called \"Professor\" was spared, giving the viewers some sort of regret and sadness, a love in vain. What a weak and rush and sudden finish of a film that only showed us lot of beautiful camera works.....A shameful ending of a half-baked love story; lukewarm and pointless.","user":"LogicIsEverything","rank":[44,60]}]