[{"title":"Twisted Family Dynamic, Solid Thriller Storytelling","rating":8,"date":"8 September 2016","review":"*Contains Minor Spoilers Of Inciting Events* Staged amidst upper-crust opulence and scored with deliciously ethereal electronica, Blood is Blood orbits a quartet of orphaned but affluent siblings on a sliding-scale of derangement. Think Game of Thrones' House Lanister (minus the incest) meets Ted Bundy, wrapped in a psychological-thriller package reminiscent of Black Swan. It refreshingly abstains from the Fight-Run-Exposition plot typical of sub-par thrillers, favoring instead a dark exploration of a small cast of supremely screwed up siblings.<br><br>I'll admit I spent a good portion of Blood Is Blood wondering whether there was any underlying logic at all. Tempted to buy into the narrative- wanting to believe- but agonizing over whether it would let me down with some cop-out. It's the danger of smart entertainment: I know I'm not the only one who shouted bloody murder at their television after Lost took seven seasons to deliver what amounts to one of the biggest middle-fingers ever flipped in the history of mankind, and even the power-combo of Ryan Gosling and Ewan McGregor wasn't enough to redeem Stay, which aimed for 'artsy and intellectual' and instead hit 'pretentious and contrived'.<br><br>The second I catch a whiff of possible chronological tomfoolery, unreliable point-of-view, or possibly mentally-ill protagonists- all of which are present in Blood Is Blood within the first fifteen minutes- I'm hearing klaxons. So I'll save you the trouble of agonizing over whether it's worth your time.<br><br>Blood Is Blood delivers, and then some, largely on the backs of the four featured siblings.<br><br>There's Daniel, who I applaud for unabashedly embracing his inner-women but must condemn for simultaneously embracing his inner torturous psychopath. Jessica stands out as the only (probably) sane, emotionally stable number of the brood, starkly contrasted to Crew, the older brother who moonlights as a masked, fratricidal maniac...<br><br> Right up until the moment he inexplicably attacks our protagonist, his adoring sister Brie, who stabs him in the neck, repeatedly, about ten minutes into the film.<br><br>In the vein of Hemingway \"less is more\" storytelling, the driving force propelling Blood Is Blood is what's left unsaid, and all in a succinct seventy-five minutes (less credits). The viewer is constantly questioning not only the characters' demented motivations, but their reality. Are any of these people sane? Are we getting the full-story? What are we missing? Considering the intentional chronological confusion, we're not even always sure what happened when, or frankly whether it even happened at all.<br><br>Disturbing imagery abounds, and the chilling score ratchets the tension to eleven. The action is jarring, unexpected, but never over-saturated. There were enough jump-scares to spill my popcorn (twice). But the most frightening aspect of Blood Is Blood is ultimately cerebral.<br><br>The entire jigsaw's there for anyone to solve- many of the most important clues crop up in the first fifteen minutes- but the pacing and measured revelations keep the average viewer guessing right up to the climax. I wouldn't say it hits every mark it aims for, but if it isn't a consistent bullseye, it all at least lands on the target.<br><br>Fiona Dourif (Brie) brings unexpected nuance to a her second top-billing roll. Tormented by her dead brother Crew- or someone impersonating him, barring an outright paranormal explanation- she flees the sanatorium she's been in since she was forced to kill him in self-defense. With characters whose perspective I can't entirely trust, it takes some serious acting chops to get me invested, but Dourif meets the challenge admirably, and debut writer-director Stuart Sauvarin provides solid, balanced material for an active protagonist and strong female lead. From the outset, Brie's presented as a woman of action with strong will, a survivor's resourcefulness, and a depth which even a relatively unengaged viewer will recognize as hinting towards far more than meets the eye.<br><br>While Brie's joined up with little-sis Jess to try and figure out who's terrorizing her from behind Crew's old mask, the narrative splits several times. We follow Daniel and his crossdressing-torture fetish for a while, which breaks up the main arc nicely. As a villain he's enjoyably demented, shifting dramatically from a charming young socialite into a sadistic murderer as he dolls up for his evening in the mansion's basement-cum-dungeon (a spine-tingling set which, unfortunately, doesn't get as much attention as it deserves).<br><br>He's also developed a stalker-ish infatuation with Sarah, Crew's fiancée, who's on the brink of total mental breakdown. Apparently she hasn't quite reconciled her charming fiancée with the fact that he was, well, traipsing around in a leather mask and trying to kill his sister. It's made clear from the get-go that she hasn't let Brie off the hook for killing him- even in self-defense- and Brie (who was never Sarah's biggest fan) has her own suspicions about Sarah's roll in the intrigue quickly spiraling towards the final, bloody confrontation. Weave in the origami motifs- you'd never think a paper fox could inspire this much dread, but the film nails it- and what you're left with satisfies both the intellectual mind with its puzzle, and the darker, lizardian id with its horror.<br><br>Blood Is Blood hasn't reinvented the wheel. It hasn't broken any new ground in the psychological-thriller genre. But it dishes out exactly what it promised- terrifying thrills in an intelligent package- and your own family dynamic's bound to look a lot healthier after you've seen Blood Is Blood.","user":"Heres_Johny","rank":[11,19]},{"title":"Psychological horror, indie style","rating":2,"date":"30 January 2018","review":"BLOOD IS BLOOD is a typically cheap indie horror that goes for the psychological approach. The protagonist is a mixed-up young girl who represses memories of her past and gradually uncovers some very dark secrets about her dysfunctional family as the running time progresses. She ends up being thrown into a mental institute which doesn't really help her very much, but so little happens during the movie that this is one big waste of time. There are the usual hallucinations and flashbacks but they fail to impress, and it's all rather shrill and silly. The main actress, Fiona Dourif, is none other than the daughter of cult star Brad.","user":"Leofwine_draca","rank":[5,11]},{"title":"Possibly Best Horror Movie On Amazon Prime","rating":10,"date":"21 August 2019","review":"I pretty much only watch horror movies and this quickly became one of my favorites on both Amazon and Netflix. I liked it so much, I made my best friend, who also loves horror, watch it. It's one of the few horror movies we agree on. No way you can figure this out until the end. I watched this twice already and am still picking up on things I missed the first time I watched.","user":"chinara_lucas","rank":[3,6]}]