[{"title":"'Can Tell the Makers Worked Hard To Make It Realistic ✅","rating":8,"date":"15 April 2019","review":"This 35-year miner liked it. The build-up scenes were spot-on. The 'big' event and it's aftermath was kinda hard to believe, but possible. This movie can show the public how hard miners work and that talk of cutting their pensions is unconscionable. Thanks to the makers. You done good 👌🏻","user":"gino-69858","rank":[36,50]},{"title":"Now I understand the dangers of coal mining","rating":8,"date":"13 January 2020","review":"I thought I knew what coal mining was about. But the truth is I had no clue at all. This movie is especially interesting for its realism and the attention to details. I discovered some harsh working conditions, not happening in the 18th century but in modern times and that makes it even more frightening. The machinery is more interesting than in sci-fi movies, and the tension is higher than in alleged horror movies. There are imperfect things, but as a whole, Mine 9 is very impressive.","user":"in-imdb-1","rank":[8,9]},{"title":"impressive and suggestive, a milestone on a proffesion","rating":8,"date":"5 January 2020","review":"I dont know much about what a miners life is, but having seen enough from tv shoots from the svalbard mines, i know its a narrow and dark working space, just enough room for me the claustrophobic, small but broad shouldered grumpy old man.<br><br>its a film about the blackness of hell down the devils ground, where they break the black gold at the gates of purgatory, where gasses and fumes and the earpinning noise of machinery, but also silence, gives you a pretty good roller coaster ride of a my day in the mine shocker, horror ,thriller, drama feature film, made on a scoarched budget.<br><br>so take my word that this is crude stuff, the actors have done their deeds eating dust and rocky water, and i think that this is quite a maximum of what you can make on a low budget. therefore impressive it is. i can just imagine what it could have been with some goliath main stream production company funding this idea, that might have been able to fulfill the soaring plotholes that obviously occurs here and there due to lack of a dollar.<br><br>but the makers have done a good job making this very realistic and close to real life, so whether your a coal miner or a greenpeacer, have a look, its stunningly made a done. a recommend from the grumpy old man","user":"ops-52535","rank":[8,9]}]