[{"title":"Well balanced movie...","rating":20,"date":"20 June 2016","review":"W.T.F. is a movie which tries to belong in too many genres simultaneously, including Comedy, Drama, Romance, War, Action, Documentary, and has a statement to make about pretty much everything including long-distance relationships, politics, professionalism, cultural differences etc. etc.<br><br>Without excelling in any of that, it manages to be a well balanced movie in the 110 minutes of its duration.<br><br>Tina Fey plays Kim Barker, a real person and an actual journalist, who is dissatisfying from her career covering low profile stories, and decides to go to Afghanistan as a war correspondent for a few months, or so she thought...<br><br>The movie has a good structure. It starts as a comedy, something you might expect because of the main actress, but soon the situations become real and more dramatic.<br><br>The rest of the cast includes well known actors like Alfred Molina, Billy Bob Thornton, Martin Freeman and Margot Robbie.<br><br>Overall: Don't expect a comedy because of Tina Fey. It starts like that but it evolves to other genres really quick. It might not be a great movie but it's not boring and you get something out of the inner journey of the protagonist. How easy is to feel unnatural situations as normal when you are a long way from home...","user":"Dr_Sagan","rank":[79,85]},{"title":"Strong Satirical look at the Afghanistan conflict","rating":8,"date":"8 March 2016","review":"One of the reasons that I write reviews of movies is that I hope to turn people on to good movies that might otherwise fly under their radar.<br><br>Such is my hope with Tina Fey's latest film WHISKEY TANGO FOXTROT - a satirical view of the conflict in Afghanistan as seen through the eyes of a novice International reporter (Fey). What starts out as a funny and corny \"fish out of water\" movie, slowly morphs into a more serious film about the addictive nature of constantly being in a warzone situation.<br><br>Fey is perfectly cast as the central character - war correspondent Kim Baker - who heads to an overseas assignment in Afghanistan to escape a rather humdrum life. I was a little nervous, at first, as all the funny parts that were in the trailer were in the first 1/2 hour of this film - and Fey handles those with aplomb. She is a gifted comedienne, so these scenes looked effortless for her. It is her transition to a more serious reporter, addicted to the adrenaline of her job that Fey really shines. I was impressed with her serious work in THIS IS WHERE I LEAVE YOU and was anxious when it looked like her career regressed with last December's SISTERS, but I'm happy to say she continues to grow as an actress and she is strong in this part.<br><br>But, this movie is more than just Fey. She has a very strong supporting cast around her - Martin Freeman as an Irish photographer, Margot Robbie (who continues to grow as an actress) as a friend/journalist competitor to Fey, Alfred Molina as an Afghanistan politician and newcomer (at least to me) Christoper Abbott as Fey's interpreter - they all bring something interesting to the table that helps this movie along.<br><br>Special mention should be made of Billy Bob Thornton's General Hollander - the US Commander in the region. While he does not have many scenes in the movie, he brings a presence that is heads and shoulders above everyone else when he is on screen. This fits well in this movie, for the Commanding General in that region should be heads and shoulders above the rest. He also gave me the best laugh in this movie (a joke I will not spoil here).<br><br>This movie is much, much more than a simple rom-com or military comedy, it is a Comedy/Drama that brings quite a bit of heart to it. I would strongly encourage you to seek this one out, you'll be glad you did.<br><br>8 (out of 10) stars and you can take that to Bank (of Marquis)","user":"bankofmarquis","rank":[105,141]},{"title":"Has soul","rating":22,"date":"22 March 2016","review":"I am impressed. This is one of the few films which has inspired me to read the source material; the autobiography by the journalist Kim Baker..<br><br>The film starts with comic moments as greenhorn middle-America Kim Baker (Tina Fey) arrives in a war zone. Then, the film darkens as it touches on the corruption of the expatriate community and the seduction of war reporting.<br><br>Surprisingly, Tina Fey can act in a dramatic role. Being comic with a straight face, facing danger, fending off romeos, and falling in love. In the end, Kim Baker rediscovers herself and returns home.<br><br>The film deals superficially with the horror faced by Afghan civilians and the root causes of the insurgency. However, this is the story of a white woman in a foreign land.<br><br>Overall, the film was predictable but lightly touches the soul. Credit to the editor for walking the difficult line between entertainment and horror. The rest of the cast did a creditable job.","user":"jim9tan","rank":[40,56]}]