[{"title":"Not Being Like Other Movies is a Strength, Not a Weakness","rating":10,"date":"8 March 2016","review":"Most of the negative reviews you see for \"Don Verdean\" are the same as the negative reviews for \"Gentleman Broncos.\" It all boils down to one basic idea: \"This movie isn't enough like other movies I like.\" Professional reviewers and users alike miss the boat on these movies because they want them to fit in a neat little package. You'll hear a lot about how they didn't feel the movie worked as a straight comedy, or straight drama, or that mixing biblical jokes with more adolescent jokes doesn't work. They are missing the point. This is not meant to be a single genre, or even really a mix of genres, instead it is an examination of characters, ideas, and themes.<br><br>Unlike many other movies, \"Don Verdean\" (and \"Gentleman Broncos,\" for that matter) is not looking to work as a whole, indeed these movies reject the idea of balance and chemistry as proscribed by mainstream films. Instead, DV is about about the details. Each moment of the movie has been engineered, largely without a thought for the other moments. In the Hess world, if something is interesting that's reason enough to include it, regardless of how it fits together with other pieces.<br><br>It's not inherently worse than other films (in fact, you'll see tremendous talent in the film-making, the acting, and the script); it's just a completely different approach. So see \"Don Verdean,\" not because it's more of what you already like (and have) but because it isn't.","user":"mallred87","rank":[32,41]},{"title":"Just Didn't Click","rating":5,"date":"14 December 2015","review":"Leaving the theater, the general feeling was \"meh\". Possibly based on Yiddish origin, it's a general shrug of the shoulders meaning neither good nor bad. <br><br>The best way to describe this movie is to say it's not funny enough for a comedy, but not serious enough for a drama. Rather than combining words and calling it a dramedy, I'd suggest keeping the same words but flipping the order, calling it a coma. The movie just never seem to get going. If intended as a light- hearted story, the laughs were just too few and far between, even though the premise itself was humorous. Meanwhile, the basic story of a Biblical archaeologist down on his luck was just a bit too silly for a drama. I'm a big fan of Sam Rockwell, Jemaine Clement, and Danny McBride, but this wasn't a great vehicle for any of them. <br><br>It's a shame, because some aspects of the movie were very well done. The cinematography was fantastic, for example. Don't get me wrong, this wasn't a bad movie. It just didn't do much for me. Your mileage may vary.","user":"kr98664","rank":[34,48]},{"title":"Enjoyable performances with a great story, but did not wow me as expected.","rating":5,"date":"17 December 2015","review":"Huge fan of Sam Rockwell so I was excited to see this flick. He plays the title character a Archaeologist specializing in finding artifacts that prove the Christian faith is real, but under pressure he becomes a con artist and gets over his head keeping the con going.<br><br>Danny McBride and Jemaine Clement (of flight of the Concords fame) give the quirky comedy to Rockwell's straight man. Both men give me some laugh out loud moments. While Will Forte who is also in the movie is good for just a few giggles here and there.<br><br>The story was actually really cool as it becomes very outrageous when the devoted Christian starts to go a little too far to keep his con going.<br><br>It is unfair to compare Don Verdean to Napoleon Dynamite, but I can't help it after finding out the same guy directed both. I'd say Don Verdean had more story and is strengthen by Sam Rockwell's performance with McBride and Clement supporting him. It has the same style of charm that makes all the characters interesting to watch. <br><br>Plus it really is good for a few laughs.","user":"subxerogravity","rank":[17,23]}]