[{"title":"Well executed, Assassination is a precise drama and equally engaging thriller.","rating":7,"date":"10 September 2015","review":"The plot to assassinate Japanese high ranking officers takes a group of Korean agents into spiral of betrayal. It is told in surprisingly large scale, shifting back and forth to events preceding and following its historic attempt told by numerous characters. In heart, it is an excellent drama with focus on stylish noir cinematography and slick visceral action.<br><br>Story admittedly takes a bit to gain momentum. There's an intricate web of espionage and it might get overwhelming with its many timelines and characters. The back stabbing or direct front shooting could get confusing early on. Fortunately, after it sets the foundation the pace pushes forward relentlessly until the end. Ji-hyun Jun as An Ohk-Yun the lady sniper is impeccable, she's attractive on-screen and also looking very capable for the demanding spy role.<br><br>Acting is great all around, considering there are many intersecting personalities, everyone plays their part amicably and these characters are presentably memorable. It offers a few subplots, which might seem overly dramatic or cliché at first, although the presentation is adequately precise in ensuring that it remains a legitimate drama thriller.<br><br>The action is superb, capitalizing its last century setting and multitude of fancy oriental scenes. Barrage of bullets and deception are portrayed with massive intensity. It plays with fight scenes as well as gun-slinging action remarkably well. Furthermore, the slick nature resembles the quirky bloody showing from Tarantino movies, the flamboyant flair is a treat for action fans.<br><br>There's no lack of treachery, vengeance and sheer animosity in the harsh era which may feel overburdened at times. Still, with exquisite human drama and solid action, Assassination keeps the aim steady to deliver a delightfully exhilarating spy thriller.","user":"quincytheodore","rank":[27,32]},{"title":"Double and triple crosses","rating":9,"date":"7 August 2015","review":"This is a marvelous film about the Japanese oppression suffered by the Koreans over 4 decades. Most of the film is set in 1933 during an assassination attempt on a Korean collaborator and a Japanese official responsible for horrors inflicted on the Koreans in Manchuria in 1931. <br><br>The central character is a sniper for the Korean Independence Army (Jun Ji-hyun) who takes on the assignment. The film is filled with all sorts of interesting characters, with names like \"Hawaii Pistol\" and \"Big Gun\", and there are double crosses and even triple crosses along the way.<br><br>The photography is terrific, the atmosphere is nostalgic, and even the music adds to the film's value. Writer-Director Choi Dong hoon keeps the acting moving right along.<br><br>Rather than merely an assassination film, this is more of a story of relationships, and at the core is one family's journey through the tumultuous times, although you may not recognize this at first.<br><br>The subtitles are a little hard to read, and some of the characters are hard to tell apart, but otherwise this is an excellent film. I was particularly taken with the acting of Jun Ji-hyun and Ha Jung- woo","user":"drjgardner","rank":[36,47]},{"title":"Intellectual action-drama that requests multiple viewings","rating":8,"date":"25 December 2015","review":"\"Assassination\" or \"Amsal\" is an engaging and epic mixture of an espionage action film and a historically inspired drama. Both genre parts are equally balanced and the modern special effects aren't so overloaded that they feel out of context in a movie set more than eighty years ago. The film convinces with an intellectually appealing script, diversified and great characters and acting performances and a solid mixture of historically inspired storytelling, personal drama parts and tense action scenes. There is no doubt that this is one of the best movies of the year.<br><br>Over the course of almost two and a half hours, the film tells the story of an assassination attempt on a Japanese governor and a pro-Japanese Korean business tycoon by Korean resistance activists during Japan's colonial rule of Korea. The movie is set at different times and even the perspectives slightly change which makes the movie a little bit hard to follow in the beginning. The film takes all the time it needs to introduce the different characters and the historical settings which adds a lot of depth to the characters, details to the historic elements and emotions to the story. These are the reasons why the slightly long introduction that might be hard to sit through for wider audiences is absolutely essential to the rest of the movie.<br><br>The first slow-paced hour builds up to the furious last ninety minutes of the film. The final two thirds of the film feature a stellar acting performance, a smart use of camera angles, costumes, locations, soundtrack and special effects by the director and a clever story with many predictable but also unpredictable twists and turns in form of different conspiracies.<br><br>Especially the fate of female sniper Ahn OK-yun who is portrayed by an absolutely stunning Jun Ji-hyun in the best performance of her career is a key element of the movie. Most viewers will probably care a lot about the twisted ups and downs of this engaging character.<br><br>The showdown of the movie is one of the best directed action scenes in world cinema this year and in the history of Korean cinema in general. It's not as memorable as the fighting scenes in \"Oldboy\", \"The Man from Nowhere\" or \"The Admiral: Roaring Currents\" but it gets quite close and has a breathtaking choreography. The coda of the movie which takes place almost two decades after the actions of the main plot is an excellent way to end a great movie on a high note.<br><br>Due to it's complex story and high number of directional ideas, I would recommend watching this movie several times. This emotional action-drama is definitely worth your attention and one of the cinematic highlights of the year. I can't wait to revisit this great film and buy this movie on DVD or Blu-ray next year.","user":"kluseba","rank":[18,22]}]