[{"title":"Although it is nothing groundbreaking or history-making, The Fluffy Movie is a fantastic work of comedian art","rating":9,"date":"25 July 2014","review":"One type of film that hasn't exactly progressed or evolved heavily in recent decades is that of the stand-up comedy movie. After the 80s when it was dominated by Richard Pryor and Eddie Murphy the popularity and the quantity of this type of film dwindled quite heavily. The demand for the art form wasn't as heavy since the inception of YouTube, Comedy Central, and the ions of other ways to hear funny stories and jokes. But then in recent years we have seen Kevin Hart give it a quiet comeback with back to back successful films concerning his stand-up. Although they lack the legendary and timeless appeal of the 80s stand-up films like Himself, Live on the Sunset Strip, and Raw; it was a step in the right direction.<br><br>The Fluffy Movie however has knocked Hart out of the park and just might be the best of the stand-up comedy movies since Original Kings of Comedy.<br><br>Gabriel Iglesias has come a very long way since his Nickelodeon and Last Comic Standing days. He has developed quite a feverish fanbase, has gotten plenty of attention amongst his peers, and has become one of the top YouTube sensations in the entire internet. What makes him stand out is his ability to provide sound effects while delivering humbling and relatable stories full of humor, and full of heart. His fans are dedicated, his fans are also quite knowledgeable about his running jokes and his family scenarios, which is something you see in very, very few comedians. The personal touch of Gabriel Iglesias allows for it to always sound like he is talking to you, directly to you, as opposed to a big crowd.<br><br>Unlike the vindictive ways of Louis C.K. and Bill Burr, Iglesias never looks or sounds like a guy that is trying to get under your skin, he comes off as a funny member in the family that is always looking for a good joke. The down-to-earth nature gives him a more nurturing audience---you'll never see Iglesias have to battle his audience like George Carlin, Bill Burr, or Richard Pryor.<br><br>And of course now we have The Fluffy Movie. In this special, Iglesias talks about all types of things from health to family life to even India. The beauty of his stand-up is that you can see yourself in most of his stories, he comes off as a blue collar person living the blue collar life, even if he has success ringing behind his ears in the form of a beautiful stage set resembling the Bay Area. And this may come off as meandering the audience into thinking he is not living comfortably, but that's not the issue---for example: Kevin Hart in one of his films had a bit about one of his friends renting out Disneyland for an entire afternoon. Was it funny? Yes. Could we relate? Nope.<br><br>Gabriel Iglesias has a bit about how back when he was growing up he had to perform surgery to save his Nintendo Entertainment System. Was it funny? Definitely. Could we relate? Most of us most certainly can. His physical movements when saving his NES was one of the highlights of the show.<br><br>He is descriptive without getting too offensive (PG-13 stand up comic? Whaaaaaaaaaaat?), he isn't afraid of physically describing the story, and ultimately throws a heavy dosage of heart with each of his performances. The delivery is always spot-on, even when the punchline can take a very long time to arrive. And finally as the added bonus, can do hundreds of unique voices and impressions as well as provide some Latin flair to his jokes.<br><br>The Fluffy Movie however really picks up in the third act when Gabriel Iglesias goes out for an emotional loop and provides a hilarious yet very heartfelt tale involving closure with some past demons. Without spoiling too much, it took the audience in California as well as my viewing audience by surprise at the circumstances that had played out in recent years with him. It got quite personal as even Iglesias was having some trouble delivering the material. But the mixing of jokes and emotional punches made for a surprising and jarring journey that hits close to home, and it sinks deeper within the of your soul than the average dosage of content coming from a comedian. Luckily for all of us, the final sentence ended with a fantastic punchline----that had been set up half an hour ago.<br><br>In terms of cinematography and direction the movie keeps it simple, keeps it focused, and relies solely and mainly on the quirky, energetic, and lovable Iglesias. And it works every step of the way, and it never overstays its welcome. Although Gabriel Iglesias does nothing new or extremely different to attract a new crowd, the die-hard fans and followers of his work will be entertained, delighted, and satisfied with the final product. Whether or not this launches Iglesias to a new level of success, there is no denying the magic and the talent of what I consider to be now one of the top comedians in the business.","user":"diac228","rank":[19,27]},{"title":"Great Onstage Performance With Deep family Roots","rating":8,"date":"27 July 2014","review":"A superbly spun tail of deep a deep personal journey many people can relate to. If you are looking for a straight up comedy show then this is not for you. But if you want superb story telling which touches every age group then Fluffy is the man. His spins a tale like no one else on the stage today. He always ties bits of story back to other stories which are seemingly unrelated.<br><br>At times it can be quite heavy, as I said this is not a straight up comedy show. At other times it's immensely deep. He pushes and pulls the viewers the entire time wrapping you up in his life and his battles to be who he is today.<br><br>If you have a teenager, go see it. If you are a teenager, go see it. Parents take your teens, my daughter loved it.<br><br>Fluffy Fluffy Fluffy","user":"rpilla001","rank":[9,12]},{"title":"The best special he's performed so far!","rating":9,"date":"24 July 2014","review":"I loved this stand-up comedy special. I enjoyed the small intro with Gabriel's friends, about his parents hooking up, and fluffy's childhood..<br><br>I'm a great fan of Gabriel, and I love his comedy, just so many other people, and i have to say this is his best special so far. I loved his storytelling and all of his funny stories about traveling with martin, losing weight and getting healthier, his relationship with his step-son Frankie, talking about his dad who he hasn't seen for 30 years, and of course his impersonations.<br><br>Anyway if you are huge fan of fluffy, or if this is your first special you ever seen from him, it will not disappoint you. His awesome stories will make you laugh and cry. To the long time fans, there are some references from past specials or interviews, and you will love the intro. I don't want to spoil anything from the film, so i'm just going to say to go watch this film and laugh from fluffy's comedy.","user":"jugallaga","rank":[7,11]}]