[{"title":"I was ready to slam this...","rating":7,"date":"15 May 2016","review":"...But, when all was said and done, I just couldn't. Could it have been better? Yes. Was it as bad as others here have written? No. I think the reason people here have given it a bad review, is that it IS lacking in some respects, however, it's an interesting story, original in it's execution. It's filmed beautifully, for a horror film. My kudos to the Cinematographer, it looks amazing.<br><br>I think most people now a days want their ghost stories to have more 'jump scares' and less 'story' and THAT'S why it's getting bad reviews. If they were more familiar with Rod Serling, or had seen some of the Hammer Film movies, they'd appreciate this one more.<br><br>This movie takes the typical 'abandoned cabin in the woods' story to an entirely different area, tying into 'true events' and putting a solid twist ending to good use.<br><br>I rated it a 7-10 because I think what this movie really needed was MORE Thomas Jane, and maybe some John Carpenter-esque sound tracks, but over all I enjoyed this movie more than I expected it to.","user":"crdnlsyn13","rank":[35,37]},{"title":"A film defined by one performance......","rating":5,"date":"25 January 2016","review":"In most respects The Veil is a very ordinary film. It takes a well trodden path that mixes the notion of re-incantation with an invasion of the body snatchers/possession twist.<br><br>Most of the performances in this flick are pretty forgettable. Jessica Alba's character, who is supposedly the lead, spends most of her time looking like she's about to have a painful visit to the dentist. She's perpetually afraid, from the opening scenes to closing credits, with little in the way of emotional range, in between. <br><br>What holds this film together and really defines it is the show stealing performance by Thomas Jane. Janes character, cult leader, Jim Jacobs, is a pretty transparent Jim Jones, Peoples Temple, knock off. But what a knock off! Jane is absurdly good and utterly convincing as Jacobs. So much so, I kept watching what is otherwise a rather mediocre film. <br><br>Its a shame we don't see more of Jane in leading roles, he clearly has a lot to offer. I think for one thing he'd make an outstanding Jim Jones, should anyone decide to revisit that sad story. As to The Veil, I'd say watch it for Jane's remarkable performance but beyond that, don't come to this flick with big expectations or you will be disappointed. Five out of ten from me.","user":"s3276169","rank":[39,43]},{"title":"I'm hard to please and I liked this","rating":7,"date":"20 April 2016","review":"I am the biggest critic of horror films. If there's just one thing that doesn't seem right, I automatically dislike a film. I really liked this, though.<br><br>It has a unique story, one that hasn't been touched upon very often: scary cults. It has a good cast who all work well together. There's not too much crappy dialogue, like the ubiquitous \"Die you f-ing b****!\" that is found in a lot of movies. (I've never understood how someone, who is fighting for their life, could be thinking of screaming cuss words at an attacker, and I curse like a truck driver.) I'm not a huge fan of Jessica Alba but this role worked for her.<br><br>The scares were a success. I jumped a couple of times.<br><br>Overall I think it's a very good scary movie. Is it Oscar-worthy? No, but that's not why I watched it.","user":"elizrug","rank":[16,19]}]