[{"title":"Never heard of it . . . but pretty good stuff","rating":7,"date":"7 November 2015","review":"I watched this one tonight and was pleasantly surprised. As I had never heard of this movie, I didn't expect much . . . but I ended up being moved enough by the film to write a review on this Saturday night.<br><br>The movie is about a boy whose mother has just died. He is going to live with his grandparents in New Mexico and a mysterious stranger offers to give him a ride. Of course, he has no idea what he is in for by accepting the offer and a fascinating \"road trip/coming of age\" story ensues (with a few surprises toward the end).<br><br>I hate long reviews, so let's get to it: I grew up in Texas and the locations used by the director are lonesome and add great authenticity to the movie. The directing was above average by Trey Nelson (who appears to be primarily a TV guy until this film) and I thought the acting was excellent by Josh and especially Josh Wiggins as Louis.<br><br>This is a pretty good film if you are in the mood for a lonesome road movie. 7/10 cheers","user":"troyboy6868","rank":[45,49]},{"title":"Simple but very effective film","rating":10,"date":"28 November 2015","review":"I sort of stumbled across this film, and thought yeah it has got an OK cast, the ratings on IMDb (specially the amount of 1 votes) were sort of on the low side, but glad I gave it a go.<br><br>It has a very simple story line that guides you along from the minute it starts, and I really got caught up in it, the music was partly to blame, but it was filmed with a feeling most high end Hollywood products would kill for.<br><br>Great performance by the whole cast, especially the kid, and seeing it has a low score of 6 on IMDb, I gave it a 10 as it deserves a way better rating than it has. If you like a film that gives you that chill kind of feeling, with out blood and guts purely because of the great acting and simple but very effective story, than you will love this film!<br><br>10 out of 10","user":"DoNotTrustImdb","rank":[26,33]},{"title":"Beautifully made, excellent acting. Wonderful!","rating":8,"date":"16 November 2015","review":"Stumbled across this gem. Superbly crafted, fabulous cinematography, brilliant casting and great performances from everyone. Outstanding locations. The expansive angles capture the southern mid-west perfectly. <br><br>Characters are rich and absorbing, even those who only feature for a few moments. <br><br>The only thing that lets it down is the script, which is a little predictable, but does have the occasional surprise. But the excellent acting carries it off, and for me it's still 8 out of 10. <br><br>If you enjoy watching a truly well made film, you'll love this one.","user":"peter-stephens2","rank":[19,25]}]