[{"title":"Beautiful in every sense, Moana will soften even the hardest of hearts","rating":9,"date":"5 March 2017","review":"Moana is a return to the classic Disney formula, the clichés and characters ripped from a number of other animated films. However, the pure beauty and skill of the production rises the old story into new heights.<br><br>Following from the success of Zootropolis, Moana follows a more traditional narrative we know and love; the princess who wishes for something more and is whisked on a supernatural adventure. We know this story so well yet Moana seems fresh and thrilling as if the plot was innovative. Perhaps this is due to the Polynesian setting or the morally ambiguous Maui, played perfectly by Dwayne Johnson, but most likely it is it the simple magic of Disney – the wonder for both children and adults has reached its peak with the perfection of the classic formula. For once, the clichés make the film more enjoyable. The quality of the animation helps too: it's clear they have reached the pinnacle of blending realistic textures with stylised designs, creating an aesthetic beauty that few other companies can match – Disney have mastered water to the point it looks better animated than in real life! Even the music has been perfected here, the annoying catchiness of Frozen's tunes replaced by memorable but effective songs that fit the culture and setting of our adventure. A childlike warmth was awakened in me and many other adult members of the audience as the film brought the emotional highs of the Disney renaissance without the modern subversion of the classic tropes. While Moana sometimes threatens this with pop culture references, the film thankfully keeps to mostly traditional values and morals; a step above many children's animated films released today.<br><br>Moana is good, old fashioned Disney magic; the traditional narrative and morals updated with stellar animation and an awareness that's effective but never overpowering enough to threaten the integrity of the Disney formula.<br><br>SWEET<br><br>Visit https://sweetorsaltedmoviereviews.com/ for more.","user":"akarmiotis-94922","rank":[82,112]},{"title":"Just the best!!!","rating":10,"date":"18 December 2017","review":"I love everything about this movie. The colors, the setting and the characters, all good to my eyes!","user":"hezekiahlamet","rank":[17,20]},{"title":"what a delight!","rating":8,"date":"8 February 2017","review":"Wow, what a great great movie! The visuals in this movie are breathtaking!! They are so gorgeous! But, besides the visuals there is such a heart and imagination and creativity to this movie. Moana is such a likable, smart, and relatable person. the voice work for Moana is so sweet and so good. The chemistry between Moana and Maui is so great and so natural. The songs in this movie are so charming, catchy and fun! But, How Far I'll Go is such an emotional song and it has such heart...I dare say I like it a little more than Let It Go! The way Moana sings it and you can feel it!! Wow, I just looved this movie and it is great for kids and adults. I will always love it and I wanna see it again!","user":"snperera","rank":[111,165]}]