[{"title":"Less than the sum of it's parts...","rating":7,"date":"3 September 2015","review":"...Which is odd, to say the least. <br><br>If you love film, you'll find something to take from this. If it's just simple entertainment you seek, best look elsewhere. <br><br>It's a puzzler - read some of the polarising reviews - in a way, it reminded me of Jim Carrey in 'The Cable Guy'; you don't get what you expect, and that can be a shock to some, and a boon to others. <br><br>Interestingly, and unexpectedly, I now think more of Jack Black - mayhap he just hasn't had the right vehicle to stretch his talents fully in, yet. <br><br>It's never going to make the pantheon, but it does have some things of merit; not least of which is the ability to make you cringe whilst not looking away. The how-can-it-possibly-be-resolved expectation is uncomfortably high. <br><br>I liked it; the discomfort, as it dawns on you, is tremendous and it walks its' line well - not subtle, but hey - I imagine the studio execs having a nightmare trying to decide how to market this. Whether it dawns on you, or slaps you in the face, will depend...<br><br>Once you've watched it, just think on that for a minute - because that vapid 'Tries to get reunion together' rubbish just doesn't cover it, does it? <br><br>Loved the soundtrack - especially the INXS lyricism - and some of the lines were priceless. (Lawnchairs)<br><br>I liked it. I feel the ending was rushed a little, but then, how else to cover bases?","user":"DrtyBlvd","rank":[27,31]},{"title":"A great film being held down by a mediocre one","rating":6,"date":"8 May 2015","review":"Jarrad Paul and Andrew Mogel's \"The D Train\" is a far more layered film than its trailers lead one to believe. Beneath the sequences of ribald partying and an explosive Jack Black performance lies tender, more touching ideas of disillusionment, self-delusion, and identity, personal and sexual. Great films have been assembled just from using one of these ideas, and for a film to include all of them in some way shows a large amount of ambition on part of the writing and directing team at work here. However, while being bold enough to try and tackle something larger, \"The D Train\" tries to have it both ways, creating a raunchy comedy out of material that deserves a more intimate focus and treads almost fatally into the Adam Sandler \"anti-character study\" formula of belittling its troubled hero.<br><br>The film follows Dan Landsman, the self-appointed chairman of his high school's twentieth reunion committee. He is the \"do all\" man on the job, working as hard as everyone combined, as he appears to relish the days of high school and the memories it left for him. Dan's immediate problem is that nobody, neither the remainder of his committee nor his old classmates, share even a fraction of his enthusiasm, and his constant monopolizing and narcissism fills his peers with contempt. With nobody RSVPing to the reunion, Dan finds one thing that will make them all come and that is the presence of Oliver Lawless (James Marsden).<br><br>Oliver was once a popular kid in high school, who went on to pursue his career in acting, predominately in TV commercials. When Dan catches one of Oliver's commercials on TV, he starts an unhealthy obsession with the man, much to the dismay of his wife and fourteen-year-old son. Dan goes as far as to travel to LA with his boss (Jeffrey Tambor), fooling his boss and his wife into thinking it's a business trip, so he can meet and ask Oliver to attend the reunion. Dan and Oliver wind up partying all night before their debauchery makes them question who they really are and want to be.<br><br>Dan is played by Jack Black, an actor once committed to the most ridiculous and shallow comedies, who branched out to show his true colors within the last few years. Black is ideal for Dan, a complex character, as his wild, larger-than-life personality and rapidly changing moods are handled with expert realism and genuine talent. Despite having a character that, at times, is incredibly contemptible and somewhat frustrating to watch, Black nails this role, similar to his role as Bernie Tiede in \"Bernie,\" where he took a character and simply ran with it.<br><br>Marsden, on the other hand, plays a character where more sophistication and mental stability is assumed. He plays the slick actor, with a cool exterior and a troubled interior, hoping people get so caught up in the former they won't even notice the latter. Black and Marsden make a dynamic duo, and both, particularly Black, transition smoothly between the ribald and the dramatic.<br><br>\"The D Train,\" however, examines loftier ideas than I presume anyone going into it ever imagined. The film shows the efforts one will go to continue to fend off feelings of inferiority and disillusionment, along with ideas of sexual revelations, even if that means shunning those you care about the most and becoming so self-absorbed you become uncaring. Dan has ostensibly always been like this, but his behavior worsens over time, and a lot of it is no laughing matter. The problem is, presumably in efforts to make the film attract a wider audience, Paul and Mogel still kind of want you to laugh at this character, even while he's in the mix of an identity crisis. This kind of nonsense is for an Adam Sandler film where the character is irredeemably unlikable; not for a film with such serious ideas behind it.<br><br>Furthermore, the film's wobbly tone works against it, sometimes wanting to take on the personality of a raunchy comedy and sometimes straying from it into something more meditative. Again, this makes it seem as if Paul and Mogel don't have enough confidence in their material to make the central focus the deeper, more thoughtful ideas. In efforts to appeal to a more mainstream audience, which I, maybe pessimistically, don't see really happening due to the film's minimal marketing and almost destined obscurity, \"The D Train\" finds itself squandering its potential, a criminal mistake that hurts an otherwise quietly significant film.","user":"StevePulaski","rank":[50,65]},{"title":"Poor comedy, but solid drama","rating":7,"date":"23 August 2015","review":"Another mislabeled movie... So no wonder that people who expected to have mindless fun watching Jack Black in a typical comic role he used to play many times before and James Marsden in a role similar to the ones he played brilliantly in Sex drive or Death at a funeral, got unexpectedly hit with quite dark theme with no many things to laugh at and disappointed. At first, I was disappointed too, but somewhere at the middle I realized that the movie it self is good, that the theme is important and that above mentioned (but all the others too) actors did amazing job. I blame the marketing of this movie, poster, but you too dear IMDb for providing wrong info on a movie category and misleading synopsis. So, in conclusion - as a comedy, this one is quite bad, but as a drama, it's very nicely done.","user":"silmaril-6","rank":[30,39]}]