[{"title":"Surprisingly delightful","rating":9,"date":"26 July 2016","review":"I didn't expect such a good movie to be honest. The plot sounded interesting but when you watch the movie you get hooked in about 10 minutes. The characters are incredible with their own personality ( i really liked main characters brother , his story was great). The soundtrack was...oh man...it was incredible and a great addition to the movie. <br><br>I believe that this is in my top 3 movies of the year so far and that's why everyone should give it a watch. Trust me you will not be disappointed at all. Its an amazing movie for all ages.<br><br>Also the acting is great and the 80s of course give the movie a nostalgic and beautiful tone","user":"billntoumos","rank":[90,104]},{"title":"Against all odds, John Carney does it again","rating":9,"date":"16 March 2016","review":"I'm a huge fan of the movie Once. When I arrived at South By Southwest, and saw that John Carney had directed another movie, I have to say I was a bit skeptical that he could capture the magic of that movie again without the amazing music and raw performances of Glen Hansard.<br><br>My fears were unfounded.<br><br>SING STREET is a heartfelt, funny and artful coming-of-age movie set in 1985 Dublin. I'm close to an ideal audience member for this film, because I grew up in the 80s myself, a child of the MTV Generation. I count John Hughes' films and the Cameron-Crowe scripted Fast Times At Ridgemont High among the most influential films of my childhood. They are the reason I became a screenwriter, and why I continue to write movies for a teen audience.<br><br>Sing Street truly hearkens back to those great teen movies of the 80s. The best stories about teenagers are rooted in pain and isolation, and this is no different - Connor \"Cosmo\" Lawler comes from an upper middle class family that has fallen on hard times. His parents have constant fights. His older brother Brendan is a college dropout and his sister, the 'smart one,' pretty much keeps to herself. In order for the family to save money, Connor is transferred to the local Catholic boys school, where he's quickly made an outcast and an example by the authoritarian headmaster.<br><br>You could say that this is a movie about forming a band. And this genre of story - of artistic awakening - seems to be replayed quite often in British and Irish films like The Commitments, Billy Elliott, The Full Monty, and others. But those movies each had a unique wrinkle, and Sing Street does too. It's the beautifully told story of the way that the inspiration and inception of the best art is rarely an individual act of genius, but rather, the result of a series of interconnected acts of human desire and emotion.<br><br>It's the parents who sentence you to a horrible school; the girl who you long for that won't give you the time of day; the other guys who join your band because they're outcasts too... the brother who loves you too much, and is too angry at his own cowardice, to let you settle for less than your best.<br><br>There's also a lot of great humor in Sing Street about the fact that you have to try on the styles of your heroes before you find your own confidence. 40-something audiences will definitely get another level of enjoyment out of all the allusions to great 80s bands. The art direction and costumes are done wonderfully in that respect. But I think this movie will work wonderful for today's teenagers as well.<br><br>The movie is by turns funny, heart-wrenching, soaring and surprising. And the musical numbers, while not necessarily Oscar winning, like Once, is great. I'm thrilled that a new generation of teenagers will get to experience the release of a movie that's on par with the films I love so much as a kid.","user":"Jaymay","rank":[95,123]},{"title":"Sing Street is a delightful film that is almost impossible to watch without a smile on your face and tapping of your feet for its outstanding soundtrack.","rating":8,"date":"7 January 2017","review":"Sing Street (2016): Films about people at school forming bands are well known for being 60% more lovable than any other sort, and this movie is no exception.Sing Street,directed by Irish Film maker John Carney,has already been nominated for 74th Golden Globe Awards but sadly it will lose it to La La Land.If not for La La Land,Sing Street has all the necessary emotions and qualities to win a best musical movie of 2016.Why am I boasting it up before the review?You will see..<br><br>Plot:<br><br>SING STREET takes us back to 1980s Dublin seen through the eyes of a 14-year-old boy named Conor (Ferdia Walsh-Peelo) who is looking for a break from a home strained by his parents' relationship and money troubles, while trying to adjust to his new inner-city public school where the kids are rough and the teachers are rougher. He finds a glimmer of hope in the mysterious, über-cool and beautiful Raphina (Lucy Boynton), and with the aim of winning her heart he invites her to star in his band's music videos. There's only one problem: he's not part of a band...yet. She agrees, and now Conor must deliver what he's promised and immersing himself in the vibrant rock music trends of the decade, he forms a band with a few lads, and the group pours their heart into writing lyrics and shooting videos.In a sea of opportunities ahead of them, what does the future hold for a love like this?<br><br>Plus Points:<br><br>1)Music: Sing Street is brilliant mostly because of its music.Much of the original music by the band \"Sing Street\" was composed by 80s veteran composer Gary Clark,which really gives us some nostalgic 80's rocking music with meaningful lyrics.For every 5 minutes a song always plays and it played a brilliant part in the movie.\"The Riddle of the Model\" is one of the best track from this movie.I loved the other tracks too.<br><br>2)Performances: Newcomer Ferdia Walsh-Peelo is outstanding in his role and he surely has a bright future ahead.He surely is a Futurist:)When Conor gives an early Sing Street song called The Riddle of the Model to Raphina, he assures her: \"It's not about you. It's about another model I know.\" Walsh-Peelo delivers the line with just the right mixture of shyness and teenage petulance.The other one I liked in this movie is Mark McKenna who played the role Eamon who has talent to play any kind of instrument.Lucy Boynton is lovely.Especially during the shoot of The Riddle of the Model,her expressions are marvelous.Jack Reynor as Brendon is very good in his role.<br><br>3)Screenplay and Direction: Sing Street has the most familiar plot for a musical drama but John Carney successfully made such a beautiful engaging drama with a perfect script.Sing Street is, in fact, a delightful coming-of-age tale that both celebrates young love and laments how quickly the fire of youth can be snuffed out. Director John Carney knows exactly how to mesh storytelling and music into his films.He is the next best after Damien Chazelle in directing a perfect musical picture.A great applause for Carney.<br><br>So,Sing Street is a delightful film that is almost impossible to watch without a smile on your face and tapping of your feet for its outstanding soundtrack.One of the best musicals in recent times.<br><br>My rating 8/10","user":"shobanchittuprolu","rank":[16,18]}]