[{"title":"Now that's dedication","rating":7,"date":"12 April 2015","review":"Greetings again from the darkness - from the Dallas International Film Festival 2-15. Most documentaries are pretty simple to recap: A filmmaker makes a movie about a topic or person. However, simplicity just doesn't fit here. Filmmakers Jeremy Coon and Tim Skousen made a movie about the making of a movie that is a movie re-made in honor of a movie that was already made. This isn't Coppola's Hearts of Darkness which portrays his difficulty in making Apocalypse Now. Far from it. This is a modern day look back at two/three geeky eleven year old boys making a shot-for-shot remake of Steven Spielberg's classic Raiders of the Lost Ark.<br><br>Coon and Skousen catch up with forty-somethings Eric Zala, Chris Strompolos and Jayson Lamb as they are trying to put together the financing and logistics to film the final scene of their unfinished movie Raiders of the Lost Ark: The Adaptation. These are the same boy that started the process in 1982 and filmed each of the next seven summers until they graduated from high school.<br><br>If you are a total film geek, you have probably heard of their film and know that it has been an underground film favorite for years. But you may not know the real life details behind it and certainly not the modern day drama of Eric and Chris as they try to complete it. How about some interviews with their mothers? How about the real world possibility that Eric risks losing his job to complete this thirty plus year old kid's summer project? How about the personal struggles of Chris over the years, or the fallout with Jayson as he is left out of this final chapter? <br><br>Director Eli Roth was instrumental in spreading the word of this film project throughout Hollywood, and the boys even got invited to meet with Spielberg. Mostly we are left with the fascination that young boys can have such passion and persistence over so many years. When asked about whether they missed out on their childhood, Chris responds \"We filmed childhood\". A true and fitting response, that doesn't tell the whole story. Fortunately, Coon and Skousen do.","user":"ferguson-6","rank":[13,17]},{"title":"Well done documentary","rating":8,"date":"7 August 2016","review":"Inspiring, often times funny documentary about a trio of eleven years- olds who set out to do Raiders Of The Lost Ark- they didn't remake it, they *made* Raiders Of The Lost Ark- in its entirety, in the homes and cellars, with next to no money, and over the course of several summers in the 1980s. Four documentary film crews then followed them in 2014, as they filmed the sole scene they could not film originally. <br><br>This doc includes new interviews with them, along with clips from the film itself, and a few blooper reel scenes and outtakes, and original, hand-drawn storyboards (of which there were 602, as explained in a film festival Q&amp;A session after the screening, and before showing Raiders of the Lost Ark: The Adaptation) and people like John Ryhs-Davies, who have publicly commended the film.<br><br>Required viewing for fans of Raiders Of The Lost Ark, film buffs, and anyone who ever dreamed and fantasised about making a film.","user":"Zbigniew_Krycsiwiki","rank":[4,5]},{"title":"A remarkable documentary about remarkable kids!","rating":9,"date":"18 June 2016","review":"When you watch a classic like 'Raiders Of The Lost Ark,' it's hard to not feel motivated to see and try if you can recreate those scenes or at the very least walk around cosplaying as Indiana Jones with your friends. So you may watch this docu and start out by wearing your adult or parenthood lenses on and wonder what in the world are these kids thinking but five minutes into it, you'll get a sense of respect and wonder because you've realized that they managed to accomplish what many of us can only wish for.<br><br>I think one of the many fascinating things about this docu is that directors Jeremy Coon and Tim Skousen were given so much access into the lives of Eric Zala, Chris Strompolos and Jayson Lamb, even the darkest moments in their past when at one point their friendship fell apart. If anything, what's most inspiring about this 'RAIDERS!' docu is to see these guys from when they were kids all the way on till they've become grown men and have their own families, how over all those years, they still had that dream and passion lingering on the back of their heads and they act on it and see it through. While others would probably give up because of life happens, in their case, yes life happens for them as well, and the roads haven't been easy either, they have families to feed and think about as well, but they found away to support each other and to realize this dream and to ultimately finish their film.<br><br>The docu jumps back and forth from the gradual process of shooting the explosive airplane scenes to the interviews with talking heads or people closest to them, to old archive footage and the outtakes revealing that only by some luck or miracle that the house at which they shot their fan-film did not burn down. This goes to also show that making a fan film, let-alone a full on feature film is never a walk in the park, it's a long and hard collaborative process, you work with people who may have different opinions and approaches, you see how this particular project impacts these kids, their friendships, their relationships, their personal struggles and their reconciliation. This shot per shot remake of \"Raiders Of The Lost Ark\" is nothing short of a labor of love, the result of following through on one's passion no matter what haters may say. Absolutely remarkable, worth a standing ovation.<br><br>-- Rama's Screen --","user":"Ramascreen","rank":[5,7]}]