[{"title":"Great Comedy","rating":1,"date":"25 June 2015","review":"This movie is laughable at best. Everything about it is atrocious. From the \"elite soldiers\" who can't properly aim a gun and shoot, to the awful flashing bullets and the \"blood\" which resembles red powder being thrown at them.<br><br>All the actors in this movie seem to lack any basic human instinct as they do not react when there is someone emptying a magazine in their general vicinity as the bullets rarely hit. It is comedic when in the middle of a gun fight, a person runs up to the soldier, stabs him in the throat and doesn't get shot immediately by the soldier right behind him. <br><br>A group of high school kids could make a better movie than this. <br><br>Now if you want a movie for pure entertainment and comedy because of the train wreck this movie is, I'd rate it a solid 8","user":"tbroz","rank":[22,24]},{"title":"Catastrophically shoddy, it might as well be a parody","rating":3,"date":"26 May 2015","review":"Remember 90s movie or television show where the characters would swing guns while poor flash effect painted over the scene? Rz-9 takes it to another level with characters shooting an entire clip while running like a headless chicken, missing the target then resorting to headbutt. It's a series of choppy production value, so utterly horrible that it gradually becomes more unintentionally funny as it goes. It tries to convince audience with serious theme, but the clunky visual and rigid acting are only good for accidental parody of sci-fi.<br><br>A government agent turns into a whistleblower as he finds the cruel method to be intolerable. The titular Rz-9 is a part of the group that is sent to capture this traitor. To its credit, the movie attempt to use terrorism and religious premise, but those delicate matters deserve much more than its underwhelming acting and illogical plot. Acting is superbly monotonous, characters would come across as one-dimensional or even downright annoying. They utter bland script with the passion of bored customer service.<br><br>The scenes are ridiculous, there's no choreography or any decent logic at all. People would engage in fire fight without cover, flailing their guns erratically and even slapping each other like kindergarten kids. They would get shot in the back, act like their arm is hurt but bleed in the stomach. At one scene their teammate is snatched mere feet away, but these people unrealistically look the other way as though they have the intelligent of stupid video game AI.<br><br>Barely anything makes sense here, the best thing it has on the production is probably the costume alone. Effects like the explosion are nothing but blurry green screen gimmick and when it tries to bring drones or any sci-fi antics they seem like images copied and pasted over. There's just no coherency on the plot, acting and visual.<br><br>The clumsy graphic and acting makes for a brief entertainment as inadvertent parody, but for a sci-fi flick, old Power Rangers show has more appeal that Rz-9.","user":"quincytheodore","rank":[25,30]},{"title":"I have no scrip nor actors yet I film","rating":1,"date":"29 June 2015","review":"May contain spoilers The overall idea had merit the script jumped around abysmally. Continuity or what passed for it was a complete joke.<br><br>You have an squad of elite \"Erasers\" who start off able to shoot a feather off a flying finch at 2km but by the halfway mark none could shoot the broadside of a barn even if they had been shackled to the wall. I was amazed that none of the Erasers managed to shoot themselves in their own face they had become that incompetent.<br><br>If they were the elite then they would have gunned down the resistance/terrorists/bible bashers at range before they would have known that they were under attack.<br><br>Why were the only long range drones used to attack cities but could not be used to hunt down the resistance? The acting was so wooden it was a major fire hazard.<br><br>I want my life back that I spent watching this failure","user":"zombie-32","rank":[9,10]}]