[{"title":"Watchable but lacklustre on the whole...","rating":4,"date":"13 November 2014","review":"For SyFy, Finders Keepers is not so bad and is a long way from their worst. As a movie in general though, it does have some good things and looks like some effort went into it but it doesn't quite come together. Starting with the positives, the movie actually looks good(and for a SyFy movie that is quite a compliment), with some very effective lighting, crisp editing and unobtrusive camera work. The music does create some atmosphere, not an exceptional one by all means but it fits the movie and doesn't try to be too obvious, the doll is very creepy-looking and there are some scary moments. A few performances come over quite well, the best of the lot coming from Kylie Rogers who is both adorable and terrifying, while Jaime Pressley is a sympathetic and somewhat touching mother figure. Most of the acting is not particularly strong, consisting of a lot of under-acting with Patrick Muldoon phoning it in, and Tobin Bell is wasted.<br><br>Finders Keepers as said has some moments that are scary and suspenseful, they only came in spades rather than the movie being continually creepy. Most of the movie was lacking in scares and atmosphere for me, it was more predictable than suspenseful, the gore and scare factor were too toned down a lot of the time and a lot of moments that should have been scary came across as silly instead. The characters are almost impossible to root for and connect with, they are very underdeveloped and you get frustrated with how stupid some of their actions are as a consequence perhaps of focusing too much on the relationship between Rogers and Pressley's characters and side-lining everybody else which was a large part of why most of the acting did not register.<br><br>The direction is technically competent but when it comes to maintaining momentum, atmosphere and making the characters and chemistry interesting it fails, and the dialogue is often horrid, the worst of which enough to make one cringe. The story had bags of potential and effort clearly was made to it with a very original idea, but it was a case of trying to do too much and not explaining enough, making it feel muddled and underwritten. Some of the plot twists border on idiotic, as seen in the senseless ending, and the story feels too padded out in places. And I wish they did more with the doll, it is a very creepily-designed character but there is a real sense that the writers weren't sure what it was, offering at least four different explanations as to what it really was but it was never made clear which one it actually was. Overall, for SyFy Finders Keepers was watchable but was in personal opinion was very lacking. It is not as though there isn't any talent on display here because there is, it is such a shame that that just didn't come across here. 4/10 Bethany Cox","user":"TheLittleSongbird","rank":[13,14]},{"title":"Not terrible, far from great. Excellent for young Horror rookies (no sex/gore/foul language/extreme violence).","rating":5,"date":"20 February 2015","review":"I happened to learn of this film while checking a trailer for another (good ol' YouTube recommendation). Apparently, it's an original TV film made by a channel called Syfy, a fact made obvious by the lighting and cinematography, and perhaps the fact that NONE of the main characters are credited here on IMDb without clicking the \"see full cast\" link!<br><br>Anyways, nothing original about the story... violent murder in a house, reasons unknown, evil haunted doll recovered, rinse and repeat. Deja-vu? Bluntly so... I must say I liked the acting, especially by 10 year old Kylie Rogers as little Claire. Having to play such a role when you're only 10 isn't easy (though not half as challenging or impressive as other young lead roles like in Mama or The Ring), and I think Rogers showed some real talent.<br><br>The story develops nicely, but not more than that. The doll is pretty creepy though! Not easy presenting scary dolls nowadays after the high raft set by Saw and The Conjuring. Certain scenes were really amateur, for instance when one of the characters trips on a wire it is painfully visible that she simply ducked and rolled down the stairs... Why give stuntman Steve Austin the first credit when other stunts were so miserably performed? Beats me.<br><br>All in all, this is the kind of film you can definitely enjoy, but only if you set your Horror meter to mediocre and below. I enjoyed watching it, and I liked the fact that it lacked any sex, gore or extreme violence, making it suitable for younger Horror fans. It isn't terrible, but it's far from great. As always, I recommend you ignore my (or anyone else's) opinion and judge for yourselves!","user":"nitzanhavoc","rank":[12,16]},{"title":"Chucky meets the Exorcist","rating":6,"date":"15 November 2014","review":"This movie had several very scary moments, from beginning. It starts off with a bang. But there were also quite a few parts that had me rolling my eyes and shaking my head starting with the mom allowing her daughter to keep a doll that looked that creepy, especially when she found out about the previous owner. Anyone would have separated the girl from the doll that day.<br><br>Instead the mother goes to visit the boy who owned the doll previously to ask him why he did what he did. Huh? who would do that? Yet even after that she allowed the daughter keep the doll. Further I doubt they would have let the mother waltz in and speak to the boy *alone* considering the crime he had committed.<br><br>Another thing that got me is that even as the bodies were piling up, the police were only called once. I felt so sorry for the mother's friend who told them how to break the curse. Did they even call 911 for her? Also we never got the full story regarding the doll, how it became so evil etc.<br><br>I was going to give this 6 stars for watch-ability because it was very entertaining. Yeah, I'll still give it 6 stars. 5 would mean it was humdrum average, but it certainly was not.","user":"lymullen","rank":[8,11]}]