[{"title":"Tremendous boxing Saga true to life....","rating":8,"date":"12 June 2017","review":"There are only four or five reviews on this film thus far and the overwhelming majority rate it at 8 of 10, or above. There is always the token \"nay-sayer\", but, everyone is entitled to their opinion. Even when ridiculous.<br><br>This stellar film is about a Boxer struggling with alcohol and other demons were not privy to in the story. Nor does it make much difference as the film is more about the human spirit and will then anything else. Boxing is simply the vehicle it rides on that back of to tell its tale.<br><br>Anything with Ray Winstone and Ian McShane, IMO, is worth the price of a theater ticket. But , they have small roles in this film. They are, nonetheless, great in the scenes they are in, as expected. It's not the big Box office names that carry this heartfelt, gritty, anti-hero superb film, it's the awesome acting of Johnny Harris and Michael Smiley that make this bittersweet human interest story so great. <br><br>Of the decades of \"Rockyesque\" type boxing films, which are pure fiction, (although Rocky was a great film, every other, garbage) this was a realistic tale of a fighter down on his heels and suffering from life challenges, yet with a spirit unbroken. The protagonist is not out for fame and fortune, recognition nor revenge. He is an average man with little in his life and a loner. No spoilers here....so I won't get too into the plot. I will say, with absolute certainty......if you are a fan of witnessing the strength of the human spirit and like to avoid the big Hollywood type nonsense usually regurgitated every few years on the silver screen using Boxing as its venue, then you will love this film.<br><br>I highly recommend it. It is 90 minutes that passes like 20!","user":"stephenw-30180","rank":[17,17]},{"title":"The Anti-Rocky, and a Heck of a film","rating":9,"date":"10 June 2017","review":"Take everything you thought you knew about boxing movies ... and forget it.<br><br>Instead of a movie about someone looking to break into the sport, here is a movie about someone looking to break into Life, having wasted most of theirs. And boxing is all he knows.<br><br>It is a testament to the skill of the writer and director that, by the time the big fight arrives, you the audience don't have a clue how it will turn out. That by itself is an accomplishment.<br><br>Speaking of accomplishments, Harris hands us one of the most amazing performances I have ever seen. To re-use a tired cliché, he literally delivers most of his dialog in this film with his eyes.<br><br>And Winstone may possibly have delivered one of the most subtle and nuanced performances of his career, and makes max use of every second of screen time.<br><br>You could possibly say it is a modern update of Requiem for a Heavyweight (1962). Or you could simply call it what it is -- an extraordinary movie.<br><br>Recommended? Hell, yes.","user":"A_Different_Drummer","rank":[37,40]},{"title":"A no nonsense film that hits all the marks!","rating":9,"date":"15 June 2017","review":"The story of a man down on his luck is as familiar as it gets. Boxing as a metaphor for human struggle and inner conflict is also very much tried and tested. So for star and writer of this redemption tale, Johnny Harris, to come up with something so endearingly heartfelt is a testament to the mans talent and ability.<br><br>I never write about a films plot, I only like to convey a sense of what the experience provided etc. This film will make you feel something; empathy, sadness, hope, pity - all the ingredients of a rock bottom and up film. <br><br>Yes, it's a boxing film. But that shouldn't deter viewers who don't enjoy the pugilistic genre or sport itself. This is a brilliantly written, produced and acted film that focuses on one man's incredibly bleak prospects and overcoming the insurmountable he has created for himself. A man who is proud yet lacking dignity and how he turns to the only vestige he knows in order to claw it back.<br><br>This is a no nonsense film that ticks every box you could hope for in an indie flick. Expertly directed by Thomas Napper it manages to avoid all the many tropes and hackneyed marks that most boxing films run into and leaves you feeling privileged to have seen it.","user":"leeroyreddy","rank":[10,10]}]