[{"title":"This is a movie for every generation. It needs to be noticed, it deserves to be talked about, and discussed.","rating":17,"date":"17 August 2016","review":"Aesthetically on high-level, questioning the most important points of human life and importance of verbal, mental, physical, social, emotional development and the inability of developing them all on the same level. There are so many factors that influence one's development. And there is space for many mistakes.<br><br>High quality acting. Viggo Mortensen gives one of his best performances, a devoted father that wants only the best for his kids, an authority, a leader, a teacher, loving, loyal husband, a grieving human with tough, determined, honest attitude he transmits to his children. Kids, from the youngest to the oldest, act with such naturalness that you simply dive in this masterfully-made journey.<br><br>Film doesn't show how one should live and not live because both sides are flawed. Internal and external conflicts make you question the reality of the present, giving you space to find your own balance of how one should live.<br><br>I personally started thinking of how there is a massive space for improvement in every field of our lives. An example is school. And how devastating it is that one could neglect the knowledge at that extant. Kids need to be inspired and motivated to learn. And more important is that they have to build inner-motivation that will make them interested and ambitious as they improve the world around them. And of course kids can't be accused for not wanting to learn if the teachers don't show them how and why to love their subject. And of course parents to support them.<br><br>This (above) is just one point of where this movie has taken my entranced mind.<br><br>This is a movie for every generation. It needs to be noticed, it deserves to be talked about, and discussed. Because that is the point of Captain Fantastic.","user":"ognjen-janic","rank":[439,517]},{"title":"Finally. A movie with creativity, originality, hope and ideals...","rating":27,"date":"27 February 2018","review":"... that also entertains.<br><br>In a sea of sequels, prequels, universes and JJ Abrams remakes Hollywood indeed comes up with something that makes you think, laugh and cry. I enjoyed it and feel that there is some creativity left out there.<br><br>Good directing, good acting and really enjoyed the food for thought.","user":"vgm-92202","rank":[117,140]},{"title":"Nuanced commentary on modern society","rating":10,"date":"15 June 2016","review":"Set against the beautiful Pacific Northwest backdrop, Captain Fantastic is easily one of the most nuanced films to come to mainstream cinema in the last few years. It's main plot addresses the struggle when everyone has the best intentions but not the same values. Additionally, the film makes honest and straightforward comments on controversial issues in today's society that are often taboo in the media such as mental illness, the hypocrisy of children's exposure to violence and sex, religion, and the flaws in the American education system. This sounds heavy and uncomfortable but these issues are paralleled in such a way that parts of the film had us in tears; from laughing so hard. Director Matt Ross says the project started as an exaggerated exploration of the difficult choices that must be made in regards to raising children in today's society. I think the film goes a step further and awakens an internal dialogue in each of it's viewers about the way that we live our own lives based on societal influences. Furthermore, the performances given by the perfectly arranged cast enhance your investment in the story in a way that will cause you to question what right and wrong really are when you're only trying to do your best and do what you think is best for those that you love.","user":"veloskiw","rank":[357,446]}]