[{"title":"Simple and straightforward but has moments that are captivating","rating":7,"date":"21 August 2016","review":"Courtroom dramas are interesting and this one is a fine addition. Nothing that fancy or over- stylish, it's basically very straightforward and has a simple style. But, that's OK because it works for this film. It doesn't try to be anything it isn't. The scenarios and the dialogue is all very well handled and thought out. It makes you think twice a few times as well.<br><br>Some scenes really work and have great tension and intrigue. Especially whenever there is a court scene. Some aspects would have been nice to have seen explored more like when they explain how to tell if someone is lying when testifying.<br><br>Keanu Reeves does a good job here and isn't so stale like some people like to say he usually is. There might be some truth in that for some films, but here you can see that he stepped up his effort. The role was originally set to be played by Daniel Craig, and I can definitely see how his acting style would have worked well for the character. It's a shame he dropped out last minute, but Reeves makes the character his own and you can understand his motivations.<br><br>The ending was unexpected and included a strange little twist which the movie could have done without and still worked well and perhaps in some ways been more effective.<br><br>The film is interesting if you want a mystery with some turns and it has some captivating courthouse scenes which are in some moments disturbing.","user":"paulijcalderon","rank":[58,72]},{"title":"A great ending tops off a solid film","rating":8,"date":"1 January 2017","review":"There's nothing like a good courtroom thriller. The thing I love about them is that everything can't possible be as it seems, because otherwise there would be no point in making the movie. There's nothing at all interesting about a straightforward court case, however one with a twist is a thing to behold. The only problem with this is that a lot of them end up getting rated purely on the strength of their twist. Everything that has happened up until that point can tend to be forgotten. That's sort of the case again here. A solid, but not stunning movie comes alive with a very strong ending, and it certainly adds some plus points to the final opinion of the film.<br><br>I tend to really like Keanu Reeves thrillers. A lot of his dramas and sci-fi films are completely forgettable, but when he signs on to a thriller it often seems to turn out very good. Renee Zellweger on the other hand is far from a personal favourite of mine. She has a serious lack of charisma and her appearance change is very distracting in this film. I feel like there are a lot of actresses who could have done a better job in this role.<br><br>'The Whole Truth' is a film that is entertaining throughout, partly because you are almost certain there is a twist coming, and partly because the story is well written and movies at a good pace. Then at the end it goes Bang! I really enjoyed this film and I think any thriller lovers out there will have a good time with it too.","user":"jtindahouse","rank":[36,46]},{"title":"Great Ending Makes It Better","rating":8,"date":"18 August 2016","review":"Did you like those old Perry Mason shows? Are you an attorney? If you answered yes to either of those questions it's likely you'll enjoy \"The Whole Truth\". What this movie does well is slowly reveal the truth, very slowly. In the mean time it shows a kind of love of the law itself. How it can be worked to an unlikely outcome, yet one that has some legs as in \"well, I didn't see that coming\". To a viewer that is not particularly connected to TV law or isn't even that interested in it, let alone being an attorney, there is still quite a compelling story here. Granted it takes the strangeness of an accused killer attempting to protect someone besides himself. But, who?<br><br>As I write this the rating for \"The Whole Truth\" is hovering around 6.5 and I've got to think it's just a bit low. This film is better and the reason is that it shows a lot about people and the law. Sure, an attorney could love this, but it's more than that. It's about how a pat situation isn't always pat, at least when it comes to a critical mass in court. It's about different party's agendas colliding with something huge at stake. It's about what you think you know, but in reality you don't because it comes down to just a compacted courtroom re-casting of even less. It's a chess game, but one in which there's more than two players. There's at least three and within the three there is some tremendous manipulation. So, whose the master manipulator whose agenda prevailed? And who are the parties that got played? It can't be denied these are fantastic questions. They're woven well too. I was never bored watching this movie even if it moved quite slowly and revealed little to nothing until the final third. This kind of enigmatic progression worked expertly building up to a real \"home run\" ending where there was a huge turn of events.<br><br>Keanu Reeves isn't right for every role. His detached acting skills seemed spot-on here. He played poker with the big boys even though, as actually happens, he lucked into his final courtroom victory. But, as the movie closes the question looms if he was ultimately the played one has to be addressed in ways you wouldn't have seen coming. That's what I call a great ending to an otherwise good courtroom drama. It raised the bar, and the rating.","user":"AudioFileZ","rank":[35,48]}]