[{"title":"Sobering, powerful, and kinda funny","rating":10,"date":"9 October 2019","review":"This is a phenomenal piece of work. It definitely covers a lot of ground. And I can see why some people want it to focus. But if you have no clue about any of this, the film does a pretty heroic job of giving you a crash course on our crazy history of home ownership.The crony capitalist parts. It's really good.<br><br>The single bad review here seems to be coming from a sadly predictable group of people in America who see the re-telling of actual history as some kind of personal threat.<br><br>This is a great issues-based doc. I wish more others took the kind of artistic chances Owned took. Super cool","user":"Carl_Weathers_Storms","rank":[8,8]},{"title":"Wow punch to the gut","rating":10,"date":"10 October 2019","review":"Saw it at WYO Fest. Audience was typical for Sheridan. ie white and doing pretty ok. I have to say, the experience was pretty moving. I thought it was going to be about the housing crash. And it was sort of but it went deeper. I got a little nervous. but after the screening most everyone there seemed to be as moved as me. This is an important story. We're all in this together. That's the spirit of the film. Really recommend a viewing,","user":"DaleGantLovesFilm","rank":[7,7]},{"title":"You have to be a maniac to give this one star","rating":10,"date":"15 June 2019","review":"Don't let the pigs set the score! OWNED is a wonderfully told story that needs to be seen. But the troll farm downvoting this flick clearly doesn't want you to know about the injustices that continue to plague our communities and shape the unjust world that so many in the US are still victims of. It seems they would rather bury a fantastic film that sheds light on a problem than dealing with their prejudices and admitting that they benefit from a system that has made a permanent underclass of the most vulnerable in America. God bless the filmmakers and this film for speaking to power at this very tumultuous time.","user":"m-hulot","rank":[30,41]}]