[{"title":"Gritty but authentic examination of aid work in a war zone","rating":9,"date":"18 October 2015","review":"I just saw a Spanish film that probably enjoyed a limited release in the U.S., although the dialogue is mostly in English – A Perfect Day. In the film, a team of aid workers faces a problem, a corpse is contaminating a well that provides the only potable water in the region, since two other wells are surrounded by mines and cannot be used. The film follows the group as they try to obtain a rope to lift the body out of the well, and examines the difficulties of executing such a small task in a war zone, in this case, the waning days of the Bosnian conflict.<br><br>The film resonated with me on several levels. First, of course, I live in the Balkans now, so the language and setting was familiar. (Now I know \"konopac\" means rope and \"bunar\" means well!) The landscape in some of the scenes was amazing, and makes me curious to see more of Bosnia now. Second, the cast itself is multinational, reflecting the multinational character of international assistance efforts. This is familiar to me too, since I work in a multinational OSCE Mission. The civilian-military interaction was all too familiar, as were the many scenes with Stryker armored personnel carriers, a common sight during my time in Iraq.<br><br>I thought the film provided a very good feel for the frustrations of development work in a war setting. In addition, the dialogue and acting were great. The impressive cast features American Tim Robbins, Spaniard Benicio del Toro, Ukrainian Olga Kurylenko (who was a Bond girl in A Quantum of Solace), Frenchwoman Melanie Thierry, and Bosnian Fedja Stukan. At one point, one of the characters, seeing Olga Kurylenko for the first time, mutters under his breath, \"And so where is she from – Models without Borders?\" The sub-plot involving the young Bosnian boy, Nikola, who attaches himself to the team, is also great.<br><br>This is a powerful film that is authentic in its treatment. I recommend it.","user":"mike_uyehara","rank":[105,128]},{"title":"A land of infuriating bureaucracy","rating":12,"date":"12 June 2016","review":"This film tells the daily lives of several aid workers in an armed conflict zone in the Balkans. They have to extract a corpse from a well, but are faced with multiple logistical and bureaucratic challenges.<br><br>\"A Perfect Day\" may look ridiculous and infuriating from the outside, as it tells a story of ridiculous bureaucracy. So if the common goal is to help the people in a war zone, why are there so many restrictions and hurdles to helping others? Well, my workplace is exactly like that, do I can relate to every single minute of it. <br><br>The subplot about the local boy Nikola is touching, as it provides a glimpse of hope for humanity - sometimes real help is from unofficial sources!","user":"Gordon-11","rank":[25,28]},{"title":"Beautiful film","rating":8,"date":"27 January 2016","review":"Beautiful film. I would say even a masterpiece! An excellent acting game,good scenario and cinematography.<br><br>Somewhere in the 90s. At the Balkans. The war in Bosnia. A group of aid workers from different countries are trying to help in the middle of a huge after war mess. Trying to do what could be done - in the present case to find a rope, which they could use for taking out corpse from the а well - the only source of fresh water for the local people. During the rope seeking they ran into a bunch of funny or dramatic (mostly both in the same time) situations, but it couldn't be otherwise at the Balkans. ;)<br><br>To me \"A Perfect Day\" is a movie for little things and little actions, which lead to a big change for people.<br><br>I highly recommend this movie to all fans to European cinema and to everyone who wants to see something different from all meaningless crap, which flooded us from Hollywood lately.","user":"DesiAnge","rank":[50,60]}]