[{"title":"Hyper-Action made tolerable by presence of Antonio Banderas and Ben Kingsley","rating":5,"date":"14 August 2017","review":"SECURITY is low on originality, medium on clashing fight scenes with guns and bombs and fire and a bit maudlin in the end when the father/daughter concept finally adds some human interest. Otherwise this 'made for action lovers' film, written by Tony Mosher and John Sullivan and directed by Alain Desrochers is a sidebar t the careers of tow fine actors – Antonio Banderas (in fine shape physically) and Ben Kingsley.<br><br>An ex-special services veteran (Antonio Banderas), down on his luck and desperate for work, takes a job as a security guard at a run-down mall in a rough area of town. He is introduced to the motley crew of security guards (Liam McIntyre, Gabriella Wright, Chad Lindberg, Jiro Wang). On his first night on the job, he opens the doors up to a distraught and desperate young girl Jamie (Katherine de la Rocha) who has escaped and fled from a hijacking of the Police motorcade that was transporting her to testify as a trial witness in a briefcase. Hot on her heels is psychopathic hijacker (Ben Kingsley), alongside his resourceful henchmen, who will stop at nothing to extract and eliminate their witness.<br><br>That is the bare bones of a story that is basically one of shooting, fire, explosions, murder, and all the other derring-do that builds a story based on the chased and the chaser. It gets repetitive but Banderas and Kingsley (and Liam McIntyre) are strong enough to hold or interest.","user":"gradyharp","rank":[29,34]},{"title":"Enjoyable!","rating":8,"date":"10 July 2017","review":"This movie might be considered a B-movie because of the budget and released straight to DVD, but honestly, it's a really good movie. Antonio Banderas is underrated, and should really be given the chance to go back to mainstream, especially action films.<br><br>The movie isn't perfect, and characters could've been fleshed out more but other than that, this is a nice movie to watch on a lazy afternoon on your day off.<br><br>The action sequences are great. Ben Kingsley, another underrated actor, was also great.<br><br>It's a well-done action movie with a simple story. If you want to be entertained for an hour and 45mins, this is not a bad choice.","user":"kgrv2000","rank":[94,127]},{"title":"Family friendly violence in the die hard tradition","rating":6,"date":"2 September 2018","review":"No F bombs, drug scenes, or blaring rap music and a pretty good story. There are more casualties on both sides which probably killed the potential BO. But besides very little plausibility, it was exciting throughout, Antonio Banderas has too much of an accent and was a bit hard to understand, so this killed his action hero future. The acting was good and Ben Kingsley did his usual bad guy role with aplomb. My major problem was the entire movie is filmed fairly dark. It is all at night and the mall scenes are mostly without full lighting. Kind of gets claustrophobic after awhile.","user":"jasontheterrible","rank":[9,10]}]