[{"title":"Furthest Witness, Witless","rating":2,"date":"22 September 2018","review":"If there's one thing you can count on from a movie maker who doesn't attend to details, it's unbelievability. In one or two cases, these things could be overlooked - after all, it is a movie - but Furthest Witness gives us a full preposterous parade.<br><br>This is the tale of Kyle Braddock who hauls people who have seen something they shouldn't have down to the border of Mexico, gives them a new passport, new identify, new money, and bids them farewell to enjoy their new life. He's a contractor of sorts, hired by ruthless gang lords who would rather pay tens of thousands of dollars and let an inconvenient witness live a comfortable life south of the border than take them out into the deserts of New Mexico and give them a 10 cent dose of lead.<br><br>Enter the girl, played by Teri Reeves. Kyle gets hired to do his thing, but it turns out she's a bit twisty and off goes the plot to the races. Naturally they fall in love along the way even though there's no chemistry. She even renounces her wicked ways to be with him.<br><br>There's plenty of bad guys, but the baddest of the bads is The Florist, played by Sean Patrick Flanery. The problem with his character is that he's stupid. He kills people for no good reason. A kid in a convenience store; a guy who runs a motel. Plus, he leaves them sitting around where they can be found immediately. He even goes into a restaurant to have a chat and a cup of coffee with a slit throat victim outside in his car sitting up in the front seat in broad daylight. He kills a guy in a motel room and then walks out leaving the door wide open.<br><br>By the way, if you like motels, this is the flick for you. Lots of motels. Problem is I've been in hundreds of them in my travels and not once did the motel guy tell me \"you can pay when you leave\". No ID, no car plates, no nothing. Just walk up, say \"I want a room\" and he hands you the key. That's not the way it works. Ask anybody who has ever taken a road trip.<br><br>Speaking of motels and not the way it works, it's also unbelievable that The Florist beats two words out a guy - \"Albuquerque... Motel\" - and manages to find Kyle and the girl in just a couple moves. Must be at least 97 motels in a town that size.<br><br>Verisimilitude. This movie has none. Besides what I've already mentioned, there's cell phones that boot up, dial, and connect in less than a second - and time after time that someone shows up somewhere in pursuit of someone else when the pursuer could not have possibly known where the pursued went. You could say magic GPS I suppose, but it's really just lazy writing and lazy thinking.","user":"LimbleKite","rank":[22,24]},{"title":"2 stars only because I didn't change the channel on this stinker!","rating":2,"date":"25 April 2019","review":"But loses 8 stars due to poor acting, poor plot (still not sure of what it was about) and poor fight choreography. Non believable characters. Unconvincing relationships. ...Smdh... I really wanted to like it, but it just had nothing to offer. Main bad guy (cant even remember his name, and dont even want to look it up) was trying too hard to portray Mickey Rourke's character from \"Sin City\". But I'd bet even Rourke would have had a hard time with this script!<br><br>FX were awful. Bullet sounds did not correspond to the caliber weapon being fired at the time. Bad timing and execution of blood squibs in body shots. Just made this very hard to watch.<br><br>But watch I did. The most painful final 12 minutes of a movie I ever had to bare. I wanted this to end so much so that just kept a literally countdown of minutes left. And this is an hour and 26 minutes of my life I'll never get back.","user":"just-woot","rank":[4,4]},{"title":"doesn't hold my attention","rating":4,"date":"18 September 2018","review":"Rainy day movie.\nhad possibilities.\nso so script.\nI don't recommend it.\ncheers.","user":"surfisfun","rank":[11,16]}]