[{"title":"A real gem!","rating":10,"date":"20 October 2016","review":"This movie is a treat not just for all Stanley Kubrick's fans, who will be granted an insight into the personality and everyday life of one of the greatest movie directors of all times, but also a fantastic and moving tale of commitment and friendship that lasted thirty years, between Kubrick and his personal assistant, Emilio D'Alessandro. The documentary is following the success of a book made by Filippo Olivieri, who managed to convince the shy and private Emilio to tell him his extraordinary story. The documentary is very well made, without distracting excerpt from Kubrick's movies, focussing instead on the human relationship between the two characters, following Emilio story and his gradual involvement in taking care of Kubrick's everyday more demanding needs. I would strongly recommend this film to everyone: it is an interesting, sincere, touching and moving story of friendship that will leave its mark. A real gem!","user":"tuco73","rank":[12,13]},{"title":"intimate perspective of the lives of 2 men","rating":8,"date":"12 July 2017","review":"Some things we don't give a lot of thought to. The one's behind the scenes that are assisting successful peoplewell this film does just that. An endearing story of the relationship between two gifted people in their own rights. As time passes in each of their lives, this film gives us an intimate perspective of the lives of 2 men and how they worked together. You'll enjoy the commentary, the famous films unfolding behind the scenes, and the quirkiness of the personal letters and habits of Stanley K.","user":"brummelfaoro","rank":[5,5]},{"title":"I'D DO ANYTHING FOR THIS MAN, OKAY ALMOST ANYTHING...!","rating":7,"date":"5 July 2018","review":"S is for Stanley is another entry point to the enigma that was Kubrick. Included w/other docs as Boxes &amp; even Room 237, we get another sideways glimpse into the uncontrollable mind of probably the best filmmaker ever. That he comes off as a mere human is a testament to the efforts of his driver &amp; loyal aide Emilio who put up w/what probably any other person would deem unacceptable in this day &amp; age.","user":"masonfisk","rank":[3,3]}]