[{"title":"More than one hour of constant bickering.","rating":3,"date":"30 August 2015","review":"Family reunion can be awkward, but these siblings take it to the next level. Nearly the entire script consists of bantering and screaming. It's quite the shame since the premise shows a glimpse of isolation that could've been better utilized for sci-fi or horror, instead we are presented an exhausting spectacle of dysfunctional family more than the actual mystery.<br><br>This is a small cast, with only three leads. Marty is the secluded brother and his siblings are worried about him. This leads to a long verbal standoff, arguing whether Marty is delusional or not. There's a lot of yelling and cursing involved, and one can't help but wonder if they could resolve the issue with better communication skill and whether the excessive shouting is merely padding to prolong the already short runtime.<br><br>After a while the loud screaming becomes numbing, and the thriller aspect doesn't get going until much later. It displays the hint of eerie atmosphere, although it doesn't manifest seamlessly and as usual shaky cam is expected. If it had more refined screenplay that focused on the mystery rather than family squabble as though they were in a cheap reality show, it could've been decent.<br><br>Scarce on the thrill and heavy on the cursing, Pod is a much tiresome and less horrifying affair than it could've been.","user":"quincytheodore","rank":[43,55]},{"title":"stereotypical silliness","rating":1,"date":"3 September 2015","review":"Like every other typical creature film the Pod fails in the first 20 minutes itself. Nothing about this movie is a plus. The character of the sister was highly irritating. She kept screaming needlessly. All the film does it move towards a failed suspense towards a creature. preferably an alien who is locked up in the basement. Warned by the lunatic brother talking gibberish all the time. The alien whose presence we witness for about 2 minutes is basically a deforming skeletal body.....so its not really an alien?. AND WE DO NOT SEE ANY SORT OF POD in the movie only a bunch of people screaming their lungs out. I truly wish I had avoided this.","user":"redcodex453","rank":[33,54]},{"title":"A great idea that missed the mark.","rating":6,"date":"11 October 2015","review":"Although the acting and character development in this film are very good, I was left at the end with too many unanswered questions and unexplained plot holes. It's always difficult to realistically display mental health disorders in a sympathetic and factual way and this title managed to cover such an emotive subject in a sensitive way, which was quite impressive. However, the storyline isn't a strong one and does little to explain who the characters really are, let alone how or why they make the choices they do. People are introduced and never explained, leaving you feeling that you have no idea where people have appeared from or what their motives are. I understand that sometimes as a viewer you have to 'Put the pieces of the puzzle together yourself' but it constantly seemed as if a lot of the pieces were missing and there was no way to see the whole picture. Overall, this movie was rather disappointing and missed the opportunity to create a great atmosphere as well as subjecting us to a rather strange and badly thought out narrative.","user":"emberstonepierce","rank":[12,17]}]