[{"title":"Great horror film, made with a passion and respect for the genre","rating":9,"date":"17 June 2015","review":"I was lucky enough to see this at a friends house last night, went into it blind, and oh boy what a nice surprise.Whilst yes, it's another haunted house movie, this brings something new to the table with a great climax to the film that really ramps it up.The performances from the whole cast are excellent,and the main four characters are likable and believable.The cinematography is excellent, and the whole film just has this authentic feel to it.I won't reveal anything of the storyline,as I think it's one of those films that's best enjoyed if you don't know too much about it,but as a seasoned horror fan,I found this one of the most refreshing films I've seen in years with some good tension and scares.I've seen some comments about 'B movie this, B movie that', but I didn't get that feeling at all, this had the feel of a 70's-80's classic horror.A little more character development of the villains would have made this even better, it could have stood another 10 minutes or more being added to the running time which would have allowed this.I'll be pre-ordering the Blu Ray as soon as possible,when there are so many horror films out there that shouldn't have even been released, this deserves my money and to be in my collection.","user":"rocknrelics","rank":[52,88]},{"title":"Nicely done ghost mystery with a Lovecraftian undertone.","rating":7,"date":"8 July 2015","review":"I freely admit to being a sucker for a good ghost story but feel no issue with prejudices when I say the movie delivers.<br><br>While there were a few problematic aspects, such as the night when the proclamation was made that there was a darkness all around inside the house which cut to a scene of everyone being sound asleep. I suppose it was the consistent use of scotch that helped with this! <br><br>That aside there is plenty of atmospheric creepiness with an easy mystery of ghosts that overlie some sort of ill defined ancient evil that had been uncovered. Nice layered evil that had no problem showing us the first layer of quite well done (yes there is a pun there) ghosts. It was, however, the deeper layer of undefined evil that I found, in the end, to be the most fun.<br><br>It was this later part that I view as quite Lovecraftian. The unseen unnamed \"darkness\" that is the real driving force of a quite haunted house. It is hinted at but never shown and in the end remains apart from the rest of the story that is told. Hats off for this added layer. The easily solved mystery with the impossible mystery added in was delightfully refreshing.<br><br>I would also add that a careful eye will catch a reference to the \"Miskatonic River\" in one of the newspapers shown during the initial end credits.<br><br>Sweet!","user":"sam21462","rank":[21,34]},{"title":"Good movie, entertaining enough, but could have built the lore up.","rating":6,"date":"15 June 2015","review":"The plot is solid enough. The movie is entertaining enough also meaning that if you want something new to watch in the horror genre- this movie is just entertaining enough, The lore could have been improved upon, and with some more back story, perhaps even some flashbacks with some creative storytelling and this film could have been a gem.<br><br>The movie at just 84 minutes doesn't provide enough time to the viewer to understand what this evil is that has descended on this family. We are told a few bits a pieces about he first owner who ran a funeral parlour out of this home. Something about the owner Dagmar hiding or selling the bodies and that the house was built on some ancient evil. Other than all that we are left to guess at what the heck the rest of the back story is and what it has to do with the old boiler downstairs.<br><br>If only they took another 15 minutes of screen time to flesh out the sordid past and we could have left this movie more satisfied with a true understanding of the houses evil past, where and why and how.<br><br>What we are left with is a gore fest with jump scares that are really nothing new. It's just a good old fashioned horror with a 2 star rating.","user":"scottmannen1","rank":[20,33]}]