[{"title":"Being Invisible Is..TIME OUT OF MIND!","rating":8,"date":"21 October 2015","review":"............................................................from Pasto,Colombia...Via: L.A. CA., CALI, COLOMBIA and ORLANDO, FL <br><br>What motivated me to see \"TIME OUT\"? Richard Gere appeared on \"ELLEN\" to promote the film a bit. Something he said kept ricocheting around in my brain. While walking the mean streets of New York, in character as George, a longtime homeless New Yorker, Gere said that of the many thousands of pedestrians who passed him by, only two actually stopped, approached him and asked\"Aren't you Richard Gere?\" This highlights a very depressing truth about the plight of the homeless in the Number One economy on earth.They are totally invisible to all but a handful of us!<br><br>No \"Rags to Riches\" story hereNo inspirational, \"Getting My Life Back on Track\" true story. As is the case with 99.9% of the homeless, whatever the life trajectory and the personal misfortune and/or issues that has led them into homelessness, as time passes, they find themselves ever more deeply entrenched in a grizzly abyss, from which the chance of escape seems constantly more remote.But, who cares, right? Judging from the paltry 11 IMDb user reviews, I'm tempted to answer.\"Almost no one!\". Of course, I have not verified this, but I would practically bet my life on the following: No other film starring Richard Gere listed on IMDb has fewer user reviews!!!<br><br>TIME OUT generally tends to be an extremely frustrating film to watch. Perhaps Director Oren Moverman (The Messenger-2009) wanted viewers to feel some of the frustration the homeless certainly must experience almost 24/7. Richard Gere's performance is the example of, \"Less is More\" par excellence! WOW! What a stunning low-key and understated performance! There are also some impressive cameos. Steve Buscemi, who, for most of his brief stint as a persistent building manager, is off-camera, made me acutely aware of just how distinctive Mr. Buscemi's voice is! Kyra Sedgwick is utterly unrecognizable (literally, since I became aware of her participation when reading the end credits!) as an ex-streetwalker turned bag lady. If her name did not appear on the cast list, I would not have shared this, considering it to be a minor spoiler!<br><br>Ben Vereen is commendable as Dixon, a troubled and lonely motor mouth. Director Moverman seems to have encouraged his actors to deliver straight up, as natural and true to life as possible performances, because that is pretty much what TIME OUT offers. Of course, with its 5.7 rating, I feel this movie is HIGHLY underrated! If you are looking for slice of life dramas that are definitely NOT over the top, give TIME OUT a little time!<br><br>Any comments, questions or observations, in English o en Espanol, are most welcome!.....KissEnglishPasto@Yahoo.com","user":"KissEnglishPasto","rank":[33,35]},{"title":"Realistically grim, with no gratuitous action scenes","rating":8,"date":"14 October 2015","review":"This is exactly what I might feel like if I were homeless or just aimless, which I've been at times. The boredom and daily routines stripped down to basic necessities seemed very realistic. It stood out as the only \"bum film\" I've seen that didn't seem cliché-ridden.<br><br>Those who need constant hooks to stay entertained probably won't get it, but it does have its share of tense moments. There's also the mystery of how he reached that state, including an apparent scar that I originally thought belonged to Gere but may have been created for the film. Those who stick with it for awhile may get mesmerized by the slow, detailed story.<br><br>The film was apparently not widely publicized, hence the small number of reviews at the moment. A reviewer who glibly gave it one star skewed the overall rating here (come on, people). I highly recommend it for viewers with intellect, though it's about a guy who's lost some of his.","user":"A.N.","rank":[28,32]},{"title":"Man of the streets","rating":6,"date":"8 September 2015","review":"Greetings again from the darkness. Poverty, mental illness and homelessness collide in this film from writer/director Oren Moverman (Oscar nominated for The Messenger). About the third time I asked myself if something was ever going to \"happen\", it dawned on me that it was already happening. This is Moverman's illumination of how society treats the homeless, and his vehicle comes in the surprising form of Richard Gere.<br><br>We follow George (Gere, making good use of his familiar facial tics and mannerisms) around the city as he bounces from vacant apartment to hospital to churches to second hand clothing stores  and finally to one of the city's homeless shelters. It's at this point where George befriends the talkative and seemingly helpful Dixon, played by the great Ben Vereen.<br><br>One of the key points the film makes is how the homeless are basically invisible to the rest of society. The characters describe this as being a cartoon – meaning, they aren't even \"real\" people to the masses of NYC. Supposedly, Gere was in character on the streets and was passed by without anyone noticing. Vereen's character helps George get on track for re-establishing his identity. See, without any form of ID, there is no welfare, food stamps, etc (except, of course, voting – a topic for another time). The only real sub-plot involves George and his estranged daughter played by the always excellent Jena Malone. She excels in her scenes with Gere, and provides the most sincere and affecting emotion in the film.<br><br>It's a very odd movie, as there are numerous \"quick hit\" scenes that feature such fine actors as Steve Buscemi, Michael Kenneth Williams, Kyra Sedgwick, Geraldine Hughes, and Jeremy Strong. None are on screen for much time, but each help demonstrate the daily challenges faced by the homeless who are so dependent on the charity of others.<br><br>It takes a patient viewer to stick with Gere's character as he comes to grips with his situation, but the camera work shooting inside/out and outside/in (through windows, doors, etc) provides visual interest, as do the lively and real sounds and movements of the streets of NYC. It may not pack the punch of The Messenger, but it's further proof that Oren Moverman's insightful projects deserve attention.","user":"ferguson-6","rank":[23,27]}]