[{"title":"Too Many Plot Twists. Flat Characters.","rating":4,"date":"17 December 2018","review":"There are too many plot twists to be believable, and the characters are bit flat. There are moments when I just rolled my eyes in disbelief at how unimaginative the writing. I felt nothing for the characters, and the story isn't anchored with any practical ideas.","user":"percevial","rank":[15,16]},{"title":"A jumbled mess that reminded me of Aloha. There were just too many story lines that didn't seem to fit with each other.","rating":6,"date":"22 January 2017","review":"\"He knows the mountains too well no one would believe he got lost. You'd have to do it.\" Miles (Roy) and Liam (Coffey) are brothers who have been struggling. Looking for ways to make money they decide to fake a disappearance and sell their story. Miles, heads up a mountain while Liam reports him missing. What seems like a quick and easy way to make money soon changes the lives of everyone involved. This is a movie that had such promise. The idea was interesting and had me looking forward to seeing it. What the movie became though was a jumbled mess of plot lines that came from everywhere and made it hard to not only get into but keep from laughing at. This fake disappearance movie contained a hardened un-trusting cop, blackmail, an angry collection thug, false accusations, constantly changing sides and stories, hidden secrets and more family drama than a soap opera. The movie was just too over the place and distracted from the main focus of the movie, but then again it was hard to tell what the main focus was. Overall, a jumbled mess that reminded me of Aloha in the way that there were just too many story lines that didn't seem to fit with each other. That aspect really really hurt what could have been an interesting and tense movie. I give this a C+.","user":"cosmo_tiger","rank":[19,22]},{"title":"Not Bad","rating":5,"date":"12 June 2017","review":"We have all heard about true survivor stories and the big bucks, and sometimes a movie made for the story.<br><br>Well, we have almost the same thing here in this fictional story. Brothers Liam (Shane Coffey) and Miles (Drew Roy) hatch a plan whereby Miles will go into Sugar Mountain after a \"fight\" with Liam and get lost and be \"found\" later on and the story will bring in big bucks to take care of their debts. The plan is hatched, but things go south big time.<br><br>Enter Joe Bright (Jason Momoa) who learns of the hoax and wants money to keep quiet. Oh, oh, this can't be good. <br><br>Acting all around is very good and the cinematography is outstanding, at times. There are plot holes and twists, but to tell of them would give too much away. And, there is one very big twist later on. Let me repeat: A VERY BIG TWIST. <br><br>Okay, one lesser twist - that is obvious - is that Liam has a thing for his brother's girlfriend, Lauren Huxkey (Haley Webb). (Yes. Very obvious)<br><br>I was surprised at how many \"producers\" are listed in this movie. Hey, guys it wasn't that good. Not bad, but why all these producers? <br><br>Notable: Cary Elwes as Sheriff Huxley, and yes, Lauren's father.<br><br>The ending is somewhat of a reach, but plausible I suppose. (5/10)<br><br>Violence Yes. Sex: Yes. Nudity: Yes. Language: Yes.","user":"rutzelb","rank":[8,9]}]