[{"title":"giving all","rating":28,"date":"28 April 2019","review":"A charming friendship story, a love story, good acting, supernatural events, humor and magic and few sadness and the perfect end. A film for entire family, inspired by an Australian legend. It is difficult to say more because it is one of films with precise purpose , precise target and precise...dog. So, a charming film. And the best part , for me, remains the great Australian landscapes.","user":"Kirpianuscus","rank":[4,4]},{"title":"Good","rating":8,"date":"13 December 2018","review":"Good family movie and sad at the end....................","user":"auliarachman-06644","rank":[3,3]},{"title":"A True Blue Aussie Legend Makes for Solid Family Entertainment","rating":7,"date":"4 January 2017","review":"Five years after Red Dog proved to be a smash hit at the Australian box office, the eponymous red kelpie is leaping back onto the silver screen, ready to win over holiday audiences once again in the sequel Red Dog: True Blue. Set immediately before the events of the first film, the story this time around is a coming of age story about a young boy who, after being sent to live with his grandfather in the West Australian outback, has a chance encounter with Red Dog that blossoms into a one of a kind friendship.<br><br>Much like the first one, the film is a throwback to an old-fashioned type of family entertainment, before animal features involved CGI talking heads and loud and noisy special effects took front stage in lieu of genuine heart. It's only let down by its over eagerness to replicate what made the first film a big hit, that it often feels like it's lagging behind. It devotes a fair bit of the opening to replaying scenes from the first film, this time through the perspective of a middle-aged man sitting in a theatre watching the film with his children. We see his red, teary eyes glued to the screen, clearly touched by the story that has unfolded, which afterwards inspires him to recount his own childhood encounter with the dog. This meta moment feels a little bit like the sequel kissing its own butt for lack of a better expression. As a framing device, it's effective, but it can't shake off the shameless feeling that it's trying to coax audiences into remembering how teary they may have felt themselves after the first film, in case they forgot in the intervening years. It only sets up the sequel for failure as True Blue never manages to recreate this emotional punch, even when it desperately tries to turn on the waterworks once again towards the end. <br><br>While this brings the film down a notch, wedged between these scenes is a film of comparable quality. It's light, breezy and frequently funny, with some mild third act drama, when a bush fire encroaches on the grandfather's cattle farm, adding some excitement to the affable proceedings. When a detour into Aboriginal mysticism threatens to veer into hokey territory, the film wisely strays away from any heavy-handed depictions, maintaining a light touch throughout.<br><br>Verdict: Even though lightning doesn't exactly strike twice with True Blue, it still offers a solid piece of family entertainment that's replete with heart and a good-natured sense of humour, even if it won't win you over quite the same. <br><br>6.5/10","user":"DJKwa","rank":[8,11]}]