[{"title":"An Entertaining & Exciting Stuff! - Here is an actor who always (with some exceptions) delivers.","rating":7,"date":"23 June 2018","review":"Ever wondered what it would be like to see Tom Cruise taking a break from his usual Sci-Fi &amp; Impossible series \"avatar\". Well, here is your answer - It gets even more exciting and entertaining. This is Tom Cruise's real life take on the impossible series where Barry Seal replaces Ethan Hunt and CIA as the agency, which dictates the terms. It's just that Barry loves to go with the flow and without any intention of getting involved with anything that seems out of his league and this is something each one of us can relate to. He is your usual guy who happens to be a pilot and wants to make some extra cash with every extra mile. So what's wrong with it? Well nothing is wrong when you do it for the right guys, and nothing gets more exciting and dangerous when those right guys turn out to be CIA.<br><br>What is even more amusing and entertaining to watch is the fact that despite having no choice left but to cooperate with CIA, \"Barry Seal never says no\" to any offer (even if it comes from any drug lord) that helps him maintain his cash flow that obviously was becoming unmanageable for him by every passing day. Although, I must admit that it was quite a fun to watch him trying to manage millions of cash that he had no idea how to spend. <br><br>You will definitely enjoy watching Tom cruise as Barry Seal who uses CIA to get his end of the bargain (and they thought that they were the only smart guys who live in one of the greatest countries of the world).<br><br>If you want to go on an adventure trip, go watch this movie and you will understand what Tom Cruise really means when he says, \"I am just a gringo who always delivers\".","user":"EngineerSahab","rank":[49,54]},{"title":"Doug Liam and Tom Cruise make such a great pair","rating":9,"date":"24 August 2017","review":"Very few directors have tapped the clown in Tom Cruise the way Doug Liman has. He had directed Tom in Edge of Tomorrow which was humorous and was set amidst a post-apocalyptic alien invasion. American Made is just as humorous and is also set amidst an invasion of sorts except this movie is a true story. Captain Barry Seal had the adventure of a lifetime before falling prey to a monster of his own doing. But what an adventure it might have been for this man to smuggle contraband into and out of the States.<br><br>I felt Tom Cruise did a great job portraying the pilot in an extremely light-hearted and funny way. Cruise is known for playing roles that ooze oodles of dare-devilry. But most of those roles are of fictitious characters. For once Tom plays a real man whose daring knew no bounds. Captain Barry Seal was like a real-life Ethan Hunt. Hence I feel casting Cruise as Seal was an extremely appropriate decision and should help in filling Universal Studios Entertainment's coffers.<br><br>If you were awed after seeing the aerial sequences in Dunkirk, wait until you have seen this film. The planes are subjected to go through some intense acrobatics which will please you. If you were disappointed with Cruise after watching The Mummy, I can assure you that you will heave a sigh of relief after watching this film. The film's story is not only engaging but also witty and hilarious. There are hardly any stagnant moments so the probability of you getting bored is very low.<br><br>A very ironic thing about American Made is that in 1986 when Barry Seal must have gone through whatever turmoil he did, a young Tom Cruise played a pilot in Top Gun which released that year. Did he know he would pay a real-life pilot who was very relevant during those days almost 31 years later ?<br><br>Watch American Made . Don't watch it for Tom Cruise's stardom. Watch it because you deserve to watch an entertaining and great film on the big screen that coincidentally has a superstar playing the leading man. I humbly apologize for the length of this post but sometimes I just can't control myself from pouring my thoughts out","user":"mitodruroy","rank":[174,225]},{"title":"Entertaining with muddied morality","rating":7,"date":"8 May 2018","review":"Bored TWA pilot Barry Seal is prevailed upon by shadowy CIA operative \"Shafer\" to fly spy photography missions for them and, subsequently, to courier materials to and from Noriega in Panama. This turns quickly and easily into smuggling cocaine for the Medellin cartel. Much money results and, before he knows it, Seal is in the middle of a very big, lucrative and dangerous business.<br><br>Barry Seal was a real person, and the events shown in this film largely took place. I'm not sure if they would have taken place in quite the way they are shown here, though. Tom Cruise plays Seal as a likeable chap, an almost-loser who is a mix between savvy and naive, and blessed with an ability to regard morally reprehensible activity as somehow justifiable.<br><br>The film is played almost as a comedy and is quite amusing throughout, despite the questionable and occasionally violent activity which takes place.<br><br>I enjoyed it, but I found myself wondering about both the morality of portraying Seal as a likeable schmuck whose only crime was finding himself out of his depth, and also the presentation of what happened as a comedy. These were not merry japes.","user":"neil-476","rank":[15,17]}]