[{"title":"This is the second film to krampus (2013) the Christmas devil","rating":10,"date":"10 October 2016","review":"At the time i am writing this there is only one other review posted they thought as i did at first that this was a second film to the popular Krampus film released last year but in fact this is a completely different film series.<br><br>The first film of this series was released in 2013 and was called Krampus - the Christmas devil its rating as i write this review is 1.7 stars <br><br>This is a real B film with B grade everything i'm sad to say from the writing to the acting.<br><br>I only managed to watch the first 20 minutes before i decided i would rather bang my head against a wall for the next 50 minutes for better entertainment<br><br>Good luck to the makers and actors of this film i'm sure they had a very small budget but sadly for me this is rock bottom and not worth watching.","user":"dave-36917","rank":[29,32]},{"title":"Add value to your life and skip this film","rating":1,"date":"7 December 2016","review":"Now, I haven't seen the precursor and based on the sequel, I don't want to. So I was impressed by the total amateurish quality. The sound, oh my aching ears the sound was so horrible, the deaf guys in my audio engineering program were so much better. The acting, what can I say, there wasn't any. Well, the Santa character was okay. Not your Macy's Santa, almost Bad Santa cool. But what can we expect from Krampus' brother? Have I ruined it for you yet, which actually adds value to you. Krampus looked like Frank from Donnie Darko. About as scary as Krampus:The Reckoning's Krampus, okay, no. Heck not even as scary as Frank. All in all, I could do as well with an iPhone and iMovie","user":"soggydeadgirl","rank":[7,8]},{"title":"Get your horns on straight","rating":2,"date":"22 September 2017","review":"This is a sequel to the Krampus filmed in Erie. Pa....most likely the one you haven't seen. In any case Krampus is snatching kids and beating and killing them for doing things like stealing lunch money and playing video games. Santa helps the Krampus. Jeremy Duffin (A.J. Leslie) comes out of retirement to hunt them down.<br><br>The film is low budget. The acting and script are not good and neither is the sound and camera work. It is a bad amateur film all around.<br><br>Guide: F-word, sex, nudity. Cat fight that could have been better.","user":"nogodnomasters","rank":[4,4]}]