[{"title":"Way Better than the First and a Ton of Fun!","rating":9,"date":"29 September 2014","review":"I'll gladly state that I liked the first film in spite of its flaws; and I'm happy to say that this sequel is better than the first in practically every aspect!<br><br>The animation is a lot better this time around and the songs have more variety. The characters remain likable and the humor is really good. The references and cameos are still aplenty and, as a fan, I thoroughly enjoyed spotting each one. The villains weren't the best MLP has given us but they were still passable and served their purpose well.<br><br>But the best part about this movie by far was Sunset Shimmer. Her development, characterization, and arc in this movie were outstanding! This movie made me love Sunset (who I originally felt meh about after the first film) and I really want to see more of her in the future.<br><br>Also, just a tip, make sure to stay after the credits because there's a nice surprise at the end that opens up a world of possibilities for the future of \"Equestria Girls\".<br><br>Overall, \"My Little Pony: Equestria Girls: Rainbow Rocks\" was a great movie and a huge improvement over its predecessor. I can't wait to see how this spin-off series develops from here!","user":"NineTenElevenTwelve","rank":[22,28]},{"title":"Bronies and Fans, Take Note: My Little Pony: Equestria Girls - Rainbow Rocks Will Not Disappoint","rating":10,"date":"29 September 2014","review":"What an addition to the \"My Little Pony Friendship Is Magic\" franchise! This film has references to the first movie, a bit of story from the last season of the show and even all the little extra characters that My Little Pony fans love! <br><br>It is definitely a combination of adventure with a crème of comedy and a sprinkle of excitement all rapped up in a friendship sandwich.<br><br>The adventure starts when a band performance is planned at Canterlot High where the kids can make bands and raise funds and three very unusual girls turn it into a super competitive battle of the bands. When they run out of things to do, Twilight's friends from that world call to another world where Twilight is. Will they be able to come there and save them or will evil prevail? <br><br>This film is just fantastic! Hasbro was smart to include a lot of little fun things from the shows that fans adore including the beloved Derby Hooves pony who is really never part of the story, just in the background for fun. The songs are great as well. We hear not just the classic My Little Pony songs from the TV show. Instead, the music is very pop like which suits the story well. I imagine that sing-along coming to the fans shortly and being a smash hit. The show's creators also connected to the first Equestria Girls movie which I thought was perfect. <br><br>My favorite scene is when girls are having a sleep-over at Pinkie Pie's house. When Twilight gets out of bed and walks to the kitchen she finds Pinkie's older sister feeding her pet boulder. I love this scene because, in the show, there is an episode where we meet this sister. So, I thought having her in the movie is a great idea and so unexpected.<br><br>This film does not have anything parents should be worried about and for extremely little kids who do not understand the ponies, they will enjoy the bright colors. I give this film 5 out of 5 stars for its original story, fantastic songs and those little characters that fans and Bronies love so much! If you want to see \"My Little Pony Friendship Is Magic, Equestria Girls: Rainbow Rocks,\" check it out at your nearest theater.<br><br>Reviewed by Gerry O, KIDS FIRST! Film Critic.","user":"rannynm","rank":[26,35]},{"title":"Battle of the bands","rating":8,"date":"2 November 2015","review":"When my nieces wanted to watch a movie with me I of course gave them the option to pick any movie they wanted.<br><br>Little did I know they would pick My Little Pony:Equestria Girls- Rainbow Rocks.<br><br>Without knowing much story-line and character wise I had nothing to lose I was just being the good uncle. <br><br>Anyway the movie turn out to be quite interesting. What makes the movie works is the story and the soundtrack is the strongest point of the film<br><br>The Animation is original and actually has some well done art work to it with cool effects. The Voice acting is very good along.There is a good percent of humor to be found in this movie but they focus the story on more important details such as character development <br><br>What drives the movie home is the music, the movie features original songs each one have their own special magic to them my nieces and I favorite songs feature in the movie were \"Under our spell\" \"Welcome to the show\" and \"Let's have a battle of the bands\"<br><br>Overall the film has good entertainment and the fans of My little Pony will enjoy it very much plus its good for the kids <br><br>I give My Little Pony: Equestria Girls-Rainbow Rocks an 8 out of 10","user":"Terryfan","rank":[5,5]}]