[{"title":"A Stunning Film on the Impact that BP Oil Spill has had on the Gulf Coast","rating":10,"date":"17 March 2014","review":"The Great Invisible was enthusiastically received at its World Premiere at Austin's SXSW Film Festival. This film is a powerful indictment of the corporate greed and corruption of BP, Transocean and Halliburton. If \"Corporations are People\" (as we have been told), than why aren't these corporations in prison? While this event made headlines in 2010, it has quickly receded from public consciousness (much as Hurricane Katrina in the same region did after 2005). This beautifully-filmed, eloquent presentation puts human faces on this environmental disaster. While it provides some political context, The Great Invisible mainly focuses on the human stories of the families of the oil rig workers who were killed and the local fishermen who lost their livelihoods. It shows the continuing impact that this event is still having and deconstructs the myth (presented in BP TV commercials) that the Gulf coast has now completely recovered. <br><br>BP and the other companies have provided some compensation, but they have not come close to repairing the massive environmental and human damage that their obscene negligence has inflicted on the Gulf coast. This film is a beautiful tribute to all those that have suffered and continue to suffer as a result of this disaster. <br><br>Some of the best contrasts are drawn from the scenes where we see oil executives sitting around fancy hotels drinking whiskey and smoking cigars while they complain about government regulation and the other barriers their industry faces. Then the film contrasts this with the injured oil workers and struggling fisherman who have had their lives devastated as a result of the executives careless negligence. The contrast is striking. <br><br>This film needs to be widely viewed by many Americans around the country for whom this tragedy has been nearly forgotten. I hope that film is widely distributed as a part of a process of beginning to hold the corporate robber barons to account. Right now, as the title suggests the long-term impact of the oil spill has become invisible. Perhaps, this film will help lift that cloak of invisibility.","user":"JustCuriosity","rank":[20,24]},{"title":"See \"Deepwater Horizon\" instead","rating":3,"date":"24 September 2017","review":"9/23/17. After watching Deepwater Horizon I thought this would be a good documentary to watch about the disaster. While it did cover the impact of off-shore drilling on the local economy and how the accident impacted the lives of those who depended on the Gulf to make a living, it hardly went into the accident itself. This could have been like an extra featurette on the DVD release of Deepwater Horizon, which you should definitely watch than this.","user":"bettycjung","rank":[6,9]},{"title":"When will we ever learn? When will we ever revolt?","rating":8,"date":"4 June 2018","review":"Some other reviewer stated that you should watch the movie Deepwater Horizon instead. Well I watched both of them and my opinion is that the movie is a good movie about the Deepwater Horizon oil rig explosion, on what really happened on that platform. But it's a movie, based on true events, but still it's a movie. On the other side this documentary is about the impact the explosion had on everything and everybody, it's about how justice never will be served, maybe a big fine but that's about it. A big fine is like peanuts for companies like BP. I'm sure nobody will ever see the inside of a jail and that while people died, while thousands if not millions people suffered from the consequences of their neglect, while millions of animals and plants perished and will continue to die even decades after the catastrophe. The documentary is very well made and very informative. But I doubt it will ever change anything in the behavior of humans. Humans, the parasites of this planet, slowly destroying everything just out of greed and comfort.","user":"deloudelouvain","rank":[3,5]}]