[{"title":"The Ballad of an Innocent Man","rating":8,"date":"16 July 2015","review":"This is a heartbreaking true story of a miscarriage of justice as well as an examination of racism and prejudice in early 1900's Texas. Edward James Olmos is outstanding in the title role and gives one of the finest performances in this underrated actor's career. The film also has a fine supporting cast of Western character actors headed by Bruce McGill as a reporter following the posse, James Gammon as a dedicated sheriff and Barry Corbin as the lawyer who takes up Cortez' case. The prison, courtroom and post-trial scenes are emotionally powerful. This is a low budget effort which probably explains the poor lighting and sometimes shaky camera work, but this largely unknown and underrated gem deserves to be discovered for its fine acting and compelling story.","user":"charlywiles","rank":[12,14]},{"title":"Superior Western based on an actual incident","rating":9,"date":"7 November 2018","review":"Simple Mexican farmer Gregorio Cortez (superbly played with touching gentleness by Edward James Olmos) becomes a wanted fugitive and goes on the lam after killing a lawman in self-defense over a tragic misunderstanding of language in 1901 Texas.<br><br>Director Robert M. Young, who also co-wrote the thoughtful script with Victor Villasenor, not only presents a flavorsome evocation of the early turn of the century period setting that has a wonderfully lived-in authenticity, but also offers a trenchant and provocative commentary on prejudice, miscommunication, how the media can turn an ordinary man into a larger-than-life folk hero, and the harsh ugly reality of \"frontier justice\" that acquires considerable resonance and poignancy from the stark and unsentimental manner in which it tells the compelling fact-based story.<br><br>Olmos brings a winning humanity and vulnerability to his resourceful and reluctant outlaw character. Moreover, there are spot-on supporting contributions from James Gammon as tough, but fair Sheriff Frank Fly, Bruce McGill as earnest reporter Blakely, Brion James as the no-nonsense Captain Rogers, Pepe Serna as Cortez's brother Romaldo, Barry Corbin as compassionate lawyer B.R. Abernathy, Jack Kehoe as slimy prosecutor Pierson, and William Sanderson as a lonesome cowboy who's desperate for companionship. Kudos are also in order for the lovely cinematography by Reynaldo Villalobos and the harmonic score by Olmos and W. Michael Lewis. An excellent and affecting film.","user":"Woodyanders","rank":[2,2]},{"title":"The Ballad of Gregorio Cortez","rating":8,"date":"5 February 2016","review":"The Ballad of Gregorio Cortez (1982) was a pretty popular film in schools during the 1980's because it played in many Spanish classes. Along with The Official Story (1985), and El Norte (1983), you'd see it often if you were taking a Spanish class back then.<br><br>It featured the then unknown, Edward James Olmos, as Gregorio Cortez. Gregorio Cortez is a poor peasant who one day is visited by the local white sheriff who is inquiring about a stolen horse. Gregorio Cortez doesn't speak English and the Spanish interpreter isn't that knowledgeable in the variance of the Spanish language. He asks Gregorio Cortez if he has purchased a horse, and Gregorio Cortez replies that he has not. Gregorio Cortez in fact had purchased a female horse, but it is differentiated in the Spanish language. In Spanish, a female horse is called a \"Yegua\". Thus Gregorio Cortez had answered truthfully, but pistols are drawn and Gregorio Cortez's brother is killed, and then the sheriff is shot by Gregorio Cortez in self defense.<br><br>Gregorio Cortez goes off with his horse and there is the action of the film. It has some lovely music and the scenes are done well. The local posse and sheriff are on his trail and finally capture him.<br><br>The Ballad of Gregorio Cortez was also a song of the time.<br><br>Gregorio Cortez is based on a true incident.","user":"osloj","rank":[2,3]}]