[{"title":"Magnificent","rating":9,"date":"7 August 2016","review":"There is an exchange of dialog in this film where Ewan McGregor's character asks another character in the story, \"Why do you live in the desert?\" and the answer comes back \"Because the desert is ruthless ... it strips away all pretense ... it makes you see yourself for who you are.\" <br><br>Now, going into this film I was a little concerned that it was part of the New Wave of faith-based films. Don't get me wrong. I have reviewed several of those, and some are very well done. But what each faith-based film has in common is that it seems at first like a regular film ... and then gets a little odd. Not saying that is a bad thing. But it is odd.<br><br>This film starts with a certain tone and stays true to that tone for the entire run time. It never gets odd. For this reason I do not consider it a faith-based film but a true creative work that is is both brilliant and powerful.<br><br>The premise is simple -- can you focus on just a few days of one of the most inspirational figures in modern religion (fictionally)and, by the microcosm of those few days, achieve the flavor and the raw emotion of the entire life of that same character? <br><br>It is a daunting goal but I think McGregor and Garcia pull it off. To appreciate this film you need to start with no expectations and then get drawn into the film much the same way the central character allows himself to get drawn into the desert. Almost like a meditation, if you like.<br><br>In the right mindset this film is like the desert in the quote above. For a brief moment it allows you to see yourself for who you are.<br><br>Recommended.","user":"A_Different_Drummer","rank":[32,44]},{"title":"\"Last Days in the Desert\" is worth discussing, if not worth being immersed.","rating":7,"date":"18 December 2015","review":"To all its credit, \"Albert Nobbs\" director Rodrigo Garcia makes a marvelous transition of the story of the temptation of Jesus to the art-house scene, cementing this \"not intended for the Christian audiences\". Though the art-house Biblical story is nothing unusual, \"Last Days in the Desert\" makes a unique turn of focusing it as a father-son story. That is where the flaws turn out. Driving the focus away from Jesus makes the story unjustifiable to explore and insincere to depict. However, the grandiose coming from Ewan McGregor's presence and the sense of struggle makes the journey satisfying. There could have been more depth to explore from a simple scripture about Jesus' 40 days in the desert, rather than adding a father-son subplot. But from what was offered, Garcia makes an interesting piece to talk about.","user":"thependragonscribe","rank":[38,58]},{"title":"An enthralling tale about the work of Jesus","rating":6,"date":"3 August 2016","review":"This is one film that I have been waiting to see since January 2015. After it premiered at the Sundance film fest and received solid praise out of the gate, I was looking forward to it. But was it picked up for a wide release? No it was not. So, nearly a year and a half later it has finally hit shelves. Recently the box office has had an abnormally high amount of pandering faith driven religious films. Which isn't really a bad thing. They certainly know their audience, and they have cornered the market for their films. That being said, this isn't one of those films. Seeing a movie that is largely religion based you normally see the typical one sided, you're wrong and we are right thing. <br><br>I am happy to say that this doesn't do that. This adaptation is about Jesus, playing out in an imagined portion of his forty days of fasting in the desert. As he is trekking through the desert on his way home, he encounters a small family. He quickly realizes that they are in turmoil of emotional proportions. <br><br>He decides that their needs out way his own and attempts to aid them. The story mainly takes place during this period of time. Now this movie could have been so incredibly dull. The main story is fairly thin and it doesn't exactly move around that much. But writer/director Rodrigo García has infused this film with palpable emotion. The more we learn about this small family the more we realize that they are pretty dysfunctional.<br><br>The father and son don't see eye to eye on anything and the mother is laying on her death bed for the entirety of the films run time. For me the scenes between the son and father really struck true. I often have experienced the same communication issues with various people that these two do. Where you want to say something but don't know how and before you know it, the moment to express that feeling has pasted.<br><br>As these issues become more prevalent the more you just want them to work it out. This creates some real drama with in these scenes. But the shining moments of the film come in the short encounters between Ewan McGregor and Ewan McGregor. Who plays both Jesus and the devil. The conversations that they have point out both sides of the religion spectrum.<br><br>It presents interesting arguments for both parties. Which honestly helps you feel what Jesus is feeling. The whole point of Jesus's desert journey was to be put on trial to see if he could over come any adversity that the devil could come up with. So when the film puts him through these temptations and presents interesting arguments for either side, it helps you get into the characters shoes.<br><br>That being said this film still has a story that is thin as paper. So when you get outside the family drama it can be rather dull. The beautiful cinematography by Lubezski can carry one through a few scenes but not too many. There are some scenes where we watch McGregor just pace around the rocky terrain for long periods of time. And it left me longing for something, anything to happen.<br><br>This movie may not be the religious experience some people are looking for but it's really a breath of fresh air in a genre that had little going for it. It seems to have a keen grasp on the story it's adapting and does so with no shortage of grace. It offers excellent performances, beautiful visuals, an insightful story, and characters that you can actually get invested in. If it weren't for the thin plotting and some dull sequences this would truly be an excellent film. But considering all it does right it's definitely worth a watch.","user":"Rendanlovell","rank":[19,27]}]