[{"title":"Flawed drama thriller","rating":6,"date":"4 August 2015","review":"In Containment, the protagonist finds his apartment door epoxied shut, and unable to communicate by phone; and the plot develops from there.<br><br>The movie was described as a horror sci-fi thriller, but that is only one-third correct. There was nothing sci-fi about it, and it is not a horror movie.<br><br>My main complaints are two. One is that there were a lot (like twenty or thirty) long-duration shots that accomplished precisely nothing, as if the director was desperately trying to add to the length of the movie. The other problem was the movie's ending, which was quite abrupt, leaving things unresolved and incompletely explained.","user":"Joseph_Halsey","rank":[67,77]},{"title":"Penned In","rating":7,"date":"18 February 2016","review":"Small budget British film about a group of people trying to figure out why they are locked up in their flat. The answer to this will be painfully obvious from the outset and the film will unravel just as you will expect. However that doesn't mean it is terrible by any stretch of the imagination. In fact it is a pretty solid 'survivor group' film with all the regular character types you would expect from such, so if you are a fan of these types of films then you will definitely find something to enjoy.<br><br>For anyone else there will most likely be a problem with pacing as it does seem to drag a tad, especially since it takes awhile for the film to reveal to the characters what we as the audience have figured out from near the beginning. There are also a lot of clichés that will seem tired and obvious, as well as possibly lazy.<br><br>Despite this there is nothing glaringly bad about the film, which to its credit works very well within its budget and keeps everything nice and simple so that it works and doesn't seem cheap or unfinished. Overall it is a good study for those looking to make a similar type of film as it is a textbook case of a group of people dropped into an unfamiliar situation where they seek to survive. As such it doesn't reach any dizzying heights or provoke much original thought, but it is solid and certainly is worth a watch if you are a fan of this sort of film.","user":"scythertitus","rank":[13,13]},{"title":"\"Containment\" (2015) is the film that sounds cliché but isn't.","rating":8,"date":"29 December 2015","review":"\"Containment\" (2015) is the film that sounds cliché but isn't. It's a surprisingly fresh take on an old standby -- diverse people isolated by an outside threat are forced to cope and survive with each other, along with the threat. In this case, an entire apartment block in Britain is forcibly and mysteriously quarantined overnight; residents awake to sealed doors and hazardous materials units being deployed along the grounds.<br><br>But this is a smartly written independent sci-fi thriller that avoids a lot of common tropes. Then it introduces plot developments that are unexpected, yet make perfect sense. It's more original than you'd guess at first.<br><br>There's a lot of nice acting, including work by Lee Ross, and by Louise Brealey of \"Sherlock\" (2010) fame.<br><br>My only complaint was a thematically ambiguous ending that seemed lost on me. But I'd still give this an 8 out of 10.","user":"ericrnolan","rank":[22,28]}]