[{"title":"Very good film for all ages.","rating":8,"date":"30 April 2016","review":"I am a sucker for true stories and this movie is based on real events within the American horse world in our recent past. The actors are all great at their jobs and were typecast very well for their parts. William Shatner plays a typical businessman, void of any personal feelings of how his decisions might affect those around him.<br><br>Ving Rhames carries his role as a somewhat kindred spirit to the lead character and is allowed to explain in the movie why he makes stands when stands are needed.<br><br>This film has very good production values and a great soundtrack as well.<br><br>Don't be afraid to see what might be considered a \"family\" film as the film has something for pretty much anybody who likes horses and good people going thru \"class struggles\" within a tight knit horse-related community of rich snobs and their \"toys\".","user":"HoosierBob","rank":[12,17]},{"title":"Ugh, A waste of beautiful horses","rating":4,"date":"30 May 2016","review":"All the hokey religious stuff aside, it was a somewhat fun watch--because I love &amp; have ridden &amp; jumped horses. But the last 1/4 of the film, and a lot more was really cringe worthy; instead of jumping into the beauty of horses (which it tries), this film is hackneyed &amp; for most, intellectually low-rent. It really doesn't deserve the 4 stars I gave it. Oh Jeeze, IMDb wants some lines of \"criticism\" (they say 10). Why can't you say it's \"just simple hokey junk--an insult to horses\". The whole medical nonsense when 'super girl\" (rider &amp; lover of her riding horses)is being treated from a fall is just formula junk for those (perhaps) who vote for Trump! (Sorry for the rhyme)","user":"davetree-1","rank":[6,17]},{"title":"Amazing movie","rating":10,"date":"6 April 2017","review":"I was watching this movie in my dorm room when my roommate walked in, and she nearly dropped her travel mug! She worked under Debi in Florida and was trained for a good deal of her life by her. I started it over and we watched it together, and according to her, the movie is extremely accurate. Way to go for taking a true story and going out of the way to alter the history as little as possible!","user":"tinkerbellkeller","rank":[2,4]}]