[{"title":"Laugh, Scream, Flinch","rating":9,"date":"18 October 2014","review":"Housebound is really something. It's part ghost story, part People Under the Stairs, part murder mystery, part slapstick comedy and part family drama. The dialog, facial expression and spot on timing of the action keep this mash up of genres amusing every step of the way. Just when you think you know which way it's heading, it either makes fun of the standard clichés or skips them entirely, casting us into a twist and turn that starts it all over again with an entirely new plot development. And when you think you know where that plot line is headed, it does it again. I really enjoyed the character Amos played by Glen-Paul Waru. His bumbling energy kept me chuckling. I also enjoyed the fact that even though this film gets pretty violent and gory at times, overall it is a good-natured, feel good movie that, like a roller coaster ride, is scary and fun and shocking and harmless all at the same time. Good job Gerard Johnstone!","user":"chicagopoetry","rank":[96,117]},{"title":"Unpredictable and genuinely funny","rating":8,"date":"3 September 2014","review":"Delinquent serial-offender Kylie is sentenced to nine month's house arrest at her family home in a small town on New Zealand's Twin Coast Highway, forcing her to move back in after many years with her slightly loopy mother, who we learn has long been convinced that the house is haunted. Initially more than a little sceptical, Kylie soon begins to experience unexplained phenomena herself, and before long local security contractor/probation officer Amos (who is principally responsible for ensuring Kylie doesn't leave the premises) offers his services as an amateur paranormal investigator.<br><br>Part ghost story, part murder mystery, it would be counter- productive to know any more about the plot before viewing, as various revelations and red herrings keep the mystery quotient high. There are also underlying themes relating to family and loss that lend the film a welcome human dimension.<br><br>One slight negative is that the many twists and turns stretch out the runtime beyond the ideal for this sort of film, and there are times when it starts to drag. Also one particular character is presented in a manner that pushes the film firmly into farce territory; one of a couple of aspects that could have been executed slightly more believably, as absurd as that sounds in relation to a film of this type.<br><br>The performances are all top notch; Morgana O'Reilly has great fun with Kylie's mardy persona, Glen-Paul Waru is perfect as likable doofus Amos and Rima Te Wiata excels as Kylie's dotty but ultimately caring mother. Refreshingly, the main characters all develop convincingly over the course of the film, which is far from a given when it comes to horrors, comedies and indeed horror-comedies. You'd have to be pretty hard-hearted not to care about them by the end.<br><br>Horror-comedies are difficult to pull off, and it's rare that a film strikes a genuine balance without ending up as a full-on horror with a darkly comic edge, or an out-and-out comedy with horror themes, but Housebound gets very close to doing so. At time it leans more towards comedy and farce, and the tone is often light-hearted, but there are enough moments of tension – and violence – to ensure that there are plenty of thrills among the laughs.","user":"leominosa","rank":[86,106]},{"title":"A surprising gem from New Zealand","rating":8,"date":"29 April 2014","review":"Kylie (Morgana O'Reilly) is a wild child methamphetamine &amp; drink fueled girl who's not averse to engaging in petty crime to fund her lifestyle. One night, after her spot of smash 'n' grab badly backfires, Kylie is put under house arrest, complete with delinquent offender ankle bracelet, to live with her long suffering mother and her mother's almost permanently silent husband and has to endure being checked in on by her social worker Dennis (Cameron Rhodes) and likable security guard Amos (Glen-Paul Waru)<br><br>Kylie and her mother don't get on at all, with neither particularly happy with this state of affairs. Worse still, her mother who tends to believe in the paranormal gets even more annoying by insisting the house is haunted, due to the strange noises and weird sighting in the basement she had. Kylie scoffs at this and finds her mother's incessant chatter and claims even more irritating... <br><br>...Until she hears the noises herself one night. Things get even worse when Kylie starts having her own sightings &amp; observations of weird stuff happening. Desperate for help, she and her mother confides in Amos the security guard. Amos, a keen amateur paranormal investigator decides to look into things, which leads to them uncovering some rather creepy info about the house in the process. As the mystery deepens, Kyleigh, her mother and Amos all realise that they're gonna have to solve it before whatever it is that dwells in the house engulfs and destroys them all...<br><br>Housebound is a very pleasant surprise comedy horror gem from New Zealand, but with nicely done scares and a creepy atmosphere to go with the chuckles, which come mainly via hilarious interactions with the dysfunctional trio. It also turns into a surprisingly layered film plot wise with some twists &amp; turns in the third act to keep things nicely interesting. With some gold one liners and effective scares, it's emerged as one of the better horror viewings of this year and while frequently hilarious, it's primarily a horror thriller that simply tempers things with some very deft comedic relief.<br><br>Overall a highly recommended gem from New Zealand and it went down well with the audience at the Dead by Dawn festival where I caught it, so any horror fan should keep an eye out for this one. 8/10, really decent little horror flick.","user":"Corpus_Vile","rank":[95,121]}]