[{"title":"There's still originality in Hollywood horror movies !!!? I'm scared !","rating":10,"date":"3 October 2015","review":"This was one of the rarest horror movies that managed to keep me totally scared and mostly uncomfortable from start to finish in years and years. I don't get this new trend of hating everything Shiamalan does. This new movie is one of the best horror concepts I've come across in a very long time and uses simplicity to the best effect. <br><br>I don't get what people these days expect an horror movie to be. If you don't think this a good example of a simple concept that works like a dream...or a nightmare, I don't get what passes for horror in Hollywood no more. <br><br>The idea for this movie is fantastic, and it's very well executed. I really don't get why people complain that nothing happens in this story. It's that type of simplicity that keeps the scary atmosphere throughout the entire movie. This is not a cgi crap action so called horror thing for teens, this is a classic old school horror, it's filled with a creepy atmosphere and uses perfectly all the ideas for each character to keep the viewer feeling uncomfortable all the time. <br><br>There's a couple of good scares ,but most of the horror really happens inside our minds. This is the best thing in this movie, it creates such an atmosphere of tension with simple things that when something really dramatic happens on screen we get ten times more startled and there's no need for any cgi on this movie at all to scare teenagers and bore the rest of us to death with the usual clichés. Not on this one.<br><br>This is clearly an horror movie for adults, its not edited at two hundred frames per second and it has a classic structure that simply is not targeted at young audiences. This is an horror movie for horror fans, it's not a popcorn movie for general audiences so ignore the bad ratings on IMDb, because if you remember the good classic stuff from the 70s like The Omen, The Changeling, or all those movies built on atmosphere instead of action, this movie is for you.<br><br>Absolutely brilliant. In my view the only thing that does not work is the final sequence after the twist is revealed, simply because the movie stops being a a story that creeps us out and becomes the usual fight for your life action bit we've seen hundreds of times. But until that happens this story is scary. Not because of what it shows but because of what keeps making us expect it's going to happen next.<br><br>Shyamalan is really back and this screenplay is the best thing he's ever written since the sixth sense and unbreakable. Also the casting is simply perfect with brilliant performances from everyone.<br><br>True horror is back folks. Ignore the bad hype from the multiplex popcorn crowd. This is a real gem that deserves to be among the very best horror titles of recent years and it will creep you out if you like your suspense atmospheric.","user":"Alcaminhante","rank":[228,356]},{"title":"Better than it had any right to be!","rating":9,"date":"7 September 2015","review":"Even though I've been severely burned by M. Night Shyamalan's commercial misfires (or rather miscarriages) like Lady in the Lake (ugh!), Airbender (what the hell was he thinking?) and After Earth, I decided to give him one more shot in the shape of The Visit. What worked in his favor was his superb work on the small screen in the form of the 2015 mini-series Wayward Pines - which made me believe that deep down inside Shyamlan's heart still resides a true artist, and not some lazy hack who tackles big-budget flops just to get paychecks from the studio. His recent talk in interviews about gaining back artistic control of his products was another positive step in Shyamalan's long path to cinematic forgiveness.<br><br>And so I entered The Visit, a somewhat short and intimate tale of two precocious teenagers, a brother (13) and sister (15), who travel cross country to meet and spend a week with their estranged grandparents, whom they have not seen or met since birth due to a big family feud their divorced mother (Kathryn Hahn, the most recognizable face in the cast) refuses to talk about. The sister, Becca (the promising Olivia DeJonge) also happens to be an aspiring filmmaker, out to make a documentary about the big reconciliation, which ever so conveniently sets the movie up in the popular found footage sub-horror genre - but also opens a wide crack for endless jokes and self-aware nods towards the unsuspecting audience.<br><br>Anyway, as you could probably tell by the previews, something isn't quite right with Poppa and Nanna, and even though at first they seem like reasonably nice elder folks, their strict rules (do not get out of the room after 21:30, do not go down to the basement) and strange manners (you'll see what I'm talking about) soon enough make it clear to both Becca and Tyler (the smaller brother portrayed by the superb Ed Oxenbould, who at 14 shows endless promise) that they better get the hell out of there - as fast as they could.<br><br>Besides the trademark Shyamalan twist, which actually works here and seems reasonable in hindsight (unlike, say, The Village), the extremely self-aware script and the very natural and authentic brother-sister relationship between both co-leads, lends further credence to Shyamlan's pet project. You can see that he cared for the characters, and you can also easily remember that this is a director who made a reputation for himself because he managed to facilitate such an emotional and iconic performance out of then-11-year-old Haley Joel Osment, so obviously he's good with kids. I don't know if young Ed Oxenbould is the next Osment, but he sure does deliver the goods through and through - and gives one of the best children/teen performances I've watched in a while.","user":"saarvardi","rank":[245,418]},{"title":"M. Night is making a comeback.","rating":8,"date":"8 October 2015","review":"I went into this movie knowing nothing about the film so when I saw, \"an M. Night Shyamalan film,\" I let out a frustrating sigh having been disappointed by him for years. This movie was different though. <br><br>There are no viral outbreaks, no creatures chasing Will Smith, and no air benders. It's simply two kids visiting their grandparents while their single mother goes on vacation. <br><br>I've noticed that M. Night does his best work when he puts the focus on ONE main story and lets the other dynamics and plots unfold around that story. In Signs, he focused on Mel Gibson's crumbling family life with an alien invasion as a backdrop. In this film, he puts the focus on the two children's relationship and lets the rest of the film follow suit. Anywho, enough about that.<br><br>This movie has the essential elements of a creepy movie. House in the middle of the woods, crazy lunatics for grandparents, and a couple of tech savvy teenagers.<br><br>The film is shot in found footage style which has definitely been done to death, but is not \"in your face\" in this movie. M. Night cleverly writes the teenage girl in the movie as a film buff who focuses on cinematography and \"setting the mood,\" which allows him to use depth of field, good lighting, and good framing unlike other FF style movies like Paranormal Activity, etc which are more jumpy and gopro-ish. The visuals and camera work are refreshingly crisp and smooth, given the method of filming<br><br>From day one, you can tell that something isn't right with the grandparents and the kids decide to set up cameras and capture the action. Long story short, things get crazy. <br><br>The most surprising thing about this film is how naturally comedy, suspense, and overt horror are blended together. Nothing really felt forced or unnatural in acting, pace, or action. At some points the horror felt a little campy, but that can't really be avoided with so much humor in the movie and most of the people I saw the movie with were cool with that. <br><br>Looking back on it, the twists were somewhat predictable but at the time I was so engrossed with the movie I didn't even notice the plot twist creep up.<br><br>Great movie and I really hope M. Night can continue with this excellence! see this movie if you can!!","user":"jackbanister16","rank":[39,60]}]