[{"title":"Failed on all counts, except for casting and acting. No interesting developments, no interesting family secrets revealed, and I missed creepiness all over","rating":4,"date":"27 April 2015","review":"Saw this at the IMAGINE film festival 2015 in Amsterdam. It missed all potential chances to be interesting, in spite of the many recommendations one can derive from the synopsis on the festival website. The introductory talk of the festival programmer was also very positive, which fully explains the even-so positive tone on the website. But I disagree.<br><br>Something happens all the time, so the movie is not boring on itself. But the proceedings disappointed and are only mildly interesting. I did not notice anything noteworthy in the controversies between the sisters and/or hidden problems with their mother. Maybe that sort of relational drama is important for romcom fans, but not for me. Many seemingly deep symbolisms about the \"seven sisters\" constellation, with one star hardly visible (like the youngest sister who is filming all this, and her sisters don't really count her for full as we find out), the birds that fly themselves to death against the window (one each day), and so on. All of that are attempts to suggest some hidden meanings, but it went all past me.<br><br>Anyway, the festival audience thought not much of this film. It ranked lowest for the audience award with average score 4.90 out of 10. To add insult to injury: I'm wondering who filmed the final scene, as I don't think this is a \"found footage\" category of film.","user":"JvH48","rank":[31,51]},{"title":"Great ActING, no ActION","rating":4,"date":"20 January 2017","review":"This movie was rooted in outstanding performances by the sisters. Lindsay Burdge is a flat out amazing actress and was maybe even out-acted by Jennifer Lafleur and Aleska Palladino. Their performances alone kept me watching.<br><br>However, I am not sure where are these reviews of \"horror\" and \"haunting\" are coming from. This movie baits you in to think there will be some bone-chilling climax, but never delivers. This may steer many people away that go into this movie expecting some chills. it is FLAT OUT not suspenseful at all.<br><br>This movie is a great story, it is mind bending, and thought provoking with some great acting...but that is where it stops. The story progresses slowly and never really capitalizes on the small moments that are set to build up suspense. <br><br>If you do watch, go into it as a short drama with good performances. Do not expect to be blown away by suspense or a thrilling plot.","user":"mrmurr9909","rank":[8,11]},{"title":"A film to haunt one's dreams","rating":10,"date":"16 November 2014","review":"I saw this film at the Ithaca Fantastic Film Festival two days ago and still haven't quite gotten over it. The Midnight Swim is a story of three sisters, their dead mother, and a lake. It is at once a piercing family drama, a somber meditation on life and death, and the creepiest film I have seen since The Orphanage in 2008. It is also an excellent example of how a small budget can work to a film's advantage when the film-makers are bearing a surplus of imagination and intelligence. <br><br>I won't give away the story, but the film is shot in point-of-view style by one of the sisters, who is collecting footage for a documentary about her family. I have always been of two minds about POV film-making. While I have admired the visceral immediacy of this approach, I have often missed in it the deeper emotional resonances that are possible in conventional film-making. One of the revelations of this movie for me is that a film can have both of these qualities at the same time. <br><br>I was also bowled over by the cast. If these three actresses aren't sisters, they could be. The documentary style gives them nowhere to hide, and the performances had to be spotless in order for the film to work. (They are spotless and at times absolutely hair-raising.) Greatly to actors' credit, it is impossible to tell how much of the dialogue was written and how much of it was improvised. <br><br>Two days later, I am still brooding on this movie. It is beautiful, troubling, weird and enthralling -- a film to haunt one's dreams.","user":"walshchad","rank":[31,65]}]