[{"title":"Sub Par effort","rating":5,"date":"7 May 2017","review":"Right from the beginning this had a straight to DVD / TV feel to it. An excellent cast seem wasted and Connie Nielson is totally miscast with a horrible accent, I usually like her too. Like others have said, the action scenes are poor and the music was awful and brought nothing to the Film, maybe they didn't have the budget. At one point Chen's character mentions NATO rounds being 7.62, when they are now 5.56, but I am just being picky. Any way I lost interest after about 30 minutes. I have liked Simon West's movies in the past but he has seriously lost it of late. On the whole a Sub Par effort.","user":"jimkennyeverett-691-760833","rank":[26,32]},{"title":"Promising premise let down by incredibly poor execution","rating":4,"date":"10 April 2017","review":"With an intriguing premise about a rogue Russian agent looking to disperse a biological agent over major cities via drone, Stratton's plot involves quite a relevant and realistic threat given the rise of drone technology in recent years. Naturally I was expecting an exciting Bond-esque action thriller, with a protagonist that really encapsulates the skill and professionalism one would expect from Britain's own Special Boat Service.<br><br>What you get in reality is a very poorly directed film, with a cast that doesn't click and some atrocious action editing.<br><br>Dominic Cooper is a fine actor but here you can really feel he was the last minute replacement for Henry Caville as Stratton, he just lacks the physique and physical presence/ability you would expect from a highly trained SBS operative. Half the time he uses a weapon he seems to be trying to emulate John Rambo, hip-firing at any opportunity. It's quite obvious that he probably only had a few weeks of prep for the role at the most, and it really shows on screen.<br><br>Connie Nielsen as the section chief/commander of Stratton's unit attempts to affect a posh, British accent but can't quite sell it. Tom Felton basically chews the scenery for every scene he is in, and Austin Stowell as Stratton's replacement partner is so rash, impatient and gung-ho he definitely doesn't come across as a highly trained Navy Seal, more an-overly aggressive mall security guard.<br><br>The action sequences feel really underwhelming and they are given artificial pacing by some diabolical editing, at points the cuts are so quick you can't tell what is actually happening in the scene.<br><br>*** Spoilers *** At the film's climax the bad guys are looking to release a drone carrying a nasty biological weapon over London, but instead of doing so right in the centre of London (they literally drive past Nelson's Column and the Houses of Parliament), they opt to do so in the middle of a park somewhere on the outskirts. Making it painfully apparent that the movie just didn't have the budget for what would have been a great set-piece.<br><br>It seems that the gleefully entertaining 'Con Air' was lightning in a bottle for director Simon West, as most of his subsequent films: Expendables 2, Tomb Raider, Wild Card and now Stratton, are just not very good.","user":"jackcakehouse","rank":[23,29]},{"title":"Not memorable, but not bad either","rating":17,"date":"17 August 2017","review":"This film tells the story of a group of British and American intelligence officers, who carries out a secret mission to stop a man's plot of destroying a Court using weapon of mass destruction.<br><br>\"Stratton\" is a mainstream film, and it's a risk averse investment by the film producers. The characters are generic, the plot is formulaic and predictable, but it does entertain and help to kill time. It's not memorable, but it's not bad either.","user":"Gordon-11","rank":[18,22]}]