[{"title":"Low budget fun. Nothing new but still entertaining","rating":5,"date":"8 January 2016","review":"Man, online sit at home critics are just dogging on this film. Guys, keep in mind it's a low budgeter. People in general don't understand all the work that goes into making a film not processed by Hollywood big wig studios. Sure there was some lackluster acting and a few playing it straight forward. I've been on set of some low budget films. I have to say this one was decent. I only got bored in the beginning during the typical intro of each character. That has been done over so many times. (Vin Diesel - XXX) none the less, when the action gets rolling, it's not so terrible. I noticed people trashing the fight sequences. I can't speak for any others but I thought Zoe Bell looked great pulling them off as a harsh judge of screen action who came from a martial arts background myself.<br><br>I have to say that Nicole Bilderback is underrated and underused in this film. She is an actual kick-boxer who never once gets to showcase any of her real skills. She actually stills every scene she is in though it seems the only curse word she knows is \"bitch\". Lol. Asylum has come a long way from the mock busters they were known for back in the day. I think this film was a good cheesy action ride. Give it a chance.","user":"avriapocalypse","rank":[11,13]},{"title":"Mediocre and cheesy, but somehow enjoyable and dumb fun","rating":5,"date":"9 August 2014","review":"Mercenaries (2014) is the kind of movie that is quite honest with people who watch it. It doesn't pretend to be more than what should be.<br><br>The plot is paper thin. Very basic, probably made by monkeys. <br><br>Character A gets kidnapped by bad guys. Character B recruits some criminals by offering them redemption. The girls go to war and there will be death and destruction.<br><br>Blood squibs, horrible CGI, laughable acting, Vivica Fox is fatty, Brigitte Nielsen is over the top, handguns have 50 bullets without even reloading, bad guys are retarded and dumb by missing shots when their enemies are only 3 feet away from them.<br><br>The last fight was so cheesy and probably it was meant to be that way. Fortunately, it's short ( 84 minutes ) and it's OK to watch if you have nothing better to do.","user":"QCTeamkill","rank":[28,40]},{"title":"This film is best used to fertilize your garden.","rating":2,"date":"20 August 2014","review":"What a load of steaming manure. There is a basic quality to the plot, some of the acting is OK, the rest is horrific. You know you are in trouble when Kristina Loken puts in a performance significantly better than any one else. The fight choreography has some, er, nope, it ranges from average to poor, with most of the fault lying in the hands of the chimp that directed this and his ham fisted editor. I have seen worse premises for films, but whoever thought that taking the concept of The Expendables for women, adding the premise from Snake Pliskin, and handing over 1/10th of the budget really must have owed someone a soul to get this pile of tripe made. I love cheesy bad action films, it is a weakness for me, and I will forgive most things. But holy cow this film is just bad on too many levels and never makes fun of itself, it is trying to be good, and failing on every possible level. Bad directing of mostly bad actors, no finance, no continuity, not pacing, no rhythm, no originality (except new lows) nothing to redeem it. Watch Expendables and Escape from New York in stead. If you like the actresses watch Death Proof and Blood Rayne. Still not good movies, but a lot better than this.","user":"Fiendrunner74","rank":[28,41]}]