[{"title":"Surprisingly Solid movie with a good message","rating":7,"date":"27 July 2016","review":"This movie comes at the perfect time with the craze of Pokemon Go; a time when you literally see millions of people obsessed with an app - where you can find videos of hordes of people in NYC all running after a particular Pokemon.<br><br>This is essentially the premise of the movie: a new app (game) comes out that takes teens in a particular city by storm, except the consequences can be much graver.<br><br>As to not give anything away, I try to be brief:<br><br>The acting was great; the pacing was great, the color pallet and tone of the movie were all top notch. <br><br>That being said, the plot - as it developed - felt \"obvious\", I wasn't surprised by anything and I wasn't ever emotionally \"moved.\" The movie knows what it is, and it does it pretty well - it's a teen thriller. <br><br>What the movie explores is far more important: the way people interact with each other when they are hidden behind a wall of anonymity. The movie has a good message. <br><br>The BOTTOM LINE: I rate movies on whether it is worth spending the $$$ to see at a theater, in my opinion this one is worth seeing at a matinée showing ($5), but probably not dolling out $12 - $15. I hope that helps.","user":"allstarrunner","rank":[137,200]},{"title":"Starts off okay, but quickly turns into a huge mess","rating":4,"date":"22 September 2016","review":"\"Nerve\" is a 95-minute thriller from this year that is based on a novel by Jeanne Ryan. Jessica Sharzer (\"Speak\", \"American Horror Story\") adapted the work for the screen and the directors are Henry Joost and Ariel Schuman, both known mostly for \"Catfish\" so far. The lead actress is Emma Roberts and the only other cast members I knew in here were her co-lead Dave Franco, brother of James, and Juliette Lewis playing the main character's mother. Most of the cast, also because of the subject, are pretty young aspiring actors that do not (yet?) have a big name. I kinda liked Emily Meade (even if the friendship story between her and the main character was one of the weakest parts of the film) and I can see her having a good future in film. But lets look a bit at the now and this movie. It is a take on Big Brother with a mix of \"Hunger Games\" and an ounce of David Fincher's \"The Game\", so if you hear all this you already know it is a mostly dark take on the age of surveillance. Here we have a young woman who gets told by her best friend that she just isn't taking enough risks to lead a fulfilling life. So she agrees to join in a virtual reality game called \"Nerve\", in which she gets watched constantly by thousands of people while she has to fulfill quests. These quests quickly get her to join forces with Franco's character.<br><br>And from that moment on, the two are out there together and the Watchers see them and hope for them to start a relationship. There is some situational comedy in this film and this was mostly working well. But sadly, in stark contrast to that, the real core of the film was not working for the most part. I am referring to the dramatic thriller sequences. They start off okay, but the script is quickly lost in a whirlwind of desperate attempt to become more controversial, more shocking and more relevant. The social commentary/criticism, which is what the film really is all about, also with a reference to our world, becomes complete garbage at some point and lacks realism entirely. One major problem is Roberts' main character. In one scene, she is scared to step on the motorcycle, int he next she accelerated the bike with her driver blindfolded. A rush of adrenaline cannot explain that. Same can be said about the ladder climbing scene. Lets not forget: This film takes place over the course of one evening/night and I just refuse to believe a character would change like that from one second to the next on all these contradictory occasions.<br><br>At some point, I felt the film really went for nothing than shock value and it was very empty and irrelevant as a consequence. Police won't do anything to stop the hosts of the game, even after a kid died earlier and probably more did looking at the risky actions. But a teenage boy and his pals can hack into the system and send messages that call everybody an \"accessory to murder\". This was maybe the most embarrassing moment, even if the idea about ending it at the very end felt very false as a whole. And why would everybody, even the \"bad\" guy, know about her plan, but Franco's character, the one closest to her, would not know? There were just so many scenes that did not make any sense at all in the second half of the film. Emma Roberts did not impress me at all. sure this is a film that is much more about the story and plot than about individual performances, but I was shocked how irrelevant her character and performance felt throughout the entire film. A more gifted actress certainly could have elevated the material and her speech in front of the crowd at the very end was nothing special either, more on the cringeworthy side. Franco, a fairly mediocre actor himself, looked really strong next too her. And Juliette Lewis? Oh well. I felt almost sorry for her about what they gave her in terms of the script. The character added absolutely nothing at all, but that's not Lewis' fault, just because of the way she was written. Apart from that, I refuse to believe that the crowd would really want her to die. First of all, humans aren't that cruel, second of all we were led to believe they loved her immediately the moment she entered the game. Make up your mind filmmakers and please don't give me the argument of people's opinions changing fast.<br><br>Okay, enough said. I am fairly disappointed here. This was definitely a missed opportunity. The film showed some solid premise early, but it quickly turned into a huge mess. I am actually glad it was relatively short and did not get any closer to the two-hour mark. I have not read the book this is based on, so no idea who is to blame and if the base material is also really weak, but if not, then I can not image Ryan being too happy with the way this turned out overall. I just hope they don't get the idea at some point to make a sequel here. This original was already underwhelming enough. I certainly do not recommend the watch. The longer it went, the worse it became, also with the ridiculously bad rushed-in happy ending for everybody. Stay away from this film.","user":"Horst_In_Translation","rank":[79,118]},{"title":"Vine and Pokemon Go had a baby (and the Kardashians are the Godparents","rating":4,"date":"26 August 2016","review":"I struggled staying until the end of that movie, probably because I am not within the right demographic,so I'd say, if you are shaving already, this movie is probably not for you! (But if you are not shaving yet I am not sure I would like you to see that movie) I usually enjoy college silly movies or even some high school centered movies, but this was too much for me. Only good reason to see this movie might be for a drinking game: take a shot every time they say \"OMG!\" This movie is surfing big time the Pokémon Go wave, it is an ode to so many things that as an adult,are bothering me: the social media addiction(Vine,FB, Instagram), it puts ego-centrism, greed, instant gratification, instant fame into the spotlight. It encourages people to break the rules for fame, it makes attention seekers, extreme thrill seekers looks cool. But at the end there is a nice little twist and a lame moralizing lesson, which tells us do not go too far, friendship and life is more important, awwww so true, soooo nice, but...too late, the movie just spent 90 min showing people that all this crap was cool, pretty much being an enabler, validating addictive, dangerous behaviors, in front of a young susceptible audience! (or an older audience wondering why the hell I am here) We all read stories of selfie takers who fell from a crane or roof or cliff because they were trying to score a cool shot for their social media profiles... The movie is rather fast paced, but it is just watching a succession of dares: steal this, be naked, get a tattoo, risk your life...it is actually not funny nor entertaining to watch this. The main actors are likable, but it is was not enough to make me forget how idiotic this movie was. I was fooled by the 7 average, but then I realized 80% of the people watching this movie were below 25, so like I said in my opening statement, this is for a younger audience (who might pause their Pokémon Go hunt or their posting on FB, VIne, Insta... for the duration of this movie, and get their nose back into their phone screen as soon as the movie is over)","user":"davidsalmon","rank":[67,99]}]