[{"title":"Naive but intriguing pioneer all black action movie.","rating":5,"date":"5 June 2015","review":"I can't find much information on this historically intriguing South African black wannabe addition to the \"Shaft-Superfly- Sweet Sweetback's Baadasssss Song\", tradition, or it's 1982 sequel. That's a pity because what went on behind the scenes is probably much more interesting than what we see. We do learn that the film was banned and unbanned in 1972 (why?) and has only just re-appeared and recognize the imposing Ken Gampu from his Jamie Uys movies \"Dinkaka\" and \"The Gods Must be Crazy\" and from \"The Naked Prey\" all those years back. He's a plausible action hero who could have carried a more substantial production. <br><br>The film's ambitions are minimal. The formula plot about corruption in sport has the bad hats trying to get star players Tlhotlhalemaje and Chama away from the Eagles so that the the rival Team the Falcons take the big game and the crooks get rich betting on them.<br><br>Ken comes with his own song (\"he's the man who won't let you down\") and wins the manager's daughter Kubeka, who does a passable musical interlude when our hero is not rescuing her from various perils. Versatile director-cameraman de Witt is most at ease covering the film's soccer matches. <br><br>The production arrives in brownish newly restored four by three, with English sub-titles rendering the poorly re-voiced English dialog.","user":"Mozjoukine","rank":[2,2]},{"title":"South African Actioner","rating":4,"date":"28 August 2017","review":"Let me say up front that I really, really wanted to love this movie. To hear that it was a film shot in South Africa that was banned by the apartheid government made it a film you wanted to watch to find out why. After watching all I could think of was why they found this film to be the least bit subversive.<br><br>The story is fairly simple. A local soccer team, the Eagles, has a chance at winning the championship. The problem is that local gangsters want to make sure they don't, going so far as to murder their coach. With the police no help they turn to the only man who can save them, Joe Bullet (Ken Gampu).<br><br>A sort of combination of Superfly, Shaft and Superman, Bullet is someone who knows how to deal with mobsters. In addition to becoming a protector for the team he also becomes their trainer, making sure they stay in tip top shape. With his expert martial arts skills and wily ways he will make sure that they not only get to the championship playoffs but win as well.<br><br>But you can't be in all places at all times. Eventually the mobsters kidnap not only two of the best members of the team but Bullet's love interest as well. Never a smart move when it comes to going after a hero. Now Bullet must use all his skills to find the team members and save the girl before the game begins.<br><br>I understand that the budget for this film had to be nearly non-existent but it shows on screen how low it was. Not only that but the locations are not the best looking spots in the world, which doesn't say a lot for South Africa. More dirt is on display here than any movie I can recall. Even the soccer field offers little color to the film.<br><br>The acting isn't much to talk about either. Even Gampu, who had roles in major films like THE NAKED PREY, ZULU DAWN, THE GODS MUST BE CRAZY and KING SOLOMON'S MINES, comes off pretty bad here. He may have known martial arts in real life but what you see on display here leaves much to be desired.<br><br>Still the film received some notoriety due to its ban in South Africa. That alone makes it a film worth at least taking a glance at. And honestly there are much worse films out there (look for my write up on THE CREEPING TERROR soon). Action fans might enjoy a few moments here and those who love to take a look at world cinema will find something to watch. As for most the odds are you won't enjoy it.","user":"kirbylee70-599-526179","rank":[1,1]}]