[{"title":"Great atmosphere and sense of period","rating":7,"date":"7 October 2015","review":"I saw this at my local film society (its first public showing in Kent, where it was made). I thought it was pretty good by any standards (and not just \"pretty good for a film that only cost £520,000\").<br><br>If you're expecting state of the art special effects and CGI and an extended gore-fest, you'll be disappointed, but it's highly watchable, engaging, sometimes funny and made me jump more than once! <br><br>In a Q+A afterwards, the director and the director of photography admitted they had had the same problem that a lot of creature feature makers have - the creature never looks as convincing on screen as you had hoped (we all remember the rubber-looking shark in Jaws!). As a result, their creature is only briefly on screen but its presence and menace are still felt.<br><br>All the actors give a good performance but I'd maybe highlight Shaun Dooley as Calhoun, looking like a slightly younger Russell Crowe, and Corey Johnson as Hank.<br><br>I'm not a big horror genre fan myself - if you are, you might find yourself insufficiently scared - but Blood Moon still stands as a well-made indie film. It benefits from having been shot in Laredo, a Western town in the UK recreated by a group of re-enactors - the period detail throughout is much more than skin deep and it's a convincing enough location to have fooled many people into believing it was shot State-side.<br><br>It's done pretty well on the festival circuit and, as the first British-made Western since \"Carry on Cowboy\" in 1965 (reputedly), I think it deserves watching.","user":"greg-gillet","rank":[16,19]},{"title":"Community Theater at its Worst","rating":4,"date":"1 September 2015","review":"\"Blood Moon\" is a movie about the legend of the Native American skinwalker. This interested me because of the setting: the American Old West complete with bank robbers and varmits. <br><br>Seems a certain town in the middle-of-nowhere-Colorado is losing its population. What is strange is the killings are only happening on-- you guessed it--the night of the blood moon. Methinks thar's a beast in them thar woods, but I digress.<br><br>This is the second movie I have watched where NOTHING seemed realistic. In fact, this reminded me of a play being performed, albeit a bad play. The opening scene looked so \"staged\" it actually lacked authenticity. All the actors were stiff and unconvincing. Another reviewer talked about how the lack of using CGI really made the movie convincing. I don't usually disagree, but this movie (and especially the creature) could have used something. And some of the \"plot\" never made sense.<br><br>This version was unrated for violence and language.","user":"dcarsonhagy","rank":[11,14]},{"title":"Plenty of boring chatters, some cheesy gunslinging action and barely any of the horror.","rating":3,"date":"14 September 2015","review":"The poster or synopsis can be misleading, at first glance Blood Moon is a supernatural movie set in wild west. Unfortunately, it's not much more than bantering between random cowboy and thug cliché, as for the supposed werewolf, or skinwalker in this case, it only appears in a fragment of the runtime. This leaves audience with mundane subpar western B-movie action at best.<br><br>What could be a unique premise unfortunately ends up with barren showing, majority of the characters are plain and lacking any presence. The movie tries to introduce many personalities, such as the young journalist, the usual mysterious gunman, enigmatic shaman and the unlawful hooligans. However, they are not fully fleshed out and the choppy acting makes it hard to invest on any of them, thus making the many subplots even more tedious.<br><br>At times it almost looks like they are just random people in period reenactment rather than actual cast for a movie. This takes away from the supernatural angle as well, which is incredibly disappointing considering it takes nearly an hour to build-up on the creature's backstory. The characters hype it with oversaturated fire camp stories about this ominous being for two third of the movie.<br><br>The most decent thing here is its practical effect, the gore looks intimidating and quite eerie. Still, the skinwalker deserves much more than a few bloody shots. When it does appear so briefly the movie uses rapid editing and jerky camera. In fact, it does so for almost the entire action sequences to the point of gunshot looking like timid firecrackers.<br><br>With no decent pay-off for its arduously long build-up, Blood Moon is lackluster on both action and horror. Staring at actual moon for an hour and half would be a better use of your time.","user":"quincytheodore","rank":[10,13]}]