[{"title":"Ridiculously bad","rating":1,"date":"21 November 2015","review":"Seriously one of the worst movies ever. Complete screen writing and directorial crap. Battlefield Earth and Roadhouse are SAG Award winners in comparison. Apparently based on a true story, the screenplay focuses for far too long on trying to establish the characters as spoiled, self-indulgent social media obsessed sociopaths without ever offering viewers a single reason to either empathize or despise any of them. If the attempt was to portray the main characters as the real horror of humanity, and their mean-girl personalities as delivering its own type of psychological carnage - the attempt was laughable. Seriously, if you've read this review, you've already wasted too much time and energy on this film.","user":"jsjennshanks","rank":[66,83]},{"title":"Clumsy and Boring","rating":1,"date":"4 April 2016","review":"Let me start by saying that this movie doesn't have anything to do with horror. Nothing. At all.<br><br>Do me a favor: think about the worst horror movie you've ever seen. Done? OK...that movie is \"the scariest thing ever\" compared to #Horror.<br><br>The movie has some killings...but they're all so mild that it's as if there were none.<br><br>The \"social commentary\" underneath the truly dumb and poorly written script of this movie is Cyberbullying. A very serious matter. And maybe too important to be buried under an absolutely awful movie.<br><br>The movie tells the story of 1 day in the life of 6 12-yo girls dealing with different \"issues\" while having a sleepover and the underlying subjects of technology as a way of ignoring others and bad parenting in general.<br><br>The acting is as bad as it gets. Even Timothy Hutton delivers an overacted performance that will make you cry in disgust. 1981 seems so long ago for Mr. Hutton. The other \"renowned\" cast member is Chloë Sevigny, possibly giving her worst performance of her professional career.<br><br>I already said the script was bad. And trust me: it's a complete abomination. Oh, and you can \"predict\" who \"the killer\" is around 50 minutes before the movie ends. And the ending is almost pure garbage. Great, huh?<br><br>The photography has some \"interesting\" aspects here and there.<br><br>And since the movie uses some kind of Facebook-esque video game as an ever present \"entity\" you're forced to watch some truly annoying montage of social media photos with a lot of bright colors and obnoxious sounds throughout the whole movie.<br><br>This is NOT a horror movie nor a drama about Cyberbullying.<br><br>This is just an awful awful movie that will test the limit of boredom a human being can withstand. Stay away from this atrocity!","user":"Orpheus_Unlimited","rank":[24,28]},{"title":"#Horrible","rating":2,"date":"15 December 2015","review":"Holy sh*t you guys, this movie is absolutely terrible, I can't possibly sugar coat that, or make it any simpler to understand. This movie is atrocious. Supposedly inspired by actual events, though the Wikipedia page seems to say that those \"events\" were the fact that the director knew someone affected by cyber-bullying, but I digress, and feel free to send me the real story.<br><br>Now, I recognize that when it comes to movies about bullying, or teens in peril, we are supposed to take them seriously because BULLYING YOU GUIZ, and I'm sure some people will give this movie more credit because of that, but the movie is just fundamentally broken on every front. Writing, acting, editing, production, the whole movie doesn't work, and it was a genuine chore to get through. While some may consider the ending to be \"totally f***cccckkkked upppppp\", there's just nothing there and if there is, it's buried deep under a huge pile of confusion and garbage.<br><br>The first issue I had with this were the actors. The teen girls cast in this movie are awful. Their characters are completely unredeemable and unpleasant, and the performances given from all of them border on being totally unwatchable. We essentially spend the first hour and ten minutes (no, that's not an exaggeration), watching these girls be horrible to each other, and watch their garbage parents be horrible as well. There's not one character in the movie who I had much sympathy or care for. They make attempts to create sympathetic characters, giving some of them ham-fisted back stories regarding suicide or just having them be taunted for their weight. Now, I don't mean to say that teens don't have bad lives, or hard times, or taunt each other, but the way that they are portrayed here creates an insanely unbelievable bunch of human beings. Nothing feels genuine, with the exception of the total and complete obsession with their cellphones.<br><br>On the topic of their cellphones, the girls all seem to be obsessed with the same app, which is some kind of bizarre combination of Candy Crush and Instagram that amounts to a senseless mess that fill the screen with indecipherable nonsense for a third of the running time. This is present immediately in the credits, which are absurdly fast for absolutely no reason, and the faux app just feels cheap and stupid. The kids obsess over this app and you're forced to watch them post on it for 45 excruciating minutes.<br><br>There are a couple of recognizable faces in the movie, primarily Chloe Sevigny (American Horror Story), who I know for a fact can do SO MUCH BETTER THAN THIS. You also get a brief appearance from Taryn Manning (Orange is the New Black), and Natasha Lyonne (Orange is the New Black), who are all fine actors, but they just have nothing to do in this movie. One thing that I will give credit to this movie for, however, is the huge number of female characters that star here. This is such an unfortunately rare thing in horror, and I don't want to discourage a female-fronted film ever. With that said though, the characters and actors in this movie are just wasted on such a weird mess of a film.<br><br>#Horror was the writing/directorial debut of actress Tara Subkoff (The Cell, The Notorious Betty Page), and I say again I love seeing women making horror movies, but this is just a mess from all fronts. Maybe it's just a case of first-time jitters, or something to that effect, but the movie just doesn't work and tries to pull of some bizarre style elements that feel awkward. There's a certain vibe of \"Hello fellow kids\" throughout this whole movie, that you usually see with adults trying to related directly to teenagers without gathering much context.<br><br>Now, there are a couple of genuinely interesting and effective shots in the movie, but that's kind of like saying that an album with one good song on it is a good album. The pieces do not make a cohesive whole, and the movie falls really flat. The shots that work do give me hope for the future, but that could also be due to cinematographer Learan Kahanov, but I'm not familiar enough with their work to really say for sure.<br><br>Yes, bullying is real, yes kids are horrible monsters to each other, regardless of all that, this movie really sucks. Give it a hard pass.","user":"TheBarleyGuy","rank":[41,52]}]