[{"title":"It's never too late to fall in love","rating":10,"date":"14 October 2015","review":"Best Day Ever doesn't start in the best of moods. David (Mel England) is arriving at 50 years old, and doesn't seem to have too many reasons to be content. He lives in the house of his boyfriend, someone that simply can't say that he's in love with him. His life is a mess. Being an independent film maker, he hasn't 'break through'. Although doing something he loves to do, everybody seems to advise him to leave the activity, starting something new. At fifty, he doesn't seem too much encouraged to doing so, and making films, despite the difficulties, is what he likes to do, alas! Then things start to grow better, as soon as he decides to make some changes in his life. He has some supportive friends, one of them much older than himself, who encourages him. And so thins go on, until he realizes that's he may be living his best days ever. Watch the film, I fell you won't get disappointed; at least if you're getting to some middle age crisis, as I do (I'm 57). The film leaves you with the impression that it's never too late to pursue your dreams, once you find the right persons to be with. It is somewhat different of the torrent of films we see about people in their twenties of thirties, who seem to have so much ahead of them, but it's a relieve.","user":"larapha","rank":[10,13]},{"title":"Wonderful romantic film!","rating":10,"date":"16 September 2015","review":"BEST DAY EVER\" is a sweet, hopeful, and romantic film about finding love at 50. Congratulations to writer Jeff London, and the wonderful actor Mel England, who plays David, a man going through a mid-life crisis. Will he ever find true love and fulfill his romantic and career dreams when he feels time is running out? <br><br>The film, based on writer and director Jeff London's own life, is a story about falling in love with a younger man, and the doubts created by the age difference.<br><br>The lead actor Mel England gives a lovely, nuanced and brilliant performance, and the entire cast is wonderful as well. This is a great independent film.","user":"wendycharles1","rank":[13,18]},{"title":"A powerful and poignant film .. Mel England is stellar in the lead role","rating":10,"date":"12 March 2015","review":"I was skeptical about watching this movie at first.... Considering I'm going through what I believe is a mid - life crisis .. Did I want to watch a movie about someone's similar fate .? And being a straight man could I relate to a Gay mans experience .? Well Am I sure glad I put those worries to rest and watched Best Day Ever..!!!! Powerful and poignant are the first 2 words to come to mind after watching it ... Getting older is universal , all races,creeds , sexual orientations ,everyone grows old , there are no exceptions..... And Best Day Ever handles this truthfully and beautifully .,!! Mel England is the actor who anchors the film , he is stellar .! There is not a false note in his performance and the supporting players all do fine work ..!! This film gave me hope , and the world we live in , that is rare.....","user":"jbale-54380","rank":[18,30]}]