[{"title":"A simple and yet superb disaster movie","rating":7,"date":"13 December 2015","review":"What does it take to make a good disaster movie? Good F/X?, Complex storyline?, intricate scenes?, massive destruction?... nothing of the sort.<br><br>Good buildup and nice character development, that's it.<br><br>That's what this movie is all about. A simple story, yet, very powerful in the way it was made.<br><br>From the first 10 minutes you'll get the point, this is gonna be a movie focused on our characters, this are people living a simple life, yet, full of good intentions and surrounded by good company in a small town with an incredible scenery and this is gonna be a movie about them, having to deal with a disaster none expects. The disaster it's there as a test to their resolve, not as the main attraction of the movie, be aware of that before watching it.<br><br>The story unfolds at slow pace but with impeccable character development and directing, to match this we have a superb soundtrack that it's not excessive nor subtle and always, to the point.<br><br>Our main hero is very lovable and yet, honest and simple. If you're expecting a super-hero like San Andreas, you'll be sorely disappointed, yet, if you think what would you do if a massive wave hits your town, you will feel identified with our main lead here.<br><br>I love disaster movies and this is one of them, It never lost my interest. The movie ends as it starts, simple and yet, highly enjoyable due to being superbly directed through and through.<br><br>If you're fond of disaster movies which puts their characters in the first place, without super excessive heroic scenes and a believable script, you must see this one, you'll be surprised.<br><br>This IS the anti-Hollywood of disaster movies, thanks good for that!","user":"tecnogaming","rank":[108,121]},{"title":"Predictable, Yet Highly Engaging (Fantastic Fest 2015)","rating":8,"date":"29 September 2015","review":"Just caught this film in Austin during Fantastic Fest and had a blast. I've never seen a Norwegian movie before and I went in blind to this one.<br><br>The moderator introduced it as a \"movie that would make Roland Emmerich cum his pants\", and while it's not exactly on the same level as, say, Independence Day or 2012, the film is an absolute destructive experience that packs a punch. The premise, which is honestly quite simple, revolves around a geologist that begins to sense that something is awry when a mountain over a small town begins to give off strange activity in its movement. By the time he warns everybody, it's too late.<br><br>The film borrows from plenty of Hollywood clichés, but what it does well is build its suspense. Normally there would be a few action set pieces preceding the real climax, but this film takes its time to build the tension and it does so masterfully. There's an emotional connection to the lead and his family, and from the moment he senses that something is wrong, you want him and those that he loves to get out of town safely.<br><br>There's nothing new about the story or with the characters, but it's an impressive feat with dazzling cinematography and a pulsating score. I'd highly recommend checking it out if you're looking to be entertained.","user":"LordofStorm","rank":[98,113]},{"title":"Better Than \"San Andreas\"","rating":4,"date":"4 March 2016","review":"This is a Norwegian movie with English subtitles.<br><br>\"The Wave\" is better because it is on a more believable scale. Yes, there are clichés: one scientist no one will believe, birds flying from danger, the hero rescuing his family against incredible odds. People whose job is to monitor the geological causes of the wave can only watch their computer screens in helpless silence.<br><br>Still, it was well acted and the special effects were good, especially considering the low budget. The aftermath was typical post apocalyptic with stunned survivors unable to believe what happened. Our hero's family is reunited and closing credits remind us of how close this is to actually happening.<br><br>It DID happen to a part of Norway in 1906.","user":"cloud_nine","rank":[28,32]}]