[{"title":"A lot better than the standard LMN fare","rating":8,"date":"7 April 2015","review":"I usually just sit in my chair playing games while my wife watches the Lifetime movies, but something about this one grabbed my attention. Okay, maybe it's the fact that Cassie Scerbo is intensely attractive. I had to look her up to make sure she was legal. Whew. Even when her character was in high school, the clothes she wore made my head spin. I'm not going to ruin the plot for you, but she plays a reluctant prostitute trying to make her life better and ends up living someone else s life. I never really care about these movies, but the ending had me tearing up. BTW, the woman who played her aunt was incredible, playing the guilt of her character while also the fragility of hope and affection she was feeling for the main character.","user":"rightisright","rank":[14,17]},{"title":"I cried","rating":7,"date":"1 April 2017","review":"I really like Cassandra so maybe that's why I liked the movie more. I don't know. It is definitely a bit sappy but I like sappy. By the end I was crying like a wiener. It is hard to write a review when you don't want to spoil anything. Okay I didn't find her role as a prostitute overly believable but boy did she look hot. LOL And I'm a girl that isn't into girls.","user":"crazy_smilers","rank":[6,8]},{"title":"Heartwarming and inspirational","rating":7,"date":"24 September 2019","review":"This made for TV movie is so much better than most of the so called Hollywood produced grade 1 films that have made it to the big screen. The lead actress Cassandra Scerbo, who plays Brittany a reformed streetwalker who witnesses her pimp murder her girlfriend decides to hide from the murdering pimp by assuming her dead friends identity. Cassandra Scerbo is a natural and she plays both parts to perfection as the streetwalker in hiding, as well as the long lost niece of the couple that takes her in under her assumed identity with many secrets.<br><br>As Brittany struggles living a big lie whilst her assumed Aunt and Uncle have no idea she is faking their (dead) real niece's identity, Brittany is showered with the love of family for the first time, and she also has a smart high school boy named Zach show great interest in getting to know the \"real\" Brittany better.<br><br>Meanwhile Brittany's former pimp knows he has to find her and shut her up forever as she witnessed him murder the real Chelsea. The acting in this made for TV was superb and the ending is heartwarming and sure to provide much needed encouragement to any young girls who are struggling on the streets alone.<br><br>Kudos for a well done dramatic film. I give it a 7 out of 10 rating.","user":"Ed-Shullivan","rank":[2,2]}]