[{"title":"You should be scared","rating":4,"date":"7 January 2018","review":"In the opening scene we see young Amish boy Amos take an axe to everyone after going into the forest. Young Jacob witnessed the event. Years later Jake and his family go to Amish country as a get-away which doesn't work out too well. The forest has an evil that calls to people at the solstice.<br><br>After the opening scene, the film was all boring drama with Amish, as cute as puppies, providing the scare factor. Dramatic scenes with intense music include a doll half floating in a pond. It isn't until the last 5 minutes of the film that it becomes exciting and by that time I was already bored and didn't like the title \"The Harvesting\" because it gave away too much.<br><br>No swearing sex or nudity. If you like made for TV drama-horrors, this one has the same feel.","user":"nogodnomasters","rank":[4,5]},{"title":"Eerie Creepy Flick","rating":7,"date":"31 July 2016","review":"I like this movie, I wouldn't call it a traditional horror film but it is really eerie though. The movie was shot exceptionally well, it doesn't look like a low budget movie. There were some really beautiful sweeping shots of Amish country, which was the perfect setting for such a creepy tale. I didn't jump out of my seat, which is fine by me because I hate those types of cheap scares. There was definitely some stand out acting performances as well – I thought the kids were great. There is one scene with the little girl that has really stayed with me - totally creepy. The father character was good too, and then there was all of the Amish characters, they were good and they looked spot on.","user":"andrea_martin","rank":[7,11]},{"title":"Decent 'folk horror.'","rating":6,"date":"13 October 2018","review":"After a prologue that is almost sunk by some uncertain acting, the film proper begins with Dinah (Elena Caruso) and Jake (Chris Conner) attempting to patch up their marriage by moving to Amish country. Inevitably, they bring with them their two young children. But worry not - no petulant brats here: Steven (Noah Headley) and Michaela (Accalia Quintana) are appealing, especially the little girl, whose genuine delight about the wide open spaces in their new home becomes something else entirely as the story moves on.<br><br>This low budget feature is, however, possibly too restrained in its imagery. Happy to be creepy rather than terrifying, that's fair enough - Director Ivan Kraljevic at least resists the monotony of constant jump-scares few films feel they could do without.<br><br>What we have is an enjoyable slow-burner that dips more than one toe into the 'folk horror' category. The nature of the horror, together with the location and the family's new neighbours provide a different spin on things. This, together with genuinely sympathetic characters, makes a superficially tame production worth seeing.","user":"parry_na","rank":[2,2]}]