[{"title":"The good kind of weird","rating":3,"date":"13 November 2015","review":"The first part of the movie is pretty neat and weird. With it's own dark atmosphere which is great and entertaining, stands out in the crowd. But it goes south really fast. In the half way through the movie and the fun and eerie part becomes collage-grade-bad-special-effects slasher flick in the dorms. What a loss.<br><br>I don't understand where's the need to do the same thing that everyone in the horror film industry has already done before. If you don't have the budget stick to the story. If you have no story entertain with good effects. They had such a good beginning with pure weirdness that temps you to take a shower after watching this - and that is rare find these days.","user":"freakart","rank":[21,24]},{"title":"Come on, it's not THAT bad!","rating":5,"date":"7 April 2016","review":"I've seen some ridiculously bad movies in the past (some were so bad that they got me pretty angry,) but this isn't one of them. I'm not saying it's good either though.<br><br>First thing I'd like to mention: I hear a lot of people comparing this movie to 'REC' and its American remake 'Quarantine'. (One reviewer even went as far to say that it was almost as bad as 'The Sand'; a movie I felt was quite charming and at times admittedly nonsensical, but still good. I digress...) I feel 'Condemned' has more in common with David Cronenberg's deeply disturbing 1975 film, 'Shivers'; that and movies like 'The Driller Killer', 'Street Trash', and almost anything from Troma Entertainment.<br><br>The special effects and makeup weren't bad, and I found the bizarre residents and their eventual changes to be amusing (albeit gross). Other than that, the lighting wasn't that great at times, characters, dialogue and scenes needed some more development, and there needed to be some explanation for some of the stuff that happened.<br><br>If I could, I'd give this film a 5.5 out of 10. If you're easily squeamish, don't bother watching it. If not and you're into any of the movies I mentioned, you might enjoy seeing it just once.","user":"fsarbolaez","rank":[4,4]},{"title":"Not nearly as bad as IMDb consensus has it","rating":7,"date":"21 November 2015","review":"This is a very well shot horror comedy with a nice sense of the absurd. The cinematography is far above average. The story is standard zombie pap, but delivered with an atmosphere that catches a certain fancy, rewards attention to detail, and reminded me of \"Rec\" (the original Spanish version 2007,) and Dan O'Bannon's \"The Return of the Living Dead \" (1985.)<br><br>I didn't realize, until I checked out the IMDb page after watching the movie, that the lead girl was Sean Penn's daughter. She was pretty impressive... attractive in a tough sort of way... kind of ugly-cute like her father. She most certainly grasped my attention and delivered a compelling performance.<br><br>This is not a bad film.(Of course, it's not a great film,) But it is well worth a watch. It has a definite grounded attitude, sense of the absurd, and a cool, (but admittedly gross,) visual style. It well deserves at least double the 3.5 rating in its IDMB main page.","user":"hulakan","rank":[14,23]}]