[{"title":"Below average zombie comedy...","rating":4,"date":"24 June 2014","review":"Anything zombie and I am there. And this particular movie wasn't really all that great. But by The Asylum's usual standards, then it was actually a step up the ladder.<br><br>\"The Coed and the Zombie Stoner\" seemed to borrow a little bit too much from \"Warm Bodies\", whether intentional or by random sheer luck, I have no idea. But it was also mixed in with some fairly average standard teenage college comedy. The end result, well it could have been better. And speaking of borrowing things, then the whole '28 days earlier' segment was actually one of the brighter moments in the movie, as it was a clear spoof on \"28 Days Later\".<br><br>The storyline was adequate, but just don't expect the movie to challenge your intellect in any possible way. This is the type of movie you just sit back and switch off your brain to while watching.<br><br>One of the flaws of the movie were the cast and their acting. It wasn't particularly great in any way, nor was it particularly convincing most of the time. And that made the movie suffer a terrible blow.<br><br>For zombie aficionados, then there is very little good stuff to find here. The zombies are mere people with basic make-up added, don't expect decayed shambling corpses or corpses with missing limbs, you will just be sorely disappointed.<br><br>There was a little bit of gore throughout the movie, and it was used in a good enough way for a comedy such as this. And while speaking of comedy, then there were awfully few times throughout the movie that I was laughing, or even just smiling for that matter.<br><br>While \"The Coed and the Zombie Stoner\" is hardly a noteworthy addition to the collection of any zombie fan, do take note that there are far worse and less entertaining zombie movies on the market that actually try to pass as proper zombie movies in the horror/action genre. \"The Coed and the Zombie Stoner\" is the type of movie that you watch one, and never make a return trip to.<br><br>And do take notice that there is a fair amount of unnecessary nudity throughout the movie. So if you are offended by such, consider this a friendly heads up warning.<br><br>\"The Coed and the Zombie Stoner\" scores a mere 4 out of 10 stars from me.","user":"paul_haakonsen","rank":[19,27]},{"title":"Boobs, Zombies, Boobs, Nude Girls and more Boobs ;)","rating":5,"date":"14 July 2014","review":"I have to say i find movies by The Asylum are kinda amusing and for the budget they use they do OK. They have made some decent zombie movies too, but this was unexpected, not the usual Asylum movie, it worked and seems to be one of their higher rated movies so far.<br><br>The Asylum tend to mostly make their own straight to DVD version of the latest potential blockbusters usually with a budget of less than $1,000,000 and normally get their money back within a few months with channels like the Sy-Fy channel buying their stuff and of course the DVD sales.<br><br>The movie was reasonably funny, none of their usual cheesy effects, cute characters...thought the guys are dorks, with some references to other zombie movies like the flash back called 28 days earlier and a cat called Romero. ;) The lead actress is good and cute, there is some mild gore, the zombies are not your usual zombies, they are a bit lame at times and there is plenty of young female skin...if you like that sort of thing ;) (Movie starts with 2 full frontal girls and plenty of boobs to follow and more).<br><br>Anyway the story is a sorority girl who seems a bit of a nerd, starts dating a zombie....jeez she could do much better, she's hot. ;) but thankfully a zombie apocalypse breaks out and its up to our nerdy girl to save the day when she discovers a cure.<br><br>Another movie added to my ever growing list of Zombie movies... 646 titles and counting lol.<br><br>BTW nothing wrong with running zombies, if they are recently infected and not too damage then why can't they run? :p","user":"brooke_gaylene","rank":[13,19]},{"title":"Very lame often, but also has some good moments","rating":5,"date":"17 July 2014","review":"The good news is, The Coed and the Zombie Stoner is not an irredeemable movie by all means. It at least knows what it is and what it's trying to do and be, which is always a good thing after seeing many movies recently that don't. It's very silly, but there is a simple sense of fun and charm when it doesn't get too random, at least there aren't any awkward tone shifts or a completely-different-movie feel. There were some fairly neat touches, notably the 28 Days Earlier on-screen caption(not an original one but will raise a smile) and one external review talks of Rigo's hand wiggling reminding them of Wallace and Gromit and I agree with that. Grant O'Connell is engaging and pretty likable, the best actor in the cast and Rigo is the only character we get close to caring for. The production values are not great, neither are they amateurish. Coed and the Zombie Stoner does have its fair share of problems. A lot of the script apart from some endearingly silly parts does feel and sound like a rough draft and really could have done with a few more re-writes. The story gets off to a very slow and dull first 15 minutes and while the pace picks up and there are signs of a story(and one that feels like the movie knows who it's aimed at) the structure often does feel too random and chaotic, with its fair share of repetition too; there is also some inoffensive nudity and the like that wasn't cheap as such but you did wish they toned down a bit. Apart from O'Connell the acting while eager does scream of inexperience, Catherine Annette is a very pretty girl but her constant talking/yapping got very annoying after a while. And of the characters the only one that is close to being developed is Rigo, most of them were very cardboard and others like Chrissy got on my nerves. The direction also shows some inexperience but there were glimpses of potential so it was not a hack job. The music has some nice moments but was a bit too constant and repetitive in other spots. Overall, neither a good or terrible movie, aspects are lame while other aspects were reasonable. 5/10, though in honesty the movie was not an easy one to rate without being too harsh or generous. Bethany Cox","user":"TheLittleSongbird","rank":[8,12]}]