[{"title":"Monkeys and Sri Lanka -- What could be better?","rating":10,"date":"18 April 2015","review":"This is the latest of the DisneyNature films and it retains the finest qualities of the previous features: amazing photography, stirring music, and enjoyable narration. Ms. Fey does a brilliant job with the script -- we laughed at all the appropriate points (and there are many). But I found myself laughing at even more points because of the wonderful, comical display of macaques being macaques. There are crises as well as tender moments but the food hunting scenes were especially wonderful.<br><br>If you are familiar with DisneyNature films, you know that the credits at the end are an integral part of enjoying the film. This feature is no exception. It is a rare film when I wish the credit roll were twice as long as they are, but this is one of those films. A brilliant addition to the series. It makes you proud to be part of this amazing pageant that is life on Earth. The filmmakers are deserving as much as the good causes that the film series contributes to.","user":"AllisonRoad","rank":[28,32]},{"title":"\"Monkey Kingdom\" is a creative, fun, interesting and wonderful piece of filmmaking!","rating":9,"date":"19 April 2015","review":"Life can be tough if you weren't born to privilege. You know and understand your place in society, but wish it were higher. You try in vain to be accepted by your betters. You see no way to improve your lot in life and all you can do is watch others enjoy the fruits of their vaunted positions, and serve them. Sufficient food and shelter are hard to come by, but you make the best of the situation. You're disregarded and sometimes outright disrespected. You might not even be free to enjoy the company and comfort of the life partner of your choice. If you become a single parent, you may find yourself even more alone than when you just had yourself to be concerned with. And this whole time, you also have to worry about those outside your society taking your food, your home, your family, even your life, knowing that your only defense is those above you who treat you with such disdain. Yes, it can be really tough being a monkey in the jungles of Sri Lanka.<br><br>\"Monkey Kingdom\" (G, 1:20) is the eighth feature film from Disneynature and tells the story of Maya, a female toque macaque (pronounced \"muh-KAK\") who finds herself in the exact situation described above. She was born at the bottom of her group's social ladder. She has to watch her fellows in the tree branches above her eat fruits and flowers, while she is forced to scavenge what she can, including the scraps which fall to the jungle floor. She watches the other monkeys play in the tower of boulders called \"Castle Rock\", knowing that trying to interact with them would lead to an attack by her own kind. When it rains and the higher-born use Castle Rock for shelter, Maya and the other societal cellar dwellers are literally left out in the cold. When a male macaque who has struck out on his own shows an interest in Maya, he is chased off by the others. Maya is left alone and pregnant, with no choice but to fend for herself and her little boy, Kip.<br><br>This being the jungle, there's even more for Maya and her fellow macaques to worry about besides the social order in their kingdom. First off, they have their natural predators to contend with. Steering clear of leopards and seven foot long monitor lizards will always be a priority, as will the search for food. Different seasons yield different edibles in varying amounts. Sometimes the monkeys have to get creative in their search for food, and sometimes (equally creatively), they just steal it from a nearby village. I suppose regular human people could be dangerous to encounter, but we see none of that here. In fact, we see the monkeys interact very amusingly with a variety of animals that are neither predator nor prey, to include an annoyed mongoose, some cute bear cubs and even an easy-going dog. Then again, there's also the danger of losing out on more than some nuts and berries. Castle Rock is prime jungle real estate and could be seen as very tempting by, say, a rival gang of macaques.<br><br>I had no idea that monkeys had such a strict social order. And that's not all that surprised me. I don't want to spoil anything by describing some of the other things I saw monkeys do in this movie, because, unless you're a monkologist (yeah, I just made that up), you're likely to be surprised as well. But there's a lot more to this movie than simply an educational journey through the wilds of an island nation in the Indian Ocean. The movie features magnificent cinematography and editing, along with Tina Fey perfectly narrating a script that is accessible, interesting, clever and fun. Technically, this is a documentary, but it feels much more like a well-planned story, only you can't plan this stuff. There's real drama here, situations to which most people can relate and even a touch of a Disney princess story.<br><br>\"Monkey Kingdom\" is definitely not your grandparents' nature program. This movie is beautiful, thrilling, fun and educational in a way that you'll thoroughly enjoy. I had the pleasure of seeing this movie with three generations of a family with whom I am very close. The youngest member is three years old and was experiencing her very first movie in a theater. This child, who is normally very energetic (choosing my words carefully because my friends will be reading this review), was as happy and calm as I've ever seen her (awake) and, for much of the movie, she was rapt, as was her mother and grandmother, and me. Whether you're 3, 23, 43 or 93, I can hardly imagine anyone of any age not enjoying this wonderful movie. \"A\"","user":"CleveMan66","rank":[20,24]},{"title":"Disney Nature Again Inspires","rating":10,"date":"1 July 2015","review":"Every time one of these Disney Nature films comes out, my wife and I are Johnny on the spot to take our family. The last 2 we saw at the world famous El Capitan theater in Hollywood. This one we saw in the theater here. It was amazing as expected. It presented the idea of a natural order, potentially upset by the underdog. I will give you no spoils as to the outcome. I felt this movie broke away from the convention Disney has used in the past and brought us some inspiration practically applied. It's fitting that Disney, the champion of Princes and Princesses in the movies, challenges that concept. Our family liked that most about the film.<br><br>For a nature film, this movie is perfect in every way. Every family with young children will love it. The incredible architecture of the fallen monument they make their home is spectacular. It's a perfect way to tell a story. I would imagine the recipe for making these things is sort of like: 1) Put cameras everywhere and shoot 2) look for what can be made into a story and 3) Make it into a story. Obviously the monkeys are not actors. Cheap labor right? Wait until the union hears about it. The monkey union? At any rate, there is love, struggle, heartbreak, and all the emotions of families trying to make it. Though the monkey's nature is a different house than ours, it doesn't take much imagination to see the connections to being a human in our society. This one's a winner. I give it 5/5.","user":"RileyOnFilm","rank":[13,15]}]