[{"title":"its nothing","rating":2,"date":"3 March 2019","review":"To be honest, this was not funny at all, its a whole lot of planning to make a trip that never happens. i didnt laugh and barely made a grin of a smile on my old grumpy face, so beware its not fun....<br><br>its made on low budget, the focus puller knows his work but thats about it. the lack of good music makes it even worse to watch, so when it comes to the acting its barely on average. the main female actress though, has a very charming glow,and some of the dark brownest eyes ive seen for long, so i hope she will appear in further productions, though with a better story and plot.<br><br>im sunday morning grumpy so its not recommended.","user":"ops-52535","rank":[22,38]},{"title":"Pretty Broken is a must see film: Dr's orders!","rating":10,"date":"27 May 2019","review":"This film is quite simply an amazing example of what brilliant writing, directing and acting can achieve on a film that relies on a powerful, human interest story. Lindsay Lou and her family are at once endearing and compelling as individuals struggling to make sense out of tragedy. As a psychologist, I see the fallout from loss regularly in my practice and the way in which loved ones cope with it. Instead of accepting and grieving, we see Lindsay embark on a mission to make sure that she has done everything possible to find out her fathers' true fate. It's a mission that pulls you in deftly and you can't help but root for her. If you look deep into her character, what's revealed is a young woman who consciously acts on her beliefs but their is a subtle realization that she may be just coping with denial. It's okay though as Lindsay has to know that she has done what she could. I personally love films that rely on the strength of the story and don't really care for bells and whistles. 'Pretty Broken' is a warm , heartfelt film that very carefully navigates the issue of loss in a family that sooner or later every family deals with. Bravo!","user":"dradamse","rank":[4,6]},{"title":"Not a masterpiece but certainly not a stinker.","rating":6,"date":"16 March 2019","review":"For once I don't agree with my wife about the rating of a movie. Most of the time we have the same taste and ratings but in this case I liked it more than my wife. Pretty Broken is a low budget movie, so no spectacular scenes or big names in this movie, but instead actors that did a pretty good job to make Pretty Bones worth watching once. Not that I will watch it again in the future but I certainly didn't regret watching it this time. Some reviewers scored it a ten, and that's ridiculous, as are the reviewers that scored it the lowest possible score. Pretty Broken is easy to watch, nothing difficult to understand, a story that is entertaining, maybe not with alot of action but that's not what you expect when watching a movie in this genre.","user":"deloudelouvain","rank":[5,10]}]