[{"title":"Phantasm Ravager: Not the most fitting sendoff","rating":5,"date":"1 May 2018","review":"It's hard to believe that the Phantasm series started back in 1979 and sporadically released it's 5 movies across the decades.<br><br>What's even harder to believe is that every major player from the franchise has stuck through it and is right here in 2016 for the final chapter.<br><br>Reggie returns one last time to reunite with his friends, fight the forces of evil and go toe to toe with the Tall Man for the ultimate confrontation.<br><br>Now I don't think that the Phantasm franchise is that great, I think they are original titles and I applaud them for lasting as long as they have but they've tended to be confusing disconnected movies.<br><br>Alas this is no different, in fact I have to say it's the most confusing of them all. Regardless it's a nostalgia trip, everyones along for the ride including the films original creators.<br><br>Though the sfx are ropey and the plot makes very little sense Ravager isn't that bad, it's just not a fitting finale for a series that has lasted this long! What makes it worse is that the highly ambiguous finale does it no favours.<br><br>I'd say this is essential viewing for fans of the series but all things considered it should have been considerably better.<br><br>RIP Angus Scrimm<br><br>The Good:<br><br>Nostalgia filled<br><br>Some new and interesting ideas<br><br>The Bad:<br><br>Plot isn't great<br><br>Pacing is a bit of a mess<br><br>Finale is terrible<br><br>Things I Learnt From This Movie:<br><br>Reggie Bannister is immortal<br><br>When a franchises sfx haven't improved since the 1970's you need to have serious words with your sfx guys","user":"Platypuschow","rank":[15,20]},{"title":"Great new installment for fans following the whole arc of the series","rating":10,"date":"2 October 2016","review":"I've now seen it twice and I really loved Ravager. Yes, it was made with modest resources, and that is visible, but it accomplishes all of the important things a film in this series should accomplish. It explores a story about how fear manifests when faced with terribly difficult realities.<br><br>I love how the first film is about a young person coping with the deaths of their family, and Ravager is about an aging person coping with the loss of their memories as they face death. I love that full-circle, complementary nature of it. Without spoiling, I love that the Tall Man undergoes a real kind of transformation in it. In fact, it might be the most humanistic film in the whole series.<br><br>I just really think the movie was made with real care and understanding of the heart of Phantasm. I'd much rather see a low- budget film that really gets it, than a higher-budget film that doesn't.<br><br>So, in summary, Ravager is totally in the spirit of the films and gives tons to think about. If you're watching it and just griping about CGI, you're probably not watching Phantasm for what I consider the right reasons. This is really a film for people who love the first four films, and for us, it is a solid, sentimental payoff. <br><br>I really appreciated all four previous films and now I love the fifth as well.<br><br>And if you're writing a review that treats the series as literal narrative, and you are complaining that your literal narrative questions were not answered, please back away from the Phantasm movies slowly, because you are likely to trip over your own shoelaces.","user":"MichaelJEpstein","rank":[59,94]},{"title":"A Disgraceful End to One of the Most Unique Horror Series of the 20th Century","rating":1,"date":"31 December 2016","review":"PHANTASM: RAVAGER is perhaps the most disappointing and horrifically executed follow-up in a film series since TROLL 2, a declaration I only wish was hyperbolic. It almost single-handedly unravels all the value and merit gathered from the previous installments and it does so with almost neolithic incompetence.<br><br>While we all knew that RAVAGER was the least-capitalized of the series, it's shocking at how poorly made it is, especially considering what Don Coscarelli was able to do with a comparable budget 37 years earlier. The film has all the production value of a SyFy Channel Asylum monster movie (complete with unprocessed production audio), and with even less narrative cohesion. The script is cringe-inducingly bad, with little-to-no plot or agenda beyond wanting the viewer to question how much of Reggie's reality is real, and the dialogue is almost a parody of bad movies done without irony. The actors, many of whom have had decades of experience under their belt, behave as if they're in their first student film, and every performance looks so horrifically under-rehearsed that it feels like they're reading their lines off of cue cards taped to the other actors' heads.<br><br>It's also the least consistent with the style of the rest of the series, and the film opens with a recap introduction that was so inept that I thought it was tacked on by an executive producer. And so many stretches of the movie involve the characters wandering around a desert simply to pad time with a free location. To put it another way: I've waited 18 years to see this film and I actually fast-forwarded through certain scenes simply to see if they were going somewhere or to bypass the sheer ineptitude of the filmmaking. That's how bad this film can be. I have seen fan films on YouTube made for pocket change that showed more talent, creativity, and cinematography than this.<br><br>I suspect that all this may have been done on purpose to ensure that no one would ask for another film (rendered moot since Angus Scrimm has now passed on), as Coscarelli has expressed a desire to move on from PHANTASM films. It would have been better for all if Coscarelli had simply loaned out the film to screenwriters who wanted to take a whack at it instead of wasting decades until he came up with an idea. As it is, we've now lost so many potential sequels and have to suffer the indignity of this entry as its finale. The lack of any talent on display in this film is almost an insult to fans of what was one of the most unique and beloved horror film series of the century.<br><br>RAVAGER is for completists only, and even then...I pity them for what they have to endure.","user":"amnesiac12001","rank":[45,70]}]