[{"title":"Interesting and engaging","rating":8,"date":"23 April 2016","review":"This is a filmed version of a diary kept by a Union soldier who escaped from a Confederate prison camp in South Carolina and tried to make his way up North to freedom. It takes place in 1864. Along the way he encounters slaves, plantation owners, and Confederate soldiers.<br><br>The photograph, sets, and music are all wonderful. The acting is pretty good too, and for the most part, the actors manage to capture the nuances of the time. My only real complaint is that for survivors of Andersonville, these guys look much too healthy. Better makeup would have made for a more convincing story.<br><br>Fans of the Civil War will be particularly interested in this film but it has a wider appeal as well. The vignettes really portray the nature of the times.","user":"drjgardner","rank":[9,11]},{"title":"\"Union Bound\" is bound to disappoint all but the most fervent and least discerning Civil War buffs.","rating":3,"date":"24 April 2016","review":"\"Union Bound\" (PG-13, 1:43) is a biopic based on the unique and surprising experiences of Joseph Hoover. What? Never heard of him?? Well, he wasn't an inventor or an entertainer or a politician, but he did have one of the most important jobs on the planet – soldier – and during one of the most pivotal periods in U.S. history – the Civil War. He wasn't a general – \"just\" a sergeant – but he has a one-of-a-kind story to tell. (Tell? Present tense?) No, Hoover isn't still alive telling old war stories, but his diaries survive. They were rediscovered and fully transcribed for the first time by relatives four generations removed from Hoover, but they tell a story that will probably be new to even most Civil War buffs.<br><br>As the movie opens, Union Army Sergeant Joseph Hoover (Sean Stone, son of writer-director-producer Oliver Stone and a veteran of several of his dad's films) has already had his fill of suffering and death, but there's more of both ahead for this war-weary warrior. After having been captured at the especially bloody Battle of the Wilderness and surviving four months at Georgia's infamous Andersonville prisoner-of-war camp, he's on a train heading for a new camp near Florence, South Carolina. On the train, Hoover and a very young soldier (Christian Fortune), captured with him in Virginia, meet fellow Union POW and self-described gambler Tom Ryan (Randy Wayne). All three share a small tent in the camp, which is still under construction. They soon hatch a plan to take advantage of the camp's incompletion to escape.<br><br>Of course, making it away from the camp's guards without getting shot as a \"runner\" is only the first challenge. With no weapons, no food and no knowledge of the land, true freedom is far from a fait accompli. They come across a plantation and, out of desperation, approach some of the slaves and ask for help. Not only do the escapees get some food, but these are just the first of a number of slaves who aid their escape, most remarkably, a slave named Joe (Tank Jones) who actually escapes with them and stays with the POWs for at least part of their journey. The men eventually link up with the Underground Railroad, which was unaccustomed to helping white people escape, but they did help these Soldiers. It's an ironic twist on history – and a challenge to the perceptions the characters hold towards each other.<br><br>Gosh, I wish \"Union Bound\" were better than it is. As someone who is very interested in history, I love learning, and as a movie reviewer, I love original stories. This movie has both going for it but not much else. Obviously, making a movie out of Joseph Hoover's diaries requires the addition of significant detail and dialog, but that's where the movie's problems begin. Screenwriter John Errington does a good job of filling in the diaries' sparse account of events with interesting details and plot points, some of which make for pretty good twists. Much of Errington's dialog is smart and insightful, but it alternates with simplistic and even silly lines.<br><br>I was also very distracted by the relatively good condition and cleanliness of the characters' clothing, as compared to how they would appear had they actually been worn by a soldier, a POW, a fugitive or a slave. I also found the battle scene and other fight scenes to be remarkably bloodless, the film as a whole to have surprisingly little violence (given the subject matter) and the camera work and editing strangely detached and sorely lacking in intimacy. I might have been able to look past more of these problems if the performances had been better.<br><br>The acting is only serviceable at best, and sub-par at worst. A stronger cast and more attention to detail could have made all the difference. I'm afraid that I have to lay most of this at the feet of director Harvey Lowry, whose job it is to insist on higher quality work from his fellow film industry professionals – and from himself. What we Movie Fans are left with is an unusual and interesting story, which could have been an excellent movie in more capable hands. \"C\"","user":"dave-mcclain","rank":[9,12]},{"title":"Good Story on a Shoestring Budget: Union Bound","rating":6,"date":"26 December 2018","review":"This film has problems; some of them severe. Production values would probably head the list. The film appeared to be made for less than $50,000. Obvious use of re-inactment ceremonies by various Civil War groups who trot out once a year to do fake battle were pretty much what this film used. That didnt cost a thing, except for the cameraman and editing. The B actors worked for scale, I am sure, and the story, although interesting, was not strong enough to overcome some lulls in the action and dialogue. The dialogue, most of the time, was not too bad. Some of the secondary characters were obviously first-time actors (or at least I hope they were). It appeared as if several community play groups may have been involved as well. The two primary buddy actors, Ryan and Young, were not too bad, but at times, the dialogue was stilted. Not a bad story, but could have been better with a few more dollars spent on it.","user":"arthur_tafero","rank":[2,2]}]