[{"title":"Floating theories and rehashing stories...","rating":4,"date":"15 November 2017","review":"During the fall of 1978 in New York City, in the six weeks or so that British punker Sid Vicious and American girlfriend-turned-manager Nancy Spungen lived in the Chelsea Hotel after leaving England, nothing much happened. They had to switch rooms one time because of a smoldering mattress; they went on the Methadone program because they were addicted to heroin; they did drugs; Nancy might have made some extra money by dancing topless in Times Square; either Sid or Nancy bought a hunting knife; the couple partied until late in the night with a succession of friends, would-be friends and hangers-on; and Nancy got Sid one important booking, playing with musician friends at Max's Kansas City. At the end of the six weeks, Spungen was dead from a stab wound and nobody knew if a) Sid killed Nancy and didn't remember doing it; b) Sid killed Nancy as part of a suicide pact but couldn't go through with his end of it; or c) Sid was passed out when a drug dealer/friend/thief broke into their room and stabbed Nancy in a confrontation. Director Danny Garcia's documentary on those six weeks takes us into the Hotel Chelsea and gives us an idea of what life was like there in 1978. Garcia includes interviews with some of the personalities who were around at the time, and fills us in on the background of his deceased star-couple. But he can't offer us much more than that because there isn't much material here to document. Anyone who has followed this story already knows the alternative theories as to Spungen's murder, which are usually bandied about by Sid's friends who don't want his legacy to be sullied. I'm always amazed at how nobody considers the victim in this scenario. Telling us Spungen was suicidal, had a high IQ and was a handful as a child doesn't cut it. Nancy was a daughter and a sister and had quite a colorful life before she ever met Sid Vicious. But that's a documentary for another day. ** from ****","user":"moonspinner55","rank":[5,9]},{"title":"Enjoyable Documentary, but Nothing New or Revealing","rating":7,"date":"20 December 2016","review":"First off, I really enjoyed this documentary. The pacing was excellent, and there was plenty of anecdotes from those who knew the infamous pair, as well as vintage stills and clips.<br><br>I'm not going to bore you with the particulars regarding John Simon \"Sid Vicious\" Ritchie and Nancy Laura Spungen as I'm fairly certain that anyone watching this documentary is, at least, somewhat familiar with them and their tragic end.<br><br>Though no new definitive information is revealed, some of the familiar events are elaborated upon by those who were friends with the pair /or involved in the events leading up to their demise.<br><br>Your not going to see any of the Sex Pistol alumni or the like, but you will hear from folks such as Sylvain Sylvain New York Dolls' guitarist) and Roberta Bayley (iconic punk photographer), <br><br>Overall, stories are told, conspiracies and opinions are offered, fingers are pointed, and both were painted in a positive, if not flawed light, but there are no new, concrete revelations.<br><br>Definitely worth a view and a perfect companion piece to \"Who Killed Nancy?\"","user":"KeithSuchland","rank":[3,5]},{"title":"The Real Sid and Nancy","rating":7,"date":"10 August 2017","review":"While the actual style of punk music didn't last that long if you look at a time line its influence has lasted years later. Looking at some of the most popular music in the last decade and you'll find nods to the style all over the place. Not so much in attitude and dress but definitely in music.<br><br>Perhaps the one band most associated with the look, style and sound of punk rock music was The Sex Pistols. Fronted by Johnny Rotten the band was popular with the punk crowd from the start. But he was challenged for notoriety with bass player Sid Vicious. The two were the focus of the band. Proof of that is when you ask anyone to name more band members other than these two. Fans will know but few others.<br><br>The story of Sid and Nancy has become legend in the rock world. A feature film was made about their story, SID AND NANCY, back in 1984 to critical acclaim. But a documentary of their story was a while coming and this film presents their last days as well as their tumultuous life just prior.<br><br>The movie doesn't delve deeply into their earlier lives but does touch on them. In Sid's case it discusses the fact that his mother was an addict before he was even born. In Nancy's that she was a troubled child. Both of these backgrounds led to their lifestyle choices later in life. Nancy remained a troubled youth seeking adoration and affection. Sid was unprepared for fame and fell into the life of a junkie.<br><br>The two of them were a pair that fed off of each other. By making herself a part of Sid's life Nancy had access to the world of rock and roll stars, a groupie with an in. And Sid found someone who could provide him with the love he never felt he had. At the same time theirs was a volatile romance with angry outbursts and numerous arguments. Both were far too young for the fame that came their way, especially with no one there to help them or guide them along the way.<br><br>Their story culminated in their deaths and that is what the last part of this film deals with. No one knows for certain what happened but at the time it was thought that Vicious had killed the love of his life, Nancy. The two were both voracious drug users. They would cut one another. They lived in the Chelsea Hotel, known as a haven for artistic individuals, drug users and violent crime. And in their room Nancy was found stabbed on the floor of their bathroom after having bled out. Vicious was arrested but not charged in her death. Sid died of an overdose not many months later.<br><br>The movie tells their story using a combination of footage of the two of them together and apart as well as stills. Performance footage is included but soundless with the focus more on their story than where it was Sid gained fame from. It's a nice touch since most movies on the subject tend to fill out their time with endless unwatchable performances. Instead the pictures are floated by on screen while various individuals who were friends of each talk about the two of them.<br><br>Most of this movie is made up of those conversations, of those friends talking about Sid and Nancy. Tales of their antics are combined with the story each has to tell about what they know that happened that night. The story of their forming a suicide pact he backed out of is discussed. Nancy's previous attempts at suicide are mentioned. Suspects are discussed that are more plausible than Sid being responsible for Nancy's death. The fact of the matter is that no one really knows to this day who was responsible.<br><br>In the end it's a sad story but one that fans of the punk scene, The Sex Pistols and the music will all find an interest in. Popular music and cultural historians will also find their story one that draws them in. It might also be a good cautionary tale for young people, especially those with a rebellious nature, might find some good information in, displaying the path to excess that led to their passing rather than elevating them to pedestal status. Well-made and well thought out, it's definitely interesting viewing.","user":"kirbylee70-599-526179","rank":[1,2]}]