[{"title":"Bad showcase for Beau Casper Smart","rating":4,"date":"24 October 2016","review":"The general acting is OK for a zero budget movie like this. It is FAR from good but the bigger problem than the actor's abilities is the horrible directing. The whole make of the movie looks like a film school project of a beginners class and that's 50% the director's fault. 40% of the rest that is bad is on the seriously bad and cheap production. I wouldn't be surprised if it was made over the course of two weekends with a budget of less than 10.000$.<br><br>The story is predictable but if you watch a movie of this type you are probably a martial arts fan and can forgive a lot. I know I have enjoyed movies with a story that's worse if the action rocks. So how about the fights? In few and fitting words: Unimaginative and boring. You can see that Beau Casper Smart has the moves - being a professional dancer it comes as no surprise. But it seems the choreographer has no experience choreographing fight scenes. It looks like he watched a few MMA fights, then made up a list of moves that he thinks are typical, pressed shuffle and just went with the outcome. There are barely any dynamics in the fights, the camera angles are boring and mostly sub par, the cuts feel like someone said \"hey, don't forget a cut and angle change there, dude\" at some point.<br><br>I think if you put a real fight choreographer in charge of the fights, give the camera to someone who's used one for more than a couple of family vacations and make sure the director isn't stoned or on the crapper while the action is happening you could get some really good results out of Beau Casper Smart. Comparing his acting to Van Damme or Segal he actually looks pretty good. Compare him to Scott Adkins, though, and you see he still has a loooong way ahead of him. But I'd definitely watch it if he gave another martial arts flick a try.","user":"tatsu2050","rank":[8,9]},{"title":"Good Movie!","rating":6,"date":"2 May 2018","review":"The movie and storyline itself was enjoyable but the editing of the film is what ruined its potential to be great.","user":"jesslouisehayward","rank":[3,3]},{"title":"Okay if you're a fight fan","rating":29,"date":"29 May 2016","review":"The movie is about a kid called 'Street' who is threaten by a 'Mr. Big character into fighting for him for free or have his family hurt ... and there is no reason given for him to not go to police through bad writing.<br><br>The idea is there, but it's not been though about enough (though the script was re-written by a 3rd writer so maybe she messed it up, who knows?) The biggest problem with this movie is the sound. The music comes in loud and hard when it's not needed and drowns out the actors' dialogue and at other times, when music is playing in the background of the room and it makes sense for it to be loud... you can barely hear it. The sound designer needs to give back their paycheck.<br><br>There wasn't any real build up to the finale and some characters were under-written, but if you're a fan of martial arts movies, you'll probably get past it all for a single viewing.<br><br>The actors do a good enough job but some acting looks bad at times due to camera placement.","user":"UglytheClown","rank":[5,7]}]