[{"title":"Great character designs!","rating":7,"date":"11 April 2015","review":"I believe this film is a big leap for Ánima Estudios and animation in Mexico. First of all, the character designs by Jorge R. Gutiérrez are very cool (I consider this is actually something to admire), they emit a lot of personality. My personal favorite was the witch Eveline voiced by Susana Zabaleta. Also, it's the first full CG feature of this studio, and one of the firsts in the country's industry.<br><br>The plot is quite similar to many animation films we know: The little character who has a mission, and has to complete certain tasks to gain self-esteem and grow against his/her problems. Personally, I got two messages from this movie. The first was \"Believe in yourself and you can overcome your biggest fears\", which we have heard thousands of times in countless animated movies (some reference about this: http://bit.ly/1EoSvIc). And the second one, which I found most unusual and interesting was \"Don't be afraid to dare those who abuse power\". I found it kind of a very strong and cool message for such a colorful and kiddie movie. <br><br>That said, one can notice some technical flaws and annoying details in the story; like the weird CG water or the very continuous appearance of the flying monkeys troop. I do believe it's really intended to be addressed to a very young market niche (5 to 10 years old maybe?), but it can be a bit tedious to watch for the adult aside.<br><br>However, I really wanted to watch this movie and pay my ticket at the cinema. If I had a 5 to 10 years old kid I would love to take him/her with me. It's hard to compete with tight budgets against big productions like \"Home\" from Dreamworks, but I think this movie is a great effort. Hope we can see more and more of the ever evolving Mexican animation industry.","user":"enrique_a2","rank":[3,3]},{"title":"Waste of time","rating":4,"date":"9 May 2015","review":"Boring.... good cartoon, but poor script. Better to stay at home on Sunday to spend time and money. The title of the movie was more promising,was a children film, but despite being a children's film it falls far short of the expectations about history of the original novel. The animation becomes slow and redundant, in addition to the thread of the film becomes confusing and pointless. Studies need to work around before launching a film to be shown in cinemas. For everything else, there are criticisms in every minute of the movie and I certainly do not recommend her. Not being a season of children's movies is the alternative that I recommend Home, which has improved production and script.","user":"cesarlopezromero","rank":[0,3]}]