[{"title":"VIEWS ON FILM review of Blood, Sand and Gold","rating":4,"date":"13 April 2017","review":"Blood, Sand and Gold is my latest review. What, no sweat and tears? Anyway, \"Sand\" doesn't have a MPAA rating but I'll go with a standard R. There are a few F-words, a cold-blooded murder involving a tied up escort, and a couple of other nasty kills. Just think of Blood, Sand and Gold as Raiders of the Lost Ark meets National Treasure. Now take away any excitement or verve that those movies hastily possessed.<br><br>Blood, Sand and Gold is your typical, slick Redbox endeavor. It has lots of glossy locations (Canary Islands, Dubai, Belgium, and Hong Kong to name a few), a no-name cast, a familiar movie poster (similar to Extraction, Arsenal, or Sicario), and a rookie director in 27-year- old Gaelan Connell. Released only in New York City, \"Sand\" is a globetrotting affair that feels surprisingly grounded. It obviously has a budget but I doubt it will break even on said budget.<br><br>With its minimal images of wealthy relics and its lack of insightful treasure speak, Blood, Sand and Gold still comes off like the cinematic poster child for modern day archaeology. It stars Monica West and Aaron Costa Ganis. West looks like a cross between Judy Greer and Tilda Swinton. Sadly, Ganis looks like the B-list version of Gerard Butler. Together, Ganis and West's characters (Jack Riordan and Mave Adams) travel the globe in search of priceless, 15th century artifacts needed for a salvage company. On their journey, they involve themselves in deeper territory as conspiracies about stolen treasures begin to surface.<br><br>In regards to the overall effect of Blood, Sand and Gold, watch for middling acting, ludicrous shootout sequences, and laughable fistfights that seem to be forced and used just for filler (that way \"Sand\" can safely say it's an action film). There's a car chase where a woman who's never shot a gun before, kills about three bad guys without missing once. There's also a scene in which an elderly dame (maybe in her 70's) turns all antagonistic and fires an AK-47. Finally, you have a romantic subplot between Riordan and Adams that lasts for about five minutes. It involves the French language and conversations about screwing on a table. Gag me.<br><br>As for the look of Blood, Sand and Gold, well it's not half bad. Cinematographer Chloe H. Walker provides mountainous landscapes, shots of gleaming deserts, and twinkling city skylines. However, the performances in \"Sand\" are so lackluster (the troupers either overact or seem wooden) that Walker's keen eye just becomes prepossessing, empty background. What a shame.<br><br>In conclusion, Blood, Sand and Gold is filmmaking water mold. Gaelan Connell's direction on it lacks a sense of coherent locality. The actors go from country to country and with each frame, \"Sand\" feels like its solely edited on the fly (that can't be good). All in all, it's best to just skip Blood, Sand and Gold unless it's the last movie left on Earth. Then, you should only see it once. Rating: 1 and a half stars.","user":"burlesonjesse5","rank":[9,9]},{"title":"Hand-held and shaky, combined with some terrible acting","rating":2,"date":"12 April 2017","review":"Even though I really wanted this movie to be my cup of tea, which it could have been if they would have used a tripod and would have taken the time to do a bit of decent casting, it turned out to be everything but that. I'm not saying all actors are bad in this movie, but there are quite a few cringe worthy moments. There's a Dutch speaking guy that can't even manage to get the grammar right. Shaky cam -at times- is so bad, that even slowly walking people are (partially) out of the frame. Drunk filming might be fun to do, but the result is no fun to watch. To be fair, the sound is okay though. It feels like most of the budget was spent on sound and music.<br><br>All in all I can't say that I enjoyed this film and I cannot agree with those who claim it's 'the future of action movies'. And if it turns out to be just that, it's a sad future indeed.<br><br>I didn't make it to the end, so maybe there's some great stuff that I've missed, but that's a chance I'm willing to take..","user":"Reem750618","rank":[11,12]},{"title":"Masked Dialogue? = Total Miss. Possible Spoilers","rating":3,"date":"24 April 2017","review":"Within the first few minutes, I \"heard\" trouble. Yes, those films that have either poor dialogue sound quality that they they attempt to smother with loud music / Foley, or the composer pushed to have the score loud for ego sake. Either way, if I have to strain to hear the dialogue, it's a fail. Had they invested in ADR in lieu of extraneous locations, so they could drop the music with confidence when characters were talking. <br><br>Speaking of locations, the story seemed to be outdoing a 007 film, but for no necessary reason. Perhaps it was the attempt to make a small budget movie look huge, but every element of the story must have a reason for being there. I found the reasons to be on the weak side. <br><br>The acting was okay, but some over-the-top action made me smile instead of gasp. Lack of setups for payoff left story elements implausible. The rooftop chases (funny how both actors knew the \"landscape\" so well, but only one lived there, and the actress was uncannily able to follow them from a street perspective for what appeared to be many blocks, without ever being able to see them). Her sudden ability to be a sure shot in another scene with no setup and other unbelievable incidences rendered the story, for me, well, unbelievable. Anyone else notice that her white shirt never showed a single bit of dust, even in the desert.","user":"kinofan1","rank":[7,7]}]