[{"title":"It might not be new but its certainly scary........","rating":7,"date":"6 February 2017","review":"A good portion of whether something is watchable is not whether it has been done before (most things have been) but whether it is done well. <br><br>Don't Knock Twice does nothing that has not been done before. That said, what it does do, it does awfully well. This is a very atmospheric horror, sounds as well as visuals, play a key part in its success. As does things hinted at or glimpsed, as well as things that are seen.<br><br>The pacing is good with well timed scares occurring throughout this flick. Moreover, it manages to feel fresh and new even though its a well worn proposition. I personally put this down to decent acting and directing. <br><br>Ignore the detractors and give Don't Knock Twice a go. Seven out of ten from me.","user":"s3276169","rank":[65,87]},{"title":"It's all clear now","rating":8,"date":"6 March 2017","review":"Well, what happened was:<br><br>Mary was the demon's slave, and apparently so was Tira. There are only two ways to get out of being baba yaga's slave, and those are to either: Kill yourself, or to trick someone into doing something evil--as explained by the movie.<br><br>Mary did indeed take the kids to feed the demon. And then she killed herself to be free of it (possibly from guilt after being accused of it).<br><br>Tira (the model holding the baby) on the other hand, tricked Jess by lying to her that baba yaga is just an internet fairy tale, and that to save her daughter, she had to find the real kidnapper. This made Jess believe that the detective was the kidnapper, and through a series of events, Jess led the detective to the demon, effectively fulfilling the part where she was \"tricked into doing something evil\". At the end, Tira killed the husband to get rid of the evidence that she herself probably planted (the folder containing the interrogation with the detective), and her mark disappeared, because she was now freed of the demon's enslavement. The ending scene, was Jess being branded with the seal of the demon, concluding that she is now officially the demon's new slave.","user":"gunesbaycan-53143","rank":[47,62]},{"title":"It wasn't terrible, but I don't buy the ending.","rating":5,"date":"17 February 2019","review":"As others have written, this movie does atmosphere really well, and I enjoyed that a lot. I'm not usually a fan of Katie Sackhoff but loved her performance in this. Lucy Boynton's bratty teenager role got old and she looked stunned for most of the movie, but I got past it. It had some good jump scares and some unnecessary and stupid ones, but I got past them, too. I liked the movie overall, my biggest complaint with it being the ending.<br><br>Brief synopsis in my words: An old woman accused of abducting children is hounded by a young girl and her friend and an investigating cop and eventually kills herself. Her ghost comes back for revenge after the girl and her friend knock on the door of the house the old woman used to live in, like they used to to hound her.<br><br>A good, old haunted house with a ghost story, right? That would have been fine by me, but then it tries to get a little too clever and attempts one twist too many and blows it - in my opinion. It also seemed like a last minute, cheap attempt to leave it open for an obvious sequel.<br><br>Okay, now for some spoilers... Apparently the villain wasn't a vengeful ghost it was a demon. Wait, no, it was a child abductor AND a ghost AND a demon. Wait, no, it was some kind of witch or something working with or for the demon or something. And the old woman was innocent. She was being controlled by the demon. Wait, no, it might have been somebody else. Wait, no, it wasn't them after all, it was the old lady but now a new lady has taken her place? Oh, and the knocking twice - that doesn't mean anything after all. Wait, what? But that's the title of the movie!<br><br>Y'know what? I'm not sure anymore and don't care. They had a good old ghost story going and lost it somewhere along the way. Not cool. But while I shook my head at the ending, I didn't hate this. It's still a 5 out of 10 for me just for the atmosphere and genuine creepiness of it.","user":"WisdomsHammer","rank":[18,25]}]