[{"title":"Definitely take a look at Don't Look Back","rating":10,"date":"28 September 2014","review":"I decided to watch this because I really liked Lucy Griffiths on True Blood. I was not disappointed. She was great in this role as the cute and quirky protagonist (and funny side note, she plays another character named \"Nora.\") And even better is Smallville's Cassidy Freeman, who is flawless as the yin to Lucy's yang.<br><br>Generally speaking, I'm a big fan of psychological thrillers, so this was right up my alley. Really atmospheric and creepy, with a gorgeously haunting score and scenery to match. It's a familiar tale, with a unique take. Not as predictable as it appears on first glance. The performances are strong by both of the female leads, and the supporting cast is also very strong: the always fantastic, Kate Burton, and the surprisingly amazing Roddy Piper-- yes, you read that right, Roddy Piper! In my opinion, he stole the show.<br><br>If you're looking for a smart thriller that doesn't rely on gore or cheap thrills, and instead, delves deep into character drama, then this film is definitely worth your time.","user":"im_a_spider","rank":[10,14]},{"title":"Blatant plagiarism","rating":1,"date":"21 December 2015","review":"This movie is a remake of the 2010 British movie Stalker (http://www.imdb.com/title/tt1411236). The story line is virtually identical to the original. Yet it is not formally acknowledged as a remake. None of the original British writers are credited for this movie, and entirely different group of (presumably American) writers are credited for \"writing\" this movie. I think it's a terrible shame that Hollywood writers can get away with ripping off British movies. The least they can do is properly credit the original. Given that there are so many remakes in Hollywood, it really shouldn't be a problem to acknowledge that this is a remake of the 2010 British movie. Why didn't they admit it?","user":"lynmurdock","rank":[4,5]},{"title":"Not quite twisting enough","rating":7,"date":"10 October 2014","review":"Lucy Griffiths (True Blood) stars as Nora, a (seemingly too) young accomplished children's / young adults author who, on the death of her grandmother, inherits the remote family house she grew up in as a troubled child. It is, she thinks, the ideal place to work in solitude on her new book. The combination of a vivacious female lodger, Peyton (played by Cassidy Freeman), and memories stirred by meeting the people she left behind lead to a settling of scores. The good - cinematography, acting (both of the female leads spark off of each other nicely and Cassidy really crackles in some scenes). The bad - you'll probably see the end coming a fair way off and, once you've seen it, the rest is just watching the story play itself out by the numbers. There's some soft core sex (but no nudity) and the violence is virtually blood free. Whether you want to slot that under good or bad I'll leave to you. I'd say it was to the Director's (William Dickerson) credit that he didn't try to boost the film by gratuitous amounts of either. Conclusion - well worth a watch but not quite twisting enough to keep you guessing till the end. 7/10","user":"nabokov95","rank":[5,8]}]