[{"title":"Qualities make up for the flaws – good, gritty entertainment","rating":7,"date":"2 June 2017","review":"Although Blood Father does not bring anything new to the table in terms of storytelling, it manages to provide decent entertainment by taking advantage of its filming locations, a good cast and somewhat interesting, although undeveloped, lead characters. <br><br>Link (Mel Gibson) is an ex-con turned tattoo artist and former alcoholic who lives a reasonably quiet life in a trailer park home. One day, he receives a phone call from his daughter, Lydia, who has gone missing for many years, and who's seeking help, as drug dealers and law enforcement are trying to track her down. Sounds familiar? It probably does. It's a very classic story, and make no mistake about it, this tale is quite typical of the genre. I would even go as far as to say that story-wise, this film is sub-par and plot development is almost nonexistent. Add an anticlimactic and abrupt ending, and an almost shameful use of pretty interesting supporting characters, one has to wonder what Blood Father really has to offer.<br><br>The answer is an overall pretty good time, despite its flaws, thanks to sympathetic characters, above-average dialogue for the genre, some gritty moments, very welcome touches of humor and great cinematography. Jean-François Richet, who directed the biographical films about Jacques Mesrine, does a pretty good job too.<br><br>Again, it's a shame to make such little use of Kirby (William H. Macy) and Preacher (Michael Parks), but their presence is appreciated while it lasts. The Sicario character's first appearance is blood chilling, but unfortunately, the character's mystique evaporates from lack of screen time and further significant appearances. Mel Gibson is perfect in his role and Erin Moriarty (Lydia) is pretty good as well. The chemistry between both characters is tangible, and the generational clash sub-theme is subtle, but interesting nonetheless. Moreover, there are a few sequences, such as the first scene at the store and the scene when Link and Lydia are in the back of a truck filled with illegal Mexican immigrants, where the film humorously takes aim at some absurdities, such as a minor buying boxes of ammo without being asked for her ID, but being denied a pack of cigarettes because she's underage, or Lydia countering her dad's argument that illegal Mexican immigrants are \"stealing\" fruit-picking jobs from white Americans.<br><br>While the film offers some nice set-pieces, as a sequence of events, Blood Father's script does not profit from the best possible dramatic continuity, and ultimately falls short on delivering any truly memorable moment whatsoever. In that regard, the writing feels very uneven, as it delivers in the dialogue department, but lacks truly interesting ideas or ingenuity story-wise.<br><br>That being said, its qualities are likely to draw you in for its hour and a half runtime, and should manage to entertain anyone who likes this type of flick.","user":"plpregent","rank":[30,33]},{"title":"Is this Mel's comeback?","rating":7,"date":"11 October 2016","review":"Pretty fitting role for this man right? A recovering alcoholic... Pretty certain Mel was as drunk as a skunk when he committed career suicide lambasting Jewish people, and everything else under the sun. Fast forward a decade later, and I ask myself has he been humbled... Seen his evil ways and has now returned to us born again? In recovery? I don't know. What I do know is Mel Gibson has always owned anti-hero roles like this. He was good at them back then, and apparently a decade later he still is.<br><br>So... This film kicks ass. It has heart. It hits all of the right notes for a Father revenge flick, and his performance hits all of these notes way way better than a movie like Taken. This film is well worth a watch, and I can't decide whether I should feel guilty or happy about this.<br><br>I guess it all depends on whether this guy is still a jerk, or has woken the hell up. Ultimately though, what does it really matter? We have this thing in our society where celebrities have to be likable acceptable public figures, like politicians, or they're kicked to the curb. When really what does it matter? They're just actors doing a job. They could be a jerk and a great actor, or a saint and an awful actor. It really just relates to the caliber of their work, and I have to say, whether he is the former or the latter, he nailed this role like he did so often back in the day with other roles like this--back when everyone liked him.<br><br>Pretty good movie...","user":"TruthTwentyFour","rank":[52,61]},{"title":"Gibson's best movie in years","rating":7,"date":"9 July 2017","review":"BLOOD FATHER is an intense little action thriller that also happens to be Mel Gibson's best film as an actor since EDGE OF DARKNESS. The plot is nothing special and sees Gibson playing the usual eccentric hard-bitten type, living in a trailer and estranged from his family. His daughter's involvement with a gang of Mexican drug dealers sees her returning to him to ask from his help, and a chase scenario unfolds from there.<br><br>This film is well-shot throughout and efficiently low key. Instead of the fun but over the top mayhem of a JOHN WICK film, in which our protagonist bumps off hundreds of foes effortlessly, Gibson and co. just have five or six tough types ranged against them. The running time is short and the pace snappy, full of hard-bitten dialogue and decent performances from a supporting cast including Michael Parks, Diego Luna, William H. Macy, and Miguel Sandoval. Another treat is that Erin Moriarty isn't your stereotypical whining, bratty adolescent but instead an intelligent-thinking adult too. Gibson is on top form, as always, and the brief but violent bouts of action are expertly staged.","user":"Leofwine_draca","rank":[17,19]}]