[{"title":"Legal/historical drama, not action","rating":8,"date":"18 October 2015","review":"Don't be fooled by the title. Make sure you know what you're getting yourself into when you watch this film. Bridge of Spies is literally about the Cold War Bridge of Spies, where Soviet/US spies were exchanged through negotiations. This is nothing like \"The Americans\" (FX TV drama - for some high unrealistic and over-sexualized espionage action - redirect here) and the most action-packed scene you will see is Francis Gary Powers getting shot out of his U2 plane during his mission. <br><br>Bridge of Spies is really a historical/legal drama. And based on my preliminary research, they seem to be getting most of their facts right. Obviously a little bit embellished for Hollywood's sake, Bridge of Spies does a fine job as a historical docudrama. There is a lot of talking, but it's meaningful talking. At times, the film can be a little slow {opening scene, especially}, but give it a chance and you might enjoy it. History buffs like myself will definitely enjoy it. But thrill-seekers, you're better off to see the new James Bond movie instead.","user":"hoxjennifer","rank":[232,292]},{"title":"A very good, very Spielberg motion picture, starring Tom Hanks.","rating":9,"date":"18 October 2015","review":"This movie hit me really strangely.<br><br>I was expecting a political drama about the cold war, and while indeed it was that, I was not expecting to have so much fun and for Bridge of Spies to be so humorous. <br><br>The Coen brothers writing a movie Steven Spielberg would direct just sounds like a winning combination and it really was. Sealing the deal, was a great performance by Tom Hanks.<br><br>Tom Hanks does what he does best, by playing an everyday man in an average life. James Donovan was just an insurance lawyer who gets caught up in the middle of the Cold War. Bridge of Spies, starts him off so normal and then turns his life into quite an adventure.<br><br>And I do mean adventure. In the hands of Spielberg, the movie's visuals were large and epic. I was expecting this movie to feel more like his last flick, Lincoln. Instead it feels more like Indiana Jones, as James Donovan travels to Berlin at the time when the wall was being completed. <br><br>Watching Hanks play Donovan who is just swept into an overwhelming situation and just keeps his cool and his charm is just highly enjoyable. <br><br>Totally loved Bridge of Spies, It's one of the best team ups between Hanks and Spielberg and even though Lincoln was a great movie, Bridge of Spies is everything Spielberg is capable of. So entertaining.","user":"subxerogravity","rank":[154,205]},{"title":"\"And the Best Supporting Actor Oscar goes to... Mark Rylance\"","rating":9,"date":"29 November 2015","review":"There are combinations of film makers that make you confident, as you pay your ticket price, that you are not going to be terribly disappointed: Steven Spielberg directing; Tom Hanks taking the lead; Janusz Kaminski behind the camera; Michael Kahn editing and a Coen brothers script (with Matt Charmon (Suite Française)). And Bridge of Spies doesn't disappoint, particularly for someone of my more advanced years (I was born the year following the film's climatic events) who remembers well the terror of potential nuclear catastrophe that hung over the world through the 60's and 70's.<br><br>In a story based on true events, Hanks plays James Donovan (diverging somewhat from reality here) as an insurance lawyer dragged by his firm into defending Rudolf Abel, the accused Soviet spy played exquisitely by British stage acting legend Mark Rylance. Against this backdrop, the international blue touch paper is about to be lit by the shooting down over Russia of Gary Powers (Austin Stowell from \"Whiplash\") in his U-2 spy plane (sorry – \"article\"). Donovan becomes instrumental in unofficially negotiating on behalf of the US government the release of Powers in East Berlin. The deal is jeopardized by his boy-scout tendencies to also want to help another US captive Frederic Pryor (Will Rogers).<br><br>I've read some negative reviews of this film in the papers that made me quite cross, describing it as \"yawnsome\" and \"sanctimoniously dull\". For me, nothing could be further from the truth and the packed Saturday night audience I saw this with seemed equally gripped from beginning to end, silent save for the odd laugh where some appropriate humor is weaved into the story.<br><br>Tom Hanks is solid and believable as the fish-out-of-water lawyer, albeit that the role is played with a large spoonful of patriotic American sugar as Donovan trumpets about the importance of the constitution over the lynch-mob mentality of the general public. Alan Alda – great to see again on the big screen – channels his best Hawkeye-style exasperation as Donovan's boss, looking for a clean and quick conviction.<br><br>But it is Mark Rylance – an irregular player in movies, and due to appear again in next year's \"BFG\" – who shines out as the acting star of the film. His salubrious and calm turn as the cornered spy just reeks of class and if he isn't nominated for a Best Supporting Actor nomination for this then there is no justice. (A special 'casting recognition award' to my wife Sue for spotting that the actress playing Judge Byer's wife – Le Clanché du Rand – was Meg Ryan's mother in Sleepless in Seattle 22 years ago!) <br><br>The cinematography is superb with some gorgeous tracking shots and framed scenes. Most outstanding of all is the scene depicting the traumatic construction of the Berlin wall – long tracking shots in greys and blues delivering a truly breathtaking piece of cinema. In general I'd give a big shout-out to both the art department and the special effects team in making the desolation of East Berlin feel so real. It makes the similar scenes, that I commented positively on in the recent \"Man from U.N.C.L.E.\" seem like an amateur school production.<br><br>The special effects team also contribute in making the shooting down of the U-2 a thrilling piece of cinema.<br><br>Music is sparingly and effectively used by Thomas Newman, and it can be no greater complement to the composer than that I was wondering until the end titles as to whether it was another Spielberg/ John Williams collaboration or not.<br><br>A great film, one of my favorites this year. Highly recommended, especially if you are over 50. You should also get out to a cinema to see this one – it will be far more effective on the big screen than the small one.<br><br>(Please visit http://bob-the-movie-man.com for the graphical version of this review. Thanks.)","user":"bob-the-movie-man","rank":[98,132]}]