[{"title":"Better than expected","rating":6,"date":"7 October 2014","review":"No spoilers in this review, but a brief summary of my impressions about the film: The movie was better than I expected, and I was a bit surprised by the low 4.8 rating (at the time of writing) on IMDb.<br><br>Granted, it's not a very good film, but it's not that bad either: The dialogue is OK and it avoids many of the narrative clichés you often see in low-budget films (even big-budget films as well), and the acting is (in general) more than decent enough (more about that later).<br><br>Thumbs up to the screenwriters for at least attempting to add some depth to the film: At first you may get the impression that this is some sort of action-film, but it's more like a thriller with some underlying \"family\" drama (with focus on father/\"stepmother\"-daughter relationships).<br><br>I was less enthusiastic about the pacing of the last half of the movie: I think the film could have been shortened a bit, to add more focus towards the end. I also felt that the foreign accent of Tally was a bit distracting, even though English was not the native language of her character (or the actress herself).<br><br>Peter Stormare was, as usual, quite funny. It's almost over-the-top, but he somehow manages to sell the performance because it seems to fit his character.<br><br>Maisie Williams is a young and very talented actress. Her character starts off as an annoying, bratty teen, but the turn of events help to bring her into a more sympathetic light (a lesser script could easily have made the character much more two-dimensional and clichéd). Kudos to Maisie for bringing her character to life, even though she didn't have that much material to work with.<br><br>However, one reviewer here wrote that \"she does not have much acting skill. ... Maisie mesmerizes the audience with her eyes. People mistaken it for acting\".<br><br>The reviewer couldn't be more wrong, in my opinion: Good acting is not only how you act or perform, it's about how you *RE*act. And Maisie's ability to communicate and express emotions via her eyes is one of the very reasons why she's so talented. She listens and reacts. Maisie's performances are also emotionally honest and \"real\", and it's not often I see these qualities in young actors in their first screen roles.<br><br>Overall, I think this film passed the \"watch clock\" or \"falling asleep\" tests: In general, if a film manages to entertain me enough to avoid these things from happening, then it usually deserves at least 6/10. Heatstroke started of well, and although it started to slow down towards the end, it still left a positive impression.","user":"PerpetuumMobile09","rank":[13,14]},{"title":"I was hoping for something like In The Blood but instead got more of a hide and seek type movie. Felt a little flat.","rating":5,"date":"8 July 2014","review":"\"They looked like they needed help. He said they is a little off the desert.\" Paul (Dorff) and his girlfriend Tally are taking a trip to Africa. His daughter Josie (Williams) is having trouble with the new relationship and reluctantly is dragged along. Instantly Josie and Tally clash until Josie asks to be sent home. On the way to the airport something happens to Paul and it is up to Tally to protect Josie and find a way to get her home safe. This is a movie that is hard to review. The movie isn't bad and moved at a pretty good pace but on the other hand it is really a overdone concept. The thing that does set this apart from others though is that the woman is the one who has to protect someone. While this may seem like an action movie it is much more drama then I was expecting. I was hoping for something like In The Blood but instead got more of a hide and seek type movie. Not that that isn't a bad thing but it needed something else to keep it from feeling as flat as it did. Overall, nothing amazing but nothing awful either. Really just a movie to put in when you have nothing else to do. I give it a C+.","user":"cosmo_tiger","rank":[16,22]},{"title":"Stephen Dorff fans expecting a Stephen Dorff actionthriller are setting themselves up for a disappointment","rating":3,"date":"1 September 2014","review":"This movie could be used in filmclass on how not to make an effective dramathriller.<br><br>The first third establishes Stephen Dorff as the main lead, at that point of the movie it's a familydrama.<br><br>That changes though in the second third, where without spoiling anything \"something happens\" and Stephen Dorff \"dissappears from the movie\".<br><br>Which of course is a surprise as the movie markets itself as a Stephen Dorff-movie on the cover and he's the dominating force in the first third as well as said.<br><br>He's also sporting a gun in the cover to make you believe it's a actionthriller but in the movie he does not have a gun, he plays a very non-threatening hyena expert.<br><br>The movie then pretty much out of the blue turns into a thriller with Dorff's girlfriend and daughter trying to escape badly written stereotypical \"bad guys\" played by Peter Stormare (who could play a role like this in his sleep) and 2 unknowns.<br><br>The acting overall is uninspired and occasionally just plain bad, the kid does try and gets it right occasionally but she can't save this movie although I'm sure in another movie with the right director she can shine but it's just a lackluster production overall.<br><br>3.5 out of 10 from me, there are hints that there are some talent involved, but overall it just fails to entertain and make you care about what's gonna happen.","user":"Seth_Rogue_One","rank":[15,22]}]