[{"title":"MUST BE required viewing","rating":10,"date":"27 June 2018","review":"This should be forcibly shown to everyone. If we force people to sit through the drudgery that is school, or work, THIS is far more important and enlightening than any science or math class. Anyone saying this viewpoint is naive obviously knows nothing of the world they live in - they simply exist in the paradigm, relying on others to tell them where they live and what space they occupy. You can tell that these people and anyone like them have a FAR DEEPER understanding of the natural world, which goes beyond what science can tell you, especially from these people who are really actors themselves like Degrasse Tyson. Science has convoluted this truth into bits and pieces, material things which they have convinced you that you need. The problem is that, because someone actually shows respect, they are disrespected. Unfortunately these people will also not take up arms to defend themselves, thus they are unjustly forced out of their homes because people need to eat chocolate and wash with fancy soaps. Globalisation IS a problem because we have gotten away from the truth of how the world works, in favor of manipulating it, trying to solve problems with more problems, ultimately only leading up to a reliance on government and useless human beings who have zero interest in actually positively building up the world around them. But to each their own - despite the fact that NONE of us are given a choice - we are FORCED into this god forsaken corrupt commercial and material lifestyle which does nothing but generate trash and waste, including out of the bodies of the people themselves (i.e. people are trash).","user":"gjr-85165","rank":[6,6]},{"title":"Tawai - connecting to the forest like a baby connects to a mother's breast","rating":9,"date":"5 October 2017","review":"Tawai<br><br>A beautiful, haunting and most welcome opportunity to tune in to how the remaining few real egalitarian hunter gather societies relate to each other and their surroundings. How they live and breathe that connection and inter-relatedness, how their way of life keeps them so tightly in touch with the present moment, with each other and the soil on which they step. An insight into what we lose when we fall out of that interwoven way of life and most of all, an invitation to allow in and fully embody the heavy aching pain and frustration that our own daily actions are chipping away at these precious last living examples of true human harmony with nature. Chipping away at the resources that are the lifelines of our planet. <br><br>It is pain that we really need to face, fully open to and deeply feel. We owe it to these societies and we owe it our planet and to ourselves, to witness and be present to this process of destruction that is happening to us as one global unit. <br><br>Tawai means to feel a sense of connection to our surroundings, in a way like how a baby is connected to a mother and her breast. To know with its whole being that it needs her, that it feeds upon her and will not be able to survive without her and her love.","user":"katiestar-89409","rank":[5,6]},{"title":"Dreamy, thoughtful and powerful","rating":10,"date":"1 October 2017","review":"I loved this documentary for its deep philosophical exploration of what it means to be a human in the context of a fast disappearing natural world. It was subtle, thought provoking and never pedantic or propagandistic. It was a beautifully told story with dreamy cinematography that made me feel very immersed in each of the different places Bruce Parry explores.","user":"sarduff-36350","rank":[4,5]}]