[{"title":"Surprising","rating":9,"date":"24 November 2016","review":"I had high hopes for this movie because of Robert Zemeckis, Brad Pitt, and Marion Cotillard. I definitely went into it prepared for a WWII movie, full of action and special effects. And to be clear, this movie certainly DOES have action and special effects (what Zemeckis film doesn't?), but it goes beyond that. <br><br>The actions scenes, when they do happen, are well choreographed and fun to watch. They also earn the movie it's rating, and are brutal but not overbearing. Marion and Brad are both convincing, proving to the audience that they are well- trained spies who don't hesitate to kill.<br><br>Something I found very interesting about this movie is that while it's not primarily a war film, it did provide a very interesting look at what life was like for people. This was a time when people partied like the world was ending. Drinks, drugs, sex, etc. But this was also a time when people sometimes watched planes get shot out of the sky. It's a fascinatingly personal way of portraying the war, and the people living through it.<br><br>The special effects are stunning, Zemeckis seamlessly blending reality and effects. Many scenes are simply breathtaking. It's puzzling how the movie manages to be both classic and modern.<br><br>As I mentioned though, this movie is more than just war and special effects. By the end, there are a few clear themes; putting what's best for those you love above your own needs, and trying your hardest to believe the best of/trust those closest to you. Even if it means you have to break some rules, or even put your own life on the line. <br><br>The ending, which some say is overly-sentimental, hit a chord that worked for me. It showed the lengths people go to to protect their family. However people complain about the Forest Gump ending, and that one makes me cry almost every time I see it. So if I'm in the minority here, I'm not at all surprised.<br><br>One last thing that I thought this movie did very well, was showing just how difficult it would truly be for spies to fall in love. For the first half of the movie, the two are basically brought together and drawn to each other because of their abilities. They live, supposedly, very similar lives. They are evenly matched. They fit together in every sense because of their mastery of espionage. And yet, once the twist comes along, that same mastery of espionage is what tears them apart. Marion's ability to lie, once a great asset, is now their greatest enemy. It's a wonderful way to weave the story together, and makes for some excellent tension as well as irony. <br><br>Overall, Allied is absolutely a mix. It has espionage, it has war, it has assassinations, it has parties, it has family, it has romantic/steamy (quite steamy, might I add) moments, it has costumes and scenery, it has a mystery to be solved, etc. And some of these things it does magnificently. Some of these things it does just well-enough. But it does it all. Which is more than can be said for most movies these days.<br><br>This movie certainly deserves the R rating. There is nudity, multiple sex scenes, a decent amount of violence, language, drugs. <br><br>If you are a fan of classic movies, watch it. Is it perfect? No, it certainly has weak points and flaws. But overall I was thoroughly entertained by it. It kept me on the edge of my seat, and I will definitely be buying this on Blu-Ray, hopefully with lots of insight into how this film was made and what technologies Zemeckis used.","user":"ilovedavii","rank":[225,306]},{"title":"A wartime romance that could have been epic, but didn't quite make it","rating":6,"date":"30 November 2016","review":"'Allied' has garnered a mixed reaction, on IMDb and with critics in general. This is completely understandable, and the mixed reaction and the reasoning for it mirrors my own feelings for the film. 'Allied' is not a bad film, but from seeing the trailers (which strongly suggested a film that would be more epic, more moving and more thrilling) to be honest was expecting a lot more.<br><br>There is a lot to like about 'Allied'. Visually, it is a gorgeous film. The cinematography is rich in atmosphere and colour and is quite poetic too, while the sets, scenery and costumes are evocative and eye-catching. The music by Alan Silvestri is neither too intrusive or too low-key, instead stirring when it needs to be and understated again when needed. There are some thrilling and harrowing moments as well as some poignant ones in the more intimate scenes, personally thought the controversial ending was quite emotional but can definitely see why it won't work for some.<br><br>Marion Cotillard gives a nuanced and deeply felt turn, nothing short of sensational. Brad Pitt's performance has been criticised (as well as defended), to me it was appropriately stoic, despite his character being nowhere near as meaty as Cotillard's, and he was a worthy partner for Cotillard, a little cold in places but mostly fiery. The supporting cast are fine.<br><br>On the other hand, the script and pacing are uneven. The script is 'Allied's' biggest flaw, lacking plausibility in places, especially in the mission scenes, having too much padding that's overlong and adds little to nothing and some of the parts intended to be emotional laid it on too thick with the treacle and sentimentality. Much more could have been done with the psychological subtext, which would have made Pitt's character more interesting and given the story more consistent suspense and thrills.<br><br>Pacing does drag badly frequently, primarily due to having superfluous scenes that lacked momentum and went on too long and also due to Robert Zemeckis' quite disappointing direction. There are moments, but it is a case of getting the job done but in a workmanlike and tame fashion, not the thrills and cleverness one expects from Zemeckis that is present in the best of his work.<br><br>In summary, had potential to be epic as a wartime romance, but doesn't quite make it. Many great things, but a few big things that got in the way of fulfilling full potential. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[145,209]},{"title":"Better than I Expected","rating":8,"date":"27 November 2016","review":"You may have seen the preview for this movie; I would say that that does not fully prepare you for the actual movie. It is a movie that will appeal to adults, both men and women, and it includes romance, sacrifice, and plenty of action and spy hi jinks. <br><br>A very good script, with some great plot turns, and superior acting from both Marion Cotillard and Brad Pitt in complex, challenging roles. My favorite bit: when they make love in a car in the Moroccan desert with a sandstorm going on all around them. It is a good metaphor for their love story in the midst of the great chaos of World War II. And it has a realistic feel, for the most part--for the sets in Casablanca (some good homage to the Bogart film, I would say also some Brando homage in parts of Pitt's performance), and the time back in the UK (second favorite bit is during a party in London). One does get the sense of the all-out effort demanded to win the war, something we do well to commemorate in these days when the last veterans of that most epic event in history are at death's door. <br><br>It is a Zemeckis film, from the school of film-making of Steven Spielberg, and that means your emotions are subject to the whim and whimsy of the director's manipulation. Sometimes you are aware of that, but oftentimes you are not, and that makes it better (than, say, Forrest Gump). <br><br>I will take the movie as a whole and suggest Oscar nominations for original screenplay and both leading roles.","user":"j1stoner","rank":[84,124]}]