[{"title":"Just god-awful","rating":1,"date":"19 February 2015","review":"I was invited to go see the Jackie Chan/Adrian Brody/John Cusack Chinese pseudo-historical period drama called Dragon Blade(though its Chinese title is more along the lines of \"Day of the Lion\" and has nothing to do with dragons or lions... confused yet? Just wait...).<br><br>In it Jackie Chan plays a guard commander on the Silk Road who absolutely refuses to use violence, which pretty much makes him the worst guard ever. John Cusack plays a super-tired looking Roman General on the run leading a Legion who all speak English but have what is supposed to be a stirring Roman \"national anthem\" which is in Latin. Oh, and even though it's the year 458 BC, Jackie Chan can still speak English... but more Chingrishy than usual (cringing intensifies). Adrian Brody plays a ridiculously evil Consul and was developed by someone who had absolutely no idea what a Roman Consul was and thought it was hereditary, thereby necessitating he kill his father and blind his little brother so that \"he could never take power.\" Seriously, dude. You have to get elected every year... and usually have to wait 10 before running again... sigh... . <br><br>Consul Brody marches an army of 100,000 to conquer the Silk Road which is apparently about a day's hike even though it's like 8,000 miles away. Captain Chan and General Cusack strike up an unlikely and utterly unconvincing friendship to rebuild a city's outer walls, the Romans show how \"smart\" they are by wasting half their schedule constructing huge machines to do the work instead of using the ample labor supply available (it is, after all, a labor camp). The Legion and the \"Silk Road Protection Squad\" have what I thought of as a \"Bring It On\" style dance-off using their respective military drills, than that goes into a sparring match, and then hugs all around. And then they have a singing competition. No. Seriously. They have a singing competition... with a blind kid. In Latin. I made none of this up. . <br><br>Jackie Chan intermittently goes from being a super-boring goof ball a la everything Chan's ever been in... to the film randomly cutting back to confusing, only-semi-explained flashbacks to when he accidentally suffocated his sister to death as a child, and then stabbed a general in the side who tried to comfort him... all of this leading (somehow) to his deciding to protect the Silk Road using the power of nonviolence forever. <br><br>Then the \"bad\" Romans show up and the movie turns a 180 and goes into hyper-drive blood, death, and gore. That little blind kid? Thrown off the top of the city wall. John Cusack gets his eyes cut out, is crucified, and then is \"mercifully\" ended by Jackie Chan who breaks form to but an arrow through his neck (he then goes back to letting pretty much any and everyone kill for him and on his behalf until the end). Chan's impossibly-saintly teacher-wife takes 2 arrows in the back. There's a random, gruesome extreme closeup of a Roman soldier taking a Hun arrow in the face *through* a wooden plank. Huns (including the super-hot Lin Peng as Cold Moon), and 30-something other \"races\" all join together to fight the Eeevul Cosul Adrian Brody, and it's like something directly out of The Hobbit #3 with a flipping horde of eagles gouging eyes out, and doomed last stands. . <br><br>Adrian Brody stabs his grandfather and almost beheads Jackie Chan, but then Chan does something with the weird little arm guard he's worn the whole movie (even though his whole squad is shown to practice with sweet swords that can be thrown and retracted, they are used once, ONCE the whole film. Brody gets his neck slashed, but opt to keep Jackie's kill could at 1 by then taking his dagger and stabbing himself in the heart while mumbling the (completely made up) Roman national anthem again. Then the remaining Romans and the member of the 30-whatever nations all join up to keep the SIlk Road safe and war-free for everyone. .<br><br>The film is bookended by explorers who find the ruins of the city, and then decide not to tell anyone and keep it a secret... *even though that's their whole job. Their ONLY job.* . <br><br>The End. . <br><br>I haven't seen a movie this unfocused, confused, and just... bad... in a long while. If you find yourself in my position, with someone offering you a free ticket... Just. Say. No. Say no to terrible cinematography. <br><br>. I wish I had extra hands so I could give this movie four thumbs down.","user":"nordrithal","rank":[158,241]},{"title":"Good Choreography, side jokes. Horrible script, story development","rating":3,"date":"21 February 2015","review":"While the main message of the movie was about multi-cultural peace (probably what the world needs now), choreography was good (nothing less than expected from a J.C. movie), side jokes to make you giggle from this otherwise boring plot, nothing else about the movie was able to redeem it from it's cliché story progression and bad script. <br><br>1) The message about multicultural peace was smacked right in audience faces left, right, up, down from the beginning of the show. To make things worst, coupled with cheesy lines, it made a profound and wise motif seem plain cheesy, overly-simplified and lacked the depth it should have had.<br><br>2) Despite the strong development of major characters, minor/side characters were not grounded enough. Fickle change in beliefs by side characters (people of the Wild Geese Gate), once again, made the story look superficial and badly developed. <br><br>Unfortunately, great choreography, scene shots and strong casts could not save it from its draggy, underdeveloped plot and horrible script.","user":"joshuaxie1993","rank":[85,137]},{"title":"disappointed","rating":3,"date":"26 February 2015","review":"I wont describe the actual movie here as you will be able to read other reviews already published. I will however will try to avoid you suffering the pain I have just gone through.<br><br>I was very disappointed in this movie, perhaps because I expected better from a movie with John Cusack, Adrien Brody, Jackie Chan. Perhaps I should have looked at who was directing the movie such as Daniel Lee and the typical movies he has made.... or maybe it was because the movie was just \"really\" bad.<br><br>I watched the movie on a quiet Wednesday night and I would estimate that a third of the audience left well before the end, some really early. When the credits came up it was like a fire evacuation alert had just came on. Please, Women and Children first.. We will all survive!<br><br>Jackie Chan fight scenes were well below par and I thought they were more like a \"Charlie Chaplin/Harold Loyd\" Silent movie style rather than a \"Rush Hour\" style.<br><br>John Cusack character was extremely boring and I could have fallen asleep in I was at home.<br><br>Adrien Brody was the only positive in the movie, but the movie was so bad that his acting was lost.<br><br>The child actor was badly filmed (always) like an old Asian hero film and I found the child annoying.<br><br>The production and cinematography of the film are cringe-worthy throughout. flashbacks are random and not in line with story. Slow motions are extensive and really annoying.<br><br>Recommendation - Go and see something else.","user":"sandy_mcnair","rank":[107,181]}]