[{"title":"Quietly Devastating","rating":9,"date":"7 July 2017","review":"\"The Red Turtle\" is an animated film that left my entire family feeling quietly devastated without even being able to put our fingers on why. <br><br>With no dialogue, it traces the trajectory life takes for most people: starting out alone, finding someone to partner with, raising children, watching those children leave, and then saying goodbye yourself to the world. The film explores how things that can at first seem like barriers to happiness and contentment can eventually lead us to the things about life that we cherish most. It's not a film full of big, obvious emotions, but instead works a quiet and subtle spell. My eight year old was extremely attuned to the melancholy sadness of the film and spent a couple of minutes in tears afterwards. It gave us a good opportunity to talk about why the movie made him sad and to make him feel OK about having honest reactions to what are essentially the ups and downs of life.<br><br>Nominated for Best Animated Feature at the 2016 Academy Awards.<br><br>Grade: A","user":"evanston_dad","rank":[83,86]},{"title":"A beautiful film about a man's relationship with his environment","rating":9,"date":"18 October 2016","review":"A man awakens adrift in the middle of the ocean. He is able to swim to a nearby remote island which is only inhabited by crabs, birds and a mysterious red turtle. This is the premise to the Michaël Dudok de Wit's first feature length film, a collaboration between French production studio The Wild Bunch and Japanese animation powerhouse Studio Ghibli. The result of this collaboration is a visually stunning and emotionally complex film.<br><br>De Wit explained after the screening that he loved the desert island stories he heard as a child but wanted to tell a different story than Robinson Crusoe. He was less interested in the mechanics of how a man can live on (or escape from) a desert island and more interested in how that man would feel. The practicalities of how the man would survive on this island are dealt with early on and in little detail. The island has fruit bearing trees and a pool of drinkable water at its centre. A very tense sequence early in the film sees the man fall into a crevice and swim the length of a claustrophobic underwater tunnel to escape. These sequences of peril are few. The majority of the film concerns the real interest of the director; what would keep a man on his island? What would he need to be happy there? De Wit explained his process as being very natural. He arrived at the premise and then wrote the story without a plan. He wanted something to keep the man on the island, something natural. He then settled on a giant turtle saying it just felt right. Not too cute, nor too animalistic. The effect of this writing style is that the film has a very dream like quality.<br><br>The animation is stunning. The island is rendered in lush colours. The realistic approach to character movements and environments makes the fantastical elements all the more spellbinding.<br><br>The director also mentioned symbolism in his discussion, hoping that it was clear. I must admit that if the film is a direct allegory then it's a little elusive. Perhaps it's a story about surrendering the instinct to escape one's circumstances and learning to embrace them. Or perhaps it's about not yearning to return to home but to make one for oneself. The man initially dreams of bridges leaving the island and string quartets appearing on the beach. As the man explores the wonders of the island he stops dreaming, discovering that the island has its own fantasies to offer. The deceptively simple story demands some thought but more significantly insists on being felt.<br><br>Other interesting details from the discussion with the director included the sudden contact from Studio Ghibli. Someone from the studio contacted him having seen some of his animated shorts. He was offered the chance to make whatever film he wanted. This, surely, is the impossible dream of all animators. He described the experience of working with the animation giant as incredibly rewarding, with their input and guidance allowing him to make a better film.<br><br>It is interesting to see the Ghibli elements within the film. Most noticeably, I think, the studio has influenced the wildlife seen on screen. Aside from the eponymous reptile, the man is joined on his island by a group of crabs. These crabs are drawn realistically but act anthropomorphically, functioning as comic relief. It's difficult not to recall the Soot Sprites from Spirited Away. However despite the whimsy of these crabs, they are still depicted as part of nature. They drag live fish away to be consumed and are themselves eaten by birds. The juxtaposition of the charms of nature with its horrors recalls the woodland scenes from The Tale of Princess Kaguya.<br><br>This is a very unique film. It has far less in common with stories like Castaway than its premise may suggest. Instead this is a fantastical exploration of what makes a person content with their surroundings. Fans of Michaël Dudok de Wit will appreciate the flawless transition he has made to feature film and fans of Studio Ghibli will find plenty of the magic and wonder they may be missing since When Marnie Was There.","user":"paul_a_salt","rank":[102,118]},{"title":"Brilliant piece of art and philosophical masterpiece","rating":10,"date":"9 March 2017","review":"Before starting watching the movie I strongly recommend to listen or even better to watch Leonard Cohen's video clip \"Dance Me to the End of Love\". The animated movie as well as Cohen's clip is about life, obstacles, hardness, love, children, death - about the life as is. Sometimes lonely, sometimes happy, sometimes on the edge of death.<br><br>The plot is quite simple: the main hero appears on uninhabited island and first tries to survive, then to escape and then just just to live.<br><br>It is real philosophical piece of art about which one can write thesis after thesis. A scope of issues reveled for discussions is vast: about the purpose of life, about love, about loneliness, about striving of the youth for changes, desire to live, to die, nature, animals and much much more. <br><br>I was extremely touched with the few very nice moments: - First - when the main hero being on the uninhabited island but alive suddenly falls down from the rock inside the deep cave with water from which you can not get out. I physically feel myself uncomfortable from realizing the situation - to survive but appear on the island and immediately after to face danger of being helplessly drowned in the cave - Second - when woman is touching the face of the main hero after years or months of loneliness (heroes do not talk - you can see the time only by means of his beard only). Deeply touching moment - and once again, while sitting in the cinema you almost physically feel the tenderness of this touch. - Third - after the main hero met woman and set a family and they gave a birth to a child and child has grown up and it looked like \"life is happy\"drastic storm from the sea arrives and almost kills all of them.<br><br>And the final and the most beautiful moment, in my opinion: after their son left them and they reached old age (one can guess of it from the gray hairs om his and her) and it is obvious that soon they will die they \"dance to the end of love\" - again and again deeply touching and moving moment.<br><br>Very very beautiful movie - a must see piece of art for those who are fond of thought provoking movies.","user":"shamborovsky","rank":[40,44]}]