[{"title":"A Strong Showing From Marilyn Manson","rating":6,"date":"24 July 2016","review":"A cerebral revenge film about two adopted siblings who fall in love, and hatch a plan to kill their abusive father (Mark Boone).<br><br>Critic Jerry Smith really sums up the world of this film when he says it's \"as dirty and grimy as it gets you can almost smell the dirt and grime.\" From the opening scene until the end, one cannot help but feel the same way. If this world exists somewhere – populated with nothing but drug addicts, trailer trash, and sex perverts – it is not a world any one would choose to live in.<br><br>What makes the characters interesting is how they interact within it. Our lead, Drew (Niko Nicotera), somehow managed to escape and right himself. But he has chosen to return in order to rescue his \"sister\", which means wallowing knee-deep in the filth and risking becoming tainted along the way. He walks a fine line between hero and anti-hero, with positive motives but questionable methods.<br><br>Also on the outskirts of this world is Pope (Marilyn Manson), a Cherokee loner who has no compunctions about killing for money. He seems like he could fit in, but chooses to live on his own, only entering the fray when summoned. He has the intellect of a philosopher or sage and this makes him more complex and interesting than your run-of-the-mill hit-man. And with his pale visage and dark hair, when he comes for you, it is as if you are face to face with the angel of death himself, or perhaps a wraith. (How much this look is intrinsic to the character or how much is just what happens when you cast Manson is unclear.) <br><br>The spark of innocence, cleanliness and hope comes in the form of Rooney (Gracie Grenier), a young girl rescued from a drug dealer's shed. Rooney has no character development, and speaks not a single word, but is obvious intended to be symbolic. Her light clothes and blond hair gives her a distinct brightness in this otherwise blemished cesspool. Her ultimate fate leaves more questions than answers.<br><br>One last character worth analyzing is that played by Michael Potts. I don't recall his name being mentioned before the credits, which is a good thing because even that much might give away his motives. He hints at his role, saying he was a \"bagman\" in a former life. On the surface, this might suggest he is a mob-connected, corrupt member of the police force. But once the pieces all come together, viewers might realize what his real intentions and occupation are.<br><br>All around, this film is praiseworthy, from the cinematography that could make you ill with how real it presents the world to the scripting of such deep characters. The casting is brilliant, and that bit of luck (Boone and Manson were later additions) really makes this a film that will demand an audience. Surely it is Manson's biggest and best role yet, and he's collected a wide fan base over the last twenty years.<br><br>\"Let Me Make You a Martyr\" premiered July 22 at the Fantasia International Film Festival. If you have the chance to catch an encore screening, do so. And if not, I would expect this film to gather some marketing momentum over the next few months. If no one has purchased the rights yet, they will soon.","user":"gavin6942","rank":[23,36]},{"title":"If you read the synopsis... You spoiled the whole movie.","rating":2,"date":"7 November 2017","review":"Got the movie, because i like revenge movies... It is dark, depressing, surrounded by scum bags and drug addicts. That gets really well presented. <br><br>But that's it. The acting is sub-par, the voices sound like they are non convinced with the script, and the story ? well, it is described in the synopsis. Nothing new. (and nothing wrong with that)<br><br>I feel these flaws basically killed the movie :<br><br><ul><li>It is filled with long unneeded dialogues. Most of them don't really matter, and skipping them wont affect the movie in the end. - I got annoyed with Slaine/Hondo first... And then i started noticing the same behavior. Everyone take long pauses to deliver lines, without purpose, perhaps trying to give it a hint of suspense. - Cerebral ? Intelligent ? Not a chance. It is a simple movie, you can follow it even half awake. Presenting the story in a non-linear way does not make it intelligent.</li></ul><br><br>I don't have an issue with slow movies. But this one is slow just because. And that bothers me. 30 minutes into the movie i was bored and waiting for it to be over.<br><br>I can't recommend this movie. Perhaps if you like to watch a favorite actor, but that's it.<br><br>So, summary : Sub-par acting, boring long dialogues, annoyingly slow pace.","user":"IvnSoft","rank":[8,11]},{"title":"A beautiful piece of metaphysical nihilism","rating":9,"date":"16 September 2017","review":"Don't mind those complaining about Manson's lack of screen time. The fact is his performance is terrifying and his characters mostly silent nature and fleeting appearance makes it. What's more they are overlooking a beautiful piece of Cajun Noir that is also a puzzling work that will stick in your head and force you to rewatch it. Beautifully shot it also contains brilliant performances. Think through it and this is a rewarding movie.","user":"Termin8","rank":[10,15]}]