[{"title":"lovely movie","rating":9,"date":"23 December 2016","review":"I don't get the bad reviews here, were they watching the same film? or maybe they have lost touch with their inner child. I loved this film and I'm not a kid I'm a 55 year old bloke. The film follows the book faithfully and keeps hold of Roald Dahl's odd humour well. The girl playing Sophie is an excellent Northern British actress who plays the part very well and is well cast, the giant character is funny, magical and full of warmth and charm with the CG very well done. Sure its a kids film but as such it is a very good one, if you want more adult material then don't watch kids films but if you like magical fantasy with humour and great visuals I recommend the BFG wholeheartedly.","user":"nickryall","rank":[116,140]},{"title":"I liked it","rating":8,"date":"27 November 2016","review":"I do understand that people are disappointed when watching a Kids movie and expecting an exciting and challenging plot. What is wrong with you guys? Just because it says Steven Spielberg doesn't mean this is a movie that is specifically designed for your needs. I am 30+ and I like this movie a lot, watching it from a kids perspective you even understand the breakfast scene and I bet all kids would laugh at it. It is kinda sad, seeing how incapable some people are recognizing a movie for kids as such. This is a proper 8! I like the accent, the CGI is fitting, the story is for kids, so if you are not a kid, stfu. I can fully recommend it to anybody with an open mind, who is not looking for the kids version of an Captain America Civil War CGI fest.","user":"creetar","rank":[98,127]},{"title":"A pleasure for the eye and the soul","rating":8,"date":"29 September 2017","review":"A beautiful tale brought to life by Spielberg. A fascinating universe makes up for the simplicity of the story (which can be forgiven since it's a children's book). Dahl's original story is beautifully retold on screen. The jokes and good ending most certainly make it an amazing, enjoyable family movie that is a pleasure for both the eye and the soul.","user":"margotmaesmm","rank":[17,19]}]