[{"title":"Revenge can send people on a journey that will take em places far darker than they would have ever dared go before.","rating":9,"date":"22 February 2015","review":"I was really impressed to see something this good from bollywood. The acting was phenomenal from nawaz, varun, huma and vinay. But the best part is the direction.\nThere was sufficient character development.\nU feel sympathy even for the bad guys. Sriram raghavan is a brilliant director.\nThe climax between varun and nawaz is another highlight of this film.\nRevenge can send people on a journey that will take em places far darker than they would have ever dared go before.\nThis film is also about the madness a person is capable of. This film is dark, violent, explicit n at times disturbing. The scene wher nawaz keeps on trying to escape from the prison was funny.","user":"Fella_shibby","rank":[27,28]},{"title":"A killer AXE matures to become good, a good TREE evolves to become SINISTER!!","rating":7,"date":"21 February 2015","review":"\"The axe forgets, but the tree remembers\".<br><br>There are two types of people in this world. The first type mourn for sometime after struck by a tragedy and move on with their lives. The second type, evolves to become tragedy themselves. Raghav/ Varun Dhawan is the latter in this disturbing movie called Badlapur. <br><br>This movie throws plenty of ethical questions at you. Which becomes really difficult to answer under the circumstances, and it becomes increasingly difficult to assess who is the protagonist and who is the antagonist. <br><br>Raghav gets struck by a shocking tragedy, from which he fails to recover. But, he evolves into something heinous, something SINISTER. He commits few acts which are considered to be menacing to the human race. But, he must commit them, for the purpose of his life had now changed, from a loving father and a doting husband he had now transformed into a dark, rather a very dark REVENGE seeker, a monster, a psychopath. <br><br>Layak/Nawaz loots a bank, but while doing this crime, commits a very EVIL act, this one act pivots the lives of many people in the future. This one act evolves a GOOD TREE into something SINISTER. But, the problem is, the AXE is punished for its mistake. Both, by the law of the land and by the forces of the nature. Yet, it has to suffer the wrath of the SINISTER TREE, which in the first place was turned into sinister by BALEFUL act of the AXE. <br><br>At the end of the movie Layak will be indulged in making a chair. While doing so, he will have a satisfied look on his face and his soul, for he knows that he has been thoroughly punished and devastated for the crime he had committed. The irony here is an AXE whose job is chopping down the tree had matured into something good, something which can create something new, even if it was a chair which it had learnt to create, but from a destroyer it had now become a creator. <br><br>DISTURBING: This movie contains few disturbing scenes, which can haunt you for sometime. When i say disturbing, i mean the kind of feeling that you got, when/if you have seen Anurag Kashyap's movie UGLY's climax scene, where you get to see the rotten dead body of a beautiful little girl. But, these scenes make this movie what it is.<br><br>This movie is a perfect launchpad for Varun from a happy-go-lucky college going kid into a serious engaging actor. Nawaz was brilliant as always. The rest of cast does a pretty job too.<br><br>Sriram the director does a fine job. Screenplay is good. Script is good. This is a very rare movie delivered by Bollywood. Now i will wait for the Blu-Ray of this movie and watch it again and try to answer those ethical questions which this movie shot at me when i watched it the first time. 7 *","user":"amoghbiet","rank":[15,16]},{"title":"Rise of the Indian Noir!","rating":10,"date":"22 February 2015","review":"From the first moment you set your eyes on the movie, you know that it's going to be highly stylish one. And it is! Not your Once Upon a Time in Mumbai sort of stylish. Rather stylish in truer and grittier sense.<br><br>The characters were just fabulous. You don't know whom to call the victim and whom the culprit. Just an unfortunate event that sets off a chain reaction transforming every one in the process for the good or worse.<br><br>The charms of the movie: Varun and Nawazuddin. The one I liked more was Varun for a very simple reason. Nawazuddin is an acclaimed actor though underrated. It's Varun who broke the stereotype chocolate boy image and got onto a new avatar. One that's disturbing and at the same time interesting. The only thing is, Varun's voice seemed childish in some scenes that demanded more impact. Other than that, Varun has my respect. Nawazuddin is Nawazuddin. I watch his every movie just to see him in action. Enough Said! <br><br>The twists and turns in this movie seemed natural. Never forced. Unlike other bollywood movies, where the twists are introduced out of nowhere, this one had twists that baffled me with it's sheer brilliance. The gore is limited to just few minutes but enough to make a huge impact.<br><br>The comedy is unintentional yet brilliant. The dialogues are not intended to make you laugh. But you laugh anyway. Even after the movie has ended. WOW! 2015 has been so good this far. Hope this continues for the rest of the year. Ugly, Baby, and now this.<br><br>I'll not urge you to watch this movie if you like masala movies Or, if you intend to watch a family movie. But, if you want a taste of the nastier grittier stuff bollywood has to offer, I can't think of a better movie right now than this one.<br><br>You'll either love this movie. Or, hate it. But this movie will definitely make an impact on you. That fer sure.","user":"alwaysplanb","rank":[25,30]}]