[{"title":"Interesting Ideas, Convoluted Execution","rating":5,"date":"14 June 2016","review":"Following \"Shisha no Teikoku (The Empire of Corpses)\", this is the second feature length anime adaptation of Itoh Keikaku's three novels. Similar to that film, \"Harmony\" tackles an alternate universe (this time set in future), where the world has achieved a whole new different level of human life-style. And also similar to \"Shisha no Teikoku\", its ideas have been over-cooked by pretentiousness.<br><br>It was always going to be a tall order to adapt a novel by Itoh Keikaku (SF writer who met premature death in 2009). The danger is that it is very easy to over-indulge and lose its audience. Or you could turn it into an action flick and fail to capture the novel's message. With \"Harmony\", it is the former case.<br><br>The film opens with an action sequence (something that might whet some viewers' appetite but it's the only action scene in the film on this scale) which triggers the main character's return to her home country, Japan. There she meets with her childhood friend who proceeds on to stabbing herself in the neck in front of our protagonist during their lunch together. Here's where the problems arise. The scene where it is supposed to be of a great shock to the viewers only achieves a \"meh\" response due to the fact that the film taking everything slow and calm. There's no sense of urgency to this scene but just plain repugnance to the visual display of blood fountain.<br><br>Every location, every dialogue and every character interaction in this film feel like the viewers are meant to meditate upon them. Characters appear and look important to the plot but then he or she disappears and we never see them again (the smuggler, the step-mother of another major character, the doctor, the comrades, the other doctor etc). The enigmatic dialogue seems to never get to the point which leaves the audience wishing for subtitles and pause button to decipher what conversation took place.<br><br>Another problem is the visuals. Normally I'd be praising a Japanese animation's visuals saying how my eyes grow watery just by looking at the screen. But not here. That is not to say the film looks horrible, but it actually does in comparison to other animated films made in Japan. \"Shisha no Teikoku\" had lots of problems as well but that film at least had top notch visuals. Here, everything lacks texture. Characters' faces look very strange in some scenes, architecture look absurdly inconvenient, the future environment shown in the film is very unremarkable and nothing leaves much of an impression. It doesn't help that the damn camera is constantly swaying around instead of focusing on something. It's always either moving around its characters or showing something else (like scenery for example).<br><br>Now, the film does have its charm. Our main protagonist, Tuan Kirie, is a strong female (and lesbian at that) character with consciousness and does not have big breasts. Mystery element that fuels the film is Miach Mihie, who has eerie vibe radiating from her just by her standing around in the scene. Her charm is seductive and it's no wonder Tuan is dominated by her in childhood. The plot does make logical steps up to some point and is very interesting. Anime fans will enjoy the \"End of Eva\"-vibe as the film progresses. The world-building also works greatly in the film's favor which amplifies the tragedy once it gets violent. Some segments of the film which relies on dialogue in tell-not-show style is done nicely too.<br><br>Although I kind of liked the film for above reasons, there's constant sense that it should have been better. That it could have been better by giving it more urgency, making it more shocking and critical in social commentary (Japan does have high teen suicide rate). It's another disappointment for \"Project Itoh\". Here's hoping \"Genocidal Organ\" is better. Much better.","user":"parknourie","rank":[14,19]},{"title":"Itoh is a terrible storyteller","rating":2,"date":"12 February 2017","review":"So I watched the second of the Itoh trilogy of movies regarding existentialism. The Empire of Corpses was bad, but could still keep my attention a bit through mindless action scenes and old book references. Harmony fails even at that, since it lacks action and is not even animated as well. You can spot the cgi much easier, while the artwork is blander.<br><br>The premise is about a world where pain and suffering have been eradicated thanks to the use of nanotechnology. Anyone taking a medicine stays healthy and happy while also not aging as fast. Unfortunately, teenagers cannot be pleased even with a perfect world, and feel the need to rebel against it, for the sake of rebelling. Our main characters are a bunch of psychotic lesbians who want to see the world burn by committing suicide. And if that sounds completely dumb to you, it can easily be explained with the typical excuse of \"they are teenagers, it makes sense not to make sense\" that anime are constantly using to cover up for bad characterization.<br><br>So the years go by, and only one of them commits suicide, while the other two get a job. There is one the plot considers the protagonist, although the only thing she is doing is being an excuse for providing info-dumps every five minutes. There is absolutely no personality to her other than hating the utopia she is living in. And by the way, she is living in an actual utopia, since there is nothing wrong with it.<br><br>The only people who are discontent with it are suicidal angst teenagers. Everybody else has a perfectly happy life. So, why do these psychotic lesbians hate this fine society? Because everyone is equally happy and thus everything is the same. It's basically \"nobody understands me, I'm so different, adults are stupid.\" By the way, that's completely hypocritical when they all have eye scouters which show numerical statistics for every individual, and they are clearly never the same. Your complaints are bull. <br><br>Even your job is bull. How did you become an investigator when you are so mentally unstable and everybody has access to your statistics? Why don't they fire you for constantly getting drunk and not following orders? <br><br>Anyways, the conflict of the movie is about some angst ass brainwashing people into committing suicide. Not because they want to, not because they hate their society, but because he takes control of their minds. No actual reason, and get ready for a lot of edgy scenes, full of gore for the sake of gore. This ass goes as far as demanding every person on earth to kill someone within a week, or be forced into suicide. Which causes worldwide chaos, as everyone gets crazy and kills everything on sight. Woah, this is so mature <br><br>Turns out the one causing all that is the lesbian who was supposed to be dead, because reasons. She has the supernatural ability to control peoples' minds, because reasons. And she did everything for the sake of a surprise attack on the eternal. Whatever, you ass, you killed half the population of earth. She even tries to further justify this genocide by saying she was raped as a child, and everyone must feel her pain. Something which did not happen in the utopia, but in a barbaric place outside of it. So basically, she destroyed a perfectly fine society, for something that happened to her not because of that society. She is even goes as far as saying she did it all out of love. She killed half the planet and her best friend because she loved them.<br><br>And then the movie ends by the plot device that is the protagonist simply shooting the psychotic lesbian. There was no battle, no chase, no resistance at all. She just sat there, waiting to be shot after info-dumping her bull for half an hour. What an amazing showdown. <br><br>There is not even any epilogue. We don't see the after effects of this disaster, aka what the survivors did after it was over, or how the society changed because of it. We only get scenes of nature with sad music. The author didn't give a damn about people, he only cared to say his bull philosophy and wrapping everything up.<br><br>This is the cardinal sin of most sci-fi. They treat characters as mouthpieces, and kill them off as soon as they served their purpose. There is nobody to care for in the whole movie. Half the population of earth gets slaughtered in a completely hollow way, and the only thing the author focuses on is spewing existential dribble and showing us trees and lakes.<br><br>There isn't even a sense of plot. The protagonist is constantly moving around the world, not because she follows clues but because she is told to go somewhere for the sake of info-dumps. She could have spent the whole movie talking over her phone and it wouldn't make a difference. Traveling doesn't mean anything, it's just pretty colors in the background. The setting doesn't matter, nor its people, because they are just excuses for existential dribble, which will bore the hell out of everyone within a few minutes. Final verdict, Itoh is a terrible storyteller.","user":"ThatAnimeSnob","rank":[13,23]},{"title":"This movie is beautiful to watch","rating":7,"date":"12 August 2019","review":"This movie is beautiful to watch. While the story is simple the underlying philosophy is not and the story flows well. This movie is mainly dialog and philosophy with only a few action scenes. The plot keeps you guessing and it attempt to subvert most common tropes, leaving you wondering who the good and bad guys are. I found the ending disappointing. While it had a great twist, it felt unsatisfying, however I notice the other ITOH movies are similar. I suspect the attempt is to subvert our common expectation of an ending, which it does well, but leaves us with an unsatisfying feeling. While not a classic, such as Ghost in the Shell, its well worth a watch.","user":"peterfmodel","rank":[1,1]}]