[{"title":"Please pardon the theatrics","rating":5,"date":"5 July 2016","review":"Misconduct is the most disappointing type of drama/thriller, the one which seems kind of watchable for thirty minutes or so and then, twist after twist, turns into a moronic potboiler.<br><br>Lawyer Ben (Josh Duhamel), whose marriage with Charlotte (Alice Eve) has seen better days, meets old flame Emily (Malin Akerman), who teases him into rekindling a relationship and at the same time turns out to be the current girlfriend of rich executive Denning (Anthony Hopkins), against whom Ben's firm, led by Abrams (Al Pacino), has clashed before. Emily shows Ben incriminating data from Denning's personal files, but is then abducted... or is she? And that's just the beginning of a series of labyrinthine, increasingly silly events.<br><br>The movie is a ball of noir tropes crumpled together, like a dead-serious version of The Big Lebowski, with femme fatales, trophy partners of smug millionaires, fake kidnappings, mysterious henchmen and a befuddled protagonist stumbling into a string of red herrings and non-sequiturs. Unlike the Coens' sharp, hilarious classic, Misconduct oozes stupidity from every frame.<br><br>Duhamel portrays his amoral lawyer doing an effective \"Timothy Olyphant passing a kidney stone\" impression - at least I suppose that was the intended goal. Byung-hun Lee plays the world's least proficient hit-man, one who attacks his victims by punching them while riding a motorcycle and yet fails to kill someone tied to a chair.<br><br>Former titans Hopkins and Pacino probably high-fived between takes at the thought of the umpteenth easy paycheck. Although Pacino does get to utter the line I put in the review title, which serves as a nice meta commentary on the last part of his career.<br><br>Poor Alice Eve is uncannily stiff and dead-eyed - not the world's greatest actress to begin with, she gets saddled with an absurd character. Also, casting lookalikes Eve and Akerman (both statuesque, clear-eyed, round-faced, long-haired blondes in their mid-thirties) as, respectively, the protagonist's spouse and potential lover, was an idiotic choice. You want COMPLETELY DIFFERENT TYPES for the contrasting roles of the Wife and the Temptress (think Emily Mortimer/Scarlett Johansson in Match Point), not clones.<br><br>Add Julia Stiles (in a minor part as a detective) as another long-haired blonde of similar age and facial structure, and this is starting to look like The Stepford Wives.<br><br>5/10","user":"petra_ste","rank":[34,36]},{"title":"Do not waste your time","rating":1,"date":"7 February 2016","review":"This movie was horrible. It's shocking to take so many good actors and make them look like they should be acting in a school play instead of Hollywood.<br><br>This is my first ever review and I felt I owed it to the public to help save themselves.besides for the horrible acting there was nothing in the plot that made sense. Nothing in the Way each actor reacted to their situation would have ever happened<br><br>Even the final twist which is supposed to be so shocking that you never saw coming is because it never made sense to ever have happened.<br><br>Please don't waste your time go watch the Kardashians. You'll feel smarter.","user":"elineger","rank":[89,110]},{"title":"Tony & Al sell soul, destroy legacy","rating":1,"date":"6 February 2016","review":"What dark deals were struck to persuade two of the greatest screen actors of all time to appear in this stillborn nonsense? What dirt do they have on Messrs Hopkins &amp; Pacino that they can be lured into this manure-filled paddock?<br><br>The script for \"Misconduct\" seems to have been pieced together from scraps of paper harvested from the bin of a ten-year-old struggling to produce a piece of creative writing homework. Someone should take this ten-year-old to one side and have a quiet word about the rudiments of drama; firstly, have a protagonist who we care about. Secondly, don't expect us to believe an intelligent lawyer would make the most catastrophic, rudimentary slip-ups when committing a crime; thirdly, have the story make even a little bit of sense, without plot holes big enough for the orbit of Halley's comet.<br><br>Special mention must go to Alice Eve, an actress so monumentally bad that in a just world she would be laughed out of the room if she auditioned for the part of the back end of the donkey in her local comprehensive school's nativity play. She seems to think that what's required for this role is to approximate one of those kittens you see on Youtube falling asleep in its food bowl.<br><br>Only go to see \"Misconduct\" if you're atoning for sins committed in a previous life.","user":"Filboid_Studge","rank":[121,153]}]