[{"title":"Screw the haters, this is a real fine Western","rating":7,"date":"25 January 2017","review":"If you are a fan of classic Westerns, you'll find yourself glued to the screen enjoying every minute of this film. <br><br>Disclosure: I am 62 years old as I write this, so I've seen 'em all. And watching this one, I couldn't help feel like it was 1967, or thereabouts, what with the steady camera-work, the superb cinematography capturing all the dusty glory of New Mexico, U.S.A. <br><br>And the soundtrack! Not some canned muzak, not some minimalist guitar scratchings, but a full-blown beauty of a musical composition that took me right back to the Spaghetti classics. <br><br>Now, this won't win an Oscar, but dang if it didn't make my Friday night popcorn and beer movie night.<br><br>\"In A Valley of Violence\" is a total winner. p.s....the dog is an unbelievably good actor.","user":"vcgraves","rank":[90,112]},{"title":"A Well-Acted, Exciting Western","rating":8,"date":"13 April 2017","review":"In a Valley of Violence follows a travelling cowboy who, after stopping by a small town, unintentionally starts conflict among the more powerful members there. <br><br>Let's start with the obvious part: Ethan Hawke. He's fantastic, as per usual. I don't think I've ever not been impressed by this guy, and that trend continues here. John Travolta pulls off a solid performance as well, playing one of the most interesting characters in the movie. And James Ransone does the same, pulling off a good ol' western hothead. Personally I don't think that Taissa Farmiga was very fit for this role, but she did her best and thankfully fails to take anything of significance away from the movie. <br><br>The writing is good as well. The movie builds the characters and conflict for a while before anything of real significance happens, and it makes it all the more effective. It excels at building tension, making the last 40 minutes of this movie just that much better. <br><br>Speaking of the last 40 minutes, they're awesome. After an hour of solid build up, we are treated with some great western action. It's tense and exciting, yet not over-the-top. It's just right. <br><br>Overall I really enjoyed In a Valley of Violence. The acting, writing, and action are all great, and in the end I would definitely recommend it.","user":"SquigglyCrunch","rank":[37,49]},{"title":"a pleasure for genre fans","rating":7,"date":"14 January 2017","review":"Considering this is basically what Ti West cooked up following a double viewing of John Wick and any given Sergio Corbucci flick, it's... really f***** good! Damn I'll just go ahead and say it: I was more entertained by this than John Wick (some of that I simply chalk up to Hawke being a more emotional and curious presence than Reeves, personal preference, and beyond the premise and some key moments it's not exactly the same as that).<br><br>This is no masterpiece or anything, and I don't necessarily think it was trying to be. West clearly loves this genre, and wants to do his own twist on it, which carries some especially graphic violence (if you had trouble with movies like The Thing, don't watch this), and some strong supporting work from Karen Gillan and John Travolta (the guy who plays Travolta's son, the real main bad-guy, is one note but the actor plays him for all his worth).<br><br>This kind of well-produced, surprisingly and wildly funny straight-faced homage western (especially near the super intense and, as the title says, violent climax, that threw me for a loop, such as everything with the one guy who protests being called by his nickname by John Travolta and demands to be called 'Lawrence') is something that pleases me. If it's ever on TV I'll stop and watch it. 7.5/10","user":"Quinoa1984","rank":[32,44]}]