[{"title":"Great thriller","rating":8,"date":"7 December 2014","review":"I'm an avid South Korean movie watcher. It's getting to a point where I'm seeing a least 1 per week.<br><br>There's a reason for that, they're great movies, really great movies.<br><br>The funny twist that I see on many of these police movies is that the police corruption, including the main character is considered as a norm. There is no glorifying the main character as a hero, standing above the dirty sea untarnished. He is just as dirty as the rest.<br><br>Again, a similar plot lines that runs through here is the main character is not the most likable character. Also it's more a story on a man who just happens to be a police officer rather than a police story.<br><br>These are things that have popped up quite a few times in other South Korean thrillers I've seen and it still has not gone stale.<br><br>The quirky, dirty, off beat, stylized, South Korean action movie is incredibly refreshing when placed up against the rest of the world.<br><br>This is a great movie, doesn't get into my top ten of South Korean movies but it's getting harder and harder to get into that top 10. With all the fantastic movies out there a great movie doesn't make the cut.","user":"reallyevilboy","rank":[42,52]},{"title":"South Korean cinema in \"fun mode\".","rating":10,"date":"16 October 2014","review":"Director Kim Seong-hoon's sophomore film A Hard Day arrives 8 years after his directorial debut, How The Lack Of Love Affects Two Men was released back in 2006.<br><br>Now, this film is a nerve racking roller-coaster ride, so the less you know going in the better. I shall attempt to introduce this film in one sentence: A comedy-action-thriller about the chaos that ensues after a detective is involved in a hit and run.<br><br>The film smoothly and skillfully balances the dark comedy, action and thriller elements, giving us ingenious set pieces (a particularly memorable one involving a toy soldier...) and also well-paced and effective suspense. The film does not waste a shot, let alone a scene to make audiences laugh, squirm and be intrigued through it's twists and turns. It's tightly-wound from beginning to end and will surely be one of the best times you'll have in the cinema (or in your home) this year.<br><br>Lee Seon-gyun (who you may recognize from Hong Sang-soo's films such as Nobody's Daughter Haewon) plays the lead role of detective Ko, a divorced father of a little girl who may not be the most ethical of cops. Lee carries the film, delivering a charismatic and humorous performance that makes us root for his character when he is faced with tough situations and pitted against Cho Jin-Woong's formidable protagonist. Kudos to Cho for interestingly pulling off a role that could have easily been bland. <br><br>This film was also filmed beautifully. It's gorgeous to look at, thanks to cinematographer Kim Tae-Sung, who gives us dynamic and impressive shots (one that immediately comes to mind is an overhead shot during a chase).<br><br>It's refreshing to see a South Korean film that's playful and never stops being fun, after the recent slew of superb but disturbing, dark thrillers such as I Saw The Devil, New World and The Man From Nowhere. Don't be fooled, this film has its dark moments. Most importantly, it holds one of the quintessential elements of movies: taking audiences on a ride that endlessly intrigues and keep them wanting more, having no clue where the next moment will take them.","user":"alwayshungryy","rank":[42,56]},{"title":"True Roller coaster.....Gripping...Enthralling...","rating":9,"date":"18 October 2014","review":"Whoa! what a thrill efffin ride!! this was my first reaction after watching the movie!!i gave it a standing ovation.It has been a long long time since a movie captured my attention from beginning to end,without even a single dull moment in its running time of over 90 minutes. I was so looking forward to see this one,and boy did it mesmerize me!and how!!<br><br>The movie has a dark undertone to its mischievous and reckless plot.Here we have a tense,gritty protagonist Lee Sun-kyun running through several escalating situations on an unfortunate day leading to a face off with a manic antagonist.There is a swift swap between the antihero-hero nature of the protagonist.I don't want to give away the plot but i will give you this,the plot is just exploding with an unrelenting exuberance that does not stop until the end credits start rolling.There is a never ending sense of what happens next.This relentless thriller captivates your attention from the opening shots,and never lets go.Special credits to the lead actors for they have done a neat job playing the characters straight,the only way to play it for a gripping plot such as this.Sometimes the movie feels like a highly stylized comedy of errors with some ingeniously crafted action sequences.<br><br>All in all 'a hard day' is a well shot genuine thriller disguised as a crime drama with underlying dark humour.It has all the scope of becoming a future cult classic.I would be surprised if it didn't.You would not be disappointed even if you watched with high expectations.<br><br>9/10.Cheers.","user":"jithinjofrancis","rank":[25,37]}]