[{"title":"this is magical Japanese exploitation joy","rating":8,"date":"6 July 2017","review":"The joy of Yakuza Apocalypse is that it's Takashi Miike doing that Takashi Miike does, what he has done, since the 90's and yet it's a filmmaker even more confident in his skills and more assured in the timing of his shots and cuts. Thinking back to another gonzo-Yakuza movie like Dead or Alive or even Ichi the Killer, he reveled in more of a sloppy, throw-lots-of-WILD-things-at-the-wall approach to his compositions and how he would cut, but now he's gone through films like 13 Assassins and Hara-Kiri, where he found a way to balance action and a more (what's the damn word here) patient way to get the audience into the drama. And yes, drama may sound strange in a movie that could also be called YAKUZA VAMPIRE SHOWDOWN and be entirely accurate. But it is a joy as a fan to see Miike in full command of his powers as the truest Gonzo filmmaker in the world. Does it mean he's the best? I dunno. <br><br>All I do know is that in Yakuza Apocalypse, if you're on board for the kind of insanity as far as action set pieces, characters, and plot turns that Miike has done in his career - the kind of 'don't give a f***ery' that has made him a household name for cult film enthusiasts - you get things like... a man in a green frog suit who can do martial arts to such a point where Bruce Lee runs for the hills, a duck-billed... man, no, really, he has duck bills in his mouth (and refers to this green-frog-suited man as \"the world's most dangerous terrorist\"), and, of course Yakuza vampires. How our hero, a young Yakuza who just has always wanted to do right by his boss - and that his boss gets his ass kicked and head chopped off by a rival looking to take over (you can tell since he speaks English and has like a Shakespeare-style neck collar, and his own bad-ass kung-fu fighter that can kick anyone into oblivion), gets turned and then makes others vampires.... well, you have to see it for yourself.<br><br>I think the biggest knock I had against this, at least during the first half, was that it is too long. At 115 minutes I'm sure where are scenes here or there that could have been cut, things involving some of the lower-rung Yakuza gangster men (the ones who, you know, are especially idiots but loyal and tough Yakuza guys, they more or less last until the climax too), and made it a little tighter. At the same time, I'm not sure looking back I'd want Miike to close and bottle up his full Miike-ness from the audience. By the time he and his writers go into action over-drive, which involves the entirety of this whole small... town, village, whatever you call it (there are also Western influences that are impossible to miss involving showdowns in the street and shots aping such things), it becomes one of the director's high points of a long career. <br><br>He and especially all of the insane stunt performers, who are fighting in such intense set pieces and choreography that I almost felt bad for them, but just almost (that poor guy in the frog suit, what he must've gone through) give it their all, up until the final frames where I threw up my hands going, \"SURE?! WHY NOT!!??!\"","user":"Quinoa1984","rank":[5,5]},{"title":"Crazy in a positive way","rating":8,"date":"8 March 2016","review":"\"Yakuza Apocalypse\" is one of last year's most flamboyant movies. It shouldn't come as a surprise that it's the most recent movie of famous Japanese director Takashi Miike, a diversified workaholic who shoots numerous movies each year and who has gained critical acclaim with psychological horror movies such as \"Audition\" (1999), gangster movies like \"Family\" (2001), experimental flicks like \"Gozu\" (2003), historically inspired action movies like \"Thirteen Assassins\" (2010), courtroom dramas like \"Ace Attorney\" (2012) and brutal revenge flicks like \"Shield of Straw\" (2013). Obviously, there is a lot of hit and miss in this director's extensive filmography but I have adored most of his movies. No matter what genre Takshi Miike touches, his movies are often direct, intense and surprising and he has a very distinctive style that some people love and others despise. There are only few people who would describe Takashi Miike as an average director and his movies mostly get very positive ratings or extremely negative critics which is the reason why most of his movies still have balanced averages. ''Yakuza Apocalypse'' is definitely a controversial movie. Some people might get lost while watching this film while others will adore this movie's eclectic style.<br><br>It's not easy to describe this unpredictable movie. It's basically a mixture of a gangster movie with a supernatural horror film and an absurd fantasy parody. \"Yakuza Apocalypse\" works a lot with contrasts. It features a rape scene and a brutal assassination on one side but humorously exaggerated special effects and slapstick fight choreographies on the other. There are profound dialogues but there is also a lot of situation comedy. The mood of the film can switch from brutal to light-hearted, from emotional to superficial and from serious to ridiculous in a few minutes. It's remarkable that the director still doesn't lose the film's guide line and manages not only to tell an intriguing story but also to include some smartly hidden social criticism here and there by ridiculing conservative gangster codes.<br><br>\"Yakuza Apocalypse\" tells the story of a disrespected young Yakuza who wants to avenge the death of his mentor who was assassinated by the mob of an international gangster syndicate. What makes this movie outstanding are the eclectic characters in this potpourri of genres. You will encounter a weird woman whose head is filled with a noisy liquid, a smart Asian gangster who looks and talks like William Shakespeare, an Indonesian martial arts expert, a hyperactive kappa goblin and a giant frog that wants to destroy the world. Expect the unexpected and you will get some very original entertainment.<br><br>In the end, even by Takashi Miike' standards, if he has any, this is one of his weirdest movies along with \"Gozu\" which is one of my favourite films of all times. This movie here is a little bit less atmospheric and the acting is only of an average quality. Still, this film offers multiple fireworks of creativity and has the potential to become a true cult movie in the future in the key of odd, recent North American films like \"The Interview\" and \"Tusk\". This flick has so many incredible genre changes, hilarious details and weird characters that it can be watched a dozen times without getting boring because there will always be something new to rediscover. \"Yakuza Apocalypse\" offers many flamboyant scenes that should lead to controversial debates with your friends but you can also switch your brain off and enjoy this incredible fun ride on your own. If you're expecting a serious mainstream movie though, you will be disappointed and get the exact opposite. Those who aren't familiar with Takashi Miike's works should maybe try out \"Gozu\" and other movies before approaching this pleasant oddball.","user":"kluseba","rank":[11,14]},{"title":"The definition of \"cult\"","rating":6,"date":"2 April 2017","review":"YAKUZA APOCALYPSE is a typically demented slice of Japanese mayhem from Takashi Miike. It's a fresh and original film in an increasingly jaded world of all-too-familiar cinema, an often stunning blend of visceral delights. The plot mixes in outrageous comedy, a zombie-style vampire outbreak, and the yakuza genre into one unforgettable whole, in a style that could only be handled successfully by Miike or perhaps Sion Sono.<br><br>My main problem with this film is just how obtuse it is when comes to meaning. Things happen for no real reason and are never tied up. It just \"is\". A vampire apocalypse sweeps Japan but that's only incidental to a main action-adventure template in which martial arts comes to the fore. The character of the \"world's ultimate terrorist\" is a case in point; it's very silly, stupid in fact, and makes no sense at all, and yet it's such a great and eccentric addition to the film that you can't help but love it.<br><br>Miike adds many diverse elements into this heady brew, from outrageously funny character performances to gore and well-choreographed action. Yayan Ruhian, from THE RAID series, is present here and a great addition to the story, just as bad-ass as you'd expect. The early part of the film feels rather unfocused but it all builds to one supremely unforgettable climax which is as delirious as you could hope for.","user":"Leofwine_draca","rank":[4,4]}]