[{"title":"A decent alien abduction film that suffered from some bad choices.","rating":6,"date":"6 October 2018","review":"Overall, I'd say Beyond the Sky is a pretty good alien abduction film. But a few blunders here and there stop it from getting a better score.<br><br>The movie makes use of some \"cam shots\", as it's basically following a video \"journalist\" (more of a blogger as he has no professionalism) who wants to disprove alien abductions. Fortunately it doesn't suffer from the usual shaky cam, blurry nonsense the \"found footage\" movies do. The camera shots are used in places and mostly done quite well. Most of the film is standard movie angles and all with just bits of cam footage tossed in at decent moments. Such restraint is definitely appreciated.<br><br>On the flip side, the so called journalist really doesn't deserve the title. He basically aggressively accuses alien abductees of lying, constantly getting in their face about things. While it's fine to not be a believer, to basically tell people that they're lying to cover up other traumatic experiences and badgering them about is downright stupid, and usually would result in a punch to the face. As a journalist, or even just a human being, the way the main character treats others is downright shameful.<br><br>The special effects are decently done (though most of that budget goes into the last few minutes of the movie). No cheesy special effects that you'd see in a SyFy flick. They have a budget and work well within it to make the most of the presentation.<br><br>One of the biggest flaws for me though, is that the movie basically does one of the stupidest things any show or movie could do. It shows you parts of the ending, and then jumps back to X days earlier. NEVER do that. EVER! You're basically spoiling your movie right from the start, which for a lot of people is enough to just give up on it right there. When you know the outcome, then all the rest of the movie becomes mostly meaningless. Everything that could have been an interesting reveal basically becomes an expected outcome.<br><br>If not for the horrible idea to put key parts of the end right at the start, this movie would have probably scored an 8 out of 10. It's really a wonderful low budget alien abduction film with a lot going for it.","user":"lord-blade","rank":[38,47]},{"title":"All in all not too bad","rating":5,"date":"17 August 2018","review":"The overall storyline is ok, with just enough suspense and unexpected twists. The best actor performance comes from the supporting cast, Claude Duhamel and Peter Stormare. Some sequences are lacking in directing artistry. For me there is also too much use of hand-held camera (found footage technique).","user":"Erik-SG","rank":[21,29]},{"title":"Interesting premise but makes 3 twists too many","rating":3,"date":"16 November 2018","review":"I went into this thinking it would be a found-footage film and the premise was enough to get me interested. Instead it's shot from a traditional perspective with some \"first person\" and \"documentary\" shots sprinkled in.<br><br>To save you from having to actually watch this mediocre film here is a story breakdown:<br><br>Things start to spiral out of control plot-wise after the main character Chris meets Emily, the girl who claims to have been abducted multiple times and says she will be again on her birthday. Chris and Emily quickly develop an unconvincing relationship, which ends up being important later.<br><br>The first twist drops when Chris, Emily, and Chris' camera man buddy get \"abducted\" by \"aliens\" who turn out to be a local businessman and another dude who apparently have been going around kidnapping people and shooting them full of \"military grade hallucinogens\" (actual line from the film). These nefarious men-in-black are trying to keep the UFO-tourism money flowing, I guess? Chris manages to escape in a contrived fashion and free Emily and his camera man buddy, and the three of them find they've been taken to a remote location with little possibility to escape - cornered by their captors, until...<br><br>Twist 2: there really ARE aliens!<br><br>In come the real aliens to save the day - they somehow know that the businessman baddie is the baddie and zap him, causing him to have a heart attack, or something, and he falls off a 5 foot ledge to his weirdly-bloody death. Then the aliens begin the process of \"beaming up\" Emily - only Chris jumps in at the last moment and gets beamed up with her. Then Chris, for some reason, wakes up onboard the ship to find him and Emily unattended, except Emily is having her memories modified, for some reason, even though Chris isn't, for some reason. Chris manages to free himself and Emily (for real, both the real and fake alien captors in this film are seriously incompetent) and the two of them wander the alien craft until they run into the actual aliens and we find out...<br><br>Twist 3: the aliens are actually FUTURE HUMANS<br><br>This is where the plot completely goes off the rails. Apparently the aliens are actually humans from the future who have evolved to the point where they \"only see logic\" and have apparently lost the ability to feel emotions... I guess? After they witness the budding relationship between Emily and Chris, they reveal themselves and explain that they have actively been removing the bad memories from at least the two of them for their whole lives, in order to change their future, or something. In the end it doesn't matter because they send Emily and Chris back to Earth and the movie pretty much ends. There's a time skip \"seven years and 9 months\" 🙄 to the birthday party of Emily and Chris' child, which I suppose is supposed to contrast Chris' bad memory of one of his own birthdays which is highlighted throughout the film (and is one of the memories that the \"aliens\" partially hid from him).<br><br>So basically nothing happens in this movie except for Emily and Chris meeting and falling in love - oh and also there are some aliens aka future humans who abduct people for some reason... and a guy who was pretending to abduct people until he gets killed by the real aliens.","user":"wellslogan","rank":[19,26]}]