[{"title":"Who asked for this?!","rating":3,"date":"3 January 2020","review":"Why was this made? Why did they think it was a good idea to remake this? Why does it take the plot of the original film and throw it out the window? Why does it look like an uninspired, totally predictable, and an overall sorry excuse of a horror film?! It's 2020, people! A new decade is already here... STOP REMAKING STUFF THAT DOESN'T NEED TO BE REMADE!!<br><br>So get this: it's a remake of the film that is a remake of the Japanese Horror film: Ju-On: The Grudge (fantastic movie, BTW) and they took that and made it into one of the most predictable stupid films ever. And it's already 2020, and I thought unnecessary remakes were outlawed (they should be). I don't even see who is the target audience of this film, and I don't see who will watch this film a second time.<br><br>Weak Storyline, Bad Cinematography, and Unnecessary Jump Scares makes this film not worth your money. What a complete disaster! TERRIBLE film!!","user":"burkholdermicah","rank":[222,330]},{"title":"I liked the horror scenes and movie very much but the climax..........","rating":8,"date":"4 January 2020","review":"I really felt great that the horror scenes are quite good and until the end i enjoyed the movie but the climax will end like horrible . It could have done better with some more story and good climax.","user":"ShajahanSmart","rank":[50,83]},{"title":"Uncomfortably between the two ends of the horror spectrum","rating":8,"date":"3 January 2020","review":"I went in with very low expectations and was pleasantly surprised. It's a really beautiful movie with some great effects, an excellent soundtrack, and a few script/editing issues that keep it from being great.<br><br>I think this movie (The Grudge 2020) falls into a weird camp. It's too \"jumpy\" for the A24 crowd of horror fans that want something more dread focused that inspires contemplation, but too slowly paced for the thrill seekers. It does both things well enough in my opinion, but it's not thoughtful enough to linger with you after the movie, and not thrilling enough to impress those looking for a shocker. Still though, I thought that the cinematography was beautiful, the soundtrack stood out to me as a step above, and some of the gore/violence was impressive visually. There's a crowd that would enjoy this movie, but I don't think it will find them. Hopefully it can find some attention as the years go by and people realize that this does some things very well, and is by far a much better movie than the 2004 US remake.","user":"nicholast1990","rank":[74,128]}]