[{"title":"Hidden little gem","rating":8,"date":"20 December 2017","review":"This movie sneaks up on you. You aren't getting the recent rash of over the top brash and crass movies of the current era. You are getting a cute and in the end a heart-warming comedy.<br><br>To begin, this movie comes at us from a small, down on its luck town who's main employer \"The Mill\" has recently closed. Maynard is one of the few remaining business owners, and his corner store is the focal point of the town. This is much like many small towns across America, so many viewers can relate.<br><br>The movie portrays a few pretty typical characters you might also find in those small towns and exaggerates their personalities just enough to make them quite amusing, but not overdone like an SNL skit.<br><br>One character that IS over the top is the \"Monster Hunter\" that comes into the town searching for bigfoot. (In a not so veiled spoof of Bear Grilles or similar reality star.) He is ridiculously funny, but it somehow fits.<br><br>To Me, this is a great movie to watch with the whole family. Three are a few scenes with minor sexual overtones, but PG is how I would rate it. And I can only recall a few occasions of foul language.<br><br>I mention these things because I feel the shocking nature of many films today is borne of laziness. Writers and directors who are out of ideas and fall back on foul language and shock value as an answer to comedy. This movie breaks that mold and still generates the laughs.<br><br>So the bottom line is, if you are looking for a caustic f-bomb fest, this isn't the movie for you. Go watch The Hangover or something else. Those are funny movies for sure, but his movie takes a different route.<br><br>This movie has great acting, a great story and surprisingly funny scenes. A great way to spend an hour and a half with the family!","user":"markjunk-66850","rank":[29,41]},{"title":"Perfect Holiday Surprise","rating":9,"date":"4 December 2018","review":"Look for references to A wide variety of movies. It was surprisingly enjoyable and proves that Michael Shannon can do anything.<br><br>I can't believe it took me the entire film to realize why it's titled \"Pottersville\".","user":"beckett2498","rank":[13,17]},{"title":"A funny movie for non-jaded critics","rating":8,"date":"18 December 2017","review":"Hi,<br><br>I ran across this little gem on a Saturday night when cruising Netflix. I was intrigued by Ian McShane and Ron Perlman. I wasn't expecting that much and I had an enjoyable time watching the actors bring the characters to life. Ian is very funny playing a hunter and Ron Perlman does an excellent job of playing a country sherriff. I read the previous reviews and I'm not we were watching the same film. I have relatives in a small town in east Texas and the themes of a small town dependent on a mill closing hit close to home as when industry leaves a small town, there often aren't a lot of opportunities. Perhaps I just have a calif attitude but I was laughing at the same jokes when I watched the next afternoon with friends. Perhaps not everyone noticed that the Bigfoot costume was what special forces actually wears for camo wear. There are a lot of other subtle jokes in the movie if you are paying attention. Cheers!","user":"alan_t_franzen","rank":[31,48]}]