[{"title":"I don't get it","rating":5,"date":"31 May 2017","review":"All I want is somebody to explain to me why Becky apparently stabbed the sister, who was having an incestuous relationship with her brother, to death. Also, while you're at it, why did the siblings' father serve 12 years time in connection with the death? The scenery and cinematography in this film was otherwise gorgeous and suitably brooding. The acting was able enough. But as a person who enjoys stories that have some cohesive purpose, I was left dumbfounded by the plot.","user":"bseaman-20248","rank":[5,5]},{"title":"Nice Scenery","rating":3,"date":"14 May 2017","review":"Spoilers here in... Dartmoor looks great here and will make you want to visit. It's beautifully shot. That's almost it though. There is some good tension here as the guy plays mind games with the two women. There is mystery. The film feels a little French with it's countryside, sex, mind games and lurking violence scenario. There is a particular scene that shows his controlling rapacious attitude towards women, it's very brief(ha ha)but it does make you wonder if that was necessary and how the partici-pants(ha ha) felt afterwards. But the plot holes! How did the guy catch up with the women so soon, why did he run over and kill the one woman, and the crucial one: why did the other woman stab the guy's sister?? - we're not given a good reason for this and it's plain they just wanted to introduce a twist. It didn't need a twist. A twist for twist's sake that lets everything before it down. A coherent plot would've made this film.","user":"iloveandrei","rank":[5,5]},{"title":"Nearly. But not quite.","rating":4,"date":"29 March 2018","review":"I really wanted to like this. The moors are a suitable setting for anything eerie and I love an English approach to ghost stories / thrillers. <br><br>But this never really seemed to get going. The requisite elements were there but the blue touch-paper never quite fully sparked it all into life.","user":"goldenarrow-99823","rank":[3,3]}]