[{"title":"Smart and Entertaining","rating":9,"date":"5 July 2019","review":"The review on Critical Popcorn pretty much nails it. This is a smart, well thought out and extremely well acted film. Kudos to Savante, Withers and Emery for taking chances on a low budget independent film. The writer/director deserves credit for being brave enough to write something that we don't see much of anymore. A provocative, funny, extremely clever, artsy, dark comedy. Avalanche surprised and entertained me.","user":"sylvias_in73","rank":[16,18]},{"title":"not a smasher but","rating":5,"date":"27 June 2019","review":"Its a triangular drama, and the partakers has to accept the realitys whether they like it or not. it basically a one location story, with 3 actors , one sneak peeking and hiding while viewing the surveillance cams he has placed around the house, and his girlfriend making out nwith a stranger, and dives into adultery in a swell of happiness.<br><br>its a basic product,but with good actors,who knows their lines and moves, and the filmographic quality and by viewing the daylight in the background tells me that there are some degree of profesionalism in the making of thie avelanche of broken trust and feelings.<br><br>its the kinda humour you either love or hate, i didnt like it but neither hated it.<br><br>i paid special attention to the music dept, with omri lahav behind the tangents and strings. he is an extremely gifted musician, that i got in touch with after viewing him at youtube, playing the theme songs from the pc game jazz jackrabbit on his electric guitar, that gave me goose bumps all over.<br><br>so if your in for a sublime sedat and a bit raunchy movie with some tiptoed comedy then the grumpy old man can recommend","user":"ops-52535","rank":[10,13]},{"title":"I liked it","rating":8,"date":"22 July 2019","review":"Shocked to see the score on this movie -- I liked it, you know. I think the \"not a smasher guy\" was onto sumthing. It's not for everyone, I get that, but it has things in it that everyone can enjoy. Patience. It's not a super hero movie. And I thought the first half was slow, but when you get to the end, it's like it all comes together. Like it all makes sense. You get this full feeling and you like and hate the characters all at once LOL","user":"cheesesandwich-50243","rank":[6,7]}]