[{"title":"\"Ricki and the Flash\" features a good premise and outstanding acting, but mediocre writing and directing.","rating":6,"date":"9 August 2015","review":"It has to be tough to be the child of a living legend, especially in show business, but Mamie Gummer seems to be handling it quite well, thank you very much. The oldest daughter of multiple Oscar winner Meryl Streep, Gummer is making a name for herself in the family business. Like Emilio Estevez (son of Martin Sheen) and Angelina Jolie (daughter of Jon Voight), Gummer uses a family name (her father's last name) while establishing her own identity in film (and television). Like Jaden Smith (son of Will Smith), Gummer has joined her famous parent on screen while developing her acting skills. As a toddler, Gummer had a role in her mother's movie \"Heartburn\" (1987). As an adult, Gummer played a younger version of her mother's character in 2007's \"Evening\". (Gummer also had a brief scene in Streep's 2006 film \"The Devil Wears Prada\" but that scene was dropped in editing.) In 2015, it's the mother-daughter team playing mother and daughter in \"Ricki and the Flash\" (PG-13, 1:41) – and it's kind of hard to decide which actress did a better job.<br><br>Streep plays the title character, Ricki Rendazzo, an aging rock musician. The film opens with Ricki playing a set of musical covers as the singer in a local bar's house band. She obviously loves what she's doing, but it's short of where she hoped she'd be, having to hold another job as a supermarket cashier to make ends meet (and then, just barely). Then, not long into the story, her other identity beckons. Pete Brummel (Kevin Klein) repeatedly calls her cell phone until she finally answers. He's not calling Ricki. He's calling his ex-wife Linda to tell her that their daughter, Julie (Gummer) has been dumped by her cheating husband and dad is worried about her. It's an understatement. Although she can barely afford the ticket, Ricki-slash-Linda hops on a plane from L.A. back home to Indianapolis to be there for her daughter. It's the most she's done for any of her children in over 25 years.<br><br>As you might imagine, in her kids' eyes, this grand gesture isn't nearly enough to make up for leaving the family to pursue her rock and roll fantasy in the late 80s – and having precious little contact with them since. Ricki's appearance sends the very depressed and highly-medicated Julie into a rage and a family dinner which includes her two sons (Sebastian Stan and Ben Platt) goes only a little bit better. During her short visit, Ricki makes considerable progress pulling Linda out of her funk, but when Pete's current wife (Audra McDonald) returns from a visit with her sick father, it's clear that it's time for Ricki to leave. It's back to California, back to the grocery store, back to the bar stage and back to her lead guitarist pseudo-boyfriend, Greg (Rick Springfield). As Ricki tortures herself over the sorry state of her relationship with her children, Greg comforts her and encourages her not to quit trying to make amends. As badly as she wants to make this better, an opportunity that arises to do just that still makes for a difficult decision.<br><br>Considering the great pedigree of \"Ricki and the Flash\", the movie should have been better than it was. Oh, don't get me wrong – the acting is top notch, but other aspects of the film were disappointing. Streep does her usual outstanding work (not to take her for granted, but this is Meryl Streep were talking about here) – and there are award-worthy performances from Streep's fellow Oscar veteran (and former co-star) Kevin Kline, definitely from Ms. Gummer, from McDonald and even from Springfield. I expected more, however, from Oscar-winning director Jonathan Demme (\"The Silence of the Lambs\") and Oscar-winning screenwriter Diablo Cody (\"Juno\").<br><br>Except for one great line late in the movie, the dialog is unremarkable and often the story feels forced. In one scene, Ricki points out the double-standard for male and female rock musicians who are absentee parents, but fails to acknowledge that Ricki could have still done had more of a relationship with her children than she did. A few references are made to Ricki being a conservative (even though she's a musician in California and her family back in the mid-West seems pretty liberal), but never gives any context for that characterization or even makes it at all pertinent to the story. The script also fails to explain anything about the circumstances surrounding Ricki's departure from the family or much about how her career developed over the ensuing quarter century.<br><br>Throughout the film, questionable writing and directing choices overplay many characters' disdain for Ricki to the point that the ultimate resolution of the story feels far-fetched. Even some of the camera work and editing seem unnecessarily melodramatic. The theme of family reconciliation is worthy and heart-warming, but for a story of an aging rocker trying to reconnect with family left behind, 2015's \"Danny Collins\" is a much better story and with equally good acting. The acting is the main reason to see \"Ricki\". The rest is just a small flash in the pan. \"B-\"","user":"CleveMan66","rank":[49,62]},{"title":"A film committed to emotion rather than emotional mawkishness","rating":8,"date":"10 August 2015","review":"\"Ricki and the Flash\" opens with Meryl Streep, boasting acid-washed articles of clothing that looks like it was stuffed away in a 1970's time capsule, half-braided hair, complete with rings, bracelets, and accessorized trinkets all over her body, belting out \"American Girl\" by Tom Petty. If this doesn't make her one of Hollywood's finest character/method actresses, I don't know what does.<br><br>Streep plays Linda \"Ricki\" Rendazzo, the frontrunner of a band known as \"Ricki and the Flash\" that plays largely at dive bars and seedy nightclubs. Linda, in the meantime, slaves away at a supermarket job, bossed around by a manager half her age, making paltry wages whilst being estranged from her immediate family. One day, her ex-husband Pete (Kevin Kline) calls her up to inform her that their daughter Julie (Mamie Gummer) is going through a messy divorce after discovering her husband cheating on her. Julie, who has already attempted suicide and since ceased showering and eating, lives with Pete and, upon seeing her mother for the first time in years, is understandably disgusted and appalled that she now wants to play mother. Linda also learns that her youngest son is planning on marrying and subsequently not inviting her to the wedding. Trying to balance out this newfound mess and work things out with her present beau Greg (rock and roll star Rick Springfield), Linda tries to be a mother to those who always needed her and somebody people won't cringe at the thought of putting their faith into as a person.<br><br>\"Ricki and the Flash\" bears a seriously tragic angle from a character perspective, given the fact that while Ricki was an absent mother, chasing rock star glory and fame, she wound up being a cover band in diver bars, the result of a failed marriage, and the bane of her children's existence. Now, Ricki has hit middle age hard and, reflecting on her life and career, she has little to show for it other than a mess of circumstances and success that was never fully realized.<br><br>Screenwriter Diablo Cody has a talent for making the most unattractive characters attractive in a way that's not condescending like an Adam Sandler film, yet not depressingly bleak like a Lars von Trier film. Cody is also unique because her films don't focus on characters wallowing in pity and self-loathing, but rather, actively trying to better themselves or making the best out of a bad situation. The latter is what Linda largely spends the majority of \"Ricki and the Flash\" doing. Instead of wallowing, she's being active in trying to be the mother that she never was to her children.<br><br>Streep does some very strong work here, being a captivating presence all throughout the film and remaining an actress who can be trusted with any role in terms of delivering quality. It also helps that Cody knows her strong suits, which are complex characters with a lot of emotions yet no really clear-cut idea of how to express such emotions. The end result, however, is a duo that I never envisioned would work together, yet alone work so well together.<br><br>As far as family drama goes, \"Ricki and the Flash\" finds itself positioned between the lesser \"This is Where I Leave You\" and the superior \"August: Osage County.\" It's far more dramatic than I ever anticipated, not sacrificing rich, emotional significance for cheap comic ploys or mawkishness. However, there's a theatrical element to the film that undermines its emotions, particularly at the end of the film. Yet \"Ricki and the Flash\" exhibits a lot of undertones not routinely showcases by the mainstream, which make it such a commendable project, especially with a great actress at the forefront.","user":"StevePulaski","rank":[46,64]},{"title":"'Flash' in the pan: nothing about Ricki or her world rings true...","rating":3,"date":"10 April 2016","review":"Potentially delicious teaming of director Jonathan Demme and screenwriter Diablo Cody with star Meryl Streep results in a surprising washout. Middle-aged bar band singer takes time off from her day-job as a cashier in southern California and returns to Indianapolis and the (now embittered) family she left behind for rock 'n roll success. Cody's writing is so facetious and 'cute' (always with a wink to the audience) that her script--already heavy with amateurish exposition--defeats the cast early on; before we can even adjust to the characters, they've been shaped by their clothes and their quips. Demme is eager to please, but his timing is perpetually off. Scenes that should work don't, while other sequences (such as a family reunion dinner that turns ugly) ramble on without a point. Ricki's family all take turns standing on a soapbox, blowing off steam. Cody can't introduce anyone to us without there being an agenda, and Demme underlines her every superficial point with close-ups that don't reveal anything (reality TV has more convincing confrontations than what we get here). Eternally misjudged and misshapen. We have no idea what Ricki has gone through in her career, what triumphs she may have had; Cody is too intent on giving us Streep as a Republican rocker (another clothesline to string conflicts on), backed by a troupe of musicians who are only there to hug her. The actress is clearly better than her material and fakes her way through. *1/2 from ****","user":"moonspinner55","rank":[17,22]}]