[{"title":"Finally, some insight","rating":10,"date":"19 February 2017","review":"It's interesting that this story is told from the POV of someone Jewish, in love with a Serbian woman, with ample foreshadowing of the holocausts both would face in the 20th century. Few people realize a million Serbs were killed by the Austrians in WWI, including many reprisals on civilians. There's also scanty knowledge of the systematic extermination of Serbs by fascists in WWII. And of course, scanty knowledge, readily dismissed, of the extent Austria was going to to provoke a war with Serbia for years before the Archduke's visit. <br><br>But if you follow the way they are referred to in this script, and the treatment they receive the picture is painted accurately. You know, things like \"Those dirty Serb dogs,\" \"It's a Serb-owned business, let's loot it.\" \"Let's go wipe them off the face of the earth.\" <br><br>It was Austrian people, apparently, making this film, acknowledging freely that this was a story of a tiny, indefensible country sitting in one of those hapless superpower thoroughfares, who is constantly overrun, who should have died out, like the Jews, centuries ago, but here they still are. <br><br>I see some of the reviewers are doubting how believable the railroad-to-Baghdad theory is that's put forth in the script, but comprising the land route between Europe and the Middle East, there's always something somebody wants, and whoever wants to be powerful is always sticking their hand in that cookie jar, have been for millennia, all the way back to the Romans.<br><br>It was quite refreshing to see a depiction of this historical/ political reality, instead of the 'Serbs as Fascists' delusional propaganda that has been rife in western media in recent decades. (Another cookie jar saga there.) I had a good laugh at the remark in the script the Austrian bureaucrats were making about the outrageous demands they'd make on Belgrade to be sure they were refused. Apparently somebody in Austria was listening to a similar Belgrade conversation ca. 1999. <br><br>Thank you Austria: Krausz, Ambrosch, Prochaska. It's nice to know there are people who have observed the nature of Serbia vs. the 20th century and see who the players really are, and the true nature of the tragedy.","user":"kerescam","rank":[42,55]},{"title":"Fiction, not documentary, and Leo Pfeffer was not a Serb...","rating":8,"date":"11 September 2017","review":"A magical film, extremely well made. But presented very strangely here on IMDb. It is by no means a documentary, it is fictional drama in historical context. And it is not about a Serbian magistrate. The film focuses on the historical figure of Leo Pfeffer, Austrian magistrate in Sarajevo at the time of the murder. In the film, it is suggested that his appointment to lead the investigation was surprising and as he digs deeper into the intrigue he slowly realizes he was chosen precisely because he is young, unknown, Jewish and expendable. In reality of course he was the magistrate in charge and the appointment was quite unsurprising. Beyond portraying the actual events and historical people involved - which the film does extremely accurately - the film explores the fictional possibility that a corrupted Austrian élite bankrolling, organizing and facilitating the assassination. A truly exciting idea which is of course pure fiction. The evidence used in the film being the authentic Austrian determination to start a war with Serbia, this being explained by said corrupt élite having some not-really-explained financial motives making them desire war. And of course the inevitable German agent perpetually desiring world wars. In this effort however, the film portrays Dimitrijevic as innocent and framed - rather repulsive in light of the many acts of murder and terror he was responsible for IRL. Furthermore, other historical people, e.g. Potiorek, are portrayed as being part of the plot against the Archdukes life. Which is disturbing and unnecessary. Ficitional characters could have been used to the same end. All that said - I still loved the film. Precisely because it is kaleidoscoping facts in such an authentic environment. Had I thought it documentary, I would have probably not liked it much...","user":"maxschonhausen","rank":[16,19]},{"title":"so tense, but is it real?","rating":8,"date":"25 January 2017","review":"I agree with most of the first review, except that I highly recommend it. It could perhaps be argued that it qualifies as 'historical fiction', but then, so is very much of what actually passes for historical non-fiction-- perhaps better referred to as 'history massaged', after the fact. Not to encourage the so-called 'conspiracy theorists', but fact is that history is replete with examples of history being massaged before the fact. Whether you agree with the premise (I am still checking), fact is that it actually (to my mind, and tastes), is much more engaging than, say pretty much anything that Tom Cruise has done--because this, at least, has a very strong possibility of being not far from the truth.","user":"Hidingintheshadows","rank":[25,33]}]