[{"title":"The Red Pill is an eye opener","rating":10,"date":"20 October 2016","review":"The Red Pill is a must see movie. Cassie Jaye was thorough, unflinching and relentlessly detailed in her research into the Men's Movement and in creating this lovely film. She patiently talked with and listened to many leading figures in the Men's Movement as well as several prominent feminists and held space for everyone's opinions. <br><br>It is difficult for most people to see beneath our culture's attitudes about male privilege and power to the myriad layers of problems and issues that run beneath that false front and to feel empathy for men based solely on their gender. I think Cassie Jaye's movie was the first attempt by a recognized documentary film maker to take on this task, and for that I am extremely grateful. <br><br>I found the movie,entertaining, fascinating and deeply emotionally moving, and I hope it will open the eyes of many to the plight of men and boys in our country and around the world.","user":"fayerweather","rank":[394,452]},{"title":"Original, Fascinating and Ellightening","rating":10,"date":"14 October 2016","review":"This documentary is incredibly rich in texture – and it covers a huge amount of territory. The subject, the \"Men's Rights Movement,\" has never been dealt with before in film, so \"The Red Pill\" becomes the go-to introduction to the people, organizations and even ideas associated with this movement that are not only ignored in documentaries but are given zero attention in the education system as well. The greatest surprise is the story of Erin Pizzey, a pioneer for women's welfare who, because she sought to help end domestic violence in all its manifestations became a pariah to thought-leaders and workers who control the domestic violence social work industry. The clips of the bizarre protests by political agitators against academic lecturers who promote human rights (for all people) are disturbing, yet are informative and valuable in shedding light on the fanaticism of extremists. The director, Cassie Jaye, is unusually modest and fair, yet at the same time is stubbornly honest and steadfast in her search for overlooked facts, no matter how unfashionable they may be. Highly recommended. Genuinely educational.","user":"freechild-68075","rank":[304,353]},{"title":"The Red Pill, a must see movie!","rating":10,"date":"2 November 2016","review":"I saw The Red Pill last night in Berkeley, Calif and loved it. Cassie Jaye masterfully shows what I and many others have seen and experienced while advocating for men.<br><br>When I first found the men's movement, I used to argue with MRAs about feminism, naively thinking it stood for equality. Then I saw the truth play out right in front of me. After I testified in favor of a California shared parenting bill, I watched a rep from NOW and a rep from the domestic violence industry misrepresent the truth and lie under oath about fathers, children and abuse. They killed the bill, even though 85% of the population supports shared parenting. <br><br>That was my red pill moment. The MRAs had been been telling me the truth. Feminists oppose equality, when it removes unfair control women have. Then I watched several videos of shared parenting bills in other states being killed (always by someone from NOW and someone from the DV industry) with the same misinformation and lies.<br><br>The film brought tears to my eyes more than once. As a shared parenting advocate, I can attest to the mass heartbreak and suffering of fathers unfairly separated from their children. <br><br>I'm very glad Cassie addressed domestic violence by women. Advocates for male victims of domestic violence once convinced Whoopi Goldberg to ask Vice President Biden to speak on the subject of female perpetrators of domestic violence, during The View TV show. Instead, he threw his hands up in the air and lied, saying every man in prison watched their father beat their mother. <br><br>The misinformation that Cassie is exposing runs very deep, and is connected to power, control, and money. <br><br>From the bottom of my heart, thank you, Cassie!","user":"terisharedparentingworks","rank":[245,287]}]