[{"title":"Do we have to take everything so seriously?","rating":8,"date":"28 May 2018","review":"This movie was so much fun. It was laugh out loud funny, the cast had great chemistry, the storyline was silly and uncomplicated.\nI can't believe how negative the reviews are! Were people expecting an Oscar nominee? If you're looking for a fun hour and a half of hilarious drunken shenanigans and some sweet romantic moments, this movie will tick all of those boxes.","user":"alice-998-959553","rank":[154,205]},{"title":"Where's the story? I'm confused!","rating":5,"date":"25 May 2018","review":"First of all: the leads have GREAT chemistry. But I felt like I was watching a snapshot of the \"real\" movie. I feel a little betrayed. The story is about Harper, a New Yorker send to Barcelona, Spain for a business meeting. Her two best friends tag along for a party trip. In Barcelona Harper meets a deejay and they instantly connect. That's it! That's the whole story. They fall in love. Harper f's up her meeting and is fired. No one seems to care. She mentions starting her own company. The deejay calls and asks if she wants to meet him in Tokyo. She says no at first because of her new business endeavor. But then her friends convince her to all go to Tokyo. END MOVIE. I checked my Netflix to make sure it was really the end of the movie. I felt confused. Such a waste of perfectly fun characters and a storyline that could've been heading somewhere, but then it was not. Who wants to watch a movie of people instantly falling in love and being happy, the end?","user":"amberhelenawriting","rank":[72,93]},{"title":"DISREGARD THE NEGATIVE NANCYS","rating":9,"date":"31 May 2018","review":"Seriously, this movie is SO MUCH FUN to watch, especially if you've had the privilege of traveling internationally and submersing yourself in a completely different culture. I loved the relationship between the three leading ladies - we FINALLY see a female-driven movie with women building each other up and supporting each other, rather than tearing each other down with petty cat-fights and competition. I felt like I was watching a mirror image of my two sisters and I; each woman has their role within the friendship, but each role is valid and equally entertaining. <br><br>This is a movie that will probably get funnier and funnier the more times you watch it because you'll pick up on those little nuances that make it relatable to your own life. I 100% enjoyed this movie.","user":"tgreider","rank":[63,84]}]