[{"title":"Dreadful","rating":2,"date":"7 May 2015","review":"The Plot. Yet another found footage movie this time about lost WW2 soldiers who turn out to be zombies.<br><br>Oh boy.<br><br>Everything about it stinks. Even the fake camera glitches. It sucks.<br><br>77 minutes long and it feels like you've been watching for 36 hours.<br><br>It's formulaic and predictable. It goes on and on and nothing happens.<br><br>There director's idea of action is having the actors pretend they are out of breath.<br><br>Midway into this movie they go underground and it's so dark you cant see a thing.<br><br>OMG, it's so horrible.","user":"arfdawg-1","rank":[24,32]},{"title":"Just another run-of-the-mill zombie soldier movie...","rating":4,"date":"13 November 2018","review":"I happened to stumble upon \"World War Dead: Rise of the Fallen\" by sheer luck. And being the zombie fan that I am, of course I picked up the movie to watch without hesitation.<br><br>But, as most zombie movies go, \"World War Dead: Rise of the Fallen\" turned out to be another generic zombie movie. Zombie soldiers doesn't hardly seem all that interesting anymore. And shifting the focus from the Nazis of World War II to soldiers from World War I hardly made much of a difference.<br><br>This whole movie was essentially one big plot hole. There were so many things throughout the movie that made little sense. For example, the lanterns still had petroleum in them even after almost 100 years of being unattended to, the zombie soldiers had managed to remain hidden in the area for almost 100 years, and the mine field had persisted for 100 years as well. Sure, very realistic. Which then takes me to the zombies. While they looked decent enough and were more than just guys with their faces painted grey, then it was really difficult to take them as serious ravenous undead with that laughable sound they made.<br><br>The acting in the movie was adequate, though it was painstakingly clear that the performers were struggling and suffering from having a script that could essentially be boiled down to a single page.<br><br>The thing that bothered me the most in \"World War Dead: Rise of the Fallen\" was the hand-held camera views. That just does absolutely nothing for me. It doesn't add to a sense of it being realistic or that you are feeling like you are there yourself. No. All it does it irritate me because I paid money for the movie, I invest time to sit down and watch it, and I am rewarded with shoddy camera work that I could do myself with my DV camera.<br><br>\"World War Dead: Rise of the Fallen\" is not a particular noteworthy or memorable addition to the zombie collection. I managed to endure it to the very end, but I can in all honesty say that I am not returning to watch it a second time.","user":"paul_haakonsen","rank":[2,2]},{"title":"My review","rating":4,"date":"18 May 2015","review":"The person who watched this obviously hates or dislikes found footage horrors as he tore this movie apart. Its not that bad. it was watchable, not the best movie ever but the guy who wrote his review said nothing happens and boring. Things do happen, they have zombies that attack the characters and there is some blood yes. I watched it and didn't mind it, although i have seen worse movies. the tunnels part? the reviewer said its so dark you cannot see? the characters had lights and torches so what is he complaining about? you can see what they are doing?<br><br>I give this movie a 4.6 out of 10, it was watchable and characters were OK, i liked the lead reporter lady she did a good job at presenting, i may get people saying, this movie was bad, but this is my opinion which everyone is entitled to.<br><br>worth watching!","user":"richardhoughton","rank":[8,14]}]