[{"title":"Just a note..","rating":10,"date":"26 September 2016","review":"Not a review, just wanted to point out that the person who gave a one- star review based on the lack of french-Canadian accents in this film..<br><br>... this is not a french-Canadian film. This is a film made by a Newfoundlander, set in Newfoundland, written in Toronto, and only has one character in the entire movie who is supposed to be french- Canadian. Giving one star based on your interpretation of an accent, when that's not even the accent most actors are portraying is really, really lame. <br><br>Personally, I truly enjoyed this film and it's twisted, dream-like format. The plot was semi autobiographical, and you can see the care and passion that everyone involved in the project put into it. Plus, who doesn't like a talking hamster?","user":"charlottetavenor","rank":[84,101]},{"title":"One of the best coming-of-age films you will ever see.","rating":11,"date":"11 October 2016","review":"\"I wasn't always this confident. Growing up as the awkward gay kid in a small town in Pennsylvania, you're constantly told, 'Don't be yourself, don't be proud of who you are.'\" Carson Kressley <br><br>From fast Times at Ridgemont High (1982) to Boyhood (2014), coming –of-age movies over the last 30 years or so have been richly diverse from fantasy to reality. Certainly, being oneself was top priority.<br><br>Closet Monster deftly bridges that variety, presenting the tale of queer Oscar (Jack Fulton as a boy, Connor Jessup as 18 years old), whose mom abandons him early in life and dad doesn't measure up in the sensitive category. This entertaining film is more like a bittersweet indie than a mainstream comedy and one of the best of its kind in years.<br><br>Along with some appropriate fantasy sequences and a talking hamster (voice of Isabella Rossellini), director/writer Stephen Dunn nonetheless gives us the feeling of reality. Oscar comes slowly to the realization that he's gay with a whole bunch of interest and concern our part. Jessup plays Oscar with such low-key humility and humanity that he makes us want to spend more than ninety minutes with him. I hope Jessup gets the acting recognition he deserves—he's that good.<br><br>So real seem Oscar's challenges, from coming on a murderous sex crime as a boy to kicking dad into the closet (nice touch) as a young man, that when we bid him goodbye at a living that will foster his artistic talents, we may well feel we have taken mom's place, or at least the hamster's, in watching him grow up.<br><br>The film is realistic but uncompromising as it allows him to be a boy outsider but also befriend an attractive girl, confide in a hamster, and confront his dad with a maturity that suits his perceptive, tough-minded persona. It's no coincidence that the tree house he occupies is a refuge from his dad's temper and a home for his eccentric companions, from the hamster to attractive male friend, Wilder (Aliocha Schneider), and therefore a home for his alternative life.<br><br>Even if you are uncertain you would like a gay-centered film, Closet Monster will make you see that a well, warmly-told story from any youth pv will be more exciting than any other mainstream romance you will have seen in a long time.","user":"jdesando","rank":[53,64]},{"title":"Evocative and Melancholic Drama","rating":8,"date":"23 October 2016","review":"Closet Monster is that rare first feature coming from an auteur with vision, clarity of thought and a voice unique enough to rise above the noise. Chances are few will see it; its limited appeal, not to mention limited release isn't likely to turn many heads. Yet for those who seek it, and more importantly, those who stumble on it years in the future, this movie is just enough to maybe fall in love with.<br><br>Even at a young age, Oscar (Jessup) didn't exactly have it easy. His parents divorced early on in a scene depicted as both turbulent and petulant. He boards largely with his father (Abrams), in a living situation that highly suggests some serious transgressions on the mother's (Kelly) part. What's worse is somewhere amid the memories of tree house building and playing vampire hunter, Oscar vividly remembers the beating and paralysis of a gay teenager from his school. Years later Oscar's worst kept secret is hidden from his father by his presumed interest in his photography model Gemma (Banzhaf) and a macabre fascination with monster makeup. That of course all changes and threatens to unravel with the arrival of Wilder (Schneider), whose wavy blonde hair and exotic accent appeals to the tortured Oscar.<br><br>Oscar's story might as well be an analog to every closeted teen, suffocating under the provincialism of their hometown, longing for an escape to the assumed gay utopias of New York, San Francisco or Miami Beach. The universality of his story is further hammered home by a host of tried and true storytelling techniques literalizing his journey. Oscar infers his conscience via his pet guinea pig Buffy (Rossellini) in order to process his complex emotions. Key images and plot points are amplified by hyperbole and forays into body horror and intellectual montage. In many ways Closet Monster invites comparisons to other fanta-fablest films like Me and Earl and the Dying Girl (2015) and Swiss Army Man (2016) especially when it comes to exploring emotionally salient themes.<br><br>Yet just like those films, Closet Monster occasionally undermines its themes in the service of artistic flourish. Director Stephen Dunn indulges in one too many moments of ponderous slow-motion and euphoric whimsy with the same film-school pretension that sunk similar films like Before I Disappear (2014). Yet when the movie pivots into its groove, it really does have a lot to say through Oscar's unique, granular life. Connor Jessup does an incredible job balancing a role that requires layers of alienation, tension and longing while also conveying outward vulnerability and priggishness. While I personally wish his relationship with his father had more complexity and objectivity than the average emotional abuse cliché, the film does leave things open for reconciliation.<br><br>Closet Monster is certainly not the definitive coming-out movie; I'm pretty sure The Way He Looks (2014) took that spot away from My Own Private Idaho (1991) quite some time ago. Yet as a evocative drama and melancholic piece of entertainment, it has the seriousness and caprice to stand on its own merits. And if it gives young kids like Oscar the courage to be themselves then I say it's all worth it.","user":"bkrauser-81-311064","rank":[32,39]}]