[{"title":"Surprisingly not that bad.","rating":6,"date":"11 August 2014","review":"So first off, this isn't really a sequel. It shares some themes with jarhead and its about Marines, but the storyline is completely unrelated and has a lot more action.<br><br>This is a relatively low budget attempt at a great war action/drama and although the writing lacks a lot of polish, the combat scenes are okay, the camera work is okay and the actors all seem to be doing their best with the clunky dialogue. The storyline itself isn't very original but again, its okay.<br><br>The film follows a Corporal who is considering leaving the Marines and explores ptsd, survivors guilt, etc. basically war is hell but it forms great bonds. Again, this isn't done exceptionally well but it does keep the movie from becoming a brainless action movie and brings a sense of drama to the film.<br><br>As a sequel to Jarhead this movie fails, but as a standalone action/drama flick it's actually fairly enjoyable.","user":"oomblongdada","rank":[31,36]},{"title":"Mildly Entertaining Nonsense","rating":5,"date":"31 January 2016","review":"If Jarhead was a subtle, slow-burning study of the Middle Eastern occupation through the eyes of a grunt, Jarhead 2 is the complete opposite. <br><br>It's an entertaining if dumb action flick but has very little in common with reality or common sense.<br><br>Ambushed on a supply run, a team of marines switches their mission object to keep an Afghan woman out of the hands of Taliban with the help of Cole Hauser's NAVY Seal.<br><br>The acting is fine and the action is well shot, if totally preposterous with overkill.<br><br>I can't claim to have served in conflict, but I'm pretty certain soldiers on both sides wouldn't frequently waste RPG's just to blow up one person armed only with a gun, instead of disabling vehicles and such, for which these weapons are designed. A lot of the action pieces seemed designed for cinema gore effects only and pretty much took me out of the reality that the rest of the film worked hard to achieve. <br><br>As did a point after a gun fight where the soldiers opt to walk to their destination through hostile territory, instead of commandeering the Taliban cars.<br><br>It wasn't the worse movie, and for the most part was exciting enough to hold my attention, but it could have been a lot better had it not been for nonsensical movie tropes that burst the bubble.","user":"blackacid","rank":[9,9]},{"title":"So far off from realistic","rating":2,"date":"8 January 2015","review":"If you are just seeking Hollywood action this is right up your ally. If your'e like me and wanted something realistic and a true military movie then move on. This movie has so many military errors it aggravated me more than entertained me. There were scenes where Marines ranks were not on their uniform. A corporal was called sir constantly throughout the film. They fired an M203 grenade at a taliban member no more than 20m away and it exploded when it hit the man. These grenades are made to not detonate that close. Also the fact that they wasted the 40mm grenade on a single man instead of blowing up the truck with a machine gunner in it was far from realistic. Also an RPG was fired and supposedly exploded the entire building they were in and set it on fire and only the one man that the grenade hit directly died, not the Marine three feet from him. Lastly, the weapons the Marines had were fully automatic M4 and M16 platforms and while they do exist they are not used by US Military. This movie was made for people that just wanted action without any realistic backing. It isn't a bad story it just was not done with the accuracy that should be expected. I didn't have too high of expectations but I was still let down.","user":"Jeremy_2014","rank":[29,37]}]