[{"title":"A \"bad\" movie worth watching","rating":7,"date":"27 December 2017","review":"This is a low budget action-thriller attempt to be one of those hipster funny violent movies such as Pulp Fiction and Two Smoking Barrels. The script is a chain of over the top cliches, the protagonist is (intentionally?) hilariously miscast, acting is all over the place (overacting mostly), the camera is gently waving most of the time. There is a twist in the movie! Served in advance so casually that by the time a certain character says\"I am not the bad guy!\" you already know what is going on...<br><br>However, I gave this movie a 7 to pay respect to the people who made it happen. I usually get bored by low budget nonsense but Scramble ... the title itself suits it perfectly and makes me smile having watched the movie already. The team did really put great effort to make this project entertaining and fun. If you stay through the first 20 minutes it gets so amusing, interesting and hilarious that you extend the benefit of the doubt and will not get disappointed.<br><br>For me actress Marissa Von Bleicken performed the best in the movie even if we barely see her in action.","user":"nkasherov","rank":[7,14]},{"title":"It's time to collect","rating":6,"date":"1 January 2018","review":"Quinn (Marissa Von Bleicken) is kidnapped by Dom Fertelli (Kevin McCorkle) and is forced to work as a prostitute to pay for her deceased father's debts. Her boyfriend Frank (Brett Newton) needs to get a hold of $75,000 to pay the debt and buy her back. This involves a hippy drug dealer and the Chinese mafia who acted more like the Keystone Cops. Meanwhile V (Irina Voronina) a former prostitute who worked for Dom has a \"Kill Bill\" type of list as she offs rich former clients and robs them. <br><br>The film is done grindhouse style with muscle cars and music. It is okay for what it tries to do, but the characters didn't come across as well as they should. <br><br>Guide: F-word, sex, nudity (Irina Voronina)","user":"nogodnomasters","rank":[2,3]}]