[{"title":"Love, unrequited; but there is always heroin.","rating":9,"date":"22 August 2015","review":"I guess I'm writing this review after seeing the one and only other review. This film is actually really very good, and for what its showing: perfect. Time is different for some people. Those with heroin in their lives don't live as we do. For them time doesn't really exist.<br><br>There is a flow and it is somewhat linear though quantum leaps here and there are possible at anytime. <br><br>There is always need.<br><br>The opening is a dream. One of Harley's perfect moments in 'time' smashed by a realisation. She has to kill herself for the man she loves? Combine this with Heroins ebb and flow and it becomes even more intense. <br><br>Love unrequited but really Ilya loves Harley too... right? <br><br>What will you do for love? Anything. What will you do for Heroin? Almost anything?<br><br>The film flows through days and night though really we are just allowed to view their lives for a short train ride. The end is Malick in style - life just keeps on flowing. <br><br>I read up a little on Arielle Holmes (Harley) - she has lived the lifestyle, and some parts of the film are based on her adventures!<br><br>It's very realistic. Just watch it all, let it flow.<br><br>Oh also, the use of modular synths and sound instead of voice (in parts) is very effective, the latter trying something new and it worked.","user":"toby_fairbank","rank":[29,33]},{"title":"The foreign, but familiar world of junkies in NYC.","rating":8,"date":"22 November 2015","review":"This is an incredible touching, intimate and stark film. You follow a young woman, who seems so fragile lost in a world we all fear filled with drugs, hopelessness and even more frightening: Love. We've all seen the passionate and outlandish arguments on the street between people that call it home, but we disregard it all as fleeting and inhuman. This film puts a human face to the people we turn away from so quickly. I commend the filmmakers for not making heroin sexy. It's a sad disease you contract that's taken three of my close friends. This film helps us better understand drug abuse and the people stuck in that cycle. It couldn't have felt more real.","user":"cernachc","rank":[19,23]},{"title":"Disturbing and compelling","rating":23,"date":"23 August 2015","review":"Truly didn't expect anything out of this, which is why it was such a huge surprise. I don't think its flawless, but effective it surely is. I feel like its style is definitely going to out off a lot of people (quite a lot actually). I mean, even from the get-go it basically affirms the type of film it'll be and how it'll be presented, with its loud, throbbing score (which is both beautiful as an individual piece, but also really disturbing in the context of the film). The performances here are compelling, all of the main actors totally and fully committed. Arielle Holmes is a true talent though, what a fantastic performance. Raw and real and totally honest, no artifice or anything. This film is fully recommended.","user":"Red_Identity","rank":[20,25]}]