[{"title":"Geat action shots","rating":9,"date":"12 February 2020","review":"Absolutely a fantastic film. The action might be a standard affair but the story and the emotion that this film evokes is insane. It is brutal in not only the action but the real feeling of a mother who just lost her child now dragged into another fiasco. Definitely give this movie a shot","user":"MR_Heraclius","rank":[36,39]},{"title":"A very good crime drama with some explosive action sequences","rating":7,"date":"23 June 2014","review":"The movie is about a hit man from America's mid-west who is of Korean decent. When he botches what was supposed to be his last job by killing an innocent kid, he is sent to Korea to fix what he screwed up by killing the kid's mother. <br><br>It sounds a bit like a fish out of water story, but the movie only proves that the crime world is the crime world no matter what country you are from. Some of the criminals were speaking up to three different languages, but in the crime game there are only two languages in you really need to know money and guns.<br><br>The gun part was not as much as the money part but when the gun part was done it was violent, like Chow Yun Fat 80's style violent. The action sequences were stylish and bloody, just how I like it<br><br>The money part is where all the crime Drama comes in as it's about a Korean gang uses a legit network to launder Triad money, The plot tries to be complex with the an everyone is not who they seem kind of situation. They film also tries to give some depth to the main character showing us why a harden hit man would allow an accidentally killing to melt his heart like it did. For me the story was not as complex as the action sequences. <br><br>Some of the midsection could use more gun play, but overall it was a great seeing it.","user":"bbickley13-921-58664","rank":[20,24]},{"title":"Tragic drama meets blistering action","rating":8,"date":"17 March 2015","review":"NO TEARS FOR THE DEAD is yet another addition to an exemplary list of South Korean action thrillers made in the last decade; such titles include THE BERLIN FILE, THE MAN FROM NOWHERE, A BITTERSWEET LIFE, A COMPANY MAN, and THE SUSPECT. I was long excited for this film as soon as I found out it was a follow-up to the same director's THE MAN FROM NOWHERE, which is one of my all-time favourites.<br><br>NO TEARS FOR THE DEAD isn't quite up there with the standard of the earlier film, but it has its moments. This is an exciting story that mixes superbly-shot, hard-hitting action sequences with a tragic human drama at the core. It's dark indeed, featuring heartfelt performances from the central actors who are inevitably playing broken characters, and it's fun to see how the tone shifts from adrenaline-pumping action to gut-wrenching emotion and back again.<br><br>The storyline is predictable for the genre: an assassin screws up by failing to take out his intended victim, only to face the wrath of his former employers. The action is blistering, with lightning fast editing and gobbets of grisly violence. But the human drama also draws you in, building to a moving but expected ending. The South Koreans have come up trumps again with this one.","user":"Leofwine_draca","rank":[17,20]}]