[{"title":"A Fantastic Comedy Movie With Amazing Black People.","rating":10,"date":"17 April 2016","review":"Barbershop: The Next Cut is a 2016 American comedy film directed by Malcolm D. Lee. It is the fourth film in the Barbershop film series and stars an ensemble cast, including Ice Cube, Cedric the Entertainer, Regina Hall and Anthony Anderson. <br><br>Calvin, Eddie and the rest of the gang must work together to save their shop and their neighborhood from trigger-happy gang members that roam the streets.<br><br>Critics wrote positive comments about this fantastic comedy.<br><br>Barbershop: The Next Cut Is heartfelt, thought-provoking, and above all funny. <br><br>Absolutely recommended for teens and adults and to anyone sad and exhausted.<br><br>I guarantee you this fantastic comedy with amazing Black people will cheer you from start to finish.","user":"anopenmindedlady","rank":[96,125]},{"title":"If you liked the first 2 movies, don't bother!","rating":3,"date":"9 July 2016","review":"I had a suspicion when going to watch this movie that it's going to be a recycled pile of boring-repetitive jokes, ploys and twists. Unfortunately my nightmare was manifested, this movie offered nothing new, creativity was as dead as a dodo. To put it simply, it's a shoddy reboot of the original Barbershop.<br><br>The movie plays out in the following sequence; Barbershop is successful with the regulars, insert some crude comedy in relation to some sordid situations, neighbourhood issues awakens people up, Barbershop wants to close due to these circumstances, Barbershop re-opens with a glittering end.","user":"mr_iceman","rank":[16,21]},{"title":"The best of the series with one of the best messages of any movie in the last few years. I recommend this for that","rating":7,"date":"25 July 2016","review":"\"Barbershop used to be a place of peace.\" Chicago is in a bad way. The violence has begun to take over and it finally hits the area around Calvin's (Cube) barbershop. When Calvin's son becomes involved in gang violence he has to once again wonders if the best course of action for his family is to close the shop. This series has been very strange. The first one was funny but didn't think it needed a sequel. The second one was really bad and I didn't like it at all. This one though I thought was the best of all 3. That being said that all pretty much have the same plot. This one has nothing all that original and the movie is fairly predictable but the reason to watch isn't for the plot. This movie has a great and very timely message. It was a little strange to see the guy responsible for F the Police to have such a strong anti-violence moviebut that actually adds a little to the impact of it. Overall, the best of the series with one of the best messages of any movie in the last few years. I actually recommend this for that, and the laughs. I give this a B.","user":"cosmo_tiger","rank":[7,8]}]