[{"title":"A decidedly incomplete narrative on the death of Jesus Christ","rating":7,"date":"28 March 2016","review":"Bible purists and devout Catholics will probably find at least some fault with this production. There are a number of elements missing from the story that most viewers with a knowledge of the Scriptures would be looking for; when they aren't depicted one has to wonder the reason why. Time and budget constraints probably play into it but that argument doesn't help much. One of the first stunning moments in the story occurred for me when Jesus (Haaz Sleiman) seemed to be unaware of his Earthly mission to atone for Man's sins, this when he was conversing with John the Baptist (Abhin Galeya). Caiaphas (Rufus Sewell) and his adherents in the Sanhedrin appeared to be greater villains than Pontius Pilate in terms of culpability for Jesus' crucifixion. No mention of Barabbas seemed to be a major oversight, and during the crucifixion scene there was no reference made at all to the two thieves who were crucified along with Jesus. I guess most of my criticism here has to do with things that weren't included in the story of Jesus, so that may just be a particular quirk of mine. However my viewing of the picture occurred a day after watching the 1927 silent film \"The King of Kings\" which appeared to be a much more complete narrative of the events leading to the crucifixion and death of Jesus Christ. If one were to be faced with the choice of one or the other, my recommendation would go for the early film. Even though silent, the longer, one hundred fifty five minute version includes two wonderful sequences done in Technicolor, quite possibly the earliest use of color one might ever experience in a movie and more than a little impressive.","user":"classicsoncall","rank":[7,7]},{"title":"Cheap, unscriptural, and confusing.","rating":2,"date":"30 March 2015","review":"I went in hoping. I really wanted to like it. But I didn't. <br><br>Jesus looks confused half the time. The Holy Spirit is a no-show. The beards are glued on. Old commonly-held beliefs with no scriptural basis are recycled. Camels hadn't yet been domesticated. Nowhere does it say that Mary Magdalene was a prostitute but she is strongly hinted to be one.<br><br>While talked about in one of the Gospels, there is zero historical evidence that the Slaughter of the Innocents ever occurred. Byzantine fortresses are used as stand-ins. <br><br>Good things: Filmed in Tunisia so at least some of the people didn't look like they came from an Ikea advertisement. <br><br>I simply can't recommend it. If you are wanting to learn about Jesus, this is not the place to look. If you are a Believer already, you will be sorely disappointed.","user":"AdultAudienceMember","rank":[58,90]},{"title":"Why Not Get It Right?","rating":4,"date":"15 April 2015","review":"I am so happy to get this type of program but I don't understand why all the inaccuracies. It's not as if the story of Jesus isn't compelling enough without having to tweak it to keep the audience watching. Some of the inaccuracies seemed just random and serviced no purpose and others seemed very intentional and purposely misleading. I'm not sure which is worse. Who did the producers make this for anyway? It was not provocative enough for non-believers and not accurate enough for believers. A note to the producers: Next time, if you intend to tell a Christian story, get the facts right. At best the inaccuracies are a distraction and at worst they are insulting to those who know what is historically accurate. I feel confident that you won't lose believers or non-believers if Christian stories are well done and true.","user":"jroswald","rank":[24,35]}]