[{"title":"Z- Rubbish","rating":1,"date":"19 November 2019","review":"The shills have been pumping up the rating on this piece of garbage. I watched this for FREE and I want my money back","user":"rhade-95788","rank":[28,45]},{"title":"Watch it for Don Frye","rating":4,"date":"20 November 2019","review":"Fifteen years ago, two teenage girls were murdered at Merrymaker Campgrounds. Everyone thought it was just an animal attack, the case was closed, the camp was condemned and the killer never found. But whatever or whoever it was, it still waits in the woods, ready to kill again. This film from director John Woodruff - his first full-length movie - was written by Jonathan Murphy. They had previously worked together on the project The Stalker Experiment.<br><br>Larisa Oleynik plays Anita Bishop and you may remember her from 10 Things I Hate About You, Mad Men, The Secret World of Alex Mack and The Baby-Sitters Club. That's not the only person you'll recognize in this movie. Heather Tom from The Bold and the Beautiful shows up, as does Christian Oliver (Snake Oiler from the Speed Racer movie) and Don Frye. That's right - former UFC fighter and New Japan Pro Wrestling monster heel and the man who turned Yoshihiro Takayama's face into pudding, Don Frye!<br><br>Seriously, this film is worth watching just for seeing Frye. He should be in The Expendables. He's a legit tough guy, after all.<br><br>Oliver plays Roland Baumgarner, a writer who wrote a famous book all about the murders. He's been invited to cut the ribbon at the grand opening of the new Merrymaker Camp. That seems like a bad idea. Guess what? It is. The horror that Roland wrote about has now come back to potentially end his life.","user":"BandSAboutMovies","rank":[5,6]},{"title":"Think about it!!","rating":9,"date":"23 November 2019","review":"If you sit and watch this movie and instantly think it sucks or is crappy and belongs in the trash then you aren't really watching it. Sitting and watching this movie I personally thought it was great for the simple fact it peruses what an older horror movie is like. It's not like any of the newer horror movies with the guts and the gore and that was obviously not the intention from the director. It was very clear he wanted it to be original and he did very so make it original. From the acting to the music and everything in between I thought this movie was amazing!! In order to understand the movie and how it was made you have to realize and understand it's not a movie full of big names and what we are all so used to nowadays. Just sit, watch and think about movies from back in the day that are honestly just like this one.","user":"hdg-7190","rank":[13,21]}]