[{"title":"one good twist and one bad twist","rating":3,"date":"16 October 2017","review":"It's Brady Baxter's birthday and he finds his girlfriend had cheated on him. His crass friend Tommy Quinn takes him to Mexicali to party. They meet Katie and Lucia who warn them about the Mexican kidnapping cartel. They are guided by the Texican and his giant sidekick El Caballo to see the real Mexico and warned them about El Gato Enfermo. Aztec shaman Kasape Suka (Steven Tyler) leads them on a wild night. They run into the girls again and it goes all wrong.<br><br>Erik Palladino is a recognizable actor which makes him character less scary as a local Mexican. That pales in comparison to Steven Tyler. He makes the movie into camp. It can't regain its horror thriller sensibilities. I do like Britne Oldford who has a crazy vibe. The big bad is pretty nice. There is a nice twist but it's wasted as the movie turns into stupidity. This could never be serious and it's definitely not funny. It's all wrong and Brady is pathetic.","user":"SnoopyStyle","rank":[2,2]},{"title":"Genre Bending But Interestingly Meh!","rating":6,"date":"14 September 2016","review":"Who haven't watched Hangover? You have been living under a rock if you haven't seen the movie about a bunch of partying dudes tripping and puking in the middle of a desert. One of them is lost and the rest try to get him back. Then there's less popular Due Date with the same bearded guy from Hangover, tormenting Robert Downey Jr. They end up in Mexico remember? Then there is even lesser known Search Party with Thomas Middleditch and TJ Miller. It's about rescuing a friend lost in Mexico. This theme is getting tiresome now. To add another film to the list is a bit of a risk. Happy Birthday tries it and survives the sandstorm.<br><br>The movie is a bit too thin on the plot, as in, I could jeopardize the entire story by simply mentioning one little detail or by referring to a certain Michael Douglas movie. It's so easy to spoil. Doing that won't be fair to the makers of this film because they obviously tried their best. Yet, I should say it's easy to predict the ending once you are half way through. It's hard to shock the audience these days.<br><br>The bit about genre bending is true though. What begins as a stoner comedy takes a turn towards horror and crime thriller. This itself is a fine achievement on the part of the writers. The movie even features a bizarre guest appearance from Steven Tylor of Aerosmith. He's quite good in his character as well. It's a good indie flick with enough scares. However, we are not left with the intended effect at the end. Like the hero of the story, we too want to find a way to get even.","user":"organicsocial","rank":[5,13]},{"title":"Fun little indie","rating":8,"date":"19 September 2016","review":"I read somewhere that the budget for this movie was $500,000. That's ridiculous. I applaud the cast and crew and filmmakers as that's not easy. My favorite part of the movie was the guy from ER playing the tour guide, hilarious. Steve Tyler was funny as well. There were a few twists and turns, and it reminded me of the Hangover meets a Robert Rodriguez movie. I do think it's misleading calling this horror, but still, I had a blast!<br><br>The two girls, one who I knew from Waiting with Ryan Reynolds, was great as the love interest, and the other tall black girl was super scary!!! She was great. The other kid I didn't know, but I recognize Matt Bush from Adventureland and a bunch of TV commercials. <br><br>My favorite part was the drug kingpin in the hotel room, it shows that the director can fare well with some more serious stuff, but - it was a fun watch. Definitely worth a rental in this day and age of remakes and comic book movies.","user":"dhbeaner","rank":[6,17]}]