[{"title":"Terrible","rating":3,"date":"3 December 2016","review":"How can I put this? It's terrible. Almost halfway through and NOTHING has happened. NOTHING. Look we all know where this is going. Guy and girl get an unplanned visit from an 'old friend'. He's sketchy. We get it he's vaguely Hispanic and talks black. He's sketchy. We know there's going to be a love triangle we know the two guys have a past that's going to come back to haunt one of them. We know the girl is going to get sexually involved with the sketchy guy. We know there's going to be some criminal activity with even sketchier dudes. We know the girl is going to get or almost gets raped by the even sketchier dudes. We know there's going to be a fight slash gun battle slash drowning between the first guy and the sketchy guy. We know sketchy guy is on a revenge trip. We know the cop who shows up at the beginning in a brilliant white linen suit isn't a cop. We know the guy and the girl are too dumb to know that. We know no one will ask how the sketchy guy even knew they were living there. We know that with Airbnb no one would rent out their top 5 most amazing homes in all of LA for $150,000 a week for the whole summer because their step daughter and her do nothing boyfriend should use it for free for their summer vacation in their mid 20s.<br><br>And that's what we know will happen. Problem is nothing happens. SLOW burn is not a synonym. It's a style. It's a tease where you spin out a shaggy dog story in a TV series so that you can stretch 3 episodes into 13. In a movie its just wasted time and film. I can't tell you how many movies now are \"the first 75 minutes are terrible but the the last 15 are good. Just make those 15 and skip the rest. Just because you call your little movie a neo noir something or other doesn't mean you can get away with awful cheesy dialog terrible direction a boilerplate script cookie cutter characters and bad acting. And why is almost every actor South African? Do they come as a package deal with the house?","user":"xhidden99","rank":[13,14]},{"title":"Definitely a \"B\" movie, I saw it for Willa Holland.","rating":7,"date":"7 December 2016","review":"I came across this movie on Netflix streaming. It has a very low IMDb rating and it is appropriate. Definitely a \"B\" movie with a questionable script and the ending isn't very clear. Still for Willa Holland, of 'Arrow' as Thea Queen, fans it is an interesting movie if you have 90 minutes to spend.<br><br>The story revolves around a couple who were friends in college out East and now lovers. Through connections of friends they, both unemployed, are house-sitting for a few weeks in Los Angeles. Not just any house, one of those up in the hills overlooking the city in the distance and with one of those fancy swimming pools out back. That is a very, very expensive place.<br><br>Things are going smoothly until one night there is an unexpected knock at the front door. With no regard for who it is or possible danger they open the door to find an old friend dropping by, a friend with a very shady past. After they visit and he says he has a ways to drive they for some reason invite him to stay the night. That turns out to be a very bad move.<br><br>Willa Holland is the girl of the couple, Veronica, and her boyfriend is Alex Russell as Percy, sometimes called a Chemist and other times a Chemical Engineer, they can't quite decide, but he is unemployed. However he is good at weighing and mixing, particularly when it involves cutting high-grade drugs. The old, dangerous friend is Miguel Gomez as Freedgood (is that really a Spanish name??), fresh out of a couple of years in prison.<br><br>Right when the young couple are ready to go to the train station for the trip back East (she is afraid of flying) a detective shows up, David S. Lee as Hector Cortez, he says he wants to interview them one more time, regarding the death of Freedgood, in the pool, blood in the water.<br><br>SPOILERS: The whole movie is basically a flashback over the prior three days, and when Freedgood was threatening both of the others, trying to drown Percy, Veronica shoots him, three times. It was self-defense. Cortez as it turns out wasn't really a cop, he was after the missing money from the drug deal. It seems that the money ended up in Percy's guitar case, bound for the East, but I am not certain.","user":"TxMike","rank":[4,4]},{"title":"you can't spoil this film","rating":3,"date":"2 November 2017","review":"First of all the main character in this which is trying to be film noir is the home. The view of the city of Los Angeles is spectacular. IMHO I could not believe these two ever went to the same college. Freegood just doesn't seem like a guy who would ever sit in a classroom. Freegood, what kind of name is that. He's obviously Hispanic. Football scholarship? Give me a break. Most love the plot twist. What plot twist? Most say it's unpredictable. This waste of 90 minutes was totally predictable. If you're on Netflix you're much better off watching \"Midsomer Murders\".","user":"ss124-661-382111","rank":[3,3]}]