[{"title":"The iron has accumulated rust","rating":3,"date":"14 April 2015","review":"RZA is definitely passionate about martial art movie and he invests a lot of time for this niche, but The Man with the Iron Fists 2 is a subpar action movie. It has low production value, the exotic location surprisingly isn't appealing, the script is flimsy and most importantly the action choreography is utterly disappointing. Fights are no better than scenes from ancient action flick from decades ago, and with this flaw the movie just loses its main appeal.<br><br>Story goes that there's an entity on a mining town that feeds on life force. The people of this town also have to content with oppression from the ruling clan. Meanwhile Thaddeus (RZA) is unexpectedly involved in a rebellion against the dictator. Main focus of the movie is the struggle of town folks, there's barely any continuity from the first movie and RZA himself only here as a supporting role. The plot tries to resolves its several subplots, only to be hampered with poor execution.<br><br>Writing and characterization are not satisfying, it follows the usual rebellion theme with screeching pace. Though it has a couple of twists, the direction is so slow, one can skip thirty minutes of the movie and doesn't miss much. The build-up is inconsistent with shady acting, and change of setting to beach town doesn't prove to be amusing as well. Environment only consists of a dark barren town and a rural village. The use of color contrast feels archaic, it's nothing more than the visual of B-movie. Furthermore, the soundtracks don't fit the theme, it may be intended as clash of cultures, but the end result is borderline intrusive.<br><br>While the first movie wasn't that great, it still had production value with famous names and stylish design. This one definitely has less budget as everything looks lackluster. Whereas the screenplay is abysmal, the action might fare worse. The motion seems fake even though it uses slow mo to mask it, some scenes even depict missed punches and overacting but these are still edited clumsily for the final product. It looks awkward for an action film not being able to deliver action sequences.<br><br>While it may benefit from oriental ambiance, the cumbersome plot and underwhelming choreography sink the movie like two giant anchors strapped on its limbs.","user":"quincytheodore","rank":[28,40]},{"title":"Keep your expectations very low...","rating":12,"date":"12 April 2015","review":"The positives in this movie would be the story, which is quite decent. And apart from Tagawa I was only impressed with Carl Ng's performance that made the story watchable till the end. <br><br>With all the great, good looking Chinese actors and actresses we see, I must say this was the weirdest cast I have come across.I expected more of RZA but way past the halfway mark of the movie I realized he may not be playing the main role. RZA, who I would say really did good in \"Brick Mansions\" was terrible, flapping his \"rubber\" Iron Fists. <br><br>As I mentioned Carl Ng does a pretty decent job in the beginning building up his character to be a real bad-ass, although it leads to big disappointment as the story progresses with very bad fighting scenes. A good fight would be one key factor we expect from this movie that lacks, apart from number of other elements like poor acting, poor selection of cast.","user":"Deathracer","rank":[9,13]},{"title":"An epic waste of time","rating":2,"date":"3 April 2016","review":"What an epic waste of time and money. Far more worse than the previous one. Poor story line, screenplay, casting. The title is inappropriate also as RZA is playing a side role. Action scenes are not up to par.A complete rubbish. Only good thing is the story. It has some twist . But one can predict that easily. The castings are not good as the previous one. Without Russell Crowe and Lucy Liu and Batista this sequel don't stand a chance . The music is not appropriate with the scenes. And too much unnecessary violence. Personally, i watched it because i kind of like the first one. But the story lack continuity. It will go down as one of the worst movie in recent years.","user":"eaf-uddin","rank":[8,12]}]