[{"title":"Nearness to Death is Opportunity to Reassess Life","rating":8,"date":"8 November 2015","review":"\"Drink your beer and shut up\" is the essence of male culture in Australia. \"Mateship\" is the term for it. Rex, a 70 year old cab driver from Broken Hill in New South Wales, finds – as he must have already felt for a long time - that mateship is a double edged sword. He is diagnosed with terminal stomach cancer and can't bring himself to tell his friends or the woman he secretly loves. \"There's no one else,\" he tells his doctor. Instead he drives his cab 2,000 plus miles across the Australian outback to Darwin where there is a newly opened and experimental euthanasia clinic. \"Why,\" asks the woman who might have been his wife \"did you not tell me?!\" \"You never asked,\" answers Rex, matter-of-factly. Rex has never seen the sea, among other things, and his eyes are opened to new scenery and people. His nearness to death is an opportunity to reassess his life and, like Odysseus, for adventure.<br><br>While much of the film is drama and serious in nature, it is also light-hearted. A mechanic tells Rex to keep his fluids up while driving in the desert, and Rex promptly goes into the bar for beer. One theme is the plight of Australia's aborigines. Whites took away much of their culture and stories, and as a result, who they are. The acting is really wonderful, especially the lead who is a veteran of Australian films and television and well-loved for such roles for his entire life. I love the ornate and wonderful arts and crafts homes as well as the scenery of Australia. The film is loosely based on a true story. The only real drawbacks are that it is somewhat predictable and short. Seen at the Toronto International Film Festival 2015.","user":"Raven-1969","rank":[19,24]},{"title":"uplifting with fantastic scenery","rating":10,"date":"11 August 2015","review":"I thought this one of the best movies I have seen in a long, long time and up there with the Castle and the Dish. I thought the acting throughout good and especially Michael Caton and the actor who played Tilley who I found to be a lovable rogue. The story line was sad, but was very thought provoking when thinking about and discussion euthanasia. All in all I really enjoyed the story and especially loved seeing the outback of Australia. I cried a lot but I also laughed a lot and would recommend this movie to any age (except children of course) and hope that many people go to see it. I also hope that it is up there when the movie award come out.","user":"pelicanbarbara","rank":[21,30]},{"title":"A road movie with loads of heart and spirit. Another great Australian film","rating":8,"date":"18 September 2015","review":"Michael Caton has been a fixture on Australian screens since the 1970's thanks to TV shows like 'The Sullivans' and 'Packed to the Rafters'. His voice is quintessentially Aussie and his face and personality have made him a household name. His casting for this film is perfect and I can't even imagine another actor as Rex; so perfect is Caton, and such a gift for an actor who has mostly been the family uncle or grandad. Here he is, front and centre; stoic, three dimensional and instantly likable. Director Jeremy Sims, himself a TV and film actor, has elicited an award worthy performance from the veteran, but also helps young actor Mark Coles Smith as Tilly, make one of the year's best supporting turns. The camera just loves his wicked grin and his playful, easy charm. The film pulls no punches with some of the content surrounding both the indigenous characters such as Tilly, or the circumstances and realities of euthanasia. I was disappointed with Jacki Weaver here: she never looks or sounds comfortable with her character, and that is unfortunate as it is a linchpin to the film's trajectory, but Caton's 'Rex' is so unforgettable, that he carries even the weaker elements of the movie. Beautifully photographed and capturing the visceral parts of the landscape and the terrain, 'Last Cab To Darwin' is not a perfect film, but an enjoyable and significant one, and a rewarding one for its leading actor.","user":"david-rector-85092","rank":[14,20]}]