[{"title":"Mainly average but the sudden twists will make you smile","rating":7,"date":"22 November 2015","review":"No spoilers!<br><br>This is a fairly basic Hollywood story of how things take a turn south really fast in peoples lives and keep getting worse by the minute. I've always liked \"gangster\" movies like this, kinda simple but yet funny characters and unexpected twists you really cannot predict. It's the small things that can make an average movie turn in to a good one and this did that for me. About half of it is just plain average but then things start to happen so don't stop watching. <br><br>The writing and characters have clear influences from Tarantinos Pulp Fiction, Guy Ritchie's Snatch(and others) and the ending is quite \"Usual Suspect's\" type but so what if we've seen it before, it still works. For it's budget I'm happy with what I saw.<br><br>Too much of movies these days throw money away in effects and other useless crap, they still haven't learned that a billion dollars worth of effects won't make a bad script good. Save that money Hollywood and make a hundred of these types instead. Put the money towards good writers and casting and that will save you a lot.. and make a better movies at the same time.","user":"artapme-840-333602","rank":[26,32]},{"title":"Four debts and a funeral","rating":6,"date":"24 November 2015","review":"For all the gritty title and noir poster it has, the better part of Criminal Activity is its satirical attempt on crime genre. The thriller works by introducing subplots while playing out the main story with a lot of twists and turns. While not every narrative pays out, there's a solid acting here and it's pretty exciting to see the diverse characters as they are put in highly volatile situations.<br><br>Four young men reunite on the funeral of their friend. After a smoke they are intrigued by an investment opportunity that fails almost immediately. Unfortunately to them the investment is already tied to a mafia and they must do a difficult favor to clean the slate. Their hardship eventually turns into a spiral of dangerous power struggle with kidnapped niece and nephew while agents and assassins chase after them.<br><br>It's a deeper premise than it originally shows, creating layers of subplots as it progresses. Some of the sequences are highly entertaining due to their absurdity and good delivery by the actors. Edi Gathegi as the gangster involved in all the shenanigans stands out even among the capable leads of John Travolta and Dan Stevens. There are unexpected outlandish mafia themed narratives, or perhaps slight parody of it, that will deliver chuckle or thrill to audience.<br><br>However, even with most of the story manage to be entertaining, the movie tends to overreach. It has plenty of side characters or events that may not be that important yet still get a lot of screen time. It tries to pull off too many tricks that don't resonate better than its core story. Not to mention the twisting revelation at the end feels rather abrupt and might too far fetch, although it's still decent due to the outlandish nature.<br><br>Criminal Activity works on parts where the acting and satire are strong, but it does try to overreach with few others distracting stints like a greedy mobster.","user":"quincytheodore","rank":[27,35]},{"title":"A bit meh","rating":5,"date":"20 November 2015","review":"If John Travolta wasn't in the movie, you'd probably have skipped past this one already. And even then, with each scene that he is in, you spend more time looking at his glued on hair piece than following the movie.<br><br>Essentially the plot is 4 guys get mixed up with the mob and incur a large debt. To wipe the debt clean, they're forced to kidnap some guy for the mob boss (Travolta).<br><br>At the end of the movie, there's a 'The Usual Suspects'/ 'Now You See Me' style twist, and that is all explained thoroughly at the end. <br><br>Whilst I think the twist is convoluted enough to make it not predictable (the last 10 minutes of the movie is needed to explain the twist), at the same time it is not all that surprising or satisfying when revealed. Leaving you with a feeling of MEH at the end. It's been done many times before, with better set-ups and better actors. <br><br>Nothing special here. Very average.","user":"thegiant-95061","rank":[39,53]}]