[{"title":"Descent to Death","rating":5,"date":"5 February 2017","review":"\"Eloise\" is a film based on the actual Eloise Asylum located in Michigan. Eloise has quite a history and not all of it good.<br><br>Jacob and Dell are pretty good friends, and when Jacob is advised of his father's death, he is also told by the attorney handling the estate that he is the sole inheritor of $1.2 million--providing he can get the actual death certificate of a former aunt who--you guessed it-- resided at Eloise. He tells Dell of his need and since Dell is also in dire need of cash (to the tune of $20,000) he agrees to help. They should have just waited for the state to declare his aunt officially dead.<br><br>Along the way they encounter Eliza Dushku and her brother who apparently has a connection AND the blueprints to Eloise. They break in; getting out is the problem.<br><br>I will not be as critical of this movie as most. I thought the story line was developed nicely (it did actually make sense), and the acting and directing was better than most movies of this genre. There was not an overuse of blood and gore and the director did manage to build some actual tension. That does not mean the movie is without its warts, because it did have plenty. <br><br>Rated \"R\" for language, disturbing images, and some violence. This one is a toss-up.","user":"dcarsonhagy","rank":[25,28]},{"title":"It wasn't THAT bad.","rating":6,"date":"7 June 2017","review":"The movie wasn't THAT bad. The only reason I watched it is because I grew up not far from there and didn't realize this was shot on site. I had never been in there but as a kid was threatened to be thrown in there 50 times (C'mon every town has one of these places that kids know of like \"If you don't straighten up we're going to have you thrown in Shady Pines\". Well for us it was Eloise).<br><br>The most horrifying thing about this movie was how they got that black dude to play that 1970s J.J. stereotype then have him stealing the drugs and shooting at everything. Having him nearly drown was the icing on the cake as you know black people are afraid of water too (eyeroll).<br><br>TRIVIA: Jackie Wilson is buried in a cemetery across the road from this place. It was paupers grave for years until they raised enough money for a proper monument.","user":"stormatsunup","rank":[19,24]},{"title":"4 people join forces to locate a death certificate in a closed psychiatric asylum in order for one of them to inherit 1.2 million dollars","rating":6,"date":"24 July 2017","review":"First, let me say I am not a horror film aficionado. I do not watch them, period. However I am extremely interested in urban exploration of abandoned mental hospitals. That is what peeked my interest initially.<br><br>The story line is your basic way to get into these abandoned hospitals, then the visions and hysteria that accompanies infiltration once there. I agree the acting left a lot to be desired, but I think the strength of the movie lies in the depiction of suspended reality. Which is real and which is imagined scenes? The film left me a bit unbalanced as I watched the 4 struggle with their own fears while in the very secret, very restricted annex.<br><br>Did anybody get the homeless guy? Well, I thought about him for awhile, then concluded he was the infamous Dr. H.H. Greiss in the flesh looking for a part of his life that was taken away from him. Watch this part carefully and see if you don't agree. I thought the plot twist at the end regarding the true relationships from the past was sheer genius, including that of Jacob and Dr. Greiss. Once again, having read the previous reviews, you should bypass the horror aspect and look at it from the perspective of hidden lives that were never fully buried. <br><br>The beginning shows Pia in some sort of room. Was that a modern version of Eloise? Was it jail, what was it? In the end they go back to the room with Pia. I liked that full circle inference and the parallel to what the patients of Eloise may have experienced. It depicts being unhinged in what seems to be a reality you are lost in, when no one believes what you have seen. Was the whole affair nothing but a figment of Pia's broken brain? Hmm, did she create the sketches, the receipts, the entire story because she was crazy and had been part of Eloise as a child, then locked away in an asylum for life, where she could only create a normal life by living in her head, but not really living it? <br><br>As horror, it left much to be desired. However, the story told may not be what you think, or maybe it is. You decide.","user":"jmitastudios","rank":[7,8]}]