[{"title":"Finally a Tale of Truth in Hollywood","rating":10,"date":"28 August 2016","review":"I find this movies exhilarating , emotional and in the mean time extremely sad, as always Adrian Brody hits his target. I am an Iranian so I can make a perfect connection to this story, it is a tale of exile and forced migration, I had to go through a less severe version of exile myself. <br><br>After the Islamic Revolution in Iran, the poor and illiterate that were empowered by the Islamists and mullahs have been given a power to loot, abuse and murder those in minorities,wealthy individuals and those who supported the previous regime. the story still continues till today. illiterate,bigoted Muslim thugs with beards still kidnap , murder, blackmail and ransack as they please. Mullahs still hold power in 21st century and Sharia law is the law of the land.<br><br>It is very hard for me or any Iranian who lived before the revolution to even imagine the ciaos brought upon us by these Islamic vermin. I even noticed some of the regime apologist have lowered the rating here in IMDb screaming murder and demanding justice. <br><br>This film is incredibly close to really, there was no propaganda involved and even today the same is happening in Iran, when country is taken over by a fascist religious ideology these kind of behaviors are normal. What is abnormal are the regime apologists residing in the west and still defending the undeniable. <br><br>The story begins when a prosperous Jewish family living in North Tehran faced with horrors, a self-made business man with his family watches as his country being tore apart by fascist religious bigots. being Jewish and wealthy, his business is ransacked by his own employees and he was arrested for being in touch with Royal Family of Iran, His wife and child are being abused and constantly taunted by the notorious IRGC members.on other side his wife and child waiting for hi at home are being faced with a class indifference and illiterate lower class demanding their rights. <br><br>Watching this movie is incredibility put you in touch with revolutionary Iran, it worth every second and it is an incredible accurate of what really happened.","user":"mypersianheritage","rank":[41,71]},{"title":"Not a single believable scene or dialogue!","rating":3,"date":"2 November 2015","review":"The story is about the family of a successful Tehran businessman, being targeted by the revolutionaries in late 70x Iran. He is detained and tortured (but not deprived from bathing and socialising with other prisoners in a hamam), she is abused (but only verbally) and their house and business premises are looted (except from the wine and the most precious diamonds). So, yes, the family are the victims, and the revolutionaries are the villains. But in the end the whole story is about them bribing their way out of the country. The most pathetic car chase in movie history notwithstanding. And the worst deal a Jew has ever made for transport services. What exactly is the moral here?<br><br>Mind you, not a single scene or dialogue in the whole movie is remotely believable.","user":"darba36170","rank":[44,80]},{"title":"Why did Shohreh Aghdashloo stoop so low?????","rating":1,"date":"26 February 2017","review":"I'm an Iranian living in exile. As a child living in Iran in 1979, I remember very well what my my parents and my family went through. We were not Jews or minority of any kind. After the Islamic took power in 1979, many were persecuted. As Iranians we consider ourselves \"One Nation\" regardless of religion. The actions of an idiotic government that took power in 1979 does not AT ALL reflect the feelings and attitudes of the Iranian people toward each other. We consider ourselves of the same race. Like Italians, we have more fair and less fair, olive skin and white skin, as well as super fair and super dark... and it doesn't matter to us. Iranian Jews are not more fair or \"white\". They can have any look just like any other Iranian. Iranian Jews are not the only wealthy ones or well-dressed ones in Iran. It may be quite the opposite but I won't get into that and I don't want to stoop as low as the screen writers here.<br><br>Also, I wonder why two Americans were chosen to play the main roles... There are countless great Iranian-American actors who could have done a much superior and vraisemblant job, but I am sure they didn't. And Shohreh Aghdashloo, top Iranian-American actress, disappointed me so much in accepting a small role in this anti-Iran film.<br><br>I've rated this film 1 because it's a horrible choice and can throw off the non-Iranian viewer completely. As for Iranians, we lived this; we don't need to watch it again.<br><br>I loved the film. It's very real. I cried a lot during the entire time watching it because this happened to many Iranians especially those in positions of power. Those who say it's not believable are those who know nothing about what horrors took place in Iran after the Islamic regime took power in 1979. My mother, a very apolitical nurse, was the principal for a Nursing Assistants school in Iran and after the revolution she demoted herself to working as a Nursing instructor in a different city just so we would not become targets for the new regime. You have to realise that anyone in a position of power under Shah's regime could be accused of being a heretic and be called all sorts of names.<br><br>The main character Isaac is a successful Iranian man who as he states just \"happens to be a Jew.\"<br><br>Here's the \"Dummies\" version of what happened:<br><br>Prior to 1979, Iran had a secular regime under Mohammad Reza Shah (AKA the Shah of Iran). Most ordinary people enjoyed life in Iran pretty much like the way we do today in North America or Europe. You could decide to practice any religion or no religion. You could go to a bar if you wanted to. Yes there was dancing, lots of parties and fashion followed Europe closely (much nicer fashion than North America).<br><br>The only downside of the Shah's system was that he had a mini- party regime and proclaimed himself king for life without being questioned. So you see, those who could dare question him could be imprisoned, tortured or executed by Savak, Shah's secret police.<br><br>The non-political middle and upper classes enjoyed a good life. Many communists and left thinkers started the movement against the Shah. However the uprising somehow was transformed into something bigger when out of the blue (in reality with the support of the US), a exiled clergy named Khomeini started speaking against the Shah too. At that time, the masses who were poor, rather religious and frustrated by the status quo took him to be the answer to their prayers and showed increasing support for Khomeini, much like American rednecks thought Trump was an answer to their prayers!<br><br>Shah left soon. Exiled Islamic clergy, Khomeini came to Iran with the support of thugs, and the misery began........<br><br>Now this was a time of chaos and anyone could be picked on. Wearing the hejab (covering hair for women ) was not a serious mandate yet (film is inaccurate in that regard). Yes religious minorities such as Jews, Christians or Baha'is could be picked on, but then so were all other Iranians who were successful or those who were Muslim by birth and didn't seem to practice it seriously (most Iranians). <br><br>The story is great, but I could understand it because I'm a fellow Iranian. For a film that is marketed to people outside Iran, the film doesn't provide a setting or backdrop. Just because Isaac is Jewish the viewer may easily assume only Jews or religious minorities were targeted by the new regime in 1979. Just because the thugs are mostly Muslims the viewers can wrongly deduce that the story is about the conflict between Muslims and Jews. No. Iranians love each other and most are not blinded by religious differences amongst themselves. <br><br>Another minor issue of inaccuracy: When some men are speaking, one says Cyrus the Great didn't discriminate based on religion whether it was Islam Christianity or Judaism. :) Well, Cyrus the Great ruled Iran (the Persian Empire) 2575 years ago! This was before the birth of Christ and the advent of Islam!<br><br>All in all, a very honest film, except the fact that to uninformed non-Iranians who are fed anti- Iran propaganda and think Iranians are all a bunch of uneducated religious fanatics, the movie doesn't help. That's just because the main character happens to be a Jew. Unfortunately there's no portrayal of what Most Iranians looked like, dressed like and behaved like, so some viewers might assume that lifestyle of Isaac was exclusive to non- Muslims! <br><br>Now that you're better informed, please go ahead and watch this heart-wrenching story that happened to many of us Iranians. That's why many of us are living in diaspora, and the majority of us are light-practicing or secular Iranians born Muslim.","user":"persian-belle","rank":[19,31]}]