[{"title":"Sweet gem of a movie!","rating":8,"date":"4 July 2018","review":"My wife and I liked this movie a lot. It's a little slow-moving, but far from boring. The plot requires some obvious suspension of disbelief, but not too much to enjoy the film. The main characters are bit different, but endearing and not caricatures.<br><br>If you think science fiction movies require massive explosions, space ships and special effects then you'll be disappointed. But this movie is well written, well acted, well photographed and well worth your time to watch!","user":"jim-80702","rank":[15,17]},{"title":"great, I love it!","rating":9,"date":"6 December 2017","review":"it's a low-budget indie sci-fi/fantasy. a little bit of romance in there as well.<br><br>I'm watching this movie without knowing anything about it, never heard of it and never seen the trailer, so I have a minimum expectation. and I love it. <br><br>if you expect to see a dystopian world with lots of conflicts or a survival journey for a better world or life, you won't get it in here.<br><br>it's a light movie, pretty straightforward. there is nothing much happening in this movie, you don't really get a huge conflict, which gives me positive vibes to the story, and somehow uplifting.<br><br>the cinematography is great, and I love the bright color.","user":"IvanSamudra","rank":[27,34]},{"title":"Everything is far far away..","rating":5,"date":"6 December 2017","review":"As the title suggest \"Everything beautiful is really far far away\". There is no sense to this movie as the plot suggest, two individual and a robot-head (main character has a head of his robot) walk through the desert in search of a lake. I said no sense because their no survival method of any kind. They walk during the day with the scorching sun and sleep at night, find water &amp; food when ever they want and where ever they want, they look like they don't need to take bath even after weeks of travel, looks fresh and healthy all the time.<br><br>To most of the viewers this movie will be boring and if your are looking for something interesting or satisfying than stay away. This might not be your cup of tea. If you want to kill sometime and don't have anything else to watch and if you can keep the logic and common sense away, than give it a try.<br><br>Anyway i will give it a 5 for their effort.","user":"rvprasanth","rank":[25,39]}]