[{"title":"full of provocative thoughts and human insights but a lot is expected of the viewer and it is easy to get left behind","rating":8,"date":"28 February 2019","review":"Seems to me the most frequent complaint about this film is that it is 'slow and boring' and the most positive that it is like Mulholland Drive. The latter comparison, is falsely made, I guess, because the film is complicated and the former remark simply because this tends to be the fallback option if there are not enough explosions. If anything the film moves too fast for its own good. The dialogue is excellent, full of provocative thoughts and human insights but a lot is expected of the viewer and it is easy to get left behind. The therapy sessions should be an opportunity for things to slow down and for us to get our bearings and sort out what is real or not to us and perhaps more pertinently what is real or not to the characters. But nothing is as simple as it appears here and even the sessions seem to take us into even darker areas. Excellent, but not the easiest film to follow because it does not set out a simple path. For those for whom that sounds 'boring', I guess will find it boring. Not sure what that proves though.","user":"christopher-underwood","rank":[10,10]},{"title":"A policeman feigns mental illness to track down a double-killer","rating":10,"date":"1 November 2017","review":"Gareth Tunley draws top-notch performances from a distinguished cast, while spinning a story about mental illness into the hunt for a double-killer. How he managed it on what is obviously a small budget I have no idea. The word here is quality, from everyone involved.<br><br>Tom Meeton is a crumpled detective landed with trying to find a double-murderer. A couple have been shot in their own home, but appear to have run towards their assailant, even when shot several times? Why would they do that? Meeton's flawed detective Chris goes undercover to try and find the chief suspect. But as Chris gives a psychiatrist a cover story, only to secretly sift files in her office as he looks for leads, he starts to question his own role in the case. He professes to be an unemployed man who has no life, and when we see him marooned in a poky flat, being brought bottles of vodka by his partner/best friend it seems his cover story is being played by the book.<br><br>But as his search for the killer takes him to a second doctor, it appears there may be more than one murderer in this beguiling journey into our troubled anti-hero's psyche. This is a low-budget film, but one with considerable talent behind it. The haunting soundtrack by Waen Shepherd is almost a character in its own right, and as Chris struggles to keep his own sanity he appears to be becoming the cover story he has created for the purpose of trapping the killer. Or as an inquisitive party-goer suggests, maybe he is just an ordinary lost man, and the shrinks have made him think he really is a policeman.<br><br>As he draws closer to his main suspect called Coulson, his quarry turns the tables by suggesting the two shrinks, Drs Fisher and Morland are in fact the guilty parties here, and they are out to steal the mind of an unsuspecting patient as an exercise in psychological body-snatching? Is Coulson mad, or has he in fact stumbled upon the real culprit/s? There are no easy answers to this haunting mystery, but the performance by Meeton in the lead role is one that will stay with you long after the credits, while the rest of the cast never strike a false note.<br><br>It would be good for once, just once, if the UK's so-called marketeers would pull their fingers out of their backsides and put some muscle into promoting a minor gem like this instead of throwing their weight behind yet another James Bond blockbuster made for $200m. Just a thought, people, just a thought. Go see it. It's well worth the effort.","user":"ian-bell92","rank":[19,25]},{"title":"Looper.","rating":7,"date":"11 August 2017","review":"Best pay close attention here, as not all is as it seems.<br><br>Twisty movies can be god fun, but as is the case with \"The Ghoul\", they can be quite unsettling. What starts out as a standard police drama slowly melts into an endless, dark, psychological journey, where everything is gradually turned upside down.<br><br>Not an easy watch, this: a dreamy, hallucinatory, moebius strip thriller with an agonizing performance from the spiralling lead (the excellent Tom Meeton). Filmed in dark, bleak confines, \"The Ghoul\" works, not inspite of it's micro budget, but because of it - relying on claustrophobic interaction from the players.<br><br>Fans of linear cinema need not apply, but those wishing for a jarring, thought-provoking experience will be rewarded.","user":"js-66130","rank":[25,35]}]