[{"title":"Head Trip in Every Key","rating":9,"date":"29 August 2014","review":"Total auteur cinema, in the best, non-pretentious way possible. This is a film that never takes itself too seriously, yet throws down on some serious themes and ideas. A schlub who can't catch a break suddenly turns vampiric and kinda cool. Kinda. Not just Onur's performance, but every character, even the minors, are totally on it. They bounce off each other effortlessly. I'm normally bugged by neurotic characters, as they usually feel forced and rehearsed. Not Onur. His rhythms and surprisingly-apt observations come effortlessly, like he's abandoned the script for what he feels is true to the moment. It's honest to the core. Self-depricating and rude and hilarious. And there's blood and sex and internet dating. It's rough around the edges in the right ways. I have no idea how it was pulled off, but what feels like a colossal mess of ideas comes together so cohesively. It just clicks. It moves forward and doesn't really care if you can keep up. It may be the first film of the year that I really love.<br><br>And really, we're all afraid of becoming Michael Douglas.","user":"joelpotrykus","rank":[38,61]},{"title":"Anti-hipster satire needs a lot more bite","rating":1,"date":"11 January 2015","review":"I must have watched a completely different movie from the other reviewer, but I could not stand this film. The main character is so abominably unlikable and annoying that it's hard to see the point - sure, pretentious hipster wastrels are a reasonable target for satire, but you have to let us out of his insufferable orbit a bit or else we can't breathe. And when the movie's plot (such as it is) centers around this schlub's relationship with his girlfriend, an attractive, up-and-coming lawyer, it robs that plot of any motive power when we can't figure out why anyone, let alone her, would be with this guy. Agonizing to get through.","user":"lotdw-1","rank":[19,36]},{"title":"Mixed reaction","rating":5,"date":"30 September 2015","review":"The acting was very good--though I suspect that a good portion of the dialogue was ad libbed which may have been the film's strength as well as its weakness. The ad libbed riffs (if I'm right) contributed greatly to the natural feel of the dialogue and the character's reactions, as well as the give and take between the characters. The problem with this is that too much of the dialogue was constant complaining about something, or off the cuff semi-insulting childish responses to justifiable criticism that made the main character very annoying and unlikable. The best part was that the other characters ALSO found him childish, irritating and odd. In this light, the discrepancy that bugged me, is just how such a dysfunctional human being managed to hang onto his job and his girlfriend at all--and why anyone would bother giving him a second chance. Fact is, though, it happens so I can't very well fault the film for portraying a scenario that I see played out all too frequently in real life.<br><br>The film needed a faster pace (the entire first half hour was pretty much NOTHING but the main character's complaining and self-absorbed existential whining (though that phrase gives it too much philosophical weight)and more variety in the dialogues (though there were some laugh out loud humorous bits, it was too monotonous overall). Once the action occurs in the middle of the film it picks up (the highlight of the movie and very well done actually--one of the more realistic vampire conversions I've seen--this isn't a spoiler, it's in the film synopsis) for awhile then goes back to pretty much the same old thing. The kicker being that while he has now pretty much gotten everything he wanted, of COURSE he's STILL not satisfied (we all know someone like that) and wants to go back to the way things were (finally recognizing what he's given up). If there is any real philosophical premise in the film it's that hindsight is always 20/20 and you don't appreciate what you have until it's gone.<br><br>I really did enjoy the relationships as they were portrayed, and the film had a very promising premise with some genuine humor, but as with most vanity films (directed and starring the same person) a more critical eye was needed; less whining; and a shorter running time or livelier pace would have helped a great deal. There is a bit of a twist at the end, but nothing that you can't see coming a mile away. Still, this isn't your typical romantic lead, nor your usual vampire film--not by a long shot. If you are a fan of vampire films, you may enjoy this quirky take on the genre--or you may find it incredibly boring and the lead character overly irritating.","user":"ladybug2535","rank":[2,2]}]