[{"title":"Weak plot great artwork","rating":7,"date":"11 January 2015","review":"To be perfectly honest what this movie misses most is a game controller. The movie consists of good action scenes great boss battles and over the top weapons and abilities. Why then do I have to sit still and watch instead of actually engaging in the battles? <br><br>The plot of this movie is nothing to write home about. You have seen it in one form or another a million times before, often better executed. Would've done nicely for a game though.<br><br>The artwork however: sublime. I really doubted in the beginning of the movie whether it was animation or live action (other scenes are less convincing but still). The ruins of New York look like a delight to wander around in and to just explore. <br><br>I can honestly say I watched this movie for the art, not the story.","user":"mcoelenfun","rank":[13,14]},{"title":"Excellent addition to series, wish I'd waited for Blu-ray version","rating":9,"date":"1 August 2014","review":"Another solid entry in the Appleseed series. Action packed with a solid story line. It is beautifully rendered and if you have the option to see on blu-ray, choose that one. The character designs are excellent (well for the main character especially). The storyline would have greatly benefited from a multi episode arc instead of being crunched down to 90 minutes, but it delivers in the end, and lets you look forward to the next in the sequence without beating you over the head with the half-assed open ending. There were so many plot points that could have been expanded into their own episodes, I would have much enjoyed further detail on the relationship with Two-Horns and Olympus, and even the backstory of the villains themselves. Solid voice acting and direction deliver the goods and the action is solid and engaging.","user":"joeywyss","rank":[14,20]},{"title":"terrific animation in search of a plot","rating":4,"date":"25 July 2014","review":"The oddly named Appleseed Alpha is essentially a series of action sequences punctuated by bland dialogue and weak attempts at character development. First, the story and dialogue are particularly weak and unoriginal. As someone unfamiliar with the comic book series on which the film was based, I was hoping for a little more back story or at least a little more information about the characters and their motivations. Second, the characters are lifeless and unlikeable, and the relationship between the protagonist and her cyborg partner is nearly devoid of humanity--nothing like the cyborg-human relationship in Ghost in the Shell. Strangely, most of the human characters seemed more like cyborgs than the cyborgs did. The animation is the film's saving grace, however, and hardcore anime fans will appreciate the detailed and amazingly lifelike characters and environments. The voice acting is also decent, considering the laughably bad dialogue. Bottom line: I don't recommend it unless you're a serious anime fan who has run out of things to watch.","user":"sunsmudge","rank":[28,45]}]