[{"title":"Ignore all the bad reviews! This was a good movie.","rating":8,"date":"7 September 2017","review":"** Possible Spoilers **<br><br>First off, I have no idea what these other reviewers are talking about with this \"alternate universe\" theory. The fact is this movies ties perfectly with the first one. All the same characters are in the movie from the first one and many references are made to Doc, so not sure how this thought came about. <br><br>This movie is essentially a version of cars where Lightning McQueen actually aged, meaning he is not the same age as in the first one. With age, especially in sports, comes new, and younger, talent. In this movie lighning McQueen is faced with this same challenge, new, younger, talent who are training in new, more advanced, ways. With this younger talent and better training methods (Lightning McQueen still trains like he did under Doc) Lightning is having a tough time competing against the new guys. He essentially has to make a choice, adapt with new training or retire. I won't go into the details of his choice as I don't want to spoil it for anyone. <br><br>However, this movie was very good and, I thought, a fitting end to the franchise. Can you imagine a Rocky movie where Rocky never ages and just keeps fighting and beating everyone? No, and that is not how the Rocky series ended. Rocky retired and helped the new up and coming fighter. That is somewhat what happened here. <br><br>I can only assume the others making the reviews wanted Lightning to be perpetually young and just keep racing and racing and beating everyone, movie after movie. The writers wisely chose not to follow that formula. Yes, I will agree, there is a bit more of a story here than just pure racing, and perhaps that is what people didn't like. However, that didn't make it a bad movie. <br><br>I hated Cars 2 but I did really like Cars 3. It's not a perfect movie but also isn't what people are making it out to be. Give it a chance and I think you will like it.","user":"mcain-26057","rank":[113,155]},{"title":"An incredible comeback for the Cars franchise","rating":9,"date":"4 July 2017","review":"There will be spoilers...<br><br>Oh boy, where to begin.<br><br>I'll start with the elephant in the review section: The accusations of \"sexism\" and \"political correctness\". Yes, it's true, there is a female car in the film who happens to be a talented race car. The horror!! Look, I get it. I hate having a blatant agenda shoved down my throat. Ghostbusters, I'm looking at you. This wasn't that. Not even a little bit. If you think it was, well, what can I say. Maybe you should just go home to your bunker and watch Breitbart.<br><br>The bigger, and I think slightly more understandable, issue is that of the overall message of the film: our heroes getting older, and the end of McQueen's career as a race car. Hey folks, time marches on. People change, even our role models. If your kid can't handle McQueen passing the torch on to a younger, more adequate player, then maybe you should plop your brat in front of the TV with Cars 1 on a loop. News Flash: this is real life! It happens in all sports. Baseball, Football, Basketball, REAL RACING! Whether we like it or not, our heroes at some point become too old to do what they do. Progress happens. We improve. As a baseball fan, I see it every single year. Players we love go away, and new blood comes in. The message in this movie is exactly that. Kids need to learn from a young age that you can't have the same guy up there doing the same thing every day. Heck, if Cars 1 took place in the 1950s and was about the Fabulous Hudson Hornet, people would be complaining about a new car called Lightning McQueen. What an incredibly boring world it would be if Lightning McQueen always won every single race and no other cars came along to improve on the sport. He isn't becoming less of a hero, he's not being emasculated. His accomplishments aren't being diminished in any way. He's helping the next generation to become a hero too! And so what if that new hero is female? By taking this apparently contentious route, Pixar has opened up the Cars franchise to years and years of new material. New heroes will emerge and some will go away. I for one am delighted by this new direction. I was concerned with the let down that was Cars 2 that the third installment would be useless. It wasn't, not even remotely. Cars 3 is fantastic, and I thoroughly enjoyed it. My 3 year old son, who is obsessed with McQueen, loved it too.","user":"robinoflocksley-626-174767","rank":[86,141]},{"title":"Not what I was expecting","rating":1,"date":"16 June 2017","review":"Not what I was expecting, *spoiler alert* franchise killed lightning McQueen, he never recovers to race again. Huge disappointment for my son, it was literally the death of lightning McQueen.<br><br>Lightning McQueen then goes on to become the youngest trainer in history bringing to an end his career as lightning McQueen. McQueen gives his position to a trainer that is older than the newer model Jackson Storm, she happens to be a girl. So my son is waiting for hero to pull through and then gets shot down by McQueen giving up. The spot McQueen gives up is won by a trick and not by speed. My son is not going to cheer for a new when the old is no more. Definitely early death of number 95. Very depressing movie. The trailer was definitely misleading.","user":"elviratrevino","rank":[124,231]}]