[{"title":"Not a review, just a warning","rating":2,"date":"6 December 2015","review":"Another cheap ass TV movie with terrible actors and terrible everything else. Not strictly a review, as I feel I'm doing enough to warn everyone straight out the gate. As for the only other guy who reviewed this movie, add him to the blacklist. Most of the films he's seen are rated 10 out of ten, and that includes \"Lavalantula\". It's sad because the rating system on IMDb used to be good, (and does still work,with the right reviewers) but recently the fake profiles and reviews have been getting way too obvious. I hope they realise their names and affiliations can be traced, as I've seen reviews from people on here that have actually been tied down to directors, actors, and other frauds. I just hope everyone is together enough to spot these reviews a mile away.","user":"dna-1138","rank":[77,88]},{"title":"OMG! And not in a good way....","rating":1,"date":"27 December 2015","review":"Sorry but I can't keep quiet about this one. It's just god awful. Everything about it is terrible. The acting is probably the best part and after about 30 seconds you realize that it sucks. Even the actors seem to know that the story is terrible, they show no interest in their parts and obviously just want to get paid and leave. The writer has no concept of physics or anything to do with science for that matter. The special effects are cringeworthy. Sure it's a low budget film but that is no excuse, there are some really good low budged movies and this is definitely not one of them. Whomever gave it a 10 out of 10.... well I'm glad you liked it... I didn't.","user":"toumasrahl","rank":[17,19]},{"title":"Terrible movie, no idea how this got so much advertisement","rating":1,"date":"7 December 2015","review":"sorry but it was just terrible, the acting was some of the worst I've seen in a long time, i read the first review giving it a 10/10 which was quite obviously written by someone who worked on the movie, easily identified by the 9 out of 90 people found that review helpful, that other 81 people knew what was going down i noticed it was one of the most downloaded movies online so read up on it, despite the reviews said id see for myself but wow, i can only blame myself but wish i could get that time of my life back to waste on a real actual movie instead, it pretends to be something new yet its not it pretends it has a point to it but it doesn't its just a long drawn out waste of film, don't bother.","user":"airfaith","rank":[13,15]}]