[{"title":"Gored for a laugh !","rating":9,"date":"23 May 2019","review":"I wonder if some people just can't be pleased or have so little going on in their lives they have to complain at the slightest opportunity. Either that or they hate anything that interferes with their \"sit in the corner and whack off opinions about Shaun\". Well Shed of the Dead is a fun, boyish, crude, and sometimes distinctly immature journey into a gaming geeks fantasy, about zombies, women, and heroic figures. It's a popcorn movie with crude jokes and knowing nods to all the films of influence that have come before. It won't win any oscars but then I doubt it ever intended to. Instead it just has fun, ramps up the adult humour, and dares to tread where Shaun didn't want, or have the cajones to. So instead of whining like spoilt little kids who won't share their toys, grab a handful of what masquerades as your manhood and lighten up ! Life is too short !","user":"anthony_wakefield","rank":[73,96]},{"title":"A great giggle with gore! Superb","rating":10,"date":"25 May 2019","review":"I'm a fan of a lot of the cast from previous movies with completely different genres.<br><br>Collaboratively well done, really enjoyed the movie. Pleasantly surprised and one I'd watch again.","user":"findelaney","rank":[67,88]},{"title":"A zombie comedy that is fun.","rating":9,"date":"24 May 2019","review":"Shed of the Dead is a fun, hilarious movie consisting of zombies, crude jokes, &amp; blood and gore. All the cast play their roles well. We see comedic sides of legendary horror icons, Kane Hodder, Bill Moseley &amp; Michael Berryman. Spencer Brown, James Fisher, Emily Booth, Ewen MacIntosh and Lauren Socha are brilliant.\nIf you are one of the low rating reviewers who say it is \"not Shaun of the Dead\", well bingo..it isn't, and it isn't supposed to be. Stop comparing. Go into this movie, wanting to enjoy a well made film centered around fantasy, comedy, &amp; horror.\nI thoroughly enjoyed it. The comic intro and ending sequences are great. The inner gamer in all of us will enjoy this film. Check it out. Thanks to all cast and crew for making this film.","user":"starbug-58540","rank":[69,91]}]