[{"title":"A Thriller with Great Potential and Cast, Wasted by a Poor Screenplay and Inadequate Direction","rating":5,"date":"31 December 2016","review":"The divorcée Rachel Watson (Emily Blunt) commutes every day to New York by train and watches the old house where she lived with her husband Tom Watson (Justin Theroux) through the window. Rachel is an alcoholic and sterile woman that frequently has blackouts and shares an apartment with her friend Cathy (Lura Prepon). Tom is married with Anna Boyd (Rebecca Ferguson) with the baby Evie. Their babysitter is Megan Hipwell that lives with her husband Scott (Luke Evans) in the same neighborhood in the suburb. Rachel admires Megan and Scott since she believes they are the perfect couple. However Megan is a promiscuous woman that has affairs with many men including her psychiatrist Dr. Kamal Abdic (Édgar Ramírez). When Rachel sees Megan kissing another man on the balcony of her house, she decides to have a conversation with Megan after drinking in a bar. However she has a blackout and awakens with bruises in her apartment. Soon she learns that Megan is missing and Detective Riley (Allison Janney) that is in charge of the investigation visits Rachel to interrogate her since the neighbors had seen an alcoholic woman wandering in the area. However Rachel does not recall what she did that night. Rachel decides to investigate the case and has dreadful discoveries about her life and Tom. Who might be the killer?<br><br>\"The Girl on the Train\" is a thriller with a good story but terrible screenplay. The characters are not well-developed and despite the great performance of the wonderful Emily Blunt, her character Rachel Watson is a complete mess. Megan and Scott Hipwell, Anna and Tom Watson, and Dr. Kamal Abdic are also one-dimensional characters. The non-linear screenplay could be better and better, but instead of suspense and tension, gives the sensation of a soap-opera. In the end, \"The Girl on the Train\" is a film with great potential and cast but wasted by a poor screenplay and inadequate direction. My vote is five.<br><br>Title (Brazil): \"A Garota no Trem\" (\"The Girl on the Train\")","user":"claudio_carvalho","rank":[117,175]},{"title":"Emily Blunt worth an Oscar!","rating":9,"date":"11 January 2017","review":"I read some of the reviews here, and came with very low expectations to this movie, and WOW, what a pleasant surprise! Blunt gives here the show of her life, way above the level of acting in \"edge of tomorrow\". The story itself takes time to build but it all adds to the atmosphere, and finally you get a fair amounts of twists and turns. Bennett and Ferguson also acting very well, which all adds (to my opinion) to a great film. And to all the men that say it's a \"men hating\" film, I say that you really have a low self-confidence to come up with such a statement... I would risk to say it's one of my 2016 best films, and I will be surprised if Blunt will not be an Oscar nominee for this film.","user":"liorreem","rank":[100,159]},{"title":"Brilliant","rating":9,"date":"4 January 2017","review":"I have been on IMDb for a number of years and always rate the movies i watch. I have not written many reviews,however i think i needed to write this one. This film is brilliant. I haven't read the book but the story was excellent and having read reviews i am disappointed with the negative reviews of this masterclass in story and film making. Do not be put off folks, this was a real thriller mystery and deserves a big 9.the acting was superb,and having been in a drunken state myself for a time they couldn't have put it more realistic. Enjoy its really good, please check my review scores before taking my opinion,i don't like crap as you will see.","user":"wayne-robb","rank":[149,246]}]