[{"title":"Paper Towns","rating":4,"date":"25 July 2015","review":"Let me start out by saying I never read the book, so I can't possibly have any beef in that area. I also didn't see TFIOS previous to this, so I can't compare. However, I was extremely unimpressed by this movie overall.<br><br>I was impressed when the anti-climax came, and Margo basically just told Quentin, \"Hey, you're crazy for coming all this way. Nothing I did actually was meant for you in any way.\" At this point, I was thinking, that's pretty ballsy for them to lead all the way up to this nihilistic shattering of idealism for Quentin.<br><br>And then they just half-assed it.<br><br>I was disappointed when the ending came and they tried to sort of flip it around, like, \"Wait, no, it DOES have meaning, see? They had fun!\" If they had stuck to the tone of that scene with Margo and Quentin in the parking lot, I would've given this a 6 or a 7 out of 10, even though the rest was just average.<br><br>I liked some of the other characters' small changes and the flirting with the idea that they're all going away to college to never see each other, but Quentin's character arc was simply not there. He started as just a spectator, and ended as just a spectator.<br><br>Overall, I give this a 5/10 for just being a mediocre movie overall, and the pacing feeling a bit strange sometimes.","user":"crackedfan9128","rank":[22,24]},{"title":"Maybe I'm just getting old...","rating":3,"date":"31 July 2015","review":"Maybe I'm getting old. These over-serious, platitude-filled teen dramas used to only mildly annoy me. Now, with Paper Towns, I feel myself getting irrationally angry at its desperate plea to be this generation's The Breakfast Club. From where is that resentment coming? Maybe it's that I'm a 30-year-old married-father who's not meant to like this movie. Maybe it's that I'm coming off the high of the teen drama Me and Earl and the Dying Girl. Whatever it is, Paper Towns irritated much more than it charmed. The premise has potential: nerd spends one magically frivolous night with the enigmatic girl of his dreams, Margot, before she inexplicably disappears. Instead of being unique, stylish, or progressive, it becomes the lament of the rich-white-teen and the manic pixie dream girl. Our \"hero\" is drawn to her magnetic mystery, but that appeal never reaches the audience. At times, she represents an idea more than a character, but mostly she's an unbearably selfish, manipulative shrew, using her womanly wiles to get whatever she needs. When she's off-screen, the interplay between the friends is watchable, but her bothersome presence is never far away. Worst yet, in the end PT never takes a stance on Margot, like the movie is trying to have its cake and eat it too. Stylistically, the movie is forcefully quirky, annoyingly cutesy, and boasts a soundtrack that's like someone pushed the \"hipster\" button on a Casio Keyboard. We can only blame director Schreier, whose previous film was the under-seen Robot and Frank. Just stay home and watch that, a story about a machine with more humanity than anyone in PT.","user":"matthewssilverhammer","rank":[205,260]},{"title":"Exactly what it shouldn't be - a paper film with paper characters and paper themes","rating":4,"date":"24 July 2015","review":"\"Paper Towns\" is that kid in the lunchroom who acts different and seems cool but it isn't until you talk to him that you realize he adheres to all the social conventions and routines of life that you thought he was rebelling against. It's the kind of film that feels like it was written by an adolescent girl cherrypicking reblogged Tumblr quotes from her wall to suffice as the theme for the film. It's the kind of film you'll love if you find the idea of \"getting lost to find yourself\" a profound concept.<br><br>\"Paper Towns,\" finally, is the kind of film where the love interest is named Margo Roth Spiegelman (Cara Delevingne), whose vacuous personality is mistaken for mystery and enigma. She is defined by her absent gazes into the world, her love for \"random capitalization\" in her writing because \"the rules are so unfair to the letters in the middle of words,\" and her statements about her town, Orlando, Florida, being a paper town with \"paper houses and paper people.\" <br><br>She also happens to be the apple of Quentin's (the former \"Naked Brothers Band\" lead singer Nat Wolff) eye since she moved in his subdivision when they were young; he considers living next to her his sole miracle in life. However, the two have significantly drifted since their youthful days of innocence, until one night when Margo climbs into his window and says that she has nine things to do that night and needs a getaway driver. Stunned that the love of his life has waltzed through his window for the first time in years, Quentin takes Margo and peels off in his minivan to exact revenge on Margo's cheating boyfriend and her friends who didn't help her in her time of need.<br><br>Upon having the greatest night of his life, Quentin wakes up the next morning and sees Margo isn't at school that day, and eventually, notices she's missing the entire week. Her parents aren't concerned, for Margo does this a lot, but Quentin and his friends - the incessant Ben (Austin Abrams) and the geeky \"Radar\" (Justice Smith) - begin to uncover clues as to why Margo may have disappeared and where to. With that, the three teens, including Margo's best friend Lacey (Halston Sage) and Radar's girlfriend Angela (Jaz Sinclair), try to track down her whereabouts.<br><br>\"Paper Towns\"'s immediate problem is it's nowhere as intelligent or witty as it thinks it is. Its themes are all rehashed to the point of breeding contempt and its characters, particularly Margo, are so broadly drawn that they work against the film, which is clearly trying to breathe that fabled freshness into the teen film genre (it always feels like Quentin's going to stop the film with his narration saying the dreaded \"this isn't your average teen movie\" line).<br><br>Strangely, though, the most contemptible character throughout this whole film is Margo for more reasons than her empty personality. She's the kind of person who thinks it's okay to drop her friends and family without giving them any inkling as to what's wrong with her because she's trying to find herself. Finally, when somebody does something for her, particularly Quentin, she takes it with a grain of salt and goes about selfishly trying to advance herself rather than consider what she means to others. She's on the verge of growing up and being Amy Schumer's Amy character from \"Trainwreck,\" a contemptible, lost soul who takes advantage of people she meets.<br><br>Furthermore, the humor of \"Paper Towns\" is another thing that's frustrating. One moment, the film is trying to wow you with a \"deep\" dialogue about what lies beneath the surface of people, and the next, a character accidentally spills a can in which he urinated into all over himself and his friends. Once more, this is a film that's trying to be one thing but can't escape what it ultimately is: trite, frequently immature, and mostly empty exercise that has nothing revolutionary to say despite thinking it does.<br><br>However, don't fault the cast here, for they clearly give it their best shot. Their energy and charisma bring to life more than writers Scott Neustadter and Michael H. Weber (who wrote \"The Spectacular Now,\" a film you should see instead of this one) do. Nat Wolff, an actor I've consistently admired for his good-natured, everyboy appearance and personality, does strong work here in that realm and is assisted by capable performers like Smith and Sage (Delevingne would likely be better if she had a character to play).<br><br>\"Paper Towns\" is cut from the same cloth as \"The Fault in Our Stars\" (author John Green, who wrote the book on which this film is based, also wrote that one and Neustadter and Weber also penned that screenplay) in that it tries to take a different direction for its adolescent characters but crumbles under the lackluster deviations from reality it so often takes. On top of that, unlike \"The Fault in Our Stars,\" which was burdened by sentimentality and cringeworthy attempts at a perceived coolness, \"Paper Towns\" winds up being precisely what it didn't want to be - a paper film.","user":"StevePulaski","rank":[102,145]}]