[{"title":"Turbo Kid Review","rating":7,"date":"5 January 2018","review":"The 80s is arguably one of the most influential decades of movie history. Films such as Star Wars, Indiana Jones, and Back to the Future have often been credited as the inspiration of many directors of today's generation. One film series in particular pretty much kicked off the entire post-apocalyptic film genre, Mad Max. Created by George Miller, Mad Max was a series of movies that followed titular hero Max and his adventures in a post-apocalyptic Australia,usually meeting with thieves who are oppressing a certain people and then fighting them in several gun fights, brawls, and car chases. The Series overall while having varying degrees of quality has been a mainstay in pop culture, kicking off many more movies about nuclear wastelands.\n \nThis brings me to Turbo Kid, a 2015 Canadian sci-fi action comedy made to mimic the over the top action films of the 80s, Mad Max especially. Synth heavy music dominates the soundtrack and the effects are purposefully cheesy. While the movie may not be perfect, it certainly is an entertaining adventure.<br><br>It's the distant future of 1997, atomic war has devastated the world, what few remains of civilization there are live their lives as Scavengers and Barbarians. Add in the fact that a water shortage is leaving the world thirsty and the one person who controls the water is a mad tyrant, the World is not a very happy place.<br><br>The Film stars Munro Chambers as \"The Kid\", A scavenger and comic book lover who looks up to his idol, the superhero Turbo Rider. He leads a simple life of collecting junk, selling the junk, and then getting his small rations of food and water. One day, he meets a slightly insane girl named \"Apple\"(played by Laurence Leboeuf) who follows him around believing him to be his best friend. The two get involved in a series of incidents that has them end up getting pursued by the leader of the civilization, Zeus (played by the underappreciated Michael Ironside). In order to combat Zues's forces, The Kid takes on the persona of the Turbo Rider, to end the oppression caused by the warlord.<br><br>The Story does feel generic, hitting beats that can be seen from a mile away. However, where the movie does excel is in its characters. While the acting is (purposefully) cheesy, the characters really do start to grow. Laurence Leboeuf's portrayal of Apple is charming and genuinely funny in some parts and with a twist midway through the movie, Her character gets deeper and you start to feel for her even more. Another should be given to the previously mentioned Michael Ironside, of Total Recall fame. His performance is so over the top but not too much to where it belittles his character, even though his actions in the movie is mostly played for laughs.<br><br>Speaking of laughs, the movie's comedy is hit and miss. There are some jokes and actions that made me laugh, while others were..OK at best. Most of the comedy comes from action, more specifically the heavy amount of gore in the film. Many heads and body parts get cut up, usually with heavy sprays of blood. While Gore in movies can go overboard sometimes, mainly using it for shock value, This movie uses it well, The setting in the film is built well enough to make the gore seem like the kind of action that would occur in their world. The fight scenes could have been handled better though, with some of the hand to hand combat looking extremely cheesy. <br><br>But in a way, that's the whole point of the movie, to be cheesy. The world, the characters, the story, the action all is made to mimic the cheesy feel of 80s action films. It wont leave you with any lasting message or theme. Its main goal is to entertain and to that end, I genuinely enjoyed the movie. I can easily recommend it to any fan of action movies, and sci-fi movies, especially if you enjoyed 2014's similar film \"Kung Fury\". <br><br>3/4 stars: Check it out.","user":"brodieblizzard","rank":[14,15]},{"title":"B movie Fans, please apply!","rating":8,"date":"20 October 2015","review":"Turbo Kid can basically be summarised as 'The Road Warrior' on bicycles. Basic post-apoc tropes apply, and it makes no attempt to be anything other than what it is. And it does so admirably. The story is simple (in a good way), the soundtrack admirable and the scenery is appropriately bleak.<br><br>'B-movies' like this are hard to judge in terms of acting, but the actors play their parts admirably. It may be cringe worthy or cheesy to some, but its grand nonetheless. The effects are 'cheap', over the top and feel very 'dated', but in a good way.<br><br>If you love cheesy 80s action flicks, enjoyed Kung Fury and the like you'll feel right at home. Grab the SO, some popcorn and relax. It'll be a fun time.","user":"KeroScee","rank":[30,37]},{"title":"Colourful and bloody homage to 80's sci-fi action flicks","rating":7,"date":"22 June 2015","review":"Some films have no pretensions other than to simply entertain their audience. Turbo Kid is such a movie. It plays upon the continual love for the 80's that still shows no signs of abating. Its set in the future of 1997 - well this was the distant future in the 80's I seem to recall – and the world is a post-apocalypse. General lawlessness prevails and life is a survival of the fittest. Enter The Kid, a teenager who lives in a scrap yard surrounded by old 80's toys, he is joined by an ever-optimistic girl called Apple and together they go against a gang of bad guys ruled over by an evil man called Zeus.<br><br>This Canadian movie really goes for it on the 80's homage front. We have heroes on BMX bikes and a world not dissimilar to the Mad Max template. We also have a very agreeable 80's styled synth score that emphasises its influences at all times. The two young heroes make for an engaging central couple, with Laurence Leboeuf particularly impressive as the girl Apple. Michael Ironside is also on hand to offer some additional B movie cred and as a star of many 80's genre pics his presence makes additional sense. The story is nonsense of course but it never pretends otherwise. It's more a means to an end to allow us to see lots of over-the-top bloody action violence and colourful characters decked out in a selection of great outfits. It's fast-paced and, most importantly, it never forgets that its principle objective is to entertain. It reminded me a little of another Canadian movie Hobo with a Shotgun (2011) which also was a hyper violent modern recreation of an 80's genre pic with a veteran genre star (in that case Rutger Hauer). Turbo Kid adopts the same approach but dispenses with the more mean-spirited stuff from that one; its focus is squarely on a fun time.","user":"Red-Barracuda","rank":[67,92]}]