[{"title":"This movie will make you ANGRY","rating":4,"date":"1 October 2016","review":"I actually liked the movie, but at the same time I really hated it.<br><br>First off - Anyone that says Keanu Reeves can not act, is just being rude. He can act, he shows emotion. I could feel his pain through the screen and the torture he was going through. I could feel what he was going through and hence made me hate the film.<br><br>Second, the movie shows he has a injured shoulder so would be weaker around the girls. <br><br>As another poster said, I really want a revenge sequel. I am just not satisfied with this ending. The movie would have been a lot better if after he is left to be found. He gets all John Wick on the intruders and gives the little cows what they deserve.<br><br>What really bugged me about the movie though, is #spoiler alert# if they weren't planning on killing Keanu Reeves, why did they purposefully kill the friend. Although it's meant to come across as \"not their fault, he fell\", they knew he had asthma, took his pump, made him need it, and jump for it. He probably fell because he couldn't breath. That really bugged me.<br><br>Also if Keanu Reeves was a bad \"dad\" and person as they suggest, why did they ruin all his WIFES art, I get why they would destroy his music but why all his WIFES and innocent children's things and write curse words over his children's pictures.<br><br>I hated this film, because it made me cringe. I really wanted the girls to be dealt with and I really hate that they just walked away. It made me give this movie a 4/10 because its so frustrating and unsatisfying. Maybe if Keanu Reeves character was actually a bad person, then yea this movie would work, BUT NO, he was a good person on the most part (sure he cheated, but he didn't go out of his way to cheat. You are sympathetic towards Keanu. He didn't deserve everything that happened). The girls were annoying, loud, crazy, psychopaths.. argh I hate them. <br><br>Moral of the story Movie script writers- don't make a movie with the good guy is kicked and stomped on and the bad guys just get away. No one wants to watch that film.","user":"mary-179-677383","rank":[166,202]},{"title":"Oh my freaking God this is so terrible","rating":1,"date":"20 December 2015","review":"I'm a rare poster here at IMDb. Good movies? They get enough praise without me joining in the chorus. Average films? There's usually enough people on each side to adequately debate the pros and cons. But a film this ridiculously bad has, if nothing else, crossed whichever threshold is required to motivate me to reset my long forgotten IMDb login details and hopefully save some poor souls the 90 odd minutes of their lives, and (god forbid) their hard earned on a ticket.<br><br>It's so hard to know where to begin, so, as a wiser person than me once suggested, I will begin at the beginning. The acting, from the get go, is so wooden, unbelievable and shallow that not only did I not feel any connection to the characters, they were actually making me angry! Keanu is has always been pretty one dimensional, but he takes it to a new level with his performance here. In this role as a supposedly doting father, it felt like he has never spent more than five minutes around any kid. The wife was equally unconvincing and the kids were so bad they wouldn't get a role on a home-brand cola commercial. I did however quite like the Boston Terrier playing the role of the family pet, 'Monkey', and I feel like he did his best to carry this stinker, but with limited screen time there was only so much he could do. <br><br>Enter the 2 mysterious young women...who continue what has become the well established, by now 20 minute old tradition of corny, unconvincing Knock Knock performances.<br><br>The direction is lousy. I'm no film buff, but I watch enough of them. When I saw Eli Roth was the director in the opening credits, I said to my wife 'I think he has done some cool stuff'. Half way through this stinker I looked him up, and realised that, no...no he hasn't done anything even remotely decent in his entire career. A bit of shock horror in Hostel, a tenuous claim to fame at best, and then nothing. And his lack of talent is glaringly obvious here. I think I had confused him with a hybrid of Tim Roth and possibly Elijah Wood? I dunno...but Eli Roth shall forever more be the huge red flag he rightly is. <br><br>The story...let's call it a \"story\" for the sake of this review anyway. There's so much that could be said, so I'll simply say that it sucked in ways that few things have ever sucked before. It pioneers new ways to suck that modern scientific research in sucking are yet to even discover. <br><br>And the final cherry on this s#!t cake, was, after breaking my spirit and will to live, to break my heart to. Using the Pixies classic Where is My Mind as the closing track. Which the Pixies must have authorise...which defies comprehension. They made great money off their last tours, and allowed it to be used to close that all time classic Fight Club. <br><br>And so ends my review of this diabolically bad film. If I save one person the price of a ticket, or an hour an a half of their precious existence, it'll have all been worth it.","user":"parkway-31497","rank":[320,443]},{"title":"Further Proof That Eli Roth is Terrible","rating":1,"date":"18 December 2015","review":"Holy sh*t do I hate Eli Roth movies. Ever since Hostel and Cabin Fever I've found his films to border on the unwatchable, and yet I watched this one (and fully plan to watch Green Inferno), knowing that I wasn't likely to enjoy them. Maybe I'm a glutton for punishment, or maybe I just like spreading the Eli Roth is not very good gospel to anyone who will listen. So, what about this one?<br><br>It's not good, at all.<br><br>We start the movie having Keanu Reeve's being a \"family man\" shoved into our faces for an unbearably long time as we take a tour of his house, which is plastered with photos of the family, evidence of children and family is practically wallpaper in this house, and then we see Keanu and his wife have an attempt to have sex interrupted by this extremely loving children who have prepared a cake for father's day, and they all spend a solid 15 minutes of the movie talking about FATHER'S DAY, and LOVING DADDY, AND HOORAY FOR DAD ETC ETC, until you feel like you just might throw up. They also introduce us to the family dog (who somehow makes it to the end) and to a VERY IMPORTANT WORK OF ART THAT IS VERY IMPORTANT (which is smashed with hammers, obviously). So, with that extremely subtle set up, Keanu is left home alone when his family goes on a trip without him (for some reason), and the movie actually starts.<br><br>This has to be one of Roth's more gutless films, we've grown accustomed to his brutal gore and violence, but this one is surprisingly void of that. Instead, we have one death that is minor and Keanu even makes it all the way to the end, and the girls get no comeuppance either. After having a weird Keanu Reeves threesome, the girls reveal that they are 15 years old and Keanu is now a pedophile, which seems like it might be the bold line that this movie takes, sort of a Hard Candy type story, but even that turns out to be untrue when (spoiler alert) the girls admit to being in their 20s.<br><br>The acting is awful, the story is garbage, and it's really hard to get yourself invested in the movie at any point. Even when you think the girls are as young as they claim to be, you find yourself wondering how the hell they were able to subdue a full grown Keanu Reeves more than three f**king times in the movie. In the end, because who cares, they post a video of one of the girls having sex with Keanu (while he is tied to a bed and protesting), as proof that Keanu is a horrible monster, on Facebook (becauseFacebook), and of course people start responding in horror and disgust. The girls leave him buried up to his neck in the back yard and run along scott free, while Keanu frees a hand (somehow) and accidentally likes the sex video instead of deleting it. Is is that a joke Eli Roth? Because it's not funny.<br><br>Hands down, this is one of the most offensively bad movies that I've seen in a long time, and you're much better off to skip it. Check out John Wick instead, that movie is f**king awesome. Look forward to seeing your next one Roth, I'm sure it'll be a masterpiece.<br><br>www.barleydoeshorror.com","user":"TheBarleyGuy","rank":[134,181]}]