[{"title":"It Could Have Been A Lot More Fun","rating":5,"date":"24 September 2015","review":"So I am fresh off of watching this and I have to say that I am a bit disappointed. The trailer and the current reviews made it out like this was going to be a blast to watch, and some parts of it were, but for the most part I felt pretty let down.<br><br>So this is an anthology film, but instead of running each story back to back the film instead runs them simultaneously throughout. So basically you jump around from each story, the main problem here is that I found two out of four of the stories to be pretty cliché and boring. It was a bummer to be right in the middle of one story that is picking up only to be thrown back to a story that is just plain boring. The pacing was a big problem too, nothing at all really happens until about an hour in, once things do get rolling it is decent but not enough to make up for the first dull hour.<br><br>I do have some good things to say, the Santa and Krampus scenes were absolutely awesome, it mostly made me wish that I was watching a movie that was strictly about them. The acting was well done throughout, and the special effects/gore was all top notch considering they didn't have a huge budget. Plus William Shatner is thrown into the mix, hard to hate that. <br><br>I feel like this could have been so much better because the parts that worked did work really well, but the stories just didn't blend well together and since you have to watch them all at once that really effected the entertainment of the overall film. It's rare that I truly hate some parts of a film but then absolutely love other parts, unfortunately with this one the good was not good enough to out weigh the bad. The fun parts were still really fun though, it just seems like the whole thing could have been a lot more fun.<br><br>5.5/10","user":"HorrorOverEverything","rank":[47,62]},{"title":"A pleasant surprise","rating":9,"date":"5 December 2015","review":"Let me start by saying I like generally horror films - not so much the torture films (\"Hostel\", \"Saw\" etc) - but things like \"The Thing\", \"Halloween (Original)\" The Exorcist, \"It Follows\", &amp; \"The Ring\". So I was always gonna watch this because I also like William Shatner &amp; Christmas. I was expecting this film was going to rate 5 or 6 but because it exceeded my expectations so much I am giving it a hefty 9.<br><br>It's better shot, acted and written than the average shocker.<br><br>The film nicely interweaves 4 stories and a semi-story of William Shatner as a DJ. All are nicely told and varied in tone. The film is really slick and well directed, shot, and edited together - especially since there were 3 directors. The dialogue is not always the greatest but heck its a horror film so its way above average for the genre. There are also plenty of nice scares.<br><br>If your idea of a horror is lots of explicit gore this film is not for you - although there is enough to keep the less gore obsessed fan on the edge of their seat. The focus is spread across 4 very different sets of characters most of whom you wouldn't usually see in a horror film. The exception are the young teenagers who decide to break into their school, in order to investigate two murders that occurred in the school's basement the year prior. This story is exactly what you might expect - and no worse for it - but the other stories are all great. I can't say any more as I think this film is best watched without expectations and definitely without spoilers.<br><br>A nice Christmas treat!","user":"sprouty","rank":[28,40]},{"title":"A surprisingly great film!","rating":8,"date":"21 October 2015","review":"To be honest, I didn't expect much from this title and only thought I'd give it a watch because there was nothing else on. I have to admit to being pleasantly surprised and found it a very well made movie with some great casting and cinematography. There are so many cheesy, novelty, horror films released which center around a particular season or holiday and they seem to be mainly low budget affairs which aren't worth watching. This is a well made collection of stories which all interconnect and come together dramatically at the finale. William Shatner is a great boon and brings his character to life in a realistic and yet amusing way, with the dry humour we know and love. There's plenty of blood and gore for the die hard horror fans as well as an interesting collection of narratives, filled with black humour and intrigue. What a surprisingly great film!","user":"emberstonepierce","rank":[27,43]}]