[{"title":"Don't be fooled by the good star rating","rating":2,"date":"25 August 2019","review":"Tricked by the boosted rating I gave it a try and I totally regret it. The acting is average at best. The storyline is all over the place and totally contrived, often adding in random bits of backstory to try to make sense of the mess that is the plot. The film try's to be self aware countless times in an attempt at comedy but it's so unsubtle that it falls flat and fells awkward. I could go on.<br><br>The cinematography is the only thing it has going for it, hence the 2 star and not 1 but the constant jumping back and forth from handheld shaky cam and traditional methods is jarring.<br><br>So do your self a favor, find another film.","user":"theoaxford","rank":[26,26]},{"title":"Started off well then went down the toilet fast","rating":3,"date":"5 July 2019","review":"I was tempted to watch this by the good reviews, however each of the good reviews have only done one review and are obviously members of the cast and crew of this film.<br><br>It started of well and the photography and style are quite professional but there is just very little story on which to build anything with such a low budget but they did reasonably well with what they had but it just dragged on and on as though they were writing it as it went but my attention soon started to waiver as it lurched from one scene to another improbably , unrealistic scene.<br><br>All the actors did a good job but Rosine Young stole the show with her superb performance but alas she could not save this miasma of terrible story and woeful continuity - I think the shaky cam found footage is truly dead - Let it rest in peace guys!","user":"omendata","rank":[30,31]},{"title":"Sorry...","rating":3,"date":"27 July 2019","review":"Sorry...Love horror,love found footage,but\nthis movie is just a pile of you know what...terrible...boring...stupid...\nHow could it get such a high rating???That's why I watched it...Big mistake...","user":"tchitouniaram","rank":[19,20]}]