[{"title":"So Ha-Ha bad ... for a bit","rating":27,"date":"27 June 2014","review":"Now, I like stupid movies with bad acting, because it avails me of the opportunity to crack a lot of jokes and keep myself amused. However, this movie is so bad on every level at all times that I became laugh-exhausted about 30 minutes in.<br><br>I don't understand where they got these \"actors\" from. They should have been forced out of the industry at gunpoint immediately upon their arrival in Los Angeles.<br><br>I don't understand aliens who cannot be killed by high-velocity projectiles, but can be killed by bonking them with bits of fire safety equipment.<br><br>I don't understand how our hero is pointlessly dragged before the alien queen for a Big Reveal, but then he never reveals any of this vital information to anyone else except in the vaguest terms. And that's cool with everyone else who, you know, has their planet's existence on the line. No follow-up questions from the team. At all.<br><br>I don't understand how you plan to successfully invade another PLANET with a team of 5 people. One of whom is only armed with a fire axe. By choice.<br><br>I don't understand ... aw heck, I don't understand any aspect of this movie, and I'm not going to wear my fingers down to nubs typing about it. This movie isn't \"Ha-Ha\" bad - it's \"Give me back my 120 minutes of life or I'll hose your offices down with lead\" bad. Oops, gotta go - I think I hear police sirens ...","user":"wabooradley","rank":[64,69]},{"title":"I'd rather have hot pokers plunged into my eyeballs.","rating":1,"date":"8 July 2014","review":"From the acting, the dialogue, the plot and the laughable the SpecialFX (that look as though they were done at a cost of $189.00) this is quite possibly the worst film I have ever seen. There is nothing that redeems this movie on any level.<br><br>Was it made as a tax dodge? By people who think the public is even dumber than a box of rocks? By a middle school student with learning difficulties? By drunken porn producers looking to go mainstream? I don't know, but what I do know is that this is worse than anything I've seen in over 50 years of movie viewing.<br><br>Within the first 10 minutes you'll feel as though you've seen this movie before, or at least the movie plot it was based on. And that movie was a big-budget Hollywood dud!<br><br>Go watch some youtube videos of goats instead of this cinematic tour de garbage. Trust me, you'll thank me and be much better off.","user":"manbytsdog","rank":[28,29]},{"title":"Another winner for the Asylum","rating":1,"date":"14 June 2014","review":"Oh dear, I was tricked AGAIN by the Asylum, their gambit of naming a movie with a title close to the name of a blockbuster worked and I downloaded this to watch<br><br>{thank god I didn't go to a theater to see this}<br><br>It bad on so many levels there is just nowhere to start:<br><br>This is simply bad on EVERY level: story, direction, script and acting<br><br>Sometimes the Asylum make movies SO bad they are actually good!<br><br>I can highly recommend 100 Million years BC by Asylum, it has the very worst of everything and I can guarantee you will watch it with your mouth open<br><br>It is a little gem of awfulness and very unintentionally funny<br><br>That was the last time I fell for their tricks, I feel deeply ashamed at being caught out again, but not as ashamed as they should feel producing absolute rubbish like this<br><br>It is {like every Asylum epic} quite literally a waste of the celluloid it was printed on and a very poor use of a plastic box and disc<br><br>Find something else to do with your hour and a bit, read a book, sit naked in a bath of baked beans, hit your friends over the head with baguettes but don't wast another second of your life on this piffle","user":"ronniewylie1","rank":[71,78]}]