[{"title":"Decent, and quite entertaining","rating":7,"date":"8 July 2015","review":"There are only very extreme reviews out for this movie, and I want to add another more moderate one. I think it is obvious to anybody who has seen even just the trailer that this movie is neither 10/10 nor 1/10 stars. I give it a good 7/10, because it delivers on its main goal: to entertain.<br><br>The movie itself is a weird mixture of gore, references and jokes, and that is a very peculiar combination and certainly not for everybody. But if you know what you are getting into and you get on board with it, it can be a very entertaining and enjoyable ride. Most of the characters aren't very fleshed out and the story is obviously ridiculous, but this is to be expected from such a movie. The execution is pretty impressive, not just for the given budget. The (over)acting is very passable and at times even good, which helps set the tone for the film (obviously bordering on silly).<br><br>This is not Oscar material, and it is not a huge studio production, but I found it to be quite entertaining and funny and worth a (re)watch. Keeping in mind that this is a micro-budget film, I might even have gone a little higher, but in the big picture, this boils down to a 7/10 for me.","user":"Floh-Ruehle","rank":[31,34]},{"title":"Real fun trash if you're in to it","rating":7,"date":"18 July 2015","review":"So this is my first review here on IMDb, but I read on that was mostly negative and I just had to defend this trash jewel. This is a very fun movie it has great special effects, like old horror movies that don't rely on CGI at all. A Micheal Bay fan will not enjoy this gore fest. If you love movies that are made to be bad like Kung Fury or Black dynamite then you are going to love this one. Give it a try seriously. Summary: I'll try to keep this short and spoiler free. A stereotypical over the top fraternity is suspended from campus due to a prank gone wrong. They are send to an old haunted house in the woods. After that it all follows a known recipe horror fans know and enjoy. The director did a good job making the movie look like a 70's horror film. The writing team also did a great job as there were lots of funny jokes. The comedy part is also the best part of the movie, don't expect to be scared if you have seen a lot of horror movies before. 7/10","user":"lootjunior","rank":[16,19]},{"title":"A hilarious and unique satire of the slasher genre","rating":9,"date":"7 July 2015","review":"Full disclosure: I've been a fan of 5SF for years and even bought tickets to the world premiere at the LA Film fest so I'm probably a fanboy.<br><br>There are a plethora of horror comedies out there, and many self aware entries into the genre will poke fun at their own tropes, but never before like this. The best summary of DBPM3 I could give would be Friday the 13th mixed with Airplane mixed with the volleyball scene from Top Gun. The film has one of the highest jokes per minute rate of any I've ever seen: any duds or misses are swiftly forgotten when another joke is laid out less than 10 seconds later. It grabs a hold of your funny bone and mercilessly throttles it, I felt physically exhausted by the end.<br><br>Even though it is a satire of 80's slashers, most of the jokes are timeless, and don't require extensive knowledge of the genre/time period to understand (and good thing too, I imagine the target audience was still in diapers during the 80's). It attempts to recreate the poor quality film making of low budget slashers, and largely succeeds, to the point where I couldn't tell which mistakes were intentional (i imagine most of them) <br><br>The only stumbling block for me was the side plot involving Officer Sminkle. Although funny at times, it seemed to drag on, and was only tangentially related to the plot. For me it never seemed to join cohesively with the action at the frat.<br><br>My advice? Get a group of friends and a case of beer before viewing this movie. It is strong on its own merits, but seems to have been created with group viewing in mind.","user":"robzored","rank":[19,27]}]