[{"title":"I saw the ending, but I didn't hear it...The music was too loud","rating":3,"date":"5 June 2016","review":"What was the point in drowning the dialogue in the end with superloud music so you couldn't even hear the big reveal?<br><br>Or was that even intentional?<br><br>My guess is that the revealing words simply was too trivial and the editors thought that the viewers wouldn't like it so let's just blast the violins.<br><br>Other than that it had it's moments I guess, the old man was a decent enough actor... Awfully slow movie though but 'horror' movies with 'nothing happening' until the last 15 minutes are very popular these days.<br><br>Yeah I don't know what more to say as I'm not sure what happened in the last 5 minutes because of the worst sound-mixing of all time.<br><br>It wasn't great before it but acceptable (you could actually hear what the characters were saying after all) but my goodness felt like I was ripped off in the ending.","user":"Seth_Rogue_One","rank":[13,14]},{"title":"If you can't figure this one out in twenty minutes, you might be the one with dementia","rating":3,"date":"6 December 2015","review":"I had high hopes for this one, based on the casting alone. Gene Jones was pretty terrific in Ti West's so-so \"The Sacrament,\" and Kristina Klebe knocked a small but vital role out of the park in Zack Parker's stark and disturbing \"Proxy\".<br><br>Jones plays a Vietnam Vet who's had a stroke and Klebe is the home health care nurse assigned to his case. But it's painfully obvious that this nurse has a special fascination with, well, pain, as in seeing it inflicted.<br><br>The concept of a helpless person being tormented by a sinister \"care giver\" is not exactly a new one. By itself, it's squirm-inducing and one of the best examples I remember seeing is the Spanish 1986 thriller In a Glass Cage about a paralyzed Nazi pedophile tortured by one of his former victims. These films aren't pleasant to sit through, in general, so they require a pretty damn good story and good performances to chew on.<br><br>It's a shame that DP Mike Testin's first directorial outing has such a clunker of a script (written by Meredith Berg - whose only others credits are a short and \"Lana Steele: Makeup Spy\"). It takes no brains at all to figure out who Nurse Michelle (Klebe) is, why she's at George's house and even how she found him --- all in about 20 minutes. There is virtually no suspense or any tension for the rest of the film.<br><br>While Jones gives the role his all, and is very convincing playing a basically unlikable character (in all fairness, I did admire how the script never backed down and soft-pedaled his PTSD raging), Klebe's performance is so unhinged and over-the-top (she twists the head off a Barbie in a check-out line, if you can believe that --- why not just hang a sign around her neck with a prescription for Thorazine attached?) that it borders on comic. I really don't think she had much to play. If so, it wasn't apparent from what got to the screen.<br><br>What is obviously in Berg's resume is the Nancy Drew style sleuthing that George's granddaughter Shelby (Hassie Harrison) gets up to, but this isn't handled with any suspense or flair either. It's very TV- like in pace and dialog. Harrison does well, but she isn't given much depth to portray either.<br><br>The lack of suspense is really what kills this one. Mark it Do Not Resuscitate and move on.<br><br>Note: For a far more realistic horror film on the realities of living with Dementia, see \"The Sideways Light\". No plot gimmicks or SFX apply here. The truth is horrific enough.","user":"bob_meg","rank":[34,53]},{"title":"Don't even bother. You won't even find out the characters' motives.","rating":2,"date":"22 May 2016","review":"I didn't exactly have high hopes for this movie, but I figured I'd give it a shot anyway considering that the premise seemed interesting. Mental illness, and especially dementia, is something that I have always found to be fascinating, humbling, yet terrifying. I figured that the plot would be the standard sequence for these kinds of movies (introduce seemingly normal antagonist, antagonist slowly starts becoming creepy, no one believes protagonist that antagonist is nuckin' futs, antagonist becomes full fledged psycho, climax, resolution) and I was right to a certain extent. Or at least I think so. <br><br>Throughout the movie, we get clued in that George was a very violent father/person and that he isn't exactly the kind of main character you'd want to side with. The nurse, Michelle, is obviously deranged and her behavior gets progressively more and more unnerving (albeit pretty unrealistic e.g. ripping the head off a Barbie doll at the check out of what looks like a hardware store. Why are Barbies being sold at Ace Hardware? And if she can keep up the facade of being a real nurse in front of her target's family, why can't she keep her cool at the shop's check out line?). However, we're told that she is avenging her mother, whom George killed when she was six years old. At least that's what I think happened. So who to root for? Well you'll never really find out.<br><br>At the peak of the climax, you can't hear anything aside from the ambiance music. Seriously. You can catch a few of the characters' hushed voices, but they may as well be reciting a recipe for apple pie and we'd be none the wiser. It's a real shame too, because this is the point in the movie when we're told what the characters' motives are. Michelle reveals what George did to her mother and why she's been tracking him down, and George tells us what he did to Michelle's mother and why. But I guess we'll never know. I'd really like to ask the producers and the sound editor what the hell they were in a rush for when they worked on the last scene of this movie and why they didn't bother checking the levels before deciding that was going to be the final cut. It's really frustrating, too, because Shelley, who had been growing fond of her grandfather throughout the movie, all of a sudden doesn't want anything to do with him. She even takes his pills from him as he crawls towards them, and when her father appears out of nowhere and tells her to call an ambulance, she lies and tells him that she already has and leaves her grandfather to die. How she finds out what he did, I'm not really sure. One minute she was is bound and gagged with duct tape in what looks like the laundry room, the next she is standing over her grandfather, somehow having been there long enough to have heard his and the nurse's exchange. And the movie ends there. We don't find out if either George or Michelle survived, or if there's ever any justice served, or even a hint at what was drowned out by poor sound editing. Nada. Complete waste of film.<br><br>Don't bother with this movie. Honestly. It's a real shame too because Gene Jones does a great job playing an interesting character (veteran war hero with some serious skeletons in his closet who wants to change and be part of his son's and granddaughter's lives). The rest of the acting is pretty meh IMO. The father/daughter relationship between Peter Cilella and Hassie Harrison seems more like they're ex lovers or couple going through a rough patch. Definitely didn't feel like a father and his child when they were interacting. And Kristina Kleb's acting was alright, but just wasn't convincing enough for me. At least not for the way the film was written (which by the way also leaves way too many loose ends on top of the mystery ending caused by poor sound editing).<br><br>Overall, skip this one. You aren't missing anything but frustration.","user":"alemetayer","rank":[6,7]}]