[{"title":"Some Kind of Hate..For Other Reviewers","rating":7,"date":"11 January 2016","review":"It sickens me to see how poorly people rate horror movies these days. I once belonged to a group of horror movie fans, but now I am alone.<br><br>Don't get me wrong. I hate B-movies. I hate the majority of Redbox horror movies that most people have not heard of. But this movie is truly something good and special, and to see it thrown in the gutter by people who I would have trusted as my horror loving peers, has disappointed me.<br><br>I remember seeing \"It follows\" a couple years back and I thought it rocked. It was a throw back to 80s horror that I really appreciated it. So I did some google searches looking for the next \"It Follows\". That is when I came across my first internet review of Some Kind of Hate.<br><br>When I watched it, I was not disappointed. I guess you could call this film a cult horror classic, since it is apparent from other reviews, that a very unique clique of people will appreciate this film for what it offers.<br><br>From storyline, to acting, to environment, to just the feel and soundtrack and nature of the film, I really enjoyed it. If I was looking at these IMDb reviews, I would never have given it a chance. <br><br>The plot and dialogue is simple, but interesting. One of the main characters is victim is extreme bullying. Karma takes spiritual form and comes back with a vengeance. It's not filled with the gore and special effects throughout the movie you might see in most horror movies that make it to the big screen, but its got story and heart. For the record, I would give it 1 star less than It Follows. But this still is a good movie, worthy of re-watching over the years.","user":"roguecritic42","rank":[21,28]},{"title":"WE MADE A BAD MISTAKE","rating":7,"date":"3 June 2019","review":"Lincoln (Ronen Rubinstein) is a bullied teen who likes death metal music (who doesn't?). When he is pushed too far, he lashes back and ends up at a desert camp, \"Mind's Eye Academy\" for troubled teens. Here he meets the pretty and manipulative Kaitlin (Grace Phipps) who forced me to look at her Daisy Dukes in slow motion. He also meets some more bullies, then discovers Moira (Sierra McCormick) a deadly vengeful spirit who we have to quickly decide if she is real or Lincoln's alter ego because the mystery doesn't last long.<br><br>The film had early potential. The development of character needed a few more scenes, perhaps some background glimpses on the other kids or Moira herself.<br><br>Guide: F-bomb. Implied sex. No nudity.","user":"nogodnomasters","rank":[3,3]},{"title":"Not perfect by a long-shot but I've seen a lot worse horrors","rating":6,"date":"20 January 2016","review":"The first 30 minutes are really solid, which is more like a psychological drama-thriller than anything else.<br><br>But on the 30 minute mark that changes and it throws a supernatural twist on you which feels really random and took me out of the movie for a bit, but once I accepted that this is what the movie is like now I slowly but safely started getting into it again.<br><br>And even though the movie most certainly is not without it's flaws I must say that this wasn't too bad of a watch, even though it's nothing spectacular but yeah I've seen hundreds of horrors that are a lot worse than this for sure... Seen hundreds that are better as well but that's beyond the point lol.<br><br>And the acting is pretty good, and the gore is excellent, one complaint would be that occasionally the cast speak really low and it's hard to hear over the dark melodies being played in the background but overall not too shabby, better than I expected considering the rating of (currently) 4.6/10 for sure.<br><br>5.5/10 from me, or rounded up to a 6.","user":"Seth_Rogue_One","rank":[8,11]}]