[{"title":"Coming of age, told a little different","rating":7,"date":"23 August 2016","review":"I do not understand why this movie is getting such a low rating when it easily deserves more.<br><br>Usually when I watch a \"coming of age\" movie I immediately see what the outcome will be, they mostly go along the same line but with Morris from America I didn't get that. What I got was much better. Albeit some missing plot holes but nothing that hurt the over all story.<br><br>The movie gives you that coming of age story without the tacky, over played scenarios. Where those movies fail, this movie excels. I never got that feeling. The feeling of a fairy tale life for lack of a better term. It's funny, nostalgic, romantic, emotional, entertaining but over all, it feels REAL.<br><br>I have never seen Craig Robertson (Curtis) play this type of role and I am happy I did because he did very well, especially with a cast full of rookies. I hope to see more of this from him in the future. Markees Christmas was surprisingly good but I could not end this without saying something about Lina Keller and Carla Juri.. They both played their roles flawlessly and Keller's role was not an easy one.<br><br>Definitely give this a watch, it is obviously not of the same caliber as The Breakfast Club but it does entertain. I am sure you will not be disappointed.","user":"Enjoyment","rank":[11,15]},{"title":"Beautiful coming of age movie - Morris from America!","rating":8,"date":"31 August 2016","review":"Just watched Morris from America even though it got a 5.6 on IMDb. I usually try and not watch movies below 6 as i end up getting disappointed, but Morris from America was different. It was surprisingly short and beautiful!<br><br>As the title says its about the romantic and coming-of-age misadventures of a 13-year-old African-American boy who moves to Germany with his dad and tries to fit in with the other German kids. He falls for a girl at a youth club and through her own growing up pangs encourages him to open up a little and share his rapping.<br><br>We've all had that one childhood crush that we fondly remember - puppy love! The director has beautifully narrated a story that captures the essence of growing up and not fitting in, our first crush and pains with our parents and their side of the story and made a pint size gem! So don't go by the rating and watch it when you have the time and want to remember that feeling of puppy love and not really fitting in!","user":"karanvalecha","rank":[8,12]},{"title":"Not about race, about growing up","rating":8,"date":"19 August 2016","review":"This is not a film about race or racism. Could easily have been done with two white leads instead of black leads. It's a film about a 13 year old boy discovering sexuality and entering an adult world by way of a love interest, as well as how his father deals with this without his wife. Great acting by them both and the lead female. Subtle but not overly complex screen play. Interesting and not trying to be over emotional. Not a superb film but worth watching. I really liked the way they portrayed the father's efforts to do well by his son and manage his adherent behaviour without alienating him. Son was also not reckless but simply unaware of the world he was growing into.","user":"wotiva","rank":[19,36]}]