[{"title":"Zombie movie ???","rating":1,"date":"22 October 2019","review":"I don't know if you can categorize it as a zombie movie.\nThe script is predictable, you already know that someone is going to die and is going to become a \"zombie\" and also those who are going to survive the journey. (For all gamers the movie's dots are some small similarities with The Last of Us even the sound of clickers)<br><br>To have several martial artists the fights are very clumsy. The camera work poorly focused on some points, * this is very personal but to me at some times the audio was poorly synchronized I don't know if someone has the same problem or it was just me. The poorly crafted VFX I know is a B movie but there are also videos on youtube with better quality effects than these.<br><br>So why the hell did I watch the movie? once again I saw her for Joosten and once again I don't believe her in her performance, of the times she is supposed to convey some emotion she always makes the same face does not convey emotion towards the viewer.<br><br>I managed to cure the entire movie. So some of us suffered and took one for the team, so you don't have to. Stay well clear of this movie, unless you are a diehard fan of Stefanie Joosten for some reason.","user":"elrichedward","rank":[24,26]},{"title":"Not one but two typos right in the description","rating":24,"date":"24 October 2019","review":"It speaks volumes about movie production when they can't even write up a description without two typos. Quality control anyone? That right there is enough to tell you not to bother watching this.","user":"rgcc-486-495874","rank":[11,13]},{"title":"Couldn't even watch it after a joint - less than mediocre at best!","rating":3,"date":"22 October 2019","review":"I am actually a fan of B movies and low budget films, but I am NOT a fan of this one unfortunately. The script was actually good all things considered, there is definitely a talent in the writing, keep working at it because I think the real crafted piece is yet to come.<br><br>But there is nothing fresh or new with this zombie film, and the acting was not great by any means, if at least annoying.<br><br>The CGI, for the budget was actually not terrible, although the guns up close looked like toys.","user":"info-33728-30040","rank":[15,23]}]