[{"title":"Absolutely awful","rating":1,"date":"6 May 2016","review":"If me and my girlfriend decided to make a movie, having no experience or talent in the field and for equipment we used my old cell phone from the late 90s, employed our relatives to act in it and elected not to use any lighting or sound engineer i reckon the result would look something like this pile of dross. The editing in this film is so laughable i had to check to see if i wasn't being spoofed somehow. How could anybody with any sense of pride in ones work watch the final product and then think \"ok that's a wrap, let's release it\" - i would be mortified to let this out into the World. Really, film fans, do yourselves a favour and go and wash the dog or mow the lawn or paint a fence because i guarantee you will wish you had done something more satisfying with the time wasted watching this. 1 out of 10.","user":"mark-2705","rank":[21,24]},{"title":"Don't do it. Just don't.","rating":1,"date":"17 May 2016","review":"Every now and then I really feel like kicking myself for some of the awful crap I will sit through from beginning to end and this is certainly one of those times. I never watched the first movie, as I'd been warned away from it vehemently by another movie buff. I thought, however, as a second film had been made, perhaps the budget would be larger and the cast and crew may have learned a few things further down the line production-wise. Boy, was I wrong. At least, I can't think the first one could be any worse than this film. I literally paused it firstly to take out the bins and then to wash the dishes to break up the monotony of it all.<br><br>What a wreck. There is nothing redeemable about this movie and I watched this one right after Sharkansas Women's Prison Massacre. That was also terrible, but a masterpiece by comparison. After fifteen minutes of The Hospital 2, I thought maybe a beer would make it better. Then it was a couple of gin and tonics. Surely that would help, right? Nope. No amount of self-medication could put a band-aid on this injury. There is no cure for this ailment, only a vaccine. The vaccine is avoiding this movie at all costs and to pray to any merciful deity that will listen to strike down anybody, anywhere, who so much as mentions making The Hospital 3.","user":"gand7","rank":[10,13]}]