[{"title":"The wilderness shows us who we really are","rating":8,"date":"28 March 2018","review":"I have been familiar with and fascinated by Yossi Ghinsberg's dramatic survival story for many years and have even occasionally given classes about it at school. When I heard that there was a movie about this intriguing journey, it wasn't even a question whether I would purchase the film or not. The blandly titled Jungle fulfils my expectations on many levels. <br><br>If you haven't heard about Ghinsberg's true story yet, here is a very brief summary. The young Israelian adventurer traveled to South America after his mandatory military service and met an American photographer, Austrian geologist and Swiss teacher. The geologist convinced the three aquaintances to travel into the heart of the Bolivian jungle to discover unknown tribes and gold. Once they were deep inside the jungle, it became obvious that there was neither gold nor tribes to be discovered and that the geologist was actually a wanted criminal with shady objectives. When the Swiss teacher got injured, the group split up into two teams. The geologist and the teacher walked upstream towards the next village which was supposedly about three days away. The Israelian adventurer and the American photographer moved downstream with a raft but got separated in a canyon. Yossi Ghinsberg fought for survival as he tried to find his partner, travel downstream and make it to the next town while the American photographer got rescued by a tribe and tried to convince skeptic local authorities that Ghinsberg was still alive.<br><br>The movie is quite faithful to the true story even though a few anecdotes had to be cut and details had to be shortened. This was a good choice because the movie is quite fluid and neither too short nor too long. It takes about twenty minutes to introduce the four main characters and about another twenty minutes for them to start their journey. The last eighty minutes are dedicated to an intense and solitary survival story.<br><br>The locations are gorgeous yet terrifying as they show the thin line between beauty and horror. What looks like a peaceful river can turn into a deadly canyon within seconds. The seemingly solid ground becomes a treacherous bog. The scary animal becomes a tasty meal that helps you survive. Jungle is an intense experience for all your senses.<br><br>One element that needs to be pointed out is the superb acting. Daniel Radcliffe was obviously very dedicated to his role. He was guided by Yossi Ghinsberg himself and obviously very familiar with the source material as well. You can see a young and naive adventurer from a severe and traditional family who wants to break free but soon realizes that freedom can come with a price as he has to face impossible challenges that will exhaust him mentally and physically. Daniel Radcliffe's progressive transformation is absolutely stunning. When a human being finds itself in the middle of nature, there aren't many human features that remain. Survival knows no rules.<br><br>When the movie came to its conclusion, I was shivering all over my body. This is how bleak, dramatic and intense this film was. You could put me on an isolated arctic island for a year but not in such a jungle for even just a week.<br><br>If you like adventurous survival stories, you can't get around this movie. Jungle is an intense journey to the essence of humanity and nature. The wilderness shows us who we really are.","user":"kluseba","rank":[104,115]},{"title":"I genuinely do not understand all the low ratings!","rating":10,"date":"25 February 2018","review":"I just caught this film on Amazon Video and I'm kicking myself for not catching this at the movies. I don't think the movie was marketed well when it was released. I was blown away by all aspects of this film and found it hard to hold back my tears towards the end of the film.To an extent it reminded me of Danny Boyle's 127 Hours, but it's a beautifully made film in its own right. It's a survival story so be prepared to see some not so appetising scenes in parts but the pay off is worth it. Towards the end of the film we get to see the real people behind these characters and those photos will stay with you long after you've seen the film. I'd recommend you to seek this one out on the biggest screen you could find.","user":"agasi999","rank":[77,92]},{"title":"Daniel Radcliffe turns in a fantastic performance","rating":8,"date":"13 February 2018","review":"I knew nothing about this one, even the synopsis wasn't anything really eye-catching. I don't think I'd even heard anyone talk about this one yet. But, I noticed it was new on Amazon Prime, so I figured what the hell, might be worth checking out.<br><br>I'm happy to say I enjoyed the hell out of this. It's a very slow moving story, but very well shot, the acting is fantastic and it sucks you right in. Come to find out this is based on a true story, which makes it that much more interesting. Love it when you find something like this that you have zero expectations about and end up enjoying it. Daniel Radcliffe turns in a fantastic performance as Yossi. His performance really takes you through the emotions the character's going through. It was one of the biggest things that stood out to me in this film. <br><br>While the film does have some issues, it takes a bit to get going and I feel like some time could have been cut out of the last half of the film, it's damn solid overall. I'm glad I gave this one a chance. While this movie certainly won't be for everyone, if you're in the mood for a good story, give this one a chance and check it out.","user":"AverageJoesDriveInPodcast","rank":[29,34]}]