[{"title":"You're killing me, Charlotte","rating":2,"date":"23 April 2019","review":"The trailer looked intriguing.\nThe trailer lied.\nI don't write reviews, but this film really bothered me. The trailer looked amazing, and I figured I'd give it a go. For the $2 million dollar budget this film had, it should have been excellent. Yet, it was, at best, a grossly drawn out student film.\nThe first three minutes or so, the film shows off its best assets; the lighting, cinematography, and set design. Really, whoever was on set and costume; you're the one thing that made this movie worth watching (and yes, I did watch to the end). I did notice the sound seemed a bit off, but kept watching anyway.\nAfter the initial credit roll, when the movie actually started, I knew I was in for a bumpy ride. Music is overlaid in every scene. After fiddling with the sound for a solid five minutes, I finally turned the subtitles on. Without it (and sometimes even with it), I had no idea what the actors were saying.\nAnd who was who? When Tim was first introduced, I thought he was a slightly older actor playing Charolette's crush? Her brother? A hired hand? I had no idea. Halfway through the movie, it's revealed he's George's (the Dad's) friend. I never would have guessed. Apparently Gertrude is George's second wife? I found that out about five minutes before the ending (everyone calls George 'Father').\nNo intentions are clear. The script makes no sense and characters say lines that leave you thinking '...did I miss twenty minutes?' I'm still not sure why they owed Randall money in the first place. Nothing is really explained. Gertrude (the wife??) calls Charlotte's mom 'mother.' Honestly, I don't know who's who. And Tim...if the whole point of the child is for her to be the product of true love...why aren't any of the other sisters mermaids? Why is it only Charlotte? Then I was waiting for the twist that Tim was the father...that didn't happen either.\nTo recap: sound effects lagged, dialogue was beyond hard to hear, acting was okay but nothing to write home about, hire the set designer for your next renovation project.\nThis movie could...no, should have been really fantastic...but it fell unbelievably short.","user":"onyamariea","rank":[11,14]},{"title":"Terrible Audio","rating":1,"date":"26 February 2019","review":"Tried watching this film on Hulu: the audio editing was so bad I couldn't watch more than 17 minutes, with the music loud and the talking soft I gave us due to the need to adjust the remote constantly, which is a shame since the film looked interesting. It's not my television and I doubt it's a Hulu problem since all other programs and films are fine.","user":"steelebeam","rank":[12,18]},{"title":"Mermaids are the bomb nowadays.","rating":4,"date":"27 January 2019","review":"Her story begins where the fairy tale ends.<br><br>I suppose this movie was inspired by the well-known fairy tale \"The Little Mermaid\" by Christian-Andersen. Now, if you were an attentive reader, you'd noticed that this little sea-dweller was explicitly present throughout the whole story. If this film is a kind of homage to this fairytale, then it really falls short on that part. It's more like the movie \"Godzilla\". This legendary monster also appeared only a few minutes in the film. The same for the singing mermaid in \"Mermaid's song\" (First titled \"Charlotte's song\"). You can admire her for 5 minutes. That's rather scanty for a film that lasts 88 minutes. But in that short period, you can see that the transformation of Charlotte (Katelyn Mager) to the dreaded mermaid is shown in a successful way.<br><br>This film obviously isn't a fairytale suitable for little children. However, it's not such a frightening film as the film poster suggests. And categorizing it under the genre \"horror\" is also a bit exaggerated. You could call it a drama with some fantasy elements. The drama part deals with the demise of a flourishing cabaret theater somewhere in no man's land in the United States. The deterioration of this establishment is caused by the death of Serena (Natasha Quirke, mother of Charlotte and also blessed with the mermaids gene) and the economic depression. And before he realizes it, George (Brendan Taylor), father of Charlotte and a spineless wimp, is having a financial hangover and is heading for a forced closure.<br><br>Whether the bankruptcy of this bar is caused by the prevailing economic crisis only, I doubt anyway. The stage show isn't exactly a crowd puller either. Maybe it was exciting enough for that period. In those days naked flesh of a female foot was enough to drive an average man crazy. I was surprised to see (during a stage performance) that the phenomenon of twerking was already invented in the 1930s. The fact that a lot of people showed up in the past, was mainly because of the enchanting singing of Serena. She was a mermaid who has exchanged her tail for a pair of slender legs and completely renounced to live on as such a sea miracle, so she can spend the rest of her life with the man who has completely and absolutely won her heart.<br><br>But to be honest, the whole thing about mermaids is subordinate to the rest. \"Mermaid's song\" is rather a social drama about poverty and the local mafia trying to exploit misfortunes. That's when Iwan Rheon appears on the scene. He plays Randall. A kind of Mafia type who has a lucrative proposal for George so the bar could be saved. The fact that George needs his daughters to act as ordinary prostitutes and his business is more like a brothel from then on, is the other side of the coin. And in this horrifying situation, Charlotte needs to grow up. An innocent looking girl who discovers that she has a special gift.<br><br>It's strikingly clear that \"Mermaid's song\" is a low-budget film (and the lion's share of that budget went undoubtedly to Iwan Rheon). The sound is simply terribly bad. The balance between music, sounds, and speech was so bad that you couldn't understand what people were saying sometimes. It was completely drowned out by the sound effects and music. Sorry to say, but that's something typical for a low-budget film. Also, the acting wasn't always enjoyable. It was rather clumsy and inexperienced. In retrospect, Katelyn Mager wasn't so bad after all. But I was really pleased with the overall presentation of the film. The decor, the props, and clothing looked authentic. And the scarce moments with the mermaid showing up, weren't so bad either.<br><br>So, all in all, it is nothing more than an average film. No, it's not the kind of film that makes you very enthusiastic. And no, it isn't so bad that it should be ignored at all time. If you ever come across it on one or another television channel, you should give it a chance. \"Mermaid's song\" is definitely worth a look. The film itself dates from 2015, but only surfaced again last year via \"Video On Demand\" services. Weird. Does it seem as if they are trying to benefit from the success of \"The shape of water\"?","user":"peterp-450-298716","rank":[8,11]}]