[{"title":"A Bit Behind the Creative Process","rating":6,"date":"6 July 2014","review":"An unrated version of Bad Grandpa which includes over 40 minutes of additional outtakes and interviews.<br><br>If people are looking for another \"Bad Grandpa\" film, this is not it. Also, very few of the pranks shown here could be said to be on the level of or better than anything shown in the film. Instead, this is essentially a feature-length behind the scenes look.<br><br>Generally, \"making of\" segments are not all that interesting to anyone beyond big fans of a film or film geeks who like to see how the sausage is made. This is an exception in a good way. When you see the finished product, you likely have no idea how many hours of footage are needed to make a 90-minute film. With pranks that get cut or need several attempts, this sort of film (more than any other) requires excessive work that will never get recognized.<br><br>This film also showcases the makeup and we see why the film was nominated for an Oscar (and why it should have won). Perhaps most interesting is getting to see Spike Jonze on a personal level. This is the genius behind \"Being John Malkovich\", \"Adaptation\" and \"Her\"... yet he still pulls pranks and skateboards with the Knoxville crew rather than schmooze with A-listers. Such an interesting character.","user":"gavin6942","rank":[17,18]},{"title":"Geeky Randy's summary","rating":6,"date":"20 October 2014","review":"Behind-the-scenes feature of the 2013 comedy JACKASS PRESENTS: BAD GRANDPA that includes over 40 minutes of additional outtakes and interviews. Catherine Keener and Spike Jonze's portrayals as elderly women add a layer to the story and help shape Knoxville's character's background a little more—and despite these subplots being removed from the final cut for lack of contribution to the story, they are just as funny as the shenanigans left in. Not only will fans of the movie enjoy, but also those fond of JACKASS, as .5 unravels a lot like an episode— which couldn't be anything but intentional.<br><br>*** (out of four)","user":"Geeky Randy","rank":[5,5]},{"title":"One of the most fulfilling \".5\" offerings yet","rating":8,"date":"6 August 2014","review":"Jackass Presents: Bad Grandpa .5 is another entry in the \".5\" franchise of the long-running Jackass series. The \".5\" film usually follows their last theatrical release by about seven months and features outtakes and behind the scenes footage from their last film, as such with Jackass 2.5 and Jackass 3.5. Normally, these medium-length features would be only adequate fulfillment for most casual Jackass fans and be the most satisfying for the hardcore Jackass fan that needed to see everything the lovable gang did, from the Evel Knievel tribute with Mat Hoffman to the \".5\" installments.<br><br>However, because the Oscar-nominated Jackass Presents: Bad Grandpa was such a hilarious and original installment to the franchise, a \".5\" feature seemed more ideal than before, and thankfully, the eighty-minute film pleases almost as much as its \"1.0\" counterpart. While the film packs in an acceptable amount of stunts, more of a focus is placed on how these stunts, pranks, and hidden-camera gags are set up and conducted rather than before. While watching Bad Grandpa, I distinctly remember trying to piece together in mind just how some pranks were executed and how the setup for certain situational gags worked. Bad Grandpa .5 gives one the intricate and eye-opening look most hardened fans will appreciate.<br><br>The irony about the Jackass series is that, while the pranks and the stunts are so outlandish and needless, the amount of labor and attention given to setting up a stunt or a sight-gag so that it works is quite tasking. We see Johnny Knoxville endure several hours of makeup to become Irving Zisman, the lovable but politically incorrect soul who loves making the public feel ridiculous and uncomfortable, before engaging in numerous different pranks, such as disrupting a game of golf by moving the hole and flag in the middle of the game, putting deliverymen in awkward positions, as Irving exposes his long, distended scrotum, and even stealing another man's wallet in the company of another person.<br><br>Some of the funniest and most outlandish stuff of the film, however, is when actor/director Spike Jonze dresses up as the dirty-old lady Gloria, complete with sagging breasts and full-body female prosthetics, and engages in meeting people looking for a night on the town with her before revealing he is indeed a male and this is a set up. Director Jeff Tremaine reveals that all of this footage was cut from the Bad Grandpa film because, understandably, none of these men wanted to sign the release form that came with it. The footage is restored for this \".5\" installment, with censors and voice distortions to obscure identities.<br><br>The only sad thing to note about Bad Grandpa .5 is its absence of Jackson Nicoll, the adorable little tyke who played Irving's grandson Billy in the film and was often used as a pawn in Irving's schemes while simultaneously making his own name by being goofy, outrageous, and silly. Nicoll is an incredibly gifted talent, with the ability to act natural in the most unnatural situations. His sole moment to shine comes relatively early in the film, in a scene involving a mall Santa, which is outrageous and devilishly funny, as Knoxville's Irving accompanies him and eggs him on while he spends time on Santa's lap. Other than that, Nicoll is given seldom other scenes and is sadly not available for interviews to comment on working with such a dirty crew at such a tender age.<br><br>But by far the most intriguing content in the film is the use of behind the scenes footage, showing how much effort and time goes into creating and planning these stunts, and how, despite having years of experience, these guys can still find ways to screw up shooting and wind up disregarding ample amounts of footage all together. Some of the humor drummed up by the ignorant victims is drummed up by the talents of Knoxville, but a great deal is thanks to luck and the victims' ability to play along and try to outsmart the performers. No matter how hard they try, the other guy is still in on a joke. Not to mention, we also see the incredible makeup effects used by the crew, which wound up getting Bad Grandpa a well-deserved Oscar nomination for hair and makeup.<br><br>Bad Grandpa .5 doesn't need to find its audience, much like the franchise it belongs to, who, like myself, have been long devoted to the brand's senselessness since 2000 and eagerly await the next product. Bad Grandpa was an ideal entry in the franchise that would've definitely gone stale had characters like Irving Zisman not been created, and if we can still receive that kind of outlandish, hidden-camera-style humor from the Jackass crew in later years, they're here to stay, I'm afraid.<br><br>Starring: Johnny Knoxville, Jackson Nicoll, Spike Jonze, and Jeff Tremaine. Directed by: Jeff Tremaine.","user":"StevePulaski","rank":[11,15]}]