[{"title":"Not a War Movie","rating":9,"date":"12 September 2018","review":"I just want to provide a quick calibration of what people should expect from this movie because some of the reviewers seem to have had a misconception of what this movie was supposed to be about. This is not a war movie - it's a movie about war. Specifically, the affects of trench warfare on a group of soldiers. Too that end, the movie is absolutely brilliant from the moment it begins to the moment it ends. You will not see long drawn out battle scenes, hand to hand combat, fire-fights, bloody carnage or anything else you've recently seen in Hacksaw Ridge, Lone Survivor or Fury. What you will see is the persistent and inevitable deterioration of the innocence and humanity of the characters as their fate, which they all know is coming, slowly but surely creeps up on them from one day to the next. Many other reviewers have used the term, \"disturbing\", to describe this movie and I agree 100%. It is highly disturbing, on a psychological level. You won't leave this movie feeling good or motivated to join the military; you will leave it with a loss to understand why humanity ends up in situations like this to begin with.","user":"boonanak","rank":[70,74]},{"title":"Masterpiece - only way to describe it.","rating":10,"date":"5 February 2018","review":"I've seen the West End play, read the play transcript, and read the novel too. This (in my humble opinion) is a magnificent adaption of this very powerful play based upon R C Sherriff's real-life experiences in the trenches of World War One. It captures the tragedy of war, courage in the face of hopelessness, friendship, and regret among a host of human emotions. The acting is superb, the sets and attention to detail like nothing I remember seeing in a film set in World War One. I cannot recommend it enough. How sad that it has had such a limited cinema release on the Centenary of the year in which the film is set. Almost as if these men are all forgotten now? Not by me.","user":"pr65","rank":[81,99]},{"title":"Benchmark by which to judge others","rating":9,"date":"3 June 2018","review":"What a contrast to so much mediocrity and worse eg. Dunkirk. Set in the trenches in March 1918 but not really about the trenches or March 1918 at all.<br><br>Superbly cast and acted, a beautifully written reflection of a junior officer's view of the penultimate stages of WW1. Even more, this is a beautifully written reflection on the human spirit in adversity. Of course some of the senior officers are somewhat caricatured - that is what happens in real life. Of course it becomes more and more difficult with the passage of time for people to understand the mentality of empire, the public schoolboy ethos embodied by Raliegh, Maybe the same bravado and fear affects people joining violent gangs - I know not - but Raleigh is about the same age as some gang members - 18/19. Stanhope at 21/22 is a veteran of war, Uncle (Osborne - quite possibly early 30s) almost a veteran of life in their eyes.<br><br>Of course such characters have been used in films since - but this was written in 1928. It cut the new ground - others have followed.<br><br>The Roman Horace said \"Dulce et decorum est pro patria mori.\" and it took until WW2 for Patton to say \"The object of war is not to die for your country but to make the other bastard die for his.\" But what about sending your friends, your very best friends, your nearest and dearest to near certain death. What does that \"do\" to a man. Stanhope knows and through this film we can maybe glimpse that horror. What happens when there is no \"cunning plan\" left. Uncle knew.<br><br>Hold them off for as long as you can. In 1914, in 1918 when Journey's End is set, and again at Dunkirk ordinary men really did. No doubt there are countless other examples both before and in the last 70 years.<br><br>This film is a fitting tribute to those men.","user":"esklepios","rank":[39,47]}]