[{"title":"Nothing special","rating":5,"date":"9 April 2016","review":"Natalie transfers to college. She wants to be an architect. As luck would have it, she catches her boyfriend cheating on her just before she moves, so now she is free.<br><br>But some sinister girls are monitoring her and making plans for her. They set her up with a roommate and are looking for a guy for her. Turns out these girls run one of the prominent sororities on campus.<br><br>Sure enough, Natalie with some help of her roommate decides to rush that sorority, as her now dead mother did years ago. Her hazing includes her having to seduce a guy...just the guy the sinister girls had picked for her. Natalie and the guy are actually a good match for each other and they go on two dates. While they are making out in her dorm, the roommate barges in and offers the guy some brownies, he starts hallucinating, a bunch of sorority sisters arrive to film him, he leaves, crashes his car and dies.<br><br>His sister coincidentally works on campus in some administration capacity and thinks something is fishy with his death. They find THC and ecstasy in his system, but she known that as an athlete he would never take drugs (ha!). She discovers that he's been seeing Natalie and talks to her. The entire sorority went into panic mode and the girls decided to stick to a story that they had nothing to do with anything. But the guy's sister knows better, and Natalie isn't very good at lying, something she's made clear to Alexa--the sinister leader. The guy's sister herself ends up in trouble and gets herself fired for harassing the sorority.<br><br>But Natalie keeps having seconds thoughts. She goes home and talks to her friends about it. When she returns to campus, Alex and her sidekick, plant drugs on her and call the cops. Natalie ends up arrested, but fortunately the sorority hires a lawyer and pays her bail. Now they have Natalie but she also realizes how far they are willing to go. She comes clean to the guy's sister and with her friends plan to take down Alexa. In the process we learn the motivation for Alexa's action.<br><br>Dead on Campus doesn't involve a death on campus, nor is it particularly sexy or thrilling. But I did like the main themes of the movie--the lure of power, the abuse of power, the corrupt network of the corrupt powerful who'll go to any lengths to cover up each others misdeeds. The message of the movie is good too--to do the right thing even when it's not the easy or convenient.<br><br>Execution is a bit iffy. Casting is rather poor overall, with the exception of Natalie's friend who saves the day at the end. The girls are overdressed and overmade-up most of the time.","user":"TdSmth5","rank":[7,14]},{"title":"\"Delta Psi Beta Forever!\"","rating":23,"date":"23 September 2019","review":"\"Dead on Campus\" is a film about a university sorority that is rotten to the core. Freshman Natalie Kellison is admitted to Riverton University, and she wants to follow in her late mother's footsteps by joining the sisterhood of Delta Psi Beta. Little does she know what is in store for her with the dysfunction of an insidious academic institution with a nefarious creature as its president.<br><br>The president of Delta Psi Beta is Alexa Cooper, the daughter of a Congressman. Alexa uses her power to get the sisters to bow down to her authority. Her tagline is, \"You don't trust people; you own them.\" But her reign of terror will be challenged in an unexpected source due to the strength of character of Natalie Kellison.<br><br>To be admitted to the sorority, Natalie must perform a task and is sworn to secrecy. Her assignment is to seduce a member of the track team, an impoverished orphan named Sumner Williams. But when Sumner visits Natalie in her dorm room, he is fed brownies laced with marijuana and ecstasy. Natalie is unaware that her date is being set up. After leaving with his faculties impaired, Sumner dies in a car crash. Alexa Cooper then moves into action to cover up the crime. But will Natalie play along? Or, will she have a conscience?<br><br>Like other Lifetime films, \"Dead on Campus\" is a scathing satire on the Greek system on our college campuses. But the film goes overboard in suggesting that a sorority or frat house would wield the kind of power implied in Natalie's story. It was also far-fetched that Natalie and her old high school pal Nicki would go undercover in the attempt to \"bust\" Alexa inside the impregnable fortress of her father's mansion. As Alexa herself acknowledges, Natalie was on \"an Ocean's 11\" mission.<br><br>The saddest character in the film is poor Sumner Williams, a schlub and a dupe, who became collateral damage in the twisted vision of Alexa. Sumner and Natalie had some good chemistry. And, it was a heartbreaking moment when he died. Was it really necessary for the filmmakers to portray his death in the gruesome manner they chose in this film?","user":"lavatch","rank":[0,0]},{"title":"Basically Standard Overall","rating":4,"date":"10 May 2017","review":"Before watching \"Deadly Sorority\",I have this Lifetime TV movie about death initiated by a sorority entitled \"Dead on Campus.It stars Katelyn Tarver together with Tamara Duarte and Nicki Aycox. This film directed by Curtis Crawford tells the story of Natalie and the death of a guy that he dated that was caused by the sorority.<br><br>Natalie was a smart and intelligent College student.When she caught her boyfriend sleeping with another in an act,she decided to transfer to another university.In her transfer,she decided to join a new sorority and to undergo the initiation rites that she had to go to.Among them is to seduce a guy named Sumner who is known to be shy and introvert.During their date,the sorority members decide to go on a prank that became viral.This led to the guy to commit suicide.The sister of Sumner,who happens to work in the university as an administrator,believes that there was something fishy behind her brother's death.She think that he was murdered instead of suicide and points all her fingers towards Natalie. This prompted Natalie to investigate the case herself to find the culprits and to clear her name.<br><br>Obviously,this screenplay of the protagonist trying to investigate the case for themselves to clear their guilt has been used many times already in numerous TV movies.So there is nothing new in this TV movie as predictably we find Natalie find out who caused Sumner's death and how she exposes the sorority's illegal activities.The story proceeded as expected and there was rarely any tension nor surprises in the plot.Everything happened as the viewer expected it to happen.Overall,it was a standard TV movie as it was both predictable and clichéd.","user":"Desertman84","rank":[1,2]}]