[{"title":"The more realistic 'Pretty Woman' of the 10's","rating":7,"date":"30 July 2015","review":"In the end of my childhood I have seen Pretty Woman a few times. Later in my twenties I have watched the movie again. And then you realize this movie is not so romantic anymore. It's just a lucky (beautiful) prostitute that gets an (attractive) rich guy. That movie is told like a beautiful fairy tale with a happy end.<br><br>This movie comes much closer to reality. The main story line of the movie is predictable, but there are enough enjoyable moments to like this movie. Also the chemistry between the main characters makes it fun to watch. <br><br>The motivation of the main characters makes the story believable and you can empathize with them; cyberbullying, loneliness, self esteem, money problems, family issues, addictions, rejection and of course the 'is love real' question.<br><br>So Yes, it's not a 'Pretty Woman' fairy tale and NO it's also not based on a true story, it's something in between and that makes is worth the effort to watch.","user":"Thijs79","rank":[57,80]},{"title":"I'm an escort myself and I enjoyed it quite a lot","rating":6,"date":"16 November 2015","review":"'The Escort' covers much of what we do as a job, and it's even a  touching movie. It goes about love, drama, touching moments, and even  humor. The relationship between the two partners is really well done as  they struggle with their own lives. The performance is quite good on  most cases although there's some overacting by some of them. It's not  the first time this story is told on movies, as you already know, but  this is kinda a more contemporary version of it. As I said, I'm an  escort myself and  I find that the movie doesn't offend our profession on any level.  Obviously it's not the best movie out there, so I gave it only a 6/10,  still, if you work on this profession you're definitely going to enjoy  it.","user":"martagularte","rank":[50,71]},{"title":"The Escort: a nice Comedy.","rating":7,"date":"13 October 2015","review":"I hope that talking about sex doesn't bother you, otherwise you won't be able to appreciate this comedy.<br><br>It's a love story spiced with some very good characters. Lindsy Fonseca is pretty (as she was in Kick-Ass) and Michael Doneger plays the part very well: he also wrote the script (together with Brandon A. Cohen), which is an always noteworthy something. <br><br>The story flows fluidly until its natural end and effortlessly keeps your attention high. It deals with talented (and good looking) young people living unusual and interesting lives. And the result is entertaining.","user":"niutta-enrico","rank":[25,36]}]