[{"title":"One of the best laid out movies ever!","rating":7,"date":"22 July 2015","review":"I just love the whole plot of this movie. <br><br>Joaquin Phoenix plays a brilliant and drunken philosophy professor who contemplates the perfect crime as a way to get a new jolt of energy to his wipe out existence. <br><br>Woody Allen is not really my cup of tea, but I dig some of his work. The movies that jump out at me that I really like are Magic in the Moonlight that also stars Emma Stone and Midnight in Paris. <br><br>What I saw of Irrational Man on the surface that was being portrayed in trailers is nothing compared to what was being passed off as the real plot of this movie.<br><br>Phoenix give such an magnificent performance I feel that it's more his vehicle than a Woody Allen movie. Adding to his performance was what he shaped his body into, which was ironically impressive. I can't remember the last time I saw such a fat gut being exploited in a movie, It literally help him to become the center of attention.<br><br>Similar to the Hitchcock classic, Strangers on a Train (especially in plot), The movie gives a very interesting take on the perfect crime. It's not coming from a cops perspective at all, or about solving the perfect crime, It's all about the emotion of the man who tries to commit such a crime, and how easily he can blend into our society. <br><br>It starts as very lighthearted movie about a self-loathing over thinker and then turns really dark without actually becoming dark. <br><br>It made me laugh and it held my interest. I'm very impressed with what Woody Allen put together.","user":"subxerogravity","rank":[98,127]},{"title":"A moral response to \"Match Point\" and a very high point in Allen's recent filmography...","rating":9,"date":"21 May 2019","review":"Finally! A Woody Allen film with a linear plot and \"what if\" dilemmas disseminated all through a thought-provoking campus-set story, a symphony of thoughts and actions without any false note and that would catch any skeptical mind off-guard. Allen surely delivered on that one!<br><br>\"Irrational Man\" covers many philosophical questions about the rationality of individual \"morality\" and their possible interference with ethic. Abe, the newly hired philosophy teacher played by Joaquin Phoenix, doesn't believe the intellectual medicine he sells to his students, his dark and brooding attitude makes up for the lack of enthusiasm in his endeavor and is enough to earn admiration, if not fascination, but the man remains totally unsatisfied about himself and pretension isn't his strongest suit.<br><br>One day, he's given a test (not a taste) of his own medicine through an intellectual challenge that could only emerge from the creativity of Woody Allen: a situation that gives its full meaning to the word existentialism, a hackneyed word that only inspired vague interpretations of the word \"accomplishment\" but in the film, it's shown as a moral weapon, more specifically, a double-edged sword when confused with a sort of misguided sense of entitlement, a great illustration of the idea that hell is paved by good intentions... or maybe that quote from \"Chinatown\" that sums it up perfectly: \"most people never have to face the fact that at the right time, the right place, they're capable of anything.\" Abe won't be one of these.<br><br>And so Abe undergoes a smooth transition from one state of mind to another as if we had to understand what's eating him before understanding what could regenerate his lust for life. Phoenix feels like overplaying the intellectual malcontent in quest for a meaning in the beginning and it takes not one but two women to try to break the ice and finds what's under that depressed carapace of his, Parker Posey is Rita the lively and sensual teacher who instantly falls in love and Jill is the brilliant student who has the typical crush on her charismatic teacher. See, the film offers so many common tropes to better avert them. Abe looks like your typical alcoholic womanizer but he's impotent and his suicidal impulses turn everybody off... when eventually things go better, he's wise enough to keep it platonic with Jill, because she's engaged, and if you think Jill will abandon everything to follow her teacher and do the right thing by breaking up with the dull boyfriend, you've got another thing coming.<br><br>As usual with the best Allen films, you have a fine set-up that introduces to characters with clearly drawn personalities but unclear motives and then there's something that changes everything: the motives get clearer and the personalities reveal new depths. It's a simple conversation overheard in a café that changes the course of Abe's life, triggering a new vision with a tangible effect on Jill and Rita. It's a decision that calls for an act, one of heavy proportions but deemed necessary because wishing is useless and action is meaningful. And from that point, the film is like a great waltz under a tertiary tempo: one for the triangular love and the way Abe's charm works way too much not to be an omen for complications, one for the moral dilemmas over which I hesitated to give a definite judgment, telling myself \"that better goes somewhere\" and finally a response to \"Match Point\" where 'bad things' went unpunished, and not even suspected.<br><br>In fact, the film is so smooth and engaging that the ending feels a bit hasty in its execution, sometimes the right thing to happen isn't necessarily the right one when it comes to end with a final \"wow\", but obviously, \"Match Point\" had already made its point and \"Irrational Man\" needed to take us back to some sanity. Many movies provide cynical examples of characters succeeding while being morally corrupt, and it's refreshing to have films that bravely set the \"boring\" but necessary moral aspect of the problem. Abe is an interesting character indeed, he draws us toward his charismatic personality to the point that our own convictions are challenged... to a limit of course. And it's for movies like these that I've always admired Woody Allen and after the disappointing \"You will Meet a Tall and Dark Stranger\", here's one that succeeds in almost every department.<br><br>Not too many characters but what's there is three-dimensional, unpredictable yet consistent, a plot that goes through many fluctuations while attached to its spinal topics and that little zest of wit that tickles your intellect and makes you wonder what you'd do if you were in \"their\" place. The film saddened me when I thought of the director's recent downfall into persona non grata territory. I've taken his last movies like consolations, if he's lost his touch then there was no need to go further, maybe his creative juice had stopped to drain such clever and brilliant films but \"Irrational Man\" made me reconsider, Allen can still surprise you... and he does it so brilliantly that I would separate the art from the artist, and I wish enough actors in Hollywood would do it so the only true Hollywood auteur can make movies like this, disinterested and interesting, devoid of any calculation except for giving a shot to \"it\" actresses, like Emma Stone who delivers a terrific performance one year before her Oscar-winning role in \"La La Land\".<br><br>The film restored my faith in Woody Allen, his \"Café Society\" left me cold but I guess there's a pattern in his long filmography, every 2-3 years, he makes 'that' film that feels undeniably good, if not great. \"Irrational Man\" is the second highest point of the 2010s after \"Midnight in Paris\", I wish there's enough time for Allen to make one great film... might be his last from the way things are going.","user":"ElMaruecan82","rank":[8,8]},{"title":"Woody doing Philosophy Noir rounds out a trilogy - underrated though flawed","rating":8,"date":"28 July 2015","review":"Sometimes a guy can't catch a break, and it may be for good reason. With Woody Allen and the critics of Irrational Man, one may think there's a rational reason, no clever spin intended. Here's a man who is spectacular at what he does, but he doesn't have the most immense range of the American iconoclast-auteurs - by this point, after writing films for 50 years and directing for over 45, critics and most audiences get the gist of what the man works with: some occasional fantasy, light-hearted comedy, serious, brooding drama, romance, mystery, magic, existentialism and the separation of reality and fantasy. But for myself, I went into this trying to take it just on its own terms: does it work as its own story, as to what it's trying to do, with or without the author's baggage? I think it does, often quite well, and it makes a sort of cap to an unexpected, thematic trilogy of movies, which I'll get to in a moment.<br><br>In Irrational Man it starts out like what seems to be a story of a philosophy professor (Phoenix) caught in despair, while an eager, bright student (Stone) starts to fancy him. He's blocked, he can't seem to write (or \"sleep with\" Parker Posey's character early on), and he drinks fairly heavily (Phoenix adds a pot belly to the mix). But its main turning point turns it into what is a Hitchcockian tale of murder and deception, all due to eavesdropping on the sad tale of a cruel judge presiding over a custody case. It turns this professor's life around, albeit with a rather dark twist.<br><br>By Hitchcockian it's easy to throw that label around, but this is a filmmaker who has previously used a scene from Shadow of a Doubt (I forget which movie, but I remember characters watching it in one of his films), and now has some elements taken from it. Hey, how about a discussion in a very lively, satirical manner about the best way to go about a murder? Or what if it's a complete stranger with a poison of some kind? At the same time Allen throws in Emma Stone, once again after 'Moonlight' but here now modern and always great to look at as a star on screen with full-on talent and energy to burn with her co-star. Phoenix, meanwhile, gets a lot of this man's despair, and then his odd joy too - though Phoenix may not seem like the most spot-on actor to show 'energy' in the later half of the film, he is still completely there for what this character requires.<br><br>What I liked about Irrational Man, even with some of its familiarity in the Allen world - professor with a younger student romantically, questions of morality, what it means when PURE luck really defines what happens for people - is that it was genuine about how its characters saw and changed with their views on the world, and that on its own you get wrapped up in the question of \"Will he really get away with this?\" To be sure, this question was asked with greater intellectual rigor in Crimes &amp; Misdemeanors, and Match Point had an even tougher, bleaker view of what it means for people to get ahead in the world no matter who stands in heir way. But all three of these movies seem to make up a trilogy - maybe we can call it his 'Dostoyevsky' series - with this one being what I should think is the capper of them. Now it's not an older businessman or a young upstart, but someone who has spent his life trying to figure out what it means to live a meaningful life in theory vs practice.<br><br>It may be the literalness of this comparison that will throw off some viewers. That and/or the narration. I have to say that is the one thing I'm really unsure of after seeing it for the first time; on the one hand it works with the realm of film noir, as in here are characters who are constantly plotting or trying to think their way through some sort of emotional or moral logic (and the moment where the plot really kicks off, it seems hard for me to figure how it could be done without voice-over), but on the other there are moments where it is too much, that a moment could work without the character's direction. On the other hand again, it's an existential comedy that takes itself very seriously, or a semi-romantic and dramatic love story that has some light touches (and that ending!) Irrational Man isn't great, but it's very good, exceeding any expectations I could've had, in large part thanks to a cast and, by the way, some really skillful and beautiful direction on the whole (and the warm cinematography, all shot in Newport, Rhode Island). I'll be curious if this gets re-evaluated in 10-15 years.","user":"Quinoa1984","rank":[58,77]}]