[{"title":"Nice surprise","rating":9,"date":"17 January 2019","review":"Burek feels like a throw-back to old times, when movies were simpler. A nice, entertaining feel-good film with fantastic scenery and a beautiful score. But also, underneath the simple plot perhaps lies a deeper message, if you care to look for it. My favorite line \"There are no strangers here, only friends you haven't met yet.\" The film is a Mediterranean delight, just like Burek!","user":"razor-35932","rank":[8,9]},{"title":"Watching Bourek is like going on vacation in a company of good friends","rating":10,"date":"2 May 2016","review":"Bourek is a solid indie production that takes you away from troubles into a different part of the world, just like characters in the film. It has drama, romance, humor and overall great interaction between international cast of characters performed by wonderful actors. Al Nazemian as Tarek shines in every scene he's in as poetic philosopher refugee who washed out on shore after falling off the boat. Also, brothers Branislav and Sergej Trifunovic are absolutely hilarious as Serbian brothers on vacation for a dollar a day. And last but not least Mari Yamamoto and Jason Grechanik portray couple in love and starving artists living their dream to perfection. Bourek is a Mediterranean dish that brings all these different characters together after turmoils they go through creating a family of sorts. Experience Bourek the film with your family whatever it might be.","user":"Swtcopycat","rank":[11,14]},{"title":"Comedy and fairy-tale meet on the sun-shot island of Time","rating":10,"date":"6 May 2016","review":"Bourek is a delightful film, intelligently written and visually stunning. It manages to be both a modern-day fairy-tale and a timeless glimpse at mythological figures washed up on the island of Time itself. It's also a commentary on how best to cultivate our gardens far from the crosswinds of globalization where man is a wolf to man. The cinematography is extraordinary (cerulean blues, glistening light, every color shot with visible wonder) and the acting of the lead Katerina Misichroni, aerial and soulful, as well as the marvelous Al Nazemian (who plays a hilarious risen-from-the-sea, Yeats-reciting Libyan refugee) are simply unforgettable. Mr Nazemian's arrival on Khronos is the highlight of the film, and both its mythic and comedic apex. All in all this is a world one dreams to visit time and time again, both for the sheer pleasure of re-encountering Misichroni's and Nazemian's exquisite faces, and for the very lush sensual (and gastronomic) pleasure the movie conjures with such style and comic bravado.","user":"lila-82726","rank":[12,16]}]