[{"title":"A Beautiful and Colorful Apparition","rating":7,"date":"3 October 2017","review":"Al and Fin, father and teen son, are reeling from the loss of a beloved wife and mother. Each is dealing with the loss in a different way, yet in no way that is particularly constructive. Al is having an affair with a student and Fin is sulking in a cocoon of solitude. Neither is communicating. This is when Evelyn flits into town. She is a beautiful and colorful apparition wreathed in flowers, butterflies, exquisite jewelry and bubble bath. Al and Fin are so blinded by passion, be it grief or love, that they risk losing each other as well as the woman they seek.<br><br>The film is personal for the director who felt extreme grief and loneliness when a close friend died. While the actors lack assurance and chemistry between each other, the story is compelling and it flows together well. Queensland, Australia, is the perfect dream- scape setting for the film. Seen at the Toronto International Film Festival.","user":"Raven-1969","rank":[16,26]},{"title":"Don't think just experience it","rating":9,"date":"20 May 2018","review":"I saw this with no idea what it was about, just that it has cool colors and butterflies in it. This movie will confuse, bewilder, and entice you to imagine things you never could expect. It's not linear in the way you'd think, it's all over the place but shows us that everyone has their own life and it's never just about you. The brilliance of this movie is it's unique acceptance of all the crazy things people do or think, their stupidity and their charm. Worth watching once, don't think just experience it.","user":"waitandhope","rank":[9,16]},{"title":"Unusual Australian drama, which combines dark themes with elements of beauty","rating":7,"date":"30 June 2018","review":"A father and son are in the midst of an uneasy relationship after the death of their wife/mother. Into this scenario enters an ex burlesque dancer who owns the local flower shop. Both males develop an infatuation for her as the seek recovery.<br><br>This Australian drama combines some beautiful colourful imagery which sometimes crosses into fantastic reality with a sombre and emotional story grounded in grim reality. As such it is quite an unusual combination but one which worked for me, with the sadder aspects of the story-line ramping up in the latter third. The issues touched upon include suicide, grief and cancer. Its pretty heavy stuff but well delivered by its small cast. Melissa George (who to me will forever be the mysterious Camilla Rhodes from the utterly seminal Mulholland Drive (2001)), puts in a great performance here as the character in which the whole story pivots. She introduces colour into the lives of the man and boy and acts as a springboard for them to move forward, even while she herself is going through a trauma. It could be said that the characterisations and connections are a little under-cooked somewhat perhaps, with little chemistry between George's character and the husband Al, but I thought she did work very well in tandem with Ed Oxenbould as the youngster who is infatuated with her. While it is a sombre film, played out in a minor key, it also has some bold and beautiful imagery of butterflies, flowers and Melissa George in burlesque gear and roller-skates. It all adds up to an unusual drama which deals with some heavy topics in a left-of-centre way.","user":"Red-Barracuda","rank":[4,7]}]