[{"title":"Underworld","rating":5,"date":"22 February 2020","review":"Mindless boring action flick. Great to see Kate Beckinsale in latex again. The action is supe-choppy and sloppily made film. Watch it if you're REALLy into the series, otherwise skip it","user":"MR_Heraclius","rank":[36,37]},{"title":"A must-avoid for all Underworld fans","rating":5,"date":"7 December 2016","review":"I enjoy (good) vampire movies, dark movies, good screenplays, good production, good screenplay, good cinematography and characters like Selene. This means I really enjoyed the first three Underworld movies, provided we ignore the prequel which was no more than acceptable.<br><br>It also means that this movie ruined the franchise for me. Production was poor and clearly quite low budget (reuse of the same footage on a few occasions, etc.), the script was inadequate and, while Anna Foerster has put in some credible performances in TV, this was quite poor. Len Wiseman, or even Mårlind and Stein, could conceivably have turned this into a movie worthy of the franchise.<br><br>There is also a hole in the plot worthy of a B-grade horror. <br><br>SPOILER ALERT. And here comes the spoiler: The very premise of the movie is that Semira's coven is impregnable and Marius would be foolish to attack it without the blood of Selene's daughter. The werewolves specifically state that they \"looked for any weaknesses and there are none\". Then, later on in the movie, with no such blood, the werewolves walk in there like they own the place and it is clear that they would have taken the coven has it not been for the arrival of a transformed Selene with significant backup. The entire first 80% of the movie is rendered superfluous in one scene. SPOILER ENDS<br><br>And so the great Underworld franchise goes out with a whimper. Neither Kate Beckinsale nor the character of Selene deserved this, some heads should be hung in shame.","user":"edudejager","rank":[122,173]},{"title":"Just take it as entertainment","rating":8,"date":"22 April 2017","review":"It's Kate Beckinsale again in tight leather! Come on people, pop in the Blu-Ray or stream it and load up the popcorn. Take off the critic's thinking cap for a night. Don't expect too much with a sophisticated plot or story line. Do expect some Lycan ass-kicking from Selene as usual, and enjoy the movie for what it is - a war between vampires and werewolves. The CGI could have been better, but did I not mention Selene/Kate in tight leather?","user":"tuanskie","rank":[58,80]}]