[{"title":"Forget the marketing and chatter, there is a real film here.","rating":8,"date":"15 July 2015","review":"The script is laughable and the acting (often voice-over), too. The 3D sex is well marketed. And yes, during certain scenes people got up and left. Yet. The film doesn't argue to be anything beyond a meandering stroll into the gallows melancholy. And it does this very very well. The film features no highbrow intellectual conversations but instead, favors the same lines you've probably slung at your lovers. Again and again and again. Just like the sex you've had with your lovers again and again and again. You know their bodies and you know how to please them and above all, you know how to hurt them. Sorrow. There's a resplendent simplicity here that hypnotizes the viewer.<br><br>You hear music banging inside the club, yet the lovers are outside in halflight. Having sex, obviously. This is a good image of what this film surprisingly achieves best: intimacy. And it fights for that with it's magnificent camera-work and editing.<br><br>But what would this review be if it didn't talk about the 3D sex? Love and cinema are inseparable. Love stories are why you stick glued to a chair for a couple of hours. Raw sex is part of love, yet, films used to cut to birds necking after a kiss. Then it became steamy windows. Signs, metaphors, analogies, semiotic nausea. And here, Noé takes that away which makes the film even coarser, and ultimately more brutal.<br><br>I wanted to write this review because the whole marketing (\"finally a love story restricted for -16) and shock value (an eye-rolling warning in the opening credits) have cheapened what this film has achieved and I encourage viewers to look beyond.","user":"kevinjk1","rank":[278,373]},{"title":"This film is actually brilliant.","rating":7,"date":"21 August 2016","review":"I know I only rated it a seven out of ten but that's because I admit this film's faults. It certainly isn't near perfect but I felt very moved by the characters and their story. Lots of people may not be able to relate to this film however those of us that do can say that everything about this depiction of love has been experienced and is real. As a grown single adult living in today's dating world I can attest that the relationship between Murphy and Electra exists. Their obsession with each other and with sex that led them into a deep and possibly unreal infatuation was honest and thought provoking. Love sometimes doesn't make sense and can't be described or made logical. Their connection was what drove them into darkness, madness and despair. Love is completely all consuming on any level it's represented on. So many times have I given myself up for something that a year later I looked back on and couldn't reconcile my behavior, and so many times have I given myself up to something to only sabotage it before it completely devoured me. I don't know if I have been in love, but I have felt what these characters are going through and I wouldn't know what else to call it. In the vein of Harmony Korine and Lars von Trier I think Gasper Noe is a genius. Yes this movie is uncomfortable, yes the acting isn't great and yes the story is dry, but it's a genuine take on what relationships look like for some people in their mid twenties to early thirties and I loved every second of it.","user":"sisilovesu","rank":[44,55]},{"title":"Watch porn.","rating":3,"date":"28 November 2015","review":"I have nothing against sex. I love it, I love watching it but this was painful. The sex was hot but the story and the acting was terrible. I think it was not worth it and very very long. I can see what the director was trying to do but he missed the mark. For the same kind of story with the sex dial down and the story dial up I would suggest The Dreamers. This story could be told in about 30 min, add maybe 30 min to get invested in the characters and that would be good. 2h is way to long for this and 5 min sex scene every 10 min is too much. Like the title says. Watch porn it will be more fulfilling.<br><br>Now for the actual review. The plot is simple. It is a guy reflecting on a past relationship. The guy is a little to dysfunctional to be in a healthy one but it is not extreme. The only real question you have during the movie does not get answered and that is about it. I would not recommend this to anyone.","user":"sssnaky-856-782861","rank":[227,337]}]