[{"title":"Finally, a movie more technically inept than Birdemic!","rating":2,"date":"15 April 2016","review":"I'm a fan of well-executed horror anthologies, especially the classic ones. I was hopeful for this attempt and I was willing to give it a chance (based on the other reviews). While I hate to be a naysayer and embrace negativity, I would truthfully grade this as a \"C+\" student film, at best. The only time a character showed any emotion instead of just reciting lines was during the third story. That just isn't good... <br><br>Film-making is (very) hard work and every director has a starting point, but compelling characters and/or a decent story can make up for many shortcomings, including poor special effects and slow pacing. While this movie attempts to tie together three \"vignettes\" in a meaningful way, it would have fared better if the director had just plagiarized a throwaway script from a Syfy-channel reject. Rule number for any film project should be to solicit feedback from outside your immediate peers -- that would probably help cut down on the rampancy of overused movie tropes.<br><br>All in all, this is a rather amateurish effort marred by clichéd dialogue, questionable casting choices, sloppy editing and poor cinematography.","user":"ajira99","rank":[5,8]},{"title":"Comes across like a student project, but still decent","rating":5,"date":"14 April 2016","review":"This movie starts really bad. Everything about the first scene (and subsequent set-up scenes for the anthology stories) is bad. It has the worst acting and the worst production values. It must have been shot on an iPhone, because my home video camera takes better quality video than these scenes. The poorly written dialog, along with the poor production values, makes it nearly unwatchable.<br><br>I was about to give up on this movie after the first ten minutes. Then I remembered the other reviewers saying to stick it out. One even said that the bad acting and story was for a reason and it would all be clear by the end of the movie. So I stuck it out. I'm kind of glad that I did, because the first anthology story was actually pretty good and although the acting was still not that good, it was the best of the entire movie. Suffice it to say that the first story is sort of like the first paranormal activity film, but better and shorter. The second anthology story was decent, with the third being the least decent. Unlike the first scene and set-up scenes, the anthology stories actually had good production values.<br><br>The entire movie, however, never explained why the first scene (and subsequent set-up scenes) had the worst writing, the worst quality, and the worst acting. I'm taking a leap here, but this movie came across to me like a very well made student project. If I were attending film school and watched this as a final grade project, then I would say it was great. Otherwise, as a commercial film, it is entertaining enough to rate 5 stars.","user":"nysalesman","rank":[3,4]},{"title":"Far better than expected.","rating":5,"date":"14 April 2016","review":"I've seen so many horrors, especially those underground ones, that's why I'm here, commenting on those poorly viewed or rated in order to straighten some things up. This one looked like so many before, another cheesy copycat of everything else ever made.. but wait!<br><br>Wait! Watch it till its very end, after about 40 minutes, when the first story ends you start to understand it. It actually has a nice plot to it, some good stories, not the best acting out there but the script is indeed a good one. I declare myself truly pleasantly surprised. I did enjoy this and even tho it is very unknown I will recommend it. If you are a horror junkie armed with a little patience, see this one. Most likely you will not be disappointed!<br><br>Cheers!","user":"gothic-fiction","rank":[6,13]}]