[{"title":"It's the best sequel you could've made twelve years later, and if that's good enough for you, it's good enough for a rainy day at the movies","rating":6,"date":"27 March 2016","review":"\"My Big Fat Greek Wedding 2\" is probably the best sequel that could've been spawned from a largely forgotten but monstrously successful independent romantic comedy from twelve years ago. One could theoretically call it a \"too little too late\" sequel, something Hollywood has been good at churning out recently with sequels to \"Barbershop,\" \"Joe Dirt,\" and \"Zoolander,\" but when a sequel is so similar in line with its predecessor after so many years and practically oozes the same kind of sentiment, one has to be a bit forgiving and credit it for what most sequels fail to capture.<br><br>Both sequels to \"Joe Dirt\" and \"Zoolander\" were flawed from the very concepts, and when it came time to try that concept again, over a decade later, it felt stale and desperately forced when it came to trying to modernize it for the times and the now-grown up audience. While \"My Big Fat Greek Wedding 2\" has obligatory scenes of poor Toula (Nia Vardalos) trying to teach her loving father Gus (Michael Constantine) how to work a computer, it nonetheless manages to effectively work as charming comedy of moments, even if its structure and narrative theme is about as basic as it can get.<br><br>The film reenters the lives of the characters we fondly recall from the first film, only now, well into their married lives and elder years. Toula and Ian (John Corbett) are having the typical kinds of struggles most semi-long/long-term married couples have emotionally and romantically, especially with their teenage daughter Paris (Elena Kampouris) in the midst of deciding where to go to college. While she wants to go off to New York University, her parents want her to stay in Chicago and go to Northwestern University, but Paris has been constantly smothered by her borderline insufferable Greek family to the point where she wants none of it.<br><br>Meanwhile, Toula's parents Gus and Maria (Lainie Kazan) are getting well into their old age, especially Gus, who has had hip and memory problems for a while now. All is going well between him and his wife until Gus uncovers a much-repressed family secret that the priest never signed the certificate of marriage to make Gus and Maria an official union, meaning Gus and Maria aren't legally married, despite fifty years of togetherness. How this was never uncovered before, as if the two never had to file taxes or partake in any other legal activities, I'm not sure, but long story short, they're not married. Rather than doing the logical thing and just going down to the courthouse to make the marriage official, of course the family must complicate it, starting with Maria wanting not only a real proposal from Gus, but a full-blown, bank-breaking wedding. So we're back to square one, this time planning a wedding for the older couple, rather than the younger one.<br><br>The scene-stealer this time around, however, isn't so much Vardalos playing a role she can practically sleepwalk, but Aunt Voula, played by the lovely Andrea Martin. Not a hugely significant presence in the first film, it would appear that Vardalos decided to give some of the best quips and zingers to her character's aunt, whose loud presence and boisterous, if invasive, mannerisms often result in some strong belly-laughs. Also giving his all in a performance that he can probably perform at any given time of the day is Michael Constantine; despite his character, the actor can't hide his energy and Jack Lemmon-esque grouchiness when it comes time to really commit to being an enthusiastic presence. He winds up being the most commendable presence here.<br><br>The rest of the film is damn-near what you can imagine if you close your eyes and picture potential setups and events for the Portokalos family. Paris is a fascinating character, but unfortunately underwhelming because, fitting for her character and her situation, she keeps getting nudged out of the frame by her louder counterparts. It would've been nice to see a setup solely involving Paris and her decision of grappling with her parents, her heritage, and her decision of where to go to school. Instead, we get a pretty lukewarm plot involving her making impromptu prom plans with another boy (The Naked Brothers Band's Alex Wolff) after he is rejected by the prettiest girl in school. That's about as cliché as Greeks kissing each side of another person's face when they first see one another.<br><br>However, \"My Big Fat Greek Wedding 2\" has some remarkably funny moments. A scene involving Gus stuck in a bathtub isn't played for the kind of bawdy and slapstick gimmicks you'd expect and a scene between all the female Portokalos members at a beauty salon is the epitome of what I wanted from this film all along: good conversation amongst people you can believe are family. Because of their general talent and the fact that they've done this before, the cast's chemistry is fun and the events of the film are lively and concise enough to assure it's never boring and always moving. It's the best sequel you probably could've made twelve years later, and if that's good enough for you, it's certainly good enough for a rainy day at the movies.","user":"StevePulaski","rank":[30,37]},{"title":"Very Cute with lots of belly laughs and better than the original","rating":9,"date":"22 March 2016","review":"I saw My Big Fat Greek Wedding 2 last night at a screening last night and was apprehensive about going but so glad I went! It was a great silly date/family movie that I really think out-did the original and was a great reminder that sequels can revive the energy and feeling of the first film without relying on the same jokes, and storyline. It had plenty of great call-backs to the original and any fan of that film or anyone with, or who knows, a loud big family will be smiling ear to ear and can plan on laughing away. The film was more or less what you would expect with almost all of the original characters making reprisals and the time didn't degenerate their characters or the absurdity of their actions but like a fine wine they matured with time. I laughed out loud many times and the theater actually erupted in applause when it ended, which is very rare with silly comedies like this, and my only disappointment was that it finished almost too soon. I wanted to spend more time with the characters, but it didn't drag on, wasn't unnecessarily absurd and kept the tone and fun that the original film had. If you are looking for a feel-good film and a nice escape from our hectic wild world this movie will definitely please.","user":"neilhopper","rank":[50,70]},{"title":"I couldn't love this country more","rating":10,"date":"25 September 2016","review":"I am from Colombia, and two years ago I went to Greece, lived with two incredible Greek Families, learned as much as I could about Greek Culture, I fell in love of this amazing country and the kindest people I've ever met... Now, I saw at this movie in the list and I never doubted of click on and start watching it.. Only if you are a foreigner who visited and explored the Greek culture somehow you will be able to feel closer to those amazing people... watch the movie took me back to the best two months I have had abroad of my country... listening to the Greek accent, the happiness and union of Greek families, the pita- gyros somewhere and some Greek words that I still remember;all that little stuff relives feelings and memories I will never forget... Thank You Greece!!!","user":"andreanore","rank":[14,17]}]