[{"title":"Made me feel like I'm in la-la land","rating":9,"date":"13 July 2019","review":"La La Land is a cinematic marvel. It's nostalgia, meticulousness and joy captured my heart and earned itself the title of one of the best musicals of all time.<br><br>Almost every aspect of La La Land is close to perfect making this not only one of the best movies in recent history but also one of the best looking films and a very memorable cinematic experience. The cinematography is lively with phenomenal long takes, different location and gorgeous colours thanks to the production design. Ryan Gosling and Emma Stone make a wonderful musical duo with serious chemistry as if the roles were made for them. The music feels alive at any moment and the sound track is definitely consistent. After Whiplash, the stakes were high for Damien Chazelle and La La Land undoubtedly lands him a spot on Hollywood's best directors. Pulling of two films of the same genre and making both of them seem unique and originally is no easy thing to do and writing a film can be agonising so Damien Chazelle deserves all the praise he's getting.<br><br>La La Land is a genre defying masterpiece which I would recommend to anyone a fan of musicals or not. It's colourful joyfulness is a sight to see.<br><br>Final Score: 9+/10","user":"Aaron_Kyle","rank":[312,363]},{"title":"A true ode to the Golden Era of Hollywood","rating":10,"date":"10 August 2019","review":"The vibrant colors and use of musical scores to set the mood for scenes transported myself back in time. This movie feels not only like a beautifully nostalgic nod to Hollywood of yesteryear, but also that of a timeless love story. Gosling and Stone have a charm to their chemistry on screen during the musical and dance numbers. All these aspects lead to a raw portrayal of love that many experience in life, with still providing a sense of hope and wonder to the viewers. I was entranced from the opening scene until the final note played by Goslings piano. I absolutely recommend this film to any and everyone!","user":"wgerhardt","rank":[57,72]},{"title":"Nostalgic, Colourful, Joyous CinemaScope Magic","rating":18,"date":"18 January 2017","review":"Do I like musicals? Not really... but damn, 'La La Land' is a nostalgic, colourful, joyful marvel!<br><br>Damien Chazelle gained international acclaim and recognition from his masterful drama 'Whiplash', what were the chances that he could pull off similar success two times in the row? Well, if 'La La Land' is anything to go by, then I'd say he did the job. With just three films under his belt as of 2016, Chazelle is slowly becoming the next big thing this movie industry has seen. His passion for classic movies and musicals is evident as he references and pulls influence from films like 'Singin' in the Rain', 'The Umbrellas of Cherborg' and even 'Rebel Without a Cause', the latter of which is one of my favourite films so seeing the nod to it was something I was pleased about.<br><br>The chemistry between Gosling and Stone is strong to say the least, after two previous collaborations, their already-strong bond helped them become one of modern-day cinema's finest couples. The music is bouncy and toe-tapping catchy, the cinematography is utterly stunning with gorgeous colours and impressive long takes, and the locations sum up the American dream and the passion the characters hold for Los Angeles. 'La La Land' is by far one of the finest cinema experiences I have had in the past 5-10 years, and although this isn't a film I would typically enjoy (genre-wise), Chazelle has instead crafted one of my favourite films of this decade. A film I would recommend everyone see in the cinema to truly witness the CinemaScope magic.","user":"CalRhys","rank":[236,330]}]