[{"title":"Don't Waste Your Time","rating":1,"date":"20 July 2014","review":"Another hoax \"documentary\" in a long list by fraudster Robert Kiviat. He brought us \"Alien Autopsy\" in 1995, his initial hoax disguised as a documentary.<br><br>A long list of shady paranormal \"researchers\" contributed to this schlock documentary: ghost hunters, Bigfoot trackers, UFO chasers, and MUFON, the biggest of the fraudsters.<br><br>By enlarging NASA photographs so that the pixels are gigantic, they imagine all sorts of structures on the moon, including a nuclear reactor, wagon wheels, a cannon 1 mile long, a mine, a prison, and fort. Blurry craters become mile-wide satellite dishes.<br><br>Thank goodness that guy with the crazy hair from Ancient Aliens wasn't featured. Although, he would not be out of place in this show. <br><br>Save your time and skip the dreck. If I could have rated this a zero, I would. A \"1\" seems too high.","user":"OldMoveeLover","rank":[68,81]},{"title":"Pegged my bs-o-meter","rating":1,"date":"4 June 2015","review":"I've seen a lot of garbage over the years, but this by far tops pretty  much all the piles of caca on my list. The cast of characters reads  like the cast of a Ringling Brothers cleaning crew, the script appears  to have been written by a drunk 12-year- old, and the level of  intelligence required to view this is just below that of a Walmart baby  rattle. The horrid cast of so-called \"experts\" in this film reads like  the patient list at Nurse Ratchett's daily medication rounds. In one  scene, they bring up an expert on photography analysis that is billed  as a... get this... paranormal expert. Poor Roger Leopardi must have  been broke, hungry and way behind on his rent to agree to narrate this  spectacularly prepubescent film.  Don't waste your time. You'll get more out of watching the grass grow.","user":"flybd","rank":[39,48]},{"title":"Hilariously Bad","rating":1,"date":"2 October 2016","review":"This is possibly the fifth worst thing I've ever watched. Certainly the third worst thing I've ever seen on Netflix (behind the atrocious \"Haunting of Silver Falls\" and another alien conspiracy movie I watched that was even worse).<br><br>The entirety of this movie consists of someone talking about an object on the moon that is most certainly just a normal rock or crater, but has a shadow that makes it look strange. Then they color in the \"shape\" of the object they think is there, which gives - at least they think it gives - the appearance that some kind of artifact has to be there. Then they discuss those shapes for a long time. That's really all there is to it. <br><br>Let me point out three reasons why none of their claims make any sense:<br><br>1) They claim that the aliens use plasma from stars like our sun to power all their stuff, yet they say that they created a nuclear power plant on the moon. Why would they need it if they already had their energy source found out?<br><br>2) Our moon sucks. There's nothing on it.There are other moons in our solar system they could use as a base that have water on them - frozen seas and all - that could be much more useful. And if they had faster than light travel to reach us in the first place, then it would be extremely easy to reach us from there, so it doesn't matter if they're on our moon or another moon further away. No alien race would want to use our moon as a base.<br><br>3) Better yet, if aliens came here why wouldn't they just use our earth as a base and just force us to let them stay? It's not like we could do anything about it if they're that advanced. You're saying that these creatures traveled many light years to reach us *just* to create a nuclear power plant on our moon and some satellite that looks down at us (yes, they said the aliens have a satellite dish on the moon. Not like they'd have something a lot better on their own ship). That seems like a gigantic waste of time for them.<br><br>To conclude, this documentary makes no sense, and is so bad it's kind of funny. It's one of the worst things I've seen, but I'd still recommend it if you want something to make fun of. For review purposes, 1/10. For pure entertainment purposes, 7/10.","user":"saraheconner","rank":[19,24]}]