[{"title":"Catches the spirit of the comics and the older animation flicks very well!","rating":8,"date":"3 December 2014","review":"It's been a while since an Asterix animation film has been released in cinema's, and as a fan of the series I was very thrilled when I heard the news about a new one. But with the last two live-action movies about this crazy yellow moustached Gaul, my hopes weren't that high.<br><br>Well, let me first put your minds at ease, this movie is way WAY better than the live-action flicks about asterix! <br><br>It's been a while since I laughed more than 10 times with the humour in an animation film, but this one did the job exceptionally well. There is a good mixture of jokes, both for kids and adults. <br><br>The story is based on comic-book nr. 17 (Le Domaine des Dieux). The story isn't very original, but is stays interesting enough and it is fast-paced, without any dull moments. <br><br>However, I recommend that you know something about the world of Asterix before seeing this movie, because you get literally thrown in to the movie without any background-story. It is truly a movie for the fans of the comic books, viewers who never heard of Asterix will not always get the jokes or puns because they don't know the background-story.<br><br>The visuals are stunning and the look of the characters are very recognizable without any unnecessary changes to them. <br><br>It was a pleasant surprise to see Asterix, Obelix and the rest of the gang again in such a positive way, and I hope to see a sequel of the same quality soon :)! <br><br>it does an great job in catching the spirit of the comics and the older animation films. I recommend it ! 8/10","user":"GlenBender","rank":[41,44]},{"title":"Asterix lives again!","rating":10,"date":"16 January 2015","review":"It's everything a movie about Asterix should be.<br><br>The spirit found in Uderzo &amp; Goscinny works breathe true this movie. The subtle humor and those sweet eye winks like the authors always did in their books. The best Asterix animation to this day and trust me i've been a fan for 40 years. A total delight for the family and even for people who don't know Asterix world and the characters it will be easy to get to know them and have a lot of good laughs.<br><br>I have been really please and surprise by this animation as all movies done about Asterix were not as authentic and enjoyable like this.<br><br>I definitely wishing they do another one soon!!!","user":"warp_9","rank":[33,36]},{"title":"one of my favorite comedies...of the decade?","rating":8,"date":"28 January 2016","review":"it's a truly funny funny film. The spirit is exactly like the books, the humour goes right to the point of them, where we have lots of social reflections (about economy and tourism, or being happy just for having things) while we laugh at them. The animation is pretty good too - i'm not the biggest fan of their faces while drinking the potion, but it's just a small detail.<br><br>The fact is: the humor that makes these books so good is completely here. They didn't try to over complicate or anything, they finally made a Cesar that is clever and has a refined strategy, they grabbed what it was funny about the people of the village - the fish and metal owners fighting, the old guy screaming, the importance the chief gives to himself...we get to see a few village fights in this! even the gags of the musician were awesome, even thought they were predictable! I don't know, it just worked. I laughed my ass off, and you can watch it with your whole family. A great surprise i had. Go and watch this movie, i'm sure you won't be able to see it without laughing in lots of bits. Really great stuff.","user":"quaseprovisorio","rank":[10,10]}]