[{"title":"The story of my life..","rating":10,"date":"10 February 2019","review":"It's the story of my life. I was born in Bangalore in 1983 and I was adopted by an Italian family when I was almost two years old. My father told me that the nuns found me on the street, and they took me to an orphanage in Solur. My father made a very difficult journey to come and get me and we stayed a month in India before returning to Italy. unfortunately I do not remember anything of that world and for me it will be very difficult to understand where I was born but one day I will come back. I have to go back\nThis film change my life..","user":"maenloca","rank":[164,172]},{"title":"Not just another Oscar bait movie","rating":9,"date":"19 October 2016","review":"Do you know the feeling you get when you go into a film with no expectations at all or thinking it might be decent, and the film turns out to not only be good, but blows you away by how amazing it ends up being? That's LION, and if you've been watching films for several years like me thinking you've seen everything committed to cinema, it's a fantastic feeling to be proved wrong.<br><br>Let me explain to you exactly what I experienced while watching LION: Almost half of the film is in Hindi, which lends incredible authenticity to the story, not that BS where they have actors in which English is their second language speak English for the sake of sparing the American audience from reading subtitles (I'm looking at you, MEMOIRS OF A GEISHA, and every other Hollywood movie ever made). In fact, the entire first act takes place in India, where about 40 minutes of the film rides on the shoulders of a first time child actor – played by the wonderful Sunny Pawar – and it's one of the best first acts I've seen in years. Think of it like the silent first act of Wall-E; it feels like it can be its own film, yet the filmmakers do a great job connecting the story once Dev Patel comes on screen.<br><br>On top of that, the filmmaking is impressive. The script is fantastic, the cinematography is lush, the soundtrack complements the film really nicely, and the pacing is on point where it rarely feels like it's dragging, despite the story taking place over the course of 25 years. Every actor in here is also terrific in their roles. As stated earlier, Sunny Pawar makes a compelling lead for the first third of the film. If Oscars were given to kid actors, he would have a damn good chance at winning one. For the last two thirds, Dev Patel more than carries the rest of the film, giving an emotionally naked performance worthy enough to top his role in SLUMDOG MILLIONAIRE. Finally, Rooney Mara, Nicole Kidman, and David Wenham are ace, despite all of them having limited screen time.<br><br>In a time where diversity is being talked about more in the film industry, LION makes a compelling case for having diversity in storytelling. It's not about a guy meeting his girlfriend's parents for the first time. It's not about a group of friends going in a cabin in the woods. It's not even about a guy/girl struggling with the death of his/her father/mother/son/daughter/dog. No, LION is a personal story unique to South Asians growing up in India, and it's refreshing and easily one of the best films the year has to offer. Don't dismiss this as yet another Oscar bait movie put out by the Weinstein Company – it probably is one. But the film is much more than that. With a distinct vision from director Garth Davis, LION offers an enthralling story that deserves to be seen by everyone.","user":"moviewizguy","rank":[388,438]},{"title":"Lion","rating":10,"date":"10 February 2020","review":"Lion is based on a true story that is both incredibly uplifting and heartbreaking. Don't watch any trailers - go in blind. This film is a must-see.","user":"MR_Heraclius","rank":[51,55]}]