[{"title":"Unimpressive","rating":4,"date":"12 November 2015","review":"This is a movie about nothing. That's fine for a half-hour episode of Seinfeld, because it's amusing and entertaining. This movie is neither. It's humorless, tedious and somewhat painful to watch.<br><br>I like slice-of life movies. I don't need action. I don't need anything to really happen as long as I experience something I normally wouldn't experience in everyday life. This movie is anyone's very ordinary everyday life with some amount of coincidence and absurdity added. Rather than creating interest, though, these devices only prevent anything genuine from emerging.<br><br>Only one of the two main characters is believable, and both lack color and depth. That's a serious flaw in a movie where almost nothing happens. A transformation of sorts does take place, but it feels contrived. The events leading up to the transformation don't in any way suggest that it should occur, or why.<br><br>I'm giving the movie 4 out of 10 because someone might get something from it, and because there are a few brief moments that I liked. Also, the acting is at least adequate.The movie is inferior, but not horrible. Observing everyday life on a long walk would be a better way to spend 90 minutes, though.","user":"SteveJ_888","rank":[17,22]},{"title":"Miserable from start to finish","rating":2,"date":"30 August 2015","review":"While the trailer was slightly promising watching this movie and its story unfold was frustrating quite frankly sad. The couple is annoying and I don't care for any of the actors in this movie based on their performances except for Orlando Bloom. Is this what people in California are like? If you like topics like cheating, drinking, drug abuse and want to feel a general malaise wash over you then \"Digging for Fire\" delivers. If there is a \"spoiler\" it's that nothing really happens after all the digging. The weekend ends and the couple realize they still love each other for some reason. I don't understand why Mike Birbiglia was cast but he was slightly entertaining at first but seemed very out of place. Perhaps that was the point. I am a fan of his comedy and he's great in person on stage. The main character played by Jake Johnson comes across as a total jerk very early on and I generally didn't care for him. The wife seemed to be playing Helen Hunt but was at least somewhat likable. If Jake continues to write screenplays and making his own movies I hope they get better because this was absolutely horrible.","user":"kurtmw3000","rank":[15,22]},{"title":"Adult Coming of Age","rating":6,"date":"27 August 2015","review":"Greetings again from the darkness. If one is evaluating the most misleading movie trailers of the year, this one would definitely be a contender. Rather than the carefree, laugh-a-minute, hanging with buddies, offbeat comedy it's presented to be, it's actually a rather dramatic observation piece on adult responsibilities and the changes we go through with marriage, kids, jobs, and so on. Think of it as an adult-coming-of-age weekend.<br><br>Writer/director Joe Swanberg has become a festival favorite with such previous films as Drinking Buddies and Happy Christmas. He co-wrote this script with Jake Johnson, who also stars as Tim, husband to Lee (Rosemarie DeWitt). As the film begins, we quickly realize Tim and Lee are terrific parents to their young son Jude (director Swanberg's real life son), but are also a bit emotionally-strained with the whole marriage and adult responsibility thing.<br><br>A pretty amazing ensemble cast delivers a 90 minute acting seminar based not so much on plot, as two separate spousal adventures. Using a client's beautiful home as their own family retreat, Lee and Tim quickly decide to spend a weekend apart – so that Tim can finish their taxes, and Lee can hit up her parents for Jude's pre-school tuition. Of course, watching Tim work on his taxes wouldn't be much of a movie, so instead, he finds a rusty revolver, and what appears to be a human bone, in the backyard. With Lee and Jude gone, Tim invites his friends over for beer, snacks and help with the gun/bone mystery. This leads to appearances by Sam Rockwell, Chris Messina, Mike Birbiglia, Brie Larson and Anna Kendrick.<br><br>Lee's trip home permits quick exchanges with both of her parents (Judith Light, Sam Elliott), an ego-boosting interlude with Orlando Bloom, and a visit with old friends played by Ron Livingston and Melanie Lynskey. Ms. Lynskey's appearance seems especially fitting, as the tone of the movie is very much in line with her TV show \"Togetherness\" with Mark Duplass. The \"tone\" is related to people who aren't so much unhappy being married as they are curious as to what they are missing. These people haven't adjusted to the fact that life isn't always a party, and it's not really possible to recapture the carefree days with your old friends. Sam Rockwell's character is a stark reminder of this.<br><br>The book \"Passionate Marriage\" makes multiple appearances in the movie, and it's clear that the lead characters believe they are losing their self, rather than evolving. It asks the question about what is \"happy\", and just how crucial it is to be open to the changes life brings.<br><br>The classic song \"Li'l Red Riding Hood\" from Sam the Sham and the Pharoahs gets a prime spot during the film and is much more enjoyable than the slightly annoying New Age score that is overused through many scenes. This isn't really a mystery about the gun and bone, and it's not really about old friends or saving a marriage. It's mostly about coming to grips with life and taking joy in the good things  like a cute little boy and a trusted partner with whom to share each day.","user":"ferguson-6","rank":[10,15]}]