[{"title":"OK, but a missed opportunity","rating":5,"date":"9 February 2016","review":"I don't generally write reviews on movies on here. I was a big fan of the TV and donated to the kick-starter though so I was anxiously awaiting seeing this movie.<br><br>I am definitely torn on it. I don't agree with reviews saying it's completely horrible. It has some very funny parts sprinkled throughout it, and is watchable. But it's just so so so far removed from the spirit of the original show. <br><br>I am not even a football fan, but because of the way humour and football were mixed in the show, I loved it. I also feel the football side of things was an important part of the characters in the show, and obviously a reason the Goat House existed in the first place. I marked this as containing 'spoilers' because it's hard to not point out that there is literally about 2 minutes of football content in the movie.<br><br>It's basically a party movie. But it doesn't really do an amazing job at that either. Everything feels rushed and again, the humour is just a different type of humour than the show was. Take one of the better party episodes from the show, but stretch it out with quite a bit of filler for an hour and 30 minutes, and you have the movie.<br><br>Most of the really funny parts (to me) revolved around Thad and his dialogue. But it would be pretty hard to screw up that character. That's one consistent element from the TV show, and the reason I can still give this a 5 ratings despite my criticisms. He really does carry the movie in my opinion.<br><br>I guess it could have been much worse. But it's definitely not anything fantastic. I really think they should have stuck to their original formula more. The one that gained the show a rabid fan base the helped them fund this movie.","user":"torndownunit","rank":[23,26]},{"title":"After a long wait.. Not really worth it.","rating":5,"date":"11 March 2016","review":"As a big fan of the TV series I was looking forward to the continued adventures of Alex, Sammy, Thad and the other members of BMS. Now it's always a difficult task to tack on a stand-alone movie to a series (that ended almost 6 years ago), and whilst I admire the fact they took a crack at it, this movie fell well short of my expectations. The biggest problem I have with this movie is the complete lack of sports.. BMS was centered around the exploits of a college football team, and their relationship on and off the field. In Rise of Thadland (ROT) we're treated to one lackluster practice session and that's all she wrote on football. The rest of the movie centers around one completely implausible party (not enough money to save the Goat House yet a party that would make Mr Hefner blush). Speaking of Hefner, early on in the movie they set the tone that ROT has a different rating than the TV series (topless girls galore) but when they have the chance to really push the envelope they hold back. In fact the only full-frontal nudity is supplied by Sammy's character (I'm going out on limb here and say we were privy to Sammy's private parts WAY TOO MUCH!!!) The movie felt flat and disjointed and the use of returning characters Shilo and Radon was nothing short of criminal. No catch ups, reunion scenes just brief semi-cameos. Mmmm time to revisit the TV series and get back that BMS feeling.","user":"mrgone23","rank":[10,12]},{"title":"I'm mixed. They did things right and they did things wrong.","rating":7,"date":"3 February 2016","review":"I had high hopes coming in to this movie. The show was incredibly funny, and I was expecting something more like the show in this.<br><br>I expected to see Thad in the NFL, with possible NFL player cameo's. Instead we see a Thad who has somehow had his contract terminated without anybody noticing. Seriously, if the number 1 pick in the draft is cut, I'm sure Moran would have found out before he did. Also, getting stabbed by a rhino (and not being physically injured) is a lame excuse for Thad getting cut. It's just not realistic.<br><br>Don't get me wrong, they did things right: 1) Bringing back Radon and Shilo I was upset after season 1 when Shilo left and was smiling when I saw him pick up Alex. By that time in the movie, it was a much needed cameo. I wish it had lasted longer though, as he is only there for a short amount of time. When it comes to Radon, he didn't even have a line until the last scene. Radon was hilarious in season 2, and would've loved him to resurrect DREAMS maybe. 2) The comedy was stepped up in some parts. In the first 20 minutes or so, it is hilarious. Thad's interview was maybe the funniest part in the movie. Thad's character alone was funnier than I had remembered. Him tracing his drawing of Thadland is genius. 3) The roles of Larry, Donnie, and Harmon Harmon did what he did in the show, Larry was coach, and Donnie is gay. All of these story lines were very funny to see pan out and they did a good job. 4) Bringing back Mary Jo. Not really sure why she disappeared in Season 3, but I was glad she was back. 5) Dick-Dawg By far the funniest character for me. Everything he did was hilarious.<br><br>Things they did wrong: 1) NO FOOTBALL This is the movie's biggest flaw, as there is close to no football in the movie. BMS is not BMS without football. 2) Coach Daniel's role I liked it at first, but his role kept getting smaller. And without his guy Jon Jon, there is no fun in him. 3) No Jon Jon or Debra. Jon Jon is a BMS classic and was sad to not see him there, would've liked to see Debra there as well. 4) Thad's death plan I'm not really sure what actually happened towards the end of the movie. Thad was carrying a loaded gun which first made me think he was gonna shoot himself when he mentioned him in heaven. He then went down with the Goathouse and presumed dead. Don't worry, he is not dead. He is resurrected as Mr. PoonTang somewhere far away (in a ridiculous looking wig and mustache which made me spit out my drink it was so funny). 5) The role of Sammy We saw Sammy nude way too many times in this one. Just because you can, doesn't mean you should. He didn't play a big enough role and turned into a bit of an animal when he ate Billy the Goat. Then he tried to beat up Dick-Dawg which was useless. I would have been okay with Dick-Dawg leaving him there for dead. 6) Different Goat House Not sure why it was different.<br><br>Overall it was enjoyable and funny. I really hope the show comes back though.","user":"wbullitt","rank":[16,23]}]