[{"title":"Eat More Fish!","rating":7,"date":"26 March 2017","review":"TSUKIJI WONDERLAND. Viewed at CineMatsuri 2017. Subtitles = eight (8) stars; voice-over narrative = three (3) stars. Part documentary, part commemorative, and part propaganda, Director Naotaro Endo (who is also credited as writer and editor) provides a long overdue detailed examination of the operations and subculture of the world's largest wholesale fish and seafood (and some fresh-water food) market located in the Tsukiji area of central Tokyo. The market has been in operation for 80 years or so at different locations, and may move yet again to the Toyosu area of Tokyo depending on the politics and cost of decontaminating the Toyosu site (stay tuned). Endo provides close ups of the many auction halls for major types of seafood (there is even one dedicated to sea urchins) not seen on the standard 3:30 AM tourist tour (which is limited to tuna auctions). The halls form the wholesale core of Tsukiji which is almost literally surrounded by wholesale/retail shops and seafood (especially sushi) restaurants jammed with shoppers who demand only the freshest of the fresh. This enormous market place is strictly a nocturnal and early morning phenomenon; by noon the place is pretty much deserted (except for Neko!). The Director documents (repeatedly!) the informal chain of trust from wholesaler to chef/retailer that exists to help ensure that seafood consumed is as labeled (unlike other places like the USA where seafood type is often an intentional mystery). But the over-populated trust chain comes at a cost; seafood is not cheap in Japan. Surprisingly, most sushi chefs (including the rock-stars) do not usually select their ingredients personally, but rely on middle men (and a solitary wholesale women?) to do it for them! Endo keeps up a drumbeat through out the film that Tsukiji middle men (ubiquitous wholesalers and \"intermediate\" wholesalers) are absolutely vital to the fish business which includes never-ending testimonies from chefs and retailers. Middlemen interviews often contain words to the effect that they are not in business to make money, but to socialize! Nonetheless, as previously noted, seafood is expensive, and one suspects this is, at least in part, due to just too many middle men. The Director's film is not for the squeamish. It features many scenes of live fish being sliced and diced as well as implying that the raw seafood you consume in restaurants may not be quite dead yet (but super fresh!). Endo does not address much in the way of environmental issues like ocean contaminated sea food (such as reports of high mercury levels in yellow-fin tuna) or what happens to the omnipresent used Styrofoam boxes (I have often seen used boxes piled as high as buildings!). The Director's objective is to also commemorate the Tsukiji market before it declines further (business continues to drop and is down significantly in recent times) and is relocated to Toyosu. The last quarter of Endo's film is mostly propaganda meant to counter current culinary and social trends in Japan (and elsewhere). Fast foods increasingly discourage the time-consuming chore of preparing home-cooked seafood. The popularity of vegetarian diets is accelerating. A new generation is ignoring their \"seafood heritage\" in favor of (less messy and more \"respectable\") office work. The Director gets carried away on this theme by including scenes of grade school luncheon menus and food preparation (which, of course, feature fish or--according to interviewed school authorizes--should do so). The use of early cultural conditioning to eat fish is clearly implied to be an absolute \"imprinting\" necessity! Subtitles are very good. Translations identifying the interviewees are co-located on the left and right side at mid screen. Voice-over narrative at the start and end of the film sounds like an after though. It is anemic and does not fit well with the level of energy conveyed in the rest of the movie. The theater was packed for the screening at CineMatsuri. WILLIAM FLANIGAN, PhD.","user":"net_orders","rank":[2,2]},{"title":"Amazing Tsukiji","rating":9,"date":"10 October 2016","review":"Tsukiji Wonderland is a documentary that will amaze you with the awesomeness of all the people working at this fish market. I had seen some documentaries about Tsukiji on TV before, but they focused on the fish auction. Tsukiji Wonderland, on the other hand, shows you the complete process including before and after the auction – from the arrival of the fish at the market until the fish being served at restaurants as sushi. The areas where visitors are not permitted are also filmed, so it is really interesting to watch.<br><br>The film centers on the intermediate wholesalers at the market. It shows their incredible knowledge about fish and how significant they are in delivering the best fish to the customers which include top-notch sushi restaurants. I have just learned from this film that fish taste different based on the season and even how they got caught! Their knowledge about fish is just amazing.","user":"Aimar_the_hobbit","rank":[2,2]},{"title":"I like it!!!!!!!!!!!!!!!!!!!","rating":9,"date":"3 May 2018","review":"Fish Fish Fish Fish Fish Fish Fish Fish~~~~~~~~~~~~~~","user":"i-21188","rank":[0,1]}]