[{"title":"Unique but flawed one-room drama","rating":6,"date":"28 March 2016","review":"This film is certainly a breath fresh air in its genre. The execution is very unique for a full movie but even it you disregard that, it can stand on its feet as one of those \"small group of people stuck together and they have talk to figure things out\" sort of dramas. On the other hand if you expect a serious horror, you might be disappointed. This is about creating tension by exposing secrets at a figurative gunpoint. Not about scary supernatural things or jump scares. In other words the horror is in the theme, not the presentation. If that's what you are after it's as interesting and surprisingly satisfying story.<br><br>In terms of technique, the film is presented as Blaire's computer screen and this allows for the kind of multiple media (Skype, YouTube, Facebook, etc) storytelling that's usually limited to alternate reality games. It enables the characters to communicate each other privately which would be impossible if they were physically in the same room. It also means that every time someone is in trouble the helplessness of the others adds to the drama. Not all is perfect though. There are some cringey parts related to the scene, like Ken's anti-Trojan program looked about as authentic as the virus uploader from Independence Day and when you consider that Laura is not really a hacker it makes zero sense to find hundreds of infected files on a damn OSX! The question \"what is a troll\" and the answers were equally embarrassing in this day and age. The corrupted video compression that plagued the Skype calls served little purpose. It signified nothing and it was way too random. Usually effects like this exist to telegraph some \"presence\", but here the corruption started way too early. Another downside is that the cinematography was even more non-existent than with the usual found footage films, because it's face-time all the time.<br><br>They used an interesting technique to bring in music which is usually absent from found footage: Blaire has a Spotify player running in the background. Unfortunately this excellent idea was way underused and when it was used it was very on-the-nose. If you've ever watched an ARG like EveryMan Hybrid, where (distorted) music is used to communicate subtext or hidden messages you know what a missed opportunity this is!<br><br>Overall it's worth a shot. If you only watch films you might even find this ground breaking. But let me assure you - there is nothing here that hasn't been thoroughly explored by various web series you can find freely. Sadly this movie is another instance of old media trying to play catch-up with new media and not quite getting it.","user":"DAud_IcI","rank":[9,9]},{"title":"DHKR: Unfriended- \"Skype-net Demon\"","rating":5,"date":"12 May 2015","review":"Unfriended isn't about killing your most hated adversaries over a ghost-possessed computer programming. It is, however, about a possessed computer screen killing the most idiotic and despicable people in the worst ways possible, so that warrants a recommendation in my book.<br><br>The story is rather simple; on the anniversary of a bully's death, four to five of the most disgusting teen \"bros\" and the sort get up on Skype doing Christ knows what you do on the Skype before the Skype starts to not act like the Skype. Did I mention Skype is in this film? 'Cause it is. Anyway, the ghost of the bully posses the internet and instead of ruining the lives abroad and giving Miguel Arteta and Lily James the glorious TMZing of their life, she instead just goes and psychologically tortures each worthless waste of life one by one. <br><br>What makes the film a lot better than most of the watered down Found Footage films is that both A) Each of the human protagonists being assaulted by the ghost of 17-year old Skynet girl is a no-good scumbag you actually want to see perish in the worst way possible, and B) The film's central theme of cyber bullying being a harsh evil of our own making gives this a terrifying feel that seems oh so close to feeling real. If not, well, the ghostly Skynet girl part of it.<br><br>Well, those of you who only want to see the film for reason A) will be glad because the film certainly delivers in that. However, I appreciate an actual moral that genuinely feels scary, much like those old PSAs about drugs, nukes, and texting while driving. And the fact that our killer ghost is hidden behind the veil of an anonymous user with a generic, imageless face hammers in a real dreadful sense, stating that anyone can do this, anyone can cyber bully and anyone can turn your life upside down. <br><br>However, near the end, where we're losing the amount of people to kill, the story noticeably sinks into oblivion and becomes \"just another Found Footage Horror film.\" Complete with a liar's subplot and an ending that, while I'm trying not to spoil it, ruins the message and any sense of dread. So, if you want to watch Unfriended, be sure to either the leave the theatre near the end or push pause on the DVD remote before turning the DVD player off.<br><br>Final Results: 2 and a Half Stars- C-Ranking","user":"Darkhorse_Knight","rank":[19,24]},{"title":"Unmovie","rating":2,"date":"13 September 2015","review":"First I wish I could give this a lower rating 1 simply does not reflect how bad this film is, I wish I could use another word as it is simply not a movie or film. Ten minutes in and the only horror involved was my realisation that the whole film was teenagers screaming as they skyped each other. Laughable plot, girl gets s### faced at party and then s#### herself which is filmed. Girl kills herself, girl haunts their skype chat and each one dies, film over. 82 minutes of watching what at times appears to be an instruction video that appear on the web of how to use a piece of software, other times you are simply reading what someone types, how this cost a million is a bigger mystery than who shot JFK, it could have been shot over a day. There are films were I have got up and walked out only to find I am watching at home and I am standing in the garden in the cold pouring rain which is more preferable than watching the rest of the movie. This film makes them look like Citizen Kane, this by quite a distance is the worst I have ever endured.","user":"Saiph90","rank":[53,79]}]