[{"title":"My Wife Hated it I loved it.","rating":9,"date":"18 October 2015","review":"Yes, as many other reviewers have eluded, the movie can be a bit dry. My wife got lost in the message because she lost interest rather quickly. It wasn't until I explained the message the movie was trying to convey that she seemingly became more interested.<br><br>**spoiler** Watch it until the end, the message is rather powerful. I specifically liked the ending because (Sasha) Stanley's wife allowed herself to fall in the same class when the nurse made her fill the paperwork while Stanley is having a heart attack. In this instance, I felt like I would have called BS and told the nurse to get a doctor ASAP, instead of calmly filling out the paperwork like she was doing. But then again, that's exactly the message the movie was delivering, that we easily follow orders without question even against what we think is right.","user":"ryn-06139","rank":[55,72]},{"title":"Very factly...","rating":16,"date":"16 October 2015","review":"This film is particularly surprising. It's very interested in many of the facts of the real life obedience experiment. In fact, one could even argue that it seems to be very dry and non- climactic. The docudrama, of course, is restrained and doesn't overdo anything with large dramatizations of events and beats. I can also very much see many people getting bored with it however. Saarsgard is really great, totally inhabiting and creating that version of Milgram. Glad to see Winona Ryder on the screen again. Overall, it is very subdued, but it is a great introduction to the experiment that really shows as much as we can learn about what motivates people to commit such crimes.","user":"Red_Identity","rank":[46,61]},{"title":"Fantastic","rating":8,"date":"24 October 2015","review":"This movie gave a great insight into human nature and so did the experiments. Yes it was a tad slow but it only felt like that to me after I had watched it. I was immediately drawn in by the whole setup of the experiment and with the progression of the rest of them. This won't get anyone's heart pumping or racing but nonetheless I was glued to the screen with what this movie was trying to show me. I was so fascinated by the whole idea of it, that putting up with any of the 'slow' parts seemed quite easy. If you're in any way interested in human nature and how or why people could bring themselves to do certain things, you'll definitely appreciate this film.<br><br>I didn't know anything about this man or his experiments but I always wondered about the very same things he did in regards to the tragedy's he spoke of and others. How can people slaughter others or commit heinous acts, bring themselves to do these things and then simply claim they were only the messenger? I believe it's definitely worth a watch to anyone.","user":"pjr235","rank":[34,47]}]