[{"title":"Stupid plot, Stupid dialog, Disconnected sub-stories","rating":1,"date":"1 September 2015","review":"This movie is almost worth watching just to see how ridiculously bad it is.<br><br>Every 3rd word or so is an F bomb. That wouldn't be a problem if there was some kind of reason for it or if it were in context. But it's not. It's like the director just said \"Throw in a lot of F's just to shock the viewer\".<br><br>Catholilc priest is a sniper hit-man. Seems totally out of context to the movie. But there doesn't seem to be much \"context\" to the movie at all anyway.<br><br>Two guys playing high stakes chess for some kind of document that might be something like \"Immortality\". The \"Devil\" guy that loses the game has thugs with guns that can't beat a chick with a samurai sword. So after those thugs get beat up he calls on his \"back up thugs\" which consists of people in bathing suits wearing devil Halloween masks. Needless to say the devil aspect has no context to the movie either.<br><br>Chick flies a Robinson helicopter with something like a sailboat tiller in reverse. Then in another shot she has some kind of steering wheel.<br><br>SWAT team...Couple dozen cops can't shoot a guy standing in the open on the roof. In all fairness, that guy, with his automatic sub-gun, can't hit any of the cops either. Cops fail to notice the bad guy sniper on the roof, the priest sniper in the building across the street nor the bad guy getaway van with two thugs parked in plain view.<br><br>None of the actors seemed like they had any lines. It's like some director grabbed anyone off the sound stage and said \"OK, sit here, pick up the phone and say something like \"\"Put me through to Captain\"\"...\" The incorrect grammar in my above actual line was deliberate. It's the actual line.<br><br>If the acting had been great, it would almost be like a really good parody movie, like \"Airplane\" or \"Police Story\" one of the Mel Brooks movies. But the acting sucked. The technical believability sucked. The continuity sucked. And the actors all looked like someone they rounded up at the last minute and offered them lunch if they'd be in the movie.","user":"LumpyMusic","rank":[39,46]},{"title":"WARNING!!...Do Not Touch","rating":1,"date":"3 September 2015","review":"This rubbish is so bad that I was not going to write a review, as I did not think I would be able to put how bad it is into words.<br><br>However, I felt that it was important to warm my fellow humans, and so decided to try.<br><br>If I said that a bunch of schoolchildren could do better, I would be insulting all schoolchildren everywhere.<br><br>If you compared this rubbish to the first day of an acting school course, you would expect that the lecturer would have gone out the back and committed suicide half way through, just to avoid the second half. 80% of the dialogue consists of the word f#ck....and all it's derivatives.<br><br>Not only is there no story, but what there is is so confusing as to be a health hazard. Do not even look for acting. It simply is non existent. Please, do not be duped by the inclusion of Danny Glover and Vinnie Jones. At this point, moviegoers must accept that if either one or both of them are in a movie that it is a very good reason to avoid it at all costs. They are not even trying to hide the fact anymore that they are simply selling their names to absolute rubbish, and are quite happy to walk away with a fat cheque, and could not give a damn about their fans. It is truly sad.<br><br>Please....please...do not be tempted to spend hard earned cash on this tripe, just so these idiots can laugh all the way to the bank. You will never forgive yourself for wasting precious time and money on the worst trash ever to hit the screen.","user":"kmichaelpm","rank":[30,35]},{"title":"The bottomless pit.","rating":1,"date":"3 September 2015","review":"Unfortunately no amount of f-words can save this immature and epicly sad excuse of a movie. We all have to pay the rent, I get that. Sometimes it just hurts to watch it happen. Checkmate tries to be so bad-ass it falls flat on its face from the very first frame. Disconnected plot, no character development, crazy amount of cuss words, words of wisdom outtro etc. The turkeylist goes on. How did Glover and Aston even end up in this mess? I would seriously think a seventh grader could put together a more interesting script. This is by far the worst film I've seen the last 10 years. We're not talking funny bad here either. Low budget just got a new low - and I'm not even gonna comment on the girl with the samurai sword.","user":"nyrn","rank":[12,13]}]