[{"title":"Not good but Not worst movie either","rating":5,"date":"5 March 2015","review":"First of all this is not a high budget movie and that can be seen. Still I have seen worse high budget movies than this one but it never reaches the level of good.<br><br>It is an action about saving the world from a newly created virus. It is seen before and same story as always.<br><br>What I like about the \"good\" characters are they are kind of ruthless and it is kind of hard to find out if there are any good characters at all. Acting is not the worst I have seen but you will not be impressed either.<br><br>Camera views are too much close ups for my taste but I can live with it.<br><br>Conclusion: This movie is okay if you are watching a movie while chatting or doing other stuff. You can easily live without ever seeing it. There is a lot better movies and I would rate it below average.","user":"sinful-2","rank":[13,13]},{"title":"So bad","rating":1,"date":"2 March 2015","review":"This movie is so morbidly bad, its not even funny. It feels like someone is trying to punk you and see how long you will last watching it. <br><br>Everything, and I cant stress this enough - everything - is just horrible in this 'movie'.<br><br>Casting, acting, writing, camera work, and music are so bad, its not even funny. <br><br>You can only cringe so much until you just press stop and you cant take this insult on your senses any longer.<br><br>I don't need any more lines to convey this message.","user":"sadfjlfdo24","rank":[15,18]},{"title":"Not just a war movie","rating":1,"date":"1 March 2015","review":"OK,I have to write a minimum of 10 lines, so here goes.<br><br>I wish I could review this movie in a word or two, but that's not possible.<br><br>Here are a few words that I could use.<br><br>Garbage, stinks on ice, very very bad, waste of time, one of the worst movies to ever have been made.<br><br>Acting...see above paragraph.<br><br>Direction, who knows. With a script like this, and the brainless actors, who knows.<br><br>Being a musician, I usually enjoy the back-round score. Here, our composer did the best he could with the trash he was given to work with.<br><br>It always amazes me that crap like this gets the bucks to fund it.<br><br>I guess our hero's all slept with the producers more than once.<br><br>The only enjoyment this vomit of a film gave me, is writing this review.<br><br>I hope this review lets you spend an hour and a half of your life watching something better.<br><br>Hell, with this movie, anything you watch would be better.","user":"largopiano1","rank":[8,11]}]