[{"title":"Art Influencing Life Influencing Art","rating":7,"date":"18 September 2015","review":"Just saw this at TIFF several nights ago. It was a welcome change as the movies I had seen up to that point were excellent, but very heavy. In math there is this concept of a complex number consisting of a real part and an imaginary part. Many things in nature cannot be modelled by a real number alone, but need complex numbers. So the analogy in life is that we have our imaginary life and visions and these in turn influence are real lives which in turn generate more visions etc. They both exist together and not separately. The movie is a mixture of film and animation and it works very well. Emma draws a character who directs a movie who's actor is writing a novel. They all interact and involve each other. Very amusing, nice mixture of Canadian and Brazilian humour.","user":"clarkj-565-161336","rank":[42,58]},{"title":"Great start, and then it sort of drifts downhill...","rating":6,"date":"9 September 2016","review":"As a \"prolific\" reviewer, I have found over the years that many IMDb members do not use these reviews to check out a film before watching, they prefer to see the film first and then up-rate the reviews that \"agree\" with their Pov, and down-rate those that don't. So, as a courtesy to those who have not seen this film, I suggest that rabid fans of this production who have already seen it, and are looking for validation, just stop right here.<br><br>That said, I didn't just like the first half-hour of this film, I loved it. Any movie that begins with the massively-talented and criminally under-utilized Alison Pill is automatically ahead on points. (She can do things with her eyes and glasses that many actresses cannot even do with dialog.) The fact that the setting for the opening scenes is a shop that makes sex dolls also was an interesting hook. I have seen a lot of movies -- arguably, too many -- but had never seen that trope before. Clever! As the story progresses, and Pill's character -- who makes sex dolls are a living -- is driven by a co-worker's callous comment to seek bigger breasts, well, again, clever and interesting and quirky as Hell.<br><br>So far, so good.<br><br>However, after a great beginning, the script takes a sharp segue into that whole \"life imitating art imitating life\" thing and, to be frank, which is the reviewer's job, none of that added to the power of the film, it only detracted.<br><br>To some extent, this reminded me of the classic 1976 Allegro Non Troppo (recommended if you can find a copy!!) where once again the story tries to define the thin line between reality and non-reality.<br><br>However in Allegro, there was a constant upbeat sense of joy and wonder to the film, which gave it power. In Zoom, all the cross-arcs -- the egoistical film director, the supermodel who simply wants to be respected as a writer -- actually remove power from the impact of the production.<br><br>By the end of the story, when Pill's character suddenly finds herself in the middle of a \"drug deal gone bad,\" I had to conclude this was a classic example of a good film which -- HAD THE SCRIPT SEEN ANOTHER FEW REWRITES -- could have been really great.","user":"A_Different_Drummer","rank":[23,31]},{"title":"Lovely movie with a very interesting premise","rating":9,"date":"25 June 2017","review":"If you're wondering how is it possible that this movie is so good and yet you have missed it, the reason is two-fold. One, it's a Canadian movie. Second, it is smarter than it is commercial, something that, ironically, is being touched on in the film.<br><br>The idea is quite fresh: this Brazilian model is writing a book about a girl that works in a sex doll factory and who is writing a comic about the man of her dreams who is a famous director directing the movie in which the lead character is the Brazilian model. The whole plot is a metaphor on the toxic loop in which we live our lives.<br><br>The individual stories were interesting enough, each touching on human vanity. Motifs like the role of the woman in society, our obsession with looking different from what we are, whether it is about the size of tits or penis or whether we are perfectly attractive and resent being seen as sex objects, and how the things we do in life come back to haunt us are everywhere.<br><br>I did like the film a lot because it was self referential while zooming in on the viewer and their own effect on themselves and everybody else. I recommend it highly.","user":"siderite","rank":[7,9]}]