[{"title":"Just the Facts Ma'am","rating":9,"date":"13 October 2018","review":"Gosnell: The Trial of America's Biggest Serial Killer. It's not the gross out propaganda film that certainly could have been. It's \"just the facts ma'am\" of a story of heinous killings that just happened to take place in a legal abortion clinic, but outside of anyone's definition of abortion. The movie is a thought provoking journey into a terrible crime that the media was afraid to report because of its political implications. Solid acting and screenplay conveys this bizarre criminal episode perfectly, without the frills or preaching.","user":"poortopp-17926","rank":[157,203]},{"title":"Boy was I wrong....","rating":9,"date":"13 October 2018","review":"I went to see Gosnell yesterday and expected to see a sort of anti-abortion docudrama. But instead I saw an excellently made taut crime &amp; courtroom movie performed by a cast of veteran actors. It was engrossing, intense, powerful and yet heartwarming, the kind of movie that arouses every emotion and leaves you with the realization that rarely have you been so enlightened and enriched by a movie. This is a must-see film, one that not only provides immediate reward, but the kind that stays with you for a long, long time. Superb acting, directing and story - a rare diamond in the rough that you have to see.","user":"pmjdjr","rank":[154,208]},{"title":"Chilling","rating":10,"date":"13 October 2018","review":"Regardless of one's feeling on abortion, I would hope that rational people would agree that killing a baby born alive is absolute murder. Dr. Gosnell, obviously, felt that once a baby was \"marked for death\" it was fine to kill it by any means necessary... His utter disregard for human life was simply horrific. <br><br>As for the movie itself, I thought that the actor that played Dr. Gosnell was excellent. Not only did he really look like him, he did an amazing job of subtly portraying a crazy person who thought he was some kind of hero to women in trouble. The movie was well-produced, had all-around great acting and kept me on the edge of my seat the whole time. I would highly recommend this movie to any audience of teenagers on up. If you see it, make sure to stay through the credits... they show photos of the actual crime scenes and the real people who were involved in the case.","user":"ugadawgfan-47499","rank":[110,147]}]