[{"title":"Thoroughly Enjoyed This Movie","rating":9,"date":"21 July 2017","review":"I was worried I might be disappointed by this movie because of the negative reviews, but that worry was ill-founded. I thoroughly enjoyed it from start to finish and thought it well-found the balance between absurdity, pathos and grit. <br><br>I could hear the literary voice of Stephen Fry throughout, especially in the outpourings of the protagonist. The words sizzled and danced and revealed a certain realistic sensitivity. <br><br>I am not associated in any way with anyone involved in the film.","user":"PutuNix","rank":[50,59]},{"title":"An Amusing Trifle","rating":7,"date":"30 April 2017","review":"A long time ago, our hero was a respected poet, but the muse has long ago abandoned him. Now he is a drunken theater critic whose high jinks, while amusing, are out of control and cost him his job.<br><br>A young woman hires him to look into a miracle worker, who happens to be our hero's godson. While a dyed-in-the-wool skeptic, our man needs the money and take the job. It's also a trip to his past, and he has to cross bridges that were burned decades before.<br><br>While the sum of the movie is much less than the sum of its parts, the parts are often quite witty. The lead is well played by the excellent Roger Allam.<br><br>The movie was taken from a book by Stephen Fry, of \"Blackadder\" and \"Jeeves and Wooster\" fame.","user":"reidandgenene","rank":[43,52]},{"title":"Horsing around","rating":6,"date":"21 July 2017","review":"A clapped out poet brings his powers of perception to an English country house acclaimed for its miraculous cures, and finds more than he bargained for ...<br><br>Lovely doff of the cap to English detective fiction that declines to avert its gaze into the nonsense of the convention. The theme of miracle cures is important, so the one scene of emotion toward the end matters a lot - I didn't feel it, maybe because the moment of death was never addressed thematically. Hey - it's a country estate, built on the deaths of others.<br><br>The pace and humour are good, and the hero is perfectly smashed and detached. The weakness is in the supporting characters - not the performances, but their drama and the necessity of their presence. No great turns or lines, and I guess that's down to the original writing.<br><br>Music and sets are gorgeous, editing keeps it clipping along.<br><br>Overall: Insightful and entertaining, not so dramatic.","user":"begob","rank":[27,34]}]