[{"title":"A Goofy Heist Movie that Veers Toward Darkness","rating":6,"date":"3 May 2019","review":"I don't know why the idea of Nicholas Cage and Elijah Wood starring in a crime thriller together is funny to me, but it is. &amp; for its first half, THE TRUST is funny. But what starts out as a silly neo-noir veers suddenly toward a darker realm as Cage's goofy Las Vegas police officer (echoes of his BAD LIEUTENANT role, but only echoes) reveals his cold-blooded determination to get at the contents of a secret vault at all costs, causing a rift to occur between him &amp; Wood's softer character.<br><br>THE TRUST is a heist movie, &amp; it's when the heist begins that the movie really starts to shine. It takes the heist in creative, unexpected &amp; funny directions, &amp; during these parts is an enjoyable &amp; engrossing film. The film wraps up way too suddenly, &amp; overall is quite forgettable, but for a good chunk in the middle it had a certain spark while these two ridiculous men dug themselves deeper into the hole they never wholly grasped they were getting themselves into in the first place. Cage is fun to watch, &amp; though more restrained than usual, his wild energy crackles from him like static off a bedsheet. The dialogue &amp; handling of situations is nicely offbeat, &amp; the script remains ontrack the whole way.<br><br>THE TRUST is worth a watch if you like neo-noirs, heist movies, or Nick Cage doing his goofy thing. Or, like me, all of the above.","user":"philipelliottrexy","rank":[8,8]},{"title":"So much potential flushed down the toilet...","rating":3,"date":"20 September 2016","review":"I really enjoyed the first half of the movie. I was thinking \"wow, haven't seen a good movie with Nicholas Cage in a very long time\". I also liked Woods in it. I loved that the movie started out funny/laid back and then developed into something rather serious... But the heist itself...oh my god...everything went wrong from there...<br><br>SPOILER ALERT<br><br>1)You don't plan to rob a vault and get scared halfway through just because there where some guns in the same location, are you kidding me?<br><br>2)You don't give your hostage a mobile phone --&gt; ARE YOU F*%$ KIDDING ME?<br><br>3)You don't spend more time at the crime scene than necessary...why don't you just have a party there? (I'm sure nobody will come, cos you know, millions/billions of dollars aren't a big deal for their owners)<br><br>4)You don't let a vault like this being \"guarded\" by some old dude and a lil girl...<br><br>5)You never take your masks off during the heist...ever heard about (secret) cameras?<br><br>6)You don't read a script like that and decide it's gonna be good for my acting career...<br><br>DAMN, this was disappointing","user":"lar-78679","rank":[45,57]},{"title":"Cage And Woods Are GREAT Together!!!","rating":9,"date":"1 March 2019","review":"This movie highlights what really talented actors these two guys are and why we've enjoyed watching them for so long!!!\nBut together these two really shine!!! Awesome chemistry and hilarious in an \"Odd Couple\" kind of way!!!\nI'm looking forward to watching this movie twice... oh yeah!!!... I already have!!!... three times to be exact!!!\nForget the bad reviews, these are the people who hate every movie!!!\nWatch it and just let it entertain you!!!.... It will!!!","user":"troydanielson101","rank":[7,7]}]