[{"title":"An orginal tale of mid-life self-discovery","rating":8,"date":"19 June 2018","review":"The Wife (2017) could be described as just another midlife self-discovery film, although with more originality and powerful acting than many. It can also be seen as a feminist essay about being true to oneself, a story of fabricated prestige in the literary world, and a tale of arrogant deceit that holds a marriage together. It's bigger triumph, however, lies in the way it blends all of these into a tense black comedic drama based on the extraordinary acting power of the duo Glen Close and Jonathan Price.<br><br>The core plot is simple: a long-term marriage full of simmering tensions is brought to the boil when the husband wins the Nobel Prize for literature while 'the wife' looks on in smiling silence. Professor Joe Castleman has become accustomed to being feted for his literary greatness and has even been described as a reinventor of the novel form. The opening scenes are emotionally supercharged: a phone call from Norway in the middle of the night, joyful close-ups on Joe and Joan hearing the news, each processing it in completely different terms. Joe's arrogance is elevated by the news, while Joan's tolerance for his deceit, philandering, and belittling her as 'the wife who does not write' inches closer to breaking point.<br><br>The news of his Prize triggers interest from a persistent freelance biographer who begins asking questions about Joan's own early writing career and the authorship of her husband's work. Marital tensions and professional conceits intersect and escalate as they approach the Nobel Prize ceremony, with their secret dangerously close to becoming public. Framed as a domestic relationships drama, the narrative moves slowly in a dialogue-rich film that records the personal journey of two intelligent and articulate people travelling in different directions.<br><br>So much can be conveyed through a husband's use of the phrase \"The Wife\". It might be used as a derisive avatar or a cartoon nagger but not a respected equal. It is at this level that The Wifeexerts its power to show how patriarchy can entrap a willing victim until its innate fragility is exposed. Yet a simple exit from the marriage is not easy, as Joe and Joan really love each other. Too many dramas immerse such themes in clichés and hyperbole, but a tour de forceperformance by Glen Close takes this one to different level.<br><br>Excellent filming, a clever script, uncluttered editing, and a nomination-worthy performance by Close gives this film a clear voice for the demographic it addresses. The feminist discourse for older women speaks in a different filmic language than what is current for others, so this is not a film for all. But its laser-precise message is targeted at everyone.","user":"CineMuseFilms","rank":[181,210]},{"title":"Close is Simply Mesmerizing on Screen","rating":8,"date":"1 March 2019","review":"Methodically paced but an intense and complicated drama, where Glenn Close is just mesmerizing on screen. As other reviewers have noted, it's highly disappointing she did not win the Best Actress Oscar.<br><br>Jonathan Pryce and Christian Slater are also excellent in their roles, and Annie Starke (Close's real life daughter) stood out in her supporting role as the young Close character. Most able direction by Swedish director Bjorn L. Runge and superb writing of the screenplay by Jane Anderson, adapted from the novel of Meg Wolitzer.","user":"larrys3","rank":[33,37]},{"title":"Illuminating husband-wife drama set in the literary world","rating":8,"date":"19 August 2018","review":"A fascinating story about an iconic 20th century author and Nobel Prize winner's ceremony in Stockholm is told from the vantage point of his faithful, devoted wife who first met him as one of his students decades earlier in Smith College. Based on the novel by Meg Wolitzer, it is a layered, challenging character study wonderfully brought to the big screen.<br><br>Three tremendous performances anchor this film. Glenn Close is compelling and sympathetic as the painstakingly complex protagonist wrestling with long-suppressed demons and a conflicting sense of fidelity to a marital relationship that requires an extraordinary level of compromise. Jonathan Pryce is excellent in a viscerally narcissistic role that becomes more and more appalling in his character's audacity as the storyline develops; you might wonder how this man lived with himself. Finally, Christian Slater is sharp as an unctuous but quietly ruthless biographer who has set out on an investigation- a textbook example of an odious character with righteous ends. All three actors contribute extremely well, even though Glenn Close's perspective is front and center all the way.<br><br>This film can be difficult to watch at times, but it's a powerful story that is well-presented and executed. It's a film that might warrant viewing a second time to evaluate the characters' dynamics to fully appreciate the heart of the story. Enthusiastically recommend.","user":"PotassiumMan","rank":[67,81]}]