[{"title":"A Bit Shaky","rating":8,"date":"7 July 2016","review":"The two glaring flaws to this film are its overuse of first person shaky cam, which while arguably immerses you deeper into the situation and action of the film, also quite simply makes you feel sick, and its appeal to generic audiences, as can be seen in the ridiculously broad title. However, if you can look past these two aspects, as well as the occasionally questionable special effect, then there is a lot of positive things to say.<br><br>This film has a great story, it makes sense and is carried out in an organic way, while still ticking all the usual zombie-survival boxes that have become the staple of this genre. The acting is pretty great in my opinion and conveys the right tone for each situation, my only complaint being here that with only four characters for most of the movie there is something lacking in personal interaction and team dynamic, although what there is is good and solidly written. There is also a rich world created within the framework of the film, although it is shown on a small scale, and this could easily be fleshed out more if there is a sequel at some point.<br><br>Overall I found myself really liking the simple and solid aspects of this film in the acting and storytelling, although the constant switching of first person views might be enough to put some people off entirely as it does get a bit nauseating after a while. Still there is a lot of good here, especially for fans of the genre, most of us being used to much lower production values and less cohesive plots. For non-fans it might not come across so well.","user":"scythertitus","rank":[22,27]},{"title":"Decent Zombie flick.","rating":8,"date":"20 June 2016","review":"Apparently everyone on IMDb thinks they're Roger Ebert now. Why anyone would give this film such a horrible review is beyond me. It's not the greatest zombie film ever made sure but it's better than 1 star. There's a few noticeable goofs as well, but overall it's a unique and entertaining movie. If your a huge fan of the zombie genre it's definitely worth checking out and even possibly adding to your collection. <br><br>I got it on blu ray and like with any zombie film was skeptical if I would enjoy it or not, and I did. I probably wouldn't sit through it a second time and I only gave it 8 because of all the crap reviews that this film definitely did not deserve. Otherwise I would have rated it a 6. If your looking for some Hollywood blockbuster like world War z you'll be disappointed for sure, but if your a huge fan of zombie flicks and just looking to be entertained for 90 minutes give it a shot.","user":"christopherdmartin84","rank":[24,35]},{"title":"First person shooter stupidity","rating":2,"date":"3 April 2016","review":"There is no good plot to this movie. In addition to that, the First person shooter camera is really irritating in movies.. (you hear me movie makers?)<br><br>It looked like the director was just trying to make use of every possible content in a short time, so nothing was well executed. <br><br>It was panic everywhere and none of the character seemed to be doing its job properly (acting was good, talking about characters here). Though it had been long time the virus had started, they should have gotten bit used to it, but it didn't seemed like it. They were making every false call possible e.g. when any person gets out of the bus in middle of a town full of infected people, you close the damn door and wait for that person to come back. Instead they decided to keep it open and wait.. knowing none of them knows firing a gun properly. <br><br>Save your time and don't watch it. You will get aggravated on character's stupidity and wont be able to enjoy movie anyway. <br><br>Thanks for reading.","user":"adeel-76779","rank":[62,101]}]