[{"title":"FAT PIZZA vs HOUSOS - It's Big and its Cheesy!","rating":12,"date":"12 June 2015","review":"I recall long ago, Mondays in high school were always the best, as Fat Pizza followed SouthPark. At first, it was simply \"that insanely funny show that comes on after SouthPark\", but as it kept going, it didn't take long for it to turn into an obsession for many of my schoolmates. I liked it, but didn't follow it religiously. Paul Fenech, the man behind the madness, starred as pizza delivery guy Paulie. After Fat Pizza finished up, Fenech was back with a blindingly funny satire of courier work, which I found especially funny having worked as a courier myself. Most recently was Housos, a show about the fictional yet disturbingly realistic dole-bludger suburb of Sunnyvale, where all the residents have trouble speaking a sentence without some sort of expletive and are allergic to working for a living.<br><br>What is my point then? Paul Fenech was the brains behind all these shows, and in this absurdly over-the-top film, the Fat Pizza crew from meets the Housos in side-splitting ways. There is nothing deep here, so don't look for it. There is nothing subtle here, so follow my previous advice.<br><br>The first five minutes show the boss of Fat Pizza – Bobo – going to jail for assaulting a health inspector with a chainsaw. Yes. The movie begins with his release from prison 15 years later, into the comforting arms of his mother, despite the fact he is at least forty. After Bobo has been ripped off by a real estate salesman, as the rent is too high in his old neck of the woods, he ends up with a new Pizza joint located in Sunnyvale – home to the unemployed, perpetual dole bludgers of Housos.<br><br>Not long after Bobo has his new pizzeria established (one that doesn't do margaritas You PANSY!), we are immediately introduced to one of Sunnyvale's residents Frankie (one of two characters played by Paul Fenech). As Frankie is walking down a suburban street, he sees the Premier doing a media gig. So what does Sunnyvale's most wanted man do? He slaps the premier with his thong (a flip-flop for you non-Aussies!).<br><br>This starts a truly absurd and hilarious chase involving a stolen courier van, a disabled person giving Frankie a ride on his motorised scooter, a chopper joining the chase, and finally a go-kart that Frankie has hidden in a drainpipe for such an occasion. All this in the first ten or fifteen minutes, and it doesn't stop there as we are introduced to more of the absurdly yobbo Australians who live in Sunnyvale, such as Dazza and his on-then-off-again partner Shazza. Their older relatives provide laughs as well. Oh, and a bong gets dismissed for normal smoking purposes after being used in an Inappropriate way.<br><br>This may be great for an old time fan like myself, but it is great for newbies too. Of course some old jokes are revisited with a new spin, but new material is here aplenty. The movie doesn't for a second try to take it self seriously, winking an eye to the audience many a time. The focus is almost solely on the humour, and it delivers plenty of Fat Pizza in that department. There are subplots to follow if you feel up to following them, as they are fodder for yet more laughs, but it isn't really needed to enjoy the film. They just make it funnier.<br><br>Some of these subplots – if you could call them that – include excessive force used by Australian police, which is exaggerated but certainly an issue in Oz today, as well as Centrelink, often spelt with a 'u' to replace the 'e' by many of us. It is the Australian equivalent of a Welfare Office I guess. We also see the hiring of refugee workers, the obsession with Occupation Health and Safety codes by government employees (which is SPOT ON!), as well as the abundance of crack-heads running around streets, which unfortunately is again spot on, especially in my hometown of Adelaide. I must say that for such a chaotically funny movie, there is actually a surprising amount of subplots that are funny in themselves and are easy to follow.<br><br>Another great part of FPVH is that it covers Australia's multicultural population – with offensive stereotypes aplenty, political correctness thrown directly out the window. Despite this, it is honestly hard not to laugh. Especially when a biker gang is led by a smaller person with serious temper issues and a loud, abrasive yell.<br><br>This introduces the various characters efficiently enough that their personalities are well-established for even a new viewer, who I watched this with. He loved it. I have a slightly biased perspective, having loved everything Paul Fenech has touched, but goddamn, this is one supremely funny movie. It is perfect mix of everything created by Fenech before this, and is directed by (and of course starring) him. Appropriate.<br><br>This is pure, unfiltered Australian comedy at its most unrestrained. Have a watch, have a laugh, learn some funny stuff about our crazy world! The film makes fun of our culture and exaggerates it with reckless abandon, but also has some serious points lying beneath the anarchy if you want to dig for them.<br><br>www.epilepticmoondancer.net <br><br>STALK ME ON TWITTER! :) @epileptimaniak","user":"punishable-by-death","rank":[4,5]},{"title":"Pretty disappointing stooges","rating":4,"date":"6 May 2015","review":"It sounded like gold when you first hear Paul Fenech was combing his shows \"Fat Pizza\" and \"Housos\" together. In a story where the pizza boss Bobo is released from prison years after he went nuts at the end of the Fat Pizza shows run. He wants to open his pizza shop up again, only rent is now too high in the old neighborhood, so he finds a new location in Sunnyvale (Houso country). However with the stooges working for him, they once again go back to old ways and begin sneaking drugs into the pizzas and when the bikers find out about this, they wont allow anyone to move in on their territory. This begins a gang war between the pizza shop boys, who contain members of the Sunnyvale Assassins, and it's on between the Bikers and the S.A. Paulie also happens to return and he looks just like his cousin Frankie, who is the #1 man on the cops most wanted list. With a few mix ups of identity, Paulie and Frankie begin a feud of their own, and before you know it everyone is wanting to thong everyone else. Apart from the bogan's who just stand around and watch from the sidelines.<br><br>Most of the cast is back for this one, however it's obvious a few members where either doing other projects as well, and had limited time to be in the film, or they are just sick of doing this thing. Big surprises are Dazza only plays a small role, Shazza seems to be around but not a major player and Kev doesn't really pop up until the finale of the film. Very surprising, yet also something disappointing that the crew you come to love and laugh at aren't really involved that much in the entire project.<br><br>Even more disappointing in the re-use of old gags and how much it felt like moments of \"We've seen them do this before\" kept popping up everywhere. Nick Gionopilos even makes a return as the cabbie, however this time he's using the same exact lines from a character when he made The Wog Boy many years ago. I don't know if he thought people might not remember that movie, or if he thought it would be funny if he recycled the same lines for himself... but whatever the reason, it didn't work, and was a complete waste of time being in the movie.<br><br>A few new gags, but not really enough to say I would ever want to see this thing ever again. I was never a fan of Fat Pizza, but I did like Housos series 1 and 2, and I'll re-watch the series, but just like Housos vs Authority, this one won't be something I even pick up just to add to the collection.","user":"MikeHunt1075","rank":[4,7]}]