[{"title":"What's valuable about this","rating":7,"date":"21 May 2016","review":"...is that it shines a light on LBJ's very significant accomplishments (civil rights, voting rights, Medicare, Medicaid) which were largely wiped from my generation's collective consciousness. This film ends with Johnson's sweeping election victory in 1964, but by 1968 he became one of the most despised presidents in history for his escalation of the war in Vietnam.<br><br>For those of us who lived through this era, this sort of biopic is a hard sell. We remember all too vividly the reality of Johnson, Humphrey, King, and all the rest. It's petty to remark that Dr. King didn't have the movie star looks of Anthony Mackie. Or that Hubert Humphrey was a lot plumper than Bradley Whitford, and his high pitched staccato speaking voice beyond Whitford's reach. Other characters are done either spot on or way off. I suppose no one could capture the essence of Sen. Dirksen without coming dangerously close to Foghorn Leghorn. But Bob McNamara looks right, and the always reliable Stephen Root brings the right manic intensity to his J. Edgar Hoover.<br><br>Ultimately it's Bryan Cranston who makes the sell. He's utterly convincing. We feel we're seeing LBJ on screen. Only occasionally does the facade crack to show the actor underneath. But for the most part it's uncanny--if not a little eerie--how accurately he portrays Johnson.<br><br>The script is about what you expect for a biopic. The kind of exposition necessary to explain who is who and what is what. It's tiresome for those of us who lived through it, but a necessary evil I suppose for anyone under age fifty. And for those under thirty who seem to have got a college degree without knowing much about anything, this will be a useful primer on the early 60s.","user":"ekeby","rank":[55,72]},{"title":"Tour De Force for Bryan Cranston","rating":9,"date":"24 May 2016","review":"Bryan Cranston brings Lyndon Johnson to life in this absorbing real life drama focusing on 1964 when LBJ not only got a major civil rights bill passed, but set the stage for the 1965 voting rights act and the war on poverty. Cranston's portrayal is uncanny, and turns this made for HBO movie into a quasi-documentary. Cranston carries this movie and makes it one of the best television events of the year. The rest of the cast is excellent too but in some cases, the actors don't look enough like the characters they are playing: Hubert Humphery and Martin Luther King Jr., come to mind. The storyline is fairly well known to anyone who follows politics and U.S. history, but the behind the scene's maneuvering to get a very major bill passed makes for great story telling and LBJ was one of the great story tellers. The stories told by LBJ are the glue that holds this movie together. His poor upbringing gave him the resolve to do something about helping the poor once he got into office. And of course he saw first hand in his home state of Texas, the massive racism that prevented blacks from taking their rightful place in American society. No doubt LBJ could have been a candidate for Mt. Rushmore were it not for Vietnam which is explored in the movie but not in-depth. That should be a sequel. Melissa Leo is wonderful as Lady Bird Johnson, and Frank Langella is excellent as Senator Richard Russell. This is a must see movie. Cranston will be picking up more awards.","user":"bobzmcishl","rank":[27,36]},{"title":"Engaging and compelling historical political drama","rating":9,"date":"30 May 2016","review":"November, 1963. President John F Kennedy has just been assassinated and Vice President Lyndon Johnson (played by Bryan Cranston) is now President. One of his first acts as President is to reaffirm the US government's intention to pass the Civil Rights Act. This Act was drafted while JFK was in office and gives people of all races the same rights, including voting rights, access to education and access to public facilities. However, he faces strong opposition to the bill, especially from within his own party. He will have to use all his political will and cunning to get it through.<br><br>Incredibly engaging drama, showing the passage of a major and historic piece of legislation in US history. Quite an eye-opener: hard to believe that in 1963/4 there was such a huge North-South divide and that racism was so rampant. Also amazing to see that some of the strongest opposition to integration was from Democrats - the left-wing/right-wing lines were clearly quite blurred in those days.<br><br>Fascinating insight into the personality of LBJ. On the surface he seems like a man wanting to what is right for his fellow man. However, his motives are not always that altruistic, and his actions are often more driven by personal power than good intentions (which would be common to almost all politicians, I guess, so not such a huge surprise). Highly complex, we see what drives him, especially how his childhood experiences shape his motivations and thinking.<br><br>Quite balanced too. We see LBJ, warts and all: his temper, his treatment of staff and wife, his colourful language, what he'll do to win. He's hardly a saint.<br><br>Superb performance by Bryan Cranston in the lead role. He inhabits the character of LBJ.<br><br>A story that needed to be told.","user":"grantss","rank":[28,38]}]