[{"title":"Liar, liar, pants on fire at 21,000ft!","rating":10,"date":"27 April 2016","review":"Wonderful film about people at the bottom of the food chain standing up for their rights against the foreign companies and their own government who are using them. This is the story you never see in stupid Hollywood movies like \"Everest\".<br><br>Climbing Everest has become a huge industry where rich foreigners pay climbing expedition companies like Russell Brice's Himalayan Experience large amounts of money (up to a 100000 USD) to fulfill their \"dream\" to climb and reach the top of the mountain. The local Sherpas who are climbing experts are hired to take all the biggest risks and lay the path for the foreigners but are only paid a small fraction (5000 USD per climb) of what the company earns. The Nepalese government also takes a big cut (about one third) with out providing any benefits or insurances for the Sherpas or their families.<br><br>Russel Brice personifies everything that is wrong with this industry. In front of the camera he lies several times to his clients (the foreign climbers), about the Sherpas being threatened to have their legs broken by some of their own people if they continue climbing. He is basically trying to vilify some of the Sherpas and turn them against each other, instead of taking any responsibility when all they are doing is demanding fair treatment and payment. Russell also tells his clients that the Sherpas and their families will have nothing to eat if they don't climb which we later in the film see is simply not true. They have other sources of income and their families don't even want them to climb. I can only hope this guy goes out of business soon!!!","user":"carltellin","rank":[32,32]},{"title":"good perspective from the Sherpa POV","rating":9,"date":"3 May 2016","review":"Hard to say - what was left on the editing floor but, it appeared to be from the Sherpa's perspective. One theme which rang through to me was the old 19th Century Master/Slave, Explorer/guide, Great White Warrior theme. And yes, during one of the down time cooling off talks one of the climbers did ask who \"owned\" the Sherpa who was making the trouble. I have never been over there but to me it seemed to be the Sherpa/Climber relationship has grown from the original 1953 Hillary climb where the climber's held the upper hand and the Sherpa's were subordinate - this film documents the reconsideration of that previous relationship. So it is a worthwhile documentary which I think all interested in climbing will enjoy. Now, personally for me, it's another crack in the wall of white supremacy, imperialism, whatever you want to call it. The hubris of these climbers who \"brave Everest\" when everything is prepared, lugged, cooked, constructed, behind the scenes by Sherpas is sickening. Their indignity at the Sherpas who dare have an opinion is amazing. Their insensitivity to local loss of life is embarrassing. Using the white supremacy term is serious so let me explain further. There is a movement in Congree to make the Buffalo our National Mammal. Ludicrous. We Europeans wiped out the Buffalo - some for sport some for tongues, and most tragically because we wanted to starve/force the Indians to the reservations so we could steal their land. One of the most noble civilizations ever along with the Buddhists and we wiped them out because we had our Manifest Destiny. What we are/were looking for could be found in the Indian way of life we destroyed. Ditto for chapter 2: the black man. We rape and slave them right out of Africa and act like it's their fault when they are \"freed\" and try to adapt to be 2nd class citizens. So we put a black on our money and make the Buffalo our national mammal - all fixed? Sorry for the rant but we treat the Sherpas with the same European contempt.","user":"plparshall","rank":[25,27]},{"title":"Beautifully filmed story about Sherpa life and their struggle for recognition.","rating":8,"date":"18 April 2016","review":"Everyone knows that documentaries tell the truth. Well, at least somebody's version of the truth. On the one hand there are participative documentaries like Fahrenheit 9/11 (2004) starring its interventionist director Michael Moore, and on the other hand there are observational documentaries like Sherpa (2015) where the camera is the chief story-teller. Unlike movies, the doco aims for a higher social purpose and in Sherpa it is to show the world how the real glory of climbing Mount Everest belongs an exploited ethnic group in the mountains of Nepal. As historical gatekeepers for the Himalayas, their existence has depended on risking their lives so that Westerners and others can experience what it feels like \"to conquer Everest\".<br><br>Australian filmmaker Jennifer Peedom starts out asking why the traditionally friendly Sherpa guides turned aggressive towards tourists in the 2013 climbing season. The widely reported brawl was triggered by a single swear word directed at a Sherpa, igniting tensions that were simmering since Hillary was Knighted for his 1953 ascent while Sherpa Tenzing received lesser credit. In the middle of filming the brawl story, a massive avalanche claimed 16 Sherpa lives. Suddenly it is about the politics of an ethnic group demanding respect, no longer prepared to risk lives for meagre wages from an industry hosting thousands of tourists each year and charging summit climbers $75,000 – $100,000 for the privilege. The camera becomes a witness to tragedy, then grief that turns to anger and political activism. Audiences become judge in a case involving ethnic discrimination and the commercial exploitation of people who have been used as cheap mules. It's a complex dilemma with no easy solutions because the same commercial interests have done much to improve the lives of Sherpas.<br><br>The film shows political sensitivity in telling the story from the Sherpa viewpoint. Its great strengths lie in extraordinary cinematography and sound recording under the most chaotic high-altitude conditions a filmmaker can ever experience. The camera works skilfully across the visual pleasures of vast mountain-scapes to angry grief stricken Sherpa faces and frustrated tourist climbers, with a soundtrack of howling wind, crunching ice and hammering stakes that viscerally creates a 'being there' feel. Peedom lets the story tell itself without manipulative editing, and it is highly engaging while being informative about a world that few of us will enter. It is beautifully filmed and teaches much about Sherpa life and their struggle for recognition.","user":"CineMuseFilms","rank":[12,12]}]