[{"title":"How a Company Should Treat its Customers!","rating":8,"date":"13 February 2020","review":"When I saw the original trailer I was genuinely horrified in Sonic's design, like a person in bad cosplay. After the redesign many like myself felt the need to support this movie to honour the fan service and genuine care. I'm sure glad that I did. A funny movie, Jim Carrey was amazing like always and of course Sonic looked great. A very fun movie for the whole family.","user":"mamba_king","rank":[470,587]},{"title":"I'm giving it an extra star because they redesigned sonic","rating":8,"date":"16 February 2020","review":"Honestly this was a movie I was never really planning to see. I thought it was another cash grab at our nostalgia. But when the initial trailer came out with the original sonic, I partook in the hilarious and frightening memes and joined in on the criticism. When I found out that they were redesigning Sonic due to the backlash - I was shocked. I never thought a studio would listen to our voice, and oh was our voice heard.<br><br>So after I saw the second trailer I thought to myself, well, I guess I gotta go see it now. \"Put your money where your mouth is.\" If the studio took the time to do this for us then I will gladly pay my money to see this.<br><br>And I'm glad I did. It's a fun movie. It's not perfect by any means, but it's an enjoyable film for the family. I love the new Sonic, I love the cast, Jim Carrey is spectacular as always. It was a fun movie from start to finish. And it was really entertaining. I love the voice character for Sonic too, I think he fit perfectly. I would've given it a 7/10 but like I mentioned before, an extra star for caring about the fans and the audience.","user":"jennifercasco","rank":[246,306]},{"title":"Soooo much better then expected!","rating":9,"date":"10 March 2020","review":"Definitely fun to watch, and with the new redesign it works very, very well!\nRecommended, hoping it does well enough in box office performance for a sequel.\nWould LOVE to see that happen!","user":"dutchcomputerkid","rank":[34,41]}]