[{"title":"Shut Down Your Brain and Enjoy the Adventure","rating":7,"date":"9 April 2017","review":"When the Vietnam War ends, Bill Randa (John Goodman) and his partner Houston Brooks (Corey Hawkins) from the Monarch organization succeed to get the financing for an expedition to the recently discovered Skull Island from Senator Willis (Richard Jenkins). He hires the former Captain James Conrad (Tom Hiddleston) to guide the expedition; a group of soldiers under the command of Colonel Preston Packard (Samuel L. Jackson); and the awarded journalist and photographer Mason Weaver (Brie Larson). On the arrival, the helicopters need to cross a storm and soon they drop bombs on the forest to map the seismology of the island. Soon they are attacked by a huge gorilla called Kong that destroys the helicopters and kills part of the crew and scatter the rest through the island. The group commanded by Conrad meets Hank Marlow (John C. Reilly), a survivor from the World War II that lives with a tribe of natives. He explains that Kong protects the island and the natives from underground monsters and shall not be killed. But Colonel Packard is insane seeking revenge for his men that died.<br><br>\"Kong: Skull Island\" is a brainless adventure with several stupidities. For example, the number of helicopters in the beginning of the journey of Randa, Conrad and Packard is totally incompatible with the size of their ship. Bo pilot would dare to cross a storm like that in a helicopter. The attack of all the helicopters to Kong is absolutely imbecile. Most of the survivor's attitude are at least unreasonable. On the other side, the adventure is highly entertaining and the special effects are top notch. Therefore the best option to the viewer is to shut down the brain and enjoy the adventure since this is the purpose of this type of blockbuster. My vote is seven.<br><br>Title (Brazil): \"Kong: A Ilha da Caveira\" (\"Kong: The Skull Island\")","user":"claudio_carvalho","rank":[172,237]},{"title":"Unbelievably juvenile. Ridiculous story.","rating":2,"date":"17 March 2017","review":"Not even sure what to say about this one. Kong was 950 feet tall. And sweet. So sweet. Unless you threatened him or made him angry. Which they managed to do. I think pretty much anything that Samuel Jackson is in these days, must be avoided like the Bird flu. He is a compromised actor of extreme proportions, and will literally do anything for a buck. He is so tired. His routine is so old. Here he plays an army officer, who of course has no respect for nature, animals, or the earth. Hence the environmental statement. It is a statement that feels like it was written by a 5 year old. Hollywood being the nearly culturally bankrupt institution it is, seems to be incapable of a balance, nuanced, elegant statement of any sort. So, they keep producing this kind on inane garbage.<br><br>Why did 14 helicopter pilots, when faced with a 950 foot tall Kong, who has a wing span the size of several football fields, fly within swat range of this beast? Was it not possible they could have done any better than that? Does Hollywood really need to continue to insult us at every possible opportunity? <br><br>The only redeeming quality this movie had was John C. Reilly. His comic touch was all that kept me from walking out on this turkey. <br><br>Hollywood, you can do better than this. You need to stop catering to Chinese teenagers. This movie was terrible.","user":"latinfineart","rank":[530,881]},{"title":"Oh, boy.","rating":2,"date":"12 March 2017","review":"I want to start off by saying that I am not going to sit here and pretend to be above wanting to see a 100-foot tall ape shred through some giant lizards and whatnot for around 2 hours.<br><br>If you were worried that Kong would wait 40 minutes to show the action only to cut-away when the fan makes contact with the feces, then you can put those worries to rest because this giant hairy grump is in your face right off the bat.<br><br>I could immediately tell that this film wasn't about to shy away from what we all craved so dearly in 2014's Godzilla, because from the first gunshot onward this script hauls some serious behind straight toward that colorful Skull Island which we were all so eager to see from the trailers.<br><br>Now, I have learned from a number of painful years that discipline is a key ingredient both behind the camera and beneath the projector. I like to think that my expectations were fair. I did not look at any reviews at any point before I hit that seat on that Thursday night - popcorn and drink in hand. I was ready, man.<br><br>If I told you that the neat visuals surrounding the lineup of lovecraftian nasties rendered into digital existence to confront the titular ape was enough to save this picture, then I would be lying straight to your face.<br><br>Yes, of course we get to see a glorious pair of giant angry ape fists make heavy and satisfying contact with: Some helicopters, a couple of lizards without legs (which is funny, because the T-Rexes in Peter Jackson's King Kong lacked arms), a giant squid because, you know, we needed 5 seconds of squid footage in the trailer I guess, more lizards, and a big lizard whose sole purpose in life is to rustle some serious jimmies.<br><br>But unfortunately, these scenes are sprinkled between around 2 hours of having the camera choppily bob and weave between two separate groups containing some of the most boring and uninteresting characters I have ever come to forget. There is a cardboard hero who is good at everything that the script needs him to be good at, a photographer who takes, like, pictures I guess, and John C. Reilly, who is arguably the closest this film gets to an interesting character.<br><br>And this is not because of the script. This is because he is John C. Reilly adding his own touch to the script he was given, like Gordon Ramsay doing his best after being handed a bag of plain rice and half of a dildo.<br><br>Everybody else is a nameless nothing that we get to see be picked off by giant insects in front of some of the worst green screen I have seen in some time. Good, lord. What time of day was it again? Because I swear to sweet baby Christ on a cracker that the sun set about six or seven different times in the same day.<br><br>The helicopter's encounter followed (after seemingly quite some time) by the final throw-down between Kong and captain ptorsodactyl mcwigglynoodle was what truly got me through the cringe-inducing humor and painfully humorous deaths.<br><br>This is one of those red-box gems that you'll have a better time with once there is a beer in your hand rather than a 7 dollar popcorn.<br><br>03/10","user":"vaughnd711","rank":[332,578]}]