[{"title":"mre","rating":4,"date":"11 August 2019","review":"Nicolas Cage is still a great actor. just gotta find the right movie to act in.","user":"tski-56586","rank":[40,49]},{"title":"Would be a great film... if played at 1.5x speed","rating":7,"date":"5 August 2019","review":"For starters, all the 1's are just bone-head amateur reviews. This film - all things considered, is a solid 7/10, and here's why:<br><br>It's clearly a low budget B-grade film. You have a novice director (only his 2nd full length feature film, other 4 are shorts and TV films), Shawn Ku, who did a fairly decent job (remember, for a novice filmmaker) with the camera, but needed work on directing his cast (except Cage, who was awesome on his own). Then you have a great (conceptual) story, that was written by a totally green newbie writer, John Stuart Newman, in his 2nd full length feature film. Yes there were some plot issues, and yes the slow pacing was atrocious that the 103 min length felt ridiculously long. But nevertheless, Nicolas Cage kept this film afloat, with some help from Benjamin Bratt (who certainly needed better direction in the beginning).<br><br>If this film was properly edited and the pacing sped up 1.5x, it would have been an entirely different (much better) viewing experience. The score was decent and the cinematography on point. It's a shame the producers didn't decide to edit this better, because Cage deserved better for his performance. Nevertheless, rating this film based on its own production merits and value, it's a solid 7/10 from me. I still enjoyed it, but wanted more.","user":"TheTopDawgCritic","rank":[43,60]},{"title":"Disappointing","rating":3,"date":"30 September 2019","review":"\"A Score to Settle\" is another disappointing film with Nicolas Cage in the lead role. However, as a fan of this actor, I dare to say that he has a good performance. But the depressing story has a weak plot point and the direction and the screenplay are not in a good pace. Instead of a thriller or an action film, the viewer sees a boring and heavy drama with deceptive conclusion. Nicolas Cage needs to find better stories and screenplays. My vote is three.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[23,31]}]