[{"title":"Easily one of the worst movies I've ever seen","rating":1,"date":"15 March 2017","review":"I never leave reviews, but I felt it necessary to warn people about this film. <br><br>The premise was great! It is the stuff I love to see in films, but the execution was just downright terrible. The acting, the props, the writing... it was all half-assed and not thought out in the least. It's almost as if they didn't even try! I've seen better movies with beter effects and acting come out of high school A/V clubs. Seriously, it is that bad. Don't waste your time.","user":"Grayman3000","rank":[39,48]},{"title":"The original Moontrap is better","rating":3,"date":"10 February 2017","review":"This movie is vastly inferior to the original Moontrap. The story is a mish-mash of elements from better movies like Prometheus, and the typical we don't want the populous to know of this, it will ruin society. The special effects are sub par and compare to the worse the SyFy channel dishes out. Moontrap was not a A budget movie but is made good use of the stars and budget. This one had only 2 robots and neither looked like the Kaalium. One plus is the character development, you cared about what was going on with them. The ending was unsatisfying. Overall a movie that needed to look at the original for better inspiration and better writers and effects.","user":"teklord1","rank":[44,55]},{"title":"WOW! Dreadful on a level I've rarely seen","rating":1,"date":"3 May 2017","review":"I never leave reviews but felt a duty to the rest of humanity to do so here. This is literally the worst movie I've ever seen. I love sci-fi. I will watch bad sci-fi just because its all that's available. I went in with low expectations and was still surprised at how bad a movie could be. Could not make it more than half way before I gave up.<br><br>I think my kids have turned in better video projects than this for school. I find it hard to believe there was a professional anywhere near this mess.<br><br>stay away - even if you can see it for free, you would have more fun reading the tax code.","user":"vq-47209","rank":[39,49]}]