[{"title":"GREAT Doc about a great singer who died too young on the verge of salvation","rating":10,"date":"1 November 2015","review":"Viewed at 2015 Venice Film Festival., \"Janis, Little Girl Blue\" by Amy Berg, With Alex Gibney, himself an outstanding documentarian acting as producer, is a Great Doc about a great American singer, Janis Joplin, who died too young on the verge of salvation. <br><br>Interviews with parents, sister, brother, surviving members of The Grateful Dead, Kris Kristofferson, and most surprising, Dick Cavett (1970). In a year of many good documentaries, this was the best of all -- a marvelous reconstruction of a tragic young life. Janis sang the blues with such conviction and such black feeling that even afro-Americans though she was black -- She died on October 4, 1970 in a Hollywood motel of an accidental heroin overdose at age 27 -- only two weeks after another rock legend, Jimi Hendrix, also at age 27. The film traces her life from humble origins in the nondescript north Texas town of Port Arthur, constant humiliation by her schoolmates because of her extreme nonconformity and relatively plain looks, up through her rise to prominence as the lead singer of the acid/rock band Big Brother and the Holding Company --one of the leading San Francisco rock groups of the mid sixties -- reaching the pinnacle when recognized as the top white blues singer of the age, her difficulties dealing with fame, her loneliness in the midst of adoring crowds, her battle with drug addiction, and finally her tragic early death on the verge of even wider fame and general acceptance by the serious music world. <br><br>Needless to say, the film is liberally spiced with clips from her amazing stage appearances, which is an added enrichment, but this is far from a mere excuse to present her songs -- far more a penetrating probe into the life of an extremely complex personality ---a true artist who became the victim of her own profound talent. Myself more or less a product of the psychedelic sixties, I left the vast Venice theater thoroughly emotionally drained and realizing I had just witnessed a remarkable film about a most remarkable life. Alex, Budapest","user":"barev-85094","rank":[35,42]},{"title":"Another little piece of her heart","rating":9,"date":"22 April 2016","review":"Maybe it's just me, but I can't seem to get enough Janis. I have read a biography on her and watched other films, as well as attended the stage play \"Love, Janis\" and I'm always wanting for more. <br><br>I rated this a nine because a near perfect documentary about Janis would be at least four hours, imho. There could have been more interviews with her sister and brother and others who knew her intimately. It focused on her person and her heart more than other things I've seen. I was only ten years old when she died and my family was as straight laced as Janis' and Port Arthur, so I don't remember any fan fare regarding her. I didn't fully experience her music until I was eighteen and I fell hard as a Janis fan.<br><br>Interesting point to younger generations is that the media always focuses on the San Francisco scene when it talks about the 60's and the hippy era, when most of the rest of the world at the time was really closer to Port Arthur. <br><br>Strongly recommend this gem for any Janis fan. You won't be bored and you will find another little piece of her heart you may not have known about before. I imagined that she had a big heart for people in general, and this documentary solidified that belief.<br><br>A comment in the film about the level of emotion she reached in her singing was at a high price and that was a prefect summation of the art that was Janis Joplin.","user":"realitycomments","rank":[16,18]},{"title":"A satisfying biopic of a great lady.","rating":22,"date":"22 December 2015","review":"The recent documentary Amy, depicting singer Amy Winehouse's rise and fall at about the same age as Janis Joplin reminds me that all rockers are not the same, especially females. Janis: Little Girl Blue depicts Joplin as much more focused than Amy and much more in control of her own life. Except for in death, where both succumb to substance abuse, even the relatively more stable Amy.<br><br>This Janis doc does an effective job showing the arc of her brief life, from a country girl in Texas to the rocker who led the way for women in the industry and eventually the world. Why the eventual failure given her great fame and fortune? It's simple, really: She wanted to be loved, and not always finding that devotion, she could turn to music and drugs for support and fulfillment.<br><br>Along the way, the doc gives insight into what makes this blues mama run: In her own words she says ambition is the desire to be loved. She's not a \"Cry Baby\" about not getting the love she wanted from some of her friends and family; actually family members talk to us and appear to have supported her through it all.<br><br>Her straight-laced parents couldn't be expected to wholly embrace the counter-culture queen, who began innocently singing folk tunes in her early teens and ended singing blues that reminded one critic of \"desperate mating calls.\" Professionally she gets plenty of love from the likes of Khris Kristofferson, whose Me &amp; Bobby Magee was her best-selling single ever and band mate David Goetz, who observed that she turned into a caricature of the blues mama that the media had helped to create. Dick Cavett interviews her with an unusual affection different from his usually detached persona. At one point he can't remember if they were intimate—a nice touch of amnesia that doesn't belie a bit his attachment to her.<br><br>Janis: Little Girl Blue informs about Joplin's career from folk to hard blues, gives insight into the driving emotions of her ambition, and amply shows her singing talents that made her a child of Aretha Franklin and her own person.<br><br>A greatly satisfying bio of a great singer.","user":"jdesando","rank":[13,16]}]