[{"title":"War? What is it good for?","rating":5,"date":"9 March 2016","review":"Dolph and his crew of misfits are actually a good fit ... for war. It's one of those B-movies that have a war theme. It's not really a movie that has many mysteries about it. Dolph has to coach a crew of people who no one else wants and from that starting point you pretty much know where this is going.<br><br>There is conflict within and everything else you could expect from a movie like this. It's decent overall if you like that kind of stuff. It's not Anti-War, it's more heroic than that. And the end suggests a couple of things, that you'll either like or hate. But your decision/mind will have been made up long before that","user":"kosmasp","rank":[7,7]},{"title":"Excruciatingly boring, it declares war of attrition on audience's patience.","rating":3,"date":"24 July 2015","review":"Let's be honest, you saw the cast or description and thought this would be an action packed war movie. Sad to say, War Pigs is a slow trudging march of bad acting and unappealing script. Even the supposed big names like Mickey Rourke and Chuck Liddell only appear briefly and what little action it has is done without finesse.<br><br>Story follows Dolph Lundgren and Luke Goss as they assemble rag tag squad to overcome Nazi advances. This is practically the whole movie, they recruit some people, train them while creating bond of brotherhood. It may sound good if it had better material, yet the plot is barren and tedious. Be it may the actors or dialogues, neither are interesting.<br><br>War movie is tricky, it inherently has some expectations and emotions involved. Many movies with better cast and production have mixed result, War Pigs have none the polished delivery nor the gritty nature to pull off this kind of scale. It's simply a few men bantering for an hour and half. The subject may have been engaging, but the presentation offers barely any battle of wit or actual battle at all.<br><br>If the slow pace hasn't deterred the audience, the flimsy action would. With the leading action stars, the movie could have done at least action sequences right, instead it only produces a very amateurish effort. The camera lacks focus and gun fight doesn't even look remotely real. It probably wouldn't help much since the cumulative action is probably only ten minutes or less.<br><br>War Pigs certainly doesn't have the depth to present cerebral war theme, it lacks the production to capitalize on the action oriented cast and it's far from authentic to appeal to military fans. It only gives a sense of desolation and tediousness for the audience.","user":"quincytheodore","rank":[44,61]},{"title":"A disaster of a war movie","rating":1,"date":"24 September 2015","review":"This must rank as one of the worst researched and acted war movies of recent years. US soldiers disheveled and unkempt, dirty dozen-like, an absolutely absurd scenario and on top of it all, no research as to uniforms and army traditions. Foreign Legion officers never wear or wore the kepi blanc and the character of the tooth-pick chewing long-haired US \"colonel\" complete with his cowboy hat is absolutely ridiculous. The acting is terrible throughout and full of boring stereotypes. One wonders if this is meant to be a war movie or a B-movie parody. 1 out of then 10 is too good for this disaster of a movie!","user":"piet-hofmans","rank":[23,35]}]