[{"title":"Very good for kids!","rating":9,"date":"16 April 2018","review":"At the weekend, my whole family watched the cartoon \"Sheep and Wolves\" and all were left with positive emotions, the children were completely delighted. The cartoon is kind and interesting, the main characters look very positive. Wolves are shown with such kindness that now children simply are not scared of them because they portrayed as good animals. A very colorful, beautiful view of nature, lambs are angelic. In this cartoon, as always, good triumphs over evil, I recommend everyone to watch it, an excellent cartoon for family viewing!<br><br>'Sheep and Wolves' deserves only 5 of 5 stars! It leaves positive emotions, it's kind and colorful. I liked it!","user":"lynn_melanie","rank":[20,21]},{"title":"I bought the dvd for my family","rating":9,"date":"9 April 2018","review":"The colorfulness of the cartoon and a good graphics at the first look. All characters look very realistic. Further - this is an excellent voice of the cartoon. This is one of the few cartoons produced in Europe, which in truth can be called the pinnacle of cinematography - the script is excellent: the animated life story unfolds in a cartoon of a pack of wolves and a herd of sheep: in nature, after all, wolves should eat sheep. But not here! A brave wolf who, by coincidence and foolishness, turned into a sheep and came to them in the herd: he found new, faithful friends there. They showed each other that it is necessary to be friends. And, of course, there is a love history in a cartoon. I'm 30 years old but I have enjoined this cartoon with my babies! So if you didn't see it earlier I highly recommend it!","user":"kate-stuart","rank":[13,13]},{"title":"Great","rating":8,"date":"21 April 2018","review":"I came into the movie expecting something like Sahara (2017). I thought it would be a good film with nothing outstanding. But this movie was great, i have not seen many animated films from outside the US and the UK, but this is by far the best one ive seen. <br><br>Positives:\nThe story: I dont have too much to say about the story, i found it good, even great, but this isn´t the films greatest thing.<br><br>Voice Acting: Wow, this film has so many actors i know, Tom Felton, Sarah Natochenney, Alyson Leigh Rosenfield, and of course, China Anne McClain.\nRuby Rose did an excellent job as Bianca and i couldn´t think of a better person to play her. Same with McClain as Lyra.<br><br>Animation: It is very impressive. This animation is so much better than the other Russian movie ive seen (Space Dogs). The animation looks beautiful and the characters all look like there was a lot of effort put into their designs.<br><br>Emotional scenes: The scene where Bianca breaks-up with Grey is very sad, but its easy to see she still cares about him. Grey also cares about Bianca a lot. And when they meet again after Ragear takes control of the pack and Bianca tells Grey to leave is just so heartbreaking. You can hear how sad Bianca is in this scene.<br><br>Dialogue: Good, but i have nothing to say about it.<br><br>Characters:\nGrey: Well-meaning but immature wolf. A likable lead and Tom Felton (A.K.A. Draco Malfoy) makes the character much more interesting.<br><br>Bianca: Ive already talked about her a bit in this review, but she probably is my favorite character. Why? Because i admire a strong female. Ok thats not the only reason why. Ruby Rose does an amazing job as her. And i admire her as a character, with her being brave and independent.<br><br>I dont have much to say about the rest of the characters.<br><br>Negatives:\nOther than the kinda bad pacing early on in the film, i don´t have anything bad to say. <br><br>Overall, i definitely recommend this film. Great story, Great animation, Great characters. and it has it´s fair share of emotional scenes. The film is on dailymotion so if you have the time, please watch it.","user":"zacharychitwood","rank":[11,11]}]