[{"title":"It's meant for people who have been in the same situation.","rating":9,"date":"7 November 2018","review":"I have to be honest. For a person who likes to critique parts of a movie like plot, character development, story flow etc., it's not one of the best ones out there. Yes it could've had more depth to it, but I think this movie is meant for someone who can relate to it as a whole. It's main undertone is about being in a situation where it feels right even if you KNOW that it's wrong. Josh having a drink with Ruby the first time they met while Josh's girlfriend is at a different bar celebrating her birthday and Ruby still tagging along with Josh the 2nd time they meet even if both of them are in relationships.<br><br>A lot of people have been there before, being in a committed relationship where you KNOW that you love the person that you're with and then out of nowhere, you meet someone that makes you question everything about your current relationship and even more about yourself. For people who have been in a similar situation, you are kept on edge as the movie goes along because you wanna see how they figure it out and if a \"happy ending\" is waiting. The best part of the movie is the conversation they had on the cab on the way to Ruby's apartment where Josh is supposed to drop her off before he heads home. Here, they both admit their feelings for one another (as if we didn't know it already) but at the same time, still acknowledging that they love the people that they are currently with and they don't want to hurt them. You can see pain in both their eyes because they know that in their hearts, they want to explore a whole different chapter of their lives with each other. It does not make it any easier when they both realize that the things that \"goes over the heads\" of their partners, is the very thing that makes them like each other so much. It makes it more complicated when Ruby admits that she is engaged and is leaving Hong Kong in a few days. The last scene where Ruby looks at the taxi driver, deciding whether or not she should let Josh come up to her apartment before the screen turns to black gives the audience an open ending.<br><br>Already Tomorrow in Hong Kong is a romantic and light movie that explores the greatest irony of love \"Meeting the right person at the wrong time\".","user":"OrangeFlavoredChocolates","rank":[7,7]},{"title":"I am so mad I really wanted to love this!","rating":5,"date":"22 April 2016","review":"It is impossible not to think about Before Sunrise when watching this movie: two people meet in a beautiful foreign city and spend the night talking to each other. This movie was really frustrating, as I love Hong Kong and I love the two main actors, still, the superficiality of the writing and lack of depth during the whole movie was such a disappointment. The movie even lacks rhythm, as sometimes it takes forever and then it rushes to the end. There wasn't any grow or character deepening, there is no development in their conversation as it is always the same; by the end of the movie, the relationship between them didn't feel any closer than it was at the beginning. That is why it is so difficult to make a movie so much alike another, because I couldn't help but compare all along. Don't get me wrong, I love rom-coms, so this should have been and easy win. Maybe this could work for younger audiences that haven't seen the \"Before...\" movies.","user":"andreamsecchi","rank":[27,41]},{"title":"Basically a travel journal with a clumsy romance","rating":3,"date":"13 July 2016","review":"A lot of reviews praise on how \"real\" this feels. Yes, it feels real in some ways, that it unfolds like a real date would unfold, but also the bad writing and clumsy acting continuously break that illusion. <br><br>The first twenty minutes of this is just them walking around Hong Kong asking each other about their backstories. Literally just backstory info-dump throughout this whole thing. Yes, the conversation is what you would really have on a real date, but you end up feeling third wheel. So fun.<br><br>The point of a story is to have something happen, and nothing really happens. The only decent thing that happens in this first segment is she is Chinese (though the actress is Korean?), and he is an American ex-pat, and he knows his way around the city better than her. They build on it a little bit when she keeps needing directions, and then when he finds a non-touristy bar to chill out in, but really this whole first 20 minutes is just about lazy info-dump. <br><br>Eventually, spoiler alert, it's revealed that he already has a girlfriend. Sorry, but this is probably the most cliché trope in cinema. \"You're great... but I already have a girlfriend... but only if I had met you first!\" Then they bump into each other on a ferry a year later, and then they both have S.O.s but go on an amazing errand adventure together to pick up some clothes from the trailer. <br><br>The writing is weak, and the acting is bad. The only redeeming quality is the cinematography makes great use of Hong Kong, and you learn a little about Hong Kong culture. Basically, it's a travel journal with a clumsy romance.","user":"funkybassmannick","rank":[25,38]}]