[{"title":"Quite enjoyable.","rating":7,"date":"9 April 2016","review":"Puerto Ricans in Paris surprised me when I saw it at the Gasparilla International Film Festival. This is because Rosie Perez was on hand to discuss the movie...which was great. However, she was not a major character in the film! I loved seeing this youthful actress but I would have preferred seeing Edgar Garcia, as he was my favorite actor in this cute little film.<br><br>When the movie begins, Luis (Luis Guzman) and Eddie (Edgar Garcia) are both very successful undercover cops in New York who investigate cases involving counterfeit designer products. Because of this, the pair of Puerto Rican cops are asked by folks to come to France to help them investigate a case where some designer bags have been stolen before they are released to the public. In other words, unless the company pays ransom, the market will soon be flooded by knockoff purses. While it's not exactly believable that the French folks would ask these two to investigate instead of just having French police or private security films look into the matter, it doesn't really matter...this is just a nice fish out of water buddy picture.<br><br>Once in Paris, Luis is completely out of place. He's brash, a bit obnoxious and fancies himself a ladies' man. Unfortunately, he's a complete failure in the city of lights...and soon he's a bit jealous of Eddie. After all, although Eddie is happily married, there is a gorgeous model who adores him....so why can't Luis the bachelor get any of the ladies to look at him?! Perhaps it is because Eddie is just an incredibly sweet guy...the sort of character who loves his wife, loves his kids and is rarely seen in films. He's strong and likable...and his character certainly was a huge plus for the film. However, it's not all Garcia...the writing and directing are also rather nice. Plus, over time Guzman's character grows...and grows on you.<br><br>Will this film change your life? Certainly not. But while it's slight, it's also a film that is hard not to enjoy. A nice date film or a movie worth seeing if you want to see something a bit different. Plus, I can't help but admire a picture this enjoyable considering that it was shot in only 17 days...something that just seems impossible!","user":"MartinHafer","rank":[25,29]},{"title":"'Puerto Ricans in Paris' is a light-hearted buddy cop comedy with solid performances and enough laughs to warrant a viewing.","rating":7,"date":"7 June 2016","review":"I'm not so sure on the 'Puerto Ricans in Paris' title, other than to possibly make way for a string of franchise films with similar names with his comedic duo, but Ian Edelman's first directorial effort is a funny buddy cop film that leaves the big action beats on the back-burner and instead, relies on the comedic genius and calm demeanor of its stars. Edelman created the HBO show 'How to Make it in America' and brings along two of its stars in Luis Guzman and Edgar Garcia, who play Eddie and Luis respectively, two New York police undercover police officers who take down people and businesses making counterfeit handbags, clothing, and sunglasses. You know, most of you have been to New York and have paid less than $100 for a seemingly \"REAL\" Louis Vuitton handbag. Eddie and Luis are the guys that stop these people from making the counterfeits and passing them off as real.<br><br>This duo's funny, but unusual style has brought in a french businessman and his famous designer Colette (Alice Taglioni) to ask Eddie and Luis to travel to Paris and go undercover to catch the thieves that stole her upcoming new handbag for next season. The thieves sent a ransom note that if they don't get paid by a certain time, they will make thousands of fake handbags, thus destroying the new line of upcoming high end purses. Eddie leaves his four kids and wife (Rosie Perez) at home after a failed anniversary attempt at romance, while Luis can't seem to commit to his beautiful girlfriend (Rosario Dawson).<br><br>Once in Paris, let the good times role, as Luis tries to score with French women and try to catch the thieves. Again, this isn't an action movie. There are no real car chases, gun shots, or explosions here. Rather than that usual trope, Edelman relies on Guzman to improv a ton of funny lines and dialogue, which we can see in the outtakes during the end credits. Edgar and Luis seem to have a fun time on screen, but Edgar seems a little too soft for the real dramatic moments, and the duo seems a little unbalanced at times. Still, his charming quiet ways are still endearing, while Luis's comedy and brashness garner big laughs in every scene.<br><br>Taglioni turns in a good performance as well here, crossing between comedy and some more dramatic moments. It's a shame that Dawson and Perez don't have much screen time here, because their characters and scenes were some of the best in the film. I just hope that if a sequel to arise, those two actresses would come along for the journey. Edelman's eye for Paris was beautiful and quaint, giving us the opposite of a tourist view, which was nice to see. 'Puerto Ricans in Paris' is a light-hearted buddy cop comedy with solid performances and enough laughs to warrant a viewing.<br><br>RECOMMENDED!","user":"bryank-04844","rank":[10,11]},{"title":"Worth the five buck rental","rating":7,"date":"15 June 2016","review":"Cliché yet fun. Luis Guzman is as charming as usual and the rest of the supporting cast is very good. The Female actors were the best and most entertaining of the film with their fun, charismatic choices which really fleshed out their characters. They really made the film entertaining. Edgar Garcia seemed to be the only one that missed the performance boat. I suppose rising seas can't lift all boats, because that dingy sank. There were a few redeeming moments for his acting but sadly the most believable moment he had on screen was when he was riding the bike. Someone give him a task while he is saying lines for god's sake. I'm almost upset with the director for letting that slide but you have to keep the machine running I suppose. I'm not trying to bash him into never acting again, I want him to do well but he's got to put in the work to deserve better criticism.<br><br>I think the film was shot fine but I would like to see some slight changes on some of the moments. The writing was OK, but some glaring plot holes as in why they had to go to Paris and the connection with the snake was pretty bad.It was as if the the guy funding it had an idea and then everyone else smiled and said,\"Yeah, that sounds great\" and nobody had the guts to say, \"No, that's awful please don't take away the funding.\" I feel as if they had the money to shoot it suddenly and they had to rush the script into the production and had to rewrite as they went. Even Luis Guzman said they had the money before they had movie in an interview. <br><br>Ian Edelman feature directorial debut had its flaws but everyone's first does.I remember my first time.... directing a short and it wasn't pretty(Neither was the other thing). It was like most teenagers, goofy and uncoordinated so I can only imagine a feature. I would like to see the lead characters a little more three dimensional and interesting because it almost seemed like all the good lines and characters when to the costars and occasionally Luis Guzman. I have to say though for your first its a great stepping stone and well done. I'm looking forward to the next film to make the leap! <br><br>Overall it's worth the five bucks on Amazon Prime to watch Luis and the Female co-stars putter around Paris for the couple of mishaps and jokes. <br><br>Last note - I think Rosario and Rosie would have made a much better duo for the film and made Luis and Edgar be the one's that had to stay at home. I can just picture Edgar with his sulking performance trying to be the house wife and complain to Luis that his wife doesn't treat him well while she's in Paris. Plus it would have been fun to see the role reversal which would been fun on so many levels to really push social norms envelope.","user":"Brustersampson","rank":[7,9]}]