[{"title":"Better than it had a right to be","rating":6,"date":"1 October 2017","review":"It's a decent enough Alien invasion movie. Made great use of an unusual location, and Lee Pace shows promise as heroic leading man material.<br><br>Clearly a small budget, and once more proves that not having unlimited power or bankbook isn't necessarily a bad thing creatively. Film-makers had to come up with imaginative sets and emotionally involving characters, not just throw CGI as the story.<br><br>Only a few really flawed moments and the writing could have been a little better. But, overall, worth the time.","user":"LordJiggy","rank":[46,55]},{"title":"Good enough!","rating":7,"date":"5 July 2017","review":"A very decent sci-fi with acceptable writing and a few original and inspired scenes in a good setting with good actors filmed properly, the whole is entertaining and the art department did an outstanding job on a limited budget. <br><br>I can only recommend this movie and praise this project especially when compared to Hollywood's super boring and high cost CGI products. This movie will grant you a pleasant and relaxed experience without stressing your patience or ruining your eyesight. <br><br>It is not a masterpiece but definitely worth your time. In fact I would not mind to watch a sequel. If Revolt could represent just the average of what sci-fi movies look like we would live in happier times.","user":"lokilfa","rank":[97,126]},{"title":"\"War of the Worlds\" meets \"District 9\"","rating":9,"date":"6 July 2017","review":"I have a saying. We die hard sci-fi fans have to suffer for our sci-fi -- meaning we endure some pretty awful stuff just to get a hit of our favorite genre. Most of the suffering involves sitting through badly written and acted low budget indies with cheesy special effects. However every now and then, we are rewarded by a gem of a film like \"Revolt,\" that overachieves and dazzles us.<br><br>Set in Africa, after an alien invasion that has wiped out the rest of world, a small group of survivors makes humanity's last stand. A big idea, right? One that could go wrong in so many ways but writer/director Joe Miale, along with co-writer Rowan Athale's smart and unsentimental script avoids all the usual pitfalls. It's smart, efficient and always to the point. The CGI aliens are terrific and director Miale seamless blending of CGI with the live action create the kind of tense and visually rich hellscape we like to see in our post apocalypse movies. Lee Pace is a welcome surprise as an action hero and along with an equally talented cast make this one of the best alien invasion films to come along in a long while.","user":"mzand-751-539572","rank":[91,124]}]