[{"title":"An entertaining and engaging portrait of a fascinating pop culture figure.","rating":8,"date":"16 March 2015","review":"To call Russell Brand a polarizing figure in the realm pop culture would be something of an understatement. Over the years, the comedian, actor and author has concocted a public persona that is equal parts amusing and annoying, and there doesn't seem to be much middle ground when it comes to opinions of his particular - well, \"brand\" of humor. The documentary Brand: A Second Coming, which opened the 2015 SXSW Film Festival, seeks to explore the many facets of Brand's personality. Not a stone is left unturned here, from Brand's early days as a comedian and talk show host, to his headline-making romance with pop singer Katy Perry, to his current mission to spark change in the political and social climate.<br><br>While much of the material is undeniably funny, director Ondi Timoner certainly isn't afraid to let things get a bit darker. Home video footage of Brand in his younger days, slumped against the wall of his apartment and smoking methamphetamine, offers a very candid representation of his well-documented battle with drug addiction. Timoner also examines Brand's recovery, which ultimately led to another addiction that was arguably just as harmful: sex. And of course, his highly publicized marriage to (and divorce from) Katy Perry doesn't escape the scrutiny of Timoner's camera.<br><br>But for every melancholy moment, there are just as many entertaining and engaging scenes, much of it culled from talk show interviews and some of Brand's stand-up comedy performances. The documentary was actually being produced during the time Brand was creating his Messiah Complex special, and footage from this performance is weaved throughout the film as Brand discusses many of the figures which would inspire the finished product, and ultimately help to inform the belief system he has developed.<br><br>Brand: A Second Coming also spends a hefty amount of time on Brand's desire to enact social and political change, and his belief that a revolution is not only a necessity, but an inevitability. His beliefs may be a bit too radical for some, but it's nearly impossible not to admire him for his conviction and dedication to those beliefs - even if he sometimes has trouble balancing his activism with his desire to remain in the public consciousness.<br><br>With Brand: A Second Coming, Timoner has constructed an interesting and enlightening portrait of one of pop culture's most fascinating figures. It's doubtful that anyone viewing the documentary will have their opinion of Brand swayed in one direction or another, but it does shed some light on the influences and experiences that have shaped him into the person we see today.","user":"BrentHankins","rank":[17,22]},{"title":"A Rare Glimpse of the Vulnerabilities & Mission of Russell Brand","rating":9,"date":"20 September 2015","review":"A compelling, deeper look into the message and autobiographical motivations of an intriguing figure, often overlooked and overshadowed by the cloud of self-induced mania and crude humor that his various addictions have covered him by. <br><br>I loved Brand in Forgetting Sarah Marshall, was annoyed by him in Get Him to the Greek, and now, after being captivated by his story and passion throughout the rather long running time of this documentary,respect Brand and his tenacity for his latest life's mission. <br><br>Give this film a chance and you might be pleasantly surprised, if not by Timoner's artful compilations of Brand's vulnerability in the documentary itself, by the insatiable vision of an electric man searching for his truth. <br><br>Part biography, part call for social change, and completely fascinating, Brand: A Second Coming is worth a watch.","user":"marboms","rank":[10,18]},{"title":"Comedy and drama with a clever political message.","rating":6,"date":"8 December 2015","review":"Quite an interesting documentary, that is, if you think Russell Brand is interesting. I do think he is an interesting person and i liked the documentary. it showed Russell brand's good and bad sides, it wasn't one-sided. It did feel a little long for a biographical documentary, but never boring because of that.<br><br>The documentary mixes behind the scenes clips of Russell's life, clips of his stand-up comedy act and interesting conversations on his political engagement. Russell Brand also opens up about his dark drug past.<br><br>Altogether the documentary is a great mix between comedy and drama with a clever political message. Great for Russell Brand fans and anyone who wants to know more about him.","user":"Pheeke","rank":[3,5]}]