[{"title":"Spoon-Fed Emotions and Flat STory","rating":2,"date":"25 April 2017","review":"The trailer cherry picks \"deliciously pitch-perfect\" when that quote applies only to the reenactments of YOUNG BUCKS, the Bachelorette-style reality TV show. Frankly, they were pushing the age of the male suitors. Top billed Matthew Morrison is 38 and his face looks every bit of it.<br><br>Less successful is the family drama that isn't very interesting and reeks of \"prodigal son\" shtick. Morrison isn't very spontaneous and doesn't really create and inhabit characters. He brings his set repertoire to the role and takes on the character's name. That's it.<br><br>The script suffers from absence of subtlety. EVERYTHING the characters are thinking comes out of their mouths. The expository dialogue reveals that the writer/director doesn't trust the audience to perceive anything. Thus we end up with emotions by braille.<br><br>This would do better on Lifetime TV than the big screen.","user":"vicstevinson","rank":[13,20]},{"title":"Funny and honest!","rating":9,"date":"6 August 2017","review":"This is a great watch. A moving story with honest portrayals of grief and a tribute to those who have to each find their own different way forward. We laughed out loud. Wish I could melt into the family's cabin in northern Minnesota. The commentary on the soullessness of the reality competition world is right on. Loved it.","user":"cscott-41317","rank":[4,6]},{"title":"Sweet and Smart Film about Loss That's FUNNY!","rating":10,"date":"26 April 2017","review":"I've lost some dear friends and family and have never seen a film about grief that captures the reality of it like AFTER THE REALITY... oh... And it's an uplifting film! I laughed and cried. The Young Bucks (the reality show contestants) are so spot on funny and real to those shows. Sarah Chalke delivers a performance of a lifetime and Matthew Morrison is right there with her. I just wish there was little more Jane Lynch. She and Matthew are such a fun on screen duo. Some people might not get the shifting realities but it's a complicated emotional film Definitely gong to watch again.","user":"swixroberts","rank":[7,13]}]