[{"title":"Why???????","rating":1,"date":"27 May 2014","review":"As someone who grew up watching good monster flicks, it kills me to see what has happened to the genre over the years, what with the crappy CGI and lack of effort from everyone involved. Sadly instead of getting better, things just keep on getting worse as demonstrated by the recent \"Blood Lake: Attack of the Killer Lampreys\". Airing on Animal Planet (Animal Planet? What the hell!!!) it presents your run of the mill nature gone wild story when more aggressive than normal blood sucking lampreys (scary, real-life snake like fish) invade a lake near a small town in Michigan. Now in the right hands, this may have ended up being some what of a decent flick. Unfortunately, it becomes a prime example of bad movie making without the so bad it's good quality. A big problem with the film is that there is not a single ounce of tension to be found anywhere. Instead, people just die violent deaths and you end up with something more disgusting than scary. Second, the special effects, (if you can call them that!) would make even the crappiest effects from fifty years ago look spectacular in comparison. But perhaps the biggest reason why the film fails is the lack of care from the actors. In the old days, when actors did monster flicks they undoubtedly knew they weren't doing Shakespeare. But that didn't stop them from giving everything they had to the part and as a result, even a cheap grade B movie could end up being something memorable. Here, you can just tell the actors' hearts just aren't in it. Even Christopher Lloyd (Yes, that Christopher Lloyd!) fails to give his usual eccentric, bigger than life performance. Then again, looking at what he has to work with, I can't say I blame him and the same would probably go to all the other actors involved. If Animal Planet wants to have its own drama shows, then maybe they should bring back productions like \"Lost Tapes\". It may have been a bit of a rip off of \"The Blair Witch Project\", but at least the people involved there gave a damn about what they were doing. I could go on but you get the point. My best advice to you is to avoid this film at all costs and as for the actors involved, disavow and deny that you had any part in this disaster what so ever!!","user":"bayardhiler","rank":[17,25]},{"title":"Killer eels slither up Christopher Lloyd's butt","rating":3,"date":"8 August 2014","review":"In this movie, killer eels go through the plumbing, slither up Christopher Lloyd's butt, then pop out his mouth.<br><br>That's horrifying on oh, so many levels that have nothing to do with this being an effective horror picture, which it is not.<br><br>That the famously reclusive character actor apparently needed the dough so badly that he'd add this call-in DTV role to his Reverend Jim / Doc Brown / Uncle Fester repertoire is sad enough. That he shakes and gesticulates in every of his few scenes like he's got the delirium tremens makes me worry for his sobriety.<br><br>But when the scariest thing in your horror movie is Shannen Doherty's face -- most specifically her Botox-frozen lips and cig-poisoned skin pallor -- you're gonna want to use your digital effects to make your lead actress look at least a bit less revolting than your vampire water snakes.<br><br>You didn't here. Ugh. Not ugh blood-sucking eels. Ugh Shannen Doherty.<br><br>Nobody dies spectacularly; none of the hot girls take their clothes off; the ending's a letdown. The Asylum, ladies and gentlemen.<br><br>Netflix \"Night of the Creeps\" or \"Slither\" instead for a movie that takes awesomely better advantage of its similarly dumb premise.","user":"mikemdp","rank":[8,11]},{"title":"Just when you thought it was safe. Ah, forget it! It's never safe to go back into the water!!","rating":5,"date":"1 August 2014","review":"Knowing (and dreading) the The Asylum production studios, it has to be said immediately that \"Blood Lake: etc\" is a lot less rubbishy then their usual work. By no means should you expect a great movie, obviously, but at least this isn't as insultingly retarded and preposterous as for example - oh I don't know - \"Sharknado\" or \"Mega Piranha\". The main reasons why this film is more or less a success, I presume, are the original choice of animal species (so original even that Animal Planet aired the film) and the fact that it's largely an old-fashioned type of 'creature feature horror flick in terms of plot, characters and structure. Haters could of course quote this last argument to claim that \"Blood Lake\" is very clichéd and derivative, but I firmly believe that ALL animal attack movies are fundamentally a rip-off of the almighty \"Jaws\". Although filmed in sunny California, the events supposedly takes place in a little lake town in the state of Michigan. They struggle with a lamprey infestation, and after the aggressive eel-like monsters devoured all the fish in the lakes, they break through the hydraulic turbines and into the city's water reservoir. The simple plot easily allows all the familiar clichés to be present. There's the obnoxious mayor who severely underestimates the dangerous situation and absolutely wants to avoid at all costs that his town gets negatively portrayed in the media, the hero's disobedient teenage daughter who flees from her bedroom and ends up in peril and the chaotic beach attacks. It's all very enjoyable since director James Cullen Bressack assures there is sufficient action and not too much idiocy. The Asylum has the bad habit of over-sizing their monsters, but the lampreys luckily remain their natural modest size. The film stars a few familiar faces, most notably Christopher Lloyd as the outrageous mayor and Shannen Doherty as the concerned family mother. Shannen got a little chubby in the face, but hey, she's a woman over forty now and no longer the rebellious Breda from \"Beverly Hills 90210\".","user":"Coventry","rank":[8,12]}]