[{"title":"Michèle: Portrait of a seriously troubled woman","rating":8,"date":"2 February 2018","review":"Isabelle Huppert migh have signed a pact with the devil. She´s still incredibly sexy at over 60 years old and as unique as always. \"Elle\" it´s all about her (duh) and no other actress could have possibly made it. A classy production with moments of great tension but I find this to be a character study more than anything else. A woman and her circumstance: her family, her work, her friends and, of course, her sexuality. It might be controversial but it´s not cheap. She´s not an ordinary woman and her father and her mother both have an important role in the film as to know why. Everything else is plausible due to her condition, from her son´s character issues to her affairs and further. Nothing is taken lightly, every situation or decision is determined by her psychology.<br><br>Now, I´ve seen how it enrages a lot of people. I guess they´re not familiar with Huppert´s work. There´s, of course, \"La pianiste\" but I find \"Ma mère\" to be worse. She´s always had a taste for moral uncertainty and she´s never been afraid of playing with its limits. Verhoeven is similar and this is a clear highlight in his appalling filmography. I wonder what would happen if \"The Clockwork Orange\", for instance, was made today? I´m not a fan of it but it´s widely regarded as a classic. We shouldn´t forget these are movies, not real life. Violence or pshycopathy are still a part of the human condition, however unpleasant they might be. I´m unfortunately close enough to rape reality to assert my opinion. \"Elle\" isn´t overly serious and never tries to be more than it is: two entertaining hours of drama.","user":"axapvov","rank":[18,21]},{"title":"Provocative psychological thriller","rating":6,"date":"12 June 2016","review":"Director Paul Verhoeven is famous for his provocative films, often combining sex, violence and psychological power play. Actress Isabelle Huppert is famous for her demanding roles, often playing powerful women with an obsession for sex and/or violence.<br><br>Put the two together and you can guess what you get. Elle's lead character, Michèle, is a woman who owns a video game company, specializing in games filled with extreme sex and violence. She casually shares her bed with her best friend's husband. She masturbates watching the neighbour unloading the trunk of his car. Her father is a convicted serial killer. Oh, and she doesn't seem to mind getting raped.<br><br>At least, that's the impression after the very first scene. After having been attacked and violently raped, she doesn't call the police of even a friend, but a fast food restaurant, ordering something to eat.<br><br>The film explores not only Michèle's relationship with her rapist, whose identity is established after about two thirds of the film, but also the men and women in her immediate circle. They all have their problems and peculiarities, and Michèle seems to pull all their strings as a hard, cold woman, superbly mastering her feelings and emotions.<br><br>For the viewer, it takes some effort to understand all the different relationships, and even more to grasp Michèle's behaviour. The only explanation Verhoeven offers, is her troubled youth as the daughter of a serial killer. In my opinion, the film suffers from an overload of characters with psychological difficulties. There's a mother hiring a gigolo because she can't accept getting older, there's a son clinging to a dominating girlfriend, a neighbour with a wife obsessed with religion, an employee playing a dirty trick on Michèle, and so on. Personally, I found it a bit too much.<br><br>The one thing that stands out in this film, is Isabelle Huppert's acting. Any other actress could easily have made Michèle's character unbelievable. But Huppert's utter detachment from any form of sensitivity makes the part completely convincing.","user":"rubenm","rank":[125,173]},{"title":"A Convoluted, Yet Well-Executed Premise!","rating":22,"date":"22 May 2016","review":"After seeing this film at Cannes, it left me with rather mixed emotions, and I continued thinking about it for quite some time after; so after much thought, I decided it was time to write a review of this new French new flick. 'Elle' is a thought-provoking thriller from the hands of Dutch auteur Paul Verhoeven that is definitely not suitable for the younger audiences. Verhoeven has a tendency to venture down more explicit routes (think of 'Showgirls'), but this time took a psychological approach creating a film that will definitely leave you thinking.<br><br>Now, the plot can be rather convoluted. The film runs several plot lines alongside each other and at times, you can lose track of certain characters, but if you pay close enough attention, you'll fully appreciate the complex, yet original structure Verhoeven has created. The performances in the film are all fantastic, and the direction is magnificent (Verhoeven actually took to learning French as a new language so he could utilise an entire French crew), the cinematography and soundtrack both make great accompaniments, but I personally think the film's structure was the only downside to the film.<br><br>The subject matter is rather grim, revolving around sexual assault and the estranged relationship between the main character and her parents, but there are instances of humour that just give that little hint of lightheartedness to a relatively dark premise. All-in- all I would definitely recommend this film if you're a fan of dark thrillers along the lines of 'The Girl With the Dragon Tattoo' etc, but be prepared for a no-holds brazen thriller. Nonetheless, Verhoeven has made a sincere thriller that kept me thinking well after the credits had finished, so congratulations to him for that, and for undertaking the somewhat \"risky\" subject matter.","user":"CalRhys","rank":[112,167]}]