[{"title":"A tender film about the pain of moving on.","rating":8,"date":"24 December 2014","review":"It's always great when festival films can hold onto that excitement even over a year from their premiere. Perhaps that magic comes from the intrigue in The Disappearance of Eleanor Rigby's conceit. The content of the film is nothing new, just approached in a special way. A couple drift apart due to an unspeakable tragedy and try to make sense of the world. Sprinkled with introspective insights and anchored by terrific performances, it's truly bolstered through its enigma. Now I decided to watch Her first, arguably the more acclaimed of the pair, at least for Jessica Chastain. Although the director states that the films can be watched in any order, the premiere started with Him and in hindsight perhaps it offers key context that I should've dived into first, but I quite prefer the way I watched it even though the latter suffered.<br><br>Knowing that it has a counterpart film gives Her an enigma and the film is enchanting, benefiting from a sparing use of James McAvoy. This is the Chastain show and she's the best I've seen her so far. Sometimes it teeters on being quirky for the sake of quirkiness the way indie movies do, but its subversive way it acknowledges and rejects clichés rings too true and dig deep. Perhaps as a result it is quite clichéd, but the nuanced and heavy hearted texture of the film with the soft autumnal cinematography and use of music makes it a human experience. It's such a melodic, delicate, intimate, introspective, melancholic and ultimately heartbreaking look at the pain of moving on, emotionally and in Eleanor Rigby's case, physically as she finds herself compelled to drift from place to place hoping that she can start fresh but never does. It's very satisfying that the film met high expectations, at least this half of the experiment.<br><br>8/10","user":"Sergeant_Tibbs","rank":[13,13]},{"title":"Touching, delicately shot and brilliantly acted. Simply fantastic","rating":9,"date":"9 December 2014","review":"Saw this last night (I consider it one film, saw both parts back to back in that order). Such a lovely, touching film, and not at all what I expected when I first heard about the project. First off, I just want to say that I find the title really gimmicky and misleading. Okay, sure, it's technically not \"wrong\", but it just sounds like a lead-on for something it's not, such an easy way to grab audience's attention. <br><br>The basic plot point that leads to the whole film has been done before (Rabbit Hole did it just a few years ago) and the whole film isn't trying to be anything other than an honest, captivating look at two characters' lives and the way they deal with this tragedy. For some reason I thought it was going to be this really daring film. I was wrong and I knew almost immediately, but I didn't mind. The script is fantastic, and the two leads superb. McAvoy actually impresses more in Her, and as a whole he's not really in Chastain's level, but he has some really strong scenes and as of now I'd have him in my Top 10 for Lead Actor (and he's in my top 3 for Filth, which is a better performance but an inferior film in every way). What can I say about Chastain? Her best performance alongside Zero Dark Thirty, and may very well be even better for the fact that she's able to play a much more rounded character in terms of emotions. What I've always found incredibly impressive about her as an actress is that, not only is she technically impeccable in all her work to a fault like so many other acclaimed actresses are, but she's also able to inhabit a character fully to the point that her technicality doesn't feel like we're watching her at a distance emotionally. That's a problem I have with some actresses working right now. They can be great, yeah, but can also hit notes technically well while feeling too much like it's all for show at times. I've never had that problem with Chastain. Her work here is among the best of the year and it's a shame that neither her or the fantastic film she's in are even getting mentions from critic bodies. If its because of the stupid \"Them\" decision, then what a shame... but it's most likely not, and that's an even bigger shame","user":"Red_Identity","rank":[12,14]},{"title":"Complex, unique film","rating":8,"date":"7 October 2015","review":"The Disppearance Of Eleanor Rigby (nothing to do with the Beatles song except a brief reference by a character) is a thoughtful, exceptionally well made film about a couple dealing with an immense tragedy that has put a weight on their relationship, forcing them to take some time apart. James Macavoy, an actor who continues to impress, and Jessica Chastain, always amazing, play the two with diligent feeling and palpable hurt. Now, there's three different edits of the film. His, which is mostly his side of events following the breakup, where Macavoy takes center stage and we see his life. Hers, which shows us where Chastain ends up, and how she is coping. The third version, Theirs, is a truncated version of both stories, leaving out a lot of key scenes and important beats. His and Hers together come out to about four hours of movie watching, but if you're going to invest yourself in their story, you owe it to you self to watch them both, starting with His. Because there is four hours of their story, they are allowed to develop and interact in a fashion that feels far more genuine and lifelike than a rushed two and a half hour movie. Macavoy is an aspiring cook who runs a small café with his friend and sous chef (Bill Hader, fiercely funny) and yearns for Chastain, angry at life for throwing them the curveball it did. He moves in with his father (Ciaran Hinds gives phenomenal work), a successful restauranteer. Chastain moves in with her folks as well, played by Isabelle Huppert and William Hurt. Hurt, who hasn't been around that much lately, makes up for that by anchoring a key scene with Chastain. It's interesting that he gets to play her father in a film, because they both share a measured, baleful, hypnotic grace in their work, and seeing them interacting was a treat for me, being an immense fan of both their work. Now, the film is more than the sum of its parts, but I mean that in a good way, since the parts themselves are so brilliantly done as well. It's what we expect from the romantic drama Avenue, but because we see an extended fluidity to the work, a narrative free from the fractured conventions of usual editing styles, we feel right there with our two protagonists, every step of the way. More films should break the mold and try to be more than just segmented movies, and use immersion techniques like this to draw us in. Coupled with that unique method of delivery comes a sincere commitment from actors and director alike, to explore an aspect of life and relationships that many see as unpleasant or upsetting, yet can still make for beautiful work. Well worth a watch.","user":"NateWatchesCoolMovies","rank":[3,3]}]