[{"title":"Shocking - and not in a good way","rating":1,"date":"11 June 2015","review":"Oh dear. I have contemplated creating an IMDb profile to be able to post reviews in the past, but this was the movie that finally compelled me to get off my a**e and put pen to paper. Not because CotWT is so irredeemably awful (although it is), but because a number of the early reviews to be posted here were so thoroughly misleading. I can only re-iterate what others have already suggested: the positive reviews can ONLY have been posted by people with a vested interest in promoting this pile of garbage. But, to an extent, they did their job - I was suckered into watching the movie, and I daresay I wasn't the only one. Hey-ho.<br><br>I'm not going to bother saying too much about the movie itself, there's no real point. The script is direction-less and largely incomprehensible. The acting is laughable - there is a reason you have never heard of any of these actors before, and you certainly won't be hearing of them in the future. The plot consists of taking just about every scary movie cliché and putting them together in a series of badly-acted, largely unrelated scenes. And the editing is absolutely laughable, probably the worst aspect of the whole sorry enterprise. I was sat watching this with my wife and daughter and, after fifteen minutes or so of us all sitting in embarrassed silence at the horror unfolding before our eyes, I turned to them and said \"This is without doubt the worst movie I have ever watched\". I wasn't even joking. However, this was a turning point of sorts, since from that moment onwards we were all able to relax and enjoy the movie for its unique awfulness, rather than trying to discern any sort of artistic merit in it. It actually made for quite an entertaining ninety minutes or so, as we sat there laughing as one pointless cliché followed another in this procession of over-acted, poorly scripted dross.<br><br>If I were to recommend this film on any level, it would be just that: if you are looking for a challenger for your own Worst Movie Ever Watched list, this could well be the one you have been waiting for.<br><br>Bleuch.","user":"alan_hart","rank":[32,36]},{"title":"Unmitigated drivel on a nonexistent budget","rating":1,"date":"17 June 2015","review":"For the love of Pete, where the hell do I even start? The movie opens with two blatantly false statistics.<br><br>--'The bubonic plague, also known as the Black Death, killed an estimated 200 million people in Europe.'<br><br>No, the correct figure is 25 million. Europe's population at the time was ~65 million, so a death toll of 200 million would have wiped out the entire population of Europe about three times over.<br><br>--'There are 61,551 recorded executions for witchcraft.' <br><br>No, the total ESTIMATE of executions for witchcraft is 40,000. We don't even have records for that many, and certainly not for the utterly absurd figure of 61,551.<br><br>COTWT desperately wants to be taken seriously and tries to emulate some aspects of Hammer Horror, but it looks like it was produced by a bunch of high school kids on an overdose of Valium. The result is 103 minutes of gibberish that even Uwe Bolle would disown.<br><br>With a rambling, incoherent plot and actors who sound like they were dragged from a psych ward on 'Extra Medicine Day', this giant steaming dung ball made me want to remove my own eyes with a combine harvester.<br><br>I rate 'Curse of the Witching Tree' at 3.33 on the Haglee Scale, which works out as a humiliating 1/10 on IMDb.","user":"Sankari_Suomi","rank":[16,18]},{"title":"Wow, what a stinker","rating":1,"date":"15 August 2015","review":"Don't get me wrong, i'm British and i like nothing more than watching a home-grown movie. But this... I don't know where to start, the acting is like watching a school play, over exaggerated movements which are comical, the dialogue is stilted and amateur. Some members of the cast are supposed to be school children and plainly look about 25, it's insulting and unbelievable. Technically it's.... well i don't know, it's..... not technical at all. The dialogue is all captured using ambient microphones, you can barely hear the dialogue in places due to traffic, bird song or the wind. The whole thing is shot in what appears to be a lovely country house but whomever actually owns it (probably one of the producers, director or 'mate of') has obviously blown all their money purchasing or renting the property because inside the refurbishment is as poor as the acting. Who the hell would spend 3 million on a house and then put a 'Beko' fridge in it? The floor coverings, doors, door frames and skirting boards are straight out of a 90's new build house and not fitting at all with the period of the house. All in all i'd say the first 1,000 people who rated this movie are friends and family of the people who worked on it, certainly not the people who worked on it themselves because i doubt that would amount to more than 35 including the cast. What Budget? What script? What lighting? what score? What sound engineer?<br><br>It's like something produced by First year Bradford film School students, and that's an insult to Bradford Film School students as to date, they've not produced anything this appalling to my knowledge","user":"lazylob","rank":[15,17]}]