[{"title":"Good","rating":7,"date":"22 February 2020","review":"This fell into the typical cliché riddled story mode and it lost all the hard work created in the first film. They never invested enough time in the friendship to pull off this story beat and the film doesn't work. I enjoyed the first film and when you compare the films, the sequel is less interesting story wise. Washington is the key here and even he cannot rescue the contrived plot chosen by the filmmakers. I wanted to like this film and the action can only compensate for so much. The supporting plots felt uninspired and with only a few of the subplots paying off. Good action scenes but a friend death that means nothing and serves zero purpose is wasted. Hopefully they can redeem themselves with a third film.","user":"MR_Heraclius","rank":[40,41]},{"title":"I just want to mention one part","rating":9,"date":"21 July 2018","review":"The movie is good. Im a Denzel fan, and a Fuqua fan, so naturally i enjoyed it. I would like to draw attention to one part specifically - when Denzel has the serious talk with the young gentleman after they get off the elevator about halfway through. In my humble opinion, acting doesn't get any better than that. It is the cream resting at the top of his consistently excellent work. A remarkable example of the power of film.","user":"esferdez","rank":[404,540]},{"title":"Revenge isn't as Sweet","rating":6,"date":"2 August 2018","review":"If there's anyone in Hollywood that I would believe is actually a real life bada**, it's probably Denzel Washington. The first Equalizer was a surprisingly brutal and visceral action film that gave Liam Neeson movies a run for its money. While the sequel is full of just as many, if not more, incredible kill sequences by Denzel's character, I think there's a lack of connection I felt this time around. I wasn't nearly as connected to the story, and perhaps that's because the revenge didn't feel as sweet this time around. The ending of the film is a great sequence on its own and there are certain scenes I will certainly revisit, but I'm not sure the film as a whole works quite as well.<br><br>6.6/10","user":"ThomasDrufke","rank":[160,225]}]