[{"title":"Gritty, Compelling and Harsh","rating":9,"date":"31 December 2016","review":"If you are a fan of Larry Clarks Kids then this is the film for you. It portrays a harsh reality that most people would rather not see. It's got that train wreck quality that won't let you turn away and at the same time has you horrified.<br><br>Sasha Lane as the protagonist Star gave a great performance. Her anger and sadness come to the surface even when she's silent. I've always liked Shia LaBeouf but I've usually felt like the films he's done don't interest me so I don't get to see his performances that much.<br><br>I realize that the film is long, but I think it's part of what makes this film special. It takes time to develop and meanders a bit in the process but again it's part of what makes the film seem so genuine. Though the premise of the story is a bit ridiculous in itself it's really just a vehicle to let us in on the behavior of these young people. What makes them tick. What kind of music they like. How they relate to each other.<br><br>Clearly this film isn't for everyone. You should have an idea what it is about before you partake in the investment of watching it. But if you are like me and enjoy the sociological aspect of feeling like you are eavesdropping on the life of these young people then it's a great film.<br><br>I'm not familiar with this director but now I'd like to see her other films. Hopefully her hand is on the pulse of a lot of different subsets of culture.","user":"DiscoVinyl","rank":[68,88]},{"title":"Lost and found on the road to nowhere.","rating":8,"date":"2 January 2017","review":"A young girl, named Star, with no economic abilities, bears the heavy responsibility of raising her two younger siblings.<br><br>Hungry after living the life of a teenager she gets attracted to a group of young people at a supermarket with high spirit and a bad attitude. She leaves her siblings behind and joins the group who lives from day to day selling magazines to whomever they meet. The common denominator is the selling of magazines. How to do it? How to manipulate the potential buyer with different kind of stories up the sleeve that is supposed to impose sympathy? As Oliver Twist is lured into Fagins lair and is taught to pick pockets without knowing what he is doing so is Star initially. At the point where she understands the rules and laws of the group, she is involved in such a way that she accepts the game and takes some very big risks and further compromises her own moral values.<br><br>The force of the movie is the depiction of the life on the road, the interaction between our marginalized young people and slowly getting to know our protagonist, who in the beginning is the silent observer and little by little starts to unfold her personality.<br><br>I can see that the movie is being criticized for being very long and not having a story that develops from a start- to an endpoint. I agree that some of the scenes are prolonged to a point that seems unnecessary. Besides this I think that this movie is a perfect example of how the truth often lies in the detail. This means that we need to dwell in some of the scenes and that the artistic challenge is to let this happen in a way that gets the audience involved.<br><br>Again I must express my deepest respect for director Andrea Arnold who has the rare ability to show a milieu in such a convincing way that it at certain points seems as if you are not watching a movie but instead a documentary but without losing the storytelling.<br><br>Regards Simon<br><br>Ps. When you read reviews that gives max score check to see if the user has made more than one review. If not consider the possibility of a lobbyist. If you agree consider putting this post scriptum at the bottom at your own reviews.","user":"SimonHeide","rank":[62,84]},{"title":"Startling","rating":8,"date":"26 September 2016","review":"Much of Andrea Arnold's American HONEY reminds me of Larry Clark's 1995 film, \"Kids,\" struggling adolescent years, but American HONEY is much more nuanced in that on one hand you have this somewhat social commentary about how we are the richest nation in the world and yet so many of our teens live in poverty and they have to hustle and do certain demeaning things just to get by, just to survive, just to feed themselves. On the other hand, you could see American HONEY from the perspective of the characters and the impressive way in which they organize, you can see their selling and marketing skills, despite it being a scam and rough around the edges. They're doing what wall street does basically but on a smaller, smaller, way smaller scale.<br><br>Sasha Lane plays free spirited teenage named star who leaves her troubled trashy home to go on a road trip with traveling laborers her age, they go from town to town, door to door, to sell magazines. Riley Keough plays Krystal, the leader of the crew, and Shia LaBeouf plays Jake, who recruits new members. There's freedom and hard partying that come with this life, Star doesn't essentially agree with some of the group's methods, although young love and jealousy ultimately motivate Star to bend her own morality rule just to prove herself.<br><br>Firstly, just a heads up, this movie is 163 minutes long, probably not quite as long as those \"Hobbit\" movies but definitely one that you'd have to be willing to set aside a big chunk of your evening for, should you want to check out this film. I have to give credit to writer/director Andrea Arnold, not only for this raw depiction of American youth living on the margins, but also the casting decisions, the actors in this film are so convincing, in terms of their looks, their attitude and the way they carry themselves, you start to wonder if they really do live on the margins. Many of the moments in the film are spent on the characters bonding, so it seems that, and I'm assuming, cinematographer Robbie Ryan had to sit inside that van and operate the camera around as one character has their dialogue with another, and it's already crowded as it is, it'd be interesting to see behind-the-scenes video on how they pulled that off.<br><br>Arnold is not focusing on income disparity in the inner cities, nope, American HONEY showcases income disparity out in the plain fields of the American midwest. But this isn't some kind of poverty extravaganza either like \"Winter's Bone,\" or \"Slumdog Millionaire,\" the characters in American HONEY get by, they do OK one day at a time, but they undergo unforgiving journeys through suburban sprawl through small towns clearly affected by economic downturn, and you see the resilience in their hearts. You may disagree with their methods, some might even see it as dangerous but what can a fractured, abandoned life can do but to fill the cracks however way they can. They're still teenagers going through crushes and heartbreaks, your usual teenage ordeals, but they're also in a situation where they're forced to be independent adults faster, and Andrea Arnold beautifully captures all of that in American HONEY.<br><br>-- Rama's Screen --","user":"Ramascreen","rank":[99,140]}]