[{"title":"Got the condition to a T","rating":10,"date":"15 August 2017","review":"SPOILER: I personally also have AE encephalitis. I also went undiagnosed for many years. To anyone in the past reviews who said it wasn't special, it is. They nailed the hallucinations you get. *hearing and seeing*, the seizures, panic attacks, mania, ocd like symptoms. Everything in this movie was very accurate. Anyone who says it wasn't necessary for making, it was. It's based off the book brain on fire: my month of madness. She was the 217th person ever to be diagnosed with this. We need more awareness. The actors were amazing. Chloe nailed the role and so did the father. The boyfriend was a bit irritating and the beginning is a lil slow but it picks up fast. And when it does, it's like beautiful art. 10/10 would recommend!!","user":"kaitlynmarie-20439","rank":[127,143]},{"title":"This Movie Mirrors Our Experience With the Same Disease!","rating":10,"date":"23 June 2018","review":"This movie has been wrongly criticized for showing clueless doctors. However, this disease was not even identified by the World Health Organization until 2007 and was only named in 2009! My family member has in 2017 been diagnosed with this disease and it was his 47th doctor who diagnosed him!!! Thus, it is important for viewers to know the diagnosis journey depicted in Brain on Fire is REAL and NOT FICTIONAL and COMMON when it portrays how hard in the real world it is for well-known doctors to diagnose this disease so that it can be treated. This movie depicts two important messages: 1. Trust your gut if a doctor says something you disbelieve like \"She must be drinking too much\" or \"She belongs in a mental hospital\" and 2. Keep asking for the views of additional doctors until you get the Dr. House-like Dr. Najjar or his team who figures it out. FYI, Mt. Sinai Hospital researchers are currently conducting a study--independent of this movie but timely!--to report to their profession the high percentage of autoimmune encephalopathy patients who are incorrectly diagnosed with psychological disorders before eventually getting the autoimmune encephalopathy diagnosis and treatment. We recommend this movie especially to anyone interested in the diagnosis process and medical mysteries.","user":"vbjorklund","rank":[88,100]},{"title":"From a Doctor who focuses on a related condition","rating":10,"date":"24 June 2018","review":"Let me preface by stating I am a doctor who has devoted the last 10 years of my career to a closely related condition called PANDAS/PANS, which produces symptoms like Susannah's but in school-aged children. I know the real Dr. Najjar well and we refer patients to one another. <br><br>I think the movie must be judged on the public service it provides as much as a work of cinematic art.<br><br>I think the movie does a good job trying to depict what is happening in the head of Susanna as the disease takes hold. It tries to depict auditory hallucinations and epileptic phenomena, which only a small percentage of viewers have experience with. Just imagine the terror a person walking the busy, noisy streets of Manhattan must experience while experiencing intense auditory and visual hallucinations. The sad truth is, there are many many homeless people in big cities who are experiencing this every day. <br><br>The particular condition Susannah has is \"rare\", but there are thousands of people with the category of disease to which it belongs - so called \"autoimmune encephalopathy\" (AE). I think the movie shows a sharp contrast between 20th century psychiatry (psychoanalysis, drugs) and 21st century psychiatry, where a few pioneers like Najaar are actually looking for root causes. <br><br>Just to give you an idea of the importance of this condition, Columbia University Vagelos School of Medicine held a two day conference this past March on AE and PANDAS/PANS. I can tell you that EVERY person with a sudden change in mental status, with no prior history of the same, and no simpler explanation MUST be evaluated for AE and, in children, for PANDAS/PANS.<br><br>It just might save them for a needless lifetime of visits to the Cuckoo's Nest.","user":"chiggen-99509","rank":[84,96]}]