[{"title":"A prime example of how NOT to make a War film.","rating":5,"date":"16 June 2018","review":"For the first half hour or so I didn't know what to make of this film. The tone was all over the place and I couldn't tell if the filmmaker wanted to make a War film or a drama.<br><br>I'll do my best not to spoil anything, but it wouldn't matter if I did, as this film isn't worth your time. It was very clear throughout the film that the writers/filmmaker, either weren't very knowledgeable of the US Army and how soldiers address each other, conduct themselves, or what battle drills are or how they are conducted. <br><br>These two young soldiers we follow constantly refer to a non-commissioned officer as \"sir\". Anybody who has served knows that is a big no no and would earn them a nice smoke session(forced strenuous PT) until they address him properly. This is just one of many issues with the film.<br><br>I honestly have no clue when this movie is set. Based on their uniforms I assume it takes place during the early stages of the invasion of Iraq, yet bars and private homes have modern flat screen wall mounted tv sets? Also there is a scene near the beginning, of the two leads meeting each other at a shooting range, but I couldn't tell if it was supposed to be at bootcamp, or at their assigned duty station. This film is rife with this style of poor writing.<br><br>The War scenes should've either been cut entirely or presented more ambiguously. Because these actors and the director slept walked right through them. None of it felt earned or organic, which is partially due to the lifeless foley. The rifles, LMGs, explosions, hiss/snaps of incoming fire etc. all sounded like it was meant to be marketed to the elderly, so it wouldn't hurt their ears. I'm surprised nobody stepped in and told this director to get some kind of energy and passion out of the actors. <br><br>By about the fifty minute mark it was clear that they were going for a mystery/drama, but even that felt unearned. None of the dramatic scenes felt natural, it felt as though the writer was searching for something to keep the audience invested.<br><br>This wasn't the worst War film I've seen, but it's not a good one either. It tries too hard to be multiple different things at once, the acting was average at best, there wasn't enough build up to any of the plot points, the directing was weak for the most part. There is a good movie in here.... Somewhere. They just couldn't find it.","user":"EndeAbgrunds","rank":[76,96]},{"title":"No military adviser on set???","rating":1,"date":"25 December 2018","review":"These studios that want to make military movies need to hire advisers, I'm sure there are a million vets out there that will do it just to see that it's done correctly, I would gladly. I got 4 mins into the film before I turned it off. Specialist insignia upside down on uniform, people calling an NCO \"sir\". C'mon now, it's 2018. There's probably more war vets alive in the history of America than ever before, least you can do is get it right if you're going to portray us!","user":"combatproven-12615","rank":[20,24]},{"title":"Difficult to Watch at Times But Still an Important Film","rating":7,"date":"16 August 2018","review":"Will not appeal to those looking for an action oriented war movie, as the film is a methodically paced and cerebral look at the devastating effects of war on soldiers both on the battlefield and on their return home.<br><br>The three leads here Tye Sheridan, Alden Ehrenreich, and Jack Huston give fine performances, with strong support from Jennifer Anniston and Toni Collette.\nYou'll have to wait till the end of the movie to find out how the mystery of what happened to Private Murphy (Sheridan) unfurled, amidst the film's numerous flashbacks.<br><br>Overall, this movie, despite being most difficult to watch at times, is still an important one illustrating the horrific effects of war on many soldiers.","user":"larrys3","rank":[14,17]}]