[{"title":"Non-dramatization of real people and a real life event","rating":7,"date":"22 August 2015","review":"Before you watch this film you should put some things into perspective - it's a family friendly film about native LDS missionaries escaping a war zone. It's a true story about real people (all Liberians - this is not a story about Americans) and their experience so don't expect it to be a dramatized thriller or action movie. If you're looking for a movie to highlight the terror and horrors of a war in which 200,000 people were murdered and 850,000 fled the country- this isn't it ( one, this isn't what the film is about, two, this film takes place at the start of the war when the terror that was to come was still in its infancy and three, the violence is only hinted at I assume to keep the movie non-graphic). <br><br>Now that you have some perspective - I liked the movie. The movie is shot in Ghana and are primarily native actors. Great story, great soundtrack, great cinematography, beautiful landscape shots, and very authentic feel overall. I lived in Ghana on a Liberian refugee camp and this movie took me back there in every way. A lot of movies set in Africa either turn the African actors into pseudo Americans or the other extreme of turning them into American stereotypes of Africans. I was so pleased that this film tried to keep true to the people, culture, and overall setting. The characters were all very \"normal\" and fit pretty well into my experience with Liberians (and Ghanaians). Now some people will hate that and think this movie is boring because the actors and script don't have the typical Hollywood feel, but for me, it was really refreshing that they and their experience weren't over-dramatized. I would recommend this movie if nothing for the insight into what West Africa is like. This includes the characters overall emotional reactions - Americans culturally display emotions, Liberians not so much and the movie was true to that cultural difference. From the clothes to the personalities to the social interaction - again, this movie kept true to the region.<br><br>What I wish they had done better - there was no back story or any of the characters and as such made it hard to really connect with them. Familiar with the actual story, the movie did feel like it oversimplified things a bit (in reality they went through 50+ checkpoints). It was never really clear why they were leaving until they end when they clarify they hadn't been able to teach for six months. Once the rebels reached Monrovia, their choice was to either to end their missions and go back to their families in Liberia or they could continue their missions in Sierra Leone. I wish that had been explained better because, like other reviewers, it kind of felt in the beginning like they were just ditching out. The movie never really dug into their fears and worries about the situation- from not knowing what was happening to their families to seeing people killed to running out of food. Also the rebel church member was a bit weird without context. Because I'm familiar with the war, I know that, in a country mired in abject poverty, many joined the rebels because they had no other option. It was the only \"job\" they could get and only option for food and shelter. At the end, it's clear this guy wasn't aligned with the rebel ideals - I think the movie could have been better if they explored a little bit more how torn he was. Finally, there's a few gaps they could have filled in, namely how they ended up at the ferry in the first place and how they dealt with the passport issue. It's a true story and I know they got across, but that's a detail that would have been worth explaining.<br><br>All in all - if you're LDS you'll probably like this movie. If you're connected in any way to Africa, you'll probably like this movie. If you like stories about real-life events, you'll probably like this movie. If you're looking for an action-packed thriller or movie about the Civil Wars, you probably won't like this movie.","user":"missczechrepublic","rank":[21,26]},{"title":"Strange Reviews","rating":1,"date":"18 August 2015","review":"A really dreary, boring and uninspiring film. The only surprise I got was the positive reviews before watching this film. I thought that maybe this was a mistake until I saw the location of the reviewers. All from Salt Lake City or Utah. So total bias. This film is about Mormons and it gets 10 stars from Mormon reviewers? I thought lying or bending the truth was a sin guys? The film is poorly acted and badly shot. Reminds me of a really, really bad B movie and deserves to go straight to DVD and then the bin. Unless you're a Mormon you won't really like this, and even if you are, it's probably because the Church of Latter Day Saints told you, you had to watch it and then post positive reviews on IMDb. Everyone else, please avoid.","user":"mattevans72","rank":[65,91]},{"title":"Mixed feelings","rating":5,"date":"24 August 2015","review":"Well, I am one of those suckers that will watch anything (I literally mean anything) with the \"inspired by a true story\" tag on it! This is one of these cases. I started watching this movie and I kept on waiting for something. Something that would intrigue me into it. Nothing. <br><br>It felt like I just stared at the screen for the duration of the movie with no feeling whatsoever. The characters were not analyzed enough, remaining on a superficial level. No explanation for their motive or incentives and a bunch of actors that would not be missed even if they gave up acting today. <br><br>The movie was not shot well and many of the scenes that could have been nice, were lost among others. The plot is overly simplistic and slow and it offers no \"revelation\" whatsoever. Even in the end, the solution that is given is somewhat too easy and simple-minded with lots of holes in it. Overall it felt like this true story could have remained untold. No one would miss anything! I gave a five to it, only cause I appreciated the historical background that came with it.","user":"palavitsinis","rank":[9,11]}]