[{"title":"A non-hateful Star Wars fan who liked it","rating":7,"date":"6 August 2018","review":"So I am of the generation who got to experience Star Wars feom the beginning. Standing in a crazy ling line, literally wrapped around the local theater back in 1977 as a kid. Totally unaware I was about to see a movie that would become my central interest for all my childhood, early teens and once again as an adult. And all these years later, able to share this fandom with my own son. \nI liked Solo. I wouldn't say it's my favorite but it was a fun ride and it evoked the feelings that I associate with Stat Wars. The world and characters felt right. It showed us some cool new things about life in that world, living under the Empire. The amazing cityscapes of Corellia... It felt similar to me to Rogue One. Modern filmmaking techniques yet convincingly evoking the vibes of the classic Star Wars world. \nAnyway, I just wanted to put in some positive review for this movie to contrast this strange wave of hate feom \"fans\" on here. I don't really understand it. I have liked something about every Star Wars movie there has been. Some are better than others. There are weaker moments in every one to be sure. But none are worth the irrational seeming hate some people are putting out there.\nSolo is good and worth your time if you like Star Wars. Just one fan's opinion.","user":"poopville","rank":[875,1]},{"title":"For anyone who feels discouraged by the reviews","rating":9,"date":"31 May 2018","review":"For anyone who feels discouraged by the reviews, I tell you this: They're not complaining about the movie, they're complaining because they feel abused by a continous stream of movies from a beloved franchise. It seems ironic, I know, but having nothing for so long and suddenly watching different posters every six months, has to be confusing and bound to raise some eyebrows. \nHowever, we have to look at it as objectively and simple as possible: If you love movies, you want to watch as many movies as you can. And if you love Star Wars, you love to experience the Star Wars' story! So all of this backlash for having so much of the thing you love is simply a tantrum that I hate to see on so many of my fellow Star Wars' fans.<br><br>This a very well made film that anyone can enjoy. Plot, acting, FX, Photography, Cast, etc. They did a great job with everything. Taking into account the enourmous pressure of making a film from such a historical franchise, I take my hat off for anyone who has the bravery to do this.<br><br>So, go and watch it, not with skepticisim, but with that natural feeling of curiousity and love you have every time you sit at the movie theater. I promise, you'll be pleased.","user":"lastjosh","rank":[704,1]},{"title":"Why do I like the Star Wars spin-offs more?","rating":9,"date":"18 July 2019","review":"This and Rogue One are my favorite Star Wars movies. Alden Ehrenreich is so good in this movie as Han Solo. Love the whole sequence of him trying to escape the planet with Kira at the beginning. One of my favorite scenes in Star Wars is when you see Han Solo fighting on the side of the Empire on MImban. Some of the best 7 minutes in Star Wars. The whole Kessel Run sequence is good just not my favorite. The 3rd act is unique with a shoot out in a small room. Love the twist with Enfys Nest that Han actually kinda started the Rebellion. Stand out characters include Han, Chewie, Lando, and Tobias Beckett. Love the whole Conveyex robbery scene. Love new Star Wars vehicles and troopers and some standouts include heavy Tie Fighter, Conveyex, imperial At hauler, Mud Trooper, Mimban Trooper, and Range Trooper. Just such a fun ride and the pace is so good.","user":"FluffyPantsReviews","rank":[40,53]}]