[{"title":"Snowden was a Patriot","rating":9,"date":"17 September 2016","review":"I don't understand people that complain about this movie. <br><br>There is zero to complain about in this movie. You got to wonder if the low reviews are government paid employees or just Oliver Stone haters.<br><br>I couldn't keep my eyes off the screen. I was mesmerized from the beginning of the film until the end. I honestly had no idea it ran two hours and 20 minutes. A movie is never too long if you don't look at your phone and check the time. Myself, nor did anyone in the theater once look down at their phone. The movie had great cinematography, excellent pacing, strong emotional dialogue, and solid character/relationship arcs. You can't ask for much more of a drama based on a true story. Excellent job Oliver. Welcome back! <br><br>The truth is people don't want to hear it. If it doesn't directly affect their cozy iPhone streaming lives, than they don't want to hear about it. They don't want to hear that they are wage slaves. They don't want to hear that there is no such thing as privacy in this country. They don't want to hear that the government isn't a democracy. People don't want to hear that the American government isn't a government at all, and that it's been replaced by a multi-national fortunate 100 corporate conglomeration funded by the international banking cartel. People don't want to know the truth.<br><br>I'd venture a guess that most of the people that rated this movie poorly didn't even see the movie. These are the same people that can't handle the truth. Open your eyes people. Don't be another corporate wage slave.","user":"rysmith25","rank":[447,530]},{"title":"Watch this instead of, or along with, the documentary: Keep an open mind","rating":10,"date":"29 March 2017","review":"For those who don't like documentaries (the documentary about Snowden, which is part of this movie, is excellent education about what our government can do with us) watch this first. Oliver Stone paints a portrait of a stand-up, pretty much button down guy who realizes the work he falls into is anything but what he was taught was right -- and then he needs to find a way out, without endangering his girlfriend. Another great film about a whistleblower --- and for his whistleblowing, he faces far harsher penalties just for coming home. Oliver Stone delivers thought provoking film again, and the entire cast, as well as the writing, is stellar.<br><br>For those who made up their mind about Ed Snowden through what was reported in mass media, I would simply say, watch this with an open mind. What happened to him could happen to any of us. This is a cautionary tale based on true facts told in the most exquisite way by Stone and his cast.<br><br>Isabeau Vollhardt, author, The Casebook of Elisha Grey","user":"cinswan","rank":[32,34]},{"title":"Excellent movie, well worth the price of admission.","rating":10,"date":"16 September 2016","review":"Very well made movie, very well acted, and directed. <br><br>Going in I was worried that the movie would turn into an action thriller or a love story that would cloud what really happened.<br><br>I was pleasantly surprised to find a step by step account of real events with a deep look at what goes on behind the scenes at the various spy agencies.<br><br>Personally I would have liked a little more time spent on the politicians (and other behind the scenes players) and how they acted before and after the Snowden revelations, but maybe that's a topic for another movie<br><br>I would recommend this movie to anyone interested in modern history and geopolitics","user":"peter-31732","rank":[233,274]}]