[{"title":"Go see this film if you've forgotten how to feel","rating":9,"date":"4 September 2017","review":"It's a long time since I've seen a film as affecting as this (principally because it isn't emotionally manipulative, which I always resent). Instead it just tells a simple tale of simple folk living in simple times, between whom love eventually blossoms against the odds. It's also a sobering reminder of how hard times were in the early 20th century in rural communities, where gossip and malice were endemic, people worked their fingers to the bone and there was no room for sentimentality. That very unsentimental ethos permeates the film, though of course in many cases it tips over into cruelty, and the cruelty Maudie suffers is at times unbearable. Yet for those tempted to walk out, stick with it because her life improves and she evens starts to smile a bit, once the art therapy kicks in. Take a box of Kleenex, expect to feel humbled (and never to complain again about your affluent neuroses). Beyond that, both leads (Sally Hawkins and Ethan Hawke) are great, and the photography of Newfoundland &amp; Nova Scotia is beautiful, capturing the seascapes and landscapes in the brilliant light.","user":"percyporcelain","rank":[80,83]},{"title":"Understanding what you value in life.","rating":10,"date":"1 September 2017","review":"When you are compelled to write a review, and you realise this is your first ever review of a film, you then understand the impact that a true classic has.<br><br>Sally Hawkins, Ethan Hawke, well done! If you want to sit down to a less than fast, but utterly embracing film about life's journey, and how individuals are valued, how they react to outside pressures and put their whole world at risk, then this is the film for you .<br><br>Simply.. Brilliant.","user":"afyfe-46314","rank":[57,59]},{"title":"Masterpiece","rating":10,"date":"22 July 2017","review":"For me, this is the reason I go to the movies. Always in the expectation that when I walk out of the theater I simply will not be touching the ground. This does not happen frequently, but with \"Maudie\" the magic occurred. An amazing story eloquently told. Sally Hawkins is superb, touching and profoundly human. Ethan Hawke is at his best. There is a believable chemistry between these battered beings. When they do take flight, they soar over this crude grandiose landscape so beautifully captured on film.<br><br>It's early, but the award community have a sure bet in this unforgettable gem.","user":"caroseraie","rank":[82,87]}]