[{"title":"For Wes Bentley fans ONLY","rating":1,"date":"30 March 2017","review":"IF you aren't a Wes Bentley fan there is LITERALLY no reason to watch this film. He is the ONLY redeeming quality the film has to offer. He is great in pretty much everything he's in, so other than casting him in the psycho lead, there was nothing else to redeem it; this movie was awful on every level. They either paid Wes Bentley a ridiculous amount of money to act with the rest of the clown car full of so called \"actors &amp; actresses\" in this horrible pile of drek, or he owed someone a HUGE favor. The kind of favor that involves saving someone's life, or the kind of favor that involves someone keeping a horrible secret you don't want another living soul to know about. Either way, he is the single solitary reason to waste an Hour and a Half of your life you'll never get back.","user":"sloppy_tuna","rank":[13,16]},{"title":"Beyond bad","rating":1,"date":"6 October 2016","review":"First, there is a reason this didn't make it to the theaters or I think even have a preview in the US. Even having it come out on DVD is a waste. One of the worst actresses I have ever seen. No realism, emotion or anything that would make you believe she is going through what she is. How is she an actress? The husband just as bad, the villain had a little going at least but he had to play against these two, her being the worst so it didn't help him at all. Could had given me a little something to make it look somewhat real but it just didn't work, at all. Could say the writing was bad and that some of the scenes and what the characters did was just the result of possibly bad writing and it made the whole thing look bad but they were just terrible. I'm not going to spoil it, it does that on its own but understand it's bad acting, bad writing, scenes just didn't make sense, and just didn't have me wondering what would happen next because I didn't care. Had to see it to the end to try and help,others steer away if possible or at least try and come up with one positive, sorry I could not. They played the typical types you would think but just badly. The shocker at the end made me say , God please don't do another. Go see another movie, save yourself","user":"tdeluca-06692","rank":[27,44]},{"title":"Not broken but not a fix also.","rating":6,"date":"28 May 2018","review":"All a bit daft, but harmless enough entertainment if nothing else better to do.<br><br>Would appeal more to the girls than the boys","user":"bryangary65","rank":[3,3]}]