[{"title":"TDER: Him, Her, Them!","rating":7,"date":"26 January 2015","review":"So yes, I watched all the three movies before making any judgement. I only did it because I saw some comments on the movie (Them) saying that it was messy and then someone saying that it was best to watch the three to better understand. I started with Him, followed to Her version and ended with Them for chronological reasons. Some people say that Her is a better version, but I decided to stick to time factor and follow the directors way.<br><br>So is it worth it? *Really trying not to say any spoilers so I don't ruin it for you* Him really gets the guy perspective of everything that is happening around and we see only his version of events, his feelings everything about him. By now we don't really know what's happening and it seems just like a story about a break up. <br><br>With Her we get the girls version and here is were we really comprehend the trigger point. I love how they explore differences between the moments that we seem them together. I think it's pretty amazing because every time we put two people talking about things from their past, even though they lived it together, each of them always seems to have differences in their memories, so it's quite amazing to see it (a first time for me) in a movie. <br><br>Them it's the putting together of these two people. I confess I was a bit disappointed with this last version. I expected a little more after the first two movies and certainly a putting together of the pieces. Even though it still manage to surprise us with small differences of what we already seen. I guess after the first two I got my expectations high, but maybe it was too much. I tried watching it as I hadn't seen the other two and it was surprising how, even it seemed confusing at the beginning without seeing Him and/or Her, in the middle we get to understand things without they being showed to us.<br><br>The end was not absolutely what I was expecting. Here too I was expecting more. But somehow it managed to still conquer me. I guess on this part the soundtrack really gives an amazing help. <br><br>So yes, it's worth watching the three otherwise there are some little pieces that connect us to the story that you will lose. My advice: watch Him and Her and later watch Them. The soundtrack connects very well with the dynamic of the movie. This is a \"dramance\" and it's about love and lost so you can't expect much action or fairy tale ending. It's real life pouring on! Jessica Chastain and James Mcavoy perform it very well and what we have here is original cinema. Hope I've been helpful without spoiling.","user":"LivBrumei","rank":[43,47]},{"title":"Fantastic performances from Chastain and McAvoy, but felt like an incomplete film","rating":5,"date":"4 February 2015","review":"\"All I want is a chance to just talk it out. After that you can disappear to wherever it is you disappear to.\"<br><br>To be honest I had no idea what this film was about before going into it. All I knew is that it starred Jessica Chastain and James McAvoy, two of the most talented actors I've seen in the past few years. The title had me fooled because I was expecting this sort of suspenseful thriller similar to Gone Girl. During the first scenes I was lamenting that Chastain would probably only be in a few scenes since she would eventually disappear, but what a fool I was. This was actually a romantic drama (or should I say anti-romantic drama?) with two strong lead performances centering on a couple who have experimented a tragedy in their lives and aren't capable of coping with it together. They've become distant and love seems to be only a far away memory. In a sense it has a similar style as Blue Valentine where you get flashbacks of the couple when they were in love contrasting with their present situation. While watching this film I had no idea that director Ned Benson had actually made two movies about The Disappearance of Eleanor Rigby from the view point of each of the characters (His and Hers). The version I was watching was a compilation of both those films, summarized in two hours going back and forth from both their view points. It was no wonder I felt like something was missing in this story. If you were to watch both original versions of Benson's film the running time would be over three hours long, but in Them the film is cut into a two hour film. I never felt like I got a sense of who these characters were in this version and I wonder how much it had to do with the fact that so much was cut out of the film. After experiencing Benson's two hour joint film I have no intentions of watching the separate films because I was incredibly disappointed with how vague and void this character study felt. By the end of the film I couldn't relate to either character and felt like they did around their parents when they had no clue what they were talking about (they both use this same line towards their parents in at least a couple of occasions).<br><br>Despite the slow pace of the film (the two hours actually felt like three) I was still hooked with the story expecting it to head somewhere. Jessica Chastain and James McAvoy are such great actors that they held my interest in the film and they were a pleasure to watch. The story unfolds in such a way that you don't get much of a sense as to what is happening. As we get some flashbacks we begin to understand what triggered the couple to grow apart from one another, but some things are missing. There are also very strange relationships that Chastain's character has with her parents (Isabelle Huppert and William Hurt). She also shares a few scenes with a Professor she begins to take classes with played by Viola Davis, but those scenes also felt disconnected from the entire film. The same thing happened with McCoy's character and the odd relationship he has with his father (Ciaran Hinds). He owns a restaurant/bar and works with his close friend played by Bill Hader with whom he also shares some strange and misplaced scenes together. Perhaps it was the way that both films were joined together, but I felt like something important was left out and I wasn't able to engage with the characters despite enjoying the performances. Chastain is fantastic and continues to get better over time. She has had stellar roles this year in Interstellar, A Most Violent Year, and now this. Perhaps her breakout role came in 2011 with Take Shelter and The Tree of Life, but she had already collaborated with Ned Benson a year before for one of his short films, The Westerners. If you are a fan of Chastain's work I'd recommend this film, but otherwise I'd suggest you to watch the two separate films because Them felt incoherent and incomplete at times.","user":"estebangonzalez10","rank":[8,9]},{"title":"A Great Approach and Objective, with a Sloppy Execution","rating":5,"date":"19 September 2014","review":"Yesterday, I went to see The Disappearance of Eleanor Rigby for a pre-release screening by Louisiana International Film Festival. As the directorial debut for Ned Benson, this movie stars James McAvoy and Jessica Chastain as a young married couple that eventually crumbles. It is a combination of three short films: Him, told from the perspective of James McAvoy's character, Connor, Her, told from the perspective of Jessica Chastain's character, Eleanor, and Them, which features their relationship. <br><br>Truth be told, I wanted to like this movie a lot more. Some of the parts were very intriguing, and then some other parts were like watching paint dry. The romantic scenes with both of them together were the most interesting and fascinating. Their chemistry together was great, and their connection was felt and natural. With the two separate perspectives, however, I was drifting in and out. At one point, I even dozed off. Both perspectives were unbalanced, as I felt like there were more parts with Eleanor than there were with Connor. Or at least, I got more out of Eleanor than Connor. From Connor's side, it was a decent tale, but there wasn't a lot of his story coming out, and it wasn't very exciting or interesting, even with the addition of Stuart (Bill Hader). Eleanor's side was a lot more dominant, and it was a mixed bag. It provided more interest, thanks to the subplot with Eleanor and her sister Katy (Jess Weixler). At the same time, some of that was repelling. The actions and behaviors that I got came across as redundant, childish and stand-offish. In other words, the subplot has a yin and a yang.<br><br>The approach that Ned Benson took was very original and rare. He built a full-length story out of three short films that all tie in together. It's a very inventive approach, and someday, there's going to be a filmmaker out there that gets it 100% right. Sadly, for The Disappearance of Eleanor Rigby, the narrative structure felt disoriented. As a whole, the movie was lost in translation. The objective was understandable, which was to showcase how they fell in love and where the marriage fell apart, but it was tough to interpret that from beginning to end. Pulp Fiction is one of many examples that pull off a great movie with a non-linear narrative. This movie was nowhere near that level, but it did a good job in its efforts. Also, there were more things that I felt needed to be elaborated on. The story was lacking a lot of things that would've carried out the premise successfully. Instead, it only felt somewhat unfulfilled.<br><br>If I can separate those short films and judge them by themselves, they would've been very successful. They are very genuine stories, they had some almost superb acting performances, and their intentions were very smart. In my personal opinion, taking these three short films and merging them to create a 2-hour movie resulted in a jumbled narrative. The objective of the story got lost in the shuffle, the plan went halfway, or maybe too many ways, and in the end, there was some emptiness left inside. Not just for our two lead characters, but also for the viewer that went in with high expectations. Perhaps, they needed to be combined in order to tell the same story, but it would've been better off as a side-by-side collection of short films, or at least it should've been given a better structure. Yet, this was the movie that I ended up getting, which was OK overall, but I expected more. Eh, it happens. <br><br>Score: 50/100","user":"mrturk182","rank":[26,36]}]