[{"title":"a family movie about the power of love to change things","rating":10,"date":"4 November 2015","review":"This is a movie for the whole family - make some popcorn - gather the kids - sit back and enjoy a wonderful story with a great message for everyone - There is humor, kids, animals and love - a great combination for a simple story - protect each other and love each other - who doesn't like that message? If you like animals you are sure to love Marshall - he brings together a mother and son and the new love of Mom's life - he changes a hoarder's attitude - and he puts a big smile on everyone's face.<br><br>This movie brings back some simple ideas - treat each other well - know that there are tough times - work to understand each other and Never let anyone or anything be bullied!<br><br>Ghandi said something to the effect that you can tell a lot about a nation by the way it treats its animals.","user":"jld-43182","rank":[4,6]},{"title":"Ugh","rating":1,"date":"28 March 2019","review":"I'm not sure I can get through this movie. There are some idiots (I'm sorry but) the asst Coach, the dumb, no SPER dumb waitress, that drove me crazy 1. With their poor acting 2. Poor directing by the director or they would be better? Just pretty terrible so far...but if it changes I will say. IF I can wade through anymore. The lead kid is cute and so far does a good job tho. Crossing my fingers.","user":"Sueso","rank":[1,1]},{"title":"Famly friendly","rating":10,"date":"1 November 2015","review":"I find myelf constantly trying to find something to watch as a family - It's always a tough choice between some lame Japanimation and a live-action movie for older audiences, the kind I have to make my own BLEEP sounds to cover up the gratuitous bad language. This is a movie you can all watch. The story is about overcoming adversity, difficulty of fitting in and bullying... themes that can be relevant to your kids and can be a good conversation starter.<br><br>Do you like movies like \"My Dog Skip\" and \"A Christmas Story\"? Do you miss the days when you could turn on the TV on Sunday evening and have (a pre-Snake Plisken) Kurt Russell entertain everyone? Then this could be for you.<br><br>Sure, it's no \"Citizen Kane\", but the story line moves along well enough to keep you interested and your kids entertained. The only disturbing moment is the scene where Travis has to put down a rabies infected-foaming-at-the-mouth Marshall before he rips anyone's throat out... (oh wait, that was \"Old Yeller\" - nevermind).<br><br>Some really decent acting by kids (which is always a pleasant surprise) and we really liked the performance of Bill Chott as \"Gary\". He played the well-meaning-but-grumpy-enabler-husband to a seemingly-always-drunk-animal-hoarding wife \"Susan\", played convincingly (as if she was totally hammered in real life) by Lauren Holly.<br><br>TLDR; If your kids too young for Bruce Campbell movies and you can't sit through another showing of \"Frozen\" check out \"Marshall's Miracle\". It really is a good family friendly movie.","user":"bullwinklejm-19680","rank":[3,6]}]