[{"title":"black comedy that won't please everyone","rating":7,"date":"20 February 2017","review":"This is one of those movies that you'll either love or hate.<br><br>I loved it.<br><br>The opening scene had me thinking that it was too over-the-top, and I wasn't going to like it, but I just kept laughing. Out loud.<br><br>Being from New Mexico, some of the jokes at the expense of the ABQ PD had extra spice.<br><br>Black comedy isn't for everyone. If you don't like the dark side, you aren't going to enjoy this one. I can understand the reviews from those who like their comedy dark but just didn't connect with this one, too. Different strokes and all. It is wacky, crazy, and out there, not just black.<br><br>I found the chemistry between the two buddy cops great, there are some truly wonderful lines amongst their banter.<br><br>If you can get over the \"silly factor\" involved with being so over-the-top, I think you'll enjoy the ride, otherwise you'll be one of those that \"HATED IT\".","user":"obloco","rank":[38,50]},{"title":"A weird modern tribute/homage/caricature of 70's cop fiction","rating":9,"date":"6 February 2017","review":"I really liked War On Everyone, to me it was an alternate reality made through the trope of American cop movies and TV from the 70's. Not the real 70's but the film fiction of the 1970's but with the movie actually set in modern times.<br><br>I also noticed the viewer has to pay attention or you will miss the connection of each scene to the next (no checking your cell phone). War On Everyone is a tightly woven film where a homage to 70's film/TV style might be too obscure for anyone under 50 or someone who never watched old 70's cop stuff. The movie probably needed some objective editing from someone besides the writer/director.<br><br>I'm 54 and I thought War On Everyone was very funny. :-) I have a tomboy mom who took me to every car chase movie that came out in the 70's - R rated included - and her favorite TV shows (that me and my brother were 'forced' to watch) were Mannix, Dragnet, and Adam 12. I loved Starsky and Hutch 1975 (Huggy Bear reference in WOE). It probably helped me like the movie.<br><br>The movie does not pull it's punches in swearing, offensive racial slurs, and bawdy humor but it strangely passes the Bechdel test when the two main female characters have a scene where they talk to each other about their travels.<br><br>War On Everyone is movie where everyone has their faults but seems to ask the questions, \"Does societies definition of right and wrong mean anything, are there acceptable degrees of wrongness and is there a line that even \"bad\" people won't cross?\"","user":"nanstamps","rank":[44,59]},{"title":"Good Ideas, Not Executed Properly","rating":5,"date":"10 February 2017","review":"If I had to give this film a pass-or-fail grade I would give it a thumbs up, but not very enthusiastically. A lot of the elements of this movie I really like on their surface, but for some reason they don't all come together as a cohesive and coherent motion picture. On the plus side the acting is good and a lot of the sardonic humour played very well for me.<br><br>On the down side this movie just seemed to have a lack of direction and a real \"point\" it was driving toward. I've read other reviews here about how the lack of point itself may be the point, but I think that is letting the filmmaker off the hook. I don't think that's really what they were going for.<br><br>It feels like they wanted at times to make a very black comedy about power, corruption, and the pointlessness of it all (for some), but at other times it's more of a light-hearted and sarcastic \"buddy cop\" flick, and they two just don't quite gel.<br><br>Good acting, it looks great, and a lot of funny moments make this a worthwhile watch though.","user":"MikeSNation","rank":[29,40]}]