[{"title":"More evidence that chronic Lyme disease is real and horrible","rating":9,"date":"13 August 2017","review":"This documentary comes seven years after the first \"Under Our Skin\" from 2008. A lot has been learned about chronic Lyme disease since then not only in the United States but throughout the world. Director Anthony Abrahams Wilson follows some of the victims of chronic Lyme disease from the first \"Under Our Skin\" while bringing the viewer up to date on both what science has since discovered since and how the political battle between chronic Lyme disease deniers and others have changed. It appears that the deniers are losing.<br><br>As I wrote in my review of the first \"Under Our Skin\" what is apparently happening is this:<br><br>(1) some people get a chronic form of Lyme disease and, (2) the insurance companies don't want to pay for the long-term treatment required, and (3) their method for avoiding the costs is to deny the disease exists. (4) Additionally, the sufferers are accused of faking it or having it all in their heads.<br><br>Furthermore, doctors who treat (and apparently cure) patients with chronic Lyme disease are threatened with losing their medical licenses because the medical establishment believes that the long- term use of intravenous antibiotics is harmful.<br><br>What is obvious from this documentary and the previous is that the pain and suffering that victims have experienced is real and horrible. They are not faking it.<br><br>The documentary presents evidence that the infectious agent was able to hide from the immune system in biofilms within the body for months or years. I also believe that the infectious agent Borrelia burgdorferi disrupted or compromised the immune system of some people so badly that it took months or years for their bodies to recover. <br><br>By the way, the disease caused by Borrelia burgdorferi is only one of many similar diseases caused by tick bites throughout the world. Consequently, when doctors are not able to find the Lyme disease agent in a chronically sick person it may be the case they are looking for the wrong bug. Or it could be they didn't look hard enough. In the documentary, we learn that a Norwegian doctor diluted blood samples from patients which allowed him to see previously unseen infectious agents with a microscope.<br><br>By the way, one of the questions asked in this video is did \"Lyme rage\" have anything to do with the horrific murders at Sandy Hook Elementary School in Newtown, Connecticut in 2012? Did Adam Lanza have Lyme disease? This documentary suggests that might have been the case; however, Adam Lanza had a long history of mental and social problems. Nonetheless it is possible since during autopsy he was not examined for Lyme disease.<br><br>I invite the reader to see the recent Australian documentary \"Our Battle Ongoing: Lyme Disease in Australia\" (2017) for more information. Interested people should also read relevant literature on the Web and reach your own conclusions.<br><br>--Dennis Littrell, author of \"The World Is Not as We Think It Is\"","user":"DeeNine-2","rank":[2,3]},{"title":"Complete Quackery","rating":12,"date":"12 February 2020","review":"Brought to us by the same anti-vax type mindset of rejection of peer reviews. This film is total quackery.","user":"random-70778","rank":[1,6]}]