[{"title":"Loved It!!!!","rating":9,"date":"5 December 2014","review":"I loved all of it! It was great to see Oscar and all of the nonsense that his character was known for. He was my favourite character. Of course Hank and Brent were their usual silly selves. It's too bad that Nancy Robertson got a face lift as she did not look like her self and I thought that she looked great the way that she was before she had it done. I thought that the scene between Davis &amp; Hank in Wullerton was very funny. Although he did have a one minute cameo in the film, I found myself missing Phil the bartender. Otherwise I found it extremely enjoyable and would definitely recommend it to anyone. I hope that they make another movie as I do not think that I will ever get tired of Corner Gas, ever.","user":"ruzya","rank":[31,35]},{"title":"Exceeded My Expectations","rating":10,"date":"3 December 2014","review":"I have always been a fan of the Corner Gas series, and was quite sad when it went off the air. I was actually unaware that a movie was being made until a week before it debuted. Of course I bought tickets to the movie. <br><br>As a fan of the show, I'll admit that some of the episodes, while always entertaining, only really became funny to me once I watched the episode a second time. <br><br>Much like the show, the movie has no laugh track, but the jokes were very funny, consistent in their pacing, and a bit less subtle than the TV show. The whole theatre (which was completely sold out) was in stitches the entire film. All of the actors did a stand up job reprising their roles, and it felt like the same old crew even years after the series ended.<br><br>The plot line was good, and in true Corner Gas fashion, all of the wild tangents that each character went on tied together in the end. Also, as a special surprise, Lorne Cardinal was at the theatre and introduced the movie in person. Over all, a great time! Maybe we will be lucky enough for a second movie sometime in the future.","user":"Filmy2020","rank":[34,41]},{"title":"I wept","rating":10,"date":"19 April 2017","review":"I love this movie. I saw it 3 times when it was in theatres. I know it has flaws but it totally feels like an inside joke between the audience and the actors. I love the show but if you're not a fan of the show you might not get the jokes in the movie that are brought over. I am 100% biased but I have a feeling if you're that interested in this movie you are too.","user":"rodgerza","rank":[8,8]}]