[{"title":"V/H/S: Viral sucks balls","rating":1,"date":"29 May 2015","review":"This movie is borderline unwatchable. I tried watching this in two sittings and by the third I fell asleep. It's so bad, it's like they hunted down the worst horror writers and directors in hopes to sabotage a continuing V/H/S franchise and they succeeded. The camera-work is horrendous. It makes the final fight in Alex Cross look like The Raid 2. Awkward edits, annoying static every five seconds, terribly uninteresting plots and terribly written too. It's a shame because there was much potential from the first two V/H/S movies that this could become a good horror anthology franchise because it's such a great premise and found-footage is best in small 20-30 minutes doses but this movie tried to make an actual story with a couple random segments that make no sense. <br><br>Gun to my head, if I had to pick the best segment it would have to be the one with the alien penises. That sentence alone should tell you enough about this movie. It was such a dumb segment and it made no sense but actually attempted suspense and some form of story. The main story is dogsh*t. I hate this movie a lot. I remember thinking after V/H/S/2 \"man, what a great idea for a horror franchise. I hope they continue these\" and then Viral had to come along and take a heaping dump on film and sell it as a V/H/S movie. <br><br>If you liked the first two V/H/S movies, don't watch this. Don't ever watch this movie unless you want to feel depressed and p*ssed off in which case by all means V/H/S: Viral is the only thing you should watch. This movie sucks balls. It should have never been made and whoever greenlit this atrocious script should be fired if they haven't been already. I wish I could unwatch this movie. Spare yourselves.","user":"lnvicta","rank":[71,83]},{"title":"90 minutes of my life I wont get back","rating":1,"date":"5 November 2014","review":"The original VHS was great, VHS 2 was fun and tied in the first one, but I have no clue what the hell they were thinking when they put together this piece of garbage. A couple of the \"videos\" were mildly entertaining, and the one dealing with the alternate universe had great potential, that was, until the end. I watched this with a group of friends and we found ourselves laughing more than anything and questioning if this was a joke or if we were watching VHS to begin with. I am pretty much writing this review just tell anyone who is remotely interested in seeing this to save your money. If you just can not resist, try to watch it with friends so you can, A) split the price of renting/buying it, and B) enjoy sharing laughs with them at the expense of the ridiculousness of this film. Other than that save your precious time, and money","user":"j-w-b-concepts","rank":[64,81]},{"title":"Don't waste your time....i created an account just to tell this to people...such a let down","rating":1,"date":"25 October 2014","review":"I just created an IMDb account to tell people not to waste time on this hack of a movie. I am a huge VHS and VHS2 fan i thought both of them were amazing and i really liked how they changed up a very predictable genre. This movie is nothing like the first 2 except in that it is made of multiple stories. All of the stories are awful, offer no good scares and they never have no closure. The movie ends and your first reaction is to look around for a refund. I am extremely let down angry and disheartened because i had been watching the trailer for months with anticipation and was completely let down and i hope they never make another movie because i wont see it....please don't give these hacks your money. They don't deserve it and they just let down all their true fans. Such a waste of time. I hate them. I am owed an apology and refund","user":"gmoconnor532","rank":[68,94]}]