[{"title":"Silly but funny","rating":6,"date":"19 July 2015","review":"Silly but funny.<br><br>A man accidentally becomes an adult movie star. The stardom turns out to have many downsides...<br><br>In short, an outrageous parody of the adult film industry. Some scenes are incredibly silly and over-the-top. However, for all the silliness, it somehow works. Just. While some scenes are plain stupid and really shouldn't be in any movie, this is more than made up for by the scenes that are quite funny. Plus, the parodying of the industry is quite profound at times<br><br>Certainly not everyone's cup of tea - it's definitely not for prudes - but good fun if you don't take it too seriously.","user":"grantss","rank":[11,12]},{"title":"If you know AV, you'll love this parody to bits","rating":7,"date":"4 June 2014","review":"Someone once told this writer that the 3D medium was made for the pornographic genre, and perhaps that's what Chan Hing-ka made in mind when he decided to make this loose sequel to his 2003 comedy of the same time sans the two characters at the front. Yes indeed, in case there was any doubt, this parody of the Japanese AV industry is offered in glorious 3D, attempting of course to replicate the same kind of bashful pleasure which its predecessors '3D Sex and Zen: Extreme Ecstasy' and '3D Due West: Our Sex Journey' promised.<br><br>Co-scripted by Chan who has since handed over the directorial reins to 'MicroSex Office's' Lee Kung-lok (another sexual farce for the uninitiated), the Category III-rated comedy has one thing going for it which neither of the aforementioned films had - that is, the sheer inspiration of Chapman To. No matter the actor's outspoken public persona which has since earned him the ire of netizens in China, To buffs and bronzes himself for a role which requires him to show more flesh than he has ever done, but it is his spot-on comedic timing that is the reason why '3D Naked Ambition' is such a guilty pleasure.<br><br>No stranger to such farces after pulling duties in as 'Vulgaria' and 'SDU: Sex Duties Unit', To here stars as a magazine writer Wyman Chan, who has most recently lost his job writing steamy stories for a saucy magazine. After commiserating with a buddy (Derek Tsang) about the death of porno VCDs/DVDs with the availability of free Internet porn, Wyman rounds up a few like-minded Hong Kong guys and travels to Tokyo to get to the heart of AV itself - i.e. to invest in their own AV content production and not only with the hope of making some money out of it, but also to have the opportunity to watch the filming live in the flesh.<br><br>A word of warning - the more bashful members of the audience (you know who you are) might want to bring along a sleep mask, for there are plenty of scenes that you will inadvertently turn red over. Wyman's trip to Tokyo becomes his initiation into the world of AV professional acting, as the novice learns it the hard way (pun intended) being made to replace the male lead next to actress Yui Tatsumi in a porno shoot. His unexpected overnight success leads to some 'finger foreplay' training under veteran AV actor Taka Kato, and further AV shoots under the screen name of Mario Ozawa (a reference to AV goddess Maria Ozawa) in familiar scenes such as a body check under the school matron, a subway car molestation and even an alien S&amp;M attack.<br><br>For the uninitiated, these send-ups of classic AV clichés will probably seem exaggerated and worse, strained; but trust us that those who are familiar with the subgenre (we're being extremely politically correct here) will likely be laughing their heads off. The twist here of course is that To plays the reluctant male here exploited for sex, in a clear gender reversal from that which one usually finds in AV movies. It's completely tongue-in-cheek of course, and To gets excellent support from real-life female AV stars Nozomi Aso, Anri Okita and Yuki Maiko in his madcap routine.<br><br>The cameos don't end there. Other Hong Kong actors also appear in minor roles, including Wong Jing, Sandra Ng, Charlene Choi and Louis Koo - the latter in particular appears as To's rival Naoki Nagasaki, who provides the obligatory showdown for the movie to wrap things up on a relative high. Besides poking fun at the lucrative AV industry, Chan's script is also rife with colloquial humour that purposely thumbs its nose at the Chinese censors (presumably, the filmmakers never intended to make their product available for the China market) - a reference to China's belligerent posturing for the Diaoyu Islands proves surprisingly hilarious.<br><br>Ultimately, '3D Naked Ambition' knows exactly what it wants to accomplish and does exactly that. It doesn't purport to be high art, or anything else for that matter, except skewer the Japanese AV film scene - that it does with great hilarity thanks to a largely witty script by Chan and a very game male lead in Chapman To. It also pushes the R21 limit in terms of the number of boobies on display, so that should be incentive for those who were undecided whether or not to watch this in 3D, Trust us, it's worth the extra D.","user":"moviexclusive","rank":[23,30]}]