[{"title":"This was, to me, the best of all the movies made from his books. The characters were actually real and believable.","rating":8,"date":"1 May 2016","review":"\"Every path you take leads to another choice. Some choices change everything.\" Travis (Walker) is a confirmed bachelor who loves being single and doing what he wants. When his new neighbor Gabby (Palmer) shows up at his house everything in him changes. Now Travis will stop at nothing to be with her. After all his pursuits he finally wins her over, but when the unthinkable happens Travis must once again make a choice that will affect both of their lives forever. Going in to this I was not excited at all. I know 99% of women love the Nicholas Sparks movies, but for me they are just too ridiculous. In the Notebook the main guy builds the woman he is obsessed with a house. In The Lucky One within a week of meeting the girl he fixes her car, boat and teaches her son to play baseball. It is hard for me to get past the perfect man image that is portrayed and they really lose me. Again, being a guy I am not the target audience for these movies. All that said this was, to me, the best of all the movies made from his books. The characters were actually real and believable. There were no over the top scenes and I was actually into this movie more than I expected. Without ruining anything, the ending did get over the top cheesy for me and lost me a little, but since this is a chick flick that is to be expected. Overall, it could have been because of my expectations but this was not a bad movie at all and is a date night movie women will love and men will be able to watch without too much pain. I surprisingly, extremely surprisingly, give this an A-.","user":"cosmo_tiger","rank":[44,62]},{"title":"The dog, Moby was the most credible character in the movie.","rating":2,"date":"13 February 2016","review":"If you are looking for a movie you can zone out during this is the one for you! The Choice once again delivered Nicholas Sparks tried-and-tested formula, full of Hallmark moments oh and not forgetting a basket full of puppies!! Only this time it felt a bit like a check list. Boy meets girl ✓ Girl is not interested in boy ✓ Boy and girl get together ✓ Boy takes girl out in a rowing boat ✓ Boy and girl split up ✓ Boy and girl get back together ✓ etc etc etc<br><br>The problem is whilst the screen writer and director are ticking off the list they forgot to make it credible. (I felt incredibly sorry for Gabby's dog who gives birth to puppies who look about 8 weeks old OUCH!!) <br><br>I will say that in the cinema there were a group of girls around 14 years old all ahhing, laughing, crying and clapping so I guess I now know which audience this movie is aimed at. <br><br>Would I recommend my friends go see this movie? No but I would tell them to watch it on TV if they were looking for something to watch and fill time.","user":"kelly-89789","rank":[47,68]},{"title":"Morals and Ethics do not matter as long as you are 'meant to be'","rating":3,"date":"29 May 2017","review":"I saw this a few months back and recently I watched an older Nicholas Spark- novel - turned-movie. I must say the common human behavioral characteristics involved in his movies are one of lies, deception and unfaithfulness.<br><br>This movie above is no different, Gabby is a feisty medical student and Travis is an easy going vet. Gabby already has a long term relationship with a doctor with whom she cheats on, this is justified because 'fate' has chosen this to be.<br><br>This disregard for moral standards shows itself in the movie, the dialogue is very planned and almost seems unnatural for Palmer (who hides her natural accent very badly) to deliver her lines in a convincing manner, the movie tries to hide this with the usual exposing of female physique and the mid-movie romp between the main characters. Walker was a lot less convincing and overplayed his role as a Southern smooth talker and his haircut did not do him any favors there.<br><br>This is your typical Nicholas Spark big screen movie...too long and too predictable.","user":"jeremiahnair13","rank":[27,37]}]