[{"title":"Mediocre Horror-Thriller","rating":6,"date":"28 April 2017","review":"A lot of reviews are giving this movie flack but it's not that bad. I feel like people go into Cage movies now expecting the worse and have already decided how to feel about it before they've even watched it. I'm not about to argue that this film is good (because it definitely isn't) but you could do far worse than watch this movie. Sure, the CGI is terrible and the plot is no good. But we have okay dialogue in the script and everyone in the movie (minus the child actor) does a fine job. Cage isn't hamming it up like he often does and Sarah Wayne Callies does a great job. The scene after they lose their son is rather heartbreaking when you look at her. This movie does fall apart a bit down the stretch, however.<br><br>All in all, it's very forgettable, not recommended, but not terrible either.","user":"Samuel-Shovel","rank":[12,12]},{"title":"So very mediocre, commonplace, average, middling, undistinguished.","rating":5,"date":"11 October 2015","review":"Pay the Ghost is pretty much as mediocre or average as they come. It's not bad, it's not good. It's just there in the middle. Right in the middle.<br><br>(In Norway we have a saying that directly translates to \"in the middle of the tree\", that expression describes this movie perfectly. I don't know what word in English is most suitable though)<br><br>Pay the Ghost had one jump scare that definitely did the job for me. I jumped, and got that cold chill inside my chest. But that was also the only time the movie was remotely scary. Not that it is much horror anyway. It's way more thriller/drama than horror, really.<br><br>Nick Cage is usually entertaining to watch, and also here. Sara Tancredi (you know, Prison Break) does an alright job, her character is a little annoying, but that's the scripts fault. The kid, well, he's.. OK. he has a couple of lines that sound out of place, but hey.<br><br>The effects are mostly good, except a couple of small problems here and there. The story is just interesting enough for me to wanna watch it through. But like I said, the main keyword here is mediocre. Meh. Commonplace. Average. Call it what you will. There are a couple of problems with the script, doesn't seem like a whole lot of thought went into it, at least not into all of it. But that was as I expected, really.<br><br>The movie looks pretty good. I don't know the budget, but it doesn't have that low budget-feel to it. I like it when movies look, you know, at least a little expensive.<br><br>This is one of those horror movies you can watch in the evening on a Sunday or whatever, not the kind you build a movie night around, see what I mean? It's right there smack-dab in the middle.","user":"Finfrosk86","rank":[36,43]},{"title":"Enjoyable ghost film with Nic Cage. Whats not to love.","rating":6,"date":"23 September 2015","review":"6 out of 10. A damn good film. Now that we got my own personal score out the way...<br><br>Its an entertaining, well made horror film for people who enjoy Cage's performance and for lovers of standard horror flicks with ghosts, jump- scares and more of that kinda stuff. <br><br>I think people are overthinking this WAY too much and just getting used to hate on Cage's flicks. <br><br>Come on. This is not a masterpiece. Nor is it supposed to be. Its just a horror film that people can sit down and enjoy. Im unsure about replay value but its definitely worth a watch if you like this genre. The acting is good. Story is decent. Looks and otherwise visuals of the film are good too. <br><br>The strange thing is that this film is supposed to be a thriller... even though we're dealing with the supernatural. But yes :) Im liking it regardless. <br><br>There's not that much else to say, my dear readers. <br><br>Its just a decent film. Something to watch if you're in the mood for a stand-up horror/thriller flick or just wanna see Nick Cage star is a spooky flick. <br><br>Thats it, fellas. Don't over think it. Im not anyway and I think its a decent film. <br><br>But Im just a reviewer who looks for films that entertains me and has replay value above all.","user":"angiris","rank":[25,31]}]