[{"title":"Under the Cherry Tree are Centipedes","rating":2,"date":"14 January 2016","review":"This thing opened at \"Fright Fest,\" huh? Wonder who they thought they would scare? <br><br>\"Cherry Tree\" is about a coven of witches who gain their powers through the blood of living sacrifices. This blood is poured into the roots of the tree and the powers of this coven grows collectively. Sissy, the Grand-Poobah of this coven, desires a sacrifice, albeit the sacrifice of an infant fathered by that cloven-hoofed bad boy, Satan. Sissy must find someone to bear the child, and she meets a girl whose father is dying of cancer. In a quid pro quo moment, the young girl volunteers with the understanding her father will be cured from his cancer. You would think that plot would make for some entertainment, but you would be wrong.<br><br>The \"Cherry Tree\" was just a big old mess from the opening scene until the end. I again was left scratching my old bald head asking way too many questions about such a simple movie. The dialogue was unbelievable, as was the young girl's introduction to the coven. Save the girl who played the innocent, the acting was \"adequate.\"<br><br>Rated \"R\" for nudity, simulated sex, language, and violence. Not recommended.","user":"dcarsonhagy","rank":[13,21]},{"title":"Yes, It's a Rosemary's Baby copy, but it's not that bad","rating":5,"date":"28 May 2016","review":"CHERRY TREE is an Irish horror yarn that comes to us courtesy of the team behind Hammer's WAKE WOOD. I didn't like WAKE WOOD much, finding it an uninspired copy of PET SEMATARY, and CHERRY TREE in turn is a somewhat weak retread of ROSEMARY'S BABY except done on a low budget and lacking that classic film's atmosphere of deceit and dread.<br><br>Saying that, this isn't a bad film at all. It's quite well made and I appreciate what the filmmakers were trying to do here. A young cast give performances that are pretty good for a genre flick, with lead actress Naomi Battrick very effective as a protagonist who must find reserves of inner strength in order to fight some very literal demons.<br><br>As a horror film, CHERRY TREE goes for the gross-out approach throughout, with some very gory moments included particularly towards the climax. KILL LIST is another film that this one appears to be indebted to. The director also has an obsession with centipedes, although they're included as random CGI nasties here rather than being truly disgusting as in an '80s Hong Kong horror flick like CENTIPEDE HORROR. Anna Walton (who played the elfin princess in HELLBOY II: THE GOLDEN ARMY) is highly effective in a crucial role.","user":"Leofwine_draca","rank":[9,14]},{"title":"Lazy impersonation of a horror film","rating":2,"date":"30 August 2015","review":"Cherry Tree was the opening film for Frightfest 2015 and I can only conclude the festival organizers wanted to get it out of the way asap.<br><br>Filmed in Ireland (strangely with very British sounding cast) Cherry Tree attempts to shock the viewer with a coven of nasty witches that are stuck, sort of kinda, under a Cherry Tree plagued with witch friendly centipedes. After occasionally lubricating its roots with the blood of locals boss witch, who teaches hockey to teenage school girls, plans to get one teenage girl pregnant with Satan's brat then kill aforementioned brat under the you know what. Supreme witch powers will then follow.<br><br>The teenage girl happy obliges in the hope said witch will cure her poor dad's cancer. However, this under age mum quickly finds herself in a heap of 'Rosemary's Baby' trouble.<br><br>The first real clue as to how bad this film is are the slow motion shots of town landscapes to pad up the feeble script. This is a hodge podge of horror concepts shoe horned into a truly indolent movie. The dialogue is terrible, the character behaviour implausible and the whole story seems to me a lazy supernatural 'giallo' copy. <br><br>At the Frightfest screening the highlight of the film was the Director, entering just after a hyperactive Jonathan Ross intro, proceeding to catapult a big rubber centipede into the audience. If I new what was to come I'd have left then and there with a favourable impression of said person. This film was like watching George Lucas remake an Argento classic \"Attack of the Clones\" style.<br><br>Why this was Frightfest 2015's opener is a real surprise. Maybe someone stumped up the money to make this an event movie for them. Much better films have followed at Frightfest 2015 I'm pleased to say.<br><br>The only reason I don't rate this 1 is the lead actress (teenage girl) was half decent. However I suspect she wants to forget this as quickly as I do.","user":"Chromex","rank":[14,26]}]