[{"title":"Heidi is Back","rating":9,"date":"11 July 2017","review":"Yes, it does have German or English options as well as English subtitles. The best Heidi I've seen; did it cover all Heidi story aspects - probably not, but what it did cover was more than sufficient to keep the viewer engaged. Acting - superb; filming, editing - superb; authenticity and beauty of scenes - superb. Yes, it's hard to go wrong with this story and you already know how it turns out, but no matter it still felt suspenseful and warm and kindly and adventuresome.","user":"westsideschl","rank":[17,19]},{"title":"Heidi - Bruno Ganz Anuk Steffen -Very Wonderful!","rating":21,"date":"21 October 2017","review":"When I rented this movie, I thought it could never be as wonderful as the 1930's version starring Shirley Temple. This was an amazing movie and pulls at your heart strings. Worth seeing for the beautiful visuals indoors and out. Heidi reminds us that the simple things in life are what make life worthwhile. Thank &amp; Grow Rich Pam Grout","user":"patriciagoldsworthy","rank":[7,7]},{"title":"Very good adaption of a national epos","rating":9,"date":"7 February 2016","review":"Yesterday, i went to the Cinema to look Heidi with my wife to to please her. Besides of the good reviews and the participation of Bruno Ganz I didn't expect too much. But the film convinced me totally, especially emotional. The film is very faithful to the books of J. Spyri even to small details. They are used very good to compound the overall story. Therefore, the film lacks inventions for the story telling. Instead it is using a proper selection of the original material given. As J. Spyri defined the idealised view on Switzerland, this Swiss film showed it as the story was intended . The looks of the Dörfli, the mountain pasture and Frankfurt are really faithful and believable while idealised as it was intended. The Alps panorama was breathtaking as could be expected from a Swiss film. The casting was very good. The short scene of the Alp-Öhi with the Grandma Sesemann played by H. Hoger showed the great actors chosen. The children were very good, too. Anuk Steffen had to carry the complete weight of the story with leading adult actors and she really did. The facial expressions and the language with the mild Swiss dialect was perfect. The roles of Fräulein Rottenmeier and the teacher was laid out overacted. I think it was made to attract children for this film. For a film targeting only adults this was too much. The story is well known, I think and of course J. Spyris master work making it one of Swiss national epics (Quotation from B. Ganz why he took the role). The film follows this absolutely truthfully. For the content of both books, the time is too short so psychological developments could only be hinted at. Another half hour of an extended version concentrating on the development of personal relationships as Heidi &lt;-&gt; Alp-Öhi would make the film perfect. But then it may be too long for a young audience.","user":"dbudelsky","rank":[14,17]}]