[{"title":"It is supposed to be a metal horror","rating":3,"date":"21 June 2019","review":"But the music was weak and laden with synthesizers. It was like a pop band with get-up and of course the jokes were juvenile. I guess this is a joke like Baby'metal' or something.","user":"zaimjaylenn","rank":[37,54]},{"title":"Good effects, but the juvenile humour lets it down","rating":4,"date":"22 May 2016","review":"DEATHGASM is a disappointing indie horror flick that comes to us courtesy of New Zealand. It features a bunch of high school reject death metal musicians who accidentally summon up a demon army thanks to their hellfire music and then must figure out a way to stop it in its tracks.<br><br>As a film, DEATHGASM has plenty to recommend it, not least the quality of the gruesome special effects which are very good. It's obvious that the original EVIL DEAD was a huge inspiration here because the demons in this film look and sound EXACTLY the same as in the Raimi flick, but the calibre of effects makes them work.<br><br>A shame, then, that the film overall is let down by a juvenile script that seems overly obsessed with scatological and anatomic humour. One set-piece in particular involves the use of sex toys and is dumb beyond belief. In addition, I hate the death metal genre of music so the soundtrack was unfortunate and the characters both clichéd and unlikeable. Films like DEATHGASM make me miss the days of well-written horror fare with intelligent characterisation.","user":"Leofwine_draca","rank":[36,54]},{"title":"Where Can I Find A Horror Film Without Humour?","rating":28,"date":"28 January 2018","review":"Why must every horror film have humour? Why is this a must? I see people here praise the humour, but sheep aside why is this a must? Does every action movie have gore? Must every thriller have a musical segment?<br><br>Deathgasm is the typical film that makes fun of metal music too inclusive of drugged out mother, troubled teenager, outcast, bullied, et cetra.. in this case this very extreme metal band has music that is softer than a gospel chant, a keyboard player and nerdy members.<br><br>Whatever... the girl is the coolest but how did she all of a sudden out of nowhere become infatuated with the nerd metal guy?\nHow did the gang's boss get killed suddenly and his henchmen switch allegiance? Why was this music magical and where did it come from? how? What? Explain? No, nothing metal band with keyboards and ....<br><br>\nThis is what people praise as a good film nowadays. No wonder Jar Jar Abrams is considered a director by some people... the world is stupid.","user":"samantha9182","rank":[42,65]}]