[{"title":"Hello Again ... Charmed, but Not Quite Seduced","rating":7,"date":"27 February 2018","review":"Michael John LaChiusa's musical Hello Again first came to Off-Broadway in 1993. Lachiusa's work is inspired by Arthur Schnitzer's play La Ronde from 1897, which examines five couples -- chambermaids, students, prostitutes and noblemen -- in 19th Century Vienna. The play is about human connection and sex, although the act itself is never shown. Indeed, in Schnitzer's script sex was referred to as \"XXX,\" and it is left up to one's imagination if those letters are supposed to represent sexual explicitness, a series of tender kisses, or perhaps both.\nThe story has an engaging hook -- a linked series of lovers, with one actor appearing in two roles, joining the players into a chain. The musical, brought to the screen by Mr. LaChiusa and director Tom Gustafson and screenwriter Cory Krueckeberg, does have some things going for it. The film has a lush, inviting look -- one is tempted to stretch out one character's futon or across the red elevator walls in one character's building and be swept away along with the lovers. In a film with these dual roles, the film nicely folds over on itself in places. One actor sliding on his shorts blends seamlessly with the same actor sliding on shorts decades later. A young man shyly tries on a bracelet during the Titanic's maiden voyage of 1912; that bracelet turns up on the wrist of the same actor in a New York disco in 1976.<br><br>One thing that doesn't work, alas, is the music. Most of it just isn't very memorable, although some of it does work. The film's best song and pairing comes near the end. It features Audra MacDonald as \"Sally,\" who is trying to seduce her lover, a senator named Ruth, played by Martha Plimpton. The decision to cast these two women opposite each other was inspired, for there is a wonderful contrast between the warmth of MacDonald and the coiled steel of Plimpton. Most of the characters in this musical are little more than types, but these two women feel alive. How did these women meet? What are their lives like, apart and together? What do they want? MacDonald, a Broadway star, answers this question when she sings her way through a quite fun musical number \"Mistress of the Senator.\"<br><br>The pairing of Cheyenne Jackson and Tyler Blackburn also works well. Jackson plays Robert, a writer who picks up Tyler Blackburn's Jack in a New York disco in 1976. The couple manages to generate some heat -- I dare say a look from Mr. Jackson could spark even the soggiest of kindling. The score works reasonably well here, moving from a rock feeling at the start, as desire has been sparked, to something sweeter, when the couple entertains the idea that maybe, just maybe, this one night stand might go somewhere.<br><br>So, Hello Again is a good movie but a frustrating one. I found myself delighted at times, but also seeing the missed opportunities. Of course, this is how love works for some of us -- if we are lucky enough to find it in the first place.","user":"rlaz","rank":[12,14]},{"title":"It's actually quite good","rating":6,"date":"6 January 2019","review":"This is a musical about love affairs of people in various time points.<br><br>The music is quite good, and the story is good as well. The segments dealing with gay guys are often the best, such as the segment of two guys on a cruise ship. It is a pity that so little people have watched this.","user":"Gordon-11","rank":[7,8]},{"title":"Really nice idea, poor execution","rating":4,"date":"27 July 2018","review":"Hello Again was advertised as a musical about many shades and faces of love told from the point of view of ten people living in various time periods. Each actor plays two roles and the movie is constructed like a chain with one actor from a couple changing each time. This idea is not new, but it isn't widely used, so it could lead to the creation of a truly great movie. It could if only the stories weren't so bland. I had a feeling I never learned anything about the vast majority of the characters other than they want to have sex. I do understand that is an important part of a relationship, but in a movie consisting of ten stories one would expect a bigger variety of themes. The only story I really liked was the one with Audra McDonald and Martha Plimpton, as it was the only one in which the characters had plans, dreams and ambitions. Sadly, in most of the stories this is not the case and the characters are completely one-dimensional.<br><br>Another thing that was poorly done is the songs. As someone who loves musicals I'm used to singing instead of talking and I really like the convention. However, this doesn't mean that making the characters sing dialogues without any metre is the same as writing songs. The songs in Hello Again sound just like that: as if someone just composed any music that would fit what the characters were meant to say without paying any attention to music patterns. In result the majority of the songs is flat and unremarkable, and it gets more and more annoying as the movie goes on. It's definitely not the type of music I'd re-listen, unlike many other musical soundtracks. In the result, it was quite difficult for me to even finish the movie.","user":"Evil_Herbivore","rank":[5,8]}]