[{"title":"Quite Enjoyable Ghostly Adventure","rating":8,"date":"25 May 2016","review":"Must admit, I quite enjoyed Ghosthunters: On Icy Trails. Probably more than I was expecting to but there you go.<br><br>This is basically the story of a boy who meets a ghost and ends up part of some secret arm/offshoot of the government that basically plays at being Ghostbusters, with the underlying aim to banish the ghost from this world. Or dimension or whatever. The problem is the boy has befriended the ghost and pulls out all the stops to stop his new friend being banished.<br><br>Milo Parker plays Tom, the boy who meets and befriends the ghost. He's a brilliant young actor (and I'm not just saying that because he's British like me) and is one to look out for in the future. Here Parker provides a solid performance along his co-stars and the computer generated ghost.<br><br>This film, looking at other external links and reviews, doesn't seem to be liked. Seriously, it isn't that bad in my view - if I'm in the minority for this film then so be it. To reuse a phrase from another reviewer on another film I also reviewed: Leave your expectations at the door when watching, don't think too hard about what you're watching (this is often a key requirement if you're watching family/kids movies outside of their target audience) and you'll be fine.","user":"neiljones1981","rank":[1,1]},{"title":"Great ghost fun for everyone young at heart","rating":9,"date":"15 December 2015","review":"Cute, suspenseful ghost movie for children and people young at heart or just fans of ghost - fun, a message with heart, good actors and an adorable slimy monster - sure, it does look like Slimer, and, yes, there are Men in Black and other references, but to be honest: which ghost is really original?? Somewhen you have seen it all before, but in this movie, at least it is done nicely and great fun. If you insist on seeing something original, watch \"Mara and the firebringer\", otherwise this is a movie you will enjoy if you allow yourself to have harmless fun. P.S.: of course there are (seemingly useless) dramatic moments - that's called raising suspense and is used in about every movie, otherwise every movie would be 5 minutes long and be called a short...","user":"supermaggie","rank":[4,9]},{"title":"Ghostbusters for kids gone wrong","rating":4,"date":"18 November 2015","review":"\"Gespensterjäger\" is a German 100-minute movie (90 without credits) from earlier this year written and directed by Tobi Baumann. Baumann has worked with Engelke and Pastewka many times in the past already and their collaborations have almost always been really funny. Not so this one. Engelke is almost the only positive thing I can mention about this movie. She nails the comedic parts and proves that she is still, after all these years, among Germany's best female comedians. Pastewka we don#t see, but only hear as he voices a ghost named Hugo. Honestly, this character added almost nothing to the entire movie in my opinion and Pastewka was truly wasted.<br><br>The film's biggest weakness were probably the dramatic parts about friendship, courage and caring for other people. All this felt really only included for the sake of it and to make this film an experience beyond comedy and supernatural humor. It did not work. Also the characters' actions in these dramatic scenes made hardly never any sense, like Engelke's character shouting at the boy near the end. I wish at least the comedy parts were good enough to let me recommend this to you, but nope. This film was rarely funny and I cannot even say it's a good watch for young audiences. But it's certainly not a good watch for grown-ups. Finally some words on child actor Milo Parker: He seems totally on the rise with this movie here, but also international projects like \"Mr. Holmes\" or Tim Burton's newest movie. And it looks like the characters he plays in these films aren't small at all. I truly hope these movies turn out better. The script here destroyed something that could have been a pretty good experience. The cast is top-notch and packed with names that are very famous in Germany. Disappointing outcome for that. Not recommended.","user":"Horst_In_Translation","rank":[2,4]}]