[{"title":"Enjoyed it","rating":7,"date":"7 March 2016","review":"I honestly don't understand the really nasty reviews here. This is a very well directed thriller with some great acting from the leads &amp; well worth a look. If you are fond of one location thrillers with a good build up of suspense &amp; tension along with fine character development you'll enjoy it too. If you're looking for an action-packed thrill-a-minute flick this is not the movie for you. I loved the performances of all three leads - the little girl was excellent - and I thought the direction was exceptionally good - I look forward to seeing what the director can produce in the future as he develops. I have no idea why so many people these days think movies should be direct copies of reality - that's why they're movies. They're not going to be \"real\" - for that you need to pick up a documentary. That said, the premise of this movie, while requiring some suspension of disbelief, does not stray as far from believability as some of these reviews would have you believe. It's not brilliant or perfect but it's a good watch.","user":"daggersineyes","rank":[44,52]},{"title":"Surprising and Suspenseful","rating":8,"date":"21 June 2016","review":"Just beyond the opening scenes, Standoff quickly rises above its cheapness as an enjoyable and gripping suspense thriller. Then we're treated to an old breed of filmmaking that hasn't been this well-done since the likes of Misery! I love both headlining actors dearly but they've unfairly fallen off the radar in recent years. I still buy into their efforts on occasion despite bitter reviews, though, because budget does not always make for a great movie. In this case, it hits the spot.<br><br>So an ex-military man turned mafia hit-man hunts the sole witness of a multiple murder - a young girl with a camera - to a lonely farmhouse inhabited by a grieving alcoholic. Literally this is the premise and the scene is set for a siege and an edgy war of wits as one tries to convince the other to let him have the girl and walk away.<br><br>Sometimes that's all you need; no winding plot twists to keep people guessing. Sometimes it's just about the suspense and the viscera, but Standoff benefits from a great script and the skills of the director who also wrote it.<br><br>It has an old-school feel to it, and when we get down to it, even the look of the film harks back to a day of shamelessly simple effectiveness.<br><br>Fishburne is on top form as the villain, bringing the ghetto mentality of former villainous roles from the likes of King of New York and Assault on Precinct 13. He's sharper than ever, bursting with character and both smouldering and cold-blooded.<br><br>Thomas Jane also throws in his strongest performance in a long time and his man on the edge versus the man on a deadline is both genius acting and writing at once. They don't make characters like this anymore. Back in the '70s or '80s the role could have belonged to Lee Marvin, James Coburn or Roy Scheider.<br><br>I'm surprised and saddened that Standoff isn't getting recognition. It deserves a round of applause!","user":"DanLives1980","rank":[24,27]},{"title":"excellent","rating":9,"date":"20 January 2016","review":"Simple theme... but the movie was gripping and perfectly executed (pardon the pun). Laurence Fishburne was brilliant lead.... carried the movie on his shoulders from start to finish and Thomas Jane supporting actor.. an ideal partnership. Fishburne commands your full attention.<br><br>This must be a very low budget movie... 99% set in a house.. and this is proof that when you have good actors and a good producer.. you have a winner. <br><br>From a purely visual point of view, the film is reminiscent of a spaghetti western. Vaguely monochrome. Hence, whoever came up with putting the child actress Ella Ballentine, in a simple, bright red, dress really knew what they were doing. The contrast was worked perfectly.<br><br>Great Film... worth watching. Enjoyed it tremendously.","user":"odette-521-562860","rank":[49,62]}]