[{"title":"Expect a lot of standing still in this movie","rating":6,"date":"21 August 2017","review":"\"You're a very lucky man. You step on a mine and it doesn't explode. You spend the night in the desert and the animals leave you alone. You're a very lucky man, Mike and Michael!\"<br><br>Guess it wasn't that simple to do this. Making a film that focuses solely on an American marine named Mike (Armie Hammer) who stepped on a landmine and who doesn't dare to take any further steps. For 90 minutes, there's nothing else to see than this soldier who has to wait 52 hours for a patrol to help him. Help that comes too late for his partner Tommy (Tom Cullen). He won't be able to break the record on the 100 meter sprint, as both his legs are spread over a few square meters after walking on a landmine himself. And, in my opinion, the thought of a leg-less existence was too much for him as well. And now Mike is standing, kneeling and balancing there in the middle of the desert on an unexploded landmine, exposed to the elements of nature and from time to time deep in thought. The ultimate survival test.<br><br>So, don't expect real action-packed scenes in this movie. Only the delusions and flashbacks as Mike gets more and more tired, are presented in multitudes. And an odd, funny looking Berber shows up occasionally to bring water and have philosophical conversations with Mike. And afterwards he disappears again over the next dune. Whether this Berber is real or just a figment of his imagination, is hard to say. Certainly, he gives Mike something to hold onto so he won't go insane because of dehydration, the heat and lack of sleep.<br><br>Hammer's performance is solid and convincing. A man who tries to survive in dire circumstances and at the same time tries to come to terms with his past. A childhood filled with domestic violence from an aggressive, alcoholic father. To be honest, it's not hard to be the star of a movie when you're actually delivering some kind of solo performance and there's no other role that has a decisive impact on the movie. In this case, Hammer has the stage completely for himself and he can demonstrate the talent he has as an actor. And that is the most commendable of this film. Despite the intriguing concept, the content is too limited.<br><br>You can also interpret this movie in a metaphorical way. Everybody tend to end up in a so-called mine field once in his lifetime. A difficult period in which making a thoughtful decision is necessary. But because of the fear of taking risks, one freezes and is scared of taking that next, crucial step. Sometimes it may be advisable to take a next step, although there are consequences, instead of standing still. A tremendous dilemma Mike is facing and something the enigmatic Gerber tries to explain to him all the time. Due to the subject and the total lack of action, you may call this a boring movie. At one point, one hopes that this bloody landmine would explodes. Just to stir up the tension. And yet, this movie managed to hold my attention and curiosity. Never thought that a non-exploding landmine could be so intriguing. And again, praise for Armie Hammer and his commendable performance.<br><br>More reviews here : http://bit.ly/2qtGQoc","user":"peterp-450-298716","rank":[26,30]},{"title":"I Wish I'd Stepped On A Mine Instead","rating":2,"date":"6 April 2017","review":"-Spoilers, but it'll help you save almost two hours.-<br><br>Ughhh...<br><br>Positives:<br><br>I give the film two stars because the berber guy played by Clint Dyer is really likable. I'd rather have seen a film about him and his story by itself. <br><br>They do some transitions between scenes/hallucinations that involve the main character Mike the sniper taking a step and then hearing a \"click\" like stepping on the mine as significant life events take place. Those transitions are really, really good. Too bad they didn't make a better film for them to be in.<br><br>Negatives:<br><br>Lore Sjoberg, professional sarcast, years ago coined what he calls \"The Law of Cinematic Inaccuracy\". \"Movies get everything wrong. Hacking-based movies are laughable to hackers, military-based movies are laughable to members of the armed forces, and Indiana Jones movies are laughable to archaeologists.\" File this one in the military category.<br><br>It's glaringly obvious they either didn't hire any military script adviser or they didn't listen to that adviser. To anyone who's served or even been around anyone who's served in any nation's armed forces, it's terrible.<br><br>Marines don't call each other soldier, just like soldiers don't call each other \"marine\", and lawyers don't call each other \"plumbers\", and IT specialists don't call each other \"deep sea divers\".<br><br>American military missions (by ground force elements, for those rare few who've read about what happened during Red Wings from military sources and not from media) also don't leave people with no comms, nor stranded in the desert by themselves with no air or ground support for days.<br><br>They also have contingency plans, fallback points, rally points, recovery points, and so on. Missions (by ground force military elements) are not seat-of-your-pants things, especially as depicted in the film. The 5 Principles of Patrolling begins with \"Planning\".<br><br>Desert survival involves wearing something to block the sun. Hats are thrown away for dramatic effect to show actors sweating. It's silly. Everyone who's been in any desert knows this.<br><br>The generic \"mid-east\" war setting didn't bother me, but the fluff of people wandering through the desert to have a \"wedding\" was pretty lame. High value targets don't wander into dunes where air assets can spot them from 30 miles away, they shuffle around settlements.<br><br>The whole setup for the initial sniping scene is preposterous, especially when they give us specific information the filmmakers don't understand. They give an exact range for the target Mike's sniping at well over 1000 yards. I seem to recall it's 1708 - nearly a mile (1.6km). When a glint of light reflecting from his scope is spotted (because his hide sucks and he doesn't run a tenebraex killflash or sunshade tube like everyone else has for decades), ragged terrorists start dumping rounds on them at 1700 yards... which is a very tough shot for a very good sniper, and well outside of the effective range of guys with AKs.<br><br>The breakdown in discipline between the two \"friends\" and subsequent wandering into a minefield that's marked by a plot device sign landing literally at their feet is something that no one with discipline would ignore. But Mike the sniper and his friend do, and his friend gets his legs blown off for his troubles, which is the only scene I laughed at because the wagging stumps were somewhat limited technically, but mainly because it was so hackneyed and plainly stupid. There was zero subtlety, and the film failed with its intended mission there completely. It could've been a really disturbing moment, but because it was so front-loaded it came as a joke like Dead Meat in Hot Shots.<br><br>Mike gets his buddy to calm down enough to hit himself up with the morphine that he carries...which ain't exactly standard issue. And then after some more war hackneyed war tropes play out, Mike is left in the desert standing on a mine by himself having heard the \"click\" movie mines make that real ones tend not to.<br><br>From there, we get all the lazy hack writer crap you could stuff into the film, from having to save his girlfriend Jenny from 5 \"ranger/delta\" guys who apparently are not professionals but instead loud abusive drunks who go to bars in partial uniforms, fighting with his abusive dad/stepdad, watching his mom die, not knowing why he's fighting, yadda yadda.<br><br>He gets stalked by the wolf from 300, he does a Bear Grylls and drinks his own urine, he has some more hallucinations, and it's just all around the kind of stuff you'd expect to see in this kind of movie that's trying to be smart but just can't make it.<br><br>One of the highlights was the berber, but he rather quickly falls into becoming the trope of \"magic negro\" who helps the white man learn a valuable life lesson. If it were slightly less blatant, it would've worked better, but frankly I could see Clint Dyer carrying a whole film as the berber in a totally different kind of movie.<br><br>The group I watched this with started calling out what would happen next, and by the end of the film, we had guessed pretty much the entire course of the movie, with the exception being the berber's interaction with mines.<br><br>The very ending is a mess, but by that point you won't care anyway.<br><br>In summary: if you want to make an intelligent, introspective look at humanity by trapping a character alone with their thoughts in a desperate situation, watch this first to see what errors to avoid. Otherwise, treat it like UXO and stay far away and call EOD to detonate it in place.","user":"themightyservo","rank":[101,136]},{"title":"Badly researched and poorly executed","rating":2,"date":"30 April 2017","review":"I was really looking forward to seeing this movie but as an ex serviceman myself I couldn't believe that there were so many mistakes in the first 15 minutes. So many that I just had to turn the film off. <br><br>Trained sniper won't fire because it's a wedding, <br><br>Trained sniper given away by lense flare, <br><br>Walking through the desert no hats, <br><br>Going on desert op with next to no water, <br><br>Buddy steps on mine, first priority... not stabilising the patient to stop him bleeding out...but getting on the radio back to base.<br><br>If you want to see a good movie of a similar style and story-line then watch Kajaki. It's a true story and perfectly executed. Give this one a miss!","user":"cslbp","rank":[50,67]}]