[{"title":"Maggie Smith never disappoints","rating":7,"date":"22 February 2016","review":"Maggie Smith never disappoints. She is such an amazing actress and continues to be in \"The Lady in the Van.\" Such an interesting true story of a very odd woman, this film is very endearing. The chemistry between Maggie Smith and Alex Jennings is very enjoyable to watch. Their relationship had a sort of codependency between them that was really fueled by a real caring for each other for different reasons.&nbsp;Director Nicholas Hytner did a great job of portraying the comedy found in this story. And that is due to the great acting of Maggie Smith, whom I cannot say enough about. Her recent Golden Globe nomination for Best Actress in a Motion Picture- Comedy was well deserved and although she didn't take home the trophy, her performance is still one to be heavily applauded.","user":"jamieleeackerman","rank":[31,33]},{"title":"Character study, Master Class, Maggie Smith. It is what it is.","rating":7,"date":"27 October 2016","review":"To say that a certain performer could read the phone book and command attention has become a total cliché. It's used so much that when it is warranted, people roll their eyes because they've heard it so much. But for certain actors, it is true. They do command attention, not just because they are scene stealers or have a way delivering a sarcastic line or even because you've come to expect brilliance from them even in the lamest of works. It is in their soul, a gift from God, and a shining example from God that excellence does exist in the human being. Maybe not perfection, but in their talent, something so raw and beautiful that you feel that you are in love with them without even knowing them.<br><br>That is the case with Maggie Smith, an artist I have loved since my teen years, seeing her on screen in the original release of \"Murder By Death\". That 40 year old film has set my screen viewing on a love affair with the dry, witty, passionate and inwardly beautiful characters that she has played. And this, rumored to possibly be her final film, is her at her absolute most passionately brilliant characterization of all of those qualities.<br><br>Miss Shepherd isn't someone you'd want outside your home: apparently smelly, rude, cantankerous and manipulative. Harassed on the street, blackmailed, bugged to no end by social services, she becomes slowly both a rose and a thorn to writer Alan Bennett. His observing of her in all of her moods makes her come to life beyond those qualities.<br><br>This is not the first time that Dame Maggie has played not so glamorous characters or more staid, non- sarcastic ones. She could be any old bag lady you'd see on the street, supplying life observations to those who care to listen. She is real. She isn't acting. She is being. And thus, she is beautiful. And in deed, if this is her last film, she gets the most appropriate of endings.","user":"mark.waltz","rank":[14,14]},{"title":"A third Oscar for Maggie? Very probable, I'd say.","rating":8,"date":"16 November 2015","review":"Like all the best English comedies, the humor in \"The Lady in the Van\" is founded on character and in eccentricity but then we should expect nothing less from the pen of the great Alan Bennett. This is mostly a true story we are told and it's the story of a very eccentric lady and one, or is it two, quite eccentric men. The lady is Mary, or is it Margaret, Shepherd who might be considered homeless were it not for the van she lives in. The somewhat eccentric man is Bennett himself. I said two because in this case we get two Bennetts for the price of one, Alan the writer and Alan the householder and they are both played by Alex Jennings.<br><br>Miss Shepherd really existed and she's the lady who, at Bennett's request. moved her van from the street outside his house, where she had parked it, into his driveway. Initially she was due to stay a few months but ended up parking there for 15 years. Bennett turned the story of her stay first into a novella and then into a play and now, under the direction of Nicholas Hytner, into a film and a beautiful job he's made of it.<br><br>Of course, for the purpose of dramatic and comic effect Mr Bennett has taken liberties, adding bits here and there including a delightful phantasmagorical ending. He also surrounds himself and Miss Shepherd with a host of other characters, some almost as eccentric as they are. Recreating the part she played on stage Maggie Smith is magnificent in the title role. Of course, you could say Maggie has been playing variations of Jean Brodie for the past 45 years. It's easy to see Miss Brodie in the put-downs of the Dowager, Countess of Grantham had Jean been born into a different generation or class and it's not much of a step to see Miss Shepherd as an older, very much down-on-her-luck Jean Brodie. A third Oscar is certainly not out of the question.<br><br>Jennings, too, has Bennett off to a tee and there's lovely support from the likes of Frances De La Tour, Roger Allam and Deborah Findlay as sundry neighbors while the entire cast of Bennett's \"The History Boys\" manage to pop up in one form or another. If it feels slighter than some of Bennett's other offerings it may simply be because here he is writing about someone we would probably pass in the street without looking twice at. Of course, if on meeting Miss Shepherd in the street we knew what we know now, we might indeed give her a second or even a third glance; we might even invite her to move her van into our driveway. Slight? Not a bit of it.","user":"MOscarbradley","rank":[52,65]}]