[{"title":"The Pursuit of Happiness","rating":10,"date":"22 March 2016","review":"All the Hollywood directors producing one comic-book sequel after the other (and all other directors as well) should see this film, they should turn away in shame, and quit directing. Movie is largely seen as a medium to entertain, yet it could be so much more.<br><br>Watching this movie, in every scene, it is incomprehensible for a western viewer how it is filmed: There are only daily life scenes, nothing dramatic, yet it is such a heart-warming experience, a simple joy of watching people living their lives.<br><br>The story follows 3 very different grown-up sisters who live independently in a big house. The father has left them when they were little, and now they learn that they yet have another little sister. Soon their little dormitory has an additional guest. The main characters are the youngest sister who tries to adapt to her new life, and the oldest sister who is determined to live her life lead by strength and kindness.<br><br>Critics have compared Kore-eda with Ozu, because of his calm observation of life. Still, Ozu's films contain great sadness, while Kore-eda's movies ('Like Father,Like Son', 'Kiseki') are full of hope and joy for living. They show simple people trying to find happiness in life. It has a Zen-like quality: one doesn't need big dramatic events to show love and kindness, if you are looking close enough you will find it in the most ordinary things in daily life.<br><br>This is one of the best movies I've ever seen.","user":"simon-wang","rank":[55,68]},{"title":"Ozu style heart-warming drama stressing family bonding","rating":8,"date":"19 October 2015","review":"This is the 4th movie on family drama centering around children I have seen by director Hirokazu Koreeda. I love them all and I would say only until this one did I see some resemblance of him to Yasujiro Ozu, Japanese classic humanistic director. <br><br>Whatever it resembles or echoes, I quite enjoy the tranquil life in Kamakura, especially family life taking place in an old Japanese house with porch and a plum tree and a little storage under the wood floor. Any movie with an old house like that (such as \"I Wish (Kiseki),\" \"My SO has got Depression,\" \"Wolf Children,\" \"Postcard\" and of course \"And Then (Sorekara)\" would instantly calm me down. <br><br>Yet behind this tranquil life, there is family trauma where three girls have been abandoned by their mother after their father left for another woman, a similar theme appears in \"Nobody Knows\" by the same director. What is different though, the Koda sisters have been brought up by their maternal grandparents in the coastal and historical town of Kamakura, 50 km south-west of Tokyo until they passed away. <br><br>When the movie begins, their grandparents are long gone and the girls have been living in the family house and taking care of themselves for seven years. News come from northeastern Japan that their father died and they have to attend his funeral, where they meet their half-sister, 15-year-old Suzu (Suzu Hirose) for the first time. Suzu has been living with her step mother and father since her biological mother died. <br><br>The only connection between the three sisters and Suzu was their biological father and the lack of mother. Perhaps the big sister Sachi (Haruka Ayase) sees some resemblance in Suzu to her and her sisters, she invites Suzu to move in with them. The other two sisters (Masami Nagasawa and Kaho) second the idea. Alone with her step family, Suzu left for Kamakura and we enter the sisters' world through Suzu's perspective. <br><br>Similarly abandoned by adults and take care of themselves as in \"Nobody Knows,\" the sisters in \"Our little sister\" have grown to extend family tradition – making plum wine and making family styled meals and struggle to fulfill their dreams – be a good nurse, a caring bank employee, a supportive girlfriend and playing soccer. The little brother from \"I Wish\", Ohshiro Maeda, who played the role of Futai Ozaki, has also matured into a handsome young men and takes the initiative to introduce his new friend for the local beauty – a cherry blossom tunnel.<br><br>Sakura, the essence of Japanese culture, was beautifully captured in this movie, not only in the tunnel where the youngsters bike through, but also as a swan's call before their neighbor passes away. She said the same thing as the sisters' father said on his dead bed – that we can look at beautiful things as beautiful before we leave. Life can be hard, but if we focus on the beauty of it, it can still be beautiful. <br><br>Death appear repeatedly in this movie – besides their father's funeral, the neighbor and their grandma's deaths are also mentioned. Big sister Sachi works at the terminal care ward and faces death day in and day out. The movie portrays death as something all around us and that not only is it nothing to be sad about or afraid of, but it reminds us how to live fully before we reach this full stop.<br><br>Part of being alive is extending family tradition or capturing beauty at the right moment – like Sakura hanami, biking in a cherry blossom tunnel, making plum wine and the white fish toast and rice and playing fireworks in yukata. Part of living relates to sacrifice for a bigger cause: Koda's father and mother leaving Kamakura and Saka's leaving her boyfriend. <br><br>Excellent cast and acting. I wish I had a big sister like Sachi and lived in a big house like that. The home-cooked meals make the whole movie very homey, warm and humanistic, even more comfortable than \"Midnight Diner.\" In the big scheme of things, family is what we have left despite all the arguments and differences. And sometimes we may have to make sacrifices for the sake of the family – a theme common in Ozu's movies. Family and food seem to be the source of support we get after all the crazy things we encounter in the outside world – abandonment, betrayal, deaths, etc. Quite heart-warming, uplifting and beautiful. A little sad and a little short, just like life and cherry blossom.","user":"Kicino","rank":[44,55]},{"title":"loved it !","rating":10,"date":"5 January 2016","review":"This movie is 128 minutes long and at the end i was hoping it could go on for two more hours. For me it is the essence of what cinema should be. Great story real characters and real life ! Just a few days before i was watching SW7 and thought it was an OK movie but while watching \"our little sister\" i was realizing how much better cinema can be and how bad most Hollywood blockbusters really are. I know its like comparing a Michelin star cook to Mc Donald's but when you tasted both you realize one is art and one is fast food. One you eat because you're hungry (bored) and one because it tastes great. This movie is art because it touches you in a special way ... not you ego but your humanity.<br><br>Compared to Hirokazu Koreeda previous movie \"like father like son\" the story is very loose sometime you even think there is none. You also get tricked by the expectations other movies force you to have by repeating the same motives over and over again. I'm not sure if this is intentional or the movie is just so different.<br><br>Like most Japanese or Asian movies there is some stuff that could be a little bit to slapstick and melodramatic for western viewers but that's a very small price to pay.<br><br>If you don't count anime \"our little sister\" makes it in my top 5 Asian movies of all time. I highly recommend it.","user":"vexyl","rank":[43,58]}]