[{"title":"A funny & moving romantic comedy, that deals more with self discovery than the pursuit of love itself. Field is great.","rating":7,"date":"12 May 2016","review":"\"She's definitely weird, but like a good weird.\" Doris Miller (Field) has just lost her mother and reason for living. She isn't sure what to do now, stuck in a job and spending her nights with her friend Roz and Vivian. One day while heading to work she sees John (Greenfield) and everything changes. She falls in love with him and wants to find the courage to talk to him. Little by little Doris opens up and finds her confidence, and begins to find herself again. This is a movie that flips the norm on its head. This movie deals with an older woman trying to pursue a younger man. Sally Field gives one of her best performances to date and really plays this character perfectly. You feel sorry for her but not to the point of pity, and really root for her but also cringe a few times at her actions. This is at its core a funny and moving romantic comedy, but it deals more with self discovery than the pursuit of love itself. That is refreshing to see and because of that it actually felt fresh. Overall, just a really nice movie with a great performance by Sally Field. I give this a B.","user":"cosmo_tiger","rank":[32,36]},{"title":"Sally Field. You still got it, girl!","rating":8,"date":"19 March 2016","review":"I like it, I really really liked it!<br><br>Academy Award winner, Sally Field proves that she still has the charm and charisma at this stage in life, to headline a young hip movie. <br><br>Fields plays, Doris, a seasoned Staten Islander working in accounts at a young trendy business, who develops a crush on the new Art Director who sparks the young at heart feeling Doris needed after spending her youth taking care of a ill mother. <br><br>It's a very realistic look at what it's like for someone who has an age difference form the rest of their co workers.<br><br>Sally Field was great to look at. She brings that old school class of acting to a new style of film making. Field brings a lot of respect to Doris, that makes you feel for the character and connect with what she's going through as she pursues her much younger love interest.<br><br>It's familiar and refreshing all at the same time. A funny and enjoyable must see film.","user":"subxerogravity","rank":[65,79]},{"title":"A truly pleasing film...","rating":8,"date":"5 May 2016","review":"I want to write a fair, balanced, impartial and pertinent review of this film... but it's difficult.<br><br>The problem is... it's near perfect. It is clever and inventive in it's conception, beautifully constructed and crafted in it's form, musically enchanting... and importantly... not infested with formulaic Hollywood nonsense.<br><br>The actors do everything that is expected of them, (and more in the cases of Sally Field and Tyne Daily), there is zero CGI... and the swearing is limited (and confined) to the sort of swearing real people engage in. Healthy, gutsy, robust 'effing' and blinding. Also... no swords, elves, planets or vampires intrude on the fun. <br><br>We all have our own preferences when it comes to entertainment I like my music intricate and embracing, I like my novels to be difficult to define... and I like my films to be addictive... (at least for the duration of the film). I like to know I will definitely watch it again...and that I will laugh and care the same way I did the first time around.<br><br>A truly pleasing film. I'm in my sixties too... Sally Field is 'effing' gorgeous.","user":"soupster1","rank":[55,69]}]