[{"title":"Tiger in the concrete jungle","rating":7,"date":"5 February 2015","review":"Antoine Yates was a guy whose arrest once caused a furor in New York when it was found out he kept a pet tiger in an Harlem apartment complex. Oh, and he also had a gator there. Well, the tiger eventually bit him and he had to call 911. The police evacuated the animals and Yates was jailed for a couple of months for reckless endangerment.<br><br>The first part of this movie concentrates on Yates driving around in Harlem and remembering his days with Ming the Tiger. He's an interesting character and raising wild animals seemed to have some spiritual meaning for him...it's his true calling.<br><br>Just as I was thinking this entire movie will be like this, we suddenly see a tiger in the apartment...and later we see the gator too. The apartment (built in a studio setting, with cameras in each room) follows the layout of Yates' real apartment. The viewer gets the feeling how it was for the tiger to spend his existence in this barren environment. Well, the male tiger they used there didn't seem particularly happy, that's for sure. He seemed to be bored out of his mind.<br><br>This apartment sequence lasted around 25 minutes or so and was mostly without any verbal commentary. Well, not entirely though as at some point an Icelandic woman started to recite freestyle poetry about the animals. This knock off Björk performance was quite annoying to be fair and the movie might've been better without it. Yet this mostly silent animal sequence had overall a very mystical and eerie feeling and made the movie worth watching.<br><br>Ming of Harlem is basically a cross between narrative documentary and experimental art-house...never seen something quite like it.","user":"andychrist27","rank":[9,10]},{"title":"Like watching paint dry","rating":2,"date":"20 February 2017","review":"About 70% of this documentary — about a nutjob up in Harlem who kept a pet tiger and alligator in a 3-room apartment until the tiger tried to chew his leg off and the cops showed up — is a staged static-camera recreation of a tiger and an alligator (not the real ones, whose names were Ming and Al) roaming around a studio-set facsimile of the apartment . Literally, for something like 40 minutes, all we see is an alligator wandering past the camera, sniffing something in a corner, disappearing again, then reappearing. Clearly the filmmakers didn't have enough material from which to spin an actual documentary, which also explains the endless artfully-framed shots of Harlem streets and interiors, which seem to serve no purpose other than to fill up footage. The rest of the film is long tracking shots of a car driving around Harlem with the aforementioned nutjob, Antoine Yates, being chauffeured around to old haunts. I admit, he has a certain antic charm, but not nearly enough to glue this mess of a film together. When you realize, through Antoine's comments, that he not only thinks there was nothing wrong with keeping a pet alligator and tiger in a Harlem apartment, but actually thinks more people should take this approach in order to somehow preserve our wildlife, you understand that there is no point whatsoever to watching this sleep-inducing exercise in idiocy.","user":"jake_fantom","rank":[1,2]}]