[{"title":"If you live in glass houses...","rating":9,"date":"11 January 2020","review":"A friend of mine's early films were so bad he even received death threats. So, mere apathy, despair and disgust bode well... My pal went on to make the hit '47 Meters Down' Shark movies... it took him at least half a dozen tries before he got there. Give Simon time...<br><br>I watched this film and at first I was uneasy but I knew the budget was almost zero and so I chilled and watched it for its merits. Suddenly I saw the humour, the Flash Gordon of the 1936 era... the Italian sci fi spaghettis of the '70's... and tv shows with rapid fire dialogues like the Tomorrow People... and Blake's Seven.<br><br>This film is the most unpretentious flick you'll ever see. I can't imagine shooting bits over a decade and stitching it together... the cardboard cutout Eighties style of vfx reminded me of the television productions of my youth, especially the early Dr Who's.<br><br>The story was actually very clever. I believe that the director wanted to produce the kind of film (made for children- but with adult twists) so that one would be reminded of the films (some of which we genuinely hated too) of our childhood... and I think it worked. It was a quirky unusual first attempt... but you'll never forget it... no matter how hard some of you might try! Lol. It's entrenched in your brain. I bet you think about it quite often?<br><br>Lighten up... watch it again. You think you can do better with the same constraints? Prove it... Have a go.<br><br>I really enjoyed it. Congratulations Simon Cox and team... looking forward to the sequel. :-)","user":"chris-253-473879","rank":[28,35]},{"title":"A fantastic British adventure!","rating":9,"date":"22 January 2020","review":"It's lovely to see a big adventurous Sci-Fi film with a British bent. So many these days are big Hollywood budget with American stories or British stories retold in America and that's great but it's also nice that people are still making home grown Sci-Fi and what the film lacks in big budget polish it makes up for in genuine heartfelt story. I wish there were more like this.","user":"momentsoffilm","rank":[21,26]},{"title":"Excellent mind twisting science fiction.","rating":9,"date":"3 January 2020","review":"I really enjoyed this zero budget film.\nSimon Cox has created a film that takes a bit of thought and consideration...the same way you have to get a little deeper into Dark City, or Jacob's Ladder. (The best film of this kind was Arrival in my opinion.)\nIf you like science fiction that you have to turn your brain on for, this one will be for you.\nConsidering the budget, this film was truly something special.\nThe effects were excellent. The sound track was excellent. And the story was great. But I like twisty convoluted films...a lot of people don't.\nIf you liked Interstellar, you'll like this one.","user":"eleanor-piper","rank":[22,29]}]