[{"title":"Crass and Funny","rating":7,"date":"19 July 2016","review":"The Bronze<br><br>Low budget comedy that gets overlooked. Check. Amazing dialogue that will make your grandma be tickled pink. Check. Amazing acting from under-appreciated actors. Check. The Bronze is about a former medalist who has to struggle with no longer being in the limelight. The opening scene in the film is by far the most interesting way to introduce a character I've seen in a long time.<br><br>Melissa Rauch plays Hope. The extremely crass gymnast who doesn't care what she says but truly cares what people think of her. The first time I heard her voice I immediately thought of Bernadette Rostenkowski from Big Bang Theory, but then as she spoke more and she transformed into Hope.<br><br>Gary Cole plays another father figure. You might remember him from Reese Bobby from Talladega Nights or as Bill Lumbergh from Office Space. He's has a great character who just wants to make his daughter happy but at the same time be a responsible father. <br><br>Sebastian Stan plays Bucky Barns, no wait that's who he plays in Captain America, Stan plays Lance. Hope doesn't like most people, so when I say she hates Lance, it means something. He was a silver and gold medalist and took something very important to Hope when she was younger.<br><br>Haley Lu Richardson is excellent as an up and coming gymnast. This was the first time I've really seen her act. That being said I'm excited to see her in M. Night Shyamalan's Split coming out in 2017.<br><br>Verdict: I wouldn't recommend this to someone whose easily offended. If you've got the skin for it, I can't recommend this comedy more.","user":"Bryan_Roderick","rank":[37,44]},{"title":"The Bronze wins Gold","rating":8,"date":"22 July 2016","review":"I want to start out by saying this film is fantastic..! It starts out REALLY slow &amp; I almost made the mistake by turning it off but I stuck with it &amp; boy am I glad.. Melissa Rauch who I'd never heard of before watching this film is hilarious.. She plays a mean foul mouthed former Olympian bronze medalist who is still living off that fame 12 yrs later &amp; plays the part like a BOSS..! <br><br>*******WARNING*******<br><br>This film isn't for everyone it is filled with cuss words, sexual innuendos, nudity &amp; a whole bunch of funny so if you like any or all of the above you'll love this film.. 7.5/10","user":"My-Two-Cent","rank":[30,40]},{"title":"Much like Idiocracy & Office Space its a movie with tremendous re-watchability & quotable lines that you will be saying over & over.","rating":8,"date":"1 August 2016","review":"\"I had no control of what people talk about. Take that up with the God of gymnastics.\" Hope (Rauch) is the darling of her little town after winning bronze in the 1984 Olympics. Since that time she has made a living just being her and making sure everyone knows who she is. When her former coach dies she is asked to train America's greatest hope at a gold, Maggie (Richardson). Hope must now make a choice, train her to be better than she was, or give up the chance to collect $500,000. This is a hilarious movie, just flat out hilarious. Offensive, over the top and so laugh out loud funny that I had to rewind this a few times to catch the jokes I was missing. Rauch is incredible in this and almost everything she says is comedy gold. If you offend easy this is a movie you should probably avoid, but if you are a fan of R rated comedies this is one of the best ones I have seen in a long time. This is the type of movie I could watch over and over and still laugh every time. Overall, not a movie that will win awards but much like Idiocracy and Office Space its a movie with tremendous re-watchability and quotable lines that you will be saying over and over. I loved this and easily give this an A.","user":"cosmo_tiger","rank":[19,25]}]