[{"title":"Simply Amazing and Amazingly Simple","rating":9,"date":"9 February 2018","review":"There are movies, and there are movies which are good enough to be called films. This is one of the best independent films I've seen in my entire life. \"Infinite Chamber\" is the thinking person's science fiction film. It's not full of wild futuristic ideas or concepts, there are no flash-forwards and flashbacks in its simple plot, and there's no fancy C.G.I., but it's still likely to blow your mind and maybe warm your heart a little too. <br><br>Although this film's concept is not a new one, it's execution and conclusion is. What was pulled off with such a small budget, a handful of set pieces, and a just a few characters was simply amazing. Even putting it's indie budget aside, it stands tall against Hollywood sci-fi. So, you're looking for something different to watch tonight? Something that'll make you think (but not too hard), and something that'll leave a smirk on your face? Give this one a shot. I strongly doubt that you'll regret the decision.<br><br>NOTE: I watch a LOT of movies. I've literally seen hundreds of movies, and scores of films. \"Infinite Chamber\" is a film worth your time. Additionally, I very, very rarely rate anything above an 8 (especially recent film or television), and therefore giving this a 9 was refreshing but also a strange feeling. I didn't give it a 9 to even out its IMDB rating (I never do that), I gave it a 9 because it deserves a 9.","user":"brandon_veracka","rank":[72,89]},{"title":"Refreshing Storyline in a World of Reboots","rating":8,"date":"30 September 2017","review":"To reboot a classic movie for a new generation is lazy and disgraceful. <br><br>To come up with a new conceptually outside-the-box movie with a cohesive plot is extremely rare and is a true gem. The most recent thing example I can think of is 'The Matrix', unprecedented concepts, albeit still lacking some cohesion.<br><br>'Infinity Chamber' falls into a third, middle-ground category: Borrowing new elements/concepts from other movies as a means to create a \"original\" movie.<br><br>IMO, any such movie would still fall into a sub-genre of the original movie it borrowed its defining elements from. The new movie can still be original (in its own right) if it uses the borrowed concept only as a launchpad to branch off into creative laterals. <br><br>The Good:<br><br>'Infinity Chamber' is largely a one-man show. Thankfully, the lead actor does a great job of keeping the viewer entertained. Interestingly, the dialogue between the man and the computer is what gave the movie its charm. The computer has all the qualifying intellectual attributes of a real person:, mannerisms, personality, relatability, voice etc. It's easy to forget that the dialogue isn't between two people, despite the computer's limitation to only give pre-programmed or abstract answers. <br><br>Whether friendly or hostile, I've always appreciated movies where man and machine can form any sort of progressing understanding towards the other. <br><br>The Bad: <br><br>This movie isn't without some obscurity and unanswered questions. While this may turn some viewers off entirely, I found them to be forgivable due to the entertaining themes and aspects of the movie as a whole. <br><br>If you like movies like \"Moon\" or \"Ex Machina\", I'd venture to say you'd find this movie interesting, if not entertaining. <br><br>8/10 stars for this low-budget sci-fi movie that brings forth an entertaining sub- original storyline in a world of countless and shameless Hollywood reboots.","user":"prabhunster","rank":[94,120]},{"title":"Surprisingly Good Sci-fi Movie.","rating":7,"date":"14 October 2017","review":"If you have seen Cube(1997) and its subsequent sequels, then you will really enjoy this film. The film is based on an original idea and screenplay. Travis Milloy writes and directs this film with a very professional touch. I am sure he will become a top director after some years. <br><br>But the person I am most impressed with is Jacob Yoffee who directs the music. The background music enhances this film with a true sci-fi feel, reminiscent of Tangerine Dream the German music group that had a lot of success during the eighties. The cinematography is also superbly handled by Jason Nolte. <br><br>Plot of the film: Frank Lerner awakes to find himself trapped in an automated prison cell with an artificial intelligence monitoring him in order to keep him alive. Later on, Frank starts to get flashbacks of his last movements before he was captured. He forms a bond with the artificial intelligence, which is a rotating camera attached to the ceiling of his cell. Sooner or later Frank realizes that a lot of people have met their end in his cell and he must rely on his wits in order to escape.<br><br>Verdict: Superb sci-fi 7/10. Christopher Soren Kelly who plays the lead reminds me of the excellent actor Sam Rockwell who played Wild Bill Wharton in The Green Mile 1999.<br><br>More Sci-fi movies: Escape from New York(1981), The Running Man(1987), Fortress(1992).","user":"Vivekmaru45","rank":[44,55]}]