[{"title":"Give into the Cuteness","rating":5,"date":"11 August 2017","review":"First of all, recognize that this is a children's movie. So, a completely coherent plot isn't even the icing on the cake. It's more like one extra and very beautiful icing flower on top of the icing on the cake. What I'm saying is not all kids' movies totally make sense, so don't get too mad at Boss Baby for not totally making sense.<br><br>The standard movie of this ilk is littered with inconsistencies and overlooked logical flaws. In that sense, Boss Baby is a standard movie.<br><br>In a much different sense, Boss Baby is far, far from standard. It's brimming with creativity and bold stylistic choices. Not everything works, but enough does to justify the attempts.<br><br>The creative dynamic comes from the nature of the storytelling. The movie unfolds through the wildly inventive eyes of 7-year-old Tim. His boundless imagination makes him a questionable narrator, like Amy Dunne in Gone Girl, except he's not a psychotic murderer.<br><br>At any moment, Tim can suddenly morph into a ninja (to give one example) and his perceived world morphs accordingly to fit his current fantasy. This creates a number of whimsical and forceful action sequences that will mesmerize children and should keep adults at least mildly amused.<br><br>Digging a bit deeper, the movie is really about the love between brothers. Well, that and the obvious yet still funny metaphor that babies are really in charge. The brotherly moments work surprisingly well for the most part. They even elicited in me some of the intended emotions during a few key scenes when the baby realized that Tim cared for him and vice versa.<br><br>Despite being completely predictable, these moments are still touching. Maybe it's the cartoon cuteness or maybe the filmmakers tactfully achieved something here. Either way, it works.<br><br>Overall, I came away more satisfied than I anticipated, partly because I accepted Boss Baby for what it was. Your kids will enjoy this movie. If you relax your critical analysis, and most importantly give into the cuteness, you may enjoy it too.","user":"Jared_Andrews","rank":[13,16]},{"title":"Goo goo ga ga","rating":2,"date":"20 June 2018","review":"This movie has as much entertainment value as reading the title of this review.","user":"lockoffmydad","rank":[39,56]},{"title":"Really loved this film","rating":10,"date":"3 April 2017","review":"I really enjoyed this film. It was imaginative, fun and just thoroughly entertaining throughout the whole time I was watching it. It had some actually genuine heartwarming moments that didn't feel manufactured like some other animated films I've seen in recent past. The animation was also just gorgeous. I really loved the look of the film, I thought it had a really nice aesthetic style and felt like a classic piece of animation that if CGI was around in the seventies, it would've looked like this. All in all, I personally loved this film. If you want something that's just plain fun, bizarre and imaginative- with a touch of warmth- I'd say check this flick out. But if you're looking for something with more of a concrete plot and a straight forward narrative, you probably won't find that here.","user":"risinghouse","rank":[101,178]}]