[{"title":"Not For the Faint of Heart","rating":8,"date":"23 October 2015","review":"This raw and explicit documentary, directed by Bobcat Goldthwait, is not for the faint of heart and certainly not for everyone. It traces the life and career of the acerbic, rageful, and cynical comic Barry Crimmins, who has now become a leading children's rights and safety advocate.<br><br>Early on in the movie, Crimmins sets the tone by stating his two main goals, that of overthrowing the U.S. government and closing the Catholic Church, and as the film progress we find out why he feels this way. The doc traces Crimmins' early years in Skaneateles, New York where he began his comic career, to his move to Boston where he established a comedy club in the Chinese restaurant The Ding Ho, that eventually became a breeding ground for many known comics of today.<br><br>About halfway through the movie, it takes a radical shift relating a 1992 monologue where Crimmins graphically revealed for the first time in public his horrific sexual abuse when he was a child. This led to a tireless effort, often at the expense of his own health, to be an advocate for children's safety.<br><br>These were the very early days of the Internet, and Crimmins discovered in some AOL chatrooms vile and disgusting transmissions of child pornography, and devoted much of his energy to try and get AOL to close them down, to no avail. At the time apparently, this was still regarded by some as a free speech issue and not criminal activity like it is today.<br><br>This was demonstrated in the film, by a Senate Judiciary hearing where Crimmins was invited to testify. He was able to confront the smarmy Asst. General Counsel of AOL, and state his case to a panel of Senators who embarrassingly professed their ignorance of what the Internet even was. Of course today, child pornography has become a severely prosecuted crime in the United States.<br><br>In summary, although certainly not for everyone this explicit documentary was one I took a lot from, led by Crimmins' deep seeded attempts to battle some powerful evils in society, and maintaining his integrity while doing just that.","user":"larrys3","rank":[8,8]},{"title":"Intense personal story of survival and growth.","rating":10,"date":"22 August 2015","review":"I felt as if I held my breath the entire length of the movie. Great historical footage, interviews and first person stories of the day. The life of a man who had to overcome trauma and pain. A man whose talents seemed wrong place, wrong time but who never compromised his principles. Touching, poignant and all of it true. The story follows Barry's career through the comedy scene of the 80's, up and down the east coast. His comedy reaches a deep lace inside, things that everyone can relate to from that era. His childhood was stolen from him. He struggled for decades. Came to terms and was able to move on. I loved this movie. It is astounding that his core group of friends were able to share stories from 40 years ago. Barry was there for up and coming young comics and many got their start in the business from him. Many familiar names in this story. I will see it again with friends.","user":"sdwalker-76758","rank":[12,14]},{"title":"Bobcat Goldthwait's documentary on a Boston comedy icon with an important message","rating":10,"date":"23 August 2015","review":"The night after the live show that was filmed for this documentary, we all woke up to the news that Robin Williams, the best friend of director Bobcat Goldthwait, had died from suicide. I heard in interviews that Robin had considered playing the lead role if this story had been done dramatically. That came to mind a few times while watching and I could see why the character would have appealed to him. <br><br>It's about Barry Crimmins, one of the main personalities behind the launch of many Boston comics' careers, but comedy seems incidental to the work he does as years pass and perspective deepens. I don't know when I first became aware of him. I know I heard Steven Wright mumble his name somewhere way back, but I looked more closely after hearing Barry interviewed by Marc Maron on his WTF podcast. Barry Crimmins personally confronts some of the purest evil mankind perpetrates on itself and tried to prevent much of the damage that continues to be done in the name of profit. While doing that, he helped nurture a conscientious brand of comedy that continues to bring out unique voices.","user":"Pentucket","rank":[13,17]}]