[{"title":"\"The Perfect Guy\" may not be perfectly original, but it is pretty entertaining.","rating":7,"date":"12 September 2015","review":"You can't judge a book by its cover – or people by first impressions. Both are truisms that I've seen play out often – in my life and in the lives of others. Excellent art work doesn't necessarily mean that the book underneath that cover is any good (or the movie behind the poster, for that matter). More importantly, when looking for a life partner, regardless of how charming the man, or alluring the woman, what's underneath is what matters in the long run – and the best way to make life-defining judgments about a potential mate will always be T-I-M-E. The problem comes in when the cover of that book is so utterly impressive that you commit to reading it, but end up regretting it – or when you go ahead and put in the time, then start to sense that you won't like that last chapter. These are the kinds of situations that become real problems for the main character in \"The Perfect Guy\" (PG-13, 1:40).<br><br>Leah Vaughn (Sanaa Lathan) has it all well, most of it anyway. She has good looks, a devoted boyfriend and a great job as a lobbyist in L.A. What she doesn't have is a life-long commitment from her man. At the age of 36, and after two years of dating Dave (Morris Chestnut), Leah decides that she's tired of waiting for him to decide when he's ready to marry her and start a family. She tells Dave to leave, and again finds herself alone, but not for long. She meets another very eligible bachelor, but this one seems to know exactly what he wants. Carter Duncan comes off as charming, kind and generous as he is good-looking and sexy. He quickly earns Leah's affections, impresses her friends (Rutina Wesley and Kathryn Morris) and wins over her father (Charles S. Dutton). Carter really does seem to be the perfect guy.<br><br>Then Leah cracks open that book. Carter soon shows that, underneath his cover, he has some serious imperfections. Leah thinks it's best to close the book on this initially very promising relationship. Carter doesn't quite accept her decision. Harassment, stalking and some very creepy behavior follows. Then, Dave re-enters the picture. He asks for, and gets, another chance at being Leah's forever man. Carter likes this development even less than the restraining order that Leah sent his way. Now we have a full-blown love triangle – and one of these men turns out to be full-blown crazy. A sympathetic police detective (Holt McCallany) does everything he can to protect Leah, and her neighbor (Tess Harper) looks out for her, but Leah ends up having to figure a way out of her situation mostly by herself.<br><br>\"The Perfect Guy\" is formulaic, fairly predictable – and fun. We've seen this basic story in \"Fatal Attraction\" (1987), \"Sleeping with the Enemy\" (1991), \"Double Jeopardy\" (1999), \"Enough\" (2002), etc., all the way up to 2015's \"The Boy Next Door\" and beyond, but this one earns its place among those earlier films. The dialog is crisp and real and, for a nice change, the script doesn't portray the cops as indifferent and powerless (although some moviegoers may feel that the extent to which one detective helps Leah sends a dangerous message). This film nicely updates the genre by showing the very real perils of being a stalk-ee in the early 21st century. Rarely have an obsessed lover's actions been more unsettling, more intrusive and more frightening than in this film. For her part, Leah's dignity, spirit and resourcefulness are also very impressive. A very solid supporting cast back up the excellent performances of the three main characters, and all three are also pretty easy on the eye. (Plus, it's nice to see more ethnic diversity in the thriller genre.) \"The Perfect Guy\" may not be a perfectly original movie, but its appealing cast, smart script and well-constructed story make it worth a look. \"B+\"","user":"CleveMan66","rank":[28,49]},{"title":"A Perfect thriller movie with a sexy black woman.","rating":10,"date":"14 September 2015","review":"Successful lobbyist Leah Vaughn (Sanaa Lathan) is unhappy in her relationship with her boyfriend David King (Morris Chestnut), as he does not feel ready to commit to her wishes of starting a family, causing them to break up. Two months later, she ends up meeting the charming Carter Duncan (Michael Ealy), who works in IT for another company. They quickly grow close, and he manages to work his way into the hearts of her friends as well as her mother and father. On their way home from a trip to San Francisco, a stranger inquires Leah about Carter's Dodge Charger at a gas station. Thinking that he was flirting with her, Carter viciously attacks the man before the mortified Leah, and he takes off when the station's owner orders them to leave at gunpoint. Leah decides to break up with Carter that night, distraught over his actions and his desperate attempts to apologize.<br><br>Over the next several weeks, Carter stalks Leah at her job and leaves numerous phone-calls, even after she changes them. Unbeknownst to her, he also intrudes into her house with her spare house key, feeling around her belongings, hacking into her computer, and abducting her cat. She finally decides to go to the police, meeting with Detective Hansen (Holt McCallany). He advises her to keep note of any further attempts he makes to contact her, and one night, she finds a threatening note and a single red rose attached to her car. The next morning, a restraining order is filed against Carter at his job, and he is subsequently fired. Some time later, David contacts Leah about rekindling their relationship, and Leah eagerly agrees. One night, Leah and David find Carter watching them at a restaurant, and David grimly warns him to stay away. They still notify the police, and after Hansen interrogates Carter over the violation, Carter feigns innocence, stating that he had no idea she was there and that David was aggressive towards him. Hansen lets him go.<br><br>One night, as Carter is inside Leah's house, her neighbor, Mrs. McCarthy (Tess Harper) catches him, leading him to chase her back to her house where he kills her by pushing her down the stairs, causing her to break her neck. He also watches over Leah and David as they sleep and have sex. One morning, it's discovered that an email of a video showing Leah having sex with David was sent by her work account to her co-workers and her business's clients, and are forced to suspend her. Another night, Carter sabotages David's car, causing it to flip down a hill and seriously injure him. Carter goes down to the wreckage and kills the weakened David by suffocating him with his rubber gloves.<br><br>Both Leah and Hansen are certain that Carter is involved, though they lack the evidence necessary to incriminate him. After investigating further, Hansen learns that Carter is not his real name, and that he changed his identity after a similar series of harassment. He subtly tells Leah to take care of him on her own if necessary, leading her to buy a shotgun and shells. Carter seems to assume a new identity, as Leah spots him with another woman. She frightens her off and files another restraining order against him in front his new employers, once again getting him fired. She then manages to find a hideout of his where he monitors her, as well as finding her cat. She destroys his numerous computers and leaves, daring him to come after her again.<br><br>That night, Carter breaks into Leah's home, and after luring him to an empty room, she aims her gun at him. After managing to knock the gun out of her hand, a struggle ensues, which ends with her slashing his arm and shooting him twice with bean-bag ammo in an attempt to immobilize him. After he continues to advance, she shoots him with an actual shell, killing him. A now relieved Leah reports Carter to Hansen as an intruder, and police cart his corpse out of her house.<br><br>The perfect guy is a perfect thriller movie with a sexy black woman I wish I could hug and kiss.","user":"avirariva","rank":[27,52]},{"title":"The movie is good and I liked it better then No Good Deed, but it was just too cliché to really have the impact it wanted.","rating":7,"date":"28 December 2015","review":"\"I saw him beat someone badly, just for talking to me.\" Leah (Lathan) and her boyfriend have different plans for the future and decide to split up. When she meets the charismatic and charming Carter (Ealy) she easily falls for him. He says and does everything perfect, but when she sees his dark side things change. Afraid of what he may do next Leah breaks up with him, but Carter doesn't let go so easy. This is a really good movie that could have been so much better. The movie gets really close to the tenseness it is striving for, but ends up falling short. Carter does do some very scary and terrifying things, but nothing that hasn't been seen before. The movie really left a lot on the table that would have really helped it out and made the movie as tense as the filmmakers wanted it to be. The movie is good and I liked it better then No Good Deed, but it was just too cliché to really have the impact it wanted. Overall, not bad and worth watching, but not as tense as it could have been. I give it a B-.","user":"cosmo_tiger","rank":[10,17]}]