[{"title":"Only bearable with sound off","rating":2,"date":"15 December 2015","review":"I watched the first \"Ostwind\" film when it came out a couple years ago and as it was fairly successful, won Best Children's Film at the German Film Awards, they decided to make this sequel I guess. I also thought the first film was pretty weak and not deserving of any awards attention, but this one here is truly embarrassing. Before watching this, I thought Hanna Binke was a weak actress, but in here I would call her terrible, in fact. Even a mediocre actor like Jannis Niewöhner looks very talented next to her. The older cast members (Sittler, Prückner, Froboess) look as if they are taken out of some crappy Rosamunde Pilcher film. The action is partly new, partly recycled (the Hungarian, the horse riding contests). The music is a disastrous from start to finish.<br><br>Basically the only good aspect in here (apart from Jürgen Vogel's very small, but funny performance), is the idea of another horse, a white one that people mistake for a unicorn. Solid contrast to the black Ostwind/Atila (what a fitting name given the Hungarian references). Other than that, it is a disastrous film that should never have been made, especially by von Garnier and Schmidbauer who already proved on the original that they do not have much talent (anymore). The dialogs are unbearably bad, Binke is terrible from start to finish, the drama is unrealistic and over the top, the love story is nothing where you would feel something at all. I guess they boy from the first film, who is also in this one, is not enough anymore for the oh co cute and sparkly (well actually completely bland and boring) lead character. This film fails in basically every area and I hope the German Film Awards will not fall for this garbage a second time. Highly not recommended, this is nothing you should want your children to see if you love them. It's really only possible to enjoy this one if you switch off the sound. You can enjoy the pictures, but you will not understand the story or hear the people speaking, but the plot and dialogs are a mess from start to finish during these 100 minutes anyway. Stay far far away. And please do not even think of making a third film or at least recast Binke.","user":"Horst_In_Translation","rank":[1,8]}]