[{"title":"Has It's Moment But Pretty Mediocre For The Most Part","rating":5,"date":"8 September 2015","review":"Don't have a whole lot to say about this flick, it's not terrible or anything but it fails to really do anything new. Seemed to have a good budget, the actors/actresses all did a fine job, and the effects were solid but every thing this film brought to the table just felt like things I have seen in tons of other horror films.<br><br>Still was able to hold my interest til the credits and the last 20 minutes were pretty thrilling but nothing too memorable or unpredictable ever really happened. Not a bad movie, but pretty forgettable and not one I would suggest going out of your way to see.<br><br>5/10","user":"HorrorOverEverything","rank":[15,19]},{"title":"MERRY CHRISTMAS","rating":4,"date":"16 July 2018","review":"Morris (Tony Curran) lives on the Moors. He owns a wrecker and has a nefarious watch collection. As he is about to add to his collection, his daughter (Diana Vickers) interrupts him and Jake (Rupert Hill) becomes a house guest in what comes initially as a farmer's daughter joke. Jake's desire to leave meets with resistance from Morris who operates a profitable business.<br><br>Th picture starts out good but then stagnates. There are a limited number of victims so the film must concentrate on what few it has. The influence Jake has on the daughter wasn't done well. They should have cut 20 minutes from the film.<br><br>Guide: F-bomb. No sex or nudity.","user":"nogodnomasters","rank":[5,5]},{"title":"Hold on","rating":4,"date":"5 September 2018","review":"You have to have a certain love for this special kind of horror film type. Not really my thing, though I have been proven wrong by some really fine examples (Loved Ones comes to mind). This isn't the worst of them, especially because you have a really fine actor as the bad guy here. A lot of weird things are happening though and our \"lead\" good guy, seems to struggle to make the right choices.<br><br>Certain things you may understand, but of course not all of them. There is violence, there is terror and there is a certain amount of blood too. If you think you can handle it and you are sure you want to watch it, then go ahead. Make your day","user":"kosmasp","rank":[4,4]}]