[{"title":"Silly, with tongue in cheek.","rating":6,"date":"25 December 2018","review":"I have seen reviews here bashing the movie. Yoga Hosers is no Godfather. This is obvious. I have been watching Kevin Smith movies for nearly 25 years. Instead, look at the fun the actors are having. This movie stars Johnny Depp, his kids, with Kevin Smiths daughter, Johnny Depp's ex girlfriend and mother of his children, Kevin Smith and wife, Jason Mewes, Stan The Man Lee....all of these people friends. It was done for fun, and to poke fun at Canada and millenial culture. If I had the pull and the money, I'd do it too. Kevin Smith does this, every now and then grabs up his friends and makes something silly, and goes back to making the movies that earn huge amounts of money. Does no one remember the line from Jay and Silent Bob Strike Back? You make the safe film, then you make the art film. And sometimes, you make a film for your friends. That is Kevin Smith. Sometimes he just wants to have fun with his friends. The relationship Kevin Smith has with his daughter is one that every father should dream of having. Or am I the only one moved by seeing Harley Quinn Smith in tears when Kevin Smith gave her the bat used by Harley Quinn in Suicide Squad as a gift? And Depp. It is like he has a side of him that reasonates with Kevin Smith. He plays a lot of roles in movies, but seeing him onscreen during one scene with his daughter and cracking wise that she may not be old enough for what he is talking about was great. The movie is not in my top fifty, but it was nice to see friends and family making jokes and enjoying themselves.","user":"highlander_31527","rank":[16,18]},{"title":"In All Seriousness What Happened to Kevin Smith?","rating":2,"date":"5 December 2016","review":"Now when I first saw the trailer to Kevin Smith's (Clerks, Dogma) Yoga Hosers I was a little surprised. Now for those who have not seen the trailer for this film, and are asking yourself \"What the Hell are some Yoga Hosers?\" The trailer focuses on the two Canadian girls from Smith's last film, Tusk. Who work at a convenience store, and encounter Nazi sausages. Seriously. When I saw the trailer, my immediate instinct reaction was \"What the f*ck?\" It wasn't that what the f*ck with anger, it wasn't what the f*ck with confusion, it really was just a simple what the f*ck. Now I love Kevin Smith films. He always seemed like a cool person, he is well spoken, writes scripts with compelling characters and story, and he seems like the kind of guy you could easily talk with. His last film Tusk, in my opinion was his worst film. The films plot was there and it sounded great. What I personally didn't enjoy was the pace of the film and the characters. At least that film had a story wrapped around in it. Most people, including myself love the art form of filmmaking and movies for two main reasons. That being a story the audience can connect to and characters and audience can connect to. In my opinion, Yoga Hosers has very little story, with characters an audience cannot connect to, it isn't that funny, it's annoying, and I personally didn't get it.<br><br>I do not know if Kevin Smith made this film to mess with critics, the media, and fans. Or is he just this bad of a filmmaker now? Sadly, out there in the world there really is an individual who has a film script. A film script with story, compelling characters, a story that is a breath of fresh air, and a script that is really written with heart. Unfortunately, we may never have a chance to see it, because Kevin Smith had to bring us f*cking Yoga Hosers. <br><br>Sorry Ah-Boot That<br><br>I don't know where to start with this film. For God's sake, there is even a Marvel cameo of Stan Lee in this! I didn't go into this movie thinking it was terrible. I saw it on Netflix, went in with a clear unbiased mind, and 80 minutes later I'm shocked. The one good part of this movie is Harley Quinn Smith and Lily-Rose Depp. Those two actually to capture the spirit of Clerks in a way. I found them to be a little funny. But the rest of it is just bad acting and really bad Canadian jokes. They run the same joke into the ground over and over and over and over again. I didn't know it was possible to offend and be prejudice towards Canadians. After seeing this movie, well Goddamn it is possible if you're Kevin Smith. We f*cking get it, Canadians say EH (A) ever so often. When they say about, sometimes it sounds like they are saying Ah- boot. At first it is a chuckle. After that, it is just sad; the whole movie is Eh and Ah-boot! <br><br>That damn title card pops up every ten minutes when they introduce a character is bad! It looks like a want to be Scott Pilgrim and Suicide Squad.The cast is talented, but the story and they way it's written is completely ridiculous. Pucky Charms cereal ever ten minutes in your face, terrible Canadian slang jokes, looks like a 1990s video game in 2016, and this is the director of Clerks, Dogma, and Chasing Amy. There is no way in Hell this movie was made seriously, it is clearly a joke. A joke I personally do not find funny.<br><br>This film is worse than Tusk. If you enjoyed it, I am more than glad you did. Maybe I just don't get the joke. Kevin Smith's down dude since day one is in this, Mr. Jason Mewes! And even he is in this for two minutes, with the look on his face like yeah I don't need this right now. Really it is a shame, it's a mess, and I will always like and respect Kevin Smith. But recently his work, his legacy, his films have gone so far down the sh*tter I don't think he can cleanly come back up. Sorry Ah-boot that, yeah you should be sorry for this sh*t you call a movie!<br><br>I believe this \"movie\" earns a<br><br>2 out of 10.<br><br>Worst Kevin Smith film.","user":"NileFortnerBoogieBuddha954","rank":[51,75]},{"title":"virtually unwatchable","rating":1,"date":"17 March 2017","review":"I love most of Kevin Smith's movies and I enjoy his recent stuff that steps outside his norms as he plays with whatever ideas intrigue him but this is the one notable exception. The movie had so much potential and fell so far short of it that the movie is virtually unwatchable. The acting sucks, even notable actors gave crappy performances in this. The fake Canadian accents and dialog had me turn the movie off twice before I was able to finally force myself to sit through the rest of it. Hopefully his next venture isn't as fantastically bad as this one was.","user":"timber01","rank":[28,39]}]