[{"title":"Don't worry. There's absolutely no science in it.","rating":1,"date":"23 March 2019","review":"A little note to those reading user reviews of TINKER': when you see user review titles saying things like \"brilliantly captured\" and \"I'm a fan\" with a winky emoticon and other such gushing sentiments, I suggest that you take a quick moment and research the reviewer behind them. A disappointing number of them, with respect to this movie, turn out to be one-review-wonders. In other words, probably shills. Seeing this sort of thing almost always indicates that even the people directly associated with a movie's creation have no faith in it to stand on its own and have made an attempt to prop it up with fake reviews, creating fake reviewers to do so. It's the best indication I know to reliably predict that a movie is genuinely abominable.<br><br>On with the review.<br><br>TINKER' tells the story of a grumpy, socially catastrophic farmer who discovers that his father worked with some of the material that the government seized from the Tesla estate after his death. (The fact that the government seized some of Tesla's work immediately following his death is historically accurate. The government was hoping to find workable \"death ray\" technology. This historical event is a subculture favorite amongst \"energy\" conspiracy theorists.)<br><br>The farmer uncovers his father's notes regarding the work he had done on Tesla's efforts with wireless energy transmission. Inspired, he begins trying to build a wireless energy transmitter himself. In the middle of this project, the farmer inherits his nephew when the farmer's sister dies of cancer. As it happily turns out, the nephew, rather peculiar in his own right but essentially a sweet boy, possesses \"special\" abilities and is just naturally tuned into \"vibrations\" and the advanced esoteric properties of crystals. Yep. The nephew is so skillful with crystals, as a matter of fact, that he can use them to go back in time and visit his mother prior to her death. As luck would have it, this nephew's intuitive capabilities are just the ticket the farmer needs to successfully complete his wireless energy transmission machine. Socially-tragic-geek-bonding happens and the world no longer has any energy problems.<br><br>The end.<br><br>Obviously, movies are a form of art. They're not entirely unlike a painting or a sculpture. And as such, they have no obligation to conform to anyone's preconceived notions about what they OUGHT to be other than, hopefully, the director's own vision. This is how you get BARBARELLA or anything from, say, Fellini. This is why I review movies based upon my perception of what it was the movie itself INTENDED for itself to be. Criticizing a movie for not living up to my expectations is fundamentally unfair if my expectations are out of alignment with what the movie was trying to say.<br><br>Unfortunately, I found sussing out what TINKER' intended to be confusing.<br><br>If TINKER' was intended to be a giant, steaming pile of foam-brained new-age jibber-jabber tripe, then it should get a 10 out of 10 because that's exactly what it is. I congratulate the director.<br><br>Unfortunately for me personally, I took TINKER' to be a science-fiction movie based upon the fact that it's listed as such on the IMDb website. This set up the expectation within me that it would have, perhaps, something to do with \"science\" and, stated plainly, it absolutely does not. Science fiction movies have quite a bit of poetic license latitude to speculate upon scientific advancements that have yet to occur in creating their futuristic storylines. But if a \"science fiction\" story blatantly violates science that is already well understood at the time of the story's writing, then it's no longer science-fiction; it's just ignorant balderdash, liberal-arts-major drivel or \"speculative fiction\". You pick.<br><br>There is a particular and devoted branch of screwball nutcasery that focuses obsessively on \"things having to do with Tesla and 'energy''\". Beneath this general heading fall several subheadings: mystical \"vibrations\", free energy, magnet energy, vague descriptions of \"energies\" in general with no specificity, wireless transmission of \"energy\", government theft and suppression of Tesla's discoveries, and so on. TINKER' touches upon all of these. And just to make sure they didn't leave any boxes unchecked, TINKER' also folds pyramids and crystals into the mix. Tesla did make a statement or two regarding crystals being \"living beings\" as I recall, and the true believers also make connections between pyramids and Tesla, but I tend to put that down to that group's excessive, um, enthusiasm.<br><br>In short, TINKER' is a big mashup of every true-believer-with-a-screw-loose wish list, right down to the doofus farmer and uneducated child solving the mysteries of the universe shtick, all wrapped up in a single movie.<br><br>To my way of thinking, the tragedy of superstitious, pseudoscientific mumbo-jumbo promulgated in movies like this is that it tends to obfuscate the fact that there is what I think of as REAL magic in the REAL world that we can personally experience every day. How about the fact that you can take a bit of copper wire, an old iron nail and a battery and build your own electromagnet in a matter of minutes? Or move some of those simple parts around, throw in a fixed magnet, and you can make a motor that can do actual, physical work? Or move those parts around again, physically move the magnet around yourself and have the system convert your mechanical energy into electrical power? And you can do this all with the same handful of parts. What could be more magical than that?<br><br>And there are magical shapes in the world, too. Only they're not pyramids or crystals. How about the shape of a converging/diverging rocket nozzle? Use one of THOSE in the right way and you can leave the earth and go to the moon or Mars.<br><br>And think of the drama of it all. However far we may go in the universe, the origins of human space travel will always have their roots with the Monsters of Peenemünde.<br><br>And how about the fact that a moving, slightly curved magical shape can \"create\" lift and make you fly like a bird and float on the breeze like a dandelion seed? If that isn't a magic shape I don't know what is. Just try to do ANYTHING even HALF as cool is that with a pyramid.<br><br>And if you REALLY want to do something magic with crystals, you can use them to make a laser, make a super-accurate watch with oscillating crystals (which I guess you can call \"vibrations\" if it makes you feel good about yourself) or break visible light into its constituent wavelengths. Or hyper accurately tune a radio.<br><br>And by the way, every time you use your cell phone you're participating in the \"magic\" of wireless energy transmission. I used \"wireless energy transmission\" to power an AM radio 24/7 with NO BATTERIES OF ANY KIND half a century ago when I was 10. ooooOOOOoooo...<br><br>If you have any kind of formal education that remotely touches on actual science, physics or math, TINKER' will probably just make you angry unless you get seriously baked ahead of time. THEN it might be pretty funny.<br><br>If you're a true believer, neither this review nor anything else I, or anyone else, could ever say will ever put so much as a dent in your belief system, so off you go and give it a watch. Have fun.","user":"S_Soma","rank":[27,33]},{"title":"Some good acting, but disappointing ending.","rating":3,"date":"11 January 2019","review":"Good performance by young Colton Crawford, Clayne Crawford and Clayne's mother Lennie Crawford, but Christian Kane is the best feature of the movie. Kind of plodding pace, and the Tesla machine built of twigs and crystals was hokey. Bringing in the supernatural and a glimpse of heaven is not in keeping with the serious work Tesla did. I wouldn't recommend it, but don't regret seeing it.<br><br>The fake 10 star reviews are from fans of Clayne Crawford, trying to support him and prove he should not have been fired from Lethal Weapon.","user":"rt-pittman","rank":[17,20]},{"title":"How did it win awards?","rating":5,"date":"8 December 2018","review":"It was difficult getting through this film. Not one of the characters seemed human. Lots of ideas which don't really fit together. A very disjointed film in that quirks of each character are revealed, but it all seems meaningless. There is no suspense, apart from.just waiting for the end of the film. Many scenes are drawn out. The men are all unecessarily quiet or grumpy. When the kid asks 'where are we going' I felt exactly the same way about the film. It seems like the director started filming without a script, and then just made it up as he went along, but never really coming up with a consistent thread or story. \"You look to the stars? I look to the stars. Some say fools look to the stars. You're not wrong. Four sides, four different winds. Energy comes from all around you and is drawn to the earth\"<br><br>If that type of dialogue is gripping for you, as well as other unrelated and disjointed hippy pseudoscience, then maybe you'll like this film. My guess is most audiences are more sophisticated. Well, anyway; overall a film with little emotion, little engagement with the characters and a meandering 'plot' (using the word plot loosely).","user":"uberdonkey6","rank":[24,31]}]