[{"title":"Australian icon who's story should be known and this is the way to learn.","rating":10,"date":"4 December 2016","review":"From knowing nothing of Ben hall to feeling like I know him and his gang personally. The legend it's self has sparked an interest in truly wanting to discover all about Australian history and the authenticity of this brilliant Aussie film is to be thanked. The director, Matthew Holmes, has thoroughly considered all aspects of history and has chosen the most breathtaking locations. The cinematography was absolutely wonderful and is perfectly matched with a heart wrenching score. The character biography's of all 3 leads is so interesting and is portrayed in such a personal way, that it makes one think about the helpless lifestyles our ancestors have had to endure. You can empathise with the young John Dunn and feel his inner urge to impress his cronies. William Lee's jaw dropping performance allows you to relate and find that place that we all hide in our inner Psyche, where we just wish we were a little bit older, wiser and tougher. The character portrayal of Jack (John) Gilbert makes you just see how common narcissistic tendencies can be seen in every day society. He shows how a demonic personality can entertain and thrill all at the same time. We all know someone just like him and Jamie Coffa portrays that scary class clown like a true star. Ben Hall is the vision of all our worst night mare coming true. Situational desperation which is captured by the lead actor Jack Martin, like it is a real life experience. It is a true Aussie treasure and anyone claiming to be an Australian owes it to them self to learn our history and there is no better way to explore the truth then to watch this breathtakingly awe inspiring film.","user":"cassielee-36377","rank":[29,45]},{"title":"Film making at it's very best...Bravo Australia","rating":10,"date":"27 April 2017","review":"I can recall a UK TV series Ben Hall in the 70's with the very excellent Jon Finch in the lead...it was brooding and atmospheric with great acting...so I was interested to see how this telling of the tale would stack up. In short it far surpassed expectation.I was mesmerised by the sheer spectacle of the cinematography, the sublime acting especially by Jack Martin who reminded me of Danial Day Lewis which is not a bad thing,and a script which only included what was needing saying...And yes, it was brooding, it was atmospheric...with landscape to die for...This is a film the Australian film industry and especially all involved can justly be extremely proud of,it was a \"simply outstanding\" movie. Australia has made some cracking movies in the past and this stands up there with the best of them. If only Hollywood would / could produce more of this quality movie instead of the constant drivel it churns out with only the occasional gem. I have only ever bothered to review one other movie before that was \" INK\" by Jamin Winans...another masterpiece and a low budget independent. Nothing else was really worth the effort...Trust me..this movie is well worth watching","user":"stevenhenry_69","rank":[21,32]},{"title":"Move over Ned Kelly!","rating":8,"date":"6 December 2016","review":"What a beautifully shot film!! Excellent cinematography, it almost out shone the stars!<br><br>After reading copious amounts of Ben Hall literature in my youth this is the best historically accurate telling without adding the usual 'Hollywood' style fluff to pad it out and make a more 'interesting' movie to the detriment of the real tale. It shouldn't, and didn't need it. Well done Mathew and crew!<br><br>Jack Martin bought to life the best portrayal of Ben Hall yet, as did the rest of the gang and support cast. Even though Jamie Coffa's John Gilbert, with his 'boyish laugh', was a bit over the top and sometimes annoying, I reckon the real Gilbert probably was too.<br><br>The costuming and set detail is one of the best I've seen to recreate an accurate picture of the period. That's something that's usually goes astray. Even right down to the accurate detail of the weaponry used which would have maybe even impressed the late bushranger historian Edgar Penzig. A hard man to please.<br><br>The great music score only added the majesty of the scenery and the use of traditional music off the period, always a must, added to the authenticity. The song Ben Hall as the end piece was beautifully haunting. The stunning work of Ross Morgan's portraits during the credits must also get a mention.<br><br>The gun battles were excellently and excitingly shot while the last scenes of Ben's demise were very moving to say the least. Those bastard traps!<br><br>And the most amazing thing? It was crowd funded and shot on a very limited budget but you wouldn't know. <br><br>This is a mostly forgotten history lesson that needed telling. Move over Ned!","user":"kimbo-65145","rank":[23,36]}]