[{"title":"Living life with our beautiful broken brains.","rating":10,"date":"27 March 2016","review":"As a survivor of multiple strokes including a major hemorrhagic stroke in 1999 just 13 days after my 37th Birthday and a massive hemorrhagic stroke 2011 just before Christmas I can relate to the lady in this film, I went through and I am still going through a lot of what she had experienced from her stroke. I found this movie very good at explaining what we as stroke survivors are going through. I would highly recommend this movie to people who are interested stroke experiences and want to understand what we are going through because it is truly hard for us to explain to others what it is like to live life with our beautiful broken brains.","user":"mynamemcgregor-1","rank":[20,22]},{"title":"Highly recommended.","rating":8,"date":"5 April 2016","review":"This film is an amazing and positive glimpse into the area of brain dysfunction. Although it is specific to a stroke, I found the symptoms very similar to those I suffered with Lyme and a separate incident of oxygen loss. I recommend it to anyone who knows someone with Alzheimers, Lyme, stroke or any brain disabling illness. The subject of the film is young, intelligent, beautiful and most importantly positive as she struggles to find her way through the situation she's in, pockmarked with the fear and loss of herself and her future from her disability. It's her positive traits and the telling of this as a human story, not a medical document that makes this a revealing glimpse into this world.","user":"thebigzip","rank":[9,9]},{"title":"Amazing Person; Mediocre Documentary","rating":5,"date":"4 October 2018","review":"I'll start by saying that I absolutely love documentaries of any kind and on any subject and these are predominantly what I'll choose to watch. \nThe subject of this documentary, Lotje, is clearly a beautiful human inside and out and her strength in the face of such a harrowing and life-changing event is incredible. I know I couldn't cope with all the challenges she faced with such dignity and grace. When I saw her lecturing and speaking French I just couldn't believe her progress, which was all achieved from her own positivity, strength and hard work.\nThat being said, for some reason, I found that my mind kept wandering to other things things. I'm not sure if it's the editing as another reviewer mentioned or just that the documentary was probably longer than the content warranted or perhaps it was the reviews I read and the high expectations they created. <br><br>Sadly sometimes an interesting person/subject doesn't necessarily make for an interesting documentary.","user":"leila_sami","rank":[7,7]}]