[{"title":"not great, but not bad either","rating":7,"date":"18 April 2015","review":"Annalynne McCord is a very attractive woman who plays a very loving wife and stepmother.<br><br>Her life is turned upside down by blackmail and some threatening photographs that leave her and her husband wondering who is after them.<br><br>There are a lot of good twists and an unexpected ending.<br><br>This movie wasn't a classic by any stretch but it was a good way to spend and hour and a half. <br><br>The one thing that could have made it better was a more menacing subplot but hey i still recommend it.<br><br>For a Lifetime movie its not a bad one at all.","user":"jwayne_24","rank":[4,9]},{"title":"A turkey stuffed with a lemon.","rating":4,"date":"20 July 2016","review":"It starts out misleadingly well and offers a few nail biting moments. But the surprise ending is really no surprise at all, just the product of some no talent writer with a creative deficit. It also is a totally absurd and blatantly dishonest ending. It would be so nice if the hacks who grind out these Canadian crappers, probably Y&amp;R rejects, had some original ideas. This is just a slight twist on a standard plot that has been used endless times. And of course it is another of these outrageous \"made in Canada but set in the US\" films, subsidized by the Canadian taxpayer. I believe it was shot in Vancouver. (IMDB does not list the shooting location) Again Vancouver is a surrogate for Seattle. Our movie policy may make work for a lot of second-rate Canadian actors, techhies and such.(The good ones have gone to Hollywood.) But how can they possibly take pride in being part of the \"Canadian\" film industry when the industry itself has no pride in Canada","user":"rps-2","rank":[4,10]},{"title":"**1/2","rating":6,"date":"7 April 2015","review":"At first, I thought I was back in the famous shower scene of Psycho. A woman steps out of the shower only to be shot to death in a dark area of her home.<br><br>We then fast forward to 2 years later and it appears as if that scene had nothing to do with what we were about to see.<br><br>A young woman is married to a guy with a daughter. His former wife is wealthy and recently released from a mental institution. She wants the child back.<br><br>You would think that the first wife had something to do with the situation when wife #2 begins receiving photographs of her. We have an assortment of possible people doing this. An amorous female neighbor, a secretary to the woman and even a supposed substitute mail carrier who really isn't a mail person.<br><br>#2'w life starts to come apart when these photographs and other weird happenings increase. It costs her her job. The hint here was that she really wasn't dismayed about losing her position.<br><br>The ending is a real shocker. Wait until you see who #2 really was. It's all too much to fathom. Connection here is the problem. Thinks really don't make much sense until the very end of this very dark drama.","user":"edwagreen","rank":[2,4]}]