[{"title":"Incredibly entertaining!","rating":7,"date":"21 January 2015","review":"Justice League: Throne of Atlantis, directed by Ethan Spaulding, written by Heath Corson as well as Geoff Johnson was an exciting and entertaining animated film. Though Aquaman has made many appearances in the Justice League Animated Series, this was the first time he stared in his own animated feature film that was full of Shakespearian twists.<br><br>Not too long after the events in Justice League: War, directed by Jay Oliva, Metropolis faces a new aquatic threat as the Ocean Master Orm attempts to persuade Queen Atlanna, of Atlantis, to fight the surface dwellers in an all-out war for the death of their king. Meanwhile, a young man named Author Curry, who will be later dubbed Aquaman, is thrown headfirst into the fray. After learning his true identity as a royal son of Atlantis, an Atlantian named Mera, at the request of her queen, retrieves Author so that he could fulfill his destiny as the new king of Atlantis. However, unlike Queen Atlanna's desire to use her son Author as a beacon that would bridge everlasting peace between Atlantis and the surface dwellers, Orm, also known as Author Curry's half-brother, yearns for the annihilation of the surface dwellers by using the destructive militaristic might of Atlantis. Through the aid of the Super 7, which will later be crowned the Justice League, Author Curry must accept his destiny as the future king of Atlantis and prevent a war that could destroy both worlds.<br><br>Unlike most Warner Brother DC Animated Films, Justice League: Throne of Atlantis focuses more on a monarchial power struggle which was quite refreshing as it had a classical approach. Be that as it may, there were still plenty of realistic action scenes as Author Curry and the Super 7 fight an abundance of foes. Furthermore, the animation was absolutely stunning! While some might complain about the level of graphic violence, I personally believe this level of carnage creates a convincing atmosphere which has made DC animated films more enjoyable to watch.<br><br>In the end, this animated feature film was an exceptional addition to the Justice League Animated Movie Series and will make any DC fan an enthusiast of the legendary Atlantian King, Aquaman. A definite 7.","user":"crimson_knight_7","rank":[50,61]},{"title":"An enjoyable movie with several distracting plot holes.","rating":7,"date":"8 February 2016","review":"Be warned: spoilers lie ahead.<br><br>This movie has plenty of action, the animation is good, and the voice acting is topnotch. I enjoyed it, but almost throughout the whole time I was viewing it, I kept getting distracted by annoying plot holes that could have easily been covered by the creators with a little forethought and additional movie time.<br><br>First, there was the confusion as to which ocean holds the Marianas Trench. Then, when Cyborg goes to the bottom of the Trench to investigate the disappearance of a sub, he has no protective gear except a small breathing mask that leaves most of his face exposed. Sure, his cybernetic components could withstand the pressure at that depth, but at least a quarter of his face is simple human flesh. That part of his head should have been crushed.<br><br>The mistake is repeated when Superman, Wonder Woman, Batman, and the Flash visit Atlantis. Without protective gear, Batman and the Flash should have been crushed by the pressure. And while I could buy that Superman and Wonder Woman would be invulnerable to the pressure, they are still air-breathing beings without gills. Yet, they breathe and talk underwater like Aquaman.<br><br>Even more jarring is the fact that none of the Justice League members seemed to learn from or remember their fight against Darkseid in the previous movie. In the first film, the team realizes that each member taking on Darkseid singlehandedly was a losing strategy, and that their best chance of winning lay in taking him on as a team. They did that and won. Here, they fall right back into each team member attacking Orm individually and getting their butts soundly kicked. If eight superheroes are taking on one super villain, wouldn't at least one of the heroes suggest that they all jump him together? That is the advantage in having numbers on your side, after all.<br><br>Also, the team seems to have gotten substantially weaker since Justice League: War. Darkseid is one of the most powerful beings in the DC pantheon, yet the League bounced back from his attacks and kept fighting. Here, Orm slaps them down one by one, and they stay down. Even Superman and Wonder Woman are left helpless after taking just one or two blows. This is completely out of character.<br><br>Finally, it's a bit odd that Aquaman is the supposed ruler of the seas, yet throughout the movie, he is completely outclassed by Mera (Meara?) in battle. And when a sea monster tries to make a snack out of the team, Aquaman hides behind Superman, letting him subdue the creature.<br><br>Again, overall, I enjoyed this movie. And I'm looking forward to the next Justice League animated adventure. But I hope the next movie pays a little more attention to detail than this one did.","user":"ewf1000","rank":[7,8]},{"title":"the best on-screen version of Atlantis in the history of small-screen cinema.","rating":10,"date":"29 May 2016","review":"Without any question or doubt, Justice League: Throne of Atlantis is the definitive telling of Aquaman's origins. as the bastard son of Queen Atlanta, he has a difficult hero's journey ahead. the twist of Manta coaxing Orm into war is brilliant, and well executed. were there problems? sure. but who cares? the idea of an already engaged Atlantean Princess having been impregnated by a human and having to leave soon after giving birth to her son ups the ante on the whole Hero's Journey that we've been seeing throughout mythology. the one thing about this i don't like is they replaced Martian Manhunter with Shazam, who's not one of the founding members in the comics. but, it's the New 52 version, so what the hell?","user":"allan_kear","rank":[7,9]}]