[{"title":"One surprise gem in the movie that wasn't spoiled by the previews.","rating":8,"date":"16 March 2015","review":"As a huge fan of Carl Barron's work it was hard not to have high expectations. I'd seen quite a bit of the promotional material that was released beforehand so I knew that the movie wasn't going to be a straight out comedy. I admire the path that the filmmakers decided to take in making it more of a serious piece. It shows you a side of Carl which you don't see on-stage, which is really interesting. <br><br>I however was a little disappointed by how much of the movie was shown in the adverts and trailer, I feel like they definitely showed too much of it. It did achieve it's goal of giving the potential audience an idea of what the film was going to be like, however I found that there was only one aspect of the plot which they chose to leave out that made it unexpected and exciting. I won't say what it is, as it is quite a good (and one of the only) surprises of the movie. I will however say that it is clever and definitely something that makes the movie worth seeing. <br><br>If you go in without expectations that the film will be hilarious all the way through then you are sure to enjoy the story and the characters for what they really are; something that is honest and real.","user":"steph_sim_crazy","rank":[13,17]},{"title":"Enjoyable, would recommend, done well","rating":9,"date":"21 March 2015","review":"The film was done very well, considering that sometimes, lower Australian production values can impact certain areas of the film, with this film, no such issues. <br><br>It was an interesting film that told an interesting story about a stand up comedian, and I believe it was done in such a way that it adds some perspective to the fact that our favourite comedians are people too, and that a lot of the humour in our lives comes at laughing at the expense of others, and often with stand up comedians, at themselves. This is a message that is hammered home throughout, and was overall, very heartwarmingly told.<br><br>The acting was superb, and the dialogue was hilarious, a few subtle jokes for fans of Carl's stand up. Though it told a real and good story, it was still executed very comedically and was very funny. Though the story may in some cases appear to have some clichéd elements to it (the loss of the 10th star in my opinion), that would be up to an individual viewer to determine, and for others I watched the film with, they found it no issue, and sometimes were surprised, expecting clichés in some places.<br><br>Overall, well worth a watch, not only for fans of Carl Barron, but because it is quite a funny movie.","user":"jamescooper99","rank":[6,8]},{"title":"Great to see Carl Barron in a movie","rating":7,"date":"21 March 2017","review":"Manny Lewis is fun little movie with a simple plot that is easy to follow. The story is nothing new, and follows a successful comedian who wants to meet a woman, and then he meets a woman and some things happen. There are bits of comedy and bits of drama, some happy moments and some sad moments.<br><br>There's not much in the way of side plots, and the story at times seems overly simplistic, but that isn't necessarily a bad thing. The story flows quickly from one scene to the next, with nothing added to pad out the running time. We want to know what happens next and we don't have to wait. The main character is the focus of almost every single scene, which keeps things flowing nicely. The film is short and fun and not too long. And although it is pretty predictable, it is still very enjoyable.<br><br>Additionally, it was very nice to see Carl Barron in an acting role. I'm a big fan of his stand-up work, so it was a real treat to watch him in a film. He's actually a pretty decent actor. The film incorporates much of the comedian's work into it, showing him performing onstage. I probably would have rated this film a full star lower if it had featured any other actor in the lead role (if I had even watched it at all) but thankfully it does not.","user":"edge547","rank":[2,2]}]