[{"title":"You know how this one will go...","rating":2,"date":"14 December 2019","review":"...because it's exactly like every other low-budget movie made about women loving women.\nThere's not much to say except \"Trisha\" can't get over her dead father who passed five years ago. She can't function at work or at home; at this point, she should just be hospitalized if five years passed and she can't get through a single day without doing something related to her father. She treats her wife like crap and largely ignores her, so I guess it's no surprise that another person comes in and catches her wife's eye. Speaking of which, the flirtation scenes are just so over the top and drawn out. One scene has like two minutes of just staring closely and moving heads around within inches of each other to gaze without kissing. We also get graced with an extended high five that turns into intense staring for awhile. Umm...okay. And the end is lame, but I think they wanted to wrap it up quickly.\nThe acting is fine, but the script, story, and directing are just terrible.\nIn short, If Lifetime made \"lesbian\" films, this wouldn't be far from it.\nThe two stars were because I was amused by the ridiculous script at times.","user":"earthboli","rank":[0,0]},{"title":"Pointless Stuff","rating":2,"date":"21 October 2018","review":"Watching this movie is not worth anyone's time. It doesn't even have the quality of a decent TV movie.<br><br>The script was so typical, it had nothing that could stand out. The story-line was was quite monotonous and equally predictable. There was no urge like 'what might happen next' at all. The performances of the main characters were unable to uplift the movie's standard. Often weak scripts can turned into an enjoyable film by a skilled performer. Sadly that wasn't the case for this film. The actors and actress were below mediocre, it seemed like bunch middle aged suburban people decided to make a film who has never acted ever in their life.<br><br>No one should spend their precious time watching this film. Not Recommended.","user":"niaz_islam","rank":[3,10]},{"title":"Lesbians Deserve Better!!!","rating":1,"date":"2 February 2020","review":"Held my attention... Took me nowhere!!!\nReview too short... Really? Says who?! 🙄","user":"bronzesrv","rank":[0,1]}]