[{"title":"Watch 'Heathers', then 'Ginger Snaps', then maybe 'Scream' instead. Seriously.","rating":3,"date":"5 February 2018","review":"I only wanted to see this because I loved Brianna as Negasonic Teenage Warhead in 'Deadpool'. The few minutes there where she was a snarky, perma-texting little brat were hilarious and added to an awesome film.<br><br>Now imagine a film where those few minutes are stretched to a full length film -but now there's two snarky, perma texting little brats.<br><br>That's about it.<br><br>Except they kill people with ridiculous ease (gigantic gym buff dude felled by two 100 pound children) and there's mind boggling things like, a murder in a fitness studio and another in a high school - both places where in 2017, there's CCTV EVERYWHERE (and metal detectors in quite a lot). But apparently not in this town.<br><br>I'm not sure if you're meant to like the two leads or what.\nAt one point, it looks as though one will be redeemed - save the day, admit her part, maybe do her time and move on with her life - but that notion ends abruptly.<br><br>I kept waiting for there to be a point to it all, but there wasn't.\nIt was just bleak, sad, annoying and an affront to the horror community.<br><br>Also, all the god damn text and emoji pop ups on screen reminded me of 'Yoga Hosers' and that just made me even more irritated.<br><br>Don't waste your time, man.<br><br>3/10 - the 3 is for Craig Robinson's nanosecond of a role.","user":"bizzywiththefizzy","rank":[41,66]},{"title":"Social media killers","rating":9,"date":"12 August 2019","review":"Just what we needed to have social media teen killers. I really like movies with female lead actresses. I like about this movie is that it has a lot of plot twists. I enjoy movies that mention other popular or simular movies in the story. And a honorable mention about cinematografy and camera movement, it is such a joy to watch it really. And music its just right I mean couldnt be better bringing joy and entertainment so you dont get bord if you have short atention span. And the ending is just amazing.\nI hope you will enjoy it as I have, or already did.","user":"jakapocasni","rank":[5,6]},{"title":"The characters aren't the only ones without a conscience","rating":4,"date":"16 February 2018","review":"\"Tragedy Girls\" is an odd and unpleasant movie. The characters are too repulsive to care about, but you could at least laugh at them, but the movie doesn't seem to want us to do that. Are we supposed to be impressed by them? Regard them as heroes? Hope for their downfall? What?<br><br>The violence in the movie is so ridiculous and over-the-top that it definitely seems to fit the mould of a horror comedy. But there's no other comedy in it. The plot would have been an almost ideal set-up for a satire of today's social media obsessed youth, but the movie avoids any and all opportunities for social commentary.<br><br>It keeps you at arm's length from its characters - which will probably be okay with you, honestly - but then at the end seems to expect you to care for them. I didn't.<br><br>The ending would be quite bleak in a movie with a social conscience, but this movie has none, so it's more confusing than anything.<br><br>The plot: two teenage girls have a blog called \"Tragedy Girls\" in which they report on local tragedies and are dying for likes - as are, apparently, the people they write about. At the film's beginning, they set-up a poor (?) ugly teenage boy to meet his demise at the hands of a local slasher, and inexplicably take the slasher hostage. Apparently they have an empty warehouse somewhere all to themselves where they can detain serial killers and cut up bodies and nobody knows about it. They don't get many more likes from these escapades so they start killing people themselves.<br><br>That is basically it. Aside from a few creative death scenes - which, admittedly, use the horror-comedy trope of bodies being about as fragile as wax figurines - there's nothing else in the movie, really. This is one of few films where the plot description on IMDB tells you everything that happens in the whole movie.<br><br>Because it's a movie about two friends, of course there's an unnecessary diversion where they have a falling out and then make up, but that's about it.<br><br>The movie, ultimately, left a bad taste in my mouth. A topic like this cries out for comedy, insight, satire, anything. I think the filmmakers just had no idea how to handle it; it's a social commentary story forced into a horror-comedy film.","user":"jadavix","rank":[30,53]}]