[{"title":"Informative and deeply passionate","rating":8,"date":"9 October 2019","review":"Making Waves is both an informative, friendly introduction to the world of film sound and a passionate advocation of the art. There are in-depth interviews with some of the biggest names in Hollywood sound design - Ben Burtt, Skip Livesay, Randy Thom, Gary Rydstrom and the industry's superstar, the always-entertaining Walter Murch - and in directing - George Lucas, Stephen Spielberg, David Lynch, as well as a great many others.<br><br>There's an entertaining history of film sound and a breakdown of all the elements that go into the finished whole. In a concise 90 minutes it manages to include most of the major technological innovations and pioneering films and figures. It also manages to give a strong voice to the many women who have worked at the highest level on blockbuster films (e.g. Cecilia Hall on Top Gun, Anna Belhmer on Braveheart).<br><br>On the downside, it is very Hollywood-centric (or perhaps California-centric - at one point George Lucas says \"so we relocated to San Francisco\" like it was some giant leap for filmmaker kind). But to be fair, the filmmakers did admit in the post-screening Q&amp;A that they wanted it to be much more of an international story but they already had over 200 hours of transcripts just from the US and didn't have the funds to travel for interviews.<br><br>That aside, it would be hard to ask for a better film about this fascinating but obscure subject.","user":"carrythe2","rank":[9,10]},{"title":"Did you hear that?","rating":8,"date":"25 October 2019","review":"Greetings again from the darkness. Did you hear that? While watching a movie, you are likely aware of explosions and spoken dialogue, but it's quite astounding how many other sounds can make up a movie-watching experience. While it's true that we think of movies as a visual medium, it's not a complete description. Oscar winning director Steven Spielberg said, \"Our ears lead our eyes to where the story lives.\"<br><br>Midge Costin was a noted Sound Editor from 1986 through 1998 on such films as CRIMSON TIDE, CON AIR, and ARMAGEDDON. She then transitioned to education and has spent 20 years at the renowned USC Film School, holding the Kay Rose endowed chair in the Art of Dialogue and Sound Editing. She is truly a sound expert, and in this, her directorial debut, she beautifully lays out the art form of sound that takes place within the art form of cinema.<br><br>Ms. Costin structures the film with an historical timeline, personal profiles of some of the most important figures in sound, and a breakdown of sound segments and technology. Along the way she includes film clips to provide specific examples, and interviews for industry insight. The film takes us back to 1877 and Edison's phonograph, and on to 1927 when THE JAZZ SINGER delivered Al Jolson's voice. 1933's KING KONG mesmerized with the first true sound effects, and we learn the direct connection between movie sound and radio. We really get the inside scoop on the breakthroughs of American Zoetrope (founded by Francis Ford Coppola and George Lucas), and the importance of Barbra Sreisand's demands for A STAR IS BORN (1976), Robert Altman's multi-track NASHVILLE, and the \"Wookie\" sounds of STAR WARS. Of course, many other films and filmmakers (including Stanley Kubrick) are singled out for moving sound forward.<br><br>Some of the most interesting data comes courtesy of the \"nerds\" known as Sound Designers. Walter Murch (APOCALYPSE NOW), Ben Burtt (STAR WARS), Gary Rydstrom (JURASSIC PARK), and Lora Hirschberg (INCEPTION) are all Oscar winners, and their insight is fascinating along with that of Cece Hall, Bobby Banks, and Anna Behlmer - the latter of whom recounts her experience as a woman doing the fighter jet sounds for TOP GUN.<br><br>Cinema sound is divided into Music, sound effects, and voice, with each of these sections have sub-categories. Automated Dialogue Replacement (ADR), digital layers (through Pixar), ambience, and the custom effects of the Foley are all parts of the circle of talent delivering puzzle pieces to the Sound Mixer for assembly. If all of this hits you as a bit too technical, you should know that it's presented in a manner that makes it easy to follow. Sound is what pushes cinema into an immersive experience for viewers, and you'll likely walk away from Ms. Costin's film with an appreciation of just how many elements go into what you hear during a movie - and that's worth listening to.","user":"ferguson-6","rank":[7,9]},{"title":"talking heads promotion","rating":6,"date":"22 January 2020","review":"I was disappointed. Instead of going into the depths of sound, the film mostly focuses on talking heads, including directors as well as sound pros. There's a short history of sound in films (not just speech), and a short segment about the categories of sound production. These were good but far too short and shallow. I felt like I'd seen a promo, hagiography even, for the sound professions instead of a doc. Those professions deserve a much deeper and more detailed documentary.","user":"paleolith","rank":[3,4]}]