[{"title":"A true work of love and a fitting homage to one of the great British ghost stories.","rating":8,"date":"25 February 2018","review":"Thorpe's unique style and delivery do more than just re tell the highlights of the rectorys story. I was transported back to afternoons as a child in the 70's reading and re reading the pan book of ghosts and trying and failing to skip past the chapter on Borley and it grim catalogue of the paranormal. Sands narration and the directors determination to tell all facets of the story only served to produce a classic well rounded piece that will satisfy both the scared and the sceptic.\nGreat performances from all the cast especially as the format relies on face acting more than delivery of lines.<br><br>now at the age of 43 I find myself once again pulling my feet under the covers, just in case.","user":"barnymeinhoff","rank":[10,11]},{"title":"A fascinating look at the history and goings on at Borley Rectory","rating":7,"date":"7 October 2017","review":"I have been fascinated by Borley rectory since I was a kid. I grew up hearing about the ghost stories and hauntings that happened there. Naturally I was thrilled when I heard that this documentary was being made. I was even more excited when I heard that Reece Sheersmith was going to be involved. I didn't really know what to expect from the film but I was not disappointed. Borley Rectory takes an at times tongue in cheek look at the goings on at Borley rectory, beautifully narrated by Julian Sands. It explores the history and events that happened to the various occupants over the years before the rectory's final demise in the 40s.<br><br>The film itself is a really interesting mix of animation, and live action combined to make for a really creepy atmosphere, that is unlike most any other film of this type. This is not Friday the 13th or a \"horror movie\" in that sense so you should not watch it expecting anything like that, rather a genuinely fascinating and original look at the history of one of the alleged most haunted places in Britain. Ghost fans will enjoy this.","user":"hartigan1976","rank":[10,11]},{"title":"A superbly curious and creepy animated documentary film","rating":10,"date":"17 October 2017","review":"Premiere screening at The House of Magic - London - October 2017<br><br>Ashley Thorpe's' Borley Rectory; The Most Haunted House in England is not like anything you'll have seen before. It would be wrong to explain in detail how he achieved such an atmospheric and truly creepy film (I know some of the secrets as I was in it for about 30 seconds) I will say though that the actors are real and maybe the odd prop but nothing much else which is all the more astonishing when you get an establishing shot with such scale and poetry like a birds-eye view of the Rectory through the pouring rain; both mesmerising and heart-stopping.<br><br>It has taken Ashley a very long time to finally complete the film (6 years?) with well-marketed kick starters, professional support and when it needed it most, some great names becoming attached to the project he has something he can be really proud of. It is a masterpiece. The film started as a short and was to be under 18 minutes, that was exciting enough but then he told us all he was making it 36 minutes! Then he surprised me one night by excitedly rattling off that the film had now become 70 minutes; a 'feature-length' animated documentary epic is what it had become. I think I nearly cried - if it was to be half as good as his previous works, I thought, it could be the creepiest horror film this century and he might just blow the lid off the film world with his utterly unique style.<br><br>And my. It really is isn't half as good, it is flipping epic. Not in a sword and sandals way of course but with every piece of design choice, every soundscape and every slice of visual imagery. So beautiful is the film to look at you could pause it anywhere and frame it and hang it. This modern Gothic masterpiece has more ghosts in it you can shake a stick at but I bet you that you can't find them all, but they are there, skulking in the background, peering from the shadows, twisting in the mists and that is just the start of this chilling piece of genius. The film is insidious and it creeps up your spine like frost on a winter bough. The relaxed pace, the silences, the insistence that it not be a jump scare frightfest is why it works best as one of the creepiest films I have ever seen. It has a heart, integrity and with its cerebral narration, it unfurls like you're reading a book. In fact, the film is actually a documentary and often this can be forgotten when a scene lures you in and strokes your soul with its stillness. When the narrator, Julian Sands, cuts in and issues forth facts and dates you feel like you own your breath again and can relax.The tense moments in this film are played out so subtly that you just don't see it coming, you know, like that shadow that stretches across the room, then suddenly catches your eye only to see that it is a candle flickering and dying. Phew, just a candle then...<br><br>The acting throughout is excellent from the principle cast, Jonathan Rigby, Reece Shearsmith and Julian Sands to the extras and there wasn't any camp terrified Jon Pertwee gurning going on, everyone in the film took the subject seriously and it pays off. It is directed with a clear vision and simplicity and no scene or line seems superfluous. The film's historical vignettes peppered with fascinating information play out like the chapters of a book in visual form.Talking of books at one point we get to see an exquisitely designed pop-up book animated and even the book on which some of this film is based on by Harry Price crops up.<br><br>When I arrived at the House of Magic where the film was being screened, a sumptuous opulent abode with atmosphere seeping from its very walls, I wondered should I watch with a critical eye or should I throw myself at Ashley's mercy and just 'live' in it for 70 minutes. I had no choice, the film sucks you in and you are forced to live its pace and grace. Thank goodness I gave into the magic and I have to say It has stuck with me for two nights. I have been dreaming of ghosts and haunted houses and even getting those tingles on the back of my neck in an empty room. So as an experience it worked, as a ripping film it is a triumph and as a well-informed documentary it is perfect and to top it all off the sound design was extraordinary and the music (composed at lightning speed) was simply phenomenal. I cannot recommend this unique film highly enough. Do your self a favour though either watch it in the cinema in the complete dark (but leave the rustling popcorn outside) or even better watch it on your own, in the dark and see how far you get. Go on I dare you.<br><br>Just as an addition the Q&amp;A was weird and fun too compered by a living magician legend Simon Drake. If you ever get a chance to visit the House of Magic you should, you won't regret it.","user":"montagfire","rank":[8,12]}]