[{"title":"A Chameleon City","rating":10,"date":"11 July 2016","review":"I lived in Northern Ireland for 10 years, I came from England. My knowledge of Northern Ireland amounted to orchestrated news stories and nothing more. This poetic documentary moved me entirely, and my wife who is native to Belfast. I shed more than one tear as did my wife. Helena Bereen's narrative is utterly moving. The use of iconic places interjected with historical facts make this documentary more a work of love than a determined exercise in Northern Irish divide. I have seen many documentaries and films concerning Northern Ireland, but I have never been moved so much by any. I Am Belfast is a visual poem, a testimony of the people of Belfast who once opened their doors to one another, sharing vibrancy and acceptance until a dark cloud moved over the waters and overshadowed everything in it's path. Even as I write this review I can still hear the voice of Belfast and I hope I continue to hear it long into my days.","user":"sanesurfer","rank":[14,18]},{"title":"Meandering and doesn't wholly work, but if it hooks you it is interesting","rating":20,"date":"20 December 2016","review":"This is a particularly niche film, and I suspect that the majority audience will not go for it. This is not to suggest that I am in the 1% and therefore incredibly cultured and smart – but rather that I was born in Belfast, and also grew up with the odd tones of Mark Cousins as part of my cinematic education. As such I was quite taken by the film for what it was trying to do, even if I did not like all aspects of it. The film is affectionate and reflective on the city; it does not shy away from the impact of the Troubles but yet has plenty of time to celebrate the strength of the people that persist through them.<br><br>I am not totally sure that the female version of the city works as a device. She is good at times, but seems to be given almost too much time when the people and city would maybe have been a better focal point. This is well seen in moments where the film gets close to real people, with their accents and colorful phrasing – by contrast the overly poetic language of Belfast seems too deliberate and forced. Mostly though it works, although I wanted to hear Cousins directly more than I wanted to hear these very scripted and performed lines.<br><br>Visually the film is very well constructed; the memorable shots of the painted pub, alongside more creative and abstract shots all make for an interesting piece. This fits with the content of the film; to those who live in Northern Ireland the final 10 minutes will particularly strike home – a story of a wee woman who forgot her shopping and the bus turned back for her, this is more reflective of the people of a very small rural country than the headlines of bombs and bullets. It is a very nice finale (with Van Morrison adding more value) and it sums up the best aspects of the film very well.<br><br>An acquired interest piece, but the meandering tone and thoughtful air does the subject justice even if some of it works better than other parts.","user":"bob the moo","rank":[2,2]},{"title":"An interesting watch","rating":8,"date":"17 April 2015","review":"Mark Cousins has done well in this film.I am not from Belfast but visit the city frequently .From the salt hill at the start through all the colours and commentary the city is portrayed in a totally unique way .His comments at the premiere were inspiring and his very personal reminisces were excellent .A keenly observed and highly entertaining film which grew on you the more it went on . Well done Mark .The capacity audience at the world premiere in Belfast city centre seem to enjoy it .I thought the funeral of the last bigot living in Northern Ireland was fun and in a way that Mark was able to do .The film was full of abstract views of the Belfast city scape .","user":"rmcdougall_wilson","rank":[6,11]}]