[{"title":"A poor quality cartoon misrepresentation of King Solomon.","rating":1,"date":"24 December 2018","review":"Not knowing what to expect, but having the opportunity to view this movie for free on YouTube's Movie channel, I decided the price was right. I was wrong, even free costs to much.<br><br>I had already seen the best of the best in animated cartoons around biblical characters in the Prince of Egypt; The Legend of King Solomon now takes the place for me as worst of the worst.<br><br>As a filmmaker and someone who reviews movies themed around the Christian and Religious Genre, I will keep this review short.<br><br>The Legend of King Solomon opens with an emphasis placed on this being the Biblical / Jewish King Solomon, son of the Biblical / Jewish King David.<br><br>It's reiterated numerous times, I assume with the intention of trying to capture some portion of the religious communities pocket money.<br><br>An unsuspecting parent who wants to provide their children with wholesome religious stories though fails to prescreen what they show their children, are highly likely, based on the title and opening, to assume this is a biblical representation of King Solomon. This is not the case. This story, despite its initial opening, and its ongoing begging to be identified as the King Solomon son of Jewish historical King David, has absolutely nothing to do with King Solomon of Jewish tradition, nor the bible.<br><br>In addition to not having any content of a religious nature, despite its title and underwhelming story, this piece of animation presents a bleak and strange animation style of many of the characters that are drawn at times bordering on a formal italian art form of structuring with rigid shapes, angles and blocks to form faces. However this is not consistent, because the animal characters which are a main focal point for advancing the story are drawn in an entirely different animation style which would be extremely modern Saturday Morning young girl appealing cartoon appropriate. But it also features yet another entirely different animation style of its main characters which would be more common to what you would expect from a film trying to emulate the Prince of Egypt or Disney's Aladdin.<br><br>I will avoid going into a comparison or details about how enormous of a misrepresentation this movie takes from its proposed target of being a film about King's David's Son, King Solomon, because it would be an entire waste of time. It simply has no relevance to the Jewish or Biblical story of King Solomon other than the main character and supporting characters referring to that character as King David's son, and the occasional suggestion that King Solomon is known for his wisdom. That's it. There is nothing else in the entire story that in anyway relates to the historical King Solomon.<br><br>Whether I had watched this film merely for the sake of wanting to watch a cartoon that is interjected with diverse cultures, or as a parent wanting to take my children to see a bible story made into animation, The Legend of King Solomon fails in both aspects. Fortunately, I represent neither, I am merely a filmmaker, watching an animated film for content, audience targeting, animation style, dialog cohesiveness, story progression and resolution. As a filmmaker, I have no expectation other than it tell a quality representative story and be enternating. King Solomon fails in those aspects I look for in a movie, and that is pretty difficult to accomplish, especially for an animated movie.<br><br>The mixing of Character animation styles is strange, distracting and annoying. I can not recall any other animated movie that has intentionally chosen to mix multiple contrasting styles that completely are outside of the theme, which in this case is ancient middle eastern.<br><br>The music of this film is also strange, a sort of carribean sounding middle eastern mesh, not enjoyable. Usually an animation of this nature uses music to create excitement, mood and tone, and fits well into the culture and theme of the setting, but this film seemed to be trying to create an african - middle eastern fusion which was less than enjoyable.<br><br>The story is a bizarre mesh of ancient middle eastern landscapes and culture, with My Little Pony type animals, modern day high school teen crush drama about \"true love\", with a Saturday morning cartoon boys centric story about fighting demons. It's lacks cohesiveness with its attempt at satisfying multiple audiences.<br><br>When I watch a movie, especially an animated movie, I want to be captivated, entertained, enjoy lots of moments that give opportunity to laugh and when the movie is over I want to feel resolved as though I just took a magically journey into an animated world. I didn't experience this at all with The Legend of the King Solomon. Instead I found myself hoping it would get better, hoping for something humorous or comical, anything to get a smile or laugh, but it simply falls flat.<br><br>I do not recommend this movie.","user":"Randy_Dreammaker","rank":[8,15]}]