[{"title":"Really liked it!","rating":8,"date":"18 August 2018","review":"I haven't read the book, and hadn't heard about it, so I didn't have high expectations. Like others have said, Netflix hasn't had many good original movies recently (or shows, for that matter), but this one was good. I didn't have high expectations for the first 10 minutes but it redeemed itself pretty quickly. I think i might read the book!","user":"mimi232","rank":[132,169]},{"title":"A heartwarming blast of love","rating":9,"date":"19 August 2018","review":"This movie has this certain vibe that makes you want to fall inlove. The script of the movie was definitely superb and was able to translate the emotion that you would feel while reading the book. The cast, the music, the atmosphere of the film, evwrything was on point. Definitely a must see","user":"karlkennethwatson","rank":[102,130]},{"title":"An Absolute Delight","rating":7,"date":"26 August 2018","review":"Netflix has been scorching the rom-com game this summer. As other major movie studios have neglected this beloved genre, Netflix has capitalized on this underserved market by releasing a steady stream rom-coms just about every week. The latest, 'To All the Boys I've Loved Before,' is perhaps the best yet. <br><br>Sometimes, I just want a movie that will make me smile. It's such a simple wish that often goes unfulfilled when watching movies. But not this time. During this movie, I couldn't stop smiling. I smiled so much that it made my mouth sore. <br><br>Lara Jean (Lana Condor), a delightful 16-year-old who doesn't realize how delightful she is, lives her love life in fantasyland. She enjoys romantic novels and daydreaming about love, but she's afraid to pursue it in real life. She's forced to reckon with this when the five love letters she wrote to her crushes are mysteriously (but not really mysteriously because the culprit is obvious) mailed to each of them. <br><br>One letter went to (gasp!) her sister's ex-boyfriend Josh (Israel Broussard), who Lara Jean has secretly crushed on for years. Another went to Peter, the ex-boyfriend of Lara Jean's nemesis. <br><br>This guy who plays Peter, Noah Centineo, looks to be one of the breakout stars of 2018. He's ridiculously charming in a Mark Ruffalo kind of way. He will also star in the upcoming Netflix film, 'Sierra Burgess is a Loser,' so look for more big things from him in the future.<br><br>After finding out that she likes (or at least used to like) him, Peter suggests he and Lara Jean enter into a fake relationship. It's perfect-he can make his ex-girlfriend jealous, and she can convince everyone that she isn't in love with Josh. The two of them make rules, ones that seem destined to be broken at just the right moment. Even in the earliest stages of the fake relationship, they have obvious chemistry, both as characters and actors. Condor is a bit flat in her performance, but Centineo effortlessly lifts her up, and lifts up everyone, really, each time he appears on screen. <br><br>The story is decidedly 2018. The dialogue includes biting remarks like, \"you don't even post about me on Instagram anymore!\" Instagram comes up a lot. The litany of present-day references and apparent progressiveness of the overall film made me wonder why the writers made the Asian girl a terrible driver. Is it supposed be that self-aware type of joke that pokes fun at a silly stereotype? Maybe, but it didn't play that way.<br><br>The only real complaint I have is the casting of Lara Jean's sister. The actress is 30 years old and looks old enough to be Lara Jean's mom. That opening scene becomes confusing very quickly when this 30-year-old woman kisses her teenage boyfriend, and we find out that we're supposed to believe she's 18. Fortunately, the sister leaves for college, and we can forget about how weird that moment was. <br><br>'To All the Boys' likely won't surprise viewers with any twists-it's not going for that. But, it remains charming throughout, even if it has its ebbs and flows. Once the story passes the effervescent 30-minute opening spurt, it goes somewhat flat. It's like a soda that's lost its fizz-it's still sweet and pleasant enough, but it's not quite the same. Though I must admit, I gobbled it all up, even the hokey message about putting yourself out there because you never know what might happen. <br><br>Bottom line: the movie is delightful. I'm smiling now just thinking about it. Give it a watch. You'll be glad that you did.","user":"Jared_Andrews","rank":[66,88]}]