[{"title":"Excellent, powerful with surprise ending","rating":8,"date":"25 November 2017","review":"Strong acting and interesting story. Starts out as typical prison film and then moves on to a really twisted revenge story. I was watching the movie with several others and each guessed a different and wrong ending as we watched.<br><br>Not a perfect movie but well acted and strong story line. Not for kids as there as some harsh scenes but I think adults would enjoy the watch.","user":"john-06301","rank":[7,8]},{"title":"A real journey into hell","rating":8,"date":"2 December 2017","review":"What a terrific small budget indie thriller. It starts off slow and you wonder where it is going. Then it just grips and drags you into this finale that blows you away. Gritty acting. The sets are so grimy you feel you can touch them. And yet the camera work is so beautiful at times. The cast, including Dylan Baker, puts in a good performance and the director sure knows what he's doing. If you like film noir or neo noir, this little gem is definitely a must watch.","user":"Gerald123","rank":[2,2]},{"title":"A great thriller that doesn't need to blow things up","rating":8,"date":"2 December 2017","review":"I've been following the work of the director Tim Mccann for quite a while. He won at Toronto with his first ever film called Desolation Angels and was considered one of the best directors to come from NY that year. He never however got into the big time and continued to make these hard core indie movies (see All Mistakes Buried, which is a real gem). With No Beast so Fierce he's made another one that is well worth watching. A story about an ex-con who just left prison to look for his son, the characters, the dialogue, the acting, the locations: everything is spot on realistic. There's no need for huge action set pieces, no explosives, but the story tenses you up and the tension keeps piling on and piling on until you get to a terrific twist at the end. Well worth it.","user":"Kador123","rank":[2,2]}]