[{"title":"Don't Waste Your Time","rating":3,"date":"8 August 2017","review":"I would say don't waste your time viewing this below B-quality mess of a movie. The humor is ham-fisted and the plot elements are silly and rather ridiculous, plus the age jokes get really tiresome.<br><br>The story revolves around 17-year-old Jake Bouchard (Dylan Everett) whose friend Angie has been kidnapped by a General wanted for war crimes and who is holding her in a heavily guarded warehouse. Jake will enlist the help of his grandfather Major Lou Crawford (James Caan), a former Canadian Special Forces officer from decades before, to help him free Angie. The Major will in turn enlist the help of his former military team to assist in the attack.<br><br>I'm sorry to say, it's nice to see such stalwarts of the silver screen as Caan, Louis Gossett Jr., Paul Sorvino, and Jessica Walter in a film together but not in a rather lame vehicle like this.","user":"larrys3","rank":[32,42]},{"title":"One for the over seventies","rating":7,"date":"3 November 2017","review":"Most of us over 70 could not manage to work as hard as these guys did to produce this film. I asked my husband if he enjoyed the movie and he said he did. He is 75. Maybe the bad reviewers are too young and critical to appreciate a film about old people. It is not a great movie but it is also not a terrible one. Lower your expectations and sit back and enjoy a few old people jokes and the fact that 70 plus guys can actually make a reasonable movie. Caan is a good actor and he carries the film along with some help from his buddies. The two young ones do a reasonable job as well. They are older than the characters they are portraying. There are no earth shattering scenes or fast chases but the storyline is okay. It is about rescuing a damsel in distress by her boyfriend and his grandfather along with some aged buddies. There is no trick photography or devices used to make it faster paced or more exciting. Expect an okay movie and if you are over 70 it will help.","user":"KathleenK22","rank":[22,28]},{"title":"Fun...entertaining...","rating":8,"date":"2 August 2018","review":"It's a comedy, a teenage movie...so, if you watch this movie THAT way, then you'll enjoy it. \nBut I guess a lot of whining \"experts\" here thought they were watching Rambo and expecting Mission impossible 7.","user":"misavr-41653","rank":[7,8]}]