[{"title":"Simple minded tale of meds vs healthy baby in dire need of subplots","rating":1,"date":"19 November 2018","review":"Forget complex when this is totally 'predicable' film. We're told out of the box that Maggie just one year ago was so mentally ill that she attempted suicide. That her lifeline to sanity is her medication regimen. Maggie is pregnant. Her doc tells her: if you stop your meds you will have another dangerous crisis. But if you stop taking your meds your baby may be harmed. Gee, brain twister here. What oh what will Maggie do?<br><br>Maggie stops her meds for the safety of the baby we get to watch her slow burn as the doctors prediction come to pass...yawn. The absence of any psycho subplots is glaring. Actually, adding to the dullsville Maggie never seeks to harm herself or threaten harm to anyone.<br><br>Hole: Husband calls the police to report Maggie has stopped her meds and accused him of sleeping around. Really? Actually the cops agree. They leave telling the husband they can do nothing for failing to take meds unless and until she seeks to harm herself or others. Police would never show up for a 'not taking meds' call. That is what doctors are for.<br><br>Even the final scene wimps out. When husband grabs her shoulder (an assault) she pushes his arm away and there is an 'accident.'<br><br>no crimes are committed. Just Maggie refusing to take her meds leaving us to watch her slow burn into non-life threatening mental illness which does at least produce a healthy baby.","user":"stevepat99","rank":[3,3]},{"title":"Beautifully Crafted Independent Cinema","rating":10,"date":"16 January 2019","review":"I first saw this film at its premiere on the 2017 film festival circuit and it simply blew me away. Director Stanley Brode handles the tightly wound story of a successful writer grasping for a hold on reality in a way that is simultaneously nerve-wracking and heartbreaking, and writer / lead actor Jessalyn Maguire proves that she is a formidable talent, both in crafting a story and playing one out. Highly recommend.","user":"josh-94126","rank":[0,0]},{"title":"Excellent!","rating":10,"date":"1 October 2018","review":"A riveting story, and a complex portrait of a woman in crisis.","user":"janecortney","rank":[4,28]}]