[{"title":"Great","rating":9,"date":"23 February 2020","review":"Edgar Wright proved to be able to create a thrilling direction and more than capable script for our ensemble cast, led by a sympathetic Ansel Elgort. He certainly shines as this teen in a tough position who is a good guy being forced to do bad things. More than your average heist movie, with a killer soundtrack and fast pace driver you'll be on the edge of your seat during the most crazy moments.","user":"MR_Heraclius","rank":[43,52]},{"title":"Starts out great, falls apart halfway through","rating":5,"date":"7 July 2017","review":"This movie had a lot of potential. It started out great, but it began to fall apart rapidly just after the halfway mark. <br><br>A more complicated plot could have developed, but the second half just seems rushed. The movie could have gone in several different and more fulfilling directions, but it went full cheese instead. Disappointing. It ends up being just a variation of \"The Last Ride\" (2004). <br><br>SPOILER ALERT <br><br>It's a given that being in debt to a crime boss means your debt will never really be cleared, so that's okay for a movie.<br><br>And you can suspend disbelief for driving physics and non-deploying airbags...<br><br>But...<br><br>Doc sending the third crew to meet with arms dealers was totally unnecessary for the job they had the next day, because they already had all the equipment they needed, so that whole scene was forced just for a plot device.<br><br>Bats proved he was willing to kill for no reason, so there's really no reason he would have left Joe alive.<br><br>There is no way Buddy would have been able to escape all those cops swarming him downtown. Then Buddy shows up again later after getting shot in the chest. Superhuman villains in a non-superhero movie tend to ruin the whole thing.<br><br>Doc remaining in the place from where the heist was launched at risk of being caught for no reason (even though he knew it was botched) made no sense, just like his sudden change of heart in \"helping\" Baby made no sense.<br><br>Oh and Jon Bernthal is only in the movie for about 10 minutes, so not sure why he was given top billing, when he's pretty much just an extra with a couple of lines. Baby's deaf foster dad had more lines (sign language) than Bernthal, yet he's not considered a main character.","user":"fb123","rank":[448,724]},{"title":"Fun And Entertaining","rating":8,"date":"15 February 2020","review":"There is some good acting in this film, fun action, violence and humanity too. There is some flaunting and a mini-skirted beauty who rocks fine skin and exquisite legs.\nWatch it.","user":"glophxnw","rank":[15,19]}]