[{"title":"A Crime Mystery Perhaps, But No Thriller","rating":1,"date":"7 October 2019","review":"This slow, awkward, and uncomfortable film purports to be a horror and thriller. It is neither. It's about a grown man having sex with his pubescent niece. She is written to be the pursuer (as if that should make the situation more acceptable to the audience somehow?) and he is written to be conflicted. The conflict being: is he sexually interested in a child because he's mentally ill, or is it just the virus he contracted from a conch shell? (Insert eye roll here.) That's the mystery we, the audience, are presented with throughout the film and left with by the time the credits roll. So, with absolutely no resolution, it's a _bad_ mystery at that.<br><br>TL;DR: You'll be mad you wasted your time on this gross nonsense.","user":"queeroid","rank":[6,7]},{"title":"My Review Of \"Seeds\"","rating":7,"date":"8 September 2019","review":"\"Seeds\" isn't unique in its style or concept when telling stories like this, surreal melodrama and psychological horror meant to serve as a metaphor for something else. It is creative, and even with such dark, uncomfortable material, the film is often poetic. Right off, I got impressions of classic horror dramas like \"Suspiria\" and \"Possession\". Two films that hardly made sense at times, flowed in a dreamscape of confusion and melanchalia, but managed to be captivating and hypnotic.<br><br>\"Seeds\" is filmed beautifully, the characters hang between detached mimics and relatable, tragic beings. I have to admit though that a lot of the film is muddled in aimless grandeur, and it took far too long for a clear story line to emerge. There is also a very real moment when you understand the metaphorical significance, it all becomes predictable, and I wished for the confusion and mesmer to return.<br><br>The horror rests mostly on the psychological elements, more so than the monster aspect. The conflict between ones own morality and propensity for depravity is universal and always relavent. The creature, set aside it's own existence within the film, is menacing when on screen . Strikingly so! Still what I personally wanted was a representation a bit more Lovecraftian, than what I got.<br><br>Overall I left the film being a little split on my feelings. There is so much in this film that is told disturbing, beautiful. The acting is superb, and the creativity can't be denied. But I also wanted a bit more actualized, traditional horror. Still \"Seeds\" is film worth checking out, and a project worthy of recognition.","user":"ASouthernHorrorFan","rank":[14,32]},{"title":"Perversion disguised as \"Art\"\"","rating":1,"date":"4 November 2019","review":"This is NOT a horror film, nor is it a thriller.\nThis so called \"film\" explores pedophilia under the guise of \"art\".<br><br>This film is about a middle aged man, (Marcus) who happens to be infected with by some parasitic seed that causes him to have sexual exploits with a young girl......how convenient!\nHowever the creature that's infecting him is nothing more than a metaphor for his own sick and perverted desires.<br><br>To make matters worse, the movie is painfully slow, boring and vague with an ending that provides us with no answers.<br><br>One would have to question the sinister motives of the writers and creators of this child abuse trash.","user":"nthbeach","rank":[5,9]}]