[{"title":"It should have been a Netflix series","rating":4,"date":"13 October 2019","review":"It's not a bad movie, but it's only for people who read the book and can recognise the characters and storylines. The movie is rushed at times and we don't get the richness of the relationship of Theo and other key characters like Pippa. The underworld of stolen art market and antiques in the book is fascinating in the book but absent in the movie.<br><br>I hope authors of epic novels like The Goldfinch stop selling their books to movie producers and trust televsion/streaming services with their stories.","user":"luisponz","rank":[97,117]},{"title":"The critics are wrong about this one","rating":8,"date":"12 September 2019","review":"I had high hopes for this movie ever since it was announced, as it had cast an all-star cast and the novel (though I never read it) was considered great, so when the negative reviews came out, I lowered my expectations going into the movie and I'm glad I did. The cinematography was great as well as the directing, Oakes Fegley is a star in the making and this is his movie. The remaining cast was pretty good and Finn Wolfhard, despite what critics are saying, nails the Russian accent. This movie represents life and how just one mistake can change your future drastically and it's not a movie for casual film-goers (as I thought 10 minutes could have been trimmed). All in all I loved The Goldfinch and don't let the critics convince you not to watch it.","user":"karimgh","rank":[184,234]},{"title":"Lack of character development; this should have been a masterpiece","rating":6,"date":"15 September 2019","review":"I loved the book like everyone else who went to the movies with the expectations of a great movie. Unfortunately, however much I wanted to love the movie, I did not. I also don't hate it either. I may have enjoyed the movie a lot more had I never read the book, but expectations fell low. First, the chronology of the film is not linear, so we do jump around the timelines, which is pretty cool. But this also caused the great distress for not getting to know the characters well enough before we developed any feelings for them or their connections to Theo. Some spoilers ahead. We know Theo's mom does right in the beginning, but the way she is revealed at the end is too late for us to know that relationship Theo ever had with her or the way the room was left unchanged when he decided to run home and wait for his mother. That sense of loss was, well, lost in itself for not allowing us to connect with her earlier on. I couldn't care more for the mom for as much as I should be. Each character felt brushed by. I felt I was introduced to the dad and not much about him made me feel anything for him, neither when he died, he tried to cheat Theo or anything. Mrs. Barbour is a character that would have maybe saved at least one of the whole charActer relationships in the film, but because of the timeline, we see Mrs. Barbour say goodbye to Theo on his way to Vegas, and ten minutes later we are out of Vegas and back in nyc 8 years later, seeing Mrs. Barbour. There was no sense of missing her because we go right back to her. So many scenes that could have played out in a more important manner and conveying emotions were lost. Puppy was developed ok, but I wished a slight more was seen. Her last scene with Theo at the pub was the most emotional connection out of all the other characters, but again it was shortsighted. Hobie didn't do much, but just dipped in and out of Theo's life.<br><br>Little details were missing. I finished the book two days before the movie came out. One big scene that jumped out was Kitsey not wearing the green emerald earrings that she was supposed to wear in the book. Perhaps this decision was made becuase her character wasn't much in the film.\nThat said, the cinematography was astounding. The cast was great and this would and should have been a great maybe tv series rather than jamming a whole 600 paged storyline scenes into a two and a half hour film. The climax built greatly, but fell off pace as it felt rushed.\nThis would have been great.i still enjoyed the movie, even though I was hoping for a lot more.","user":"gogolooks","rank":[29,34]}]