[{"title":"Wild fire disaster movie packs an emotional wallop","rating":8,"date":"21 October 2017","review":"\"Only the Brave\" (2017 release; 133 min.) brings the story if the Granite Mountain Hot Shots fire squad. As the movie opens, \"Based on True Events\" we are reminded, we get to know Eric Marsh and his gang, as they are trying to get certified as Hot Shots, allowing them to combat wild fires in the front line. We also get to know Brendan, a doped-out loser whose girlfriend just got pregnant. Realizing he needs to turn his life around, Brendan applies to join the fire squad and for reasons unknown until much later in the movie, Eric decides to give Brendan a shot. In a parallel story, we also get to know Eric;s wife Amanda, a horse whisperer. But not all is well in their marriage... At this point we are 15 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is the latest movie from up-and-coming director Joseph Kosinski, who previously directed \"Ton: Legacy\" and \"Oblivion\". In his latest, he steers away from sci-fi and instead brings us the incredible story of the Prescott, AZ wild fire squad, nicknamed the Granite Mountain Hot Shots. I expected a disaster movie, and there is certainly that too, but the movie does much more than that: it brings the story of a group of people in a way that you are completely emotionally invested in those people, and you CARE. Kosinski directs an all-star cast, headed by Josh Brolin as Eric. Is it just me, but Brolin only seems to get better as he is getting older. That guy is just solid and authentic. Miles Teller plays the role of Brendan, an unlikable character at first. Jennifer Connelly is outstanding as Eric's wife Amanda. Taylor Kitsch is one of the guys in the fire squad. In much smaller roles, Jeff Bridges is Duane (Eric's superior), and the ageless Andie MacDowell plays Duane's wife. The movie's photography is eye-candy, and the wild fire scenes, which I imagine are mostly CGI, look very real to me. Last but not least, there is a very nice musical score, courtesy of composer Joseph Trapanese (who has worked with Kosinski before).<br><br>\"Only the Brave\" opened wide this weekend, and I was really looking forward to seeing it. The Friday evening screening where I saw this at here in Cincinnati was attended only so-so (less than half a fairly small theater), somewhat to my surprise, given the stellar critical acclaim this movie has been getting. I can only speak for myself, but I found this to be an outstanding wild fire disaster movie that packs an emotional wallop I didn't expect. I encourage you to check out \"Only the Brave\", be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion.","user":"paul-allaer","rank":[89,96]},{"title":"A True Story Worth Experiencing","rating":9,"date":"19 October 2017","review":"True stories are the one thing throughout the film industry that can't be known as being a dime a dozen because it seems as though almost half of the films nowadays are based on true events. Of that half, I'd say only about half of those stories are done with complete justice and care. So, it's really a toss-up when going into a film like this. With that said, Only the Brave is a fantastic presentation of these events and the men who risked their lives on a daily basis. Although it may feel a little slow at times, here is why I believe this is a film that's pretty much for everyone. <br><br>When you're trying to tell a possibly tragic story about people that may or may not have to give their lives in the wake of danger, it really does require some powerful and devoted performances in order to get the audience to emotionally respond to the events unfolding on-screen. From Josh Brolin to Miles Teller, to even Taylor Kitsch and Jennifer Connelly, I honestly thought this ensemble was one of the best of the entire year, with the standouts obviously being Brolin and Teller. Each and every one of the supporting roles gave their very best as well, making this a very believable and realistic team.<br><br>The premise of this film is relatively simple. A crew of firefighters is out to become the next crew of \"Hot Shots,\" and they will do whatever it takes, which also entails hiring some fresh and willing talent. The film dives into their lives outside of work and really invests you in each one of their jobs. I was quite riveted throughout each one of the fires, and I loved how it didn't take it too seriously to the point of depression. With a nice blend of bickering and action, these characters were more fleshed out and likable than I was expecting them to be, which really added a level of intensity to the overall movie. <br><br>It really is the fact that this film has a terrific cast that really makes you feel for them when the climax occurs in the third act. I was not familiar with the events that occurred in real life, so I wasn't sure what to expect from the finale of this film. Although I feel there are some abrupt aspects about it, I feel as though it was handled with care and respected the families involved in the actual events. The final act of this movie is surprising in multiple ways and it did have me shedding a few tears by the time the credits started to roll. <br><br>In the end, Only the Brave is definitely a slow watch at times and its run time is slightly longer than the material needs it to be, but when it's slow it also takes its time to emotionally invest you in its characters, so it's sort of a catch-22. With terrific performances all around, direction that seems to be inspired, and sequences that will have you on the edge of your seat, this is a very well-made a memorable film that I can confidently say will be one of my favorites of this year. This movie is well-made in every regard and I highly recommend it to everyone.","user":"kjproulx","rank":[115,126]},{"title":"A Team for the Ages","rating":9,"date":"22 October 2017","review":"There have only been a few movies in which the theater I was in went completely silent as the credits rolled. Only the Brave tells the true story of the Granite Mountain Hotshots who risked their lives to stop wildfires across the country. It's films like this that always move me the most. A group of people who you grow fond of during the course of a film band together in the most dangerous of circumstances for a common cause. When done right, they can be extremely powerful.<br><br>Directed by Joseph Kosinski and starring Josh Brolin, Miles Teller, Jeff Bridges, Jennifer Connelly, and Taylor Kitsch among others; all of them do a great job of creating a chemistry and realness between each other. In order to feel anything when these men are entering the flames, there has to be real friendships and relationships built between the actors as these real life heroes. Perhaps more than anything else, Only the Brave completely nailed the bond between the team of hotshots.<br><br>Going along with the bonds they have with each other, the film focuses heavily on a few of the men's personal lives, which is where the real emotion lied for me. Jennifer Connelly had the biggest supporting role, as the wife of Brolin's character, but that was far from the only character's personal life I felt attached to. As much as this a tribute to the men on the team, it's also a great film to honor those lives who were affected by the team in any way shape or form.<br><br>Kosinski's directing, the team of writers, the ensemble of actors and actresses, and of course everyone else doing the dirty work should be commended for the work here. Only the Brave is a deeply moving film that never takes advantage of the fiery source material to bombastic results, instead only using it to honor the lives impacted. Truly one of the best films of the year.<br><br>9.4/10","user":"ThomasDrufke","rank":[60,67]}]