[{"title":"Nostalgic for me, but a fun trip nonetheless","rating":7,"date":"4 April 2015","review":"To understand the cultural impact of the Teenage Mutant Ninja Turtles is to go back to the late '80s/early '90s when the property exploded and took the world by storm. TV, toys, the big screen, all of it. And \"Turtle Power\" does a pretty good job doing just that. This covers all of it, even going back to the very beginning with the underground comic (two kids in their living room started All of this). It was really cool to see the original voice cast of the '87 series back together (nice camaraderie), and it was new to me what sorts of trials were faced on the set of the 1990 film. Given the release date, I'd expected them to cover everything (one and all reboots) up until 2014 and shill for the new Michael Bay movie. Nope, not the case, and I think the movie turned out the better for it. There's plenty here devoted to the original cartoon, Playmates toy line and the New Line movies. Basically, the Turtles explosion.<br><br>And they bagged some great interview subjects: Brian Henson, Kevin Clash, the extremely attractive Judith Hoag and even James Avery (R.I.P.). Overall, good stuff. Well put-together and informative.<br><br>7/10","user":"Mr-Fusion","rank":[6,7]},{"title":"Cowabunga!","rating":7,"date":"21 June 2015","review":"By \"definitive\" they mean through 1990 or so, but that's okay, as that really covers that first initial wave of Turtlemania that swept the globe. With a runtime of just over 90 minutes, this is never the less a very thorough documentary about how an independently made black and white comic with a strange title and an even stranger premise came to dominate popular culture in the late 80s and early 90s. It features nearly all the people who were there and played a vital role, from creators Eastman and Laird to the makers and voice talent from the cartoon to the director and stars of the first live action movie to the people at Playmates toys who helped the Turtles become one of the biggest toy lines of all time. This is a well and lovingly made documentary and a must-see for any Turtles fan.","user":"Fluke_Skywalker","rank":[0,1]}]