[{"title":"Despite underdeveloped protagonist, compassion for the dying and society's aversion to it is a most worthwhile theme","rating":6,"date":"28 January 2017","review":"While Mexican director Michel Franco's story about a palliative care worker may not be completely developed, his overarching theme proves to be quite illuminating as well as disturbing. His protagonist is the driven David, very well-played by Tim Roth, known for work in wide variety of independent and mainstream features.<br><br>Chronic is divided into three segments focusing on the three patients David cares for. The first has little dialogue and focuses on David taking care of an emaciated woman whom we later learn is named Sarah. The camera is fixed at a distance and we see David assiduously attending to Sarah, carrying her around as she is unable to walk and propping her up in the shower, as he bathes her. <br><br>Soon afterward David is attending the woman's funeral and is approached by the niece of the woman who seeks information as to her aunt's last days. David declines to speak with her. Franco's theme soon becomes apparent—family members keep their distance from relatives chronically ill, facing their last days. Only the palliative care worker—in this case one who appears to care deeply about his patients—seeks to get involved by engaging with the dying, on a deeper emotional level.<br><br>David so identifies with his patients that when queried by strangers at a bar, he refers to Sarah as his wife, an AIDS patient, who has just died. In the next and most compelling segment, David goes as far as going to a bookstore and purchasing books on architecture in order to converse with his next charge, John, a former architect now debilitated by a devastating stroke. Again, it's the extra effort he puts in to take care of his patients that's so impressive (he voluntarily takes over the night shift for the next nurse on duty free of charge). <br><br>Unfortunately, John's family doesn't take too kindly to David allowing John to watch pornography on his laptop, and soon he's being accused of sexual harassment and forced to leave John immediately. Again the theme of society's aversion to confronting mortality is reiterated. There is nothing salacious about David's actions—he simply seeks to improve the quality of life for his patients and bring them a measure of humanity and dignity in their dying days.<br><br>What causes David to be so self-sacrificing? Franco presents David's backstory in dribs and drabs—contact via the computer and in person between his ex-wife and daughter provides a sketchy picture of a man who was forced to deal with the terminal illness of his son—ultimately deciding to pull the plug much to the chagrin of family members. <br><br>There's not much more to what makes David tick but he's the kind of saint that makes people uncomfortable. Franco's portrait of David's devotion to his patients is uplifting and reminds us that we should all be more sympathetic to those facing end of life issues.<br><br>In the last segment, David forms a relationship with a woman undergoing chemotherapy and ultimately facing a terminal diagnosis. Again David's engagement of the dying is cathartic, but Franco now shifts gears by injecting another issue into the narrative involving assisted suicide. David's ambivalence about how he handles this situation is brought out and this is how the story basically ends.<br><br>There is a coda, however, that some critics found specious (Super Spoilers ahead). David, who jogs in his spare time, is suddenly hit by a car and is killed in the final scene. Franco perhaps is hammering us a bit too hard when the devoted healer ironically meets an untimely end himself.<br><br>Chronic is not for everyone. It's slow-moving and its protagonist is not much of a developed character. Nonetheless, the theme of compassion for the dying and society's aversion to such a subject, is a wake-up call for the majority of us who choose not to reckon with the reality of our own mortality.","user":"Turfseer","rank":[20,20]},{"title":"So depressing but worth watching...","rating":24,"date":"24 October 2015","review":"One warning first. <br><br>Don't go to see this movie if you are not in the mood to.<br><br>Don't go to see this movie if one of your friends or relatives is suffering of a lethal disease such as cancer, AIDS or what so ever...<br><br>Don't go to watch this movie if you are depressed or just to commit suicide.<br><br>But, yes, yes, yes it's a wonderful, moving story here showing the daily burden of a male home nurse taking care of terminal cancer phase or severe brain vascular damages patients. Some very hard watching scenes but nothing gratuitous here, on the contrary, so close to reality. Tim Roth is terrific in this feature, in this ambivalent, disturbing but so kind man in the same time. A so gripping character. <br><br>I love the film making, with so many still camera shots all the time, in the pure European or non Hollywood films style. <br><br>And the story is very like another movie from UK I watched this year: STILL LIFE. With a very similar character and a very same ending. A real must see but not for all audiences.","user":"searchanddestroy-1","rank":[26,29]},{"title":"What is love?","rating":10,"date":"30 March 2017","review":"Character driven masterpiece (Tim Roth as David, being an exceptionally detached, efficient and yet sensitive nurse) composed of different \"episodes\" cleverly puzzled together. The focus - as the title hints - is on chronic (and terminal) sickness but don't expect anything pointlessly dramatic or tear-jerking. Instead every story line seems an attempt to explore a broader (and ocean deep) set of topics:<br><br>What are really worth our typical human bonds and their cultural boundaries?<br><br>Do we really acknowledge our frailty before getting to \"the point\"?<br><br>Does our grown-ups busy daily life affect our ability to assess new scenarios?<br><br>How dangerous (and rewarding) can be thinking about (and adopting) a deeper perspective?<br><br>A very nice episode i.e. shows mercilessly how chronic illness is prone to destroying relationships. No matter how close you were to your beloved ones and how sorrowful they are; you are a different person with different priorities now: either they get it or they become less and less relevant for your existence. Someone who understands you and your needs becomes indeed a better companion than anyone else (ah love... oh family). And this is ofc hard to deal with for the previous \"favourites\".<br><br>Who can say he always gets what the authors meant to express? Or everything? Well, here we have many (but not too many) good examples of film sections where apparently nothing happens. What's the matter then? Within this \"emptyness\" there's David thinking, feeling and changing. Up to the dumb viewer to decide that this is irrelevant. We think we are better than that and we will use these sections to guess and feel ourselves what is happening.<br><br>But it's not all-in on the imagery: we have a solid script as well (best screenplay at Cannes); it's a pleasure noticing how lying is used (and it's annoying reading that a reviewer dislikes David because he is shady). Another review suggests that the film \"Still life\" (2013) is used as more than an inspiration while unaccredited but that is plainly wrong: \"Still life\" is Forrest-Gump-surreal and plot-driven while here we are on the opposite side; \"Still life\" deals with someone believing that dead people deserve care and love, while here David just feels like giving dignity to its fullest to the sick. Well, both films have workaholic main characters but the parallel solidity ends there in our opinion.<br><br>A possibly weak point is the color palette which is strangely overexposed and bland (not necessarily in a annoying sense): if this is not meant to be so as an expressive tool (which may well be for reasons I don't get) I'd note a lack of proper post-processing.<br><br>Not a happy movie but neither a sad one and most definitely not a \"pornographic\" one just because you see a penis, excrements and death (didn't people notice we don't see any blood? fortuitous or thought provoking?)... Anyways be ready to switch the brain on for this great work. It's a 9 but I'll go for a 10 given how clueless low-vote reviewers sound.","user":"Ladiloque","rank":[10,10]}]