[{"title":"Winner All the Way !!","rating":10,"date":"19 July 2015","review":"Haven't seen such a beautiful movie in recent Times. Its Salman's Best movie till date. BB is not an Anti-Pakistan film. It's a possibility that it will be a lesser commercial success than Kick or Ek Tha Tiger. Its not Salman's type of movies but probably the best one.<br><br>KK has been vigilant about sense and aesthetics more than just looking into a mass appeal. This could be a new beginning for a successful director to becoming a good director. He has been helped a great deal by Vijayendra Prasad's story and a capable production design team of Rajnish Hedao. Vijayendra' a household name in South market, has brought an original story with a lot of room to attract cine- goers. Rajnish's team, well known for PK, Rockstar and Three Idiots, already has vast experience of multi- location shoots. BB spreads across various cities and weathers and production design and art direction is always tough for such films. Credit to KK for utilizing the resources at hand in the best possible way.","user":"divyasingh532","rank":[34,37]},{"title":"Finally something refreshing!","rating":10,"date":"17 July 2015","review":"Despite being a Salman fan I was not too impressed with some of his recent flicks which in my humble opinion lacked freshness or had mindless direction, so when a family member bought tickets for this movie I didn't go in with high expectations. But to you dear reader I'll say GO WITH HIGH EXPECTATIONS! It will not disappoint! <br><br>And more importantly go with your heart - that is all you need for this 2.5 hours long film to become one of the best you've seen in years. It's just one of those movies with such heart-tugging moments and the highlight - the bond between Pawan (Salman) and Shahida (Harshali) - which is such a delight to see that you forget all about plot, logic, direction - not to say that the movie lacks that. The perfection in execution is definitely there, especially in the second-half. I watched it in the AVX theatre with at least 500 others and from the sound of it at least 75% of them regardless of age or gender were crying from the intermission onwards - sometimes because it was sad and other times because the screenplay was just so pure and unfiltered that it just made these happy tears bubble up inside of you.<br><br>There is a certain level of comedy throughout and definitely some deep witty one-liners. My favourite was from Nawazuddin Sidduiqi (who played his role to perfection) who pointing at the current state of the media and their polarization of India and Pakistan proclaimed that \"Hatred sells. Mohabbat doesn't.\" <br><br>The movie has depth, a message, and the cuteness overload that is Harshali Malhotra. It also has a relationship and emotions so simple yet so extraordinary that they make a hero out of a common man. :)","user":"ranjanac","rank":[102,120]},{"title":"One of the best movies of all time","rating":10,"date":"17 July 2015","review":"This is undoubtedly Salman Khan's best movie ever! What a masterpiece of a movie with: 1) one of the best stories presented on the big screen in the past decade, 2) unbelievable acting by each and every member of the cast, particularly Nawazuddin and the little charming girl - Harshaali, 3) some of the most soulful songs heard in the recent past, esp the one sung by Adnan Sami, and last but not the least 4) Salman Khan being at his best in all forms of acting, especially his best emotional scenes ever. Salman Khan, aka Bajrangi will blow you away in this smoothly paced and highly entertaining + engaging drama - with Shahida by his side. A must must watch movie for each and every member of the family, friends, siblings, kids, partners etc etc.","user":"nikhil-40302","rank":[122,148]}]