[{"title":"The bad reviews have it all wrong","rating":7,"date":"27 May 2016","review":"This movie was a great CREEPY movie. Not intensely terrifying, and that was not the purpose. Dolls are creepy and therefore a movie about a doll is supposed to be creepy and this movie nailed it. A lot of people complain about the ending, some say that they don't like how it wasn't actually the doll being possessed by a spirit, and I've even read some reviews from some.... Not very smart people.... Who somehow totally missed the fact that the man was the \"dead\" boy. He killed a little girl when he was 8. His parents were ashamed, hid him in the walls, and I believe they created doll to replace their \"odd\" boy. They locked the real guy up, never saw him, fed him through the walls, he had a bunch of holes he made over time that led to the inside of the house. The parents were scared of him too, so they made sure to comply with all his requests: loud music so he can hear it behind the walls. Living in isolation for 20 years behind the walls would obviously drive someone intensely mad, not to mention he was odd to start out with. Obsessive, creepy, weird. The doll was his creepy way of being loved and accepted by his parents, and as he hoped, by a woman. So he lived through the doll for 20 years. It's the story of an isolated family with a dark secret, an even more isolated and insane man who just wanted to be loved, and lived through the more lovable and accepted doll, and was murderous against anyone who rejected him. Creepy. And successful. Anyone who dislikes this movie probably wanted super scary, and it did have a couple scary moments, or they wanted poltergeist chuckie demon doll, which no offense, but that is silly. It makes it way more cool for it to not be paranormal but just a really f'ed up family in the middle of nowhere.","user":"annaily","rank":[100,115]},{"title":"People are being too hard on this good movie, better than ANABELLE to me.","rating":8,"date":"28 April 2016","review":"NO spoilers<br><br>OK, OK, i understand most peoples problems with this flick. It has some gaps, and some missing story elements. I read a couple of reviews, and people complained about things not being explained and impossible scenarios. But this move was super entertaining. I did not want to turn away, it kept me glued, and was fun. What else do you really want from a horror or mystery movie? It was original, and inventive, and the acting was good. Was it a perfect movie, no... but it was definitely worth watching, and if your on the fence about it, don't be, watch it. And i am picky.","user":"zachary-10857","rank":[122,142]},{"title":"a horror movie with more originality than usual","rating":31,"date":"31 May 2016","review":"If you are looking for a horror movie with more originality than usual this may be your film. Most horrors are standard genre films that rely on cinema clichés to frighten us and audiences have become immune to plots with spooky dolls, isolated nannies and scary mansions. The Boy (2016) stands out by combining all of these horror tropes into a single story then overlays them with a plausible thriller about parental grief. It tries to be a serious film without the lame humour which so often sugar-coats horror movies into comedy-thrillers. But the downside is also typical of the genre: it runs out of ideas on how to finish the job.<br><br>Greta (Lauren Cohan) is fleeing a bad relationship and applies for a nanny job caring for an 8-year old. She arrives at an isolated mansion in the English countryside and the child turns out to be a life-size doll called Brahms. The older couple's son died in mysterious circumstances twenty years earlier and Brahms is their way of dealing with unresolved grief. The creepy parents abruptly depart for an extended holiday, leaving Greta with strict instructions on how to care for Brahms. At first she ignores Brahms but soon weird things happen like the doll changes position and strange sounds echo through the house. Greta is alone and terrified until she befriends the local grocery guy Malcolm, but all hell breaks loose when the violent ex-boyfriend turns up unexpectedly. Poor Brahms becomes the unwanted child in some high-tension scenes but predictably the doll gets its revenge.<br><br>Although not a great fan of horrors, this one kept me engaged until the final quarter where a tired old stock-standard formula is used to tie the narrative ends together. Until then, the film maintains a menacing Gothic atmosphere and enough surprises to keep you guessing what will happen next. Lauren Cohan is well cast as Greta and the story moves along at a lively pace. If you are not willing to suspend disbelief and go along with the story premise, you are unlikely to see it through and you are probably not a horror fan anyway. A good test if it will work on you is to grab a toy doll and stare into its eyes; if your mind can fantasise it staring back at you with malicious intent, you pass and should see The Boy.","user":"CineMuseFilms","rank":[57,65]}]