[{"title":"Most boring movie I've seen in a long time","rating":1,"date":"27 February 2016","review":"There are at least 4 fake accounts being used here in the comments. How do I know? Because it is impossible for anyone with the intelligence to create an account and post on IMDb to consider this movie a 7, an 8, a 9 and a 10.<br><br>This isn't just a difference in personal preference. This is by any standard a terrible terrible movie.<br><br>I expected a movie about someone's life being turned upside down because they were being cyber-terrorized. That's the plot summary. What I got instead was a movie that chronicled the most mundane activities of a young pudgy woman's everyday life.<br><br>Everything is shot on webcams and cell phones. I thought this was clever for the first 10 minutes because, although it was annoying, I thought it was a good way to introduce the viewer to the fact that all her devices have been hacked by a stalker. I guessed that it would then turn into a real movie after five or ten minutes. Nope. The entire f***ing thing is shot like that. It's annoying as hell. But much worse is the fact that nothing happens.<br><br>For the first hour, we the viewers are treated to having to sit through (and don't forget this is all shot from the perspective of computer webcams and cell phone cams):<br><br><ul><li>she does housework - she dances around the house - we see her ankle in the shower scene - she gets hit on by a guy in the library - she chats with her mom on Skype - she cooks - she does aerobics - etc. No, it does not get more meaty than that. Imagine your boring routine life and then having to watch someone else do the exact same things you do all day. That's what this movie is.</li></ul><br><br>I tried hard to keep going but I couldn't. I gave up after an hour to go floss my teeth, which was more exciting by a factor of 10.<br><br>Bad movies, there are plenty, I can live with that. What I can't live with is the f***ing FRAUDS on this board that are working for the studio and come here to pump up the rating. It should be illegal to falsely make others believe a movie is good to get you to watch it. In every other business, trying to sell something by lying to the customer - by saying that something does what it clearly doesn't - is illegal. Movies are supposed to entertain. This one does the opposite of entertain.<br><br>The only \"horror\" in this film that I saw was having to sit through the non-story.<br><br>It just plain sucks bad.","user":"throwaway50000","rank":[54,83]},{"title":"Ratter is AWFUL - Don't Bother","rating":1,"date":"20 February 2016","review":"I hate it when you go to a movie on IMDb and it has a high rating as one person, most probably involved with the movie or promoting it, rates it high just to suck you in. This movie is absolutely AWFUL. It has amateur camera work, most probably due to a limited budget, a boring story line, and the actors just seem like actors from a local college class. I know it is supposed to be on the subject of people hacking into your devices and monitoring you but boy was this BAD. Don't bother with this movie as you will never get that time back. For the person who wrote the first review - Shame on you. You should not review a movie again. This movie should be 1/10. I certainly regret watching it.","user":"foxyimports","rank":[76,124]},{"title":"Chills","rating":7,"date":"21 February 2016","review":"One of the reasons I explore the out of the way places when it comes to film. Low budget and shot mostly on webcams, this movie evokes a sense of dread and horror without showing a drop of blood. The moral, if there is one, says that danger in the 21st century no longer needs mass or form. <br><br>Emma is surrounded by the technology that slowly becomes a menace to her as a stalker takes over her devices and the devices of others. A nameless presence oozes through the movie with no clear indication of who or why - it's just nameless malice floating through the same ether as the wireless signals that connect her. As such, it's filmed entirely on hand-held, cell phone and webcam. While this gets annoying at times, the filmmakers break up with some nice editing moves. The performances are solid and engaging. The stark, brutal ending horrified me with its unspoken implications. <br><br>(BTW - to the person who trashed this, insisting that the rating was inflated, I didn't even know this film existed. If you didn't like it (and I'm betting the lack of nudity and gore played a part in that) that's fine. But don't be a dick.)","user":"paul-day-clone","rank":[48,76]}]