[{"title":"Hard to believe this beautiful film is a documentary","rating":9,"date":"27 November 2016","review":"Filmed in a remote part of Western Mongolia, this beautifully shot film chronicles the coming of age of Aisholpan, a 13-year-old girl who wants to become an Eagle Hunter like her dad, grandfather, and all male ancestors stretching back 12 generations. Her dad is all for it (quite a modern attitude, as it turns out) but custom dictates that eagle hunting (that's hunting with eagles, not hunting for eagles) is a male undertaking. Girls are too weak, fragile, get cold, etc. The usual explanations why a female can't do what a male does. However, Aisholpan is fearless. With dad's help, she climbs up and down a mountain to trap her own eaglet just before it's old enough to fly away from her. She trains it to hunt with humans. She competes in the local eagle-hunter festival in Ölgii (signage in the film is in Russian and English). All of this takes place surrounded by the beautiful but bleak mountains of the Mongolia steppe, carefully captured on film. (Looks a lot like Death Valley in winter to me.) These people are heroic just going about a nomad's daily subsistence life that's obviously hundreds or thousands of years old but adapted to modern times with down parkas, trucks, and motorcycles. Their lives are both far removed and yet arrestingly similar to Western life (minus the Starbucks). They care for their kids, drive, go to school, listen to the news on the radio, read by electricity stored from a solar array set up on a metal pole and a wooden stick.<br><br>The point: This movie captures a mostly pre-industrial society coping with 21st-century norms in a modern world, and with little to no extra effort as portrayed in this movie. For example, the film's Web page on Sony Pictures' site shows Aisholpan with a Go Pro Hero action camera strapped to her head, which explains where some of the film footage came from.<br><br>Billed as a documentary, we presumably see things as they happened. I couldn't say but nothing much goes wrong in this movie. Mostly, things go very right and the narrative just moves forward. Nevertheless, I was always cheering for Aisholpan, because she's a most worthy heroine.","user":"steven-leibson","rank":[18,21]},{"title":"Beautiful and uplifting","rating":3,"date":"3 December 2016","review":"\"It's not a choice, it's a calling that has to be in your blood.\" Aisholpan's father, Nurgaiv.<br><br>Rarely does a documentary tell it like it is; manipulative docs sometimes embellish with contrived conflicts or outrageously obvious re-creations. The Eagle Huntress needs no phony clashes or extensive re-enactments, for its hero is 13 year old Aisholpan, from Asia's Altai Mountains, the first female Kazakh in twelve generations to be a bona fide eagle huntress.<br><br>The Eagle Huntress is so beautifully shot you'd almost book passage to visit this isolated world in Mongolia by the China border. Director Otto Bell said, \"It's not the end of the world, but you can see it from there.\" The air and sky are clear like we in the city have never seen, and the nomadic tribe that gives us Aisolpan is so loving and innocent as to make us wonder what our modern technology has taken from us.<br><br>I guess I am most impressed that the modern notion of female empowerment is played without histrionics among elders who question her fitness as a woman to compete in the annual Golden Eagle Festival. Aisholpan is the perfect model for early teen film goers: fresh faced, wide smiled, and ready for challenges. Director Otto Bell lets the male power gently give in to the age of feminism without acting like stupid old guys.<br><br>The Eagle Huntress works not just as a tract supporting the new woman but also as a treatise on simple, authentic life style where what one does trumps what one says. By the way, she's a perfect role model because she lacks the self-absorbed qualities of today's female heroes.<br><br>It's beautiful and uplifting in the most honest way a doc can be.","user":"jdesando","rank":[16,19]},{"title":"Outstanding exploration of Mongolian nomadic life","rating":10,"date":"10 September 2016","review":"Not only does this film trace the remarkable achievements of the teenage girl Aisholpan who handles very major challenges in achieving the goal of becoming the first female ever to become a successful hunter using the eaglet she has trained from a nestling, but it also portrays the life of Kazakh nomadic herders in the Altai region of Mongolia better than any of the other Mongolian herder films I have seen (even the Weeping Camel, which was also outstanding). I have travelled in this area of Mongolia and the adjacent part of Xinjiang in China - it is a very tough environment for the people who live there, and making such a technically difficult film must have been extraordinarily challenging. The scenes where Aisholpan captures her eaglet and where the eagle catches its first fox are breathtaking, and the scenes showing the interactions among these very traditional people of the Altai region are so totally realistic the film makers must have established very good relationships with them first.","user":"rogermorris-30149","rank":[26,33]}]