[{"title":"Fantastic romantic musical comedy","rating":7,"date":"7 June 2018","review":"The picture \"How to talk to girls at parties\" is a fascinating and fantastic story about love. The film unfolds in the suburbs of London in 1977. Three friends of high school punks after the next concert go in search of after-care and accidentally wander to an unusual party. There they observe small groups of people in amazing costumes of various colors. One of them is fond of sex Stella (Ruth Wilson), the other finds herself in a strange dance, and the main character Anne (Alex Sharp) falls in love with the beautiful Zen (El Fanning). At first, it seems to him that she is just a nuts American, but later he learns that she is an alien, like everyone else at a party. This is only an intriguing plot of the film, which can be called a fantastic romantic musical comedy impregnated with punk culture.<br><br>This work was put by John Cameron Mitchell on the eponymous story of the now very popular English writer Neil Gaiman. American Mitchell - a provocative director, screenwriter, actor - known for theatrical and film audience for his musical, and later the film - \"Hedwig and the ill-fated inch.\" Briton Gaiman, in turn, is more known for the novel \"American Gods\" and his recent serialization. In creating a beautiful visual style, Mitchell was helped by the cameraman Frank J. DeMarco, who shot \"The hope will not fade away\" with Robert Redford, as well as costume designer Sandy Powell, the owner of three Oscars, for her past work. Along with this, you can hear the frenzied music of the 70's in the picture, not so much hits as it usually happens, how many tracks of lesser known bands that even more immerses in that atmosphere.<br><br>To watch this picture is a pleasure, if you like its creators like punk rock and Britain of that time. Animated psychedelic scenes complementary to what is happening look bright and mesmerizing. The cast that, to the stars already listed (and they can not be called in any other way, because Ruth Wilson and Alex Sharp are also theater actors with high awards) is complemented by the unfading Nicole Kidman in the image of the punk queen Bodice, looks very convincing. And the fascinating El Fanning, who is at least 18 years old, will make even those who perfectly speak with girls at parties party.","user":"BiiivAL","rank":[74,88]},{"title":"You will love it or hate it","rating":9,"date":"2 June 2018","review":"It's pretentious and cheesy, unique and amazing. The only promise I can make is that you have never seen anything like it. That in itself should be enough to make any movie or art lover feel like this movie was money and time well spent. Of course there are flaws, but it's punk, that's what gives it character. If you spend all your money on Hollywood reboots, stay far, far away... <br><br>You can enjoy the humor in this movie on the surface level or try to dig deeper into the many metaphors. I just went along for the ride and had a great time.","user":"root88","rank":[51,62]},{"title":"Loved it","rating":8,"date":"27 May 2018","review":"When I read Neil Gaiman's short story of the same title, I wanted more. It is a beautiful story, I wanted more of it, and this movie delivered for me.<br><br>If you want to know what you are getting into before watching, it is a blend of romanticized teenage punk scene with fantasy world aliens. It is nostalgic, fun, and touching. You can read the short story before watching the movie, or read the comic book (it is beautiful).<br><br>Some negative reviews I've seen say the movie failed their expectations, which were based solely on the title (lol), or cast. Don't be that person. Or maybe they are just punks?","user":"pashai","rank":[42,58]}]