[{"title":"I was satisfied","rating":7,"date":"4 December 2016","review":"I enjoyed this movie because of the lessons it teaches about telling a story on a tiny budget.<br><br>Mike, Rich, and Jay (along with the other members of the RLM team) focus most of their output talking about movies, about what makes them work and what makes the fall short.<br><br>Space Cop is very self-aware, and I don't think it can be viewed by itself as a standalone movie. In many ways, it is a meta-movie, designed to point out the elements that comprise storytelling on the screen.<br><br>It's not hilarious or beautiful or fascinating; it's something else, a secondary communication from the creators that brings together many of the ideas from Half In the Bag, Best of the Worst, and The Plinkett Reviews.<br><br>I enjoyed this movie, but I did lot of homework with RLM over the years to get the points they are making. I accept it for what it is.","user":"hlocnw","rank":[20,24]},{"title":"Disappointed","rating":4,"date":"31 January 2016","review":"As a huge fan of RLM I was really looking forward to this movie, but I was really disappointed. <br><br>It's not funny.<br><br>I really like their skits that they have done in the past(HITB&amp;others), but this movie just isn't funny. I was kinda smiling in few parts and laughed twice, but yeah there is just so many missed jokes they could have done. I was writing a better movie in my head while watching it.<br><br>They clearly put a lot of effort in to making this movie and I'm not trying to dis them, but I suggest next time they should put much more effort in to the script than the sets and special FX.<br><br>They should try making some kind of down to earth comedy(clerks) rather than a high concept one because of their limited budget &amp; crew.<br><br>And the acting/casting choices of Rich and Mike were just horrible. Mike should be the lovable cynic and Rich the wacky one not the other way around.<br><br>I hope in their next project they don't try to do these \"wacky\" voices and just speak in their normal voices.<br><br>4/10","user":"kjmusto","rank":[59,82]},{"title":"Space Cop Fell Short, Mostly Flatlined","rating":1,"date":"27 January 2016","review":"The feeling I had after viewing was a strong \"Meh.\" Perhaps if the product had sold for 10 bucks instead of 25 bucks, I wouldn't have felt so unfulfilled. But for the price of the movie(the blue-ray version), it was not worth it. The special features did not add much either.<br><br>The audio suffered in many areas. The musical score was drab and irritating, and in some parts, even distracting due to the levels being off. The score clashed with dialogue and other sound effects, forming a mesh of noise.<br><br>There were also audio flaws. Aside from parts of the film where audio did not sync properly to characters mouths, much of the dialogue sounded dubbed, as if they had technical problems they did not realize until post production.<br><br>When actors were called back to re-record lines, they ended up sounding like they were concentrating too hard on syncing their voices to footage, which took away from the much more natural delivery they probably had on set physically interacting with each other. Most noticeably was this in Jocelyn Ridgleys character. There were also audio distortions in some of the dialogue with characters, like the mic had redlined. <br><br>When it came to the cinematography, Space Cop relied mostly on bland tripod shots, or shaky hand held shots. No steadicams, skylifts, booms, panning...just the type of cinematography you would expect from anyones low budget backyard film. For RLM, you would expect more, as you have seen them do more in several of their projects.<br><br>Mike Stoklasa and Rich Evans as the main characters, the formula did not work for one main reason. Both Mike and Rich played caricatures, not characters. The combined result of two \"cartoons\" took away from the film, as I found myself detached and not invested in either.<br><br>Had Stoklasas character played just Stoklasa, or a more \"straight man\" role, it might have worked better. Instead, Stoklasa played a caricature of a corny 1930's styled vaudevillian,(though I think they meant to do more of a 1950's style \"Untouchables/Elliot Ness\" type) while Evans played a cliché clint eastwood/1980's action hero. The result was being forced to listen to two \"silly\" voices for the whole film, and the humor you would get from it hit its punchline 60 minutes before the film ended.<br><br>When it comes to indie films, most indie film makers take advantage of their unrated status, and exploit things like sex, violence, foul language or a lack of political correctness. Space Cop fell short of all of this. It is a PG-13 film, yet the vast majority of RLM's fanbase are well over 17.<br><br>I think Space Cop may have made up for its shortcomings had they went for more blood and gore, or made the audience wince over other subject matter. For instance, Stoklasas character is a detective from the past, and they did play with some politically incorrect humor over his storyline. But they could have gone further with it, even made an intelligent and satirical statement about the subject matter.<br><br>The problem with this self aware, purposefully bad film making style(that often dominates the indie scene) is that it makes it harder for the audience to invest in any of the characters, to root for the good guy, or get involved with the story.<br><br>These things are essential to any movie. As bad as Death Wish 3 was, the producers set out to tell a story and deliver a performance. You still rooted for Charles Bronson. You still cared about or hoped his friends and allies would not get hurt. You wanted to see the bad guys get what they deserved.<br><br>In Space Cop, you just didn't care. You went a long with the story simply because it existed. The \"bad guys\" were convoluted, in fact in the last 20 minutes, you learn they aren't even the antagonists.<br><br>I'm sure my little review will be attacked by brainless and pathetic RLM fanboys who will defend slipshod work with excuses like \"its meant to be bad\" and \"its JUST a b movie\", but this only vindicates my point about purposefully self aware shlock.<br><br>For a group of people to make a side career out of criticizing the work of others, it must be nice to be able to fall back on such excuses when your own work flatlines or falls short.<br><br>In all honesty, the entire movie felt like a long youtube video. In fact, Red Letter Media probably would have gotten more attention and fanfare had they turned Space Cop into an internet series, broken into 10 minute videos. Not only would they have reached a larger audience by providing the content for free, but they would have still earned ad revenue on the product, and the flaws and shortcomings would have been much more forgivable.<br><br>Having seen all of RLM's films, Space Cop was definitely a step backwards. Hopefully in their next project, they will base a story on something more than just a cheap gimmick/joke, not take so long to complete it, and charge much less. There really is no need for them to bother with Blu-Rays.","user":"BitterJim","rank":[32,47]}]