[{"title":"Nice surprise","rating":7,"date":"18 April 2018","review":"If you like horror, you will probably like this movie. I almost skipped it because the review site I looked at gave it a 4...its definitely better than that. Is it going to win an Oscar? No...But is it entertaining? Yes. The little girl did a great job, she has a bright future in acting. A couple of parts are kind of brutal, but hey, it is a horror movie. If in the mood for something different give it a chance, I was pleasantly surprised.","user":"pensacolacomputer","rank":[120,140]},{"title":"Very good!","rating":8,"date":"26 April 2018","review":"At least two of the negative reviews clearly indicate that they only watched the beginning of the movie, and rate it unfairly imo.<br><br>This movie is excellent at involving the viewer's imagination. I put it on meant for background noise while I was multitasking, but dropped everything else to watch it.<br><br>Some pretty good scare parts, and that kid is a talent that I'm sure we'll see a lot more of. The plot was also pretty good at keeping me from correctly predicting what happens next. *Watch the beginning of the end credits, too - it delivers closure.<br><br>Nice to see Anna Torv again, too - I think I'll watch the first three seasons of Fringe, now lol!","user":"rsvp321","rank":[84,103]},{"title":"Glad I gave it a chance","rating":7,"date":"24 April 2018","review":"Being a fan of Anna Torv (Fringe) and not having seen her in anything for a while (also do enjoy a good horror type movie), I decided to give this a go.\nThe acting is great, albeit a very minimal cast. The young girl (Stephanie) carried the film well, with most of the scenes being her on her own.\nThis is a bit of a mix of a movie, with some horror and sci-fi elements, it did kind of remind me of a Fringe event.\nNot sure why there are some low ratings here, can only assume some people went into this expecting something else. This movie will keep you guessing as to what is going on and doesn't disappoint.\nSo if you like a bit of a break from the norm, give this one a go.","user":"ramonster_uk","rank":[66,83]}]