[{"title":"Scratched the Surface","rating":4,"date":"13 July 2016","review":"I went into this movie with the expectations of a more orthodox time line. About a young pitching prodigy from his early days in High School to his troubled journey in the Major Leagues. The story scratched the surface of his overbearing Father and his mental state as to why he was having trouble throwing strikes, But for me, the movie never tied it all together. All the characters in the movie were never fully developed enough to explain the reason for Hopper's problem. I was waiting for the progress made by Hopper in his sessions with Dr. Mobley playing out on the field or the root of the problem being revealed finally at the end. That never materialized. The ending left you wanting more meat on the bone. I was very disappointed with this movie because it had a good premise but was too superficially told to make any impact on the viewer.","user":"abadguy44","rank":[14,16]},{"title":"The people that would like this film probably would not watch it.","rating":7,"date":"11 June 2017","review":"This is a strong character study. I really enjoyed it, but it is not a sports movie, at least not what one thinks of a typical sports movie. Strong acting throughout elevate this from being a pretty run of the mill character study. I really enjoyed hating the Ethan Hawke character. At times I thought the character was slightly over the top, but I still liked it. Worth watching. Just a word of warning, if sports movies are your favorite genre, you may want to reset your expectations a bit before watching. You will probably enjoy it more.","user":"somf","rank":[6,6]},{"title":"Doesn't really have an ending...","rating":4,"date":"1 July 2016","review":"It was an alright movie for the most part, but when it was over I sat up in bed and said \"Is that it\"? I guess this is one of those movies that you just have to decide what happens to the characters when it's all over.<br><br>There are certain scenes that just felt very out of place and a few different parts of the story that didn't get fully fleshed out. Towards the end of the movie, I thought the movie was finally building up to a climax but it turned out to just be the end of the movie.<br><br>One thing I did like about the movie though, was that there were some very beautiful scenes and shots. Good camera-work and use of color, but the writing couldn't keep up with the directing.<br><br>If you're into baseball, are a huge sports enthusiast, or like movies without an ending, then this film may be for you. Otherwise, your time might be better spent elsewhere.","user":"treyosaddler","rank":[14,18]}]