[{"title":"Good premise, poorly executed","rating":2,"date":"22 September 2016","review":"I watched this film based on it's tag line. It was a good premise, but the acting wasn't great and it was a little ham-fisted.<br><br>Plot: several literary types (a gay book shop owner, an English professor, a local reporter and a publican) band together to write mummy-porn. They do so to save the local pub.<br><br>*spoilers*; obviously they suddenly need to have a female author. Now this could have been a ripe area for exploration. Whenever a woman has needed a male front-man to sell something there's some exploration of bias and sexism in the industry. But that's not even acknowledged.<br><br>Then there's the front-woman. A struggling actress. So they set her up with fame and fortune and all she has to do is 'act'. But apparently that's too taxing for an actress and she is portrayed as the victim. She is cruel to them, betrays their trust and then tries to financially screw them.<br><br>In the final scene, she doesn't even apologize but is given a job in the saved pub.<br><br>It could have been really fun. Like a literary Full Monty. But each step was ham-fisted and obvious. The actress was totally unsympathetic and the four authors were continuously dumped on. It was great to see the gay book store owners, but even that was a little rough. It would have been nice to explore the differences between male and female tastes, particularly as some of the authors were so unfamiliar with the genre.<br><br>Disappointing.","user":"christopher-39349","rank":[12,16]},{"title":"Should have been so much better","rating":3,"date":"25 November 2016","review":"Oh dear. Another writer/director movie (okay, they're not all bad, just most of them.) It's a strange little film with a great idea and some class actors - including John Hurt, bless! Love him but he must have done it for the money - but in dire need of some editing, rewriting, tightening, reworking and all the other stuff you do to make a so-so movie better.<br><br>Read the blurb and within a couple of minutes of the movie you know what's going to happen. But the actors are good - hooray! - and it's probably that that made me watch to the end.<br><br>There are some nice bits of dialogue but much does not further the plot or develop character and you feel - like the characters - that you're sitting in a pub waiting for last orders to be called.<br><br>There are also some unbelievable character motivations and the writer has absolutely no knowledge of how the publishing industry works - particularly the timescale! It might have a message. I've no idea what it is but it is definitely last century! Notting Hill it's not.","user":"iantrader","rank":[11,16]},{"title":"Charming and very funny!","rating":9,"date":"21 October 2016","review":"This is a genuinely funny and affectionate movie made in the best tradition of recent British cinema comedy. The story line and plot are great, the acting consistently good, and, considering the minuscule budget it was apparently shot on, it looks and sounds as good as some of those 'big name' British films of recent years. I'm especially impressed by the pace of this, slow enough to give that affectionate feel, but tightly cut enough to give younger viewers a sense of pace. The critics were not kind, however I guess the 'Islington set' do not get to hang out in North Norfolk very often, and probably prefer their yokels as Wurzels caricatures! Give it a go - you'll get some belly laughs out of this one!","user":"howard-69078","rank":[14,32]}]