[{"title":"One of the best Lupin III adaptations","rating":8,"date":"8 December 2014","review":"\"Lupin the IIIrd: Jigen Daisuke no Bohyo\" is the next installment in the Lupin III franchise, based on the manga by Monkey Punch, which was first published in 1967. This film is the continuation of the 2012 \"Lupin III: The Woman Called Fujiko Mine\" television anime series. The plot, like most Lupin III stories, seems simple. Lupin and Jigen plan to steal a diamond from the country of East Doroa, which has a conflict with the neighbouring country of West Doroa. However, what seemed like an easy job for the duo got complicated when they discovered they were the targets of a famous assassin. Directed by Takeshi Koike, the film has a beautiful animation style and fast pacing. It is aimed at a more mature audience and is quite entertaining. A definitive must-see for the fans of Lupin III.","user":"ippomakunouchi92","rank":[7,7]},{"title":"The better part of the Lupin III revival","rating":7,"date":"6 April 2015","review":"In the early 2010s, Lupin III underwent a revival of sorts with two features: A WOMAN NAMED FUJIKO MINE (a TV series) and THE GRAVESTONE OF DAISUKE JIGEN (a spin-off film). Both took Lupin back to his manga comic roots: the setting was the 1960s-70s, the story was darker and more serious, Lupin and his mates were more self-serving and treacherous. This film-noir hardboiled version was a great hit and successful revival of Lupin III (if rather controversial - some Lupin fans preferred his softer, more popular version of a noble trickster). <br><br>I would call GRAVESTONE the better part of the revival. The Fujiko series did things differently and delightfully, but it presented a convoluted backstory that turned out to be a falsehood, all for a character that never really had a history to begin with (Lupin deserves as much history as James Bond – it's the adventures he faces rather than his past that matter for him). This story happens to be more straightforward, with Lupin facing off against a gunman who has marked his mate Jigen for death. <br><br>The artwork and music are wonderfully atmospheric, capturing the suave, sensual and stylish essence of the 1960s-70s era. The story too is well- written and substantial, and pays tribute to the original days of espionage, when espionage was about using one's wits and skill to outsmart an enemy, and not about saving the world with a pocketful of gadgets. There are no fancy schemes at work, simply a hit-man's job and a clash of skill and wits.<br><br>The only problems with the film is, for me, seen from a Lupin fan's perspective: in a long line of Lupin works, this comes off as a somewhat predictable adventure (the appearance of an enemy from a Lupin film enhances the perception of deja vu). Also the removal of two major characters (Goemon, Zenigata) is a little off-putting, but to be fair they had no place in the story. But as I said, these are a fan's perception: for the most part this story manages to be original enough to draw in viewers, and as with long-running franchises the stories tend to be the same after a while (OO7, which inspired Lupin, is a great example of this). <br><br>On the whole, it makes for a fairly good Lupin tale. Not necessarily one of the best, but definitely an above average story that makes for a great watch.","user":"q_leo_rahman","rank":[2,2]}]