[{"title":"Not quite a true story","rating":7,"date":"17 January 2016","review":"The film is based on a novelization of the true story of a boy who was brought to Buchenwald with his father (not a stranger as depicted in the film) near the end of the war, while the mother and sister were killed in Auschwitz. The novel was written by a man who himself was a prisoner at Buchenwald for eight years, which lends credibility to the scene he paints. Nevertheless, some aspects of the situation in the camp and some dramatic events in the story were implausible. For me this undercut the grim realism and emotional impact of the film. It turns out that the actual story is both more tragic and morally ambiguous (search \"buchenwald boy guardian\" to learn more), whereas the film rather simplistically aims to depict \"the best and worst of humanity.\"","user":"gubrud-46545","rank":[18,28]},{"title":"Powerful film","rating":6,"date":"24 November 2015","review":"This is a superbly done film but don't watch it if you're already in a downer. Or you don't have access to a stiff drink. It is grim and graphic. The violence and horror are simply stated but not exploited. It also gets beyond the Holocaust, portraying the seldom documented horrors the Nazis inflicted on non Jewish political prisoners. Nobody knows what life in the camps was like unless they had lived through it. But this may come closer than most such pictures. Dark and unrelentingly morbid, it is still a worthwhile watch but not an easy one. You will finish watching by pondering how an educated, civilized nation like Germany let this happen and by asking yourself how you might have reacted to the many moral dilemmas posed in the story. Not a film to enjoy but certainly one to watch!","user":"rps-2","rank":[33,101]},{"title":"Amazing true movie.","rating":9,"date":"21 March 2018","review":"This movie is a good remake of the old one with still holding the details. The realism was just phenomal with good storyline.","user":"alsjeblieftnl","rank":[4,8]}]