[{"title":"One of my all-time favorite films, but it might not be yours.","rating":10,"date":"22 October 2018","review":"One of my all-time favorite films, but it might not be yours. This is the first film I've actually reviewed after 10+ years on IMDb. Clearly some people are unimpressed by this film and others think it's amazing; I am in the latter category.<br><br>I'm also someone who, when I was a kid, fantasized about what it would be like to live off the land and away from people. This is a truly unique film in that it does not spell it out for you; does not have a position; it does not have villains; It is willing to let you make your own conclusions. Clearly this bothers some people, as does the pace. Speaking for myself, I was never bored. I was riveted from beginning to end. I had never seen the trailer, and I would recommend not seeing the trailer.<br><br>A main complaint from those who don't like it seems to be there are enough bad people; I actually found this refreshing. I don't meet many bad, evil people in my every day life; most people are pretty cool, I find. I actually felt the fundamental premise of the movie was realistic and I appreciated that it was willing to skip ahead and not spell out every beat. Or fill in the backstory. A good film can choose the story it wants to tell and does not need to fill in every interstitial space or to mimic the way things would necessarily unfold in the real world. I suppose it could be a realistic criticism that things could never quite happen this way, but it certainly did not bother me. I thought this film portrays people - and I mean all the characters in the film, not just the primary two - that are too rarely portrayed in film, but do exist in our world.<br><br>As everyone seems to agree, the cinematography and acting are extraordinary. I also thought the story was unique and refreshing, and for me at least, the pacing was perfect. I believe I benefited from having no idea where it was going to go, so I would recommend skipping the trailer and seeing it for whatever reason compels you. Perhaps just the beautiful, green forests of the Pacific Northwest.","user":"paul-591","rank":[137,152]},{"title":"an engaging and touching tale that leaves a warm glow","rating":8,"date":"10 July 2018","review":"Framing a story through the outlier's point of view is a self-reflective device that makes us to look at ourselves through the eyes of the marginalised other. It usually adopts a single perspective but Leave No Trace (2018) is as multi-layered as a Russian doll. Homelessness, poverty, single-parenting, post-traumatic stress disorder, and life off-the-grid are just some of the themes woven into this finely balanced film.<br><br>The ruggedly beautiful opening scenes show a father and daughter appearing to be camping in the wilderness. Silent but for the sound of nature, they forage, taste nature's bounty, and communicate by gesture. The father, Will (Ben Foster), is a war veteran with chronic PTSD and cannot stand the confinement of conventional accommodation. His teenage daughter, androgynously named Tom (Thomasin Harcourt McKenzie), has been raised by Will since infancy and is as adept at chess and reading literature as she is at hunting in the wild. They are close, sleep together for warmth, and the forest is their home. That is until a walker spots them and police are brought in.<br><br>Immediately applying labels like homeless and potential abusive relationship, the authorities subject them to the kind of interrogation that presumes the worst. When suspicion lifts, Will is praised for how well he has raised Tom but they are not permitted to return to their forest home. Social service accommodation is found, but Will soon flees again and Tom must follow. The cycle is repeated until the rapidly maturing Tom must face either a life running from Will's war torments or claim her independence, put down roots, and let him go.<br><br>This film works on all levels. The cinematography has a docu-drama feel, with hand-held camera-work that intimately observes the father and daughter bond. This is pitched perfectly because of the understated authenticity of performance by Foster and McKenzie. It must have been tempting to dramatize the veteran's trauma but here it is expressed entirely through Foster's eyes and silent stare. McKenzie consumes her role, emerging from the cocoon of adolescence to a butterfly, vibrant, caring, and grounded in self-belief. The dynamic between them is the scaffold that raises the story beyond expectations.<br><br>It would be challenging to find another film that could more appropriately carry the 'hybrid genre' label. Strands of adventure story, a coming of age tale, a road trip, and a drama, are all present but none dominate. Nor does the film offer an easy solution to helping people like Tom and Will. This is an engaging and touching tale that leaves a warm glow.","user":"CineMuseFilms","rank":[175,204]},{"title":"A Deep and Moving Father-Daughter Story","rating":7,"date":"25 July 2018","review":"Don't walk in to see this movie expecting any action and excitement. That's not what this is. <br><br>'Leave No Trace' is about the relationship between a girl and her father. It's a patient movie and a thorough one. It takes its time unveiling the details of their relationship and their lives. <br><br>Dad (Ben Foster, gripping) suffers from PTSD from his time in the military. He cannot function in society, so he chooses to live in the forest. His 13-year-old daughter, Tom (Thomasin McKenzie, a revelation), lives with him. <br><br>Though life in the forest provides its challenges-Tom is growing and is often hungry-the two live happily. As Tom says, they \"didn't need to be rescued,\" but living on public land is illegal. They're brought in and assigned to indoor housing so they can re-acclimate themselves with society. <br><br>While Tom thrives, her dad struggles. He cannot handle this lifestyle anymore. The strength of their bond is tested, and it keeps them together as they navigate unfamiliar and uncomfortable terrain. <br><br>Both actors are terrific-serious and subtle. The whole movie is subtle. There isn't much dialogue, but the subtext says a lot. Director Debra Granik operates with a light touch that lets events unfold without forcing anything upon her audience.<br><br>Her film style simply presents moments and allows viewers to actively participate in them. Nothing is shoved in your face. It's up to you to engage, so you can take away from this movie as much or as little as you choose.<br><br>This is unequivocally a theater movie. It's not meant to be half-watched on an airplane. To experience it in full-and you should do this-go to a theater and really pay attention and think along with the movie. It's a rewarding experience that gives a lot back, as long as you give a little first.","user":"Jared_Andrews","rank":[89,112]}]