[{"title":"This movie gives Headaches","rating":3,"date":"24 October 2016","review":"Extremely boring film it gave me a headache I don't know how this is rated around 8 the movie lacks everything one boring and old school story. The plot doesn't contain any interesting twists or turns a total time waste. I recommend this film to an age group under 10 a family drama. I am only continuing my review because the minimum length for a review should have 10 lines of text. LOL have a nice day GTFO unexciting, boring, dull, tiresome, wearisome, tedious, dreary, tiring, flat, lifeless, monotonous, humdrum, uneventful, slow, unvaried, repetitious these are some synonyms for the above. an epic fail when it comes to story telling and casting.","user":"prudhvizzzz","rank":[21,27]},{"title":"To award this a star would be generous","rating":1,"date":"6 November 2016","review":"Where to start? 1. Horrible casting, worse than highschoolers 2. The plot is as predictable as it comes. Even worse. 3. The acting eliminates any kind of drama from the plot as they are incapable of showing any emotion whatsoever, regardless of the situation they claim to be in. 4. This is an example of two hours wasted of our time. My wife and I were making a comedy out of it as we could not find any other thing to do with this movie. 5. Somehow this movie had 8.5 stars. We are writing this to make the rating closer to the reality and avoid this traumatic experience to other watchers.<br><br>Do you know one of those movies that you will always remember, even after years, due to its poor quality, horrible cast and woeful plot? Jackpot here.<br><br>Do yourself a favour: pick a letter of the dictionary and start reading. That's much more entertaining!","user":"halucaceres","rank":[5,7]},{"title":"What a good movie, wow!","rating":10,"date":"14 January 2017","review":"What a good movie, wow! Very entertaining and heartfelt. Whole family liked it! This is one of the most heartfelt movies I have seen in a while. Beautiful scenery, pretty exciting, Things start going bad when the kids start taking advice from an overconfident kid who is in pursuit of a hidden treasure left behind from his estranged father. This story shows you just how quickly plans can fall apart when your in the middle of the wilderness. Its surprising more people aren't lost in similar situations when you think of all the inexperienced campers heading out each year. The bear scene might not be appropriate for really young viewers under five. Love the ATV stuff. Awesome movie and message.","user":"lorirocha","rank":[2,2]}]