[{"title":"Fake reviews","rating":1,"date":"20 October 2015","review":"Two reviewer accounts created on the same day as their only review posted. Don't be fooled by the high rating on this stinker. Anyone with half a brain couldn't watch this without cringing. It's a complete mess and a disaster of a movie. Ot's not worth the time to write this review, other than to off-set the fake reviews posted by crew members or people directly associated with the movie. A closer look at the profiles of those that give the highly rated reviews clearly shows that the profiles were created to review this movie (likely created around the time of the completion of filming but months before the film's distribution). When reviewers have only been in existence for less than a year prior to the movie release and give it 9 or 10 stars, with that movie being the only movie they review, the numbers are inflated to reflect those higher numbers.","user":"birdstrikes","rank":[48,59]},{"title":"No, don't do it.","rating":1,"date":"20 October 2015","review":"I felt cheated by this movie because not all the women in the movie appear topless. It runs for 90 minutes, pretending there is a plot, when there isn't as made obvious by the title of the movie itself. A review of 4.9 at the time of watching this film made me believe there would be some laughs at least. But there was not even one. Even the gratuitous display of boobs couldn't make up for what an utter waste of time and money this movie was for me. I wouldn't recommend this movie even if I was its producer and distributor. How do I write more to make this review long enough to fit 10 lines? Gosh, I think I am putting more thought into this review than the scriptwriters did.","user":"Nand2Tetris","rank":[29,37]},{"title":"Yikes","rating":23,"date":"23 April 2016","review":"I watched this movie with a friend who said it would be worth the watch because it had a respectable star rating( I can't remember what it was at the time) and several stellar reviews. At the time of me writing this, my first review, the star rating has dropped to 3.2 and popularity has dropped 372%. So it is quite clear that this movie is headed down into the 2's, which I consider generous, or maybe even the 1's. <br><br>I don't know if this dog is the worst movie I have ever seen, but I can't recall any that are as bad. I won't bother going into all the details of what made this a bad movie. That would take far too long. Instead I will focus on the redeeming qualities....... There that didn't take too much time at all.<br><br>After the wasted time I endured watching this dud I felt it necessary to check out these reviews my buddy talked about. To my surprise one of the reviews giving it a 10 was written by the writer himself. Surprise because he admits to it. But he also admits that he believes that to his knowledge all the other reviewers that gave it high marks were legitimate accounts. So I looked at these legitimate reviews and found that every one was a newly created account and every one had only reviewed one movie. Any guesses which one? This prompted me to make an account and add my two cents.","user":"spoolstarter","rank":[5,5]}]