[{"title":"Made 0 sense ... dont bother","rating":1,"date":"27 April 2019","review":"So, big spoilers here because I'll explain the movie.<br><br>1890, a seance is done because a couples daughter is missing. Daughter is dead, bc the medium connects with her. Then the medium is suddenly taken over and kills everyone in the room.<br><br>FFW to now, a typical story of mom dying and idiot dad wants to start over with bratty kids in an old home whilst doing no research ahead of time about the home. No one has lived in this house for 120 yrs and it's super cheap and super nice. Sure why not!<br><br>So then, the kids start getting possessed bc theres a random chest of old valuables in the house.<br><br>Then the dead daughter from the 1890s appears, warns dad that \"she\" is coming. Medium pops up, makes the kids kill the dad, oldest daughter burns the chest, medium spirit kills the 3 kids.<br><br>Then a new family moves in. That's it. No scares. No storyline whatsoever. No back story. No clue as to who the dead girl is or why shes even there. No clue as to what took over the medium and why shes even evil. Then theres this neighbor with a dad who had a stroke in the house, so no development with that either.<br><br>None of it made any sense whatsoever and as someone who LOVES bad movies, I just hated this bad movie. Only watched it bc I was a huge True Blood fan.<br><br>The end.","user":"ashleyryan-36896","rank":[9,9]},{"title":"Terrible Everything","rating":1,"date":"5 August 2016","review":"God this movie was AWFUL!!!!<br><br>I created an account just to warn people not to spend money or time on this pile of crap!<br><br>Not a good movie at all.... TERRIBLE ACTING and overacting 🙄<br><br>If you like spoiled, bratty kids that curse, slutty teenage daughter, oblivious mourning father who's an idiot who's never heard of Google who purchases a house no questions asked then this is the movie for you...<br><br>I've always wondered during the process of shooting a movie if anyone ever says \"wow this movie is really crappy, this acting is really crappy, what's the point of this movie\"","user":"the_banganest_chick","rank":[53,67]},{"title":"Don't expect much, and you may half enjoy.","rating":5,"date":"23 September 2019","review":"The first thing you notice is the film looks cheap, the special effects are shoddy, some of the costumes look like people dressed up for Halloween, and it's a story that's been done to death. Despite the negatives it's watchable enough.<br><br>Todd Lowe is rather good as the central character, the tormented father, not unlike a young Kenneth Brannagh.<br><br>Some decent scares, although just as the film starts to get into its groove, it comes to an end.<br><br>I wouldn't watch it again, but it was a decent watch.","user":"Sleepin_Dragon","rank":[8,8]}]