[{"title":"Pointless and aimless","rating":2,"date":"20 November 2018","review":"Atrocious in every way but especially the acting. A pointless endeavour with barely a story or plot to hold it together.<br><br>How can a 1hr 15m film drag so much, that's an achievement in itself.<br><br>Terrible","user":"chuckm76","rank":[12,12]},{"title":"It was just so horribly boring and mundane...","rating":3,"date":"17 December 2018","review":"I found this movie by sheer random luck. I hadn't heard about it, nor did I know what it was about. I assumed it was a horror movie, from what I read on the synopsis.<br><br>Turned out that I was in for a very long ordeal of a movie that had a very shallow and pointless storyline at heart. This movie was boring. Yeah, that is being bluntly honest, but it was. It was gut wrenchingly boring and so very little happened throughout the course of the entire movie, and even less so happened of any interest or worth.<br><br>It was a tough ordeal to suffer through \"Dark Beacon\", but I endured it. I did so in the hopes of the movie picking up and becoming better. That just never happened and now I am missing about an hour and a half from my life.<br><br>I will say that there are some nice scenic shots in the movie, and the camera-work is actually quite good. But those things alone or put together hardly makes for an entertaining movie.<br><br>The characters in the movie were mundane, one-dimensional and could essentially just as easily had been replaced by cardboard cutouts. The dialogue was adequate, although it didn't really matter much as the characters portrayed in the movie were pointless. And the cast included a very few members, so there was a lot riding on the back of the actresses performing here, just a shame that they were restricted by script, storyline and characters.<br><br>\"Dark Beacon\" was not entertaining in any real sense, and this is definitely not a movie that I would recommend that you take the time, effort or spend money on watching. Nor is it the type of movie that can sustain more than a single viewing, as it hardly couple manage to sustain even that very first viewing.<br><br>This movie should be avoided, unless you absolutely have nothing else to watch at hand.","user":"paul_haakonsen","rank":[9,9]},{"title":"Lesbian Ghost Story?","rating":2,"date":"19 December 2019","review":"Funny how they can't use the word \"lesbian\" in the description of the movie and replace it with \"paramour\" - odd.<br><br>Anyway, this movie took 1.25 hours of my life that I will never get back. Horrible acting. Dumb plot.<br><br>Run for your life.","user":"Old_School_Gamer","rank":[5,5]}]