[{"title":"Better than the other reviews say it is","rating":7,"date":"22 December 2017","review":"Good movie all around, has people drinking and partying. Some cussing, kissing, no nudity. Lots of blood and some gory moments. Kids and I really enjoyed it, not the best but far from the worst.","user":"blackgobblin","rank":[10,17]},{"title":"Better than the rating suggests","rating":7,"date":"19 November 2017","review":"The only other review has this movie at a 1. It definitely does not deserve that. If you are a horror fan and/or a who done it fan you will probably like this. Is the acting Oscar winning? No...But does it keep your interest and have some decent gore? Yes...Besides a few dull moments this is a hidden gem on Amazon Prime. Check it out if you get the chance.","user":"pensacolacomputer","rank":[10,17]},{"title":"Oh! It's You","rating":8,"date":"8 April 2018","review":"The \"Oh! It's you\" 80s horror trope got annoying fast (SEE: mainly, Happy Birthday to Me,) but my horror-friend at work and I love to say it to each other all the time, followed by laughter.<br><br>No spoiler, although...this movie begins with a version of that phrase and then dives right into a fun and funny weekend getaway beginning 12 hours earlier. Nothing original yet, but the party at this cabin in the woods felt real and I was totally invested in the characters. These actors truly portrayed old and new \"friends.\"<br><br>Then, as with the night, it gets dark and darker once the Movie's Title comes into play.<br><br>One thing bad with streaming movies and me, I get distracted and distracted bad. In fact, I must've seen this incredibly short 80-minute movie 3-4x all the way through with starts, restarts, pausing, refreshing over a course of 3 days. And yet, when they explain the rules of Movie's Title (a scene I probably saw 4x) I still don't get it. Eh, it's just an excuse for the gang to avoid playing PlayStation 2 and wander around in the dark so Oh! It's You can hunt them down for real.<br><br>I liked the movie despite the shift in tone from a fun and witty opening (which was better than the actual plot.) The ending might be laughable to some, but I gave it a pass. Or passes? Saw that a few times. And it was wildly predictable. <br><br>So, when I said in the beginning \"No spoiler, although...\" in reference to the Oh! It's You killer, it totally gave it away to me. That wasn't much of a surprise, especially with their weak ways to red herring us. <br><br>Still, it's genuine up front, brutal for horror fans following and yeah, I did like the ending. It certainly swayed from most of these kinds of movies. Definitely recommended.<br><br>***<br><br>Final thoughts: One of my distractions, in the opening, I thought this was going to be a horror-comedy. So, my mind wandered into making a top ten best horror-comedy list off the top of my head and without research. This movie wouldn't fall under it, since it never ended up being a comedy, and this list is irrelevant to this film...but since, I took the time to make it...<br><br>Top Ten Best Horror-Comedies:<br><br>10. Planet Terror\n9. Bride of Chucky\n8. Young Frankenstein\n7. The Babysitter\n6. Shaun of the Dead\n5. Tucker &amp; Dale vs. Evil\n4. The Cabin in the Woods\n3. The Final Girls\n2. Scary Movie\n1. Student Bodies","user":"thesar-2","rank":[9,16]}]