[{"title":"Send In The Clowns","rating":3,"date":"1 October 2016","review":"I dig Rob Zombie films. Devils Rejects, the Halloween reboots, Lords of Salemall personal favorites. So much so that I contributed $150 to the crowd funding of 31. It was promised to be the movie RZ wanted to make as well as the movie he thought his fans wanted to see - an unapologetic and uncompromising slaughter-fest. Well, I finally watched 31 last night and unfortunately it does compromise and it isn't even much of a slaughter-fest. It's simply another \"we-kidnapped-some-innocent-people-for-the-purpose-of-torturing-them\" retread. And not a very good one at that. I'm bummed.<br><br>There are certainly moments that make 31 worth watching. But those moments just aren't enough to make it a good movie. Much of the criticism of 31 has been directed at the lack of character development. My comment to that is \"who cares?\". This is a movie where I wanted to sink into my seat and cover my eyes due to the extreme and unrelenting gore. I wanted to feel like I did when I first saw Dawn of The Dead in theaters in 1980 - unable to look, but unable to look awayutterly horrified by images I'd never seen beforewalking out exhilarated, out of breath, and laughing at myself for being so freaked out by a movie. If anyone could do it, Rob could. <br><br>Alas, most of 31 is just another quick-cut, shaky-cam exercise that does manage to force the viewer to look away - just not out of disgust, but to keep from getting a headache from the excessively annoying hand-held shots and machine-gun editing. More often than not, you can't even tell what's going on in the action scenes. There are lots of half second images of blood- soaked faces, and blood-soaked clothing, and blood-soaked weaponsbut we can't tell who's getting chopped up and who's doing the chopping. <br><br>31 opens with a monologue from villainous clown Doom Head. It's a great scene that draws you in. The idea that he was, of course, going to show up again by the end of the film was the only thing that kept me from walking out. He does show up in the final 15 minutes, but it's too little, too late. It was already to the point where I couldn't care less what happened to these people and I knew however the inevitable deaths were played out wasn't going to be anything interesting or inventive. I was right. In between the opening and closing Doom Head bookends there is absolutely nothing of interest. A little unsuccessful character developmentsilly villains that are far too easy for our heroes to killpompous ringmasters that add nothing and could have been cut out completelyit all made me want my $150 back.<br><br>I assume there will be an unrated version somewhere down the line that I'll watch and re- evaluate, but I can't imagine it saving this waste of fake blood and Malcolm McDowells talent. If you want to see an interesting, scary clown movie try 2014's Clown (he eats children!) if you want gut-wrenching gore watch the Evil Dead remake again. The only reason to see 31 is it's an RZ flick and to be properly schooled in modern horror you need to see all RZ offerings - at least for now. A few more throwaways like this and Rob will just be another straight to Netflix hack director.","user":"roode937","rank":[63,79]},{"title":"Do not pay to see this","rating":2,"date":"16 September 2016","review":"I'll start by saying this, I know there are some that will claim \"He wasn't going for a traditional scary movie. People that don't like it just don't understand his perspective.\" I'm sure that in all of the conversations they had with Mr. Zombie these points were covered and clearly they have a much better understanding than anyone else. This review is for those that have been excited about seeing this because Rob Zombie's pieces in the past have had that intense shock factor and were delivered very well. Unfortunately, this one does not. It is kind of sadistic and if you put yourself in the position of one of these actors you can imagine it would probably be terrifying. Then again, you wouldn't use poorly scripted cheesy lines and engage in badly choreographed fights. Personally, I have been looking forward to this film since I first heard about it last year and have kept myself up on the release date so as soon as it was available I could treat myself to it. I couldn't have been more disappointed. I thoroughly enjoyed his other films and would watch another if he made it. I realize fanatic Zombie lovers will disagree with me when I say this but for every one that like it there will be several that don't. I can't decide which was worse: the ending or the overall acting. I must give credit where credit is due, the intro is entertaining and you will probably enjoy Doom Head (the guy in the opening scene). Again unfortunately, he is in the movie all of about 10 minutes non-consecutively. Had the movie centered around him and a twisted hunting obsession perhaps I would be writing a very different review. The acting is over-the-top and awful. Not in the same way that some movies are so bad they're good (like Zombeavers or Axe Giant) but more like super low budget projects filmed on an iPhone. For a movie that has reasonably good quality in most scenes I was so let down to see the acting was so unrefined. It probably could have been worse, I'm just not sure how.","user":"bwhelveston","rank":[86,120]},{"title":"A Rob Zombie fan no more","rating":2,"date":"1 September 2016","review":"To start off, I have loved previous Zombie films. House of 1000 Corpses and Devils Rejects were at one point two of my favorite films. With that said, this film is just bad. I just came from the Fathom Events and was so disappointed by this movie I opened this account just to write this review. There are numerous things this movie lacks and going into this film I did not expect a masterpiece, but instead good ol bloody fun. Sadly, the blood could not save this film.<br><br>We find ourselves with a simple plot revolving 5 individuals forced to play a game called \"31\". They must fight to survive the night and win the game. The killers have a clown based appearance making for what appears to be a fun ride.<br><br>After the premise is revealed the film immediately goes down hill. To start off no character development is really made with both the survivors or villains of the movie. When the killings begin we feel indifferent to who lives or dies. When the deaths do occur, they are disappointing especially in comparison to Zombie's past. By this I mean, most of the kills are done by stabbings, which either cut to black, or show minimal damage. I'm not saying the lack of gore is what makes this movie bad, but I figured it would be Zombie's scape goat if anything. Unfortunately the movie progresses with no real development of plot and ends with what appears to be a copy of a scene found within other Zombie films. Which normally would be a cool throwback, but in this case seemed lazy.<br><br>From here I could go on about the issues with this movie, but ill just bullet point them.<br><br><ul><li>The editing seemed as if a fan of Zombie's film had made this. Overuse of \"vintage\" effects just became detrimental. </li></ul><br><br><ul><li>The killers lacked any real character. It's as if he thought \"Killer clowns are scary, enough said\". So with that said the killers are just that, new clowns in different \"Weird attire\".</li></ul><br><br><ul><li>The killers lack any power. As the film nears its remaining 30 minutes, we see the heroes plow through \"killers\" like nothing.It's as if everyone was on the same playing field and this was just a brawl.</li></ul><br><br><ul><li>With such a simple premise of \"Killer clowns\" most would immediately assume the setting is going to be a carnival or something related. Instead we are introduced to the characters in a great looking carnival Esq setting in the very beginning, then the film immediately places all the characters in the most clichéd looking \"pipe room\" that is completely gray and dark. I assume this was due to budget constraints, but then why the lavish room to simply introduce the characters? This poor use of setting is later seen in a room that is shown which looks like a typical mini circus tent but is actually a cage. This room was only used for a few minutes on screen and completely abandoned after. Returning all characters to the pipe room.</li></ul><br><br><ul><li>The acting was poor. Like just scare actor at your local Halloween attraction bad. That goes for both heroes and villains. The only one who had evident talent Meg Foster. Her performance was brilliant with the material she had.</li></ul><br><br>FINAL THING. After the movie there was a \"Q&amp;A From Rob Zombie\". The first question was \"What inspired you to make this film?\" His answer was \"Well , I was working on a movie that got stuck in production hell so I called up my team and told them ' I can pitch you the dumbest simple idea that will make money right now in 30 seconds\" \"Its Halloween... uh people get kidnapped....uh clowns kill them. boom that'll make money.\" This was the moment I was not only disappointed in the movie but Rob Zombie himself. This man practically had the audience sit through a poor excuse of a movie THEN had the nerve to basically include a feature that tells them they were dumb for falling for it. <br><br>All said and done, if you like Rob's past movies just avoid this one. Trust me, it will shine a light on the idea that maybe Rob never had any talent, but instead used the same tricks until they got old.","user":"ishmaelmontiel","rank":[75,106]}]