[{"title":"A beautiful film of epic proportions","rating":9,"date":"18 April 2015","review":"Mune was a visually stunning adventure of epic scale. Set in a whimsical world, the sun and moon are controlled by their respective guardians. As the time comes for new guardians to be selected, the boasting and brawny Sohone is selected as the new guardian of the sun. In an odd twist of fate, the reluctant Mune is selected as new guardian of the moon. This film features a very beautiful world, filled with all kind of creatures and fauna. Both the day-dwelling and night- dwelling creatures are very distinct, building a very rich, interesting world. The story is very easy to follow and features a huge cast of distinct, interesting characters. We see practically every corner of this vast world, from the bright, stony land of the day-dwellers to the luscious forests the night-dwelling creatures live in. It's very clear that a colossal amount of creativity was put into this film, and it offers a fantastic visual experience. What definitely surprised me most about this film is that it features several scenes rendered in 2D animation. It is a style you see very little of in mainstream animated films, and was a nice change indeed. This is a great movie for animation buffs like me, and those who love whimsical adventures as much as their children.","user":"duskdani","rank":[51,55]},{"title":"Absolutely stunning family film","rating":9,"date":"8 February 2018","review":"This movie is straight up eye candy, right up there with Disney &amp; Pixar productions. I watched Mune with my 4 year old and was instantly drawn to the beautiful animations. There were major Salvador Dali &amp; Hayao Miyazaki influences in this dream world. I really can't praise the animators enough for the beauty they created in this film The story was lovely, despite some of the characters falling into cliche stereotypes (looking at you Sohone)<br><br>This is a movie I would've loved to have seen as a kid and I am really glad I was able to enjoy it with my own child. Highly recommended for families to watch together, just know that there are some scary scenes so be prepared to reassure sensitive children that the good guys will overcome the bad ones.","user":"shinelovershine","rank":[14,14]},{"title":"Cartoon Dreams within Cartoons","rating":8,"date":"13 March 2016","review":"7.75 of 10. Stylistically and in terms of the quality of animation and imagery, one of the best recent cartoon films. The story is pure fantasy and works as sort of new a fairy tale clearly for children but with various themes that make it enjoyable for everyone in a family and certainly safe enough for kids to enjoy alone.<br><br>The deeper messages of the story involve the complexity of the universe and the benefits of working positively with one another as opposed to alone with minions doing your bidding under the threat of your power. The other ongoing message is a softened version of curiosity killing the cat. Curiosity here is both good and can get you into serious trouble, as can over confidence, arrogance, and too much power.<br><br>The story and cartoon is all woven together, as is the cartoon within the cartoon. It also makes beautiful use of new voice actors as opposed to relying on stars. It deserves to catch on as an underground classic that the critics and production corporations failed to identify and properly distribute.","user":"in1984","rank":[28,32]}]