[{"title":"Promising set up, but after 15 minutes story takes a nose-dive","rating":4,"date":"6 September 2015","review":"Every technical aspect, direction, soundtrack, performances gets a gold star. But the story just gets sillier with each second, culminating in a preachy ending which seems to want to shoehorn depth into a film which has been lacking it for the most part.<br><br>The easiest comparison here is with House Party, but where the comedy in that film was outlandish, it was at least believable and organic. Malcolm as the hero is given many a test, but whereas a typical Hero will meet these tests in a way that really says something specifically about him, the waves really part suspiciously quickly for Malcolm. He gets jumped by his high school bullies and he gets them to back down by pointing a gun at them. Implausibly, they are not packing. He is made to sell the MDMA he found in his backpack - like a drug king pin would trust someone who he had never met, and surprise surprise this is Malcolm's opportunity to screw the screwer.<br><br>It ends up a clichéd, lazy exercise that, apart from some early set-pieces, manages to be neither funny nor dramatic.","user":"peter-stead-740-486963","rank":[64,90]},{"title":"Irresistible Fun","rating":9,"date":"20 June 2015","review":"\"Dope\" is not the movie that you probably expect when hearing the title. I want to stress that. The word itself has negative connotations (with most thinking immediately of drugs when they hear it), and though it certainly deals with things of that sort, it isn't really that simple. The few definitions of the word are addressed at the beginning of the film, most notably as a slang term referring to something that is \"very good\". This definition, my favorite of the few, seems to capture the movie in the best light. <br><br>Essentially, this is a coming-of-age picture. Our main character is Malcolm, a high-school senior who's obsessed with 90s hip-hop culture, and who constantly shows this affection by emulating the fashion and language of the time. He's a straight-A student with perfect SAT scores and seems to have everything under control - despite a few bullies - until he finds himself taking a chance invitation to a drug dealer's birthday party along with his two best friends. From there, he's taken on a crazy adventure littered with bad choice after bad choice, all the while juggling college applications and interviews that will surely determine his future.<br><br>Writer/Director Rick Famuyiwa strips the film of any tired clichés or stereotypes for African-American characters, and surprisingly manages to infuse details that question the issues of racism and class discrimination. But above all, he makes a really fun movie. The writing is sharp and humorous, with the acting from the main trio - Shameik Moore, Tony Revolori, and Kiersey Clemons - complimenting it excellently. And though it's undoubtedly rough around the edges, its wit and ceaseless energy make it irresistible.","user":"bloodclay","rank":[57,82]},{"title":"Optimism in a hopeless place","rating":8,"date":"19 June 2015","review":"Rick Famuyiwa's \"Dope\" opens by providing its titular term with three distinct definitions - to paraphrase, the word can mean an illegal drug, a stupid person, or an affirmation of something's greatness. For the next one-hundred and ten minutes, the film works to illustrate all of those features in some way or another through a lens that's unique, refreshing, and respectful to its characters and their cultures.<br><br>Our main character is Malcolm (Shameik Moore), a black teenager carefully surviving in his crime/drug-ridden neighborhood of Inglewood, California, Despite being influenced by modern forces like the internet and Bitcoin, he loves nineties hip-hop and the culture of yesteryear, and so do his two closest friends, Jib (\"The Grand Budapest Hotel\"'s Tony Revolori) and Diggy (Kiersey Clemons), who play in his punk band. Malcolm is going for what seems to be the impossible, which is applying for Harvard and forging a successful career path post-high school. However, in the mix of taking his SAT and writing his college entrance essay, Malcolm gets caught up in the underworld of illegal drugs and crime in the most unconventional way possible. After being invited to a party thrown by a drug dealer (rapper A$AP Rocky), Malcolm works to craft a name for himself by getting invested in the online drug-drealing world, using the help of a local hacker and Bitcoin to create a huge influx of revenue for him and his friends.<br><br>Famuyiwa attempts to do the same thing to African-Americans that John Hughes did with the middle class high school population in the 1980's, which is cut through the stereotypes, the incredulous romances, and what adults perceive teenagers to be like to really get to the heart of them as people. People with choices and decisions to make that are often times as big or as impacting as the ones adults make. The difference is, however, adults come equipped with life experiences where teenagers generally come equipped with their own instincts and peer pressure in their decision-making.<br><br>\"Dope\" shows the constant struggles of being a moral teenager engulfed in a society driven by illegal behavior and surrounded by peers who are nudging you onto a more dangerous pathway than on which you'd like to travel. The fact that it pays homage to the music and the urban movies of the 1990's is interesting because \"Dope\" doesn't focus on an anti-hero in a gritty neighborhood, much like the films of that era did. Instead, adhering to the principles of Hughes, it turns to the geek and, in turn, humanizes and paints him as a character trying to find himself in the mix of all this madness.<br><br>Famuyiwa and cinematographer Rachel Morrison crossbreed the early 1990's hip-hop culture with the contemporary technology of the mid-2010's, causing a culture shock of epic proportions in \"Dope\"'s aesthetic variety. \"Dope\" has the cinematic look of acid-washed jeans, the feel of a sun-soaked day at the beach, and the smells of everything from acne cream, sunscreen, and marijuana ostensibly infused into every scene. It's the kind of aesthetic that's so detail-centric it almost channels the likes of Wes Anderson, minus the meticulous symmetry in every scene.<br><br>Shameik Moore must be given considerable praise for his role here, which can only be described as a breakout performance. His human characteristics, carefully painted by Famuyiwa, his conflicted personalities, and his subtle arrogance, all traits that, in the end, make him very likable, echo the sentiments of Cuba Gooding, Jr. in \"Boyz 'N The Hood,\" another conflicted soul caught in between being moral in a morally bankrupt area or taking the easy way out. Alongside Revolori and Clemons, two supporting roles that, again, go far and beyond the call of supporting roles, Moore is a talented who you find yourself being unable to take your eyes off of throughout the entire film.<br><br>Above all the aesthetic and character charm, \"Dope\" is a surprisingly optimistic film. It doesn't get bogged down by environmental cynicism, even when Malcolm has to turn into the kind of people he never wanted to associate himself with. Famuyiwa takes a brave step in the opposite direction of his peers, capturing acts like drug-dealing and backhanded deals in a light that accentuates joy and positivity, but it's all this that make \"Dope\" an even more fascinating character study, coming of age story, and a subversive tale about life in an urban area.","user":"StevePulaski","rank":[58,84]}]