[{"title":"Joker's Wild: Awful on every level","rating":2,"date":"9 February 2019","review":"Joker's Wild otherwise known as Joker's Poltergeist otherwise known as American Poltergeist 4: The Curse of the Joker has two major glaring problems. For a start it's absolutely terrible and second, it's in the poorest taste I've seen in years.<br><br>First about the initial issue, the movie is terrible. It tells the story of a mass shooting at a cinema, one year later the late owners daughter is reopening but she's haunted by visions.<br><br>The plot is naff, it flows about as well as Cambodian plumbing and the two name stars Eric Roberts and Martin \"Karate Kid\" Kove are conveniently playing characters who are separate from the rest of the cast and could have been filming their scenes from home.<br><br>And the second issue, remember the Aurora cinema shooting in 2012? Well this is making a mockery out of that incident. Let's see it's about a mass shooting in a cinema, the lead girls name is Aurora and the shooter has bright orange hair. Add to this lots of back and forth arguments both pro and anti gun control and the whole thing screams poor taste. I don't know what the writers thought they were trying to accomplish here but quite frankly it's sick.<br><br>Awful film and in the worst possible taste.<br><br>The Good:<br><br>Lacy Marie Meyer<br><br>The Bad:<br><br>The whole thing is in bad taste<br><br>Just an all round amateur attempt<br><br>Kove/Roberts not even being on set","user":"Platypuschow","rank":[15,16]},{"title":"Awful Movie.","rating":1,"date":"24 October 2019","review":"I came across a horror/thriller called Joker's Poltergeist aka Jokers Wild. So why do I bring this one up? Well this film I would say is rather insensitive.<br><br>The film stars Eric Roberts and Martin Cove. Its about a young woman named Aurora who survives a mass shooting at her fathers movie theater. The shooter is dressed in a clown mask. Sounding familiar? Yes they made a film that is a take on the real life 2012 Aurora, Colorado shooting. Plus the film tries to have some message about guns. Im guessing its a pro gun stance but the message and film is so poorly done. Plus the film is so confusing with the supernatural elements that happen later in the film. Also its dreadfully boring even at 66 minutes (minus the end credits).","user":"FridayElmStreet","rank":[4,4]},{"title":"Totally nude","rating":4,"date":"2 October 2017","review":"The Palace Theater is having a grand opening of a horror show when a man in a clown's mask shoots up the place killing the owner (Martin Kove) before getting killed himself (Eric Roberts). The killer was a former partner who got kicked out and lost in court. The owner's daughter Aurora (Lacy Marie Meyer), in LET THAT BE YOUR LAST BATTLEFIELD make up, is devastated and the survivors all go to group. A year later they all get together at the scene of the crime, as the town wants to demolish the building. Then things start to happen as Aurora suffers from nightmares and hallucinations or are they real hauntings? The acting wasn't really good. I thought Eliza Roberts did a better job than her husband. His role should have been Tony Todd or Robert Englund who has done \"theater.\" Aurora is both the name of sleeping beauty and the site of a horrific theater shooting connected to \"The Joker.\" The film contained a gun control argument that was inane and I am not sure what was the point. The \"you shouldn't like guns\" scene could have been cut. Many might consider the feature in bad taste in the wake of the tragedy. The appearance of the \"jokers\" throughout the film was a confused mess.<br><br>Guide: F-word, sex, nudity (Lacy Marie Meyer, Suzi Lorraine, Seregon O'Dassey)","user":"nogodnomasters","rank":[2,6]}]