[{"title":"The c.g. is bad, the story is ridiculous, the acting is cheesy but the movie is fun","rating":6,"date":"12 August 2015","review":"SHARKNADO 3: OH HELL NO! review by Mike Smith   In this 3rd installment of the Syfy original trilogy, Sharknado, a  monstrous tornado unleashes ravenous sharks from Washington D.C., all  the way down to Orlando Florida. It's up to Fin Shepard and his friends  and family to save the day....again.  I highly enjoyed the over the top cheesiness of the Sharknado  franchise, but this one jumped the shark. The movie is outrageously  ridiculous but it's a fun ride. The movie knows what it is and doesn't  take it's self serious.  One thing I loved about this Sharknado is the list of celebrity cameos.  David Hasselhoff, Frankie Muniz, Bo Derek, the awesome Michael Winslow,  Ne-Yo, WWE legend Chris Jericho, Bill Engvall, Jerry Springer, and the  list goes on! The c.g. is bad, the story is ridiculous, the acting is  cheesy but the movie is fun. Yes all 3 movies blend together and the  movie is forgettable. If you like B movies then you may enjoy this as  much as I did, but this movie isn't for everyone. I really hope that  there are no plans for a Sharknado 4 because I think this film really  pushed the franchise as far as it can go. Cheers and remember life  won't suck as long as there is a good B movie to watch.  6.5 out of 10   Edited by Samantha Locke","user":"sweeeetmikey","rank":[10,10]},{"title":"Sharknado 3 Review","rating":7,"date":"28 July 2015","review":"Fin (Ian Ziering) and April (Tara Reid) are now remarried and are expecting another child. After a trip to Washington D.C. to receive a medal from current president Marcus Robbins (Marc Cuban) for his heroic actions during the events in the first 2 films, another sharknado strikes destroying the capital. Fearing that his family is in danger, he heads to Orlando. What he doesn't know is that a sharknado is following him while another is attacking Orlando. Now he and those he runs into on the way to Orlando must work together to try to stop the sharknados before they combine to form a sharkicane with the potential to destroy the entire East Coast.<br><br>I'll get right to it and say that this movie is terrible but that's not the point here. Everyone probably knew this coming in so I don't think that I'm surprising anyone. The acting is bad, the special effects are bad to the point that they are laughable, and the story doesn't make any sense. I am aware that this movie is called Sharknado 3 so I wasn't expecting anything scientifically accurate. Sharks in space people!!!! I saw some things in this that made me question myself but like I've said, this film is called Sharknado 3 so in order to enjoy it, you just have to suspend belief and accept what you are being given. My favorite thing about the film is all the random shark kills in all their \"semi-gory\" glory (this is a TV movie so they can only go so far). You'll also be surprised by some of the people who get killed (no spoilers). Common sense would normally dictate not watching this but if you give it a chance you'll be pleasantly surprised and perhaps entertained as I was. I've seen the first 2 films and I enjoyed them a lot and I think that this one is the best one so far.","user":"keithlovesmovies","rank":[11,12]},{"title":"A complete riot!","rating":9,"date":"3 August 2015","review":"The first two films were simply rehearsals for this completely over the top,wonderful piece of fun.<br><br>This is all I wanted the first two to be and more,it's just so full of action, in jokes, humour,load's of knowing cameos,and that's the joy of this film, everyone knows it's ridiculous,but they're having a ball, and so does the viewer if they allow themselves to.<br><br>I have to say, I think the people who don't enjoy this movie must have had a sense of humour bypass,it's just such fun,and likable.<br><br>I noticed that all three films have been released in 3D in Germany, so have ordered them,and can't wait to watch this instalment in particular all over again.<br><br>Highly recommended for fans of funny,camp,kitsch humour.","user":"rocknrelics","rank":[15,18]}]