[{"title":"A few insights, some talking heads, a little rare early footage","rating":7,"date":"10 December 2015","review":"Oh sweet, I get to write the first IMDb review for this? I'm a big fan of their music and I am a musician myself. I viewed this movie and most of it was in French (could make out a few words) although there were a few people interviewed that spoke English (could definitely understand those parts better) and one guy who spoke Japanese (could not understand one bit but it was a short segment). Interesting look into the past of these musicians and their musical work over the years.<br><br>There was some really cool stock footage from their early days and i think the Coachella footage is probably pretty rare also because of how they had kept it a secret even from their manager and it is super awesome. I was hoping for more coverage on the Discovery album, and a little more about the Tron Legacy soundtrack (although they did talk briefly about conducting the orchestra and having it go with their music and the impact that had on their follow up FIVE Grammy Award winning album Random Access Memories! Which they talked about the making of a little bit, even though I really wanted to know more in depth about their interactions with Paul Williams another musician and composer whose music I am also a big fan of. Seems as though it had some audio clips of the music maestro talking but the film seems most likely not made fully with their cooperation as I feel this project would have been done with even more artistic style. Also I would bet that there could be Issues with copyright money on the tron legacy soundtrack which is why they glossed over it only briefly touching on the music itself. Watching the old footage and comparing it to the different stages over the years was a fun treat and I would definitely recommend a watch to anyone who likes their music. I would also like to know more about all the other European electronic musicians that were influencing the sound of Daft Punk in their earliest stages for reference to see the chain connecting the evolution 70s and 80s synthesizer boogie to 80s and 90s technological acid jazz to today's supersonic musical technological wizardry. Also would be more interested to hear the full account of their interactions with other musicians and producers when they came to the US but maybe that is being saved for another tale... another animated one without the chattering heads next time hopefully. Still, this film is decently made and pays tribute to a great influential musical group of the electronic music variety. ;)","user":"lucius_420","rank":[8,8]},{"title":"The rare footage and the subject matter saves it","rating":7,"date":"14 October 2016","review":"I'm probably biased in this because I love the music and style of Daft Punk, so watching this documentary was really interesting, as much of it covers reaction within a scene and industry that I am not familiar with at all. So in a way, the focus was not only on their history, but what it meant to the music world in general.<br><br>There's also a surprising amount of footage of them before they donned the robot outfits. I was expecting maybe a couple of photos, but you get videos from concerts and similar. They've also seemed to track don't the audio interviews they could, which is good for those of us who don't speak French.<br><br>That said, they have made some odd choices in what the prioritized. The Tron-soundtrack is barely given any attention at all, and there seems to be quite a lot of interviews with famous people that offer little new about Daft Punk. I'm fine with some of that, but here there were perhaps a little too much. Also how people they've been with in their career are used as headlines for parts of the documentary - I don't really see the reason for it.<br><br>As far as I know, this is still the documentary to watch if you like Daft punk, and it's obvious that they did quite a lot of research for it.","user":"peefyn","rank":[4,4]},{"title":"Worth seeing even if you don't love their music.","rating":8,"date":"12 February 2016","review":"As a 51 year-old man, I am certainly NOT the target audience of this documentary about Daft Punk. I do not hang out in clubs nor am I especially hip. On the other hand, I have long admired these two French musicians (Guy-Manuel and Thomas) because of their showmanship and marketing genius. Instead of seeking fame in the traditional way, the duo have remained anonymous--donning modified motorcycle helmets and pretending to be robots in all public appearances. This is the ultimate commitment to electronic music and it's made them legendary...as well as Grammy winners. <br><br>What makes this a very interesting film is that you only catch small glimpses of the guys' faces...and then, only very early in their careers. They also do not participate in making the film and aren't interviewed...mostly because robots don't do interviews and they are THAT committed to their personas! Instead, you hear from folks who have worked with them and admirers. It all paints a portrait of two marketing geniuses who also make exceptional music...and is intriguing and well made throughout.","user":"MartinHafer","rank":[7,9]}]