[{"title":"Molly, you in danger girl........again....","rating":2,"date":"4 January 2016","review":"The unholy demon inside the titular character is apparently alive and well. <br><br>Six years after graduating high school, and discovering that a secret pact assigned her soul to the devil, Molly is suspected of murdering the only reason why this should be unrated and confined to a mental hospital, where she wreaks supernatural havoc on the staff and patients. <br><br>Her only hope is an exorcism by a defrocked priest, who has seen The Exorcist a few times, looking to redeem himself and save Molly's life before her transformation is complete........<br><br>In the world of most pointless sequels, this has to be up there with the likes of 8mm 2, and Single White Female 2, but at least this tries to have some sort of connection to the first movie, rather than cashing in on a successful film (but the first wasn't exactly a blockbuster)....<br><br>And from the upstart, it's pretty clear that it's film making at its most laziest, ripping off almost every exorcist/satanic cult related movie from Rosemary's Baby, The setting of The third Exorcist, and a blatant rip off of the Finale of original Exorcist, which is just so cheeky, it's deserves an extra star for its own cockiness.<br><br>But then it just shows you that the film has nothing new to offer in the plethora of straight to Blu Ray horror films that plague our market every single week of the year for the rest of our lives.<br><br>The most notable thing about this film is Devon Sawa, that chap from Final Destination, who now looks like Daniel Craig, but if he was inside out.<br><br>He looks so uninvolved in the film, and could win the award for least convincing Exorcist in a movie.<br><br>The first one was bad, but it was laughably bad, something you could point at and laugh at its misfortunes.<br><br>This however, is a pitiful excuse of a movie, and it angers me that I wasted precious minutes enduring it....","user":"FlashCallahan","rank":[11,15]},{"title":"Terrible acting, terrible plot holes, just terrible.","rating":1,"date":"22 November 2015","review":"I created an account just to express my dissatisfaction with this sad excuse for cinema. First, the acting is horrendous and in the best attempts it feels forced like watching a bad play at my kids school. Second, this movie has more plot holes than every story assigned to and written by middle-school students worldwide. Third, it's just lazy. <br><br>{SPOILERS} The writers made a LOT of assumptions and did no research: 1.) How does a priest find himself in prison after a failed exorcism? Yes someone died, but from an outside perspective there is absolutely nothing he could be charged with that a prosecutor would attempt to bring to trial. 2.) Molly was left unbound after being convicted *(assumed never actually confirmed)as a murderer who is a danger to herself and others. Any actual psychiatric facility would have had the crazy in a straight jacket and padded room immediately. 3.) Why is the only padded room outside of the woman's ward and through the opposite end of the men's ward? 4.) This line \"Does my file tell you that my parents were also into the occult?\" 5.) And then this line \"I'm not insane, Dr. Hawthorne. I'm possessed.\" 6.) As for the ending well it seems that Matt Venne just got sick of putting this drivel on paper and rushed out the details for a convoluted, nonsensical, plot hole finally. {END SPOILERS}<br><br>In a sentence, this lazy sequel borrowed(without research) more than it offered.","user":"twhit-91475","rank":[11,15]},{"title":"The Industry Shills have been out in force.....","rating":1,"date":"4 November 2015","review":"Judging from the number of fake reviews here already (come on IMDb, sort it out), it looks as though 20th Century Fox have got their interns rattling out fake shill reviews to try and make a few dollars out of this tripe. While marginally better than the first Molly Hartley film, this one is still pretty much in the 'utter nonsense' category. The storyline is below weak; preposterously stupid in the most part, the acting is simply dire. I felt offended that anyone would release this garbage for viewing by the public at large. The 'acting' is absolutely shocking. I doubt any of the cast would make it into a High School play let alone (one hopes) another film. As a horror fan I get to watch a lot of bilge, and this one is near the very bottom of the pile. Best avoided. I look forward to exorcising this rubbish from my Hard drive.","user":"jackstupidjack","rank":[16,25]}]