[{"title":"Playing those mind games forever","rating":10,"date":"1 January 2016","review":"The BBC has been trailing the return of three (okay, four) of its most popular detective heroes in a clever advertisement showing Stella Gibson from \"The Fall\", John Luther and Sherlock (and Dr Watson). \"The Fall\" re-starts next week although it is my least anticipated of the three, while \"Luther's\" comeback was very good but this dazzlingly brilliant episode was the best thing I've watched this Christmas.<br><br>The writing really was terrific with a plot that had more ups and downs than a mountain range, more ins and outs than Hampton Court Maze and more twists and turns than a dozen corkscrews, in short it was a triumph. Starting with a Victorian-era impossible murder with an even more impossible murderer, guest appearances by all the previous supporting cast including a massively-bloated Mycroft, surely a homage to Sydney Greenstreet and the return of the master-criminal we've all missed, a premonition of another husband-slaying in a big old house after dark, a recreation of the real Reichenbach Fall climax of yore, an ingenious denouement anticipating female suffrage years later but perhaps the best thing of all was the promise of a new series to come.<br><br>As ever, the technical aspects of the production were great, I'm a sucker for the multiple camera-angle, 360 degrees perspective, time-freezing, computer graphics and microscopic zoom shots employed. There was humour a-plenty and hosts of references to the Conan-Doyle original, including, if I'm not mistaken, the first time this Sherlock has ever said \"Elementary my dear Watson\".<br><br>The playing by Cumberbatch, Freeman and Andrew Scott as the three main protagonists was never better. I'm sure there will be Sherlock-oligists who can pick apart the complexities of the plot, which for sure seemed at times like a read-across from Moffat and Gatiss's other re-creation Dr Who, but let them, they won't spoil it for me. This was the best \"Sherlock\" I've yet seen and sets an almost impossibly high standard for what may come after this.<br><br>Doesn't matter if they don't however, this one was so good it really was the perfect after-Christmas present.","user":"Lejink","rank":[110,158]},{"title":"A brilliant, madcap Gothic adventure.","rating":9,"date":"1 January 2016","review":"Sherlock and Watson land in the late Nineteenth Century to solve the case of Emelia Ricoletti, a bride that killed herself, and then later manages to shoot her husband and bring about the death of Lord Carmichael. The duo must uncover how this devious crime was carried out.<br><br>I must admit I have been hugely looking forward to this, possibly because I was keen to see how the altered setting would work. Series 3 had been somewhat of a disappointment, a little too self satisfied I suppose, so I'm glad they did something different to refresh it, it was certainly different.<br><br>A few minor quibbles, a little contrived at times, and as is the nature of the show it did seem a little wrapped up in its own smuggness at times, but I was utterly enveloped in the story, it had me wrapped from start to finish. Beautiful cinematography, great direction, awesome production values. It managed to feel fresh and exhilarating once again.<br><br>Cumberbatch was definitely on fine form, I loved the altered appearance, suited him, I noticed a few Jeremy Brettisms, not sure if anyone else did, maybe the hair and some of the body language. The scenes between Holmes and Moriarty once again were simply amazing, Andrew Scott is just unbelievable, he is such a charismatic performer.<br><br>Crazy, fun, Gothic, energetic, waited a long time, and it was worth the wait. 9/10","user":"Sleepin_Dragon","rank":[57,89]},{"title":"I hated it...then I loved it!","rating":10,"date":"3 January 2016","review":"I did not fully get it the first time but when I watched it again, it all started making some sense to me. It may be difficult for those who are not devoted fans of this series to fully grasp the craziness of this episode, but once you open your eyes to the genius of the writers' intent on what they were trying to achieve here, I could not keep my eyes off the show and found myself watching it over and over again. If the writers of series simply made this an one-off episode to truly stick to the original storyline, then there would be numerous critical remarks about how the writers settled for the comfort of predictability and made the whole plot so ordinary and boring. Before shooting at the TV screen and calling it 'stupid', one may want to watch it one more time and there will be that \"a-ha\" moment!","user":"jess-01645","rank":[64,104]}]