[{"title":"Just bad, awful, and frustratingly poorly written","rating":1,"date":"18 October 2015","review":"I actually thought the actors were okay, for the most part, but there were quite a few instances where the reactions to certain circumstances seemed way off base. There were so many, that I finally quit counting..or caring.<br><br>I don't think I've ever given any other movie a 1-star rating, but this movie deserves it. There is no redeeming value to it whatsoever. It's sad to think that people spent time and money making this. I've seen better home movies.<br><br>All sorts of fallacies in \"action movie logic\" and interactions written that just wouldn't happen in any world, real or imagined, completely destroyed any hope of this movie being worth anything more than a glob of gum stuck to the bottom of your shoe. Just terrible and awful, and I couldn't even laugh at it enough to make it entertaining in the least.","user":"mgarland","rank":[18,21]},{"title":"Just Nope","rating":1,"date":"19 October 2015","review":"This film was so bad, I even felt sorry for the prop designers who had to make all those fake dollar bills in the back of the vans. There was one scene where the main woman was asked to describe her husband and she says \"he has brown hair\" cut to husband in the cop car...He's bold as a babies bottom and talking about babies bottoms his partner describes a girl having an \"ass like a ten year old\" now this might have been a joke but the way it was deliverer and how out of the blue it was, just make it creepy.<br><br>It seems to me that the characters where totally miss cast or very poorly directed but not even Spielberg at the helm would have make the story any better. <br><br>DO NOT WATCH!!!!","user":"mikeyvallely","rank":[17,21]},{"title":"Worst acting I have ever seen","rating":1,"date":"18 October 2015","review":"Terrible acting, unlikely human responses in movie &amp; very predictable. I made an account JUST to let people know not to waste their time on this one movie. Hopefully you poor souls listen to my advice. Mischa Barton has absolutely no emotions towards HER child. She distills nearly NO EMOTION over her daughter being kidnapped and nearly drowned. Just pure disgust. Don't buy it. Don't watch it. Don't even bother with the trailer.<br><br>Can't believe people paid money to provide this.<br><br>Don't do it.<br><br>WORST EVER","user":"karissabestphotography","rank":[8,9]}]