[{"title":"A very good slice of Bacon","rating":7,"date":"25 June 2015","review":"I guess you would have to describe Cop Car as a high concept movie, i.e. a film whose story can succinctly be described in one sentence. This is essentially about a couple of kids who steal a cop car belonging to a sheriff who it soon transpires is a very bad man. Do not let the simplicity of the set-up put you off though, as this is a lean film with a lot of good things about it. Firstly, we have the two young boys who are a great central pairing; they really act like genuine kids and are very sympathetic and humorous throughout. Secondly, we have Kevin Bacon giving yet another good performance as the bad cop. Thirdly, this is well-paced and builds quite a bit of tension as events escalate to an ending that is a little surprising. Fourthly, it's a rather well photographed and scored affair, with the sparse Colorado plains scenery shot nicely in widescreen.<br><br>This is a very good example of a film that keeps things simple while never forgetting to entertain and surprise. It's well acted, photographed and directed. It has well-handled suspense and characters you actually care about. Can't say fairer than that really.","user":"Red-Barracuda","rank":[132,166]},{"title":"Another good piece of acting.","rating":7,"date":"7 April 2016","review":"I must confess - i chose to watch this movie purely because of Kevin Bacon. He chooses his characters very carefully so i knew this film is going to be good at some point. 😉 <br><br>The story is about two boys who steel a cop car and a cop (not good one) who tries to retrieve it back. The story simple, only three characters to concentrate on - and very real. Yes, real, because children these days can be that stupid, and cops these days can be that \"of the line\". What i liked about this film is that it's not over crowded with unnecessary story lines, characters - it has only whats needed. And in a short time they can tell a lot that way. Beautiful nature, as it is, small town's life without any \"glamour\". And good acting - kids acted very naturally, Kevin Bacon of course was very good as always. I admire his talent to \"get into\" character he is playing.<br><br>I enjoyed this film - don't know why, but at some point it reminded me of \"Perfect world\" with Kevin Costner, just with less action 😀","user":"kadushke","rank":[28,32]},{"title":"Solid film, the type I wish they'd make more of.","rating":8,"date":"14 August 2015","review":"Great characters. Their back stories are hinted at and your imagination fills in the gaps. <br><br>Great writing. The dialogue has weight and sounds natural. <br><br>Great scenery. It's on the outskirts of an old dusty town, way out in the back-roads of somewhere and it looks beautiful. <br><br>Great storyline and a great score all at a nice pace and under a one and half hour running time. It has no need for flashy, gimmicky explosions or a convoluted and overly-complicated plot. <br><br>This is the best film I saw this summer.<br><br>It's a simple original story that keeps you wondering what will happen next. I don't know how a film like this can get made any more.<br><br>Kevin Bacon was pretty great too.","user":"colmagn","rank":[101,132]}]