[{"title":"Oh My God!","rating":9,"date":"11 November 2015","review":"This movie sets out to be offensive, blasphemous and hysterically funny. Well, it does that. It wins hands down! Totally and utterly brilliant.<br><br>Strong performances and the actor, director was incredible. I was intimidated by the actor portraying the psychotic father. I loved the flow of the movie, it is dark, sick, funny, irreverent, gory, hysterical, dramatic, a master stroke of cinematography.<br><br>This is a movie that if you love comedy, you are going to love. If you have an inappropriate sense of humour, then this is YOUR movie! If you are gay/straight religious/atheist there is something to shock you, and make you laugh your head off.<br><br>Have fun! I know I did.","user":"ikonmediahouse","rank":[10,22]},{"title":"I love movies like this!","rating":8,"date":"29 March 2020","review":"A couple of people here are saying that they can't believe the positive reviews this film is getting, claiming it's just friends of the director leaving them. I never heard about this movie before, but it's exactly the kind of cinematic pleasure I enjoy. (I refuse to use the term \"guilty\" pleasure, because only mentally ill puritans would think pleasure is something to feel guilt over.<br><br>If you like Troma movies, the early John Waters stuff, cheesy 80s action flick one-liners, and exploitative levels of violence and gore, you'll get a kick out of this one. The acting ain't perfect, the effects aren't perfect, there's no real plot. None of that matters. Billion dollar production budgets and photo-realistic effects would probably make it less entertaining. It's something out of an alternative universe. But it's so damn fun. Just turn your brain off get over yourself. No one likes that sour face you're making.","user":"iamkrause","rank":[0,0]},{"title":"\"forgiveness for some.. bullets for the rest!\"","rating":6,"date":"25 January 2020","review":"It doesn't happen too often that i agree with the obviously fake, overenthusiastic reviews of cast, family members or whoever. this time i must admit that, even if i don't share the euphoria their authors must have experienced, \"holy hell\" was better than expected, and more entertaining than most other low budget production. the lighting is a bit odd at times, acting and effects straightup laughable but the plot is grim and there's enough violence to keep you tuned. unlike other cheap flicks, it doesn't try to be something it can't be.\nthe fact that it is obviously a \"hobo with a shotgun\" - ripoff is bearable.","user":"Krhhmg","rank":[0,0]}]