[{"title":"Perfect blend of stage and screen","rating":9,"date":"19 July 2015","review":"I'm somewhat a Shakespeare traditionalist and was prepared to walk out of the theater early. No way. Julie Taymor pulled off a small, and difficult, miracle. We are treated to the spontaneous presence of a stage setting and the freedom of cinema trickery, but with the lightest of touches. And the magic of this cherished comedy has been lovingly preserved. The low tech and brilliant use of fabrics and light gave the production just the right touch of enchantment. There was wonderful use of the chiaroscuro effect, as characters appeared and vanished in out of the shadows. The tiny lights that bathed Titania's face in soft white was a gorgeous touch. And Tina Benko played her to perfection, with a flawless blend of sauciness, raised eyebrow and tongue in cheek. Pale, sinuous and haughty, she was complemented by the strapping brooding black hulk of Oberon, played by David Harewood, leaving all the fairies quaking in his wake. Perhaps the most praise should go to diminutive Kathryn Hunter, giving a decadent Cabaret spin to Puck, with a dash of Jerry Lewis, not to mention some very lithe gymnastics. Max Casella's Bottom also stands out for its hilarious schtick. The director took a few liberties with Shakespeare's lines to great comic effect, most especially with Jacob Ming-Trent's Tom Stout, who got some of the biggest laughs, and deservedly so. I could go, but it's dinnertime and I'm hungry. My hats off to the cast and crew, and most especially to Julie Taymor who created a vision to be proud of. So says I, and so would William, methinks.","user":"chiodoesque","rank":[9,11]},{"title":"A Complete Delight","rating":10,"date":"20 August 2017","review":"Certainly one of the best films ever made of a stage production. Julie Taymor's astonishing, magical production is infinitely fascinating with its fusion of world theatre traditions with riotous slapstick and acrobatics and stunning visual projections. There is too much to praise. It must be seen. Besides this, the four-camera film captures the arena stage perfectly. The beautiful stage direction is matched by astonishing film direction. Hugely beautiful and entertaining. It is impossible not to love this film.","user":"wbeeman","rank":[3,4]}]