[{"title":"This Cabin Fever reboot fails in every way imaginable.","rating":1,"date":"12 February 2016","review":"Cabin Fever is just another one of those movies where studio executives thought, \"Hey, the original was good so why not milk the f*ck out of the name and release heaps of garbage, call them sequels, and the money will come.\" Now this reboot comes along with the exact same script as the original so I figure the execs were just like, \"F*ck it, why even try?\" And it shows. The good news is that this isn't a theatrical release - it's limited on-demand or something so thankfully a majority of people won't be aware of this abomination's existence. But for those who are, let me affirm your suspicions: this movie blows.<br><br>First off, none of these people should be allowed to act ever again. I hesitate to call them actors because I saw no semblance of acting on screen. The characters are unlikable and annoying, which is weird because I don't remember hating them in the original. I didn't care if any of them died; in fact I wanted them all to die so the movie would end as quickly as possible. It literally goes down the horror movie cliché checklist. The cabin in the woods schtick, clueless college kids, creepy guy at a gas station, perfunctory sex scenes, loud sound effects to make you jump, etc. Hell, even the gore is lame. Patient Zero had better gore effects.<br><br>Please don't watch this movie. It makes Patient Zero look like The Dark Knight. Watch the original if you want, or literally any other Eli Roth movie. I don't blame Roth for this mess because I'm pretty sure he just signed off on it, made some green and never thought about it again. It doesn't even have his signature silly style. It tries to take itself seriously and it fails miserably. Then they shoehorn in some jokes that aren't funny at all, and you laugh at how horribly they were delivered, and then you'll contemplate what you're doing with your life. It's a chore to watch, seriously.<br><br>Cabin Fever is just another byproduct of the horror remake craze. Avoid at all costs.","user":"lnvicta","rank":[130,149]},{"title":"Pointless remake","rating":3,"date":"13 February 2016","review":"I'm not the one to hate on horror movie remakes I actually enjoy watching a classic remade for the modern audience. But that's only when the director can create a new modern twist or add more to what the original didn't have like what Zombie did for Carpenter's Halloween. But the remake of Eli Roth's Cabin Fever is just one of the most pointless horror remakes I've ever seen next to Psycho. The story of the movie is lame. It's everything you seen in the original just with different actors in these scenes. You actually know what's coming next. You even know what the characters are gonna say next. There's nothing new added in the directors own vision. It's the same Dog death opening scene. The scene where one of the characters gets his hand attacked by Dennis is the same. Even the camp fire story is the same. The only difference is the ending of the movie, which is not half bad. The characters are very unimportant to this movie or at least they felt like it. You don't pay even a minute of attention to them because, well they are supposed to be the same as well and they make the same dumb choices of survival as the original. The blood n gore effects seem to be up higher than the original. But it might it some gore lovers we do see a lot more blood all around in some scenes especially in the bath tub scene we see even some skin coming off.<br><br>I didn't enjoy this remake at all it's nothing, but watching the same movie you already seen. You know what's coming next. The characters die in the sane order as they did in the original. The only differences you'll find is the ending, higher blood n gore, and different actors who shouldn't be allowed to ever act in another movie again. I don't recommend you watch this waste of a remake. You'll have a much more better time re watching the original movie.","user":"nathan-mcgee6","rank":[40,44]},{"title":"No, no, no.","rating":1,"date":"13 February 2016","review":"While not a shot-for-shot remake (the angles and cinematography are different), this remake uses the same script as the 2002 original with slight alterations. Despite this seemingly pointless exercise, I was prepared to give it a chance and not hate it for failing to aspire to anything original. I'll go on the record saying I -wanted- to like this film, despite some unease after watching the trailer. I'm sad to say it fails to live up to the original in nearly every regard.<br><br>What sets this remake apart from it's 2002 predecessor is the lack of any chemistry between the actors. It's not that any one particular actor is singularly bad, it's that none of them feel like they're in the same movie. It literally feels as if they pulled random strangers off the streets and asked them to make-believe they were friends for a weekend. I simply couldn't buy that any of them would take off for a weekend together, much less have known one another for years, as is the case for at least two of the characters. They feel like strangers and it doesn't help that all of them seem to be acting as if they're in completely different films--the disconnect is that apparent. It's upsetting that, despite having many of the same scenes and lines as their original characters, everyone in the cast feels so disconnected from the script that they utterly fail to bring any of their characters to life. They're the ghosts of what we saw in the original film, the acting completely lifeless. It's as if none of them wanted to be there.<br><br>Roth's trademark humor is also excised in favor of a few random throwaway jokes, delivered in such a deadpan tone by the actors that each one falls flat on its face. This time around, the director goes for a more serious approach to the material (a mistake, I believe) and attempts to paint the film as a tragedy. Nothing attempts to sell this more than the overly-ambitious music score, which is so epic at times that it feels like it belongs in a big-scale war movie. The composer feels the need to John Williams this thing up at times, which just leaves the viewer scratching their heads at why such a big spectacle of a score is being utilized for a film that largely takes place in a single cabin.<br><br>As if to keep from being too familiar, the deaths are altered just enough to qualify as being original, as long as you don't count on being surprised. Practically everything is telegraphed a mile in advance thanks in no small part to the reliance on the original script so that even the prospect of new deaths isn't enough to warrant much excitement.<br><br>Perhaps the biggest blunder is the recasting of Deputy Winston as a woman, played by an actress with zero comedic timing (although this doesn't stop her from being handed humorous dialogue). The character is a painful reminder that no one invested in this remake knows how to bring life to their character, as is true with the weed-toting camper (played by Eli Roth in the original). No one would call the acting in Cabin Fever '02 a revelation, but it's as good as gold compared to this.<br><br>The entire film is permeated with a depressing lack of passion on or off camera. It's as if no one wanted to be doing this. Roth's film, while certainly underrated by many, at least felt as if it was made by someone who cares. This is a lifeless remake on par with the new Nightmare on Elm Street. Truly a flat, emotionally barren production not even worthy of viewing as a curiosity.","user":"lupitag-11852","rank":[61,71]}]