[{"title":"What were people expecting? This was great!","rating":9,"date":"24 November 2017","review":"Beware low ratings and subjective reviews of movies, including this one. I gave this 9 stars based on how well the movie delivered on what it promised. It did fantastically.<br><br>It was a little bit wacky, but not even close to being over-the-top. All the jokes were original, imaginative, and genuinely funny. The humour didn't rely on being crude or scraping the bottom of the gutter. No foul language or innuendo, except for 5 minutes from one character who suited that brand of humour - yet even that was very tame.<br><br>The narrative was consistent and engaging with no plot holes. It didn't test my suspension of disbelief. Except for one fake-out, there were no clichés. Even the fake-out was accompanied by a tasteful and funny joke.<br><br>Would watch again. Would show to friends.","user":"creativedoom","rank":[27,40]},{"title":"Enjoyable, deserves a higher rating","rating":7,"date":"26 September 2017","review":"I don't understand some of the negative reviews about this movie, and it's low rating is unfair. Antonio's choices of movie projects can be a bit hit and miss, but Gun Shy was a pretty funny movie. Don't expect it to be the best comedy, or anything great in cinema, that is not what this movie is about. It's an easy going hour and half of inoffensive fun. Gun Shy and it's cast and crew are not going to win any Oscars for this, but everything was done well enough to give the viewer a pleasant experience. It's not a deep thinker, and as such does not need to be over critiqued.<br><br>At least a 7/10","user":"kruizer04-268-186704","rank":[22,37]},{"title":"Antonio Banderas worst movie ever.","rating":2,"date":"14 September 2017","review":"They made the trailer look somewhat interesting and it got me curious so I took a chance not expecting much. Well, it was way worse than I thought. This is by far Antonio Banderas worst movie ever. The directing and location sets were the only salvageable parts of this disaster, everything else especially the acting and writing were garbage high-school drama class quality. Seems to me whoever produced this garbage needed a tax write- off, and they got it. It's a generous 2/10 from me","user":"TheTopDawgCritic","rank":[25,44]}]