[{"title":"Marvel just doesn't give ah crap when it comes to straight to DVD","rating":3,"date":"16 August 2014","review":"﻿I have a theory. Marvel is SO successful on the silver screen, that they've decided to throw whatever is leftover on DVD, not really giving two craps if it's any good or not. While DC pours all their love into their DVD's, Marvel just give us mediocre nonsense like Iron Man.... I'm not writing that long ass title again.<br><br>So what's wrong with it? Short answer. EVERYTHING. Like Black Widow &amp; Punisher Heroes United (damn! wtf is with these titles?!) IMCAHU also has horrible animation (see example below), boring voice casting and a story NOBODY cares about (Red Skull is the bad guy, Hail Hydra, you get the idea).<br><br>My biggest issue with this movie was the animation. Not even good enough to be on Saturday morning cartoons. IMHO, this kind of animation weakens a story, because it's stiff and affects the pacing badly. Action seems stilted and slowed compared to what's suppose to be going on.<br><br>There's not much else to say other than if you miss this, you aren't missing much. Only watch if you're some kinda die hard Marvel fan. Otherwise, stick to DC for the straight to DVD movies based on comics. Trust me, they might be stumbling on their big screen adaptations but they are consistently hitting home-runs on our flat screens.","user":"moviejunkie0705","rank":[13,18]},{"title":"Well it was better than the one with the Hulk.......","rating":9,"date":"9 June 2018","review":"Heroes United should have been a tv series. If they had cut out all the pointless blather and friendly sparring, this would have been a solid half hour adventure. I'm not sure what they were going for with these movies but in classic Marvel style, they failed.","user":"TheMeanGreenMidget","rank":[2,2]},{"title":"Viewer Disgusted again","rating":2,"date":"17 September 2014","review":"Riding on the popularity of Robert Downey Jr's live action IRON MAN movies and this year's CAPTAIN America: THE WINTER SOLDIER, HEROES UNITED 2 sees Iron Man and Captain America caught up in H.Y.D.R.A's latest plot to steal advanced technology and learn the secrets of the super soldier serum coursing through Captain America's veins. Mind control, bickering heroes, secret antarctic bases and other clichés riddle the already boring story and flat characters. All this is set to the worst computer animation to ever soil a screen in the last 15 years. <br><br>In repeating the mistakes of its predecessor, HEROES UNITED 2 plays out like a 5 year old enacting a captain America story with his action figures. And just because he is so popular, Marvel goes and shoves Iron Man into the mix and allow him to steal the spotlight. But who cares? The characters are nothing like their live action counterparts or their comic book incarnations. They are uninteresting and borderline unlikable. <br><br>Tony Stark sounds like a pretentious teenager, more like Spiderman with all his wise cracking. His nasal voice and attempts at mimicking the more witty humour of his live action counterpart just fails. Captain America is that one dimensional boy scout with \"generic hero voice\" and a chest designed by Rob Liefeld; a huge disproportional chest that seems to change size throughout the movie.<br><br>That is least of the visuals' problems however. The cel shaded CGI is inconsistent and at times looks worse than 2003's Spiderman CGI series. Animation is jerky, stiff, looking like it was made in the late 90s right along side Reboot and Jimmy Neutron. There is little sense of weight to the CGI models, surfaces do not seem to connect (e.g. between a metal strap restraining captain America and the hero's chest or between laser shots and unfortunate victims), and many fight scenes look like they were done with stop motion puppets. Don't even get started on the embarrassingly bad human facial animations. <br><br>The whole show in a sentence: Two kids playing with their action figures on a boring Sunday morning. This is proof that Marvel's direct-to-video department is dead in the water. Zero effort at being even marginally entertaining, pit bottom production values, groan inducing dialogue. This here is a sequel to a dismal excuse for a CGI Direct to video movie that manages to one-up its predecessor in how horrible it is. IRON MAN AND CAPTAIN America: HEROES UNITED is 2014's scrap from the bottom of the barrel. Look up youtube and one will easily find Computer animation done by students with their off-the-shelf software that looks way better than this drivel from a so called \"Multi Million dollar production company\".","user":"xamtaro","rank":[9,16]}]