[{"title":"Surprisingly interesting","rating":6,"date":"8 October 2016","review":"I will not lie one of the reasons i watched this movie is because of Eleanor Tomlinson, I was drown in her big beautiful green eyes, but then I discovered that the story is not too bad. A lot of interesting elements are there: the pace is correct, we have nice GoPro bicycle chases, murders, a traitor that nobody suspected, a spectacular hit and run, corruption, blackmail, cheating and multiple turnarounds. But the thing that is remarkable is the soundtrack, a lot of nice songs like \"Hell on wheels\" by Fu Manchu, \"The Sleepless\" by Red Snapper and the ending with \"song to say goodbye\" by Placebo. I recommend this movie to enjoy a nice British action thriller.","user":"tizipapa","rank":[18,27]},{"title":"Alleycats Movie","rating":5,"date":"13 December 2016","review":"Well Alleycats(2016) is a thriller, suspension, Mystery, Action Comedy film taking place in Modern day London. Almost like the Premium Rush(2012) with Joseph Gordon-Levitt. The Story takes place when the main Character Danni(Eleanor Tomlinson) returns back to her home roots with her brother and bike gang, following the unfortunate events of a blackmail gone horribly after the witness of a murder. Supported with GoPro Fast paced footage on bike chase's and a story that not all is as it seems, with a Twist. As Main Character Danni(Eleanor Tomlinson) its up to her to find out what is really going on. Alleycats keeps you Unexpectedly watching till the end. So if you want to watch a good British Thriller I recommend Alleycats.","user":"estevanmarquez","rank":[4,9]},{"title":"Cinnamon Street","rating":7,"date":"11 October 2017","review":"Chris (Josh Whitehouse) is a London bicycle courier, not as flashy as Joseph Gordon-Levitt. He witnesses and head cam films what appears to be a politician (John Hannah) who has murdered his mistress. Okay, don't get attached to Chris. His sister Danni (Eleanor Tomlinson) eventually teams up with the father of the dead girl (John Lynch) and Jake (Sam Keeley) a friend of Chris...which creates a girlfriend issue for a brief comic scene, to investigate Chris' accidental death.<br><br>In this film we have amateurs, armed with bicycling and drinking skills (neither one helped) going after a well connected politician with the police helping him and paid professionals. Don't expect a lot of bicycle nonsense or parkour stuff, it is not that kind of film. The title and cover art is slightly misleading. A film you can watch, enjoy, and most likely forget as they didn't bother with memorable scenes.<br><br>Guide: F-word. Sex. No nudity.","user":"nogodnomasters","rank":[0,0]}]