[{"title":"When a secret long hidden makes its way out...","rating":9,"date":"14 October 2016","review":"A very surprising Aussie film. Not all the Australian film makes big at the world stage. So this film was not known to many people, but I am lucky to watch this. The film was based on the Norwegian play called 'The Wild Duck'. It was adapted several times for the screen, but this is the latest and a modernised version. The first film for the director and he was amazing in handling the screenplay as well. <br><br>Obviously I did not know anything about the film. The cast looked good and also the storyline, so that's my reason to watch it. It began like a simple drama about a family who are going through a difficult time after the wood mill was shut down in their small town. Their's daughter, Hedvig, who is studying in the high school worries that she's going to lose her boyfriend if they move out of the town. That's not it, the narration had layers like from other people surrounding this small family and their perspective too has a big impact on the storytelling.<br><br>Not just this family, but many from the town were out of the job and that leads to some unexpected decisions. Another family who ran that wood mill for nearly a century, welcomes their son, Christian from the United States who is having a tough time with his girlfriend and also to attend his father's wedding. He accidentally meets his childhood friend which is actually a Hedvig's father. They spend lots of time together and that's where a new issue arises. Christian reveals some hidden truth for the decades between their two families. Everything breaks loose and becomes impossible to fix it. From all this, the daughter is the one who directly get affected, but to learn how is why you should watch this film.<br><br>You won't immediately understand the meaning of the title. The film very smartly progresses like bit by bit with lots of suspense around. The best part is, it never reveals the actual secret at any length of the film, but still the viewers going understand the situation very clearly. That's really amazing, particularly the writing being so clever. I don't know the original material which is more than a hundred year old, but I loved this to tell the story in a smart way.<br><br>\"You do not need to be scared of the truth.\"<br><br>The characters were the best part of the story. The switching time was excellently done. Like the whole film is not intended to deal with one particular issue, but multiple. Everybody had something to deal with, some were personal and some were concerned for their whole family. The story always engaged with details, so there's no time for relaxation for the viewers. In the first half it succeeds to keep everything neat, despite the story developed from different angles. Because the end pulls them all together to conclude the tale on high. High mean, neither happy or sad, the timing when the twist takes place was a perfect setting.<br><br>If you are a melodrama fan, this must not be missed. I haven't seen a good tearjerker for a long time and then I found this one unexpectedly. I did not know the film would turn this way, but that's one of the reasons why I liked it a lot. The twist at the final act was kind of predictable if you were focused enough in the early part, but nobody gets a clear picture of how it all ends. That's the point. Despite how the film characters react when the suspense was revealed, we have our own respond too, but unable to deliver where it requires. That is funny, but the film gets very serious towards the final segment and you get no time to react, you will be like unmoved till the end credits roll up. But sensing a tragedy is certain.<br><br>I recently saw 'Fathers &amp; Daughter', that I anticipated something what this film offered. The story lines are completely different from these two films, but that father and daughter relationship thing, I liked very much from this one. Especially the emotions are the most crucial to narrate the tale and this film was way better in that perspective. Comparison between these two titles only on the sentimental side, other than that it's not fair to bring a debate on them. Anyway, both are the fine melodrama.<br><br>This film definitely would appeal strongly to the family audience and I highly recommend it to them. There's no strong nudity or the sex scenes, but thematically it goes some length to record the required event. Other than those couple of parts, this is a film for everybody. Very satisfied with the overall film. I might not consider it my favourite, but very close to be called one. Like I said the story was thoroughly written, so I'm feeling this film won't go unnoticed. I am not talking about it would find its audience, but the remakes. European, Korean, Bollywood, even a Hollywood version might come. So fingers crossed, but I suggest this one to watch if you are convinced with my review.<br><br>8.5/10","user":"Reno-Rangan","rank":[19,24]},{"title":"Excellent all-round Aussie Production","rating":9,"date":"7 June 2015","review":"I was lucky enough to see this film today at the Sydney Film Festival....adapted from Henrik Ibsens late 19th century play ''The Wild Duck'' but totally rewritten and retold into a modern Australian story set,maybe in the logging areas of Tasmania but actually filmed around the very atmospheric Snowy Mountain towns of Tumut and Batlow. The acting is superb, particularly the wonderful Ewen Leslie who just gets more magnificent in each role he takes on...Script and cinematography add to the overall brilliance of this terrific Jan Chapman production....a must see for all lovers of great Aussie films both here and overseas...I cant wait to see it again on its general release","user":"edhart08","rank":[38,54]},{"title":"Gripping and Moving Australian drama","rating":8,"date":"15 October 2016","review":"Henry (Geoffrey Rush) is the master in a town where his logging company is the main attraction. His wife has passed away long ago and so he decides to remarry. This coincides with his decision to close the logging factory due to falling sales. The town is imploding but he wants to pull out all these stops for his wedding day.<br><br>His estranged son, Christian, has also returned from America and immediately reconnects with old friends and this includes Oliver and his wife and daughter. He has long born a grudge with his father and as old tensions resurface so do nagging questions from the past. It is the answer to those questions that are the setting for the calamity of the future and a delve into the darkness that the past can often hold.<br><br>This is a smouldering watch, all the performances are brilliant especially Odessa Young as Hedwig and Ewen Leslie as Oliver. We also have a fine performance from Rush and the ever reliable Sam Neil – both acting royalty in Australia. It keeps the tempo up almost from the start and is a credit to Screen Australia for investing in such a commendable piece of cinema.","user":"t-dooley-69-386916","rank":[12,15]}]