[{"title":"Acting skills not required","rating":1,"date":"28 June 2015","review":"Being a lover of bad movies I wasted an hour or so of my life watching this garbage. It's so bad I had to warn other users to save themselves. I can't act either but the bunch of morons in this 'movie' are unbelievably terrible. I'd like to ask them one question.. 'Why?' ..... Did they set out to deliberately make a crap movie ? I honestly could make a better movie with my mates and my phone. Truly awful garbage, it makes Asylums movies look like multi million dollar blockbusters. Ghost Shark and Sharknado are positively genius compared to this 'movie', at least they have people, sometimes even 'stars' who can act a little, yes the scripts are bad but Asylum know it, I'd rather sit through Bermuda Tentacles again (and it was shocking) than have to watch these idiots . You have been warned.","user":"roymcf-332-857173","rank":[13,14]},{"title":"The worst movie ever","rating":12,"date":"12 April 2019","review":"This movie is about a giant prehistoric shark that lives in 3 feet of water and terrorizes an island you can drive to. After flying out of the water to kill a guy, there's 5 hands on the shore. Was that comedy? I have seen hundreds of bad movies and this is definitely the worst.\nThere is a review that says no nudity in the title but there is nudity.","user":"TheMeanGreenMidget","rank":[7,7]},{"title":"When you want to stab yourself in the face...","rating":1,"date":"30 October 2016","review":"I like trash movies. I like shark movies. So, being really spoiled by Asylum, I thought: Aww, come on, for just 5.99, this can't be bad. Or... Can it? Well... Yes, it can. This is an amateur movie released on DVD. And it's so incredibly DUMB on so many Levels... There's minor things (Why is he leaving his socks on as he wants to join the hottie in the water?) to really, really, REALLY stupid stuff (Whats a scientist doing all alone in the middle of the woods?) and some stuff which will make you just shake your head (no blood in a decapitation scene, but when there's a flesh explosion they just take a bucket of badly done fake blood and throw it into the actors face)... The acting isn't present, I haven't watched it in English, but the German dub, so I can't say anything about the original voices, but the facial expressions are just... Ugh! German sincere is on the Level of \"let a bunch of drunk people yell into an iPhone\". Not even the music is any good. Uhm, have I mentioned the Shark is just a still picture? It's a PICTURE in front of a moving background. Yes, the thing can fly. For whatever reasons.<br><br>Don't buy this. Don't rent this. Don't even STEAL this, it's not even worth that. The only good thing about this movie is: It's only 60-some minutes, and at least the end credits song isn't THAT bad. Still bad, but it's the only light at the end of the tunnel.","user":"full_pirate_regalia","rank":[7,7]}]