[{"title":"Emotional, well-acted, and atmospheric, but extremely mediocre.","rating":5,"date":"12 November 2016","review":"The Monster was slightly better than I expected it to be. It manages to take a very basic plot and turn it into something more engaging than you'd think. But it is by no means a great film.<br><br>First of all, the pros. The acting from the two lead characters, especially Zoe Kazan, who plays the mother, is pretty good. These two show a ton of emotion throughout the film that really hooked me in and made me feel for them. I'm happy to say that the child performance was solid. Child performances are too often cringe-worthy, but this one was okay. Not fantastic by any means, but not terrible.<br><br>The direction and tension the director managed to create, with the atmospheric lighting, camera movements, and shot composition, was very good. You can tell a lot of effort went into creating a tense, suspenseful atmosphere.<br><br>The makeup effects on the monster were decent. They are 100% practical, no CGI. If you appreciate practical effects like I do, you might enjoy this monster design.<br><br>Lastly, the final act of the movie was pretty strong. It was engaging, emotional, intense, and all around the best part of the film. <br><br>Now the cons. The story is the definition of mediocre. Two people get stranded on a deserted road and a monster from the woods terrorizes them. The film tries to engage the viewer more by making the primary focus of the story about the strained relationship between the mother and daughter and how this terrifying experience brings them together. On some aspects this works, but it's not enough to make the plot anything more than average at best.<br><br>The dialogue was also very shoddy at points and felt unnatural and forced. I wouldn't call it terrible, but it wasn't great either.<br><br>Lastly, some of the decisions the characters made just had me scratching my head. They came across as nonsensical and just flat- out dumb.<br><br>Overall, this is a pretty average movie. I'd recommend one watch just for the decent performances and direction and a cool monster. Don't expect anything great. Expect a flawed film with an unoriginal plot with some good aspects scattered throughout, and you might enjoy it.<br><br>5/10","user":"HailPaimon_","rank":[106,139]},{"title":"Monsters come in all forms","rating":9,"date":"31 August 2017","review":"Just watched this and loved it. Another smart addition to the encouragingly robust genre of smart and allegorically innovative horror movies. <br><br>My take? The monster is simply Kathy's addiction, as experienced by daughter Lizzy. <br><br><ul><li>it attacks when she's vulnerable</li></ul><br><br><ul><li>it removes people who are there to protect her (Lizzy's father (the actual addiction)/ the tow truck guy and the paramedics (the metaphorical monster))</li></ul><br><br><ul><li>shining a light on it/ acknowledging it weakens it</li></ul><br><br><ul><li>once you've acknowledged it, you're in a better place, but you still have to go through withdrawal and might be too damaged to pull through (Kathy vomiting blood in the woods due to her internal injuries)</li></ul><br><br><ul><li>despite your best intentions, innocents will still suffer because of it. (Lizzy undergoes her mother's \"overdose\" and death, and then still has to grapple with the monster on her own.)</li></ul><br><br><ul><li>Finally, the ultimate version of \"shining a light on something\", i.e. setting it on fire, is what allows her to be free, albeit with a forever altered view of her own safety, and the security of the world in general. [ Fun add on-- she had to sacrifice her childhood/ innocence, i.e. her singing teddy bear, in order to finally overcome the monster. ]</li></ul><br><br>A lot of people are commenting on the weird/ unbelievable choices made by the characters in the third act. If you're looking at it as a straight up horror movie, I could understand that. But seeing it through the lens of the pretty obvious analogy that was being made about addiction, they all felt totally spot on to me. <br><br>Definitely recommend!","user":"kazps","rank":[41,54]},{"title":"A Good Indie Horror Flick","rating":7,"date":"13 November 2016","review":"There are a lot of strong opinions on this film in its early reviews. I just want to give a practical commentary on what I see. <br><br>This is a great horror flick with some heavy symbolism. It is a story about a mother and daughter who are terrorized by a monster when their car gets stuck. A lot of dudes (or women haters) seem to hate it (check the low reviews and notice the colorful words they have for women). As a dude myself, I had no problem watching a film from a female perspective. I rather enjoyed it and found it touching at times. <br><br>The characters are both flawed. I related with the daughter at times because I grew up with a flawed father. I acted and reacted a lot of the ways the daughter in the film did too. So from my perspective, there was some heavy realism in the backstory. I found the \"boring\" moments to be touching. <br><br>The practical effects are superb in my opinion. Some will disagree though. <br><br>Some of the writing is flawed in regards to character choices. I think discourse could answer some of the choices, but my fellow horror film nerds seem to be either accepting or spiteful of cliché character fails in the genre. I could see past them though for quality story though. <br><br>So if you don't get angry being put in a woman's perspective and like horror films, this should be right your alley.","user":"cshawproductions","rank":[71,98]}]