[{"title":"Inventive, immersive and entertaining with a bit of an anti-climax","rating":6,"date":"3 July 2016","review":"As someone who used to enjoy gaming a lot before the house was taken over by a wee one, I have to say, the kind of virtual reality shown in this movie seemed like a dream. Thing is, it very quickly turns into a nightmare. I can imagine most Gamers would enjoy the movie, even if it were only for the possibilities....<br><br>The movie follows a group of elite Gamers who are called up to try out a new virtual reality experience. When things quickly take a sinister turn, are the best-of-the-best good enough to finish the game?<br><br>I enjoyed The Call Up as I quickly became engaged with the characters. The acting was solid and the special effects were spot on. It takes you to the next level of game-play and makes you think about what we actually do in games when we're blowing each others heads off. There is a kind of predictability of sorts, but that would be nigh on impossible for this not to be the case and it's not as if the entire story is wide open.<br><br>The ending was a bit of an anticlimax, but in actual fact, this probably is a good thing given the mood of the movie.<br><br>I did enjoy the movie and would recommend it to any Gamers or avid movie watchers. It's never going to be a blockbuster or total crowd pleaser, but I didn't feel I'd wasted time by watching it (how I judge most movies) and I wouldn't be averse to watching it again. If you don't find the prospect of virtual reality intriguing or feel like gaming is for kids, then probably best to give this one a wide berth.","user":"jaffa_cake-47439","rank":[42,52]},{"title":"Nothing exceptional, but actually decent.","rating":7,"date":"3 July 2016","review":"I really don't get why some people hate this movie so much. The actors are pretty decent for this kind of movie and while you sometime think the characters are being plain stupid, i'd be willing to bet if it happened for real, it would be worse, regular people in life or death situation are scared and dumb.<br><br>The character development could be better, but there's enough of it to get the story going, there's the scared youngster, the good guy, the hopeless nerd, the jerk, the ex-soldier... sure it doesn't go real deep into details, but you get a pretty good sense of the kind of people they are.<br><br>The plot is interesting, the cgi is good enough, there's plenty of AAA movies that did way worse out there and incoming (supposedly scary cartoony looking neon ghost anyone?). <br><br>So yeah, 7/10 for me, i liked it.","user":"Callista_CM","rank":[36,44]},{"title":"Solid action film with a sci-fi premise","rating":6,"date":"3 August 2016","review":"I love sci-fi that explores the human impact of developments in technology and the premise for The Call-Up promises plenty of that. How do different personalities react when they realise that the VR game they've been invited to participate in is more sinister than it first appeared? <br><br>Although this central dilemma is prominent in the first part of the film, once the plot gets going, the action leads and the pace keeps you engaged as the characters are forced to learn quickly and figure out whether to work together or turn against each other. The way that the film's perspective mirrors that of the protagonists as they switch between 'real' and 'virtual' is impressive and compelling to watch.<br><br>I would have liked to see a bit more focus on the psychology of the premise, but with a concept of this scope, there's only so much you can cover, and the action-movie elements win out. The effects are impressive for a low-budget debut and I found the acting convincing, although there isn't much nuance to the characters.<br><br>Worth a watch if you enjoy action films that make you think.","user":"ruthmarybennett","rank":[32,40]}]