[{"title":"Well written Sci-Fi Thriller for those who like to think.","rating":9,"date":"24 February 2019","review":"Nicely paced reveals without actually giving any end-game full answers. Was really pleased with this. I'm not a horror fan, but a huge thriller buff and I appreciate tension, build, mystery, more tension, some nail biting, tossing in questioning of reality, and deeper meaning layered into the context.\nYeah, some of the free-will questions are spoon-fed, but there are other western family/religion and political ideals being questioned as well.\nThere is one quote in the film that really put the entire thing in a nutshell, but I don't want to give anything away.\nIt got incredibly high rating everywhere I've looked except IMDb, so was suprised at 6.5 here. I assume its from people expecting a horror and being given a Sci-fi philosophical thriller and being miffed about it.","user":"piratefemme-144-400028","rank":[18,19]},{"title":"A gem of a sci fi thriller","rating":8,"date":"19 October 2019","review":"What a great little gem!\nI've watched this film three times - something I very rarely do.\nWhat I value the most about this film is the story line. The story is tight, and simple, and clever, which is a lot more than what I can say about many mainstream sci fi blockbusters.\nThey probably deserve even better rating, given the limited budget they had to work with, in order to get this result. Good work!","user":"knhu","rank":[15,16]},{"title":"Different and interesting","rating":7,"date":"19 September 2018","review":"There are no cut and dried answers here, just a mystery and a happening that defies logic but makes you feel that it just might happen somewhere unknown to anyone. What is really happening at this cult, why are some people behaving so strangely, what is the past that has pulled the two brothers back to make sense of it all.<br><br>I liked the movie, the acting and the flow is good and the tempo maintained till the end. The theme of living life in a loop where one day is very much like the other is intriguing but the possibility that some alien intelligence is making it happen leaving no way to escape such a fate seems a little depressing.<br><br>But finally it is a different movie, well made and so different than the standard SciFi genre that it is worth a watch.","user":"askanade","rank":[77,96]}]