[{"title":"Best Movie in a long time...","rating":9,"date":"24 December 2015","review":"I watched it yesterday and I kept my expectations rather high, because the main theme of the movie and the way it shapes politics concerns me in a direct manner. It was even better than I expected it. The script is extremely interesting, especially if you like movies that have to do with the society and politics. I daresay it depicted my country, Greece, as it is in reality. With both its breathtaking beauty and its ugliness. What mostly enthralled me though, was the directing and the photography. On the whole, it was a movie that captivated you frame by frame. The acting was another surprise, although it should not have been, with such an impressive casting. Niki Vakali and Tawfeek Barhom were two names, which I am going to remember and watch over from right on. Andrea Osvart was pleasantly fitting to her role, like it was written for her. JK Simmons and Maria Kavogianni amazed me with the natural innocence of their romance. There was chemistry and simultaneously their acting was enviable. And, lastly, Christopher Papakaliatis has to be congratulated, because he did not only direct and write the film, but he also gave a fairly good performance.","user":"catherinegreece","rank":[46,81]},{"title":"A pompous, masturbatory mess of a movie","rating":2,"date":"5 January 2016","review":"I was convinced by friends to watch this film, after complaining about its being over-hyped and over-advertised. I hoped that, at least, with the resources and critics' praise lavished upon its creator, I would see a decent, if not overwhelming film. The result was not what I expected. It was far worse. <br><br>Papakalliatis is definitely not the multitalented cinema renaissance man. He is a handsome guy, true, but he's, at best, a mediocre actor. There are a few moments of passable film direction sprinkled about, but that's about it. As a script writer, he is heavy-handed, preachy and overloads his script with exposition and pseudo-philosophical ramblings. He tries to act smart and pose as a master of symbolism, but, in his heavy and clumsy hands, symbolism is crushed to mere pretentiousness. He dishes out drama with a heavy hand, ending up with ludicrous grotesqueness. The stories, especially the first romance between the Syrian immigrant (groomed up to feel less threatening to his audience) and the daughter of the jilted old man feel rushed and incomplete. The romance of the Greek white collar worker, played by mr. Papakalliatis himself, is the self-satisfied romp , together with the classic Papakalliatis unnecessarily explicit and self-voyeuristic sex scene that we all love to hate. Only the last romance gave me a few breaths of fresh air, with moments of genuine tenderness and sensitivity, probably due to J.K Simmons' incongruously good presence. But in total, this movie is a mess made by a creator who has an overly high opinion of himself and lacks the skills to support it.","user":"angie-karagounaki","rank":[45,89]},{"title":"This is a thought-provoking movie!","rating":10,"date":"19 December 2015","review":"Go to watch this movie if you like thinking outside the box, if you like exploring different characters, if you are not fully uncomfortable challenging stereotypes. The plot is highly realistic with a good pace from scene to scene throughout the movie. There is a balance between positive and negative aspects of life. The main characters developed by Christoforos Papakaliatis seem to be able to distinguish good from bad but are not always able to follow the pathway of compassion. Understanding an individual of another nation seems to be an extremely difficult task especially if you are not in love with him or her. Apart from the plot, three different ones to be specific, that meet towards the end of the movie; acting was realistic and photography was great. The movie kept you wanting to find more about the characters while politics and how it shapes peoples lives was kept at the background through the movie. This is a great balanced movie!","user":"viliad","rank":[36,74]}]