[{"title":"Don't you believe it ...","rating":1,"date":"12 July 2019","review":"Must agree with gpsychos2-239-278464.\nI decided to watch it and found it crap.<br><br>For these \"viewers\" who are rating this film 9 or 10 stars, click on their name to see this is the ONLY film they've reviewed. gpsychos is correct. It's staff, actors, workers, and then some who were part of the production of the film.<br><br>Very very disappointing a film company would resort to such underhanded tactics.","user":"dw8177","rank":[10,10]},{"title":"Q: How-to tell if a movie is bad?? A: Keep reading","rating":1,"date":"12 March 2019","review":"Theres always a sign. Some are subtle. Others such as the one we are going to talk about are not. When a movie is new like this the \"Star\" rating is usually worthless. Most people involved with the production actors,directors,extras,family members and basically every single person associated will have dropped by and dumped an 8-10 star rating just to help promote it. So when you see under 100 ratings barely breaking 4 stars total means anyone involved got as far away from this film as fast as the time it takes to yell \"cut\". They didnt brag about it, mention they were involved or tell family and close friends to watch it and give them a good rating. Even knowing that i still took a chance and watched it based on the trailer. Dont make my mistake and think theres any redeeming qualities to this film. There isnt.Im not even going to list why because the film isnt worth anymore of my time. I only do this to warn others away and hopefully save someone from the visual and auditory torture I went thru lol","user":"gpsychos2-239-278464","rank":[35,47]},{"title":"I would rather have a hot sauce enema than EVER watch this again.","rating":1,"date":"12 January 2020","review":"This film was a steaming pile of filth.<br><br>The writing was absolute garbage and the script was further abused by the absolutely horrible acting. I've seen better performances from third grades at a Christmas pageant.<br><br>If the director, writer, and producers had tied me to a chair and smashed my toes into a pulp with hammers for 84 minutes I would probably hate them less than I do now.","user":"DarlingLlama","rank":[4,4]}]