[{"title":"From The Life Animated Generation","rating":7,"date":"14 April 2017","review":"I'm an autistic Disney fan and I like this film.<br><br>Finally a positive portrayal of autism and animation. I was also one of the lucky ones:awesome family (grew up with two older sisters), love of Disney and non-Disney cartoons, etc.<br><br>Only problems are the sex talk (understand why he would struggle over this as I prefer to be single myself and no, don't suggest Disney porn!).<br><br>As for sidekicks: Nick Wilde from Zootopia, Kronk from The Emporer's New Groove, Baymax from Big Hero 6 (deadpan minimalist extraordinaire), Vinny from Atlantis:The Lost Empire and BEN from Treasure Planet (Owen got Lucky Jack from Home on the Range)<br><br>And my villain would be named Fuzzbutcher (grown up version of Fuzzbutch as I also suffered from OCD).<br><br>Also, read the book too.","user":"cmomman1988","rank":[11,12]},{"title":"Struggling with ‪‎autism‬, hope is found in ‪‎Disney‬ animated films in 'Life, Animated'","rating":8,"date":"27 January 2016","review":"Director Roger Ross Williams shed light on the African evangelical invasion in 'God Loves Uganda'. Openly admitting he needed to do something a little more light-hearted for his next film, his latest documentary, 'Life, Animated', is an entirely different project.<br><br>At the age of 3, Owen Suskind completely shut off from the world and became unable to communicate. His parents soon discovered that he had autism and may never be able to speak again, heartbroken at the thought of how the relationship with their son they had dreamed of may never fully exist. After trying many tactics with professional help, suddenly Owen became able to communicate through Disney animated movies. The exaggerated character movements and expressions became a tool for Owen to learn his language skills and be able to communicate his emotions. Through the trials of growing up, Owen used scenes and moments from Disney movies, such as 'Aladdin', 'The Jungle Book', and 'The Little Mermaid' to gain an understanding of how to express himself in situations he will experience. It's a touching and at times comedic success story.<br><br>Now at the age of 23, Owen is an incredible human being and a banner example of someone who has gone far beyond what people expect from a person with a severe disability. While the film does take a little long to get the momentum going, Owen's story quickly becomes extremely compelling. What makes his story so interesting is that as a 23-year-old he is going through a lot of the same situations that anyone experiences: finishing school, moving away from home, relationships, etc. How he goes about it is entirely different, and takes a few more steps, but the general trajectory is entirely universal.<br><br>The Disney element of the story serves as a gateway for us to gain a better understanding of autism and those affected by it, similar to how Disney has helped Owen to understand the rest of the world. The filmmakers follow Owen through numerous obstacles he faces in life which serve as the primary source of drama. Fortunately, he is such an engaging and charismatic protagonist that his life events are heart-warming and at times hilarious as well. The film successfully widens the understanding of an often mysterious mental state that so many people are affected by. Occasionally, top-tier documentaries can forgo the need to deliver a major message or inspire societal change in exchange for telling us a great human story, and giving us a broader understanding of the human condition: 'Life, Animated' is such a film.<br><br>For more, visit: www.cinemacy.com","user":"cinemacy","rank":[21,26]},{"title":"So glad I watched this","rating":10,"date":"18 February 2017","review":"One of the best documentaries I've seen. I had a clue what what was going on in my brother's mind, but this made it so much more relatable. As if we really know what goes on in anyone else's mind, because we're all so completely unique. Every person is shaped by their experiences, and what this family did when nature struck their child an unexpected blow is inspirational. What Owen did for himself leaves me beyond words. \"Who decides what a meaningful life is?\" Best line ever. As if any of us are \"normal\" or \"better,\" just because we don't have a noticeable or diagnosed \"defect.\" I think my brother is hands down one of the best people I've ever known.﻿","user":"adiadv1","rank":[10,12]}]