[{"title":"Meh. If you're not into corny....or sad","rating":3,"date":"26 July 2017","review":"Okay, when I first saw this summary I thought maybe I could relate. Being a city girl, it seemed cute that a boy would go after her. However, the summary and the actual story line don't seem to match up. This is about a struggling singer trying to get her big break and about a guy who has experienced a lot in his life. And the main girl on the cover is barely even in the movie, I was so confused about that. <br><br>Anyway, after realizing that this is a musical I kinda chuckled a lot. It just didn't give me that musical vibe from the first 5 minutes then bam, the brother is breaking into song. <br><br>As for the acting, it could definitely be better, but the voices are killer. I actually bought some songs as a result of watching the movie. If these actors were as good at acting as they are singing, we'd have a gold mind right here. <br><br>I actually recommended it to a friend, if you like cheesy movies then you'll def love this.","user":"vrlayer","rank":[6,6]},{"title":"Our review","rating":8,"date":"8 August 2018","review":"We were so excited to watch this movie and it was absolutely not what we expected. Complete waste of time but mama aint raise no quitter so had to finish watching. The character of Nancy was strong in the very beginning and then idek not a very strong review writer but... Very disappointing movie.","user":"owensaretha","rank":[4,4]},{"title":"An original film and I wanted to like it","rating":3,"date":"6 August 2018","review":"I wanted to like this movie but aspects are plain ridiculous like singing at the gravesite, the orange faces, and the leads having no chemistry and being so mismatched - oh my....... Good Soldier films has a long way to go before they are a professional outfit..... I guess we all have to start somewhere and at least here there are unique and interesting ideas and are adding a fresh enthusiastic perspective. ......","user":"skpn123","rank":[4,4]}]