[{"title":"Katie Holmes will make her mark as Director...but","rating":2,"date":"30 April 2016","review":"This adaptation lacks the depth and solemnity of the source material, Annie Weatherwax's novel of the same title. The opening scenes introduce viewers into the story establishing the main theme of the film of an addict who is trying to make a better life for her 14-year-old daughter but the plot rapidly gets boring. Despite the mediocre screenplay, Katie Holmes delivers as Director and actress; Stefania Owen who plays Rita Carmichael (Holmes) daughter Ruthie also delivers a strong performance. Overall this movie proves that Holmes will be able to make her mark as Director with screenplays worthy to make into a film, unfortunately the screenplay of this movie ruined what could have been a great drama.","user":"edv-57309","rank":[29,43]},{"title":"Excellent.","rating":9,"date":"24 July 2017","review":"Well, I haven't read the novel...yet. I just watched the movie as I always do, patiently, and I can tell you the acting was great, really top notch from everyone. I don't care how many movies shared a similar plot, I can tell you for sure this one was done right. It's true it's a bit slow at times, but it's understandable. A movie for people who can still feel with their heart, not with stupid super-heroes, not with cgi or something which nowadays appear way too often in movies. For an indie debut movie, excellent.","user":"zaethermind","rank":[7,9]},{"title":"The Right Ending Can Make the Whole Story Fall Into Place","rating":8,"date":"1 July 2017","review":"Rita (Katie Holmes) is a poor judge of character. She cares for her 14 year old daughter Ruthie (Stefania LaVie Owen) as they live on the road out of their dying car. Circumstances make it easy for them to stay in one place for a while, as she makes he life more complicated than it needs be and not trusting those who would help her. Eve Lindley plays a sympathetic cross dresser waitress who befriends Ruthie.<br><br>The film is a basic drama about life and the folks who live at the bottom. Well directed. Well acted. Slightly emotional, but not a heavy tear-jerker.<br><br>Guide: F-word. Sex. No nudity.","user":"mikeledo","rank":[3,3]}]