[{"title":"Go Go Technodrome.","rating":6,"date":"14 October 2016","review":"Mindless, superhero, brain candy, zoom. Bad jokes, great effects, explosions go boom.<br><br>My neck muscles are tighter than piano wires and I've sweated enough this week to fill a swimming pool. At the end of a long week of mad work, sometimes you just want to sit down and switch off your brain.<br><br>So, thank you, turtles. I like it when you hit stuff.<br><br>Is this a dumb movie? The obvious answer is yes, of course it's dumb, it's more superhero schlock: kiddie-fare enjoyed by 30-somethings.<br><br>But I don't know. Any fight scene with martial arts is a bit like a magician's sleight of hand. It's too fast to follow completely, but if done well we can see sophistication in the movement, and a fight is a bit of a story in itself. There's the setup, escalation of conflict, then boom, resolution. The best parts of this movie are not of the turtles talking but when things go all smashy-smash-smash. Smash.<br><br>Smash.<br><br>Where the film drags is with its human characters, who have way too much screen time. Casey Jones is a 30-something who talks like a 12-year-old (\"Someday, I'm going to be a detective!\") and Shredder, regrettably, is mostly without his mask and doesn't throw a single pie. Megan Fox is wearing less makeup this time around, but in \"acting,\" less is more. Baxter Stockman is likable, but doesn't turn into a giant fly.<br><br>But it's inoffensive, fun to look at, and a nice thing to shut your brain off to while recovering from a long week of sweaty haste.","user":"thisseatofmars","rank":[29,32]},{"title":"TMNT 2 Out of the Shadows honors the \"cartoon spirit\"","rating":8,"date":"5 June 2016","review":"TMNT 2 is silly and flamboyant enough to work as a live-action cartoon movie. It embraces its crazy plot (the story operates in a world where mutant turtles have been taught martial arts by a mutant rat, 'nuff said). However, the film suffers a lot of what we can call \"convenient circumstances\" — unaddressed plot holes are deliberately ignored by forgetting events and characters being conveniently placed at locations to advance the plot without explanation whatsoever. Also, it may be nitpicking but there's no attempt to explain how these turtles become experts in crafting CIA-level tech.<br><br>The level of humor in this film is clearly catered to a young audience. For adults, you may get a healthy dose of nostalgia if you were once that kid who were really into the cartoons, otherwise you'll find the script stale. The fun interactions between the brothers are still present but what gives them more depth here is when they start to experience teenage anxiety – issues of belonging and identity. I'm keeping it vague so as not to spoil anything, but yes, they actually have a subplot this time! Sadly, things aren't sustained as the film rushes through, ending it in favor of a big climactic action sequence.<br><br>Speaking of action sequences, the movie never strays away from the basic Michael Bay blockbuster formula (he's the producer, of course): over-the-top CGI-heavy destruction, one action set piece after another. If the first TMNT movie offers a fun-filled chase down a snowy mountain, the most adrenaline-pumping action sequence here starts with skydiving and ends with a waterfall jump. The film also takes the liberty in ripping-off previous blockbusters – a retrofitted garbage-slash-war truck (Mad Max), a via inter-dimensional sky portal alien invasion (The Avengers) and a police car chase/prisoner escape scene (The Dark Knight and Fast and Furious). And as if to acknowledge the debt, Raphael mutters to himself, \"What would Vin Diesel do?\"<br><br>Remarkably, there is an improvement in the CGI department, more specifically with the look of the ninja turtles – less gritty, more friendly-looking. The voice actors are not to be faulted in giving better distinction to their characters' personalities –the leader (Leo), the muscle (Raph), the brains (Donnie) and the wild one (Mikey). And just to make sure that viewers won't be confused again, they are re-introduced twice in the film (which is odd). Megan Fox, as the main human protagonist, however still fails in-I can't believe I'm about to say this- effectively engaging the audience. She fares better as an anti-hero or villain (Jennifer's Body). Her sex appeal is even pushed to a breaking point during an inexplicable costume change scene to a sexy school-girl outfit to keep the males awake. Will Arnett's character Vern, sidelined as an comic-relief is a good choice for he does little to advance the plot. Stephen Amell obviously got the role of Casey Jones due to his physical work in \"Arrow\" and the fact that they needed someone equally attractive as Fox. He does his best, especially in action scenes, but him joining forces with the turtles is rushed and poorly done. Shredder, recast with Brian Tee, returns as a human and not some sort of a transformer is still lackluster as a villain. Super-villain Krang who looks hideous and remotely realistic could've better served with a more fleshed-out backstory. Of all the villains, arguably the comical mutant duo, Bebop and Rocksteady, steal the show.<br><br>There is no doubt that Teenage Mutant Ninja Turtles: Out of the Shadows is better in nearly every way than its predecessor. It is turtle-focused and it re-wires the franchise to the right direction. I am not all \"Cowabunga!\" for this sequel (the plot still rots my brains), but if you're looking for two hours of frothy entertainment and 'Bay'-esque action sequences are your guilty pleasure, bring some pizzas because you're in to a one (s)hell of a ride.<br><br>Full review: http://goo.gl/xoNRno","user":"kevin_newdirections","rank":[74,108]},{"title":"A Stupid Cash Grab","rating":3,"date":"14 December 2017","review":"Whatever initial arguable charm the first reboot had has vanished. Think Transformers with Turtles. The plot: who cares? It really doesn't matter as of course there ends up being a threat to the whole planet, ubiquitous car chase scenes, a couple close combat turtle fights and of course they manufacture a way to get Megan Fox into a mini skirt. As was proclaimed in Sandler's Billy Madison, I am now dumber having watched this.","user":"iquine","rank":[15,20]}]