[{"title":"Best Netflix's Live Action So Far","rating":7,"date":"22 October 2018","review":"The adaptation of Mamoru Oshii's \"Jin-Roh\" of 1999 is quite good, it retains the essence of the original animation film directed by Hiroyuki Okiura. I highly recommend this film for action lovers, asian cinema enthusiats. The movie doesn't deviate that much from a possible reality of a reunified north and south korea. The acting is decent, the effects and suits are quite good and the plot flows smootly until the end. Anyone that has seen the original master piece before would find dissapointement in the last 15 min. The raw and \"bestial\" ending was changed for a more \"humane\" one. If they had kept the original ending that preserved the nature of the main quote, I would have easily given it a 9/10.","user":"josevacis","rank":[21,26]},{"title":"Much better than I thought.","rating":8,"date":"22 October 2018","review":"It seems the movie didn't work well in Korea, and I remember watching the Jin roh animé as a kid and didn't like it that much. However I really enjoyed this movie, yeah the romance part might a bit long but also has some purpose in building the final climax. I liked the quality of the movie action scene, simple and without CG. A really good action movie with an intriguing setup. I felt entertained.","user":"minatotomodachi","rank":[9,11]},{"title":"I've been waiting almost 20 years for this and thankfully it was not a whitewashed Hollywood disaster!","rating":9,"date":"19 October 2018","review":"Being a huge Kerberos fan (went as far as spending two whole month salaries to buy a full size set of armor back in the day) my expectations were really high\nYes they've changed the setting but it's almost a shot to shot homage to Jin Roh in some parts, when Grace Omega started playing I immediately got frisson!\nIf you're a fan of the saga you'll enjoy every single minute of this, even though someone could dislike the alternative finale...","user":"purifier-1","rank":[31,47]}]