[{"title":"I really wanted to hate it!","rating":6,"date":"17 July 2018","review":"Watching Mary Shelley was a curious experience. I knew I should hate it, because, although it gets many of the facts right, it gets a massive amount wrong, and thematically, it's a mess. As an English academic by trade, it really should have irritated me no end. Additionally, pretty much everyone I know who has seen it (both academics and non) have loathed it. And I found it very difficult to disagree with any of the criticisms they had. The film is, in places, laughably bad. But for all that, whilst I most certainly didn't love it, nor did I hate it. In fact, I actually liked quite a bit of it. I'm ashamed!<br><br>Okay. Let's get the basics out of the way. Directed by <a href=\"/name/nm2223783/\">Haifaa Al-Mansour</a> and written by <a href=\"/name/nm3667303/\">Emma Jensen</a> (Al-Mansour is credited with \"additional writing\"), the film bills itself as the true story behind the composition of Mary Shelley's (<a href=\"/name/nm1102577/\">Elle Fanning</a>) first (and best) novel, Frankenstein; or, The Modern Prometheus (1818), with the poster proclaiming, \"Her greatest love inspired her darkest creation\". This is essentially false advertising; of the two hour run-time, the writing of the novel takes up roughly twenty minutes of the last half hour. Instead, the film is a fairly insipid love story, beginning shortly before the first meeting of Mary Wollstonecraft Godwin and Percy Bysshe Shelley (<a href=\"/name/nm3150488/\">Douglas Booth</a>) in 1812, and culminating in 1819, after the initial anonymous publication of Frankenstein.<br><br>As a love story, the film's main focus is, obviously, the ebb and flow of the relationship between Mary and Shelley. With this as the organising principle, and Mary herself as the lynch-pin to the whole endeavour, many of the main events in those seven years are covered; Mary's stay in Scotland with William Baxter (<a href=\"/name/nm9494455/\">Owen Richards</a>), where she first met Shelley; her difficult relationship with her father, William Godwin (<a href=\"/name/nm0226820/\">Stephen Dillane</a>); Shelley's unexpected arrival in London at Godwin's invitation; the collapse of Shelley's marriage to Harriet Westbrook (<a href=\"/name/nm7194496/\">Ciara Charteris</a>); the antagonism between Mary and her stepmother, Mary Jane Clairmont (<a href=\"/name/nm0296219/\">Joanne Froggatt</a>); Mary's attempts to escape the shadow cast by her deceased mother, Mary Wollstonecraft, author of the mildly influential A Vindication of the Rights of Woman: with Strictures on Political and Moral Subjects (1792); her close friendship with her stepsister, Claire Clairmont (<a href=\"/name/nm2525790/\">Bel Powley</a>); the elopement of Mary, Claire, and Shelley, and their constant struggle with debt; Shelley's concepts of \"free love\"; the death of Mary and Shelley's first child; the summer of 1816 in Geneva, when she and Shelly stayed with the \"mad, bad, and dangerous to know\" (to quote Lady Caroline Lamb's famous description) Lord Byron (<a href=\"/name/nm0836432/\">Tom Sturridge</a>); Mary's friendship with Dr. John Polidori (<a href=\"/name/nm5228887/\">Ben Hardy</a>) and the tragedy concerning his short story, \"The Vampyre: A Tale\" (1819); and, ultimately, Mary's composition of Frankenstein.<br><br>The overarching A-B-C is all present and accounted for, but, within that reasonably accurate framework, there are a huge number of omissions, inaccuracies, and unwelcome interpolations. For everything the film gets right, it gets so much more wrong. For example, although it correctly shows that Shelley was of the opinion that Mary and Thomas Hogg (<a href=\"/name/nm2524113/\">Jack Hickey</a>) should become lovers, it fails to acknowledge that Mary herself wasn't entirely opposed to the idea, and was actually good friends with Hogg, whom she often confided in. Upon the death of her first child, she wrote to Hogg, \"My dearest Hogg my baby is dead-will you come to see me as soon as you can. I wish to see you-It was perfectly well when I went to bed - I awoke in the night to give it suck it appeared to be sleeping so quietly that I would not awake it. It was dead then, but we did not find that out till morning - from its appearance it evidently died of convulsions - Will you come - you are so calm a creature &amp; Shelley is afraid of a fever from the milk - for I am no longer a mother now.\" In the film, Hogg is a lech who tries to force himself on Mary. The film also gets it right that Shelley and Mary first expressed their love for one another at her mother's grave, but it shies away from what many scholars believe; that Mary lost her virginity to Shelley on or near the grave. Instead, the film features a dreadful cliched sex scene in a bedroom bathed in firelight. More romantic? Probably. Historically accurate? Almost certainly not. Another point that's presented fairly accurately is the poor living conditions after Mary, Shelley, and Claire elope, and the fact that they were constantly in debt and frequently had to flee their lodgings in the middle of the night. However, the film fails to depict or even hint at the fact that Shelley and Claire were, for a time, lovers. Finally, although the film correctly depicts many of the details of the summer of 1816, it neglects to show that Mary was taking large quantities of laudanum for pretty much the entire time she was in Geneva.<br><br>Regarding the performances, first we have Tom Sturridge as Byron. Good lord in heaven! Again the film gets the basics right - Byron was notoriously lavish, flamboyant, and fickle, living a life of excess, even for a Romantic poet, and well known for using and discarding women, and, on occasion, men. However, Sturridge's performance is a thing to behold. He has always tended towards overacting, but his performance here makes <a href=\"/name/nm0000199/\">Al Pacino</a>'s work in <a href=\"/title/tt0115907/\">City Hall (1996)</a> look positively catatonic. It's just laughable how bad he is in the role, turning Byron into a cartoon character. Stephen Dillane's Godwin is also problematic. Dillane is an immense actor with an extraordinary range (compare his performances in <a href=\"/title/tt0349683/\">King Arthur (2004)</a>, <a href=\"/title/tt0944947/\">Game of Thrones (2011)</a>, and <a href=\"/title/tt2240991/\">A Touch of Cloth (2012)</a>), but he plays Godwin identically to how he played Leonard Woolf in <a href=\"/title/tt0274558/\">The Hours (2002)</a> - a put-upon, buttoned down intellectual, trying not to offend anyone, talented in his own right, but living in the shadow of the greater talents of people he loves. Jane Froggatt plays Clairmont as a wicked stepmother straight out of Disney, with no depth to the character whatsoever. A lot of reviews have heavily criticised Fanning's work as Mary, but I thought she was okay in the role. Not spectacular, but not as bad as I expected. Her accent isn't too bad either (and certainly better than <a href=\"/name/nm3586035/\">Maisie Williams</a>'s ridiculous Scottish brogue). However, one can't help but wonder what <a href=\"/name/nm1519680/\">Saoirse Ronan</a> would have done in the role, had she chosen to do Mary Shelley instead of <a href=\"/title/tt2328900/\">Mary Queen of Scots (2018)</a>.<br><br>However, easily the biggest problem with the film, and the one that most of my colleagues and friends have trashed with the most fervour, is the script. First of all, it tries to cover too much, and instead of saying a lot about a few events, it says little of interest about a lot of events. But its biggest flaw is that it reduces one of the greatest love affairs of all time to a series of ridiculous and repetitive petty squabbles that wouldn't be out of place in an episode of <a href=\"/title/tt0088512/\">EastEnders (1985)</a>. The film is at pains to impart how empyrean Mary is, presenting her as a character whose soul is infused with the poetry of an era. However, when depicting her squabbles with Shelley, she's reduced to little more than a cipher for her beliefs, as is he in relation to his. As they literally have the exact same argument about five times in the film, and each time, because their characters have been reasonably well defined, that fact that they're arguing about things that they are well aware of makes the whole thing seem ludicrous; it's all about his free love and failure to provide for Mary clashing with her protofeminism and political sensibility. The film essentially gives us a CliffsNotes summary of some of the key texts of the day, including Godwin's An Enquiry Concerning Political Justice, and its Influence on Morals and Happiness (1793), but it completely fails to provide a solid political or philosophical context, with both Mary and Shelley seemingly existing in some kind of intellectual bubble of their own creation. Lastly, the attempt to link passages from Frankenstein to specific events in Mary's life via flashbacks, is horrendous; poorly conceived, and just as poorly executed.<br><br>However, for all that, I can't hate it. Al-Mansour (the first woman from Saudi Arabia to direct a Hollywood funded movie) directs the film confidently and competently. The period detail is excellent. <a href=\"/name/nm0912396/\">Amelia Warner</a>'s score is rousing in places, <a href=\"/name/nm2518642/\">Caroline Koener</a>'s costumes are well designed, <a href=\"/name/nm1156431/\">Paki Smith</a>'s production design is impressively detailed, and <a href=\"/name/nm0881104/\">David Ungaro</a>'s cinematography is suitably gritty. There are also some fine performances; Booth is pitch-perfect as a frustrated and free-thinking Shelley, and Ben Hardy is superb as Polidori, whose tragedy is unfortunately glossed over far too quickly.<br><br>So, with all that said, it's not a film I'd recommend unreservedly, but it's not something I'd warn people not to see. In fact, one of the questions I had after watching it was who was it made for; who was the target audience? Academics and people familiar with the events will almost universally hate it, whilst a more mainstream audience used to superhero movies and explosions will find it boring beyond belief. A very curious experience!","user":"Bertaut","rank":[126,149]},{"title":"A GOTHIC TALE OF A WRETCHED LIFE LIVED TO CREATE A MASTERPIECE","rating":9,"date":"10 June 2018","review":"I always make the time to read IMDB's user reviews before I waste my time on a movie. For some reason I decided not to on this evening, as I was eternally bored with my own existence. The experience of watching Mary Shelley has made me reconsider my tactic of choosing movies based on user reviews, as we all have such diverse taste in an artists work, we should not let the audiences opinions hold too much merit over our own taste. I enjoyed the movie from start to end, and the actors did a wonderful job at the portrayal of their characters. I have taken the time to dive to deep into Mary Shelley's life story, so I do not know how true this story is to her life, but the movie did manage to keep my attention for just over two hours and entertained me over the course of that time. I must say this movie managed to spark a deep interest in me for the young author of Frankenstein, and I shall now proceed to do more research on the infamous Mary Shelley.","user":"marhashams","rank":[63,80]},{"title":"a deliciously Gothic tale of the tempestuous life behind Frankenstein","rating":8,"date":"19 November 2017","review":"It will surprise some people to know that the first science fiction novel Frankenstein: A Modern Prometheus (1818) was written by the 18-year-old wife of celebrated poet Percy Bysshe Shelley. This literary classic was the product of a restlessly creative mind, emotional turbulence and stifling Georgian social pressures. All of it is captured by the sumptuously filmed historical bio-pic Mary Shelley (2017) which tells the story of a romantic rebel and literary feminist who spoke for her times.<br><br>The simple plot line is saturated with the tropes of feminist melodrama. An avid reader of ghost stories, the precocious Mary (Elle Fanning) was raised by author William Godwin (Stephen Dillane) after her mother, the feminist writer Mary Wollstonecraft, died soon after Mary's birth. Encouraged to find her own writing voice, she spends her time turning her imagination into private stories until the day she is swept off her feet by the dashingly handsome Percy Shelley (Douglas Booth). As Percy is already married, scandal follows and they are cut off by their families. They run away and live happily in bohemian squalor until Mary loses her own child and Percy has an affair with her half- sister. When challenged by the decadent poet Lord Byron to write a ghost story, she draws upon her experience of abandonment, her fascination with mortality, and her tempestuous relationship with Percy to write and publish the immediately popular Frankenstein.<br><br>Successful bio-pics of great literary figures are generally character studies more than plot-driven narratives. From a literary history viewpoint, the film's greatest achievement is in showing how Dr Victor Frankenstein's destructive monster was itself the embodiment of Mary's emotional world. The story is powered entirely by Elle Fanning's brilliant performance. With an extraordinary expressive range for a young actress, she can transform herself from pain and anguish to romantic ecstasy with a simple transcendent smile that jumps off the screen. Douglass Booth is superb in his supporting role, playing the self-indulgent poet scoundrel to perfection. As you would expect with principal filming in Dublin, the sets are gorgeously authentic and the filming style deliciously Gothic.<br><br>Some critics have bemoaned the decision to introduce Frankenstein only towards the end of the film. To do otherwise would have turned the novel into the subject and lost the film's focus on the writer. There is great storytelling at work here: it balances period drama, feminist history, romance, and a portrait of creative genius, making this a film of many labels. It is also a satisfying psychological deconstruction of how a literary work can be a mirror of a writer's life.<br><br>More reviews https://cinemusefilms.com","user":"CineMuseFilms","rank":[81,111]}]