[{"title":"Starts out somewhat promising, quickly shows itself to be a Propaganda piece","rating":3,"date":"18 July 2016","review":"This starts out well enough, shedding some light on the fact that some people are raised in unstable environments, lack of father figure/abuse, which can have a very negative emotional/mental impact on growing boys. It also points out that bullying is a serious issue. These talking points should be explored further, as they are very fundamental to understanding how to help boys and men overcome detrimental upbringings. <br><br>Unfortunately, 5 minutes in, by declaring masculinity to be unnatural and inherently harmful, this film devolves into nothing but transparent propaganda. Manhood, being the catalyst for all of society's woes, is just the rejection of femininity, it asserts. In short, Feminine altogether good, masculine altogether bad. The documentary hammers this narrative from this point onward, so quickly turning from a noble and much welcomed exposition about childhood abuse and abandonment, along with it's outright negative effects of said children, into an incredibly condescending and nonsensical attempt to make masculinity out to be wholly damaging. <br><br>The film claims that masculinity is nothing but a social construct, designed to make boys and men afraid to speak, or to show emotion, which leads to lives of crime and violence. So never mind what proper science would have to say, only femininity exists, and we males who reject it are everything that is wrong with the world. Men and boys who come from broken homes and hostile environments are used to bolster the narrative that masculinity is indeed synonymous with hatred, violence, rape, murder... But this does not represent the vast majority of men, and I would bet that the vast majority of men have some masculine traits. <br><br>However, if it's proper statistical analysis and presentation, you may want to look somewhere else. The women who made this film claim that men and women are pretty much the same from a biological perspective, which you would once again have to disregard science as an effectual intellectual tool to believe such nonsense. Here's how they prove their claim. They draw two bell curve graphs side by side. The curves represent the overall positive/negative life experiences of pools of 50,000 men and 50,000 women, separately. The curves of both graphs are similar, as they obviously would be, as they are bell curves intended to present averages... Then they superimpose one on top of the other and... voila! Men and women are the same and everything they have said thus far is true. And they really expect you to believe this, with such preschool presentation and lack of any kind of logic or actual statistical analyses. Clichés and buzzwords are not evidence, either.<br><br>But people will believe them. Even when they use the 1 in 5 women are raped on campus stat, which has been proved to be entirely misleading. Just look it up. I would only urge you to think for yourselves. Even when they resurrect the decades old claim that video games and movies and toys are turning people into monsters... which has also been debunked time and time again throughout the years by honest research and proper statistical work, people will still believe them. Presenting lies in a tenderly manner does not make them truths.<br><br>There is just so much wrong here. Written directed and produced by women, unsurprisingly driven by feminism, this film is thoroughly erratic and lacks any kind of real evidence to support its claims about the nature of men. <br><br>As a young man who has always struggled with depression and father abandonment issues, I cannot recommend this film to those wanting to learn anything true or useful. In fact I find it deplorable that the women behind this get to so passively pretend like they are helping anyone, when they have to use misleading and outright false claims/statistics to lend their ideology any credence, at the expense of those who are suffering from mental illness no less. If this is all that can be offered to help those afflicted, then I'm afraid we've gained no ground on the subject of mental illness in boys and men. Although, I really do not believe that the point of this intended to really help anyone.<br><br>Those of you who already buy into today's feminist theories/talking points... well i'm sure that you will love it as it will reinforce your incredibly biased and skewed, one-sided perspective of the world. Coming from those who would use fear and misrepresentation to persuade others, whether done consciously or not, I find it incredibly ironic for the film to begin with a quote (half of one anyway) from George Orwell. So I will end my review with a better application.<br><br>\"The great enemy of clear language is insincerity. When there is a gap between one's real and one's declared aims, one turns, as it were, instinctively to long words and exhausted idioms, like a cuttlefish squirting out ink.\" - George Orwell","user":"joshuastewartp","rank":[61,97]},{"title":"Starts okay, goes superficial pretty quick.","rating":5,"date":"13 August 2017","review":"The documentary raises some valid points, but ends up very superficial. The downfall starts with blaming of superheroes and video games. The old stereotypes from the brainwashed boy are popping up, that are refuted in a lot of studies. Sure, media has influence, but the \"how\" and the \"how much\" only implied. The study it presents is from the 70ies and 80ies and hardly representative of the present state of psychology.<br><br>As such it feels the movie pushes a narrative. Some of the interviewed people offer only anecdotal reference and some just lack any credentials for the issues they discuss. At times it feels weirdly constructed, as with the vilification of porn segment. Even Philip Zimbardo only conjures the old outsider-stereotype and an extremely bold statement like \"violance against women is at epidemic proportions\" is not supported by any historical figures. Questionable feminist terms like \"rape culture\", \"entitlement\" and \"privilege\" are thrown around.<br><br>The main topic of this film is very important and current and at times it seems the film is highlighting the right issues. But ultimately it looses itself in general attack on anything that it perceives masculine. I wish it was more subtle in the approach and better researched and balanced.","user":"badoli","rank":[22,33]},{"title":"Easily Related To","rating":9,"date":"20 January 2016","review":"What does it mean to be a man, exactly? Why shouldn't boys cry? Why can't fathers share their emotions? Why are men allowed to communicate their anger towards others but not their love for their friends? Why are young men taught to view women as sexual conquests instead of people or friends? <br><br>Questions such as these lie at the heart of this documentary, which argues that our society's definition of masculinity is deeply flawed. This is done through a wide array of interviews and case studies. Though the film is clearly informed by feminist theory and an academic foundation, the case studies put a face on concepts and humanizes the ideas found in textbooks. It is an accessible and clear introduction to the fact that feminists care deeply about men's issues. I would strongly discourage people from avoiding the film simply because of this theoretical orientation, however. <br><br>I was able to easily relate to the narratives and case studies presented in the film. The process of socialization for boys is something I experienced first hand, and the film organizes things in an insightful and cogent way. Similarly, it does an excellent job of capturing when things begin to go off the rails. For instance, one of the experts that is interviewed notes that kindergarten boys are eager to talk and participate, while by sixth grade boys had become increasingly reticent. This reticence is, partly, because of an avoidance of being nerdy (weak, effeminate) in favor of projecting a tough \"I don't care, none of this effects me\" attitude. Example upon example is piled on to create a compelling diagnosis of a problem.<br><br>The primary issue of the film, or perhaps an area for future discussion or analysis, is that it does not explicitly broach how masculinity overlaps with race and class. It is portrayed, but not explicitly explored. There is some mention of how sexuality and masculinity are intrinsically connected, but those other axis of oppression are largely ignored. As a result the concept of masculinity used in this film might seem overgeneralized to viewers. Fortunately, the film wisely sticks to the most universal threads such as aggression, dominance, and control. <br><br>Just a final note: If you have read this film as attempting to demonize \"maleness,\" you've missed the point. It's about the performance of manhood, which is a matter of gender, not sex. Gender is highly malleable and varies across cultures in a variety of ways, and this movie highlights the possibility for change towards a more open and loving form of masculinity in the future. That is a fantastic message and I would encourage any men who find themselves feeling defensive or threatened by the contents of this film to really question why they feel that way. There is an enormous opportunity for self- introspection and growth in this film.","user":"drohucimup","rank":[48,89]}]