[{"title":"That eyeshadow is always on point.","rating":4,"date":"23 April 2019","review":"I fully appreciate the *look* of this movie, for starters. It's got the sheen of a late-60s/early-70s thriller mashed with an Italian giallo, minus all the blood and gore. It's very fab. And the performances, particularly by lead Samantha Robinson, are fantastic. Even the makeup deserves quite a bit of praise, it's so on point. Everything seems to be in place and just so, except for the plot. The surreal air that envelops the proceedings masks a fairly pedestrian plot, that of a witch who cast spells in order to find her true love, with the help of her cult, er, fellow witches, some of whom are routinely naked. Like I said, the movie has all the feel of a period piece, but there just isn't much there, and after a while the viewer may become as bored as I did. Which is unfortunate, given the level of effort and talent.","user":"dfranzen70","rank":[18,20]},{"title":"Cult Film - but for the wrong reasons?","rating":10,"date":"10 March 2017","review":"The biggest cult film in L.A. right now with sell-out shows and great word of mouth. Interestingly, many of the folks who like it most have misinterpreted its influences and what it is trying to do (more later). Caught it in 35mm at the American Cinematheque. It was shot on film and it has been lovingly created with a rich color palette for maximum visual impact. And, it's titular heroine is played by the extremely photogenic Samantha Robinson.<br><br>Director Anna Biller's attention to detail is such that she not only wrote, produced and directed it - but, also hand-made many of the items on screen. All of that would make for a fanatically detailed 20 minute short. Unfortunately, THE LOVE WITCH runs a full 120 minutes. The movie uses the horror genre to tell a modern feminist update on the old-fashioned 'Woman's picture'. It's so hyper-stylized that it has led to much confusion on the part of many of its most ardent admirers. Director Biller did a Q&amp;A afterwards and she adamantly and defiantly rejected the notion that she was inspired by the 60s and 70s exploitation pictures by folks like Radley Metzger, Joe Sarno, Russ Meyer etc. (although she did admit a certain fondness for Kenneth Anger; a friend of the family she noted) - exactly the filmmakers many of the films' admirers THINK that Biller is paying tribute to! Indeed, many of the viewers of the movie think it's a hip spoof of those pictures (I call these the 'titterers' who laugh knowingly at all the nods and tweaks of those old exploitation pictures).<br><br>Now, to be fair, Biller sends mixed messages. She claims LOVE WITCH is really a post-modernist update of Film Noir and Douglas Sirk's style glossy melodramas. Yet, her soundtrack is full of 60s Ennio Morricone type giallo and psychedelic lounge music - not the more old school Herrmann,Alfred Newman 40s and 50s style of scoring. And, all the nudity and explicit sexuality is much more 60s/70s exploitation than 50s MGM technicolor weepie. It's an odd combo. All of that is fine, if the film worked. Unfortunately, it becomes tedious long before the 120 minute end mark. Exacting attention to detail, a few clever feminist touches and some nice upending of clichés only go so far. And, the acting is so affected that you can't help but think it's parody (again, Biller says that was not her intent). The biggest drawback is Samantha Robinson in the lead. She is trying for a very tricky stylized throwback tone, but, she simply isn't a good enough actress to pull it off. She just comes off as stiff and stilted (you actually have to be a very good actor to pull off being so stylized in your performance). You have to believe that, in the end, Robinson was chosen more for her physical charms than for her acting ability (something Biller indirectly admitted to). It's also odd that such an underground effort still hews to mainstream cinema's tendency to have the 'stars' manage to remain partially clothed while the nameless background artists go full frontal nude (including a very noticeable breast pastie).<br><br>I don't want to come off as overly harsh. I appreciated the effort, and the 35mm film photography gives the film a certain patina that no digital counterpart could quite achieve. I just find it both odd, and a bit amusing, that the strongest members of the Love Witch Cult are loving it for the 'wrong' reasons -- according to it's own filmmaker!","user":"gortx","rank":[60,79]},{"title":"Drowning in Estrogen","rating":7,"date":"26 January 2018","review":"It´s been said, \"The Love Witch\" is technically brilliant. The imitation of older genre films is perfect. It´s not only the visuals, the scenery or the costumes, the sound design is just as good and every single character seems to be taken from another era. Even transitions from scene to scene are excellent. Anna Biller has a complete understanding of the movies she wants to emulate. It´s almost witchcraft.<br><br>From a feminist standpoint, it isnt´t subtle. I´m not sure if it should be taken entirely serious. I find it deceitully simple, though, and quite clever but it does at times seem taken from another era as well. The truth is i don´t get it completely. This film, feminist or not, is certainly feminine. The most feminine film I´ve ever seen. It´s a woman´s art, a woman´s idea, a woman´s everything. It´s absolutely drowning in estrogen.<br><br>The question is, if \"The Love Witch\" was actually a late 60s film would it be any good? I have no idea but I´m guessing it´s irrelevant. Revivalism is a crucial element. It uses older esthetics to prove a point now. The comedy works better in a 21st century context. It might be too long and slow, I´d recommend watching it in the morning, not a popular time to watch movies but a lot films work better that way, and this is definitely one of them.","user":"axapvov","rank":[26,34]}]