[{"title":"Claw Away Now","rating":1,"date":"4 November 2014","review":"A copycat movie with the same old Christmas theme. Starring 3 little kittens and a kid obsessed with a Christmas tree. Santa Claus is allergic to cats what an absurd plot. Lost interest 5 minutes into the movie, however writing this review to save others from boredom and ruining their Christmas spirit. There is no single sentence which makes you smile let alone go on a laugh riot. Please give it a miss ..... Horrendous effort even for a low budget movie. Christmas movies need to be fun this does not have any maybe a good movie for the feline fans who like to cuddle up with their pets when they watch it. Claw out your way around this movie ...!!!","user":"dhanesh555","rank":[18,23]},{"title":"So deliberately bad it's quite enjoyable","rating":6,"date":"21 December 2015","review":"In the tradition of Shaun of the Dead or Fido, the humour is campy and the effects deliberately annoying.<br><br>The cats are a wondrous mockery of those endless puppies-save-Christmas movies.<br><br>The kids universally can't act 'realistically' and the adults are B-move standards, but there are some wonderfully over-the-top freak-outs.<br><br>This is absolutely not a movie to be taken seriously, just to be enjoyed for its send-up of pretty much every Christmas movie trope out there.","user":"JaynaB","rank":[11,13]},{"title":"I disagree with the other reviews","rating":7,"date":"20 December 2014","review":"I think this movie was amazing. THE CGI, the over-the-top acting, the bad cutaways, the entire premise itself...If you're the type to sit around and laugh at horrible low-budget films, I definitely recommend watching it. Perhaps with a couple of drinks. I can imagine if I'd watched this as a child I would have actually, sincerely enjoyed it in the way it was intended, so I'd definitely recommend watching this with the kids. They'll enjoy the silly talking animals, and you can enjoy how bad it is. It's so bad, it's somehow actually good. I feel like it's all very tongue-in-cheek, they must have known what they were doing. Many of the lines had me in tears, not because they were actually funny -- but because of the way they were delivered. I hope these guys make more films, I would happily sit and watch another if it was in the same vain as this one. I hope those kittens found good homes in real life.","user":"malborell","rank":[24,33]}]