[{"title":"A war movie that will become a classic.","rating":9,"date":"9 October 2016","review":"I have never reviewed a movie before, and I probably will never review another. I always go to IMDb to read reviews on a movie before I watch it, just to decide whether it's worth the 1.5-2 hours of my time.<br><br>I must say that I am a war movie buff, and have not seen a decent one since Saving Private Ryan and Heroes of Iwo Jima.<br><br>Put simply, this movie had me hooked from the first five minutes. The dialogue is fantastic, the narration is on point and the story line flows very well.<br><br>I was gripped to my seat as I watched this film, and I felt a deep connection with each and every soldier on screen. This might come out as a B grade movie, but I assure you it was A+ in my books. definitely worth the 2 hours and I will probably watch it again and again in future.","user":"xenonkuraz","rank":[139,160]},{"title":"A remarkable story of courage and political machinations....","rating":10,"date":"18 October 2016","review":"I had never heard of The Siege of Jadotville before watching this film. <br><br>Its based on a remarkable story of courage of a small group of Irish UN troops who come under attack from a much larger contingent of mixed tribal, coup based government, settler and mercenary forces in the Congo. <br><br>The courage demonstrated by the Irish soldiers and their determination to do their job is overshadowed by the political machinations of the UN and the Irish government. The fear, on the part of the latter, of looking incompetent, leads to the soldiers becoming the fall guys, for a situation they did not create and could not, ultimately control. All this, in spite of their heroic efforts. <br><br>Whats really surprising is the quality of this production. Its an exceptional film on so many levels. Its reasonably candid, in its appraisal of the situation that existed at the time. Its capably directed, scripted and acted as well, with a very strong cast. <br><br>The action scenes that run the length of this film are quite simply, incredible. This film is never, ever boring but what really astounded me is the casualties inflicted by the Irish soldiers with not one of their men lost. Its a testament too, to the ability and insight shown by their commanding officer. <br><br>I'm not a huge war film fan so for me to give what amounts to a war film, a 10 out of 10, really is saying something. Take a look, you wont be disappointed.","user":"s3276169","rank":[61,71]},{"title":"True story of Irish UN peace-keepers embroiled in a civil war in Africa in 1961","rating":10,"date":"29 September 2016","review":"Based on true events, this film is a shock to the system because what it reveals had been meticulously covered up for over 40 years. The film highlights one of the most important roles ever played by the Irish Defence Forces as United Nations peace keepers. All the more astonishing given the \"battle virginity and inexperience of the Irish troops, the menacing threat and overwhelming numbers of hardened ex-Forign Legion French and African mercenaries there to defend the interests of the powerful international mining companies. Superbly acted by a virtually unknown cast, the tension mounts from the moment the troops find themselves billeted in the uranium rich mining Katanga outpost of Jadotville, in the province of Kinshasa in the southern rump of the fledgling Republic of The Congo. <br><br>In the background the Cold War is at its most dangerous as the Western, Eastern political blocs posture between the emerging United Nations trying to establish its credibility on the international stage. The civil war in this strategically important supplier to the nuclear armaments race is at its height, and an Irish diplomat Conor Cruise O'Brien (Mark Strong) is sent to Katanga to handle the situation on behalf of the UN. It is impossible to fathom how the Irish commandant (Jamie Dornan) in charge on the ground can be expected to keep the peace and hold the area assigned to the poorly equipped Irish troops. While tension mounts locally, high stakes and political posturing take place in the background stretching the ubiquitous tension even further. I'm still pinching myself with the realisation that all this happened within my lifetime and never knew a thing about it until viewing this spell-binding, tension filled action drama.This massively impacting film would be well worth seeing again , if only to focus next time on the drama itself without the distraction or initial shock of the unfolding historical events portrayed.","user":"jimothy1-439-660258","rank":[79,94]}]