[{"title":"Wow! Eyes Wide Open","rating":10,"date":"9 August 2019","review":"Just saw the latest superhero movie tonight. Although it was not advertised as one. I am talking the new movie Brian Banks. Don't get me wrong-I enjoy superhero movies and even attended Comic Con when I used to be able to afford it. Tonight, was a great reminder that we are the true superhero's with comics mimicking how sensational we can be as humans when we rise above injustice. Brian Banks is played outstandingly by actor Aldis Hodge who is amazingly convincing as Banks. Actress Sherri Shepard plays the role as Banks mother, who is everything one could want as a loving and protective mother. Greg Kinnear as the attorney Justin Brooks provides the right touch of truth about our judicial system, while exuding gut-wrenching care to this heartfelt classic hopeful. This movie is as compelling as The Blind Side-another based on true events story. Except you get blind-sided in a different way. As uncomfortable as this movie makes you feel, due to its disgusting unfairness faced by Brian Banks. You can't help but feel sorrow for what must be missing inside someone propelled to tell such sickening lies on the innocent-played perfectly by actress Xosha Roquemore as the accuser Kennisha Rice. This movie made me mad, cry and grateful for the freedom and life that I have. Test yourself, see how feel when you come out. All I can say is Wow, my eyes are now wide open.","user":"quietaura","rank":[36,47]},{"title":"Refreshing take on a broken System","rating":10,"date":"8 August 2019","review":"Wonderful to see a true story that matches the person it covers. I have heard Brian Banks speak before and Aldis Hodge captures his spirit and intellect in a beautiful way. He was a victim that does not ask to be seen as a victim. He stands up and fights for himself and others in the same position. Welcome back Tom Shadyac!","user":"zackarayz","rank":[26,37]},{"title":"Inspiring!!","rating":9,"date":"11 August 2019","review":"What a great movie showing his determination of not giving up!!! Very inspiring movie. All the actors portrait the characters perfectly.","user":"ilovefoodcoma","rank":[17,24]}]