[{"title":"A New Low in Stupid","rating":3,"date":"7 December 2015","review":"A meteorite brings ice and freezing temperatures, which threatens to harm the residents of a small Montana town at Christmas.<br><br>It would be nice to be able to say good things about this film, but there really is nothing nice to say. The script is nonsense, the science completely made up (remember when SyFy had heart?) and none of the actors seem anything special. The romantic aspect is garbage, with two overall pale kids pretending to be cold... and not trying very hard, because the girl never even puts her hood up.<br><br>Someone thought they were being clever by naming the rival families Ratchet and Crooge, an obvious allusion to \"A Christmas Carol\". The head of the Crooge family is Ben, clearly a shortening of Ebenezer. But the problem is that the name \"Crooge\" sounds so forced coming out of the characters' mouths... there had to be a better way.","user":"gavin6942","rank":[8,8]},{"title":"With the thrill and conviction of random employee forced to work at Christmas.","rating":3,"date":"13 October 2015","review":"Aside for a selective few, like the recent Everest, disaster movies don't really have amazing track record. So, one would already expect what to come from the poster or title here. Christmas Icetastrophe works by incorporating cheap CGI and shots where people stand very still to create the illusion of being frozen. It's as silly as it sounds and even worse when one finds out that the trigger is meteor fall.<br><br>As common sense, or countless depictions of Hollywood, would dictate, a meteor usually falls down to Earth in blazing glory. For this movie however, it will create instant ice age to wherever it touches. Scientific reasoning be damned, yet it still tries to convince audience with pseudoscience mumbo-jumbo, which undoubtedly be a great pivotal point for the plot.<br><br>Cast is all sort of cliché. You have the heroic father, the one scientist who figures things out, the douchebag who may or may not redeem himself, incompetent authority figure, a few sidekicks for brief comedy and half of the town for death scenes. Everything plays out in dramatically predictable way.<br><br>The effect itself is far from convincing, most of them literally a blue filter being applied to create cold effect. There are many scenes where people instantly freeze over in ludicrous fashion. It does tend to repeat this tricks many times over, it becomes stale and not even hammy funny at the end.<br><br>Being B-movie doesn't exemplified the lack of quality but for a movie called Christmas Icetastrophe, it delivers what expected of it, with the conviction and thrill of random employee forced to work at holiday.","user":"quincytheodore","rank":[7,7]},{"title":"If you are fascinated by things being flash frozen, you will like this movie","rating":2,"date":"26 December 2014","review":"In a nutshell.....asteroid hits town starting to celebrate Christmas, Santa gets flash frozen, people scream, people flee and good looking lead actor and actress save town just before everyone is flash frozen. <br><br>Too bad Mystery Science Theater is not still on TV, because this movie is perfect for it. There is no story line, no character development, no acting of note, no anything other than wall-to-wall things/people being flash frozen. There is not even a point to who is/isn't flash frozen. But trying to find something positive to say, it does have a lot of actors who were in other shows/movies that were much better. <br><br>Its just a classically bad sci-fi movie and the kind of movie for people who are into such things.","user":"story_by_corey","rank":[27,36]}]