[{"title":"Ponderous & Irritating","rating":3,"date":"29 April 2016","review":"To me, this was one of those supposed deep dramas that produced only unlikable characters, espousing psychological drivel throughout, and thus in the end just became ponderous and irritating to watch. Often told through flashbacks, it held my interest for a while, wondering where it was all going. I should have known better because it ended up going nowhere, all the way to its highly ambiguous finale.<br><br>Elisabeth Moss and Katherine Waterston star as Catherine and Virginia respectively. Catherine has come up to her best friend Virginia's family vacation home to get some rest and relaxation. Her emotional state is quite unstable, after her father, a renowned artist committed suicide, and her partner has told her he's having an affair with another woman.<br><br>If these two women are best friends, I wouldn't like to meet their enemies, because Catherine and Virginia are constantly bickering at their best moments and being cruel and hostile to each other at their worst. They're joined from time to time by Virginia's neighbor Rich (Patrick Fugit), who's in a relationship of some sorts with Virginia, and who seems to delight in \"adding fuel to the fire\" whenever he can to provoke the unstable Catherine.<br><br>All in all, I imagine the writer and director here Alex Ross Perry, was aiming for a deep meaningful film, but all I found it to be was a tedious and irritating waste of time.","user":"larrys3","rank":[19,25]},{"title":"I can understand if some people like it but I just found it rather dull","rating":3,"date":"22 July 2016","review":"Slowmoving psychological drama about a woman with a mental state that's on a downward spiral after her father died.<br><br>Has a bit of a eerie 70's mystery feeling to it stylewise both visually and emotionally (even though it takes place in now time).<br><br>But instead of getting intrigued I just found it rather dull instead, perhaps a bit to do with the fact that I didn't find anything particularly likable about any of the characters (or interesting for that matter) and they were all fairly self-absorbed.<br><br>And some scenes just go on forever with mumbling monologues of which I often found myself not knowing what exactly they were talking about because for one they mumbled quietly and also the eerie music was really loud, so that didn't really help, and the ending is rather abrupt.<br><br>So yeah what can I say, not for me I guess.","user":"Seth_Rogue_One","rank":[19,26]},{"title":"\"I don't deserve this.\" I know the feeling","rating":4,"date":"6 January 2016","review":"I went into Queen of the Earth with so much good will. The premise sounds like it has a great deal of potential - a woman's (Elizabeth Moss) father dies and she goes to try and get away from everything in the wake of this and breaking up with her boyfriend to a cabin by a lake that her best friend (Katharine Waterston) has, and from there she starts to lose her mind. I hadn't seen The Color Wheel or Listen up Phillip, the previous Alex Ross Perry films, but I am an admirer of Elizabeth Moss (just last year she was in a little seen but awesome indie movie, The One I Love), and I thought she could pull off a deep and interesting character. The trouble is, the resulting film Queen of the Earth isn't deep or interesting, though it would very much like to be and pretends to be.<br><br>It paigns me to rag on a film that is trying to be ambitious in the psychological/interior sense. It's not that the world lacks independent film dramas dealing with loss and mental instability, but it's always good to have well made ones that let the audience in to the character's pain and, perhaps, see that person grow. But the core problem with the movie is that it doesn't give enough context for the main character's misery. In a sense the format reminded me of Lars von Trier's Antichrist, only without the hilarious fox or over-the-top antics involving castration: someone loses a loved one, they go off to the middle of the woods with a close friend, and then the bile spews out. And Queen of the Earth is nothing but an experience where characters are loaded with bile to one another scene after scene.<br><br>Of course a story dealing with grief and loss and mental fractions should be taking itself seriously, of course... but maybe it should also allow a tone that doesn't hit the same ugly sensations. Even in the flashbacks Moss and Waterston's characters are sniping at one another in passive-aggressive or just aggressive ways, and even the (very) few semi-happy moments are tinged with the flavor of dread. After an opening shot where we see Moss crying and in hysterics - and to be fair, it's an amazingly acted and shot scene - it never really loses that tone, and yet we also never get a sense of WHERE and WHO this character was at before all of this; it's all told to us (that she had a father who was reviled, that she is reviled as a \"spoiled brat\", that she should get over herself, her art, etc).<br><br>Part of the approach may be due to the low-budget - Perry didn't quite get started with the 'mumblecore' filmmakers, but he's in the same ballpark - and yet there's little actual creativity, or any sense of empathy that the audience can have in the writing, at least from my perspective. Part of the problem too is due to the style, where Perry gets composer Keegan DeWitt to hit the same ominous, horror-movie notes, and it's draining. In scene after scene it's as though we are locked in with one woman, Catherine, who is a head-case and is becoming undone further and further along (the same tone is basically, 'why can't they leave me alone') and she is not that interesting as a miserable character, and Virginia is even worse. There's no arc with either of these people, no sense of growth whether it's up or down (well, I guess Catherine DOES get worse, but you know what I mean, the trajectory is muddled and shallow); that may be part of the point, but it doesn't work in this case.<br><br>I can see why the film was made, to bring a full atmospheric experience through eerie-grainy 16mm cinematography, and to highlight how, well I guess, society people are people too. But aside from Moss's performance, as she really is trying and going for this full- throttle (she produced too), Queen of the Earth comes off as a miserable, empty time.","user":"Quinoa1984","rank":[22,33]}]