[{"title":"She's above the glass ceiling, but she's still not at the top","rating":9,"date":"27 August 2016","review":"Equity (2016) was directed by Meera Menon. It stars Anna Gunn as Naomi Bishop, a high-powered Wall Street executive whose specialty is taking corporations public with IPO's. (IPO stands for Initial Public Offering.) She has taken nine companies public, but her most recent effort has fallen short. Now, she's working with another company, and she's fighting for the opportunity to take it public.<br><br>James Purefoy plays Michael Connor, a hedge funder who is Naomi's lover. Alysia Reiner plays Samantha, Naomi's assistant, who is loyal, but who has ambitions of her own. Sarah Megan Thomas portrays Erin Manning, who works for the federal government. Her job is to discover and punish corporate crime, and she's very good at it. All three of these actors do very well in their roles.<br><br>I enjoyed this film, because it gave me a glimpse of a world I don't know, and don't really want to know. The acting was superb, the sets were excellent, and everything looked and felt real. As I noted, I don't know if the plot was realistic, but the sense of wealth, power, and greed felt real to me.<br><br>I don't see this as a movie about a woman trying to break through the glass ceiling. I see it as the story of a hard-driven, ambitious person, who is up against some strong, vicious, and crafty competitors. That's the life she's chosen, and that's the life she's living. It's not a happy life, even if you win. There's hardly a happy moment in the movie. Be prepared for a tale of ambition and treachery.<br><br>We saw this film at the excellent Little Theatre in Rochester, NY. It will work well on DVD. <br><br>Note: Equity has a horrible 5.4 IMDb rating. Normally, we would never go to a movie rated this low. However, when I looked at the ratings, it became clear that women liked the film, and men hated the film. As usual for IMDb, many more men than women vote. So, if men hate a film, that will lower its rating, even if women like it. My suggestion--ignore the rating and see it.","user":"Red-125","rank":[36,54]},{"title":"It's a men's club or women's, but jobs are done in the same way.","rating":6,"date":"14 December 2016","review":"It's a woman oriented financial film drama directed by a woman filmmaker. That makes it empowered by women. On the perspective it was my first experience, so I think it could be the only of its kind. It is not as bad as it looks, those who liked financial related films like 'Margin Call', 'The Big Short', 'Glengarry Glen Ross' et cetera would enjoy it as well. This film stayed true to its title, so that's what you are going to expect, but nothing a bit more than that.<br><br>There are unexpected turns in the narration. Particularly the characters, that too the females. It is about the commitment and trust in the colleagues. No matter what you do, the company always judges you by your result. The pace might look slow, but it gets better in the latter half. The film turned into kind of thriller and ended with a little drag, though satisfying.<br><br>Anna Gunn was so good and looks like we have here another talented woman director Meera Menon. This film did not get as popular as its counterpart on the same theme, I mean men's Wall Street thriller. But somewhat I liked it and seems a sequel is not a bad idea, after how this story had ended. Finally, this is for the selected viewers, so those who are from the outside of its bandwidth won't end watching it happy, hence the film will lose its rating, but not the quality.<br><br>6/10","user":"Reno-Rangan","rank":[10,13]},{"title":"Realistic","rating":7,"date":"28 April 2019","review":"I really enjoyed this movie, although I'll recognize it may not please everyone. Didn't feel as much as a hollywood commercial film as other Wall Street productions. Not many catch phrases. Indeed what I liked the most in this movie is how realistic it is.\nPeople would be surprised about how easily conversations like that happen. How easily people actually slide into ridiculous behaviour when under extreme pressure.\nOverall, good acting, nice pace, realistic scenarios and story.","user":"alexandraclfranco","rank":[3,3]}]