[{"title":"This is why 2d animation will never die.","rating":10,"date":"6 March 2018","review":"This movie gets a perfect score for me, but it's not for everyone.<br><br>Recently I saw many movies and even animated movies. But they were all made to impress in cheap ways such as huge stakes, awesome CGI and well known actors. The Breadwinner for me does so much more with so much less.<br><br>This movie however is about characters you wouldn't normally care about. About a story so far from your living room that you wont bother to check. And yet, this is why it touched me. It's a realistic take of a distant world. The characters and situations are as down to earth as possible, even compared to live action movies. The soul this movie has, with the small stakes of a poor family and even how a girl copes with the loss of her brother, is what most directors and writers fail to deliver. The movie gives many cultural elements of how an Afgan family lives, how men differ from women and how the whole city works. <br><br>I had to check and see if everything depicted in the movie was real in some way. This was a fictional story but so well crafted that left me stunned. I thought it could be a biography like the 10 year old cartoon movie Persepolis (which has similar style and setting) but it's not.<br><br>The description of this movie \"an 11-year-old girl who cuts off her hair and dresses like a boy to support her family\", put me off at first because it reminded me of Mulan. This may not be a blockbuster but it is a superior film made by a smaller company.","user":"veinctor","rank":[69,72]},{"title":"Wow, wow.","rating":9,"date":"24 February 2018","review":"It was good. Powerful film. As a writer, and a lover of a good story, this was a good story. A glimpse into the look of lives, human lives, that many seem to forget about whenever speaking about the middle east. It reminds me of a more, hopeful version of Grave of the fireflies. Again, a lot more hopeful, but no less powerful. Especially the ending. Worth watching.","user":"shineyturdspresident","rank":[44,51]},{"title":"Stunning film about perseverance and the kindness of the human heart","rating":10,"date":"3 March 2018","review":"This is a film that tells the story of a daughter forced by the circumstances of her world to hide her identity and protect her family from starvation after her father is wrongfully imprisoned. Having said that, this film is beautiful and uplifting. I would definitely recommend this film for young adults on up.<br><br>This story shows the effects of war, fundamentalist religion and poverty and how it affects a Muslim family living in Kabul. It is a more honest depiction of Afghani culture than many purely adult films as it has many aspects they don't contain, as it was made to also appeal to children (the violence is all implied, but never shown).<br><br>This is a great family film - I watched this with my girlfriend who has had little to no exposure to Middle Eastern culture or Islamic culture. She asked \"Do you think this is an accurate depiction of this culture\" and I responded: \"for some people - families like this, yes\". This is a film that talks about the struggles of these places without it being from an American or European viewpoint (as is often the case in the last decade), but it WILL appeal to people from American and Europe as the messages are about a struggle for survival, freedom from oppression and the journey of childhood through uncertain times.<br><br>This is by far the best Animated film coming from North America in 2017. Adults will be able to connec the dots here to see the connections to modern politics and current events in the last 20 years.","user":"pcm1123","rank":[27,31]}]