[{"title":"A coming of age story with a difference.","rating":7,"date":"20 November 2016","review":"This is a coming of age film with a difference. It starts off pretty typically: a teenage Greta on the brink of adulthood struggling to navigate her new world. Starting at a new school and having a 15th birthday party looming forced on her by her well-meaning but clueless mother, she's faced with making some tough decisions regarding the relationships in her life. But after having a falling out with her new best friend at her party, the tone of the movie does a complete 180 as Greta falls asleep and enters a strange dreamland where she's forced to confront her fears about growing up, say goodbye to her childhood and rethink how she views the people in her life. While I really enjoyed this film, I don't think it was adapted from the play very well. The dialogue, direction, style of acting and even some of the special effects are much more suited to the theatre than the cinema. The actors for the most part do an excellent job, but they can't quite shake the staginess of it. Despite it's flaws, it's easy to get lost in the fun, quirkiness of the film and I challenge you to not fall in love with the characters!","user":"breannesartori","rank":[17,20]},{"title":"Brilliant first half","rating":5,"date":"1 August 2018","review":"The first half of the film was wonderful (I'd give it 9 stars)! It was witty, artistic, imaginative, and delt with really world issues. The characters were fresh and complex, and their conflicts and choices were intriguing.\nHowever, halfway through it started to loose all of that, except some of the imaginative aspect, but in a style so unlike the rest of the film it's jarring.","user":"brandonbrooksby","rank":[5,5]},{"title":"Creative and Evocative Tale","rating":8,"date":"7 September 2016","review":"'Girl Asleep' is a delightful coming of age dramedy that uses the medium of film in a creative and entertaining way. Less is more (or it should be in features, where directors are too often indulged) and the running time here is succinct; whilst exploring its themes and concerns. Recreating an era on film is never easy, especially on a budget, but Rosemary Myers does a great job as she and the screenwriter (and supporting actor) Matthew Whittet, adapt his stage play and bring some visceral and visual elements to the tale.<br><br>The protagonist here is a 14 year old played with smart enthusiasm and sturdiness by Bethany Whitmore (already a seasoned actor at aged 16!). Her Greta undergoes some quick rite of passage as the narrative propels her towards her next birthday and a reluctant participant in her own celebrations. With quirky parents, an apathetic older sister, and a geekily winning best pal played to perfection by Harrison Feldman, Greta has a new school and peer pressure to navigate as well as the looming birthday. <br><br>There is much to enjoy about 'Girl Asleep' with its retro first half; resplendent with late 70's furnishings, music, costumes and an altogether more innocent time. The film's shift in tone and style is not unexpected, with some early metaphysical and fantasy components flagging its intentions, but for some this may prove too wayward. There is ultimately a sweetness to this movie, without being saccharine or predictable. With a cast largely of teenagers and lesser known actors, the director wrangles the elements with a deft hand but not intrusively; allowing Matthew Whittet's story to be explored and Greta's turbulent coming of age to be presented in a distinctive style. I hope this movie finds its audience. This is an Australian film to rally for!","user":"david-rector-85092","rank":[12,18]}]