[{"title":"Good","rating":6,"date":"21 February 2020","review":"It would have made a great 10 episode series but too much information, characters and plot lines for one sitting. Good actors and camera work but fails to make sense in the end. I feel like it was pitched as a series but the accountants decided to make it into a movie.","user":"MR_Heraclius","rank":[39,40]},{"title":"Half Decent","rating":6,"date":"14 July 2016","review":"The Bad Half: <br><br>Unnecessarily over convoluted plot. And although at the end I understood who did what and why, there were still too many questions left. Too many loose ends. The last 10 minutes felt weird, as if the production was running out of money, so they tried to close all knots in a hurry.<br><br>Confined spaces, and generally low number of people on set, resulting in a more low-budget, B-grade feel.<br><br>Bruce Willis. His character lacks authenticity and feels artificial in any scene he's in. It seems like Bruce Willis didn't care too much for the role.<br><br>The Good Half:<br><br>Christopher Meloni, Adrian Grenier and Johnathon Schaech. Their character felt very real, and I could rely to any of them. Their character development was very good, so I clearly understood who each person is. Moreover, it seems that their script was well- written since what their said was mostly in-place (at least as the plot went on and not looking back in retrospective).<br><br>There are also several good camera movements which made nice additions. <br><br>The action was far from exceptional but in most cases it had a tight grip. One of the action scenes was actually very tense, with a good score.<br><br>I don't know whether to recommend this movie to anyone or not, but I certainly didn't feel it was a total waste of time.","user":"athena24","rank":[50,61]},{"title":"The unbelievably convoluted plot line sinks it --","rating":4,"date":"30 June 2016","review":"-- despite a fine lead performance by Meloni.<br><br>Which is too bad, really, because the cinematography is quite good (digital's getting closer to celluloid every year) and a few of the supporting roles are well-acted (Grenier's in particular).<br><br>But then there's the story. Oh mother of God the story... <br><br>SPOILERS AHEAD!<br><br>It's something about a shady bank president, played by Bruce Willis, whose banks keep getting robbed in particularly brutal fashion. The trail leads the tough FBI agent in charge of the investigation (Meloni) to members of an elite special forces team and then -- wait for it - - to ANOTHER special forces team, both of which are tied in, somehow, with the kidnapping and murder of Willis's younger brother several years before. <br><br>A corrupt Ohio Senator and a missing-and-presumed dead ex-special forces op also figure in the (incomprehensible) proceedings.<br><br>I defy anyone to see this movie once and summarize the plot line. It's like the filmmakers tried to pack 4 hours worth of story into a 2- hour running time, and failed in the attempt. <br><br>All in all, a missed opportunity. I happen to love smart intense heist movies (such as HEAT, THE TOWN, THIEF, etc), but this wasn't one of them.","user":"filmklassik","rank":[93,121]}]