[{"title":"The struggle of the man, not the race","rating":8,"date":"4 December 2015","review":"This film introduces the struggles of men released today (2015) from prison, while showing the humor and compassion these men possess. It does communicate the hard choices some men are willing to make that labels them as unable to be rehabilitated, from society. The struggle of the man from the streets, not the race, this movie does a great job presenting the issue to the viewer. Most times we understand the phrase; \"Scared Straight\" as a direct way to change a persons self destructive behavior. This movie; \"Chapter &amp; Verse\" puts this term on its head, when a man is willing to make the hard choices. After viewing the movie come back and reread this review.","user":"ladymagyver","rank":[6,12]},{"title":"A stunning movie that deserves wide distribution","rating":9,"date":"9 February 2017","review":"I just saw this movie, which had a brief run at a theater in Harlem and was a NY Times Critic's Pick. The lead actor co-wrote the screenplay with the director. It's a sophisticated film that was made on location in Harlem, with a focus on the difficulties of life after prison for someone trying to stay out of trouble and also ties of friendship and family in a longstanding and complex community. The lead character, out on parole, is given a job delivering food to shut-ins, many living in public housing, a device that places him in a number of situations that advance plot and character revelation. Each character the film is deeply individual and they illuminate different aspects of the protagonist's life. I hope Chapter and Verse becomes more widely known, at least through streaming.","user":"swilde-81357","rank":[4,7]},{"title":"Powerful.","rating":9,"date":"2 January 2020","review":"This film shows a powerful story of a man's daily struggle to survive and the ultimate choice he has to make to protect the next generation. He makes peace with so many parts of his life that he lost when he went to prison. I didn't anticipate the ending at all. Wow.","user":"EmmaNelly","rank":[0,0]}]