[{"title":"A low 2/10","rating":2,"date":"18 January 2018","review":"I'm going to keep this review short. The movie entirely is not that good. The actors aren't good. I feel they were a let down. The story has a potential to be something really good. The only thing that stood out was the directing. It was actually pretty good and I can see some good potential in the director. Maybe over the years we could see an actual good movie from the director. Some parts of the film were lazy and sleazy. At one point I even saw the reflection of the camera man on a car window. It was pretty clearly visible. In all honesty I wouldn't recommend watching movie.","user":"fareedbatcha","rank":[6,7]},{"title":"What is the point of this film ?","rating":1,"date":"14 November 2019","review":"Why make this film ? The director's experience extends to 2 shorts ... and the producer previously made a game show etc. So a bunch of ametuer actors and crew get together to make an ametuer film , and the result is ... well, less than mediocre to put it politely ! They had to start their careers somewhere, and this was IT !!<br><br>Please don't waste your time on this garbage ...","user":"adabsiz","rank":[0,0]},{"title":"Unintentionally Funny Political Drama - Redistributors","rating":3,"date":"9 January 2019","review":"Before you view this film, you must be sure to be able to suspend your disbelief; and I assure you, that will be very hard to do. This is a tired screenplay that has been done 100 times before (and much better) about the evil conservative capitalists vs the good liberal socialists. In American terms, this would be like your local all-star softball team playing a game of hardball with the Yankees (they would be the capitalists). I think we already know the outcome of that matchup. In this film, we are supposed to believe a woman with a high-paying job suddenly grows a conscience, while her brother suddenly grows a penis to shoot a capitalist. That is after her father suddenly grows a penis to knock out a young soldier for the capitalists holding him hostage. Then another member of the capitalists grows a conscience to help the woman. Finally, a third member of the capitalists grows a conscience instead of doing his job as a soldier. So, this is all so very funny to watch. THREE dyed-in-the-wool capitalists grow consciences in less than a week, and THREE dyed-in-the-wool socialists (liberals) grow penises in that same time period. The results are hilarious; but unintentional. I've had Halloween parties that were more realistic than this mess.","user":"arthur_tafero","rank":[1,4]}]