[{"title":"Caution","rating":2,"date":"14 January 2020","review":"Russ Washington (Hunter G. Williams, who is the auteur of this, writing, directed and starring in the film, which begins with an extended shot of him nude; he also broke his neck during filming which put the movie on hold for a year) is a successful businessman on top of the world. However, addiction, secrets and horrible relationships have sent him on a downward spiral that he may never recover from.<br><br>I'm trying to think of how much money Lily Tomlin was paid to be in this movie. There has to be some reason for it, because otherwise, her appearance in a film about two producers who do drugs and basically abuse women makes little to no sense. I'm still flabbergastered that she would watch, much less act in this movie.<br><br>I love cautionary Hollywood tales, because most of us watching them will never have to decide between falling in love with a prostitute with a heart of gold and making our next movie. No, I'm more concerned if whether or not I have enough in the bank to cover my quarterly business taxes.<br><br>If coke-fuelled Eyes Wide Shut sex and Pretty Woman style romance without the comedic edge is what you're looking for, don't let me stop you.","user":"BandSAboutMovies","rank":[0,0]},{"title":"my true review","rating":1,"date":"9 April 2020","review":"I can't believe there is no review after the 06/12/19 release date.<br><br>Thriller only!!! why?, it should be Drama only, a lot of irrelevant Drama 100%, I skipped through the boring crap.<br><br>Weak storyline he is just partying all the time, very drawn out slow going, you're waiting for something good to happen but it doesn't, total garbage from all unknown actors, its like watching cement/paint dry.<br><br>Let me explain why I use a lot of irrelevant Drama for reference with my other reviews.<br><br>Good films/movie's spend a lot a money making these films. It appears the film/movie makers set the genre considering they are making it.<br><br>They must make the storyline if no one has watched it. Therefore there are loads of genre's I like. Action, Crime, Fantasy, Horror, Sci Fi and Comedy?<br><br>I rate all my films from the genre and storyline given if it plays out.<br><br>When I watch them if they don't meet that genre then the rating can drop to 1 as you can't rate 0.<br><br>I also like a good Comedy. To me a comedy is supposed to make you laugh or the low point smile a lot.<br><br>Every Comedy film I've watched some are Comedy only which makes even more of an insult. You don't even smile, that's US Comedy for you when they laugh at anything.<br><br>That's why they get a lot of irrelevant Drama %. to me irrelevant Drama is when they talk about anything useless of storyline that has no interest what so ever. So the more irrelevant Drama there is means they are reading a bad script or the storyline has no good foundation, they are just filling in in time.<br><br>The other factor is the play time for the film. The average play time is around 90 minutes 1:30. To 1:30 is a good time to watch a film. There are plenty of films with play times of 2 hours or more, they use irrelevant Drama just to pad it out.<br><br>This site is good for making reviews if no one has made a review. You have to get all the text you want to say correct the first time before it goes for checking.<br><br>I've learned that even if a film or TV series has no reviews shown my review gets posted in other reviews. So I never post a review because who decides which review is show?<br><br>I have posted my review for Yinz (2018) 3 times and it still hasn't been approved why not as there is only 1 spammer review why?<br><br>The bad thing if someone has made a review which is totally wrong to the same film I've watched you can only click yes or no was this useful.<br><br>Lets see if this review gets approved and posted?","user":"keithstanier","rank":[0,1]}]