[{"title":"A realistic window into Mexico that becomes too real to be the funny satire that it promises","rating":9,"date":"21 October 2014","review":"Nothing can ever compare to that achievement of political humor through satire and metaphor that was \"La Ley de Herodes\" (\"Herod's Law\"), directed by the same Luis Estrada that directs this film, \"La Dictadura Perfecta\", (\"The Perfect Dictatorship\").<br><br>But while \"Herodes\" was a succinct metaphor of the Mexican political system through the entirely fictional story of a 1950s town in rural Mexico, \"Dictatorship\" is a very direct satire of 6 different real-life political scandals in Mexico's recent history, told through fictionalized events in Mexico's near future. Thus, while \"Herodes\" was a fairy tale about the failures of the revolution that eventually decayed into corruption, \"Dictatorship\" feels more like a fictionalized documentary of the contemporary political system.<br><br>And it's important that these two films are considered together, not only because they share director, actors, and the purpose of political criticism and analysis, but because they are inherently linked. While \"Herodes\" dissected Mexico's system from the 1940s to the 1990s, \"Dictatorship\" presents a perception of Mexico in its current form. The fictionalized President of Mexico, for example, is seen committing gaffes that were actually committed by President Fox (2000-2006), Calderón (2006-2012), and Peña Nieto (current). So, it would be unfair to conclude that the film criticizes only one party. It analyzes and criticizes the entire political system, much like \"Herodes\" did. But, while in \"Herodes\" we explore the relationship between a single-party system, and the US, the Roman Catholic Church, a submissive population, and the ineffective and hypocrite opposition, \"Dictatorship\" instead explores the relationship between the multi-party democratic system (perceived by most Mexicans to be a farce), the drug trade violence, and the media.<br><br>It is also obvious from the very title of the movie that there is an implication that the present cannot exist without the past. \"The Perfect Dictatorship\" is a phrase that Uruguayan author Mario Benedetti once used to describe the Mexican political system depicted in \"Herodes\". But now, \"Dictatorship\" uses the same phrase to title a movie that depicts, not the past, but the present. The relationships between the past and the present are further established by using similar character names in both \"Herodes\" and \"Dictatorship\" (The main character in \"Dictatorship\" is named \"Governor Vargas\", evoking the main character from \"Herodes, \"Mayor Vargas\"; similarly, the opposition leader is named \"Morales\" in both movies, and they are played by the same actors).<br><br>Now, the power resides in corrupt Media that is the gatekeeper of reality for uninformed, uneducated, or otherwise gullible Mexicans, and that exercises its power through media framing, politically-motivated editorial gatekeeping, and downright restrictions to access of information that shape political behavior. The TV network is fictional, but it doesn't take too long to realize who the movie is referring to. The funniest bit, is when they refer to their media manipulation strategy as the \"Chinese Box\", a clear reference to \"Yellow Journalism\", invented by William Randolph Hearst to sell newspapers by using fear-mongering headlines about Asian immigration.<br><br>Opportunities were missed. For example, the above could clearly have been an opportunity to reference another great movie about the influence of media in politics, \"Citizen Kane\". But, more importantly, though \"Dictatorship\" is a satire, the humor is dark and the events too real to laugh at them. Yes, they are funny, until the audience realizes that the punchline is the country they live in. And though the entertainment value of a film is important, this is not the only metric of the movie's worth. This story needed to be told. This movies excels at representing the current political and media landscape of Mexico. This movie excels at criticizing and analyzing their dynamics. And, more importantly, this movie excels at doing both of them not by presenting a documentary that criticizes \"the system\", or by having a political bias or agenda, but by presenting a fictionalized version of real life events. It is a well written story, flawlessly filmed and edited, and well acted. Its success at being a great movie transforms it into a window into Mexico, losing the humor in the realism of the film.<br><br>As mentioned before, the movie, though 100% fictional, leverages 6 real-life political scandals to drive its point home. Spoiler Alert, the real-life scandals are the following:<br><br>== Spoilers ==<br><br>1.- The inappropriateness of government officials in conducting PR (former president Fox's comments, and current President Peña Nieto's campaign) 2.- The \"video-scandals\" (where officials from the Green party, and the leftist PRD were shown on TV receiving bribes) 3.- The \"Gober Precioso\" audiotapes (where PRI governor of Puebla State was caught on tape promising favors to a donor in exchange for cognac bottles, it was later discovered that the donor was implicated in child-trafficking, and their sexual exploitation) 4.- The Paulette Case (where current-President, then governor of a populous State, botched an investigation of the kidnapping and murder of a child from an upper middle class family) 5.- The Cassez Case (where the government of former President Calderón ordered the manipulation of evidence to re-create for TV the \"capture\" of a criminal cell) 6.- The revelation by the UK newspaper, \"The Guardian\", that the campaign of current President Peña Nieto leveraged from the PR consultancy of Televisa, the largest media group in Mexico, to improve its image, and paid for this service with State government funds, including government debt.<br><br>Finally, another spoiler. In the movie, the opposition leader, a very moral and idealistic, right-wing legislator, is assassinated under circumstances that are presented as suicide. In real life, 3 or 4 years ago, a very moral, idealistic, right-wing legislator and former Presidential Candidate, Diego Fernandez, was kidnapped for 60 days. The movie missed the opportunity to represent this event in this part of the film. Perhaps because by doing so, the director would've crossed a political line. Fear and self-censorship are alive and well in Mexico, and the film makes it very clear why that is. <br><br>== Spoilers End ==","user":"guillermo-246-956608","rank":[47,56]},{"title":"Satire at its best","rating":8,"date":"9 July 2019","review":"This's a funny yet thought provoking movie. I love watching Spanish language movies and this's a really good one. It pokes fun at the 2012 Presidential Election in Mexico as well as fake news and politics in general. Damian Alcazar pretty much steals the show as the corrupt governor trying to clean his image with the help of Television Mexicana in order to fix his political career. The commentary's spot, the jokes are funny and the characters are interesting and enjoyable to watch. If you speak Spanish or are learning Spanish and you like political comedies then I highly recommend this movie.","user":"mitsubishizero","rank":[3,3]},{"title":"Too real","rating":7,"date":"10 April 2019","review":"This movie felt too real, and I say this from a country thirteen thousand miles away from Mexico.","user":"tabachoi","rank":[2,2]}]