[{"title":"Bad acting here and there","rating":4,"date":"6 October 2015","review":"This movie is OK for kids and maybe some teenagers but I would not recommend it for the mass. The camera work and scene editing is amateurish. Some of the transitions and scenes make me cringe and this goes on throughout the movie.<br><br>The acting all around is quite bad. The lead actress Alexandria needs more work. The exception is Mr. Henriksen.<br><br>The script is good for the most part just but without good acting and screenplay it's not going anywhere. Some parts are acted out horribly, especially by Alexandria *cringed*<br><br>This movie is a slight step up from your sci-fi channel TV movies like Sharknado...maybe.","user":"thenekassyni","rank":[7,11]},{"title":"Great family movie with talented cast","rating":8,"date":"1 June 2015","review":"I admit — it was my curiosity of seeing veteran actors Lance Henriksen (\"Aliens) and C. Thomas Howell (\"The Outsiders\") on screen again that initially made me pick up a copy of \"Spirit Riders.\" But what I actually found was a great little family movie that I enjoyed throughout.<br><br>\"Spirit Riders\" is an uplifting story of second chances that takes place at a horse therapy ranch. When troubled teen Kacie (very well played by actress Allie DeBerry from the Disney Channel series, \"A.N.T. Farm\") is ordered by the court to work at the Spirit Riders ranch, she tries to get her life back on track  while helping a stubborn, retired racehorse re-acclimate to life off track. <br><br>The story is simple enough to appeal to kids, yet offers a fresh take on the typical bad-teen-gone-good movie that will hold parents' attentions, too. The cast of young talent did a great job and really held their own against the pros! <br><br>A great family-friendly DVD. Definitely worth checking out.","user":"dmcmahon36","rank":[9,17]},{"title":"Meaningful story that is enjoyable to watch.","rating":7,"date":"1 June 2015","review":"I recently came across the movie Spirit Riders while shopping for a family-style video. The jacket photos and write-up caught my eye and, after watching it, I can say that I was pleased with my choice. I thoroughly enjoyed the storyline. At the beginning of the movie, I wasn't sure that Allie Deberry as Kacie, the main character, would capture my sympathy, but she did. She even managed to evoke a few feel-good tears from me near the end of the movie. One character I was drawn to was Rex, played by Lance Henriksen—kind, tough, and patient all rolled into one. I did disagree with some of the direction in the film; the main instance that comes to mind occurs when Kacie races back into a burning barn to rescue a camper—everyone just watches from a distance (even Rex; they call for her to stop, but not a sole takes a step toward her); no one helps even after she exits dragging an unconscious male camper until she collapses. But while I noticed things like this, they did not spoil the movie for me—there were a myriad of well-done moments and a meaningful story throughout.","user":"cscotten-21986","rank":[3,7]}]