[{"title":"A Long Overdue Documentary on Dennis Hopper's Life and Art","rating":8,"date":"21 January 2018","review":"The prime of Hollywood icon and iconoclast Dennis Hopper finally gets the examination it deserves with this documentary, narrated by Hopper's longtime friend Satya De La Manitou. I had the honor of seeing the film at a screening at the Jean Cocteau Cinema in Santa Fe with Mr. Manitou and Dennis' brother in attendance. Focusing primarily on the period of his post-Easy Rider success as he attempted to direct his avant-garde film The Last Movie in Peru, the doc. offers wonderful circa-1970 footage of Peru and its people as well as of Taos, New Mexico, where Hopper lived and edited the footage. The film also explores his post-drug burnout/Hollywood exile and resurgence years with interesting, often hilarious tales from shoots in Australia, on Apocalypse Now and Wim Wender's The American Friend. While the film sometimes gets a little overdone in the self-congratulatory reminisces of Hollywood bigwigs and the footage of Satya himself gets over-elevated to mythic proportions, the footage of Hopper himself as a man and actor, combating his demons while trying to make authentic art , is what makes this film fascinate and well worth seeing.","user":"Binkconn","rank":[5,5]},{"title":"Poetic, touching and moving.","rating":7,"date":"26 March 2018","review":"There are a few Dennis Hopper documentaries, I have seen some great ones. This one is ultimately different though as it's about Hopper by way of his PA, friend and confidant, Satya de la Manitou.\nManitou speaks candidly but always with love and respect of some of what he experienced in the rise, \"sleeping\" and rise again of Hopper's life and career from Easy Rider and his black balling from Hollywood in making \"The Last Movie\" to his last days and utimely death. Just like in \"The Last Movie\", Hopper's career refused to die.<br><br>This documentary explores some of his private life, haunts, fellow actors and friends that shared experiences with Dennis.\nManitou has a very deep love for Hopper which is beautifully apparent, but never shys away from telling it how it was.\nSome of Hopper's most influential films as a director and actor are looked at uniquely and cements his impact on American counterculture, the movie world and in history.<br><br>Beautifully shot, scored and edited this film is worthy of anyone being a fan of Hopper,film or sociology for that matter.<br><br>Rebel, Icon and outlaw, Hopper may be never intended to be any of those, but he definitely was.","user":"awakeinreality","rank":[4,4]},{"title":"A Cut Above the Rest. Truly Unique.","rating":9,"date":"23 May 2018","review":"A beautifully shot and moving exploration into the artistic enigma that was Dennis Hopper. I didn't know that much about his followup to Easy Rider called The Last Movie before seeing this film and found myself simultaneously inspired and stunned. Great insight and stories here from Hopper's buddies particularly Dean Stockwell, David Lynch, Wim Wenders and Hopper's \"Right-Hand Man\" Satya.","user":"thatguycorp","rank":[3,4]}]