[{"title":"Not that bad","rating":7,"date":"6 February 2017","review":"Okay, I'm old school dude. Like Golden Age of Science Fiction old. Maybe I'm too tolerant. But I'm not the only one! There is a lot of slamming going on here. The truth is this isn't a bad movie. If you want to be cynical then go right ahead and not enjoy yourself. This isn't science fiction. It's fantasy. Most of the gripes I read are legit. There are plenty of things that aren't scientifically correct. The plot is a new twist on an ancient concept. It's a STORY. I like the movie because it was fun to watch. Entertaining. And for a change, not a shot was fired except for rockets. So cut it a little slack and go in and be entertained.","user":"pdofak","rank":[192,244]},{"title":"Fits for ages 12-15","rating":3,"date":"1 February 2017","review":"I went to see the movie as an accompanying adult with my little sister and her friends, who are all 13. The plot seemed promising at first. A kid born on Mars, that's a cool take on Martians, right?. That was not the case. About 30 minutes into the film, I started twitching in my seat, about how little sense it all made. Got worse the more it went on. In my opinion, it was a mediocre story built around a great initial idea. I can't rant without spoiling, so I'll just say that the love story is weak and develops too fast. The kids are supposed to be 16 in the film, yet the 22+ looking Britt Robertson makes Asa Butterfield look more 14 than 16. In my opinion, it's unrealistic and pointless to see unless you are into a super super easy watch and won't get disturbed by stuff like 3 inch thick see-through laptops 16 years into the future; 16-year-olds crashing a plane into a building and jumping off on the last minute before a great explosion like Bruce Willis in Die Hard; half the movie being 16-year-olds making out and stealing cars; and of course a super predictable ending.","user":"lgxd","rank":[178,260]},{"title":"Something we could all use.","rating":10,"date":"26 March 2017","review":"Some of the reviews I have read must have come from those without a beating heart. I finally took the time to watch this film as the reviews were not great. I had an understanding it was a little sci-fi and a lot teenage love story going in. I found the screenplay to be brilliant by such young actors. I also understand there should be some fantastic things in a movie that includes sci-fi so while some of what the teenage couple set out to do seems unrealistic, it fits for what story the director and writer were trying to give us. I wish more adults could express the feelings this movie tries to tell us not to hide, and to enjoy every moment of life that is afforded to us. I found this movie not only heart warming but uplifting and inspiring. Thank you for such a much need film of this type. It has been a while. Take the fantastical with a grain of salt and pay attention to what it is trying to share, we may just all benefit from that thought process rather than the cynical one.","user":"jrodgers-896-904307","rank":[142,208]}]