[{"title":"A delightful film about overcoming some obstacles of youth and aging","rating":10,"date":"28 August 2016","review":"I liked this film because it was entertaining,and I learned something. Many tales are told on screen with similar themes, but this one took me to a place I didn't expect. I am not the savvy movie goer that typically writes reviews on IMDb. I am a patron of the arts, and if a story sticks with me, then I have high praise for the film. <br><br>My criteria for rating the film so high is this:<br><br>Is it worth the price of admission? Is it memorable? Does the look, continuity, and score of the film add or detract from my enjoyment? Is it inspiring? Did I see something new? <br><br>This film did not disappoint on any level.It gave me a glimpse into another culture and enabled my mind to see things from an actor's point of view.","user":"irene122438-804-563184","rank":[59,78]},{"title":"fine performance","rating":7,"date":"14 January 2018","review":"Sir Michael Gifford (Brian Cox) is a celebrated stage actor suffering from a rare form of Parkinson's. His overprotective daughter Sophia (Emilia Fox) struggles to find a caregiver for her grumpy father. Young Hungarian actress Dorottya (Coco König) arrives hoping to start her job as his carer. <br><br>The plot is relatively thin. The characters are simply drawn. Brian Cox laps it all up. Coco König has a simple beauty although her flat accent makes her acting within the acting less than compelling. I am thankful that they didn't force a romance. This is lovely and enjoyable. It may not be ground shaking but it is perfectly fine.","user":"SnoopyStyle","rank":[4,4]},{"title":"Brian Cox!","rating":7,"date":"21 November 2019","review":"The Carer is a pleasant if somewhat sentimental film. The principal characters are Sir Michael Gifford, an aging British theatre actor with a form of Parkinson's disease, and Dorottya, the young Hungarian woman who is hired by Gifford's daughter to be his nursemaid (the \"carer\" of the title). It's a nice story which would have benefitted from being fleshed out a bit more in some areas. We don't learn much about Dorottya's background prior to her arrival at Gifford's estate, but she is spunky and assertive during her interview, and is allowed to stay conditionally, to see how she and Sir Michael will get along (Sir Michael is foul-mouthed, cantankerous and irascible, and has been going through caregivers at an alarming rate - he simply wants to be left alone). We soon find out, along with Sir Michael, that Dorottya has some acting experience herself, and in fact can quote Shakespeare, which of course gives her some common ground with her \"patient\". She is also not put off by having to help him with his bodily functions, and stands up to his verbal abuse, all of which makes her too good to be true: naturally they wind up hitting it off, and she is given the job on a permanent basis.<br><br>There is more to the story, which I won't go into: it's fairly predictable, but still pleasantly satisfying. The writing emphasizes comedy over drama, but it feels a little simplistic and casually tossed-off: Dorottya's mispronouncing of \"carer\" as \"career\" would be a more elegantly comic irony if she made other speaking mistakes as well, but her English is otherwise flawless, so it just comes off as contrived cleverness. Both Dorottya's acting aspirations and Sir Michael's illness are treated as mere plot devices, and IMO the film would have benefitted from exploring them both in more depth, especially since its running time is on the short side.<br><br>I was not particularly blown away by Coco König's performance as Dorottya - she does well enough as the character, but is not convincing when she is supposed to be demonstrating Dorottya's acting talents. Better are Emilia Fox, Anna Chancellor, and Karl Johnson, who all give excellent turns as the people living within Sir Michael's orbit, though their characters could also have been given a bit more dimension in the script. But by far the main reason to check out this film is Brian Cox's tour-de-force portrayal of Sir Michael. Cox is simply phenomenal - his superb performance is the one real standout element of the film, and watching it is like attending a master class in acting. His final scene in particular is spectacularly done, but he is brilliant throughout.<br><br>I also enjoyed Atti Pascay's music, and the film is beautifully shot by Tibor Mathé. Overall, \"The Carer\" is a feel-good movie which, despite some minor faults, is worth seeing for Brian Cox.","user":"volare12","rank":[3,3]}]