[{"title":"Informative but a little bit lacklustre","rating":6,"date":"17 February 2016","review":"Being AP takes you through the journey of Sir AP McCoy's final year as a jump jockey and it also takes a minimal look back at some of his previous moments in horse racing. The overriding message that the documentary provides is that competitive horse riding is a highly dangerous sport and Sir AP is presented as a heroic figure through the reciting of old and new injuries throughout the documentary, and rightly so.<br><br>Being AP has a rather flat mood until the end when it becomes a bit more emotional. Archive footage was well worked into the documentary along with footage that would have been intentionally filmed. I feel that I managed to sit through the documentary because of how I am a big fan of horse racing, however; I feel that due to the rather stagnant mood of the documentary some people may find it a little bit boring.<br><br>Overall, I think the cinematography was good, I think archive footage was used well, however; I would have liked to have felt more emotion from the documentary and seen a few more of Sir AP's greatest moments such as his 2010 Grand National win. The documentary was good, however; it could have been made better through more reflection and it didn't completely capture the true emotion of horse racing.","user":"ryan-eden-1994","rank":[2,3]},{"title":"I am about to watch this film again...","rating":10,"date":"9 September 2016","review":"My heart was in my mouth, I was holding my breath, the sheer emotion of the last act of the film had totally captured me. The film maker, Wonke, has carefully and lovingly crafted a beautiful film. Why do I keep referring to 'Being AP' as a film, and not a documentary? Because in every sense of the way, it is filmic, and tells the fascinating story with a classic three act structure you see lacking in many feature films today. Probably some good editing went on also, I would imagine.<br><br>By the end of the film I had almost forgotten I was watching a documentary, it was like the third wall didn't exist. The film is seamless, and builds to its realistic finale with superlative story telling. The voice over is used sparingly and to good effect. It is only near the end that some of AP's psychology is revealed; the addiction to win, the drive to perform, the fear of failure. As good films do, this film shows not tells, AP's taciturn reserve throughout and almost cruel goading of the host of an awards point towards a life lived in the spotlight and under criticism, particularly of his age and stage. The show don't tell approach may not please all viewers who wanted to know more, or see more highlights of his career depicted, but biopics must slice out a part of a subjects life, and then build the narrative structure with that, not dip in and out of the lifeline of the subject, and the films succeeds because it stays in the present and drives towards its ending like AP with 'the bat out' headed for the finish line and a win. Because that is what an addict needs, their fix.<br><br>The compassion drawn from us by the film maker towards AP and what he will do when put out to pasture is underpinned by the scene where we cringe as does AP, over the peanut butter ad his publicist wants him to do. In the back of my mind I wondered about AP taking up a trainers role, or an owners role, which is often a logical progression, but this is not mentioned - it would detract from the harsh reality of waking up from the dream of his life...<br><br>But it is the emotions that really draw you in, the relationship between AP and his wife Chanelle is bare, they allow access to their lives like people who are used to being filmed and watched in the public realm. The ending is bittersweet for both of them - more sweet for Chanelle who gets her husband back alive, bitter for AP, as his life will never be the same.<br><br>Do watch this film...","user":"claireashton7","rank":[1,1]},{"title":"In the mould of Senna","rating":10,"date":"8 June 2017","review":"Just as with Senna (which I watched with my nineteen-year-old daughter who is left stone cold by cars, let alone Formula 1 - and she was hooked from the get-go) I was gripped from start to finish. You seriously don't need to know the first thing about National Hunt racing or even horses because this film is about what it takes to make a true great - the only difference between A P and Senna is that A P was lucky enough to have faced the decision about when to step down (which is beautifully narrated in the film). Highly recommended.","user":"robinbruce","rank":[0,0]}]