[{"title":"Watch and Enjoy in the moment","rating":6,"date":"17 April 2016","review":"A late 20 live-for-now guy (Jefferson) finds his belated way to adulthood. <br><br>Along the way he temps for a living, sleeps on his friends couch, and lives for the once-a-year opportunity to go skiing.<br><br>Enter a 'rebounding-from-a-relationship' girl (Stephanie), and 3 months of fun and serious sparks ensue.<br><br>A juncture looms for Jefferson, as the push of the past, and the fear of the future, with all its responsibility and accountability, become unavoidable.<br><br>It's a movie with sincere performances, simple story line, some pretty raunchy moments, and a less than typical American ending. <br><br>Watch and enjoy it in the moment :)","user":"mickgmovies","rank":[5,5]},{"title":"Temps: A confused recipe.","rating":4,"date":"15 April 2016","review":"A sort of rudderless comedy, possibly reflecting its Author's (Timothy A. Bennett: you can see him towards the end of the movie, uncredited, introducing Reid Ewing's dance performance) personality.<br><br>It has some good scenes and some good dialogue but in the end it fails to catch: none likes when a story doesn't tell anything. That makes you feel like you have wasted your time watching.<br><br>The film is not completely bad, though. Even if I would not recommend it, it has its good parts: after the least inspired 'before the mirror' scene I've seen in the last 20 years (just few minutes after the beginning of the flick), Grant Rosenmeyer redeems himself with a convincing performance, and so does the whole cast. Ryan Sage's work (editing and direction) seems OK and the same ingredients in a less confused recipe would have produced a different result.","user":"niutta-enrico","rank":[14,18]},{"title":"Out of the cliché","rating":9,"date":"10 August 2016","review":"I've really liked this movie - it's delicate, thoughtful, charming with the good performances. It contrasts two ways of living, which in their utmost are both self-destructive, though in different manners. The day for day living and the living with the job only for the future. The film focuses on the first and catches it very good.<br><br>I've really enjoyed the play of Grant Rosenmeyer and Lindsey Shaw and think they both have a great part in the authentic atmosphere of the story and the persuasiveness of the main characters.<br><br>It's also psychological truthful, it expresses excellent the fear that you're off with something only after you become aware that you've lost it. <br><br>A true movie doesn't need to end as a fairy-tale. It's out of the cliché and it's good for it.","user":"h-stoev","rank":[8,10]}]