[{"title":"The milk of human kindness. Totally enchanting movie.","rating":9,"date":"28 November 2015","review":"I was privileged to be at the premiere of this great movie at the Edinburgh International Film Festival tonight as guest of the co-producer, Simon Mallinson.<br><br>It's a low budget tale with a big human story at its heart that is carried off with consummate ease by its eponymous lead, Peter Mullan.<br><br>Mullan has slowly but surely risen up the star league over many, many years, but few parts can have given him such screen time, such total empathy with the viewer and such character.<br><br>Most people associate Mullan with aggressive, gritty, hard Scottish character parts but this, although gritty and Scottish, is the complete antithesis of that. He plays a long term homeless man that still cares about his appearance and his ability to integrate into his own form of society – his \"real family\" as he calls it.<br><br>It opens on Hector carefully going through his morning ablutions, only for the camera shot to widen and reveal that these are taking part in the public toilet of a northern Scottish shopping centre. Such is the lot of a homeless person that cares about how they look.<br><br>It's a road movie of sorts in that it follows the endless winter migrations of Mullen's character, Hector, North and South across the UK, sleeping in the outdoors, public toilets, motorway service station car parks, shopping centres but more positively in a London Christmas homeless shelter where he has, over the years, become something of a cause celebre.<br><br>The tedium of his life is beautifully realised in the succession of lifts he gets from kind hearted (and possibly lonely) lorry and van drivers and the slow pace emphasises the sheer monotony of a life with no real purpose.<br><br>And his situation, already bleak is heightened by the fact that every step he takes is contorted by some form of unexplained leg pain. Hector's life is clearly far from a picnic.<br><br>But, despite this, what lies at the movie's core is the milk of human kindness.<br><br>Each lift acquired, each gesture of charity (a free cup of tea, a shared meal, the tenderness of the London homeless centre's manager, played beautifully by Sarah Solemani) adds weight to the fact that homeless people are more often than not castigated for their situation, assumed to be beggars, spongers, thieves.<br><br>But, the truth is, each has a story, a reason, for their situation. And it's this kindness that Hector elicits, dramatised in tiny vignettes again and again, that marks this movie out from the usual \"it's grim up north\" docudrama that dwells constantly on the misery of life where one is cast aside from society.<br><br>It would be wrong to explain why Hector finds himself in his own situation, and for so long, so I won't spoil it. It sort of doesn't matter, but we are curious. What does matter is how Mullan crafts his perfectly rendered character into a lovable, sympathetic man and the absolute epitome of what makes people good.<br><br>To that end director and writer (based on a true story) Jake Gavin is to be congratulated on not only what is a decisive and confident debut but also a great human love story that potentially offers more to come.<br><br>Hector could come back, that's for sure.","user":"markgorman","rank":[34,39]},{"title":"Moving Brit Indie of the life of a homeless man","rating":9,"date":"21 January 2017","review":"Peter Mullan ('Tyrannosaur') plays the eponymous 'Hector' in this film. He is sleeping rough in some part of Scotland with two friends and it is deep winter. He is in failing health but seems to just carry on eking out an existence.<br><br>The film follows him on a journey from Scotland to London to a temporary Christmas shelter that he has been attending for years. Here he knows people and sees it as a sort of family. And family is the one thing he has been running from but now feels it is time to reconnect with those from his past. <br><br>Now this is a simple story on first looking at it – but the complexities that lead a person to any given point in their life are never so straightforward and that is the case here too. The film reveals at a slow pace but with absolute charm. This is the sort of film that moves you with its sheer force of story telling and sense of human frailty and as such is a wonderful piece of cinema that I can only recommend.","user":"t-dooley-69-386916","rank":[15,18]},{"title":"An emotional, thought provoking film","rating":9,"date":"9 July 2017","review":"Came across this film on Netflix and enjoyed every minute. Laughed and cried. The acting was so realistic and the characters really drew me in. I was surprise home d that I had not been aware of \"Hector\" before and was pleased to find it. The film brought home the different reasons for becoming homeless and made me and my husband think deeper about how society help. I think that this film should be shown in schools to raise awareness.","user":"ruthconnolly","rank":[9,12]}]