[{"title":"Simply Amazing - Touching & Heartfelt","rating":8,"date":"8 February 2016","review":"I was taken by surprise with this movie. I know that it is classified as a \"gay\" movie but in truth it is a \"human\" movie. It is a story of acceptance and finding our way in life. I could relate to this movie on so many different levels.<br><br>It was touching, heartfelt,romantic, and had some truly funny moments. <br><br>This dealt with an average guy who had an awakening in his life and he decided to share it with his friends. <br><br>It then became a journey for everyone around him - some who accepted and others who did not. <br><br>There needs to be more movies like this as the script was well-developed, the actors truly cared about their roles, the production quality was top-notch, and there was a genuine heart to the movie.","user":"bajmba","rank":[46,57]},{"title":"A sweet film","rating":14,"date":"14 October 2016","review":"This film tells the story of a young man who works as a car mechanic in a blue collar town. He is gay but no one even suspects, hence people are shocked when he finally finds the courage to come out. Fortunately, his friends and family remain supportive of him.<br><br>The nice thing about \"4th Man Out\" is that it is real. The characters and their experiences are real life like. They are ordinary people who faces ordinary things. People can easily relate to the story. There are a lot of funny moments too, and they can also be related to be the viewers, such as Bradstar. I enjoyed watching this film a lot. It is very sweet.","user":"Gordon-11","rank":[17,19]},{"title":"Wow! A touching story about coming out of the closet.","rating":7,"date":"9 February 2016","review":"I saw this as a pure dudes film, and I can't believe how much I like it, and how much I related to it. 4th Man Out is a true testament of what it means to have diversity in film.<br><br>It's about stereotypical frat boy types who have a coming-of age moment when one of them reveals to the others he's gay. <br><br>It's a story of true male friendship as the team adjust to a life changing moment from someone they knew all there life. <br><br>It was funny. I feel like it was design to teach guys how to be a true friend to one another. It has all the jokes from a frat boy comedy.<br><br>On the same level, it's romantic. I'm not into the romcoms yet this one was excellent, as Adam, the fart boy who comes out of the closet tries to find love, and his best friends attempt to help him. <br><br>the movie was just so nicely done. It feels like the filmmakers had a personal connection with the story content and it breathes all over this film. <br><br>Very impressive and worth checking out.","user":"subxerogravity","rank":[34,45]}]