[{"title":"Should go Off the Air","rating":8,"date":"8 June 2016","review":"Great Gertie's Nightgown! I simply cannot believe the glowing reviews this big old turd got. I was bored to tears in 10 minutes--TOPS. Formulaic, hackneyed, unoriginal, and mind-numbingly awful, KILd-TV, sucks.<br><br>A radio station, which employs several people who have the acting acumen of a turnip, offers some sort of REALLY CHEAP chiller TV movies, complete with a host that has the personality of a broom. In fact, he is so bad, he makes \"Svengoolie\" look like an Oscar winner. Anyway, turns out a serial killer is locked inside the station with all these guys taking a break from their real jobs at Jack-N-the-Box and soon the unscary kills start.<br><br>Cheap? Oh hell yeah. Worth paying to watch? Oh hell NO.","user":"dcarsonhagy","rank":[3,6]},{"title":"KILD TV Keeps You Tuned In!","rating":7,"date":"22 March 2016","review":"Kudos to KILD TV for being a Horror/Comedy/Suspense/Thriller plus pulling off all genres in this original Indie! William Collins has Directed an entertaining film vehicle. This is 1st feature written by Channing Whitaker I for one will be watching his future scriptings!The film is set in a TV station with the call letters being KILD-TV. It opens with the ending of the local news segwaying into a Late Night Horror Show Hosted with great delight by a Dr. Perseco(DC Douglas). His new 1st night Producer Adel(Astrea Campbell-Cobb) new to the job/station. Very photogenic supporting cast of actors includes Heather Williams,Grace Johnson,Jared Doreck,Aleeah Rodgers &amp; Dan Braverman. Murder comes to TV with equal parts Hor/Com/Sus it's a bloody good time!","user":"Playball100-1","rank":[6,16]},{"title":"Fun, original horror","rating":9,"date":"14 April 2016","review":"Impressive work for William Collins and Channing Whitaker. Easy to follow story and excellent special effects. Strong acting with a standout performance by Jared Doreck. <br><br>Very original setting for a horror movie. Television employees are locked in the studio and are being killed off one by one. Who will figure out why people are being offed and who will make it out alive?<br><br>Equal amounts of laughs with equal amounts of gore. This one is not over the top, and it is fun to see original faces of death with a television studio theme. It is sure to please fans of the genre. Can't wait for the next installment from Collins and his Eye Candy production company.","user":"rolandcirilo","rank":[2,14]}]