[{"title":"Fascinating film about Democracy and White Supremacy in Small Town America","rating":9,"date":"13 March 2015","review":"Welcome to Leith was well-received at its showing at Austin's SXSW Film Festival. The film documents the peculiar events that occurred in 2013-2014 when a nationally-known white supremacist Craig Cobb moves to tiny Leith, North Dakota (population: 24) with a plan to buy up land and take over city government and make it into some sort of center of white supremacy. Once alerted by the Southern Poverty Law Center (SPLC) the ordinary town folks mobilize to fight back and save their town from Cobb's nefarious plan.<br><br>The odd part of the story is that Cobb's plan seems to be legal. (When he and his partner are finally arrested they almost seem to have been provoked.) There is nothing illegal about buying land and moving into a town. And the first amendment allows him to express his beliefs and fly his Nazi flags no matter how evil and offensive those beliefs may be. The town residents actually seemed to be making excuses to get rid of him such as citing him for not having running water and a sewage system on his property. <br><br>Fundamentally, the film asks the question is democracy about the community making decisions by the will of the majority or is there a basic set of minimum beliefs about human equality that are necessary prerequisites to participate in democratic society? The majority of the town seemed to decide – really quite reasonably - that Cobb's noxious beliefs were so anti-egalitarian that they didn't want him and his cronies to live in their town. They are in some sense intolerant of his intolerant beliefs, but one can hardly blame them.<br><br>Welcome to Leith is beautifully filmed and the filmmakers maintain an impressive level of objectivity about their offensive subject. They let his evil beliefs discredit themselves rather than trying to paint Cobb as anything more than the pathetic nasty creature that he is. The townspeople come off as genuine and human. Perhaps it is a positive sign that this sort of racism is unacceptable even in one of the smallest most isolated corners of the United States. I hope that Welcome to Leith gets widely distributed so that many more people can enjoy this powerful film.","user":"JustCuriosity","rank":[50,59]},{"title":"Good Triumphs, But At What Cost?","rating":6,"date":"31 May 2016","review":"Leith, North Dakota, is a small town. It is the very upper curve on the dot of the 'i' in the middle of nowhere. With a population of less than thirty individuals, it nevertheless prided itself on its small and isolated nature. That all changed when white supremacist chat board demagogue Craig Cobb moved into the neighborhood, and suddenly the small town was the focus of national attention, as Cobb declared his intention to turn Leith into a haven for the white supremacist movement, to live in a place where the \"purity\" of the white race wouldn't be uninterrupted by society at large. Taking advantage of cheap land prices and the town's small government, Cobb ultimately intended to take over the town completely Ultimately, Cobb's dreams of creating a white supremacist promised land fell through, for the same reasons that have plagued the white pride, hate group movement since its inception. Violent rhetoric, preached without subtlety and ultimately self-destructing in a pointless show of force. In total, the grand vision of a white-supremacist utopia amounted to Cobb, a fellow white supremacist and his family, and three others who, at the time of writing, have shown little interest in picking up where Cobb left off. Cobb and his cohort were arrested and forced out of the town.<br><br>But when Cobb had made his intentions known, the media--as the media is wont to do--took off with it, declaring it a battle over the soul of a tiny slice of America. A battle of good versus evil, akin to a real life Western, with the outlaws trading in black hats for shaved heads. And this is the mistake made by \"Welcome to Leith\", as this view of good versus evil overshadows a much more important series of questions raised by the events portrayed in the story: At what point does society at large infringe on the rights of the individual to express their viewpoints, their lifestyles and how far can they go to oppose them?<br><br>A disclaimer: by no means do I support the White Nationalist movement, or whatever other monikers and labels they use to disguise their true, hate-filled intentions. These men have violent intent that can only be described as evil and repulsive. Their views and methods have been the force behind some of the greatest tragedies of the last century. But it is important to note that under our system of freedom of speech and freedom of self-expression, they have every right to express these viewpoints, so long as they do not engage or plot violence and harm. And while it is indeed true that this is exactly what Cobb and his followers have espoused, nevertheless, we also see some rather underhanded deeds committed by those opposed to the invading white supremacists.<br><br>Although it is hard to blame them for their actions, the citizens of Leith nevertheless did engage in campaigns of harassment against Cobb and his followers, vandalizing their property, denying them services, ultimately culminating in a town ordinance being passed that was transparently intended to be solely for the purposes of kicking Cobb out of town. While it is difficult to feel sympathetic towards these particular lifestyle practitioners, it is important to bear in mind that this same action could have been taken against anyone with a viewpoint or lifestyle that clashed with that of the town at large. It isn't difficult to imagine Muslims, Jews, homosexuals, or any other cultural or racial minority receiving similar treatment in the place of Craig Cobb and his white supremacists. Treatment that, in Leith at least, now has legal precedent.<br><br>This is not to say that the citizens of Leith would engage in such behavior. Indeed, it would appear that Leith is a town that welcomes viewpoints of cultural diversity. Yet the lengths at which the town went to remove this element that they detested, supported at large by society due to the controversial viewpoints of the ones they targeted, is an important question to address. One that, ultimately, the film seems to hint at, then promptly ignore in the face of documenting the ensuing, spectacular fall of the white supremacist movement in Leith, North Dakota.<br><br>Ultimately, \"Welcome to Leith\" merely documents a moment in time, hinting at greater, more thought-provoking questions, but does not seem to want to focus on them. Instead, it focuses on the same sensational viewpoint taken by the media at large. The good people of Leith won out over the forces of evil, we have our happy ending. For \"Welcome to Leith\", that is all that we ultimately get.","user":"woobooridesagain","rank":[11,12]},{"title":"Thought-provoking but dissatisfying","rating":6,"date":"25 June 2016","review":"The story is fascinating, but the execution is lacking. Despite the filmmakers' attempts to market and portray the film as a thriller, it misses the mark. (SPOILER) The only \"violence\" committed by Cobb and Dutton is antagonistic speech intended to provoke reaction. <br><br>Whether unwittingly or not, the filmmakers almost help the viewer empathize more with the supremacists than the townpeople, because more film time is dedicated to the supremacists' reflections. Personal hateful behavior is displayed more thoroughly on the townpeople's side -- (SPOILERS) the gathering of angry mobs verbally berating the supremacist newcomers, the burning of supremacists' homes. <br><br>The film leaves you feeling a profound sense of dissatisfaction. Cobb doesn't get the justice the townspeople think he deserves. The viewer is left unsure as to what the proper amount of justice would be, who is the true victim, and which group has a worse mob mentality. WELCOME TO LEITH is thought-provoking as a documentary but not the fast-paced thriller it was hyped to be.","user":"janetnotjackson","rank":[9,11]}]