[{"title":"A Rambo clone in the woods that likes to smack people in the face","rating":5,"date":"24 August 2016","review":"It appears to be the be first script that Paul Logan has written, which probably explains the excessive martial art fighting scenes involving himself and opportunities to take off his top! ha ha The horde was obviously made on a pretty small budget and considering this, I don't want to slam it too much. The movie as a whole is kind of weird mash up of Rambo, Universal Soldier and perhaps a pinch of Deliverance meets House of 1000 Corpses? As an intended horror, I don't think its particularly scary in any way but its got some good gore factor in there for you in that's your thing. The teacher to student talk about being a virgin was an obvious set up for a B movie unneeded gang rape which was pretty cringe worthy and I guess in place for the lack of frights to this movie. The story itself is pretty shaky and doesn't really develop past being in the woods and in danger. The direction of the stereotypical characters in scenes is not the best nor is the explanation for these weird people being in the woods doing what their doing in the first place. However, the whole point of this film is obviously to get to the kicking arse part of the movie where the Rambo type character of John Crenshaw gets to descend on the town, does his arse kicking and attempt to rescue his group. I would say that on a budget the SFX are actually pretty good surprisingly. It was worth a watch in short but it wont need a second viewing.","user":"monkey_ross","rank":[5,5]},{"title":"I've seen better character development in a game of Guess Who.","rating":2,"date":"7 May 2016","review":"I will give credit where credit is due, the set design and makeup is decent, but that's is it for the positives for this film. This movie wouldn't be enjoyed by anyone with a mental mentality over a 12 year old's. The characters are as cookie cut as they come, the snobby rich kid, the over sexed teens, and you just want them to hurry up and die faster so you don't have to cringe at their presence any longer, I don't think you were meant to side with the murderers in this movie, but that's what it makes you do. at one point I was saying to myself \"they better make that douche suffer\" Our hero in this movie, the ex Seal is incredibly unbelievable, due to equally bad acting and fighting choreography. Having making a thing about being \"aware of your surroundings\" you could sneak up on this idiot on bubble-wrap carpet while tap dancing in golf shoes.<br><br>The thing I found most infuriating about this movie is the Seal was trying to save his girlfriend and the cookie cut kids but wasted all these precious moments in the woods building elaborate booby traps, with the hopes that a single antagonist would stumble through, among the dozens, while he was playing Rambo in the woods, his main objective was being raped and murdered, it wasn't until the climax that he decided he had enough of playing Hunger Games in the woods and decided to go save his girlfriend.<br><br>The whole movie was just a sloppy, badly thought out mess, and a complete waste of time, so hopefully you will decide to not endure this film like I have.<br><br>2/10 set design and makeup is the only thing that justified not giving it a 1/10.","user":"james_shaw1990","rank":[17,24]},{"title":"Paul Logan's pecs are the star","rating":2,"date":"2 December 2016","review":"No doubt the reason for a brand of whey protein a power drink are thanked in the credits to \"The Horde\" is because they helped keep its multi-functioning star Paul Logan -- who also wrote, produced and did fight choreography -- shredded and pumped. Logan's big biceps and lean, mean torso are the main attraction of this turkey, and a few more shirtless scenes would have been welcome. There's not much else to look at or appreciate.<br><br>Logan plays a SEAL who accompanies his fiancé, the world's worst nature photography teacher at some kind of probably for-profit rip- off college, on an \"extra-credit\" class camping trip. She has great advice like \"try different settings\" and \"experiment,\" and inspirational pitches like \"there's beauty everywhere.\" Her remedial students aren't terribly interested in photography and seem barely able to hold a camera -- one could be forgiven for thinking the film's title refers to them instead of the group of inbreds who kill, kidnap and torture them in the woods, until of course the muscular Logan snaps into action. The students are all either one thing -- the spoiled rich kid is just a spoiled rich kid, the horny couple is horny all the time -- or nondescript. Logan the screenwriter hasn't mastered creating characters that are remotely lifelike, even his own is one-dimensional. That's probably why they cast terrible actors -- why waste the money on good actors when you aren't giving them anything to play?<br><br>This is a combination trip-to-the-woods horror film and \"Rambo\"/\"Missing in Action\" style military action film. I guess we are too far removed from Vietnam for Logan to be re-fighting that war, so instead he picks off mutants of the horde the way Chuck Norris used to pick off Viet-Cong. Unfortunately, the mutants are about as uninteresting and uninspired as the hapless soldiers were, which is a problem for the horror-film part of the story. Costas Mandylor does a good job as the horde's opportunistic ring-leader, and Matthew Willig looks suitably imposing as his main henchman, but isn't given enough to do. Considering how much build-up there is to the fight between Logan and Willig, it is really disappointing that it didn't turn out better. Logan the fight choreographer is fine if not innovative, and Logan the actor is good at action, but director Jared Cohn doesn't have a knack for shooting action sequences in a dynamic way, at least not on this film's obviously limited budget. There is less of a sense of place (it isn't set anywhere specific) or realism than in ultra-low-budget films like \"Deadly Prey\" (to which this owes a debt). They are about as deep in the woods as your average company picnic, yet somehow this mass of mutants has lived there for decades unnoticed by the people of Topanga, where this was filmed, or the staff of the Burger King that is probably 10 minutes away from the location shoots.<br><br>One oddity: Don \"The Dragon\" Wilson, for my money the least interesting action star of the 1990s, has an entirely pointless cameo. I guess they couldn't get Norris.","user":"michael-3204","rank":[7,9]}]