[{"title":"Good thriller with the creepiest n most effective villain of the Department Q films.","rating":8,"date":"29 April 2017","review":"This is the third installment in the Department Q series. Saw this few days back on a DVD. It begins with a message in a bottle from disappeared children. The movie starts as a kidnapping drama n then turns into a serial killer thriller n later explores the importance of faith. Some may compare this to Prisoners, True Detectives S1 n Marshland. Nonetheless it is a very solid crime thriller. There is sufficient tension n good amount of atmosphere. The cinematography was gorgeous. This time the movie has some decent action sequences too. Trains, helicopters, car chase. Our two leading detectives, Nikolaj Lie Kaas n Fares Fares acted good. The guy who played the serial killer acted well. He is the creepiest and most effective villain of the Department Q films.","user":"Fella_shibby","rank":[20,26]},{"title":"Dark and intriguing Nordic noir","rating":7,"date":"24 June 2016","review":"I saw Norwegian director Hans Petter Moland's recent film In Order of Disappearance (2014) a couple of years ago. I was very impressed with that Nordic noir which was both very humorous and inventive. A Conspiracy of Faith is another thriller but one with quite a differing approach. It dispenses with the comedy of the earlier film and instead goes for a pretty downbeat approach. Hardly surprising really when you consider that the story is about two cops investigating the case of two abducted children. This kind of material is always one that is going to be somewhat dark, another recent north European film The Treatment (2014) dealt with this subject in a very head on manner and consequently was very disturbing indeed in places. A Conspiracy of Faith only goes so far with its dark material and by the end of the film slightly dissipates its impact further by having its narrative go into more standard thriller territory. But despite that, this is still another compelling bit of Nordic noir.<br><br>There are strong acting performances throughout, with a return performance from Pål Sverre Hagen - so memorable as the hilarious vegan crime boss from In Order of Disappearance - as the cold hearted psychopath. The story has added interest in that it mixes in themes of religion, with the killer himself solely targeting children from deeply religious families, exploiting the fact that these people have more faith in God than in the police. So there are a few distinctive elements interwoven into what otherwise may have been a standard serial killer thriller. I would probably rate this as less interesting as the more ambitious In Order of Disappearance but it still remains yet another pretty impressive Scandinavian noir.","user":"Red-Barracuda","rank":[22,35]},{"title":"Major disappointment compared to first two films","rating":3,"date":"3 February 2017","review":"Keeper of Lost Causes is one my favourite films of all time. When I recently discovered the 2nd and 3rd films I could barely wait to see them.<br><br>This one however did not live up to the production of the first two and I am amazed that no one else has called all the impossible, nonsense things the plot is dependent on and clichés galore. I'm sure I won't dissuade you from watching but the 2+ hours sure dragged for my partner and I.<br><br>****Spoillers**** After cliché of kidnap victims not wanting cops involved (OK in the scheme of things) the father gets on a normal German EC train. Cut to the next scene and he's on an ICE express. Then it gets better as the baddie calls him and tells him to throw the money out of the train - so the Father just opens the door of a moving train doing 200+km/h - wth??? What train even allows a door to open without an emergency stop. Then he jumps out and is OK. Later in same scene cop gives chase and seemingly to drag the film out only rings in the ambulance call and doesn't put out an apb to the helicopter they have on the operation with a description of the car or license plate. Heavy sigh.<br><br>Of course the killer is so confident he comes to get the father in hospital and it turns into keystone cops again.<br><br>This film just lets down the other two and even now makes me want to eye roll. If in doubt think of the Department Q series as a two film series and not a trilogy. Painful.","user":"jonb-78337","rank":[20,33]}]