[{"title":"I spit on this film","rating":1,"date":"24 April 2019","review":"This has got to be a contender for the worst sequel of all time title. I was so looking forward to this as I really enjoyed the first one all those years ago and was interested in seeing where Jennifer Hills character ended up after the first movie. But whoah! I didn't expect this dross.<br><br>I've no idea who this is even aimed at, it's not shocking or graphic, it's so badly written and poorly acted and is full of some of the most awful characters ever put onto film.\nMaria Olsen's character is so weird and over the top that she ruins every scene she's in. There's countless scenes where people just turn up at the right place and time to push the film onto the next scene, almost as if they have psychic powers and teleportation devices. (Oh look, our main protagonist just ran off into a massive forest and within seconds runs straight into the bad guys who are standing around at the exact spot for her to run into, what a coincidence)<br><br>All the hicks in the film are depressingly over the top, idiotic and weird. The main heroines in the film do some of the most stupid things imaginable, it leaves you face palming yourself every few minutes, like seeing one of the villains coming towards you with a knife and despite you having a gun in your hand you........TURN YOUR BACK ON THEM AND START BANGING ON A DOOR, It's cringeworthy to sit through.\nSome of the dialogue in this abomination seems like it was written by a depressed crack smoking teen, seriously, you won't believe how bad some of the lines are. I spent half of the film cringing and wincing at some of the things the bad guys come out with.<br><br>The main woman in this film is supposed to be the worlds no 1 supermodel who turns down half million dollar offers for fun, yet come on, while she's not a particularly unpleasant woman to look at, there's no way anyone who looks like her would be the worlds most famous model, they didn't even try to get someone stunning for the role. Even her hair and clothes suggest she's just an average woman, there's nothing glam about her whatsoever, so taking this serious is hard to do.<br><br>The film rolls in at nearly TWO AND A HALF HOURS and there's a reason for this. Countless scenes of things that should last a few seconds like a character raking up leaves that go one for minutes at a time. Scenes of dialogue that just go on and on without ever adding to the story etc etc<br><br>If you found any joy in the 1978 film or any of the reboot trilogy, then avoid this one, it's woeful.","user":"papadeltazulu","rank":[108,118]},{"title":"If you like to waste precious hours watch this","rating":1,"date":"24 April 2019","review":"Awful acting, on what could have been a classic, the film drags on, the violence is tame, really was a waste of 2 hours 38 mins.","user":"rickywallace","rank":[64,70]},{"title":"What a way to destroy an iconic franchise.","rating":1,"date":"25 April 2019","review":"Pathetic, there are no actors, I swear they picked a few people off the street to continuously scream and read long boring monologue. Such a total disappointment, don't know how it even made it to a screen, should have been buried in a grave a spat on.","user":"donnaivyecho","rank":[52,58]}]