[{"title":"Don't be fooled by many of the reviews; Swiss Army Man is a rigorous and unflinching portrayal","rating":10,"date":"15 November 2016","review":"In my view, Swiss Army Man is an unflinching and clinical documentary of the emotional life of a mentally ill, severely repressed adolescent boy named Hank, whose diminished mental capacity has been exacerbated by a repressive and dominant father. The father's violations have induced excessive shame with regard to normal bodily functions (farting, pooping, fantasizing about girls, masturbating); the boy is disturbed by the powerful sexual urges experienced by any teenager, and is painfully shy, lonely and socially isolated. Hank has been laughed at by others; his father has called him retarded and presumably diminished his sense of self in plenty of other ways. His mother appears to be kinder towards him but his father is dominant.<br><br>Seeking love and kindness, Hank has fixated on a girl on the bus. He knows where she lives, runs away from home, and camps out in the woods by her home. All he has to eat is some junk food and soda. He quickly runs out of food and drinks bad water from a stream. With such a poor diet his body is exhibiting gastrointestinal problems and he's farting and pooping, shaming him further. He's having the normal erections and lustful thoughts of a teenager and is haunted by guilt and repression. His loneliness and sense of isolation manifests in a delusion that he is living on a desert island. He decides to kill himself but the rope he assembles from litter in the woods comes apart. Something triggers a deeper psychosis: perhaps the failed suicide attempt; perhaps he truly discovers a corpse in the woods; or perhaps he \"simply\" drops into a more manic episode. In any event he resolves his shameful feelings by splitting into two personalities, constructing an alter ego, Manny. It is Manny, not Hank, who is doing all the farting, having all the erections, having the mother fantasies. He is in two minds about whether to give Manny his fantasy about the girl since he wants to keep her for himself, since she is Hank's hope for rescue from his torment, his deliverer of love and affection and sexual gratification. In Manny all the shameful body functions become legitimized: the farts become a form of locomotion, the erections become the compass to the girl (she is after all the focus of these). Hank's euphoria (racing through the water on top of Manny) suggests a manic high.<br><br>Manny speaks with Hank's own inner repressed voice, or perhaps his mother's voice, telling him there's nothing wrong with his sexual desire, or his farting. Manny articulates his confusion about being laughed at and being called retarded. While Manny takes the role of Hank, Hank dresses as a woman, as the girl he wants to love him, seeking some kind of comfort and intimacy, trying desperately to fulfill his own needs by himself, trying to reinvent his life and find some emotional rescue. He tells Manny how to be attractive to women, how to walk and talk and wear shades, while admitting his own shyness and lack of courage. Manny meanwhile also \"saves\" him from his physical distress, becoming his magical source for the food and water he doesn't really have. In the woods Hank also encounters the normal life of the American northwest, a raccoon, animal sounds in the bushes, juniper berries that make him sick. A sewage pipe across a stream (source of the dirty water he's drinking) becomes in his imagination a dangerous crossing over a great river. He falls in and is \"rescued\" by Manny.<br><br>An encounter, real or imagined, with a bear finally drives Hank out of the woods, perhaps wounded. The sad story ends when he emerges into the back yard of the woman he has fixated on. She discovers him talking to her young daughter, gets her child away, and calls for help. Hank only sees that she is caring for him. Things now start happening very quickly: the police and social services and Hank's father arrive. His father walks away from him, rejecting him once again. Hank runs off and is chased and brought back. He rationalizes this experience of \"rescue\" into a new script where everyone now understands and cares for him. He has been welcomed home, his father gives him the slightest nod of approval, an indication by the filmmakers of how Hank is converting the most insignificant signals into experiences of approval and understanding. Everything will be OK. Manny no longer has a role; he takes off, seen by everyone to be taking Hank's shame with him. Hank is now in the hands of others, believing in his salvation while doubtless en route to medication and mental health services.<br><br>The film is quite unflinching in its portrayal and gives away nothing. It is a sign of its success that the emotional experience of the viewer is not sadness for this terribly sad story, but of bewilderment and an uneasy humor. Viewers have reported a wide range of responses: leaving early, disgusted by the \"cheap laughs\"; feeling that it delivered an immature, childish philosophy; experiencing it as a profound meditation on modern life and death. But in fact the movie does nothing more or less than attempt to describe an episode in the life of a disturbed, possibly bi-polar or schizophrenic, certainly repressed and emotionally violated young man. Whether the depiction is psychologically accurate I am not qualified to say, but the preoccupation with farts and sex and childish philosophies are not those of the film makers but of the young man being portrayed. It is to the credit of the film makers that they never deviated from this portrayal and never made any attempt to distinguish themselves from the subject, to the extent that many people may be entirely mistaken in their interpretation of the film and of the directors' abilities and intentions. That is both courageous and skillful. Well done Daniels!!","user":"mike-82085","rank":[234,276]},{"title":"For everyone who thinks this movie is just fart jokes...","rating":10,"date":"30 August 2018","review":"I was compelled to respond to all the 1 star reviews. As someone who actually really dislikes fart jokes, finding them to be lazy writing that only attempts to appeal to the lowest common denominator, I can sympathize with anyone who would be skeptical of this movie at first.<br><br>But I love this movie. These are not merely fart jokes, but a much deeper and richer metaphor. There's another review on here that goes into some length to describe how Dano's character Hank is an unreliable narrator, a troubled and delusional, suicidal man in the midst of a mental breakdown. While I find that review to be an accurate reading it doesn't fully explore the film's use of metaphor which function on many levels. The first level is the film's plot itself which can be read as everything we are being shown is really happening, or that we are seeing things from Hank's perspective and he is hallucinating and delusional.<br><br>But to go deeper than that, this is a movie about shame and repression so strong that it makes you unable to express your own inner feelings. It directly comments on this in numerous ways, through the long discussion of Hanks's shameful feelings about masturbation, how he constantly tells Manny not to do things because people will think he is being weird. Manny is doing what comes naturally and just being honest and talking without filters. Everything is new to him and he approaches the world like a child, wondering and asking questions about everything.<br><br>Manny is innocent and has not learned shame yet. Society shames all of us, and teaches us that there are right and wrong ways of behaving. There are proper ways of behaving in public, and as children, when we act naturally, we are usually shamed, maybe even punished for breaking the rules of polite society. These rules rely on numerous pre-concieved notions but are in actuality completely arbitrary. The idea that a fart or a boner are gross are value judgement that rely on the idea that there can be something wrong with our natural body functions. Thus are we taught to be ashamed of our own bodies, taught to conceal nudity and hold in our farts.<br><br>I could go further into how religion and polite society frame innocent body functions as perversions, but Hank's insecurity extends into shaming of other behavior, his repression is so extensive that he is uncomfortable in expressing basic emotions. <br><br>This is explored through the recreation of meeting the girl on the bus, and how someone without preconceived notions of right and wrong behavior and societal repression would approach the situation entirely differently. Dano is so afraid of how other's might perceive him that he never approaches this girl he feels a connection to, Hank is his un-repressed inner asking him why anyone would ever stop themselves from doing what would make them happy.<br><br>So this movie is questioning society's arbitrary rules, public shaming that causes social anxiety and shyness and forces people to conform to socially acceptable behavior. It uses body functions as a metaphor for that. Farting in the film is a metaphor for holding feelings inside or hiding your true self. In the final scene of the film Hank lets out a fart in front of other people in a last desperate attempt to revive Manny, Manny who represents his inner child. Throughout the film he brings Danny to life by letting go of and coming to terms with his inner repression, learning to re-approach life with playfulness, curiosity, and creativity, as a child would. So in that final scene he is \"letting go\" of his repression.<br><br>There is one more level that all of this operates on, and it's here that I have to say that I have pity for people who could not see any deeper meaning in this film. Because it confronts the ways in which we take ourselves too seriously, when in reality part of the human condition is living in these strange and amazing and earthy vessels we call bodies. And bodies are amazing things that operate on a level of complexity that science still struggles to understand, outright magical in fact. But we ignore that magic and instead frame our viewing of our bodies with shame and repression. The film playfully confronts us with bodily functions in order to make us confront our own relationships with our bodies. As someone who normally despises bathroom humor I was amazed to find myself laughing out loud and feeling outright joy at moments of reveling in bodily humor that were outright triumphant.<br><br>This is in part a movie that tries to teach us to enjoy life by taking it less seriously, by showing us a man who is learning to do the same. And so if you despise this movie, I think if you spent your time doing nothing but trying to learn to find enjoyment in this film, and trying to understand why other people do, you would find yourself letting go of repression and finding empathy beyond what you knew you were capable of. I think it would be entirely worth it.","user":"orion-canning","rank":[63,71]},{"title":"Swiss Army Man - Movie Review","rating":8,"date":"26 September 2016","review":"\"If my best friend hides his farts from me then what else is he hiding from me, and why does that make me feel so alone?\"<br><br>Never would I expect a farting talking corpse would've turn out to be a good movie. Even on paper, this idea sounds awful, but it's one of those things that manages to work out. I always hear people complain that movies just ain't that original anymore, with the endless reboots and the unnecessary squeals. And then you get something like this that's so different. Something so bizarre, weird and original that it's executed in a way that it actually works as a movie.<br><br>There's something deeply beautiful and very relatable about \"Swiss Army Man\" that I know a lot of people won't agree. It isn't for everybody. I mean, just look at the reviews for Sundance and the reports of walk outs during the movie. But then again, what do they know.<br><br>Daniel Scheinert &amp; Daniel Kwan bring a sweet and a very surreal study of the human condition that's done so uniquely. Making farts jokes seem so poetic.<br><br>This is Daniel Radcliffe at his best and while he's character may be dead, there's still heart within him. Paul Dano who really has been impressing me over the past years is really great in this. Radcliffe and Dano brought a sense of friendship and a real chemistry that after awhile it kinda over shadows the wackiness of whats going on. Some people may find the scenes between them too disturbing or creepy, and I can totally understand that. But it's something that's hard to explain really. Even if you try to put together why something like this worked, but it never fully clicks in your head as the correct answer. Well, what can I say. Movies make you feel something man. <br><br>Overall rating: I'm no gonna lie, I teared up a bit while watching this. Yes, a farting corpse movie actually made laugh, cry and think differently on things. <br><br>WOW.","user":"MattBrady099","rank":[215,272]}]