[{"title":"Extraodinary","rating":10,"date":"16 September 2018","review":"It is one of the most powerful documentaries I've seen. \nMoving, reveling and completely life changing.\nThanks to all the people involved there is a story, there is evidence of a shameful present. Hopefully the voice of this brave women and men will be heard loud enough so organizations, governments and ordinary people with take a bold stand against this atrocities. \nBRAVO!","user":"agoldstein-20418","rank":[4,5]},{"title":"Powerful, heartbreaking and joyous film","rating":10,"date":"10 January 2017","review":"Holy Cow this film! I have a basic awareness of what is going on in the Congo, but this film really brought home the daily struggle for so many women. The film told the amazing story of the building of City of Joy, a safe house for women and of the three mavericks who made it happen (Dr. Denis Mukwege, Christine Schuler Deschryver, and playwright Eve Ensler. The women who live and work at the City of Joy have faced mind boggling atrocities but find the will to go on every day. <br><br>I cried and cheered for these women. They are my roll models, inspiration and motivation. <br><br>The film shows just how much can be achieved and how much more we have to do. <br><br>See it!","user":"kathleendrohan","rank":[6,9]},{"title":"Powerful In Two Ways, Sad and Inspiring","rating":9,"date":"7 September 2018","review":"I've always said that Netlfix nearly constantly puts out some of the best documentaries and docu-series, and this is another accolade to be proud of. An interesting documentary in the sense that it conveys a wide range of emotions, from crying about the horror these women experience, to crying out of joy that they are strong enough to face it and still not give up. Congo has been a nasty place for a very long time, from its dozens of pre-colonial civil wars, to its horrifying compliance in the slave trade, to what we see in this documentary happening today. Congo has faced many civil wars and regular wars in recent years, with a few mass starvations and genocides, so one should understand what they are getting into when they watch this film. Its a tough one, but in a way, a beautiful one.","user":"neener3707","rank":[4,7]}]