[{"title":"8 out of 10 for a film of this kind","rating":8,"date":"18 August 2018","review":"So I'm scoring this based on my personal opinion, and classed it as a low budget. I'm not comparing it to any other \"type\" of movie to give an accurate reflection.<br><br>I watched it because it was fun, on sky and Welsh. Do I regret it... Hell no. Will it win Oscars also no. This is down to earth fun, solid acting, solid plot and well written. They've seemed to make the best with what they had and the end result is a high end low budget movie. I would recommend for sure but don't pull it apart and try to make it something its not... just sit back and appreciate the ride.","user":"kryptkicker-30845","rank":[16,20]},{"title":"Canaries: I expected more","rating":4,"date":"10 March 2019","review":"So this was advertised to be a Welsh Shaun of the Dead-like sci-fi comedy, sadly it fails hard on most fronts.<br><br>It tells the story of a group of friends celebrating new years just as an alien force makes their move against mankind.<br><br>The characters are pretty plain and lack gimmicks and the aliens are, well they're basically pale dudes with Lady Deathstrike fingers and they wear..........raincoats. So, yeah.<br><br>Comparing it to Shaun of the Dead is optimistic, this just isn't funny. There are a couple of laughs to be had but not enough for a feature movie, in fact in places it gets very serious for extended periods and you forget its a comedy at all.<br><br>From a sci-fi perspective it really hammers home the X-Files conspiracy nonsense that is going on in the background away from our heroes, and that's about as interesting and engaging as a 60 minute special on shoes.<br><br>Not funny, not interesting and the aliens quite frankly look ridiculous. But wait, the worst part is yet to come! The movies ending, is well............it doesn't have one. Things happen, then you're hit with a to be continued and the credits roll. So this is an incomplete film and chances are it won't get a sequel so it'll never be continued anyway.<br><br>Should have been better but they just didn't have much to work with.<br><br>The Good:<br><br>Some great writing<br><br>Robert Pugh<br><br>The Bad:<br><br>Comes across as cheap in places<br><br>No ending","user":"Platypuschow","rank":[11,14]},{"title":"In tune","rating":7,"date":"19 October 2017","review":"The movie played at Frightfest and it arguably had if not the best introduction to a movie, then definitely one of the best. The main actor got conned into stripping (only partly, upper half, but still a hoot for all the women and some men I guess, but fun nevertheless). And it all was setting the mood for one very funny movie.<br><br>The main character, a radio DJ, who is past his prime, goes back to his roots. For financial reasons of course. What he doesn't know: there are things happening outside of his realm ... literally! But while the dialog is amazing, the script may seem a bit convoluted in general, especially when it comes to coherence. Still that takes not much away from the fun you can have with this. Just roll with it and it's idea, that is really out there ...","user":"kosmasp","rank":[11,15]}]