[{"title":"Hilarious light-hearted movie","rating":9,"date":"22 April 2016","review":"Addicted to Fresno is full of artfully-crafted deadpan situations that probably created quite a few amusing bloopers. The star Natasha Lyonne has great control of her expression. The other actors and actresses complement her talents well, but she really stood out.<br><br>Presumably, this was a low budget movie but nevertheless the cinematography was excellent. As a photographer, I often was impressed with how well the lighting was controlled (for example, the poetry scene on the loading dock; scenes in the hotel hallway, never a good lighting situation; the pet cemetery scene). OK, maybe most people wouldn't care about these details, but if the producer had not properly lit these scenes, the movie would not have been as pleasant to watch even if nothing else had changed. Appreciate what you don't notice as much as what you do notice.<br><br>Don't look for any deep philosophical plot; just take the movie as the comedy that it was intended to be. Loved it.","user":"ecf-48492","rank":[9,10]},{"title":"How Sisters Can Sink Each Other","rating":4,"date":"17 September 2015","review":"Greetings again from the darkness. It's not quite a unicorn, but it seems fair to call it a White Harbour Porpoise. Yes, it's that rare to see a Comedy movie written by a woman, directed by a woman, starring women in a story about women. And it's that rarity which makes it all the more disappointing when the finished product doesn't match the expectation.<br><br>The cast is loaded with funny people, many of whom are best known for their work on TV. However, that's not what makes this feel like an aimless TV sitcom straining too hard to make us laugh, often through cheap shock value. The movie leaves us with the feeling that writer Karey Dornetto (\"Portlandia\") and director Jamie Babbit (But I'm a Cheerleader, \"Gilmore Girls\") have spent too many hours studying the work of Judd Apatow, rather than letting their own voices speak. We are teased with glimpses, but mostly just left wanting.<br><br>On the bright side, Judy Greer finally gets a lead role after seemingly hundreds of support roles where she has often been the best thing about a movie. Yet somehow the filmmakers manage to dull Ms. Greer's natural glow as she plays Shannon, a registered sex offender with little desire to break her sex addiction, or even become the least bit likable. The very talented Natasha Lyonne plays Martha, Shannon's younger lesbian sister who is her personality polar opposite, yet never can quite escape the \"bad luck\" following her around.<br><br>Martha decides to make Shannon's recovery her mission in life, and secures her a job so they can work together as maids at a local motel. What follows is an accidental murder, a frantic attempt to dispose of the body, a mentally challenged housekeeping supervisor, multiple instances of sexual confusion, a sex shop hold-up, blackmailing pet cemetery owners, a profane rapping boy at his bar mitzvah, an inappropriate relationship with a therapist that breaks up a marriage, and a running gag with a chubby hotel guest in a Hawaiian shirt carrying a little dog. All of that zaniness leads to a disproportionately few number of laughs, although we do get a terrific Cousin It impersonation and an extremely rare (maybe a first ever?) Hammer-throw joke.<br><br>What's lacking here, despite the best efforts of Ms. Greer and Ms. Lyonne, is any semblance of humanity or realism  necessities for comedy. We just never make any connection with the main characters. The supporting cast provides numerous diversions and feature the familiar faces of Ron Livingston (the therapist mentioned above), an underutilized Aubrey Plaza, Molly Shannon, the duo of Fred Armisen and Alison Tolman playing opportunistic small business owners, Jessica St Clair as one of the more emotional front desk clerks you'll ever see, Jon Daly as one of the more unfortunate characters, and Malcolm Barrett as Shannon's latest love interest/poet.<br><br>Of course, in keeping with the film's title there is a never-ending stream of insults directed at the city of Fresno. If that much attention had been paid to the sister relationship and the forming of characters, perhaps the comedy would have been more effective. Instead, if you are all set on watching sisters working together in the clean-up business, the better recommendation would be Sunshine Cleaning.","user":"ferguson-6","rank":[12,15]},{"title":"A lot of bad reviews for a not that bad of movie","rating":7,"date":"24 April 2017","review":"Apparently a lot of reviewers hated this movie and I honestly don't get why. It's an easy to follow movie, nothing too complicated, but still an enjoyable movie to watch. And sometimes it's nice to just relax and watch movies like this one. It's not the most funny comedy ever but it has it's funny moments. Most of the actors are normally more acting in TV-series but they do an okay job in Addicted To Fresno. Maybe I'm a bit biased because they come from series like Orange Is The New Black, Portlandia, and Parks And Recreation, and those are all shows I really love. I just watched this movie because I wanted something lighthearted with some humor and that's what I got so I can't be disappointed.","user":"deloudelouvain","rank":[4,4]}]