[{"title":"Unflinching and brutal serial killer romance","rating":5,"date":"16 January 2019","review":"Conducting a rampage of extreme prejudice, a savage killer targets women as he tries to find a compatible woman to engage his fantasies in, eventually catching the eye of a female serial killer who's just as sadistic as he is forcing them into a deadly and dangerous showdown.<br><br>Overall, this was an exceptionally enjoyable piece of exploitation sleaze. This is one of the strongest aspects of the film and is given to us immediately at the outset of the film, which is the exceptionally brutal and challenging murder scene of the killer targeting several victims and graphically tortures them in wholly demented fashion as his rants about his intentions go unheeded. Its unflinching mentality makes for a truly immersive experience the first thing you see in a film, and to see how he carries out his work cleaning up after himself in the bloodstained aftermath immediately afterward tells a lot about his psychotic nature. That brutality is carried over and rightly topped by us following the woman around. Arguably going for a more brutal approach with her frenzied and relentless stabbing that's generally targeted at their private regions, the montage that opens her story offers us an even stronger glance at what to expect within here the focus on both disparate people come together is the focus here. The final confrontation that occurs, a full-on hard-hitting brawl with each other smashing objects, pummeling and cutting each other or stabbing the other, is an exceptionally tough and brutal sequence to get through as they lay into each with a rawness that's incredibly vicious and realistic long before it unveils the savage twist for their physical beings. This is all truly fun if not enough to overcome its minor flaws. The film's biggest issue is the fact that there's just so little info that the film simply feels short. While the idea is surprisingly effective in how it's realized, the lack of depth into each individual manages to somewhat undo the idea that each person is mentally deranged. There's something to be said for how two individuals come together, but the way it's handled here where they just come together as a stroke of luck rather than being drawn together due to one picking up the other to continue their individual rampages and then discovering what the other does for a living just comes off as a sloppy mechanism. As well as some questionable tactics designed to get a misguided attempt at nostalgia that's just distracting, there's not much else really wrong here.<br><br>Rated Unrated/R: Extreme Graphic Violence, Graphic Language and Nudity.","user":"kannibalcorpsegrinder","rank":[5,7]},{"title":"most unusual love story ever filmed. Ever. Ever.","rating":7,"date":"24 September 2019","review":"... yet very few cineastes will have the stomach to watch it from beginning to end.<br><br>No, it is not torture porn. Nor is it shlock in the grand western tradition of LAST HOUSE ON THE LEFT.<br><br>It is a distinctly Japanese attempt to explore the nature of the relationship between men and women.<br><br>This is made crystal clear by seemingly random cutaways to a \"too cute to live\" teenage couple who talk earnestly about male-female relationships, while the real exposition of the topic is left to the central characters. Who say almost nothing. But actually show us the dark side of the topic by their actions.","user":"A_Different_Drummer","rank":[6,12]},{"title":"I didn't understand","rating":1,"date":"25 October 2019","review":"Basically the movie is very confusing. The acting is very poor, the gratuitous violence is kinda bad, the movie soundtrack is also good for Final Fantasy and Kingdom Hearts, sometimes it reminds you of a weird Devil May Cry. Besides that, characters psychology are not even close to a serial killer. Everything is bad.","user":"eduvini-93173","rank":[2,4]}]