[{"title":"It really is that bad","rating":2,"date":"1 September 2016","review":"Absolutely dumbfounded as to how this is getting anything higher than 3 - 3.5 stars<br><br>As one of the previous reviewers suggested, it does look like it was made by Uni students during their lunch break. There are a number of painful scenes where the actors really are unsure of what they're supposed to be doing or how they should be acting. <br><br>Also, with regards to CGI, if you don't have the budget to do it well, don't do it at all. It was laughable. We didn't really need to see as much as we did, it would have been better leaving more to the imagination. <br><br>Wooden acting at best with lackluster direction. The idea and potential could have been great with thorough execution but this just left us all feeling like we wanted 2 hours of our lives back.<br><br>The dog was great.<br><br>Funny thing with some of the other 10/10 reviews.... check the profiles, one gold coast actor (supporting his friends in the industry) the others all created recently and only reviewing this film ... I smell a rat! ;-)","user":"browchay","rank":[25,33]},{"title":"Absolute rubbish","rating":4,"date":"30 December 2016","review":"The acting is really poor here - there are a couple of good scenes but for the most part it just seems to fake and unreal. The plot is just useless - it starts off good and I was hoping for a good movie but as it continues you realise that the script is like something a bunch of kids put together - and that is how it ends. Do not waste your time on this movie. The CGI is third grade/ low budget. Its a B class movie - and they haven't been able to pull it off. The script could do with a much better plot and a more scarier story as opposed to three women needed to complete the cycle - really? I liked the dog the most - really expected better.","user":"lenasheh","rank":[11,13]},{"title":"Really Awful","rating":1,"date":"25 August 2016","review":"The idea that \"just because an Aussie made it -- It MUST be supported\" is rubbish -- this really feels like a university student film with a high school plot - the online PR is promoting that this is Australia's first CGI film... ummm ... so what?!?! Using CGI doesn't equal a good film. In fact the CGI is below average. Everything in this film is clichéd to the point of embarrassing. The story is predictable. The actors are soap calibre. The link to ancient culture is forced &amp; ill-conceived. There is no horror. No thrill. Nothing new. This is naive film-making at it's worst. The whole exercise looks like a marketing survey aimed at the lowest common denominator.","user":"baziz-45340","rank":[25,36]}]