[{"title":"Worth watching, but a lackluster adaptation of a book you MUST read","rating":7,"date":"24 May 2017","review":"First off, the Novel \"Ali and Nino\" by Kurban Said is the seminal piece of modern literature for the country of Azerbaijan. It is absolutely worth reading for anyone who enjoys literature of any kind. The English translation is short, accessible, and infinitely interesting. It is a love story, a clash of cultures, and a political-historical account of how Azerbaijan was the first liberal democracy in the Muslim world ... for less than two years before the Russians decided to conquer it again. <br><br>Of course, this movie was made and financed by the current authoritarian president of Azerbaijan's family, and is put together like a PR product to western nations. It's a bit like if Ivanka Trump decided to produce an adaptation of \"The Grapes of Wrath\" for foreign audiences. It would certainly be technically well-done, but noticeably lacking much of the substance of the source material, perhaps even missing the point of the story entirely. <br><br>The book is full of humor and nuance in the interactions of the characters. It portrays a uniquely multi-cultural society where people from the same country, living literally under the same roof think so differently about things it is like they come from opposite sides of the Earth. The movie only briefly touches on a few of these moments, and kind of lacks context and buildup when it does. <br><br>What the movie gets absolutely right, and the whole reason to bother watching the movie, is the visuals. The cinematography really captures the feel of the place, it will make you homesick if you are from there, and make you want to see it for yourself if you have never been there. <br><br>So in sum, the visual depiction of the story's setting is an 11/10, A+, outstanding result. The adaptation of the substantive bits of the story leaves A LOT to be desired. The acting is fine, and may even be great if the screenplay gave the characters more or the development and \"moments\" from the novel.","user":"baxterlawfirm","rank":[17,19]},{"title":"Well-Done Historic Period Film","rating":8,"date":"11 February 2018","review":"\"Ali &amp; Nino\" ( 2016) I am not usually a fan of Historic Period pieces....but I ADORE Adam Bakri so I thought I would give it a chance. And I am glad I did.\nWhat I found was a beautiful love story wrapped in a veil of tragedy. The tale is set from 1914-1920 as World War I is fought.....Azerbaijan claims its independence from Russia....becoming the first democratic state in the Muslim world. The celebrations are short lived as the oil-rich country quickly finds itself having to fight to maintain said independence.\nAt the center are Ali (son of a powerful Muslim man in the capital city of Baku) and Nino (a Christian Georgian princess) who fall hopelessly in love. The film chronicles the struggles, obstacles and enemies of their love and their tenacious fight to stay united.","user":"drtodds","rank":[5,5]},{"title":"Touching Movie!","rating":10,"date":"13 December 2017","review":"The touching love story with magnificent description of diversity of culture and different religions. Special thanks to the cast for creating such a multicultural unity!\nElchin Abd","user":"abdullayevelchin","rank":[5,5]}]