[{"title":"Steven Seagal is: The Punisher (sort of)","rating":4,"date":"11 May 2016","review":"Ugh. It's a foregone conclusion that Seagal will never make anything again that lives up to his heyday in the 80's and 90's, but at least his DTV work up to this point had been quirkily interesting. As Seagal has aged and grown more portly, he's done less hand-to-hand combat and relied more on guns and knives, but the new trend seems to be that he barely appears in movies where he has the top billing. SNIPER: SPECIAL OPS was guilty of this, but at least that one had the good sense to be on the short and simple side. CODE OF HONOR is, quite frankly, one of the most cynical and shoddy pieces of work (and I use the term loosely) to ever have Seagal's name slapped onto it. Here, he plays Colonel Robert Sikes, a Punisher-like character who acts as a vigilante in his city to clean up crime. On his trail is a former protégé/friend who is trying to bring him in along with the help of the police. And, for some reason, there is a sleazy news team who follow them around trying to get a good story. So, you have elements of THE PUNISHER, SURVIVOR (the generic Pierce Brosnan movie from last year), and NIGHTCRAWLER, with none of the nuance or sophistication of each (at least the first and last ones). There are no characters with significant screen time to root for, as government, the police, and news media are all painted in such a bad way. Even Seagal who normally is likable, if stoic, is stuck playing a character who straight up murders people. Of course, I was with the movie for about two-thirds of it because it was kind of entertaining in a bad way. However, a third act plot twist completely ruined the film for me. It's like the filmmakers/screenwriter were like, \"Just kidding!\" It honestly angered me a little bit, making the last half hour or so a real chore to get through. As for the action, which is what most people will care about, there is a decent amount of it although it's mostly shootouts and some knife-fighting. Seagal gets very little to do, and I was disappointed here just like with SNIPER: SPECIAL OPS. The opening scene was probably the best, and there was a couple short fight scenes towards the end that partially made up for how dismal the rest of the film was. Seagal also gets one of his trademark speeches about halfway through, although the politics of it rubbed me the wrong way. Ultimately, I feel like I've been tested for the last time as a Seagal fan. These last two films were a whole new level of lazy, and I don't know if I can take it anymore. CODE OF HONOR is for Seagal fans only, and even then I'd still be cautious","user":"brchthethird","rank":[13,13]},{"title":"Death Wish, Punisher and others","rating":4,"date":"28 October 2016","review":"They do not need to worry. Not only because Steven Seagals character won't be after them (he's hunting criminals you see?), but also because this just tries to mash a couple of things and take a decent idea and make something out of it. I'd say it doesn't succeed, but at least it doesn't shy away from showing the violence behind it all (even if most of the blood, if not all is CGI).<br><br>Youz also get some nudity (a friend of mine told me that Steven Seagal movies nowadays have at least one scene shot in a strip club, haven't checked if that's accurate but wouldn't be surprised at all) if that floats your boat. And a story of sorts of someone being after a guy, although they have the same goal and ... well who am I kidding, you're not going to watch this because of a plot. Even when it sounds decent and made me reconsider my own recent ban on Seagal movies and watch this. He did worse, but if you're not a fan, you probably should just stay away ...","user":"kosmasp","rank":[5,5]},{"title":"Unbelievable in 2016","rating":2,"date":"7 May 2016","review":"It's hard to describe what i just watched.<br><br>It's a Steven Seagal movie, so naturally my expectations weren't high, but what i saw... left me speechless. The horrid acting, the useless CGI in gunshots, the useless CGI in news playing on the TV, the useless CGI everywhere... you just don't see this quality in 2016 even in Indie movies.<br><br>Everything in this movie is just cheap. I would expect a Seagal movie to have the action he is so known for, but no. He barely says a word. Barely shows up at all.<br><br>The whole \"plot\" of the movie is just stupid and unbelievable. The so called action scenes are so slow, that the only thought you are left with is \"really??\". I have never in my life edited a movie, but if i did, this is not how i would do it. It's impossible to describe this movie, you just have to see it. If you have ABSOLUTELY nothing else to do.<br><br>Like me.<br><br>I only gave it 2 stars because i used to like Steven Seagal, back in the day.","user":"closetdrunk420","rank":[9,14]}]