[{"title":"A flawed overview of the battle over Internet freedom","rating":6,"date":"30 April 2015","review":"The documentary follows the exploits of Weev, an annoying \"good troll\" who fights on the Internet for freedom of speech and action. While many of the things described and said are totally true, the failure of the film stands in the presentation. A clone after any nutcase documentary out there, it does nothing to make you empathize with the characters or even understand what is going on, it just rants. Frankly, I feel less for poor Weev after watching the film than before when I was acquainted with just the facts!<br><br>Worse, it is made by members of a small community about members of this community and for members of this community. I don't see anyone outside the tiny group of hacktivists \"switching sides\" because they watched the film, I highly doubt they will even consider watching it. Therefore I can only consider this documentary a failure.<br><br>I rated the film so highly because if someone does pay attention, there are a lot of things there that need to be made known. What I am talking about is the vast gap between how an offence is perceived in \"real life\" and how in the \"virtual world\". Pay extra attention to the part where it says corporations and state have been humiliated, therefore they had to react like the big bullies they are. The bit when the FBI accused the mother of a young hacker of obstructing justice because the son had an incriminating laptop in the house made me sick, even if I already knew about it.<br><br>It is too bad that most of the documentary was an apology for Weev's action and less a well argued discussion on what went wrong with the entire arrest. In short, he was arrested for giving to a journalist the data collected from a really badly designed web page that allowed access to the information of other logged users. We have to ask ourselves if the same would have applied to someone entering a house with no door and reading the papers left on the table.","user":"siderite","rank":[20,25]},{"title":"Socialism vs unchecked Capitalism","rating":10,"date":"31 May 2016","review":"OK, so when it comes down to it, a lot of the information in this video is already out there. Hacking has been around since the dawn of computers. Hell even Kevin Mitnick, was charged and jailed because they thought he could use a phone, whistle a tune and cause Nukes to fly.<br><br>Hacking, or Hacktivism as they term it in the video, is how this world operates. And there are 3 types of hackers. The black hat, who use their skill to enrich them selves. A white hat, who use their skill to defend. And a grey hat. Who use their skill of the betterment of society.<br><br>I would place each and every one of those interviewed on this video as Grey hats. They were not in it for the money, they were not in it to cause damage. They were doing the public a service. And that is where the title of my review comes in. You see, it is the grey hats who embrace socialism. They made the system what it is today. Where as unchecked capitalism is attempting to exploit everyone, lie to the people about their intents, and then call them selves victims because the public strikes back. Like come on folks.<br><br>TrapWire is one item i found interesting. And have since dug deeper into it. And the fact that Glenn Greenwald is in this is another bonus. It gives these folks a line of legitimacy for their actions.<br><br>One review stated that these people are criminals. That they steal and hack and since it is a crime, they should be treated as criminals. I would like to offer a different perspective if you will.<br><br>My perspective is this: If a nation ends up being run by a dictator, then it needs someone to stand up against said dictator right? If trump gets into office, and he starts acting like a fascist dictator... Someone has to stand up and lead the charge to remove said person from office. These people in this video are the ones who are standing up against the corporate dictators. Not 1 single dictator, but a multi-headed set of dictators. We live in a surveillance world folks. We all acknowledged that. Even some cop is probably reading this review now trying to determine if i am a threat or not. As such, it is our imperative in these democracies to hold businesses &amp; government politicians and leaders accountable. Embarrassing a company is not illegal folks. Its holding them accountable.<br><br>After all, in a real democracy, we don't have protest zones or ask permission to protest. In a open society we should not fear.<br><br>Anyways, an excellent movie and i would recommend anyone interested to watch it and then do their research into what was mentioned in the documentary.<br><br>Oh, and Thank you Edward Snowden!","user":"ncc_oblivion","rank":[4,4]},{"title":"Informative Regardless of Viewpoint","rating":7,"date":"22 October 2015","review":"In today's world, it's incredibly important to know just how anonymous (pun intended) people really aren't when online. Whether you oppose these proclaimed \"hacktivists\", or admire their creative way to resolve a felt injustice, there's a lot of quality info here. It's an easy and engaging watch. Working in fraud, I couldn't be more surprised for how many people are so careless on the internet.<br><br>The viewpoint is fairly biased, but there's nothing to suggest a significant revolution just by watching the film. The only truly horrifying part is how many hipsters are present in this documentary. Kidding of course.","user":"kb3014","rank":[8,12]}]