[{"title":"False teeth and the thing about happiness","rating":10,"date":"14 July 2016","review":"Toni Erdmann starts slow and is in general a movie that takes its time. 162 minutes might suggest an overlong or very slow paced film, but in this 162 minutes we get a firework-like examination of a relationship between a father and a daughter. And yes, Toni Erdmann is a comedy. There are some moments that are so hilarious, that they gained applause mid film from the audience at my screening. But it is also a tragedy. A really complex one actually. There is so much loneliness in those characters, so much longing. Toni Erdmann is constantly entertaining, extremely well acted and emotionally compelling. A masterpiece of German cinema.","user":"kamille-roboter","rank":[164,232]},{"title":"Overly long and criminally unfunny","rating":2,"date":"8 October 2017","review":"I feel at a loss when it comes to the love for beloved Oscar nominated German dramedy Toni Erdmann.<br><br>I've tried to understand why this excessive, criminally long and utterly weird (not funny) film, that at its core tells a rather generic and ordinary story of a father and his daughter has been so blatantly fawned over by many a top critic but I just can't see or understand why Maren Ade's tale has become the so-called classic it's been labelled with.<br><br>Over 160 minutes of runtime we the audience get the \"privilege\" of following around the odd Winfried Conradi whose relationship with his business driven daughter Ines leads him to take up a persona of Toni Erdmann, a self-professed life coach that starts to follow Ines around to become a part of her working life. It's a story with potential but told as dryly and blandly as Ade tells it, this ends up being a rare foreign film where you just can't wait to see a more tightly structured and funny Hollywood remake.<br><br>There's nothing wrong with Peter Simonischek or Sandra Hüller's central performances as father and daughter duo Winfried and Ines and the two actors are both game to partake in some odd scenarios, from cupcake antics, odd birthday parties to awkward nights out with the girls, but Toni Erdmann has surely hoodwinked people into thinking strange and bizarre is in fact genius at work and while some who like their films cut from the bizarre corner of filmmaking will lap up Toni Erdmann's fondness for the odd, there will be other viewers such as me you don't buy into what Erdmann is selling us.<br><br>It will be interesting to see how Hollywood tackles the stories untypical nature, but there's enough love flowing for the film around the place that acting legend Jack Nicholson has shunned his retirement plans to appear in the remake as the titular Erdmann while Girls superstar Lena Denham is attached to help work on the script, showcasing that Erdmann has its large portion of fans and few detractors.<br><br>Final Say – <br><br>Quite clearly Toni Erdmann wasn't for me and I understand that I will be one of only a few who didn't find this slow, charmless and cold experience that's trying to be an odd yet touching tale of a father and daughter, a sight for sore eyes.<br><br>For those that get on board the journey of Winfried and his quest to reconnect to his daughter, Toni Erdman will be near 3 hours' worth of quality dramatics with laugh out loud oddness, for the other bewildered few, Toni Erdman is one of last year's most unduly praised experiences.<br><br>1 cupcake out of 5","user":"eddie_baggins","rank":[46,63]},{"title":"The most over-rated film of the decade","rating":3,"date":"16 January 2017","review":"The opening scene gives you fair warning. The camera lingers on the front door of a house. And lingers. A mailman arrives with a package. He rings. And rings. The door opens and Mr. Conradi appears (actor Peter Simonischek). He makes jokes about the package being for his brother, who defuses bombs. He calls into the house for his brother, then goes inside. We wait with the postman. And wait. The brother shows up, but it's Conradi in a wig and fake teeth. Eventually the scene ends. But the movie will continue like this for almost three(!) hours. <br><br>Conradi is in almost every scene, and he is a grotesque, ill-favored old man who treats people as if they were pawns in some grand comedy he's living. His main target is his daughter, a hard-working executive stationed in Bucharest (most of the film was shot in Romania). He treats no one with respect, especially not her, and he has no dignity.<br><br>Almost every scene would benefit from being shortened, some by up to half. Whole scenes (e.g., the handcuffing, the sperm-splattered pastries) could have been cut without losing any of the point-- which by the way, is anything but fresh territory. Zorba the Greek leapt to mind as a similarly themed movie. In two words: enjoy life. Zorba, however, is a charming character. Mr. Conradi/Toni Erdmann is not.<br><br>The multiple-award-winning actress Sandra Huller holds the film together, and the scene, toward the end, when she belts out Whitney Houston's \"Greatest Love of All,\" is a triumph of performance over production. That's pretty much it (and I'm not forgetting her prolonged nude scene). Without her presence, I would have walked out. This is a grossly over-rated film, and a painfully over-long one.","user":"Irie212","rank":[67,103]}]