[{"title":"shhh!","rating":7,"date":"18 April 2016","review":"Greetings again from the darkness. \"Silence is a sound of many qualities.\" Director Patrick Shen explores this sentiment as he reminds us what an important role silence (or at least quiet) can play in our lives.<br><br>There are many interviews and insights from experts (like author George Prochnik)  each in agreement that the benefits to silence are many. To be clear, we are speaking to the silence associated with things like rustling leaves, flowing water, and rolling waves. We are talking about the process invoked in Japanese Tea Houses, and the steps for meditation.<br><br>We are informed that silence has a positive influence on four areas: Physiological, Psychological, Cognitive and Physical. In fact, deep forest walks are used as treatments and prevention, and have shown signs of improving immune systems.<br><br>Most of us have noticed how uncluttered our mind becomes as we relax by the shore or on a mountain. Mr. Shen's film has plenty of quiet time around the interviews, and even in a movie theatre, these peaceful times have quite an impact.<br><br>The point is made that we have substituted technology for human interaction  even in place of interaction with our own self. We have left only the tiniest space for reflective thought  the kind of thought that reduces stress and results in clarity within life.<br><br>For those who have never experienced it, the film offers a display of composer John Cage's infamous 4'33\" (4 minutes, 33 seconds) piece with three movements  each with complete silence from the orchestra. The idea sprang from his Zen lessons, and now for more than 60 years has been startling audiences into a pleasant state of appreciation. The film drives home the point that we should all find time to quiet our soul.","user":"ferguson-6","rank":[11,14]},{"title":"Quiet revolution","rating":8,"date":"17 December 2017","review":"A meditation on silence as a commodity vanishing from the modern world and a pondered appeal to recover it while we still can. It is a bit all over the place, as other reviewers have noted, but I see this more as a quality. The film does not restrict itself to a linear argument, but rather tracks silence and noise as foundations of our existence and being. The recurring motif is John Cage's 4'33, which serves as a benchmark for the many issues raised. The film's greatest strength, by far, is its mindful use of sound design as an element of cinematic experience. Throughout, the audience is made to 'see' sound purposefully, like in a piece of sound art, and thus to challenge the way we take noise for granted in our daily lives. Ironically, the biggest flaw, for me, was the musical soundtrack, which encroached on moments that could have more profitably been given over to silence. Highly recommend this film to anyone interested in re-thinking the many things wrong with the way we live in the age of social networking. That's pretty much everyone, really.","user":"rafael105","rank":[8,10]},{"title":"Without a sense of direction","rating":6,"date":"30 September 2016","review":"This movie was a bit all over the place, though I did enjoy many of the segments. They all do relate to silence in some way, though it's by various definitions of the word, and at times it is more about its opposite (noise) than silence itself. I am not saying that these do not fit together as a valid exploration of the term, but the movie feels a bit sprawling, going from one to the other.<br><br>On a deeper level, the movie does succeed, though. I left the screening with a clear awareness of the noise around me, and for the first time in quite a while, I actively listened to my every day environment. But then I tried remembering the different segments in the movie, but they were almost all forgotten. Perhaps a ten minute piece would have had just as strong an influence on me, but then again, perhaps the whole package was needed to underline the message of the movie.","user":"peefyn","rank":[4,7]}]