[{"title":"Biting off more than he can chew","rating":2,"date":"1 June 2017","review":"Holy! That was really awful. Truth be told, I couldn't make it past 25 mins. I get that he's 16 but I saw an interview with him and he seemed extremely arrogant and was going on about how he did everything and that he was only 15 while making the film and then he went on to let us know what else he has made and again, reminding us of his age. He could use a slice of humble pie because bragging about how much you were involved and yet the final product is less than mediocre, then maybe do a good job at one or two things opposed to not doing a good job at a lot of things. The first scene, he is with his buddy and he says his buddy's name like 40 times in the first 5 mins. If you are only two people, why on earth would you have to say your friends name every goddamn time you say something to them?! His directing while in motion is dizzyingly nauseating and his use of contrast (white on stark white) is confusing. His soundtrack (which of course he composed) is out of place and frankly, he is a terrible actor. I do believe he didn't get advice from his Father because I enjoy his Father's work so he couldn't have. Hopefully as he matures, so will his talent.","user":"anwahs13","rank":[11,14]},{"title":"Maybe Aim a Little Higher?","rating":4,"date":"13 February 2017","review":"This one is a real dilemma kiddies. Especially with all the outstanding movies currently being released It's hard not to compare so I shan't make that mistake. STRAY BULLETS - A feature movie written, directed, produced, music composer, &amp; acted in by a 16 year old (even with Dad's production company assistance) is a magnificent achievement by any standard. But the lack of experience here is glaringly obvious. Regrettably the script meanders willy nilly around an open field with no definitive or positive bearings followed. There are unnecessary elements added with no rhyme or reason. Many, many tracks are trodden only to culminate in dead ends for unexplained reasons. Many, many tracks that should have been explored more fully are suddenly closed leaving the viewer lost and wondering who and why. Disjointed editing made for unclear, hard to understand and random appearances by characters that seemed to have no influence on the story These are scattered throughout whilst the major players are not fleshed out at all. Unfortunately the story line was also very far-fetched and quite unbelievable. Perhaps we needed a bit of padding for an admittedly quite short (83 mins) feature but we certainly don't need a 2 minute pan across unused pianos to get to the piano player and then another 2 minutes for him to get up and walk across a room to a ringing phone. He answers the phone, we get no conversation just a cutaway to a random tractor driving down some street, not really worth the wait. If you produce a dramatic scene at least let us hear what/why/who it's about<br><br>The soundtrack quite frankly is atrocious, badly placed, distracting, overly intrusive and constant. It goes from African drumbeat inspired to Catholic hymns over a silent face pan and romantic swing whilst wiping blood out of the car is just plain weird. It also doesn't help when two of your major sideline actors were terrible. I mean TERRIBLE!.. Not too sure where they earned their acting chops but the fathers were appalling actors. The slo-mo shooting/dying scene at the park was over acted &amp; cringe worthy. The actor who played the Ash's father had the emotional acting depth of a snail. SHOCKING! Most scenes with either of these two in it should have been scrapped before release and they both should have been sacked on the first day of the shoot. The exit, stage front, final scene is also dragged out to painful extreme but a camera angle of 45 degrees on a moving vehicle driver is a preposterous and very visible error that should have been rectified. It's a learning process obviously for young Jack (I sure as shite couldn't do it and I'm a lot older than 16) so this should be used for what it is, a few positives whisked together with many negatives resulting in a very flat cake but educating all to produce a better recipe in the future. Yep, that's right kiddiesincredibly Jack is also listed as \"chef\" in the final credits","user":"MooveeVu","rank":[9,13]},{"title":"robbers in flight","rating":7,"date":"14 February 2017","review":"as the above review states, the writer, director, producer, editor, etc. of \"stray bullets\" is a 16 year old with a lot of talent. the only actor I recognized was james le gros. the plot is basic robbers (?) fleeing scene of the crime, ending up in an abandoned trailer upstate (I don't know where), two young boys-wrong place, wrong time, a hit man after fleeing robbers. I don't read reviews, so I had no idea what to expect. the movie was playing at theatre in nyc where the movies are usually art house stuff, so you can just go and take your chances. I enjoyed the movie a lot. it remains interesting throughout and moves right along. there are lots of holes in the plot and the movie leaves you hanging, a kind of stunt you can do once when you are a young film maker, but not twice. it's not worth the $15.00 nyc admission, but watching on TV would be worth it. it's fun. just remember the name-jack Fessenden. there's a very bright future here. I wish him the best.","user":"cdcrb","rank":[2,6]}]