[{"title":"Among the darkest times of reunited Germany","rating":6,"date":"12 January 2017","review":"\"Wir sind jung. Wir sind stark.\" or \"We Are Young. We Are Strong.\" is a German movie that is also almost exclusively in the German language with the exception of a couple Vietnamese phrases. The film was released about two years ago and was written and directed by Burhan Qurbani, a name that is very fitting in terms of the subject as the movie is mostly about the acceptance of foreigners here in Germany. It runs for slightly over two hours and takes place in the German town of Rostock back in the early 1990s where people demonstrated violently against the German immigration politics, a subject that could not be any more relevant 25 years later today. Maybe this is also why the film received a great deal of awards attention, including a German Film Award for Swiss supporting actor Joel Basman, an Outstanding Feature Film nomination at the same event, a Bambi nomination and a German Screen Actors Award for Devid Striesow. With the exception of the last half hour, the movie is in black-and-white.<br><br>The focus is on a group of young men living in Rostock around that time and how they are immediately confronted with the events, especially with how it all rises in terms of the conflict and the tension. Apart from the ones I already mentioned, the cast features Trebs, Rosendahl and Nay, some of the biggest acting prospects from Germany. Another reviewer wrote that the film is more about this group of people than about the actual events and I would agree with that for the most part. The scenes with the Vietnamese as well as the last half hour feel a bit rushed in to give the film more relevance in terms of the subject. It is mostly a really fictitious work and the accurate historic references, such as the fact that the police left for a while are scarce. Of course, I did not expect an almost documentary-like film, but I feel that it could have been better with regards to the city and time when/where it takes place, just because it is such an interesting period and it is also one that (with all the German Nazi movies) has not yet received the consideration it deserves. But just like with the NSU, movies about Nazis in Germany long after 1945 become much more frequent apparently, so maybe it will in the future.<br><br>Anyway, the one aspect I really enjoyed about this film is how it shows us that it was impossible to stay away from the political climate. The ways in which you identify yourself with one side of the movement may have been very different (compare Nay's through love/sex, Striesow's through his already existing beliefs and Basman's through experiencing violence first hand), but you had to step up for what you think was the right choice. Abstention was pretty much impossible. I already mentioned the scene involving violence against Basman's character and it is somewhat telling that this moment turned him into one of his aggressors, maybe also as means of self-protection and the way they used \"Time After Time\" in that scene made it one of the best scenes of the movie. I think the music was generally one of the film's biggest strengths and this also refers to the inclusion of the Internationale on another occasions. Overall, the movie had occasional weaknesses (the female characters felt very irrelevant at times or the transformation of Nay's character at the very end may have been too drastic to be believable as he was always one of the shy guys), but as a whole the movie works pretty well and is certainly worth checking out for everybody with an interest in German (history) movies. I give it a thumbs-up.","user":"Horst_In_Translation","rank":[5,5]},{"title":"The true thriller is not shown","rating":6,"date":"26 January 2016","review":"The movie focuses on a group of aimless youths with bleak prospects and their role in the riots against the asylum seekers' house. The other thread shows a local politician, who is the father of one of the depicted youths and who is being left alone by his superiors.<br><br>Although the group's inner dynamics and their frustrations are dealt with in a very sensitive way, the action is extremely slow paced and not very emotionally engaging.<br><br>After having watched the movie, I wanted to know what really happened that night in Rostock Lichtenhagen. So I turned to the Wikipedia article covering the infamous event. And there it was: the real thriller! <br><br>I will not reveal my conclusions, but there were very strange things going on the federal level, very strange things said by the heads of the then ruling CDU, very strange directions to the police. Read it yourself, you will hardly believe it! <br><br>Let me give you just one example: in the aftermath, there was only one member of the two big parties CDU and SPD (the latter ruling in the state of Mecklenburg-Vorpommern) truly condemning the riots as well as the failure of the government, Knut Degner. The next day he was released from office (!).<br><br>So the real thriller happened not in Rostock on the streets but in Bonn and Schwerin behind closed doors. The movie should have taken this in to account. Or maybe a documentary would have been genre more appropriate.","user":"gaga75","rank":[25,37]},{"title":"A crime beyond words","rating":8,"date":"7 November 2017","review":"\"We are young. We are strong.\" deals with the pogroms in Rostock- Lichtenhagen during the early Nineties when hundreds of refugees and Vietnamese people became victims of a violent mob of right-wing youth and neo-Nazis rampaging through the quarter and setting their house on fire. It focuses on a small group of teenagers that takes part in the events and depicts their lives during these hateful days.<br><br>In my eyes the movie delivers a good impression of the atmosphere and the general mood that let to this crime. It shows a group of disorientated teenagers, mostly not certain yet of their own identity, that tries to find their place in the world and turns evil. Unfortunately, the events are not depicted in all their brutality and failure regarding the police and other offices. Even though I get that the director wanted to focus more on the personalities, I still think that speaking about these points would have suited the film well. Apart from that it reminded me of \"La Haine\" quite often and is a very atmospheric film that sets an interesting tone for its plot.<br><br>All in all this is one of the better German movies and it deals with events that are crucial to understand the younger German history. It shows us that we can't always count on the average people and that we should carefully reflect our actions in advance.","user":"blumdeluxe","rank":[4,4]}]