[{"title":"Extraordinarily Well Crafted - The Meaning of Christmas","rating":10,"date":"30 November 2014","review":"My wife and I saw this program when it was first aired on Hallmark a few days ago (Nov 2014). We had watched all the previous episodes of Signed, Sealed and Delivered, and had enjoyed them for their story lines as well as for the individual characters who are nicely developed and who also form an effective ensemble.<br><br>This Christmas special is almost breathtaking. I'd love to know more about the writer(s) involved and how the director and actors viewed the project also. Particularly good is how this Christmas episode provides enough background and details about the characters so that a first-time watcher of the series is not lost or bewildered.<br><br>I plan to add to this review after I watch the program again (on DVR). The actors in this series and the guest stars all deserve recognition for their work.<br><br>Right now I can say this beautifully filmed and edited show offers a lovely composition of interesting characters, dynamic and subtle relationship issues, tension and pathos, familiar cinematic devices that older viewers will recognize and all can appreciate ... and ... some clear, eloquent expressions of doubts about Christmas and then a stirring vision of the most basic true meaning of the Christmas message.<br><br>Whether the viewer is secular, Christian, or of another worldview, the overall presentation is at once intriguing, uplifting and satisfying. This two-hour program showcases the best of what the Hallmark Channel aims to offer viewers.","user":"dial911book","rank":[20,25]},{"title":"Incredibly well written / crafted","rating":10,"date":"10 June 2015","review":"It is rare to see a special-episode that is so carefully well crafted. The script had a lot to accomplish and it did so with excellence. Having followed the series, my household watched in amazement as newcomers in our audience picked up on and enjoyed as if they'd been following the show all along. The series core strength is its abundance sentiment, with nuances of miracles / belief in God. For the Christmas 2-hour episode they \"took it up a notch\" in both areas, yet were never heavy handed or preachy. Amazing. This series, perhaps better than any other on television, weaves fun and funny suspense that manages to draw the viewer in tugging on heart-strings along the way.","user":"critic_w","rank":[13,18]},{"title":"Unusual approach to Christmas","rating":8,"date":"2 December 2017","review":"This is a bit of an unusual story with quirky characters. Even some of the props are strange. The story has a number of Christmas related messages but doesn't get overly preachy and in fact some of them are subtle. There are elements of the story that are quite predictable, some that become predictable with clues, and even a few false clues.<br><br>The characters would be called losers by many people, but certainly not by anyone who loves Christmas movies. As we get to know them (if you haven't seen the series) they become quite lovable. They have backstories of their own, which are kind of sad. Because the characters are so quirky, I hesitate to evaluate the acting, but I found that it was fine for the story.","user":"Jackbv123","rank":[3,4]}]