[{"title":"Bring on Lost Butterfly.","rating":10,"date":"24 December 2017","review":"I saw this movie twice, during its release in the US, &amp; I'm glad I did. The movie had beautiful Animation, the characters are just as memorable here if not better than the previous Fate series, it had great comedic moments, awesome action, &amp; certainly some Dark &amp; creepy moments. Yes, Fate/Zero was dark, this movie is just as dark if not Darker, for a movie that mostly relied on build up, it got brutal. I like changes that were added to the movie, it actually works &amp; certainly gives us a better understanding of the characters. The only negative I can give to this movie, is that I would not recommend it any new comers of Fate, you have to watch Fate/Zero &amp; UBW first, before you see this movie.","user":"kaiju-92653","rank":[14,18]},{"title":"Amazing","rating":10,"date":"22 January 2018","review":"Its really great and please don't judge it by ratings !! , its far better","user":"anujpathak-94368","rank":[10,16]},{"title":"Why such an \"average\" rating?","rating":10,"date":"23 December 2017","review":"I watched this film the first day it screened nationwide in North America. I found this film to be very entertaining, as a fan of the Fate series. The prequel to this series, Fate/ Zero has garnered a huge hype for future Fate adaptations by ufotable. When its sequal, Fate Stay Night: Unlimited Blade Works came out, I was very disappointed. The entire series was a mess, pacing wise, the characters were very boring and overall the transition from VN to an animation on screen was incredibly underwhelming and executed badly. With these elements in mind, I was a bit hopeless on how this adaption would turn out.<br><br>I was wrong. This film exceeded my expectations by A LOT (they were pretty low considering UBW). Ufotable turned the scales up to an 11 with their animation. Many of the fight scenes were very fluid and well animated, and the designs were improved, as a different director took the spotlight in the trilogy. And thankfully so. <br><br>The sound designs, and the soundtrack is memorable and complemented the scenes and animation very well. It's also good to mention that the composer for \"Fate/ Zero\" came back to Fate to compose for this trilogy, so there are traces of Zero themes to be heard throughout the movie.<br><br>Some of the story elements were changed to fit the movie slightly better than if it were a carbon copy of the VN, and those changes I can appreciate a bit more. This allows some anime original content to be put in, and a better understanding of the characters. <br><br>This movie is NOT for people who haven't read the VN or have at least seen UBW, as this movie skip some elements already explained in UBW.","user":"toonlinkms","rank":[8,13]}]