[{"title":"Amazing rock doc!!!","rating":4,"date":"4 August 2017","review":"Absolutely incredible! if you are a fan of music you MUST see this film. Ideally on the big screen! I have seen the film 3 times, at SXSW, in the theater, and on DVD, and I well up every time. The \"Hired Guns\" featured are the most talented musicians in the world and each of their stories are incredible. Highly recommended.","user":"sisicronin","rank":[9,9]},{"title":"Simply a must if you love music","rating":9,"date":"28 September 2017","review":"Everything in this movie appears to be something unknown to the regular music lover like me. The hired guns were something I didn't even considered in the music industry. <br><br>Really good featured musicians, fun stories. Really great job. You must see it, trust me!","user":"panchovaldovinos","rank":[7,7]},{"title":"Some Great & Inspiring Individual Stories","rating":8,"date":"5 September 2017","review":"This documentary focuses on what's called \"hired guns\", especially in the rock and heavy metal genre. Basically a \"hired gun\" is a super talented musician who can, at a moment's notice, play as a studio musician or actually join a band and tour with them. However, in the often cold and brutal musical world, they will have no tenure, receive low pay, and often get no credit for their contributions.<br><br>As one sees in the film, some of the \"hired guns\" will emerge and prosper from their stints while others will not and even eventually experience tragic consequences. The film, directed by Fran Strine, jumps from one interviewee to another, and initially seemed disjointed, since I really wasn't familiar with most of the musicians and record execs. However, the power of the individual stories overrode all else, in my opinion, and I certainly not only was inspired by these tales but also learned a lot about a genre I knew little about.<br><br>As I've read in some reviews this documentary can certainly fall into the category of such other movies as \"20 Feet From Stardom\", \"The Wrecking Crew\", and \"Standing in the Shadows of Motown\", except this doc centers on rock and heavy metal bands and players.","user":"larrys3","rank":[5,5]}]