[{"title":"This is not horrible!","rating":5,"date":"24 September 2015","review":"Considering the reviews so far are either 'zeroes or heroes', I thought I'd offer a middle-of-the-road approach.<br><br>This movie is by no means horrible. It reminds me of a better than average pilot for a TV series (albeit one made in the 80's), or could even pass as 'part-one' of a mini-series.<br><br>The leads are unknown, but solid without being brilliant. David Sterne who plays King Vortigern is a better than average TV actor, and he was very believable. Charlotte Brimble who plays Olwen (the lead female) does a very creditable job, and she didn't have to get her kit off to do that job either!<br><br>Special Effects were very, very, simple and wouldn't have over-stretched the budget, eg the occasional fog machine got switched on, but that worked in the movie's favour, as it meant that nothing was done 'badly'. ie there was no need to cringe at poorly constructed monsters.<br><br>The Story was also very, very, simple, but that meant that it wasn't as rushed as B-Grade movies can often feel, as they try to pack a script worthy of War and Peace into 90 minutes. The last 12 minutes were 'so-so', as endings go, but once again, 'not horrible'. <br><br>In summary, you wouldn't pay to go see it at the movies, but you wouldn't regret watching it, if it turned up on Netflix either.<br><br>It's not worth much more than an honest 5, but it's definitely not a 1!","user":"johnno1969","rank":[32,36]},{"title":"entertaining but a little too long","rating":6,"date":"21 September 2015","review":"I found this take on the King Arthur Legend very entertaining. The use of colour and the cinematography was the most enjoyable aspect of this film. The story was good enough to get me through the full film despite it's length being close to a Lord of the Rings film. It is clear to see the effort and passion that has gone into this film and it has paid of in the end result.<br><br>Although this film may not compete with Peter Jackson's fantasy series, it's budget is a fraction of Hollywood features and it is still very enjoyable. <br><br>It works very well as a family film as I watched with my kids and they thoroughly enjoyed it.","user":"maximusblyth","rank":[24,29]},{"title":"How much Hollyrottenwood pays for a single down vote?!","rating":7,"date":"30 September 2015","review":"This movie kicks Hollywood b-u-t-t. I can see from some fake reviews that it hurts them badly - a movie with tiny little budget far more enjoyable than marvel-like \"blockbusters\".<br><br>I am looking forward to see the Hollyrottenwood crumble and be replaced with more humble movies like this one. <br><br>In Arthur&amp;Merlin you simply enjoy the flow of time and immerse yourself inside the adventure. Special effects are used on rare occasions, but still able to make you feel the story is real. Kind of Game Of Thrones style where acting, story and sets alone do the job, not dumb CGI or hundreds of enemies thrown at heroes every other second.<br><br>And please don't get me wrong. This is still economic movie, but very good and very enjoyable for every fan of elemental wizardry :)<br><br>Best wishes from Poland! Thank You.","user":"muaddib-23","rank":[36,51]}]