[{"title":"Every detail counts","rating":10,"date":"18 September 2016","review":"This film was full of surprises, all the way to the ending (no spoilers here). The storytelling is masterful, making events unfold organically; no visual detail is wasted; the loose ends tie up in unexpected ways. The four main characters are all well acted and a pleasure to watch. Martin Sheen's nuanced portrayal of the village priest makes the character feel complex and believably human, a flawed good man. I think two of the things I liked best about this film were the setting and the ensemble cast. Both the setting (a seaside village in Puerto Rico), and the ensemble's role as the entire small population of the village -- both function critically as \"main characters\" influencing the story. For a setting-as-character analogy, think how \"Niagara\"'s setting figures into its plot. The villagers as a group function almost with a \"hive mind\" spreading gossip instantaneously and acting as a kind of emotionally synchronized swarm. See this film if you are prepared to deal with deeper questions about human suffering and redemption. (If you loved \"Sausage Party\" then this film probably isn't for you).","user":"ehzimmerman","rank":[35,48]},{"title":"Art house film that raises serious religious questions","rating":9,"date":"30 September 2016","review":"Full disclosure ... This is my first IMDb review. I'm just trying to do my part to help promote this little known film. I attend the same church as the parents of the director, but I do not know them.<br><br>If you like all the recent superhero flicks, or you like Michael Bay films, then this movie is not for you. This movie causes you to feel sadness in a way that is painful, yet worthwhile. There are many moments of silence, broken only by the sounds of the sea. The key religious question is: Why do bad things happen to good people? This movie explores that question, yet does not beat you over the head with any answers. If this seems appealing to you, then please see this film, and send your friends to see it too.","user":"gmock-33123","rank":[40,64]},{"title":"A technical marvel for a freshman director.","rating":7,"date":"18 January 2017","review":"When I checked up on the writer/director of \"The Vessel\", Julio Quintana, I was surprised as this was only the first full-length film he's directed or written. In light of this, the film is incredibly successful as you see very few freshman efforts like this one. The problem has nothing to do with his skillsthe problem is that many viewers probably won't love this film since it's a very, very somber and depressing film. To enjoy it, you really have to look past this and appreciate the beautiful camera-work and care that went into this production.<br><br>This film was made in Puerto Rico and because of this, they decided to make two versions—one in Spanish and an alternate version in English. I watched the English version. However, you won't necessarily recognize it as Puerto Rico and the setting is supposed to be some unnamed island. Apparently, a decade earlier a tsunami came through the town—destroying much of it and destroying a school filled with children. While you'd expect the people to be sad, they simply have stopped living and only exist in the time since the senseless tragedy.<br><br>The story revolves around a young man, Leo (Lucas Quintanaand I wonder if he is related to Julio) as well as the local priest (Martin Sheen). Leo and his friend slip into the sea and both wash up on the beach.dead. Or, at least everyone thinks this. Somehow, despite appearing to be dead, Leo awakens several hours later and soon folks start to wonder if this is some sort of sign from God. As for the priest, he at first dismisses this but then realizes this possible miracle could be the spark that brings this moribund town back to life. After all, they haven't even rebuilt the school and folks are forbidden from having any fun. However, this miracle and the town's sudden enthusiasm for life appears to be short-lived. So what's next for this dreary, hellish town?<br><br>Technically speaking, this is a very good religious allegory. It looks very professional and somehow Julio Quintana was able to get a highly respected actor into this movie! However, like some indie pictures, it's not the most enjoyable picture. Heck, it's downright depressing and it's not a film to watch if you are feeling low yourself. However, if you want something different or if you are a film student wanting to see how a film should be made, by all means see \"The Vessel\".","user":"MartinHafer","rank":[23,36]}]