[{"title":"Good fun Shlock","rating":7,"date":"2 January 2020","review":"There is a horror trope of the last madman locked up in an asylum when some teenager decide to spend a night in there as their right of passage. Saying boo to Michael Myers house in Halloween is another example.<br><br>In this one we get a cast of actors playing a cast of wannabe actors. They have to spend a night a horror museum/attraction. It is the familiar tale we all love of will they live out the night? There is a madman loose in the asylum/attraction bumping off the actors but will they see it all as an in joke or will they survive the night? That is the premise.<br><br>It is well acted. The actors themselves seem to be having a great time playing bad actors. The effects are good and it is well shot.<br><br>It is let down somewhat by the main antagonist not actually being that scary other than they have an axe.<br><br>Well, worth renting from itunes and it is geared towards the youth. The one thing about the team is they could have made this great, if they had followed the movie the game. The other old trope it is all a prank, should have been the final denouement. Though that is my personal preference.","user":"alistairc_2000","rank":[3,3]},{"title":"Good movie","rating":8,"date":"31 December 2019","review":"I genuinely enjoyed this movie, I was certainly entertained.","user":"preciousenquiries","rank":[3,3]},{"title":"What a mess did I just watch?","rating":1,"date":"23 December 2019","review":"The Tombs has the honor to be the thirtieth movie in my list of movies with the lowest score possible. It's rare that I rate a movie the lowest possible but in this case I had no choice. The Tombs is an absolute disaster, from the beginning till the end. There is absolutely nothing good about this movie. The script is unbelievably bad, a five year old couldn't make it up. The acting is from another level, the kind of level where you seriously hope for those people they didn't give up their regular job. As for the horror it's simple, there is no horror. You will have more scary moments in the haunted house at the local fair. The killer moves like a defected robot, so that one you could just outrun by hopping on one leg. Who the hell did give that guy money to make a movie? What a waste of time (mine) and money (theirs).","user":"deloudelouvain","rank":[3,4]}]