[{"title":"This is how a fun romance should be","rating":9,"date":"22 April 2015","review":"Gridley(Paul Campbell) is a down on his luck drifter who runs into his high school crush Josie(Hilarie Burton) in the park one day. Her boyfriend Richard, who is arrogant and stuffy, knows that Josie's wealthy parents hate Gridley even worse than him, so he pays Gridley to accompany Josie home for the weekend to her parents 40th anniversary party, in order to make him look more appealing.<br><br>Yes, there are a lot of standard romantic clichés here: snobby parents, comic mishaps by Gridley, and romantic sparks flying between Gridley and Josie. However, three things make this better than the usual Hallmark romance. First, Tim Conway plays grandpa as a man who fakes dementia to avoid his family's squabbles and is hilarious throughout.<br><br>Second, Josie's sister Mindy with her green-streaked hair, which is the result of a Gridley mishap, and her free-spirited, stubborn ways is extremely likable and comes close to stealing the show.<br><br>And third, Paul Campbell has just the right amount of quirkiness and makes the viewer both sympathetic and humored.<br><br>Of course, Josie and Gridley fall in love, her family accepts him and they end up together as one would expect. But, the journey there is fun and sometimes its nice simply to watch a movie, especially Hallmark, JUST for fun and romance!!","user":"jwayne_24","rank":[21,23]},{"title":"OMG !!!!! The BEST !!!","rating":10,"date":"21 January 2019","review":"This is the best non-Christmas Hallmark movie ever!! Someone said the first 15 minutes were not good. Please don't stop watching until you get to the end!! Tim Conway is hilarious!! And Paul Campbell is seriously my favorite Hallmark actor and ranks extremely high on my list of all time favorites! He is flawless in this one!\nThis is the perfect reality~escape movie that will keep you laughing, smiling and quoting when it's over!!","user":"imapakrfan","rank":[9,9]},{"title":"***1/2","rating":9,"date":"17 February 2015","review":"Delicious romantic comedy where a guy who is not liked by his girl's parents pays a guy they even disliked more to spend the weekend at their mansion so that the former would come out looking good by comparison.<br><br>Of course, bringing the two together brings back memories and sparks romance once again.<br><br>The best part of all this is the snooty parents who act as though the world is totally beneath them. It is at their 40th wedding anniversary that their younger daughter finally has the courage to tell them off and it's nice seeing how they're brought back down to earth.<br><br>Tim Conway is a scene stealer as a grandfather pretending to have dementia so that he can tune out his daughter and son-in-law.<br><br>A great way of looking at ourselves and removing our foibles.","user":"edwagreen","rank":[13,14]}]