[{"title":"Magnificent filmmaking...","rating":10,"date":"22 September 2016","review":"I went to see this film at the 23rd Oldenburg film festival last week with a slight apprehension, but after the screening and Q&amp;A session with the director and producer I came out feeling satisfied.<br><br>I am German and I could also ramble on about yet another Second World War movie in which Germans are portrayed negatively but I have to be honest towards the filmmakers who did an amazing job on what looks like a limited budget. This is truly top class filmmaking on all levels: camera, direction, performances, music, production, etc. As IMDb is a filmmaking site and we are here review and judge filmmaking rather than the quality of historical interpretation, this film deserves ten stars, without any doubt!<br><br>I saw the previous film \"Beautiful People\" by this (oddly) quite unknown film director, which reminded me of Alejandro Inarritu's debut film \"Amores Peros\" and I was curious to see his next film. Strangely enough, the independent low budget \"Chosen\" reminded me of the latest Innarritu \"The Revenant\", depicting the same kind of deeply wounded and enraged protagonist who after losing his wife and unborn child due to prejudices against the Jews, is prepared to go to any length to avenge them. <br><br>Stunning direction throughout the film and particularly in the last half an hour when the film reaches its climax. Here we have more than just a ferocious depiction of the senselessness of the war ironically and symbolically depicted in that shocking scene when two soldiers in Nazi uniforms greet each other in a very friendly way then suddenly one of them shoots the other in call blood. The chaos of the war is where you can be shot dead by what may appear as a the friend from your own side. <br><br>Bullets shooting, whizzing and ricocheting from everywhere, fire launchers, tanks firing and exploding, bodies strewn over the battle field, then as the momentum grows towards explosive finale which any other lesser filmmaker would go for, here Jasmin Dizdar suddenly opts for a complete contrast of what is expected and goes for an intimate look at war with a sensual slow-motion pace against highly the aggressive battle montage, where we are suddenly placed inside the main hero's demented head and we experience his self-torture.<br><br>After the screening the director Jasmin Dizdar gave us some insights into how he made the film. He said he was not interested in making a docudrama reportage film, to reconstructs historical facts which is more of documentary filmmakers and historians domain, not a fiction feature filmmakers. He was intrigued by the subtle fairy-tale element and that the 95 year-old Papi (played by Harvey Keitel) narrates the story to his 13 years old great-grandchild who is to have his Bar Mitzvah next week. Logically, such child would never be able to grasp the complexity of the Eastern European history. The only way to make it understandable is by simplifying and adding a fairy tale element to the story. The main character Sonson, is inspired by a real historical character, just like certain episodes in the movie were. However, \"historical reality\" (always presented differently by each different side or nation) had to be elevated and in some parts made to look akin to an action thriller which would enable 21st century the (mainly) English speaking audiences who knows nothing about the Eastern European Jewish resistance to relate easier. <br><br>The director stated that their intention was not to dismiss history but instead to use certain historical characters, like David Grosz (the inspiration for Sonsons character), as inspiration to create a fictional character and story that even a 13 years old child would be able to understand. After watching this film people will go to Wikipedia or other history websites and read about David Grosz and other Hungarian resistance fighters who forged Nazis documents and dressed in Nazi uniforms in order to save thousand of innocent lives.<br><br>The director said during the Q&amp;A that he too was against this idea of the Eastern Europeans and Germans speaking English and ideally wanted each character to speak in their native language (Hungarian, Russian, Polish or German) after which the producer explained that the US production and distribution criteria requested that all actors from a very large international cast to speak only in English. This meant that a lot of accuracy's in terms of historical and cultural aspects of the story had to be compromised. He also said that the film would be arriving to cinemas this autumn in USA, UK, France and Germany. You'll love it just as we loved it last week, I would highly suggest the cinema experience. The music is just beautiful. It's definitely a film I would recommend to everyone with an open mind. A 10 out of 10 film.","user":"matthias-38478","rank":[11,15]},{"title":"Brilliant! A good movie which is very underrated.","rating":10,"date":"25 July 2017","review":"**Don't believe the ratings at all,this is a great resistance movie**<br><br>The bad ratings are a result of hatred from a certain community or people who have different views about the historical facts.<br><br>Let me start by saying this that if you're crazy about watching war movies and period movies you should definitely go for this and if you're still skeptical about it then don't take just my word for it and watch the trailer for yourself. <br><br>The acting of Mr. Luke Mably is very powerful,magnificent and absolutely stunning in this war drama. The way Mr. Luke Mably acts and portrays his role in this movie is such that you'll jump from your seat at times and will always leave you wondering and excited of what's going to happen next. <br><br>This movie deserves much more ratings and views and deserves to be in the list of all good war era movies ever made. I would highly recommend you to watch this and make up your own mind of how you want to rate it instead of believing the unacceptable ratings that has been given to it by people.<br><br>****Highly Recommended****","user":"subbass-sahil","rank":[13,19]},{"title":"Capable","rating":8,"date":"8 August 2016","review":"I would say this film was a cautionary tale, in more ways than one.<br><br>A story told by way of narrative in the present day, to a child wanting to hear about grandpa's stories of the past is more than ably delivered by Harvey. Through his narrative we are told the story of Sonson, his wife and sister-in-law, all Jews living in Bulgaria towards the end of WWII. For some less than clear reason the story references that he is a lawyer, though this comes to nothing (in my view) through the movie. It tells the story of a small group of underground Jews and their struggles after the lead characters wife dies (due to Cancer whilst pregnant, though the latter seems to go unmentioned other than a line about eating for two)...<br><br>Anyways I digress, the film tells the story eloquently enough, there is minimal then/now flashbacks that can so often be an annoyance, with Luke Mably very competently leading the cast. He embarks on a journey after the death of his wife to locate his sister-in-law who has been shipped off in one of the notorious 'trains' bound for Poland - she however is no withering Jewess doomed to her fate, no way, she (played very well indeed by Ana Ularu) escapes the train and disappears back into the underground network. The narrative tells us that Sonson has walked a great distance in a short number of days and eventually (after a few Germans are shot or otherwise dispatched) meets up with another group of underground Jewish fighters.<br><br>What ensures is a small band of fighters seemingly taking on a never ending stream of Germans armed with machined guns, grenades and a couple of well equipped tanks. After the smoke clears the Jews win the fight and out of the smoke comes not just a reprieve but the missing sister-in- law, hugs ensue.<br><br>It may not sound much, and yep there are holes in the story throughout, but the cast are entirely wonderful, and tell the story in a compelling way despite the plot/script holes. Much applause much go to the leads, Luke and Ana who were simply brilliant, and a degree of applause to Harvey who did his job well also.<br><br>This story has been told before, and perhaps told better through script, cinematography and directing, but I have less often seen it acted so well. I have not seen much of Luke in recent years despite his obvious ability, and Ana is new discovery who I hope to see more of in film.<br><br>This is not at all the best war story ever told, nor the best narrative of the oppressed overcoming their evil oppressors, but it is a story well acted and generally delivered, and I imagine if you find this film and spare the time to watch it you might also enjoy the many good parts if brings to the table.","user":"michaelrthomson","rank":[17,28]}]