[{"title":"Thoroughly surprising and enjoyable","rating":8,"date":"31 March 2017","review":"Although almost turned off by negative reviews at first, I am glad I stuck through with this one. The beginning is humorous, but slowly gets darker and darker. It was interesting, had me on the edge of my seat, and seemed to provide a parallel to the realities of drug use. Character performances were for the most part skillful. Enjoyed it!","user":"clairehorse","rank":[20,23]},{"title":"Impressed by its ability to be strange and horrifying at the same time","rating":6,"date":"10 June 2016","review":"It's a weird one, but a cool one.<br><br>Pierce Brosnan plays a unique pusher man who gives a group of young people a drug that will let you know what it feels like to live without the boundaries of society holding you back for one night only.<br><br>Danny Masterson plays a man who is part of the one percent and wants to supply his friends with the drug for more than one night.<br><br>The problem is when you take a drug more than once it gives you total freedom to do whatever you feel like with no regrets and to have a world with no boundaries is a dangerous one.<br><br>The beauty of the film is how messed up these people got. It was well acted when these people just started doing what they wanted.<br><br>Best way to watch it, is to cling to the person in the film you most relate too (their was this one girl who after taking the drug twice wondered what it would be like to smash a Kim Kardashian type's head into a window for being annoying, so she did)<br><br>Also giving mad points to the great music in the film that really set the tone and was super impressive, making up for the not so great cinematography. <br><br>Urge you to see it.","user":"subxerogravity","rank":[32,43]},{"title":"Is it God or the Devil?","rating":6,"date":"30 August 2016","review":"This review might contain a mild spoiler. Read it at your own risk. It's a decent thriller. Not that terrifying, yet not boring enough to make me fall asleep. The acting is quite natural if you ask me. The plot is rather predictable. The gore is plenty, yet not hardcore. The sex scenes are what I can only describe as striptease only. Zero excitement on this part. The only downside that I felt is the lack of explanation of who Pierce Brosnan's character was supposed to be. God or the Devil? I mean I get that this movie is about the 7 deadly sins and how they can bring humans to their grave end. But if he (Pierce) was meant to play God, then this movie is one hell of a sick and twisted interpretation of God. I can only make assumptions of my own. I think I'll go with him as the Devil.","user":"cahidi","rank":[16,20]}]