[{"title":"Simplicity is its biggest strength","rating":6,"date":"20 June 2016","review":"'Blackway' is about as straight forward of a story line as you'll ever get, and yet it's all the more enjoyable for that reason alone. Frequently films spend so much time trying to be complex that they forget to keep the realism factor and allow the characters to carry the movie. Some reasonably large actors (not so much currently, but in their time) signed on to this. Ray Liotta has always been a personal favourite of mine. He's very much suited to the character. He can play 'unlikable' very well. Julia Stiles is a little clunky in her line delivery at time, but has just enough acting chops in other areas to get away with it. The stand-out for me though was Anythony Hopkins. What a delight it is to watch this man act. He may not have the energy in his roles he once had, but his presence more than makes up for it. His line delivery is elegant and yet menacing in its own way at the same time. To think at 78 he is still working as frequently as he is is astonishing.<br><br>Quiet little independent films like this often go one of two ways. Either they're incredibly dull, simply trying to be more than they are capable of. Or in the case of 'Blackway' they just perfectly find their niche and are a delight to watch. It's far from perfect and there's nothing game-changing here, but if you're just looking for an enjoyable 90 minute experience you won't be disappointed.","user":"jtindahouse","rank":[68,76]},{"title":"Gritty, low-key small town drama","rating":7,"date":"13 June 2016","review":"If you, just like me, can't get enough of bleak and gritty small-town dramas, this one might be for you. Blackway slowly builds momentum and although not as good as Blue Ruin (2013) - one of my favorite films in the genre - actually feels kind of similar in 'realness' and setup. Dialogue is quite sparse but complements the low-key grading of the scenes perfectly. I doubt this film will make any significant waves with the general public, but Anthony Hopkins performance is as solid as ever and the story is pretty believable. Over all good performances by the cast. I would recommend for anybody into drama and or revenge type films.","user":"nyrn","rank":[58,70]},{"title":"Nice indy film","rating":8,"date":"9 April 2018","review":"I agree with the 10 January 2107 review (\"The movie isn't bad...\"). I had recorded this movie and was going to check out the first few minutes and watch something else, but I couldn't stop watching. The story may be simple but the cast is stellar, and the story moves along at a steady pace. I liked the fact that we weren't sure through most of the movie what the characters were likely to do. The average of 5.2 is way too low in my opinion. Anthony Hopkins is great of course, but how about Hal Holbrook's understated and as usual impressive. Alexander Ludwig's performance was a continuous surprise of excellence--surprising I suppose only because I haven't been paying enough attention to his career.","user":"Kay_movie_lover","rank":[12,13]}]