[{"title":"Misleading...","rating":4,"date":"30 July 2015","review":"I thought this movie was supposed to be about a haunted place, but it is, in fact, about infidelity. The story focuses on the Reverend's wife and the handyman's affair almost exclusively; so much that the supposed \"paranormal\" events look totally out of place.<br><br>This movie did not get anything right. It didn't look or feel like 1930 at all (I've seen documentaries about the 30s). The actors seemed wrong for their respective roles. The events were unrealistic and the characters' response to them illogical. The movie didn't seem to know where it wants to go or what it wants to do with itself.<br><br>The paranormal events were so few, so exaggerated, discorded and random that it'd make you think that, perhaps, they were edited into this movie from another movie by mistake.<br><br>The description: \"A Reverend and his wife discover their new home has a deadly secret.\" <br><br>O.K., what \"deadly secret\"? Unless I missed something, this \"secret\" was never revealed...<br><br>I really don't understand the paranormal connection at all. This movies is about a cheating wife, not about paranormal activity. I didn't get what the ghost drivel, that was randomly shoved into a movie of entirely different genre, had to do with anything or what connection it was supposed to have to the story.<br><br>Basically, the whole thing is poorly pieced together and a bit messy. Perhaps it would appeal to \"drama\"- or even \"crime\"-lovers, but to label it as \"mystery\" is highly misleading to say the least.","user":"vip-danii","rank":[20,21]},{"title":"Movie is nothing like story on cover","rating":22,"date":"22 June 2015","review":"The story goes: <br><br>\"In 1930, Reverend Lionel Foyster and his wife Marianne move into the Borley Rectory when Reverend Foyster is named rector of the parish. The couple's peaceful existence is soon shattered by a series of unexplained occurrences which quickly escalate into a heart stopping nightmare.\" <br><br>I think they must have put the wrong description on the cover. Actual film is: <br><br>Reverend hires handyman. Reverend's wife has sex with handyman. Reverend finds out. Handyman and wife plot to kill reverend. Reverend kills handyman and wife instead. The End.<br><br>Unexplained occurrences? Handyman gets beaten up in bed. Scarecrow found in bed. Bones found in cupboard. Woman walks about in graveyard in white frock. Some person in a black hood and white mask appears a couple of times. If there was anything else I must have missed it when I dozed off. <br><br>Summary: One big yawn and a waste of time and money. Dreadful.","user":"patriciasue-986-860927","rank":[13,14]},{"title":"rubbish","rating":1,"date":"20 August 2017","review":"Got this in a pound shop. 99p over priced. No relation to the true Borley Rectory story at all. No supernatural goings on worth reporting. OK, the actors weren't bad, but I felt embarrassed for them . Hope Suzie gets better exposure though, she's good . So slow, and not 1930's at all.","user":"johnnorris-09360","rank":[6,6]}]