[{"title":"Not what I expected...","rating":7,"date":"28 July 2018","review":"This was on my to-watch list for quite a while before I gave it a chance. Holy crap this movie is good. Not ten stars good, obviously, but man it throws some curve balls. All of the actors were competent and believable. The tension builds and builds. The ending was stereotypical but didn't detract from the film at all. Wonder how much time Patrick Stewart had to spend in makeup to play a skinhead lol.","user":"jmb-68085","rank":[15,18]},{"title":"White Knuckle filmmaking at its best","rating":10,"date":"12 July 2016","review":"First off, want to say R.I.P Anton Yelchin. Such a tragedy for someone so young and promising to pass. He was incredible in this, I felt he was really coming into his own as an actor. --- After watching Saulnier's excellent and understated Blue Ruin, the director immediately became one to watch out for. A director that knows how to direct characters with subtlety and nuance, but with intensity and brutality as well. <br><br>Green Room is perhaps the most stressed out I've ever been watching a film, and if I'm not clear, that's actually a good thing. Few films ever get such a visceral reaction out of me, but Green Room managed to do that, and then some, delivering on many fronts as a contender for my favorite film of the year. Since the beginning of the year, A24 has been unstoppable, putting out some of the most unique and incredible genre movies to be released in quite some time.<br><br>Green Room is certainly violent and grim. Its sense of dread and brutality is unending and relentless, yet never overstays its welcome or becomes cartoonish or fetishistic. It could've very easily gone into Saw, Hostel or Martyrs territory, letting the bloodshed become the most memorable aspect of the experience, but it did something much more. Not only does the brutality feel real and impactful, unlike the aforementioned films, the characters feel totally believable and genuine, completely immersed in their roles. The protagonists are naive and brash, yet fresh and relatable delinquents. The antagonists are subdued, quiet and strategic, yet animalistic and complex. From a character standpoint, it is such a welcome and ultimately more human change of pace.<br><br>For a movie so steeped in violence, it's a very humanistic movie, filled with rich and complex characters that feel like they're apart of something completely real and also very intimate and small-scale. The story is not a black and white 'good vs evil' kind of thing, all characters have their own shortcomings and sympathetic sides, making for an incredibly dynamic cast. It's a debilitatingly horrifying film, yet done with the same amount of care and understatement as Blue Ruin. It's a white knuckle thrillfest, and one that pits a lump in your stomach from the intensity witnessed on screen.","user":"Deimos-remus","rank":[110,169]},{"title":"This Review is going to be Short and Sweet","rating":8,"date":"1 October 2015","review":"Don't let ANYONE spoil you ANYTHING about the film.<br><br>Don't see the trailer when it comes out.<br><br>Avoid clips and any promo materials they may release in the future.<br><br>Go in knowing as little as possible.<br><br>Just know that watching Green Room is like getting a shot of adrenaline that doesn't let up until the very end.<br><br>It's fantastic, tense, and entertaining.<br><br>Take my word for it.<br><br>But also...<br><br>Don't get too caught up in the hype.<br><br>See the film when it comes out.<br><br>You'll be glad you did.<br><br>P.S. Jeremy Saulnier is definitely someone to look out for.","user":"moviewizguy","rank":[218,350]}]