[{"title":"the piece of information that we were missing","rating":9,"date":"16 November 2016","review":"Many documentaries show us situations that we have some idea, that somewhat we know a bit or we have heard or read about it but not deep enough. For that reason, this documentary was a complete surprise from the beginning to the end and it seems the audience was very compelled too through the whole film... so I guess I wasn't the only one feeling like \"how this happened and I did not read or hear anything about it\". The topic is extremely important and current; we have several documentaries about how important is protect our data and privacy but not so many about how we got in this situation. Here is that piece we were missing and helps a lot to make sense nowadays with our sense of surveillance. We have films about Edward Snowden and the last one, \"Snowden\", have the Nicolas Cage's character base in the creator of \"Thin thread\" that is the man, the good American.","user":"frantastika","rank":[25,29]},{"title":"A Must See","rating":10,"date":"13 September 2017","review":"This film reveals that the inner workings of our intelligence agencies and the NSA in particular, often place the security of US Citizens below the motive for profit. It shows that these intelligence agencies can be more fearful of embarrassment than of attacks by extremist organizations. It has the courage to state facts and name names. It describes how software already in place at the NSA that actually predicted the 9/11 attacks was totally shut down mere months before the actual attack occurred.","user":"stevechristison","rank":[19,23]},{"title":"The Arrogance of Power","rating":16,"date":"16 December 2018","review":"This superb documentary tells the story of Bill Binney and his team of code-breakers at the NSA, who developed such sophisticated technology that the attacks of 9/11 could have and should have been prevented.<br><br>Binney was always ahead of the curve in his work as an analyst. In 1967, he had detected the evidence of the North Vietnamese TET offensive that should have led to greater preparedness of the American military in the 1968 offensive. He also predicted the Soviet invasion of Czechoslovakia in 1968 and the 1973 Yom Kippur War. By the end of the century, Binney was ahead of everyone in understanding the importance of \"traffic analysis\" through the gathering of \"metadata.\" He also recognized the potential for the abuses of power in the national security network. He had worked too long with people who believed that they had so much power that they were invincible.<br><br>The name of Binney's operation was Thinthread, and the film goes into great detail about the visionary work of Binney's system to track electronic and phone communications of anyone throughout the world. His program also ensured that no American citizen's identity could be compromised without a warrant.<br><br>But the bureaucracy of the NSA opted for greed instead of the goal of protecting the American people. It also chose discarding civil liberties in the name of national security. The Thinthread project was disbanded in favor of outside contractors selected by General Michael Hayden. The new program called Trailblazer failed whereas Thinthread would have identified specific details about the al-Quaeda plot of September 11, 2001.<br><br>Binney and his colleagues even demonstrated how the data would have been generated to prevent the attacks. In the wake of 9/11 and to prevent embarrassment to Hayden and his minions (Maureen Baginski, Bill Black, and Sam Viser), the homes of Binney and his colleagues were raided, and their programs were confiscated.<br><br>This is a story of corruption, fraud, waste, and abuse. It is also the story of the incompetency of unelected officials determining national policy that favor greed over security of its citizens. Vice-President Dick Cheney discussed the \"dark side\" that he embraced in the wake of 9/11. The film reveals how the dark side has compromised the ideals of our nation's foundational documents and how the moral standing of America in the world has possibly been irredeemably compromised.","user":"lavatch","rank":[5,5]}]