[{"title":"Sakura Ando turns in a stunning performance in this life growth/boxing flick.","rating":8,"date":"16 August 2015","review":"100 Yen Love (2014 Japanese movie). Premise: A lazy and aimless woman in her thirties finally finds her passion for life through amateur boxing.<br><br>SPOILERS AHEAD!<br><br>Our story begins with our heroine to be (Ichiko) living at home with her parents. She's slovenly and lethargic, and she's also jobless, never had a boyfriend, and has zero ambition or desire to accomplish anything. She's portrayed as a shut in type that mostly stays in her room eating junk food and playing video games. Her mother is fed up with this routine, and she and Ichiko sort of mutually agree that it's time for Ichiko to start experiencing life on her own. With a few bucks in hand, Ichiko sets out to find a place to live, and takes the graveyard shift at the local convenience store she frequents where everything costs 100 yen. On her way home from work each morning, she passes a local boxing gym that soon begins to draw her interest. She eventually approaches this gym for some boxing lessons one day, and from there, she's off on her journey from awkward un-athletic girl to a more confident and fit woman. Along the way, she finds herself, and a boyfriend (sort of), and generally starts to emerge from her shell overall while experiencing life's ups and downs.<br><br>I suppose one could compare this movie to a female version of the original 'Rocky', or something similar. This isn't really a sports themed movie though, as the boxing aspect really serves as just a metaphor. More than anything, this movie is one of those meandering life growth stories that the Japanese film making industry specializes in. And although the boxing element does eventually play a big part here, this film is more tonally aligned to other semi-recent films from Japan such as 'Breathe In, Breathe Out', 'Sawako Decides', 'Funuke, Show Some Love You Losers'. None of these films are the same by any means, but they all share similar dramatic elements with '100 Yen Love', and they all tend to progress at a very unhurried pace which are occasionally punctuated by periodic instances of humor, quirky characters, weirdness, and pivotal moments, until they reach their climax.<br><br>Sakura Ando plays the lead as Ichiko, and, everybody else is basically a supporting character. I've seen Sakura Ando in a number of roles over the last decade, and she's always gotten the job done quite well in my opinion. This is a head turning performance though, and one that is well deserving of some best actress consideration. She doesn't really say a whole lot throughout, as she mostly lets her expressions, mannerisms, and body language, do the talking instead; she utilizes these physical traits to speak volumes though, and this is one very effective portrayal of emotional and physical development within the framework of the story.<br><br>This is somewhat of an odd and uneven film, and at times, it almost feels like two entirely different films smashed together. It can be equally as dull as it is exciting, annoying as it is funny, heartwarming as it depressing, and so on. I'm not sure I would've even liked it if the lead actress wasn't so imminently watchable (regardless of what was happening on screen). This is a front &amp; center role that requires a good deal of nuance and subtlety until it's time to let it fly athletically, and Sakura Ando owns every bit of it from start to finish. And although I suspect there was some early use of a body double and/or prosthetics (in order to make her initially look a little more out of shape than she actually was), it's obvious she put in some serious workouts in order to get lean and toned when the time came to step into the ring. If you tuned into to watch only the first and last 10 minutes, you'd have a hard time reconciling the fact that it was the same actress playing the same role in the same movie. I'm really not sure if that's a good or bad thing, but it is a decent indication of both the lead's incredible diversity, and the movie's ambition. <br><br>PROS: This film is pretty solid and enjoyable overall, the lead actress is outstanding in her role, the movie is very appropriately scored to suit varying moods &amp; themes (including the insanity inducing background music that is perpetually played at the 100 Yen store, which perhaps explains why every employee &amp; regular customer there is a bit \"off\"). It features a simple, and often easy going, story w/o any frills, and it utilizes a minimal budget effectively in order to produce an entertaining life growth/semi-boxing movie that's also fairly well shot, written, and directed. So, not much to dislike here!<br><br>CONS: This story won't work for everyone and many people may find this film to be a bit boring (particularly during the first half). The movie is disjointed on occasion and the transition of the lead from shy dork to determined boxer girl could have been smoothed out in order to be a little more seamless &amp; cohesive (so that the movie would not appear to be broken down into two distinct halves quite as much), and there was one early scene regarding the lead character's virginity that did not seem appropriate to the tone of the story at all (although I suppose one could consider such an event to be an entirely relevant possibility under the circumstances).<br><br>Summary: I loved it for the most part! Clearly not the best movie I've seen from 2014, but definitely one of my personal favorites from that year. Be forewarned though, it pays to have a lot of patience and/or some prior positive experiences with these types of Japanese movie productions in order to get the most mileage out of it. Worth it alone though, just to watch Sakura Ando's mesmerizing performance.<br><br>Bottom Line: 8 out of 10 stars.","user":"cremea","rank":[23,25]},{"title":"you can change your life if somehow you find a motive","rating":8,"date":"13 November 2015","review":"...well, 100 yen love is a very good movie. The pace is slow but is very important for the development of the story, so be patient and immerse in this simple images of a complicated life. Excellent work by the main character, Ichiko played by Ando. From start to finish she is the movie, all the other parts revolves around her. The other actors perform pretty well their respective characters, included the slum guy ( ) that barely appears. She s a 32 years old slacker that lives with her mother and recently with her sister and nephew and her not so useful father. Ichiko is the definition of apathy, lack of enthusiasm, laziness, disinterest, etc plus she does not help with their own store. Seems that she does not have ambitions and of course does not work or has a boyfriend.<br><br>The mother spoiled her too much until a big fight with the other daughter, after that Ichiko is invited to leave the house; however, the mother gives her some money to rent a place and to see if she can start a new life. Somehow she managed to get a job in the local store (Konbini) that s open 24 hours per day. Night shift so she can earn almost a minimum Japanese salary but working part time. She always passing by a box gym; flashing with another particular guy that practice there. All along the story you can see the transformation in body and mind of Ichiko, due to training hard and to have a pursuit in life; these things seem that s going away in new generations in many countries; in my opinion is the fault of the parents and the cooperative/protective governments (mostly in populist ones) Not so many dialogues in the movie and the few, are short and straightforward; most it said by the looks, intentions, actions, etc. -Now she lives in a rented apartment, has a job, a training schedule and fell in love with that other particular character. Lots for a gal that few weeks before only lived in a room playing video games and eating junk food. It s more like self esteem is to be found self dignity. But is not all beautiful and \"Hollywoodesque\", many problems along that she face up to but there s hope ahead; just like real life.","user":"Hombredelfuturo","rank":[7,7]},{"title":"There is no climax on most of us.","rating":8,"date":"4 October 2019","review":"I am pretty sure that most of us here are never ever going to be the best in the world, just like the protagonist here. Yes, she started off as a perfect loser then put more effort than any others. Yet, her effort was never good enough since she found her passion too late. This is life to be honest. You might find your talent late, and the reality might hit you too hard to the point you might think it is impossible to achieve anything. However, she achieved something greater than a win in regional boxing match; her purpose on life.<br><br>From then on, she is most likely to have no climax in her life just like most of us. Yet, that isn't too bad of a life as long as she has a goal to achieve.","user":"ewjun","rank":[2,2]}]