[{"title":"\"Steve Guttenberg Vs. Giant Lava-Spitting Spiders!\"","rating":6,"date":"26 July 2015","review":"Steve Guttenberg, Nia Peeples, Noah Hunt and Patrick Renna star in this 2015 sci-fi action film. This takes place in L.A. and Guttenberg (Police Academy) plays action film star, Colton West who finds himself in a real-life film after earthquakes unleash giant lava-spitting spiders that terrorize the city. Colton races across town to save his wife, Olivia (Peeples) and teenage son, Wyatt (Hunt). Renna (The Sandlot) plays Jack, a fan of Colton who helps him and Guttenberg's \"Police Academy\" co-stars, Michael Winslow, Marion Ramsey and Leslie Easterbrook also appear. This pays tribute and pokes fun at giant creature features like \"Sharknado\" and Guttenberg is great in it as usual. It's a cheesy, but fun flick I recommend checking out at least once.","user":"gwnightscream","rank":[10,12]},{"title":"Full of itself","rating":6,"date":"22 November 2016","review":"So the success of Sharknado (why again?), has made things like this possible. This goes Meta too, with Steve Guttenberg playing a formerly successful celebrity ... sounds familiar? I guess you've seen Police Academy then. And he's not alone from that movie, also there are some other \"stars\" who do have their moment.<br><br>And while this is far from perfect, it does work overall, with some bumps and holes along the way. If you can dig the humor that is really setting a low bar, you will be entertained while watching this. It's made for TV and the effects are therefor ... well you actually have seen way better effects on TV shows. Then again, this has probably a lower budget. You'll either make excuses for it, because you love it, or you'll be annoyed by it to say the least. Make up your mind and enjoy or stay away ..","user":"kosmasp","rank":[7,8]},{"title":"A fun ride","rating":8,"date":"8 March 2016","review":"Yes. I gave the obligatory eye roll when I saw the title. Another disaster movie. Another low budget attempt to make a movie with meaning. A rubber stamp copy of a copy of a copy. I went into viewing this with low expectations, thinking I wouldn't get past the first 10 minutes. But I was wrong.<br><br>From the beginning, this movie showed it did not take itself too seriously. It parodied all movies of this genre with a tongue in cheek innocence that belied it's self effacing motive. It had me smiling from end to end.<br><br>The clichés came with regularity and predictability. It's kind of like sitting in a Rocky Horror Picture Show revival. You know the lines. You speak them out loud. You throw rice. It's great fun as long as you accept you are part of the joke and it's OK to laugh.<br><br>Guttenberg and Peeples looked like they had so much fun with their roles. Their campy caricatures of people with greatness thrust upon them by adversity couldn't have been played (or overplayed, if you like) any better. And who could ever resist Michael Winslow?<br><br>This movie was a hoot. Take it for what it is....a very clever play on the genre.","user":"eladale-90211","rank":[8,10]}]