[{"title":"Predictable . If You've Seen The Trailer You've Seen The Whole Movie","rating":6,"date":"18 August 2016","review":"The original film in this franchise had a great premise but failed to do anything with the concept and I wasn't expecting anything with the sequel but was stunned by how much the production team developed the idea , so much so that I was genuinely excited to seeing the next film in the series which is a rare occurrence for me to get excited about upcoming film . As the trailers were released earlier in the year I did feel my excitement being negated and felt we'd be getting more of the same from a concept that with hindsight might not have much in the way of legs . Yeah the promos did feature some very topical satire about a female Senator and a right wing nutjob battaling for the future of America but seemed a little too obvious <br><br>The bad news is that's exactly how THE PURGE ELECTION YEAR plays out . You could say the studio has been honest and constructed a trailer that is refreshingly accurate and what you see is what you get but is a backhanded compliment really a compliment ? Worse than that the trailer is edited in chronological order and there's no surprises . One great thing about ANARCHY was that the story revolved around the mystery and the enigma of the mysterious violent anti-hero who had his own motives for trawling the streets during purge night . Here there's no mystery or character development . Here Sgt Leo is a knight in shining white armour saving the Senator from the fascist establishment and purgers thereby trying to save America from its extreme elements . Everything is black and white and painlessly simplistic . Everyone is good or bad with no in-between and no ambiguity involved <br><br>Being positive about this at least the dichotomy of the characterisation means no one is going to confuse the noble and genuine Senator Charlie Roan with any female politician running for President in 2016 so at least the film can't be accused of being cheerleaders for present American party politics . It also contains the occasional haunting image such as a body lying burning in a street , but there's nothing here that matches the impact of a burning bus driving along a road or the nail biting heart stopping tension of the hunting ground we saw in the second movie . Don't get me wrong ELECTION YEAR is still better than the original film and if you loved ANARCHY you'll probably like this one . The downside is that you had hoped for something a bit better and are left feeling rather disappointed by a rather predictable movie","user":"Theo Robertson","rank":[22,30]},{"title":"The Purge: Election Year","rating":6,"date":"21 August 2016","review":"I'm not a fan of this franchise, but I have to admit that it has got more ambitious with each new film. The Purge wasted its complicated (and too improbable) premise on a typical home invasion tale. The second film, The Purge: Anarchy, focused on the urban chaos. And the third part, The Purge: Election Year, (excessively) exploits the political satire which had barely been suggested in its predecessors. This doesn't mean that The Purge: Election Year is a very good film, but at least, it offers a more interesting and fluid story, supported by a relevant message... even though it's said on such an obvious and strident way that it's difficult to take it seriously. The ridiculous exaggeration employed by director and screenwriter James DeMonaco in every aspect of the movie barely surpass the reality; 3 years ago, when the original film was released, the Purge looked like a distant fantasy, but we are currently so close to that social collapse that an even more extreme screenplay is needed in order to return to the fiction field. The bad thing is that DeMonaco's narrative manipulations keep being weak and illogical: the heroes make inexcusable mistakes, while the villains vary between invincible and incompetent, according to the requirements of each scene; and the political rhetoric of the screenplay seems written by a first semester university student who has just read his first communist pamphlet. But, well... at least, the actors make a good work in their roles, bringing an appropriate balance of humor and seriousness. Frank Grillo brings a credible performance, while Elizabeth Mitchell is perfect as Senator Roan. And as common people trapped into the violence of the Purge, we have Mykelti Williamson, Joseph Julian Soria, Betty Gabriel and Edwin Hodge... they all play cinematographic clichés, but they still managed to bring humanity to their characters. In conclusion, I wasn't left very satisfied by The Purge: Election Year, but it didn't bore me and I found it superior to the previous two films, so I can give it a slight recommendation, mainly to the followers of this saga and public servers searching for spiritual peace because they aren't as evil as the ones portrayed in this movie.","user":"Argemaluco","rank":[45,68]},{"title":"Propaganda Aside This Really Is Just A Bad Movie","rating":3,"date":"15 July 2016","review":"So I'll start off by saying that I actually liked the original Purge, I know many people were expecting it to be a bit bigger and to expand more on the premise but I still enjoyed it and thought it was a pretty fun Horror/Thriller. Then the second Purge (which really wasn't a sequel, more of just a separate movie set in the same universe apart from one little tie in) came out and I enjoyed that one as well, however I thought it was a bit more cheesy than the original and it was really more of an Action/Thriller than a horror movie. I was pretty set with those two, I didn't think there was any need to continue on with the franchise, but we rarely ever get big release horror movies anymore so I decided to just suck it up and give The Purge: Election Year a chance.<br><br>So the premise was actually pretty interesting, a Senator whose family was slaughtered in front of her on Purge night is running for president in an effort to stop the Purge. However from there things start to get really really stupid. Since her opposition wants to keep her out of office they decide to disband the law that protects political officials on Purge night, thus making her fair game. When this news is shared with the Senator she decides that instead of locking herself up in a safe house (which would keep her and her dream to stop the purge alive) she'll just put the life of herself and the lives of her security team in jeopardy by just hanging out at her house on Purge night. This is one of many stupid decisions made by the Senator, and that is one of the main reasons why I found it very hard to root for her. Luckily she has a bad ass security guard (the main character from the second film) who is there to rescue her when things go south on Purge night, from there the film basically just becomes a rinse and repeat of the second film. There is also a sub plot about a extremely cookie cutter deli owner who will do anything in his power to protect his deli.<br><br>I think my main issue with the film is that the characters were just so cheesy and unrealistic. All the good guys who we are suppose to care for just ooze cheese and almost every line that comes out of their mouths is cringe worthy. The is one character in particular (the deli owner) who I found myself rooting against because he was just such a lame and unbelievable character, they actually tried to give this guy catch phrases. These felt like characters out of a bad action movie, and that's really what this film was at it's core, a lousy action movie in a horror setting. The villains weren't much better, at one point they try to pass off a group of obnoxious teenage girl as villains, the scenes with these girls were drawn out and extremely irritating, these characters belonged in a teen comedy not a R rated \"Horror\" film.<br><br>All in all I thought this was a lousy sequel and that the Purge Franchise would have been better after just being two films. They basically just repackaged The Purge: Anarchy with worse characters and a little bit more of an expansion on the story. The worst part is they will probably make more of these, they will run this franchise into the dirt just like the Paranormal Activity franchise. My expectations were not very high, yet I was still pretty disappointed.","user":"HorrorOverEverything","rank":[84,143]}]