[{"title":"Thought provoking","rating":7,"date":"7 October 2016","review":"This film tells the story of&nbsp; a young man who is diagnosed with brain cancer. The devil appears and tells him that he has only one more day to live, but he can extend his life by one day by making one thing disappear from the world.<br><br>\"If Cats Disappeared From the World\" makes people think and reflect on their lives. What if there is really only one day to live? Is one willing to trade something precious for one more day of life? The butterfly effect of the first trade has a profound effect on the character's world, and this makes am impact&nbsp; on the viewers too. There comes a point when the trade is not worth it anymore, and this decision is different for everyone. This requires&nbsp; a lot of thoughts and introspection, and this film triggers exactly that.<br><br>Despite the topic of the film, It doesn't come across as sombre or sad. I enjoyed&nbsp; watching it.","user":"Gordon-11","rank":[13,15]},{"title":"If cats disappeared from the world, how would the world change?","rating":9,"date":"9 June 2016","review":"...\"If cats disappeared from the world, how would the world change? If I disappeared from the world, who on earth would mourn for me?\"...<br><br>\"Sekai kara neko ga kietanara\" is based on a popular novel of the same name and centers around a young postman (played by Sato Takeru) who learns that he has a terminal illness and is soon going to die. Then, a devil appears and offers to extend his life on the condition that one thing the devil picks will disappear from the world in exchange for him living one day longer.<br><br>Things which seems not essential to life turn out to be more crucial than expected, as they affect the relationship he has with his ex-girlfriend, friend and family <br><br>As the story evolves, it reminds me to think about what is actually essential to life. Existence or essence?<br><br>The story is meaningful, and Takeru is a great cast in a great film. He perfectly delivered the role with his talents. The film is also shot so beautifully that I had to add Hakodate, the filming location, to my list of must-visit cities in Japan.","user":"Aimar_the_hobbit","rank":[16,21]},{"title":"Thought Provoking!","rating":10,"date":"12 December 2016","review":"I have no words to describe how I felt after watching this movie. It made me think a lot about life,relationships,ambitions and regrets. This movie is not meant for people looking for light entertainment.<br><br>Satoh Takeru has delivered mind blowing performance with dual role of the postman and the devil. A postman who unexpectedly comes to know that he is going to die due to a terminal illness.After losing one by one,items which he associates with important people in his life,he realizes that a death without people to mourn for,A life which leaves no memories on people and a life whose existence is erased,is of no use. Its OK to have a mixed past(good+bad) and not able to live long enough to fulfill dreams,yet life gives us something to cherish and be thankful for.<br><br>A movie full of insight.A must see.","user":"giteckm","rank":[9,12]}]