[{"title":"Challenging and thought provoking","rating":10,"date":"16 August 2018","review":"One of the better indies I've seen. It's too bad it didn't quite find its audience. For the deeper, thoughtful cinephile, there is a beautiful, mindful journey into consciousness. Like a microcosm of humanity caught in a bottle, the story of a psychopath who takes ecstasy and experiences his humanity is anything a fan of Tarkovsky or Kubrick will find engaging. Add to that great acting, writing and cinematography, and you've got what is a very satisfying experience. Not for the surface level viewer. It's a film you'll think about after you watch.","user":"minnowkyle","rank":[8,9]},{"title":"An valuable description of psychopathy in interaction","rating":25,"date":"25 July 2018","review":"If you are working in the field of mental illnesses you will enjoy this piece,because it's entertaining and precise about this pathology.\nThe interactions between different types of psychopaths and sociopaths and also it's victims is excellently pictured and the actors performed great .I didn't expect this movie to be any good after seeing the rating, but I was right to give a chance.","user":"Johndemontaigne-32806","rank":[11,14]},{"title":"A lackluster thriller that could have been better","rating":3,"date":"3 December 2016","review":"I was at the Whistler Film Festival this weekend (December 2016) and I was quite keen on seeing a locally produced film called \"Lost Solace\". The film was billed as a SciFi thriller. The premise of the film was in short, very intriguing and fresh. The screenplay, however, was very disappointing as character development throughout the film proved to be slow, disjointed and difficult to follow. This may also have been attributed to the extremely slow pacing of the film. Writers Andrew Jenkins and Chris Scheuerman started out with a great idea but failed to develop that idea into a palatable script.<br><br>Andrew Jenkin's performance as the dashingly handsome but disturbed narcissist/psychopath, Spence, was remarkably dull, and uninteresting. He performed his lines as though he was reading a script \"run through\" for the very first time. Andrew Jenkins wasn't terrible and he was appropriately cast as he is just as handsome in person as he is on screen, but his performance lacked the energy needed to exemplify the true complexity of his character's personality and the inner self that was destroying him. However, I find it unfortunate when a film relies solely on an actor's good looks to carry the film through a script that was anything but exciting, let alone thrilling.<br><br>Charlie Kerr's character, Jory a mentally disturbed brother of Spence's next victim, Azaria (Melissa Roxburgh), was simply overplayed. Kerr's opening scene with his shrugged shoulders and distorted facial expressions were just creepy and failed to enhance the suspense the film had intended for this character.<br><br>Melissa Roxburgh's (Azaria) performance made her character believable. Her lines and character development, although scripturally challenging played the naïve love interest of Spence, with delicate softness and naivety which was not perceived as being disingenuous but real.<br><br>The real winner of this film was Thomas Billingsley, the director of cinematography. His shots were fluid and crisp, where camera angles, set lighting and special effects were strategically placed to successfully enhance the visuals of this film. Billingsley executed his expertise in filmmaking admirably which resulted in giving this film a sense of professionalism that you would normally only see with big budget projects.<br><br>In summary, the film was disappointing to watch. Unfortunately, great cinematography and beautiful actors aren't enough to keep me interested in watching this film to the end.","user":"aretel","rank":[22,34]}]