[{"title":"Not a great one","rating":5,"date":"19 April 2019","review":"This film was a little too slow and boring. Storyline was also a bit predictable. Still lovers of horror movies would love this anyway.","user":"stani101","rank":[2,3]},{"title":"My Review Of \"Blood Bound\"","rating":5,"date":"17 February 2019","review":"\"Blood Bound\" is a weighted story, with family dynamics, personal conflict, and social complexities. On the surface it is a story about the occult, and overcoming supernatural evil. But to its depth it is a character melodrama pitting self identity against clan mentality. And aesthetically the juxtaposition between backdrops of scenic beauty against such dark and damaged characters is total arthouse.<br><br>At the beginning the story falters near to being forced, or convoluted. However it merely teeters there as characters become more developed and recognizable. It is mixed with some moments of quality acting and captivating storytelling. \"Blood Bound\" feels indie and at times it felt like a Lifetime movie, you know- the creepy kind they play during the Halloween season. I did keep asking \"where's the horror\"?!<br><br>There is some horror in the film but it comes nearly an hour into the story. The supernatural elements are slightly weak, mostly coming off as \"make-believe\". They seem too understated. The occult aspects beyond that are done nicely, and really give into the witchy vibe that LeMay is going for. Overall \"Blood Bound\" fails to gain any major ground as far as the horror, but the story is a good one and the film is worth checking out.","user":"ASouthernHorrorFan","rank":[1,1]},{"title":"Slow Brooding Horror!","rating":10,"date":"27 January 2019","review":"Wow, what a great flick! The movie is visually spot on and the cinematogrophy does a great job of marrying beautiful imagery with darkness and despair. Ultimately a story of karmic debt and bad choices made all around, but painted with a deft hand at storytelling. While measured in pace, the slow build leads to a big payoff, so it was worth it! The cast did a great job also!! Oh yeah, I really loved the score. Simple and Haunting!<br><br>If you are looking for a Rob Zombie gore fest then this is not the movie for you. But if you are looking for a creepy and (Bloody) tale of witches and demons told through the viewpoint of Generation Z then this is your film.<br><br>For lovers of \"It follows\", \"Rosemary's baby\", and \"The Witch\".","user":"jonesadam-25566","rank":[6,17]}]