[{"title":"Nice independent SciFi movie... And french!","rating":7,"date":"20 March 2017","review":"I may understand some bad ratings! This movie is like french literature, a bit complicated and intellectual. I agree this will not be the movie of the year, but I acknowledge the effort and the construction : special effects are good, atmosphere is fair, acting is good enough to immerse you in this future, filming is well done, story-line is having a track. This could really be our future some day. The realism of the streets of future Paris is nicely constructed, seems like some 1900 paintings. This is not a blockbuster from Hollywood, this is an independent SciFi movie with a fair budget and to be honest, the money have been invested well. I have been watching the whole entire movie and enjoyed it. I hope people will do so.","user":"sokolovitch","rank":[42,48]},{"title":"Well made indie movie","rating":7,"date":"6 January 2018","review":"Good plot, good dialog, saves the movie from the obvious low budget. Music suits the movie theme. Composed by the director even. Some visual effects catch your eye for not being \"Hollywood standard\". I've seen worse visual effects with way more budget. Still impressive piece of work with actors doing their best within what they've given. For a low budget scifi flick I'm more than entertained. The storyline was easy to follow and some minor distractions were saved by lively dialogue (my mother language is not English so I don't pay much detail to subtle nyances in dialogue). Very enjoyable scifi flick to pass the time with a nice thought provoking plot.","user":"lmstrand","rank":[16,17]},{"title":"Although it's low-budget, I was impressed by the overall look of this ambitious SF.","rating":6,"date":"25 January 2018","review":"\"The year is 2047.\nA century of technological revolution.\nThe revolution did happen, just not really the way people thought it would.\"<br><br>Apparently there's one thing that'll never change, according to the movie \"Virtual Revolution\" which takes place in the near future.. And that's the attitude of the political establishment towards the citizens. I concluded that after Dina said the following: \"If the politicians want to keep things the way they are, it's because they benefit from it\". That's also the most wise thing Dina (Jane Badler) had to tell, because the rest was just irrelevant drivel. But that's the only thing that annoyed me in this rather ambitious science fiction.<br><br>The makers have gathered a lot of impressions from other famous SF films. It's obvious they've re-watched \"Blade Runner\" several times to create a similar atmosphere. Paris from 2047 looks dark and deserted. An utopian city with lots of neon lighting. A big city with sky high futuristic buildings with small spaceships navigating in between them. Believe me, this film has the same appearance as \"Blade Runner\".<br><br>Only Paris seems to be sparsely populated. And this is because the majority of the population stay at home as they are continuously connected to virtual worlds called \"verses\". Nash (Mike Dopud) is a private detective employed by a multinational who developed and own these virtual worlds. The moment users are being murdered in these virtual worlds, he's sent out to investigate who's behind it. Turns out there's an underground movement of a group of hackers with one main goal : give the connected back their freedom.<br><br>\"Virtual Revolution\" alternately shows images from the real world and the virtual worlds. Honestly, I have to admit that the idea of walking around in such a virtual world sounds incredibly fascinating. Fragging in a Quake-like world or being a firmly muscled adventurer and defeating dragons in a world that resembles Skyrim. I'm sure you'll find me in such a comfy dentist's chair with headphones after a while. And trust me, I will have a swelling around my belly button as well. It all looks interesting. Certainly when you realize, just like Nash discovered to his surprise in a mirror, that you can transform into any desired individual of any gender you want.<br><br>Although this is a low-budget SciFi funded by crowdfunding and also the debut of Guy-Roger Duvert as a director, this movie looks impressive and slick. Maybe the story itself isn't groundbreaking and the introduction of a half-dressed virtual heroine waking up in the middle of a lesbian scene, feels like a rather cheap trick. For the rest it's admirable what they've put together. There were certain moments you could compare it with similar Hollywood films with a budget ten times bigger.<br><br>But what surprised me the most is the denouement. No predictable end like most blockbusters. It even contains an important message. A message about human liberties and choices that one can make as an individual. Oh well, no big prizes will be won with this movie. But if you come across it somewhere on your VOD service, I would give it a chance. I recommend it and you won't regret it.<br><br>More reviews here : movie-freak.be","user":"peterp-450-298716","rank":[10,12]}]