[{"title":"It looked like a Harry Enfield sketch.","rating":3,"date":"27 March 2016","review":"I watched Tom Hardy as the Krays which had excellent script good dialogue, top rate acting, then I watched this film and at times it was laugh out loud poor. I take it the bloke who played Reggie Kray must have gone to the shout at every opportunity school of acting. At times it resembled a Harry Enfield sketch with the calm down, calm down lines. The story of the Krays is well known territory but if you were unaware this would have made little or no sense, it really was a disjointed script with dialogue which was painful. Your can not expect the actors to look exactly like Ronnie and Reggie but when you have a character shouting at Reggie \"fat poof\" while the actor looks anorexic it just looks plain stupid. One of the worst Kray movies I have endured.","user":"Saiph90","rank":[15,16]},{"title":"This was hard work","rating":4,"date":"8 February 2016","review":"I never like giving a low score to a film, but after watching this I don't really see how I can possibly grade it any higher then a four. I'll start with the positives, in terms of period detail, it looked really good, the clothes, the cars, I felt they did a fairly good job at capturing the atmosphere of the era.<br><br>Sadly the film never engaged me, I've read some of the books on The Krays, and at no point did I feel the two leads I was watching in this were the Kray Brothers, firstly appearance, I know you can't expecting a perfect likeness, but they just seemed a little off. In terms of them as characters, that is where I had main issues, possibly it would have worked better as an independent film, nothing to do with the Krays. <br><br>I felt Simon Cotton did a slightly better job in the role of Ronnie, but only marginally. <br><br>Compared to Tom Hardy's film, it's quite a pale comparison, overall a poor follow up to an average opener. 4/10","user":"Sleepin_Dragon","rank":[10,11]},{"title":"A total waste of of camera time.","rating":1,"date":"6 April 2016","review":"What a load of garbage. I just wasted nearly two hours of my life watching this junk. Not only was it low budget, it was low everything. Low quality acting, characterisation, scripting and just about everything else I can think of.<br><br>How the heck this ever made it through to distribution I will never know. My only other regret is that I have to give it at least 1 star, whereas zero or even a negative would have been more appropriate. <br><br>I can only assume this will languish in the video rental charts for a while before finally disappearing without trace. It is without a doubt, the worst movie ever made.","user":"Essex_Rider","rank":[6,7]}]