[{"title":"Something in recent sci-fi that's not completely ridiculous","rating":8,"date":"19 October 2017","review":"Something of a mood piece leaning toward gattica over trek in styling and pace, it's a good one to watch when you've seen almost everything and have a cold or for whatever reason get stuck indoors. It's more mature sci-fi instead of talking rodents and giant smurfs.<br><br>Considering a movie has such a short time to convey complicated ideas, this film is put together well and shoots and hits at more of those targets than one would expect.<br><br>Presentation is good on all fronts. The lead role could have been written for anyone really, male or female and they had to choose one particular lifestyle to represent the story and the one they chose was OK, but some wont like it.<br><br>This is a movie that could have gone longer in many directions. The actual science of it all was done well and can serve as an example of a direction that could have gone longer. That's what a good movie does. Makes you want more.<br><br>A once watch flick that makes an impact. I'll buy it for the box art and put it on my recommend list.","user":"Crankgorilla","rank":[14,15]},{"title":"Thoughtful Science Fiction","rating":6,"date":"14 May 2017","review":"When Marc Jarvis (Tom Hughes) is diagnosed of an incurable throat cancer, the plans his life to commit suicide and keep his body cryogenically frozen in the Progeny Company awaiting for technology to revive. In 2084, he becomes the first man to be successfully revived by Dr. West (Barry Ward) and his team. The nurse Elizabeth (Charlotte Le Bon) helps Marc in his recovery and he learns that his beloved lover Naomi (Oona Chaplin) did the same expecting to live with him in the future. However Marc finds previous fails in the project with several casualties. Further, he is losing his only belongings – his memories – and he does not recover his previous health. Out of the blue, Marc takes a decision for Naomi and him.<br><br>\"Realive\" is a thoughtful sci-fi by Mateo Gil, the writer of the magnificent \"Abre los Ojos\". The story is interesting, approaching themes like ethics, afterlife without the original memories, adaptation to a future society with different moral and behaviors and so on. However the narrative is too cold despite the intriguing screenplay and the film does not work well. Marc Javis and Naomi should have been better developed in the beginning in order to make these characters likable. The hot Charlotte Le Bon is also wasted in a very limited character. Anyway, the story is original and provides a different view of immortality that makes the viewer think. My vote is six.<br><br>Title (Brazil): Not available","user":"claudio_carvalho","rank":[24,28]},{"title":"More philosophy than sci-fi, true, but not lacking in the sci either","rating":6,"date":"7 October 2017","review":"So, a lot of people went into this movie expecting to be dazzled by hi- tech conceptualizations of the future, and were disappointed. That's understandable. The tech is a background at best, although every character does seem to blend seamlessly with it. It is a background that is tastefully crafted, realistically employed and never flickers. <br><br>To add insult to injury, however, the 2 hour hypotech is stuffed with sentimentality and philosophy, rather than action and sex, as many sci- fi's are. For most people, action and sex are a far better filler than the heartfelt musings of a struggling soul, regardless of the context. <br><br>For those of us not seeking to escape to the future, we were treated to a salient, cerebral wine-tasting, of sorts...and a sobering one at that. The film seems to offer up so many spiritual, cultural messages, from so many vantage points, that it's impossible to label one bottle and drink from it. For the single-minded it's a mess. For others, it's an awakening to new flavors of suffering, and a perversion of our taste buds. Some things, once sweet on our tongue, now stain with an aftertaste. Other drinks, like death, may now crisply tinkle in the glass and repel us a bit less. <br><br>All I'm saying is that this film is more art than entertainment. Some people drink wine to get drunk and have sex. Others sip it carefully to explore its variety. Realive is certainly a film for the sipping class.","user":"littleitaly-71510","rank":[13,15]}]