[{"title":"Masterclass Cinema","rating":10,"date":"7 July 2016","review":"This is hands down the most perfect film I have seen so far this year. I gave a score of 5/5 to movies like The Revenant, Spotlight and The Songs We Sang. But even with these excellent films I can always find a spot that doesn't quite sit right with me. With The Handmaiden, it is perfect; every frame handcrafted to perfection. Even with 4min of explicit sex taken away by my country's dumb censors, this is still perfect every way I see it. <br><br>Auteur Park Chan-Wook's The Handmaiden is a superb exercise in form, structure and tone. With the latter, Park (Oldboy &amp; Joint Security Area) has achieved something extraordinary. If any scene were to linger a few seconds longer or he had decided to focus on a certain issue, the film would have veered off to a different territory. As it is, and with all the major characters' kooky off-kilter portrayals, I can't pinpoint whether I was watching something real or abstract. I was also kept in awe by the intricate and resplendent set- design which suggests something dark and Gothic is working the undercurrents. There are of course some serious girl on girl action but that never encroaches into the spine of the story. <br><br>Adapting Sarah Waters' Fingersmith, a Victorian tale awash with all manner of Dickensian motifs, Park spins an engrossing tale that ebbs and flows with a Hitchcockian suspense; it withholds as much as it discloses; it is an erotic tale that beats with raw fervour. It is at once a love story but also a menagerie showcasing human beings in their vilest forms. Park's finger hovers over all the buttons, teasing us gleefully but it is with the ultimate restraint that he never descends down to the usual tropes. The story is divided into three chapters; each told from a different character's perspective. The structure is Rashomon-esque but Park puts his own stamp on it. The film may be nearly 2.5 hours but I hardly moved in my seat; my senses kept spellbound as each twist hits me hard. When it ended I couldn't believe 2.5 hours have whizzed by. The plot is pulsating and it never lets up. There is even an octopus in it! This is definitely the most perfect film I have seen this year. You may not agree with me but for me this is cinema of the masterclass level. <br><br>It's sexy time!","user":"ctowyi","rank":[236,298]},{"title":"The Handmaiden","rating":9,"date":"11 February 2020","review":"Park Chan-Wook explores the power of narrative (the way you tell a story and its ramifications), creating another astounding visual spectacle full of dark humor, sexual desire, betrayal and revenge, with intense performances and a wonderful production design, editing and score.","user":"MR_Heraclius","rank":[42,49]},{"title":"Sublime cinema - like Hithcock with the extremity of Oldboy and the sexual candour of Blue is the Warmest Colour.","rating":10,"date":"22 July 2016","review":"I consider Park Chan-Wook to be among the greats of cinema, alongside Scorsese, Tarantino, Fellini, Truffaut, Coppola, Tarkovsky and Nolan. So I had huge expectations going in, and boy, they were met. <br><br>TheHandmaiden is a masterpiece in pretty much every sense. It is visually exquisite, Costumes, production design, cinematography, music, all combine to create a lush vision of Japan-occupied Korea in the 1930s. Park Chan-Wook is a visually meticulous filmmaker and no film so far of his has showcased his knack for visual storytelling better than the Handmaiden. I went into this film totally blind, which I honestly recommend all people doing, because the plot itself unfolds in such a beautifully engineered fashion. <br><br>My best description of the film is a Rebecca-like Hitchcockian thriller with the extremity and depravity of films like Oldboy and Battle Royale, and the humanistic sexuality of Blue is the Warmest Colour. All actors are stunning in this film. The two women share an honest, tender romance that is both passionate and moving, with a refreshing candour about the nature of sexuality that is almost never seen in Hollywood productions. The Count is an incredibly charismatic performer who remains appealing despite his many despicable acts. <br><br>But as always with a Park Chan-Wook film, the real star is the director himself. The way in which this story is crafted is nothing short of engrossing. The outrageous, depraved, sexy, fascinating plot is crafted through multiple perspectives, dashing across back and forth in time, to masterfully reveal key plot points across a never less than spellbinding two hour run time. Some would say the film is slow, but I felt as though the extended running time worked in the film's favour, in order to build character to the extent that the finale for the film feels momentously epic, a real feat considering the movie showcases only four key characters. <br><br>I was utterly engrossed by this beautifully made film.","user":"sossevarvo","rank":[191,243]}]