[{"title":"For late night thrills, I enjoyed it.","rating":8,"date":"6 April 2015","review":"From the Dark was a pretty good little thrill-ride, even if it's not the most flawless or intelligent film. <br><br>Basic plot: After their car gets stuck in the mud, a traveling couple have a run in with a creature that cannot be in a source of light. As the creature slowly diminishes their sources of light, they fight to stay alive and evade it.<br><br>Without spoiling too much, I will say that this film is basic survival horror without much story to bog it down as anything other than a simple little horror flick for mindless entertainment. The atmosphere is bold and the direction can be pretty creepy, even if the bold and interesting camera work can sometimes make it feel like too much. Still, major props for building a movie where you spend so much time paying attention to the background for the thrill of seeing something that isn't obviously there. <br><br>I do see many complaints from other viewers about the fact that there were a handful of light sources that were overlooked by the main character, but I must say, when thrown into every situation, do you often notice every detail or think clear enough to make the best moves possible? Apparently if characters in horror films aren't the brightest and sometimes make poor decisions, then it is unbelievable and a bad film. Heaven forbid anyone is flawed, ya know?<br><br>As far as finding light sources and just staying in them til sunlight, I do believe those people weren't paying attention. The creature was not entirely stupid or slow. Trying to remain in a light source without moving only led it to find ways around it and cut off the light. Even setting an entire house on fire wouldn't have been the safest mood: fires get out of control and I'm sure no one wants to burn to death.<br><br>Those things aside, horror films like this are pretty much built around the trope of wanting you to scream \"NO! NO! DON'T DO THAT! DON'T GO IN THERE! IT'S RIGHT BEHIND YOU, STUPID!\" which I think adds to the thrill.<br><br>So all in all, no, the movie isn't genius and it's definitely not a 10. But for what it is, it's a successful little thriller chiller., sure to appease people looking for something simple and creepy. Fairly solid, but not groundbreaking.","user":"Jonny-ironica","rank":[31,40]},{"title":"Well made but still awfully dumb","rating":4,"date":"3 April 2015","review":"This movie looked great and the beginning setup was fairly standard but done well. The initial dialogue between the main characters wasn't cringeworthy... though it's pretty much the only dialogue in the entire movie. So there's that. There is great atmosphere throughout and the monster is creepy in it's vagueness and mystery. More of a phantom than a raving beast. Unfortunately, beyond those elements the story is just silly. The heroine is level-headed and stoic the whole time, she never panics or breaks down... and yet she keeps doing the most inane things and ignoring opportunities to fight back and keep herself alive. I know that's kind of normal for horror films, but this one goes to a new level of dumb as characters do stupid things solely because the plot demands they not figure this stuff out. For one thing, they never seriously looks for a weapon. They're on a farm and there must be all sorts of sharp pointy implements around... but except for one moment, where she stabs the creature in the foot, she goes about completely unarmed. Also, it's quickly made obvious that the creature avoids the light. The house is full of papers and rags and stuff they could set on fire... and they've got a lighter... but not until far into the movie does she ever try making anything like a torch to keep the thing away or use as a weapon... and even that's only done halfway. Once she gets the tractor she could easily have set the entire house on fire... creating a huge amount of light to cover her escape... and yeah, that tractor would have gone fast enough to get away in... but somehow that whole element is dropped as well. There are several times where she's sitting with a decent light source and could just wait for sunrise... but no, she keeps screwing with that obvious plan in favor of things that end up putting her in the darkness and into danger, again. It's just frustrating... aggravating even... especially when everything else about the movie is so well done. Really, it seems like the whole situation was not well thought out at all and it ruins a movie that otherwise could have been a whole lot more fun to watch.","user":"venusboys3","rank":[32,45]},{"title":"Atmospheric and Chilling","rating":6,"date":"5 April 2015","review":"I am a huge fan of the horror genre.I look at other peoples reviews and it seems to me some people expect too much from movies they like realism which is fine but its horror folks it is suppose to be fiction. This movie is a survival horror it uses the typical survival formula but the director and production crew do great job building tension with the soundtrack and some clever camera work. The actors do a decent job in there roles.I watch movies to be entertainment if I want to watch realism I will watch a documentary it is after all a horror movie and a pretty decent one for me.Everyone has opinions that is the great thing about the movie world I just feel people sometimes expect a little too much.","user":"antmlfc","rank":[21,32]}]