[{"title":"After seeing \"Citizenfour\", you will have to remind yourself that this was not a work of fiction.","rating":10,"date":"9 December 2014","review":"Citizenfour Scores a 10<br><br>If you never want to see a bad film in the theater again, I suggest you limit your viewing to documentaries. They are far better on average than fictional fare. Case in point: \"Citizenfour.\" <br><br>\"Citizenfour\" tells the story of Edward Snowden's leak of NSA documents. Those documents reveal how our government, with the cooperation of major telecom and internet companies, has been surveilling our electronic communications. Moreover, our government has been spying on electronic communications around the world. You might ask, \"Haven't they been doing this for years?\" Yes, they have, but that was mainly (not exclusively, unfortunately) when there was probably cause, a warrant, or a history of criminal activity of the target. They have now been looking at everyone's communications without cause, and this can have a chilling effect on private communications and thought, journalism and our right to petition the government. <br><br>\"Citizenfour\" hits all the marks of a good documentary: it is topical, relevant, well organized and thought provoking. It is quietly dramatic and not overblown. In fact, the director could have manufactured more drama out of the subject through editing and dramatic music if desired. The restraint serves the film well. <br><br>Filmmaker Laura Poitras interviews Edward Snowden from the time he leaves his job at Booz Allen as an NSA analyst to leak the famous NSA documents that reports the spying programs up to the time his identity as the NSA whistle-blower is revealed. I thought I knew enough about this case, that there was no need to see this movie. I was wrong. Throughout the film, we see Snowden explain his decision making process, and what we see is revelatory. If people thought that Snowden was in it for fame or attention, watching this film will change that perception. Snowden was dismayed at the government surveillance of ordinary citizens and made a choice to leak that information. He did not name names and as far as he is concerned, did not reveal any information vital to U.S. security. <br><br>Heads of the NSA and other security agencies are shown in the film denying the existence of the surveillance program to Congress and on news programs. Other whistle-blowers or people investigating the program are interviewed or shown testifying such as former NSA intelligence agent William Binney. As the movie unfolds, so do the revelations of the extent of the spying program as it did in the London Guardian and other media outlets. First, U.S. domestic spying was revealed, then international spying, then spying on officials in other countries, even German Chancellor Merkel. Suffice to say, I knew some about the program but not the extent and the manner in which it unfolded. <br><br>What the film did was allow Snowden and Greenwald to take control of their own narrative, wrest it away from the mainstream media and government propaganda machine. Some of the shots in the movie start out of focus because Poitras started filming when something important was being said and to cut the takes for focus issues would have been unnecessary. Besides, the focusing was metaphorical of the main characters', Snowden and Greenwald, attempt to get a focus on the issues. We are brought along in this process. More effects and camera tricks could have been used to enhance the drama in the film, but the director wisely made a choice to focus on the content and characters. \"Citizenfour\", unlike all the overly dramatic movies from Hollywood, is a case of substance over style. <br><br>Rating: Pay Full Price, see it twice<br><br>There is little to complain about in the film other than I wanted more. The cinematography is not award winning, but it's exactly what the film needed. The timing in the film and editing were excellent. The director's choices were precisely what this story required. <br><br>Peace, Tex Shelters","user":"texshelters","rank":[163,179]},{"title":"Solid, Powerful","rating":9,"date":"27 October 2014","review":"I thought Citizenfour was quite powerful as a humanizing portrayal of Snowden. I didn't learn anything new particularly about NSA programs, since I've been reading each story I come across, but the film quite effectively transported me into Snowden's hotel room in Hong Kong and into conversations with Snowden, Greenwald, Poitras and MacAskill. Snowden comes off as a completely responsible, quite sincere, thoughtful young man. He very clearly and explicitly says that he does not want to be the story, and one believes him. Whereas Assange can impress people as narcissistic and Bradley/Chelsea Manning's sexual confusion was only one of a number of facets which distracted from Cablegate, Snowden sounds like a young Ellsberg – very intelligent and well-spoken.<br><br>Poitras's style was interesting, I thought. The camera a number of times holds for lengthy periods on fairly static shots of architecture, which served to impress the viewer with the monolithic, pervasive nature of the NSA's networks. There's a long disorienting shot out the window of a train at night or going through a tunnel, which draws you into the dark network Snowden's revealing.<br><br>The film successfully touches on a number of different aspects of the surveillance state, bringing in the idea that when we talk about \"privacy\" we're talking about security, about our constitutional right to freedom from unlawful search and seizure. I think this is a hard sell for too many viewers. I don't fault the film here. I saw it with a friend who was a few minutes late because she was watching the Giants' game. In discussing the movie afterward she questioned just how important some of the issues raised were. Greenwald and others speak passionately about the dangers of the surveillance state, but my date pointed out that she can't feel much fear that the NSA is going to be breaking down her door because of anything she's said on the phone or in e-mail. My own experience is that friends and colleagues on the one hand self-censor and don't mention politics, drugs, Bittorrent use, etc. in e-mail or social media for fear of the all-knowing eye, or on the other hand seem oblivious to any danger – why worry about Google programmatically reading every single e-mail sent or received, if it means free e-mail and potentially more accurate search results when shopping? Snowden at one point convincingly says he doesn't think it is possible for anyone no matter how brilliant and educated to individually fight all the electronic surveillance systems in existence. We're told of the multitude of methods of surveillance and repeatedly shown NSA officials blatantly lying to Congress about their existence. The lack of accountability for this last has been personally troubling to me – I remember Watergate and Iran-Contra – how is it that the heads of the NSA can with impunity flat out lie to Congress about spying on American citizens? What will viewers come away with when walking out of the theater after Citizenfour? I'm wondering how many will see it as a call to action, and how many as a well-executed depiction of Edward Snowden's experience, which may not be seen as intersecting our own.","user":"mlwehle","rank":[184,204]},{"title":"The most important documentary of the year","rating":1,"date":"1 November 2014","review":"As I write this, a few days after the film's release, so far only three users have posted reviews about it on IMDb. Given that the film ends with the revelation that 1,200,000 people are on the US government's watchlist of people under surveillance, if you're contemplating adding a positive review, the first question that you have to ask yourself is: will this make me number 1,200,001? I've followed the media stories detailing the contents of the documents Snowden leaked, so that part of the film wasn't new to me, and in fact I felt some of Snowden's more serious disclosures were underexplored in the film, maybe because of their somewhat technical nature. If you're looking for a documentary that lays out in detail all the ins and outs of what the NSA is up to, this isn't it. The main strength of the film lies in its portrait of Snowden as a person. The filmmaker and other journalists basically meet Snowden in person for the first time with cameras running, and it's fascinating to watch them getting to know one another in such a highly charged, high stakes situation. Snowden is very articulate and precise, and obviously motivated by a very moral sense of right and wrong, in much the same way as Daniel Ellsberg. Whether or not you agree with Snowden, the film definitely undercuts criticism of him as being unpatriotic or mercenary. The documentary works well as an introduction to the Snowden story for those only casually aware of it, and also as a tense real world political thriller, sort of like Three Days Of The Condor come to life, but without the gunmen and Faye Dunaway. All in all, a very important film that everyone should see.","user":"jamesdamnbrown","rank":[151,168]}]