[{"title":"Chip Off the Old Block","rating":5,"date":"16 April 2015","review":"The brother and sister duo locked up in an attic during their \"coming of age\" returns for a third \"Flowers in the Attic\" (2014) series movie; having spent their \"Petals on the Wind\" having sex and coming to terms with their honest, albeit incestuous, relationship. Another set of actors take over the parts, blond doctor Jason Lewis and blonde ballet teacher Rachael Carpani (as Christopher \"Chris\" and Cathy Dollanganger). It's now the 1980s and, to avoid scandal, the couple have changed their name to \"Sheffield\" and are raising two sons (hers) aka two nephews (his). The oldest is this film's entry in the crowded \"shirtless hunk\" character sweepstakes, attractive blond Jedidiah Goodacre (as Jory). His brother is moody, dark-haired pre-teen Mason Cook (as Bart)...<br><br>Rough-looking butler Mackenzie Gray (as John Amos) is an asset...<br><br>This story, and the next (possibly final) installment, changes focus from Chris and Cathy to their kids. What happens is that the sons' grandmother Heather Graham (as Corrine Foxworth) secretly moves into the mansion next door to her offspring. Like she did in the other movies, Ms. Graham causes trouble. She mainly cozies up with young Cook, who gradually reveals himself to be a chip off the old block. Graham is fine, but should have applied some old age make-up; she looks like she could be playing her daughter. Everyone does well for director Nancy Savoca, but it's Cook as the kid who convincingly carries the story. To improve the story, the Gothic suggestion that young Cook is possessed by evil ancestor Malcolm Foxworth should have been more clearly developed.<br><br>***** If There Be Thorns (4/5/15) Nancy Savoca ~ Mason Cook, Heather Graham, Jedidiah Goodacre, Jason Lewis","user":"wes-connors","rank":[7,8]},{"title":"3rd in the Dollanganger series","rating":6,"date":"28 December 2015","review":"Olivia Foxworth is gone and Corrine (Heather Graham) is in the mental ward. Brother and sister Cathy (Rachael Carpani) and Christopher (Jason Lewis) are now married living under the surname of Sheffield with Cathy's sons Jory and Bart. A mysterious woman moves into the mansion next door. It's Corrine and she befriends Bart keeping it a secret from Cathy, Christopher and even Jory. She starts poisoning his mind against his parents. Cathy adopts Cindy who lost her mother and has set up three beds in the attic.<br><br>This starts off more or less like a horror movie. Corrine is the bogeyman with a mysterious plan against Cathy and Christopher. I would have liked the plan to be better defined and better formulated. The situation should build up until a climatic reveal of Corrine. I haven't read these books and I don't really care about them. Bart starts out too normal to be bent completely out of shape like that. The movie should start him off with a bit of disturbing behavior. I'm not sure how good is the source material. This is better than most other Lifetime movies but it is nowhere near theatrical quality.","user":"SnoopyStyle","rank":[5,6]},{"title":"very good film","rating":8,"date":"15 August 2015","review":"This film was very good and did show the book well but I just didn't feel as drawn into this film. I do think the constant change of characters are confusing and they all seem new again even through they only look different. I understand they do this to show they have aged but with make up I believe you could have done that to the previous Chris and Cathy as I think they were much better. I did like Cathy in this film but I do not feel Chris looked like what he should in the books. They are meant to be the 'Dresden Dolls' but I think it is Chris' hair maybe, he just does not fit the Doll. I do think the children fit very well though. Apart from that the film was enjoyable I just wouldn't be in a rush to watch it again. :)","user":"sophie_casandra","rank":[4,5]}]