[{"title":"What an intense adventure!","rating":22,"date":"22 April 2016","review":"This film tells the story of two German citizens who are in Chile under Pinochet dictatorship. They get locked up in a camp of a religious sect, and get mistreated, abused and tortured. <br><br>The story is super engaging, keeping me glued to the screen from start to finish! I applaud Lena's courage to go into the camp just to see her boyfriend, though it can also be argued that it is the silliest thing to do. It shows that love is blind, and rational decision is clouded by love. The conditions in the camp is horrible, made worse by the wicked headmaster who wrongly uses religion to control and abuse people. There is one scene that vaguely suggests sexual abuse, but it is so vague that I had doubts until the words appear at the end of the film.<br><br>The ending is super intense. I find myself grabbing onto my chair, leaning forward and simply hoping that things will work out. The desperation of the characters transmit through the screen to me, and I just hope so sincerely that they will make it.<br><br>I didn't expect such an intense adventure. I enjoyed watching 'Colonial\" thoroughly.","user":"Gordon-11","rank":[58,71]},{"title":"Not a mere thriller, but a movie with contents","rating":9,"date":"28 September 2015","review":"I've been to the premiere at the Film Festival in Zurich and I was moved by the movie, not because of the love story, but because of the irrefutable truth. The movie left me thinking and researching about its topic: Colognia Dignidad, a cult in Santiago de Chile. It conjures many ethical questions and portrays what humanity is capable of. The movie grips and doesn't let go of you till the end. The contents is real, except for the love story that forms the golden thread. One has to imagine that the movie portrays the life and the ways of Colognia Dignidad almost like a documentary without felt exaggeration, but it is still a movie with a story. Superb acting by Emma Watson and Daniel Brühl made the movie an even more intense experience. The only criticism I can make is that the love story is average in comparison to the rest. I believe that the characters actions don't always make much sense. All in all, it's one of the best movies I've seen this year and cannot be compared with the commercial films normally shown in cinemas.","user":"SauturNuss","rank":[131,172]},{"title":"Yes, people actually do that and others fall for that, just like in the movie","rating":8,"date":"15 May 2016","review":"The film attempts to spin a thriller story inside the larger and more important history of Colonia Dignidad, a torture, rape and death place run like a religious cult by a pedophile Nazi ex-nurse preacher in collaboration with both the Chilean and German authorities. It sounds corny, yet it's true. Before and during the brutal military dictatorship of Pinochet in Chile, this guy ran the colony for 33 years, only being accused, then running away, then being caught and convicted... at 84 years old, much too late for anything. His right hand man is still living in Germany, close to his many victims that returned home, because the German constitution forbids deportation of its citizens.<br><br>The movie depicts the horrors inside in typical American fashion, focusing on what restricts personal liberty and rights, but shying away from actual physical blood violence or nakedness. The scene where Schaefer enters the shower of the young boys and starts undressing for a full second was comically reminiscent of the old movies when people kissed and then there got up from the bed a scene later.<br><br>Even so, the psychical and emotional torture is shown quite readily, shocking the viewer into asking: how is this even possible? Just look it up: cults sprout all over the place with millions and even billions of people happy to partake in whatever horrible fairy tale psychopaths can imagine, as long as they don't feel responsible.<br><br>As a movie, though, the film fails in several directions. Many have said that the characters weren't sufficiently developed. The movie was not about the characters, but about the colony, so no, I don't agree. However many dramatic moments seemed crafted specifically for the movie, especially towards the ending. As such, I believe the biggest sin of the film was not deciding from the get go what it wanted to be. We spend the last twenty minutes of this almost two hour movie trying to develop empathy towards the characters that were neglected until then, while the epilogue is the lazy text over saying what happened - or more like not happened - to the people involved.<br><br>To the question about the reality of the story, the romantic story of the two is fantasy, while the things inside the colony are likely worst than how they have been portrayed. Strangely enough, while the movie made this horror more visible, to actually find well documented articles about it has become more difficult, as many are talking about the film rather than reality.<br><br>Bottom line: solid acting, horrible reality, kind of bland adaptation. A movie certainly worth seeing, but not a fun one at all. To be recommended at least for making this visible to large audiences.","user":"siderite","rank":[49,62]}]