[{"title":"Mr killer plz make the kids shut up","rating":5,"date":"22 October 2018","review":"This movie is actually a love story gone wrong. A masked guy with talents in pastry and painting after living for a long time alone in a forest, falls in love with Yvonne Strahovski (can you blame him?). However, is she already has two very loud hyperactive kids that ruin the movie for everyone. In a futile attempt to fix the move and give himself a very happy ending he tries to bribe the kids with cupcakes and drawings. Kids get even louder, and the audience starts rooting for the masked avenger while checking out info on contraception at their mobiles.\nIn the end our guy just gives up and will probably try to get it right in the next movie.","user":"demetrius11","rank":[125,163]},{"title":"The Most Annoying Kids In A Horror Film Award Goes To.....","rating":4,"date":"6 January 2019","review":"Wow. So, mom and girls arrive at their isolated, lakeside vacation cabin with the promise of dad showing up late the same night. However, there is a lunatic lurking in the woods and he has some plans for the family. Will anyone survive? This is your plot.<br><br>The thing that will irritate you most about this film is not the search for reasons why this lunatic is doing all this or the fact that children go into the woods and find a creepy \"tea party\" setup and think they should eat the food that has been laid out for who knows how long. The number one thing that will irritate you will be how the children are behaving. I have never seen a film that has kids that are so downright annoying. Mom can't even begin to figure out what to do because the girls are so distracting. \"Mommy!' \"Mommy, No!\" \"Don't leave us alone!\" \"I'm scared!\" \"Mommy, you're scaring me!\" It just went on and on. I was ready for this guy to take the kids OUT.<br><br>Aside from the kids, this isn't too bad. Location is right, timing is right and there were a couple of nice problematic scenarios setup. There isn't much of a story for the killer, simply meaning you won't find any explanations as to why things are happening. So, if you are looking for it to all come together in the end, you'll be disappointed. This would've been a much better film had there been more attention to how the kids were reacting and making sure that the story made a bit more sense.<br><br>It's not just downright awful but it leaves something to be desired.","user":"Foutainoflife","rank":[63,86]},{"title":"THE KIDS RUIN THE MOVIE!! Absolutely terrible, makes you not want children.","rating":1,"date":"20 September 2018","review":"In all honesty, if the kids weren't in this movie it wouldn't be that bad. The kids are annoying, whiny, and just terrible. We were rooting for them to go just so the movie wouldn't be a complete flop. Don't waste your time and money. Absolutely aweful and the grey scale on the film was as if a colorblind child did the editing.","user":"brenthanson","rank":[125,180]}]