[{"title":"A True Legend, Who Is All Heart!","rating":8,"date":"5 November 2014","review":"First of all if you decide to watch this documentary, don't expect to see lots of action and/or lots of footage from the dozens of fights from the legend known as ''Muhammed Ali''<br><br>That being said, what can you expect? Well......lots of dialog about the former heavyweight champion, coming from a lot of people who were either very close to him or had a lot of influence on him, his life or his career for example from his ex wife, his children and even his former boxing rival ''George Forman''. There were samples from audio tapes which he himself recorded from telephone conversations he had with his at the time young daughters scattered all over this documentary. <br><br>There were moments when the documentary was on the edge of losing its momentum, but fortunately every time that started to happen it immediately picked up its speed again by showing us an old clip from an interview with the fighter which were easily the best parts in the documentary. Simply because of the overly charismatic manner and cockiness in which he presents himself as he is OBVIOUSLY known for. They do address a couple of fights from his career that had a huge influence on the boxing history.<br><br>With those things in mind its easy to say that you can prepare yourself for a very personal and intimate experience about the boxer's life. Everything this documentary is trying to accomplish it succeeds in every way if you ask me. Its quite admirable to see and learn about all the people this man has inspired and still continues to inspire to this day in his life and how much love this man has for life itself.","user":"WallyDee","rank":[18,23]},{"title":"The Concorde turbo-jet may be retired but jets will still fly and people will still remember the Concorde","rating":8,"date":"9 December 2014","review":"People can say what they want about Muhummad Ali (Marcellus Cassius Clay) and as he once said himself \"They say that the Concorde jet may soon be retired, but jets will continue to fly, and once I retire boxers will continue to box, but they will always remember the Greatest\". Ali's legacy is more than what he was able to accomplish in the ring over a 21 year (1960-1981) professional boxing career. Ali's legacy will live on through the many books and documentaries such as I Am Ali. <br><br>This documentary on the life and legend of Muhummad Ali was developed with the contributions of Ali's personal audio library. It certainly reflects the extraordinary appeal that Ali exuded with not only his loyal fans, but more importantly with his children, his wives and even his greatest and toughest opponents. Ali liked to tape his telephone conversations with his children when he was away from them, and he told his children when they were older that they would grow to appreciate these intimate conversations by telephone with the passing of time and with their own maturity. My own personal opinion on why Ali may have taped these intimate telephone conversations with his children was because he may have been weary that just like the fate that struck great men such as Martin Luther King, the Kennedy brothers and even John Lennon, Ali may have feared that his mortality was imminent and that he could be assassinated at any time for his outspokenness against the war in Vietnam, for his love and pride for his black heritage and for finding the Muslim religion. Thank goodness for the worlds people that Ali continued to fight, and he continued to send his message and share his love and passion for family, as this documentary reflects. <br><br>As his children said in this film, my father Ali may have fathered many children from different wives, and girlfriends, but he never hid his infidelities and he insisted that all his children periodically meet with one another for family gatherings when he was not boxing or training. Even his ex-wives expressed their love for Ali and that he was a man apart from all others. And what he said he meant.<br><br>I have watched countless hours of historical footage on Ali and although this may not be as good a documentary as the 1997 documentary Muhummad Ali The Whole Story, I still gleaned new information about this boxing legend regarding the great respect opponents such as Joe Frazier, George Foreman and Cleveland Brown football icon Jim Brown had for Ali. George Foreman's comments about his \"rumble in the jungle\" in Zaire Africa are priceless. George explains that during this fight he pounded on Ali mercilessly for six rounds (and George was in his fighting prime) and what does Ali do at the start of the seventh round? He whispers in George's ear during a clench, \"is that all you got George?\". George tells the camera now that \"yeah, that was just about all I had\" and then he laughs about the incident. These are the insights that many Ali fans love to hear about and this film has several that are worth watching from the mouths of his family members and closest friends. <br><br>Ali is to this day still the most recognizable face around the world, and even with his speech impediment caused by 30 plus years of living with the debilitating Parkinson disease Ali still makes personal appearances when he is feeling up to it. Everyone seems to have a story or two about Muhummad Ali, a memory from bygone years of a great fight such as the Thrilla in Manila, or the Rumble in the Jungle, but one day hopefully while Ali is still alive one of the major movie or television studios will agree to produce a deserving 10-12 part mini series on the life of Cassius Marcellus Clay/Muhummad Ali from his early childhood, through his 21 year boxing career, and his subsequent living with Parkinson disease. I believe this mini-series would break all previous television viewing records.<br><br>I rate this documentary an 8 out of 10. Ali is who he is, but in many peoples' minds Ali \"IS\" and always will be \"The Greatest!\"","user":"Ed-Shullivan","rank":[11,13]},{"title":"Great Value","rating":8,"date":"17 November 2014","review":"Of course some can argue whether Ali was that so great or not (each one has your own conclusion), but the main point here is that this is really a very good movie and worth to be watched.<br><br>The movie is very educational for those who just arrived from Mars and know nothing about that remarkable character, and very enjoyable to the ones already familiar with Ali's career. Whatever it is your case, the movie will catch your attention by covering some important moments of Ali's career mixed with some of his personal life. <br><br>Throughout the film, there are testimonies of people who were present in the life of Muhammad Ali during his time as a great heavyweight fighter in boxing. This includes coaches, editors, journalists and family members, describing memorable passages of the life of Ali at that time.<br><br>Beyond that, there is no way to deny he was one of the greatest figures from the past century, far beyond the sport scenario, and with a great story above all.","user":"surlesecrans","rank":[12,17]}]