[{"title":"Not one for the real motor sport fans.","rating":3,"date":"11 November 2014","review":"Sorry to say that this was not made by petrol heads and it showed. Too many close ups of neatly coiffured blokes and not enough of the engineering or racing. It would have been nice to have a full lap of in car footage, instead we were treated to a succession of close up's of people stood in the garage. The editing was constantly to quick (except when interviewing the frankly bland participants).A number of clips were used on more than one occasion (the exit from the pits behind a Chevrolet for example)which detracted from the continuity. Overall a big disappointment lacking depth and insight, it left me cold. The makers admitted in the question and answer session, following the premier, that they had not seen other racing based films and it showed. There was never any real tension created, even in the crash sequence, and at no time did I connect with the main character. If you are a true motor sport fan best give this limp offering a miss. Sorry.","user":"john-decoy","rank":[25,33]},{"title":"Wrong cinematic viewpoint for presenting racing.","rating":3,"date":"25 May 2015","review":"Journey to Le Mans is a documentary presenting team Jota's quest to win Le Mans in the LMP2 division.<br><br>Much of the race footage is presented in slow motion, and the melodramatic soundtrack is unrelenting. These aspects betray the innate excitement of high-speed racing. The film doesn't even present a summary of the race in any desirable form. I have to believe an under-produced bland documentary would have been much more interesting.<br><br>What it does somewhat well is profile the drivers of team Jota. The raw footage is top-notch, alas the actually racing clips are very short.<br><br>My one word summary would be \"boring\", which is a very unfortunate description of the pinnacle of high-speed auto racing.","user":"robmccrea","rank":[8,9]},{"title":"It's really Jota's Journey","rating":3,"date":"29 November 2014","review":"When you are a petrolhead, a 'journey to Le Mans' movie will get you interested. And I am a petrolhead, with some Le Mans experience, and I can tell you this is nothing like a Le Mans experience. It really is nothing more than a personal story of the Jota team. Must be great to see for friends and relatives of those involved in the Jota team, but why releasing it to the general public? It puzzles me. Considering it's not that interesting for petrolheads, fairly boring for motorsport enthousiast and straight-out insulting for documentary fans.<br><br>Sure, getting Patrick Stewart (needs no introduction) and Tiff Needell (a car journalist) looks good on the poster, but honestly, the Jota LMP2 team is not that interesting. The documentary contains half kind of interviews with those involved, and half clips of racing action. Le Mans Radio audio-clips are edited to the racing video's to make sure you can follow what's going on with the Jota LMP2 team. <br><br>The title of this documentary is misleading and don't get your hopes up about it's quality.","user":"tom-810-150081","rank":[16,23]}]