[{"title":"Excellent War Movie","rating":10,"date":"14 October 2015","review":"Well done to Paul Gross and the cast of Hyena Road for creating an authentic Canadian war movie. Being a Canadian Army officer, I had to go see this one in the theater. It was an opportune time as I was able to go with my son, a 2nd year economics student home on his Fall break. <br><br>The movie was entertaining, emotional and educational. Hyena Road weaves the perspectives of war fighters into an telling story of the character of the Canadian experience in Kandahar Province. It keeps you engaged throughout with a mix of action, soldiering and the very human dimension to conflict. <br><br>\"Inside the wire, we think about what to do outside the wire. We get it wrong fifty percent of the time which means we get it right the other fifty percent of the time\" and \" We have to remember that the end state is not for children to fly kites\" were themes that stuck with us as we drove away from the theater. <br><br>Thanks Paul,<br><br>Major Brian Taylor, Canadian Army","user":"briantaylor-26472","rank":[96,123]},{"title":"Big-Screen worthy","rating":7,"date":"17 October 2015","review":"I found the film to be somewhat adrift as far as the theme and the storyline. There didn't seem to be much of a resolution, rather a way to end the film. If it's supposed to be an analogy of the current situation in Afghanistan, well we get that \"It's not one war, it's a lot of little wars\" message earlier on. It would make a superb pilot for a series centered around the Intel guy (Paul Gross). I found the scenes within the CP interesting: radio procedure has changed dramatically in the 40 years since I was in the infantry. But the only scene I found totally authentic was the \"dance in the desert\" scene. This sort of thing does happen spontaneously within a tight knit group. And the patrol procedure and snipercraft were off in my opinion. The \"Ghost\" character was my favorite. I liked the fact that no subtitles were used and that, like the soldiers, we had to listen to the interpreter. I would liked to have seen his character developed. The artillery scenes were authentic and dramatic, but it was the only time I've seen the gunners get a target round on the first shot. The small arms combat sequences were excellent. Total confusion like always. All in all, I enjoyed it, and I recommend it.","user":"uncle_booga","rank":[47,62]},{"title":"Excellent Film. See it.","rating":10,"date":"10 October 2015","review":"This is excellent film about modern warfare with convincing battle scenes, ramped up tension and incredible locations. Who are the good guys? Who are the bad guys? Very hard to tell in Afghanistan as Canadian soldiers do their duty, to little effect. In my view it is a superior film to the much hyped American Sniper. The performances were all very convincing and Paul Gross's direction was swift and to the point. The atmosphere of working in a very foreign land for the Canadian soldiers is very apparent. I found I cared about what they were doing, as I was frankly trying to figure out their mission. If you enjoyed films like Zero Dark Thirty or The Hurt Locker, you should see this film.","user":"gkpearson41","rank":[80,110]}]