[{"title":"This plot has more holes in it than Swiss cheese","rating":4,"date":"18 August 2018","review":"I wanted to like this movie, but it's just so stupid I can't.<br><br>I love the beautiful bay and the long shots showing how pretty it is. But problem 1: where are the waves? There aren't any! It's clear that the actual surfing shots were filmed elsewhere. Come on... you don't surf on a beach with no waves. Sigh.<br><br>Other problems:\n2. A shark that size bites you, and all you have is a tiny nick in your leg?\n3. There's a juicy fat whale carcass right there, but the shark is only interested in bony human beings?\n4. That whale carcass appeared out of nowhere? She's been surfing there all day, and suddenly turns her head and it's magically 60 feet away? \n5. Why would you try to eat a crab after just a few hours? Just nonsensical.\n6. The CGI dolphins were quite bad. But not as bad as the fake wound on her leg. I've seen 1980 horror movies with better blood... and they had a $500 budget.\n7. The water is clearly shallow, as you can see in the aerial shots. Yet at the end when she sinks to the bottom, it's suddenly 60+ feet deep?!\n8. Holding on to that chain would've ruptured her eardrums in seconds because she wasn't equalizing.\n9. That shark is dumb enough to swim full force into the bottom of the ocean? \n10. Why is there a buoy there, of all places? \n11. Am I supposed to believe a beach this nice is right next to Tijuana, within walking distance of drunks, yet there's nobody there, no garbage, nothing? \n12. Something tells me you wouldn't have a 4G connection on that beach to stream video on your phone.<br><br>Sigh. It's a shot, and it's a miss! Wasted opportunity. Watch a re-run of Jaws instead.","user":"mkivtt","rank":[71,94]},{"title":"I was with you until the shark turned into a stalker","rating":3,"date":"16 January 2017","review":"This movie started out well. A very attractive woman surfing on a beautiful, secluded beach. There was some great cinematography and shots of the area. Blake Lively even seems to be a decent actress.<br><br>Then the shark stuff starts, and from the very beginning, we have to forget about everything we know about sharks and play pretend. First of all, she really ticks off the shark somehow by disturbing its \"feeding grounds.\" She approaches a dead whale that the shark was feeding on and seems to have offended the shark somehow. So the shark ignores the thousands of pounds of floating, dead meat in the water for the rest of the movie, and pursues the 100 pound surfer girl exclusively.<br><br>The surfer seeks refuge on the carcass of the whale, then the shark drags a dead whale many times its size further out into the ocean, and seems hell bent on knocking her off. In her escape from the floating whale to a small rock outcropping, she's bitten by the shark, and has some serious wounds from both the bite and coral. The shark is circling her, she's bleeding heavily, and there's no one around who can help.<br><br>At this point, I'm still willing to forgive the whole shark ignoring the dead whale to pursue a person who isn't even in the water any more. It still felt suspenseful. I wanted her to find a way out and survive. The movie still had my interest and I still cared what happened to her.<br><br>Then things got real, real stupid. The shark continued to circle, and killed a drunk on the beach who was trying to reach her. Then it killed two other surfers that she'd met the day before. It tried jumping up on the coral to reach her, and pretty much completely stopped acting like a shark. She managed to escape to a buoy as the tide came in, and the shark proceeded to rip the giant, steel buoy to pieces. She shoots the shark with a flare gun then lights whale oil in the water on fire with it, also lighting the shark on fire. I had already written off the movie at this point, but kept watching as I was already close to the end.<br><br>She then ties herself to the anchor that was holding the buoy in place, and as the shark breaks the chains away she is pulled hundreds of feet under water in the matter of a couple of seconds, and the shark chases her at full speed with reckless abandon to kill her. It ends up impaling itself on the jagged spikes which were apparently part of the anchor.<br><br>And yea, that was it. A stranded, wounded surfer with nothing kills an over 20 foot long shark by making it chase her into spikes. Dumb.<br><br>You know what would have been good? A wounded surfer on a small rock outcropping tries to keep her sanity and get help to survive a shark attack. Leave out the dead whale because that kind of made the rest of the movie not make sense. Don't make a wounded, half dead surfer kill a 20+ foot shark, that's not the victory that the movie needed. It would have been sufficient to have her survive. You don't have to schlock it up with the typical Hollywood type ending.<br><br>Sharks are scary enough, you don't have to make it cartoonish shark with a vendetta against a surfer. Every time the shark did something stupid that a shark would never do, it became less suspenseful. I don't know why they went down that road, but they turned a movie that started out pretty suspenseful into a SciFi Channel made for TV special with a dumb ending.","user":"bmyers22","rank":[71,96]},{"title":"Nifty, well-crafted shark thriller boasting a strong lead performance by Blake Lively.","rating":6,"date":"4 July 2016","review":"The Shallows knows exactly what it is, and that's the best praise I can give it. It's barely 90 minutes long, has a small cast, and only one location. Its only purpose is to give you a thrill-ride during that time; an adrenaline rush based on an ubiquitous fear among humans: being stranded in the ocean with a shark. However as the title suggests, this doesn't take place in the middle of the ocean. This woman is stranded only a couple hundred yards from the shore, close enough to potentially shout for help. What The Shallows does so well is establish this sense of isolation and hopelessness for our main character, and her situation of being so close yet so far from safety.<br><br>Blake Lively is great in this role. It's mostly a reactionary role - not much dialogue aside from some early establishing conversations to develop her character. For the majority of the film Lively is terrified and fighting for survival against a deadly shark. This thing is huge, like the Jaws' shark's father huge. And it's interesting to see how she follows its patterns and observes its behavior, allowing her to act accordingly without being trapped. There are some far-fetched scenes, sure, but Jaws had them as well and it's hailed as a classic. Now I'm not saying The Shallows is as good a movie as Jaws, because it certainly isn't. But again, the movie knows what it is, and as a short shark thriller appealing solely to our primal fear, it gets the job done and then some.<br><br>Now, it has its faults. The electronic music during the surfing scenes was immediately off-putting, and there are some slo-mo shots that definitely did not deserve to be in slo-mo. But the directing as a whole is well done - gorgeous sweeping shots of the open ocean, the slow build up before the initial attack, showing the shark only when it's most effective. The writing is clever and practical, relatable to the point that you feel for this character's predicament, and the acting as I said is top notch. The Shallows doesn't break any new ground, but it does exactly what it sets out to do - give the audience yet another reason to avoid the beach.","user":"lnvicta","rank":[202,305]}]