[{"title":"Breathe deep","rating":10,"date":"27 May 2018","review":"This is one of the most honest, disturbing yet beautiful explorations of a subject that is all too often over-simplified or dealt with extremely heavy-handily.<br><br>The way that the abuse is discussed within the characters frozen in time in the main character's psyche, is profound and unflinchingly honest. The discussions in real-life between mother and daughter - painfully real.<br><br>I will be thinking about this film for some time to come, it is an invitation to look much more closely at the stories we tell ourselves, especially with regards to \"love\".","user":"peterdeuk","rank":[104,140]},{"title":"How we re-write history to survive - heartbreaking","rating":9,"date":"30 May 2018","review":"The most interesting thing to add to other reviewers is how this poor child chose to reinvent what happened to her as consensual, as evidence she was \"mature,\" she was making her own choices, she was \"NOT a victim!\" (as she boldly wants us to know!).<br><br>Yet this sweet, young, pre-pubescent girl was abused, molested, and raped through preying upon her own insecurity, self-doubt, and shyness. However, she CAN'T see it that way and continue to survive.<br><br>So the adult Jennifer begins the movie with a fuzzy memory of a consensual relationship and herself at around 15 in her mind (until her mother corrects her - no, you were 13 that summer). And she slowly unravels what really happened. \nMost interestingly, we see the devastation in her life in present day that's a direct result of her experiences.<br><br>I know this is based on a true story. I would love to have seen /read the \"original\" essay she wrote at 13 years old for English class about the entire experience and why the teacher did NOT become alarmed and alert the girls parents or authorities. But it was different time then.... Still, unforgivable.","user":"coachbarbwade","rank":[59,85]},{"title":"WOW....Heartwrenching","rating":9,"date":"27 May 2018","review":"I've never written a review in my life, but anyone who has been touched by child sexual abuse get ready to feel bombarded. The shame, the confusion, the guilt, even the secret feelings of being \"special\"....they're all in there. This film was both hard to watch and hard to look away from. The acting is superb and the flow of dialogue realistic. A cautionary tale for anyone with children.","user":"mymovies-93713","rank":[65,97]}]