[{"title":"Lars von Trier's autobiography and a narcissistic statement about art...","rating":8,"date":"14 December 2018","review":"As a long time von Trier fan, I believe it's pretty obvious he made this film primarily for himself, and secondly for the dogmatic fans of his own work. Sure, on the surface it is a sort of a black psychological (divine, *wink, wink*) comedy, as some of his previous films can, as well, be seen. However, there is a layer beyond the physical, even more so the psychological aspect of what is portrayed.<br><br>I'll assume anyone reading this has already seen the film so I'm putting spoilers on.<br><br>It is my firm belief that the entire film is a metaphor for stages of life of an artist or at least a creator in some sense. As good and realistic, if you will, as the portrayal of the mental states Jack is in, what is beyond his actions is the most fascinating part.\nJack often refers to his work as art, and incidentally, the \"incidents\" represent the stages of an artists creative mentality, the way von Trier saw and perhaps experienced. It starts with, in the context of the chapters in the film:\n1.Impulsive creation, art in the moment, that one breath of inspiration that sets an artist on his path.\n2. Seeking perfection, obsessing over every possible detail, trying to achieve the ultimate form of art.\n3. Transgressive and controversial art, imagery designed to shock the audiences, that I believe also self-referential.\n4. Love and hate of one's own work, reaching a climax of creativity, at the point of giving up and exposing ones self.\n5. Burning out, making art just to get a new high, experimenting just for the sake of it and finding no new joy in this process.<br><br>Throughout the film, at one point, we get a flash of most of von Triers past work, ranging from The element of crime (1984), towards Nymphomaniac (2013), which I believe closes up his ode to himself and his life's work, showing that narcissistic side again, with a possible message of the end of his artistic endeavors, but also pride in himself as an artist and his career -and possibly a large \"f you\" to the Cannes Film Festival, represented by the house he finally manages to build, with the \"body\" of his work, while also being a word play on the nursery rhyme.\nThe epilogue is a very comical, almost cartoonish parody of the Divine Comedy, in which Jack (von Trier) is Dante, in which he shows emotion for the first time in a Citizen-Kane-like moment, but instead of his happy ending he falls into the deepest part of hell, possibly referring to von Trier's own mental state.","user":"Impatotec","rank":[253,348]},{"title":"Pseudo-art, and the death throes of von Trier","rating":5,"date":"18 December 2018","review":"The amount of 10/10 reviews are absolutely ridiculous. Pay them no heed. 1/10 is also similarly ridiculous, as there are positive take-aways (I enjoyed Dillon's neuroticism, and the first quarter of the film is genuinely funny). However, it ends up being nothing more than a competently produced film with almost no substance, an 'anthology' with no clear direction, and an overarching 'theme' ending up as an afterthought more than anything else.<br><br>'Shocked audiences at Cannes'...yes, cheap shocks. What could have been, in concept, a wonderful blend of comedy and horror falls flat, with the identity of the film never fully fledging itself out. Is it a dark comedy? One could argue this with the start. Is it von Trier lashing out at accusations of misogyny and pretentiousness by doubling down on both? There's plenty of proof for this argument as well. Is it an exploration into the nature of evil and psychopathy, and what constitutes art and artistic expression? It could have been, but it's never explored deeper than the usual tropes.<br><br>I think what upsets me the most about this film is how asinine it is, BECAUSE of the 'shocking' nature of it. It approaches self-parody at times, with brutality being used for no other purpose other than to make audiences cringe. If the elements serve no purpose other than shock, what is redeeming about it?<br><br>'The House That Jack Built' as a dark comedy - this would have worked fantastically, as there are legitimately funny (darkly funny, but funny nonetheless) moments in this film; the rising frustration at a broken car jack, the interchange between him and the woman behind the locked screen door, the blundering act with the police officer, the creation of the waving child before his body fully froze. The issue is that the film never fully embraces this (think American Psycho, where the film adaptation of the book softens the brutality and opts for dark, absurd comedy throughout).<br><br>'The House That Jack Built' as a personal commentary of von Trier - there is also evidence of this, and in spades. The narration throughout between Jack and 'Verge' (Virgil? Hell's guide?) approaches breaking the 4th wall, between commentary of the film and commentary on von Trier's own body of work as a whole. The self-masturbation was palpable, but it is is fully confirmed near the end, when he uses footage from his own films as supporting evidence. However, this wasn't fully embraced either because the accusations against him of being a pretentious misonynyst, instead of deflecting from them, or justifying them via the commentary itself, are merely confirmed throughout the film; brutal violence is only employed against women, with very graphic shots of strangulation, bludgeoning, and even slicing off a woman's breasts) and Verge even points this out in the film. Men are killed, sure, but never sadistically. The final trap of killing 5 men with a single bullet feels merciful more than anything. Was von Trier purposefully doubling down on accusations of misogyny by ramping up the misogyny? What meta-commentary is he trying to do here? This is a cheap self-analysis of his own work, a blatant lack of self-awareness.<br><br>'The House That Jack Built' as an exploration into the nature of evil, psychopathy, and artistic expression - throughout the whole film, Jack again and again mentions that he is an artist - in a literal sense, being an engineer-turned-architect, wanting to design and built his perfect edifice - which he demolishes and rebuilds over and over again; but also in an attempt to blur the line between artistry and psychopathy/evil, by making art out of his murders - comically posed photographs of his victims, presentations of his hunting which include culled crows, along with his family - even this idea is only half-baked, as only some of his murders fall into this. The most pervasive thought I had was that Jack was a pseudo-intellectual narcissist who overestimated his own intelligence, proved by his own failures as an architect, his basic views of art, and I thought whether this was in itself some kind of meta-commentary von Trier was making of himself, ironically - does he view himself as Jack thinks he does, or as Jack actually is? The reviews that state that Jack is a 'genius' are baffling - the movie makes it clear that luck, or divine providence, are instrumental in Jack's success - there are blunders and lack of preparation, in almost every instance. He even voices his lack of repercussion for anything he's ever done, which is why these interpretations of him as a 'genius killer' are baffling to me. The creation of the house from the corpses was almost so obvious, I was hoping it wouldn't actually happen - but it does, to my dismay. And at this point, the shocks are non-existent. The parallels between personal evil and the 'great evils' (Hitler, Idi Amin, Mussolini, genocide, etc) are so fundamentally basic that it must be a piss-take by von Trier.<br><br>Which leads me to the following: Is von Trier so self-aware that he would make a film as a parody-commentary of his own body of work and his approach to film-making? Or is he so self-absorbed that he doesn't see that it's become a parody of himself, and he can produce half-baked films to (as evidenced by the user reviews here) riotous reception and being lauded a 'cinema genius'? I don't know, and I don't care to spend more time pondering this question, because I don't believe he is the genius that the cult of personality around him would paint him as. I believe he has produced genuinely beautiful (if haunting) films, with 'Dancer in the Dark' and 'Dogville', but the reliance of shock as a means to push films has gone full circle into self-parody now, and being self-aware of this as he may be, doesn't justify the pseudo-artistry of it.","user":"drucom","rank":[151,229]},{"title":"The House That Jack Built (2018) Review","rating":9,"date":"19 September 2018","review":"I just saw Lars Von Trier's new film 'The House That Jack Built' at the Atlantic Film Festival. I'm not extremely familiar with Trier's other work (I love Antichrist and Dancer in the dark is one of the most depressing films I've ever seen), but I've still been looking forward to this one since its premiere at Cannes. The subject matter peaked my interest and the trailer looked great. The early reviews got me even more invested as everyone was saying it was Trier's most disturbing and violent film yet.<br><br>'The House That Jack Built' was fairly brutal, yet oddly comical (if you can look past the disturbing material) and widely entertaining. I was not expecting it to be as funny as it was considering all of the 'hype' around the film's dark brutality since its screening at Cannes. Having said that there are some extremely gruesome and disturbing scenes which are effective in what they set out to do. <br><br>The film is divided into 5 sections plus an epilogue. A strange structure but ultimately I think that it benefited the film as we see a slight progression of Jack's character throughout. Though it can feel a bit repetitive at points, it never gets boring and is continuously engaging. Matt Dillon was excellent as the truly psychopathic serial killer Jack. It was honestly probably the best role I've seen him in (seriously, he should be in more movies). <br><br>There are many philosophical discussions about the nature of art throughout the film. This can either come off as super pretentious or can actually add to the film. I thought it worked fine in the context of the film as it relates very much to the character of Jack and how he views himself and his, so to say, 'art'<br><br>The film portrays the violence in a fairly realistic manner and does not hold back. At all. Seriously, the movie is not for the faint of heart. But it never came across as gratuitous or 'edgy'. It felt like Trier was just showing us what these scenarios would look like if a serial killer viewed his killings as art. <br><br>If you're a fan of Trier's work then definitely try and see this one. Even if you're just a fan of disturbing art-films, check it out. It has a screening at VIFF in October but other than that I have no idea where you can see it. Surprisingly, the Atlantic Film Festival (Halifax, Nova Scotia) had a one-night screening for the film. Either way, try and see it if it looks interesting to you. I highly recommend it. 9/10.","user":"ethancarmanmoore","rank":[227,355]}]