[{"title":"Seriously, Nicholas Cage, is your time over?","rating":1,"date":"13 November 2016","review":"I am a fan of Nicholas Cage who believes that his movies are just below the top grade, but enjoyable at most times.. I read the story-line in IMDb and was seriously looking forward to have a good time. Boy, i was wrong. There was no story, no thrills but cheap gun shooting action. I went all the way to write a review as i believe that this review could save someone their 90 minutes. By the way, this is only my 3rd review ever in the last 8 years, the other 2 being positives and this one for the sheer disappointment i had with the movie. <br><br>Pls avoid this movie unless you are a blood thirsty movie lover.<br><br>Hope this helps!","user":"johnphilips-be","rank":[80,124]},{"title":"Wow","rating":3,"date":"19 November 2016","review":"I can honestly say this one of Nicolas Cage's worst films and I think his career is tanking. From the opening scene it was appalling. It is extremely dark, weighing heavy on valleys and missing any peaks. Also, being as I am a Clevelander, it does not portray an accurate portrait of the city I love...not even in regards to crime. This is a despicable display of cinema art. I have no known issues with crime films or violence. What I do have an issue with is is poorly written, directed, and produced work like Dog Eat Dog. The actors in this film are legendary but their work is sub par, at best! Save yourself the time that I wasted by not viewing this film.","user":"ikonsneed","rank":[42,63]},{"title":"Fooled by a cool trailer yet again","rating":4,"date":"30 December 2016","review":"Starts out entertaining enough, the first 10 minutes or so offers some absolutely insane dark comedy from Willem Defoe.<br><br>But eventually (fairly early tbh) the script runs out of steam and it takes a more serious (not so comedic at least) turn but more so goes all over the place with little to no coherency at times.<br><br>I can't help but to think that this movie must have been at least 30 minutes longer but edited down to the point where one minute for instance a person is caught by the police and the next he's free with no explanation as to how this happened.<br><br>Not that I think that the movie being 2 hours instead of 90 would have helped it much though tbh because the editing is far from the only problem this movie has.<br><br>Nicholas Cage's character appears to change from one scene to the next after a while, starting off as the more sensible criminal of the trio but eventually lashing off and appears to try to outcrazy Willem Defoe (who is the crazy guy in the group).<br><br>Why did I say trio you ask, well there's actually a third guy with the same importance as Cage and Defoe and that is the unknown Christopher Matthew Cook, I'm guessing he is good friends with the director or something because he just becomes 'the other guy' when put in to the same position as 2 stars like Cage and Defoe and doesn't have the acting-chops to rise above it.<br><br>Cook's character is said by Cage's character to be incredibly intelligent talking about how if he lived in another universe he would have been a Harvard student, but there's nothing that Cook's character says or does in the film that suggest that he is particularly smart.<br><br>There's a lot of random stuff like that that doesn't go anywhere and a lot of random stuff that doesn't come from anywhere, like the last 5 minutes, very random.<br><br>Anyways all in all it just becomes a pointless and confusing Tarantino wanna be of a film.","user":"Seth_Rogue_One","rank":[21,30]}]