[{"title":"Terrible......Just.Terrible.","rating":1,"date":"7 February 2018","review":"This is the worst \"documentary\" I have ever seen. I would rather have actually been \nabducted by aliens and implanted than to have watched this garbage. This might as well have been made by a couple of 14 year olds equipped with an iphone. The most scientific aspect of the entire film was when \"Steve the scientist\" (in his personal laboratory that looks like a renovated outhouse) pulled out his periodic table of elements to intrepret the alleged data; but what really puts this film over the edge of barely tolerable is the narration by the film maker himself. Terrible.","user":"pamelonians","rank":[26,32]},{"title":"Where is the zero star option?","rating":1,"date":"10 March 2018","review":"0 Stars - WOW, and yes I did watch the whole thing. It was what I'd expected, but Ken Ham, (Queensland Institute of Technology (B.AS.)\nUniversity of Queensland) the guy who built the Ark reproduction has a better scam. (u mm... I meant science)<br><br>I DARE you to watch this and tell me I am wrong!<br><br>The \"Nano-scientist,\" (just listed as Christoper C. in the credits,) was some guy in a shed, looking up information from a high school level textbook, \"Modern Physics\" by Hans C Ohanian (1986), and yes I looked it up, but by using Google, along with an old classroom size periodic table. Believe it or NOT!<br><br>As far I could tell, there were only to people that had degrees at all in this film, the main character Roger Krevin Leir, graduated with a bachelor's degree in Science from the University of Southern California in 1961, qualifying as a podiatrist three years later. I could not find any advance degree listed, my guess is to \"qualify\" in 1961 as a podiatrist was not as rigorous, but I'm not sure why one would not flaunt your credentials a bit.<br><br>The surgeon who actually performed the operation was only listed as Dr. Matrisciano. Boy, was it hard to find him! Doing an in-depth Google search, it was hard to really link the doctors together, go figure! <br><br>In the movie, Dr. Matrisciano explicitly states \"just some small foreign object. I just removed it, up to the tests to see what it is\" In the one and only Google article I could find to tell me who/if he was a real doctor stated; <br><br>\"\"Dr. John D, Matrisciano. \"I know nothing about UFOs or implants,\" Dr. Matrisciano said after the operation, \"but I think that's what is needed in this case; to be objective.\"\"<br><br>The article also makes it clear this was Matriscianos' first operation done for Leir. Dr. John D, Matrisciano still seems to be working in Thousand Oaks California, and has what someone would expect to find, some link to credentials.<br><br>Well there, my guess is I spent more time researching this online than any of the above spent on contemplating how silly they all appear in the film. Or maybe they just wanted a quick buck, and thought anyone that matters would never see the film?","user":"mastrait","rank":[9,10]},{"title":"Yaaawwwnnn","rating":1,"date":"6 February 2018","review":"Basically a really really slow documentary discussing a tiny bit of metal in a man's leg which pretty obviously got there when riding his motorbike. <br><br>The experts are, well not experts.<br><br>Utter nonsense","user":"michaelbohan-58928","rank":[16,20]}]