[{"title":"Well done","rating":8,"date":"12 September 2019","review":"I had been wanted to watch this and then read the reviews and thought I wouldn't bother. I only ended up putting this movie on as I'd seen everything else and couldn't sleep.\nDid I watch the same movie as the people who hated it? I understand each to their own but for me the acting was great and the story would have resonated with so many different people on many levels.\nA rare script to have so many great actors in it so they obviously saw the wow factor.","user":"info-569-1968","rank":[33,48]},{"title":"Overblown and over-wrought","rating":5,"date":"13 September 2019","review":"Dolan's movie creaks and groans and ultimately fizzles under the weight of it's own enormous ambition. And, to be fair, it's beautifully directed. Dolan has great visual stye, invests scenes with great energy and emotion, and gets wonderful performances from a very impressive cast. You can see why Sarandon and Bates and Portman would have placed their faith in him. Unfortunately, the script is too slight to withstand the epic treatment it's given, and the movie runs out of steam before even the halfway mark. It's at least 20 minutes, probably 30 minutes too long. But even a good hard edit wouldn't have saved it. Dolan is certainly a director to watch, but he's going to need better material than this.","user":"ozjosh03","rank":[17,23]},{"title":"So much potential and such a messy film.","rating":4,"date":"16 September 2019","review":"It's a shame that \"The Death And Life Of John F. Donovan\" isn't as good as it should be. A messy, mismatched, and overly long film.<br><br>In this drama, years after the death of a TV star, a young man reminisces the written correspondence he shared with the famous actor, as well as the impact those letters had on both their lives.<br><br>As much as writer/director Xavier Dolan's latest effort isn't really confusing, it kind of feels like it is. After you're done watching \"The Death And Life Of John F. Donovan\" you feel as if you've spent hours and hours watching this film and it goes nowhere. The film does feature some good performances from the all-star cast but in the end the story is what is at fault here. The film does have a powerful moment which features the song \"Hanging By A Moment\" by Lifehouse; you wish \"The Death And Life Of John F. Donavon\" was that great throughout. It could've been a better drama but Dolan's film is just a disappointment.","user":"SnobReviews","rank":[16,22]}]