[{"title":"A modern Frankenstein that never forgets its roots.","rating":8,"date":"17 February 2016","review":"Bernard Rose has successfully translated Mary Shelley's original novel by turning it into a Cronenbergian body horror tragedy. <br><br>The performances are stellar with Xavier Samuel making a heartbreaking Monster and Tony Todd stealing the show as a blind musician. <br><br>The direction is superb and horror fans will be pleased by the gruesome practical effects. If there are any weak points here, it would be the extremely brisk pacing and a few odd editing decision. <br><br>The ending is also frustratingly abrupt. Beyond that, it is nothing less than a triumph of genre filmmaking and the sort of thing I wish to see more of from the horror world.","user":"gojiseb","rank":[29,37]},{"title":"Such Promise...","rating":6,"date":"11 March 2016","review":"I had high hopes for this film, not because I'm a horror movie and goth-loving freak, but also because it was a fresh take on an old idea.<br><br>The film started off well enough. Victor Frankenstein was really a marginal role here; his wife was pretty much the focus as well as the monster himself. Most of the elements from classic Frankenstein were there, and that was nice to see. The acting was generally good, too, especially the monster. I think the filmmakers did well with transitioning the monster from a baby to a man.<br><br>But that's where the script fell apart. I know one thing for sure - if I was hustling on the street constantly, playing my guitar and begging for money, I don't think I'd give my hard earned cash away so some guy I just met can get laid for the first time.<br><br>And you know, there are people today who are thoroughly perplexed by the GPS systems on their cellphones. How the monster was able to navigate with it after just being recently created is a mystery to me. The monster also sure knew how to say the right things at the right emotional time.<br><br>I think that if I was a cop I'd protest this movie. Yes, the police do go over and above their call of duty at times (see Black Lives Matter), but are they really this unfeeling and barbaric? What I did like about the movie was the blood. Yeah, this one was violent as hell. The makeup was well done, too. If there's anything that stood out for me was the monster and the level of violence in the film. Just for those two things alone it's worth giving 'Frankenstein' a looksee.","user":"redrobin62-321-207311","rank":[9,10]},{"title":"modern revision","rating":5,"date":"7 October 2017","review":"Married scientists Elizabeth (Carrie-Anne Moss) and Victor Frankenstein (Danny Huston) reanimates Adam (Xavier Samuel) although he only retains the mind of a baby. He starts to deteriorate with deformities. The scientists try to euthanize him but he is too strong and too hard to kill. He escapes but causes chaos and is attacked by the angry public.<br><br>I like the idea of bringing Frankenstein into the modern world. I like doing some of the classic story elements such as the little girl and the angry mob. Around the midway point, the film loses me. The cop taking him out back and shooting him in the head is completely wrong. There are some more wrong-headed stuff like a voice-over suggesting an advanced mind which isn't right. The A-list stars Moss and Huston leave after the first act and only return for the last confrontation. Samuel is perfectly fine. This is an intriguing idea but it doesn't come to much more than an indie.","user":"SnoopyStyle","rank":[5,5]}]