[{"title":"It was okay, at best.","rating":7,"date":"22 January 2015","review":"I watched all four episodes of the new Arise series then went back and watched the classic 1995 film. The newer version, despite the advantage of visual technology and with 4 hours to do express itself, still could not touch the original film. The clarity and depth of the storyline, as well as the rich dialogue, is what makes the original GITS a masterpiece that's clearly not easy to replicate. The original version makes it clear from the opening sequence that the major is a cyborg, consisting of ONE organic body part - her brain! The series dances around this clear fact, admitting it at times, and then seemingly contradicting it in other moments with the sexual innuendos. Don't get me wrong, the series was not a completely bad attempt to resurrect GITS; it just missed the opportunity to achieve something epic. The very definition of a classic is that it cannot (and should not) be replicated. Simply let it be. The Americans have decided to see if they can botch the franchise further with a non-animated version due in 2017. All I can do is SMFH!!","user":"BlissQuest","rank":[5,7]},{"title":"Worth a watch if you are a Ghost in the Shell fan","rating":8,"date":"24 December 2014","review":"Story The story quite honestly feels like you have seen it before from Ghost in the Shell, not deviating from the ghost hacking concept that is present all throughout the franchise. However, despite staying in the \"comfort zone\" of the franchise it is still a fascinating universe being portrayed, and so it is still intriguing to follow Section 9 as they unravel a case even if the story concept isn't as unique as it once was when it was in the franchise. This particular movie felt as though it could fit right in with the Stand Alone Complex series as an episode that was stand alone from the over arching story. It is nothing new, but that isn't a bad thing because it can still tell an interesting and rewarding story which it does.<br><br>Art Production IG did a great job with the art in this series of movies combining vibrant colors and fluid animation that give this OVA series a unique and refreshing feel. It does a good job at making the world feel realistic, like the movements of the characters actually have weight and substance. I believe the cinematography could have been better when the show slows down to scenes of conversation between characters. Perhaps it was just the camera positioning in some of the shots, but they could have definitely made the more dialogue heavy and static scenes more interesting.<br><br>Sound The soundtrack is nothing to go crazy about, though it does fit the aesthetic of the Arise series quite well I believe. I can personally admire some of the music from a technical standing because I produce electronic music myself, but there aren't many memorable compositions in the soundtrack. The exception to this would be the opening theme which is an extremely soothing track with all kinds of interesting techniques and musical elements that feels like a breath of fresh air. Otherwise there are mainly standard songs that get the job done, but could be done better.<br><br>Characters These are the same characters of Section 9 that we have grown to enjoy from Ghost in the Shell and it comes as no surprise that the communication between them is entertaining, mainly Togusa, Batou, and the Major. The other characters don't get too much spotlight in this series which is a shame because we already know so much about these main characters that it would be nice to get some more development from the other characters in Section 9. That is more of a personal gripe that stems from how fond I am of the characters. There isn't much development of the characters in this series, it almost just seems shoved off for the last few minutes of each movie. Without any prior knowledge of the characters through previous iterations I would definitely have felt detached from the characters because of this lack of development.<br><br>Ghost in the Shell: Arise as a whole does not stand as tall as other Ghost in the Shells have but it stands with them at a comfortable level. It doesn't attempt anything new but it still has interesting cases for Section 9 to solve and I was on board for each one. It is a relaxing watch that won't make you think too hard but still keeps things seemingly complex with stories about ghost hacking and ghost dubbing. I enjoyed it, though I still much prefer the original movie and Stand Alone Complex over it.","user":"StzmJgzmf","rank":[6,9]},{"title":"A sad testament of what has become of the Ghost in the Shell franchise","rating":4,"date":"17 December 2014","review":"I honestly had hopes left for the last installment of the Arise arc, I thought that maybe they'd want to end it properly by actually putting effort in developing something that didn't feel cheap, uninspired and forgettable.<br><br>Well I was wrong, Just like the other three episodes prior, it's amateurish, and feels like a dumbed down version of SAC, which in itself wasn't the greatest thing ever, but was enjoyable in its own way.<br><br>Soundtrack-wise it features weaksauce techno beats, the animation is poorly done and is borderline laughable. Scenes and lines are (poorly) rehashed from the 1995 film and as usual the character development is lacking.<br><br>This movie says a lot about the current state of anime as a whole and its target audience. I really have to go re-watch Mamoru Oshii's film to rinse the bitter taste this thing left on my mouth.","user":"aaroncsm-169-107280","rank":[10,21]}]