[{"title":"Don't think it. Don't watch it.","rating":1,"date":"17 April 2017","review":"Let's just all hope, the girl who played the girlfriend never gets a movie role ever again. The whole film felt like a joke and the acting was awful but that girl..i was laughing out loud and calling out for Jesus anytime she was on screen. Probably the worst 'acting' I have ever seen. About the story. There's really no story. There's this man who shows up when you say his name and makes you see and do things. For what reason tho? No clue. Where did he come from? No clue. Why? No clue. What's with his dog? No clue.","user":"denesn","rank":[42,62]},{"title":"Say bye bye to decent horror films","rating":1,"date":"23 January 2017","review":"There are moments when you watch a trailer for a movie and think to yourself \"Well, the trailer is pretty bad, but maybe the movie is better.\" And, sometimes the movie does actually turn out to be better, making you pleasantly surprised. I did not have that feeling as I watched the trailer for the Bye Bye Man. After the trailer ended, there was not one ounce of me that thought \"OK, maybe I should give it a shot.\". <br><br>I watched this movie with my best friend, who also happens to be a horror fan, only because we have literally seen everything else that was out. I personally found three major issues with the movie. <br><br>1. The characters: Not one of the characters were particularly likable, so who really cares if any or all of them get hacked to bits? They don't really have any back story. The only one you feel any emotion towards at all is Elliot, and even those moments of emotion are sparse. Of course, he's the only one who has somewhat of a history to him. <br><br>2. The acting: To put it simply, the acting is horrendous. It's downright laughable. The writing can only be blamed for so long. It felt more like a high school stage production (and a bad one at that), than an actual movie. The women who played Kim, and Elliot's girlfriend, are by far the worst out of the whole movie, the latter being slightly worse than the former.<br><br>3. The worst thing about this movie is there is no mythology about the Bye Bye Man. There is zero backstory into who or what this creature is. All we know is that he is a creepy man with a creepy dog, and that's it. We don't know why he's terrorizing and killing these people, other than the fact that they say his name. WHY?! Where did that lore come from? Even the most psychotic icons of horror have some backstory into why they are that way. This movie offers you none of that. <br><br>I wouldn't recommend seeing this movie; I wouldn't recommend renting this movie; I wouldn't even recommend watching this movie for free on Netflix. This is one of the worst horror movies I have ever seen, and I've seen some very bad horror movies.","user":"JontheLobsterLover","rank":[119,201]},{"title":"Why the bad reviews?","rating":8,"date":"29 March 2017","review":"I just finished watching this movie. I don't understand all the bad reviews I thought it was pretty good. I'm very particular on my horror especially these days. I found it to be rather eerie and a creepy atmosphere. It has a nightmare on elm street kind of vibe but more stranger. It's not a serial killer rip off and far from boring. <br><br>Perhaps people are just obsessed with the lousy \"found footage\" atmosphere or the Ouija boards possessions. I thought it was a rather refreshing considering all the other flicks these days. I wasn't expecting to enjoy it I just put it on for background noise and I thought it was going to be a random crazy fellow killing random people. <br><br>I highly suggest it I'm shocked about all the bad reviews I'm wondering if we watched the same movie. If you're not the type to listen to bad reviews I say take a chance for it.","user":"BatsyCharky","rank":[169,300]}]