[{"title":"Better than expected","rating":2,"date":"2 March 2016","review":"I have to say, I never expected this to be even watchable but was pleasantly surprised by the writing and quirk quotient. The lead, unknown to me, was decent enough and the cast proved to be very entertaining. The narrative isn't anything too unique (fish out of water succeeds), but the story is engaging enough to make you care about the protagonist and stick with it. The payoff to me are mostly the scenes with Michael Rapaport and Jay R. Ferguson who bring a hilarious bizarro edge to the story. One thing this film deserved was a better ending, not to give anything away, but it is fairly anticlimactic.","user":"MongoLloyd","rank":[8,11]},{"title":"Was this a tax write off?","rating":2,"date":"25 May 2016","review":"In all respects this was horrible. B-grade actors who never had a starring role in any movie or HBO special, dialogue that was just that far below being memorable, location shots and then just bad backyard actual locations that made for anyone to know it was just sad and pathetic.<br><br>The movie should really have been called \"When you think of making a movie and you have a couple hundred bucks\".<br><br>The B-grade actors must have been doing someone a favor to appear in this dung.<br><br>The movie production values screamed that it was made with a handycam. The actors looked bored and as if they were wondering why they were asked to say the horrible lines. Nothing about the piece was believable.<br><br>Please, producers, before you decide to fund your cousins' latest project because your mom said to do it, think of your reputation.","user":"sanjsrik","rank":[7,10]},{"title":"Worse than I could have expected","rating":2,"date":"11 July 2016","review":"I have seen many great films that have gotten rotten reviews and this one didn't have many expectations but I thought it might be off beat and funny in some sense. I was shocked that it was worse than my lowest expectations. The main character is not cute, funny, charming, smart or funny (did I already say not funny?). He is supposed to be a stand up comedienne and yet his act sucks. He makes fun on members of the audience and the act is disturbing and uncomfortable. The love interest is laughable but only because they have no charisma together and there is no way to believe she would be involved with such a loser. None of his friends are funny, none of her friends are funny especially her brother who tried so very hard to be funny and failed. Terrible script, terrible directing, terrible film. A couple of nice moments with his daughter but that isn't the main focus of the film because the director shined the light in all the wrong places.","user":"johnmartindj","rank":[3,4]}]