[{"title":"Hurtful try at being entertainingly informative","rating":2,"date":"13 May 2016","review":"Amerigeddon the movie has quite possibly done more damage to furthering the discussion of a runaway government and the impacts of it than anything else in its cinematic attempt. This is an example of good intentions gone sideways and at worst just another rich guy making a \"B\" movie to get his face on the big screen.<br><br>Using the \"EMP\" doomsday approach to make a movie narrative is understandable. Making an over dramatic, choppy, and under developed story line film that my friends wanted to walk out of is bull headed irresponsibility.<br><br>The movie itself started out with plausible and believable scenes in the first few minutes that quickly get over shadowed by bad music, 1980's sound effects at \"key\" moments, and acting that would make a high school drama teacher throw their glasses in disgust at. While it didn't have to be cutting edge graphics or sounds track quality, it does have to be fully watchable. It isn't. It is painful to sit all the way through. The end battle was worse than an old scene from the 80's A-Team TV show.<br><br>For those people that have been in the military, or follow world events from an anti-globalist perspective, this movie lets you walk out of the theater having to apologize for the horrible creation the people that went with them just saw. There is no plausible transition to a realistic conversation about politics, individual preparedness, or faith at the end of this film.<br><br>I am terribly disappointed and embarrassed by this attempt at informing or at least sparking the interest in people who don't take these kinds of things seriously.<br><br>From someone who wanted an A plus movie it is clearly an F minus effort.","user":"pamyers-90771","rank":[71,110]},{"title":"Seriously ?","rating":1,"date":"18 September 2016","review":"This movie is an tragedy and insult to all people with common logic and knowledge . Once again the US and their \" freedom \" is under attack and the bunch of \"patriots \" are saving America. I don't have problems with B movies but this one ., this story is so , so stupid that I had to comment on it . Even the birds on the tree knows who is the biggest imperialist country in the world but somehow in the movies they are always the victim and the enemy this time are the United Nations ( biggest sponsor of the UN is US , basically UN is in the pocket of US ) This movie could only be good for somebody from the US ., probably only from Texas and other rednecks parts of the US . Just unbelievable ., just trash of the story :)","user":"amerstaff","rank":[100,168]},{"title":"They did try, but.......","rating":5,"date":"20 September 2016","review":"\"Well, they did try but....\" was the first thing that came to mind having watched AmeriGeddon. <br><br>Its not that this politicized film doesn't have some valid points. Its concerns over globalized corporate government and the growth of an oppressive surveillance state, are not without validity. Nor is its criticism of GMO food, something that can simply be written off. The problem is, the whole affair is so over the top and confused, that the real message gets lost in translation. <br><br>From an entertainment point of view, this rather short flick, is best described as a cross between Red Dawn and the A-Team. Its clearly a budget affair.That said, the acting is not too bad even if the script is more than a little corny.<br><br>In summary even though this flick falls short of the mark, its still good to see people refusing to blindly accept the mainstream dialogue. Lets hope for more polished, focused efforts in future. Five out of ten from me.","user":"s3276169","rank":[38,61]}]