[{"title":"It's Not a Tumor","rating":7,"date":"30 June 2017","review":"In case you missed the first film, or like me forgot it, there is a brief statement to get you caught up. The web site Redroom causes a tumor to grow in a person's brain turning them into a killer who can be partially controlled. There is a cure, that is to drill a hole in the skull and disconnect the blood vessel to the tumor, however the tumor may take over the body again...or not. These people are called \"defects.\" There is a web page that shows you how to do this with simple power tools with advice, \"not too deep.\" Love the dark humor.<br><br>Sam (Michelle Mylett) is a defect on the run from everybody as humans are killing defects too. She teams up with a young defect Beatrice (Josette Halpert) who everyone calls 'Bean.\" She was cured by her father (Stephen Bogaert). Sam had a son taken away from her at birth.<br><br>The film is great at this point, like Milla Jovovich killing zombies in any \"Resident Evil\" film. However like \"Resident Evil\" they don't leave it at that. Someone decides they want to create a lower budget story line so it goes indoors to some lab. At the lab there is a young boy (Samuel Faraci) who has a strange connection to Sam...not too hard to figure out.<br><br>The acting was fairly decent. As you can surmise I didn't like much of the lab scenes. Samuel Faraci did good as the boy. There is a twist ending that was not well developed, nor did it seem to make a lot of sense. For Trekkies think \"The Return of the Archons\" the \"will of Landru.\" I didn't appreciate the first film as I was not familiar with \"brain hacking\" where a person's brain physically is altered to that of an addict from being on line. This production takes that fact and extrapolates it to the nth degree.<br><br>Guide: No F-words that I recall. No sex or nudity. One brief scene where a man is on top of a woman forcing himself.","user":"mikeledo","rank":[8,12]},{"title":"IT'S NOT A TUMOR","rating":7,"date":"7 October 2018","review":"In case you missed the first film, or like me forgot it, there is a brief statement to get you caught up. The web site Redroom causes a tumor to grow in a person's brain turning them into a killer who can be partially controlled. There is a cure, that is to drill a hole in the skull and disconnect the blood vessel to the tumor, however the tumor may take over the body again...or not. These people are called \"defects.\" There is a web page that shows you how to do this with simple power tools with advice, \"not too deep.\" Love the dark humor.<br><br>Sam (Michelle Mylett) is a defect on the run from everybody as humans are killing defects too. She teams up with a young defect Beatrice (Josette Halpert) who everyone calls 'Bean.\" She was cured by her father (Stephen Bogaert). Sam had a son taken away from her at birth.<br><br>The film is great at this point, like Milla Jovovich killing zombies in any \"Resident Evil\" film. However like \"Resident Evil\" they don't leave it at that. Someone decides they want to create a lower budget story line so it goes indoors to some lab. At the lab there is a young boy (Samuel Faraci) who has a strange connection to Sam...not too hard to figure out.<br><br>The acting was fairly decent. As you can surmise I didn't like much of the lab scenes. Samuel Faraci did good as the boy. There is a twist ending that was not well developed, nor did it seem to make a lot of sense. For Trekkies think \"The Return of the Archons\" the \"will of Landru.\"<br><br>I didn't appreciate the first film as I was not familiar with \"brain hacking\" where a person's brain physically is altered to that of an addict from being on line. This production takes that fact and extrapolates it to the nth degree.<br><br>Guide: No F-words that I recall. No sex or nudity. One brief scene where a man is on top of a woman forcing himself.","user":"nogodnomasters","rank":[3,5]},{"title":"Not great...","rating":4,"date":"28 November 2019","review":"It's very easy to see they weren't too sure what they wanted to do here, the first 40 or so minutes is basically just going from location to location with no real story building ...you could literally jump 40 minutes in and not have missed anything.<br><br>This is your very basic \"we are a military compound, working on a cure\" type zombie movie. Except I will say the kid, and how he interacts with the characters is kinda neat I guess? The kid did a great job.<br><br>There just isn't much else to say...it pretty much ends how you expect with a minor twist. The first movie was much better. Also, the bad guy in this couldn't have been more cliche.<br><br>Also, why earlier in the film did Sam mention she could stay online for a max of 5 minutes and infact goes slightly over it over, then later on her heads about to pop off at less than two minutes? It's just kind of a mess...","user":"mvike","rank":[1,1]}]