[{"title":"Intruders or Shut In? Why two different titles?","rating":7,"date":"16 February 2016","review":"Just finished watching Intruders or Shut In. I don't know what the real title is and I don't get why you have to have two different titles for one movie. But nevertheless I enjoyed this thriller. It's not a horror movie but a thriller. I didn't read any of the reviews before watching it and I'm glad I didn't because the story is full of twists and I didn't see them coming at all. The actors all did a good job with their respective characters. The story starts slow but quickly builds up to a efficient thriller. There are enough twists in the movie to keep you interested until the end. Even though the end was a bit disappointing to me but it still is a good thriller to watch.","user":"deloudelouvain","rank":[27,31]},{"title":"Interesting Premise But Filled With Unlikable Characters","rating":6,"date":"18 January 2016","review":"The whole \"Woman turns the table of ruthless killers\" thing has been done a lot lately. You're Next, Preservation, I Spit On Your Grave Remakes, have all done the theme quite well. So when I read the premise for this film it sounded like more of the same and I really wasn't too thrilled. But \"Intruders\" managed to take that theme and do something pretty interesting and a little interested with it.<br><br>I won't spoil anything but I will say that this isn't just simply a movie about a woman being attacked by men and then turning the tables on them. There are some things thrown in to spice it up a bit and make the movie more suspenseful. However, some of the things that were thrown in felt a little choppy and rushed. It's good that the film makers tried to do some original things but some of them just didn't work.<br><br>The movie's weak point is definitely the characters. The baddies are just not interesting at all and the leading female transitions through emotions way too much to ever really gain a connection with the audience. You want to root for her but a lot of her actions are questionable, and plus one minute she will be a ruthless bad ass and then the next she is a babbling victim.<br><br>I liked this film, it does enough right to make it an entertaining experience. Unfortunately it misses the ball on being more then just good, if they would have done a few more things right it probably could have been a pretty great horror film.<br><br>6/10","user":"HorrorOverEverything","rank":[40,49]},{"title":"Revenge-style flick with nice twist","rating":8,"date":"28 December 2015","review":"Intruders (or \"Shut In\", as it was when I saw it at the European Premiere) begins as a fairly tame drama about a woman with agoraphobia but takes a sudden and welcome turn for the more exciting and interesting to become a satisfying revenge sub-genre picture.<br><br>It compares, in spirit, with the recent \"No One Lives\" and perhaps slightly in plot with \"I Spit on your Grave\" though, like the former, does not take itself too seriously and certainly doesn't have the vicious nature of the latter.<br><br>The ending is perhaps a bit predictable and watered down. That would be my only criticism of an otherwise fun movie.<br><br>This was one of my favorites at the FrightFest festival and am eager to catch it again at some point.","user":"mungflesh","rank":[58,74]}]