[{"title":"Funny, Sweet Look at a Modern Japanese Family","rating":8,"date":"31 July 2016","review":"Shuzo, a recent retiree, likes to spend his time smoking and drinking and hanging out at his favourite bar; Tomiko, his wife of 45 years, has been taking creative writing courses at the local cultural center. When Shuzo get home from his bar late one night, which happens to be Tomiko's birthday, he (having forgotten her birthday) promises to get her what she wants, as long as it's not too expensive. Tomiko reassures him that what she really wants only costs 450 yen - it's a divorce. Her proclamation throws the entire house into a tizzy - the household including their oldest son, his wife and two children, along with their youngest son; their daughter and his husband, constantly fighting and threatening divorce, are also frequent visitors. How this family will resolve their problems is a matter of time, fighting, family meetings and, well, hilarity too. I enjoyed this light, witty and sometimes touching tale, with its characters who are quirky but not annoyingly (or overly) so. There is a constant stream of physical humour too, with various people falling over things, tripping down stairs and so on - again, done to a certain degree, but not so much that one starts rolling one's eyes at it. This is a fun glimpse into modern Japanese family life, particularly with respect to the differences between the generations, and it also serves as a comedy of manners, Japanese style!","user":"alisonc-1","rank":[4,5]},{"title":"Amazing movie","rating":9,"date":"4 September 2018","review":"Watched this second movie on the plane ride back from Japan. It simply amazed me, i laughed and i cried. Its just something so different than what we in the west are used to, it has its own wonderful charm. I dont know much about family life in Japan, but that a lot how i imagine it. Though id consider the movie as a comedy it has some serious topics to it and makes you think about family and its value.\nCant wait to see the third movie in the future. Hopefully i can watch it somewhere, its hard enough to find these movies back in europe. <br><br>I watched the first one today with a friend and it also was really good.","user":"bloodworia","rank":[2,2]},{"title":"A long married couple in a fresh hurdle.","rating":7,"date":"14 May 2017","review":"I thought it would be purely a Japanese style comedy, and it was, but also capable to reach out the world audience. Except the Japanese cultural influence, the story and its characters, how it all were designed can be compared to the films from the rest of the world with a similar theme. If you are a film fanatic or even common people are very familiar with this kind of storyline. So when a film talks about the family issues, some of the clichés, especially basic ones are unavoidable. But this is first such film from Japan for me, so I enjoyed every bit of it rather getting disturbed by any deja vu moments.<br><br>The advantages were the film characters and the cast. Everybody was so good, particularly the veteran actor in the lead. I might be wrong, but it does not look like a B film from Japan. If you research about its popularity online which is less known, but received much better. This film was released last summer and I'm definitely a bit late, but on the right path as its sequel is going to hit the screens in a couple of weeks from now. Since I liked this, I am expecting the next part as well.<br><br>It's about one big family. When a young couple just got into a fight and talking about divorce, they are going to receive an even bigger surprise when their parents announce their separation after 50 years of marriage. Now everybody from the family turn their focus on them. Some would try to fix it and some are concerned about what's behind it. But seems nothing is getting better. So all these years living together in happy and sad stages of life, now how the family is going to cooperate is prioritised in the remaining parts.<br><br>❝Words don't matter. Feelings do.❞<br><br>I don't know what the different between this and 'Tokyo Family'. From the cast and crew to the storyline seems alike, except one is a comedy and the other's a drama. The only way to clarify that, I've to watch that film. By the way this is one of the best family films of the year. It stays up to the expectation of its title name. But not entirely a fun film. Preference for comedy was given only in the initial parts. At some stage it turns into a meaningful one with better dialogues.<br><br>It might be an under-noticed film, but surely worth checking it out. The end might be too predictable, even though a very fitting solution. I did not mind that, but for some people, that would be a turning point on rating the film. I hope they won't take it very serious, rather to analyse what the film accomplish and according to respect it.<br><br>How the issue concerns the whole family and from their individual perspective, there are some narrations. But it does not go much deeper than that to explain thoroughly which never required. The overall focus always stayed with the main couple and their daily activities. To reveal how far they have come from without noticing how their relationship shaped all these years.<br><br>It was awesomely written screenplay, particularly at reusing the essential details to give a better new look. Almost all parts of the film maintained with the same level of rhythm, except the mood that transforms towards stretching the conclusion. It is almost a must see, but I stick with a simple recommendation for those who love drama over a comedy.<br><br>7/10","user":"Reno-Rangan","rank":[2,2]}]