[{"title":"A cruel punishment","rating":8,"date":"24 November 2019","review":"Two hours is a hell of a long time to sit through what is essentially, quite possibly one of the most disturbing movies of all time.<br><br>What sets this film apart from the disturbing movies labeled under \"horror\", is that the excessive violence (sexual, racial, gender-based, vengeful and genocidal) pretty much all throughout this film is based on real life - The Black War in 1820s Van Dieman's Land, now known as Tasmania.<br><br>Clare and Billy, the two protagonists are hated minorities in this land (An Irish female convict and a black man) who seek vengeance for the terrible crimes committed against their families and themselves. The film begs the question - how does empathy survive in such a brutal world? How do you move on after you've lost so much? And finally, does vengeance bring satisfaction?<br><br>The answers are No to the last two and Yes to the first one.<br><br>I don't know if I can recommend this. It felt like the director was subjecting her audience to a horrific punishment with this. It essentially left me traumatised. Even in the moments when a character says a funny line, it's always followed with a horrific act of violence straight afterwards.<br><br>Other than that, the acting, especially Aisling Franciosi and Baykali Ganambar, are extraordinary. I believed every second of their performances. The way it's shot, the landscape and the cinematography, is gorgeous.<br><br>Watching this was a hell of a challenge. But I'm glad I got through it.","user":"Avwillfan89","rank":[35,39]},{"title":"Vengeance is thy name","rating":8,"date":"2 August 2019","review":"Greetings again from the darkness. With only her second feature film, Jennifer Kent (THE BABADOOK) has created a near cinematic masterpiece. The only thing holding it back is the historical subject matter and the no-holds-barred approach that will surely limit its audience. From an emotional aspect, the film is extraordinarily uncomfortable and disturbing to watch; however, from a filmmaking perspective, it's a thing of beauty. The two sides of my brain were at war the entire time.<br><br>Set in 1825 Tasmania, the opening scenes are ominous and cloaked in dread - even though nothing has happened (yet). We just feel it in our bones ... things are about to go wrong. And oh my, do they ever go wrong. Now you are likely similar to me in that your knowledge of 1825 Tasmanian history is quite limited. This was the era of \"The Black War\". The British were in the midst of colonizing the country. Violence was prevalent towards women, native Aboriginals, and even the land and existing culture.<br><br>Clare (Aisling Franciosi, \"The Fall\") is a young Irish woman, recently married with a newborn. She has served her 7 year sentence for theft (likely food for survival) and is now an improperly indentured servant to the ambitious and quietly despicable Lieutenant Hawkins (Sam Claflin, THE HUNGER GAMES). Clare is headstrong, but wise enough to understand her place. Her husband Aidan (Michael Sheasby, HACKSAW RIDGE) lacks the same judgement and his foolish attempts to deal directly with Hawkins results in the atrocity that leads to the core of the story.<br><br>When her pleas for justice fall on the deaf ears of the British military, Clare's need for vengeance transforms her into a woman-obsessed. Due to the harsh elements of the Tasmanian forest, Clare reluctantly agrees to hire an equally reluctant Aboriginal tracker/guide. Billy (Baykali Ganambarr) takes the job, and the two have little respect for each other as the trek begins. As a female Irish convict, Clare was treated poorly by the British, yet she somehow views herself as superior to Billy. On the other hand, Billy lumps all white people into the category of those to hate and distrust. This pair make quite a statement on racism, classism and pre-judging others. Of course, as their journey continues, their similar backgrounds and commonalities are revealed, bringing these two broken people closer together and building mutual respect.<br><br>This is a part of history that Australia understandably doesn't work to keep in the forefront. But the atrocities were very real and Ms. Kent's film never shies away from the gut-punch of a moment. And though it takes place during this dark period with numerous appalling characters, the core element to the Clare's story is determining the consequences and price of seeking vengeance. How does one hold on to compassion and humanity while trapped in an environment that is barely survivable? Does violence truly beget violence? Is there another way? One of the most striking elements of the story is the contrast of mindless slaughter against the intimacy of vengeance. The British soldiers seem to pay little mind to their victims, while Clare is an emotional wreck when violence is required. It's quite a thought-provoking debate.<br><br>This is the first leading role for Aisling Franciosi and she is a marvel. Clare is quite a complex character and Ms. Franciosi is remarkable ... as is her singing voice. Also impressive is the performance of Baykali Ganambarr as Billy. Known as a stage performer, this is Mr. Ganambarr's first film role and he is terrific and believable as a young man looking to move on from a life that hasn't been kind or fair. Other key supporting roles include Damon Herriman (\"Justified\") as Hawkins' right hand man, and Charlie Shotwell (CAPTAIN FANTASTIC) as young Eddie. All performances are strong, and filmmaker Kent was obviously attuned to presenting the authenticity of the period, even down to the spoken language. The costumes never look like something out of a Hollywood warehouse and cinematographer Radek Ladczuk captures the harshness of the land and brutality of the people. It's a gripping tale focused on the reaction to the deepest of personal loss. The reward is there for those brave enough to give it a watch.","user":"ferguson-6","rank":[130,167]},{"title":"A tough but powerful and rewarding watch","rating":8,"date":"2 June 2019","review":"We were introduced to the film by one of the lead actors who advised us to \"strap ourselves in\", which I think was good advice. It does depict some horrific things done by humans to other humans, and a few people walked out of the screening in the first 10 minutes because by far the worst scenes are at the start.<br><br>But I recommend sticking with it as it's really about showing glimpses of humanity underneath murderous hatred in an extremely hostile environment. It is not simply a gleeful revenge thriller, despite the often cartoonish evil of the British soldiers and the Tarantino-esque levels of violence. When the revenge does come, it feels like a drop in the ocean of cruelty that surrounds it - by which I mean the everyday treatment of the aboriginal people by the white settlers and of women as property. The larger themes come through with crushing strength.<br><br>There isn't much in the way of humour or lightness here, but it manages to be a compelling and rewarding experience even if it feels a bit exhausting. You can tell it was a tough shoot - it's mostly set in the muddy, wet Australian bush - but like the actors I came out feeling it was worth it in the end.","user":"carrythe2","rank":[87,121]}]