[{"title":"Worst British Gangster Movie.... EVER","rating":1,"date":"7 February 2016","review":"Can't believe I've just wasted 1hr 36mins of my life watching this! No real/credible plot, awful acting... Never really liked Steven Berkoff and now I know why! Best thing about the film is the lovely Freema Agyeman IMO. <br><br>The plot is based on two lovers from opposing sides wanting to escape the world they live in... However, you'd never have guessed if you hadn't read the plot summary! <br><br>Don't waste your time on this and wondering... \"Surley it can't be that bad\".... Well yes ladies and gentlemen \"It is\" and if I could score this as a minus I would!","user":"craig914","rank":[5,5]},{"title":"Does the world need another British gangster flick?","rating":5,"date":"16 July 2015","review":"If anyone is considering going to see British gangster flick 'North v South' in the hope that Elliott Tittensor will do a nude scene like he used to back in the good old 'Shameless' days, let me save you some money: he doesn't (although there are a couple of compensatory shirtless scenes). Having cleared that up, is the film worth seeing anyway? Well, fans of the genre will probably like it: it has lots of guns, oodles of mindless violence, a dangerous woman, a transsexual assassin, copious amounts of swearing and people who have been shot or burned with a flame-thrower recovering for a final bit of gunplay. To be fair, though, there are a couple of surprises: a little girl as a trainee assassin, and not one single scene set in a sleazy strip club.<br><br>Attempts by southern gangsters (led by Steven Berkoff and Keith Allen) and their northern rivals (Bernard Hill and Oliver Cotton) to reach a truce are derailed when a southern lieutenant slits the throat of Hill's best friend. The predictable gang war ensues, complicated by a Romeo and Juliet-style problem: northern lieutenant Terry (Tittensor) and Berkoff's insipid daughter Willow (Charlotte Hope) are secretly in love.<br><br>Berkoff is in full psycho scenery-chewing mode, while Hill delivers a more measured performance as far as the script allows. Tittensor doesn't do badly, but Hope is less impressive - although, given she has to burble lines like \"Terry was my god\" and \"I'm nothing without you\" that's hardly surprising. 'Doctor Who' fans will not be disappointed by Freema Agyeman as the tough-but-sexy female gangster.","user":"euroGary","rank":[19,26]},{"title":"Not the worst straight to DVD British gangster flick","rating":4,"date":"10 January 2016","review":"I normally avoid these straight to DVD British gangster movies because they are generally crap. This one took my eye because it had a half decent cast with actors such as Bernard Hill , Steven Berkoff and Keith Allen and while this isn't as bad as most of the usual rubbish , even these actors , despite giving solid performances , can't make this a film that I can really recommend. The story is about two rival gangs from either ends of the country who are tying to and a feud but behind the scenes there is a romance that will never be tolerated , especially when one gang member is hell bent on destruction. I enjoyed the first half hour , especially the performance of Brad Moore but the film soon falls apart when the story seems to go pear shaped and in the end I didn't really care what happened to anyone","user":"valleyjohn","rank":[3,3]}]