[{"title":"sickly sentimental story","rating":4,"date":"17 October 2017","review":"Paris is always one of the cities that I dream to be live, Paris is a word of romantic and fashion. Unfortunately, two French movies I watched recently, 'The Model' and 'L'amant double', both are pretty sick for me. I think I am probably 'not acclimated' to Paris culture because both movies showed me nothing besides sex and lies.<br><br>The main character from The Model, Emma is a coquette. In my hometown words, we classify these kinds of women and named them 'Green Tea be-tri' - the one who is fresh as green tea that good at acting naive and innocent, but an emotional manipulator. <br><br>What is the movie about:<br><br>Emma came to Paris for her modeling career, she screwed up her first job and reclaimed the job by seduced the photographer. She lied to the photographer that she doesn't have a boyfriend, in fact she usually has one back in town. Up to that point, I wasn't surprised or mad if Emma just simply fall in love with another guy. The photographer is handsome, and famous that will be helpful to her career. Besides, long distance relationship is difficult, especially living in a foreign country, people have to face everything new, and cannot be comforted when they need it. What goes wrong after was Emma played between men, she cheated to different men.<br><br>I couldn't imagine how this plot could be wrote in such unexpected stupid and dramatic. Soon after, the girl not just played with 2 men, she played with 3! After Emma was found to have an affair with the third person, the photographer ended their relationship. Then Emma pretended to be pregnant to get him back, but soon was caught, and betrayed by her roommate. The ending is even more dramatic soapy, spoilers can be included in few words with rape, knife and police, and I have no more interested to recall them in details because I am speechless and sick already. <br><br>My option/Why I don't like<br><br>The movie exaggerated this chaotic relationship and the temptation, Yet lack of reality, and ignore those genuine hard workers. I can never be a fan of this kind of sickly sentimental story, too fake and negative. It also demonized the model industry.","user":"ElliesWonder","rank":[10,11]},{"title":"I've seen worse, but I've seen plenty better","rating":6,"date":"23 June 2016","review":"'The Model' opens with shots of city streets - but what city? It's not New York - no gleaming skyscrapers - and those narrow, hilly streets belong to neither London nor Copenhagen (this is a Danish film). Actually, it is Paris - director Mads Matthiesen fooling the viewer by ignoring the film convention that every establishing shot of the French capital must feature the Eiffel Tower. The story follows Emma, a painfully slim young Dane, who arrives in the city ready to begin her career as a fashion model. Her supporting cast are quickly established - Zofia, a prickly fellow model who becomes her friend; and a fatherly landlord. Her first shoot, with temperamental British photographer Shane, does not go well, but one dance at a nightclub later and Emma is not only Shane's favourite model but is also tumbling into bed with him. Soon she is swept up in an exciting lifestyle of glamorous fashion shoots, girly confidences with Zofia and parties where dishes of cocaine are presented as interesting table decorations.<br><br>To be frank, the film is not a success. The storyline is very soapy, but the pacing is slow in far too many places. This is partly because central character Emma, as played by Maria Palm (a real-life model), is rather glum and lifeless, wafting about the screen like a floaty curtain (but Palm deserves credit for acting not just in her native Danish, but also in English and French). The viewer's feeling that he's watching a soap opera is reinforced by Ed Skrein as Shane, whose husky voice and showy mannerisms are straight out of 'Hollyoaks'. The story does not share with the viewer the legal ramifications for Emma of the climactic scene (you'll know when you've reached it) and there's a very noticeable continuity error when, during a conversation between Emma and Shane, the camera focuses on the back of the latter's neck - in one shot the label of his T-shirt is sticking up, in the next it's no longer visible - a minor thing, admittedly, but one I found distracting. All of which means I'm marking this film 'must try harder'.","user":"euroGary","rank":[19,25]},{"title":"What in the world...","rating":5,"date":"9 April 2017","review":"Geeze this movie had a lot of potential. I know it was an over dramatization of a real situation, but i feel like this movie could have delivered so much more. There are parts of the movie that are really strong, and you become intrigued and you feel very invested in the movie, but it falls flat almost immediately. The ending somewhat saved it, but you don't necessarily feel her loss, you just feel somewhat benign. I would love to see a remake of this movie, but with a better screenplay. I loved the lead male photographer and female model. you also see full front of a very hairy dude. Hes hot but not well groomed. thats not a spoiler. its just a fact.","user":"chrislesmckis","rank":[8,9]}]