[{"title":"Ten Entertaining Tales of Halloween","rating":6,"date":"19 November 2016","review":"Divided in ten segments by ten different directors, \"Tales of Halloween\" is an entertaining horror–comedy film in the style of \"Tales from the Crypt\" with the theme of Halloween. <br><br>1st) \"Sweet Tooth\": A boy collects candies in the Halloween, and his babysitter and her boyfriend tells the legend of an evil being that has sweet tooth and kills those who do not share candies with him. They eat the boy's candies and discover the truth about the legend. This tale is funny and gore. My vote is six.<br><br>2nd) \"The Night Billy Raised Hell\": a boy dressed like a devil is forced by his sister and her boyfriend to throw an egg at the house of a secluded man. However the man is the devil and he teaches how to create havoc in the Halloween night. This tale is also funny because of the devil's tricks and has a surprising end. My vote is seven.<br><br>3rd) \"Trick\": a group of drugged and drunken friends are attacked by kids that ring the bell and break in their house. Why are they under attack? This gory tale has an intriguing screenplay with a surprising end. My vote is six.<br><br>4th) \"The Weak and the Wicked\": a gang led by a teenage girl bullies a teenager and he summons a demon. The three bullies hunt him down and he run to the place where his house and his parents had been burned to ashes by the gang. This dark tale of revenge is too short and could be a little longer, but with a surprising end. My vote is five.<br><br>5th) \"Grim Grinning Ghost\": a young woman goes to a Halloween party at her mother's home that tells a story of a fiend. When she goes home, her car breaks and she has to walk home. She startles with footsteps and a laugh behind her on the street. Could it be the evil spirit? This tale has a creepy atmosphere and a scary conclusion. My vote is six.<br><br>6th) \"This Means War\": a man discovers that his wife is a witch that likes to eat children. This tale is silly and one of the weakest of this anthology. My vote is five.<br><br>7th) \"This Means War\": a man is proud of his Halloween decoration that attracts many viewers. However his new neighbor with his friends dispute with him the best decoration and they begin a war. This tale is a tragic comedy with a stupid situation. My vote is five.<br><br>8th) \"Friday the 31st\": a disfigured serial-killer confronts an alien that possesses the body of one of his victims. This silly tale is a parody of Friday the 13th but the fight between Jason and the alien does not work well. My vote is five.<br><br>9th) \"The Ransom of Rusty Rex\": two thieves abduct the son of a wealthy man o ask for ransom. However the man refuses to pay and the men have a surprise. This tale is certainly the best one with a great twist. My vote is eight.<br><br>10th) \"Bad Seed\": a man carves a pumpkin that eats him. A skeptic detective has to hunt down the pumpkin and finds where it was produced. This tale is also great with a trash story. My vote is eight.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[24,30]},{"title":"Like a standard Halloween candy haul.","rating":6,"date":"16 October 2015","review":"Tales of Halloween perfectly emulates a trick-or-treater's haul in their Halloween candy bag. There are a few pieces of chocolate and candy which you want to scarf down right away, more which you eat hesitantly when you run out of the better stuff, and some which you flat out throw into the trash. The quality of the assortment of shorts follows that general pattern. <br><br>On the delicious side, I enjoyed the opening short (Sweet Tooth), because it presented a funny and entertaining Halloween legend, with some pretty excellent gore. It was funny and over the top but it still remembered to throw some actual horror in there (like a very effective jump scare that pays homage to Exorcist III). Another good one is Lucky Mckee's entry \"Ding Dong\", which stars the most active current horror queen (Pollyanna Mcintosh) who does a fantastic, hilarious job acting out her insane character. It is over the top and ridiculous while exposing sad, deep-rooted feelings. <br><br>In the middle of the pack (the hard candy and stale gumballs) are most of the entries. There are some that are almost successful - The Night Billy Raised Hell was hilarious but mostly due to the amazing performance of the devil neighbor, he was great; Trick had a very fun concept which was unpredictable compared to the rest of the film, but very poor execution (rushed, convoluted, self- inconsistent, and poorly acted); Grimm Grinning Ghost had exceptional acting with some familiar horror faces (the girl from Starry Eyes, the psychic from Insidious) but it felt like a creepypasta come to life (had shades of The Smiling Man) and existed mostly for the purpose of a very effective jump scare at its culmination. There are others in the middle of the pack which aren't even close to successful but are not unwatchable either - The Ransom of Rusty Rex is \"cute\" at best and very generic (I saw an identical short film just a year ago); Bad Seed has two or three funny lines but is a MAJOR letdown from a director like Neil Marshall (a CSI parody where the killer is a pumpkin, which would make a good low budget you-tube or Key &amp; Peele sketch but feels unfit for a feature and for the running time it got). <br><br>Then there are the dental floss, apples, and raisins of the pack. To me personally they had no redeeming value and I did not enjoy any part of them, from acting to script to visuals. The Weak and the Wicked is an emotionally uninvolving tale with poor storytelling and severely miscast actors (the \"street thugs\" looked like Hot Topic employees). Friday the 31st, about a Jason-like killer having the tables turn on him, is the kind of cheesy one-joke short that someone new to After Effects would make as practice. And finally, the worst of the bunch, the razorblade inside a piece of candy, is \"This Means War\", about two neighbors competing over their Halloween decorations. Both the concept and execution were amateurish and I don't know how it wasn't axed at any point. <br><br>Tales of Halloween is not a great film but at least it is temporarily entertaining while it lasts (most of it anyway) and is much, much better than other recent attempts at anthology films (ABCs of Death 1/2, V/H/S 1/2/3, etc). I don't think it is worth seeing in theaters but I can see it being fun as a Halloween night movie with friends and beers (for those who are bored of the better holiday offerings, like Trick'r'Treat).","user":"horrorinpureform","rank":[32,43]},{"title":"Ten very different stories, told with a wide-ranging degree of success, but never boring: that's Tales of Halloween.","rating":7,"date":"18 October 2015","review":"It's nearly that time of year again, so what better way to pass the time than to settle down with Tales of Halloween, a seasonal anthology from ten of today's hottest horror directors that features cameos from some of the genre's giants.<br><br>As is often the case with anthologies (especially one with so many stories, like this), it's a very mixed bag—some parts work very well, other's are less effective—but for my money, this is still more fun than that other Halloween anthology of late, Trick 'r Treat, which I found frustratingly mediocre all the way through.<br><br>'80s scream Queen Adrienne Barbeau introduces the tales, starting with 'Sweet Tooth', by director Dave Parker (The Hills Run Red). An enjoyable way to kick things off, this sets the tone perfectly with a Halloween legend coming true for a young trick or treater with gory results. This is followed by 'The Night Billy Raised Hell', from Darren Lynn Bousman (Repo: The Genetic Opera), who introduces a bit of dark comedy into the mix with his amusing story of a boy who meets a demon (Barry Bostwick) that shows him the secrets of extreme pranking.<br><br>Segments 3 and 4—Adam Gierasch 's 'Trick' and Paul Solet's 'The Weak and the Wicked' are passable fare, revolving around vengeful killer kids and the summoning of a demon; Axelle Carolyn's 'Grimm Grinning Ghost' starts off promisingly, but winds up being little more than a weak attempt at providing a cheap jump scare (which I fully expected). Lucky McKee's 'Ding Dong', is without doubt the weirdest of the ten tales (and my least favourite), featuring a childless woman who turns into a witch when emotional.<br><br>'This Means War' from Andrew Kasch is kinda forgettable, although at least there's fun to be had from trying to spot numerous cameos, but things get much better with the next story 'Friday the 31st' (by Mike Mendez), which is totally bonkers and extremely gory: a deformed killer gets a taste of his own medicine after a tiny trick or treating alien possesses the body of sexy victim Dorothy, who returns from the dead to turn the tables on her attacker. The plot might not make much sense, but this one is so gleefully insane and incredibly bloody that I couldn't help but love it.<br><br>'The Ransom of Rusty Rex' is also very enjoyable: directed by Ryan Schifrin (son of movie composer Lalo, who provides the score for Tales of Halloween), it follows a pair of unfortunate kidnappers whose victim turns out to be a hideous little demon whose 'father' is only too happy to be rid of. This is followed by Bad Seed, from Neil Marshall (The Descent), which features a fun premise—a man-eating pumpkin on the rampage—but sadly ends proceedings on a rather weak note.<br><br>6.5/10, happily rounded up to 7 for that adorable Halloween-lovin' extraterrestrial.","user":"BA_Harrison","rank":[34,51]}]