[{"title":"I know what you ate last Xmas.....","rating":7,"date":"21 August 2018","review":"Yes it had to happen. The Xmas ham has finally returned for revenge, Aussie style. \nThis is an utterly ridiculous horror film about the prince of porkers who has a voracious appetite for outback Australians and the occasional American.<br><br> I know the premise sounds awful on paper but its executed with such tongue in cheek good humour with an overstated ribald, ocker vibe, that it actually works.If you have lived in Australia as I have you will know this is overdone in a big way. The \"boar-ish\" humour is a yard wide and ten feet deep but it plays well in the general context of this film. <br><br>As a horror film there is the predictable blood and gore factor but its not gratuitous or sadistic and this film plays better for it. Its more a little on the silly side as are the giant pig special effects. <br><br>If you want to have a good laugh with your mates over a few beers and chips or maybe some pork rinds, this is one to watch. 7/10 from me.","user":"s3276169","rank":[24,29]},{"title":"If you liked JAWS, watch it again instead of this","rating":3,"date":"17 August 2018","review":"Watched Boar because of the reviews and don't know where the high ratings came from. I wanted every character to be killed because they were all so freakin' annoying! Dialogue was vulgar and uninteresting, special effects mediocre at best. If you can watch it for free you'll get you money's worth, any more than that and you overpaid.","user":"jg-62457","rank":[36,52]},{"title":"Boar...ing","rating":1,"date":"16 August 2018","review":"A truly abysmal creature feature where nothing of interest really happens with special effects Blue Peter would be ashamed of.<br><br>How this boar gets around without someone noticing is amusing to say the least. It's actually a Boar-ninja as it just appears out of nowhere and kills people then disappears into the bush. \nIt also has the ability to grow in size for close ups and then return to normal for longer shots. <br><br>The acting is terrible and the story nonsensical. \nThe characters are so dull I was rooting for the Ninja Boar.\nIt seemed to be veering towards comedy as it certainly was not horror or even a thriller.<br><br>Two points I will make about how stupid this film is.\nSPOILERS.....<br><br>1 At no point does anyone use their mobile phones to get help. In a day and age where people can't be separated from mobiles for more than 60 seconds even kids seem to forget they have them when faced with a very unrealistic large pig with blood and gore on its snout.<br><br>2 Big spoiler here so be warned.\nAfter having his guts torn out Bernie....don't call him Bern... is able to recover for the final scene and act as if it was just a scratch.<br><br>Laughableless rubbish. <br><br>The most horrific thing about this pile of sewage is there may be Boar 2.","user":"doorsscorpywag","rank":[34,51]}]