[{"title":"Interesting movie but too much deviation from the original story","rating":6,"date":"14 April 2015","review":"I am a long time fan of this book series and of V.C. Andrews. I have read and re-read the books dozens of times so needless to say, I know the Dollenganger/Foxworth story quite well. <br><br>I watched this movie on Lifetime last night and while I enjoyed it for the most part, I did not enjoy the massive deviation from the original book story. <br><br>For starters, anyone who has read these books knows that Foxworth Hall is the king of homes, the biggest and most elaborate structure in all of Virginia. In the beginning of the film, when Chris and Cathy pull up to Foxworth Hall, Cathy remarks how Bart had built an exact replica as the original. The home they use for the film seriously lacks the majesty that is Foxworth Hall. In fact, it looks no different than your average home in an upscale neighborhood, hardly befitting someone like Malcolm Foxworth. The Foxworth Hall from the books was imposing and frightening, standing alone on a high hill like a king over his subjects. <br><br>One big problem I had with this movie was the complete omission of Joel Foxworth, Corrine's long-though dead brother. As those of you who have read the books know, Joel was a main character in Seeds of Yesterday and was also a significantly bad influence over Bart. I suppose if the filmmakers did not intend to make \"Garden of Shadows\" into a movie, I can understand the omission of Joel but it took a lot away from the story. <br><br>The characters of Chris and Cathy lacked any real passion or intensity. In the books, Cathy was stronger, more fiery and more of a fighter. The Cathy in this movie was a passive pushover. Cathy and Chris' relationship is always defined as intense and very sexual. That did not come across in this movie at all. <br><br>Bart and his adopted sister Cindy having sex and then later getting married? Definitely not from the book. Jory Marquet is descended from the Russian Ballet and was always described in the books as having jet black hair and blue eyes, very intense. The Jory from the movie did not fit the book character at all. Jory was much more fiery and passionate, in the movie, he was turned into a pathetic character who didn't stand up for himself at all. <br><br>All in all, this was a good movie but I believe the books are always better than the films. This was no exception to that rule. I would recommend seeing the movie but I would also recommend reading the books first so that you have a more accurate understanding of the characters. The \"Flowers in the Attic\" series is best understood if you read from beginning to end. Otherwise, it won't make any sense to you.","user":"jnrh","rank":[7,8]},{"title":"'Seeds' concludes a whirlwind of a series in dramatic fashion","rating":8,"date":"8 June 2015","review":"And here we have finally arrived. The last installment in the Dollanganger series, which is hopefully never going to continue. We began with Flowers in the Attic, a isolated story that was fairly interesting, and then Petals on the Wind, which was underwhelming at best, and then If There Be Thorns which was a suspenseful thriller that I thought was the best so far. Now, we've come to the finale. The only thing I know for certain is that James Maslow is in this one, and I enjoy him as an actor and he's a sexy beast, I mean, delightful human being. Let us dive right into the deep END... this is...<br><br>...Seeds of Yesterday. Seeds of Yesterday starts off thirteen years after If There Be Thorns, with Bart inviting the family to the newly built reproduction of Foxworth Hall for his twenty-fifth birthday bash, and all of them bringing news and their own problems that start to weigh heavily on Bart's mind.<br><br>This is a very worthy sequel to If There Be Thorns. Let's talk about the positives, because there is a lot of them. The character of Bart is probably the most interesting character, in not just this film or the previous one, but in the entire series. James Maslow gives an amazing performance in this film. I wouldn't expect it from the guy who began on a show like Big Time Rush, but he honestly brings a sense of darkness to the character that just works so well. Definitely the best actor in the film, just as Mason Cook was last time.<br><br>The cinematography and music are all wonderful. What's the point of even mentioning it in these films anymore? They all look very atmospheric and make any room seem either warm or cold, depending on what the situation is.<br><br>All of the other actors do well, even some of the newer ones who have been recast again (I think this is the only time Chris and Cathy haven't been recast in a film!). Some of the highlights, in my eyes, include Sammi Hanratty as a grown-up Cindy Sheffield, Anthony Konechy and Leah Gibson as Jory and Melodie Marquet, and they all do a great job. All of them are forced to do some pretty despicable things in the film, or experience those things, so having actors who can properly convey that, is very important.<br><br>The plot is pretty good. Towards the end, it does go a bit crazy and Bart seems to be going off the deep end, but what I previously thought might have been possession could have also been delusion. The way this film ends, it's kind of reminiscent of how the first one begins. It begins, and ends, in the attic of a Foxworth Hall. I don't know if that was in the book, but that is a very strange way to end the film.<br><br>Perhaps my only issue is that I still can't believe that there's another incestuous relationship in this film, and the fact that for how much Bart preaches about sex being a sin, he really has a lot of it in the film. I counted like four or five times he had a sex scene in the film. The incestuous relationship kind of comes out of nowhere. I won't spoil it, in case you have an interest in watching the film, but still.<br><br>Overall, Seeds of Yesterday is on the same level as If There Be Thorns, better than the first two and a very intriguing story. I personally enjoyed the acting, especially from James Maslow, the cinematography, music, and script. The only things I disliked were some of the plot elements and the ending, but it's still a great conclusion to this roller-coaster ride of a series.<br><br>8/10. Grade: B+ (Film Grade) 7/10. Grade: B (Series Grade)","user":"arussell23","rank":[14,22]},{"title":"Oh no, MORE cringe-worthy incestuous melodrama?","rating":3,"date":"11 June 2016","review":"I won't deny that this modern version of V.C. Andrews' 4th book in the Dollanganger series has a lot of cinematic style, highlighting the dark and ugly secrets of the rich and strange in a haunting and often surreal way. But Seeds of Yesterday just came across as lame and overdramatic. The acting was horrible for the most part, and the character of Cindy especially really got on my nerves. She's this wealthy, worldly dancer, almost an adult, so it makes sense for her to just blurt out \"d!ckhead\" at her brother like a five-year-old? The perverse sex scenes between siblings Cathy and Christopher were just shudder-inducing, disgusting and frankly silly. The film takes place in an earlier point in time, yet every character talks just like a 21st century hipster. All of them act like children. The constant lines such as Bart's \"your wife can't stay off my junk\" and the pretentious speech style of the immature and dysfunctional family seemed out of place and a little stupid.<br><br>I honestly think that this film series has been stretched out much longer than it needed to be, and that it's just a cash cow for a company already known for making identical films about shallow cookie-cutter families. I never would've thought that Lifetime would be the company to revive this twisted series, and instead of focusing on giving the story some depth, they just kept on piling up the shock value of the incest, sexual phrases and violent theatrics. I just kept laughing the whole way through, because it's impossible to take Seeds of Yesterday seriously.","user":"TheBlueHairedLawyer","rank":[9,13]}]