[{"title":"Of the better ones!","rating":5,"date":"15 October 2015","review":"The Breed, Burning Bright and now The Pact! The list is growing, movies where people are trapped inside the house with the enemy surrounding the place and finding its way in, are plenty, but how many out there, are good?<br><br>I never cared much for The Grey, I am a huge Liam Neeson fan, but still, that one was way unrealistic, probably even for a sci-fi film. So, as horror has it lately, bring on the indies, the low budget projects, the little gems, movies that manage to take you by surprise and offer a good 80-90 minutes worth of thrill and suspense. Now don't get me wrong, The Pack is no masterpiece and it does have its holes, but still, it was a pleasure watching it.<br><br>No real explanation will be offered, typical, I know, and this one builds very little to itself as it jumps straight to action. I think they worked OK as a family, the dialogue was decent, the acting good, effects simple tho hitting the spot and a good execution to a quite used plot. More to say about it?<br><br>It is shorter than most, just 80 minutes here of watch, doesn't bring any new elements to the story, doesn't act dumb either, so all in all, I graded it a 4. It was better than most, not a bad movie, just a decent watch!<br><br>Cheers!","user":"gothic-fiction","rank":[27,44]},{"title":"Not as silly as expected","rating":5,"date":"15 October 2015","review":"My quick rating - 5,1/10. Was much better then expected by reading the summary. Basically a family on the brink of losing their house in the middle of the outback is suddenly under siege by a \"pack\" of attack dogs. Yes, it does sound somewhat stupid by that but taking a simplistic idea and doing something with it (without cheating and using a 200 million dollar budget) is something to be said. The acting is good and seems very matter of fact. The characters just had believable qualities that helped the story along. The pace was done well and of course turns into high gear when the animals go into full attack mode. Speaking of, the effects were fine and not overdone are bad cgi laden. Overall not a bad unknown little flick that has a couple decent scares.","user":"jackmeat","rank":[15,23]},{"title":"A good one","rating":7,"date":"23 November 2018","review":"I have watched this movie several times now. I myself watched the film with a very open mind with and expectation that it would be boring with terrible special effects. I myself live where wild dogs are a common problem on our properties. I was actually surprised with this movie. It was very much the effects that the wild dogs have on live stock and pets around the area . Yes, this movie was over the top in certain areas, with dogs breaking windows to get inside etc. But overall I found this to be a well done movie from what I was expecting, entertaining and at times suspenseful which I was surprised with. One if the better movies with animals that attack of late.","user":"sammynjyi","rank":[2,2]}]