[{"title":"first 5 mins are impressive then it nose dives into bad","rating":4,"date":"29 June 2019","review":"The first 5 mins is clever and cute, visually impressive and inventive, the world from inside an egg, and then it just falls into bog standard badly written tropes about fitting in and finding yourself, crowbarring in problems (don't flap your wings, you should be able to swim even though your feet are claws etc etc) to make a story that isn't really there.\nThe animation was pretty good, especially the light and background scenery, but the over long race scene outstays it's welcome as the animation team run you through every trick they can think of till it became annoying.\nThe A list voice cast failed to engage. I could see what they were going for but they phoned it in, and really the characters on paper weren't that interesting so they didn't have much to work with.","user":"Rob-O-Cop","rank":[8,16]},{"title":"Charming family flick 7/10","rating":7,"date":"24 October 2019","review":"A lovely little film, had some joyful emotion moments that gave me a fuzzy feeling inside! Loveable characters and good story, CGI was beautiful, slightly let down by inconsistencies, for example the start of the film in the day time the feathers of the gulls looked a little plastic and environments a little empty and yet towards the second half of the film suddenly improves to an amazing standard! Regardless of minor faults I really enjoyed the film and I only watched it to keep my girlfriend happy! Was pleasantly surprised when I ended up enjoying it so much! Defo worth a watch, it's nice to have a lighthearted family film with some deep moments once in a while! Check it out!! 9/10","user":"gabrielmoon777","rank":[4,7]},{"title":"Good enough for the kids","rating":5,"date":"23 November 2019","review":"Stunning animation and beautiful artwork but a good story concept that suffered poor a script. The pace was all wrong, the dialogue was terrible and the characters had shaky development, and even the voice acting was surprisingly weak.<br><br>But a proven concept of skill and talent in art and animation for Haas and Block.","user":"demonweare","rank":[2,3]}]