[{"title":"Building A Worker's Paradise gone horribly wrong","rating":8,"date":"29 November 2017","review":"Ikitie (The Eternal Road) is a morbid film of a man's attempts to get back home, set against the backdrop of the untold story about 10,000 people who voluntarily moved from North America to the Soviet Union to build a worker's paradise, but who eventually learned the true face of Stalin's U.S.S.R.<br><br>It is 1931, and the Great Depression is on. Jussi Ketola has recently moved back to Finland from the United States with his family. He has bought a farm, and tends pretty much to himself. All is good and well until right wing extremists, who claim Jussi to be a communist, decide to practice their favourite pastime, namely kidnapping Jussi, driving him a few hundred kilometers to the Soviet border zone, then shooting him (though it might sound odd, these things actually happened in Finland during that tumultuous time). Except that they botch the shooting part and Jussi, heavily wounded, barely escapes across the border to the U.S.S.R.<br><br>When Jussi wakes up in a hospital in the Soviet Union, he is greeted by a Finnish police working for the Soviets who, instead of letting Jussi go home, summarily accuse him of being a spy. Unable to escape, Jussi is sent out to a collective farm. This kolkhoz has been built by Americans and Canadians, but mostly by Finnish immigrants who had first moved to North America, but then moved to the U.S.S.R. Their common goal is to build A Worker's Paradise. Jussi's task, on the other hand, is to inform on any suspicious activity. And it is here where the story really begins.<br><br>Ikitie tells its disturbing story at a laid-back pace. It is not boring by any means, but the scenes, particularly during the first half of the film, are given plenty time to breath. The same goes for the actors. They have both the space and time to act with nuances. Helped by this, acting flows naturally. People speak their native or common languages (Finnish, English, Russian) with appropriate dialects. Cinematography is lovely, particularly when playing with darkness of the night without crushing everything to black. Colours are perhaps ever-so-slightly muted but still realistic, and - thankfully - there are no teal-and-orange scenes to be seen.<br><br>As time goes by in the film, tension slowly but surely rises, right until the dramatic ending. Adding to the tension and pain is the knowledge that things that we see in Ikitie actually did take place on a large scale in Stalin's U.S.S.R. during the purges of the 1930's.<br><br>What can I say? I saw Ikitie today at our local theater with my mother and son, and it left us discussing for hours, about local and international history, the Great Depression, the Finnish right-wing extremist movement, Stalin's purges, all of it. If that is not a sign of an exceptionally impressive film, I don't know what is.<br><br>Judgment: Highly recommended, just don't expect a light-hearted comedy!","user":"RealLeo","rank":[32,38]},{"title":"One of the true stories that must be taught in school","rating":10,"date":"7 July 2019","review":"Very good movie. The story is awful but it was shown without excess, not overdoing the gruesome aspects and yet not saving anything.\nGood direction, edition and casting. The actors had done a good job.\nNice work in showing the time and uses: set decoration, costume design, makeup. Nothing is out of tone.\nWhenever you hear someone saying socialism is what we need, make them watch this movie. Noone needs socialism, no matter if in the russian way or the nazi one, nor Cuban, Chinese or any kind of socialism. And noone needs any kind of politics that take away your rights. If you need spies and violence to keep people's will, then you know it's not good.<br><br>PD I knew I've already seen the actress that play Sarah. I thought she was American because she sounds very American. I've just checked on her and she's the star of Borgen, the excelent Danish tv show!","user":"canarycaia","rank":[8,10]},{"title":"When Finns do a movie like they do it in Hollywood","rating":5,"date":"4 February 2018","review":"2017 is the year that I started following Finnish movies too. Aki Kaurismäki's latest, \"Toivon tuolla puolen\", and \"Tom of Finland\" proved to be great starting points.<br><br>\"Ikitie\", on the other hand, reminds me that no matter how good it can get, there are always gonna be mediocre efforts as well.<br><br>It's a prestige project belonging to Finland 100 program - which celebrates a century of independence, and includes 13 Finnish movies largely funded by private sector.<br><br>It's all about a man (Tommi Korpela) forced to leave family and Finland to start a bitter new life in Soviet territory. He's always in trouble, not having a chance to return to his family, not being able to live peacefully as well.<br><br>This is connected to bigger if relatively forgotten part of history of early Soviet era. During the Great Depression of the 1930's, great father Stalin called American people to relocate to Soviet Union - to build a better world behind the iron curtain. Nearly 10,000 followed the call; their community is where Jussi ends up.<br><br>\"Ikitie\" was surely made for international attention and maybe foreign language Oscar in mind, so the makers have found it important to create a Finnish epic which looks like Hollywood project.<br><br>This has resulted in roaring success on visual side - production values are great, the movie looks truly beautiful -, but failure on creative side.<br><br>I am not familiar with the true story, or novel by Antti Tuuri, that the screenplay is based on, but the storytelling is just weak.<br><br>The events are not very varied, interesting or connected too, bringing us just a series of moments from one man's journey. The result is too shallow to have a natural fluidity or be able to address any complex issues contained in the story.<br><br>Sadly for a movie concentrating on the state of mind (and life) of the main character, it is not able to create a strong emotional connection with neither him nor any around him.<br><br>The characters are paper-thin which is neither a great start for building rapport with audience nor offering great performances, leaving us with exactly one semi-intriguing person on screen.<br><br>And this intriguing figure is not the central hero but his nemesis, played by Hannu-Pekka Björkman, who is able to surprise with some devilish charm and uncertainty, like a trickster figure.<br><br>The lack of development for Tommy Korpela's much-suffering main character leaves him mostly with a chance to look sad or remorseful.<br><br>So they have spent more energy playing with his appearances through time (beard, haircut, etc) rather than character development. Think Brad Pitt in \"Legends of the Fall\", only with more straight and much more good-looking version of Hillar Kohv.<br><br>The main character's life choices may also seem infuriating to modern audiences, especially as his behaviour and motifs are understandable mainly for those familiar with a history of Red Russia's oppression. The background needs some additional explanation to strike a chord with wider, maybe international, circle of movie lovers.<br><br>Also, \"Ikitie\" suffers from too much \"acting\", resulting in some unnatural-sounding dialogue, resembling a play rather than a movie. The usual problem with Estonian movies too.<br><br>The project has other connections to Estonia as well, including the shared history under Russian regime, filming locations (Sillamäe, Tallinn, Haapsalu, and Varangu) and some Estonian actors used, such as Hendrik Toompere Sr. and the late Lembit Ulfsak. But their roles are small.<br><br>Based on his resume so far, Antti-Jussi Annila is an interesting director for sure, but \"Ikitie\" is simply a disappointment, and not a very interesting disappointment at that.<br><br>By the way, the screenplay was written by A-J Annila and other famous Finnish filmmaker, Aku Louhimies, who was supposed to direct it but had to honor other commitments instead. Which is directing and co-writing a war drama \"Tuntematon Sotilas\" (\"Unknown Soldier\"), another famous movie from the Finland 100 program.","user":"kaptenvideo-89875","rank":[27,49]}]