[{"title":"Coronavirus COVID-19","rating":9,"date":"13 March 2020","review":"The timing of this documentary is amazing - it was made in 2017 , it had no idea about the outbreak that's currently unfolding that initiated in Wuhang China but it prophesied it .<br><br>Incredibly thought provoking<br><br>This is not the first and won't be the last pandemic , the world needs to prepare for the next one , no more knee jerk reactions after the event.<br><br>Vigilance is permanent , the world has never been so connected we need to use those forces for good . Invest in preparedness - 500 million died of small pox in the 20th century alone more than all the wars combined through the combined efforts oh WHO the virus was finally eradicated .<br><br>It is predicted that the next pandemic will kill 200 million world wide we must do all we can to prevent that .<br><br>This documentary was incredibly informative and it's so important to watch right now .<br><br>Pad.A 9/10","user":"Padreviews","rank":[9,9]},{"title":"this is a warning. not a movie","rating":8,"date":"21 January 2019","review":"A magnificent documentary about how epidemics occurred in the past and will happen again in the future due to the increasement of the population. Director's point was to warn us about the possibility of the rising of another new deadly virus. And if it is to happen, this time it won't stop in A continent but will spread across the globe. By watching this you'll learn how easily and quickly it can spread. Be alert, nobody has any idea about how this invisible enemy will reach and silently kill.<br><br>This eye-opening documentary will scare you and will pull you up to the reality. Earth isn't as stable as you think.<br><br>#ItTakesAllOfUs","user":"smsudusinghe","rank":[8,8]},{"title":"Pandemics are optional?","rating":5,"date":"19 March 2019","review":"Put it down to a morbid interest in epidemics, but there was no material in this documentary I had not seen or heard before. The interviews were for most part good and I definitely enjoyed watching Dr. Moses (front line medical professional during Liberia's Ebola outbreak) say his piece, but the underlying message of needing to do more to prevent future outbreaks is actually quite illogical. How do you prevent something when you do not know what is coming down the pike? It did not help that the person they chose to hammer home the message was Peter Sands (former CEO of Standard Chartered). If Hong Kong had known that SARS was going to be a risk, do you not think that they would have done something about it? But they did not and could not have known that an outbreak of the then novel SARS virus was going to occur.<br><br>The filmmakers want to drive the point that prevention is a lot cheaper than treatment, but offer no real suggestion as to how prevention is possible or what might be done to prepare for a pandemic. Aside from giving more money and resources to public health professionals who obviously have a vested interest in promoting the idea that prevention is possible, what else do we do?<br><br>Much of the documentary is quite preachy, like the stuff on climate change. But production value was often decent and they did manage to get some of the biggest names in the field of public health to give interviews. So despite the fact that it was mostly boring and not insightful, I have given this a 5 star rating. You will not be entertained and unless you know nothing about the outbreaks of recent years, you will not learn much from watching this film.<br><br>They made a movie on an important topic that is not likely to have any impact whatsoever on public discourse. Really, a wasted opportunity.","user":"mingsphinx","rank":[9,13]}]