[{"title":"HISstory film scores big","rating":9,"date":"17 October 2015","review":"(Please pardon lack of detail to keep spoilers modest.)<br><br>Woodlawn tells an amazing, true story of black and white people embracing change and each other as they also embrace God, while working to transform haters of all types, using a football team as the delivery mechanism.<br><br>Woodlawn High School of Birmingham, Alabama has been forced to integrate (mix white and black students), leading to anger on all sides (but for different reasons). The football team takes on some black players including Tony Nathan, an impressive runner. The lackluster team's hard-edged coach reluctantly allows a \"religious nut\" to speak to his team amidst the racial tension. The result? The team chooses to stand with one another in unity and love amidst the racial tension surrounding them. But in the jet-wash of this transformation come intense new attacks from all sides, within and without -- including indirectly from Governor George Wallace, a key inspiration for racism in Alabama at the time, who subsequently tried to cover it up by shamelessly using a black player. Will the team, and new potential star Tony, be able to keep together the commitment to \"do something bigger than yourself?\"<br><br>This movie has some seriously good talent. Jon Voight and Sean Astin deliver like the professionals they are, and -- pleasant surprise -- the rest of the cast deliver as well. Further, there was interesting use of old footage from the time period, and the contemplative well- spokenness of the black community at the time is thought-provoking. Modern Christian films are improving as a lot, but not homogeneously, so you have to watch for one failed aspect (such as cinematography, writing, acting, or direction) dragging down otherwise good elements; however, during the the film and even after post-credits contemplation I was unable to come up with any material flaw.<br><br>Personally, I found this story and the way the film tells it engrossing. Brokenness can be beautiful; truth can be touching. This country, so tragically in the midst of lies about racial animus, as well as about our individual identities, needs a fresh injection of healing truth and reality. This film is medicine for the soul, and its surprising viewpoint may inoculate viewers against those trying to divide this country along racial lines.<br><br>Touchdown, Woodlawn!","user":"rking-19","rank":[34,45]},{"title":"True story about reconciliation","rating":9,"date":"17 October 2015","review":"This movie was excellent at setting the stage of what the country was dealing with in the early 70's. Some of the old footage brought back a flood of memories as kid. The quotes from the black community could have been from last week though, haunting how they felt so much like now. The despair, pain and frustration was tangible. <br><br>Then Sean Astin's character, Hank, brings hope. It seemed that every place there was strife and animosity, he was in there bringing understanding and an opportunity to forgive. <br><br>I love the fact it's a true story, hearing from the directors and producers on this at a pre-screening was really insightful. They did a ton of research to get the story from the people who were there. Tony Nathan was such a solid man, the actor did a splendid job portraying him. The footage was excellent, on the field with real players, you felt like you're in the action getting muddy. A little side note, the actor who played Tony was a real player in college from a long line of college and pros. So you see the actor doing the moves without CG or stunt doubles. I also love how the end credits provide the \"rest of the story\"","user":"timj-amazon","rank":[32,44]},{"title":"Woodlawn is quite an inspirational real-life high school football drama","rating":7,"date":"18 October 2015","review":"While there is a Woodlawn High School in my town of Baton Rouge, LA, this one is about a Woodlawn in Birmingham, AL, that seemed in danger of closing because of the racial incidents that happened when it was integrated in the early '70s. The coach employs a motivational speaker-played by Sean Astin-to help heal whatever issues the school football players had with each other and it seems to do the trick, especially when one of the black players-Tony Nathan-suddenly becomes very valuable to the team. I'll stop there and just say this is quite an inspirational true-life drama to watch in light of recent racial strife we seem to be going through right now. Oh, and I also liked Jon Voight's playing of legendary Alabama coach Paul \"Bear\" Bryant, as well. So on that note, I recommend Woodlawn.","user":"tavm","rank":[33,46]}]