[{"title":"Tried to be cool but ended up lame","rating":3,"date":"6 November 2015","review":"This is a pretty darn bland movie with some poor editing and super cheesy and poorly executed action sequences. Mainly because of the camera execution, it was just lame from start to finish. The acting is pretty bad and seems like regular civilians with shaved heads, some muscle and a beard participated. Or guys that just look slick or a bit geeky played these roles. I like watching movies where it's survival of the fittest, but this movie was boring. I have seen much better from amateur youtube videos and much entertaining as well. Randy Orton for most the time, looked like he didn't know what he was doing. The movie is about an hour and thirty minutes and they try to milk every second of it. Because apparently movies have to be at least 1 hour and 30 minutes or close to it. So there is a bunch of shots of rich people throwing around money, cheering and making bets. Sure this can play a part in the story, but not when it's constantly shown over and over again. This is a action movie, but just about all of the action in this movie is downright stupid and doesn't make any sense. The story seems like something someone can come up with in like an hour by just sitting and writing. Even the interactions between characters was so bad, cliché and boring. Just pass on this one, it's a waste of time. I give this movie a 3 because they seem to have tried really hard to make a cool, stylish quasi video game style movie.<br><br>3/10","user":"KineticSeoul","rank":[34,41]},{"title":"With illogical plot and amateurish action, Condemned 2 is both flavorless and messy at the same time.","rating":4,"date":"7 November 2015","review":"There are so many things wrong with the execution, it often defies logic and ventures into cheesiness, especially towards latter half. The action doesn't work and even looks more unreal than actual pro wrestling stunts. Unfortunately, this leaves the movie with silly slow-mo and random explosions, which only work as mild diversion at best.<br><br>Will (Randy Orton) is a former bounty hunter who wants to turn his life around, when suddenly people start popping up in his life trying to kill him. This silly way of killing a target is set by the antagonist Raul as he creates gambling den to bet on Will's life, but the mercenaries appears in such silly determined manner almost like a video game where they must battle enemy one at a time.<br><br>The premise is highly illogical, not to mention motivation for characters feel unconvincing. Furthermore, they can suddenly appear or react in very bizarre way for the sake of plot, that they movie just doesn't try to explain anymore in the second half. It just wants the audience to sit back and enjoy the rapid fire and liberal use of explosion.<br><br>Randy Orton is pretty good, he does look the simple action hero part. In the beginning, his character is given decent backstory, which the movie drops once the shooting begins. Ironically, for action movie the choreography looks very timid. Expect missed punch and poor editing for fight scenes, and it's even worse when the movie tries to sell the antagonist, who is a foot shorter than the main character and lacks any charisma.<br><br>This is a movie of a man wearing plot armor, rushing through bullets and explosions in slow-mo. It's messy in terms of logic and plot, so those wanting a more cerebral action would be disappointed.","user":"quincytheodore","rank":[15,17]},{"title":"gave me a headache","rating":1,"date":"10 November 2015","review":"The plot does not make sense at all. It almost gave me a headache to try and make sense of the plot while stifling through countless flaws in the movie. The nonsense eventually overpowers the film. The only reason I decide to sit through is for some good ass kicking by Mr.Orton but even that is a disaster. Unnecessary explosions and overhead shots from the drones makes the most of the movie. Felt more like a promotion for drones. If they had stuck to the original plot and made a sequel on just that I believe it would have been much more tolerable. Lionsgate-WWE being such a big production fails to deliver and has been since the past few projects.","user":"redcodex453","rank":[13,18]}]