[{"title":"A family friendly post apocalyptic movie","rating":8,"date":"3 May 2019","review":"I enjoyed the film. There were some moments where it missed the mark but overall it is kind of fasinating. I only thought afterwards that there was nothing in it that wasn't okay for for our kids to watch. We have a seven and eight year old.\nCan't think of another post apocalyptic film that you can watch with young children and they were mesmerised! Word of warning though expect never ending questions most of which you won't be able to answer. I ended up putting the movie on again for them and managed to get an hour and a half of peace and quiet before it all started again.\nThere are a few moments which I would advise parents of very young children to be around for - when the wind attacks the priest was a little scary for them but only the first time. They did get upset as well but only when a certain something happens to a certain someone. But all smiles again at the end.\nI would expect this kind of film to come from a studio like Disney. For some reason it reminded me of the eighties science fiction film The Black Hole. No idea why.\nAnyway, they're both watching it again and my wife has been tasked with searching for a rucksack like Lillys for our daughter. I give it an 8.","user":"johnwalker-62283","rank":[90,99]},{"title":"There's something about this movie, I just can't put my finger on it...","rating":8,"date":"12 April 2019","review":"This film raises a lot of interesting questions about the nature of humanity, conscience, love, etc. which, honestly, I'd never thought to ask before, and don't care enough to answer now that they HAVE been asked. That's not to say I didn't like the movie. I did.<br><br>But here's the thing, the paradox of this film: It didn't bother me that a lot of the film is slow and and at times confusing, it's never boring because I was inexorably drawn to wanting to know what the destination was.<br><br>And the weird thing is, I can't figure out why. I could not tear my eyes away.<br><br>I don't know if I can recommend this film to others or not, because I have no idea if anyone else will share my particular sentiments especially when it comes to the ending. I don't know who will understand it and who won't, or who will even think it's worth trying to understand. There are, of course, some people who absolutely love it, and probably even some who understand it (or think they do), because... well maybe because of the words of Rumi give people something to hold onto. Which in itself is a very clever thing to do because reading more of his poetry after watching added more meaning to it where perhaps none existed before. But there are probably just as many people who hate it, because... well, it's different.<br><br>At any rate, though, I think it's at least worth a look. If you find it boring, slow, incomprehensible, whatever... just turn it off. No big deal. But, on the other hand, if you find yourself inexplicably compelled to keep watching, unwilling or unable to tear yourself away for a single frame... well, then, you're welcome.","user":"romantraveller","rank":[124,140]},{"title":"I liked it","rating":8,"date":"28 March 2019","review":"Beautiful cinematography, great performances, original story. I really liked it.","user":"johannahlistoel","rank":[141,160]}]