[{"title":"This film made me think twice, and still thinking about it...","rating":9,"date":"2 December 2015","review":"I've never written a review. But this movie made me think twice, so I thought I'd share my thoughts with you. Please don't be too harsh on me about mistakes in my English, my mother tongue is Dutch, so I am bound to make mistakes. As I said, I am Dutch; that makes me a neighbour of Germany, my parents grew up during the second WW, the school system educates us inside out about the war(s) and we learn German in school. So I have knowledge about Hitler, the way he rose to power, his gruesome deeds, his mistakes, also his successes, and his downfall. I was eagerly anticipating this movie, I had seen the trailers and they made me chuckle. Yet, I was very curious how the director was going to portray this character as \"funny\", since the trailers were portraying this movie as some sort of a comedy. In my opinion, Hitler is far from funny, yet I did smile during the trailers, which didn't really make me like myself. I had to see this movie. Fortunately it played in our local cinema, so I went, on a rainy afternoon. There were three other people there, one of whom was an elderly lady (with her grandson), discussing loudly how \"they were going to make it credible how Hitler got back to present day\". That was not my worry As far as I could judge (and please don't slay me on this, I'm not an experienced movie critic) the movie made clever use of actors, as well as regular people, bystanders, whose reactions were filmed documentary wise while meeting \"Hitler\" (in SS uniform, a very good likeness, although in my opinion the actor was quite tall, whereas the real Hitler was quite short). My initial emotions during the beginning of this movie, were confusing to me. I had some good laughs, and I even felt sympathetic to the way he was portrayed. I couldn't help myself. I didn't want to feel sympathy for him or laugh about his silliness, yet I did. The beginning of the movie was humorous, yet as it progressed, it got more and more grim. And it was not because of the actors or the things happening in the movie, it was because of the reactions of REAL people to \"Hitler\". I could not believe my eyes and ears. And without getting too much into detail and thereby spoiling a lot of content, \"Hitler\" goes on a road trip through Germany and talks to real people. Their reactions made me cringe. But the director cleverly changes from scene to scene and the \"bad things\" tend to be forgotten soon enough, when funny things happen again. This also made me think, after the movie was done. All in all, the viewer will undoubtedly feel sympathetic towards Hitler. And then suddenly, 3/4th into the movie, there is a grim and sudden turning point, which leaves you in awe, and makes you THINK and gives you a bolt of reality. **SPOILER** Hitler is introduced to an elderly demented Jewish woman, yet the audience does not know she is Jewish, she is catatonic and does not react to anybody, including her family, yet when Hitler steps into the house and starts to speak, her head lifts, her eyes open wide and she starts to scream. This scene gave me goose bumps. While everybody tried to calm her down and said things like \"he is not real\", \"it's just for fun\", she exclaimed things like: \"that's what everybody thought about him decades ago, yet he was not funny, or sympathetic, he was a beast of a man and murdered out my entire family\", well you get the drift. I was shaken about this scene, because she was so right and I felt like I was put in my place! From here on, the movie takes a different course and all is not so funny anymore, but a tad grim. Yet, the director preserves humour by showing how real people react when they get confronted with \"Hitler\". You feel like a voyeur, and you feel substitute shame, which is all too real, cause these people are real! Toward the end there was another scene which made me think twice. **SPOILER** \"Hitler\" is filmed when somebody confronts him who found out that \"Hitler\" is not a clever fraud but real, and this persons wants \"Hitler\" to jump off a building, which eventually happens. When the confronter looks over the edge, \"Hitler\" is nowhere to be seen, but when he turns around, there \"Hitler\" is again, and he speaks, saying something like he cannot be killed, because he is a part of all Germans, part of their common history, and he cannot be erased from that. This made me sit upright again. Cause there's so much truth in it! I've had German friends, who had a huge love for Scotland. They went there every spare moment. I asked them once: \"Why don't you ever speak about Germany? Or go on holiday there? Your country is really beautiful\". They explained that they somehow felt this was not a right thing to do, because of Germany's burdened past. They could never say things like \"we are proud of Germany\", because it would immediately be associated with Germany's Nazi history. That's why they concentrated on other countries than their own. They underwent their Nazi past as a burden. I felt bad about this but I also had to acknowledge there must be truth in how my friends felt. My conclusion about this movie is, that I was ready to be entertained by it, yet I was left thinking twice about its message, and still thinking about it. The movie is never boring, the acting is very good and the characters very credible. There is a sublime mixture between humour and seriousness and plain \"wow\"-moment, I can't explain. But the best thing about this movie is, that it is contemporary and it really makes you think twice.","user":"princessnina3","rank":[186,202]},{"title":"While it seems like a super-offensive film, it actually is incredible social, political and media commentary.","rating":9,"date":"23 May 2016","review":"Imagine a film made guerilla-style like \"Borat\"....but with a guy dressed up like Hitler walking about modern day Germany! Well, you don't really need to imagine too much as some crazy filmmakers have done that with the film \"Look Who's Back\"!! Yes, a film crew follows Oliver Masucci as he impersonates Hitler and plays it 100% straight!<br><br>Unlike \"Borat\" where you know that it's just Sasha Baron Cohen pretending to be from Kazakstan, in this film Masucci plays it as if he really is Hitler and never breaks character. When the film begins, he is inexplicably transported from Germany in 1945 to the present day. At first, he's very confused. Then, he develops a plan...to return to politics and take Germany into the future! To do this, he enlists the help of an unemployed filmmaker, Sawatski...and together they travel throughout the country...meeting people, talking politics and becoming an internet phenomenon! Where does all this lead to? See this very insightful film.<br><br>The idea of this film is thoroughly distasteful and I actually thought might be illegal in light of German laws about the portrayal of Nazis and Hitler. However, the film manages to somehow be funny, great political commentary and not as distasteful and awful as you might imagine. This is because some of the folks in this film are not actors...and their reactions to Hitler are incredibly telling. Many of them seem to like Hitler and his message...especially regarding the negative influence immigrants have made on Germany. Again and again, folks agree with 'Hitler' and his crazy ideas while others just think it's a funny or incredibly unfunny joke...and these reactions are indeed fascinating. In addition, the way that television takes to him and his crass message is a real indictment of the moral bankruptcy of many in the media...and one that is highly reminiscent of the great 70s parody, Network.<br><br>Before you start sending me hate mail, I suggest you try seeing this odd and incredibly offensive film for yourself. While it clearly is wrong on one level...it manages to actually have some incredible political and social commentary...making it clever and a sad indictment of the culture and the media. The film's contention, amazingly, is that he'd probably fit in just fine if such a thing actually did happen! What an unusual and compelling movie...and one that just debuted on Netflix this month. Clearly, you ain't seen nothing' until you've seen this one!","user":"MartinHafer","rank":[85,95]},{"title":"This isn't about Hitler...","rating":8,"date":"31 May 2016","review":"...And that's why it was so scary.<br><br>This is a thriller. The premise is Hitler has some how come through time and believes fate has brought him here to clean house (again). However, the film was actually using this metaphor to describe the coming of the next Führer if we're not careful. If we let down our guard we absolutely WILL see the rise of the next Adolf Hitler.<br><br>The character of Hitler spoke the truth, mostly. His rhetoric cut to the heart of today's problems. It was a German production so, obviously, he spoke directly to German issues but again, Germany was just the stage and Hitler the puppet. The puppeteers were revealing a global truth wrapped in a local narrative.<br><br>Recall the time Angela Merkel, today's German Chancellor, called G.W. Bush on 9/11 and the subsequent \"War on Terror\" saying something to the effect of, \"We've seen this before...!\" THIS is what the movie is getting at.<br><br>This film is filled with amazing though often chilling street interviews featuring Hitler interrogating work-a-day people. Many of the younger of these people so open to the apparent humor or irony were embracing him, taking \"Hitler selfies\" - other older spectators and interviewees apparently LONGED for someone to take the reins and whip (Germany) into shape, getting rid of \"suspicious-looking, bearded Salafists\", etc. And these were not actors. The film was illustrating for you how Hitler rose to power the first time and how easily and quickly it could happen again.<br><br>This was a beautifully done movie. I have the book as well and I prefer the movie.","user":"empty-bin","rank":[97,112]}]