[{"title":"Think Lifetime Network movie standards ... with snippets of nudity","rating":2,"date":"17 January 2015","review":"IMDb readers of the present and future may well look at the low rating --2 -- and think that this reviewer is perhaps being harsh...? However, in fairness, I will note that, if you take the time to research the IMDb reviews of other productions where Jared Cohn has acted as both writer and director, you will discover even lower ratings than that number associated with his work.<br><br>The story deals with the \"older\" daughter of a successful businessman who gets involved with a sexual partner who attempts to bring out aspects of her sexuality (BDSM) with which she, presumably, was not already familiar.<br><br>Brought to you by the same team that gave you BIKINI SPRING BREAK (among others) and starring the irrepressible Daniel Baldwin (whom, one reviewer noted, seemed to be reading his lines off cue cards he had never seen before), the most interesting thing about the film is the casting of Charisma Carpenter in the lead.<br><br>For those visiting from another planet, TV is the 90s was dominated by the emergence of a young auteur named Joss Whedon (yes, the same Joss Whedon who gave new life to the Marvel library in his Avengers I script).<br><br>Whedon, by the end of that decade, had not one but two breakout hits on his hands, each handled by a different network -- (Buffy and Angel)-- and each prominently featured Capenter.<br><br>In other words, you could not miss her even if you wanted to. And no one wanted to. She was perky, fun, gorgeous, and memorable.<br><br>The prevailing view is that Carpenter's career since those days has been somewhat problematic, and an argument can be made that this effort is yet another attempt to recapture her glory days and reconnect with former fans.<br><br>As for the production itself, it features the standard levels of quality that Cohn and his company, Asylum, are known for -- perfectly lit sets starring exceptionally good looking people in static (low movement) environments with lots of head and shoulders framing.<br><br>Where the director wants the audience to really \"get\" that something important is happening on-screen, he will attempt to do this via a change in the lighting, as opposed to the more traditional ways (such as through the dialog or the acting).<br><br>That technique, in real life, is just as effective as it sounds.<br><br>Really and truly, for Carpenter fans only.","user":"A_Different_Drummer","rank":[58,76]},{"title":"Cordelia with boandage","rating":1,"date":"27 January 2015","review":"This is a lame attempt to make a low budget 50 shades of Grey.But all it does, is remind you of those god awful movies,those so called erotic thrillers, that came in the wake of basic instinct's success, but was really just glorified softcore porn. <br><br>But the difference is those were made with younger former scream queens,B-C movie actresses who weren't afraid to go full frontal. Something charisma doesn't seem willing to do. Which would be fine,if she didn't accept scripts that would need full frontal for her role to work,or at get some attention. The producers seem to hope that Charismas tits are gonna save this movie,which they can't. the script is to boring and her character uninteresting. <br><br>Who ever directed this should be shot,or go back to film school.When Charisma undresses,they focus on her face.And I mean REALLY focus on her face.<br><br>They zoom so close you can see the wrinkles around the eyes. The story is lame and Charisma can't manage to show an emotion to anything that happens around here. Sadly her face seem to only have 2 expression, pleasure and anger.Those are the only two emotions she manage to express fully,with her face.<br><br>I'm pretty sure her phone hasn't been ringing off the hook since she left Buffy and Angel,but this is just sad.","user":"Eddie_weinbauer","rank":[59,78]},{"title":"50 shades of awful","rating":1,"date":"2 February 2015","review":"This was just about as bad as it gets for a BDSM related movie. I'm not sure how the script or the director got this in front of a camera but they are better salesman than they are movie makers.<br><br>Producers of these types of films, including those from 50 shades, really need to get to understand the BDSM lifestyle a little more. They make a complete mockery of the experience and get lost in the whole whips and chains of it all. They have the ability to create something more erotic and powerful than any movie ever made but turn it into steaming piles of whatever this movie was.<br><br>Lastly, as a BDSM enthusiast, I thought the portrayal of the main male character was pathetic. Turning him into an abusive statutory rapist?, well done. You managed to make the movie's plot match the performance of its 'actors'.<br><br>The 1 star is for Charisma Carpenters looks alone.","user":"the_stretford_end","rank":[24,30]}]