[{"title":"***1/2","rating":9,"date":"10 February 2015","review":"Don't you think that at times Kelli Martin looked too old for the part and that her mother-in-law to be even looked younger?<br><br>That being said, we have an interesting, often funny and yet poignant story of traditional versus now-a-days. Two women in competition over their bridal gown stores don't realize that the younger owner has fallen for the other owner's son. It is funny how the latter attempts to keep the news from both women and of course the mayhem that you would expect to break out when each finds out.<br><br>Of course, we have the mother trying to sabotage the relationship, even going as far as to insult the woman's father, a widower who wed 3 times after his wife's death. Nice seeing Bruce Boxleitner in the role of the father. He looks like Al Gore in certain scenes.<br><br>Of course we know that a rapprochement shall have to be reached between mother and son's fiancé since love conquers all.","user":"edwagreen","rank":[13,14]},{"title":"Most everything about this just so so.","rating":5,"date":"4 June 2016","review":"The story is OK. A bridal shop owner runs a business which caters to clients looking for non-traditional wedding attire. A chance meeting with a lawyer brings a man into the shop owner's life. A man whose mother also happens to own a competing bridal shop but with a snobbish slant. Overall the actors do OK. But, the characters just don't seem to fit together logically. I just don't buy it. Kelli Martin is a good actress but just is not the right person for this role, bless her heart. Quirky has been used in previous reviews to describe her character, but to me she comes off as a bit pitiful, unattractive, whiny, and just too odd and difficult for any sane person to want to have a relationship with. I did like the love interest character although I can't see why someone like him and from his background would have any interest in the bridal shop owner played by Martin. I am a guy, and not embarrassed to admit I like Hallmark chick-flicks. But this one for the reasons listed above is nowhere near the top of my Hallmark \"like\" list.","user":"m2dad","rank":[8,10]},{"title":"I liked it...it was pretty good, 7 Stars!","rating":7,"date":"12 April 2017","review":"Touching, sweet, romantic comedy &amp; drama. Well, it doesn't classify as a romance according to IMDb, but I beg to differ. It was unlike most movies in the way of romance. It didn't have the most prettiest gal nor the most handsomest guy as the main characters, but that's what was different about it. The acting was good. It had a charming appeal! It's worth one viewing.","user":"huggibear","rank":[5,6]}]