[{"title":"Immensely entertaining!","rating":9,"date":"1 August 2016","review":"Fantasia 2016: 'ANOTHER EVIL': Four and a Half Stars (Out of Five)<br><br>One entry in this year's 'Fantasia International Film Festival', is this extremely low-budget horror-comedy flick. It's about an artist, who's trying to rid his family's vacation home of a ghost, who then befriends the eccentric exorcist, that he hires to do it. The movie was written and directed by first time feature filmmaker Carson D. Mell, and it stars a cast of mostly unknown actors; including Steve Zissis and Mark Proksch (as the film's two leads). For such a low-budget flick, the movie is immensely entertaining!<br><br>Dan (Zissis) is an artist, who's spending some time with his family at their vacation home, when he witnesses two ghosts. The first exorcist he hires (Dan Bakkedahl), to get rid of the spirits, tells him the ghosts are friendly; and that he should just learn to live with them. Dan doesn't like that idea, so he hires another exorcist, named Oz (Proksch); that promises to actually rid the house of it's unwanted guests. A very bizarre relationship forms between the two men.<br><br>The movie is hilarious, in places, and it's also quite frightening, and disturbing, in other places. The climax is totally intense (as well), and it's also extremely involving. The two lead performances are fantastic, the directing is adequately done, and the script is brilliant. What's most impressive about the film though, is how the filmmakers are able to do so much, with so little! The execution, of this 'little indie that could', is masterfully done! I'd definitely recommend it.<br><br>Watch our movie review show 'MOVIE TALK' at: https://youtu.be/bE358EcZTbU","user":"Hellmant","rank":[19,33]},{"title":"Cable Guy meets Conjuring","rating":8,"date":"6 July 2017","review":"Another Evil is one gem of a little film. Let the reference to 'little' not mislead you though - it's 'little' not due to lack of significance or quality, but because of its limited budget and its orientation towards a smaller audience (appreciators of intelligent minimalist horror comedy). The film seems to have been made by true enthusiasts of the genre who must have enjoyed every bit of making it. Another Evil is a good proof of the fact that it's not the budget and fancy special effects that make a good film but a quality script, skillful directing and good acting.<br><br>The Plot is simple. A family's house is haunted by evil (or not?) spirits and the man of the family invites a ghost specialist (or a ghost evictor?) to chase these spirits away from the house. The ghost man - a chubby and funny looking man (who first seems nice and friendly but eventually turns out to be totally bizarre weirdo) becomes very fond of the protagonist's company and does not seem to be wanting to part with the latter. He therefore extends the initially agreed term of the services and even offers to the protagonist a free-of–charge day (so that he can stay over a little longer with his new \"best friend\"). However, the protagonist does not quite share this affection (to put it lightly). He wants this weirdo to leave the house immediately, once and for all, even at the expense of some of the ghosts remaining in the premises. This is where the conflict begins and the comedy slowly picks up thriller elements, leading to unexpected events.<br><br>The film is hilarious, filled with irony and top quality subtle humor. The jokes are at times dry and somewhat dark, so they're definitely not for everyone, but the \"right\" audience will appreciate. The choice of the main actors was done very well (especially the ghost man) creating the right chemistry between the two.<br><br>Some tabloid could probably describe the film as \"Cable Guy meets Conjuring\" and this would probably be a pretty accurate description (despite the corniness). Overall, if you enjoy a good quality, subtle dark comedy and are a fan of John Landis/Sam Raimi movies, Another Evil is definitely worth checking out.","user":"george_aslf","rank":[8,12]},{"title":"You may need to exorcise the demon that made you watch this film","rating":1,"date":"3 July 2017","review":"First and foremost this is not a comedy. We have a haunted house and artist owner Dan gets a recommendation and hires Os (Steve Zissis) to rid the house of the ghosts/demons/whatever. There is no 'relationship' between the two other then the fact that they are alone in the house for almost a week. Most of the time, and this was so irritating, Dan merely sits/stands and listens and watches, saying very as he realized two things. First, he does not understand anything Os is doing and second, he realizes Os is nuttier then a fruit cake i.e. describing how he plucked eye balls out of a woman's corpse with juice squirting everywhere. OK, Dan, why not terminate Os that very moment? Also, a bizarre scene with a stripper called to the house and which added nothing to the tale.<br><br>When Os begins destroying Dan's house and paintings he tells Os to leave. I will say the Os, played by Steve Zissis, portrays lunatic so well it seems nonsensical that Dan did not end the nonsense early on. It is one thing to be a zealot exorcist, highly recommended, and quite another to be a madman that will, at the drop of a ghostly hat, see Satan within Dan's teen son and to develop a psycho murder plot that might include Dan's son and possibly Dan and his wife as well. After all, if he kills the son he would have to kill the witnesses. <br><br>Forget the police or self help when a ghost can intervene 'after' Os has already begun his torture campaign. So a ghost with very bad timing. Seeing Os naked in the kitchen, to catch vibes, then asking Dan about locations he had sex with his wife and suggesting his son has been possessed by Satan should have been way more then enough to call the cops when Os refused to leave. The fact that Os could sweet talk Dan at that point, to cancel the police, is absurd. Os was obviously 100% loony been material of the highest order. <br><br>The final confrontation was staged poorly with Dan, as happens in too many films, leaving slightly injured Os with the shovel so that when Dan turns his back Os can have another go at him. You can't save your son by letting a psycho would be killer have a second shot at you with a deadly shovel. Take the shovel, toss the shovel but do not ever leave it by the side of the would be and still viable psycho killer.<br><br>It is not clear how Dan allowed his wife and son return to the cabin knowing psycho Os would be there?<br><br>this movie is perfect for rabid Steve Zissis fans. For me, I am still in recovery.","user":"stevepat99","rank":[9,17]}]