[{"title":"Talk about a director with self-esteem issues.","rating":1,"date":"21 March 2018","review":"Here's a tip, when you're buying fake reviews for your crap documentary it's not a smart idea to have them all gush praise and reverence for the director over and over and over. Seriously, whatever fake PR firm you used to write these reviews laid it on way too thick. Learn a little subtlety. Wow.","user":"terrencepatrix","rank":[116,149]},{"title":"More shills than genuine reviews","rating":1,"date":"17 June 2018","review":"I liked the sound of this movie. It was rated 6 on IMDB so I figured I'd check out the reviews. I gave up after wading through a mess of 10/10 reviews, comprising of adjectives a 10 year old would use. And the clincher, nearly all of these 'reviews' are by people who have never reviewed anything else. Listen, when a film company decides to pay a lot of people to make it sound like Citizen Kane on IMDB, then the movie gets a one star rating from me and two fingers for the pathetic sounding shills you've employed.","user":"shadowfax73","rank":[86,111]},{"title":"Sorry but I must call BS","rating":4,"date":"19 April 2018","review":"It's funny but I just created this account today to actually call BS when I see. I have used imdb for years (without an account) getting great real life reviews from good movie critics. But I'm sorry, when 95% of the 10/10 reviews are from people (maybe like me, but I highly doubt it) who have only been on imdb for just a couple of weeks and have only reviewed this one movie. Not to mention that all the reviews are just three or four lines. Does that not feel like maybe the same person with multiple accounts? Come on guys. This movie is nowhere near a 10/10 if the scale only goes to 10, then 10 should be academy award films. Yes, no, maybe? Please all I ask is critics be honest and promoters do it somewhere else. \n This movie is ok if you are into off scene action, reenactments, and general horror type films. You are not however going to find any hard evidence one way or another. If you are looking for that, save yourself some time and look somewhere else. The movie does have its on style of character but it really does fill like a 95 minute TV episode. I hope this may help anyone really looking for an honest opinion.","user":"rtstoco","rank":[45,58]}]