[{"title":"Predictable but we do love the Amish in TV movies","rating":7,"date":"1 March 2016","review":"There have been some recent Lifetime movies about the Amish so UP TV offers this nicely filmed, attractively cast romance about an Amish girl finding true love. The result is watchable but predictable.<br><br>The story is simple, Emma is a fan of Pride and Prejudice. She travels to another state to visit her cousin and there she meets a nice wholesome Amish man and a suave city guy who wants to interview her about her cheese. Danielle Chuchran plays Emma and she is very pretty. Sometimes she acts and speaks a little too modern for an Amish person (at least the stereotypes we see on TV). Her Amish beau is Trevor Donovan of 90210 and her city suitor is Drew Fuller of Army Wives. Guess who she ends up with. The clichéd part of the story is that the Amish are all blonde and pure hearted and the city folk dark haired and jaded / lecherous.<br><br>Worth one watch if you need your Amish fix.","user":"phd_travel","rank":[6,6]},{"title":"Simple sweet story of young love","rating":7,"date":"5 February 2017","review":"This is a coming of age film but in the context of an Amish Community - it speaks to knowing ones own mind while remembering that sometimes this involves a journey of discovery to find not only new experiences, but also ourselves.<br><br>A little predictable and good and evil is stereotyped at times but easy and fun to watch. If your soul need soothing this film is like a cool breeze - present our destiny, our calling as something attainable and fun to search for. Subtle themes of loving and losing but staying open to life and what it has to offer.<br><br>A little more character development would have enhanced the film's gentle message.","user":"skpn123","rank":[6,8]},{"title":"Best love movie ever!","rating":10,"date":"20 December 2015","review":"Well guys, do you know these situation where your girlfriend forces you to watch a love movie and you feel not good about it? Have you watched some love movies and the food in your stomach wants to come out of your mouth? Not this movie! It is great! The Amish are portrayed nicely. The main actress is hot and did a believable job in her role. The other actors are all good.<br><br>The movie has a lot of emotional scenes and in the end you will be rewarded with a fantastic finish. On the other side, the end of the movie is predictable. Beside the end of the movie, there is a lot of tension that keeps you guessing what will happen next.<br><br>There are some messages in this movie, which are interesting.<br><br>All in all it is a simple and emotional great movie!","user":"tronrontron-52511","rank":[9,16]}]