[{"title":"A Greek Tragedy on Film about Lighthouse Keepers vanished in 1900","rating":6,"date":"25 February 2019","review":"The movie is a tragedy, an imaginary tale of what could have happened to the real \"keepers\" who indeed vanished back in mid december of 1900, and never heard of again.<br><br>The truth is that nobody knows for sure what was the fate of the real three men at the Flannan Isle, and anybody's guess is as good.<br><br>Theories abound about what really happened, from alien abduction to a giant wave, and anything in between.<br><br>Was it a terrible natural accident, such as the three men falling down a cliff or down inside a cave? Or something more sinister as the men kill each other?<br><br>Your guess is as good as mine.<br><br>In the real diary entry logged by the real keepers, they write about a terrible weather \"as the one they have never seen in 20 years at sea.\"<br><br>That particular entry in the book is extraordinary, having in consideration that weather reports at the time indicated that weather was fine and calmed and the first rain can in on december 17, 1900. That is baffling to say the least.<br><br>Will we ever know what happened to those 3 scotish men, thomas, donald and james? sadly, most probably not, which is so sad, especially because they had wives and children.<br><br>About the movie itself, i'd say its pretty good. i give it a 6.<br><br>acting is excellent from the three main actors, as well as from the supporting characters. all did a good work, and the director set the grim tone right from the beginning.<br><br>the drama unfold with camera close to the faces of the actors to emphasis the tragedy going on, no images from the beauty of the ocean and a blue scotish sky don't expect to see that.<br><br>all is sad from the very beginning and the only laughs occurred when donald and james found gold in the chest. other than that, all is grey.<br><br>i'd recommend the movie to anyone who likes thrillers and tragedies on film. no special effects just plain good old fashioned acting (good actually) and an ending kind of predictable, still enjoyable (again if you like tragedies).","user":"carlos512","rank":[47,53]},{"title":"Butler reminds us he's an actor with a surprising amount of range","rating":7,"date":"14 April 2019","review":"The Vanishing<br><br>It's nice to see Gerard Butler taking on a role that reminds us he can act and with a surprising amount of range.\nHe has become Hollywood's go to man for B movie action over the last few years.\nHowever in 'The Vanishing' he gives the stand out performance.\nWith strong support from Peter Mullan and Connor Swindells this film tells the story of three lighthouse keepers that vanished without trace off the coast of Scotland.\nObviously only inspired by true events Director Kristoffer Nylholm's film is a tense slow burn thriller that relies on the three actors to drive the story through dialogue rather than action.\nAs aforementioned it is Butler's performance that captivates the most as the three men discover a man washed ashore with a wooden chest.\nIt is apparent that the contents of the chest is rather valuable when three more individuals come looking for their property.\nNylholm's film never truly ignites. It instead smoulders. Tension is turned up by the three leads as their predicament gets the better of them.\nGreed, guilt and madness ensues in what Is a superbly crafted movie.\nIt's a shame Butler doesn't lend himself more to these type of roles and allow himself to flex those acting chops rather than his muscles.\nDon't get me wrong I love his cheesy action roles but here he's allowed to shine as an actor.\nMullen is the father figure of the crew and he is the one turned to for wisdom and advice whilst Swndells character is the naive new Youngblood.\nI recommend that you watch this film. It's slow but captivating like a good mystery thriller should be.","user":"stevenrotherforth","rank":[32,37]},{"title":"Disturbing drama","rating":9,"date":"6 January 2019","review":"This is not to entertain you, this is a serious movie and very dramatic, kept me thinking all night.\nAfter checking the internet, I found out that nobody knows what happened to these 3 men , so the story in the movie is based on fiction not reality.\nIt's a great movie , Gerard Butler in his best performance to date away from the action hero type of movies. He really deserves a nomination for this . You will not recognize him in this one.","user":"ozsud","rank":[97,129]}]