[{"title":"The movie you didn't know you had to see this summer","rating":8,"date":"31 July 2015","review":"Here's a surprise: The Gift is a mature thriller that's more complex and classy than the trailers suggest. I don't know what caused the marketing department to make the film look like such a second-rate, cheap, predictable thriller that somehow had gotten ahold of talented actors, but now we know the truth. As Joel Edgerton's directorial debut, it's impressive, considering the sense of craft going on behind the camera. The cinematography is gorgeous and the pacing is that of a slow burn, but it's never dull. The premise is also deceptively simple, turning more intricate and involving as the film progresses.<br><br>Edgerton, who also wrote the screenplay, refuses to adhere to genre conventions, constantly subverting audience's expectations on how the story plays out. Red herrings, plot twists, shifting perspectives, and moral ambiguity ensue, but they never feel cheap. Like the best thrillers, The Gift evolves naturally and realistically. Edgerton and Rebecca Hall are great, but it is Jason Bateman who impresses. As a natural comedian actor, he plays one of his rare, serious roles to terrific effect. But I digress. You should go into this film with a clean slate, but know that it is a rare, intelligent thriller that doesn't cheat or spoonfeed its audience. And in that regard, Joel Edgerton has given us a gift, indeed.","user":"moviewizguy","rank":[258,321]},{"title":"well wrapped","rating":7,"date":"9 August 2015","review":"Why as a seasoned movie addict and theatre visitor am I always amazed at the way the \" Blockbusters\" get all the press and gossip and fantastic movies like this slip through the net. Like last years immense \" The Babadook \", this directional debut by Joel Egerton is a really good thriller and has had nowhere near the media coverage it deserves. It makes me so angry that the Marvel franchise gets rammed down our throats on TV and in fast food cafes and masterpieces slip through the net. Excellently directed and very well acted,this clever little well - wrapped gift is all we need to let us know that the proper movie making process is still alive and kicking. Very few special effects and perfect use of sound( or lack of it in some cases) with 1 or 2 shocks to keep us going,it carries a clear message of our past waiting to wreck our future. I think it cleverly slows pace half way through then wakes up in the last third.Grab it while you can guys cos this will just go after a week or 2.","user":"Alanjackd","rank":[118,152]},{"title":"Tense, unsettling, and so well paced...","rating":8,"date":"8 August 2015","review":"Yeah, this was a lot of fun. I mean, the story reminds me of many others (most noticeably, Gone Girl and Side Effects) in that it's able to turn its story in more ways than one. As a very straight- forward thriller (the first half of the film) it works marvelously. Edgerton really has such a confident control of the pacing and the tone he wants the film to have, and when it switched direction, he's still able to keep the audience in their toes. What's most impressive is that this really is such a B-plot in many ways, but Edgerton goes further and really develops a thoughtful morality tale. Just when the film seems like it's going to go down the rabbit hole and not come back, he reveals another aspect of the story that puts it al in perspective. There are a few implausibilities (like someone else said, not sure if I can buy that she would be unaware of how he was for such a long time) but there are enough answers to such questions that are satisfactory and don't damage the film as a whole.<br><br>The three leads are also so fantastic. Edgerton is perfect, and Bateman also really surprising. Who knew the lead from Arrested Development (although in retrospect his character never really stayed in caricature mode really) had this in him? He has some really dramatic scenes that blew me away. Rebecca Hall is such a great screen presence so her I'm not surprised about at all. She's just great.<br><br>I think what's also really impressive about the film is that nothing comes out of nowhere. Every turn you sort of have an inkling, and you see all of the clues planted early. This may seem like a problem for many (\"i totally saw that coming\") but for storytelling, it's what works best in retrospect. The film at its core is really about the way our past can have consequences not just for us but for others, and the way it can also shape other people in ways you wouldn't expect. Simple, but effective.","user":"Red_Identity","rank":[65,84]}]