[{"title":"Why, oh why?","rating":3,"date":"3 June 2016","review":"I'm sorry, but with the best will in the world I wanted to like this movie. I've probably watched all the original series when they were first televised and thought that they were so, so funny. I watched the DVD's of the series several years ago and still found them highly amusing, not as funny as when I originally saw them but that, to a certain extent, is understandable. However, this remake!! It is so not funny! The dialogue and interaction between the characters is woefully weak. If I were to see that sort of interaction in a school play rehearsal I would seriously consider canceling the show! Why do producers think it is good value to remake classics without the original actors? Could you imagine a remake of Steptoe and Son without Wilfred Brambell and Harry H Corbett? Perish the thought! Sorry, but this movie is a no-no for me and I would advise anyone who has a 'soft spot' for the original 'Army' to stick to your good memories of that show and not to spoil those memories with this poor attempt at an alternative version.","user":"phillewis-42679","rank":[28,34]},{"title":"A Big Mistake","rating":4,"date":"4 June 2016","review":"Trying to duplicate an evergreen TV series such as Dad's Army is about as plausible as trying to re boot Laurel and Hardy. <br><br>This was a unique show fronted by unique characters. The plots were simple and depended a bit on slapstick, but more than anything the presence of the late Arthur Lowe. Unfortunately, Toby Jones couldn't come near character of the stuffy but lovable Capt. Mainwaring. Without that it's not Dad's Army.<br><br>The production is filled with top actors such as Bill Patterson,Tom Courtenay and Catherine Zita Jones. But they had little to work with in a rather unfunny script for a far too serious plot. Bill Nighy does his best at stayed Sgt.Wilson. But he had little to work with against an equally unfunny Jones. I wasn't expecting too much from this film,so I wasn't disappointed a great deal.","user":"danew13","rank":[15,17]},{"title":"Comes armed with everything except the comedy.....","rating":4,"date":"3 June 2016","review":"I grew up with the 1968 series Dads Army. It sat cheerily alongside other quality Brit comedies in a similar vein, such as It Ain't Half Hot Mum and complimented top US military comedy shows, such as Hogans Hero's. <br><br>That said, much as I desperately wanted to love the new film based on this wonderful series it simply lacks the clever comedic wit and wry humour of its predecessor. Indeed, it would be fair to say it comes armed with everything except humour. This film offers up great sets, a good choice of location, excellent costumes, a predictable but not unlikable story and a stellar cast. <br><br>Sadly, that's about it. The comedy is thin on the ground and a good portion of any humour there is amounts to very innocuous, mildly sexual jokes, mostly directed at Catherine Zeta Jones, spy character. \"Did you slip her a sausage?\" one woman asks Jones the butcher. <br><br>Simply put, this is such a terrible waste. A more polished script, infused with comedy of the period and maybe a few new twists, could have seen this film shine, paying homage to a wonderful series I can still happily watch 47 years later. Instead, what you get, is weak tea without the sugar. I'm sure Arthur Lowe's, Captain Mainwaring, would not have been impressed. Four out of ten from me.","user":"s3276169","rank":[15,17]}]