[{"title":"\"Hey Gang, Let's Put On A Show!\"","rating":2,"date":"5 September 2017","review":"When purchasing a ticket to a movie with a title like \"Valley of Bones,\" a viewer probably has at least a fairly general idea of what he might be getting into—likely a horror picture. And in buying a ticket to this new release, he wouldn't be wrong. At least not completely.<br><br>And that's part of the trouble: \"Valley of Bones\" changes gears, and genres, so often that it seemingly can't make up its mind precisely what it is—a crime thriller, an adventure, a soap opera, a western, a horror picture, or a domestic drama. At one alarming point, the movie seems to be on the cusp of becoming a musical—the heroine and the villain, having bonded over shared stories of their pathetically inadequate parenting skills, sing a bedtime duet from different sides of the screen, as in \"West Side Story.\" It's a nice enough moment—it just belongs in a vastly different picture.<br><br>Briefly, \"Valley of Bones\" concerns the efforts of a disgraced paleontologist to regain her professional honor by recovering what promises to be the largest complete Tyrannosaurus skeleton ever located. <br><br>The enormous fossil was inadvertently discovered in the North Dakota badlands by a lowlife, low-level drug dealer marked for extermination by a homicidal international narcotics kingpin known as El Papa. The dealer seeks to use his share of the profits from the dig to settle his enormous debts with El Papa, and buy back his life. In the unlikely meantime, both the paleontologist and the drug dealer seek to become better parents to their alienated youngsters.<br><br>By the time the picture finally sorts out its various and diverse plot elements, it's already too late. In the end, \"Valley of Bones\" is sort of a half-baked, stoner version of \"The Treasure of the Sierra Madre,\" with the gold dust sought by the various characters in that 1948 classic replaced and substituted by either crack cocaine or dinosaur remains, depending on your perspective.<br><br>Worse, the filmmakers apparently know about as much about paleontology as they do about story construction. While actual fossil recovery efforts as large as this continue for years and sometimes decades, the gigantic fossilized Tyrannosaur in this picture is unearthed and crated-up within a day or two. And although one of the beast's teeth is as long as your forearm, the entire skeleton is finally loaded onto the back of a large pickup truck. Instead of practicing actual scientific paleontology, these people behave as if they're digging up the remnants of last week's barbecue.<br><br>Usually a motion picture as compelling and intelligent as \"Valley of Bones\" holds its gala premiere in the discount bin at Walmart. Presumably this picture made it as far as select cineplexes because the distributors noticed nothing much else going on during the first weekend of September, and decided to take a shot—a long, long shot.<br><br>Judging by the same names listed over and over in the picture's credits, \"Valley of Bones\" was very much a family affair—writers Dan Glaser and Steven Molony are also the picture's director and co- star, respectively, and various other members of the cast and crew also pull double- and sometimes triple-duty.<br><br>Your best option is much simpler—just stay home, save your money, and wait for a movie worth seeing. \"Valley of Bones\" is the kind of picture which sooner or later will find its way to the patented mockery of the new Netflix reboot of \"Mystery Science Theater 3000.\"","user":"cschultz-2","rank":[26,29]},{"title":"Good photography is about the sole saving grace here","rating":3,"date":"1 September 2017","review":"Dingy, violent little number, about a paleontologist ( recently out of prison, and trying to redeem herself, obligatorily ) who receives a tip from a meth junkie ( with vaguely defined ties to, and undefined debt to, a drug cartel who is threatening his family ) about a tyrannosaurus Rex buried on a desolate plot of land in North Dakota, which could potentially be worth a fortune.<br><br>Characters with overly cluttered backgrounds people this well photographed drama/ Western/ horror thriller, which never climaxes, so much as it just stops, with no resolution to any of its numerous plot lines. However, if we were to take out the overly complex character backgrounds, all we would be left with is the odd story of an archaeological dig, with the vaguely defined prize going to the undefined highest bidder, and again, some good cinematography, making good use of the bleak North Dakota land.<br><br>This is another film ( similar to The Gracefield Incident, from a month or two ago ) which was filmed several years ago ( in this case, this was filmed from 5 October 2015 - 2 November 2015 ) and sat unreleased until its abrupt, barely advertised limited release ( in September 2017 ) and has barely any information on its IMDb page, or Wikipedia page, and doesn't have a Boxofficemojo page, and didn't get a Thursday night preview screening. I saw a trailer for this one single time, about a week ago, and there was a standee in the cinema lobby, and apparently that was all of the promotion this received. <br><br>Edit: it now has a Boxofficemojo page, and this opened in a limited release, on only three hundred screens, bringing in $164.738, placing it at number 44 for opening weekend. The following week, it plummeted from 300 screens down to only 13, and from 44th down to 105th place.","user":"Zbigniew_Krycsiwiki","rank":[25,28]},{"title":"Two ways to pay.","rating":4,"date":"23 January 2018","review":"Single mother, starving, paleontologist Dr. Anna Olsen (Autumn Reeser), is down on her luck. She is estranged from her son (Mason Mahay). She is offered a chance at a big find. She goes there with her son and Uncle Nate (Rhys Coiro). The issue is that junkie Wes McCoy (Steven Molony) discovered the location. He owes the cartel who want their money, or else. <br><br>To be honest, I was more interested in the bones than the drama and limited action. This is a me-too film with forced excitement. It is movie you will forget once you see the next one. <br><br>Guide: F-word. Stripper Nudity (Kelly Cossette).","user":"nogodnomasters","rank":[3,3]}]