[{"title":"a fun yakuza comedy","rating":8,"date":"26 September 2015","review":"Honestly, it feels like 2/3rd of the other reviews did not even see the movie. Nudity? There was none besides the old men baring their chests. Smoking hot girl? There's barely any women in the film. You got the fat wife of the main characters son for 10 minutes total, a couple hostesses in 2 scenes and another old hostess friend of the main character who gets the undress the male main character, but stays fully dressed herself. Violence towards normal people? They barely even attack anyone, being elderly versions of the old honorable yakuza cliché. The only fights are against cartoonishly evil crooks that steal from the elderly. Its not even an action movie. There's a few action scenes, but they mostly exists to poke fun at the old guys or are flashbacks that serve as references to older yakuza flicks. Its just a fun getting the gang back together film like the Korean film 'Sunny' or the American 'Stand Up Guys' but not bad like Stand Up Guys was. It won't change anyone's world but it was consistently funny and would satisfy any lover of yakuza films. For anyone who cares, there's no real gore, it sticks mostly to comedic violence.","user":"davincie40","rank":[34,46]},{"title":"Takeshi Kitano Right on Beat","rating":8,"date":"11 February 2016","review":"This movie is a 100% guaranteed Kitano style. The satire and comedy contained in this movie, is absolutely hilarious, although at points you aren't entirely sure where this is heading, or why there are some unnecessary scenes that didn't quite fit the set pace. I too would strongly recommend to ignore the poor IMDb ratings for this movie. You shouldn't even pay any attention to it, as the score is so obviously faked (42% of 1??! - yeah, right!) it makes me feel ill to think that there are people who would do that sort of thing. Regardless of that sad attempt to manipulate ratings, this is one of the best comedies by Takeshi Kitano. The seemingly western take on a very much Japanese thing, is actually a refreshing one. What some may miss about the inventiveness in this film, is the simple fact that not every one is, (or will ever be) able to understand one of the most difficult forms of comedy, satire. It seems that Kitano is purposely making fun of his own \"serious\" Yakuza -movies, with incredibly light touch, that makes everything seem so effortless in this movie. The idea of old, retired men \"getting at it\" one more time is very often used cliché in movies, need I remind of such movies as \"The Bucket List\", \"The Unforgiven\" and of course \"Seven Samurai\". However it must be kept in mind that Kitano's entire style doesn't appeal to everyone, nor will it never be understood by all. It's also absolute poppycock for someone to say that if you like this movie, or think it's good because you are \"asianophilic caucasian\" or just because it is by Kitano. I would recommend this movie to anyone, unreserved. It has it's low points, but one thing still makes me smile: The movie is stunningly funny, in the most hilarious way!. Well done Beat Takeshi!","user":"FilmCuckoo","rank":[11,14]},{"title":"Unmatured with Age","rating":5,"date":"9 October 2015","review":"You couldn't put much wrong with Kitano's works in the Nineties: Some yakuza/police classics, with 'Sonatine' and 'Hana-bi' widely regarded as among some of the best Japanese films of the last three decades. There was the slightly out-of-place 'Scene at the Sea' and the delightfully awful 'Getting Any?', but generally, you knew you were getting some quality. <br><br>The last fifteen years, however, have been a less enjoyable ride. They started reasonably well with 'Brother', 'Dolls' and 'Zatoichi', but since then, there has been little to shout about. Over a decade has brought the ambitious, but confused 'Takeshis'; the enjoyable, but relatively ordinary 'Outrage' films; the okay 'Achilles and the Tortoise'; and the at times bizarre and boring 'Glory to the Filmmaker'. While fans in the West may have over-estimated their brilliance, blinded by love of his earlier works, these a hardly works by a master. <br><br>Kitano is a man that can wear many hats (not literally usually), and his films can take many forms. With his latest work, 'Ryuzo and his Seven Henchmen', Kitano is in comedy mode, telling the story of retired yakuza, Ryuzo, who reunites his old gang to start a new, ageing 'family' to claim back their old turf from the younger, more corporate group who are currently in control.<br><br>Naturally, a comedy about ageing yakuza is going to be of the slapstick variety - there is nothing serious to be considered here. What we have are eight bizarre characters, each with his own idiosyncrasies. Though this is not so much the case, with only around half of them actually getting much individual screen-time for character development, serving as little more than comic cameos. This isn't exactly 'Seven Samurai'.<br><br>Forming their new family, they set about taking on corporate organisations and Keihin United, led by the supposedly slick Nishi. But soon things go wrong, resulting in the sort of farcical ending you expect from a - I'm going to say it - knockabout comedy. Kitano himself makes a cameo as a similarly ageing policeman as 'Beat' Takeshi, and his brief appearance serves as a metaphor (a meta for what?!) or how much thought has gone into this one. <br><br>Now, taking my Radio 4 hat off and putting my 'movie-goer' one on, was I entertained? Kitano's last few films has suggested he isn't going to be making the artistic films of his Nineties peak. Is it silly, yes; is it stupid, yes. Is it funny, in parts; was I entertained, yes. <br><br>Like Ryuzo, Kitano is not a young man anymore, and his films will not have the edge and violence of his earlier works; this is a gentler age. There are some moments of nice film-making, with the scene where the old yakuza calculate their criminal points, sat around with a revolving camera capturing the moment in one take. But there is less of the artistry these days, with this a movie to be enjoyed rather than a film to be critiqued. <br><br>Maybe I am one of those Westerners that search for too much meaning in the films of the 'enigmatic Kitano': the Japanese TV personality or global auteur. 'Ryuzo and his Seven Henchmen' is entertaining enough, but I always found his most funny films to be those that aren't comedies. <br><br>Still, someone who hides in toilets to stick a knife up his enemies' bums is always good for a laugh...","user":"politic1983","rank":[14,21]}]