[{"title":"the subtlety and innocence of the character was completely gone.","rating":30,"date":"30 July 2015","review":"The reason I liked the first Joe Dirt a lot was because Joe Dirt was a likable and kind of an innocent character. The first movie had some crass jokes and it had some dark humor in it, but Joe Dirt was always the shinning star of the story. He felt like a real character that was just down on his luck, the humor might have been silly and gross at times but Joe Dirt was still an innocent, Naive, good person looking for his parents. That was the core of the story. A good guy that did not have the best life and wanted to find his family. What do we get here? Just a cynical version of that character.<br><br>the subtlety of the character is completely gone. This felt more like am actual mean spirited Parody of the first Joe Dirt. there was nothing deeper to this movie than just the jokes and the cameos. Say what you will about the first movie but it at least tried to have a heart underneath all the jokes. What happened to \"Life is a garden, Dig It\" what happened to that? that's my point. This movie felt like if it was written and Directed by Robbie (Kid Rock) from the first one. The same exact thing happened to the Dumb and Dumber sequel and the Vacation sequel. any kind of innocence and naiveness those characters had was replaced by foul humor. Not sure what is happening to comedy anymore. Everything is just loud and obnoxious today.","user":"reaseltbim","rank":[27,30]},{"title":"What's wrong with some of these reviewers?","rating":9,"date":"8 August 2016","review":"It's Joe Dirt 2! Whatever you're thinking it should be, you're wrong. Did you see Joe Dirt? Both are HILARIOUSLY FUNNY! I woke my wife up several times howling laughing. It's witty and funny in a intellectual way, if that makes sense. If you're not paying attention to the dialog you won't get it. You have to actually pay attention and watch and listen. <br><br>Joe Dirt and Joe Dirt 2 are comedy classics like Airplane and Naked Gun. I was 13 when I went to see Airplane at the theater. I asked for one ticket for the \"Mat Daily story.\" They had no idea what I was talking about but my friends mother was cracking up. She was the only one that got it. <br><br>I just don't understand what's wrong with most people. When Austin Powers opened in the theater I was the only one cracking up. No one else thought it was funny. Now, it's a classic. It seems a lot of people just don't know what funny is until someone tells them.<br><br>I love this mindless comedy. Maybe people think it's easy to write this, but no. It's very difficult to truly make the ultra-stupid actually funny.","user":"scribling","rank":[5,5]},{"title":"Bad,bad movie...","rating":1,"date":"18 December 2015","review":"This was a bad,bad movie... Completely awful, I don't even know where to begin. I really liked the first one, the story was cool, jokes were excellent, had that Adam Sandler humor going on. But this one - nothing. Absolutely nothing. I haven't had one laugh throughout the whole movie. They've managed to put in,at least 3 minutes long,\"farting in the face\" scene on the very beginning of the movie. And it got even worse after that!!! Farting, nuts stuck in the toilet scene, farting,dick in the popcorn scene, farting, boobs, gay jokes, boobs, farting... Such a shame what they did with this movie. You can see that even the actors don't give a damn,they don't even try to make it better. What a nasty way to take people's money! <br><br>In the end - nothing made any sense, especially why i watched it whole the way through.I just feel more stupid now!<br><br>I don't recommend it, don't watch it! Better take a two hour nap or something, it will be a time better spent!","user":"sinisachejim","rank":[10,12]}]