[{"title":"A brave, audacious and sometimes-flawed attempt that deserves to be celebrated","rating":9,"date":"15 July 2017","review":"Jagga Jasoos is many things, both good and not-so-good, but 'typical Bollywood' is a tag even the most die-hard detractors will not be able to bestow upon it. In fact, it is the opposite of that tag for the most part. It is a beautifully crafted, melodiously tuned and exquisitely shot story of Jagga that is essentially a comic book brought to life. <br><br>Watch it for director Anurag Basu's sheer audacity of attempting a film that is mounted on a scale so lavish and so large that it seems to lose its way here and there for short periods. Make no mistake, it will demand your attention, failing which you might lose track of what's going on. In return, it will reward you with breathtaking cinematography, rich music, a fantastic supporting cast and typical-of-Anurag-Basu-comic-moments. Katrina Kaif's Shruti does enough to carry off the role, but you can't help but wonder 'what-if' and think of other actresses who could have portrayed the role better. <br><br>The same can't be said of Ranbir Kapoor. His endearing Jagga has Kapoor in top form and leaves you convinced that no other current actor could have played this part. <br><br>On the whole, Jagga Jasoos is a must-watch. It is a film that deserves the large screen, and it is an attempt that, I think, will age very well. As a sometimes-flawed movie that's full of heart, I would take it any day over synthetic, formulaic 'Bollywood' fare that we are served week after week. This is a good sign of the things to come for the Hindi film industry. <br><br>9/10 for me.","user":"ashwamedh","rank":[57,71]},{"title":"Intriguing and heart-warming","rating":9,"date":"13 July 2017","review":"The film seems like one of those musicals Bollywood was waiting for so long. The director has created a dream-like environment in which Ranbir Kapoor plays a man-child with extraordinary deduction skills. The film is told mostly through songs. The cinematography will have you glide through this fairy-tale. It is a compilation of many stories that build up to make Ranbir's character. Finally all I can say is that Jagga Jasoos a journey worth taking. Enjoy this amazing flick!","user":"hasib8675","rank":[68,87]},{"title":"Witness to a historical moment in Hindi films. Best Bollywood movie for this year so far","rating":10,"date":"14 July 2017","review":"Ranbir Kapoor is the lifeline of Jagga Jasoos.He is what makes the film watchable and engages you on very level.He takes to playing jagga with such ease that you don't even think of it as an attempt to play a character. With Ranbir, Jagga jasoos wouldn't have been what it is. Bassu and RK have managed to create a fusion of perfect timing and the magic that is needed a film special.","user":"shilpashamatanwar","rank":[54,69]}]