[{"title":"Great comeback for 2D animation","rating":9,"date":"4 October 2017","review":"I know I speak for a lot of people about wishing for a 2D film to return to the big screen. None of us expected it to be My Little Pony, but don't let the title fool you. The story is a bit simplistic, but the colorful cast of characters and personalities make the adventure worthwhile. The animation really brings these qualities out and is reminiscent of classic Disney movies. The songs are also great; two of them already stuck in my head. This isn't a kids movie just for the parents to groan over. This film gives everyone of all ages something to enjoy. Give it a watch and I'm sure you'll have a great time with it.","user":"ma-43548","rank":[67,77]},{"title":"The movie didn't necessarily make me into a brony but... (possible spoilers)","rating":8,"date":"4 October 2017","review":"The movie is great and is praiseworthy. The animation is engaging to the eye, and it enables to arouse interest in going along with the characters &amp; plot.<br><br>The characters are great, such that there's a diverse disposition for each array of character. This is probably an exaggeration, once you realize in the end that Fluttershy is voiced also by the same person who voiced Pinkie Pie, and Apple Jack &amp; Rainbow Dash being voiced by one person as well. <br><br>The main character is Twilight Sparkle (consistent enough with the movie poster), and we get to explore her power as a princess, which is Power of Friendship. The antagonist is a new/guest character named Tempest (Emily Blunt), a disenfranchised pony who has become calloused and driven. If you don't care about My Little Pony at all, Tempest is the powerful character you'd like to watch. The character of Tempest however will take you on a journey to an unexpected destination, because Tempest's interaction with Twilight Sparkle becomes very important. Another antagonist, Stormking is just as important as Princess Celestia, Princess Luna and Princess Candence.<br><br>There is a cat character, Capper, who you'd soon realize is a smooth talking cat. Capper would fall into the male prototype character category in the midst of female characters, worthy of their fancy, disdain and then fancy again. <br><br>There are various absurd situations (mostly because of Pinky Pie) the characters are put into, and as a group, you are able to assess, compare and contrast the reactions of each member of the group. Again, the animation conveys the situation well, and because of its comical effect, it engages the mind into hilarity. <br><br>The movie is quite an adventurous one, and would appeal to any audience other than young girls. The plot is a rather good one, and the pacing moves along quite well. For those who have seen adventure films before, one may realize that the movie captures recognizable thrilling, and momentous stages of an adventure. Again, the coloring of each backdrop, background, is lucid &amp; vibrant, with a great use of acute hues.<br><br>The animation quality of the movie is good; it appears to be a mixture of rotoscoping, mixed with 2D hand animation (I guess by computer). The coloring is with a balanced saturation and hues.<br><br>I could digress about the movie in its trivialities, but in summary, the movie is great. I enjoy it. It didn't make me into a brony though (that's probably because I don't know what brony really is or what he does).","user":"latinvspiscator","rank":[70,84]},{"title":"Recommended for all viewers of the show","rating":8,"date":"4 October 2017","review":"First time reviewing a film . There are some bits that the pace does feel fast but the rest lives up to it's standards. the animation and visuals are amazing and gives the feel of like watching classic Disney films and the 2D works very well with the 3D. The songs are great as well and the voice acting fits very well. Highly recommended film for fans of the show and for family's and younger audience.","user":"charlottemiller-88324","rank":[53,65]}]