[{"title":"An experience you'll gonna remember forever.","rating":10,"date":"24 April 2019","review":"There is no way that I could describe my emotions for this movie. I'm totally speechless. I haven't laughed (even cried) this much in Marvel movie or even in any movie. I'm fully on my emotion, there are so many tears of joy and loss. Amazing story, the acting is outstanding, epic action, great CGI, the best storytelling ever told in a superhero movie, amazing performance. I love it more than 3000.<br><br>Happiness, sadness, pure joy, excitement... I'm gonna miss this moment in my whole life because let's face it- it's been awhile movies can bring such a big enthusiasm like this.<br><br>It is such an experience you'll gonna remember it forever. People are clapping, laughing, crying, full of a state emotion. It's 3 hours long but it went by like a finger snapping by Thanos, and now I'm thinking I'm actually in Quantum Realm because it felt like 5 seconds. Even though you know where the story is gonna bring you because it's still a 'superhero movie' but it left me speechless. It's not just a superhero movie, it's more than that.<br><br>**SPOILER ALERT**<br><br>Even some characters that you didn't like before, you will love them in this movie. Like Captain Marvel. I didn't like her before in her own movie but in Endgame they showed how powerful, how strong and how capable she really is. And now I kinda love her! But Marvel should really be careful of her line though, I didn't like some of her line like \"I'm the strongest\" and \"You didn't win because before you didn't have me\" duh. Also not gonna forget Hawkeye. To be honest, in Avengers I really didn't like Hawkeye because he's just a 'guy' with an arrow and just randomly showed up in any scene but actually he's character is so BADASS! Everything that we need, what we want is here.<br><br>Also I don't get it why some people can not accept that Thor is fat or treat him like a joke. I mean, this movie might be trying to give us a message about no matter what 'shape' are you, you can be a hero and save the world. To be honest, I like what they did to Thor, that man is depressed and taking the most responsible after he missed the shot to kill Thanos in Infinity War. Even though he already did killed him but it's not gonna bring back his people of Asgard. Also he's God of Thunder for god sake, he could slap his stomach with thunder and got his abs back.<br><br>I'm so happy too for Captain America. Finally he could do his dance with Peggy and I didn't expected that we could see the fight between Captain America with his own self. Also when Tony met his father really warm my heart, and we can see the 'real-life' Jarvis - I didn't expected that too.<br><br>When the whole superhero arrived it is so EPIC! The whole person in theater are screaming and shocked. Gives me a goosebumps and still left me speechless!<br><br>This movie is absolute perfection. The ending of this movie is we and the characters deserved. It gives a perfect balance for all these past 10 years. Epic and perfect ending, I was not disappointed at all. This movie was completely emotional and visually stunning. Now I get it why the Russo Brothers told us to do a Marvel Movie marathon before watching Endgame because this movie had everything to accomplish what left behind before all of this.<br><br>Ready or not, whatever it takes.<br><br>Go watch it for yourself.","user":"raudafitriani","rank":[4,6]},{"title":"Amazing, but the more I dwell on it the worse it becomes","rating":6,"date":"26 April 2019","review":"I have to say, my first reaction walking out of the cinema was that it was great. Probably an 8/10. You know there's so much fan service in this movie and I particularly loved the \"I can do this all day\" CA line from one CA to another. It was almost Toy Story 2, enlightened Buzz to naive Buzz banter.<br><br>I loved Clever Hulk, found Thor hilarious, though a bit annoying at times, and loved the references to past movies. Cap swinging Mjollnir around was beautiful.<br><br>The deaths in this movie were also pretty surprising but I agree with some of the more balanced reviews in here that it was bizarre that so much time was spent on Hawkeye - does anyone really care about him? Not really.<br><br>Killing off Black Widow was a surprising touch, but I, like many others, probably felt more of an emotional reaction to Banner's relationship with her and not Hawkeye (because no one actually cares about him). Renner, as an actor, just doesn't cut it much, unfortunately.<br><br>The real problem with End Game, is the time travel. I don't know why any movie franchise would ever want to deal with time travel knowing how much grief it creates. Sure they try to explain everything with their hilarious conversation about movies, but in the end, there are just too many questions left at the end of the day, particularly when they already try to explain it through the Ancient One.<br><br>The most glaring one of these is, if they change the past, they're changing another timeline, so how selfish is that? If Tony Stark snaps his fingers and kills Thanos, what happens to that original timeline? If he sent Thanos and everyone back, how does he magically know not to send Gamora back who is now stuck in 2023 - and so does that mean 2014 Quill never meets Gamora?!? What the hell? Essentially erasing the entire 2014 GOTG franchise in that universe. If Captain America goes back in time, he will inevitably change history in some way or another, so that is another timeline, right? So while everyone else's timeline is meant to stay the same in the present (as said by Stark) how does Cap end up sitting by the same lake as everyone else.<br><br>There are also way too many questions about new timelines created - but perhaps that is intentional, such as the Loki TV show. But this is why I hate it when they bring time travel into any movie and just add stuff to it to make it wrap up nicely in their own universe.<br><br>Also, don't get me started on how impossibly strong Thanos suddenly is without an infinity gauntlet? Even WITH the IG he couldn't stop Thor's Stormbringer, but now without the IG can easily defeat Thor with Stormbringer AND Mjollnir, Iron Man and Cap??? How convenient.<br><br>I also think Marvel made a serious mistake creating Captain Marvel, how is she brought in as a convenient deus ex machina and yet doesn't really stick around to show off all her abilities, and she can't even defeat Thanos single handedly? Pfft. That was rich. She can barely prevent Thanos from snapping his fingers, yet in Infinity War, Cap was able to actually hold off his hand too? Bizarre parallels.<br><br>So okay, sure, it was enjoyable to watch, but I just feel that there are too many plot inconsistencies creeping into End Game. There should have been better ways to get the infinity stones back, and I think someone stupid just thought time travel was the best way to do it,.","user":"theroo200182","rank":[2,5]},{"title":"The End of an Era!","rating":10,"date":"25 April 2019","review":"After Avengers Infinity War, we waited for the Avengers Endgame. We wondered how the story would go on, how our heroes would turn back, what would be the end of Thanos. Many theories related to this have been put forward. Avengers Endgame was undoubtedly the most anticipated film of recent years. Normally, the higher the expectation, the higher the probability of disappointment. But this is not the case for Endgame. Whatever you're expecting, you find much more in the film. This means that the biggest concern about the film has disappeared.<br><br>On the other hand, another comparison comes up. Is Endgame more successful than Infinity War? We can comfortably say it Avengers Infinity War is just the beginning of the story. Endgame was the finale of the story. So we shouldn't think of these two films as two separate stories. There is only one story divided into two parts.<br><br>Avengers Endgame is, above all, a great homage to the ten-year history of the Marvel Cinematic Universe. The story highlights the original Avengers team. Iron Man, Captain America, Thor, Hulk, Black Widow and Hawkeye are at the center of events. No character comes in front of them. Of course there are many characters that play an important role in the story outside the original Avengers team. Everyone's concern was that Captain Marvel, who was included in the Marvel world, overshadowed other heroes. We can say that this certainly did not happen. What is important in this struggle is not how strong you are, but how good you are. This comes to the fore in all areas. It gives good message about being a hero and a family.<br><br>Of course, Avengers Endgame has some critical aspects. For example, is the three-hour period necessary in terms of the story? It can be discussed. The head of the story moves much slower than the rest. It also drags the heroes into an emotional predicament. Then the tempo is rising and the heavy scenes we are watching are getting more meaningful. The last 45 minutes of the movie is fully action packed. But the last 45 minutes goes so fast that you don't even realize it. Action and battle scenes are really successful. There is not even a slight distress about visual effects. There are also slight logic errors in the film, but in general the story is so successful that these details become meaningless and insignificant after a certain point.<br><br>Lastly, Avengers Endgame doesn't have a movie end scene. Because after the film's final, there is no need for another scene. The Marvel legend Stan Lee appears with a small stage. But this is the last surprise scene in the Marvel Cinematic Universe. Moreover, there is no clue about Marvel's future. This makes us wonder more about Spider-Man: Far from Home. 10/10","user":"ahmetkozan","rank":[2,3]}]