[{"title":"Great","rating":9,"date":"23 February 2020","review":"This movie portrays a villain that by far has been the best out of all the other Marvel antagonists. It shows his personal conflicts, his purpose, as well as his cruelty. The heroes of this film are overshadowed by this, but the ending really makes a mark on the audience.","user":"MR_Heraclius","rank":[48,53]},{"title":"Way better than endgame","rating":10,"date":"2 September 2019","review":"This film is way better than endgame!\nThe actions better\nThe writings better\nThe dialogues better\nThe cgi is better\nMore shocks and more emotional.\nWatching both in the cinema , the reactions to this in cinema was unbelievable compared to endgame. Dont get me wrong endgame is good but to say its the best marvel film is jus marvel fan boys being stupid.\nI just dont see how people are saying endgame is the best marvel film when theres clearly other marvel films better than it!\nBut trust me this is the film that changed the mcu , lol maybe it because i wanted them to lose because thanos is badass!!!!!!!!!!!!!!","user":"michaelhowell12","rank":[109,150]},{"title":"Unlike anything ever done in the history of cinema","rating":10,"date":"14 August 2018","review":"This movie is the beginning of the culmination of Marvel's masterfully woven cinematic universe. Beginning back in 2008 with iron man, we are finally seeing the results of all the movies have been pointing to; and it did not disappoint. Thanos is a complex villain, with deeper and more interesting desires than just \"world domination.\" The dilemmas all the characters face in this movie (both the heroes and the villains) are truly thought provoking and leave you on the edge of your seat. No other set of movies has beeen so involved, so expanded, and encompassed so many story lines/characters and previous movies. The sheer amount of star power alone in this film is insane; and they do a masterful job of weaving all these unique and various characters into a common storyline.","user":"kjames-26542","rank":[374,577]}]