[{"title":"To the critics: Yes, we know it's not the Lego movie, thank you.","rating":7,"date":"19 August 2019","review":"If you read the reviews, you could get the impression that the main flaw of the Playmobil movie is the fact that it's not the Lego movies. Yes, thank you, we know that.<br><br>This movie does NOT try to be a clone of the Lego movies. Strangely, most reviews I have read seem to have a problem with that. The Playmobil movie is not full of meta jokes or references to other movies. The movie does not make fun of the quirks of old Playmobil sets. It's not self-aware. The characters don't know that they are toys. The fairy godmother behaves exactly like a fairy godmother; she's not behaving oddly or making sarcastic jokes. If you are expecting all those things, you are simply in the wrong movie.<br><br>The Playmobil movie is exclusively targeting children, not adolescents or adults. From this point of view, it's a solid movie. The 3D animation looks a bit outdated but it brings very well the look and feel of the Playmobil toys to the big screen. The story is okay but I think it would have been better to spend more time on the characters instead of rushing through the different sceneries. There are locations that don't contribute anything to the story (e.g. the scene with the lava and the dinosaurs on the road), while potentially interesting characters like the fairy only have a short appearance. But again, that's me as an adult overanalyzing a children movie. Children will probably enjoy to see all their favourite Playmobil themes.","user":"orsdu","rank":[59,78]},{"title":"Fun little film","rating":7,"date":"8 December 2019","review":"I find it ridiculous how many critics trashed this movie. I went into this film with very very low expectations, like Chicken Little levels. But its accually a cute film. It is no Finding Nemo, but a quick paced little story of adventure. It moves quickly and kept my kids attention. There were more moments where I thought this was really good. Jim Gaffigan did a great job. It is a musical with a lot of action. As a Dad who is a classic film buff I would watch this again and yet again the critics are aweful. Its not Lego movie, but it is harmless fun. On top of that the movie is $5 per ticket due to an experimental pricing experiment. Please do yourself a favor at this price, go see this with the family. And ignore the critics who can this but throw high numbers at whatever Disney throws up.","user":"bugs-79620","rank":[9,12]},{"title":"Better than expected","rating":7,"date":"9 August 2019","review":"Obviously you are going to compare this to the Lego movies and yes it very similar but it is still a fun film. It has a good story and the live action framing at the beginning and end of the film serves it well. in-fact the framing does point the way to a potential sequel that could flip the story round. I do have one negative thing to say, the songs do derail the film in places but fortunately the film quickly recovers so no harm done.","user":"stuartpbottomley","rank":[18,29]}]