[{"title":"Fun, intriguing film with cool vibes","rating":10,"date":"25 May 2016","review":"First off, let me say both my husband and I are big Iggy Pop fans. So when we first heard about this film months ago, we got excited for it to come out. I pre-ordered a copy on Amazon.<br><br>Fans or not, no one can say Iggy Pop didn't do a spectacular job as Bill. He was PERFECT for the part. So many times he made us chuckle. Bill was cool. Intelligent. Cunning. Sexy. <br><br>Ben Lamb, Kacey Clark, and Antonio Magro were all believable, too, playing their characters well. The heat from Kacey radiated from the screen, and the relationship between her and Bill was nuanced and enticing.Their appreciation of who each other was is something I particularly enjoyed, it made me really feel they \"got\" each other.<br><br>The movie drew us in right away, and the tension built slowly, seductively, drawing us in even further. Very noir atmosphere.<br><br>I will watch it more than a couple times. Thank you for making this film.","user":"caddyauthor","rank":[15,26]},{"title":"a cool slow burning thriller","rating":9,"date":"23 May 2016","review":"While the premise may have similarities with \"A Bigger Splash\" and take its references from \"La Piscine\", this is a very different film indeed. It takes its time to unfold but then it shifts a gear, twists and twists again and then what was a sun soaked lazy art-house drama becomes a full on menacing thriller that keeps you guessing right up till the end. Iggy is a really charismatic screen presence - beguiling, darkly witty, quite a nuanced performance... Dangerous but still sympathetic. Kacey Clarke is much more than just a sexy femme fatale and Ben Lamb pitches his performance perfectly as the spoiled brat looking for vengeance but getting further and further out of his depth. This is a movie that knows how to play around with genre expectations. A smart, slow burning thriller that draws you in and takes no prisoners.","user":"drjasonscholars","rank":[15,26]},{"title":"Awesome movie!","rating":10,"date":"27 May 2016","review":"How on earth does this movie only have two reviews (so far) on IMDb?<br><br>The casting couldn't have been better and Iggy Pop is a stand out as an old rock star. Hmmm... I wonder how that could be!<br><br>Everyone except the dopey pool boy has a plan and they unfold at a leisurely pace until the final line is spoken.<br><br>It's difficult to talk about the movie without giving the game away but I was reminded of a similar movie in both style and substance... the superb 1987 noir (yes, noir), Black Widow... and the similar movies that it spawned.<br><br>This is an 'adult' thriller... there's not much in the way of actual violence. No shouting and no infernal young people in the way. Any thinking person and fan of legato measured dramas will enjoy this.<br><br>The songs are well chosen, the photography is exquisite and there's not a second wasted.","user":"khunkrumark","rank":[16,31]}]