[{"title":"The Best Documentary about \"Black Classical Music\" and a Long-Ago New York City","rating":10,"date":"4 July 2017","review":"If you love and understand real jazz--and especially if you love the long-ago New York City that gave birth to bebop and hard bop--there is nothing out there like this film. It is also fitting that a non-American made it, given that the United States has so turned its back on its greatest artistic creation and the musicians who created it. (Just compare this film with the shameful recent American documentary about Trane--with its pandering casting of Denzel Washington as narrator and utterly stupid and irrelevant choices of people to interview (Bill Clinton? Carlos Santana? Common? Cornell West? John Densmore?). From the late-night Larry Thomas jazz radio program and New York City snowfall and that opens I Called Him Morgan(and hey, whatever happened to that snow? It seems to have disappeared along with the jazz scene),the interviews with jazz musicians of Lee Morgan's time (one of whom who objects to the term \"jazz,\" aptly preferring \"black classical music\"), and with it's beautifully paced rendering of acompelling American story of love and pain...for someone like me, who lived through all of that, it just could not have been better.","user":"kozure-okami-744-789585","rank":[25,27]},{"title":"This is not the ultimate Lee Morgan biography. But it is a very good film that tells a complete story","rating":9,"date":"2 April 2017","review":"As a long time fan of Lee Morgan, I went into this mentally prepared for a big letdown. I had wanted to get a clearer and more complete picture of his life before dying at the young age of 33. I wanted to know more about his previous wife, a Japanese American woman for whom he wrote songs and from whom he split amicably. <br><br>In the end though, what the director did was focus on the events that led to the shooting death of Mr. Morgan on a snowy night in New York City and at the hands of his on-again/off-again lover or common-law wife, depending on what perspective one takes. And as a result the film was tighter and more linear than it would have been otherwise. <br><br>Even if I hadn't been a fan of the music and of Lee Morgan in particular, I would have walked away from the movie impressed with the directorial skill (which includes interviews and editing) on display, but the fact that we manage to get so many great people on film, including Wayne Shorter, who is 83 years old, really sealed the deal for me. <br><br>As of this writing, there is only one other review up, and while I disagree with 97% of it, I agree that this ALSO could have been a very effective PBS radio broadcast or a podcast. But that does not give sufficient credit to this director who shot the material and people (and included the music and rare footage) with such a careful and appreciative eye as well as excellent cinematography. <br><br>This is the best jazz documentary I've ever seen and even if it focused on the woman who killed the star (that she previously nurtured back from addiction) it is very much worth seeing (and hearing). I highly recommend it if you have a chance to see it while it is in limited release. <br><br>Seen at Lincoln Performing Arts Center, NYC March 2017","user":"TheUserIDYouEnteredHasAlready","rank":[20,22]},{"title":"A Documentary worth seeing on the big screen","rating":30,"date":"30 April 2017","review":"I confess to not being the biggest jazz fan (not sure if I had even heard of Lee Morgan before!), but, this Documentary is one of the best movies released thus far this year. It does what a good Doc should do - bring us closer to details and insights that a dramatic presentation simply can't fully fulfill.<br><br>Director Kasper Collin doesn't merely present facts, he takes us back to the 60s and 70s (where the bulk of the story takes place) and makes us feel what those in Morgan's circle felt. Further, this isn't just a talking heads parade, Collin creates a mood and an atmosphere backed by the riveting jazz music scene of the era. There are some 'recreations', but they aren't used to 'fool' the viewer into thinking they are authentic footage, but, rather as a way of further enveloping the viewer into the story (simple shots of desolate streets, wind blowing through trees, snow falling etc.). This is truly a documentary that is meant to be experienced in a theater if possible. Even those unfamiliar with Morgan or Jazz will find something to value here. Superb.","user":"gortx","rank":[8,9]}]