[{"title":"Just go","rating":10,"date":"9 February 2017","review":"I'm not sure how anyone can criticize this movie for anything. Its 2 movies in one. The kids see Lego's with colors, action and subtle lines they understand, but children are more focused on the action and not dialogue. For adults, it is full of Innuendos that keep you laughing non stop. I literally cried from laughing so hard. <br><br>So if a movie for a family is entertaining for the kids and makes adults laugh and not look at watch to see \"when this is over\", then that's a 10. No kids here. And my fiancée was like omg, what! When you leave a movie still laughing and repeating lines....10. <br><br>Kid tested, parents will hoot!","user":"jasonthomas-93423","rank":[138,171]},{"title":"It's not just a great kids movie, it's a great Batman movie!!!","rating":9,"date":"10 February 2017","review":"This is the best theatrical film based on DC property that WB has put out in years. Sorry fans but this blew all 3 of the cinematic universe movies out of the freaking water. Just like the movie before it, the LEGO Batman movie surprises yet again with a fun piece of imaginative work. It has the humor, the action, the animation, and surprisingly again the heart. We thought to ourselves a Lego movie would never work, it sounds like the ultimate marketing sham Hollywood could ever put out to sell toys, but it became one my favorite animated films of all time why? The first movie blew me away because it not only worked as a story, but it encompassed everything a fan of Lego remembers. In a similar fashion, this movie encompassed everything you know about Batman, and I mean everything. I swear there was almost a reference to everything you remember about him, from Detective Comics all the way to Batfleck. It sounds like I'm talking about fan service because yes, it is most of the time. They use it to their advantage here, they praise and mock everything great, and everything terrible Batman has gone through over the years. You almost miss too much because they cram so many funny nod ons and jokes you wish they had spread em out a little bit. But In other words, the script is a hilarious tribute to arguably one of the greatest superheroes of all time, and surprisingly the most emotional. The focus of the film actually deals with to me a critical factor of Batman. His isolation and loneliness, his fear of becoming part of a family again. The special relationship Batman has with the Joker. It hits all the emotional beats just right with all of its themes. It utilizes it's imagination of Legos to it's potential. And it produces a fantastic message for kids, as well as a touching tribute to fans of Batman. Seriously this movie had a smile on my face except for the parts when it really hit home for me. It also makes me mad, because the film proves that WB is just sitting on a character's pile of good material to work with, and they don't know what to do with them in their real films. This movie has such a stronger emotional impact than anything the DC cinematic universe has done with its last three films. It doesn't mean DC has to sell to Disney, it doesn't mean critics are biased against DC. It just means when you get people who know the material well, they're gonna make it a great film if they know what to do with it. That's what's happening here, if WB can take notes and study why this movie really works, maybe the Justice League and Ben Affleck's Batman film will actually make a better impact? Regardless, this is the standard animated movies need to have outside of Disney, and WB really needs to bring the heart this movie has into their live action films. If you love Legos and Batman what are you waiting for?? Go now!! You don't even have to take a kid, it's a total blast for all ages, and I will definitely be seeing it again real soon.","user":"Thekeybaldemasterrises","rank":[129,172]},{"title":"A Celebration of everything Batman!","rating":10,"date":"14 February 2017","review":"It's odd that this would be the movie that takes a look back at 78 years of batman and says... yeah it's silly, LET'S CELEBRATE IT ALL!!!<br><br>I actually thought some of the characters in this movie were just a joke but nope, there really was a condiment king in the batman comics that walked around with a ketchup and mustard guns, there was a character called \"the Eraser\" that looked like a pencil!<br><br>Best of all was the most iconic villain from batman, the Joker! Just replace the word \"hate\" with \"love\" and it's a rom-com between the two with batman refusing to commit and Joker feeling like his \"hate\" was only one sided and he deserves better, Hilarious!!!<br><br>They actually reference all of batman from the silly TV show of the 60's, the bam and kapow that pop up in the comics when he hits someone, his dark night trilogy, you name it it's there... and sometimes they'd even play some footage!<br><br>If you know anything, really anything at all about batman then I'd recommend you watch this movie. age doesn't matter. The one flaw I could think of was how fast this was going with the jokes, at times I wish it would slow down because another one comes in before I was even done laughing at the previous joke.<br><br>10/10 and yay for parody not being dead!","user":"hjalsayegh","rank":[82,112]}]