[{"title":"Very similar to Finding Nemo...but a lot weirder.","rating":5,"date":"29 October 2018","review":"Maybe I'm just pairing the two movies because they're both undersea adventures, but I couldn't help but notice how it copies Nemo in a few ways.<br><br>Anyway, the movie was enjoyable enough and doesn't deserve the hate it's receiving from some. Although, they were some odd elements that I'm not sure were entirely appropriate for children, namely the blunt discussion of reproduction/mating to repopulate the oceans, as well as the sheer amount of fish &amp; human skeletons throughout. Now, it should be clear that these were just cartoonish skulls and bones and wouldn't go as far as to traumatize any children, but it was still a little morbid. Speaking of morbid, the bigger picture, outside of our fish's adventure, is that the world is in such a sorry state that humans have long left the planet itself... I mean, that's not Walking Dead level of dystopia, but it's still a little bleak for a children's movie, no? All of this wouldn't stop me from letting a child watch, but it is a little odd.<br><br>Other than that, the animation was top notch and looked pretty cool. Each character is pretty one-dimensional, but there's enough characters and creatures to give the movie the variety it needs, ranging from shrimp to whales and all in between. A visually appealing movie, no doubt.<br><br>A lot of people have been ripping into this one for not being entirely scientifically sound. This is a movie where a penguin pilots a spaceship, get a grip. This isn't one of those Pixar masterpieces that is enjoyed by parent and child alike. It's a silly kid's movies, and it serves its purpose as that. Saying that, it wasn't outstanding or anything. Funny at points, and creative sometimes too, but Deep is nothing too special.","user":"CorpusTristis","rank":[7,7]},{"title":"Factually ignorant fluff","rating":3,"date":"1 December 2017","review":"*Spoiler: 2nd Grade Science Classes are smarter* 1) Whales are not fish. They do not have gills. If you chain one up underwater.. It drowns.<br><br>2) Gravity works differently underwater. Having a runaway subway car scene is... I don't even have words<br><br>3) Many of the abilities and plot devices only appear, or disappear, for convenience. There is little more here than an ego-absorbed, ill-researched Scooby Do episode.<br><br>4) If you save all the Humans, then the Land Animals, then the Marine Life... YOU FORGOT AVIANS!!!<br><br>5) If the ice caps melt and flood the earth, then the remaining land... STOPS BEING A FROZEN WASTELAND!!<br><br>I tried this with my kids who are 3 and 1.5y/o, so no harm. However, this is a poor attempt to emulate a Pixar movie by copying tropes, clichés, and ripping off other films to slap together a \"quest\" tale.<br><br>So many things are homogenized, misrepresented then ignored to move along an episodic plot that is an OK theme for kids: \"Work as a team and use your individual gifts to save the day\".<br><br>But... (and that is the word that will come to you as an adult a lot) everything is just 'there'. Often for no conceivable reason besides a rushed draft of a kids movie.<br><br>And then the *spoiler* ending: \"Hey, we just found more of our species.. Better go repopulate NOW!!!\"","user":"knuckles29-1","rank":[18,25]},{"title":"Why would anyone do this to us?","rating":1,"date":"2 December 2017","review":"OK, I've been on this site for a long time now and never written a review. This \"film\" is so terrible that I feel this incredible urge to spew out a few words. I won't go into the scientific inaccuracies because this is a kid's movie (and other people have already done it), but literally every single second of this movie makes me want to gouge out my eyes and eardrums with a rusty spoon. I would rather watch barney on a loop for the rest of my life than spend another second with these characters. Everyone involved with this monstrosity should be blacklisted from the industry and be forced onto a registry so that decent human beings can know what damage they've done to society.","user":"anannoyingfilmgeek","rank":[21,31]}]