[{"title":"Would- be comedy riddled with the usual clichés of the genre.","rating":1,"date":"2 January 2017","review":"Wow, what a sad little mess this is. Just caught it on cable this afternoon, because I'd never heard of it and the cast seemed promising.<br><br>A story-line so clichéd with characters making stupid choices to advance the ridiculous story along. What a waste of Miss Parker and Miss Cardinale. Is it any wonder that it was never released in the U.S.? Pretty much a mistake for all involved. Raoul Bova remains a very attractive leading man. And the young girl who picks up the daughter in her pick up truck is a dead ringer both physically and vocally of the young Claudia Cardinale. Was this done as an homage deliberately? If so, a nice touch.","user":"stbartz","rank":[8,9]},{"title":"Half watch, or don't watch","rating":2,"date":"19 February 2016","review":"This is handleable to watch when you're in the mood to half-watch something. I watched it half whilst working and still followed it, without subtitles when there's odd conversations in Italian - it's that empty and predictable. I love SJP so I am really disappointed in this. Every bit was predictable, I guessed the relations, the start, middle and outcome. The soundtrack is appalling. It's actually the first thing that put me off the film. And I can't believe that I heard the girl's tattoos being described and defended, in 2016! I'm reviewing it with about 10 minutes left - and I know how it's going to end. Don't bother until it comes on TV and you're hung over or sick and worried about falling asleep in front of the box - because you won't miss anything.","user":"kerryclear","rank":[16,22]},{"title":"Poorly written with average performances! 2/10","rating":2,"date":"23 April 2016","review":"Review: I'm usually a suckered for an emotional Rom-Com but this film really wasn't that good. Sarah Jessica Parker is more annoying than funny and her daughter Summer, played by Rosie Day, just didn't have any respect for her mother or any adults whatsoever. The storyline also went from one extreme the next and I lost interest as soon as Maggie (Sarah Jessica Parker), threw her daughters iPhone out of the car window so she wouldn't receive calls from her boyfriend. When they finally reach the remote Tuscan village, were Maggie previously fell for the dashing Luca (Raoul Bova), she tries to bond with Summer but she just wants to go back to NYC to be with her boyfriend. Summer then decides to steal Luca's car and make her way back to the airport but Luca's eighty year old mother, Carmen (Claudia Cadinale) needs to get to her secret wedding, against her sons wishes, so she jumps in the car with Summer and they make there way to Rome. When Maggie realises that they have escaped in Luca's car, they take chase, to try and stop them in there tracks. That's the main concept of the story but of course, Maggie and Luca fall in love, which really wasn't that surprising, and Summer causes trouble along the way. I wasn't expecting too much from this movie because I don't really rate Parker as an actress. The script also was really poor and the silly situations that Maggie and Summer get themselves in, just became ridiculous after a while. Anyway, I wasn't a big fan of this film and I'm not surprised that it didn't go down well audiences around the world. Disappointing!<br><br>Round-Up: Sarah Jessica Parker, 51, first hit the big screen in 1984, in the hit movie Footloose and she started to make a name for herself with films like Girls Just Want To Have Fun, L.A. Story, Honeymoon in Vegas, Striking Distance, Hocus Pocus, Ed Wood, First Wives Club and Mars Attacks but it was Sex and the City that made her an household name. After two hit movies from the series and the lead in The Family Stone and Failure To Launch, she hasn't really taken on many projects. The movies that she has taken on, have been really poor and her range, in terms of acting skills, are pretty small so this movie was a disaster from the beginning. It was directed by Ella Lemhagen who has made 11 movies for the Swedish market, which haven't really been heard of. I personally think that it's going to take a very well written movie for Parker to come out of the Sex and the City bubble because her career hasn't progressed since the hit series became popular around the world.<br><br>I recommend this movie to people who are into their comedies starring Sarah Jessica Parker, Raoul Bova, Rosie Day, Paz Vega and Claudia Cardinale. 2/10","user":"leonblackwood","rank":[11,15]}]