[{"title":"A very dark film presented like a comedy","rating":5,"date":"5 September 2016","review":"This film tells four stories that involve Wiener Dogs, their owners and the people around them.<br><br>The film has nice bright sets, and the people look seemingly bubbly enough most of the time. If you look at the screenshots, you'll be forgiven for thinking it's a comedy. However, the stories are actually rather dark and disturbing. There is a child with cancer, a drug addict whose father just died, a depressed professor and a grumpy old woman. The four stores are equally good, they are touching and convey much emotions but still manage to be individually unique. The clash of the bubbly tone and dark subject matter is very interesting. Acting is great as well, especially Danny DeVito and Ellen Burstyn.","user":"Gordon-11","rank":[19,21]},{"title":"How do you write about a Todd Solondz movie?","rating":7,"date":"3 May 2016","review":"I went into this thinking it was a sequel to Welcome to the Dollhouse; I guess it technically is but it has greater concerns than letting us know what happened to Dawn and the rest of the WttD crew so adjust your expectations accordingly.<br><br>The movie is broken up into 4 parts, each part focusing on a different owner of the titular Weiner-dog.<br><br>The first part was my favorite, about a young boy struggling to understand his dog's place in the world. It is sweet and funny and I was incredibly nervous about what would become of the dog since I did not know the movie would take on a 4 chapter structure.<br><br>The second part reunites the Welcome to the Dollhouse characters Dawn and Brandon. Greta Gerwig's performance was a little strange and there were some distracting continuity issues and cutting. In fact, the entire movie had very distracting moments of editing, usually cutting back and forth from character to character for each individual line. It's very jarring, particularly because the moments without dialogue are usually portrayed in long takes.<br><br>There is an intermission, it is fantastic.<br><br>The third part is the weakest. It focuses on Dave, a screen writing professor, who is struggling to sell a script. It drags on a bit long and ends with a punchline that doesn't really have a ton of punch.<br><br>The fourth part is a bit more surreal, and feels more similar to his recent movies. It focuses on an elderly woman whose daughter comes to visit. Then takes sort of a bizarre turn in its second half.<br><br>I walked away from the movie thinking it was great but feeling terrible.<br><br>Overall, Todd Solondz continues to be one of the most interesting filmmakers out there. I feel like he's definitely making the kind of movies he wants to be making: quiet comedies reflecting our superficial, pathetic, and delirious culture packed with incredibly uncomfortable conversations and situations; I just think his previous work is more interesting.","user":"Dennue","rank":[67,94]},{"title":"Come on people, it's a dark satire, nothing more...","rating":8,"date":"27 November 2016","review":"Seems like it's too easy to offend people nowadays.<br><br>Seriously, if at least 20 users voted 1 for this movie, it is not about director, actors, story or photography. It is more about their state of mind, and some kind of emotional instability.<br><br>First of all, this is a movie which has it's own style (moreover Todd Solondz has it's own unique style), which is simple, yet requires certain movie watching experience, and sense for slight surrealism. It was never intended to be artsy, au contraire, it mocks to 'too artsy' attitude...<br><br>All characters were intentionally made like caricatures, in order to present their flaws and shortcomings in more obvious, yet funny and sarcastic way. But don't get fooled so easily, all of them reflects real behavior, which we can observe all around us: parents who make up idiotic stories instead of simply tell the truth to their kids, lonely losers with dysfunctional families, worthless but pathologically ambitious people, shameless nerdy hipsters, damien hirst wannabees and such charming creatures...<br><br>Simply, it's highly sarcastic, anti-indie, somehow childish-style comedy, which may offend only someone who perceived it as a mirror...<br><br>Ah yes, it's called \"Wiener-dog\" so everyone expected a warm dog story, and they all ended up disappointed? Then watch Disney instead.","user":"dmitttri","rank":[18,26]}]