[{"title":"\"Ordinary World\" lives up to half of it's title at any rate.","rating":6,"date":"19 October 2016","review":"I really wanted to like \"Ordinary World\". The comedy stars Green Day front-man Billie Joe Armstrong as Perry, a just turned middle-aged singer/guitarist on indefinite hiatus from his once-promising rock group. This cat is a fish flung FAR out of water as domesticated husband, father and feckless hardware store sales guy. When presented with the opportunity to celebrate his 40th birthday in grand style he does it up right in a posh New York City hotel suite, together with his ex band-mates and a pack of party animals he's heretofore never met. Natch, shenanigan's soon ensue.<br><br>While the hard driving original music Armstrong contributes is fantastic, particularly the amped-up onslaught that mule kick starts the story, the superlatives for this largely lukewarm effort pretty much start and end there.<br><br>Writer/Director Lee Kirk thrusts it completely upon Armstrong to carry his movie, as the brilliant musician performs in practically every single one of it's scenes. Now granted, Armstrong's Perry is of decidedly docile demeanor, having ostensibly fallen into the mostly uneventful life he now leads. However, he proves to be just a little TOO passive in this role. To the point where Armstrong's underplaying of his understated character never managed to amplify and fully engage me. In all candor, the same can be said of the turns turned in by the flick's supporting stable of actors, which includes a trio of highly capable pros in Selma Blair, Chris Messina and Fred Armisen.<br><br>Still, despite the earnestly honorable intentions, and in keeping with the film's title, all involved here wind up coming off as not much more than...yep...you guessed it.<br><br>Ordinary.","user":"jtncsmistad","rank":[18,20]},{"title":"Takes Way Too Long to Get Unraveled","rating":4,"date":"16 December 2016","review":"If only the first hour of this film was as good as its final twenty minutes. I felt there was a better movie in here somewhere that never really emerged, as the film got mired in awkward and flat humor, plus some plot elements that just didn't ring true.<br><br>Billie Joe Armstrong (the lead vocalist for Green Day) stars here as Perry, a former punk rocker who left the band some years before to start a family. Now he's quite a scatterbrained but decent guy going through a midlife crisis. He's having trouble, as he's ready to celebrate his 40th birthday, accepting living in his \"ordinary world\", as a husband and father of two, and mired in a job with his brother in a family owned hardware store. Thus, the film will follow Perry for one day,as he ends up spontaneously arranging a birthday party at a very fancy hotel, in NYC.<br><br>Overall, the movie, written and directed by Lee Kirk, just took way too long to get unraveled, but at least the final parts of the film prevented it from being a complete clunker, in my opinion.","user":"larrys3","rank":[7,8]},{"title":"OK movie","rating":6,"date":"7 April 2017","review":"I expected that Billie Joe Armstrong will be bad in this movie, I was wrong. He was good. He can act, not Oscar worthy, but he can act. This movie has many flaws, some major plot point are not explained at the end of the movie, it's bothering me a little bit All the acting was fine, everyone did their jobs well The soundtrack was awesome Predictable as hell Overall, OK movie. You can watch it as a Green Day fan and you will be pleased by Billie acting skills. I enjoy it, not sure I'll watch again or not but hey check it out, it's worth your time","user":"skyvessels","rank":[6,7]}]