[{"title":"Ummm...yeah","rating":6,"date":"11 April 2018","review":"Before I start this a couple of caveats.<br><br>Not the highest budget film recently. So keep expectations lowish.\nDialogue- Oh dear. Beyond cheesy into incompetence territory\nBut still- I liked it.\n \nWhy? <br><br>Atmosphere.\n \nWith what appears to be a budget based on a 12 year olds pocket money, dialogue that at times just seems like random words put together and the principal actors obviously hamming it up in parts - it kinda works. <br><br>Okay theres no Oscar nomination in the offing, but with a set that seems to consist of 1 room and 1 corridor, plus a couple of outside shots in the wood nearest the production companies HQ...it still pulls off suspension of disbelief.<br><br>Manages to convey a kind of Hellraiser/Cuthlu mythos sort of vibe despite its shortcomings. Then it pulls off the ultimate movie trick of setting you up for a sequel but still giving enough closure where you can accept the ending as is.<br><br>Dont get me wrong, its no classic. But worth your time from the very conscious uber violent creature kill scenes to the OTT ending. <br><br>AND its got Aid .Edmondson","user":"trainman269","rank":[10,11]},{"title":"Not carried away with this.","rating":2,"date":"25 September 2017","review":"Very repetitive throughout and a major let down for an ending. Don't make this your Saturday night film to watch. The killing of the zombie type creatures is repeated over and over, ad nauseum. I got fed up half way through and was hard pressed not to leave before the end, which I should have done.","user":"mbprocter","rank":[9,11]},{"title":"Don't even bother.","rating":1,"date":"27 September 2017","review":"Don't waste your time with this garbage. Just about everything that could be bad, is! The dialogue,particularly for the main scientist is laughable, in the worst possible way. The acting is appalling. The directing is worse if possible. I think this proves that in the British film industry, who you know is more important than talent. Avoid.","user":"buffalob-02399","rank":[16,23]}]