[{"title":"Nate Parker's Ambitious Debut Chained to Conventionality","rating":4,"date":"28 January 2016","review":"Freshman Director Nate Parker creates a picture that is seemingly inspired by Best Picture winners such as Braveheart, Schindlers List and 12 Years of Slave, but produces a conventionally formulaic film lacking aesthetic cohesion, pacing, and&nbsp;subtlety. <br><br>The Birth of a Nation (2016) isn't a remake or reboot of D.W. Griffith's controversial and widely regarded groundbreaking masterpiece, but is instead Nate Parker's seemingly ambitious directorial debut-- a true story revenge tale about Nate Turner, an African American slave, referred to as \"Prophet\" by his followers, who led a Slave rebellion comprised of slaves and free blacks in Virginia in 1831, approximately 33 years before the Congressional passage of the 13th amendment and abolishment of slavery in all States. After a series of religious visions and certain atmospheric conditions, Nate Turner believed he was tasked by God to begin an uprising, his goal was to awaken the attitudes of whites to the reality of the inherent brutality in slave-holding and to spread terror and alarm amongst whites-- the rebellion did not discriminate by age or sex, until it was determined that the rebellion had achieved sufficient numbers. <br><br>Turner certainly accomplished that, but one could say in vain. The rebellion left around 60 dead white's- including many defenseless women and children-- and resulted in the state executing 56 blacks suspected of having been involved in the uprising. And unfortunately in the hysteria of aroused fears and anger in the days after the revolt, white militias and mobs killed an estimated 200 blacks, many of whom had nothing to do with the rebellion.<br><br>The fear caused by Nat Turner's insurrection and the concerns raised in the emancipation debates that followed resulted in politicians and writers responding by defining slavery as a \"positive good\". Across Virginia and other southern states, state legislators passed new laws to control slaves and free blacks. They prohibited education of slaves and free blacks, restricted the rights of assembly for free blacks, withdrew their right to bear arms and voting, and required white ministers to be present at all black worship services. So one could definitely say the revolt was ultimately an utter failure. <br><br>The story about Nate Turner has been something of a passion project for Freshman director Nate Parker, who-- for all intents and purposes-- had full creative authority on this production as the writer, director, producer and lead actor. In what is the most violent slave revolt in U.S history it definitely is a story worth telling on screen, but one better told accurately; and as far as violence is concerned Parker delivers a solid account in its depiction. But Parker certainly cherry picks his character development aspects and plays down Nate Turner's religious zeal and tries to show the rebellion as a success and skips showing us the post revolt brutality instead strangely delegating that duty to the end credits. <br><br>The washed out aesthetic to the cinematography looks cheap, and is accompanied by a soaring score that oftentimes is overbearing. Despite the beautiful Georgia landscapes and a few great shots, Elliot Davis mostly delivers conventional cinematography, instead of showing the dramatic material in a visually arresting way, wasting great opportunities to be a character in and of itself. <br><br>The dialogue is a bit cheesy and unconvincing. This includes a routine sentimentalism that keeps the movie grounded in a series of conventional beats. Turner's stump speech feels especially heavy-handed.<br><br>The weakest aspect is the pacing. Unfortunately there's a conventionality to the somewhat mediocre and predictable storytelling that remains monotonous throughout. Parker plays it a bit too safe, and wastes many opportunities to build narrative momentum.<br><br>Aside from Nate Turner the characters just feel a bit thin and underdeveloped and to some extent unbelievable. Parker fails to sell us on Turner's visions. The best aspect of this film is Nate Parker's solid performance but the rest of the cast delivers unmemorable performances with most filling stock roles. <br><br>All in all the delivery of the film seems a bit too heavy handed to seriously be considered a great film. It's like The Patriot or The Alamo more than Braveheart or Schindler's list in that sense. Nate Parker takes a great story but fails to deliver a memorable picture by using conventional storytelling methods in a bid to drive home an agenda that'll launch a debate instead of delivering a masterpiece to be remembered for decades. This film could have really been something amazing had a better filmmaker (less afraid to take risks) taken the reigns.","user":"yeayea-36102","rank":[171,262]},{"title":"A disappointment","rating":5,"date":"4 October 2016","review":"I strongly disapprove of the fact that this movie has gotten a lot of IMDb thumbs-down from people who most likely haven't seen it, but just disapprove of a movie about slavery, as well as one whose director has a problematic past.<br><br>However, that's not what I'm writing about here. I DID see the film (at a film festival), and my disappointment is based on the movie itself, not politics or anything else external. \"The Birth of a Nation\" is about a very important chapter in US history, yet it sanitizes that history to a ridiculous degree. I think most non-blatant-racists can agree that an uprising amongst slaves is a thing that inherently generates empathy. Yet this movie apparently doesn't agree--it needs to sanitize the mental health of Nat Turner (who was on record as saying God directly told him what to do from an early age) as well as pretend women &amp; children weren't killed in the Turner uprising. I'm not saying these things were justifiable. What I'm saying is that they're part of a complex historical record, and shouldn't have been left out of a movie that purports to tell the \"truth.\" That would be fine if \"Birth\" were one of many Nat Turner movies out there, but it's the only one most people are likely to see.<br><br>It's also a pandering, middle-of-the-road \"inspirational\" movie, so much less complex a take on slavery than the recent \"12 Years a Slave.\" While that movie was a work of art, this is more like a TV movie in style and content. I just wasn't impressed by it. I wish somebody would make great Nat Turner movie. This isn't it. And sorry, a bad populist telling of the tale isn't better than no telling.","user":"ofumalow","rank":[115,189]},{"title":"A film that wallows in the shadow of it's story and never really escapes it.","rating":6,"date":"17 July 2016","review":"Nate Parker's stirring portrayal of Nat Turner's rebellion is a film that tries extremely hard to be something more than what it is. This is not the Oscar contender you read it to be, this is not some revelation in the vein of Roots, this is just another slavery film. Nate Parker's film sheds no new light on the brutality of slavery and does his absolute best to make sure you despise the white villains in this as anyone should as they are portrayed with much relish from the actors especially Jackie Earle Haley's menacing slave owner that serves as the main villain of the film. The problems that The Birth of a Nation has are ones that exist in it's director's overbearing ego and overwhelming goal to bring something powerful to the table. Parker succeeds haphazardly unfortunately. The Birth of a Nation tells the story of Nat Turner, a preacher turned rebellion leader as he fights racism in the south with a violent and brutal fist. The film is powerful and Jackie Earle Haley and Gabrielle Union are absolute gems in this film, with Union giving the best performance of her career and Nate Parker giving...well, a performance. The problems here lie with the film itself. The story plays like a more realistic version of Django Unchained, even lifting some inspiration from that film a little too heavily for the scenes in which the slaves are beaten and abused. However, the film also delves into the religious aspects of Turner so heavy handedly that it borders along the fine line of a parody more often than not. The other film that Parker must have had playing on his tablet while directing some scenes is Braveheart because, the last battle in particular, is riddled with countless homages to that film that border plagiarism. Between the way Parker conveys his violence and the way he immortalizes Nat Turner by making him more of a saint than he ought to be, the film gradually feels less and less genuine as the running time winds down. That was my biggest gripe with the film honestly. Nate Parker failed to convey anything human about Nat Turner outside of him witnessing the brutalization that went on around him. There is something divine in the way Parker conveys Turner and it is just too much for a film that is steeped in this much history and realism. It fails to accurately portray to rebellion as it happened. There are very few mentions of what the rebellion actually did in reality as opposed to what it did in the film. While I am not saying that Turner's Rebellion was without cause, the film dilutes the harsh realities of what Turner's Rebellion did. In a sense, I felt it was a bit disrespectful to the victims of his Rebellion both black and white. With that being said, this is a film and not a documentary, so there is some room for some creative liberties, within reason. However, this does stand as Nate Parker's first directorial effort and, for a first film, it is a damn fine effort that should lead to more work as a director. Despite this fact, it still is nowhere near enough to sustain this as a film worthy of accolades and praise. Quite frankly, there is a lot wrong with the film. The pacing is either mind-numbingly slow or so quickly cut and erratic that you can barely grasp what is going on. Also, the extreme close shots are so constant and abundant that it is just another contributing factor to it feeling very incoherent. The story is bland and has been done before and done better despite this being Nat Turner's first on-screen portrayal, the story has inspired many films that have come out in recent years such as the previously mentioned Django Unchained. The sound design, at least on the Sundance version that I saw, was very flat and felt a bit too post-production sounding. Despite all this, I can't fully write this film off. There are some truly powerful performances in the film and some well done battle sequences to enjoy but other than that, this is an average film.","user":"trublu215","rank":[103,182]}]