[{"title":"Touching, thought-provoking romance","rating":9,"date":"13 February 2017","review":"1Night is a touching, thought-provoking, coming-of-age romance. Stars Justin Chatwin (Shameless) and Anna Camp (Pitch Perfect) are completely convincing in their roles as jaded lovers trying to rekindle the passionate flame they shared in their youth. Likewise, Isabelle Fuhrman (The Orphan) and Kyle Allen (The Path) perfectly portray both the awkwardness—and tenderness—of teen love and existential angst. The film depicts a chance encounter between two distinct couples, one old, one young, and each reflects disparate aspects of being in love. The interconnected nature of the characters' stories makes for an engaging viewing experience. As their narrative arcs weave in and out of one another's, their relationships grow stronger, and their hopes, dreams, fears, and motivations become more complex and fully-realized. In that respect, the film feels like a two-in-one; the elder couple's arc plays out similarly to the cerebral and bittersweet romance Eternal Sunshine of the Spotless Mind, while the joyful (and puerile) relationship between the younger couple hearkens to the exuberant indie romance (500) Days of Summer. What's more, the ending—which I refuse to spoil here for anyone—puts M. Night Shyamalan (Sixth Sense, Split) to shame.","user":"cbornv","rank":[23,32]},{"title":"Engaging and marvelously romantic!","rating":10,"date":"13 February 2017","review":"Just in time for Valentine's Day, I came across this wonderfully charming film that presents a realistic portrayal of love that viewers can identify with. 1 Night's central characters are believable and relatable, which allows us to become invested in the story and the authentic chemistry between the two couples. The dialogue is sharp, and the ending (unlike a lot of romantic films) is truly thought provoking. Each of the four lead actors, whom normally work less dramatic roles, deliver fantastic performances, proving that they are forces to be reckoned with in Hollywood. I thought the cinematography was top-notch, and the film's use of warm lighting creates a relaxing atmosphere. 1 Night is a wonderful commentary of love, life, and personal growth, making it a choice selection for this Valentine's Day.","user":"jamescentre","rank":[12,16]},{"title":"A thoughtful romance!","rating":9,"date":"16 February 2017","review":"A film like 1 Night comes along every now and then and surprises me on how much more territory the romance genre has left to offer film goers. We live an era where moviegoers want lust, like Fifty Shades Darker. But that message is blank and meaningless. A film like 1 Night has dignity and intelligence that drives the romance of the film. Instead of skin flick, we have a smart flick. The acting is natural and honest. No kinky billionaires here. Common people are the characters and that allows the story and the audience to empathize and put themselves in the character's shoes. The film succeeds in laying all of its cards on the table to give rare, romantic sincerity to the narrative and dialogue. But there are several surprises up its sleeve that guarantee a grander mosaic and deeper message that will surely invite all to a gleefully welcomed second viewing. The message is clear: Romance never dies, it's transcendent.","user":"seanrushdrive","rank":[10,15]}]