[{"title":"Corny production and odd casting undermine what little horror it could have had.","rating":3,"date":"9 September 2015","review":"A curse occurs in a family where everyone's age looks misleadingly too young or too old. It's one of the strange things about The Chosen, the leads seem very young for their characters who are playing the uncle and mother although they're more fitting as siblings. Furthermore, the brief jump scares occasionally turn into unintentional comedy with stiff acting and awkward scenes as though these events are pranks gone wrong instead of genuine haunting.<br><br>To its credit, the setup for the premise is decent. It's a more unique twist of the usual possession plot. There's a good use of family bond here, the two leads can at least produce on-screen platonic relationships. It's definitely aimed towards the younger audience who can relate more. However, the acting isn't superb all around, thus more character it tries to introduce the more they become like strangers bumping into each other.<br><br>Any attempt at horror quickly fades. The sudden pop up of random lady or the child staring bizarrely only makes it uncomfortably odd, far from creepy. Later on it relies on cheesy CG and unconvincing practical effects that utter hamper the tension. Drama between the characters is inconsistent, the development sometimes happens too sudden or just inexplicably arbitrary.<br><br>It's a missed opportunity since there's a good foundation for horror here, but with such shoddy presentation The Chosen is devoid of any thrill.","user":"quincytheodore","rank":[21,22]},{"title":"One of the worst films of the year...","rating":2,"date":"9 September 2015","review":"Wow! Where do I begin with this mess? <br><br>Let's begin with by saying 'The Chosen' is one of the worst films I've seen all year. The acting is so bad, I had to double check to make sure this wasn't a black comedy. Kian Lawley is so wooden, he seems lost at every turn of the film, as he goes around 'marking' people after being told to by a complete stranger minutes into the film that he must sacrifice six family members. I mean, she couldn't be a complete nut job, right? Barbara Goodson is probably the worst actor/actress in the film, and if you can get through her death scene - congratulations, it only gets worse. Mykayla Sohn, although a child actress, deserves some credit, as well - she only becomes tolerable when her dialogue comes to a screeching halt. If anyone wants to remake 'Troll 2,' I'm sure she'll make a nice addition to 'Nilbog.' The random Nun that pops up once in a while is the only tolerable character in the film, but I'm fairly certain she's not really supposed to be there - more than likely a mix up in sets. There's many more bad performances to be seen here (Mykayla Sohn started talking again,) but lets move on.<br><br>The plot is also mind numbingly stupid, as this character just goes around marking people on the whim of a complete lunatic. One minute he's convinced she's crazy, and before the door closes we hear - 'Oh, well, if I wanted to mark someone...' Well, she did have an old looking book, so those people are usually legit, right? Bothered one moment by what he has to do, then seemingly enjoying it the next, he really doesn't know what the hell he's doing with his character. The entire film is a complete mess of random nonsense. You're not going to find many films worse than this in 2015.<br><br>Random Ramblings of a Madman: Now that I've seen 'The Chosen,' I'm going to have to get six people to watch it, before I'm able to move on. I'm still deciding on the ''lucky'' six.","user":"Krackoon","rank":[18,20]},{"title":"Chosen for the bargain bin.","rating":1,"date":"24 September 2015","review":"How can I put this? You know how when you go to the dentist to have root canal work done and the dentist tells you that you may experience some 'discomfort' afterward and what he really means is that you'll be in agony once the anaesthesia wears off and you'll just want to lie down in a dark room and pray for death rather than live through one more second of the pain shredding its way through your nervous system? Yeah. This movie. This movie right here is like having root canal work carried out on your soul. Forget it. Don't watch it, don't look at it, don't even bother reading the rest of this review. For real. You will find no redeeming qualities in this movie. Okay, so maybe the main guy was OK acting wise. I do have one question for the movie producers...what was with the end credits soundtrack choice? Really? You're gonna hit us with some trap rap hip hop tune that was in no way related to anything that happened in the movie and really really really didn't go with the atmosphere (or lack of) that you tried (and failed) to aim for? Nope. I'm out. NEXT!","user":"g_burns-457-890206","rank":[31,39]}]