[{"title":"Suspense n tension is missing.","rating":6,"date":"14 March 2020","review":"An American couple is murdered in Europe. The girl's father, a police investigator travels to Europe to hunt down the murderer. Other young couples in France, Germany, Denmark and Sweden have since then been killed....\nSounds like a good serial killer film but....<br><br>Started off well. Similar to A Perfect Getaway. Midway the twist became predictable n the film came close to Crimson Peak.\nThen came the lousy unrealistic ending.","user":"Fella_shibby","rank":[35,44]},{"title":"Clearly the directors and story writers did not read the book this movie was supposed to be based upon.","rating":5,"date":"3 April 2020","review":"A HUGE letdown. Almost laughably. I'd just finished James Patterson's \"The Postcard Killers\" a couple days ago before I found this movie and decided to give it a try.\nAll the names are the same, such as Jacob Kanon the 'main character' and Sylvia and Mac Rudolph 'the psychopathic art studying postcard killers', but that's about where the similarities end. I wish it were mandatory that in order for you to make a movie of a book, ALL of those involved in the casting, producing, and directing must ACTUALLY read the book. Because if you follow the script in the book, it'd be impossible to screw this movie up, because of how phenomenal the book is. With that said, all of those charged with making this movie completely SCREWED the whole thing up. Dropped the ball in every way possible. Had anyone cared to ACTUALLY READ THE BOOK, and not just taken a worthless and empty summary of it to base the movie off of, I wouldn't be writing this. So so so sad. Wish I could fire the producers but I can't so I'm leaving this note instead.","user":"mheuerma","rank":[5,5]},{"title":"Lots of filler, but little substance.","rating":7,"date":"14 March 2020","review":"This film wasn't that bad, but with very little rework, could've been much better.<br><br>The main issue was the amateur screenplay put together by the novel's author, Liza Marklund, and newb writer Andrew Stern. Had a seasoned screenwriter proofread and edited the script, this film would've been impressive.<br><br>The 104 min runtime dragged on with terribly slow pacing. This film should've had the pacing sped up and/or the writing cut down to about 85-90 mins max.<br><br>Directing by Danis Tanovic was adequate, except for the annoying fade-ins to out-of-focus dizzying shots. The cinematography was decent however, and the score quite fitting. Casting and performances were on point, particularly from Morgan.<br><br>This film isn't much of a who-done-it, as we find out underwhelmingly half way through, but more of an international chase, of which also ended as underwhelming, with a silly final scene.<br><br>Still, not as bad as the critics say it is. I still enjoyed it, and it's a generous 7/10 from me.","user":"TheTopDawgCritic","rank":[24,33]}]