[{"title":"This is an incredible film and is what true story telling is all about.","rating":10,"date":"18 January 2017","review":"The story is complex: Ray is a boy who was born into a girl's body. Craig and Matthew are his biological and emotional fathers, Frances and Dolly are his grandmother and lesbian lover, and Maggie, his long suffering Mum who tries to manage the whole family. Ray is going through the process of becoming a boy and the film follows him through part of the journey with all the pitfalls and emotions there is. The dialogue is genuine, the direction is superb, the acting is first class, even from Naomi Watts who plays Maggie, an actor I don't really like but she takes on this role competently. Elle Fanning shines out like an acting sun, eclipsing everyone around her and becoming the hinge pin that the entire story revolves around. She displays almost every single emotion a human is capable of and acts far, far beyond her 17 years. She earned £65,000 from this movie, that's a pittance for her performance, it's probably one of the 10 best I've ever seen. Don't miss this, it will stay in your memory for a long time.","user":"Boristhemoggy","rank":[54,78]},{"title":"Misses the Mark","rating":5,"date":"14 June 2017","review":"Ray (Elle Fanning) is a 16-year-old who was born as Ramona but has felt for years that he's a male inside a female body. As he tries to begin the medical transgender process, it will open up much family angst and discord. Additionally, because of his age, Ray will require the parental consent of his absentee father which will lead to more emotional upheaval and the uncovering of some hidden family secrets.<br><br>Although the film's heart may be in the right place, I thought the dialogue often came across as contrived, strident, and melodramatic, which made it a difficult watch for me. The movie does have a poignant and uplifting ending though.<br><br>All in all, although I felt for Ray, who seemed the only one who was not conflicted about what he wanted to do, the movie itself did not seem like the best of vehicles to bring transgender issues to the forefront.","user":"larrys3","rank":[12,15]},{"title":"It is a feel good movie that shows that family can overcome anything together, no matter how dysfunctional.","rating":8,"date":"21 September 2015","review":"About Ray is a fresh take on a family drama that most people can relate to in some way.<br><br>All families have their problems, and this family is no exception. They show a glimpse of what it is like to have to live in a body that you don't identify with and the complications that go with it. <br><br>It is a feel good movie that shows that family can overcome anything together, no matter how dysfunctional.<br><br>All of the lead actresses are amazing, and the set is really one of a kind.<br><br>Check it out.","user":"alyssahurst","rank":[69,113]}]