[{"title":"I enjoyed it","rating":7,"date":"4 December 2018","review":"The History Channel a while back did a documentary about the Battle of Bannockburn from a military viewpoint was excellent. I did enjoy this production, however. Anyone who has watched \"The Outlaw King\" should find this interesting. The wonderful Lynette Nusbacher was one of the experts wheeled out for this programme. She speaks so clearly and with authority. I always enjoy it when she is on a programme. It held my attention for the two hours. When you consider how small Bruce's army was compared to the English army it was a marvellous victory.<br><br>Why the previous reviewer felt he had to insult History Channel viewers as ignorant Neanderthals I don't know. Most true patriotic Scots are well aware of our history. Compare this programme to Rise of the Clans with the presenter Neil Oliver and you will truly see how superior Battle of Kings is.","user":"celtigra","rank":[3,3]},{"title":"Informative, but, jeez, talk about ridiculously made!","rating":4,"date":"11 October 2018","review":"What could've been an interesting documentary about King Robert the Bruce and Bannock Burn was utterly spoiled by cheesy CGI and frenetic editing more suited for the WWE/YouTube/fruit fly attention span-length generation. Blood-spattered-sword scene wipes every 2 seconds, blink-and-they're-gone maps of troop maneuvers, dramatic music no matter what was actually happening (not to mention terrible foley work: cantering sounds for a walking horse, out-of-sync footsteps, etc.), and other amateur filmmaking stunts ruin what could be a very informative program. Comparisons have been made to the film \"300\" but, honestly, between the two, \"300\" is practically restrained and demure. I wonder if the eminent talking heads the producers hired were embarrassed upon seeing the final product they'd joined - I know I would've been!<br><br>Of course, it doesn't help that many of the viewing audience are ignorant Neanderthals, as displayed by the comments elsewhere concerning Lynette Nusbacher, a well-respected historian and military expert who just also happens to be transgender. Oh, and she may speak like a prim school marm, but as an American in Scotland, it's unconsciously done on Lynette's part in order to tone down her broad accent and to better blend in, I'm sure. Trust me: as someone who's been there and done exactly that so as not to stand out with my braying American accent, I know how it goes.","user":"eclectic_girl77","rank":[0,5]}]