[{"title":"Like Res Dogs but worse","rating":5,"date":"27 April 2017","review":"Free Fire starts off well. Music is amazing and it gets you excited about the movie, and the dialogue works amazingly well. It's the perfect kind of dialogue. If you're an aspiring screenwriter it might make you think oh right, that's how you're supposed to do it. <br><br>The beginning may feel a bit stretched out, but when s##t hit the fan, I almost started to miss that slow, dialogue-heavy beginning of the movie. Mostly because after that, most of the movie seemed more like just shooting without any kind of actual point to it. It desperately needs something more story driven there.<br><br>The entirety reminds me of Reservoir Dogs, but like a weird, simpler version missing the charm Tarantino put in his work - apart from the dialogue of course. The set-up is good, but the story isn't close to as great as it could be. There's so much potential that seems to be wasted since it comes to the weird part where the film is mostly shooting and throwing in bits of great dialogue every here and there. It's hard to keep track of, especially when most of the characters look the same and the names are thrown in there so casually you barely remember three of them. Also the structure makes the movie feel way longer than it is. <br><br>Free Fire has potential, but it needs some better way to wrap things up, and better way to keep the audience invested in the characters. This way it's just watching and wondering who's going down next and what the hell is even happening.","user":"mistoppi","rank":[76,107]},{"title":"Free Crawling","rating":2,"date":"3 June 2017","review":"That is what they should have called this film.<br><br>Some action and a lot of crawling, like watching paint dry.<br><br>I wanted to like it but it was just too ridiculous and tedious.<br><br>No likable characters really, I wasted my time watching this and I urge you not to do the same.<br><br>Shame really, with such a great cast and a good performance it still wasn't enough to save it.","user":"tenshinhan_san","rank":[84,133]},{"title":"Slightly above average, but boring, boring, boring","rating":6,"date":"22 April 2017","review":"I have never written a review on IMDb, but I decided to because I was so annoyed while watching this movie last night after reading the featured glowing user review.<br><br>I don't need a fantastic action movie to make me happy. I just need a good movie. Drama, thriller, comedy, action, you name it: so long as it's good.<br><br>This movie is only slightly above average. It failed to make me care about any of the characters, and I'd probably need two hands to count the number of times I sat in the theater thinking to myself \"pick up the pace!\", \"Hurry up!\", \"oh, they missed AGAIN?\", and \"WHEN is something going to HAPPEN?\"<br><br>I honestly went in quite excited for a quirky, norm-defying flick based around the interactions of several characters. You have a star- studded cast: Cilian Murphy, Brie Larson, Sharlto Copley; it will be DECENT at least, right?<br><br>No. The characters have no depth. The actors play their characters well, but it doesn't feel like these are people that could actually exist. It just feels like you're looking at a drawing an artist put together of imaginary characters, who only exist on that paper. Most of the time the characters simply yell at each other from different positions in the room and then fire shots that fail to hit anything from their seemingly endless reserves of ammo. If they're gun dealers/criminals, why can't they shoot? Why do they fire with wild abandon instead of aiming?<br><br>Even the setup for the situation is illogical, which is another thing that irritated me. No one can accomplish anything unless it serves the plot. Everyone can fire bullets everywhere BUT their target, until it serves the plot. It's exasperating.<br><br>If you're a fan of movies which are paced far too slow, leave obvious logical holes in order to advance the plot, have exasperatingly stupid and drawn-out gunfights, and leave you feeling unfulfilled, irritated, and wondering why you wasted 90 minutes of your time when you could have been watching something better, this is the movie for you. If not, then avoid it.","user":"muneeb658","rank":[57,88]}]