[{"title":"Literally painful to watch it was so bad","rating":1,"date":"14 May 2016","review":"I don't normally write film reviews but feel like I owe it to potential watchers of this movie to write one. <br><br>First of all, the people that gave this movie 7/8 put of 10.. have you ever actually seen a decent horror movie?!<br><br>The acting if you can call it that was beyond terrible. Literally painful and cringey to watch. Felt like they were all auditioning for a commercial or something. <br><br>This could have been so much better had they used decent actors and a slightly bigger budget. Also did anyone notice that the movie was filmed inside a hotel?! Nothing about the movie felt genuine and I didn't expect much from the movie but didn't realize it would be this bad!<br><br>Please save yourselves the time and watch a proper horror movie instead. 'The Boy' for example is a great doll horror with a great twist.","user":"karlycarman","rank":[23,24]},{"title":"Horrendously stiff character and acting will make audience root for the evil doll","rating":2,"date":"29 August 2015","review":"It's inevitable that Robert will be compared to Chucky and Annabelle, which is probably the pitch this movie going for. Neither dolls are perfectly harrowing, but even then Robert has no right of being lined with them. The movie is strictly poorly written and acted. Characters do nothing but scream to each other, and even worse, the wife is so unsympathetically annoying she makes the movie unbearable.<br><br>You know the story already, a creepy doll talking to the kid and ruining the family. However, the worse criminal is the wife with her ear-rupturing high pitch voice. One can argue that the boy is expressionless or the husband seems detached, they are nothing compared to the terrible delivery of the wife. She literally screeches and shouts the entire movie, it's a torture beyond what the family has to deal with on-screen. It's like hearing dying animal every five minutes.<br><br>Plot doesn't go beyond the typical \"who did it\" theme and the paranoid wife. It move so horribly slow, when it hits one hour mark it only tells stuff other movies had done in half the span. The horror itself consists of poor editing worse than old stop footage movie. It feels amateurish at best and completely ruins the thrill, which barely exists in the first place.<br><br>When an inanimate object with creepy face plastered on it has better screen presence than the character, you know you're in for a terrible ride.","user":"quincytheodore","rank":[24,27]},{"title":"Waste of time and money","rating":1,"date":"27 August 2015","review":"I'm no stranger to bad scripts and stupid characters in horror films, but this film had me thinking it was written on bring your kid to work day.<br><br>The Wife is an emotional mess that will believe anything, the son shows hardly any emotion towards anything that happens, the husband is a stereotypical 'my wife is crazy but I'll play along' guy... the only character that's worth being in the film is Robert, and he's hardly in it!<br><br>Every scene had me re-evaluating what I considered a bad movie, which is a shame considering the potential it had; great graphics, a brilliant killer doll story, set in England. But alas it just wasn't to be, with the women all shown to be weak, the men being imbeciles and the doll practically not even doing anything most of the time (the film focuses on the poorly written Wife).<br><br>If you like bad movies get this one, but if you're looking for something decent to watch for whatever reason, steer clear of this film like it'll give you Bubonic Plague.","user":"smthegamer","rank":[23,27]}]