[{"title":"A Tough Film I'm Glad I Saw","rating":8,"date":"14 August 2016","review":"My mother was born in Slovakia and I grew up on stories. How beautiful her village was, of course. But stories of overwhelming ugliness, too. Munich, like Yalta, was an obscene word in our household. In 1938, long after Hitler had revealed that he was a rabid dog needing to be put down, the West surrendered Czechoslovakia to Hitler without firing one bullet. British Prime Minister Neville Chamberlain, the man with an umbrella, called the Munich agreement \"peace for our time.\" One of the many reasons so few Eastern Europeans are Anglophiles. <br><br>My mother taught me about Lidice, a Czech village that, with its inhabitants, had been wiped off the face of the earth by the Nazis. The men shot, the women and children murdered more slowly, the houses razed to the ground. In fact the Nazis wiped out hundreds of villages in Poland and Czechoslovakia. <br><br>\"Anthropoid\" is a Hollywood movie that, at long last, tells some of the war from the point of view of desperate Czechs and Slovaks fighting the Nazis. Fanboys gripe, \"How many World War II movies can you make?\" One answer: chronicling of World War II will not be complete as long as major stories like Operation Anthropoid remain untold. Reinhard Heydrich was one of the worst human beings who ever lived. He chaired the Wannsee Conference that formalized the Final Solution, the Nazi plan to murder all Jews. He was also in charge of the Czech Republic. He brutalized the population and wiped out the resistance in short order. <br><br>Heydrich was the only top Nazi to be assassinated, although there were assassination plots against others, significantly Hitler himself. People need to know that non-Jews, as well as Jews, suffered under the Nazis. People need to know of the incredible courage and heroism of forgotten heroes who fought the Nazis. The questions of an operation like Anthropoid remain open. Is it ethical, and is it militarily strategic, to assassinate one of history's worst humans if you know that thousands of innocent people will be murdered in retaliation? <br><br>\"Anthropoid\" opens with two resistance fighers, Jan Kubis a Czech (Jamie Dornan) and Jozef Gabcik, a Slovak (Cillian Murphy), being parachuted into Czechoslovakia after their training in England. They must find the tiny remnants of the surviving underground and announce their assassination plan. Resistance members Ladislav Vanek (Marcin Dorocinski) and Uncle Hajsky (Toby Jones) are not immediately enthusiastic. They recognize the risks of retaliatory mass killings. They understand that this assassination may be more of a means of bringing respect to the Czechoslovak government in exile in London under Edvard Benes. <br><br>\"Anthropoid\" is a tense, gripping, film noir-ish film. I was on the edge of my seat the entire time, and I cried at the end. For hours afterward I was haunted by the film. <br><br>It's not for nothing that Steven Spielberg chose to make a glamorous, powerful, heroic, high-living member of the Nazi party the subject of his \"Schindler's List.\" It's hard for a storyteller to tell the audience a story that has no triumphant moments, lots of death, and an ending that most filmgoers will already know. <br><br>\"Anthropoid\" consists largely of very tight shots on the faces of its two assassins as they live in Nazi-occupied Prague, trying to figure out a way to fulfill their mission. Scenes are dimly lit. Everyone is tense. There is little laughter or smiling. There is zero swaggering. There is a very brief moment toward the end that offers a hint of redemption. If you see the film, you will know what I'm talking about. The scene involves water, light, and a beautiful woman reaching out her hand. <br><br>The film does not take in the grand sweep of history. There are no shots of London headquarters, no fetishizing of squeaky Nazi boots or Hugo Boss uniforms. Lidice is mentioned in such an understated manner that filmgoers unfamiliar with it won't know what has been said. <br><br>\"Anthropoid\" offers an almost documentary look at what it is to be an assassin in a totalitarian regime. It's not fun. I was at first dubious when I heard that Cillian Murphy would be playing Jozef Gabcik. I wished for a Slovak actor. Murphy's performance is the emotional and aesthetic heart of the film. Murphy rarely allows any emotion to register on his face. He has turned himself into a killing machine. When, at a certain moment, a tear falls from his eye, that tear carries great weight. The audience knows what a courageous professional this man is.<br><br>My mother told me about Jan Kubis and Jozef Gabcik. When I have gone through tough times in my own life, I have used men like them to inspire me. How can I complain, when they went through so much worse? How can I give up, when they never did, through a six-hour shootout with Nazis who massively outgunned and outmanned them? How can I fail to take risks to fight evil, when a Slovak just like me managed to send to hell a man who seems to have emerged from its most fetid depths? \"Anthropoid\" is not a fun movie, but I'm glad I saw it. It brings me closer to the heroes it honors.","user":"Danusha_Goska","rank":[280,307]},{"title":"Fantastic","rating":10,"date":"9 August 2016","review":"Mission - To assassinate a top ranking Nazi Officer, Reinhard Heydrich. Not many films leave me feeling this much emotion.. so much so, I felt the need to write my 2nd review in around 5 years! I thought the casting was an interesting choice and Cillian Murphy and Jamie Dornan didn't disappoint but I really loved Anna Geislerova. Although most of the action is towards the end of the film, the lead up to the events gave a good insight to the characters which I find some films lack as they are too busy concentrating on special effects, rather than getting to know the characters. . I found myself holding my breath on many occasions! A truly gripping finale and I will definitely be watching this again.","user":"KALLISTUART","rank":[123,150]},{"title":"The best cinematic account of this historic event","rating":11,"date":"11 September 2016","review":"On 27 May 1942, at a tight street corner in Prague, two resistance parachutists - the Czech Jan Kubi and the Slovak Jozef Gabčík stopped an open top car carrying the Nazi leader Reinhard Heydrich with the intention of carrying out the most high profile assassination of the Second World War. The consequences - both personal and political - were enormous. Kubi and Gabčík, together with five other parachutists, eventually found refuge in an orthodox church near the city centre, but they were betrayed by one of the other parachutists and all died in the shoot-out with the SS. <br><br>My strong interest in the assassination is because it took place at the height of the wartime exploits of my Czech night fighter pilot father-in-law, so that I included a couple of paragraphs about it in my biography of him, and the church in which the assassins Kubi and Gabčík died is literally at the end of the street in which my closest Czech friends live, so that I have visited it several times.<br><br>The year after the assassination which made massive world news, Hollywood rushed out two films - \"Hangmen Also Die\" and \"Hitler's Madman\" - which gave highly fictionalised accounts of the event and its aftermath. In 1964, there was a Czech film called \"Atentát\" (released under the English title \"The Assassination\"). \"Operation: Daybreak\" - released in 1975 - was a British portrayal of events which was shot on location (in what was then communist Czechoslovakia) and gave an essentially accurate narrative with some fictionalised embellishments. <br><br>So \"Anthropoid\" (2016) - the code name for the operation - is the fifth work to bring these events to the big screen and again this is a British-inspired work shot on location (in what is now the democratic Czech Republic).<br><br>Britain's Sean Ellis is director and cinematographer as well as co-writer and he has produced an accomplished work which is even more faithful to the facts and makes even more use of original locations than \"Operation: Daybreak\". Also dialogue and acting are both better than the previous film. Cillian Murphy is particularly good as Jozef Gabčík who is shown as the leading personality (in \"Operation: Daybreak\", Jan Kubi - played this time by Jamie Dorman - was represented as leading the team). Another change is that the parachutists are shown as more human, given to bouts of doubt and fear.<br><br>The 1975 and 2016 films follow a very similar narrative arc, beginning with the jump by Kubi and Gabčík and ending with their death, so that the actual assassination attempt is the hinge for the two very different segments tonally: the tense preparation and the ferocious aftermath. However, one difference is that the target of the assassination Reinhard Heydrich - who was a major character in \"Operation\"Daybreak\" - in this latest film only appears in order to be attacked and has no dialogue at all. Also the new production opens and closes with some explanatory text that usefully underlines why this piece of history deserves to be remembered. Finally this is much more of Czech work with even greater use of Czech actors and technical talent.<br><br>Anna Geislerová - who plays Gabčík's girlfriend Lenka - is a major star in the Czech Republic. I could have done without the imaginary appearance of Lenka in the final moments but, that aside, the conclusion of \"Anthropoid\" packs a powerfully emotive punch. Indeed this is a film that lingers long in the memory and some of these memories are profoundly disturbing, but the viewer needs to be aware that even the torture scene of the young Ata Moravec actually happened.","user":"rogerdarlington","rank":[68,81]}]