[{"title":"Same circumstance, different experiences","rating":8,"date":"4 August 2015","review":"Unexpected is precisely the kind of film one well-acquainted with the mumblecore subgenre in film would expect Kris Swanberg, the wife of director/writer/producer/actor/do-it-all-man Joe Swanberg would make, and that's by no means a bad thing. Her husband has made a career making no-budget films revolving around millennials grappling with happiness, personal enrichment, existential dread, technology, sexual angst, sexual tension, and relationships, and here, in her third feature, following two decidedly smaller efforts, Unexpected tackles a story of two people going through the same tribulation/blessing and finding themselves seeing different experiences.<br><br>We focus on Samantha Abbott (Cobie Smulders), a young teacher at an underfunded public school in Chicago that will see its doors close following this school year. Samantha, being one of the only white teachers in the largely urban school, does something few of her peers seem to do, which is encourage her students to apply for college, even going as far as to sit with them individually while they apply and work out possible financial aid opportunities. One day, however, Samantha discovers she is pregnant with her boyfriend John (Anders Holm). Samantha doesn't know how this will effect her future, especially when she has John declaring she can take a year or two off of work to raise the kid while he'll float the family with his income.<br><br>However, this idea doesn't sit well with Samantha largely because she doesn't want to be a mother and have everything else come second. Yet, despite this, Samantha impulsively marries John, holding a brief service with no family, much to the dismay of her mother (Elizabeth McGovern), who feels she's going about this pregnancy in a backhanded way. Even though Samantha and John seem to be at opposing ends throughout this whole process, Samantha finds comfortable empathy and friendship in Jasmine (Gail Bean), one of her students, a high school senior, who is also pregnant by her current boyfriend. Jasmine lives with her grandmother, and while she does want to go to college, the lofty pricetag that comes with and the potential of not being there for her child are budding factors that always cross her mind.<br><br>Unexpected deals with how the same sort of circumstance can provide for different experiences depending on a variety of factors. Both Jasmine and Samantha aren't wholly far in age (she's about eighteen, she's maybe in her early-thirties), but their racial divide is clearly present, especially when considering colleges to apply to and having to work around Jasmine's tumultuous homelife in order to make college a reality. If nothing else, Swanberg effectively shows us the idea that every kid should go to college isn't a bad idea, in theory, but in practice, without taking into account different financial and stability situations, is a very messy ordeal.<br><br>Swanberg keeps the pregnancy jokes down to a minimum, pleasantly so; only one scene involving Cheetos and pickle-juice will evoke some form of nauseousness, while the remainder of the film is helmed by strong conversations between Samantha and Jasmine, or Samantha and John, as we see one relationship brew and a marriage that should've never been slowly divulge into arguments. This is also, somewhat unsurprisingly so, a story of trying to find your personal identity amidst a change that will potentially make your life come second to the life of a child. The recurring theme in many of these newer independent films is trying to find some comfort in one's self, and Unexpected shows that by having Samantha's boyfriend trying to dictate what she will do and how she will live her life following a baby. She doesn't want the next ten years already laid out before her and she definitely doesn't want them meticulously mapped out by someone who isn't her.<br><br>At Unexpected's core are its performances and dialog, and Smulders proves that's she's more than a background character in Agents of S.H.I.E.L.D., in addition to Bean, who has serious acting talent, with an ability to be emotional without being too obvious in her feelings. This is a film that really shows how something widely regarded as a blessing can be a setback or a difficult thing to manage, in addition to being a circumstance that prompts many different experiences depending on you, your social class, and your race. It's a uniformly solid film about very few people have probably seen taken with such a reserved tenderness despite being such a hot topic of discussion.<br><br>Starring: Cobie Smulders, Gail Bean, Anders Holm, and Elizabeth McGovern. Directed by: Kris Swanberg.","user":"StevePulaski","rank":[9,13]},{"title":"Good, but a few questions","rating":7,"date":"28 March 2016","review":"I won't recap the plot, since other reviewers have done this in fine detail. This is a gentle story about two pregnant women--one an adult with a career and a stable future, the other a teenager with no certainty--who bond over pregnancy. It works hard to avoid the \"rescuing white lady\" cliché, and find another narrative, and that was a strength of the movie, and also a weakness.<br><br>The filmmaker explores a mother's need to nurture the baby against the desire for a life and identity of her own. She also explores the lost opportunities that pregnancy brings to both women.<br><br>However, I was less satisfied with her conclusions. Coming down on the side of the stay-at-home mom was too pat. Of course many women want to stay with their babies, and if given the choice would be there for the early months at least (although not all women feel this way).<br><br>At one point the two women have an argument with one asking the other, \"Would you leave your baby?\", ignoring the fact that almost all working women around the world, and certainly single mothers, do just that. That's especially true if they want or need to earn well. I think it must be easier to romanticize this if you work in a flexible profession like the arts.<br><br>In the case of Jasmine specifically, the choices the filmmaker has her make are choices that doom her and her baby to a significantly limited future. In the case of Samantha, although she did miss her chance at a dream job, one missed chance for a well educated, young, upper middle class woman won't seal her fate. <br><br>The movie's message is that Jasmine shouldn't sacrifice time with her baby, and having an extended family will make it all OK in the end. Yet an earlier scene shows that her family can't get through the month on the food stamps they have. Raising a child is expensive. Giving him/her a good future and education is even more so.<br><br>Sacrifice is sometimes necessary to improve life for the next generation. In this case maybe it means Jasmine leaving the baby with family for a time while she pursues her education and a better future for them all.","user":"jjmcgee-25086","rank":[2,2]},{"title":"Razor Sharp Dialogue in This Feel-Good Flick","rating":9,"date":"22 October 2015","review":"I'm surprised at the 5.5 rating for this film, as I found it to be filled with razor sharp dialogue that rang true to life, laced with humor but also raised some serious social issues, mainly the conflict families face with a newborn when they don't have long term maternity leave available.<br><br>The most talented actress Cobie Smulders is excellent here as Samantha, a high school science teacher, in Chicago, who's working for a school scheduled to close at the end of the semester. She's been in a long term relationship with John (Anders Holm), when she unexpectedly discovers she's pregnant. They decide to quickly marry at the local courthouse, and you can see they have indeed a loving relationship.<br><br>At the same time, one of Samantha's senior students, Jasmine, superbly portrayed by Gail Bean (an actress to watch in the future), finds out she's pregnant as well. This will subsequently bring Samantha and Jasmine closer together, and Samantha will try to help her student apply for college and hopefully build a more solid future.<br><br>Initially, I thought things in the movie were perhaps too sugary sweet, but as it progressed there were conflicts that arose, and it all came down to a most poignant ending, in my opinion.<br><br>All in all, I found this to be an exceptional indie, filled with most solid performances, good direction from Kris Swanberg, who also wrote the true-to-life script with Megan Mercier. It also raised some important social issues as well, without being too preachy.","user":"larrys3","rank":[3,4]}]