[{"title":"What's behind door number one?","rating":4,"date":"5 August 2016","review":"\"Darling\" follows an out-of-touch young woman who gets a job house sitting in a large New York mansion that is reputed to be haunted—that's about all I can say without ruining the rest of the film, as it really is that paper-thinly plotted.<br><br>Writer/director Mickey Keating seems to be a serious film student, as the movie is entirely based on Polanski's \"Repulsion,\" and has shades of \"The Shining\" and \"Diabolique\" worn on its shoulder at all times. This is perhaps the most frustrating thing about it—the fact that it lacks its own identity.<br><br>The film is nicely shot and has some great closeups which are accentuated by the black-and-white cinematography, and the setting has an off-kilter, claustrophobic vibe that is more or less effective; I did, however, find the flashy jump-cuts and strobe effects to be overwrought. Lauren Ashley Carter plays the lead of the picture, and even looks like Catherine Deneuve; her performance is solid, while Brian Morvant plays a male counterpart who takes on a vital role in the proceedings. The film has a downbeat ending at its 76 minute running time, but it's a conclusion that seems apparent from the opening scene.<br><br>Overall, \"Darling,\" though a technically well-made film, lacks bite because it seems too preoccupied with paying homage. A meatier film could have gotten away with this, but the narrative here is far too basic and skeletal to offset a cache of cross-references. The result is stylistically effective, but unfortunately rather dull in all other areas. 4/10.","user":"drownnnsoda","rank":[19,25]},{"title":"Excellent Indie Horror","rating":8,"date":"6 April 2016","review":"I just saw this and liked it very much. The film starts slowly by design, and misdirects you into thinking this will be innocent young girl vs. ghost of devil worshipping former owner, but takes an unexpected turn i doubt anyone will see coming.<br><br>The camera is always on the lead actress, often in serious closeup, which must have been a challenge for her but she eats up the camera. Lovely black and white photography, sharp direction, great creepy old mansion location.<br><br>Like the best low or micro budget films puts bloated un-scary Hollywood products to shame. Two severed thumbs up!","user":"targosfan1","rank":[33,50]},{"title":"Disappointing","rating":3,"date":"1 March 2017","review":"Right off the bat, Mickey Keating's latest film Darling shows real promise. For starters, it is visually stunning: the lighting, set design and black and white cinematography (while imitative) are truly impressive. His shot compositions of New York City even rivals Woody Allen's famous, yet overrated opening of \"Manhattan. It's undeniable that Keating and company know their craft pretty well, and that has to be applauded. However, the overall end product is lacking in many crucial areas for me, particularly its narrative trajectory and plot, which borrow heavily (I use that word kindly) from early Polanski's \"Apartment Trilogy\",among other films in the \"female losing grip on reality\" (i.e. Carnival of Souls) subgenre. Obviously, anybody who has been schooled in these films can clearly see that Keating's effort is really just a modern, pimped-out mashup, but with a pretentious, student film-like execution that lacks a unique vision or a genuine exploration into the pathology of its lead character. In other words, Darling looks great but gives audiences very little to process.<br><br>I could have forgiven the film's plagiaristic nature if it had something authentic, unique, or timely to say about its hinted-at themes of isolation, female sexual repression, mental illness, urban alienation, or anything for that matter -but it doesn't. The film is an exercise in style and, well, literally nothing else. I am not convinced Keating has any idea who his main character is, or truly even cares; she is merely a prop (admittedly a very lovely one). Instead of giving audiences any type of backstory, Keating relies on the exhausted but fertile \"descent into madness\" premise- borrowing heavily from films similar to 1980s The Shining in its exploration of the murky area between mental and metaphysical chaos.<br><br>However, here this foundation is really just used as a lazy device to demonstrate Keating's technical virtuosity while allowing him to exercise his giddiness over the entire filmmaking process. In the end, the filmmaker's ego ultimately compromises the integrity of the film, rendering it a hollow shell devoid of meaningful content.<br><br>In addition to its shallow and derivative vibe, Keating's film is hampered by a flat and unconvincing portrayal of Darling herself, played by the purportedly budding indie \"darling\" Lauren Ashley Carter. Without beating around the bush, I can only say that Carter's performance simply belies any credibility or resonance and comes across as wooden, self-aware, and curiously arrogant. I couldn't help but imagine her trying to stay in character, while making a valiant attempt to adhere to Keating's rigid physical instructions, with a \"step-by-step\" dutifulness (literally, it seemed like she was walking an invisible tightrope the whole time). Watching her, I got the sense that Keating was directing her based on shot construction and lighting schemes rather than character development/arc or story advancement.<br><br>After watching Keating's film I was compelled to go back and reflect on specific scenes from the films that clearly inspired it. Remembering Catherine Deneuve in \"Repulsion\", Candace Hilligoss in \"Carnival of Souls\", or more recently, Angela Betis in 2002's underrated \"May\"- I couldn't deny the undeniably stark contrast between the craft and depth behind those memorable performances and Carter's here. It became clearer to me that there is so little subtlety, nuance, or honesty in Carter's performance or Keating's film as a whole. Alas, Darling lacks the particular combination of rawness, originality, and vision that made its progenitors so enduringly effective.<br><br>Instead, what we are left with is a series of random shots and jarring noises that are devoid of context or purpose. It's really too bad because as mentioned earlier, Darling is a visual feast; and given a more original script, clarity of purpose, and engaging lead, it might have been something truly inspired and influential in its own right.","user":"whineycracker2000","rank":[16,22]}]