[{"title":"Has its moments but not enough for me.","rating":5,"date":"1 May 2016","review":"I am a huge fan of Key and Peele. Their show was my whole existence and I still go around doing the \"I said biiiitch\" skit everywhere I go. So with this, I was expecting a good bit of laughs to come of 'Keanu' but I was left a little disappointed. 'Keanu' was not a total fail, it had its moments, in my opinion, but to me it felt like an overly drawn out K&amp;P skit on their show. Mostly a third season skit at that. Key and Peele themselves were naturally hilarious as usual. Their deliverance is perfect it was just the material was beaten to death to me. Overall, not terrible but not great. Just an average comedy from excellent comedians.... The cat was cute though.","user":"Oberrated","rank":[34,43]},{"title":"Hilarious take on traditional action/comedy.","rating":7,"date":"22 April 2016","review":"Key and Peele have established themselves with their show as two of the leaders of small screen comedy. Their brand of comedy pokes fun at stereotypes and generic film tropes, with heavy influences from the cinema world. Their skits are often cinematic and ridiculous, but in the best kinds of way. Now, they carry that over to an actual movie and the results are often times hilarious. While not always successful, when they are, Keanu is laugh out loud funny. With huge influences from traditional cinema, ranging from romantic comedy to 80's action, Keanu covers a range of genres, providing that same ridiculous kind of comedy fans are used to.<br><br>The film kicks off with a bang, delivering a stylish opening action scene that introduces us to the titular Keanu, a cute-beyond-words kitten that you immediately fall in love with. We're then introduced to our dynamic duo, Rell, a man-child lacking direction in his life who has recently lost his girlfriend, and Clarence, the straight arrow of the two who is happily married, but is so caught up in trying to please everyone else, he never takes time for himself. Once Keanu enters the picture, the two find themselves spiraling downward into a world of gang warfare, crime, and mistaken identity, all in pursuit of retrieving the adorable little Keanu.<br><br>If you've seen Key &amp; Peele, the humor here will feel familiar. Working under the show's director, Peter Atencio, and with Peele in the writer's seat, all have a firm grasp of how to craft cinema and then skewer it. Both characters constantly feel out of place while at the same time handling themselves well, and much of the comedy comes from both the familiar fish out of water story and some surprises. What helps is that the film never really feels forced. Our heroes never feel too unnatural in their actions, though it is slightly mystifying that they are continuously believed to be tougher than they actually are. The action is well done too, with it feeling like it wouldn't be out of place in an action movie. And Keanu replacing what would be a person in distress makes for a hilarious spoof on traditional damsel- in-distress type tropes. Our villains also fare well, with one particular hilarious scene seeing Clarence bond with other gangsters over George Michael music. <br><br>As stated above, not every joke works, with several falling flat or getting little more than a chuckle, but more often than not the movie knows when to end a joke or just what to do to surprise or make the audience laugh. It also helps to know movies well to catch several of the references or tropes. Where the film could have made many missteps, it makes wise decisions in terms of balancing comedy, action, and drama and knows when it's comedy may be going too far and for too long. I often wondered if Key and Peele would take their comedy to the film world, as they have always clearly loved movies, and now that they've finally done so, they have delivered. Not a perfect comedy, but a very funny one and shows that the two have promise for a future in the cinema world. It's my hope that Keanu is just the beginning for these two.","user":"cadillac20","rank":[80,117]},{"title":"Thin and Over-Stretched, This Concept Doesn't Have the Legs for Feature-Length","rating":4,"date":"28 July 2016","review":"Key and Peele, in their first starring vehicle, play a pair of soft suburban dudes who somehow find themselves acting like thuggish, grizzled killers to retrieve a stolen kitten (the titular Keanu). It's a terrible screenplay, but at least the laughs are there for the first act. After that, it falls into endless re-hashes, basically telling the same two or three jokes against a different backdrop for the length of the picture. I loved these guys on TV, but Keanu doesn't do a great job of highlighting their versatility and eventually goes beyond satire to become exactly the type of movie they're lampooning. Would've made a hilarious five-minute fake trailer on the small screen, which may shine a light on the type of growing pains to expect if they continue this transition to feature-length material.","user":"drqshadow-reviews","rank":[26,37]}]