[{"title":"interesting young actress in bad movie","rating":4,"date":"10 January 2016","review":"Telulah Farrow (Kiernan Shipka) needs to make a movie trailer for her film class so that she can get into film school. She is obsessed with pop star Alex of the band 'All Time Low'. She needs to make the trailer with perpetual senior Darvan to enter a film festival. She has a crush on Charlie and talks in a British accent in front of him.<br><br>Kiernan Shipka is an interesting young actress. It's too bad that young stars often get stuck in horrible movies. This is one of those times. It tries so hard to be super hip and wacky fun. Most of it don't work. Kiernan is a charming performer. Meg Ryan is the mother trying too hard. Scott Adsit plays the funny film teacher. I'm sure he got Tina Fey to take the pictures. The writing is so awkward at times that any accidental funny moments seem out of place. It's a weird movie that goes all over the place. I think some experienced rewrites and a better director would figure out how to make a good comedy out of this. This seems slapped together by recent film school graduates.","user":"SnoopyStyle","rank":[6,7]},{"title":"Kiernan Shipka is confident in a leading role, but it's just an All Time Low promo.","rating":6,"date":"16 July 2015","review":"Here's the thing about Fan Girl – it's great if you like the band All Time Low rather than if you like its appealing cast. That is to say, if you don't know who All Time Low are or you aren't a fan of modern pop punk, it's going to be struggle to get into it. I've heard of the group but I hadn't really heard their music, I generally find the genre inoffensive so I could go with the film's flow. Admittedly it should have definitely invented a band instead of recruiting one. It too often ends up being the Alex Gaskarth – aka frontman of the band – worship show rather than the Kiernan Shipka hour.<br><br>She stars as Telulah Farrow, a high school sophomore who adores All Time Low and filmmaking. A birthday video she makes for Gaskarth goes viral but she's in the midst of stressing over a project she's behind on for film class. So she utilizes her passion for the band to complete her assignment. I do love how her motivation is that she wants to impress Tina Fey, a judge for the film festival she'll be entered in. I'm on board with that. But I'm disappointed to report that she does not make appearance, not until a series of stills in the end credits. Don't forget, this is an All Time Low promo.<br><br>It feels like there's a race to be the iconic teen movie of the 2010s, desperately updating the subgenre for the social network generation with nothing landing yet. Since John Hughes' heyday, it's been pretty barren besides Mean Girls, Juno and Easy A, if you only dig in the PG-13 barrel rather than the onslaught of sex comedies. Naturally, Fan Girl is crammed full of references to Facebook, Instagram, Twitter, Tumblr and so on – calling instagram pictures 'instees' without ever explaining it to those out of the loop. The film's plot revolves entirely around how popular you can be online and where that can take you in life. Time will tell whether this makes these films instantly dated or a fresh snapshot of an era. It at least boasts contemporary fashion with its array of costumes.<br><br>That's pretty much all Fan Girl has to offer for originality – that being in the grand scheme of teen movies. It's unfortunate that it relies on such obvious humour. For example, the school announcer reads out: \"the debate club meeting is cancelled because they couldn't decide where to meet.\" Hilarious if you've never heard the joke before. It has few charming moments, but it can be nauseatingly forced, such as Talulah's fake British accent she puts on whenever she's around her crush, as well as a Ron Slater-junior who's nicknamed 'Hashtag.' Just as it wins me over, it finds a special way to grate me. At the very least, it's an attractively shot film, even if it struggles to blend its styles including DSLR video and concert style footage.<br><br>Of course, the film's greatest strength is Kiernan Shipka. While she always efficiently fit in with the low-key pompousness of Mad Men, she absolutely shines here in a leading role that feels comfortable in her skin. It is her commitment to the film that makes Fan Girl worthwhile. It's the first time seeing Kara Hayward since Moonrise Kingdom and she too seems delighted to be out of the 1960s. They make a great pair. Meg Ryan also appears as her out-of-touch mother, but is only given tried and tested punchlines as she catches onto today's technology. Scott Adsit is the highlight of the familiar faces as the overenthusiastic film teacher. Maybe watch it for these guys, but otherwise it's skippable. Fan Girl's very narrow niche will surely connect to it more than anyone.<br><br>6/10<br><br>Read more @ The Awards Circuit (http://www.awardscircuit.com/)","user":"Sergeant_Tibbs","rank":[6,7]},{"title":"Confusing plot that makes you question if everyone involved in the film was high.","rating":2,"date":"8 June 2016","review":"This train-wreck of a film stars young (stupid name) Telulah Farrow, a 15 year old girl who is obsessed with the rock band All Time Low (a very irrelevant band in 2016). The only thing Telulah loves more than All Time Low is film making. She loves film making so much that she can't seem to finish a really important assignment for film class that she had tons of time to do. Even though Telulah won't do her schoolwork she is very proud of a 20 second video she made saying happy birthday to the lead singer of ATL Alex Gaskarth, and it got tons of likes on social media so she equates this to actual talent. <br><br>Enter the token black kid Darvan. Darvan is the only black person in the whole school, who for some reason has repeated his senior year a few times. Darvan's role in this movie is to repeat Telulah Farrow's name about a thousand times and drive a limousine occasionally. Anyway Darvan helps Telulah by turning in her stupid fan video for her film assignment and her teacher accepts it with the promise that she will finish her senior project, which is a movie based off her last assignment that Tina Fey will be judging even though she isn't in the movie. <br><br>That is basically where the plot ends the rest of the movie is Telula running around accomplishing nothing such as getting a spray tan because some girl she doesn't like calls her pale, breaking into All Time Low's hotel room and then stealing clothes to wear, and talking in a British accent to her crush for no apparent reason. Her mom, played by Meg Ryan, spends her time taking nude selfies and hooking up with married men even though she is also married, I think, they never really make it clear. <br><br>The school is also obsessed with some online fashion vlogger. She barely adds anything to the overall plot, and goes on a date with the lead singer of ATL Alex Gaskarth even though he is 28 and she is 15. Someone call Chris Hansen.<br><br>Overall this movie has a non existent plot that goes nowhere and everywhere at the same time. Has incredibly vapid odd paced dialogue, and is basically a weird mash-up of a thousand half baked ideas. Do yourself a favor and just don't watch it.","user":"crawfordk87","rank":[4,5]}]