[{"title":"Excellent Start but did not carry all the way!!!","rating":5,"date":"22 May 2016","review":"I was a bit hesitant to watch this one but my GF insisted and hence the review. I was quite surprised with the initial plot which was a bit mysterious and had a touch of fantasy to it. The acting was great and I was really enjoying it but half way through the movie they just threw everything away.<br><br>The plot just gets weird around the last quarter of the movie and seemed like either the director was in a rush to wrap everything up and go home or one of the actors wanted to quit early or something. It just felt incomplete, leaving you with tons of questions and a poker face wondering what just happened .....","user":"soulreava","rank":[52,58]},{"title":"Good until the end...","rating":4,"date":"8 April 2017","review":"I was more than intrigued by this take on Sleeping Beauty, and it showed a lot of promise. It wasn't fancy or big budget, and the acting had some not-so-great moments, but I still highly enjoyed it. Until the end. It doesn't end, it just stops. It sets up for a sequel, but you can do that without having such an unsatisfying ending. And if no sequel is planned that makes it even worse. There is no resolution, no conclusion...it just stops. And leaves you angry. I liked it otherwise, but I just can't get past the end.","user":"reneeharper-64605","rank":[22,25]},{"title":"it tries it's best but...","rating":4,"date":"8 April 2016","review":"The film starts pretty good. The atmosphere is very early set, characters are introduced, and they all do a pretty good and convincing job - albeit with the occasional cliché (but you can overlook that).<br><br>The problem of the main character is revealed about one third into the movie, and then the solution starts. But, I don't know what exactly happened, perhaps they lost all their money, but in no time and for no good reason it just ends. there is no build up, no explanation given, it just ends. half of the introduced mysteries of the movie are not explained.<br><br>so you leave the cinema with a film that wasn't finished, and as such, only a 4/10","user":"ravviann","rank":[35,46]}]