[{"title":"philosophy teacher survives loss and abandonment","rating":8,"date":"7 December 2016","review":"The Donovan song's tension between seeking an impossible purity and living a deep peace establishes the film's central theme and heroine Isabel's primary virtue. She lives a live of immediate, accepting presence. She won't be tempted by shallow rewards or depressed by disappointments. She embodies the strength and resilience of the examined life. <br><br>As the Rousseau quote declares, desire is the enemy of happiness. Our failed satisfactions are based upon the desire for something new — which, once achieved, no longer satisfies. <br><br>Isabel has lived through the political temptations of her time, from her flirtation with communism through the '68 revolution. So she's not tempted by the current students' strike for pensions or her star ex-student Fabien's anarchism. In contrast, her husband stays stuck in the attitudes he held at 18 and has the rigidity and insensitivity to tyrannize his students. <br><br>Isabel finds real value and fulfilment in teaching philosophy to her high school students, training them to think for themselves and taking an interest in their lives. She has a stoic response to her publishers' initial insistence on jazzing up her textbooks, then suspending their publication altogether. Her integrity won't allow her to abandon her values. She has the dignity and self-respect to accept their abandonment with aplomb. <br><br>That also sustains her through her husband's abandonment for a younger woman. As briskly as Isabel cuts loose from him she ends her connection to his family's country home where they vacationed every summer and where she planned and cultivated her garden. In all their scenes together she conducts herself with strength and an absolute rejection of self-pity. <br><br>This self-sufficiency supports her when she visits Fabien's mountain retreat and when her fragile yet demanding mother dies. A scene with an importunate stranger at a cinema shows her refusal to seek carnal reaffirmation. Her grandson's birth shows her instead embracing the role of grandmother, fully and warmly. <br><br>In the last scene Isabel hosts a Christmas dinner with her children. To let her daughter eat, Isabel goes to tend to the crying baby, stilling him with yet another song. With the family dinner framed out of the shot on the left and Isabel and the infant framed out on the right, the shot focuses on the shelves of books between them. <br><br>The film is about the use of those books, i.e., the traditional function of philosophy — detached from the fashions of the day in pedagogy or politics — to address the one essential question: How should we live our life? <br><br>Aptly, the last song is \"Unchained Melody,\" which turns an exultation in freedom into a love song. The Schubert song and the Woody Guthrie ballad both provide imagery of transcending the mundane reality by discovering the ethereal around it. <br><br>The other characters live to pursue new pleasures, which inevitably fail to satisfy them. The husband's new woman has left him alone for Christmas, apparently not yet ready to introduce him to her family. Fabien and his German friends debate the political uses of anonymity or the collective authorship (i.e., the death of the author or the personal, a recently fashionable fiction). <br><br>Isabel's daughter has wanted a baby but at the tension between her parents dissolves into tears and needs to hold him again. As if he will give her the stability she lost through her father's infidelity. The preacher similarly cites Isabel's career as a philosophy teacher to be the proper justification for her mother's life of pain, isolation and abandonment. <br><br>And then there is Pandora. This is the obese, willful, all-black cat that Isabel inherits from her mother, is allergic to and impatient with, and finally leaves at Fabien's retreat. Far from the traditional Pandora, who unleashed the world's evil winds, this one is a minor key replay of Isabel's themes. Pampered by Isabel's mother, Pandora hides from whoever else enters her mistress's flat. She's heavy to carry, like the unwanted burdens we all have periodically thrust upon us. But like Isabel she has a feral intelligence and instinct. This house cat takes off into the forest but has the instincts to survive and find her way home in the morning, bringing her new mistress back a dead mouse. In her instinctual survival and her integrity the cat is another reflection of our wise, warm and worldly philosopher. <br><br>The film is titled L'Avenir, \"the future.\" Written and directed by a woman, it offers a real rarity: a heroine of intellect, will and strength. That's a refreshing new kind of superhero.","user":"maurice_yacowar","rank":[41,51]},{"title":"A realistic and affecting slice of a woman's life","rating":7,"date":"4 February 2017","review":"I read some reviews wondering about the point of the movie: I think asking for the point is simply insignificant when watching a movie like this. It depicts a portion of a mature woman's life, a philosophy teacher and an intellectually brilliant editor, having to come to terms with loss, abandonment and conscious aging. One would say: nothing new, nothing original, or interesting. On the contrary, I found the picture deeply affecting, in the apparently placid but still very focused and deep way it portray this normal life. It reflects so realistically the natural and typical feminine facing of things as they come, that it gets intrinsically authentic and involving. As usual, Isabelle Huppert does not only interpret but lives her character and is the real pillar of strength of the picture. If you love unpretentious but simply authentic women's stories you'll like this movie, and you won't have to ask where the point is.","user":"yris2002","rank":[18,22]},{"title":"Life goes on","rating":8,"date":"2 February 2017","review":"Until this movie I never quite got the hype for Mia Hansen-Løve. Her slice-of-life, semi- autobiographical movies seemed forgettable to me. Maybe Hansen-Løve is growing as an artist, or maybe it's just Huppert. Whatever it is, Things to Come, is a movie that's stuck in my mind, a beautiful portrait of a woman whose life is upended just as she is entering the final third of her life. <br><br>The great French actress Isabelle Huppert plays Nathalie (based on Hansen-Løve's own mother). A successful philosophy professor with two grown children, a fellow philosopher for a husband, and an ailing mother, she is comfortably settled in her life. But as the movie continues on we watch as the things that Nathalie considered so much a part of her, change, dissolve, disintegrate. <br><br>I'll admit it, I was actually initially reluctant to watch the movie because the idea of seeing a woman having everything taken away from her seemed almost too sad to bear. And yet Things to Come is a surprisingly joyful movie. Nathalie isn't an automaton, she cries as the things she once counted on as part of her life are no more, but at the same time she picks herself up, dusts herself off and goes on.","user":"ReganRebecca","rank":[21,28]}]