[{"title":"Lestranger than fiction","rating":4,"date":"10 December 2018","review":"I'd really love to tell you about the plot. I really would! But I would struggle to pull all the multitude of strands together from J.K. Rowling's story and coherently explain them to anyone. If Rowling had put ten thousand monkeys (not a million - it's no bloody Shakespeare) into a room with typewriters and locked the door I wouldn't be surprised.<br><br>Let me try at a high level..... The arch-criminal wizard Grindelwald (Johnny Depp) is being tortured in 'Trump Tower', but manages to escape and flees to Paris in pursuit of a mysterious circus performer called Credence (Ezra Miller) and his bewitched companion Nagini (nudge, nudge, wink, wink) played fetchingly by Claudia Kim. Someone needs to stop him, and all eyes are on Albus Dumbledore (Jude Law). But he is unable to do so, since he and Grindelwald are \"closer than brothers\" (nudge, nudge, wink, wink). So a reluctant and UK-grounded Newt Scamander (Eddie Redmayne) is smuggled into the danger zone... which suits him just fine since his love Tina (Katherine Waterston) is working for the ministry there, and the couple are currently estranged due to a (topical) bout of 'Fake News'.<br><br>Throw in a potential love triangle between Newt, his brother Theseus (Callum Turner) and old Hogwart's schoolmate Leta Lestrange (Zoë Kravitz) and about a half dozen other sub-plots and you have... well... a complete muggle - - sorry - - muddle.<br><br>Above all, I really can't explain the crux of the plot. A venerable diarrhoea of exposition in a crypt, during an inexplicably quiet fifteen minutes (given 'im-who-can-be-named is next door with about a thousand other people!) left me completely bewildered. A bizarre event at sea (no spoilers) would seem to make absolutely NO SENSE when considered with another reveal at the end of the film. I thought I must have clearly missed something... or I'd just not been intelligent enough to process the information.... or.... it was actually completely bonkers! Actually, I think it's the latter: in desperation I went on a fan site that tried to explain the plot. While it was explained there, the explanation aligned with what I thought had happened: but it made no mention of the ridiculousness of the random coincidence involved!<br><br>The film's a mess. Which is a shame since everyone involved tries really hard. Depp oozes evil very effectively (he proves that nicely on arriving in Paris, and doubles-down about 5 minutes later: #veryverydark). Redmayne replays his Newt-act effectively but once again (and I see I made the same comments in my \"Fantastic Beasts\" review) his character mumbles again so much that many of his lines are unintelligible.<br><br>I also complained last time that the excellent actress Katherine Waterston was criminally underused as the tentative love interest Tina. this trend unfortunately continues unabated in this film.... you'll struggle afterwards to write down what she actually did in this film.<br><br>Jacob (Dan Fogler) and Queenie (Alison Sudol, looking for all the world in some scenes like Rachel Weisz) reprise their roles in a sub-plot that goes nowhere in particular.<br><br>Of the newcomers, Jude Law as Dumbledore is a class-act but has very little screen time: hopefully he will get more to do next time around. Zoë Kravitz impresses as Leta.<br><br>As you would expect from a David Yates / David Heyman Potter collaboration, the product design, costume design and special effects are all excellent. Some scenes are truly impressive - an 'explosion' in a Parisian garret is particularly spectacular. But special effects alone do not a great film make. Many reviews I've seen complain that this was a 'filler' film... a set-up film for the rest of the series. And I can understand that view. If you analyse the film overall, virtually NOTHING of importance actually happens: it's like the \"Order of the Phoenix\" of the prequels.<br><br>I dragged myself along to see this one because \"I thought I should\". The third in the series will really need to sparkle to make me want to see it. If J.K. Rowling were to take me advice (she won't - she NEVER returns my calls!) then she would sculpt the story-arc but leave the screenwriting to someone better. The blame for this one, I'm afraid, lies at Rowling's door alone.","user":"bob-the-movie-man","rank":[471,543]},{"title":"Stunning movie, but where was the plot..?","rating":6,"date":"14 November 2018","review":"Let me start off by saying that I am a big Harry Potter fan; I loved all 8 HP movies, and really liked the 1st installment of Newt's adventures as well.\nThis movie just didn't really do the trick for me. There was absolutely nothing to complain about visually; the movie was even more stunning than the first one, with even more beautifully designed 'Beasts'. And as many other people have mentioned, as a Harry Potter fan, you just can't hate this movie. Where Fantastic Beasts and Where to Find Them only contained a handful amount of references to the Harry Potter series, The Crimes of Grindelwald has tonnes. Enough to hype up any Harry Potter fan.<br><br>The problem this movie had for me was its plot, or rather, its almost nonexisting plot. This movie just seemed to serve as background information or something for the upcoming movies in this series (for which we'll undoubtedly have to wait another 2 years or more..), more of like a setup for things to come. It introduced many new characters and revealed certain things about already known characters. But yet, some of these things just felt unnatural, as if JK Rowling just kept writing more and more to squeeze into 1 movie. This basically leads to a movie where the biggest plot is to find Credence's 'true identity' - not really much of a plot at all. Some of the reveals about characters also seemed a bit strange, but that could be just me. All in all, all this dialogue about characters made it extra confusing to know what the movie was about, in addition to it lacking much of a plot to begin with.<br><br>This movie is definitely not a waste of money or anything, you could just buy a ticket for the stunning scenes and you'd be satisfied. It's just that this movie was quite a disappointment compared to many people's expectations I think, seeing as it basically is just a setup for the upcoming movies, which lacks a good plot.","user":"Tom0610","rank":[1,1]},{"title":"More focused on franchise building than telling a good story!","rating":4,"date":"15 November 2018","review":"As both a lover of the Harry Potter Universe and a lover of movie going, I was thoroughly disappointed, even angry with this movie. While the visuals are as magical as ever, it's clear that the filmmakers are so distracted by trying to build a franchise that they're forgetting to actually tell a good story! The chemistry between our main four heroes was diluted by so many new characters being introduced. With so many new people and also so many questions for our old heroes, there wasn't enough time for any kind of (explainable) character development or for the viewers to connect with anyone on the screen. The only \"character development\" with one of our main heroes felt random and out of character and we aren't given much reason or warning for this change. I was also very disappointed with the writing behind Tina's character as her role was demoted from a strong willed Auror and woman to merely a side kick and love interest. Huge and important elements of the story were left for us only to assume what had happened when discussing the one year time jump between the two films (like the Jacob/Queenie relationship, Jacobs memory, etc.). As a whole, the film screamed \"money hungry\" and \"franchise building\" rather than letting us really connect with the characters. It also seemed as if they were only adding in twists that would surely get a reaction from viewers despite the fact that they not only discredited the original Harry Potter films, but just felt like unrealistic and a little too convenient! In short, as a huge fan of the Harry Potter Universe, I was disappointed, upset and felt really let down, and as a film goer, I was confused with the plot and frustrated with the lack of character connection and development! The only reason I have given a 4/10 instead of a 1 is for Eddie Redmayne's perfect execution of the shy, socially awkward but loveable and charming Newt Scamander and for the alluring performance from Jude Law's Dumbledore who leaves us wanting to know more of his history! But in the end, it was a huge disappointment as a stand-alone movie.","user":"maiajay13","rank":[1,1]}]