[{"title":"Just not worth the time","rating":3,"date":"9 October 2019","review":"The movie is reasonably well made but it falls well short of being a good movie. It's basically a relationship drama about an aging woman who practices polyamory meaning she pursues multiple sexual relationships concurrently and ensuring each relationship stays superficial enough to avoid strings being attached. It sounds interesting enough in theory but the reality disappoints because, mainly the characters are not compelling enough to make the viewer really care. Date one man or date 10, sorry I just can't be bothered to concern myself. It might be different if the female lead was someone I might like to date. But she's just an older lady without much really going for her. She's not unattractive per se, but I just don't see any sizzle and I think most men would agree. I can't say much for the other characters either. If you just wanted something on to waste some time, this could work. But if you're expecting more, just pass on this.","user":"franklindf","rank":[22,22]},{"title":"No substance; no interest","rating":2,"date":"6 July 2018","review":"A sad story about friends in love, but who can't admit it. The story had huge holes and lacked the details to flush out interest in this story. The acting wasn't too bad, but the script was so weak, I couldn't force myself to stay engaged.","user":"fam-32854","rank":[29,30]},{"title":"It didn't hang together for me. It might for you, but don't expect too much.","rating":3,"date":"10 June 2018","review":"Gosh! Who on earth scores this so highly??<br><br>It's an interesting concept - a serial mistress wanting no commitments - but it's cliched, a bit predictable and the plot develops through 'logical argument' rather than character drives.<br><br>Ok, one at a time...<br><br>Cliched - ok, we'll give it the Rom cliche - girl meets boy, girl loses boy - girl may or may not get boy back (so as to avoid any spoilers) - but she works in a bookshop - or ows it or part owns it, it's not clear - and one of her best friends also works there (or owns it) and is gay. Ring any bells? All the meetings she has are in swanky restaurants or hotels. That defines a type of Chic Lit fiction which perhaps this is.<br><br>A bit predictable. After the initial intro you know where it's heading. As is often the case with RomComs (altho this is a RomDrama) but there were plenty of opportunities to step off the path a bit.<br><br>Plot development. Ok, this is the worst thing and it appears in many, many American series. It's where the author wants a relationship to change and they do it by constructing a 'logical' (or sometimes not so logical) argument between the characters. Probably not the first example, but I became increasingly aware of the technique in The Arrow series and then it seemed to pop up everywhere. There's a lot of talking in the movie, and a lot of these arguments.<br><br>Other than that... :-) <br><br>Well, I love Jane Seymour but she's no spring chicken. In fact she's 66 and she's playing a 40-something. I hope to god she's not supposed to be a 30-something. Hey, maybe she's a 50-something. That would make more sense but I feel the character is def in her 40s. Having said that she looks terrific and very foxy!<br><br>Parker Stevenson is a year younger but he looks his age so we have a 40-something with a 60-something. Nothing wrong with that particularly but he's also dating a definitie 30-ish woman. Like it or not, such age differences do matter and do need to be discussed in a relationship but it's not mentioned here when so many other things are.<br><br>Anyway, the movie didn't quite hang together for me. Nor for most of the reviewers, so who's giving it these high score?<br><br>It might work for you, but don't expect too much.","user":"iantrader","rank":[28,29]}]