[{"title":"Tough to say what's wrong with this one, but somehow it did not feel smooth","rating":4,"date":"15 November 2018","review":"Here we have \"Elliot the Littlest Reindeer\", a new Canadian English-language movie at 1.5 hours and the most recent and second filmmaking effort by director Jennifer Westcott, also a writer here. If you take a look atg the cast here you will find some famous names, voice acting castg that is of course, such as Baccarin, Hutcherson and Cleese. Family holiday films sure attract big name actors too i suppose. You could say that this is the story of a little pony who wants to be a reindeer on Santa's sleigh very basically. So we got a zero-to-hero story line basically and the film is about all the obstacles the pony is facing on his road to said goal, which he eventually achieves as if this was never in doubt. There are several character who may get in the pony's way to this achievement and you can never be quite sure who the main antagonist is: the vain pompous other reindeer? the bizarre woman (why was she voiced most amateurishly by a male in the german dub)? the older elf? the grumpy female elf? Watch for yourself. But I can say a negative thing about pretty much all of these. For example, said woman did not fin in the film at all, she was there early on described as so evil and at the very end when we had bascially forgotten about her. The specacular green battle sequence about said other elf at the very end was strange too. i think it was supposed to be one of the film's visual highlights, but it felt extremely shallow. Same can be said about the brief moment when they rushed in a conflict between the pony and his goat friend because he seemingly grew too close to the reindeer and forgot who he can count on. But yeah, this was forgotten about again immediately for whatever reason, so no idea why it was even included in the first place. Same about the competition parts about who was gonna become the next reindeer for the sleigh. Looks-wise the characters are okay I think, the settings and landscapes could have been better. I did like the goat bff to be honest, she was somewhat funny. There is also a very awkward situational comedy I liked at times, such as the very first scene with the female human speaking about the effects of her interview. I had nice hopes for the film the way it began, but they got disappointed pretty quickly unfortunately. There are just too many negative aspects, like the main antagonist's real motivation for something he pursued over decades apparently or the very much for-the-sake-of-it story line about the two humans because seemingly they really wanted to show us at least the tendencies of a romantic story line and they could not do it in the world of animals. And maybe, as a final conclusion the worst of it all is that the film really did not get me in the spirit of Christmas at all and for a film with this background, it is definitely a negative deal breaker in my opinion. So yeah, I like animation, but this is nowhere near the best of the year. Gotta give these 90 minutes a thumbs-down and my suggestion is to skip the film.","user":"Horst_In_Translation","rank":[10,14]},{"title":"Simple graphics","rating":5,"date":"13 December 2018","review":"Interesting story, but graphics are not up to ppar and years beyond disneys.\nTOO much dialogue in the movie, children will not understand","user":"dino_flores","rank":[7,10]},{"title":"Not worth the watch","rating":3,"date":"24 December 2019","review":"The characters are incredibly annoying. My four year old nephew asked why we were watching it about 15 minutes in. It was so terrible even he didn't like it and he'll watch anything animated. Except this. Hazel is exceptionally annoying.","user":"lonetraveler86","rank":[2,2]}]