[{"title":"Tedious Annoying Movie","rating":2,"date":"31 August 2017","review":"I'm not sure what the point of this movie was? Are we supposed to side with the hippie druids? If so then it failed miserably.<br><br>Firstly the squatters, does anyone actually think they should have any rights? Apart from other squatters of course. Despite things later on revealed they are still trespassers and hence get no sympathy from the audience.<br><br>The main posh Brit is a douche-bag, no denying that but that doesn't excuse some tree worshiping nutters killing and maiming people.<br><br>It sadly paints every character as unlikable, the hippies coming off the worst.<br><br>The voice of the Crow character is so annoying I was already hating the movie before anything happened. Which is another point...nothing really happens throughout the film, it is mainly just nonsense voice-overs (what a waste of talent!)<br><br>The acting in itself is fine but with such irritating characters they didn't have much to work with.<br><br>All in all there is nothing to like in this film and I was rooting more for the main guy, despite the film desperately trying to paint him as the bad guy.","user":"Lost_Highway","rank":[17,27]},{"title":"Slow, lecturing, over serious, too much narrator and repetitive at that.","rating":24,"date":"24 August 2018","review":"So where is the movie, the entertainment, the horror, the story? This is boring and empty.","user":"braddy4","rank":[8,12]},{"title":"More irritates and bores rather than horrifies and scares","rating":3,"date":"3 May 2019","review":"There is not an awful lot to add to what has already been said by the previous negative reviews, but will offer my two cents anyway. Did not watch 'Crow' intending to hate it or with initial prejudice, actually wanted to like it as it did sound somewhat interesting, even if not exactly original. Personally do not mind if something is not original, as long as it engages me and has enough to allow me to keep watching. As well as not having anything that distracts or annoys.<br><br>'Crow' however completely fails in the former and has a lot of the latter. It had an interesting cast, do like Terrence Stamp in other things for example, but it is completely uninteresting elsewhere. Will do some elaborating later on in the review, but there are irritating elements such as characters not worth rooting for, and one hates the way they behave and over-used narration, and the pace never rises above flat. While not having anywhere near enough horror to horrify and lacking in surprises and suspense to scare.<br><br>It is not a completely irredeemable film. The cast do okay with what they behave, especially Tom Rhys Harries trying his utmost hardest to make the titular character menacing and vulnerable but needed much better material to work with.<br><br>Visuals generally are reasonably good, with some nice photography that evokes an eeriness.<br><br>Unfortunately, a lot brings 'Crow' down. The script is far too sedate, too literal and stagy, with scenes feeling like melodramatic monologues but excessively drawn-out and self-indulgent almost. The narration features too much, is often not needed and in this aspect the film really could have done with more show and less tell. None of the characters engage and none of them are worth rooting for, Tucker is far too over-the-top as a character and it is like watching a cartoon. The way they behave too induces a lot of face palming, just silly and sometimes illogical. A big problem too other than the dialogue and the lack of real horror is the out of place and excessive lecturing, which certainly gets its point across but beats the viewer around the head with it.<br><br>Enough of talking about the things that annoyed me, and talk about why the horror didn't work. One of the biggest issues is that 'Crow' had too much emphasis on the drama, which failed because it frustrated and felt like overwrought melodrama, and the horror is nearly neglected. Another big issue is the pace, which is flat as can be and is far too slow as a result of overlong scenes and too much talk. When the horror did feature, it never shocked me and had such a been-there-done-that feel to it with its complete lack of surprises. There is no tension and even less suspense, with build ups being far too obvious, the special effects being jarringly poor, the scares being too few and repetitive and there never is a sense of threat, again because the dramatic aspects get in the way as does the lecturing. The music is so unmemorable that it nearly got forgotten about writing the review. 'Crow' takes itself far too seriously and actually would not have minded a little humour and levity to break things up a little.<br><br>Overall, interesting cast and idea, uninteresting execution. 3/10","user":"TheLittleSongbird","rank":[4,5]}]