[{"title":"A boring mess of an action flick","rating":2,"date":"22 September 2017","review":"There is precisely one action scene in the movie which happens in the first 15 minutes after that it's boring exposition, Lazy Acting, and a few scenes that should qualify as action scenes but they're so dull and boring since you don't care about the characters and barely anything exciting happens anyways.<br><br>Jk Simmons performance is the only redeeming quality that nonetheless still does not save this shitty movie.<br><br>Don't watch it unless you want to get bored.","user":"febhanli","rank":[70,105]},{"title":"More like $300 Rusty Metals, One Lousy Mission","rating":3,"date":"1 September 2017","review":"The premise started off mediocre, somehow reminding you of The Expendables series. The audience would probably think of it as a rip-off to the movie as it has that similar environment with its freakin' huge tank smashing through walls and smearing dirt over the roads while the S.A.S (Rival) trying to put a stop to it and arrest them for their own sake. The scene here did not fortify anything for the sake of the plot except on showing the team they were reckless enough on a very confidential mission.<br><br>As part of that, most of the actions scenes, well probably all of them that were shown in the official trailer were seen only in that first 20 minutes of the film. The second and third act did not maintain its action-heroic sequences that we thought it's going to take place on that before the screening started.<br><br>The dialogues were kind cheesy, saying words and the quite bland witty one-liners that merely gave us a smile or a sudden chuckle.<br><br>The cinematography was corny. For one, the color effect did not live up to its standard expectation as for us who are living in a world surrounding with techs. The coloring style was dull that added the clichéd-ness of the entire film. <br><br>Sullivan Stapleton did a good job with his acting but not as great as he was previously in the five seasons of Strike Back. J.K. Simmons also put some hope for the film to lighten its mood but the rest of the casts seem to be against the notion.<br><br>As the film went on until the final climax scene, we were expecting probably an action scene to wrap the movie nicely but surprisingly, none of the mentioned scene was provided unless if you call a dozen of grenades being anchored into the deep water and a 20-second featuring soldiers firing guns an action scene then.. hell yeah.<br><br>Not a great movie to be made in 2017. It should have been done 10 years earlier as audience would appreciate this popcorn flick film. 30/100","user":"tomholland2016","rank":[52,88]},{"title":"this film is an insult to intelligence..","rating":12,"date":"12 January 2018","review":"Completely predictable, Navy seal team are the strongest, no one can stop them. They avoided every bullet, which is impossible in reality but only possible in American cinematography ;)","user":"plavielf","rank":[44,74]}]