[{"title":"The first half proves why Neeraj Pandey is one of the Best Directors in the country.","rating":9,"date":"29 September 2016","review":"\"Absolutely magnificent, Dhoni,finishes off in-style, A magnificent stroke into the crowd! India lift the world cup, After 28 years , The party started in the dressing room. and, Its an Indian captain who's been absolutely magnificent in the night of the final.\" Pretty much one of the best moments of the movie. Massive goosebumps. Ms Dhoni The Untold Story - Is a fantastically made movie which is like two sides of the same coin. The first half which shows why Neeraj Pandey is one of the best directors in the country. While the second half shows why Neeraj Pandey should never make a love story. The movie's main strength is clearly Sushant Singh Rajput who shines in every scene. He has captured the essence of the calm and composed Dhoni and portrayed it brilliantly. The first of the movie is stunning, brilliantly acted, poor special effects with some great dialogues and excellent direction by Neeraj Pandey. The cricketing aspect of Dhoni is so well done. It shows that there is always a team behind a person who is successful. An ode to friendship, struggles, responsibility, compromise and facing life regardless of the unexpected turns and twists. I was in awe how well connected the movie was. Moving from one point to another so effortlessly. Neeraj Pandey's best hour in cinema. The second half starts of well but the two love stories really bring down the movie. The Actresses are likable and all. WTF Neeraj Pandey but the movie moved at a steady pace nevertheless. It was like living the past. The famous India-Pakistan series where Dhoni shines. A lot of moments. It was like a Pleasant flashback. The performances in the movie are brilliant. Sushant Singh Rajput as Dhoni. What a performance! Not his best, I feel Kai Po Che was better. He was seamless, cool, composed, confident. Just like MSD. He breaks down in one scene. Which was brilliant. The Supporting Star Cast is brilliant.Every Actor in the supporting role. FANTASTIC!!! They are a lot of them. Everyone was brilliant. The actresses were strictly average. The music was decent. The movie is a solid 8-8.5/10. The love angles and the bad special effects in the first half are the only things which could have been improved. You'll love it if you loved cricket. You'll like it if you love good cinema.","user":"kamran_3012","rank":[52,73]},{"title":"An Indisputable Effort By Sushant Singh Rajput","rating":9,"date":"30 September 2016","review":"MS DHONI : THE UNTOLD STORY! AN INDISPUTABLE EFFORT BY SUSHANT SINGH RAJPUT<br><br>From the beginning of the movie every one must have understood that their hearts gonna stop for a few moments! And they have not been wrong. I'm not highlighting the plot in detail as I'm pretty much interested not to unfold the story line as many of you will go to watch it.<br><br>Let me talk about the best parts. First of all, Sushant's tremendous acting and dedication deserve a big thumbs up. Next Anupam Kher and Rajesh Sharma rightly have adjusted themselves to their spots. Herry Tangri (Yuvi) excellently has scaled himself with his character. Kiara Advani (Sakshi), Disha Patani(Priyanka) have given their best too. Well, now I must talk about the cinematography, here Santosh Thundiyil has done a brilliant job. Especially Dhoni's train capturing scene leaving his job and Dhoni's coming out of the dressing room scene during the World Cup (2011) Final help a lot to excel this film. Undoubtedly fantastic cinematography it has. As a director Neeraj Pandey is of course successful but somewhere it has lacked a bit of his special touch. Though it doesn't matter because you will not find a single moment that can make you bore. The story has real gravity and it successfully has followed the tag line i.e \"The man you know... The journey you don't\". Truly it has focused on his journey- his struggle, ups and downs etc. The dialogues are very inspiring and heart-touching at many places. It is around 190mins' movie. You may think it's quite long but trust me after watching it you'll think if it could be of 5 hours that would have been perfect.... Even the Dhoni-haters can't deny that.. Actually there's so much to tell about. Anyway, let's come to the background sound... Truly effective though at some points it could have been better. Except that the editing has been done quite well but truly it's the place where it has lacked a bit. At few points it seems to be less glued... sudden turn of the movements and emotions is visible. And another important part is the story line which is of course very good but few interesting points it has actually missed. It would have been much more better if there's a bit more details about few facts like Wicket Keeping, Yuvi, Dressing Room situation after the WC2011 Final. But still it's fine as I have said earlier that it has focused more on Dhoni as a man.. especially his journey... Otherwise it is actually excellent... Or better to say super-excellent! And oh yes casting is just amazing.<br><br>So finally I would like to conclude like this. If you wish to watch it don't wait for the review just go for it. One thing I can assure you that you will not regret for a moment. But you may regret if you don't watch it or watch it by downloading from internet. If possible for you to spend some money please try that to give your respect to the hard works done by the cast and crew. I don't feel like giving marks to this movie as it may look disrespecting but taking it as a work of art I'm giving 9/10. Please don't listen to someone else if you feel like going then go...!!<br><br>P.S - I respect you, Sushant Singh Rajput... Your career is going to get a big hike after this. 'Excellent' is just a word for you.<br><br>Caution - You may find yourself in out-of-air-condition while the last scene happens, in spite of knowing the upcoming. ;) :)<br><br>N.B- If a second part of it comes out, I'll not be surprised. There are lot more facts deserve to get unfolded.","user":"itzzjoy","rank":[27,37]},{"title":"A magnificent movie of a Legend who is Magnum opus and an actor who portrays this Magnum opus on screen with an electrifying performance.","rating":10,"date":"30 September 2016","review":"I am a dhoni fan but this movie is beyond fans of dhoni or fans of cricket... For general audience this will be a movie that's not just a treat but also a complete package... Coming back to fans of cricket! This is India.. And we like to idolise legends... The very fact that we can see the demi-gods we worship on a 100mm screen is surreal. There are moments were the theatre here in Chennai goes berserk.. The kind of reception the demi- gods of Tamil cinema get! I completely had the feeling of a thalaivar movie ... Each aspect of dhoni's life brilliantly portrayed in a way respectable to the man and to his colleagues.The way the movie teaches us that hard work can only pave way to success is taken . congratulations to the whole team... It was an experience which cannot be worded in a 1000 words limit given by IMDb. For a movie to have an explosive climax the middle order is the setup point... That's y the director chose to pace the love scenes just around the interval and then the last scene where the earth shattering response is still being felt by me after 12 hours... A dedication to a Legend... The Demi God I shall say!","user":"anirudhgamer-53637","rank":[22,33]}]