[{"title":"Criminally underrated","rating":9,"date":"26 February 2018","review":"I'm floored by the poor reception this movie got. It's a loving throwback to horror classics with modern polish, clearly influenced by HP Lovecraft and body horror classics like Hellraiser and The Thing. If you like \"classic\" horror - i.e., horror before CGI and jump scares replaced practical effects and slow dread - you owe it to yourself to watch this movie.<br><br>It does drag a little bit at the end, but the opening and middle are fantastic. I would have given this movie a 10/10 if the denouement had been done more efficiently. But honestly, it's very watchable right up to the credits.<br><br>This movie has some of the best damn body horror I have EVER seen, period. I don't know how much of it was accomplished by practical effects, but it does seem like a lot. The acting is mostly good, and the pacing, while slower than most modern horror movies, is brisk enough that I didn't get bored. <br><br>I really wish horror movies like this were still getting made.","user":"seanpatrick-36000","rank":[101,114]},{"title":"Hell Hasn't Been This Much Fun In Ages","rating":7,"date":"9 April 2017","review":"First off, I've seen some negative reviews on here that have truly surprised me. After growing up as a fan of Horror during that wonderful 80's period, I can honestly say The Void felt as comfortable as it does uncomfortable, especially if you're a fan of those movies of that time. Yes there are some very strong Clive Barker influences running throughout the movie (both Hellraiser and Nightbreed for example), but I think that's what kept me hooked throughout. That with a dash of Lovecraftian themed fantasy here and there really gave this movie a lot of (albeit dark) charm. I think the last time I saw something this twisted was probably the Turkish movie 'Baskin', with which it shares a lot of similarities, but The Void tends to push the boundaries a bit further, The landscape and atmosphere are nightmarish, imaginative, and gleefully sinister and foreboding. If they set out to create a true vision of hell then I can safely say that they've achieved that goal and then some.<br><br>Its only true flaw is probably some moments of shoddy dialogue but they by no means break the movie. I can think of a lot of top box office Horror's that have far worse dialogue in fact.<br><br>One of the things that I found most pleasing was the return to practical effects, so if you're a fan of movies like Carpenter's 'The Thing' then you're in for a real treat here. I think I only saw one moment of CGI in the entire picture, which was extremely refreshing. Nothing kills horror like bad CGI ('Mama', I'm looking at you) but its obvious from the get go that this is a movie made by people who respect the genre, and want to bring it back to its roots.<br><br>Ignore the negative reviews. If you're a true fan of the genre then I'm sure you'll find a lot to love about this movie. Its one hell of a trip, literally!","user":"SmartGun","rank":[176,221]},{"title":"Love 80s horror? watch this","rating":8,"date":"27 April 2017","review":"I am shocked, seen too many \"80s feel\" horror, or so called, which are either poorly filmed or the acting is painful.<br><br>Just heard about this and thought \"oh not another\" but happy to say this is very good, its not going to win any Oscars for acting, the script is not Shakespeare, but what it try's to do it does well.<br><br>The practical effects for the most part are great, The Thing/Hellraiser type, on a very low budget.<br><br>Story is in realm of Hellraiser/Phantasm/Event Horizon, seen those? you will get my drift.<br><br>Its ending does leave questions, but also left me wanting to know more, and I would happily watch a second film if they stick to this way of making them, maybe a bit more money spent but keep away from CGI.<br><br>Overall I am impressed, they should be applauded for going old school and doing it well.","user":"prodigychild2008","rank":[87,106]}]