[{"title":"Wrong Turn, England","rating":8,"date":"11 April 2019","review":"Jack and Gill get lost camping. Don't get too attached to them, they are just there to introduce a family of cannibals who live in a remote home. They call Cupid Carpet to place a new rug in the living room. It appears Tasha (Zara Phythian) is going to be the final girl. Once the crew gets there, game on.<br><br>Now I am not sure why you would call someone to your home to eat them unless you want to get caught. But ignoring that, it was your typical British humor horror-comedy, which I happen to enjoy. The only thing that would have been better is if the cannibals were played by the Monty Python gang. Laura Jean Marsh was priceless.<br><br>Guide: F-word. No sex or nudity. Blood and gore, but not what one might expect from the title.","user":"nogodnomasters","rank":[5,5]},{"title":"Carpet fitting is dirty work, but someone has to do it!","rating":5,"date":"16 April 2018","review":"My hobby of writing user-comments is made significantly easier when a film's title and the entire plot synopsis are identical! This film is about a cannibalistic family clan versus two minivans of carpet fitting colleagues, and there's not a whole lot I can add to that. The cannibal camp exists of five hillbilly baboon-brothers, including a Jason Statham lookalike and a guy with a goofy 80s mullet, and as usual the mother is even more deranged than the boys. The carpet fitters are four dim-witted guys and one tough babe, but their chances are next to none in the ancient country mansion full of subterranean tunnels and human meat pie recipes. Luckily, I watched \"Cannibals and Carpet Fitters\" at 3am in the morning at a chock-full theater during the Brussels International Fantastic Film Festival. If it weren't for the stimulating ambiance during the annual horror-night, I probably would have been a lot less tolerant regarding the unoriginal plot and the clichéd nature &amp; behavior of the villainous cannibal family. The bloodshed &amp; gore is plentiful and overall satisfying (although the axe head-splitting scene at the very beginning of the film is never topped) and you gradually even develop some sympathy for the lead characters, notably for the duo Colin and Dean. This is the first full-length film of director James Bushe after a handful of interesting looking shorts. He definitely has the potential to become a good genre director, but then he'll have to put a bit more effort and depth into the scripts.","user":"Coventry","rank":[14,18]},{"title":"Very Good Horror Comedy","rating":7,"date":"5 March 2019","review":"I'm a yank but spent a lot of time in the UK and in similar venues as this one.\nGreat parody of small business where cliches abound but cliches create laughs. loved the dumb blonde who only answers the phone if she's not filing her nails (can't call for help if dumb blond won't answer) The whole rich people in mansions will pay more (absolutely gorgeous footage of mansion house aerial &amp; other) but we'll do a crappy job anyway lends a back &amp; forth ok so they're all a bit unsympathetic)\nShout out to 7 foot Phil Martin for always adding the \"looming\" factor- no camera tricks needed.\nFun scenes in places like the kitchen where you can play the continuity game.\nFantastic tunnel fun. I'll leave it at that, and attention paid to \"wait why is...oh yeah he padlocked it\" games\nHilarious scenes of incompetent workers with the main contractor increasingly frustrated.\nNice sudden 'what the?' scares without needing to rely on \"call it in jump scares\"\nBeautiful tasty Gore. This girl loves me good tool use!\nI consistently laughed hard. I'm glad that the original reception the 'short film received allowed this full one to blossom albeit at a trim under 90 minutes.","user":"darwinsom","rank":[5,6]}]