[{"title":"Allows us to remember how to dream","rating":9,"date":"8 October 2015","review":"For 350 years, Spain built a vast empire in South America based on the labor and exploitation of the Indian population, forcing them to accept Christianity while decimating their culture, religion, and even their language. In the late 19th and early 20th Centuries, \"rubber barons\" rounded up all the Indians and forced them to tap rubber out of the trees in rainforest zones leading to slavery and human rights abuses. Winner of the top Director's Fortnight Award at Cannes and Colombia's submission to the Oscars in the Best Foreign Film category, Ciro Guerra's (\"The Wind Journeys\") Embrace of the Serpent (El abrazo de la serpiente) provides a powerful insight into the effects of colonialism on an indigenous population.<br><br>The film, in which nine different languages are spoken, follows two interconnected stories based on the travel journals of two Amazonian explorers thirty years apart, German scientist Theodor Koch-Grunberg (Jan Bijvoet, \"Borgman\") and American plant enthusiast Richard Evans Schultes (Brionne Davis, \"Avenged\"). Both men are seeking the Yakruna plant to discover its powerful ability to heal. The two explorers are accompanied by the Amazonian shaman Karamakate (Niblio Torres as a young man and Antonio Bolivar as the elder) not only to find the sacred plant for research purposes but to learn deeper truths about themselves and the nature of reality. Karamakate, the last surviving member of his tribe, guards the secrets of Yakruna, a last symbol of independence for his people.<br><br>Filmed in black and white by cinematographer David Gallego (\"Cecilia\"), it is the first film to be shot on location in the Amazon in thirty years and its gorgeous kaleidoscope of rivers and forests, and the blending of time creates a surreal, dreamlike atmosphere, fortified by native songs and chants. As the film begins, a young Karamakate, armed with a spear and dressed in native attire, stands menacingly as a boat approaches the shore containing the German scientist and his companion Manduca (Yauenku Migue), a native dressed in white man's clothing.<br><br>Manduca asks the shaman to cure the explorer who is very sick, but Karamakate, who is familiar with the destructive nature of the white man, refuses. When Theo tells him, however, that he has seen survivors of his people and will take him to them, the young shaman agrees as long as the white man follows his \"prohibitions\" about disturbing the natural flow of the jungle. The two scientists, Theo in 1909 and Evan in 1940, follow the same path and explore the same places drastically changed over the years. Karamakate, as he did with Theo, acts as Evan's guide and considers himself as a \"chullachaqui,\" an empty shell of a human being, and must become a man once more in tune with nature.<br><br>Two scenes stand out. After a night of singing and dancing with a native group and demonstrating Western technology, Theodor becomes angry when a member of the group wants to keep his compass in exchange for goods. To rationalize his anger, he tells Karamakate that owning a compass would disturb their traditions of finding locations through the sun and stars, but the shaman tells him \"You cannot forbid them to learn. Knowledge belongs to all men.\" The other scene is one of pure horror when a priest (Luigi Sciamanna, \"Secreto de Confesion\") at a Spanish mission is found brutally whipping his young students until Theodor intervenes. <br><br>Despite an element of religious madness that feels out of sync with the tone of the film, Embrace of the Serpent soars when its focus is on spiritual awareness. The shaman tells both scientists the need to unburden themselves of their material possessions and explore the mystery of consciousness alone without their physical and psychological baggage. They cannot be cured of their illness, he tells them, because they have forgotten how to dream. After Evan ingests a native plant following a heated exchange with Karamakate, a montage of brilliant, swirling colors pushes the boundary of what we think is real and allows us to remember how to dream.","user":"howard.schumann","rank":[101,117]},{"title":"TIFF 2015 -- Embrace of the Serpent:","rating":8,"date":"16 September 2015","review":"For the things we don't see, or weren't around to see, 'Embrace of the Serpent' attempts to re-image a dark past in our history. <br><br>Karmakate is the last survivor of his tribe, living in the heart of the Colombian Amazon. At two separate points in time, he is asked by foreign scientists' Theodor Koch-Grunberg and Richard Evan Schultes -- both with different purposes -- on how to find a scared healing plant. The film borrows a lot of its content from their diaries from when they had commissioned Karmakate to help them in 1909 and 1940, respectively. He is conflicted as he has no ambition to help \"the White man\" because his tribe was wiped from the Earth by them, and he lives his days by himself.<br><br>The film doesn't beat around the bush. As it progresses, it becomes evident that the story is about the devastation of colonialism and what it had done to the land &amp; its people. Everything from spreading Catholicism to Rubber Farming, more and more they see the land changing for the worse. <br><br>It was impressive to not only hear these actors speaking Spanish, but also being able to converse in the native tongue of the locals, including the several other languages that were used through out the film. Couple that with the beautiful cinematography, and you have yourself quite the masterpiece.<br><br>Fans of Miguel Gomes' 'Tabu' would likely enjoy this. Shot in black and white. Beautiful transitions and landscape shots. Winner of the Art Cinema Award at Cannes. Expect this film to go for Best Foreign Film at the Oscars.","user":"Brap-2","rank":[60,68]},{"title":"Brilliant","rating":9,"date":"3 February 2016","review":"Embrace of the Serpent deserves a special mention of the movies I watched at the 8th Bengaluru International Film Festival. Loved the way this movie delineates the Amazon, Culture, People, their belief, their love for the spirit called LIFE transcending from reality to fantasy effortlessly. Though its loosely based on the diaries of the 2 scientist, the movie gives a collective account of what it would have been to witness those times and see the true dark side of the Colonial enforcements and the resulting destruction of culture, people, nature on a wide range of a scale. The rich monochrome frames simply captivates ones mind and more importantly, the lack of background scores at times adds the muscle to the already strong Amazon backdrop. The forest &amp; the river has this captivating power which sucks you into it and makes one feel as if he/she is also a part of the journey through time. Those handpicked tribal actors are out of the world truly - especially both the young and the old Karamakate - inspirational stuff. Certainly not to be missed.","user":"Susankritha","rank":[48,54]}]