[{"title":"A thoughtful comedy","rating":10,"date":"14 March 2017","review":"Punching Henry is an intelligent comedy. Unlike most comedies out there that rely on cursing, disgust, or slapstick, this movie has a brain. I won't get into any plot details but it is clear that many of the scenes are inspired by real-world events. The film has plausibility and never seems contrived. Punching Henry also manages to be both funny and sad at the same time, which is quite rare and difficult to carry off for even the best scriptwriters. Finally, the film makes a comment on culture and human nature. Popularity it seems, has little to do with talent or integrity. Maybe you knew that already, but this is well worth watching. It will have you consistently laughing, thinking and sympathizing with the protagonist. It gets my highest recommendation.","user":"jay-friedenberg","rank":[10,12]},{"title":"598th Review: Hangdog Comedy That is Laugh-Out Loud Funny","rating":6,"date":"23 February 2017","review":"This was a genuine surprise - Henry Phillips, a loser comedy musician and proud of it, plays himself in a film that has more going for it that most - firstly, it is actually funny, rather than just meh, it has some excellent sight gags, sharp one-liners, and a script that uses his road tales and converts them into something more. On top of this is an actual plot of LA life (and of the horrors of big commerce trying to seduce him into monetizing his life). Hey, we see what you did there Henry, clever...<br><br>All in all, this is a small, intimate film that captures its Garry Shandler, Larry David, Walter Matthau vibe and gets better as it goes along. With loads of cameos and a nice sensibility, this is an easy film to recommend - it's low down without being mean about it - and it actually gets its laughs right.","user":"intelearts","rank":[11,14]},{"title":"Can't seem to get it right.....","rating":9,"date":"19 March 2017","review":"When I first heard about 'Punching Henry' I did not know quite what to expect. <br><br>The theme of a 'can't-get-anything-right-everyman' has been tried, and not all attempts have been successful.<br><br>Then I saw 'Punching Henry.'<br><br>In the context of a guy's attempt at fame and art, everything he did, except for one thing, somehow worked against him (I will leave out the 'one thing' so as not to spoil it for those on the fence.)<br><br>The timing was right; the pace was spot on; the humor was there; and the inevitability of it all, from the two cabs to the wrong turn off the elevator, and everything in between, worked.<br><br>I'd recommend this for anyone who has wondered 'What does it take to make it in the entertainment industry?' and, more importantly, 'Just how many wrong turns can my career take?'","user":"moneybagzz","rank":[8,10]}]