[{"title":"Make me proud","rating":4,"date":"9 August 2017","review":"Not since \"John Dies at the End\" have I been able to figure out the ending of a film from the title. Ivan (Gary Stretch) is terrible. He kills his one son Chester (Chester Rushing) and hits the other one in the side of the head so he can't hear out of both ears. Asher (Joe Anderson) grows up deaf and decides to be a mute because he would talk funny. When dad is released early from prison, Asher is out for revenge. And there is a girl (Candace Smith) involved.<br><br>The film won a number of awards for being the best indie out of Louisiana. It was professionally shot, however there were a number of things I didn't like. The first was the metaphoric and poetic language monologue that was fitted into the script by someone with less than the education to speak/write that way. Good writing, but didn't fit the character. Now for a deaf guy, I assumed he could read lips and sometimes read lips when he wasn't looking at them. And how did a deaf guy know to turn around when a gun was fired? I guess no one caught it in post or didn't care. The whole situation seemed like over reaction. I am sure grindhouse zealots might find a gem here. It seemed a bit tedious to me.<br><br>Guide: F-word. Sex, rape, nudity (Frances Reagan James + uncredited)","user":"nogodnomasters","rank":[4,4]},{"title":"Fathers have always taught their sons to replace them","rating":10,"date":"20 January 2017","review":"This movie hits me on a very personal level.<br><br>It resembles much of my relationship with my father. I never knew why my father started or why he couldn't stop drinking. I am certain that not many IMDb users can relate to violent childhood memories but this film goes beyond that.<br><br>The poetic voice-over, the spectacular scenery, resembles Terrence Malick's doing and the violence on a Black &amp; White screen, punctuated at key points in the story, resembles Quentin Tarantino's work.<br><br>I don't have much to say about this gem, but that it captures how it feels to be born in a family with a violent past and how good men chose to make different decisions in life.<br><br>It's spot on. Uncomfortably so.<br><br>Yet beautiful.<br><br>Thank you, Sean Brosnan","user":"neamtzu_rau","rank":[15,23]},{"title":"It was an intense film! Well Done!","rating":7,"date":"21 January 2017","review":"Was not sure what to make of the synopsis of some guy who can't hear and who can't speak going after his father who murdered his brother but it turned out to be one of those real good movies that pays homage to that 1970s style of film making that all the indi filmmakers who love b-movies seem to enjoy paying homage to.<br><br>Very gritty and emotional. Well laid out film. I love the way it looked it was beautiful in it's grittiness and I loved the way it felt and I loved the music.<br><br>I was waiting for a while for this film to come out at my theater. I saw the poster and it looked great. It was worth that wait.<br><br>http://cinemagardens.com","user":"subxerogravity","rank":[6,9]}]