[{"title":"Beautiful, but ultimately nonsensical","rating":4,"date":"4 August 2016","review":"This movie is the equivalent of watching a famous painter perform his craft; you stand there, amazed at the beauty being demonstrated, and then when it's all over, you wonder, \"What did he just paint?\". I am all for films that make you think and create an ambiguous air in both storytelling and message, but this film is beyond absurd. The premise, the events that transpire throughout the movie, the lack of rhyme or reason as to why the events are taking place in the first place, etc. It was like a puzzle with not only missing pieces, but with each piece a part of a different puzzle. It's beautiful shot with some amazing cinematography, so be prepared to be amazed at some of the vistas shown throughout the film. But the movie just does not make any sense, and the ending does not clarify anything, nor does it bring it all together. Had it clarified some of the events, it actually would have been a great art film. As it stands, it's quite possibly the most nonsensical movie I have ever seen. I would not recommend watching it.","user":"manuelasaez","rank":[99,137]},{"title":"Childhood Fantasy & Nightmare","rating":7,"date":"13 May 2017","review":"This movie is a magical mystery journey that touches on the best fantasies and the worst fears of my childhood. I needed to watch it twice to get a better understanding, there's just too much going on here. Certainly brings up more questions than answers, but I appreciate how the movie allows my imagination to wander and come up with my own observations and interpretations. That's what I like most about these kinds of movies. <br><br>Those mermaids using the boys as reproduction tools was a really wild idea. What a nightmare! Perhaps a bit far fetched, yet it really enhanced the paranoid \"creep factor\" in this movie. Still wondering what that \"thing\" was being passed around during the beach orgy, but that's part of the mystery, isn't it?<br><br>I could totally relate to Nicholas asking the important questions and realizing that everything about his existence needed to be questioned. Indeed, even questioning if his perception of reality is true. He uses drawings as therapy to create a world he understands. It's a process and Nicholas stays strong throughout his struggles to uncover the truth about the weird reality around him. He finally learns to \"let go\" with the help of the lover nurse and this is where the movie ends. Evolution leaves plenty of room for the imagination to wander.","user":"peterberkey51","rank":[21,26]},{"title":"Some good ideas but hampered by a joyless execution","rating":4,"date":"18 October 2016","review":"A young boy begins to wonder about the isolated community he has grown up in; one populated only with boys his age and young women.<br><br>This French film is an example of a recent type of development that I have noticed in horror cinema in that it is a film that is played out in such a self-consciously arty style that it seems to think engaging with the audience may in actual fact be beneath it. The events depicted have some genuine potential but they are played out in such an overwhelmingly downbeat manner that their effect is seriously compromised. The tone of the film is more or less one note from start to finish, resulting in a pretty unsatisfying experience. This is an especial shame when the overall setting of the story and its enigmatic qualities are fairly promising. Details are not fully revealed about what is going on but this fact didn't concern me too much – aspects such as the strange medical experiments and odd events that played out on the beach in the dead of night were intriguing. But the material was not served well in my opinion by the excessively po-faced execution and it was ultimately quite difficult getting very involved with the events that played out in this one.","user":"Red-Barracuda","rank":[53,75]}]