[{"title":"A Powerful Drama Packed With Suspense!","rating":9,"date":"15 April 2016","review":"Viewed at CineMatsuri 2016. Japan's unconditional surrender brought an end to WWII, but not an end to Japan. Despite the nuclear destruction of Nagasaki and Hiroshima as well as considerable damage to other major cities, it's people were not exterminated. But it may have been a close call! Director Masato Harada's screenplay takes the well-known outcome of a major historical event and injects the real and starling possibility that things might have turned out quite differently. It is based not on speculation, but, apparently, on recent research including information contained in documents that surfaced relatively recently. Harada's dynamic depiction of the actions by Japan's governing elite in the hours before surrender is sobering and, frankly, scary. It is unclear who has (or might seize) the authority to lead the nation (authority seems to oscillate between the Emperor, his civilian ministers, the military departments, and combination thereof) in the midst of a nascent mutiny by junior military officers with a rallying cry of: \"Japan has 100 million kamikaze fighters.\" If this do-or-die hysteria had gained more traction, Japan may have been annihilated (with it's civilization joining the dinosaurs). Acting (by veteran actors you may have seen in other recent films) is excellent with just the right level of melodrama or underplaying of scenes given the situation. Cinematography (wide screen, color), lighting, effects, set decoration, editing, and scene continuity are top-of-the-line. Sound-field creation and recording are state of the art. The high-energy score (played by a large, symphonic orchestra) exhibits compositional depth with many themes and variations thereon. Often it injects major enhancements to the drama depicted on screen. There are simply too many moving parts portrayed in the movie. It is obvious that Harada wanted to include most/all of the principals and significant military units now known to be involved. But this can be pretty confusing to viewers who are not hard-core history buffs and, hence, have little (if any) idea of who were key members of Japan's ruling elite at the time (aside from the Emperor) and how they ran their government. Role clarifications as to why were certain actions taken (or not taken) and their significance are especially needed for some of the Emperor's ministry heads and leaders of various military departments/units at home and abroad. (Perhaps a brief introductory overview/road-map before the film gets underway might do the trick?) It is surprising to see the mode of transportation used by grimly-fanatic and fully-armed officer-leaders of the mutiny to tool around Tokyo (or what was left of it) at night---bicycles! A juxtaposition that seems to be telegraphing the eventual outcome of the mutiny. The on-screen flash rate of dialog subtitles can be a bit short at times. This is contemporary Japanese movie making at its finest. Not to be missed. WILLIAM FLANIGAN, PhD.","user":"net_orders","rank":[14,15]},{"title":"Painfully educational","rating":5,"date":"11 January 2016","review":"This was a movie that if you were not interested in history would be boring and although it had some of Japan's most respected actors it still felt like the director didn't want to allow them to show the passion of the time. Koji Yakusho who played Yamamoto in Isoroku Yamamoto, the Commander-in-Chief of the Combined Fleet and he was a mirror of this character. I feel that Japanese directors tend to make all of their famous historical figures liberally open minded and victims of their times. In hindsight so do American directors but I don't want to watch an American film I want a Japanese film.<br><br>Tsutomu Yamazaki portrayal of Prime Minister Suzuki suffered the same fate and here we have another respected Japanese actor who I have seen do wonderful roles. The only character that we never see much at all in many movies is Emperor Showa. Many directors prefer to show various Emperor's as omnipotent and Masahiro Motoki in this role opened up the historical figure a little more making him more human to the watcher.<br><br>I felt a little let down by the movie and it appears that a taking of US $7,431,985.36 in the first 2 weeks shows that the younger film goers just don't want to have lessons forced down their throat on a night out at the movies with friends.","user":"john_j_grant","rank":[4,13]}]