[{"title":"Deadly obsession.","rating":9,"date":"31 October 2016","review":"Disturbing film about the true case of Bamberski. He was lucky enough to have a couple of sidekicks: the good lawyer who works alone, like him, the German translator, and faithful Cécille, who withstands a lot. His dad in his alpine retreat is also understanding, gives him the best advice. <br><br>André had a life as a businessman, not very kind to his employees as we see in the first scene, but has his life transformed by the death of her daughter. The film doses the truth very well, and doesn't' shy away from showing the darker aspects of André. He is shown speaking alone while working, attempting acts that are not very lawful, and with a single- mindedness that could end with somebody at any moment. My favourite moment is him eating and resting alone in his car, a homage to \"L'adversaire\" in my humble opinion (one of the best films I've ever seen). The differences between the two roles are stark, nevertheless. Daniel A. can pull off basically any role he's thrown at, with a lesser actor this film would have been just stock material.<br><br>The director succeeded into making Marie-Josée Croze an unlikable woman ;). Her character could have more character development, I didn't understand much her (lack of) reactions and why did she never react to André's truths, not even at the cemetery when they cross paths with A.<br><br>I didn't feel much like going to Germany after watching this film ;). It looks like a foreign country, cold, with a difficult language, a juridical system that protects people like Dieter K. and rather absurd legal decisions. Hadn't it been for Andre's stubbornness, Kalina's case would have been buried. The German system doesn't come off very well in this film ;). It may have to do with French-German relationships, not always loving, but it's for Europeans to give opinions on that.<br><br>Overall, a great film. Not entirely pleasurable to watch but, given the material, a well told story, without melodrama or demagogy.<br><br>Recommended!","user":"stuka24","rank":[23,27]},{"title":"Father's fight","rating":19,"date":"19 March 2016","review":"Inspired from actual events, this is a true compelling story. The tale of a man whose daughter was raped and killed by her step father, because her mother had divorced from the teenage's father. But the rapist was a German citizen who took full advantage of the lack of extradition policy between France and Germany. So, during more than thirty years, the poor father - Daniel Auteuil - never stopped fighting, over and over, to get justice for his murdered daughter. <br><br>SPOILERS SPOILERS SPOILERS SPOILERS He finally succeeded in his task, every body in France knows that, but this film is still gluing for the audience, thanks to the outstanding performance of Auteuil.","user":"searchanddestroy-1","rank":[13,17]},{"title":"Outstanding performance of Auteuil, highly recommend!","rating":10,"date":"13 April 2019","review":"Just watch this movie, for the real story, for the cast, for everything. The persistence of a man in seek of justice where the system, most of the times, fails.\nOutstanding performance of Auteuil, one of the best actors in Europe. Also my thumbs up for Koch.","user":"fl-20473","rank":[4,4]}]