[{"title":"Love is blind, and sadly apparently so was Riley","rating":6,"date":"12 October 2015","review":"Now I get that when you like someone you're willing to put up with a little bit, but Riley bless him, it's fair to say Samantha wasn't looking her best when he made out with her, it's all i'm saying, everyone around poor Samantha was a little dense.<br><br>The sequel in some ways is a step up from the original, even more scenes to shock and gross you out, but as a film it's done on a much bigger scale, the first one was fairly insular, the second is similar but on a much bigger scale. It does somewhat turn into the typical Zombie movie, shocks, gore, cops etc, but it's worth watching.<br><br>It picks up exactly where the last one left off, after Sam infected Riley it concentrates on his story, his degeneration and battle to save himself and expose what's caused it. The scenes of Riley's degeneration are gross, don't have a hot dog watching this movie.<br><br>It's not on the Christmas wish list, but if this is your kind of film, you'll enjoy it to a point, i think we were left knowing that there'll be a third. 6/10<br><br>The moral, never lie to your Doctor!!","user":"Sleepin_Dragon","rank":[18,19]},{"title":"An opportunity to right the wrongs of the first film is wasted.","rating":1,"date":"1 March 2016","review":"*spoilers ahead*<br><br>In the original Contracted, characters lacked even the most basic logic in nearly all of their decisions. I won't recount the details, since they've been thoroughly torn to shreds by others, but shamefully, all of these prior mistakes have been carried over to and made worse in this abysmal sequel. <br><br>The film begins with Riley (the male who slept with zombie Sam towards the end of the first film), who is talking with a Scottish-accented (wtf) police detective about the body count that amassed in the last day. Instead of revealing what has actually occurred, he provides only the bare minimum. Okay, I guess after sleeping with decomposing maggot-girl and then stabbing a reanimated corpse in the mouth with a kitchen knife didn't cause Riley to stumble a bit in his standoff with the interrogator. He's let free from the police. It's not like his fingerprints, semen, and blood weren't at the crime scene, right? I mean, no worries. <br><br>Riley goes to a doctor (who is also his brother in law.) He wants to get tested for \"everything\" but won't give the doc any further details. Good thinking, Riley. I'm sure a blood test one day after sleeping with a zombie will clear everything up for you. Especially if you don't tell your doctor what actually happened. And oh yeah, the claw marks on your back with the fingernail you removed yourself? No biggie. That yellow puss is probably nothing the doctor needs to look at. Carry on!<br><br>The film continues with the villain, \"BJ,\" stalking Riley for reasons that aren't explained. I mean, why does he care if Riley spoke to the police? The virus is already released and spreading. How could Riley have any info for the police that is worth jeopardizing the entire operation for? So, he saw BJ with Sam in the car. Does that matter so much? Another character that behaves without logic and whose actions serve only to progress the plot. <br><br>Riley lives with his elderly grandmother. He accidentally infects her with the virus by leaving his toothbrush next to hers in the bathroom. Doesn't take much to spread this, I guess. So why does BJ make such a fuss about sleeping with women to spread it? If he wants to destroy humanity, all he has to do is smear some of the virus in public places where thousands will come in contact with it. But I digress. <br><br>Riley goes to a memorial service for Alice (the zombie friend he stabbed) attended by friends and family. His sister gives a speech and some dude plays a shitty song on acoustic guitar in her memory. While this was occurring, Riley begins having head pains and bends over in agony. Blood drips in large thick drops from his nose and lands in some kind of dip. Mind you, his doctor/brother-in-law is standing right next to him in the room and even whispers something unintelligible to him while he's doubled over. Does he offer him help? No. Does he go with him to the bathroom to see what's happening? No. Apparently he missed the bloody agony 12 inches away from him. Thanks doc! In the bathroom, Riley sneezes and a massive amount of blood is spewed all over the mirror. He tries to clean it up and while doing so, talks to his date, Harper, through the door. She wants to know if he's OK. He says he's fine and then suggests they go for a drink. Yep, you heard that right. He blew chunky blood out of his nose, barely cleans it up, and then thinks a drink with a date is a good idea.<br><br>They go to a bar and Harper kisses him before heading to the bathroom. Riley is then drugged by BJ, threatened, and apparently brought home and placed in bed. He wakes up the next day even sicker than before. He goes to Harper's college and pulls her out of class. She is visibly very ill. As ill as Riley. I guess the disease progresses at different rates in different people? One of Harper's classmates tries to intervene and remove Riley, but Harper pukes blood all over him and they leave. <br><br>Riley is convinced he can find a cure for the plague and enlists Harper to help track down and confront BJ. Harper ends up plucking out her eyeball and Riley tends to his own maggot-infested decomposing body. They then go to their drug-dealer friend's apartment and attempt to buy guns from him. The Riley threatens him with a gun because he thinks he has info that can lead him to BJ. The detective arrives and breaks up the gun deal. Riley and Harper are taken to the hospital, but one-eyed Harper dies. In case you were wondering, no, you won't care if she dies or not. In fact, due to the complete lack of humanity and any believable character development in this film, you won't care about anything or anyone. That's a promise.<br><br>In the Hospital, BJ shows up with some kind of suicide-zombie vest on and begins revealing his plans to obliterate mankind, like all good villains do. Long story short, a zombified Riley jumps to save the detective who is in a standoff with BJ. After a brief, laughably undeserved montage of our not-hero, the detective shoots zombie Riley and we cut to credits. Midway through the credits, it is revealed that the doctor from the first film was in cahoots with BJ all along. I guess they wanted to make his apparent ineptness in the first film seem more believable. It didn't. <br><br>OK, so, we're set up for Phase 3. I will watch it. Not because I want to, but because like all good train wrecks, I'm compelled to do so.","user":"satanicocarlos","rank":[10,11]},{"title":"It follows ... up on the original","rating":5,"date":"17 August 2016","review":"If you have seen the original, you kind of know where this is going. And I will continue as if you have seen it. This time around it's a man who has the issue. The viewer might have a different issue though: We go through almost all the same things we did in part 1. Then again, why change a winning formula? Exactly, if you can \"continue\" something by adding to it.<br><br>The acting is OK and one can generally say that if you liked the first movie, the same will be true for this one. Predictibility aside, this has its fair share of moments that will freak you out, something the first one was able to do to. There are \"contracted\" movies that actually have major issues, so I guess we should be thankful for the better ones","user":"kosmasp","rank":[4,4]}]