[{"title":"Very moving and well done","rating":9,"date":"16 July 2016","review":"This movie is very stirring and emotionally moving. It really captures the emotions and the crisis of faith that must be the experience of those who must watch their children suffer in any way.<br><br>The directing is very good and the cinematography is well done. When I started watching the movie I expected the characters to be somewhat plastic. To my delight, this was not the case. The characters seemed real, human, and relatable.<br><br>However, it is the performance of Jennifer Garner as Christy Beam (the Mom) and Kylie Rogers as Anna Beam (the daughter) that put it over the top. <br><br>I very much recommend this movie","user":"pboisvert-11876","rank":[38,52]},{"title":"One of those rare Christian movies that's worth the time to watch!","rating":7,"date":"3 August 2016","review":"'MIRACLES FROM HEAVEN': Three and a Half Stars (Out of Five)<br><br>A faith-based Christian drama flick, adapted from the memoir (of the same name) by Christy Beam. Beam tells the story of her 10-year-old daughter; who suffered from an incurable disease, and then was suddenly cured from it (after having a near-death experience). The movie deals with Christy's struggles with her faith, while coping with her daughter's tragic illness. Jennifer Garner stars in the film, as Christy Beam, and it costars Kylie Rogers, Martin Henderson, Eugenio Derbez and Queen Latifah. It was directed by Patricia Riggen (who also helmed 'THE 33', last year), and it was scripted by Randy Brown (who also wrote 2012's 'TROUBLE WITH THE CURVE'). The movie only received mixed reviews from critics, but it did surprisingly well at the Box Office (where viewers raved about it). I enjoyed it as well.<br><br>The story takes place in Burleson, Texas (in 2011). Christy Beam (Garner), and her husband Kevin (Henderson), are devastated to learn that one of their daughters, 10-year-old Anna (Rogers), suffers from pseudo-obstruction motility disorder. The disease makes it so Anna is unable to consume food, without tubes. It's also deadly, and incurable. Christy doesn't understand how this could have happened, to her Christian family (that always goes to church regularly). She struggles to keep her faith, and then is amazed to learn of her daughter's miraculous recovery (possibly because of it).<br><br>I was raised strictly Catholic, and I always attended church regularly (as a child), so I'm always interested in any movies that deal with religion. I'm not usually that impressed, with the average 'overly preachy' ones (that mostly just 'preach to the choir'), but this one is really well made. Garner's performance is amazing, and Riggen's direction is equally as impressive. The movie seems a little clichéd, and gimmicky, but for the most part it's pretty emotional (I cried multiple times). It's also kind of inspiring. The film is actually one of those rare Christian movies that's worth the time to watch!<br><br>Watch our movie review show 'MOVIE TALK' at: https://youtu.be/UotWSwc37KA","user":"Hellmant","rank":[23,31]},{"title":"Wonderfuly done inspiring film!","rating":10,"date":"5 May 2016","review":"The film is beautifully shot, and really well acted, seriously the best performance of Jennifer Gardner's career she really lived it! Every one in it did a good job but especially the little girl that is the main character. And its a true story! I really don't understand how anyone could not like this film. I'm an actress and fairly critical because I see film technically as well as story wise, but this one really stands up! The story was wonderful. I loved it! I cried my eyes out, I connected with the characters and cared about their journey and it left me thinking. In the end what more do we want from a film! I really hope Jennifer Gardner gets some recognition for this role she earned it!","user":"FanGirl7","rank":[51,83]}]