[{"title":"3 generations of spitfire women","rating":7,"date":"3 September 2015","review":"Greetings again from the darkness. Perhaps your mental picture of a grandma is the familiar form of a Norman Rockwell painting  a sweet, bespectacled little lady baking pies or knitting booties or kicking back in a rocking chair as the grandkids romp around her. If so, Lily Tomlin will jolt you into reality with her performance in this latest from writer/director Paul Weitz (About a Boy, American Pie).<br><br>The film kicks off with Elle (Ms. Tomlin) breaking up with her much younger girlfriend (Judy Greer). As with many relationship break-ups, the tone shifts quickly with an increase in 'let's talk about it'. Elle tosses out \"You're a footnote\" as a zinger that quickly ends any hope of reconciliation. It's an uncomfortable opening scene that aptly sets the stage for what we are going to witness over the rest of the movie  Elle has lived quite a life, but has been unable to move on since the death of her long time companion – a recurring subject throughout.<br><br>The six segments of the film are titled: Endings, Ink, Apes, The Ogre, Kids, Dragonflies. Don't expect those descriptions to help you guess the direction of the film. Instead, it plays out like a road trip through Elle's past  albeit with a very contemporary feel. See, her granddaughter Sage (Julia Garner) shows up at the house asking to borrow $600 for an abortion. Despite her career as a poet of some notoriety, Elle is tapped out at the moment. So the two of them set out in Elle's 1955 Dodge Royal (Ms. Tomlin's real life car), and proceed to visit people (and hit them up for cash) who have played a role in Elle's most interesting life.<br><br>During this journey – which all happens during a single day – the ladies cross paths with Sage's clueless boyfriend (a miscast Nat Woolf), a transgender tattoo artist (Laverne Cox) who owes Elle the money she lent for enhancement, a small business owner (the final appearance of the late Elizabeth Pena) who is a bit more tough-minded than Elle gives her credit for, a long ago ex-husband of Elle's (the best performance from Sam Elliott in years) who still carries heartbreak , and most bombastic of all, Elle's daughter and Sage's mom – a workaholic, no non-sense, Type A professional (played with vigor by Marcia Gay Harden).<br><br>Much will be made of the film treating Sage's decision so matter-of-factly, but it makes for nice contrast to Juno, where the decision to abort an unwanted pregnancy is abruptly reversed when she's told the baby has fingernails. This movie even offers a tip of the cap to that scene (bravo Sarah Burns), but is never preachy or heavy-handed in its dealing with Sage. It's a young girl in a real life situation, and she is depending on her dysfunctional family to provide financial and moral support.<br><br>One might describe this as an art-house movie with wider appeal. Lily Tomlin makes this a must-see, as do Julia Garner and Sam Elliott. Some will avoid it due to the abortion topic, but this is much more a story of three strong women who are related to each other – even if they don't always relate to each other.","user":"ferguson-6","rank":[31,47]},{"title":"Grandma","rating":8,"date":"17 February 2016","review":"I didn't expect too much from the film Grandma, but it ended up being quite a pleasant surprise. Its story is simple and it barely covers one day in the life of the characters, but it works as an adequate frame of a genuine character study, in which even the most trivial events (like buying a coffee or taking a taxi) reveal new aspects and hidden emotions from the characters. I suppose that the tragicomic adventures from an irascible grandma and her granddaughter touring a city looking for money (500 dollars) might not seem particularly attractive material for many spectators, but as I previously said, the point of the movie is gradually drawing the endearing relationship both of them develop with each other, also extending to the granddaughter's mother, perfectly played by Marcia Gay Harden. I would also like to mention the solid works from Elizabeth Peña in her last performance; and Judy Greer, one of my favorite actresses, finally playing a role which takes advantage of her huge talent. Lily Tomlin seems to improve with the age (something which is already a big compliment), facing mature roles with dignity and without losing a pinch of the intensity and energy which have always distinguished her, while Julia Garner also makes an excellent work as the granddaughter while having a perfect chemistry with Tomlin. In conclusion, Grandma is a \"small\" movie, made with very little money (supposedly 600,000 dollars) and which received minimum publicity, but I enjoyed it pretty much, and I recommend it as a solid and satisfactory film.","user":"Argemaluco","rank":[12,16]},{"title":"Great characters and performances","rating":8,"date":"27 September 2015","review":"It's a rare event, but, yes, sometimes the director of American Pie makes a really good movie. The last one was probably About a Boy back in 2002. Grandma is a charming little indie with some fine acting, good character work and some touching emotion. Lily Tomlin plays an aging lesbian poet who is visited by her granddaughter (Julia Garner). She is hoping for money to pay for an abortion, but Grandma is broke. The film follows them as they go from place to place, hoping to get a loan or owed money or sell something valuable. The past is filled in by these encounters. The supporting cast is ace and includes Marcia Gay Harden, Sam Elliot, Judy Greer, Elizabeth Pena (who passed away about a year ago) and Laverne Cox (lovely to see her make the leap to feature film). It's Tomlin's movie, of course, but one should not overlook how good Garner is in the more passive role. I knew I recognized her from somewhere - it turned out to be Martha Marcy May Marlene - she should become a huge star. Okay, maybe it's because she's cute and I love her hair so much, but she is very good here.","user":"zetes","rank":[26,40]}]