[{"title":"Heartbreak incarnate","rating":8,"date":"1 April 2016","review":"Greetings again from the darkness. If we need a poster child for independent film, perhaps this little gem from writer/director Trey Edward Shults should be the leading candidate. The film is daring and raw and proves that even a familiar theme can be interesting if the creative forces are allowed to do what they do best. And on top of that  it was filmed in 9 days with no \"stars\" and almost no money.<br><br>The extended opening shot is a close up of only a woman's face. Her eyes are expressive and her lip begins to quiver. Her look could be described as unnerved, and with the ominous music playing, our mind leads us to believe we are headed towards a horror film. Oh, how right  and wrong  that initial impression proves to be.<br><br>That woman is Krisha (played by Krisha Fairchild), a sixty-something year old who is joining her family for Thanksgiving dinner – after a 10 year absence. Of course, there are no shortage of family holiday dinner disaster movies, but most of the time they are either slapstick comedy or so stagey that the frustration never strikes a chord. Not so with this one.<br><br>Tension is palpable in every scene. It's as if everyone is waiting for the proverbial shoe to drop. Krisha is a trainwreck as a mother, sister and person. She is an alcoholic and drug addict, though she proclaims herself healed. It's pretty obvious to everyone (except herself) that her best intentions are not firmly planted in reality  and the inevitable is only a matter of time. Old wounds are re-opened (though they were probably never closed), and a simple conversation on the patio or checking the timer for the baking turkey become near catastrophes.<br><br>Mr. Shults has economically and effectively cast many of his own family members, and filmed in his mother's home outside of Houston. Krisha is his real life Aunt, and Robyn (who plays Krisha's emotionally devastated sister) is the director's mother. This is a story that works because of the realness of each moment. It feels like family members unloading on each other rather than two actors reciting lines. Krisha's swig of wine in the bathroom provides a moment of relief for both her and the viewer. Having been called \"heartbreak incarnate\" and an \"abandoneer\"  we even sympathize with her instinct to retreat to the bottle, though it's with dread and misery.<br><br>Director Shults displays promise as a director who can capture a personal moment, no matter how awkward or painful. Krisha Fairchild has a Gena Rowlands on screen presence (very high praise) that delivers a touch of grounded realism to her words and actions. As a lover of independent films, here's hoping we see more from them both in the very near future.","user":"ferguson-6","rank":[42,52]},{"title":"Unsettling and brutal, but essential","rating":19,"date":"19 August 2016","review":"I don't know where that \"comedy\" label on IMDb comes from. I don't think it functions even as a black comedy. Absolutely heavy and quite dark, but fabulously written, directed, and acted. There are many films that deal with this sort of premise (even Rachel Getting Married comes to mind) but this really took it to another level. Completely immersive, watching it all unravel just hurts to watch. Not an easy viewing by any means and definitely one that will divide audiences completely (even on this board, I can see many people hating it). I loved it though, easily one of the best of the year so far. Krisha Fairchild should absolutely be in contention for end-of-the- year awards, and Trey Edward Shults shows a lot of talent.","user":"Red_Identity","rank":[18,23]},{"title":"Too real for most IMDb film reviewers","rating":9,"date":"6 December 2016","review":"Like \"La Cienaga\", this movie has a veracity and intimacy that will freak out most self- appointed film critics (and I'm not one). If you can't handle domestic pain, tension, and heartbreak then don't watch it. As a big fan of Dostoyevsky I found it riveting and powerful. After viewing I immediately sought out the back story and wasn't surprised to learn the cast/family are actual family members. I don't think a filmmaker could achieve what Shults does with an all-actor cast. It matters not a whit to me that he used family members or that you can foresee an inevitable train wreck in the making toward the end of Act 2. A great film, and the audio effects are superb, especially in the kitchen scene and the use of a Nina Simone track to score Krisha's high flying cookoff.","user":"rick-42282","rank":[24,33]}]