[{"title":"Incredibly Detailed, Stunningly Realized","rating":8,"date":"8 March 2016","review":"Mamoru Hosoda has come a long way since his Digimon (1999-2003) days. He's been steadily rising through the ranks and in the hearts and minds of anime fans with his cult Samurai Champloo (2004-2005) series and three very memorable feature length movies over the last decade. The Girl Who Leapt Through Time (2006) made a lasting impression to be sure, but Wolf Children (2012) remains in this writer's mind one of the most insightful and sublime anime films ever. It rivals the delicate balancing of themes that make Ghibli Studios so popular yet instead of children's stories, Hosoda dabbles in adult themes making Hosoda more of a contemporary to the late Satochi Kon.<br><br>The Boy and the Beast continues the animator's winning streak providing a soulful coming-of-age tale through killer action sequences and clever thematic liberties. Ren (Sometani/Vale), a pre- teen with a bad attitude has run away from home after the death of his mother. Angry, spiteful and living on the streets of Shibuya, Japan, Ren discovers a portal to Jutengai: The Beast Kingdom where anthropomorphic creatures roam free. Inadvertently, he's entangled in a feud between two powerful warriors vying for Lord of Jutengai. The first is Iozen (Yamaji/Hennigan), a wise and popular swordsman who fathers two children and apprentices many talented disciples. The second is Kumatetsu (Yakusho/Swasey) a powerful but temperamental and lonely warrior followed only by Tatara (Oizumi/Sinclair) his wise-cracking buddy. Partially out of desperation and partially out of spite, Ren apprentices with Kumatetsu and slowly learns the martial art of Kendo.<br><br>The central conflict in Boy and the Beast ignites when Ren and Kumatetsu butt heads while training. Kumatetsu it should be noted, starts out as a very poor teacher angrily screeching \"reach for the sword in your soul!\" and other such nonsensical things. Kaede (Hirose/Apprill), the wise monk of the village informs Ren (nicknamed Kyuta) that his master had to learn everything himself without help. Thus he became independent yet unable to teach. It is only when Ren starts to mimic Kumatetsu and anticipate his moves, do they both start training in harmony.<br><br>The other central conflict is the internal struggle Ren battles with as he grows older. The citizens of Jutengai claim humans do not belong as they have an inner darkness. Ren's darkness manifests itself in a shadow with an open pit in his chest. This ghostly figure however is tempered by the arrival of Hyakushubo (Franky/Organ), a high-school girl who encourages him to focus on other things besides fighting. While venturing between the human and animal realm, Ren takes an interest in reading and is taught by Hyakushubo who shows patience in ways Kumatetsu never could. It is this connection as well as his re-connection with his father, that Ren is ultimately able to become whole.<br><br>Boy and the Beast features some incredibly detailed, almost photographic background art. One could watch this film on mute and still be enveloped by the beauty of the world surrounding Ren, Kumatetsu and Hyakushubo. Only Satochi Kon's Tokyo Godfathers (2003) has ever reached this level of mastery and all due credit should be given to the animators. Even little throw away habitats such as the montage of our plucky heroes meeting with \"the wise masters,\" are awe-inspiring. Out of all the adornment however, the climax remains the most visually impressive part which more than makes-up for any narrative issues.<br><br>And yes there are some slight narrative issues. Elaborate swordplay and exciting, detailed animation aside, the third act tends to go on a tangent only loosely connected to the story at-large. We're made privy to a long festering rivalry that seems to come out of left field and are given certain rules a little too late in the game. The whole third act could have taken up the contents of a whole new movie; a sequel perhaps. Instead it's squeezed in like descriptors in a Herman Melville story.<br><br>Most people are blessed to have one person in their lives who inspires them to follow their dreams while arming them with the discipline to make those dreams a reality. Ren is given three over the course of Boy and the Beast. The first is Kumatetsu who despite his gruffness would sacrifice everything for Ren if given the chance. The second is Hyakushubo; a kind young girl who not only teaches Ren how to read but encourages him to reach for more and never be afraid of failure. The last is Ren himself; the only one who can reflect on the choices he's made and give him the motivation to learn from those choices. We may not always have a choice about what happens to us but we do have a choice on how we react, adapt and grow with each opportunity. With that Boy and the Beast illustrates it's most important lesson; you too can be your own hero.","user":"bkrauser-81-311064","rank":[33,35]},{"title":"\"Kemono: The Movie\"","rating":8,"date":"7 December 2015","review":"Like a male version of \"The Cat Returns\" - full of beautiful animation, appealing characters and themes, speckled with a few moments of honesty, a lot of familiar anime tropes, and some spotty pacing/storytelling.<br><br>Fortunately, the film is sufficiently well made and intentioned that if you're able to accept the director's priorities and not get hung up by less-than-subtle exposition, it's a totally charming, indulgent time.<br><br>Movies like this fill a sweet spot: the kind of comforting sentimentality that makes you feel good on sick days.<br><br>If you're reading this, chances are you're familiar with the director's work (\"Wolf Children,\" \"Summer Wars,\" \"Digimon,\" etc.). As the title of this review indicates, this movie delivers that content...more than any other film in existence. Enjoy.","user":"slyweazal","rank":[32,35]},{"title":"Great Movie!","rating":8,"date":"17 June 2016","review":"This is the same person who made \"Summer Wars\", \"The Girl Who Leapt Through Time\", &amp; \"Wolf Children\" all of which I absolutely LOVED!, I can't even pick a favorite out of those 3. I can say this was my least favorite of all 4 of his movies, but thats not a bad thing. Its a great movie, I just found a little something more out of the others over this one. The story is about a 9yr old boy whos mother dies &amp; is told he'll be living with his relatives, because of this he runs away &amp; ends up traveling accidentally into the spirits world(very similar to \"Spirit Away\") &amp; being taken in by one of the greatest warrior spirits to live there. The story is solid through &amp; through, it'll tug your heart a little &amp; has some awesome action as well. The artwork &amp; character designs are amazing, every single character even minor characters are so unique. The backgrounds are beautiful as well. The music is amazing, everything is spot on. This is one of the better anime movies, check it out especially if you were a fan of any of the titles listed above, I can almost guarantee you'll really like this.<br><br>4/5 Why? Really well done, solid story. Amazing artwork &amp; animation. Perfect matching music. Solid movie, if your looking for a good anime movie that your going to enjoy check it out.","user":"mercfma","rank":[18,20]}]