[{"title":"Surprisingly good, very refreshing, brilliantly original","rating":8,"date":"11 December 2016","review":"Wonderful cast of characters, charming situations, interesting pleasant characters - paused 36 minutes into it to say I found it absolutely flawless so far. Its understated and simply done. As I have said in another review when you do something simple it becomes a measure of how well you do something. <br><br>This is so very well done.<br><br>I am looking forward to other projects from this film maker (writer director).<br><br>First time I ever saw a really good film coming from Kansas City, Missouri.<br><br>I only found this by searching for Christina Grimmie - poor dear.<br><br>This should help memorialize her with happy thoughts.","user":"michaeljtrubic","rank":[17,23]},{"title":"Amazing emotional subtlety","rating":10,"date":"11 December 2016","review":"Christina Grimmie delivered an amazing performance, conveying dozens of subtle emotional nuances through the lens of a Jazz singer. Look past some of the production quality challenges, and you can see fine-grained balance of passion and reservation. You see this coming through as a deep well, knowing there are plenty of resources held in reserve. There are dozens of examples of this, mostly during interactions to Wesley Elder's character, where she conveys far more through her subtle but precise facial expressions and voice tone (using dozens of combinations) than the words she uses. The result draws you into this light hearted story, and feel what this character feels, without taking you on an emotional roller coaster.<br><br>The world lost a sweet and talented soul six months ago, with tons of potential to continue to impact the world. Fortunately for us, she left behind this performance that was both sad and fun at the same time... \"(to make) you feel better about the bad stuff.\"","user":"hallkw","rank":[19,27]},{"title":"better than you are expecting","rating":8,"date":"18 December 2016","review":"the movie is awesome. this movie has everything comedy, romance, drama.I was waiting for this one since the movie has Christina Grimmie whom I want to see as an actor. For those people who don't know Christina Victoria Grimmie, she was an American singer, songwriter and YouTuber known for her participation in the NBC singing competition The Voice and for her covers of hit songs by contemporary pop musician. Well, she did a great job with Wesley elder in the movie. Both actors played the character perfectly. Must watch the movie if you like a romantic comedy. One more thing the jazz songs cover by C.G is awesome. Enjoy this movie. Thank You.","user":"ravinfox","rank":[10,14]}]