[{"title":"Not What I Remember","rating":3,"date":"21 March 2017","review":"I grew up in Cole Harbour. The racial tension that exists or has existed at Cole Harbour High(school this is based on) between white kids from Eastern Passage and black kids from North Preston is very well known here. I'm old enough to have witnessed a time when racism was pretty overt everywhere and I certainly remember the \"race riot\" and subsequent other racial incidents that broke out at Cole Harbour High. Although I wasn't personally involved.<br><br>Now I totally understand and forgive the film for having to be adapted to modern day for budgetary reasons. However I cannot give the film the praise I would like to. Little X definitely does a good job directing. The acting is average to sub par at best, although I do give a special nod to Shamier Anderson and Jeremiah Sparks for bringing some sense of authenticity to the cast. The biggest issue I have is with the script. <br><br>It just doesn't depict race relations in a way that resembles reality. It lacks depth and nuance which is apparent to anyone with any real experience living here. I don't need to spoil the story to say that the white characters are portrayed as very one dimensional and it depicts black characters as reacting to, or on the defense to white racism. This just isn't the way it really was. Black students involved were not victims at all, but instead equal participants/antagonists to the foolishness. The filmmakers did make some effort as to not come off as totally biased but in the end it fails. Sadly.","user":"zinou-95849","rank":[13,21]},{"title":"Good Movie","rating":8,"date":"20 February 2018","review":"I thought this was a good movie and I disagree with a previous review that the acting was sub par. It was good acting. And I also disagree that the real Blacks involved in the school incident were not innocent at all. Even in the review you can see the bias. Which is ridiculous.<br><br>Anyhow, it's not a movie you'd want to see at the movies, per say. More like a cable movie. But it does accurately depict blatant racism, reaction to that racism and police, school and authoritative bias towards minorities. <br><br>It seemed a little incomplete towards the end. The villain was not dealt with. But maybe that's the narrative: that racists, especially ones of wealth and privilege, often get away with their misdeeds. I also would have liked to have know how it turned out for the young couple. I'd say, it's fine to watch at home. I did not feel like I wasted my time.","user":"ladytiffknee-65172","rank":[2,2]},{"title":"Slapdash not a slapshot","rating":3,"date":"3 April 2017","review":"Mattie is a high school student with prospects in the NHL. However his town in Nova Scotia is racially divided and tensions are high. Mattie's brother is already in the wrong side of the law, Mattie himself is in a tentative relationship with a mixed race girl. However she has a white boyfriend who hangs around with friends who are racists. On of them calls his coloured teacher, an ape.<br><br>Director X is better known for his music videos, however the writing in this movie is like a student essay at times. Weak, cumbersome and predictable. It is lacking in nuance, subtlety and even intellect.<br><br>Mattie's dreams are in danger of being shattered because of bad lack and being in the wrong place at the wrong time on too many occasions. In fact every white folk he meets, the random police officers he encounters have basically got it in it for him. Even the sports coach at college calls him derogatory names.<br><br>The film is even handed as to who is good and bad, there are few saints and more sinners in this film but the message is too simplistic and blunt.","user":"Prismark10","rank":[5,8]}]