[{"title":"No excuses: Bad film is bad film.","rating":2,"date":"11 August 2017","review":"When a movie isn't very good, it just isn't very good. When you rate a film higher than it should be rated because a) it was made by your friends, b) it was done on a really low budget, c) it was made in a country where they usually don't make movies, d) gosh, they really tried hard, etc. then you're not being honest. \"It's good for what it is\" doesn't make it good. This movie isn't very good. Yes, the cinematography, at times, is the best part of this film. Some of the CGI is passable. One or two actors were OK, at times. Sadly the majority of this film comes off as amateurish and juvenile. The acting is high-school drama-ish. The script feels like it was written by a teenager. It's derivative of so many other films, in particular, \"I am No. 4.\" The music isn't terrible, but it's placed inappropriately throughout the film. And the pacing, the timing, the editing... it's laborious.The romances were entirely unnecessary, and the film shifts focus so many times that it's hard to know what it's about. I think the film was hurt most by a lack of a consistent production design. It's all over the place and lacks continuity in look and feel. I think, as a project, it's a good first attempt by young film-makers, but it fails to stand up with serious, professional productions. If you take the time to watch it, (I saw it for free on Netflix) be prepared and don't expect much.","user":"bobbyf","rank":[34,36]},{"title":"Thought this was going to be an Asylum opus...","rating":1,"date":"2 September 2017","review":"Since Netflix continues to try and camouflage its \"bad movie\" stash (by getting rid of star ratings), it's hard to know what you're wading into. Anyway, I figured this was an Asylum rip off of something. Lo and behold, I ran into something much, much worse. <br><br>I raised the white flag at about 18 minutes, which I thought was pretty sporting of me. <br><br>This is the worst movie I've seen this year. By quite a bit. This will appeal to a small subset of \"so bad it's good\" viewers, so if you appreciate low skill and even lower budget, this might not be too bad. The script has some howlers in it. The \"actors\"....hahahahaha. <br><br>Let this one go by and watch Battlefield Earth instead if you have to watch a crappy Sci-Fi film. That one's more fun.","user":"tcplotts","rank":[24,26]},{"title":"Endless Exposition Spouted by Amateur Actors","rating":2,"date":"16 October 2017","review":"From time to time, there will be a special effect spectacle, linked together by characters in unlikely situations explaining the story line via stilted dialogue. Scenes are cut together oddly, such as characters being pursued in a crowded city at night, then we suddenly see them in broad day light in a rural setting. The cast perform like people collected at random and given dialogue to recite a moment before the single take used to capture the scene. There were a couple of quality props, but over all the production communicated a lack of budget. I felt I had to give it a 2 out of 10 because the images were in focus and the sound quality was good. There was nothing compelling about the story. None of the characters were developed to the point where anyone would care about them. Hopefully everyone was paid well to create this mess of a movie.","user":"allen-roulston","rank":[16,17]}]