[{"title":"Tragic but true story of three women held captive for ten years","rating":7,"date":"5 May 2015","review":"This drama is based on actual events that occurred over a period of more than ten (10) years. The actual perpetrator Ariel Castro was 42 when he first abducted Michelle Knight on August 21, 2002. Michelle was in the process of trying to regain custody of her son from the state when she was abducted. Michelle had agreed to get in to Ariel Castro's truck as she knew Ariel's daughter so she failed to see any danger in getting in to Ariel's truck at that time.<br><br>Subsequent to Michelle Knight's kidnapping Ariel then kidnapped Amanda Berry on April 21, 2003 and Gina DeJesus on April 02, 2004. The film focuses mainly on the relationship between the dominant kidnapper Ariel Castro (played by Raymond Cruz) and his first victim Michelle Knight (played by Taryn Manning). The film does more than an adequate job in the 90 minutes made available to capture the imprisonment of the three young girls and how Ariel Castro first physically and then mentally subjected his kidnapping victims to torture to the point that they knew if they even attempted to escape they would receive a beating.<br><br>Fortunately for the films viewers we were spared any vivid graphic violence and rape of the three girls. Actor Raymond Cruz recently starred in the multi Emmy winning series Breaking Bad as drug kingpin Tuco Salamanca. For those of you who have watched Breaking Bad you will be familiar with Tuco's violent and crazy side so when I first heard that Raymond Cruz was playing the role of the vile Ariel Castro I was a bit concerned that the film may include some gratuitous violence as it was in Raymond Cruz's capacity as an actor to emulate this scum of the earth kidnapper Ariel Castro. Fortunately the director Alex Kalymnios chose to maintain a factual film theme and limit the depiction of the hundreds of rapes and beatings that Ariel Castro subjected his victims to.<br><br>This 90 minute film also does a good job of encapsulating the friendship and feeling of family the three girls shared which most likely made it a bit more bearable under the circumstances of being chained, beaten and repeatedly raped. As in the actual events we get to see how Amanda Berry gave birth to Ariel Castro's daughter with the assistance of Michelle Knight who was threatened with death if she did not succeed in ensuring Amanda's baby lived.<br><br>It is sad to realize that Castro's first victim, Michelle Knight was considered a runaway and very little was done to look for her as she was 21 years old at the time of her abduction. The press and police had communicated publicly that she most likely chose on her own accord to disappear as she had lost custody of her son to the state. Taryn Manning who played Michelle Knight made the audience feel how a kidnapped victim may have despaired as the years progressed and the abuse continued. In fact the film also depicts how Ariel Castro beat Michelle up when he felt she was pregnant with his child and so he ensured Michelle would abort the fetus by hitting her in the stomach with a barbell and kicking her in the stomach.<br><br>This is both a film about hopelessness, family by circumstances, and the evil of men with no conscience. Castro was arrested on May 06, 2013, more than 10 years and 8 months since he first abducted Michelle Knight. As mentioned earlier the films run time was only approximately 90 minutes and maybe the producers could have provided more in depth of the psyche of both the perpetrator Ariel Castro and the victims at the time of their abduction who were Michelle Knight (21), Amanda Berry (she turned 17 the day after her abduction) and the youngest and last of his victims Gina Dejesus (14) had the film been produced as a 4 or 6 hour mini-series.<br><br>I felt the producers did a very good job in providing the facts of this 11 year case history. Remember when Castro was arrested on May 06, 2013, CNN news carried the story almost exclusively for the next two weeks, 24 hours a day. No one could believe that not one but \"THREE\" young girls who were missing and presumed dead for years were being held prisoners less than 3 miles from their own homes. By the end of the film it leaves us with the question if Ariel Castro deliberately wanted to get caught and so he neglected to lock the front door because he was behind on his mortgage payments, could not afford to feed his 3 captors and his child, and after close to eleven years of maintaining a prison in his home he had just had enough of the lies, beatings and rapes that he had been responsible for.<br><br>This is a tragic but true story that covers a lot of abuse and actual events that the kidnapper Ariel Castro was able to hide from his own children, his band mates who actually practiced as a band in his home, and his two brothers who were initially also arrested under the assumption that they had to have known about the kidnappings and 10 year imprisonment when in fact Ariel was able to keep everyone fooled including his own family by keeping locks on the basement door as well as the upstairs bedrooms and by sealed windows.<br><br>I hope the victims benefit financially from this film and if so I recommend the film to parents and children alike to ensure one of the films messages is clear. That message being if you are getting in to someone's vehicle make sure your family knows where you are going and with whom you are going. I give this true story a 7 out of 10 rating.","user":"Ed-Shullivan","rank":[29,37]},{"title":"The Cruel Story of a Monster and His Victims","rating":8,"date":"23 September 2015","review":"In 2002, the single mother Michelle Knight (Taryn Manning) is walking to the court for the custody case of her five year-old son Joey, of whom she had lost custody. She realizes that she is late and accepts the ride from her acquaintance Ariel Castro (Raymond Cruz), who is the father of a schoolmate. He lures Michelle telling that his dog delivered several puppies and he would like to give one to her for Joey. Once inside his house, he imprisons her with chains in a dark room. For eleven years, Michelle is beaten and submitted to sexual abuse and abortion. In 2003 and 2004, Ariel also kidnaps and abuses of Amanda Berry (Samantha Droke), who has a child with him, and Gina DeJesus (Katie Sarife). In 2013, Amanda succeeds in escaping from the house and the police arrive and release the women.<br><br>\"Cleveland Abduction\" is a great TV movie that tells the cruel story of a monster and his victims. The direction and performances are impressive for a movie made for television. I still recall this notorious case in the Brazilian news and it is very sad to see how cruel a human being can be. My vote is eight.<br><br>Title (Brazil): \"Sequestro em Cleveland\" (\"Cleveland Abduction\")","user":"claudio_carvalho","rank":[15,18]},{"title":"A Rather Distant Feel To A Real Life Horror Story","rating":6,"date":"12 May 2015","review":"The Cleveland abductions ? You remember that don't you ? No ? Let me refresh your memory . , A couple of years ago police in Cleveland Ohio raided a house belonging to one Ariel Castro who as it turned out kept three young women as captives . One of whom Michelle Knight had been held prisoner for eleven years . You remember it now and it'd be impossible to forget this true life horror story and this TVM tells of Michelle's ordeal <br><br>Now to be fair having the story told through a television film via the Lifetime Channel is both a blessing and a curse . A blessing that we're not going to be subjected to extreme exploitation that's going to keep us awake for nights on end due to the disturbing subject material but at the same time a curse that the restrain of a TVM really doesn't do the story justice . In this medium it's a rather uneasy mix but doesn't stop an opening caption that \"Contains distressing scenes . Viewer discretion advised\" . The constant rapes and beatings of Michelle are thankfully left mainly to the imagination but at the same time you're left thinking that this isn't due to any cerebral reason except that you're not allowed to show that type of stuff on the channel . In other words the story is shaped by outside criteria that have got absolutely nothing to do with the story and everything to do with outside factors . Another irritant is that you never get to feel much in the way of Michelle's hopes of ever being rescued being dashed time and again which I'm sure must have constantly happened . None of this is helped by the feeling of time passing being conspicuous by its absence and much of this TVM feels like it has taken place in 90 minutes rather than the eleven years of Michelle's real time imprisonment . There's not enough foundations for the audience to emotionally invest enough in to Michelle's ordeal which is terrible but at the same time abstract which means despite the compelling subject matter the characters remain entirely distant","user":"Theo Robertson","rank":[21,32]}]