[{"title":"A rare film from the South Pacific","rating":1,"date":"1 November 2015","review":"Tanna is a small island in the South Pacific, part of the nation of Vanuatu. The traditional way of life is still prevalent there, so Western sensibilities have to be put to one side for this film featuring tribal dances, pig slaughtering and penis sheaths.<br><br>Dain is a chieftain's grandson and Wawa granddaughter of a shaman. The pair are in love, but when a long-standing rivalry with a neighbouring tribe once more erupts into violence, Wawa's hand in marriage is promised to a warrior of that tribe as part of peace negotiations. Forbidden by their elders from being together, Wawa and Dain resolve to defy their families.<br><br>So far, so Romeo and Juliet. Except that this is based on actual events that happened barely thirty years ago, making the film an account of a relatively recent way of life on the isolated island - unsurprisingly, as directors/producers/scriptwriters Martin Butler and Bentley Dean usually work on documentaries. As you would expect from a cast of non-professionals, the acting is of variable quality, but the cinematography - from the lush forest to the barren landscape of the island's volcano, lit only by occasional eruptions of lava - is stunning. And how often do you see a film from the South Pacific?","user":"euroGary","rank":[34,37]},{"title":"Beautiful and visceral cinema. Degree of difficulty = 9 out of 10","rating":9,"date":"5 October 2016","review":"'Tanna' is what cinema is all about. Storytelling using the visual medium to illuminate and transport the viewer into another world. Collaborators Bentley Dean and Martin Butler have long histories in journalism and magazine current affairs and have achieved success with their documentaries, but this is their first feature film. They have intrepidly ventured into the picturesque locale of the Vanuatu island of Tanna and its indigenous folk for this tale of star crossed lovers. <br><br>Whilst using an age old narrative theme, the conflict at the centre of 'Tanna' is whether to go with your heart or your head (here represented by tradition and tribal custom), the filmmakers have beautifully photographed and captured the daily life and tribulations of this somewhat cloistered population. Plucked from the very villages they were born and raised in, the performances are really fine; having been well cast to handle the daunting task of acting in a movie. Of particular note for me was the wonderful Marcelline Rofit as the younger sibling of the betrothed lead, played by Marie Wawa. Her eyes taking in everything around her and affected by the changes are really fascinating to observe through her perspective. Mungau Dain plays the forbidden object of desire for Wawa, and according to the filmmakers he was chosen for the leading role as he was the most handsome in his tribe. He has a perfect mix of sensitivity and strapping masculinity. The two leads work very well together. 'Tanna' makes filmmaking look easy, but the degree of difficulty cannot be underestimated here. With a remote location, a cast that had never seen a movie, let alone acted in one; the cultural respect and fascination of Dean &amp; Butler is evident in their sensitive and at times majestic portrayal of the peoples of Tanna. Bentley Dean's evocative cinematography and Antony Partos' effective score add to the atmospheric feel of the look and sound of the film. There is some tart dialogue that injects some needed humour and humanity into what might have been a conventional story. For me, seeing filmmakers explore unchartered terrain; both cinematically and culturally engenders more enthusiasm for contemporary film. There are plenty of formulaic directors and writers perpetuating the same notions of mores and perspectives, so it is refreshing to spend a couple of hours with other peoples and other customs. And it is a most affecting and enriching experience.","user":"david-rector-85092","rank":[28,30]},{"title":"When will this be widely available in the US? Well worth watching!","rating":10,"date":"22 May 2016","review":"I was lucky enough to see this amazing movie in Vanuatu in March. I am frustrated that this movie is not widely available in the US and you can not buy the DVD here. This movie is beautiful. You are transported to another culture dealing with the universal issues of love, family and community norms. <br><br>What is even more amazing is the actors are not trained actors but villagers. They do an excellent job.<br><br>The movie is visually stunning. Shot in Vanuatu on location with an active volcano in the background adds to the emotion.<br><br>Hope others in the US get the opportunity to see this.","user":"daradwest","rank":[19,23]}]