[{"title":"Confirming the Value of The Confirmation","rating":8,"date":"3 June 2016","review":"This is one film where the synopsis does not do the film justice. If I had only read that, I doubt if I would have watched the film at all. Even though the summary is correct, it fails to elucidate the subtleties in the plot and the fine acting that underpins the storyline.<br><br>First of all, I hate films that feature kids. The kids are all stereotyped in most films. Either they are too cute or too cynical, spoiled, and arrogant to be compelling. You can be sure that 1) they will be the one that cause the problems or 2) they will be transformed into 'good kids' by the end of the film.<br><br>Jaeden Lieberher, who plays the main kid role, is believable. Clive Owen, who I think is often underrated as an actor, does his usual solid performance as a recovering alcoholic-father. But it is the supporting actors who bring this slice-of-life drama to perfection. The emotional fine points in the plot could not have come through without them.<br><br>After watching it myself, I decided to watch the film with my 13-year-old son. Normally, he likes the action movie, super hero, special effects-laden films, so this was a bit of a transition. The verdict? He could associate with a lot of the interactions that went on in the film from a kid's point of view and enjoyed watching it. Adults will like it for the insights into adult relationships.<br><br>It will not be for everyone. I would guess most kids will be waiting for the next exploding car or 15 minute fight scene, which will never happen, just as they never happen so frequently in real life.<br><br>I know this film will pass largely unnoticed, which is why I felt obliged to write a review of it. There are those filmgoers out there who still appreciate a good film in its purest form.","user":"SteveMierzejewski","rank":[39,48]},{"title":"If I had to chose between the new Marvel movie and this one I would choose this one hands down.","rating":9,"date":"1 May 2016","review":"\"I don't know what kind of trouble he can get in in a day.\" Anthony (Lieberher) is 8 years old and is about to be confirmed in the Catholic Church. He has a hard time thinking of a time he sinned and lives life without conflict at all. When his mother and step-dad go on a retreat he isn't excited about spending the weekend with his alcoholic dad Walt (Owen). What starts off as a typical weekend with him slowly changes into 2 days that change the lives of both of them. This is just a great movie. This has everything I want in one. Great acting, a great story and nothing too over the top or unbelievable but touching and heartfelt regardless. It was just a pleasure to watch the interaction between the father and son and how, without overtly trying, they help each other to become better people. This is a very good family movie and is one that you can watch and enjoy with everyone. Every once in a while a movie comes along that needs to be talked up in order to get the audience it deserves. This is one of those movies. If I had to chose between the new Marvel movie and this one I would choose this one hands down. What you lose in effects and action you make up for in acting and story. To me that is more important. Overall, a movie I highly recommend and the best family movie since Little Boy. I easily give this a A.","user":"cosmo_tiger","rank":[39,50]},{"title":"Coming-of-age: A boy's real world encounter.","rating":8,"date":"4 September 2016","review":"For the first time direction, it is not a bad film. The 'Nebraska' writer did his best and I'm totally surprised how this little Canadian gem was not recognised extensively. In fact, it is one of the best films of the year among the PG13 ratings. A drama about a divorced freelance carpenter who babysits his son on a weekend, adventuring the city while preparing for his work on the Monday. When someone stole his tools, they both go after to look who took it and that takes the whole film to cover with some other small events on the side.<br><br>Truly a heartwarming drama. You can compare it to films like 'The Pursuit of Happiness', but it had its own way dealing with the story contents. This is not a comedy, but slightly it is fun, as well as inspiring. It narrates the world is full of good and bad, and how we react to them accordingly. Particularly the main character who was desperate to come out of the bad day and to have some quality time with his son. It actually stayed neutral on the topics like theism and atheism, which has some influence in the narration, but revolved carefully around the social and other issues. So that makes there are more things to care about than fighting for nonsenses. That was really a good thing to focus on, maybe that's why I loved it.<br><br>The opening and the end take place in the same location, but the difference was the 24 hours and its events. During that time, a boy who was struggling between what his mother believes and his doubts over those beliefs were somewhat influenced to clear his mind. I mean it was not intentional, the film to explain us through the boy, but they were described in the way of someone's daily life base, except it was not an ordinary day for him/them. It was a quite interesting take, and in the current world scenario, this is a wonderful theme for a film which also has high entertainment value.<br><br>\"Well, I don't know what kind of trouble he can get in in a day.\"<br><br>I don't know the Christian commandment (or any religious's equivalent) that referred in it, especially the meaning of the title, but according to the writer, he wanted to tell what happens if a good behaving young boy breaks all the rule in just one day. Besides, a bit of his own life experience, as well as the outline was inspired by 'Bicycle Thieves'. I don't know how the religious people take it, but I enjoyed it, kind of it is an awareness theme about the reality of the human world. So my disappointment is not the film, but how it was received. Once again an English film from the other region was turned down by the Americans. I hope the rest of the world won't react same way.<br><br>It revolved between a father and son characters, so the side contributions were good, but does not require any praise. The Clive Owen, who I consider an ordinary actor was brilliant in this. He is not in any film franchise, especially the current trends superheroes and/or sci-fi, though happy to see him in such a beautiful one-off film. The boy was equally good, especially after the good show from 'St. Vincent', this is his another great character display. Looks like he's going to be a big name in the future.<br><br>You can't believe it is just a 2 million dollar film. Great production quality with good performances, a better outcome than usual film with the same production value. From my perspective, it is an underrated film and also an undernoticed film. A fine film for everyone, particularly for the family audience. These are reasons why children as well should watch it, like there are no sexual or drug related material in it. Though the real reason is there are some contents that might help them to understand about such as financially struggling and sober parents, the reality of the society and as a coming-of-age film, it always kept its priorities on the top while narrating the tale, especially from the children's viewpoint.<br><br>8/10","user":"Reno-Rangan","rank":[15,19]}]