[{"title":"They came, we laughed and the movie conquered","rating":8,"date":"16 February 2018","review":"Well I'm just paraphrasing of course. And the movie did not conquer judging from the voting so far. But comedy is in the eye of the beholder, so if you are not into silly horror comedy, you may feel insulted (by the movie and by my vote). But if you have a heart for low budget movies, who do achieve a certain quality and originality, then you will feel what I did when I watched this at the Fantasy Filmfest last year.<br><br>The acting is good, the script had quite some funny ideas and it's really something you can enjoy if you let yourself. I did not expect this to be as much fun as it turned out to be and I'm really happy with what they came up with. The story is not new and what the characters have to go through is not new either. And others have gone the comedy route when it came to this kind of horror ... but it does have a couple of ideas it has that really do work. And the effects are not half bad. So again, this may or may not be for you - but the movie gives it its best shot","user":"kosmasp","rank":[36,51]},{"title":"If u enjoyed Eight legged freaks, dirt bike sequence from Point break n Starship troopers........","rating":7,"date":"19 April 2018","review":"Saw this on a pirated dvd. The trailer was enticing n the synopsis n settings more like Eight legged freaks.\nThe opening sequence was more like Starship Troopers, where two military men r firing at giant ants.\nCut back n v see some beautiful villas in the desert town n even more better is the amazing dirt bike racing scenes reminiscent of the new Point Break film.\nHordes of deadly giant ants attack a group of youngsters partying in the middle of nowhere. The effects of the giant ants were cool n the bike action sequences were really cool, particularly during one chase sequence with the giant ants in pursuit. Remember its a very low budget film n it managed to entertain very well. Also noteworthy is the cinematography.\nWhat more could you ask from a monster movie?","user":"Fella_shibby","rank":[26,38]},{"title":"A missed opportunity","rating":3,"date":"13 October 2018","review":"(Warning: contains mild plot analysis which some people might consider a spoiler)<br><br>I've always been a giant fan of It Came From The Desert on the Commodore Amiga 500, one of the best games on that system and way ahead of its time. So imagine my surprise decades later when I heard that a movie was in the works.<br><br>Video game adaptions into film though are usually terrible, so I approached this movie with caution, however I was left disappointed. The story differs completely from the game, it references bits of the game but it has a new location, new characters and doesn't even take place in the same time period like the original game. Worst of all, there isn't even a small town, or the infamous hospital, all the atmosphere of the original game is gone in his movie.<br><br>As it happens though the movie starts off pretty well, it has some good references to cheesy action heroes and despite being a 90 minute movie it at least makes some effort to set the scene and the characters early in the beginning, there are some great camera scenes with bikes driving across the desert.<br><br>The film is meant to be played as a comedy, but it doesn't seem that way. One liners seem forced and at times, each of the main characters, they sometimes say something or do something that seems jarringly out of place for their portrayed personality.<br><br>Unfortunately though the main problem with this film is with the star of the show, the giant mutant ants themselves and at times the terrible special effects. The ants don't look all that good, there is something not quite right about them, they are supposed to be fire ants, but they are a weird fleshy pink. The ants and their physics, they seem very floaty, when the scene is full of them, their lighting and resolution, they just don't look like they are in the same scene, which is a big shame.<br><br>The behavior of the ants is also a major concern. At times you can run away and shut the door behind you with ease, but then they can sudden;y run faster than a full speed motorbike. In one peculiar scene they'll just run straight into gun fire like lemmings, all of them. <br><br>They're either intelligent or very stupid, a plot point is that they need to bring back bodies to the nest but they will sometimes still kill or be eating people. Rules about the plot and what is supposed to be happening, things just change on the whim, considering this is supposed to be the desert, everyone is drinking alcohol but there is no food in sight.<br><br>The whole film is very inconsistent which made me sad because sloppy writing and haphazard directing has made what could have been a good film into a bad one. At times I kept thinking about Bill and Ted.<br><br>The worst thing for me was that the ants make weird giggling noises, as if some of Steven Spielberg's Gremlins were present in the background. Why?\nThey should have used the trademark noise of the ants that was in the Amiga game, one guy has a ring tone that takes music directly from the video game and is one of the films good gags, so it's not like they couldn't have used more assets from the game, after all they even put footage of the ACTUAL GAME in the ending credits...<br><br>Yeah, it's watchable, you won't have an awful experience, but I doubt you'll ever want to see it ever again.<br><br>I highly recommend watching the 1950's classic film THEM, the original black and white film that It Came From The Desert is originally based on. It might be old but it's so much better than this one.","user":"gultineil","rank":[6,8]}]