[{"title":"Predictable for adults, cute for the youngest","rating":4,"date":"9 November 2015","review":"I couldn't bring myself to finish the whole movie, though normally I don't mind the harmless fun of these. <br><br>This movie feels like a fan-fiction that was written quickly and the animation reflects a lot on the overall feeling that this movie was never intended to be more than some harmless fun for an hour. While the characters do look like the toys, I found the bucket-fill colors to be very straining on the eyes at times. <br><br>Despite the title having \"Barbie\" in it, the main character is called Kara. She's a princess and one day gets kissed by a radioactive butterfly and gains superpowers. Then not much happens in terms of plot. Occasionally she rescues some people, but mostly it's flying through the skies with pop music playing. There seems to be no focus as to what the plot should be. Things just seems to happen so that Kara can react to it. We're introduced to a villain at the start of the movie, who does have a clear motive: He wants the kingdom instead of Karas family. After 10 minutes of screen-time, this character simply vanishes. After about 40 minutes of pop-music, flying and random rescue scenes, he is back again. Only to disappear again for some more scenes about the superpowers and harmless interactions with Kara and her friends. And then he returns a moment and then back to harmless.<br><br>It's not a horrendous movie, so I can see little girls liking it. I don't think I hate anything about the movie, I just don't feel it's as engaging story and character wise as Disneys \"Tinkerbell\" movies.","user":"morphricky","rank":[1,1]},{"title":"The very young demographic that is hyped up on sugar and love bright colors and loud pop music will get a kick out of 'Barbie in Princess Power'.","rating":3,"date":"11 August 2015","review":"Have there really been 29 films based on 'Barbie'? Yes there has, and the 29th one is here with 'Barbie in Princess Power', which is sure to delight all of the young kids who love seeing splashes of bright colors, glitter explosions, and bubble gum pop songs set to their favorite doll. As usual with these types of animated films, specifically the 'Barbie' ones, there is only a very small demographic the filmmakers are interested in here, which are mostly kids under the age of eight I imagine. Every story plot is predictable, nor is there any real tension or suspense.<br><br>The villains of the story never meet a gruesome demise, but rather come around to the \"light side\" of things, complete with a ton of super poppy music to entertain the small ones, which is exactly what the filmmakers know that works. These writers and directors know their core audience to a tee, and they execute that precise formula to get the kids excited for the next 'Barbie' film, even if it looks the same to us adults. In this particular film, we have Barbie, or shall I say Kara, who is a princess who wants to build a community garden for all the people of the land to enjoy. Although, her parents would rather her learn to be the stereotypical princess by learning the ways of royalty and waving in parades.<br><br>All Kara wants to do though is make the world a better place with her garden and helping people. Kara gets what she asks for when she is kissed on the cheek by a butterfly, that turns her into a flying superhero named Super Sparkle, where she fights petty crime day in and day out with the help of her friends. Soon enough, her cousin Corinne becomes jealous of her superpowers and forces the butterfly to kiss her cheek too. Corinne then becomes the arch enemy to Super Sparkle, as she is now known as Dark Sparkle and the battle of pink and purple begins. Meanwhile, there is a much more evil force about with Baron Von Ravendale, who believes he's in charge of Barbie's kingdom, and now the Sparkle twins must set aside their differences to fight something bigger than their jealousy.<br><br>The story here is really only something a young kid would enjoy, and that they certainly will. There's enough loud music and adventures for them to hang onto through its 70 minute runtime without becoming bored, but if you're older than eight, you'll be bored and annoyed out of your mind, thinking that this whole story could have been told and executed in under ten minutes. The kids will certainly learn life lessons here, particularly that of loyalty and friendship by the end. The animation is decent, but isn't great though, so don't expect a Pixar quality looking movie. That being said, the very young demographic that is hyped up on sugar and love bright colors and loud pop music will get a kick out of 'Barbie in Princess Power'.","user":"bryank-04844","rank":[1,1]},{"title":"The main character may have had super powers, a shame that that didn't translate in the rest of the film","rating":4,"date":"6 August 2017","review":"It is very easy to meet the 'Barbie' films with a lot of dislike and scorn and they are all very lowly rated here (despite some favourable reviews). It is understandable to take issue with the dialogue (a fair few are ropy in this regard), the predictability of the stories, the odd annoying character, the animation in a few (not all are well animated) and whether there is enough for adults to keep interest.<br><br>Despite not being the main target audience, to me they are mostly better than given credit for, easy to take them for what they are and don't deserve to be dismissed as baby-ish and for little girls only (a very narrow minded generalisation). Are they animation masterpieces? No. Are they among the best films ever made? Again no. Are they worth watching if taken for what they are? Absolutely for most of them. Most of them look good if not having the polish of studios specialising in computer animation (Pixar for one), often great music, good lessons and messages, a good deal of charm, have their heart in the right place and have entertaining characters well voiced (some had actors of considerable calibre like Tim Curry, Anjelica Huston, Martin Short and Kelsey Grammar, all of them terrific in their respective outings Curry especially) and a likable title character that particularly young girls can relate to.<br><br>Like 'Barbie and the Secret Door', 'Barbie in Princess Power' didn't do much for me. Certainly it is much better than 'A Fairy Secret', 'A Fashion Fairytale' and 'The Princess and the Popstar', it would take a lot for a 'Barbie' film to be worse than those three. However, it is no 'Nutcracker', 'Diamond Castle', 'Island Princess', 'Pink Shoes', 'Prince and the Pauper' and '12 Dancing Princesses'. As far as 'Barbie' films go, 'Princess Power' is in the lower end.<br><br>First of all, the good things. The animation mostly really isn't bad, trust me anything from Video Brinquedo and Spark Plug Entertainment and all the (computer-animated) 'Swan Princess' sequels and those for 'Alpha and Omega' are far worse looking than any 'Barbie' film put together, have never felt physically ill watching a 'Barbie' film even the ones that are not good. There are some (not all) beautiful bright colours, handsome and imaginative backgrounds and the character designs and movements have natural freedom rather than being stiff.<br><br>The messaging is also very nicely done. Appreciated their positivity (like with team work, helping others and being brave) and how they were put across in the film, making their point without being preachy if perhaps not exactly subtle. The leading character Kara, like most of the Barbie heroines, is likable and resourceful, she's easy to relate to and she can be considered a decent role model.<br><br>Voice acting is pretty good and done with a lot of spirit. Cannot imagine Barbie without Kelly Sheridan (the 'Barbie' films without her did suffer from her absence on top of even bigger problems) and she continues to grow.<br><br>However, while the animation was mostly not bad, there were some colours that did get over-excessive in their brightness. The music did to me feel too loud and intrusive, often in need of a toning down so that it didn't drown out the dialogue. For my tastes too it was too teeny bop-ish even by modern 'Barbie' standards. The dialogue has rarely been a strong suit in a 'Barbie' film, even in the films in the better half of the series but not quite among the very best of it.<br><br>That's an understatement in the case of the dialogue here, which really doesn't flow and the worst of it makes the toes curl. Although the characters are nice enough, the lack of character development makes them bland and archetypal too. There could have been much more consistency with the villain, despite a clear motivation this was one underused villain and that the writers didn't know what to do with him was even clearer and more obvious than his motives.<br><br>Once again like 'Secret Door', even there was much more heart and charm in that (despite me generally not caring hugely for that either), the story is too much of a Hodge Podge of ideas tried, tested and already worn to the ground (well thin in this film), giving a real sense that the 'Barbie' series has run out of ideas. It means that the story-telling lacks any kind of surprises, which does take away from properly enjoying it, and that some of it is sometimes dull (while also too hectic, too makes it less forgivable.<br><br>Unlike most 'Barbie' films, there are target audience issues here too. Although how children handle films are often under-estimated, some of the peril (which is more so than usual) may be a bit too scary, even to an older viewer like me who saw the film as how it was meant to be the darkness was too out of place in the loud, colourful and kinetic nature of the rest of the film. Older audiences may find the film too tired, repetitive (there is a lot of action here but with very little variety) and also too saccharine, overly simplistic and sugary sweet.<br><br>In summation, not awful but one of the weaker 'Barbie' films. 4/10 Bethany Cox","user":"TheLittleSongbird","rank":[0,0]}]