[{"title":"Doesn't try to be anything other than what it is","rating":8,"date":"25 February 2019","review":"If you love old school gory psycho killer horror fare this is unmissable. \"Terrifier \" has no interest whatsoever in being smart, satirical or post modern, it just wants to wear its mean spirited, gory grindhouse heart on its sleeve - and good for it.","user":"stuartvanlinden","rank":[31,35]},{"title":"Loved it!","rating":8,"date":"6 October 2018","review":"This movie was insane. I am a horror lover and I don't see a lot of horror movies that actually deserve to be called a horror movie. This one does. It definitely has some of a B movie vibe, but not at all in a bad way. I actually enjoyed that aspect because it felt like it added to the film. This movie is definitely twisted and graphic, but it delivers.","user":"guambrat1","rank":[79,101]},{"title":"certainly the bloodiest mute-killer clown movie ever made! And a fun one too","rating":4,"date":"4 September 2017","review":"Damien Leone set out to make a gore-show, exploitation horror experience with Terrifier, and it's there on the screen in full splendor. This is a filmmaker who has no pretensions in the slightest about what he's doing - I was reminded of this in particular since a trailer for the upcoming Jigsaw, the *eighth Saw film which may or may not be a reboot or at least is a sequel, point is that's a gore-show that thinks it's meaning something when it isn't - and loves the genre. This may not mean Terrifier has much to *say* exactly, but why carp? Sometimes a horror movie can be about the simple things in life, like a silent, homicidal/maniacal clown in black lipstick sawing a young naked woman hanging upside down in half... starting from her privates.<br><br>Another key thing is how much David Thornton brings to this performance (in his feature debut). Good holy crap is he good in this! This is an actor fully committed to playing sadistic, twisted, mean, and yet he's having a blast being this character. Again, he doesn't have a word of dialog - one might want to say there's Mime going on, but that's not entirely true, he just doesn't speak - and yet he doesn't need to speak. It makes it outside of the stuff we usually get with clown characters in horror, even with Pennywise. What would \"Art the Clown\" have to say anyway? \"Hoo-hoo, ha-ha, I'm going to cut off your head and kick it like a football down this grungy cellar hallway?\" There's also nothing at all we know about him either, except that he's killed before and, presumably (spoiler? I don't know) may kill again.<br><br>And lastly the gore is fantastic; Leone loves his practical effects, and all of the bodies are really BODIES, and you can tell watching it. There's no s*** CGI or bad/fake blood, and it also doesn't skimp on the violence like modern horror sometimes does in the name of appealing to \"all audiences\" with a PG-13. This may be going in a massive way in the other direction, to the point where if it's not laughable it's gross. But maybe I needed gross horror tonight, or on a certain night that's rainy and miserable and all that. At the same time Leone subverts conventions here and there, characters you think won't bite it do, and there's some creative color grading to make it more grungy and filthy.<br><br>Will it stay with me or will I revisit it many times like a Texas Chainsaw Massacre or Return of the Living Dead? Probably not. But it did the job well it set out to do, and it didn't do *stupid* things. It kept to what it knew it could pull off and as far as movies involving maniac clowns offing drunk girls and bug exterminators on Halloween night... you could do a lot worse I'm sure!","user":"Quinoa1984","rank":[83,114]}]