[{"title":"Tombraiding Chinese style...","rating":6,"date":"8 October 2016","review":"\"Mojin: The Lost Legend\" (aka \"The Ghouls\", a title which do the movie no justice at all) is definitely not a movie that you should let slip under your radar. I became aware of the movie because I am a fan of Shu Qi, so of course I had to watch the movie. And let me just say that this movie can essentially be summarized as a Chinese \"Tomb Raider\" movie, of sorts.<br><br>The story is about three close-knitted tomb explorers whom is drifting apart, as they are not adjusting to life in USA, after having left China behind. And when Wang Kaixuan (played by Huang Bo) sends an alluring video with proof of an ancient tomb, the interest of the Hu Bayi (played by Kun Chen) and Shirley (played by Shu Qi) is stirred. But what secrets will the Mojin unearth in this ancient tomb? And are the intentions of their employer really what they say? Whom can you trust when you are trapped far beneath the surface of the Earth?<br><br>There is a very good pace to the movie, and it kicks up into a fast and good pace early on, and it doesn't really slow down throughout the course of the movie. And as such, then there weren't really any slow, dull or boring moments throughout the two hours that the movie run for.<br><br>The effects in \"Mojin: The Lost Legend\" were goods and that really helped the movie along quite nicely. Especially because special effects and CGI that prove convincing, realistic or just dazzling awesome are very important to movies such as this. And the special effects and CGI team handled this with flying colors.<br><br>\"Mojin: The Lost Legend\" has a good assembly of cast members. The three lead talents were equally performing well in the movie; that being Huang Bo, Kun Chen and Shu Qi. But also Xiaoqing Liu (playing Madam Ying) was standing out here with her performance.<br><br>If you enjoy adventure movies with supernatural elements, such as \"Indiana Jones\", \"Tomb Raider\" and the likes, then you should most definitely give \"Mojin: The Lost Legend\" a chance. Don't write it off because it is a Mandarin movie, because this movie is definitely a well-worthy addition to the adventure genre.","user":"paul_haakonsen","rank":[7,8]},{"title":"Stunning visual and audio which was dragged to hell by an absolutely dumb plot","rating":4,"date":"25 January 2016","review":"I rarely watch Chinese movies and dramas, but there's a formula in almost every single title I've encountered: the cast is full of dumb side-characters with no brain cell just to make the main characters look cooler than they actually are, which they actually aren't. And often, none of the cast is memorable or like-able, and neither is the plot.<br><br>Mojin-The Lost Legend's production value is high. That's what you can tell from the very first moment you see the movie. If you wonder how great the visual and audio is, just watch the trailer. However, I'm afraid the trailer already shows all this movie offers. Everything else is just... awful.<br><br>As I said, the visual can not save this movie's 5-year-old plot. This movie has lots of suspenseful sequences (4 as long as I can remember), but that's all there is to it. The entire movie's plot revolves around triggering these sequences by whatever reasons just to showcase the visual, the effects, CGI, etc. Let me list some instances where side characters acted like they were brain-dead just for those oh-so-cool scenes to happen:<br><br>1st sequence: We saw some weird-looking thingies. One of our member said those were dangerous. To hell with it, let's destroy them! -&gt; Sh*t happened, lots of people died. Whew!<br><br>2nd (Just after 1): Hey. Those weird-looking thingies are here again. Our people just died? I don't f*cking care! Let's destroy them again. \"We are materialists. We are not scared of anything!\" &lt;- Sh*t happens, running like chickens later.<br><br>3rd sequence: We are in someplace dangerous and full of traps. The experts said do not touch anything. Wow! There's that thing we were looking for. Let's touch it immediately! -&gt; You can imagine the end.<br><br>4th time: Our people just died. Experts said don't wander aimlessly. Why the h*ll should I care? I go where I want to -&gt; die immediately after.<br><br>5th sequence: There's that thing we were looking for, AGAIN! Our people just died from touching the same thing. Oh f*ck we want it so bad. So let me take it! And I'm sorry I don't like wearing gloves despite our people just died from touching the very same thing. Hah! <br><br>At this point I did not care about any of the side characters anymore. They were either brain-dead or suicidal or both. If I want to watch a movie about them, I would not watch this movie in the first place.<br><br>And the main characters, they were okay at most. The movie depicts them as \"Legendary Mojin\" but fails to deliver. There were nothing impressive about them in the film. There were some instances where the hero could showcase his \"wit\", but it is delivered in such an awful way that you might not understand anything and think the writer of this movie was just feeding us bullsh*t in order to make the main hero looks \"smart\".<br><br>The heroine, if you has some understanding about Japanese culture, is a \"tsundere\". She was okay, but her character was not invested enough in my opinion. There was no back-story explaining why and when she met the main hero and how their relationship developed. She was just... there, in the present, insulting the protagonist almost every instance she talked (even though it was obvious she was insulting him because she loved him so much.Hah!); however, in the end, BOOM!, they became a couple. A movie just could not be done right without a happy ending and romance, right?<br><br>In conclusion, if you just want to watch some cool suspenseful sequences and do not care about the plot and how illogical the characters are, this movie is perfect for you. However, if you are looking for something more than just an eye-candy, look elsewhere. This movie is not for those looking for logic and realism.","user":"fugakaka","rank":[23,36]},{"title":"Stunning visuals and very suspenseful","rating":6,"date":"21 December 2015","review":"It's one of those movies that I knew I'd be interested in, going to the theaters. the poster screams action and adventure like Indiana Jones.<br><br>It's a buddy movie with a little romance and fantastic imagery. It's how the Chinese are doing epic these days, outdoing the American blockbuster, or at least giving it a valiant effort. <br><br>The special effects are boss, and the movie comes with a great assortment of charters in a story that untangles in a way that keeps you interested in what happens next.<br><br>But I have to admit, Mojin is not as charming and amusing as they think of themselves, but that might have more to do with the cultural differences<br><br>One of my favorite parts was a scene were the characters just began to drop f-bombs like it was nothing. It felt like the use of this word was not as bad in China as it is in America (especially in sub title form), but it made for a good unexpected laugh from a movie I would have assumed was rated PG-13.<br><br>Mojin is definitely visually amazing. I could watch the imagery for days and it has a great story tied to it. Nice blockbuster made in china.","user":"subxerogravity","rank":[16,24]}]