[{"title":"Warning: Do Not Watch on an Empty Stomach","rating":8,"date":"4 December 2015","review":"This movie places the food centre-stage. And it's the most incredible food you've ever seen. Even raw, being turned into delectable dishes, it's to die for. <br><br>I watched this over two nights, while eating dinner. And it still almost killed me. And I'm a great cook. <br><br>If you possibly swing it, watch this on some mobile device while eating way too much food in a Jewish delicatessen somewhere. As the film itself points out, that's hard to do, since in all of North America there's only 150 left. But otherwise, you're going to be really hungry for several days. <br><br>One small complaint: they left out Montréal. C'mon, guys! The smoked meat sandwich that's MTL's world-famous signature dish was a gift to that city from Jewish delis! They're the reason the French language now contains the word « le smoked meat ». <br><br>Great. Now I'm jonesing for _that_. <br><br>Anyway, see the movie. If I could eat it too, I would.","user":"rkhen","rank":[4,4]},{"title":"Deli-Licious","rating":9,"date":"24 March 2015","review":"I love deli food and I loved this movie. The historical stuff was fascinating, while Ziggy, the main focus, is delightful and lovable. I really have nothing bad to say EXCEPT-- the deli they featured in San Francisco is the only one in the movie that doesn't stick to traditional deli food, but specializes in chi-chi California Cuisine- style variations on the theme. Okay great. But most restaurants in San Francisco, featuring ANY type of cuisine, do the same thing. It's not noteworthy for any restaurant in SF to feature smoked caramelized arugula drizzle. So the filmmakers should have shown a traditional Jewish deli in San Francisco-- - THAT would be special. And one does exist. I went there after the movie and had a heavenly whitefish salad sandwich.<br><br>Okay, rant over. Despite that one major flaw, it's still a great movie.","user":"rnc55","rank":[6,7]},{"title":"Interesting & Fun","rating":10,"date":"14 March 2015","review":"This documentary is about a deli man, the Ziggy of Kenny &amp; Ziggy's in Houston, TX, really David Gruber, a professionally trained chef following in the footsteps of his grandfather who started the Rialto Deli in Manhattan in 1933. David is a 3rd generation deli man. The documentary presents the history and sociology of delis interspersed with brief interviews of owners, patrons and 1 waiter. We visit one of David's purveyors for whitefish.<br><br>The decline of the deli parallels the acculturation of Eastern European Jews. At one time, there were 1500 kosher delis alone in NYC. Today, there are 150 delis in the US. Anyone who lives in a large urban area has seen the change.<br><br>Pastrami was created by Romanians. Who knew? Thank you Romania!","user":"enewslettersource","rank":[11,15]}]