[{"title":"Jackie Chan goes Bollywood","rating":6,"date":"13 October 2017","review":"Honestly, I don't understand the bad reviews. Chan is older, but he still has the moves. The film producers didn't have American millennials in mind when they developed the script. Their target audience was China and India and I am sure the people there loved it. The film, even with its flaws of melding Chinese, Indian and English dialog, is still fun. The car chase in Dubai was incredible and Chan discovering a lion in his car was hilarious. And, in this age of crude and prurient films coming out of Hollywood, Kung Fu Yoga is a good popcorn film for the family.","user":"rbr-41299","rank":[19,21]},{"title":"A fun, picturesque film that explores different cultures","rating":8,"date":"28 March 2017","review":"A fun, picturesque film that explores different cultures.<br><br>It's like Jackie Chan meets Indiana Jones, in China, Iceland, India, and Dubai!<br><br>Some reviewers are slamming JC for making this film, but hats off to him for going outside his cultural expectations and comfort zone.<br><br>I have to give credit to the amazing cinematography and location sets, I'm guessing this must be one of JC's bigger budget films.<br><br>All in all this movie was just plain fun. The car chase scenes with all those expensive cars in Dubai was off the hook, almost Fast &amp; Furious like, but with more expensive sports cars.<br><br>It's a shame for all the hateful reviews... JC still has the moves and is still funny and entertaining as always! <br><br>Oh, and 'Little Jackie' was also a blast, I hope his stomach has settled lol.","user":"TheTopDawgCritic","rank":[48,70]},{"title":"Multicultural Family Film (No Spoilers)","rating":9,"date":"29 August 2017","review":"The overall plot is that Chan teams up with an Indian archaeologist who is interested in a historical legacy that is shared by India and China. Chan's team is devoted to the respect and preservation of this joint history and its ancient roots. (No Spoilers, but things are not quite what they seem.) <br><br>Another great action film featuring Jackie Chan, here a modern version of Indiana Jones with the added touch of his classic kung fu moves. (In fact, Indiana Jones is referenced directly at one point in this movie. (No spoilers!)) Several humorous scenes mixed in with the usual combination of action scenes that are typical in Chan's movies, and as usual kung fu saves the day. It's refreshing to have a family-friendly film. Choreography is great throughout, but most especially in the closing scene, which is meant to emphasize the unity Chan's team strives to discover. <br><br>Great use of costumes and technology throughout the film. Intricate set designs and a few scenes showcasing the beauty of modern India and classic artifacts from both cultures. (Whether the \"artifacts\" are authentic or fictional, I can't say for sure, but the effects are brilliant.)<br><br>(It would have been great to have cleaner subtitles, though, which is really the only negative about the film.)","user":"dishlady69","rank":[15,20]}]