[{"title":"Very boring start, then violence for violence sake.","rating":5,"date":"27 February 2018","review":"I got so bored after 40 minutes I started skipping along the play bar, then I got run of the mill violence. Was there a story behind this experiment, was the violence somehow explainable. Did I even care, it might appeal to some, but on what level I just don't know, and again don't care. Gave it 5 as it had a promising idea and the cast did the best they could with it.","user":"apjc","rank":[6,10]},{"title":"So terrible with a nothing ending","rating":1,"date":"25 June 2018","review":"I've never gone so far as to actually write a review of a film but this one was truly terrible; the protagonist is completely unlikeable and two dimensional, with the supporting roles being equally flat and adding nothing to the \"story\" if you can really call it that. Of course there was an awkward semi romance shoe horned in between two characters who go from completely disliking each other to having sex in the space of about 10 minutes, and it was even more unnecessary and awkward than when it is usually used; it was very obviously an attempt to thicken an extremely thin plot and to humanise an extremely lazily written character. The scenes with the prisoners made for the most interesting viewing, even if their stories were barely (and in some cases not at all) explored. The story feels like it was written by a very unenthusiastic teen for their english class; so much of it was vague and ill explained, not for effect or to add tension, but seemingly because no one involved had any interest in explaining anything. Ever. Even for a film with a fairly short run time (around 80 mins) this movie was embarrassingly poor and lacking detail. The ending showed no form of resolution and, once again like a teen in english class, seemed like a careless afterthought that comes from a lack of direction or planning. Do not. Watch. This movie. Not even to laugh at how bad it is because you wont laugh. There is no way to enjoy this film even ironically. Spare yourself the frustration you will feel during every second and do literally anything else with your time because nothing will be as bad as sitting through this movie. I will say that the concept is good but in order to work it would definitely need a completely different writer, director, producer and lead actor.","user":"carriegreenslade","rank":[2,3]},{"title":"It is a waste","rating":1,"date":"2 March 2018","review":"Never ever allow yourself to even watch the trailer of this movie , it is a rubbish.","user":"crr-94872","rank":[2,3]}]