[{"title":"Hollywood, please, give real screenwriters a chance!","rating":3,"date":"14 August 2017","review":"One would think that a top notch producer-duo like Anthony Bregman and Gary Goetzman, an amazing cinematographer like Matthew Libatique, an unbelievable composer like Danny Elfman, two talented editors like Lisa Lassek and Franklin Peterson, and incredible actors like Tom Hanks and Emma Watson would guarantee a great film, right? -- Wrong... this is why the screenplay is so important. To be completely fair, I haven't read David Eggers' novel, so I don't know if it's good or not, but if we base that judgement on the film, it sure as hell doesn't seem like it.<br><br>Why is the script so poorly written? The first big problem is that we don't know our protagonist's intent or obstacle. We have no idea what she wants, what she's doing to get it, or what stands in her way. This is at the top of every screen writing seminar, course, book, or principle list that you can find. If this is not clear within the first 10 to 12 pages of your script, then don't even bother filming it.<br><br>We do know that she dislikes her job and that she has a sick father whom she loves. But she's not doing anything to help her dad, and she's not looking for a different job either. She does go kayaking though, so... good for her! The job offer (inciting incident) that gets her to embark onto a promised adventure, comes in a phone call from a friend. A phone call that takes our protagonist by surprise. So, to make matters even worse, our main character is completely reactive. Things happen to her, she doesn't make them happen, which makes her dull and boring -- Something one would think could be a big decision-changer for actors like Emma Watson to accept a role in a film at this point of her career. But hey, maybe not! Our protagonist agrees to the interview (a very weird one that includes picking between her favorite Beatle and reacting to an inappropriate invitation to go out with her interviewer) and she gets the job! And now we embark onto the adventure.<br><br>At first, everything is very expository. Tom Hanks' character is introduced as a quite literal Steve Jobs-like company manager, who believes in technology's power to help us know everything about everyone in the world, basically. Then, an opportunity to help her father reveals to our protagonist by, again, the same friend who offered her the interview in the first place. So, our protagonist is yet again reacting to what is happening to her.<br><br>To make matters worse, what pushes her (very late so) to make her first big decision, is that she inadvertently decides to take a kayaking trip in the middle of the night, and go sailing onto the darkness with no life-vest (or even a flashlight for that matter), for a ridiculous nocturnal, meditative promenade (because, you know, YOLO). This really bizarre, nonsensical decision is what propels her to take action with Tom Hanks' character and take an active part of the all-time-surveilling-technology of the Circle. Then the story turns into a modern era \"Truman Show\" without the innovative factor of reality television, and with an improbable audience who is all-love-and-no-hate for our always innocent Mae Holland. (Seriously, this Utopia world presents no haters in the social media.) The technology gets so big, they challenge themselves to find any person in the world, with the help of their hundreds of millions of subscribers. The first person they challenge their users to find is an outlaw murderer woman. She is found within 10 minutes, and guess what? These hundreds of millions of users find her without a shred of mistakes. No one mistakes another woman for her, there are no complications, and her capture is done by a police officer with calm and accuracy. Let us just say that plausibility is not this film's strongest suit.<br><br>The next person they challenge their users to find is an ordinary person who's not a part of the Circle's network, and who's a former friend of our protagonist. What happens next is simply too stupid to face, because people actually chase for this guy down a highway in the mountains and get him killed in live-feed broadcasting. And what's even worse: there are no consequences to his death. Instead, what happens is that Mae finally \"opens her eyes\" to the fact that what the Circle is doing is wrong (duh!) and that violating people's privacy could get them killed (oops!). And so, she designs a trap to expose the people behind the Circle and their true intentions (evil laugh). And guess what? SHE DOES IT! She exposes them, all their conversations, their plans, all their private correspondence, all of it! And do you know what they were hiding? -- Neither do I, because the screenwriter forgot to tell us, I guess... Or maybe he did write it but the editor cut that part out... or maybe the director forgot to film that part... or maybe it's not even in the original novel... who knows? And at this point, frankly my dear... who gives a damn? Yes, the antagonist played by Tom Hanks is a uni-dimensional character who we pretty much know nothing about. He has no intent either, no obstacles along the way, and no clear agenda at all. How they got Tom Hanks to act in this film, is just a complete mystery.<br><br>The end of the film is as nonsensical as the rest of it. Mae goes on yet another one of her kayaking sails -- but wait a minute, this time she's not alone. She's surrounded by drones who are watching \"over\" her... because, you know, that is what this was all about...<br><br>Please, please, Tom, Emma, Anthony, Gary, Danny, Matthew, Hollywood, the studios, THE AUDIENCE... give some real screenwriter a chance. We promise, we won't let you down.<br><br>Cheers from Mexico.<br><br>Sincerely, Carlos Algara","user":"12_Monkeys","rank":[259,294]},{"title":"Good concept. Bad execution","rating":4,"date":"15 May 2018","review":"I was really looking forward to seeing this when it popped up on my streaming service. Such an interesting concept (how technological advancement will effect humanity) and a good cast. <br><br>One problem. The plot was grossly under developed and the ending was weak and predictable. First big issue, the main character seems to have a complete 180 on her beliefs halfway through the movie without a plausible reason (honestly I was waiting for her to have been drugged or something).<br><br>Second big issue, you don't understand what the bad guys motivation is. Are they die hard believers? Are they just doing it for money and power? And how are they so ridiculously stupid that they'd allow themselves to be taken down so easily?!<br><br>Now the sneaky thing about this film is that they develop the plot JUST ENOUGH that the story will keep you engaged the entire time (and these days that's rare).<br><br>Problem is that if you were looking for something a little deeper and philosophical on such a complex and important topic you would walk away feeling unsatisfied.","user":"foghorn_clj","rank":[68,78]},{"title":"Shallow, predictable, and patronising","rating":3,"date":"30 July 2017","review":"What a monumental waste of A-class actors! <br><br>On paper, this film ticks all the right boxes: topical sci-fi, great actors in fitting roles, plot ingredients that should create great suspense...and yet, it completely fails to deliver at all levels.<br><br>I wanted to like this film, so I ignored the first few warning signs: the characters start off a bit one-dimensional, a slightly uninspired representation of Google/Facebook/Amazon-ehm I mean-\"The Circle's\" headquarters...But then came a couple of scenes that could (no exaggeration) be right out of a CollegeHumor parody video - except they were meant to be serious- and I knew something had gone really wrong with the script and direction.<br><br>15-20 minutes into the film everything becomes completely predictable. There isn't a single moment that has you on edge or wondering what's coming next, because everything is as blatant and simplistic as it could be. There's nothing novel about any of the characters or the major plot points. What is worse, the script just can't stop preaching:<br><br>\"losing all our privacy is bad...mmkay?\" <br><br>\"big corporations shouldn't spy on us all the time...mmkay?\" <br><br>\"sacrificing your personal life in the name of a morally dubious career can have regrettable repercussions...mmkay?\" <br><br>-NO SH!T movie! Thanks for letting us know, because, you know, we didn't have to write enough 10th grade essays about these things!<br><br>Bottom line: I know it's tempting, but don't watch unless you have time to waste. It's not even \"so-bad-it's-good\" bad, it's just incredibly dull.","user":"elliest_5","rank":[168,210]}]