[{"title":"Another Disappointing Movie","rating":3,"date":"3 May 2015","review":"Scooby-Doo! Moon Monster Madness (2015) <br><br>** (out of 4) <br><br>A billionaire plans to take some experts into space but five \"normal\" people also get picked for the trip and sure enough it's Scooby, Shaggy, Velma, Fred and Daphnie. Once up in space everything seems to be going as planned but soon they run into an evil alien.<br><br>The latest direct-to-video Scooby-Doo movie is yet another very disappointing one. Even though it pays homage to ALIEN, THE RIGHT STUFF and even E.T., the overall feel is just downright flat and boring. By the twenty-minute mark things were already moving at a snail's pace and sadly things never really picked up despite some great animation. There's no question that the screenplay is to blame here as we're really not given anything funny, mysterious or even remotely fun.<br><br>This includes a very predictable screenplay that opens with Daphnie failing a driver's test and you know this here is just setting up a certain ending. Even worse is that the alien itself really isn't all that entertaining and I'd argue that the design wasn't all that impressive. Another problem with the film is that the jokes are all rather lame and especially the stuff dealing with Fred putting his foot into his mouth when it comes to two elderly men on the spaceship.<br><br>All in all, SCOOBY-DOO! MOON MONSTER MADNESS is a real letdown that has very little going for it.","user":"Michael_Elliott","rank":[6,8]},{"title":"Good fun but not the best that Scooby's had to offer","rating":7,"date":"7 April 2015","review":"As a big fan of Scooby Doo since forever, of the pro-Sander Schwartz Scooby Doo films- the ones since Chill Out Scooby Doo!- Moon Monster Madness was for me one of the weakest(although none of them are at all bad, even the weakest Music of the Vampire, two of the best Scooby Doo films- Big Top and Mask of the Blue Falcon- came from this period actually). That said, it's still worth watching, and Scooby Doo fans should find much to like.<br><br>The animation is great, with bold use of colour, colourful and atmospheric backgrounds and while not the smoothest animated Scooby Doo film out there it's nicely drawn with a nice mix of classic and modern Scooby Doo. The music fits very well and has a really groovy vibe while also using music and scoring appropriate to the mood, may it be light-hearted or suspenseful. On the most part, the writing in the Scooby Doo films is most enjoyable and Moon Monster Madness is not an exception. The dialogue is goofy without being too silly and good-natured, with some nice homages(like Ellen Ripley from the Alien films) with some very funny and sweet moments with Shaggy and Scooby. The story is not without its faults, but it's diverting still and has a solution that's not too obvious or over-complicated as a result of being too predictable or trying to do too much(Stage Fright was a good example of the latter).<br><br>On the most part it's fun and with some nice suspense, Shaggy and Scooby's friendship is one of the franchise's joys and it's as ever charmingly done here, the film also uses its unique(for Scooby Doo) space setting very imaginatively. Shaggy and Scooby are funny and endearing, Fred's likable and there are some fun supporting characters, Sly and Ridley being good examples. Not to mention the alien, it's very coolly designed and has a genuine creepiness without being too scary, to the extent where you'd start to think that it was a real monster. Great also is the voice acting, the gang are beautifully voiced(Matthew Lillard being the standout, though Frank Welker shows remarkable consistency considering he's the only one who was there right from where Scooby Doo began) and Malcolm McDowell and Jennifer Hale are particularly good in the supporting roles, Mark Hamill's a nice addition too.<br><br>Moon Monster Madness does have some erratic pacing though(but not all the time), with some scenes chaotic and others dull. The scene after the reveal for my tastes went on for a little too long and felt like padding, but the biggest issue for me was the friction/jealousy between Daphne and Velma, it didn't feel necessary and a little clumsily handled, Velma also came over as annoyingly bratty rather than resourceful, like a few of the Scooby Doo films made around the Mystery Incorporated period and after. In conclusion, good fun but not one of my favourite Scooby Doo films(Witch's Ghost, Zombie Island, Big Top, Goblin King). 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[7,10]},{"title":"An Honest Review","rating":3,"date":"1 April 2017","review":"Can you scream \"Jumping the Shark!\" at the top of your lungs? It feels like they are jumping the shark on this.<br><br>Actually, no, it feels a bit like it's trying to be the Animaniacs. A lot of the jokes, a ,lot of the references, a lot of the parodies seemed like they came out of the Animaniacs.<br><br>The only thing is, the Animaniacs could have taken them to the next level and made them funny as where Scooby Doo is too grounded in Scooby Doo humor to make things like the Ellen Ripley spoof anything but annoying.<br><br>At least there are a few decent jokes at Fred's expense and those are always worth while.<br><br>But the Enter the Dragon Daphne seems retconned away to the vapid arm candy of old...and in the most humorless of possible ways.<br><br>All in all, this installment fails miserably. Possibly the worst Scooby Doo movie to date.","user":"generationofswine","rank":[4,6]}]