[{"title":"There's a fresh concept in there somewhere.. But poorly executed.","rating":3,"date":"24 November 2018","review":"Right of the bat, i could not tell if this was prohibition 2020 or the 1920s. Getting mixed signal about that direction there. You also get to meet Ice T with a big fat diamond earring which i guess men back then wear. The dialogue from the first officer yapping away sounds 20th century. The editing where the singer performs one song had multiple annoying dissolves. And then we are back to the past when the waitress talks with 1920s accent. Confused... could not watch it. Oh don't forget the vampire who did the matrix move in the bed scene.\nNow if this movie is told and shot and edited.. in the classic way, i bet there is a descent movie in there somewhere. I have to fail this one. Next project please","user":"rasull-ramad","rank":[2,2]},{"title":"Low budget vampire flick delivers some new fun things!","rating":6,"date":"1 November 2017","review":"Something I really liked about this film was that they came up with some fresh and original ideas in the midst of a small-time vampire flick. Ever wondered what happens if a vampire turns into a flick of critters, and a few of the critters get killed? Ever thought about using a rosary to deliver a knuckle-duster to a fanged-face? In addition to decent acting and some complex characters, the original twists made this a very enjoyable escape...","user":"ravenskald","rank":[2,2]},{"title":"c movie","rating":6,"date":"22 May 2017","review":"Set in 1930s prohibition, a corrupt cop discovers that the popular speakeasy in town has been infiltrated by vampires.<br><br>The story was unique since it's in the 30s and there are vampire but these vampires are gangsters and very careful. The acting well Micheal McFadden character was good corrupt cop who came from war and the only thing he thinks about is drinking, Ice-Tea well he can do better, this role was not suitable for him unfortunately. The script was good it was like they were not acting but talking real. The directing well action scenes were ridiculous so much, no visual effects, but the outfits and environment were nice although there were not too many places to shoot in the film.","user":"coolprince03232","rank":[2,2]}]