[{"title":"Inspirational. Expectected better;","rating":7,"date":"10 April 2015","review":"The footage of the space shuttles in transport to museums was nice.<br><br>The footage of the space station was mostly the same footage from Space Station 3D in IMAX from 2002. Too much recycled footage. I don't understand why they don't have much ISS IMAX footage from the 13 years since.<br><br>Animations of a projected future mission and footage of testing newer equipment to be used on future missions were interesting.<br><br>Overall, I recommend it as a good inspirational film, especially if you haven't seen Space Station 3D. It's a more complete story of the current value of NASA, commercial space program, and the short term future of space exploration for the next couple of decades.","user":"millsgrphx","rank":[34,38]},{"title":"Brutal reviews","rating":9,"date":"2 November 2019","review":"Great doc. Recycled footage or not this was very informative and entertaining.","user":"scottbuchanan20","rank":[2,2]},{"title":"Brief compilation with much more potential than actually presented;","rating":6,"date":"23 March 2019","review":"For a documentary that was intended to make a sweeping overview of humanity's accomplishments in space, this sadly felt more akin to a shallow compilation.<br><br>Where I expected a thorough exploration of most of the achievements astronaut have staked there lives on, it was more akin to a jumble of subjects that didn't have a proper thematic connection. Sure, most of the subjects discussed within this documentary have their function such as for example the bit about the simulations that astronauts have to experience.<br><br>Long story short, I expected a stonger view on the missions themselves and the people involved and how their work in impacted their time for the better. It is there within the documentary but it deserved way more limelight than it did in my honest opinion. The bits about the future explorations toward Mars were very interesting though.<br><br>It works for the amount of time it takes to watch the documentary.<br><br>6/10.","user":"ginexmachina","rank":[2,2]}]