[{"title":"Maybe a Very Rainy Night Rental.","rating":5,"date":"19 April 2017","review":"There's a solid cast in this slow burn thriller, as the first 30 minutes of the movie are most glacially paced. Lydia (Tricia Helfer) and Creighton (Luke Mably) have agreed to travel to a remote Bahamian island to try and patch up their marital troubles, stemming from an affair that Creighton admitted to.<br><br>While having dinner at a neighbor's home on the island, they return to find the villa where they're staying (owned by one of Creighton's clients) has been ransacked and all their valuables stolen. From that point on, all hell will break loose as mayhem and violence ensue, resulting in the couple fighting for their lives.<br><br>Some of the plot machinations here are highly implausible, but I thought, overall, the movie was not awful but it was not very good either. To note, there's raw language laced throughout the film and some explicit scenes as well.<br><br>Maybe a rental for a very rainy night.","user":"larrys3","rank":[17,20]},{"title":"This Disappoints Me","rating":4,"date":"14 October 2017","review":"PROS:&nbsp;I liked the premise of the movie. I actually think, that although this was based on real events, it was actually altogether&nbsp;compelling. The director had a clear image for what this movie should've been and it seemed to me that he achieved&nbsp;everything that the set out to do. The acting was good when it wasn't thrilling. When the movie was slower and wasn't building up tension the characters did a nice job at showing their individual relationships.<br><br>CONS:&nbsp;For me the movie was just too corny. Overall the acting felt extra and bizarre. The movements the actors made felt very rehearsed and unnatural. Characters in the movie just didn't fell real when it came to the action scenes. With horror movies it is important to have the authenticity&nbsp;in both the tense and the not tense scenes. The sort of fakeness I saw in the movie effected my watching experience greatly. The intensity fell flat because there was no real fear that took place because&nbsp;there were no people experiencing the real fear. It all comes back around to how real everything feels. If I don't feel that this could actually happen to me then I wouldn't actually be scared. The other thing that frustrated me was the beginning&nbsp;and the end of the film. The beginning was so slow. It took forever to get to the actual point of the story. They just dragged everything out way to much and built the characters and their bonds a needless amount. Then when you got to the ending you had the complete opposite problem as the beginning. The resolution was just way to short and felt so unfinished. I wish the movie took an extra 5 minutes&nbsp;at least to actually resolve the film.<br><br>www.chorror.com","user":"cmovies-99674","rank":[8,10]},{"title":"We all have secrets","rating":2,"date":"5 July 2017","review":"A couple has marital problems. They go off to an island and we suffer through the light drama. They meet some people and then get chased near the end of the film.<br><br>I kept waiting for something to happen. They just couldn't go to the island they had to go through the whole martial thing, go to one island and then the other. The film was 90% filler. \"Isolation\" and \"Fugitives\" are the same film. The production is a waste of talent.<br><br>Guide: F-word. Shower sex. No nudity.","user":"nogodnomasters","rank":[7,10]}]