[{"title":"Amazing, stunningly beautiful and filled with learning.","rating":18,"date":"18 August 2016","review":"Humpback Whales is an amazing, stunningly beautiful and spectacular educational ocean adventure. For the first time in IMAX, it offers an up-close look into the incredible lives of humpback whales by a team of researchers. <br><br>What I particularly like about this show is how much fun information you learn about humpback whales. For instance, did you know that humpback whales can weigh 50 tons, be longer than a 50 foot school bus and have a wing span greater than most Lear jets? Or, that they can dive to the depths of 1,000 feet in the ocean and migrate up to 10,000 miles round-trip every year? And, did you know that male humpback whales sing? <br><br>Sadly, we also learn that for hundreds of years and up until the 1970s, humpback whales were killed for their oil. Fortunately, because of the generous support of the Pacific Life Foundation we are learning the importance of the humpback whales and the importance of protecting them.<br><br>My favorite thing in this show is learning that the male humpback whales communicate through song. Their songs are known as the \"Music of the Deep.\" It is also what motivated countries across the world to form a ban to stop the killing of humpback whales in 1978. Up until this time, these marine mammals were becoming extinct.<br><br>This film is wonderfully narrated by two-time Golden Globe nominee Ewan McGregor and produced by Academy Award nominated filmmakers at MacGillivray Freeman Films. The accompanying music is moving and sets the mood perfectly. I also loved seeing the beautiful scenery as we follow a team of researchers journeying into the waters of Alaska, Hawaii and the distant stunning islands of Tonga. <br><br>The message of this film is that humpback whales should be protected, respected and asks what can we do to help them survive. So what can we do to help? Glad you asked. The film tells us that this is possible by encouraging ships to slow down or be re-routed and to keep trash out of the ocean. However, there is also a life moral message about how it is our turn to be the guardians of these magnificent creatures. <br><br>This is a wonderful, educational, ocean adventure for both children and adults. Young viewers will enjoy the beautiful scenery and more mature viewers will appreciate the many amazing things there are to learn about humpback whales. I recommend this for ages 5 to 18 and give it five out five stars. I hope you watch this DVD so you too can experience the magnificence of humpback whales. <br><br>Reviewed by Abigail Zoe L., KIDS FIRST! Film Critic.","user":"rannynm","rank":[7,10]},{"title":"An important subject, but just an okay documentary","rating":6,"date":"31 October 2016","review":"\"Humpback Whales\" is one of the most recent works by nature documentary filmmakers Greg MacGillivray (two-time Oscar nominee) and Stephen Judson. It is from last year and like most of their works, the title is already a giveaway what this film is about. It runs for slightly under 40 minutes and focuses on humpback whales, a breed of animals that is still endangered (and probably always will be). We get an insight into how they try to survive against whalers coming for them, how people work to keep them from going extinct, how their mating behaviors look like and how new generations learn about this very special breed of whales. But is it really very special? I must say I am a bit disappointed by the filmmakers' take on the subject in this short documentary. It is a subject that has a lot more to offer I believe and the way they made it for the masses (also with the somewhat cringeworthy music used in here), it sometimes felt like a missed opportunity. The reason I say that is that it is not half as informative or relevant as it could have been. But this is nothing really new when it comes to IMAX movies. Still, it is not a weak or even bad film by any means at all and (also as usual) some of the video footage is pretty great in here. I give it a thumbs-up and recommend the watch, even if I am far from as enthusiastic about it as I would have wished I was.","user":"Horst_In_Translation","rank":[2,3]}]