[{"title":"What has happened to Entertainment","rating":1,"date":"4 November 2017","review":"Yeah,I'm not sure how to write a review on something that is so bad. Some movies are so bad that, under the right circumstances, could actually be entertaining or even funny, but not this stinker. This is 1 hour, 21 minutes and 32 seconds of the lamest 'SciFi or Comedy' I have ever seen. I really don't know what was worse, the script, the acting, the story, the sets, the cinematography, the 'special effects'!! The people that made this must have been smoking crack or sniffing paint fumes. Everything about this movie is a massive fail. Whatever budget that this had, could have (or should have), been donated to charity. The entertainment industry seems to be failing it's audience, in it's core reason for being....Entertainment, and this one sets a new low.<br><br>Jeez, I hate being this critical.","user":"kruizer04-268-186704","rank":[21,26]},{"title":"I have finally found my new...","rating":1,"date":"4 November 2017","review":"Worst movie ever! This movie, as of 2017, is the worst movie I have ever seen in my life. I never in my life thought my last worst movie would be topped in my lifetime, but this one reigns supreme now! Unless you are into soft porn and some seriously disgusting scenes with possibly the worst acting ever, you too might find you're worst movie ever here!","user":"iceman88869","rank":[22,29]},{"title":"All I can say is wow...","rating":1,"date":"6 November 2017","review":"I think someone made this movie as a total and complete joke... The acting is nothing short of horrific. And when I say horrific I'm being a little conservative. You might want to toss back a few brewskies before streaming this one out folks. I'd rather sit on the crapper for an hour and a half than watch that again. I'm not kidding on that either. You need to go into it with the mindset that it's meant to be a joke and not some high dollar budget flick. Watch it with a group of people at a party or something so everyone can enjoy the experience of this winner. Brewskies folks lots of brewskies. And a shower now that I think about it. You almost need A shower afterwards to wash the \"stank\" off. Anyway Enjoy!!!!","user":"brett-76260","rank":[15,19]}]