[{"title":"\"Sometime I wish I had a spaceship\"","rating":7,"date":"17 September 2016","review":"\"Kicks\" (2016 release; 80 min.) brings the story of Brandon, a 14 or 15 yr. old kid in \"East Bay\", as we are reminded at the beginning of the movie. Brandon has a hard time fitting in, dreaming that \"sometimes I wish I had a spaceship\", so that he wouldn't have to worry about being chased or fitting in. He pines for Air Jordan sneakers (a/k/a \"kicks\"). After saving up and earning extra dough selling candy, Brandon is finally able to buy the much coveted black-and-red Air Jordans, but within a day, he is savagely ambushed and robbed by a gang in the hood. Brendan is determined to somehow get his sneakers back... To tell you more of the plot would ruin your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is the feature length debut from writer-director Justin Tipping. He brings us an insight look at the African-American culture in the Oakland/Bay area, where image and perception apparently are paramount. To not have decent sneakers is to not belong. To not be a 'tough' guy is to be dismissed by girls and guys alike. BEWARE: the movie does not hold back on anything, not in the least the violence that apparently is rampant in those circles. The ambush of Brandon, where a gang robs him of his newly-purchased Air Jordans, is vicious and repugnant. It almost made me leave the theater. Then a strange thing happened: Brandon's quest to regain his sneakers becomes a journey towards self-discovery that becomes mesmerizing, aided along the way by his imaginary/alter ego spaceman who guides him when he desperately needs help. Whether the movie accurately reflects what life is like in that segment of the African-American community, or simply stereotypes it, I couldn't possibly tell you, but what I saw displayed on the big screen made me shake my head on more than one occasion. It's possible, if not likely, that these things are simply incomprehensible for a middle-class white guy like myself...<br><br>\"Kicks\" debuted with critical acclaim at the Tribeca Film Festival earlier this year. It opened this weekend without any pre-release fanfare or advertising at my local art-house theater here in Cincinnati. The Friday evening screening where I saw this at was attended poorly (only 2 people besides myself), and I can't see this playing very long in the theater. If you are in the mood for a tough \"boys in the hood\" tale that exposes/clarifies the importance of sneakers and other bling, this might just be the movie for you, be it in the theater, on Amazon Instant Video, or eventually on DVD/Blu-ray.","user":"paul-allaer","rank":[24,35]},{"title":"Good attempt but a terrible delivery! Overly exaggerated!","rating":18,"date":"18 January 2018","review":"I appreciate the attempt to tackle a serious subject. Children are dying over something as simple as a pair of sneakers. I wanted to like this movie but the acting was horrible and over exaggerated. Yes, the N word, underage drinking, violence and drug use is rampant in an urban environment, but not the way it was depicted in this movie. It was so overdone that it was both laughable and depressing. If your not from this environment please understand that this is a terrible depiction.","user":"derekchatman","rank":[6,10]},{"title":"Brutal & Stark Realism","rating":8,"date":"7 December 2016","review":"Definitely not for everyone, this brutally stark drama centers on 15- year-old Brandon (Jahking Guillory), who's mired in poverty in the East Bay, Richmond, California. He's constantly bullied for his diminutive size and for the fact that his footwear is so poor, in a culture where sharp sneakers mean status.<br><br>Brandon finally gets enough money together to purchase his dream sneakers from a street vendor, a pair of original red and black Michael Jordan's. As soon as he begins to wear them, he can see his confidence soar, as well as his status among his peers.<br><br>However, soon thereafter a bunch of thugs confront him, beat him, and steal his new shoes. Brandon decides he's going to get them back no matter what the cost. Thus, he embarks on a dangerous odyssey, with his two best friends, to Oakland to retrieve his sneakers, which will result in lots of tragic violence.<br><br>There's pervasive explicit and raw language here, lots of on screen drug usage, and various sexual situations.<br><br>The acting in the movie is incredibly realistic on all fronts, and I read that director and co-writer (with Joshua Beirne-Golden) Justin Tipping grew up in that area, which would account for this stark realism. <br><br>All in all, if one has the stomach for it this film can be painfully intense, yet it left me with a lingering sense of sadness as well.","user":"larrys3","rank":[6,10]}]