[{"title":"WHY SO MUCH HATE?","rating":10,"date":"26 September 2018","review":"I simply do not understand the bad reviews on this movie. I feel like I saw a totally different movie. I fell in love with it from the beginning. Slow but incredibly touching with such a deep perspective to life and loyalty. The end was unpredictable and left me with a great state of mind. I would recommend this movie to everybody!","user":"xio_lyn","rank":[322,412]},{"title":"I see the problem with the reviews","rating":9,"date":"24 March 2019","review":"I just stumbled upon this move on one of the premium channels. I came here to read about it. Reading the reviews I can see why the reviews are so polarized; basically the people who like this movies are dog lovers, animal lovers (in general), and/or were looking for a Family Movie... and found it.<br><br>The folks who are rating this movie 1 or 2 stars seem to be archeologists (amateur, academic, or professional) and are having a tizzy that \"Ice Aged Man was really black\" or \"the relationship between man and wolf happened much earlier and in China\"... Ya, OK, whatever...<br><br>This is not, and was never meant to be a Documentary!! This is the story of a young man getting separated from his tribe and making a very long, arduous journey trying to get home. Along the way he is attacked by a pack of wolves. He injures one of the wolves, whom is left by the pack. The young man nurses it back to life and they become companions, helping each other on the rest of the journey.<br><br>This is not, and does not claim to be THE man-wolf bonding story. Nor is it a teaching film to show how humankind lived x-number of years ago. This was not made by The Discovery Channel or The Smithsonian Channel.<br><br>What it IS, is a great, heart warming story. Almost a Vision Quest, of sorts. It is a story of survival and companionship. It has a great underlying message for all animal lovers, even all humans. The boy's parents said it the best, \"Kaya leads with his heart, not his spear.\" But he has great inner strength.<br><br>Enjoy this family movie. If you're looking for a documentary, try another channel.\n<ul><li>Uncle Dave</li></ul>","user":"Uncle Dave M","rank":[119,152]},{"title":"This Film Made Me Cry","rating":8,"date":"17 September 2018","review":"Rating 8.3/10\nThe characters of Keda and Wolves in this movie is very good. Friendship between animals and humans is inserted in this movie. Amazing movie, it was very beautiful and definitely made me cry. Worth a watch !!","user":"ymyuseda","rank":[174,231]}]