[{"title":"It doesn't do what it sets out to do and it doesn't finish what it starts to do","rating":4,"date":"5 January 2019","review":"Hollywood star Markey Marlowe (Analeigh Tipton) is floundering. Her career is fading. She's threatened with real jail time. With an ankle monitor, she checks into an isolated rental place away from the paparazzi for the 30 days probation. The reclusive owner Daryl (Tyler Labine) lives next door in the converted house.<br><br>This is mostly the lead actors and I like them both. I don't mind the expected B-movie plot. The lower rating confused me a little until I watched the movie. It takes an unconventional sharp turn about the midway point. It's an awkward questionable turn. The premise is she wants her fame back no matter the cost. That's not what happens. This turns into revenge but the reason is a little muddled. I also don't like leaving the ending ambiguous. It doesn't do what it sets out to do and it also doesn't finish what it starts to do. The movie takes a weird turn and then pulls off on the side of the road.","user":"SnoopyStyle","rank":[7,7]},{"title":"I enjoyed this but could have been much better","rating":6,"date":"22 July 2018","review":"Acting was great and the story lone kind of came together well. Then close to the end it took a turn and I am still a little confused about how it actually ends,","user":"natcalgary","rank":[12,14]},{"title":"Disturbing, thought-provoking movie about Hollywood narcissism......","rating":10,"date":"9 December 2018","review":"I found Tipton exceptional and Lebine good as well playing two HIGHLY damaged, even borderline-psychopathic characters engaged in a \"nasty, sick perverted,\" yet strangely moving relationship. (Not that it excuses any of the actions committed by both the characters in the movie---particularly those of Darryl (Lebine)----but you do end up understanding at least partially what why they do some of the things they do).<br><br>Now for the ending...<br><br>I think one of the reasons many dislike this movie is because of the ending. Way too ambiguous, they say. Too confusing. I say it is believable if you pay attention and think about it after the credits have rolled.<br><br>Either A) Markey or Darryl \"changed the ending\" to start all over again and redefine their relationship-----and not ending up with having anyone tormented/killed(which then would make this psychological thriller take a sharp turn into supernatural territory-----or, B) Markey dreamed the whole thing up, as another reviewer commented. And she's \"starting over again\" but in a more brave, more positive light, without the initial whiny self-pity and narcissism. (Exemplified by the motto \"Be alone but brave\" scrawled across her arm at the end).<br><br>That is hampered by her discovery that Darryl is stalking her. Will she reject him this time? Probably so.<br><br>(On the other hand, it's implied the two of them kiss at the end of the dream, implying some sort of a relationship between both of them. Was it somehow a prophetic dream? Could be....)<br><br>This ending is reinforced by the clue that she reawakens and looks in the mirror like she did two other times in the movie and she does so in the nighttime----like she was having intermittent dreams----like all of us have. Her calendar after she wakes up is not filled like it was before, implying she just started living in the house.<br><br>Personally to me that is the most believable explanation, but the first also could be possible. Remember, too, that Markey also told her friend near the end that she \"controlled\" everything, implying either a dream or that she had more of a chance to \"rewrite\" the ending (supernaturally) than Darryl did.<br><br>Maybe she did not want to give in to her sick attraction to Darryl at the end and just kiss him in the dream as it is implied.<br><br>Ultimately, there is still room for ambiguity at the end. Will Darryl and Markey somehow (and somewhat improbably) end up together? Will he kill her or just befriend her? What will happen next.<br><br>Who knows. LOL.<br><br>If anything, this a disturbing and thought-provoking examination of Hollywood narcissistic, empty culture and its effects on broken people's lives and all of us.<br><br>10 out of 10.","user":"marioreturns","rank":[5,5]}]