[{"title":"Got to hang in till the end","rating":6,"date":"13 July 2018","review":"Overall an average film, CGI is a bit scretchy in certain places but the suspense within the film makes up for it. The ending will leave you wanting just a bit more of an explanation.","user":"iandsplastering","rank":[10,10]},{"title":"Patient viewers will be rewarded","rating":7,"date":"21 February 2018","review":"I have enjoyed this movie. I got to watch it not expecting anything from it - in fact, I came across it by chance, having never heard of it before. Maybe that was the key in appreciating it (by not setting expectations too high). Anyway, you need to like psychological, slow-paced, rather contemplative pieces of work to feel at ease watching this one. True, action is sometimes redundant and the pace could have been a bit faster, but overall, this film takes you to the point where you need to make up your own mind: is the soldier actually getting mad, or is the threat real? The ending, of course, gives the answer. But I have liked the suspense, not knowing which one is the right one - although plenty of clues are provided regularly if you watch carefully. Yeah, the ending's really good, if not too short. Overall, the film can not be ranked among cheap movies. Although it was probably shot on a shoestring budget, that doesn't show. But to enjoy it, the trick is that you really need to be patient, which may turn off a number of viewers.","user":"supersonicprowler","rank":[21,26]},{"title":"Iwan Rheon is good even if the movie isn't","rating":4,"date":"1 December 2017","review":"In the not-too-distant future, Earth has been invaded, overrun and defeated by a race of hostile aliens, or so we are led to believe. With only a small fraction of Earth's population remaining, humanity has taken to life underground in a grim bid to keep the human race alive. Out of necessity, this subterranean society is rigidly structured along militaristic lines.<br><br>Only a few die-hard human stragglers eke out a meager existence on the surface. A major focus of the subterranean militaristic society is to round up as many of the top side stragglers as possible, ostensibly for altruistic purposes and as part of the overall push to save humanity.<br><br>A lowly private, named S.U.M.1, within the subterranean society is sent out on a 100 day mission to man one of the outlying security towers in keeping with the general operation to keep a lookout for the dangerous aliens, referred to as the \"Nonesuch\".<br><br>Over time, S.U.M.1, as part of the supposedly mentally deleterious effects of \"long-term\" isolation (although the private has the opportunity to regularly communicate with his fellow personnel twice daily, not to mention being able to contact his superiors more or less at will as needs be), begins to suspect that the aliens either do not exist at all or if they do exist, that they have already departed, and that the rigid and unpleasant life everyone leads is simply part of a nefarious plot to subjugate the human rank-and-file population to the benefit of the elite human power structure.<br><br>Having devised a way to disable the security perimeter intended to fence him within his operational area, S.U.M.1 travels to an adjoining security tower only to encounter the \"big reveal\" of the movie.<br><br>This is obviously a very low-budget effort and of relatively low quality. It would not be untruthful to say that the only thing that makes it stand out is that it does feature Iwan Rheon as the protagonist, the eponymous S.U.M.1. Viewers may know him from his primary debut as Simon Bellamy in MISFITS and as the creepily monstrous Ramsay Bolton in GAME OF THRONES. He is a very competent actor and he brings a certain what? cinéma vérité? that this movie would otherwise not possess.<br><br>As others have mentioned, ALIEN INVASION: S.U.M.1 is conceptually very closely related to MOON and OBLIVION in its fundamentals and simply tacks on a twist or \"surprise\" ending in the hopes of not winding up being completely derivative. I empathize with the movie on this point; there are only so many movie story lines to go around and, after all, where was it going to go for $1.95?<br><br>Unfortunately, there are innumerable gaping plot holes that inexorably drive the movie into the realm of the subpar and amateurish.<br><br>Here is a partial list.<br><br>In an in-your-face sort of way the aliens are actually CALLED the Nonesuch, which is highly suggestive that they don't exist by the very name. Hint hint.<br><br>Inexplicably, each of the security towers occupies a hexagonal territory grid pattern bordered by an electronic fence and augmented with some kind of embedded security chip within the leg of our private, very similar in concept to the pet-corralling product, Invisible Fence. Anytime S.U.M.1 approaches this barrier, he is overcome with pain and driven back, the implant beeping and flashing away in his leg. From a plot standpoint, this is clearly to inject into our minds the notion that the powers that be don't want him to wander from his grid location because he will \"find something out\" a la OBLIVION. Given what we find out about the truth at the end of the picture, such a barrier makes no sense. Especially if one of the private's primary operational orders is to corral any loose humans running around the surface. All such a wandering human would have to do to avoid corralling is simply go beyond the perimeter and S.U.M.1 wouldn't be able to follow them. So this fence doesn't jive with either the ending or the situational set up.<br><br>Realistically, the movie only consists of 2 parts: 1. The situational exposition (the exciting alien invasion idea, humanity hanging on by the skin of its teeth) and 2. The \"surprise\" ending. NOT surprisingly, this makes the giant, movie-length chunk of time in between these 2 plot points rather difficult to fill. And so the movie cheaply falls back on the notion that somehow being stationed in an isolated observation tower just naturally drives the occupant nutty. For the vast majority of the movie we're just watching S.U.M.1 behave more and more erratically without any real explanation as to why. I guess were just supposed to accept it on face value.<br><br>While the depiction of the aliens themselves isn't bad at all, their apparent combat strategy is just to run around at random and eat people. We see no sign of any advanced technology, nor do we actually see any incidents of the advanced energy weapons possessed by the humans actually HITTING any alien. Our primary protagonist even has an opportunity to shoot one at point-blank range and it somehow never happens.<br><br>A complete list of the plot holes would go on much longer than allowed, but I'm sure you get the idea by now. It's a terrible movie with a disastrous plot line only slightly elevated by the inclusion of a namebrand actor. On top of this we add glacially slow pace while we illogically kill time going insane for no reason between the exposition and the big reveal at the end, and what you have is, well, kind of a junker. If you decide to watch it, just keep in mind that watching Iwan Rheon will realistically be the high point of the movie.","user":"S_Soma","rank":[25,32]}]