[{"title":"Extremely Valuable and Gripping Viewing","rating":10,"date":"14 March 2015","review":"I moved to Hollywood in 1989. My first experience with Scientology rank-and-file was seeing crowds of Sea Org teenagers milling about Hollywood Boulevard in their fake naval uniforms. I was like, what is this? The Navy docked in port? Uh, no, the port's 25 miles away. Halloween is two weeks away, so what is the costume party all about? Scientology had a lot more members then, so there were dozens of these people wandering around, trying to look important and accomplished. All of them probably under 20 years old. They all looked like children playing dress up. I just smirked and shook my head. It was a combination of hatred and sadness that I felt for these poor children. Many times later on, passing the by the Scientology \"Testing Center,\" I got hit up on the sidewalk for a free \"personality test,\" or maybe it was a \"stress test\" by that point, I can't remember. I took one look at the zombie-like girl with the plastered smile, and just laughed. I wanted to tell her, I see right through your lousy sales technique. That smile is not real. You're miserable. You're trying to sell books and register new members and are failing miserably. I wish I could have helped her. I wish I could have told her, you know, it's okay to be grumpy. It's okay not to smile 100&amp; of the time. We're all humans and we have emotions. That's just how it is. I can see somebody being grumpy especially doing the job that you're doing. You think Scientology works somehow? You're trying to audit away your emotions? That means you're attempting to audit away your humanity.<br><br>Years later, I started running into several books laying bare the psychosis of L. Ron Hubbard and his army (sorry, navy) of hypnotized, brainwashed robots. Then I started to get mad. Mad that this organized fraud mafia masquerading as a religion existed and there was apparently no way anyone could prosecute them for their crimes. Then, when the internet became a thing, the word began to spread far and wide about the ongoing criminal activities of Scientology. Human trafficking, kidnapping, slave labor, espionage, wholesale fraud, negligent homicide.<br><br>With Going Clear, the true facts about Scientology are going to be revealed to the public at large. Many people watch HBO. The scales are going to fall from their eyes. So many people in the public probably don't think much about Scientology, and if they do, they think of it as that wacky alien worshipping, e-meter using religion that Tom Cruise belongs to. This film will change that perception. There are a lot of shocking facts here, and Oscar winning documentary film director Alex Gibney delivers them in a stunning presentation. The film just flew by. I was on the edge of my seat for a lot of it, and I knew most of the story.<br><br>Just to add, as a long time Scientology watcher (I have never been a member, but living in the proximity of their facilities for years I can't help but see them around from time to time), very little of this was new information to me. But the way that Gibney presents things using the language of film is powerful and engrossing. For people not versed in the subject, this is a fantastic primer on the madness that is Scientology. The approach of having people tell their personal stories, mixed in with archival footage, really humanizes the film.<br><br>Gibney has a lot of ground to cover. He takes a look at the life story of L. Ron Hubbard, a lot of his lies and crimes, the founding and rise of the Church of Scientology, Hubbard's death and the dictatorship since that time of one David Miscavige. The film also explicitly calls out the two highest profile Scientologists, John Travolta and Tom Cruise, and accuses them of culpability in the large range of abuses that the Church perpetrates on their low level staff, who get paid 60 cents an hour.<br><br>There are just so many bizarre tales, wacky stories, unbelievable occurrences, that a two hour movie is not enough. (Would you like to hear about the time that Scientology tried to take over the government of Morocco?) But it is a stunning introduction that touches on a majority of the important points. The life of L. Ron Hubbard alone could be great material for a lengthy TV series lasting several seasons about the long strange life of a sociopath, at least as watchable as Breaking Bad if not more so, except the stories would all be true events that actually happened.<br><br>If you are one of those people that dismiss Scientology as just a bunch of harmless idiots, I urge you to watch this film and get the real story of what a dangerous, power mad organization Scientology really is. You won't regret spending the two hours.","user":"Scott_Mercer","rank":[346,359]},{"title":"Bravo to All Who Contributed to this Documentary!","rating":10,"date":"14 March 2015","review":"It's about time the truth of what goes on in Scientology behind closed doors is revealed in a mass media format. This documentary has opened up the flood gates, so all of the world can hear first- hand from ex-members what this cult is REALLY all about. Believe everything you hear and see. The abuse is completely accurate. Sea Org members (staff) are slaves and at the whim of their sadistic masters...anything goes. I know this first-hand; I was one of their slaves. This documentary is a must see!<br><br>This movie lays out and proves through engaging interviews with disaffected members that Scientology is like any powerful organized \"religion.\" It's run by a few \"untouchables\" who hold the reins to all the power. Those few who are not held accountable for their actions, believe the human code of ethics does not apply to them. Their reasoning is the end justifies the means. To keep control, dehumanizing tactics are necessary to control the rank and file. The film plays an important role in documenting the eyewitness testimony of the many inhumane abuses that occur in this organization. Cloaked in secrecy and hidden from the light of scrutiny, the executives of this cult do as they please. The physical, mental, and emotional abuse is like a POW camp. I just finished reading the book \"Unbroken\" and the stories I heard in this documentary remind me of what happened to Louis Zamperini when he was under the control of \"The Bird.\" My hope is that this film opens up a dialogue for a call to action to help those who have been at the mercy of the \"few.\"","user":"jdjctilly","rank":[253,264]},{"title":"Effective, Gripping Interviews","rating":10,"date":"30 March 2015","review":"I was involved with Scientology from 1978-1990 and encountered some of the human rights abuses that Alex Gibney exposed in his documentary. The Sea Org people, who sign Billion Year contracts, bore the brunt of the mistreatment and are well represented in this film. Most former members will know of details that were not included in the show, but the topics that became the focus received a more complete treatment as a result.<br><br>The humanity of these survivors shown through in each interview and should evoke empathy in anyone willing to accept the truth in the story. I never felt that someone was embellishing or seeking attention; in fact, quite the opposite.<br><br>A huge thank you to HBO for having the guts to air this and not back down.","user":"cgallo","rank":[208,217]}]