[{"title":"This is actually quite good","rating":11,"date":"11 June 2018","review":"I just finished this. I very much enjoyed it. The undead in this are some of the creepiest in the genre because of their utter silence. The character of Sam really drew me in. You feel very much for him and he manages to portray just about every human emotion there is extremely well while finding ways to survive alone in the desert of death, horror and loss around him. This survival is not just about food and ravenous flesh-eating zombies. There are some small and brilliant experimental music scenes created when Sam finds ingenious ways to relieve his boredom and loneliness. He's obviously a musician . He plays drums amazingly too. \n There is a twist in there too. I don't want to give anything away except to say I didn't see it coming at all. \nThere were many sad scenes. Some achingly sad. And a few humorous ones. \nOverall, this is an unexpected gem. Kudos!","user":"matahari20-1","rank":[90,109]},{"title":"Spoilers but an alternate view of the movie","rating":4,"date":"4 January 2019","review":"So I just watched this movie and wanted to come here for a take on the ending. Then i had an epiphany. The whole \"it is just a dream\" thing may actually apply here. At first I thought it was a straight up zombie movie. But there were disparate pieces when you put them together indicate that it was about his relationship. Often times writers/directors want to make commentaries but wont get the viewers unless there is something that appeals to the masses. Think of District 9 as an example or Starship Troopers. But think back to the beginning of the movie. There is a reason for the whole broken relationship angle. The apartment itself and the elevator are symbols of Sam being trapped within his feelings. He is reluctant to escape and move on. Then think of his constant attempts at \"suicide\" with attracting the zombies. He didnt have to lure them back continually but he did because parts of a person wants to die after a breakup. Remember his rant with Alfred? He was talking about being alone and the actor conveyed that hurt appropriately. Finally, the girl he meets represents opportunity. He shoots her down because he doesnt want anyone else. But in his dream within a dream, he realizes that he does have to move on. He tells her that she is right and has been right all along. He cant stay trapped in the memories of the breakup. He releases the inner him that is trapped in the elevator. Sam could choose to accept his fate once he is trapped in the elevator instead. But he doesnt...he escapes. He does want to live/love again. He is willing to take a leap of faith literally figuratively. At the end he realizes that he has moved on to the next building/relationship. However, they all are the same as he looks out to his future with the same pitfalls. Is he willing to love again and move from building to building? The writer/director leaves that up to the viewer. The road is rough and we dont know if he can or is willing to do it.","user":"careyethomas","rank":[45,53]},{"title":"Definitely not the stereotypical zombie flick!","rating":7,"date":"8 October 2018","review":"For starters, the zombies are totally, utterly mute. Believe or not, it's quite scary! In the real world, a simple cough would get anybody killed in an instant... More generally, one of the most powerful features of this movie is the strength of the overwhelming silence: in the streets, buildings, cars, rooms, hallways... Gone is the human agitation we have grown so used to!<br><br>Then, the setting in beautiful Paris, downtown-style. Lots of nice Haustmanian buildings. This comes in sharp contrast to the horror that awaits our character at virtually every corner.<br><br>The story fits on a simple sheet of paper, but the interest of this movie lies elsewhere. As some reviewers have described it before, it's about survival of the worst kind. I found myself planning what actions the \"hero\" should be taking to survive, ahead of him and, ticked, he went through each of them! In this regard, it is a pretty consistent movie which feels quite real.<br><br>My biggest complain is about the ending, something that a lot of French movies typically fail to do properly (just like the Americans and Asians, but for some other reasons): there is absolutely no closure to the storyline, far from it. I won't get into the details here, but please be warned that you will be left with a virtually limitless number of possible endings for this movie, way too many in my opinion to feel comfortable with it.","user":"t-rexx-568-196825","rank":[26,31]}]