[{"title":"Awful!","rating":1,"date":"23 July 2016","review":"Plain simple it is rubbish! Awful acting, awful story (what story?) but awful FIGHT SCENES. Common people they're UFC fighters and it was just so bad i had to laugh. waste of time to watch! Big Miesha Tate fan as a person and a UFC fighter and her looks are the only positive i can say about this movie. I've seen better movies on YouTube so go figure. It makes me wonder how someone is able to make such a thing? I mean, somebody actually put effort in this movie thing. And this is the best you can do? Not blaming the actors, cos most of them aren't actors but UFC fighters. So i understand they want to participate in a movie and they think ow that's fun to do and try. but from the director to anyone creatively involved, please go find another job cos your not made for the movie industry.<br><br>Please skip this movie and spend you time on anything but watching this.","user":"ralphmaessen","rank":[20,23]},{"title":"This is barely watchable!","rating":1,"date":"17 September 2016","review":"Let me first say, the only reason I wanted to watch this movie is because I'm a fan of WMMA as well as Miesha Tate and Holly Holm; so naturally I wanted to see how both would do in their feature film debut's. The verdict? They are better fighters than they are actors and that's clearly evident in this film.<br><br>To give my review some cred; I graduated from film school, have written numerous feature scripts, directed numerous shorts and short films and have taken acting lessons so I know how to make a film from script to screen (production through post).<br><br>That being said, this film is definitely high on the list of poorly made films.<br><br>Acting - nearly all the performances are stilted, stiff and lifeless. At times you can tell the actor is just waiting for their scene partner to finish their lines so they can say theirs; versus \"being in the moment\" and actually listening to what their scene partner is saying and evoking a real reaction. Additionally a lot of the performances are dramatic for the sake of being dramatic with no apparent motivation (called over acting). Everything must be motivated.<br><br>Dialogue - seems very contrived and often the dialogue is pointless and irrelevant. There's also too much of it. Film as a medium is primarily visual; i.e. you can still convey a message without speaking a word. Watch Don Cheadle, he's one of the best at doing that. Sometimes in a scene you just need to let it breathe and allow the viewer to consume what is happening rather than force feeding them dialogue non stop.<br><br>Writing - like the acting the dialogue is very stilted and contrived. I lost count on the numerous plot holes and setups without any payoff (screenwriting 101). One major plot hole is that none of the girls who \"have to fight to survive\" have any plan to better themselves, no plan to get out of there and make their life better. By doing that, I as a viewer couldn't care less about the characters because they don't care about themselves. The whole purpose of characters in a film is for the viewer to ride along with the characters along their journey. None of the characters have a transformational change in the film (even the main character which is highly unusual). Where's the character arcs? One major plot hole is the training of Windsor to eventually fight whoever killed her sister; but when the scene comes she doesn't fight her, Jabs fights her. Why build that up and not pay it off? As a viewer I feel let down. I was led to believe that Windsor would fight Church. Another example of setup with no pay off is Holly Holm's character. Animosity is created between her character and Miesha Tate's but then nothing comes of it. We never see her again after their confrontation in the bar. Why initiate that if you're not going to follow it through especially with a high profile fighter/star like Holly Holm.<br><br>Directing - There seems to be scenes of drama and emotion and/or hostility for no apparent reason. One minute a character is mad at another then all of a sudden they are completely calm, seems very unnatural. There's also issues with the blocking of the actors and framing issues (rule of thirds).<br><br>Technical - Bad and fake fight choreography. The actors take larger than life swings which look totally fake. Watch 'Bourne Identity' to see fight choreography done correctly. The audio mix in this is very poor; effects come in hot one minute, then too low the next minute (static shot of house, crickets are nearly distorting). Music is too low, dialogue cuts off from one scene to the next, there are scenes with dialogue out of sync, the volume goes up and down, etc.<br><br>According to the IMDb page the budget on this was $27,000,000 which has to be a typo because I find that extremely hard to believe based on the poor production quality. However their are some great aerial and crane shots in this so possibly that's where the majority of the budget was spent. <br><br>The reason I'm so critical is not to be demeaning or rude, or judgmental, but rather provide food for thought to those who desire to make films and encourage them to put out their best work. Don't put out crap, put out the best thing you can in anything you do. No one likes to see crap and this is pretty close to that.","user":"dallenofficial","rank":[12,15]},{"title":"An actual MMA beating is preferable to this steaming excrement","rating":1,"date":"20 October 2016","review":"If it were a student film, they'd barely pass, despite their $27,000,000 budget! (Could've fed 14k African villages for a decade - yes, I did the math).<br><br>Plot summary: remember that episode of friends, where Monica's millionaire boyfriend Jon Favrau wanted to suddenly become the UFC champion? That's the plot here, except with an all female cast in the ghetto. <br><br>The script is as stale as Adam Sandler's rotten tomatoes average. The acting as stiff as the late Roger Ebert's jaw.<br><br>Everything is awful. The sound, the cameras used, the editing, the sets, the make up, etc...<br><br>The single redeeming feature this film has is it's numerous lingering shots of Miesha Tate's ass.<br><br>Imagine Brock Lesnar reciting Shakespeare; same thing.","user":"rpwfoster","rank":[14,20]}]