[{"title":"I feel violated","rating":2,"date":"14 August 2016","review":"At first it looked like it will be an average level movie with a half decent plot, but moving through out the movie everything changed. From somewhat good film it became a low budged plot less porno without the porn. It was filled with plot holes, terrible writing and honestly there is no way the director/producer has actually seen any of this high school level content. I feel sorry for the actors who have tried to salvage this already sunken crapfest, but ended up devoured by this Frankenstein someone had the courtesy to call a movie. It is safe to assume that whoever wrote this THING has already committed suicide, since no sane person would ever think that this was even remotely close to decent.","user":"karolis-peciulis","rank":[55,63]},{"title":"This movie is not just bad, it's really bad!","rating":2,"date":"11 August 2016","review":"I'm not the review-writer really, but after seeing this movie and the absurdly high rating it gets here on IMDb I just had to write my 50 cents worth. To sum up some things about this movie in short:<br><br><ul><li>Acting: Poor/lacklustre/wooden/amateuristic - Directing: There was a director on set?! - Writing: Nice try, but utter fail - Production: Cheap</li></ul><br><br>Guy is beta tester for a gaming company to find out he's controlling a real person (ex-employee turned against the company). If you like this premise alone, I strongly suggest you go and watch 'Gamer' because in that film this concept is executed 100 times better. Gamer and ex-employee turned avatar go against company, have a couple really slow-paced unbelievable fight-scenes towards the end. Director of gaming company has a popcorn-frenzy somewhere in the last part of the film... I mean really? Someone must really thought let's flip off our viewers and shove them some bs down their troath. Even for an Indie-movie with a low production budget this is an insult to nominal human intelligence in general, and they should have spend that money on repaving some road in Texas or something.<br><br>This movie is Into The Woods bad (and that movie was really bad). There's not a single thing that I can credit as being positive about this movie... Wel... some of the music was OK. You'll be craving the endtitles before the first 3rd of the movie has passed!","user":"armandox","rank":[57,67]},{"title":"SyFy Channel production values, at best.","rating":4,"date":"7 August 2016","review":"At the time of my review this is carrying a 7.1 score on IMDb. I'm left wondering if the user votes on this movie are bought from some click-farm in India.<br><br>So the premise of the movie is a chump who is the ultimate beta- tester for a game studio who gets to beta test a new game, only to find out he is actually controlling someone else in real life. As events unfold the uber-beta tester decides to \"do the right thing\" even under penalty of death.<br><br>As you can imagine, a movie that mixes video games and real-life footage has to be brilliantly convincing. This is not the case. At all. This carries, at best, SyFy production values in a movie with terrible CGI, awful acting and the result is, shamefully, something the actors will have to live with for the rest of their lives.<br><br>The \"biggest fight scene\" tries to cash in on Daredevil and the likes, but the premise is so contrived (and the execution so poor/unconvincing) that you'll avert your eyes or start laughing.<br><br>Sorry click-farmers... this is horrible.<br><br>BTW: if you remain unconvinced that this is not even worthy of a TV Movie, please bear in mind that it grossed $9000 box-office. mmmkkay?<br><br>Not 7.1. Not unless that is a scale of shittiness.","user":"pauldavidtaylor","rank":[62,78]}]