[{"title":"Train your sights on Trane","rating":8,"date":"13 November 2017","review":"Pretty good doc on John Coltrane.<br><br>Although some of the talking heads like former President Clinton and Carlos Santana are not useful and only distract from the subject. Clinton's only there cause he thinks he knows how to play the sax.<br><br>My biggest beef is with the section on 1965. Coltrane did not just up and invent a new avant-garde style. That came from contemporaries like Ornette Coleman (who is not even mentioned, and created what was known as \"Free Jazz.\") and some of the wild cats like Sun Ra and Rahsaan Roland Kirk (again none of them mentioned).<br><br>Coltrane surely heard those cats and was influenced by them. But the film fails to deliver that critical content.","user":"blitzebill","rank":[9,9]},{"title":"For 'Trane","rating":21,"date":"21 April 2017","review":"\"Chasing Trane\" is as comprehensive as a documentary about the short life of John Coltrane can get. Apart from his recordings, precious little exists about the life and career of arguably the best saxophone player who ever lived. This documentary traces his upbringing in the Jim Crow South to the pinnacle of his career - at which point he died of liver cancer. He was 40.<br><br>The filmmakers used still shots coupled with interviews with his surviving friends, family members and admirers. He never gave an interview, and when he is quoted the voice-over is Denzel Washington. Those interviewed include Cornel West, best friend Sonny Rollins, his children and -surprise- saxophonist Bill Clinton. Testimony is given regarding his musical perspective and the impact music had on his life and the lives of others. It is extremely illuminating and insightful.<br><br>I could go on and on, and suffice it to say the film is never slow or dull. It is a fast 99 minutes and it is terrific. If you are a fan of his you should go and see it. You have to.","user":"GManfred","rank":[19,23]},{"title":"Chasing inspiration","rating":10,"date":"7 November 2017","review":"As you'd expect, this documentary offers a close-up view of the different phases of the life of John Coltrane through lots of family photos and footage of his performing and through the remembrances of family and friends who loved and understood him.<br><br>But what's really special is that the mix of interviews, from Sonny Rawlins to Wynton Marsalis, from Cornel West to Bill Clinton, captures how deeply Coltrane's life and art inspired people who happen to be both famous and highly articulate about how Coltrane affected them.<br><br>If you're not familiar with Coltrane's music, this may be the best introduction you'll find. If you are familiar, you're still likely to learn something new, because the documtary carefully traces Coltrane's musical development. But its greatest strength is how movingly people describe their experiences of Coltrane.","user":"xWRL","rank":[9,12]}]