[{"title":"A Fantastic Suspense Thriller, With Some Great Horror Elements!","rating":10,"date":"1 April 2018","review":"Originally I was approached to have this reviewed on a horror site that I manage. After watching it, though, it seemed to be hard to place it in any one genre, and especially horror. This isn't because it is bad at all. Quite the opposite, actually. This film was pretty much all over the charts. It has a lot of tension and suspense, moments of thriller, drama, and some of horror, but they are all tied neatly into a story that is very realistic. Overall, this film was really well shot, well written, well directed, and the acting is phenomenal. It is also very powerful for having only two actors for the majority of the film.<br><br>The story itself isn't really groundbreaking, but the portrayal of the characters and dialogue really shines. It's about a home intrusion that doesn't happen the way any of the parties involve think it will. The people who break into the house realize that the woman inside has taken a lot of pills, and passed out on the couch. One leaves, and the other is left there to watch over the situation. After coming to, she realizes what is happening and a lot of the film focuses on her and her captor in the house, and the interaction between them.<br><br>It's hard to say much about the film without giving too much away, but although this isn't an outright horror film, there were some great horror elements. One was very reminiscent of something you would see in \"The Texas Chainsaw Massacre\", and another notable scene involving a knife had some very satisfying cinematography for horror fans. Also there is the real life horror element that is the home intrusion and everything that can happen along with it.<br><br>All that being said, \"Eat Me\" is a very emotional film. It blends a lot of lines between genres, and in a very unexpected and unique way. While I wouldn't give it 10/10 as a straight horror film, it does deserve the rating based on the film quality as a whole, and the quality of the experience it provides which is nothing short of an amazing one, regardless of genre. For an indie film, this is a benchmark for quality, and I would highly recommend it to anyone.","user":"media-87144","rank":[10,13]},{"title":"Go","rating":10,"date":"12 March 2018","review":"I'm not gonna lie..Jacqueline Wright's \"Eat Me\" is a tough film to watch...but not in a begrudgingly masochistic way. It is one of those rare films that takes the dynamics of a human relationship, puts them in a blender, and serves it as part of a five-course meal complete with a bloody rare slice of veal, bottle of Dom, and a slice of tiramisu to close. Wright's character Tommy has lost her will to live, and, when confronted by a home intruder with the question and relevance of her mortality, both perpetrator and victim are called to answer. The roller coaster that ensues is like no other, with acting by Wright and Carter as gold as it gets. Martin Carrillo's score adds an impending urgency that these two haunting humans need for understanding and redemption, and Adrian Cruz's direction pulls focus to the characters' plight and inner demons as a way to justify the horrific actions that ensue. It is a game of living. It is a game of loving, and, most poetically, it is a game of connecting to the traumas and childhoods that create us..that will help us understand..and ultimately heal. \"Eat Me\" will make you THINK. Live a little. GO SEE IT.","user":"lizziepeet","rank":[9,15]},{"title":"Poignant, topical, and wildly thought-provoking.","rating":10,"date":"3 April 2018","review":"\"Eat Me\" is terrifying, sadistic, and devious... in the best way possible. This journey into the psyche of misfits is equal measures horrifying and hilarious, terrible and wonderful, brilliant and gut-wrenching. It dares to go places we never imagine a story would go to, and it does so without a shred of apology. This is progressive filmmaking at its finest: poignant, topical, and wildly thought-provoking.","user":"nrh-67707","rank":[6,9]}]