[{"title":"Lust and loneliness","rating":8,"date":"17 April 2017","review":"If I were the producer of this film, I'd have chosen a different title. I'm sure lots of moviegoers are going to be misled: this film has nothing to do with Shakespeare. It's an adaptation of a novel by the Russian author Nikolai Leskov, set in early 19th century England.<br><br>The film seems to be a pre-feminism manifesto for women's rights. It shows Katherine Lester, the submissive wife of a wealthy but abusive landowner, living in a secluded manor in the British countryside. During a prolonged absence of her husband, she rediscovers her freedom and starts an affair with one of the stable boys. Not willing to give up her newly acquired status, she starts a series of increasingly extreme actions.<br><br>The interesting thing is how Katherine evolves from victim to culprit. She seems to have learned from her husband how to use and misuse power. The lack of social conscience of which she at first is a victim, becomes a driving force for her own behaviour. Her selfishness and lack of morality is so extreme that, in the end, she betrays innocent servants. The viewer has to shift his allegiances: at first, it's impossible not to sympathize with Katherine, enjoying a free life without her heartless husband. But halfway through the film, it becomes clear that Katherine is just as heartless, as soon as she is in power.<br><br>The story is filmed in a very effective, sober style with beautiful cinematography. The lack of any music is remarkable: some elongated scenes are striking because of the silence. The oppressive atmosphere in the manor is emphasized by the camera work. The camera repeatedly shows scenes from exactly the same viewpoint. Four or five times, we see the servant Anna entering Katherine's bedroom in exactly the same way.<br><br>As much as 'Lady Macbeth' is about gender, it is also about class. It is striking that Katherine, who as a woman is considered a lower form of human life by men, herself considers the servants to be a lower form of human life. She shamelessly uses them for her own purposes and enjoyment, but doesn't care at all about their fate afterwards.<br><br>'Lady Macbeth' is a beautiful film, about issues that even nowadays are worth thinking about. But I would have named it 'Lust and loneliness' - after all, it's set in the same period as the Jane Austen novels.","user":"rubenm","rank":[119,151]},{"title":"Superbly Well-Made, Chilling Period Drama","rating":10,"date":"24 July 2017","review":"This small independent film from the United Kingdom is an astonishing portrait of the bleak realities of how Scottish culture viewed class, race, and (especially) gender in the nineteenth century. The film does this without ever needing to be preachy or overtly politically correct. It is very dark and rather disturbing, and it will get under your skin--but it is brilliantly made. It is the best film of the year so far. It should also, however, be noted that this film is not an adaptation of Shakespeare's \"Macbeth.\" Rather, it is an adaptation of a Russian novel about a woman who begins to exhibit deranged behaviors after being forced into an arranged--and loveless--marriage.<br><br>Despite using minimal set pieces and little music, the aesthetics of this film are truly sublime. They add to the simple feel of the film, rather than the extravagant sense of many period dramas. The costume design is also simple rather than outlandish or flamboyant. Once again, this makes the film feel realistic and tense, rather than removed from reality. The film's cinematography is top-notch as well, reflecting the dark tone of the film in its entirety. Florence Pugh is exceptional in the lead role as Katherine. Despite the actions that her character commits in the second half of the film, she manages to generate sympathy while still portraying herself as a twisted individual--almost an impossible trick to pull off. But what elevates this film to utter brilliance is that it is not solely a defense of her--or a defense of anyone. Rather, it is simply a unique reflection on the notion of social status at the time period that skewers all preconceived notions of judgment--including morals and morality--to the point of ambiguous analysis. The film's true messages are quite complex, even though its direct plot is not difficult to follow. This is why even simple, dialogue-free scenes such as moments when the camera stares at Katherine's face as she is seated, tell you so much about her as a character and her mood to a degree that I have not really seen in any film of recent memory. Such complexity, though, is what makes the film an unforgettable watch. (Of course, the uniquely simple look and feel to the film and its excellent, slow-burn-style pacing also contributes greatly to it.) Recommended to the highest degree. 10/10","user":"bastille-852-731547","rank":[65,88]},{"title":"Excellent story telling - beautifully acted and directed.","rating":9,"date":"4 May 2017","review":"I was enthralled by this movie from start to finish. The cinematography and sound were excellent. The complete absence of a music soundtrack except for two notable atmospheric crescendos added to the overall oppressiveness of the story and the location. All of the performances were excellent and the lead was outstanding IMO. The story was in many ways familiar - being evocative of Bronte and Hardy - with its portrayal of Victorian country gentry and the brutality and sense of entitlement that sometimes occurred between the classes but the way the story unfolded frequently surprised me by not following through in the way one might have expected it to. I too would recommend a cinema viewing in order to get the full effect of the landscape and the oppressive silence of the house.","user":"choonmixer95","rank":[51,72]}]