[{"title":"Pure cinematic excellence","rating":10,"date":"10 August 2015","review":"When I saw the trailer of Victoria I was really interested in the movie, because I am a fan of Sebastian Schipper, who directed also \"Absolute Giganten\", one of the best German movies in recent years. German cinema had to struggle in the last years, too many movies about the German past or really bad and soulless comedies flooded the market. Only really few risks were taken and some of them were pretty good E.g. \"Zeit der Kannibalen\", but for the most part they sucked. <br><br>So...there comes Victoria, a movie by a experienced director, with (for the most part) unknown faces in the cast, a really small crew and shot in a single take in a night in Berlin. Latter is something truly unconventional for a German film, so I went into the theater expecting a good unconventional German movie. <br><br>What I got was a masterpiece. Victoria is not only the best German movie in years, but (IMHO) the best movie of the year yet. The tracking shot in the movie isn't only there for effect and a showcase of the cinematographers talent, but a essential part of the films main story, that unfolds around a Spanish girl named Victoria, that meets a bunch of \"real Berlin guys\", so they call themselves, in the middle of the night. You experience the story of Victoria in real time, you see live character development for instance.<br><br>That, the down to earth acting and plot make the movie so incredibly immersive that it becomes something completely new and fresh, which is incredibly rare in recent years. I don't want to give away more about the plot, so I'll talk about the acting. The acting in this movie is fantastic, the dialogue is actually completely improvised, so that the actors, especially the fantastic Laia Costa and Frederick Lau, become these characters in those 140 minutes and it feels real. It feels like they are actual existing persons.<br><br>The cinematography is brilliant, Sturla Brandth Grøvlen does a fantastic job in accompanying the main characters and even if there are some shaky parts, which was expected, its never annoying and the viewer becomes the camera. Another aspect of this movie that I adored was the soundtrack. It was perfectly suited in supporting the atmosphere and hypnotic. <br><br>I left the theater speechless, what happens in the final act will either throw you off, or you will be completely exhilarated. Either way: Watch this movie and support movies with original concepts, only like this we will continue to get better movies than the usual dog**** from Hollywood and co.<br><br>Victoria is a truly exhilarating masterpiece and the first time I felt like watching a new kind of cinema in a long time. Go and watch it. Its worth it.","user":"kamille-roboter","rank":[153,211]},{"title":"This movie is a masterpiece","rating":10,"date":"24 June 2015","review":"I never really write reviews or tell anyone about the stuff I watch, but for Victoria, I just had to make an exception<br><br>I was never so drawn into a movie before, it was amazing. The characters act so natural you really feel like you are experiencing this night with them for real. No 3D or any fancy stuff that movies do today can draw you into a film this much.<br><br>Sometimes during the movie - because all the location changes are perfect - I wondered how much time since the beginning of the movie has passed in \"their world\" - and then it came to me! You are with them all along, there is no timeskip, no narrating, nothing that could put your focus away from whats important: <br><br>The five characters and that fateful night.<br><br>I tell everyone I meet that they should go watch this movie: once this has been to a few more filmfestivals and stuff, there is no doubt that it will become a massive hit. I think this movie even surpasses \"the life of the others\" and I definitely would recommend it as one of the best German movies I know.","user":"felix-krel","rank":[194,273]},{"title":"Victoria: A One Take Wonder","rating":8,"date":"12 June 2015","review":"In 1948, Alfred Hitchcock released \"Rope\", a film which consists of only eleven shots. Hitchcock's intention was to film it as one continuous take, but of course, the technology was not available at the time to enable this desire. It's wonderful to see how far cinema has progressed over time, allowing masters of the craft to be able to capture moments of films in real time, and add an intense and more realistic affect to their material. <br><br>In 2002, Alexander Sokurov's \"Russian Ark\" premiered at Cannes. A 97 minute one-take marvel, without a specific narrative, that was filmed entirely in the Winter Palace of the Russian heritage museum. Other such films that have utilised similar techniques include \"Timecode\" (consisting of four separate but simultaneously continuous shots), \"Birdman: or the Unexpected Virtue of Ignorance\" (A.G. Inarritu's Oscar winning black comedy, edited to flow as one continuous take) and PVC-1 (a Columbian film consisting of one 84 minute take). We can now add Victoria to this canon of films. <br><br>The technical achievement of \"Victoria\" can not be completely appreciated until the final credits roll. It's exhausting. An engrossing, kinetic and intense exercise in filmmaking that will not appeal to all audiences. But, to those it does strike the appeal towards, you are in for a treat. For over two hours, the camera does not cut once. We are with our title character every step of the way. Many films that take on this bold challenge of constructing a piece of cinema using one shot often limit themselves to a single (or few) locations and rarely exceed a duration of 100 minutes. <br><br>Not Victoria.<br><br>For 134 minutes, we span across 22 locations throughout Berlin, starting at a techno club where we meet our Spanish protagonist, Victoria (played beautifully by Laia Costa). The opening shot is a pulsating one, in which you can not ignore. The blue strobe lights fade in, a beat pulsates heavily, and there, slowly coming into focus, is Victoria dancing - essentially by herself. Her loneliness is set up early on the film, with her isolated/out-of-place presence around the club and the fact that she asks the bartender himself if he'd like to have a drink.<br><br>As she leaves the club, she bumps into four men: Sonne (Frederick Lau), Boxer (Franz Rogowski), Blinker (Burak Yigit) and Fuss (Max Mauff). They're an odd set of characters (with names that would suit reindeers better) but they show Victoria attention, attention that she appears to have been craving whilst living alone in Berlin. The group appears to be led by Sonne, or at least he is the one whom Victoria hits it off with the most. They ask if she wants to join them to celebrate Fuss's birthday. Initially unsure, she agrees. Seems unlikely? Don't worry you'll be glad she did.<br><br>After spending more time with these men, moving across rooftops and through the streets, we end up at the café which Victoria works at, and which she has to open for or in the morning. Keep in mind that it's past 5AM by this point, so her sleep would be limited. This moment feels like the core of \"Victoria\" (as both a film and character). A sudden impromptu piano sequence shows a much more emotional side to Victoria, and further expands upon the possible romantic opportunities between herself and Sonne. The sequence which follows completely shifts the film into a separate genre, and that's what is so great about it. We have now entered the genre of 'crime', where by in which our boys owe a favour to a certain \"not-to-be-reckoned-with\" figure. Your heart will be in your throat during certain points as Victoria is roped into an intense bank heist.<br><br>The film is never pigeon-holed into being \"one-thing\". It's bold and fierece and often sprawls in unexpected directions, all the while it beautifully maintains its stunning one-shot sequence, allowing us to experience every single moment over this 2 hour + period. Is all of it necessary? Maybe not, some scenes seem a little stretched, but hey, it's part of the experience. From what I believe, the original screenplay was only about 12 pages long, meaning that the vast majority of dialogue is improvised. This is evident during various of points of the film, but it's easy to forgive any falsities. The cast (especially Costa and Lau) do an excellent job of maintaining an intense sense of realism, which may occasionally fall slack, but thankfully with Schipper's tight direction, it's not very often.<br><br>Premiering at the 66th Berlin Film Festival, cinematographer Sturla Grovlen won the Silver Bear for Outstanding Artistic Contribution for Cinematography. It's no surprise as to why, the cinematography is daring and audacious and wildly contributes towards constructing a naturalistic atmosphere. It's a stunning achievement, and the film as whole is not perfect, but it knows that. It happily unfolds itself as a genre transcending piece of cinema that often has unexpected moments of dark beauty hiding up its sleeve. Enjoy.","user":"TheMaster01","rank":[100,139]}]