[{"title":"603rd Review: Good on modern composers, but could be more","rating":7,"date":"17 November 2017","review":"Score is the sort of documentary that anyone with more than a passing interest in film can enjoy - financed partially by 1,870 backers it explores in real depth the process, the creation, the orchestration, engineering and history of the past 30 years in film.<br><br>Score starts ambitiously, looking at movie scoring in the 30s, 40s, and 50s, before turning to the great composers of the 70s Jerry Goldsmith and John Williams. It then turns to look at more recent favourites. There are plenty of interviews and plenty of scores.<br><br>However, the film is restricted by studio choices to only being able to use certain scores, and some of the really great film scores that one would love to know more about just aren't there. In particular, with the tragic death of James Horner, having only a two minute piece (a very good piece though) in the end credits is a real shame. I sat through the whole film waiting for the section on James Horner that simply isn't there.<br><br>Again, it is a well-made and interesting insight to the world of film scoring and deserves viewing, but for this viewer by not being able to get all the studios to release their soundtracks at a minimal cost the film ends up focusing on only some of the great scores.","user":"intelearts","rank":[7,7]},{"title":"Good, but could be better.","rating":7,"date":"7 May 2018","review":"I enjoyed the background and interviews, but wanted more. I can't believe John Carpenter was not included. I am not sure if he is being slighted by Hollywood for doing his own thing, but he deserved to be included. Another slight was the recently deceased Johann Johannsson. Johann was one of the most innovative modern film composers and will be deeply missed. I also wished they would have revisited the guy with the Piano in the valley to see what he did with that unique set up.","user":"spgreen-36239","rank":[4,4]},{"title":"Great but needs a Prequel","rating":9,"date":"28 October 2017","review":"Great entertaining detail on the technology that goes into movie music. I liked the attention to the musicians and agents as well. Introducing us to the studios, large and small, was appreciated. I would like to see a companion piece by the director on the earlier film composers. Then he can include Rota, Korngold, Elmer Bernstein, and more of Herrmann, Alfred Newman, Raksin, Steiner, and Waxman.","user":"jdziubek-78104","rank":[7,9]}]