[{"title":"The best Cobain focused documentary I've seen.","rating":8,"date":"17 July 2015","review":"Some will complain that the documentary doesn't focus enough on Nirvana, and there's a very good reason for that. It's not a documentary about Nirvana; the film is intended to provide a more intimate look at Kurt Cobain as a person and provide insight into his more private and guarded moments. In that respect it is pretty successful. Nirvana's history is very well publicised, and the film assumes it's viewers are already fans that know a lot about the band (Why else would you watch a movie about the band's frontman?) <br><br>The films biggest selling point is that for the first time a director had the full cooperation of Cobain's family and access to the archive of materials he left behind, much of it had never been seen by the public eye before. These include home movies dating back to him as baby, behind the scene footage, and audio recordings. There is also going to be a companion book dedicated to never before seen photos and other materials that were unearthed. Unfortunately, it's not as exciting as it sounds. There may have been information I had never heard before, but none of it was surprising or profound. It all falls in line with what you would expect if you knew anything about Kurt going in. (I'm sure some people will disagree and say they found it shocking, but I didn't.) That being said the archival materials were well utilized and had a good presentation that fit into the story that was being told. It was nice to see them even if it was an over- hyped aspect of the movie.<br><br>From a technical standpoint the film really is a marvel. The animated transitions were a great way to incorporate the drawings and doodles that littered Kurt's notebooks. There are also scenes featuring puppetry and stop motion that are also inspired by his art and/or song lyrics. These are all really cool and actually provide more insight to his artistic style and writing process than you would think. <br><br>Additionally, several segments are entirely animated, and they look beautiful. Doing this is much more captivating than just just showing people talk about events or have a voice-over with a slideshow of pictures. It was a very good choice, and adds a lot to the viewing experience. <br><br>The film's soundtrack features live Nirvana recordings, covers and remixes, as well as music by other artist that fit the scenes, such as the Buddy Holly song that plays over his parents home movies from the '60s. This is well executed and I particularly love the violin rendition of \"Smell Like Teen Spirit\" that was used to mimic an orchestral score in the longest animated sequence. <br><br>Overall the film is an energetic and seemingly honest look at Kurt Cobain and the man he was. It was well made, entertaining, and a worthwhile documentary that stands head and shoulders above any other documentaries about him.","user":"ecmelton-186-105049","rank":[25,28]},{"title":"Thirsty for More","rating":5,"date":"30 August 2016","review":"I found Montage of Heck to be a scatter-brained documentary that couldn't decide which direction to go. It grabs at various forms of media culled from Cobain's family, and tosses them into a blender, with splashes of interviews and band footage. <br><br>There were some stunningly rotoscoped animation, using narration from Cobain, that briefly takes you through his dejected teenage years in Aberdeen, Washington. They also rendered the years Cobain spent living with his first girlfriend, Tracy Marander, who supported him when Nirvana started getting noticed. Marander isn't shown (only in interviews and rare photos), we just see how Kurt spent his days being creative while she was at work. Anyway, not long after, the band signed to Sub Pop and released Bleach. <br><br>There were also drawings and writings (many would make Jack Kerouac's \"spontaneous prose\" seem lucid by comparison) from his sketchbooks / journals, that were brought to life using muted computer graphics. These were scattered throughout, and became laborious after about the 10th time. Still, the music that accompanied them were great. We get to hear plenty of unreleased material, and I even noticed some Nirvana covers, which felt redundant. <br><br>Now, cue in Courtney Love. Sigh. It was annoying seeing her all dolled up by a makeup artist, chain-smoking and sounding incredibly untruthful about Kurt's last couple of months. I won't ruin it, but it's towards the end of the film and it made me more suspicious of her. The home videos of Kurt, Courtney, and Frances Bean were quite touching, although at times it got dark, especially some moments with just Kurt and Courtney (not 100% on who recorded them). You know he was the happiest he's ever been, but they were also plunging into the abyss of heroin and other drugs. <br><br>Overall, Montage of Heck started off as a sweet concoction that ultimately left me with a bitter aftertaste. I hear that 'About a Son' is the superior documentary, so I'll watch that in hopes of getting a deeper insight into Kurt Cobain and Nirvana.","user":"DeltaHomicide","rank":[11,12]},{"title":"A refreshing documentary that presents Kurt Cobain as a human not a victim.","rating":9,"date":"21 June 2015","review":"By far this is the most comprehensive look into Kurt as a human being, without the sole focus being on his drug addiction and his depressive moods.<br><br>For the last 21 years the majority of what has been published has focused on Kurt's last few years and his impending demise but it was refreshing to see a documentary that tried to look at the big picture which included home footage of Kurt with his family as a young kid and as an adult, just being himself.<br><br>The inclusion of so much of Kurt's art and personal journals added so much depth and insight into his feelings at different times over his life, even though editing can skew what we see and what we don't.<br><br>It is fantastic that Frances Bean Cobain had an integral role in producing a more accurate representation of who her father really was rather than who the media/tabloids wanted him to be.","user":"riaghan","rank":[11,12]}]