[{"title":"Everyone seems to have missed the truth here","rating":8,"date":"20 December 2018","review":"In reading all of the different reviews I've noticed that no one realized that \"both\" of the other dimensions the kids visited were, absolutely, the same dimension. That's how Mr. Wallace was able to get everyone to stand down to get the kids back into the closet. It's ALSO why the main girl's sister tried to smother her. When they run away the sister says \"you should have just let me smother you, it would have been easier\" it's because she, and everyone else, knew that they were in this horrible consequences of your actions dimension.\nYes, the movie had some pointless moments, but it WAS a good movie. It keeps you guessing until the end. And when you don't get the answers you're looking for, you have to think about the movie after it ends. It's a movie that's engineered to make you come up with your own answers later. It's a solid and smart movie. Would definitely recommend.<br><br>Also, I wish they still had the forums as I would also like to explain the pencil and Derek's (the bully) disappearance. Many people think that the movie emphasizes the pencil for no reason. But that's not true. That pencil is going to have the bully's and the main guys blood on it. From when he cut his thumb just before entering the closet. He's going to answer to murder charges after the movie ends.<br><br>I only took the time to write all of this because I know a lot of people come here post movie for answers, so i'm here to scratch that itch. Hope you enjoyed it!","user":"graceh-14901","rank":[28,39]},{"title":"Fun, eerie horror flick within a high school party flick.","rating":7,"date":"16 October 2018","review":"Seven in Heaven.. sounds like a teen rom com, but actually is a cool and creepy little horror mystery film. The whole premise of a secret closet in a house that transports two high school students to a messed up alternate reality should reel most viewers in. It did for me anyways, and I'm glad I watched it because it was fun and it keeps you guessing throughout the film's runtime while still remaining creepy and suspenseful at the same time. I actually wish Netflix would add more movies like this. Who cares if they are kind of low budget, the film still looked really good and I was impressed by the eerie atmosphere they created by using the dark reddish look in the alternate reality. Yes check this one out! A high school party movie/ horror fantasy thriller. 7.25/10","user":"Andrew_Wiper","rank":[32,47]},{"title":"at its best when its not answering questions","rating":7,"date":"14 October 2018","review":"This film promises alternate universe escapades from the very start. but several minutes into the film, you can quite readily tell this is not the kind of film that is prepared for all the sci-fi and mind-bending trauma that such a thing entails.<br><br>\nthis film overcomes that sort of thing by remaining concise, focusing not on the alternate universe itself, nor lingering too much on how they end up getting there, but keeps tightly focused on the protagonists trying to get out of it.<br><br>\nalong the way, Gary Cole appears as a teacher who inexplicably appears to be fully aware of the protagonists' ordeal and acts at times as an exasperated guide and other times a menacing sort of referee between the protagonists and the alternate universe people who are hostile to them.<br><br>\nWhile this is happening, the film is also focused on the \"main\" universe people the protagonists have left behind during a house party, dealing with the fact that two of their friends just disappeared in a secret closet, and now the cops have arrived, one of them having made the mistake of not bothering to check if there was drugs or underaged drinking occurring and now unable to get a warrant to enter the house and so is now squatting outside waiting to arrest any teen that tries to escape.<br><br>\nA lot of aspects of the \"travelling\" are unanswered, and it works best when it remains unanswered. Everything about it feels functional and meaningful in some way unexplained to us in such a way that it just works, and the mystery makes it more compelling.<br><br>\nAt some point, however, the movie starts caving in to the pressures of storytelling, and starts to set things up in a more surreal and less sci-fi fashion. The \"alternate\" universe somehow ceases to be an alternate universe and becomes something more fitting for a morality fable, while some of the precise mechanisms of the \"travel\" are given some flimsy explanation with incoherent nonsense involving a playing card as a \"passport\".<br><br>\nNone of that manages to completely derail the rest of the film, but it certainly fumbles a great shot at an alternate universe type film with the limitations of budget and location.","user":"phenomynouss","rank":[30,46]}]