[{"title":"Things to learn","rating":6,"date":"14 August 2016","review":"There is only one other review on this page currently (dated 7 Aug 2016) but I think it sums things up nicely, and I find myself almost completely in agreement with it. There are, however, a few things I would like to add.<br><br>I don't feel like I have wasted my time if the film has managed to maintain a smile on my face, and I can learn a few things along the way. In this case, the film definitely informs the viewer of several interesting things regarding the modern sex industry, while at the same time making a study of the struggling middle class and its increasing crossover into taking more desperate measures in order to get by.<br><br>If I had to point out faults it would be that there are a few issues/sub plots the director raises but then doesn't fully address, and in fact just completely brushes them aside in order to provide the film with the desired ending.<br><br>But to sum up, as long as you watch this film in a situation where sex topics are not going to cause embarrassment, I regard it as worth watching and a bit of fun.<br><br>Oh, and I'll disagree with the other reviewer and say that Ashley Tisdale would by my pick. ;)","user":"go_titans","rank":[15,23]},{"title":"Perfectly forgettable film","rating":6,"date":"17 August 2016","review":"This film wasn't terrible. Not at all. But it wasn't anything special either. I had a decent enough story (apparently based on a true one), and was executed well enough (though I really don't think a smart guy like Guy would have made the bad decision he did at the end).<br><br>Jason Biggs was the only reason I watched this movie, and he was the best part of it, playing basically the same character as American Pie. The only parts that made me laugh (2 or 3 times) were from him. Otherwise, the film was basically forgettable. I didn't regret watching it, but I could just as well have watched something else and not regretted missing this either.<br><br>This doesn't have a rating listed, but for those wondering it would pretty much be rated R because of language and sexual content (though I don't really remember anything above PG-13 nudity).","user":"spmact","rank":[11,19]},{"title":"It was very mediocre, but I like it.","rating":6,"date":"7 August 2016","review":"Not a bad movie at all but nothing to get excited over. It's very bland in it's implantation of the plot.<br><br>I've seen this before. The economy is bad and Jason Biggs plays a highly college educated man who can't get a job in his field. He can't wait any longer, because his out of work wife is having a baby, and they have no insurance for it, so he takes the first job that's offered to him: A job as a driver for a group of strippers.<br><br>Jason Biggs was right for the role as the main protagonist. He brings a sweetness to the whole movie. His innocence is believable without being too melodramatic.<br><br>I thought it was interesting that they did not bring up the strippers dark side to why they became strippers. Early on the movie explains it's about the money and it's good money and it's a job and nothing else, which is pretty much the prime basis of the movie is that everyone needs a job. It's not that the dark side of stripper would have added anything to the light comedy, it's just one cliché they seem to have left out.<br><br>I did like how the strippers were portrayed in the film. It's very new era, showing just how in control they are of the situation, which is how it should be and hope that the film statement of being semi-true is getting that accurate.<br><br>Plus all the girls were sexy, especially Bria Murphy. can't help to cross my mind what Papa Eddie thinks of the film.<br><br>Anyway, the story has the potential to leave a mark, but it's not a decent enough comedy. You'll watch it, have fun, and a minute later forget all about it.<br><br>http://cinemagardens.com","user":"subxerogravity","rank":[18,36]}]