[{"title":"\"The Witch\" is horror for cinephiles, not as much horror genre fans","rating":8,"date":"16 January 2017","review":"There's another version of \"The Witch\" that could've existed. A Puritan family in New England gets terrified by a witch living in the woods, who torments them with supernatural Satanism. If you're saying to yourself, \"wait, isn't that exactly what this movie is?\" then you've come to the right review.<br><br>I'm not what you'd call a fan of horror movies. I don't gravitate toward the genre and I almost never seek horror movies out in theaters. That said, any movie that garners critical acclaim or positive buzz piques my interest as a fan of cinema on the whole. \"The Witch\" lives in that territory as a horror movie for cinephiles, not for audiences who love the thrill of a good scare.<br><br>That's not to say \"The Witch\" isn't scary; it is. It's just not scary in the modern trend-driven, formulaic, \"movie trailer that ends with a jump-scare\" kind of way. Writer and director Robert Eggers, who makes his feature film debut, builds his terror with tension drama and mystery, not by creating the pervasive sense that some creepy thing will pop into the frame at any moment.<br><br>Eggers, a production designer first and foremost, builds his \"Puritan nightmare\" from the ground up, starting with all the tiniest era-appropriate details in the set, costumes and even dialogue. It doesn't take a historian to notice the immaculate craftsmanship and consideration of time and place. Eggers' devotion to this realism pays off in that the \"The Witch\" never loses its footing in reality even as more supernatural elements creep into the story. Well, until the end, but let's not go there except to say that by then, the realism matters much less.<br><br>The story follows a Puritan family that leaves its plantation and village over religious differences and goes off to build a home near the edge of the woods. Suddenly, the family infant, Sam, disappears under the watch of the eldest child, Thomasin (Anya Taylor-Joy). The incident devastates the mother (Kate Dickie) and father (Ralph Ineson), who convince everyone it was a wolf that took Sam, but the tragedy trickles down to the four children, Thomasin, pre-teen Caleb (Harvey Scrimshaw) and young twins Jonas and Mercy. Of course, the audience is privy to what actually happened to Sam, and we know things will only get worse for the family.<br><br>Considering the legitimate Puritan fear of Satan and witches, the subsequent events begin to tear into the family dynamics, which adds to the tension that already exists over what unnerving thing might happen next. The story could definitely have gone deeper into distrust and paranoia, but then it might have become too much of a \"witch trial\" movie.<br><br>The way the movie ends will draw no shortage of opinions, but without a doubt, Eggers and cinematographer Jarin Blaschke have made an and utterly engrossing film that would be just as effective had it just been a period drama instead of a horror film – from a visual standpoint. Blaschke works almost exclusively with available natural light, which in addition to bolstering Eggers' emphasis on realism, keeps the specter of darkness and evil hanging over the family. In fact, had the film not marketed itself so overtly as a horror film, it might have been given more awards consideration. <br><br>Regardless, Eggers delivers a remarkable feature debut that's a definite breakthrough candidate; he will certainly have a lot of eyes on his future projects. His focus on detail and strong cinematic instincts could work wonders on a more mainstream project, but if he opts for more small-budget genre films, no complaints here.<br><br>~Steven C<br><br>Thanks for reading! Visit Movie Muse Reviews for more","user":"Movie_Muse_Reviews","rank":[293,383]},{"title":"Gut-Wrenching Tension","rating":3,"date":"3 February 2015","review":"Period pieces don't often serve as the backdrops for horror, which is actually a real shame. Consider The Witch, a story about a banished Puritan family trying to sustain itself on the edge of an ominous forest inhabited by a gruesome witch. The faithful representation of one of the most creepy time periods in American history makes all the difference here. The family's dealings with the supernatural terror in the woods push their spiritual and physical endurance to the breaking point. Robert Eggers pulls no punches and makes no apologies in this film. The Witch's scenes are steeped in primal dread, and each actor makes the audience feel the seams come apart as paranoia and mistrust begin to take their toll. While Game of Thrones alumni Ralph Ineson and Kate Dickie offer brilliantly raw performances as the family's mother and father, it's the film's younger actors—Harvey Scrimshaw and Anya Taylor-Joy—who really shine. Scrimshaw captures the nuanced turmoil of being an adolescent male in a strictly religious family. As the oldest daughter who is blamed for the witch's malevolent deeds against the family, Anya Taylor-Joy shows a surprising amount of risk and range in her performance. The film swings for the fences on all fronts. The performances are explosive, the tension is gut-wrenching, and the settings are nightmarish. To the horror films of 2015, the gauntlet has officially been thrown down. –Alex Springer","user":"SLUGMagazineFilms","rank":[389,530]},{"title":"As good as psychological horror gets","rating":21,"date":"21 October 2015","review":"I feel like I can't come up with the right words to describe this incredible movie, but I'll try. The lingering atmosphere is done incredibly well from the beginning, helped along by a combination of a tense score and the use of extended periods of silence. The acting is bang-on and you don't know when or how it is going to end. The movie doesn't have 'twists' exactly, but the way it is written keeps you guessing constantly. And I personally loved the ending. Though the potential is there to use a more standard approach, The Witch however opts to go down a more subtle avenue, leading to the true nature of religious persecution that is on full display here. Additionally, elements of the story have been taken from historical documents, adding another layer of grimness. The supernatural elements are obviously up for discussion, but that these tales were written centuries ago somehow adds more to this disturbing film.<br><br>The film is set in 1630, in New England, America. A Puritan family is banished from town for their beliefs (or it at least seems this way, perhaps based on real events). They are forced to move to a farm that feels like it is on the edge of the world, as from the opening the woods that line the farm are presented in ominous fashion, almost creating a character that could serve as the scariest element of the film. What exactly goes on in there? Why can't the children venture inside? Suddenly, without warning, tragedy strikes. The family clings to their faith to prevent them from starving as their crops die; with nothing they can do to prevent it.<br><br>The period is an appropriate choice given how humans treated each other centuries ago, and an ideal setting for a horror tale. Some conversations require a little more attention, as the characters speak in 'ye olde English' which takes a little getting used to, but it adds another layer of mystery as the family is struck by more inexplicable hardships, causing them to become wary of each other, which in turn leaves them in a increasingly vulnerable state. I can't say I is scared, but I do know that I is gripping the armrests pretty hard for most of the film. Hell, they manage to make a scene where a man is hunting a rabbit seem tense and creepy! Additionally, this is not for inattentive viewers; I could see clock-watching all around me. The incredible camera-work almost reminds me of Paul Thomas Anderson in There Will Be Blood, with many long takes, often slowly panning or zooming in. There is also a focus on facial close-ups reminiscent of Bergman, all of which is a feast to watch on an IMAX screen. The score matches this camera-work almost to perfection, while there is often a lengthy silence between dialogue to contrast the tense music. It also must be mentioned that the child actors really shine, out-doing their older counterparts.<br><br>This really is my sort of horror film. No jump-scares, convincing acting and a focus on a dark, foreboding atmosphere rather than the grotesque and bloody. This is another of those films I would label as a psychological thriller, as the supernatural horrors are kept almost completely out of view as we witness the downfall of a family who are all affected, turning on each other as their faith is truly tested.<br><br>This film couldn't have catered to my interests more; I can't recommend it to everybody, but if you go in with no preconceived notions you'll be in for a tasty, if not nasty surprise. The suspense is almost unparalleled among recent films, and the 'horror' genre conventions are cleverly subverted to deliver a film that is better than 'It Follows' while being a completely different film. In addition to all this, there is much to take in thematically if you are so inclined Hell, I'd love to see this again to do just that.<br><br>www.epilepticmoondancer.net","user":"punishable-by-death","rank":[358,536]}]