[{"title":"Lazy writing riding on nostalgia...","rating":2,"date":"9 October 2019","review":"Total waste of time, full of plot holes, senseless and illogical...\nIt was good seeing the gang again but totally disappointed by the degraded storyline...<br><br>The lack of Intelligence and effort behind the duels in this movie is really irritating..<br><br>We need to have standards when rating movies/shows or else It all becomes pointless","user":"gtenalokes","rank":[6,7]},{"title":"Terrible. Who makes a Yugioh movie without the voice actor?","rating":1,"date":"12 February 2017","review":"I give this movie a 1 because well, the writing is terrible compared to the original series. Secondly, the movie teases you all 2 hours long that Atem (Yami Yugi) will return, but you never hear him speak. There's only still shots that show him but he never speaks and it's a cheap way to cash in on die-hard fans. Secondly, all the characters are one dimensional and serve no purpose. Kibas action in the movie at the end makes no sense at all. I hope my review doesn't spoil anything but if you are going to watch a Yugioh movie, it's only fair that you know you won't get to hear the main voice actor that made the series the success that it was.","user":"deathwing702","rank":[30,52]},{"title":"Hooray!","rating":8,"date":"28 January 2017","review":"A triumphant, big-screen return for Yugi and friends.<br><br>This film is fun and exciting for those of us who grew up with the original anime, but new viewers won't be disappointed, either.<br><br>The duels themselves are very fun and exciting, and the wonderfully composed music strengthens them even further.<br><br>My only complaint is that the film felt a bit too long. For example, there were a couple of scenes that really didn't add anything to the film which could've easily been cut out.<br><br>Wonderful animation, a surprisingly good story and the usual rhetoric about the power of friendship make this one a winner. Even if you think you've outgrown this franchise, I still suggest seeing this one. I left the theater feeling energized and joyful.<br><br>Recommended.<br><br>8/10","user":"skylerisaac","rank":[18,39]}]