[{"title":"Boring, dull stack of nonsense.","rating":1,"date":"29 July 2018","review":"Ok so, <br><br>It's a poor movie, it's just bad. But not like funny-bad... The story is badly told,\nBlank and dull characters, no structure &gt; You end up wondering who is who even after 30 minutes in. I mean, I didn't even catch the protagonist name because they keep boucing between all of those scenes. No time to know the other characters, they either die or just disappear of the movie too fast.<br><br> First part of the movie totally about the killer &gt; you end up forgetting that he is the antagonist and the \"bad guy\"(We're also pretty much more sensibilised to his feelings than to the protagonist's which we may have forget that she is the protagonist aaaand.. So when we're back to her, we're like \"Heck what's happening here? Who's this again?\" (it seems they even changed her haircut between two scenes, made things more difficult))\nThere seems to be random people (blurred face) in the background... That's not professional at all. Who does that in a movie?\nI don't think I need to go on, it's just so bad, it doesn't catch your attention. \nMaybe they added a bunch of panties shot, short skirts, teens having sex for this purpose? Heck, still lame.<br><br>I do not recommend you this movie, even to kill time. It's just boring.","user":"neroaquiria","rank":[9,11]},{"title":"TERRIBLE ! And I don't just mean the idea.","rating":2,"date":"28 July 2018","review":"First off yes the idea of making a movie based on the UCSB killings that left 6 dead is a terribly disrespectful thing to do, so if you do take on this task you better be sure to get it right. Albeit this killer uses a knife and in reality it was a shooter but using the same college and streets from the actual event with the same amount of murders and the Director/Writer Shawn hart is from that area and went to that college it isn't hard to figure out this movie was based on the Isla Vista shootings. Why Mr.Hart would try and lie saying in an apology he didn't base it on that incident is also a farce.<br><br>From the beginning of this movie the picture painted of this circle of female besties is not a good one. Many times I felt as though I was more in tune with the killer then the victims. The storyline was also discombobulated bouncing all over the place maintaining no cohesion &amp; not giving you a clear idea of the characters and their development.<br><br>The videography was on auto focus in some scenes getting blurry and then popping back in to focus very amateurish. I even saw scenes where I guess the people were real citizens and not actors because their faces were actually being blurred as they would approach the camera or cross by. \nIt also had some very poor acting. The girls were beautiful and their halloween costumes looked marvelous but besides being eye candy there really wasn't much else they brought to this film. I think the killer definitely put on the best performances both of them the high school kid and the older one for the college years, The mask he used was a great addition very creepy and horrifying But that's about the extent of good things attributed to this film.<br><br>I've never seen a horror movie with such blatant disrespect for logic, not once but twice the lead character runs threw a crowded area of people and isn't screaming for help while being chased by the killer, I mean c'mon keep some reality connected to the plot. All in all this film receives a terrible rating of 2 not because of the half a million spent on the budget because the camera and special effects did a good enough job that it wasn't a problem watching this film all the way through but with a poor execution of Acting, Storyline, Writing, Pace and Realism this movie fall flat on it's face. Don't waste your time on this one.","user":"tkaine3","rank":[8,11]},{"title":"Really not good","rating":2,"date":"28 July 2018","review":"Imagine Rob Zombie's 'Halloween' but with bad actors, a completely messed up script, needless nudity, and bad directing... okay, it's just like Rob Zombie's 'Halloween'. Alright, 'Halloween' isn't that bad, but this movie is. It is really hard to follow, has some horrible acting, is very cheesy, and never should have been made. It's story is very similar to the aforementioned 'Halloween'. I won't spoil it or get into the details but the similarities are obvious. There's no point to watching this one unless you have already seen every other movie ever twice, and are seriously desperate for something new. It's a NO for me.","user":"mikedegroot","rank":[5,7]}]