[{"title":"Not a cult classic but still a good watch","rating":5,"date":"23 November 2018","review":"I did enjoy parts of the movie but it deff. won't be a cult classic as it lacks substance. The visual styles of the movie were good and the acting was ok, but the plot lines seemed to go no where,<br><br>5.1","user":"natcalgary","rank":[4,4]},{"title":"Horrible...","rating":1,"date":"24 October 2018","review":"Before leaving this review I read some others- just to clear things up, this will NEVER EVER be a train spitting. Period. This movie goes absolutely nowhere. I know it's based on a book, but this movie so falls short. Yes the cinematography is very good, I will give it that. And the music during drug scenes and around Taipei was also done well. But I felt like all I did was watch a couple use drugs over and over and over with no...what's the word...enlightenment about anything they were doing? Sure she deleted their documentary footage in the end but I felt like there was no depth to the film, it was all just superficial. And the actors, well I feel like the lead girl didn't fit the part and I often had a hard time understanding her. If you feel like watching this movie on a free channel, go ahead but I wouldn't waste a dime paying to see it.","user":"piscesblue","rank":[6,8]},{"title":"Celebrity writer alledged autobiography","rating":6,"date":"8 October 2018","review":"Watched it on Showtime and although I have not read the book it is based on, Taipei, from the description of the book it does sound like much was followed including the names of the main characters. <br><br>Guessing the success of the movie Crazy Rich Asians might have been a factor in the film airing before the 2019 date. <br><br>The film is an unapologetic glimpse of a celebrity Asian writer and his circle of wealthy friends but focuses on the relationship that develops.<br><br>It is sot for everyone and don't expect any Hollywood ending here. I do feel it was worth the watch but passing up on it would be no big deal.","user":"jrneptune","rank":[4,7]}]