[{"title":"Tells the tale of bomb city punks perfectly","rating":10,"date":"13 February 2018","review":"I was living in Amarillo Texas when this happened, although I was only 8 I can still remember the news story's and the trial. I grew up to be a punk and have a similar life to the punks in this movie. I watched the credits in tears and thought of my youth. I knew the story and what was going to happen and I still became very emotional watching this. I personally know many people who were directly affected by Brian and his tale. The movie was brilliant, very well directed and was visually Amazing.","user":"alysa_gyllenband","rank":[59,81]},{"title":"This movie is a love letter to fallen heroes and fellow outcasts","rating":8,"date":"6 November 2017","review":"I don't know if this is a good way to start a movie review, but after seeing this movie all I could think to do was message an old punk buddy of mine and warn him that the next time I saw him 'I was going to hug him and never let go.'<br><br>I have so much praise for this movie I don't even know where to begin (I would have expressed this praise to the filmmakers during their Tallgrass Film Festival Q&amp;A, but when I was given the mic to comment, I just couldn't make ...words.) Y'see, it's a ton of bricks this movie... Not just in sad ways either, mind you, but across the board. The authenticity is overwhelming: The accuracy of the hangouts, the music blaring, the art that was happening, the bond between outcasts-if you've been there then you know the good times that are had with people who have nothing but would give you the shirt off their back if you needed it. But sadly, a part of that authenticity....the world is usually at war with us outcasts, and this movie shows that reality. Hard. Like all those bricks I mentioned earlier.<br><br>I'll quit waxing poetic and get to some movie stuff over here- The 3rd act of this film includes a scene that is still managing to shake my punk self and the film snob he grew up to be- to avoid violating the 'spoiler' criteria of this page, I will refer to this scene as the 'Truck Ride'. It may be the most haunting and true depiction of that journey I've ever seen committed to film. It's a perfectly filmed moment and- I pray I'm not out of line by saying-inspiring. Absolutely, we know the tragedy and bedlam that is looming when you take such a ride (and in no way am I trying to make light of the things that follow) but the filmmakers show that along with the fear and bloodcurdling uncertainty of that ride, there is a nobility. A quiet moment shared between the warriors who have no choice but to be on the way to somewhere they shouldn't be going. I'm not kidding, it's that powerful.<br><br>Oh yeah, movie review... (This movie made me get lost in thought again dammit!) Wonderful job done by all-Acting, Production, Cinematography, Direction. Sound. Everything is Outstanding. I will be owning this movie soon, and I WILL be owning it on DVD-it belongs on the bookshelf next to my copies of 'Another State of Mind', 'Decline of Western Civilization pt 1' and appropriately enough, 'The Outsiders'. <br><br>In the meantime I'll be raising a glass to fallen punks and fellow outcasts while I play my favorite Subhumans record-This one's for you Brian, I hope punk valhalla is treating you well my Brother.","user":"randallaviks","rank":[43,65]},{"title":"A great story that needed to be told better.","rating":8,"date":"13 February 2018","review":"Let me start by praising the outstanding cinematography in this film. The acting, especially by the leads, were all on point, particularly the punks. <br><br>Novice director, writer and editor Jameson Brooks (this was his first major film aside a handful of short films) did an impressive job for a novice director, but his writing was way too lose, and his editing was terrible. <br><br>Although only 95min length, it felt much longer with certain dragged out and slow-mo scenes that took away from the impact of those scenes. The pace needed to be faster, edited (cut) unnecessary prolonged scenes, and rid of some of the slow-mo shots that dragged the film. For the large amount of producers involved with this film, someone should have spoke up to re-write the screenplay to make it tighter. <br><br>Additionally, leaving out the fact the jock didn't get away without jail time (albeit for parole violations), detracts from the satisfaction (for karma) of some form of justice. This should have been displayed in the closing credits along with all the other factual notes: In June 2001 Camp was apprehended for underage drinking and was arrested for being a minor in the possession of alcohol. Michael Camp, father of Dustin, attempted to cover for his son's probation violations. Michael Camp was formally charged with making false statements to the police. He was sentenced to 60 days deferred adjudication (a type of probation) and a $100 fine after a plea bargain. In September 2001, Dustin Camp received an eight-year prison sentence for violating his probation. <br><br>Nevertheless, an enjoyable film worth seeing. It's no big Hollywood blockbuster, but yet pulled off quite well with B-grade actors and a novice director/writer. A well deserved 8/10 from me.","user":"TheTopDawgCritic","rank":[20,31]}]