[{"title":"Confuzzling plot and action. Not scary.","rating":3,"date":"4 February 2017","review":"It starts out promising, with a bunch of graphic images of maggots and other insects during the opening credits, but in the actual movie, most of the actual action happens OFF screen, and there is a real LACK of interesting imagery to hold our attention. Our protagonists' backstories are shallow, the so-called 'secret' is stupid, and nothing really comes to light during their confinement in the tent except when the third-party gives some exposition about the monsters.<br><br>Spoilers: the monsters are druids. They don't do anything particularly violent, at least not ON CAMERA, and the female lead just kind of kills the other actors off. Even the birth scene (yes there is one) is ridiculously short and happens entirely off camera. <br><br>Utterly not-scary, nonsensical and invokes little else except apathy.","user":"cjs6547","rank":[12,13]},{"title":"Not Impressed","rating":3,"date":"28 February 2017","review":"A boring creature feature film with an equally boring ending. The film tries to do too much with a simple concept, it seems really over-produced to me. Most scenes are not scary at all, and the creatures I thought, looked pretty silly. I'd compare this to an old school SCI FI channel film that you'd watch in the middle of a weekday. Really not worth watching in my opinion. About 30 minutes in I was ready to call it quits and rate it in IMDb, but decided I should give it a try if I'm going to write a review about it- maybe it has an amazing, redeeming ending- nope, it didn't. At the end I was even a little confused about the intentions of the bad guys. Were they really religious or something? Are they feminists? What exactly was their motivation to stalk these woods?? There was the guy's name who made the film all over the place too which seems annoying and like he is deliberately trying to shove his name down your face: Patrick Rea: Arbor Demon! Arbor Demon BY Patrick Rea! A Patrick Rea Film: Arbor Demon! I mean, I don't know who this guy even is and he pastes his name everywhere possible. The only good thing about this movie is that I know who made it so I can avoid his crap in the future!","user":"banglainey","rank":[10,13]},{"title":"Enclosure: I see what they were going for, they just didn't do it very well","rating":4,"date":"20 December 2017","review":"I don't know what it is about the cover poster but because of it I was actually quite looking forward to this. <br><br>Enclosure otherwise known as The Arbor Demon is yet another forest set horror movie which actually has an interesting plot, but is ruined by poor pacing and weak delivery.<br><br>Starring the real spawn of Chucky (Fiona Dourif) and erm the spawn of the Gingerdead Man? (Jake Busey) it tells the story of a couple who go camping in the woods but witness the local rednecks come under attack from a mysterious creature and they may be next!<br><br>It's all pretty cliched stuff that though it all comes together at the end, by that point it's all so very late.<br><br>Nice ideas but ultimately the Arbor Demon is more than slightly on the boring side.<br><br>The Good: <br><br>Great cover<br><br>Decent finale<br><br>The Bad:<br><br>Very dull<br><br>Pacing issues<br><br>Poorly made<br><br>Things I Learnt From This Movie:<br><br>Ms Dourif does not have an ounce of the talent of her father","user":"Platypuschow","rank":[3,3]}]