[{"title":"Idiot plot","rating":4,"date":"4 June 2017","review":"This is a good example of what Roger Ebert called an \"Idiot Plot: Any plot containing problems that would be solved instantly if all of the characters were not idiots.\" Guy's girlfriend pulls out a gun one night and acts like she's going to shoot herself and wants him to also. He gets black out drunk and wakes up and she's dead, shot in the head. He's hazy on what exactly happened, but quite obviously to the viewer and any non-idiot character, she did, in fact, shoot herself. Instead of calling the police like a non-idiot, for no apparent reason he decides to try to cover it up, keep her rotting corpse around to play dress up with, and kill all of his friends who come over to check on him.","user":"qwerty79789","rank":[8,12]},{"title":"Trying Too Hard","rating":1,"date":"14 December 2016","review":"There's not really much more to the story besides that synopsis, honestly. Quinn (played by Noah Segan) wakes up with a gun in his hand, a dead girlfriend, and only vague memories of the night before. He's trying to piece together what happened while he slowly (actually, pretty quickly) slips into madness and takes some other innocent people with him.<br><br>If I can jump right to the point, this movie tried WAY too hard to be edgy and disturbed. From one of the very first scenes with his girlfriend, Thana (played by Olivia Grace Applegate), riding on top of him while pleading with him to pull the trigger on the gun shoved in his mouth it just didn't shock me like it seemed it was trying to. It felt very forced, actually.<br><br>The frequent flashbacks are the only time we actually see Applegate's acting — for basically the rest of the movie she's a corpse — and they prove that she has clearly always had some issues, and she's always been fascinated by the morbid and unusual. Quinn is some kind of desperate artist, too, considering at one point he goes down to the basement to start up a new collage/painting rather than deal with her body.<br><br>The movie takes place in the few days leading up to Christmas, so they really went crazy with adding Christmas songs in, including a man who offers to sing Christmas carols for $1 and Quinn gives him $10, so we get to have that \"quirky\" aspect tossed in to the mix. Lucky us. It just felt like they were trying to drive home the eccentricity of the whole thing, the juxtaposition of such a dark and disturbing scenario right around such a happy time of year, but the songs just annoyed the crap out of me. Like, maybe have one in the mix — or just keep the Christmas caroler — but having a Christmas song playing every other scene is a bit much.<br><br>Ultimately though, ya know what the kicker was? Noah Segan is honestly just a terrible actor. I didn't feel a damn thing watching him (except boredom). It was painful at times. His extended interaction with the landlord (played by Don Most) was cringe- worthy. I had first seen Segan in Starry Eyes, where he was much less of a central character, but seeing him attempt to carry an entire movie was NOT a fun time. He just doesn't seem to know how to emote. Every bit of his speech is just monotone, and seemingly not in an intentional way. Just yikes. No. I would have much rather seen either Applegate or Richardson (who plays Quinn's co-worker) play the lead role.<br><br>I think it was an interesting attempt at some psychological horror, and story lines like this can occasionally be pulled off well since they are really tapping into some deep human emotions (fear, regret, desperation), but this was a huge flop for me.","user":"thelastblogontheleft","rank":[13,23]},{"title":"Follow-don't","rating":1,"date":"9 July 2017","review":"I have not watched a film which starts as promisingly then unravels as quickly as this film. The major problem is after the start it has no idea where or what it wants to be, horror, thriller, black comedy but then tries way to hard to be a sort of Twin Peaks quirky film, the boy singing Christmas carols is very contrived but it totally lacks the humour or empathy. The basis of the film is a man wakes up with his disturbed girlfriend who has blown her head off with the gun she gave him for a Xmas present. She had discovered a letter which indicated he was moving away, oddly he decides not to call the police but to dress her up and move her around the house, this is nonsense as rigor mortis and bloating would soon set in, the boyfriend descends into madness and takes a few with him. another issue is the total lack of empathy with lead character, his acting is pretty mediocre, the aim of every film should be entertaining this fails completely.","user":"Saiph90","rank":[7,11]}]