[{"title":"Terrific ensemble cast, with career performance by Annette Bening","rating":9,"date":"21 January 2017","review":"\"20th Century Women\" (2016 release; 118 min.) brings the story of Dorothea, a divorced woman in her mid-50s, and her 15 yr. old son Jamie. As the movie opens, we are reminded it is \"Santa Barbara, 1979\", and Dorothea's car is engulfed in flames while she and Jamie were grocery shopping. When they finally get home, we also get to know Abbie, a 24 yr. old orange-haired photographer, and William, a Mr. fix-it-all, who both are renting rooms at Dorothea's house. Then there is Julie, the 17 yr. old who hangs out at the house for no apparent reason. When Dorothea feels she cannot handle the unruly(?) Jamie by herself, she enlists the help of Abbie and Julie. At this point we're 15 min. into the movie, but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is the long-awaited new movie from writer-director Mike Mills, who last surprised us with the outstanding \"Beginners\" (now already 6+ years ago). Here he brings a character study of a group of 5 people in the late 70s. This movie immediately connected with me, as I saw pieces of myself in \"young\" people: Abbie (Born 1955), Julie (born 1962) and Jamie (born 1964). I was born in 1960. The movie features an all-star ensemble cast, with an almost unrecognizable Great Gerwig as Abbie (and on the heels of another outstanding role in the recent \"Jackie\"), Elle Fanning in perhaps her best role to date as Julie, Billy Crudup as William, and newcomer Lucas Jade Zumann as Jamie. Surely we have not seen the last of him. But the biggest applause must go to Annette Bening, who brings perhaps the finest performance of her career as the well-intended but at times confused, sad and/or lonely Dorothea. Mills brings us these characters in rich detail and nuance, much to the viewing public's delight. Ever wonder what a \"cool cigarette walk\" is like? You'll find out in the movie. Music plays a ventral role in the movie. There is a fine original score (mostly electronic) by Roger Neill, but even better are the song placements (Talking Head, Black Flag, David Bowie, the Clash, and many others).<br><br>\"20th Century Women\" premiered to great acclaim at the New York Film Festival last Fall. The movie opened wide this weekend and I couldn't wait to see it. The Friday evening screening where I saw this at was attended nicely although by no means close to a sell-out. Doesn't matter. This is one of the finer movies of the year, for me anyway. If you like a richly-developed character study with an all-star ensemble cast, you cannot go wrong with this, be it in the theater, on VOD or eventually on DVD/Blu-ray. \"20th Century Women\" is HIGHLY RECOMMENDED!","user":"paul-allaer","rank":[56,74]},{"title":"Life in fast motion","rating":8,"date":"14 January 2017","review":"20th Century Women isn't about giving us some epic look at a group of friends or a family, but it is about the passage of time with people who are warm and caring and in a genuine way. Mike Mills isn't a saccharine filmmaker, but he also doesn't shy away from sentiment - I always have to point out this is separate from sentimentality - and the feeling that I came away with from the comedy 20th Century Women is this warmth from all of the characters, and this feeling that I know these people, whether I did or didn't (and I actually did in the sense that, at times, the mother and son were me and my mom for a short period of my teenage years, so there's an authenticity just there to me).<br><br>There's so much empathy for everyone here that it adds to the authenticity of the emotions, even for Greta Gerwig's Abbie who is, in essence, another 'Greta Gerwig' character like I've seen, or think I've seen, in other movies (her quirky wisdom seems akin to last year's Mistress America at least). While she is my least favorite person in this movie, she's given a history and many moments, surrounding one of those terrible things that happens to people and there's not much to be done about it, or could've, it's out of the hands of anything *to* be done. There's so much work done on the characters here by Mills, getting us to like them despite all of their flaws or those moments where they don't act with logic or sense, that it doesn't matter that there isn't too much of a story. This is the story of these characters in a short span of time while also, as if looking on from some other, ethereal plane, about what this time meant in the context of what came before 1979, and what was to come.<br><br>Among the actors here, Lucas Jade Zumann is the breakout star as the 15 year old Jamie, but I was so taken with Benning and Fanning as the 50-ish, \"she was in the depression\" as she's described mother and the 2 years older than Jamie but that matters so much pleutonic friend respectively. I wonder if the film would've worked with any other actors in the roles, but really I can't imagine anyone else. Every time Bening's on screen she gives Dorothea this feeling of 'well... I guess this is happening now, what do I do about it, I'm not sure', and while she can get angry or concerned she's never one to go too over the top - this is the anti-Fences in that regard of being about a kid scarred by a parent - she does care about what happens to her son, with the \"inciting incident\" in screen writing terms being him almost dying from doing one of those dumb-s*** things teenagers do on a dare. It's a unique and subtle performance, filled with a sense of... questioning, uncertainty, which is harder to pull off than it looks.<br><br>Fanning, meanwhile, is also having to underplay, which is good to see. This is an impressive year for her between this, Live by Night (which she was the best part of) and the Neon Demon, and she's different in all of them. I want to say I like the work she does here the most even as (or because) it's the least likable one among the bunch (and keep in mind she's a born-again Christian in the South in LbN). Mills's writing provides Fanning a great deal to make Julie come alive, but I found her not saying things, the way she shows Jamie how to hold a cigarette, when she is saying little, and then when she is backed into doing something that she should want to do but doesn't go for - going past being 'just friends' with Jamie in the last third - how she responds is devastating. It's like, 'no, don't act this way', as opposed to simply looking at her as a \"B\"-word, which is how a hackier writer could've gone with it.<br><br>Oh, and I must reiterate this is a comedy, and it's funny as hell. There's certainly some dramatic stretches, but Mills mines a lot of humor out of generational splits - Bening's face as she hears early Black Flag, and then trying to \"move\" to it with Billy Crudup, is one of the funniest things this year - and it's a tricky balance that Mills finds between making the feminism (yes, actual literature and quotes spoken in voice-over from essays) serious AND humorous. We don't doubt that the feminism of the characters is pure, but there's also that question that's posed: how much is really appropriate, or can be legitimately understood, by 15 year old who barely knows who he is in this world? <br><br>And on top of this Mills is having fun and some daring as a filmmaker, using psychedelic colors to show cars driving at times, and going not for the slow-motion but fast-motion speed, but not for comedy - the aesthetic point matches up with what the movie's about: life moves too fast, and we have to try and keep up with it best as we can and grow with things and become better people as everything moves too quickly. If it's ultimately too episodic to be anything really great or up to be there with the very best this year, I'd still tell anyone who likes smart character independent(ish) movies centered on teenagers and adults to see it immediately; it has a good place alongside The Squid and the Whale and, to a less taboo extent, Diary of a Teenage Girl.","user":"Quinoa1984","rank":[54,73]},{"title":"A Multi-Generational Cultural Exchange","rating":8,"date":"15 January 2017","review":"The scene feels remarkably familiar – Dorothea (Bening), the matron and saint of a Santa Barbara household circa 1979 leans in on her son Jamie (Zumann) listening to \"Fairytale in the Supermarket\" by The Raincoats. \"They know they sound terrible right?\" she says. Abbie (Gerwig), Dorothea's avant-garde lodger interjects; \"yeah, but it's like they don't care. They got all this feeling but don't have the tools they need to express itit all comes out as passion.\" Dorothea fixates on Abbie's intonation, like listening to language she's only now grasping. She gets it...but then she doesn't.<br><br>Much like Abbie's defense of The Raincoats, Dorothea believes she has all the passion to be a proper mother, but she lacks the right tools to support a son who is growing older with each passing moment. She decides to enlist the help of two young women; Julie, Jamie's best friend and crush and Abbie a free spirit who was recently treated for cervical cancer. The only other man in the picture is William (Crudup) a well-meaning former hippie with a gift for mechanics and a passion for pottery. Between them all, the stalwart Dorothea hopes to quietly guide her son through his formative years which pit her depression era approach, to Jamie's recession era resentments. \"Don't you need a man to raise another man?\" asks Julie. \"No I don't think you do.\" 20th Century Women starts with competing voice-overs and uses a collage approach to convey the surfaces of each character's inner life. The collages are stuffed to the brim with stills of 1930's gloom and 1960's turbulence all set to audio of proto-punk, Jimmy Carter's Malaise Speech and \"As Life Goes By\" from Casablanca (1942). It's an awkward mix; one that creates an echo chamber of sorts.<br><br>That subtle discordance of people talking at and not to each other, runs through the first half of the film. Jamie's coming-of-age story, a volatile mix of stubborn familial resentment and unrequited love clobbers together with Dorothea's own midlife crisis. \"I had Jamie when I was 40.\" Dorothea says; a fact that can help explain Dorothea's free-range parenting approach, but also helps explain why Jamie's sharp insights cut so deep. For a while there it always seems like its Jamie versus Dorothea, pulled apart by an ever widening generational gap.<br><br>Then, like responding to the blessing of a wartime parlay, the factions in this film begin to center and calm. It is during this truce that the film begins to really take off, presenting its characters with vibrancy and humanity while flying through a more nuanced story arc. Almost independently both Jamie and Dorothea learn their goals are one in the same and the differences they have are little compared to their mutual respect for time which presents itself in rainbow tinged tracking shots and subtle fast-forwards.<br><br>And at the center of 20th Century Women lies the affable Annette Bening who suitably captures the zeitgeist of a generation no longer with us. While most might pigeonhole Dorothea as a madcap eccentric or worse a passive pushover, Bening wisely lets the character's inner strength shine through. Dorothea is unabashedly a one of a kind lady. She invites strangers to dinner, invites herself to punk clubs, leaves early, and then comes back days later alone. She verves uncomfortably with post-sexual revolution mores yet she quietly takes frank conversations about menstruation in stride. She does all this because she knows that with every encounter, every meeting, every stranger there's a chance for exchange.<br><br>Of course 20th Century Women is not without its problems. While Bening, Gerwig and Fanning all do wonders in their roles, Zumann fails to endear the young Jamie to the audience in any meaningful way. Part of it is due to the part as it is written. The film is loosely based on the life of director Mike Mills thus Jamie at times feels more like an avatar than a real teenager. Additionally it's ironic that despite constant paraphrasing of feminist literature, 20th Century Women would struggle to pass the Bechdel Test. Our three women characters orbit Jamie's life and analyze his actions and motives like he's the center of their universe.<br><br>Yet, while the film uses the wider Women's Liberation movement as window dressing, allowing the external conflicts of the film to melt away to reveal honest internal pain was a stroke of genius. Genius enough to maybe be interpreted as a meta-text on standard storytelling practices being a form of patriarchal oppression. That however is a discussion for another day. 20th Century Women is an artfully rendered film with plenty to say about the passage of time, the commonality between the generation gaps and the unifying love of mother and son.","user":"bkrauser-81-311064","rank":[42,58]}]