[{"title":"The idea is cool but the attempt falls just short.","rating":6,"date":"8 December 2016","review":"Our two characters, Anna and Beth, are both actresses. Bashful Beth is a rising success, while bold Anna's career is struggling to take off. The two decide to take a weekend away to rekindle a neglected friendship. However the trip seems burden by an overbearing sense of tension, that slowly builds between the two over their stay, leading to an unexpected yet unavoidable confrontation.<br><br>The film is intriguing enough to hold interest until the end, mainly because of the two main characters and the actresses portraying them. The film is at it's best when centered on the two and their interactions. When the plot takes over with it's evasiveness and phantasmagoria, it seems to use the excuse of self awareness as an answer to your questions. An interesting watch nonetheless with a commentary that touches on sexism and type casting.","user":"sonnybillhammond","rank":[21,26]},{"title":"Very well-done","rating":30,"date":"30 December 2016","review":"I didn't really expect much from this but the poster certainly intrigued me. It reminded me a lot of the classic two-female psychodramas, most recently of Queen of Earth, and yet it also managed to bring something new to the table. It feels like a B-flick at its core but the filmmaking is very impressive and very intentional. The film also has a lot of interesting themes on its mind regarding the role of women in the film business and in society as well, and it will surely hit close to home for many. The two lead actresses are really good in their roles, particularly Mackenzie Davis who has the meatier role and who is able to knock it out of the park. I highly recommend this.","user":"Red_Identity","rank":[15,23]},{"title":"Bergman's little brother...","rating":5,"date":"19 December 2018","review":"This is an extremely simplistic version of Ingmar Bergman's \"Persona\". Actresses, identity questions and melting-downs, envy, craziness, but oh! so much less interesting and fun! There is an element of suspence from the start and the two protagonists are good. Good rythm, the photography is not bad. But it still falls short in every department. Overall not a loss of time, but you could as well invest it better for sure.","user":"danthepoetman","rank":[3,3]}]