[{"title":"Groovy!","rating":10,"date":"27 January 2015","review":"A groovy documentary on a groovy movie. Almost the whole cast and crew are interviewed here except for Sam Raimi, who was working on Oz: The Great And Powerful.<br><br>The doc starts off with Bruce and co explaining how it took forever to get the first Evil Dead released. Then they made their second film, Crimewave which went through a nightmarish production.<br><br>Basically, the real reason why Evil Dead 2 was made, was to escape the nightmare of Crimewave, a film which went over budget, 2 cast members were addicted to cocaine, the lead part was written for Bruce but Columbia wanted a bigger name (Bruce wasn't known at the time) and how Columbia recut the film behind Raimi's back. <br><br>So Sam wanted to go back to working with his friends instead of working with the big studio boys. <br><br>Josh Becker, the 2nd unit director of Evil Dead 1 said that he wrote a draft of Evil Dead 2 that was very different to what it is now.<br><br>The reason why the beginning of the movie acts like a remake was because the filmmakers couldn't use the footage of the first film, due to it being a different company. It's like Disney asking Dreamworks if they could borrow footage.<br><br>Dino DeLaurentis wanted to make this film because he loved the first film.<br><br>Then we move on to the casting. Ted Raimi explains the nightmare of being in the Henrietta suit. \"It didn't matter cos I was 20,\" he says. Bruce brought his daughter on the set and Ted scared the life out of her. <br><br>Dan Hicks, who played Jake tells the story of how he almost drowned when he had to hang upside down and water was sprayed out of the cellar.<br><br>Richard who played Ed talks about how to play a Kandarian demon and how he pulled the ugliest face to do so.<br><br>Next is the best part of the doc, the special make up effects. We see how Richard had to keep his mouth open for his make up and drool was coming out of him.<br><br>They also explained what it was like being in North Carolina and they went into a laundromat that was full of black people. They told the effects boys that the \"White laundromat\" was nearby. <br><br>\"This was '86,\" said Howard Berger. Then they talked about the scorching heat they had to deal with. \"We had put out covers in cold water.\"<br><br>They also compared themselves to the Jackass gang what with all the pranks they pulled on each other.<br><br>Then there's segments on the visual effects, the stop motion animation, Sam Raimi (he know he to do some of the shots because he came from a magician background) and finally we get the post production. <br><br>The editor said that she cut her finger on the teeth of the editing machine. Sam Raimi walked in and looked shocked. The editor though she was going to lose her job, but then Sam said to her \"I'm sorry, the sight of blood bothers me.\"<br><br>Then the doc with the legacy this movie had caused and how the cast and crew were proud of it.<br><br>Overall, a must see for Evil Dead 2 fans.<br><br>Now that we had documentaries on the first two movies, we need one on Army Of Darkness. Make it happen, folks!<br><br>By the way, I got a comment on Youtube from Michael Granberry who did the stop motion animation in this documentary. Thanks, mate!","user":"bazmitch23","rank":[8,9]}]