[{"title":"Not Tonight. I have a Shadow Man Headache.","rating":4,"date":"1 July 2017","review":"This review is for the 2017 film and not the 2006 Seagal film that Amazon has linked in the reviews.<br><br>\"The Shadow Man\" and \"The Man in the Shadows\" are the same feature. It is another film about \"shadow people\" more specifically the faceless man in the hat. The movie centers on Rachel (Sarah Jurgens) who suffers from serotonin imbalance, a cheating lawyer husband (Nick Baillie), shadow man, and a bad script. She attends meetings and meets William (Adam Tomlinson) a shadow man enthusiast, string theorist, and amateur hypnotist. He attempts to turn the horror film into science fiction, but Rachel isn't buying.<br><br>The film goes to a cabin in the woods which was almost pointless. In fact the film was down right boring except for the last 15 minutes which wasn't that great for closure. The piano music sound track was depressing and the record playing seemed pointless.<br><br>Guide: F-word, sex. No nudity.","user":"mikeledo","rank":[5,7]},{"title":"A Movie So Bad One Should NOT Waste Their Time or Money Watching It!","rating":1,"date":"2 January 2019","review":"I ordered Shadow Man, a 2006 Steven Segal film and was sent this one by the seller who had confused its title with the Segal film's title (without checking and verifying the UPC). Was refunded by seller and they didn't want it back (so I didn't send it). Since then I got what I wanted, the Segal film. That ended OK.<br><br>The Movie:\nSince it wasn't being returned I looked up the film, which doesn't have much about it on the Internet. Found out it's a Canadian production with little-known actors and an even lesser known director. Decided to plop the DVD into the disc player as it's an alleged horror film about the \"shadow man\", aka \"hat man\", which is sometimes portrayed in tales as the \"slender man\". They're all variations on the same theme of a silhouette spirit that induces stark terror in those that see its apparition. Sometimes they must \"obey\" it and at other times it merely needs to appear. There are BAD movies that are bad in such an amusing way they're classed as \"campy\" and gather a cult following, such as \"Plan 9 From Outer Space\", or one of the Larry Blamire films that deliberately to parodies 1950's sci-fi horror (e.g. Lost Skeleton of Cadavra). A number of Japanese 1960's films such as \"The X From Outer Space\", and \"Goke, Body Snatcher from Hell\" also fall into that characterization.<br><br>Then there are revoltingly BAD movies like this one that evoke visceral revulsion while watching it. Where do I begin? There's nothing praiseworthy about this film beyond the leading actress eking out a workman like performance in spite of the script, director, and leading actor, a tribute to her ability. The leading actor is wooden with the inflections and emotions in his performance out of sync and inappropriate for their point in the plot and movie. This is not an action horror movie. It's a psychological one Portrayed emotions with line delivery, facial expressions and body language, and their timing, are crucial to building the tension and terror.<br><br>The cinematography is passable as is the lighting in most scenes. It's the director's primary filmmaking background. The post-production cutting room editing ruins it. Timing is clearly off with the cuts in the leading actors' 2-shot dialogs (where the camera switches between the two people having the conversation). It exacerbates the principal actor's inappropriate dialog delivery inflections, facial expressions and emotions. That's as much the director's fault as it is the actor's for failing to direct the actor properly and retake the scene's shots. It's as if the leading actor showed up, punched in on the clock, recited his lines with no investment in the plot, punched out, went home and collected the paycheck in the mail. Scenes with 2-shot dialogs are not done all at the same time. With two actors it's done with two camera setups, the first for one actor and the second for the other actor, usually with the actor not on camera doing their lines to aid timing and response for the one on camera. Then it's flipped around and done again to film the other actor on-camera. Looping to put in the dialog better can be done afterward if needed. The film is cut and edited together to create the 2-shot conversation scene flipping between them. The failing in directing, emotional responses between the actors and film editing completely destroy the flow of the story.<br><br>If that weren't bad enough, portions of the script with its dialog are irrelevant to the basic plot. They do nothing to build mood, tension and ultimately terror and horror. Instead these distractions deflate it with unnecessary diversions. The movie is 88 minutes run length. It's about the minimum for a current full length feature film, albeit within the industry, the technical definition is a minimum of 60 minutes (a vestigial definition from a century ago). The plot and script should have been completely reworked to excise these diversionary distractions and replace them with meaningful elements that create character and story depth related to the plot.<br><br>The result of all these failings is an utterly failed film. The audience has no vested interest in the principal characters, the story, or the conflict imposing the challenges they must overcome in its traditional three-act narrative structure (i.e. the \"hat man\" apparition terrorizing the principal actress). It has no ability to engage the emotions of the viewers. We don't care about the principals or their plight. I predict it's destined for eventual use as 3 A.M. filler on the Lifetime Cable Channel. Maybe their royalties will eventually pay off its production cost within this century. Don't waste your money or 88 minutes of your time on this movie.","user":"j-a-lind","rank":[0,1]}]