[{"title":"Solid Indie Political Thriller From a Rookie Director","rating":8,"date":"24 August 2018","review":"I love finding a well-made underground indie film like this. I saw this movie and was impressed by the quality of such an inconspicuous picture by an unknown director with an unheard-of cast. I did a bit of research into the people who made it, among other things, I found out the original title was \"Redfish Bluefish\". On their YouTube channel there is a video posted in 2015 (3 years before it was released) that tells a bit about the creation of this film that should be inspiring to any upstart filmmakers out there who wonder what is possible to accomplish with not much else but talent and perseverance.<br><br>This is not a perfect movie, but it's a damn good one considering it's a micro-budget, independently produced film by a first-time writer/director/producer. The cinematography and editing are especially impressive, giving it a polished look. It's cast strictly with lesser and un-known talents who are all very good in their roles. <br><br>The top-billed leads include Kaiwi Lyman, who's biggest credits include some smaller roles in well known titles and a few leads in other straight-to-video movies, plays Timothy Daniels, a rogue American spy, the main protagonist in this picture. Jeff Hatch, an obscure actor who has only a handful of credits on IMDb, is the title character Arthur Blackmark- our principle antagonist. Corey MacIntosh, another unknown, plays a noble Russian military commander, Alexi Popolovski. These three turn in solid performances, anchoring a roster of veteran D-list actors as well as some other surprisingly polished rookie talent. John Henry Richardson, Lana Gautier, Jon Briddell, Tim Oman, David Light, Brian Ide and Elliot all turn in solid performances in this uniformily good cast. <br><br>Perhaps the most noteworthy discovery of talent from this film however, is the writer/director, AJ Martinson III, who pulled this project together with a motley cast and crew and no doubt a shoestring budget with lots of called-in favors.<br><br>The overall quality of the acting, script, direction, cinematography and editing make this obscure feature feel like a worthy addition to the high tension political/spy genre right beside big Hollywood Cold War movies like Bridge of Spies, Hunt For the Red October or classics such as Failsafe and 7 Days in May.<br><br>The story takes place in 1963 during the highest tensions of the Cold War. It involves a shadowy, Illuminati-like organization working behind the backs of the Whitehouse and Kremlin to initiate a nuclear showdown for reasons that do not become clear until late in the story. Twists, double-crosses, treachery and a unique conspiracy theory unfold in this overachieving little movie.<br><br>The knocks from negative IMDb user reviews have mainly been the complexity of the plot and overly dramatic feel of the acting. The plot is a bit hard to follow, but if you stay with it, it pays off. A second viewing with the subtitles turned on satisfied some questions that left me scratching my head. The movie does not quite \"stick the landing\" at the story's climax though, in explaining the reasons it comes to the conclusions it does, but it executes a high degree of difficulty getting there, so it only loses one point on that count. As for the acting, I felt the quick, snappy dialogue and rushed pace was a nod to the straightforward way acting was typically done in classic noir thrillers of the black and white era, but it does get a little heavy-handed at times and there are a couple of over-cooked speeches, costing them one more star for final rating of 8/10.<br><br>Overall, the quality of this film, especially considering it's a first time effort with a tiny budget, is incredibly impressive. I hope this movie will find the audience it deserves and I'm quite interested to see what Martinson does next.","user":"desertshark-45652","rank":[5,7]},{"title":"Not A Masterpiece, But Well Made And Entertaining","rating":10,"date":"14 August 2018","review":"Don't believe the harsh reviews from people writing reviews in their mother's basements. This is a good, solid, well-crafted movie that's entertaining. To me, a movie is good and entertaining when I'm not wondering how much longer before it's over. Blackmark is like walking out of a fog - it starts a bit slow and is a little confusing, but as it goes along it builds momentum so by the end you're right there and caught up in the drama. And, like coming out of a fog, you see things clearer and clearer as the movie progresses. What makes that interesting is you want to watch it again - and it actually plays better the second time because you now understand and have context for the whole story. Most importantly, it's just as entertaining the second time around.","user":"platinmman","rank":[8,13]},{"title":"Conspiracy - yeah!","rating":7,"date":"23 August 2018","review":"What's not to like about a movie about JFK? Everyone knows, just like the Manhattan Towers, that the truth has not been told; and when the truth is hidden fantasy abounds. Now fantasy is usually more fun than the truth, and whatever the truth about the JFK assassination this fantasy is interesting, intelligently constructed, even if at times a tad confusing, but certainly action packed. The characters are sketchy, but it is a short movie, and designed to be leave much to the imagination - filling out the characters would, imho, take from the \"whaaat?\" factor. The second viewing opened up new possibilities, and the third led to \"Ah ha!\" moments. Overall a good watch to fill an evening with other conspiracy theorists.","user":"chriszedillo","rank":[4,6]}]