[{"title":"Laika's Masterpiece","rating":10,"date":"19 August 2016","review":"\"Kubo and the Two Strings\" is a hard movie to explain. There is a story in it and the adventure is grand and fun, but I can't place it into a category of traditional storytelling. The themes of the film are the values of memories and how we truly can never forget people that we lose throughout our lifetime. Very mature themes that are handled with such finesse and creativity that I can't say I have seen anything like it before. Even when you as the audience know where the story is headed, the film surprises you with the delivery and you actually grow and learn with the characters. <br><br>The strength of the film is the pure visceral experience it provides. The visuals and sound had a layer of depth and drama that you feel in your inner core. It is more of an experience than it is a movie that you watch. Throughout the film, I felt moments of sadness, loss, happiness, horror, fear, and accomplishment. It is a movie that truly raises the bar for animation and it saddens me that many people will not check it out as it is very different from traditional animated films that we are used to seeing from other major animation studios. <br><br>So much care and attention went into this film. The world Laika has created is rich with so much history, story, mythos, and culture that even some movies and series that are much longer can't fully create. I felt that the world is living and that magic is truly alive. I love how the character make it feel special that magic exists, but aren't put of by it, when they see it for themselves and have to question the logic.<br><br>The characters are fun and lovable, but also brave and dimensional. Not one character felt out of place and they're inclusion felt important. The voice casting is top-notch and I felt like the celebrities actually made an effort. Unlike many big-budget animated productions, The voice actors weren't distracting and added their own layer of charisma that enhanced and drew attention to the characters. Monkey is probably the best character and I feel like she'll be the fan favorite as she's funny, powerful, and a total bada**.<br><br>Overall, Laika has produced probably their best animated film to date and that is saying a lot from a studio that produces quality efforts time and time again. \"Kubo and the Two Strings\" is unlike anything out there and deserves to be seen on the big screen. The animation alone is breathtakingly gorgeous. The beautiful score and music only adds to the complexity of the film. It is probably the best film of 2016 so far and I find it hard to beat. I highly recommend that people check out this highly creative experience.","user":"TheConnoisseurReviews","rank":[163,217]},{"title":"killer combo; studio LAIKA + Charlize Theron","rating":9,"date":"23 January 2017","review":"Reviewers Notes; <br><br>1. As I write this, the top-rated IMDb review starts with the header \"a hard movie to explain...\" and that pretty much nails it. The film starts very slow, builds gradually, has the viewer hooked like a fish by the mid-point, and then falls a tiny bit short in the climax. But overall the experience is unforgettable, magical, and great fun.<br><br>2. In Japan anime, they revere not only their movies but their studios. It was always considered that the NA studios, even Pixar, don't measure up. But Studio Laiko in this amazing film has done things with stop-motion and color which make it a world standard and as good as or better than the best that Japan has to offer. I am even going to use some frames a screen saver, they are THAT good.<br><br>3. Lots of great voice acting but Charlize Theron steals, literally steals, the film and takes it to a new level. Makes you forget all about the goldfish that initially started the trend in \"star\" voices. Truly an incredible performance.","user":"A_Different_Drummer","rank":[50,64]},{"title":"A movie of epic proportions. Lovers of film, animation, storytelling, do not miss out on this one!!!","rating":10,"date":"19 August 2016","review":"Kubo and the Two Strings might be one of the best movies I've seen all year. In a crowded year of comic book movies, sequels, and remakes, that's probably not saying much. I wanted to be fair though and look at those movies with an open mind and a little background on their franchises for what each movie wanted to accomplish. However I've been waiting for so long to see something fresh, original, and holy cow this was it. Kubo is a stop motion animated film by Laika studios who've produced Coraline, Paranorman, and the Box Trolls. I really enjoyed Coraline and didn't really like Paranorman or the Box Trolls so I had no idea what to expect from this movie. My friend and I went opening night because the trailers looked interesting, and we were into the entire run time. It's so beautifully shot, the story is simple yet engaging, and the action is just amazing to behold. I don't want to give away anything about the story because I went into this movie blind not knowing that much and I think people should try to do the same. It's surprisingly also very funny! My friend and I just looked at each other shocked at how much this movie made us laugh. The characters are great and the voice work is very impressive. Everything about this movie is just so impressive. For little kids maybe it's not something to hold their interest, but older kids and adults I think should seriously consider checking this out. It's a fun, well written, and very emotional story. Not only should this movie win best animated feature so far, it should be nominated for best picture I'm serious! Lovers of film, animation, storytelling. PLEASEEEE go out and support this movie I heard it will have a low opening weekend and it's such a shame. We need to make this film a hit I want more animated movies of this quality, check it out!","user":"Thekeybaldemasterrises","rank":[122,166]}]