[{"title":"Doesn't Worth Your Time","rating":3,"date":"8 June 2017","review":"It is mostly a gangster movie filled with people with bad temper. There aren't much substances in it. When there was a sudden opportunity to become the most furious gang, everyone tried to prove that they are the toughest and merciless gang of all. <br><br>The story was okay but the acting was quite mediocre. Some of the actors and actresses hardly knew how to do a convincing acting. Some of these actors and actresses had important role in the movie. But because of their poor performance the scenes were not that effective which affected the overall movie experience.<br><br>Not Recommended.","user":"niaz_islam","rank":[18,19]},{"title":"No substance","rating":2,"date":"16 July 2019","review":"If you like seeing angry people being horrible to everyone they come into contact with, then you have a 90 minute treat ahead! Without any meaningful storyline or redeeming features, no charactor arcs or consistancy. This film was massively disappointing. The first movie was is a good film within the genre, With good characters and directing. This film is weak and predictable and Unfortunately they replaced everything good about the first movie with constant over the top posturing and aggression. Avoid","user":"bencarpenterpp","rank":[4,4]},{"title":"don't waste your time/ money watching this","rating":1,"date":"6 October 2017","review":"bonded by blood 1 was excellent, tamer hassan vincent regan, terry stone all physically big, and believable as menacing gangsters<br><br>bonded by blood stars sam strike and martin delaney, these two look like schoolboys and are about as threatening as a poodle<br><br>in this movie every scene involves smoking and saying \" f1king c1nt\" the director seems to think smoking makes you a gangster,<br><br>the storyline was boring, they tried to add a romantic aspect to the movie, this is supposed to be a hard hitting gangster movie, not the notebook <br><br>none of the characters were likable,some had terrible fake cockney accents<br><br>there was far too much swearing , every other sentence had the F word, and way too much shouting <br><br>the only positive was that it didn't star danny dyer, if it did it would have gone straight to DVD<br><br>hopefully this will be the last of the \" essex boys\" movies","user":"AMAZINGzingzing","rank":[5,6]}]