[{"title":"Finally a smart and engaging family movie!","rating":10,"date":"18 September 2019","review":"This movie is a charmer. Funny, smart and endearing-a film that you can play for the whole family. The story is about an engaging 12 year old boy genius named Emmett who must help solve a mystery at his school to help his brother. But more than that it is a joyous window into the life of Emmett. Lots of great themes of friendship and family are included in this wistful and fanciful gem!","user":"sydneybmail","rank":[3,5]},{"title":"Highly creative coming of age movie","rating":9,"date":"24 September 2019","review":"I normally am not too into family movies because most of them are cookie cutter and you pretty much know how they're going to end. Boy Genius surprised me because yeah it had some familiar family movie things but this \"family\" movie had cool fantasy sequences, good acting (especially from the lead), strong directing, and a solid script. I went in with no expectations and was pleasantly surprised.","user":"nardobram@yahoo.com","rank":[2,3]},{"title":"a mess","rating":4,"date":"1 March 2020","review":"Emmett Charles (Miles Brown) is a confident, imaginative 12 year old prodigy attending high school. There is a thieve in the school and police detective Gordon is called in. Suspicion falls upon Emmett's brother Luke.<br><br>Emmett is an annoying brat. He can claim some of it as comedic flourishes but there is too much of it. Everybody keeps complaining that he's too perfect when Mac is closer to the truth. He's a know-it-all but has non of the experience. Quite frankly, I feel sympathetic to Mac and I shouldn't. The movie forces me. Then there is the smorgasbord of differing styles and tones. It's a mangled mess. It wants to be a kiddie movie. It wants to deal with the serious race card. It wants to be a wacky screwball comedy. It's all over the place. The production looks weak. That part is surprising since there are some good actors involved. The mystery is not a tough mystery. I thought the case got solved with the pawn shop surveillance footage. When that happens, the tension of Luke all goes away. This is a mess.","user":"SnoopyStyle","rank":[0,0]}]