[{"title":"A Solid Version of \"Grease\" With Some Technical Issues (Updated)","rating":9,"date":"31 January 2016","review":"Having watched all of the live musical performances on TV since NBC's production of \"Sound of Music Live!\" in 2013, I was anxious to see what Fox could do with \"Grease: Live\". The movie \"Grease\" is a favorite of mine. Like many others, I have watched the film many times.<br><br>All in all, I was pleased with the show. Most of the issues were technical, and there was only one actor (who I will not name) whose performance disappointed me.<br><br>It was the sound that tempers my enthusiasm for this production. In some cases, leading vocals were not quite loud enough. There was a total loss of sound during a portion of the \"Hand Jive\" number. And the big disappointment was the poor sound quality during Julianne Hough's (Sandy) performance of \"Hopelessly Devoted To You\"--what would have been the highlight of the show due to Julianne's soaring vocals. It sounded like a microphone problem, but wouldn't they have two mikes in case one failed?<br><br>The logistics of staging \"Grease: Live\" are mind boggling. I appreciate the way they took the viewer backstage and otherwise revealed the layout and the mechanics of moving cast and crew.<br><br>The cast is extremely talented. There were too many great performances to list them all, but I want to single out Elle McLemore whose Patty Simcox was inspired.<br><br>The storyline mostly followed the movie, but there were numerous deviations. The choices made resulted in a very enjoyable hybrid.<br><br>A DVD would be a nice addition to one's personal collection of musicals, but they will first have to clean up or remake Julianne's solo.<br><br>7/14/16: Received 10 Emmy nominations.<br><br>Updated 10/4/2019: I watched this performance again on pay-per-view. I am pleased to say that Julianne Hough's performance of \"Hopelessly Devoted to You\" has been fixed. I don't know what other edits might have been made. Since there are no commercials (or transitions to commercials), some of the backstage glimpses are lost. But I really enjoyed my second viewing. I noticed some things I had missed the first time through. And Vanessa Hudgens' talent really stands out. Her performance of \"There Are Worse Things I Could Do\" is a highlight.","user":"atlasmb","rank":[29,42]},{"title":"Truly wonderful! Grease is still the word!","rating":10,"date":"31 January 2016","review":"I had just graduated from high school when the movie Grease was released in 1978. I have watched the movie at least 20 times and have seen a Broadway production. This has been my favorite for so long and I am absolutely blown away by what I just watched over the last 3 hours. The talent was amazing. I feel that they paid tribute to the original, but actually made it better with a few minor changes. Vanessa Hudgens was perfect as Rizzo and Julianne Hough was a close second as Sandy. It was great to see Didi Cohn, the original Frenchy. I am giving 10 stars because I was completely amazed by the show, but I do have to mention one negative. It is my opinion that Aaron Tveit, who played Danny Zuko was miscast. His singing voice and his acting were significantly less appealing than the rest of the cast. His dancing was great, though. I also think he looked too old for the part. The sets were amazing. The choreography was sensational. I want to see it again!","user":"redsoxjv13","rank":[27,41]},{"title":"A Great Show with a Few Flaws","rating":7,"date":"1 February 2016","review":"Overall, Grease: Live! was a success in my eyes. I thought Aaron Tveit, Julianne Hough and Vanessa Hudgens were outstanding in their respective roles as Danny, Sandy and Rizzo. They acted well and sang even better, which is all I can ask for in a musical like this. <br><br>The staging was well done and, all in all, I really enjoyed the show. My gripes are few and far between, but there were a few blips on the radar. The sound went out shortly and the sound issues carried over into another song number, but that didn't bother me terribly. <br><br>I really only had an issue with one section of the show. The section with Frenchy in the Frosty Palace. Frenchy, played by Carly Rae Jepsen, was alright. I wasn't blown away by her performance, but I hadn't really noticed it either by this point. Then she sang a song I read was written for her just for this production... and it showed. The song, \"All I Need is an Angel\" completely conflicted with the period of the other songs and of the show. It sounded like a teenager wrote it that morning and they threw it in. A 2016 pop song thrown into a musical set in 1959 and every bit as unfitting as it sounds. The song was so repetitive and dull that Idon't think there was much to it apart from the chorus. <br><br>Then the show is brought to an even more agonizing halt when Boys II Men shows up to sing \"Beauty School Dropout\". Their rendition, again, didn't fit the period the show was written for. You're telling me you couldn't get Johnny Mathis or someone else still living from the era? You couldn't even get someone who could at least sound like it? Boys II Men could have done a better job trying a Platters style rendition at the very least! I suppose you could tell me Boys II Men is a bigger draw than some nostalgic singer from the era, or close to it, but to that I'd ask you, how many viewers tuned in for Boys II Men? Really. How many? I'd like to know. Because I'm guessing nobody. I didn't know who they were. I had no idea. I'm 23. Who was the intended audience? I don't understand it. <br><br>Then we come to my real sore point of the evening, the hypocrisy of the censoring. I couldn't help but notice that, every time they returned from commercial break, the little rating box would appear in the corner of my screen. It claimed the show was \"TV 14\", which, in of itself, is a bit of a surprise, but it begs the question, what does \"TV 14\" really mean? What's appropriate for 14 year olds to watch? Apparently, the show couldn't quite make up its mind... <br><br>The words of \"Greased Lightnin'\" were too vulgar for the show, so they were changed. On the surface of it, I don't mind. I've heard these lyrics changed before. I do take issue with the fact that THEY changed while the rest of the show stayed the same (and in some cases got WORSE)! Several wholesome lines remained like, \"Where ya going'? To flog your log?\", \"Bite the weenie, Rizz.\" and a reference about how cheerleaders hate to be \"late\". There were a slough of others, I just can't think of them at the moment. <br><br>Don't get me wrong. Innuendo is fine. It's funny, particularly in Grease, as it is so well done. <br><br>My problem is the absurd notion that cleaning up \"Greased Lightin'\" suddenly makes the show \"family friendly\". I fail to see the difference between the lines above and \"Chick'll cream\" and \"She's a real pussy wagon\" differ in their vulgarity. If somebody understands it better than I, please let me know. I'd like to understand. <br><br>I suppose you could argue that, when the soundtrack is released, kids will sing a clean version of this song and that's all well and good, but a number of them will have seen the rest of the show... the \"damage\" will have been done. Won't it? Just what do we really want 14 year olds to watch? The show took out all cigarettes, which is wholly unrealistic, but not show destroying. They made the lyrics of \"Greased Lightin'\" PG, but kept in and added sexual references and innuendo. What do people want their 14 year olds watching? What's wrong? What crosses the line and what's acceptable? I honestly have no idea after watching this production. It had no idea what it wanted to be. <br><br>You either PG the whole show or you let the thing play out in its unbridled, innuendo laden glory. Anything in between does the audience a disservice. <br><br>Either parents make a conscious decision to let their kids watch this and prepare to answer questions about what some of the dialog means or they keep their kids away from it because it isn't the kind of thing they want them to watch. As the show is in this form it doesn't properly service either side. This show left me feeling that 14 year olds were mature enough to handle, or stupid enough not to notice, the blatant sexual innuendo but were entirely too naive to understand that, even though people are doing it on screen, smoking is bad for you. <br><br>Go, have and talk about sex wildly, but for the love of God don't smoke! (Oh, and don't sing about sex! That's just vulgar and wrong.)","user":"MorganneLuse","rank":[19,28]}]