[{"title":"Great location, atmosphere, acting... bad film","rating":4,"date":"3 October 2018","review":"As the title of this review states, the film had several things going for it. The location was amazing, the acting very good and the atmosphere that the film created was very effective.<br><br>However, in terms of story and horror the film just did not deliver. It never lifted itself to reach any satisfying level after the promising start. The mythology it eventually revealed was stupid. Boring. <br><br>I am very forgiving of horror films and I so much wanted to love this after the first few minutes drew me in. But it was unlovable.","user":"SantiagoWLW","rank":[38,41]},{"title":"Ummm..","rating":6,"date":"12 March 2018","review":"This film was interesting to say the least. The acting is good, Had a few creepy moments. I was really hoping for more of a story line, it left much to be desired in the end. All in all not great, but not bad either. Just a solid meh","user":"eveland13","rank":[50,59]},{"title":"The Lodgers: Simply unlikeable","rating":3,"date":"21 December 2018","review":"The Lodgers is an Irish made horror which looks like a Hollywood movie complete with production values and standard genre flaws.<br><br>It tells the tale of a brother &amp; sister living in a mysterious house who must follow certain rules to not upset a supernatural entity that appears to be present within the same walls.<br><br>It's bleak, it's moody and truth be told it really isn't that interesting. Though it certainly looks the part there isn't much of value to see!<br><br>Starring Game of Thrones stars David Bradley &amp; Eugene Simon by the time the movie goes anywhere it's pretty much over already. It's a slow burn with no payoff and the journey is uninteresting and lifeless.<br><br>Visually a triumph for Irish cinema, on every other level a complete failure.<br><br>The Good:<br><br>Looks great<br><br>Couple of interesting ideas<br><br>The Bad:<br><br>Lifeless<br><br>Things I Learnt From This Movie:<br><br>Horror movies with a coherent plot are few and far between<br><br>People in movies can hold their breath for considerably longer than the real world","user":"Platypuschow","rank":[27,33]}]