[{"title":"An Average And Predictable Mess Of A Film","rating":3,"date":"16 January 2018","review":"The film starts off moderately ok with a couple vacationing in Thailand who visit an ancient burial site where they are attacked by an evil spirit that follows them throughout the vacation. The film then spirals into a mess of cliches, bad acting, predictable jump scares, and a story that does not hold your attention. The story becomes dull and uninteresting within 15 minutes of the opening, an opening that crams too much information into it, making questions one would have about the story answered already, leaving the story nearly non-existent.<br><br>The jump scares are almost all the same. Girl is alone, ghost suddenly appears, girl freaks out. It may work the first few times, but you end up knowing what the scare is going to be before it happens. While the ghost from a distance could be considered by some as scary, up close it is not. The make-up job on the ghost is so poorly done, it renders the tensions useless and takes you out of the moment. The writing is also painfully dull, including characters with barely one dimension as well as conversations that leave you waiting for it to be over so the next scare will come.<br><br>In short, if you are a horror veteran, skip it. If not and you want some cheap scares, go for it.","user":"neener3707","rank":[16,22]},{"title":"Not Very Good","rating":4,"date":"28 August 2017","review":"Ghost House is a generic horror film in which an American couple (Jim &amp; Julie) travel to Thailand on holiday. During the sight-seeing and partying they are tricked into visiting a forest where ghost houses are kept. These are miniature structures said to be inhabited by spirits. If the house is disturbed or desecrated the spirit will inhibit the offenders body and consume their soul. Julie is tricked into taking something from the ghost house and is possessed by a vengeful jealous spirit and Jim finds out that the only way to free her is to pass the curse to someone else as was done to Julie. <br><br>Overall the acting is fairly decent and there are some nice shots of Thailand. The effects are OK and so is the directing, but the story is somewhat slow moving and the movie which is about 80 or so minutes seems much longer. Some of the decisions the main characters make also seem illogical and this brings the rating of the movie down e.g. Letting complete strangers take them into the rural areas. The fact that there are movies like The Ring, Shutter, The Grudge, The Forest and many, many others also make the movie very predictable and formulaic at times. An example is passing the curse on like they do with the video tape in The Ring and Ring 2. The end result is therefore neither exciting nor really worth watching.","user":"nebk","rank":[20,29]},{"title":"Decent horror by numbers.","rating":6,"date":"10 September 2018","review":"Ghost House is worth a watch, it's a decent horror, with a few good moments, some decent scares, and it's well acted.<br><br>My criticisms would come from the fact that it contains virtually every single horror cliche in existence. We have the wise woman, the long haired female ghost, an English villain, arched backs, a ceremony, literally everything you would expect to see in a horror film is on show here.<br><br>Despite all that though, it is still a good watch, the beginning is very atmospheric, and the way in which the young couple are manipated into trouble is very well done.<br><br>It's unsurprising, but decent. 6/10","user":"Sleepin_Dragon","rank":[13,18]}]