[{"title":"If you're into dreams and the sub-conscious, the film is worth checking out.","rating":8,"date":"9 March 2020","review":"I saw \"Impossible Monsters\" at Cinequest last year and picked up the blu-ray last week.<br><br>First off, the film is not perfect. Although the writing could be stronger, the story itself is quite unique. Themes of control and lack thereof dominate (no pun intended) the film.<br><br>Characters' inner worlds are nicely crafted onscreen through various layers in the style and textures of the music, cinematography and editing.<br><br>The original artwork created for the character of Otis is incredible. It could stand on it's own and deserves a gallery show in the future.<br><br>Overall, the cast is fantastic, engaging and complex in their choices. It was great to see Santino Fontana in a very different role.<br><br>The film is more an internal study than a visceral gut punch with a distinct mood throughout. If you're into dreams and the sub-conscious, the film is worth checking out.","user":"rossalex231","rank":[47,58]},{"title":"It may not be a nightmare, but it's no dream either","rating":6,"date":"5 March 2020","review":"A dramatic thriller based on the very creepy subject of sleep paralysis proves to have some very disturbing dream sequences, and a generally unsettling mood overall. The pacing is a little erratic, sometimes all over the place, with a muddy story that may leave you behind if you aren't giving it your full concentration. And even if you are, it may still lose you a little bit. Not bad, but not really great either, and probably a bit forgettable. If it were just a bit scarier and perhaps focused more on the nightmare sequences and less on the characters' lives I think it would have made a bigger impact...but with good production value and decent acting forgiving its flaws, it's a 6/10.","user":"umimelectric","rank":[40,56]},{"title":"Has it's moments","rating":7,"date":"19 March 2020","review":"This movie was a trip! A trippy psychology, dream type of plot that will have you at the edge of your seat. There were some familiar actors in this so it was made with a budget and the soundtrack was top notch also. This is an unique film and not for everyone.","user":"musictapper","rank":[12,16]}]