[{"title":"If I could give it 0 stars I would.","rating":1,"date":"4 March 2020","review":"This movie was awful from start to finish.","user":"cloftuspdx","rank":[4,4]},{"title":"Quite quite quite bad.","rating":2,"date":"3 March 2020","review":"This feels like it wants to be \"Due Date\" or some other Zach Galifianakis gross out comedy. There is a cast here that could maybe pull that off, but the script SUCKS! The premise is quite stupid. This kind of absurdist comedy needs an absurdist set up...and a marriage for a green card is just NOT THAT. It is just too too unbelievable that the lead couple would set up a marriage to such an ogre.\n80-90% of the attempted jokes are lame, lame, lame. The fake reviews on here make me angry. That Hollywood or where ever makes such a terrible movie with such a BAD BAD script, while using up so much talent, makes me mad.<br><br>Oh, and, a large man very deliberately slaps a woman twice, very hard, once to the ground, for laughs and sucker punches a guy out, also for laughs. It's disgusting.<br><br>The end credit roll include a few outtakes where the cast laughs at some of their mistakes. That's more humor by a lot than the entire movie. There are some really fine cast members here...given NOTHING NOTHING NOTHING to work with. Avoid.<br><br>P.S. The movie makes decent use of one very fine asset, Gregg Sulkin's body. BUT, he is hosed with water in one scene and the huge amount of body makeup on him starts to run...and no one cares. Just left in. No comments. No jokes. Just a jacked gorgeous young man with obvious fake tan body makeup running down his torso. The rest of the productions values are okay...but this slop is a great indication of the unevenness and sloppiness of the whole film.","user":"LeatherCajun","rank":[5,6]},{"title":"Too Many Fake Reviews","rating":9,"date":"9 March 2020","review":"I haven't seen this film, nor will I until I read some real reviews. It's when you have a bunch of rave reviews posted within the same two days it's a dead giveaway that cast and crew were the source.","user":"mzand-751-539572","rank":[3,5]}]