[{"title":"Give It A Chance :)","rating":7,"date":"22 July 2015","review":"In an alternate universe, the Justice League is a brutal force that maintains order on Earth. As a result of the Justice League's savage tactics, their unaccountability is ultimately challenged by the world's governments following the suspicious deaths of renowned scientists.<br><br>Admittedly, I was initially influenced by some of the negative reviews that lashed out at the concept of Justice League: Gods and Monsters; however, this DC Animated Film was surprisingly entertaining. Directed by, Sam Liu, the dark and violent atmosphere suited the overall theme of the movie. Although this is an alternate Justice League from the one I grew to love over the years, this is definitely an exciting addition to the Justice League Animated Movie Series. <br><br>7 Stars.","user":"crimson_knight_7","rank":[50,58]},{"title":"Can Stand Alongside Some of the Other Best DC Animated FIlms","rating":8,"date":"27 July 2015","review":"I was hesitant about what Gods and Monsters would bring to the table. I was hoping it put DC animated movies back on track after some mediocre entries like Throne of Atlantis. And I'm delighted to announce that DC is back. Gods and Monsters is another great entry in DC's animated film catalog that can stand alongside some of the greats like Under the Red Hood or Flashpoint Paradox.<br><br>The story has an interesting premise. We see three of the founding members of the Justice League in this Elseworld story where the Justice League is more brutal and morally gray which makes the government feel threatened. Batman, Superman, and Wonder Woman are center stage and each have a newer origin story which help flesh out the characters more. The origin stories blend nicely with the rest of the story and add certain emotion when necessary. Lastly, as usual, there is a threat that affects the entire world except this time the threat is framing the Justice League and causing it to be feared even more by the government than they already are. Along the way, there are some nice twists and turns which help the viewer stay engaged.<br><br>The voice acting is top notch and was a nice and refreshing change from the usual Kevin Conroy and Tim Daly. As much as I love them, it was great to hear some new voices.<br><br>Overall, this Elseworld story is a fantastic addition to the DC Animated Universe and is a clever spin on what could be a normal Justice League movie. The darker and grittier tone allowed the film to fully develop this newer Justice League to their full potential and just made the film more intriguing in general. Definitely check this one out.<br><br>\"Someone once asked if I wanted to save the world or rule it. Today it's going to be hard to tell the difference\"","user":"DoubleOscar","rank":[29,33]},{"title":"Good start, great potential.","rating":8,"date":"1 August 2015","review":"Justice League: Gods and Monsters is a much welcomed return to the quality standard DC Animated established that was a bit lacking in the last few entries since Justice League War, Son of Batman and others. What makes it even more special is that it isn't based on any material but is a new, original take on the Justice League. <br><br>If you haven't seen the free-to-watch shorts, know that the almost all characters have little to none in common with their original, classic counterparts and only share the same handles and loosely the same function within the league. Superman is now the son of Zodd, Batman has no problems killing villains by sucking their blood Dracula-style and Wonder Woman has a completely different background. New faces, new abilities, new origins and relations etc. Considering how much was already done in Batman TAS, Superman TAS, Batman Beyond and Justice League, it's really refreshing to see Bruce Timm back doing new things while still maintaining the similar feel and quality the classic Justice League series are known for. While it's not quite on par with the best episodes of the Diniverse/Timmverse, it's definitely up there with the good ones.<br><br>A good portion of the fun is discovering familiar characters and see what has changed about them. You'll see familiar faces or just familiar outfits, notice what changed on the first sight and wonder what what else is new about that character and where they'll go with him. The good thing about it that they don't feel neither better nor worse, gimmicky or unnecessary, just different and effective in waking my curiosity and it makes the impression the makers had fun with it for the most part. It succeeds where Justice League War, another alternate universe JLA movie, failed.<br><br>The story tells the origin of each of the three Justice League members with a plot-line in the current time and is pretty much straight forward, but interesting enough and well paced. The downside of is that you have to be familiar with the DC universe to a degree, otherwise you'll be wondering about the function of a couple of characters with small screen time and won't care for their destinies as much.<br><br>The action is a bit lacking, but the focus is more on storytelling and characters anyways, so its a good trade off. A change here is now that the JL member are much more ruthless and have less remorse, which results in some bloody kills. It's a good thing that the writers have more freedom in that regard, however in this case it feels a bit forced and clumsy. It feels weird seeing them crush some goons with a huge and heavy door and seeing blood coming out underneath it. Perhaps I'm just too used to the DC Animated series, but it felt more out of place rather than adding anything to it. They got it right in a few scenes, but for the most part it felt just like a gimmick - violence just to show they can do it, without any meaningful impact or purpose.<br><br>Overall it is good, solid and refreshing fun. It's a good mix of old and new with very similar art-style to the series and is a great way to start things off. It has it's faults like a few characters being degraded to throwaways (Darkseid, Harley Quinn in the shorts...) or not being more subtle on certain things, but the rest makes easily up for it. There is much potential and hopefully we'll see more of it, maybe even in a form of a series just like in the old days. It's deserves a shot.","user":"grintemcstinger","rank":[10,10]}]