[{"title":"Solid dance film","rating":7,"date":"5 February 2018","review":"Really enjoyed this film. Unlike most dance films it doesn't try to be silly or uplifting. Instead it's more akin to a moody indie film about a young woman who has been stifled all her life finally finding her voice. <br><br>The beats of the film will be familiar to anyone who has ever watched a dance film but the sincerity of the actors and the beautiful choreography makes this incredible to watch.","user":"ReganRebecca","rank":[15,15]},{"title":"Dance Film - A Challenge","rating":8,"date":"5 February 2018","review":"It is difficult to create an acted dance film with mostly unedited performances; choreography; rehearsal; practices; auditions. A joint Russian - French production that auditioned hundreds for the roles and they chose well. The storyline is in part about the sacrifice by families and dancers to get to the highest level. Also, the search for one's self as our lead explores different dance genres. Of course since it's a film that part is somewhat dramatized, but not excessively offtrack. I think what the film misses most is the pain of six plus hours a day practices - the sprained ankles; torn muscles; bleeding feet; the weary exhaustion.","user":"westsideschl","rank":[11,12]},{"title":"Dance, art, personal achievement: uneven yet gripping","rating":8,"date":"9 January 2017","review":"This is one of the most underrated movies of 2016: reviews were mixed; box office was reduced. Nonetheless, it is a great film about dance and art, even though it is not pleasant with just pretty dancing scenes: its ambition is greater.<br><br>Based on the graphic novel by Bastien Vivès (\"Polina\", 2011), it was directed by acclaimed choreographer Angelin Preljocaj and his partner Valérie Müller. It contains autobiographical elements: Preljocaj's parents were poor Albanian refugees (Polina's parents are lower middle class Russians); when he came to France he first lived in a modest suburb (Polina struggles financially after she leaves Aix); he studied classical dance before moving on to modern (just like Polina). Yet the aspiration of the movie is not to depict a specific story, but to illustrate the difficulties and beauty of dancing.<br><br>*** WARNING: CONTAINS SPOILERS ***<br><br>\"Polina\" shows the evolution of its heroine through different fields: classical ballet, modern dance, improvisation, choreography. Every time she challenges what she learned before: she needs to strip off her previous knowledge to progress in a new field. Actually she even sometimes needs to perform the exact opposite: \"You have light movements from classical ballet, but my postures are rooted into the ground\", the modern choreographer Liria tells Polina. It is a constant search for beauty, perfection and exceeding one's standards.<br><br>That comes with hard work, injuries, failures, dead-ends and humiliations. Yet technique is not the ultimate goal of art, but only its basis: essentially, it requires a complete and disturbing challenge of one's own personality. Liria tells Polina: \"You only focus on yourself, you need to be in harmony with your partner.\" Also: \"An artist looks at the world.\" A great artist is not just a skilled, he/she must be open to his/her and others' sensations: he/she searches for truth, not just beauty. This is the profound meaning of what Polina tells her father in the bar when he asks her what she wants to do: \"Discover the world.\"<br><br>The movie is frequently elliptical, which increases its enigmatic atmosphere. We don't see some of Polina's key moments, for instance her audition for the Bolchoi or what happens just after she leaves Aix. Her decisions remain unexplainable: she quits the famed Bolchoi to follow her lover to Aix, where she will start from scratch and perform modern dance she does not know; she leaves Aix because she is jealous, without any prospects; we don't know why she goes to Anvers, of all places renowned for modern dance. The end is mysterious (see below).<br><br>Most ellipses regard her family. We vaguely understand they smuggle clothing to pay for Polina's ballet studies, but it is not explicit. Later on, what is the Afghanistan route the father will take to pay the criminals? Who wrecked the family's apartment and why? Where does the father go afterwards? What does he eventually die of?<br><br>Regarding that, there seems to be two parallel movies: one about Polina's artistic progression, one about her family. However, this division is only apparent: the harsh parts with her family stress Polina's difficulties to progress personally. And far from trying to provide an easy background to the character, the family scenes increase the overall sense of loss, both for Polina and for us viewers through the ellipses and uncertainties noted above. We are lost as she is, in a materially and emotionally unstable environment.<br><br>This said, what are the limits of the movie? First, the structure is unbalanced. We spend a long time on ballet teaching (including when Polina is a child), less on modern dance, even less on improvisation and choreography. The latter part is not credible: one does not create such an outstanding performance without experience, only relying on \"Let's try that\" and \"It looks good\". Of course, the purpose is symbolic to show Polina's transformation, but it could have been introduced more progressively.<br><br>Second, the parts with Polina's family, despite the symbolic purpose noted above, are somewhat exaggerated. Certainly the action depicted does happen in real life, but we see little of her family apart from hardships. Last, there are many clichés (the poor child who succeeds, the frightful villains, etc.), even though they efficiently support the main themes.<br><br>In summary, \"Polina\" sometimes feels awkward and amateurish. Despite this, it is a challenging movie about art, emotions and personal accomplishment. If you are sensitive to dance, notably modern, it is worth viewing. Choreographies from Preljocaj are superbly conceived and performed as expected, although they only appear in the second part. Music is varied (baroque, romantic, modern, contemporary, techno), highlighting the importance of expression and energy over form. Remarkably, talented dancers emerge as good actors: Anastasia Shevtsova now performs in Saint Petersburg's famous Mariinsky ballet; Jérémie Bélingard is a first dancer at Paris Opera. Conversely, professional actors impress by their dancing skills, notably Juliette Binoche and Niels Schneider.<br><br>The end is compelling, mysterious and rather joyful compared to the general dark tone. Polina and her partner dance on stage, in fake snow. Apparently, they brilliantly managed to produce their work. It loops the loop with the beginning, when Polina was dancing outside in the snow. The contrast is striking, revealing her evolution: at the beginning, she was a child from a modest family, dancing randomly among tall dark buildings; at the end, she is a talented adult, performing on a stylised stage a stunning choreography of her own (actually created by Preljocaj himself of course).<br><br>We then see Polina quietly walking towards her former ballet teacher Bojinski. She smiles: she finally found her vocation and peace of mind. He smiles back as recognition of her achievements. However, it is unclear if these last two scenes are real or fantasised (Polina has a tendency to fantasise, for instance when she sees the deer in the snow). The movie ends on this beautiful uncertainty: art remains a moment between reality and dream.","user":"Teyss","rank":[14,18]}]