[{"title":"Should have been called 90 Days of Recovery-90 seconds in heaven","rating":5,"date":"18 September 2015","review":"I don't know what it is about some Christian movies. They just don't get it. Just because you have a catchy title and a theme about 'GOD', the producers seem to think it will be a big hit. Im sorry to say, this movie was completely boring to me. The cast and acting were OK i guess. I think the wife in the movie was kind of cold and unemotional considering the events surrounding her. I was OK until i kept waiting and waiting and waiting for something to happen other than this mans' pity party to be over and from his recovery to be over. He says he saw Jesus at one early point in the movie (complaining to himself) and then complains about being alive and alienating his entire friends and family the other 95% of the movie! Really? Who would do this? By the time the movie is almost over he finally talks about his Heaven experience. Its nothing more than we have heard a million times already. A bunch of people he knew before, standing in front of a big light, an open gate, a relative, and an old friend standing there smiling at him. Thats it! And by the way, the people looked the same as they did here on earth! Of course we will look the same in appearance, but to have an old face with wrinkles and still have your dentures? Come on! It breaks my heart to give this review. I really really really HATE giving bad reviews on Christian movies being a Christian myself but i must say the truth in how i feel. Someone has to tell the truth even if it hurts or seems negative. We need to stop giving Christian movies high ratings just because they are Christian movies. Here's my prediction: Hollywood will say, \"Wow! There is money to be made with these Christians! Lets make them ourselves!\" They will screw them up with their ignorance. My God, have you seen Noah, or Exodus? Don't get me started... If you want a good Christian movie in theaters, GO SEE WAR ROOM.","user":"SpiritMechanic","rank":[40,51]},{"title":"Very honest.","rating":10,"date":"1 April 2018","review":"I have seen suffering like this and have been in the wife's shoes and this is very real. You have to understand the pastor's experience in heaven made his recovery more difficult (that might be a spoiler). His suffering was hard to watch but it was realistic. The spiritual struggle, financial trouble, and family trauma is just how it is. A near death experience, even without seeing heaven, makes you wish you had gone all the way, just to escape the suffering here and the suffering of dying again. It is honest and if you want to be prepared for tragedy here and heaven afterwards, it is worth the slow torture of watching this. It is better than doing yourself. The legal problems were also so true to life. Watch and learn and you might not have to live it. The last half hour is worth and since I see honesty throughout this film, I believe that is also likely the truth.","user":"kmweir-57189","rank":[12,15]},{"title":"Boring To Say The Least","rating":4,"date":"6 October 2015","review":"I saw this on my birthday on October 3rd. Was really having high hopes for the movie. But still, as I was really anticipating the movie as a Christian myself.<br><br>But when I saw it, really it disappointed me due to the fact. Of being boring and slow. And really was just about to put my father to sleep a couple of times.<br><br>As even though you feel bad for the Don Piper character played by an unrecognizable Hayden Christensen. <br><br>And the struggles that he had to face in 105 days. And his wife, played by Kate Bosworth trying to struggle as a wife and mom. Holding it together. <br><br>With the support of his family and friends at church and the school Eve, Don's wife teaches. He must learn to try to live as he feels like he does not. Until Fred Thompson as a mentor of Don's gives him some tough love.<br><br>A few parts were good but it was otherwise a boring movie.","user":"ShelbyTMItchell","rank":[27,39]}]