[{"title":"The title is promising but the movie can put a even a grizzly bear down","rating":1,"date":"25 March 2017","review":"The Greatest Tale of all Time. True. Then there is this typo 'David AND Goliath' so the title of this movie sounds like it's one of those sleazy 80's adult flicks. This biblical tale is better known as 'David versus Goliath'. Anyway I don't want to be persnickety but the movie poster is still the best thing about this movie. Period. I have seen better footage lying on editor's cutting floors than this. Sometimes I do not understand why serious movie makers struggle for money to get an independent movie gem made and other director's can easily deliver crap like this. Hollywood works in mysterious ways. Maybe this isn't a movie but instead it's a really long television ad for retro clothing and shoes. Who knows?","user":"denno","rank":[10,12]},{"title":"Nauseating","rating":1,"date":"29 July 2017","review":"This may as well be The CW's interpretation of the Bible. David fights (and kills) Goliath's shield bearer using bad Krav Maga moves and engages Goliath in a 3-1/2 minute sword-and-fist fight before climaxing with the iconic slingshotted stone, which turns out to be a godawful CG effect that looks like it belongs in Dragonball Z. I could go on for a few more paragraphs, but that should be enough to keep you away from this garbage, unless you're watching it for the same reasons you'd watch a Neil Breen film. I'm an atheist and was still somehow offended by it.","user":"alansmithee-19241","rank":[3,3]},{"title":"Worthless!! No redeeming value at all.","rating":1,"date":"24 June 2017","review":"If you're looking for an accurate Biblical portrayal of the epic story of David and Goliath, move along. Nothing to see here. This story is a re-write and they do preface the movie with the disclaimer that they took artistic and stylistic license. However, this movie is so NOT the story of David and Goliath. If you change the names of the very poorly acted characters there would be absolutely no resemblance. It removes faith from the story and portrays David as a late twenty something warrior in training instead of a sheep tending, song singing, fresh- faced young teenage boy. The acting, directing and casting, just make this movie atrocious. No redeeming value...not even with the hot girl who makes an appearance for a few moments.","user":"gunndavid-32750","rank":[5,6]}]