[{"title":"it's not about the money","rating":8,"date":"12 October 2017","review":"Greetings again from the darkness. Does it make sense to create an entire movie about a single scene from another movie? Director Alexandre O. Philippe answers with a resounding \"Yes\" and proves it with thorough and varied analysis of the infamous and iconic shower scene from Alfred Hitchcock's classic PSYCHO. <br><br>\"The death of a beautiful woman is, unquestionably, the most poetical topic in the world.\"<br><br>That quote from Edgar Allan Poe opens the film, and reminds us that the hullabaloo surrounding PSYCHO would never have been possible if Janet Leigh hadn't been a beautiful movie star  and if Hitchcock hadn't shocked us with the timing  and if so many other pieces hadn't fallen into place. It's those pieces that are the focus of Mr. Philippe's expository on the immediate and lasting impact of the scene.<br><br>The film's title comes from the 78 pieces of film and 52 cuts that make up the 3 minute sequence being adored, admired and argued here. The interviews and insight come fast and passionately from filmmakers, writers, educators, film historians, and actors. We meet the ultra-charming Marli Renfro, who was Janet Leigh's body-double for the film – and also graced the September 1960 cover of Playboy. There is also Tere Carrubba, Mr. Hitchcock's granddaughter and the daughter of Patricia Hitchcock, who has a minor role in PSYCHO. A few of the others who discuss the scene and film's influence include directors Peter Bogdanovich, Guillermo del Toro, and Karyn Kusama (JENNIFER'S BODY); and writers Leigh Whannell (SAW, INSIDIOUS) and Bret Easton Ellis (AMERICAN PSYCHO).<br><br>True technical analysis and peek behind the mysterious filmmaking curtain kicks into high gear when Walter Murch speaks. Mr. Murch is a 3-time Oscar winner and 9-time nominee for such timeless films as APOCALYPSE NOW and THE CONVERSATION. He is an expert on sound and film editing, two vital components to the shower scene, and he literally guides us through the individual cuts. Most fans of the film know of the chocolate syrup, but the casaba melon and the painting on the wall might be new territory. The film ties together, like never before, the script of Joseph Stefano, the storyboard of Saul Bass, the editing of George Tomasini, and the scene score of Bernard Hermann  all giants of the industry. <br><br>Whether you are a film lover, Hitchcock fanatic, or film theorist, you are likely to find something new here. The film represents so many \"firsts\" and was truly a turning point in the film industry, while also being a cultural phenomenon. When Martin Scorcese talks about the PSYCHO influence on RAGING BULL, it's the culmination of a blissful 90 minutes.","user":"ferguson-6","rank":[18,21]},{"title":"A Must-Watch For Psycho Fans (Or Film Junkies In General)","rating":9,"date":"11 November 2017","review":"Considering that \"Psycho\" has long been a \"top movie of all-time\" in my book, I knew I would be watching this documentary when I first saw the trailer. Considering how many times I've seen the movie and how many stories I've already heard from it, perhaps the most impressive thing I gleaned from \"78/52\" was how it was able to approach the topic from such a new, fresh perspective.<br><br>Basically, this documentary looks at \"Psycho\" from the perspective of its now-infamous \"shower scene\". While other topics are discussed and other stories are told, the narrative always shifts back to the construction of that sequence, which was truly momentous both in its time and even today. It completely changed the game of American cinema forever.<br><br>I really liked how this documentary was basically just a whole bunch of film geeks and/or industry insiders sitting around watching/talking about certain scenes. I mean, that's what it's all about, right? As movie fans, a large part of the fun of the experience is to discuss it with others after the fact, and that is the tone that \"78/52\" hits on. I felt like I was sitting around discussing the shower scene and everything that springs forth from it with family or friends.<br><br>So, I highly recommend \"78/52\" to any fans of \"Psycho\", obviously, but also for those who just love to discuss movies! It's technical enough to be enlightening, but not technical enough to keep it from being a great discussion/history of certain aspects of the scene, \"Psycho\" as a whole, &amp; Hitchcock (and Co.) in general.","user":"zkonedog","rank":[11,12]},{"title":"If you can't go to film class, be instructed and delighted by this informative and entertaining doc.","rating":5,"date":"5 November 2017","review":"Let's say you don't have the time for a film class; do you have 1/2 hours to spend to learn a major chunk about film, let's say theme, editing, and auteurism? Then see 78/52, a superb analysis of Hitchcock's famous shower scene.<br><br>Wayne Miller, who knows more about Hitch than anyone else I know and regularly visits as guest host on It's Movie Time, gave it thumbs up with the observation that the doc was replete with facts and observations he didn't even know.<br><br>Here is a perfect example of the ideal educational mantra: to teach and delight.","user":"jdesando","rank":[12,14]}]