[{"title":"A true gem for the right viewer","rating":9,"date":"16 October 2018","review":"Without needing to say it, this is not for everyone. In fact, it's not for most. But for a certain niche audience, its a true gem of a film. Motlagh throws the kitchen sink into this, and what is left is a haunting, lasting portrait of a character searching for meaning, that benefits from repeat viewings. The film starts to form the longer you go into it, and the particular rhythm starts to make sense. Without spoiling it, one particular scene was extra memorable and came from left field. For fans of challenging, cutting-edge, foreign, arthouse and experimental film, this is the good stuff.","user":"billbaggins1234","rank":[5,6]},{"title":"A solid experimental indie from an emerging director","rating":9,"date":"17 October 2018","review":"5 years from now, people will read this review and be like \"emerging???\" But very much like Amir Motlagh's other small, experimental film \"Man,\" this one hooks you in with it's skewed narrative and patchwork structure. Don't expect some grand drama with a clear-cut plot. That's not what this is--it's experimental, non-narrative essentially--and it's a bold indie with an equally bold Motlagh hallmark.","user":"spmjm","rank":[4,5]},{"title":"Beautifully filmed, drama, with sci-fi elements, indie/art movie","rating":8,"date":"23 September 2018","review":"Three Worlds offers a new story from indie filmmaker Amir Motlagh, who has made 15 or so films to date - including 3 features. In the movie a man goes through an experimental procedure and we get to see three stories, possibly more, happening in different points in time and perhaps in an alternate dimension. This is unlike most movies out there - a beautifully shot slow cinema art movie w/ sci-fi elements, featuring an Iranian-American lead (actor/director Motlagh) with moments from an Iranian-American experience in the film. And there are some great surprises in the film, can't say much more except that one of those great moments may involve some type of a ghost. An unpredictable film that deserves repeat viewings to fully experience and appreciate the multiple layers of the story. Fans of Malick, Mekas, and movies that blend real life and fiction seamlessly, and fans of earlier movies by Motlagh will enjoy this movie.","user":"wilddiner-544-410540","rank":[7,17]}]