[{"title":"A chore to sit through","rating":4,"date":"17 May 2015","review":"A couple (Candace Cameron Bure, Ty Olsson) married for fifteen years struggle to put the spark back in their marriage. Unfortunately, they also struggle to put some spark into this movie. I usually enjoy Candace Cameron Bure's TV movies a lot. But this one was just so blah. The leads have very weak chemistry. Candace does a decent job but she's better in lighter, more comedic roles. She's gorgeous though and when the movie does lighten up she shines. The highlight of the entire movie is the batting scene. There is the charm and adorableness that I watch a CCB movie for. She's really the only reason to recommend this, although I think it will test the patience of even her biggest fans. Ty Olsson is more of a problem. I know him from a variety of guest appearances on TV shows. He's not a bad actor but honestly, and this will sound like more of a slam than it's intended to be, he's just not leading man material. I'm baffled as to why he was cast in this part. <br><br>To be fair to Olsson, I doubt even a stronger leading man would have saved this. It's just very clichéd material that fails to connect with its audience. Perhaps if the characters weren't so successful and perfect I might have cared more about them and their ONE problem. I mean, really, I rolled my eyes at these two so much while watching. \"Oh no my life is only 85% perfect instead of 100. Woe is me.\" The biggest drawback to the movie is that it's so dull. I will give props to them for using the original Billy Joel song instead of some generic knock-off by a no-name singer, which is what I tend to expect from these things. Yeah they let the girl sing it in the end but there was an in-story reason for that. Prior to that every time they play it, it's Joel.<br><br>I've read that Candace thinks this is the best TV movie she's done yet. Just goes to show how actors and viewers aren't always on the same page because I think this was one of her worst. It's not a romantic comedy, as IMDb has it listed currently. It does have some light parts but it's really a romantic drama and not a particularly original or interesting one.","user":"utgard14","rank":[19,24]},{"title":"8 Star quality movie! Now that was a different Hallmark movie for sure!","rating":8,"date":"7 April 2017","review":"Now that was a different Hallmark movie for sure! It starts out in a love relationship, married with kids, lasts up to 15 years, then they have to work on rekindling the flame that was there all along, it just needed a little shove in the right direction. It was different because it wasn't really about FINDING NEW LOVE, more than it was about FINDING THE LOVE THEY HAD AND LOST in each other. What a sweet movie indeed! It was a Mother's Day movie too. This would have been better to watch around Mother's Day instead, but I hadn't seen it yet and I enjoyed it a lot. Hallmark Movies &amp; Mysteries pick great movies to view. Some of them might be corny and cheesy love stories, but I like most of them. Give it a shot! Record it on your DVR and watch it on Mother's Day with your mom. My absolute favorite part of this movie was the 'front porch' idea. It was the gathering place when I grew up. What happened to them!","user":"huggibear","rank":[4,5]},{"title":"Mildly entertaining","rating":6,"date":"22 August 2015","review":"I'm a fan of Candace Cameron Bure and all her Hallmark movies, which is why I chose to watch this movie. Candace has that cute, bubbly personality that works really well in the Hallmark feel good movies because you just always want to like her; you can't help it. <br><br>The problem with this movie is that I just didn't get the feel good part of it, and I didn't buy the two main characters as a couple. They didn't have any chemistry and just didn't seem like a good fit, even from that very first scene. <br><br>The movie had the potential, but I think it was just missing that something to tie it all together. It was a bunch of random scenes that didn't work together as a whole.<br><br>SPOILER: I thought the blind date idea was cute, but do you really have to buy your husband a helicopter ride before he falls in love with you again? I enjoyed the ending, but like I said earlier... there just wasn't a lot of chemistry with the leading lady and her leading man. He was somewhat likable, but nothing made you think that they should be together. It wasn't a good fit. That kept me from enjoying it more. Maybe if the opening was more than a couple minutes and you actually had a chance to see them with chemistry as a young couple, the whole thing might have worked a little better, for me at least.","user":"debbie_packer","rank":[5,7]}]