[{"title":"A nutcase hiding in the desert with a sniper rifle. Sounds fascinating. The end result wasn't as fascinating.","rating":3,"date":"31 July 2016","review":"\"Brothers burn faster when they're burning together.\" <br><br>The only positive thing about this film was Pat Healy as the crazy ex-marine Wyatt Moss, who set up his own personal amusement park somewhere in the bone-dry desert in California where he lures lost backpackers and hunts them down as a real psychotic hunter. He gratefully uses his talent as a sniper during these chases. The few times he speaks in this movie, show that he's ready for the nuthouse. Especially the dialogue with his brother, Sheriff Moss (Alan Ruck), is a memorable moment with that intonation and those facial expressions. Wyatt gave me the chills here, acting as a real psychopath. Just because of this scene, I'm planning to watch some more films with Healy playing in it.<br><br>I also thought that the sometimes eerie soundtrack and sound clips reverberating from the megaphones weren't so bad. They emphasized the insane mind of Wyatt. But otherwise this was a meaningless crime film, starring a madman fascinated by religion, who has his own safari park where victims try to survive. Thus a typical survival film. The last victim here is Vivian (Ashley Bell). She was kidnapped by two layabouts who tried to rob a bank and ended up in Carnage Park. It isn't very original and to be honest, there isn't happening that much essentially. It's during her stumbling flight that Vivian discovers other victims. And surely you can expect some fragments that are similar to those in other famous horror movies.<br><br>The thing that amazes me every time, is the stupidity of the main character. When you take matters into your own hand, make damn sure you do it thoroughly. Such a madman wouldn't get a second chance with me. But no, Wyatt with his gas mask (which reminded me of a CD cover from \"Therapy?\") resurfaces once again and the cat and mouse game restarts. And a cat could well have an advantage in this game, because it was largely pitch dark in this film. Several times I checked if the power went down, because in the end I couldn't see Jack sh*t most of the time. Also, the attempt to emulate the feel of a 70's movie wasn't really successful.<br><br>Actually, you can compare this with Mickey Keating's previous creation \"Pod\". Also, a so-called horror with potential. Good intentions are clearly present and there are also some positive aspects can be seen, but ultimately it's all vague and disappointing. Even downright violence and bloody fragments can't prevent it's becoming pretty boring and tedious halfway. Not to mention the announcement that this film is based once again on true facts. That won't make it an exciting movie, unfortunately.<br><br>More reviews here : http://bit.ly/1KIdQMT","user":"peterp-450-298716","rank":[18,24]},{"title":"Tedious, boring n badly directed n badly edited movie.","rating":3,"date":"18 October 2016","review":"I saw this on a pirated 50 rupees DVD. What the hell was the director thinking? Mickey Keating did a terrible job. The movie started well. Killer with a sniper gun. Killer shown shooting a victim. Pat Heally acted like a true psychopath. His facial expressions n accent was good. The deserted highway, the Californian deserts, bank robbery, hostage, all these gav me hope that this might b another Wolf Creek or another good thriller. I was wrong. The movie went downhill. Inspite of being only around 77 mins, i found the movie tedious n boring. At times i felt like switching off the movie. Very badly edited. Very badly directed. The soundtrack was awful. The acting of the remaining actors was pathetic. Larry Fessenden was jus there for few mins. Some decent cinematography but some of the scenes were so badly shot that I felt like turning my face away. Shaky cam, hand held, flickering lights in darkness were too tedious for me. Some scenes jus went blank (dark screen). I don't know what purpose does that serve. So many clichés. Viz. 1)When u take down/beat up a villain/creature/psycho, make sure that they r dead or completely down. 2)Whenever the main lead is terrified he/she accidentally stabs a scissor or a knife in an innocent person or cop's neck. So many times this scene been repeated in horror films man. It's getting repetitive.","user":"Fella_shibby","rank":[19,26]},{"title":"Really Enjoyed The First Thirty Minutes, Got Pretty Bland After That","rating":5,"date":"4 July 2016","review":"Carnage Park is a brand new horror film from Director Mickey Keating. Keating put out two pretty solid horror films last year, Pod and Darling, so I was pretty excited check out his latest offering. Plus from the trailer the film looked to have a grindhouse type feel to it, that combined with the fact that the cast featured Pat Healy (Innkeepers, Cheap Thills, Compliance) and Ashley Bell (Last Exorcism, Last Exorcism Part 2, The Day) was enough to make me want to see this on it's release.<br><br>Almost immediately the film had me interested, the opening scene does a good job of setting the tone of the film, then from there they jump right into a homage to one of the great scenes from Quentin Tarantino's \"Reservoir Dogs\". The first thirty minutes or so were very Grind house esque, I liked that a lot. The first character we are introduced to (Scorpion Joe) is a very cool character, the type of character that we usually don't see in horror films like this. Then we are introduced to our leading lady Vivian (Ashley Bell), Bell plays the part well but her character was pretty uninteresting in my opinion. Unfortunately though right at the thirty minute point the film started to get pretty bland. The Grind house style is thrown to the side and instead we are treated to a rather familiar scenario of a cat and mouse game between an attractive female lead and a crazy psychopath. Pat Healy does a decent job as the Killer, he is under used though and does not get enough screen time. <br><br>Of Keating's three most recent films (Carnage Park, Pod, and Darling) I would say that Carnage Park is the weakest. It really borrows too much from other movies and fails to do much to stand out. It's not a terrible movie, as I said the first thirty minutes were done very well, but the last hour or so of the film is just basically a rinse and repeat of so many other cat and mouse type flicks. Probably worth watching for die hard horror fans who need their horror fix, but outside of that I think most people will find \"Carnage Park\" fairly bland and boring.","user":"HorrorOverEverything","rank":[17,24]}]