[{"title":"Incredibly Fun Satire For Genre Fans","rating":7,"date":"11 February 2018","review":"This is just an incredibly fun satire for genre fans, and I'm a bit surprised it didn't generate larger waves. It uses the old (but not yet tired) trope of an outbreak among people trapped in a building to put a hilariously violent spin on the kind of themes Mike Judge already explored to great comedic effect in 'Office Space' (1999): what happens when a repressed, disillusioned office clerk suddenly has the liberating epiphany that he doesn't give a fû*k anymore and decides he'll stick it to his boss no matter the consequences. <br><br>Only that in this version, everyone around said clerk - from the lowest employee to the highest executive - throws their (few remaining) moral restraints over board at the same time as he does. Not through their own will, mind, but because everyone in the building is infected with a virus that makes people act out their most aggressive impulses. As you can imagine, the result of that is not peace, love and happiness - but rather... what's the word... Oh yes: bloody MAYHEM. Needless to say, I had a blast. 7 Stars out of 10.<br><br>In case you're interested in more underrated low-budget films and fun B-movies, here's a list with some of my favorites: imdb.com/list/ls054808375/","user":"gogoschka-1","rank":[56,77]},{"title":"Fantastic Film. Pure enjoyment.","rating":9,"date":"31 July 2017","review":"Just saw this at the Fantasia film festival last night and loved every second. A humour-filled, ultra-violent movie which skewers corporate office life -often literally. For anyone who has ever worked in a cubicle or hated their boss. Brilliantly funny and gory in equal amounts. So glad I went!","user":"johnandrewdavis","rank":[82,121]},{"title":"Gem of a B List Film!","rating":9,"date":"13 November 2017","review":"This was a breath of fresh air and I loved every minute of it and to be honest this was one for the B list actors as A lister's I feel would have ruined it?<br><br>Samara Weaving is one to watch out for and will no doubt soon be in big blockbusters!! Great actress who very much looks like Margot Robbie but fitter and has more of a presents on screen. She did great in The Babysitter too. My new Favourite female actress for sure.<br><br>Any way back to the movie...<br><br>The special effects was above par for the budget and acting was solid all round!<br><br>I am sure if an A lister was in this movie it would have made it into the mainstream Cinema's and not just 'Film Festival'<br><br>9 out of 10","user":"stokesy1012002","rank":[38,56]}]