[{"title":"A film that needed to be made","rating":8,"date":"1 November 2015","review":"Unfortunately, child abuse and the Catholic Church go hand in hand, with offenders rarely being punished. I went to a Catholic school, and years after I had left it was reported that one of the priests working there as a principal had in fact had sexual affairs with minors. It is an ugly, almost taboo subject to talk about, causing this film to be all the more courageous and confronting.<br><br>One thing is certain very soon into EL CLUB; Pope Francis and the Vatican would love to sweep this film under a rug, much like the estranged priests we meet. They live together in a secluded house and they are hidden from society; the hours that they are able to go outside are very limited. The home is run by a nun-turned-caretaker, and it functions as a sort of priest retirement home, with one clearly suffering from some sort of dementia. This though is a retirement home with a difference, as it is a house for priests with certain skeletons lurking in their closet.<br><br>However, their serenity and separation from their past evaporate as a fifth priest arrives with his own skeletons, not to mention a former altar boy following him. The viewer is immediately put to the test, as the obviously unstable man outside the house is crying out this new priests' name and recalling, in extremely graphic detail, their more intimate time together. At first he is a character yelling drunkenly outside the house, but later he becomes a pivotal character in the story.<br><br>He is Sandoken, a troubled and bruised man who was obviously sexually abused as a child. More than once he describes what happened to him as a child, further testing the viewer. The new priest's arrival and Sandoken's outbursts stir the pot, as soon the priests find themselves being interrogated by someone hired by the caretaker as a 'spiritual director', who works for the church and wants to speak to everyone separately and truthfully.<br><br>These scenes make up about a third or a quarter of the movie, as each priest and the caretaker are interviewed. This man's true mission is to have these priests confess to what they have done. These one-on-one talks are very deliberately filmed, as after each question is asked, we see an extreme facial close-up of the priest in question, emphasising the issues at hand, while at the same time soaking in the emotions that wash over the face of the character being interviewed.<br><br>The rules of the house change dramatically once this man enters the picture. Suddenly no alcohol is permitted, among other things. One of the priests owns a greyhound who he enters in races to bet on. It is an activity that all the men enjoy, but since this adviser has started poking his nose into their activities, he takes an interest in the greyhound; though not the sort of interest the priest would want. This 'spiritual director' doesn't seem to understand the reason for keeping an animal, so he asks directly, why keep the dog? This man works for the church but is extremely passive aggressive in his actions and particularly in his words and questions.<br><br>Having been raised Catholic, going to a Catholic school, this film resonated with me in a way I wasn't expecting. While I don't consider myself religious anymore, I found myself immersed and being reminded of the real life horrors this film is based on, wishing that it could all stop, that priests' records could become public.<br><br>Guilt and secrecy are the main themes here, with EL CLUB serving as a portrayal of priests with reasons to hide certain acts. The 'spiritual director' only wants them to confess, he doesn't really want to dig up their secrets. He is after all a man of the church. However, each priest is hesitant. This theme runs parallel with real life, as priests who have committed sins of this nature want them buried and forgotten about, rather than confessing. Ironic, considering part of their day-job is to listen to confessions.<br><br>That these priests have been sent to a remote house rather than remaining in the public eye also mirrors reality, as again the church would rather forget these issues ever occurred rather that revealing the truth.<br><br>This movie was made in Chile, and the events depicted were no doubt influenced by local issues: a man who was known to at least be involved in pedophile behaviour was assigned as bishop for Chile's armed forces, by the Pope himself. This caused an unprecedented level of outrage and protests by victims of abuse. All these people are represented in the character of Sandoken, broken and confused, unable to find direction. A bit like the hierarchy of the Catholic Church really, but that is a story for another day, and a long one at that. A heavy watch then, but one gets the sense that it was a film that needed to be made. Avoid this if you're not ready for a very heavy drama.<br><br>www.epilepticmoondancer.net","user":"punishable-by-death","rank":[62,79]},{"title":"TIFF 2015 -- The Club: Exposing evil through brutal honesty","rating":7,"date":"20 September 2015","review":"Pablo Larrain (No) returns with another story that shadows his country with 'The Club'. Before the details emerge, this story is nothing like 'No'.<br><br>'The Club' takes place in the somewhat remote coastal village of La Boca Navidad where a house of secret guests exists: they are either child molesters, baby snatchers, or were active supporters of Pinochet, and they were all Priests. They have all been excommunicated from the Catholic Church for their crimes and sent away to this house as not to harm the Church's image instead of being put in the public eye and then thrown in jail. The house is quarterbacked by a Nun who also suffered a similar fate as her house guests.<br><br>One day, a new guest comes to join The Club, only to be eventually tracked down by a former altar boy who shouted claims of constant abuse from outside the house for him to hear. Not long after, we learn that these claims are true, and the reaction sets off a further investigation into the requirement for the house and the livelihood of the guests who reside there.<br><br>'The Club' isn't an artistic work that should be shared for praise and glorified for any kind of distinction. Instead, it clearly details the horrific nature of how the Catholic Church deals with their worst offenders — by putting them in houses in rural locations, 100% funded by the Church. As the film progresses, we learn that the house mates have ways of passing the time — good and bad. Some are healthy, while others are vices. Eventually, when the house comes under inspection by the Church as to whether it should remain or not, extreme actions are taken to try and keep things intact.<br><br>While advertised as a dark comedy, this film is almost nowhere near that. It was intended to show the evil behind the Church, and that its image cannot be tarnished. In a continent that houses 40% of the world's Catholics, a film like this definitely sticks a thorn in the Church's side. It gets dark, it gets rather nasty, it gets brutal, but, while it's just a story with fictional accounts, they were created via true stories over the years.<br><br>Watch this film with the expectation that you will be shocked by what you see and hear, but hopefully you will be moved enough to know that there's evil where good supposedly resides.","user":"Brap-2","rank":[45,58]},{"title":"An Engaging Story Told with a Mix of Disturbance and Discomfort","rating":8,"date":"28 December 2016","review":"The Club is about of group of former male priests who have been sent to live in a house for supposedly being incapable of properly ministering, when something horrible happens outside their house and a young priest-psychiatrist joins them in the hopes of finding out what's going on, and putting the former priests back on the right track. <br><br>The movie has so many twists and turns, it's probably better that you don't know much more about it. And that's something that I loved. It's unpredictable, and the movie just goes along without over dramatizing much, thus making it just a little more real. <br><br>Right from the get-go, this is a beautifully shot movie. Every scene is gorgeous, and the gloomy color pallet really helps set the tone. Even the coloring of the house sets the mood incredibly well, and allows an atmosphere of dark sadness to settle over the entire film. <br><br>The acting is all pretty good. The characters are convincing as characters, and they react in ways that I think a lot of people would in their situation. This is often due to the writing, which is also great. The dialogue is intriguing and pulls the story along with nice pacing. <br><br>The movie is pretty slow to start. When the dog races are first introduced, I thought it'd be about dog racers and lost interest. However, I'm happy I stuck with it because it gets better. Much better. <br><br>Despite how well-made and unpredictable the movie is, I found myself somewhat distant from it emotionally. Scenes that should have shocked or made me tear up had little effect. While it captured discomfort perfectly, it didn't quite capture other emotions. <br><br>Overall The Club is great. The acting, writing, shots, and story are all very engaging, all with a little too much discomfort. It lacks emotional investment and intrigue right off the bat, but it gets better. In the end I would definitely recommend this movie.","user":"SquigglyCrunch","rank":[10,11]}]