[{"title":"Calling all Cat Lovers - You have to watch this!","rating":8,"date":"13 August 2016","review":"We almost didn't watch this movie because the ratings were so bad, I am sorry I waited this long! I went with my sister and my kids aged 10 and 7, we laughed the whole way through! It was such a funny movie. I loved all the characters, especially frustrated Mr. Fuzzy Pants..! The supporting characters were great especially Christopher Walken and Cheryl Hines. Jennifer Garner and the girl cast as her daughter were beautiful and perfectly cast. Yes the story was a little predictable, but it didn't matter..the cat antics were hysterical, cat lovers and Kevin Spacey lovers will enjoy this film. We wanted an enjoyable family, summer movie and we got it!! PLEASE go watch this movie! It's a great last hurrah before school starts :)","user":"indienari","rank":[75,109]},{"title":"its not as bad as people say","rating":7,"date":"9 August 2016","review":"I've read some awful reviews about this movie and my expectations were set low. I was expecting to be dragged by my kids to a mix of \"Baby Geniuses 2\" and \"Battlefield Earth\". But I was pleasantly surprised. This movie won't win any Oscars, but its a reasonable kids movie. Kids liked it, and I was OK with it. Yes, the plot is predictable, and the jokes are pretty flat, but they are geared toward 10 year olds and adults who really like cats, and that is what is expected from a kids movie about a cat. If you hate cats, well, don't see it, see \"Shaggy Dog\" instead, its virtually the same plot, except its a different type of a pet. I think this movie is OK and I look forward to seeing new incarnations of the same plot in the future movies, such as \"Being Goldie\" (hint, hint movie studio, in about 10 years we will be ready for another one of those plots)","user":"mnemon07","rank":[62,89]},{"title":"No sure why this is getting so many bad reviews","rating":6,"date":"27 October 2016","review":"OK, I agree that this is no Citizen Kane, but I was amazed at the critical reviews and low IMDb score.<br><br>I think perhaps to appreciate this you need to be particularly fond of cats and/or been a cat owner. But if you are then this film is a perfectly serviceable slice of family entertainment, and frankly there are much, much worse films out there. Kevin Spacey and Chris Walken are dependable as always and I think there is plenty about this that kids will enjoy. Worth a look as a Sunday afternoon family film in my opinion, or perhaps as something you can put on to keep the kids amused.","user":"barryweir","rank":[32,46]}]