[{"title":"low expectations, great rewards","rating":2,"date":"2 June 2016","review":"I was actually looking for a different movie when I stumbled upon this through Netflix. By the time I realized my mistake, I decided to give it a shot anyway. I went in with the mentality that this was a kids movie because it is. Anyway, I saw the plot coming a mile away but it was still fun to see the character's reactions to it. Dove Cameron did a great job with her character and most of the others portrayed their intentions pretty well. I absolutely loved the dynamic between Beth and Hunter. I wanted, more than an adult woman should want, for a second movie to come out just to see what would happen if the bad guys came back. I enjoyed this more than many of the other Goosebumps movies and I say it's worth a shot as a family flick. Go in with low expectations and come out with great rewards.","user":"annielovvorn","rank":[7,7]},{"title":"Enjoyable light horror with likable characters","rating":7,"date":"14 October 2015","review":"I'm a big horror nut but sometimes I like the soft stuff. I've read a few R.L. Stine's \"Goosebumps\" novels and they're always an enjoyable read. I feel like he captures teenage life quite nicely and he creates likable characters who you root for. He's been well served by the television medium as his \"Goosebumps\" TV series is quite well done and I've just began watching his \"The Haunting Hour\" show and so far so good. <br><br>\"The Cabinet of Souls\" is, likewise, a very solid TV offering of light horror aimed (mainly) at kids and adults alike. The setting is good; a traveling house of horrors with a mysterious owner who collects the souls of customers and feeds off of them. It could very well be a premise for a full out gory R-rated film but it manages to generate a few creepy moments and is always entertaining. <br><br>The cast is likable and their characters as well. They do possess qualities that are admirable and that's a nice thing for a parent to know if they'd like to sit down with their kids for something a little bit on the scary side. Bad language is nicely sidestepped without the film feeling corny or something like that. <br><br>\"The Cabinet of Souls\" is an all around decent flick which many age groups can enjoy.","user":"ODDBear","rank":[17,20]},{"title":"Timepass","rating":4,"date":"7 December 2015","review":"If you have nothing else to watch and this is the only thing on TV, watch it I guess.<br><br>The biggest problem I had was with the weird camera-work. Almost everything is blurred at the edges and I am guessing they were trying to give it a fairy-tale look with the blurring, but it just looks silly.<br><br>The second problem is that the lead male and female have no chemistry. The Hunter guy has more chemistry with the lead female and mostly because they actually are a couple in real life.. so yeah.<br><br>In the end, acting is fine, girls are fine, mood is light and I was kinda hoping for all that. But unlike Goosebumps, this movie wasn't very entertaining. Teen problems mixed with campy horror. Meh!","user":"DBLurker","rank":[8,12]}]