[{"title":"This one really surprised me...and I only mean this in good ways.","rating":8,"date":"26 August 2016","review":"\"I Am Not a Serial Killer\" is a very slow and deliberately paced film. I am telling you this up front so that you know that it's well worth sticking with this one...please resist your urge to try something else because of this! The payoff is well worth it and the film is well made and I honestly can say I've never seen anything like it in my life!<br><br>This movie by Billy O'Brien is set in a small town in the Midwest and was filmed in rural Minnesota. This certainly is not where you'd expect a series of super-grisly murders to occur, but that's exactly what happens soon after the picture begins. Body after body begin piling up and naturally the townspeople are scared. They don't know it, but their only hope is a very strange young high school student. You see, this story is told from the viewpoint of this very strange misfit high school student...a kid unfortunately named John Wayne Cleaver (Max Records)! With a name like this, it's not at all surprising that he's obsessed with serial killers. And, because of his strange obsession he decides to start investigating on his own into who is eviscerating folks in town...eviscerating and stealing some of their organs! His trail leads to one of his neighbors, a nice old man played by Christopher Lloyd...yes, the Christopher Lloyd who used to play Jim on \"Taxi\"....and in this case his character is far, far stranger...that's for sure! I'd love to tell you more about the plot but had better not, as it might spoil the suspense...and wow is there a lot of suspense!<br><br>While I generally do not like violent or bloody films, I was captivated by this picture because it was not simply blood and gore but offered far more. The actual murders are far, far more complicated than you can imagine and the film has an amazingly gory yet exciting finale. And that, naturally, brings me to mention the blood, guts and gore. This is not a family film and don't even think of showing it to your mother, children or Reverend Fletcher! Well worth seeing and I'd love to see more from these folks!","user":"MartinHafer","rank":[58,72]},{"title":"delightfully refreshing from \"modern\" movies","rating":9,"date":"16 September 2016","review":"We saw this in the theater yesterday (luckily we have one that shows non-major studio movies). We recognized many places as it was filmed locally. <br><br>It has all the elements (drama, comedy,irony, surprise, style) without adding CGI and other effects. In some ways it is a throwback to the sci-fi genre of the 50s and 60s. The plot kept me guessing and changing my mind until the end. <br><br>If you have an opportunity, watch this! You will find what quality movies can be. Granted it is not the movie of the year but should be given recognition.","user":"mduffsub","rank":[25,33]},{"title":"Fresh and entertaining","rating":9,"date":"12 August 2016","review":"As an average movie goer who was let down by major titles released this year, I decided to give this one a go. As it was part of the Melbourne International Film Festival program this year, I closed one eye and picked something that sounded mildly interesting to watch with a friend. <br><br>This is a movie-adaption of Dan Well's book, which already received quite a reputation, but I didn't know that. Heck, I didn't even bother to look at the cast list, or anything further than the 'psychological thriller' genre. Boy, was I in for a ride. <br><br>Overall, I was mildly surprised by how entertaining this movie was. The pacing was adequate - not rushed, nor was it too slow. It was also quite easy to follow with no convolution in the story and it doesn't feel forced. I was even more impressed about the clever slice of humor being thrown here and there. I enjoyed the cinematography and clever use of sound effects to keep you at the edge of your seat. <br><br>So I'm giving this a good rating, simply because I really enjoyed it - and that 2016 really need more gems like these. I wouldn't mind watching it again, or pick up the book.","user":"qlissa","rank":[53,78]}]