[{"title":"Nothing out there quite like this","rating":9,"date":"15 October 2016","review":"Weirdest movie i have ever seen. Cannot be recommended but i cannot not recommend it either. I don't condemn anybody who gives it a rating of 1 out of 10 but i can see how it could get a 10 out of 10 too. From the bat**it crazy soundtrack to the gratuitous full on male nudity that peppers the entire movie you are in for an experience if nothing else. Do not go into this without being warned, you will hate it and love it (delete as applicable) It's a horror movie with some weird gross out scenes, a love story with some weird gross out sex scenes and a comedy movie with some weird gross out scenes. It's funny in a kind of \"never seen that before\" way - you will tell your buddies about it. Watch it because you'll be glad you had, even if you hate it, if that makes sense.","user":"mark-2705","rank":[87,101]},{"title":"Absolutely weird.","rating":6,"date":"11 October 2017","review":"I tried describing this film to a friend. It's labeled a horror comedy, but I didn't find it scary or funny. The latter is not meant to be an insult, because there's a definite unique style that would work for some people.<br><br>The most apt analogy I can make is that it's a live action Beavis and Butthead world done by the cast of Shameless. <br><br>Characters that would be considered as a weird outlier in any other work seems to be par for the course here. Everything is weird, awkward, and unsettling but not in a creepy way.<br><br>I rate it a 6 because after I was done watching all I could really say was \"Yup. I watched that.\" but it's very easily either the best film you'll ever see, or one of the worst, depending on what you want from it.","user":"overvelde","rank":[11,11]},{"title":"Pure Joy! An Instant Cult Classic","rating":9,"date":"25 October 2016","review":"What's with all the low-ball ratings/reviews? Come on people, can you honestly say you were expecting something else when you sat down to watch this movie? The name alone is enough to either pull you in or send you running for the door - so, if you didn't go running, then you obviously didn't hate it.<br><br>I'll be honest, I didn't sit down to watch this movie expecting to be blown away, but I was intrigued enough to see it. Most movies that go straight to \"on-demand\" status rarely are worth my time and money. A mere 5 minutes in though I knew I was seeing something special (I watched it 3 times in 48 hours). This movie isn't for everyone, and frankly you could spend the rest of your life searching for someone capable of appreciating it for what it is. It's a throwback to the thinly-plotted, cheap thrills horror-comedy movies of the 80's. Anyone who's seen the Toxic Avenger will surely fall in love all over again. The acting isn't Oscar-worthy by far, but that's the point. It's supposed to be cheesy, and that's what draws you in. It's probably gonna shock you, it may offend you, but it's definitely gonna put a smile on your face one way or another.<br><br>My only complaint is that they supposedly cut 45 minutes of the film for the final version. I'd love to see it released someday with the extra footage. Also, the ending seemed somewhat rushed, they could've left it open to a sequel, but that may be due to their cutting the extra scenes.","user":"GratefulDom","rank":[45,57]}]