[{"title":"Loved IT!","rating":10,"date":"1 March 2015","review":"I like Hallmark Movies &amp; enjoy watching them. Some are a little too corny for me or just OK. Which I was expecting for this one. I only watched it because I had DVR'd it. It was actually after I had watched the other 5 movies I DVR'd.<br><br>But, color me SURPRISED! I just loved the movie! I literally could watch it over &amp; over again. I already watched in 2x's in a week!<br><br>GREAT MOVIE!<br><br>An architect heads to the altar with her fiancé, unsure of her marriage and their future. She relives her disastrous wedding day, put together by her fiancé's overbearing mother, over and over until, with the help of her fiancé's brother, she begins to face her biggest fears and discover what she really wants in herself and in her life.","user":"happybwst","rank":[12,20]},{"title":"The Autumn Reeser Show!!","rating":10,"date":"23 April 2015","review":"What a great romantic comedy! I didn't see the time pass by. Usually, I am not a huge fan of the Groundhog Day-type movies. But in this case, it worked perfectly. And much of the credit goes to Autumn Reeser. She is hardly off camera during the whole movie, and she's absolutely brilliant from start to finish! Fabulous actress!<br><br>It's the story of an architect who heads to the altar with her fiancé, unsure of her marriage and their future. She relives her disastrous wedding day, put together by her fiancé's overbearing mother, over and over until, with the help of his brother, she begins to face her biggest fears and discover what she really wants in herself and in her life.","user":"butterfly-78","rank":[9,15]},{"title":"I wish I did not","rating":1,"date":"10 March 2015","review":"Groundhog day revisited. Neurotic Ali Liebert is an architect who marries author Antonio Cupo. The wedding is planned by the mother in law to be and it looks like Cupo has only got married for career advancement. Liebert bumps into her brother in law to be, Shawn Roberts who is a doctor in Africa and who is a sort of a free spirit.<br><br>As the wedding does not go according to plan she has to relive her wedding day every day and decides to make small changes such as learning Italian, learning to dance, finding out what she wants in her life.<br><br>This is a cheap looking film, with cookie cutter production values. I swear the music in the film has been used in other Hallmark films. You can tell straight off that Cupo is unsuitable for her and the rugged Roberts will be her suitor.<br><br>The film is annoying, poorly acted and has absolutely no flair or fire in its script or direction.","user":"Prismark10","rank":[15,34]}]