[{"title":"The magic is not quite there","rating":9,"date":"7 November 2015","review":"I love Ghost in the Shell. The original movie was great, the series were a bit different, but still making the viewer think about the nature of self and the direction technology takes us in. All of that was enabled by great stories and wonderful music.<br><br>While \"The New Movie\" is a good piece of animation and with an interesting story, it doesn't quite catch the magic of the original. Also, as a continuation of the GitS:Arise four episode series, it makes it difficult for newcomers to understand what it is all about. But probably what bothered me most was the soundscape. While not bad, it is a far cry from Kenji Kawai's work.<br><br>Perhaps the problem is that, in attempting to reboot the franchise, they went too soft. Less blood, less killing, less subtlety and instead just a modernized corporate Yakuza fight that is easy to understand from the perspective of the Japanese viewer. Ghost in the Shell was never about the present, though, it was about the future, its role to make the viewer think things forward and see the predictions of the anime come true in the years to come. \"The New Movie\" doesn't quite do that and so I feel a slight disappointment with it.<br><br>Still, a flawed GitS movie is a lot better than no GitS movie and I was glad to watch it. The excitement of the original, though, I didn't find it here.","user":"siderite","rank":[41,51]},{"title":"Very light on action and a bit dry plot-wise","rating":6,"date":"24 November 2015","review":"The original Ghost in the Shell movie is one of my favorite movies of all time and still holds up very well to this day. GITS2: Innocence wasn't on the same level but it was still well made, looked great and had an spooky Alice in Wonderland feel. Ghost in the Shell: The New Movie (what a retarded and inspirationless title) is actually a continuation of the Ghost in the Shell: Arise, an anime TV series. But that actually does not matter much. The story revolves around the assassination of the Prime Minister of Japan. Although a bit typical for anime films and the GITS series and films there is an incredible amount of the characters just standing around jabbering endlessly with plot exposition. And the plot does seem overly dry and long winded IMO. When there is action it's great (but not as great as in Nr. 1) but there is so few of it. This makes the film feel very slow and long - a problem I didn't have with the first 2. So if you're a fan of GITS you'll want to see it just to be complete but for the casual viewer I would recommend to skip it or just watch the first 2.","user":"Jerghal","rank":[15,19]},{"title":"Gorgeously animated sci-fi, although might not be easy for newcomers to pick up and plug in.","rating":7,"date":"6 November 2015","review":"Ghost in the Shell is one of the most enduring and beloved anime franchises, also widely known for inspiration for the Matrix. It's also one of the most reworked franchises, with many iterations and alternate versions, which aren't entirely accessible for some viewers. If one can pass this hindrance, the literal New Movie possesses high quality sci-fi with excellent artworks and voice acting.<br><br>Plot is a continuation from the most recent Arise: Alternative Architecture TV animation, which is television version of Arise four movies. If all of these etymologies confuse you, it's all right, this series is known for its complexity. Arise itself is a new rework, thus the artwork might not look like old version, especially the slimmer protagonist Motoko Kusanagi.<br><br>While this is not so out-of-the-world like many previous iterations, it's not easily available for newcomers, even for fans who didn't watch the Arise version. It's skimped on many narratives and character introductions. It certainly doesn't have \"previously on\" segments, so this can feel alienating, especially when the movie has many specific jargon and terms associated with the plot.<br><br>Fortunately, the sheer production is brilliant enough to compensate for the inaccessibility. The world Motoko lives on is very splendidly done, it's also the world with prejudice, not for skin color but for the prosthetic parts one wears inside. Motoko is born fully augmented, making her a special operative. The same technologies are also used on different aspects like stealth, warfare, and even communication with virtual private chat, so the characters might seem speaking telepathically.<br><br>The visual is very aesthetically and thematically pleasing. It's a futuristic setting, but not so far off that it becomes unidentifiable. There are tons of cultural and urban scenery, some of which look utterly gorgeous, even those in brief scenes. Bits of graphical details scatter on the vista, as nifty foundations for intriguingly futuristic world.<br><br>Aside for the immense amount of details, action is also fluid and inclusion of 3D effect looks admirably fitting. Voice actors do wonderful jobs here, especially the veteran Maaya Sakamoto who delivers wide range of emotions, there are subtle variations even with the stoic character.<br><br>For fans, this is a nice continuation of new series with polished execution. For newcomers, it's almost akin to watching The Matrix straight on its second movie, rather overwhelming but can be still pleasing due to its sheer production.","user":"quincytheodore","rank":[17,24]}]