[{"title":"typical and awful","rating":1,"date":"30 June 2017","review":"I don't like to write reviews. But I've watched so many terrible horrors, I feel like I have to say something.<br><br>This movie is gawd awful. Everything that is wrong with current horror is in this movie - amplified; false jump scare, forgettable characters with no intelligence spitting nonsensical lines, unnecessary special effects (the house has a Star Trek force field, dude really?), it's annoyingly loud, unimaginative and confusing non-existing story line.<br><br>This movie made me physically mad.<br><br>I had to reward myself with ice cream having endured a terrible experience called Darkness Rising.<br><br>Save yourself the time, skip it.","user":"vpeou","rank":[58,65]},{"title":"This wasn't a horror movie, it was a pile of garbage consisting of smaller piles of garbage","rating":1,"date":"1 July 2017","review":"This movie was a struggle to sit through. Before i continue I want to make it clear i'm not gonna trash this movie for the heck of it, i'm usually pretty good at giving movies the benefit of the doubt (I watched \"The last air bender\" 3 times). I have watched a lot of horror movies, some good, some bad. This was without a doubt one of the worst ones yet.<br><br>The story was bad, the acting was bad, the script was bad, the cinematography was bad, the props were bad and, the special effects were bad.<br><br>Darkness rising had a total of 2 scary/Creepy scenes with a combined length of 45 seconds (and that's generous). There are so many of the plot devices that just goes unexplained, most of them actually. They try to explain it towards the end of the movie but fail horribly, partly because the acting and script is so bad it's hard to actually listen. Oh, and i have never seen a weaker character in any other movie, about 30-40 min into it, the main character, Madison, starts to cry and LITERALLY does not stop for the next 45 min, every line she has is said crying and she is basically helpless and just screams for her boyfriend, Jake, to help her and the ONE time he asks for her help, she hides (while crying).<br><br>Frankly the only good thing about Darkness rising was the credits, great roll speed, great font and font size, great spacing and fantastic spelling.<br><br>Please do not waste time and money on this.","user":"andersdalsgaard","rank":[49,55]},{"title":"Darkness Rising: Wait.....what?!","rating":2,"date":"26 August 2017","review":"When the legend that is Ted Raimi appeared on screen after the opening credits I was awash with a feeling that I was about to watch something good. Sadly however it was not meant to be and I was presented with this realisation within no more than 15 minutes.<br><br>You know those over-convoluted horrors which make the rules up as they go along, make no real sense and are generally pretty damn appalling? This is one of those.<br><br>A girl returns to her childhood home with her friends, the home where her mother went crazy and tried to kill her when she was a child. Then spooky things begin to go on around the house and it all gets bad, but more for the viewer for the trio.<br><br>Messy unlikeable tripe.<br><br>The Good: <br><br>Looks the part <br><br>The Bad: <br><br>Makes no sense <br><br>Why do the characters keep repeating themselves? <br><br>Things I learnt from this movie: <br><br>Nothing, in fact if anything I lost brain cells","user":"Platypuschow","rank":[21,23]}]