[{"title":"Is the old Bruce Willis back in an exciting action movie? Nope, damn ....","rating":4,"date":"26 January 2016","review":"The makers of \"Extraction\" use the same marketing gimmick as used in  films such as \"The Cold Light of Day\", \"Fire with Fire\", \"The Prince\"  and \"Vice\". It's the famous Bruce Willis magic trick. Actually, it's  dead simple. Make sure this star actor of yesteryear (I have to say I  was always a big fan of BW) participates in an upcoming B-movie.  However, the length of time you can admire him is limited and his  presence is evenly spaced. You let him turn up at the beginning of the  movie as an appetizer and give the impression that this might be a real  Willis movie once again. Eventually, he disappears for most of the film  and pops up again in the end for the big reveal. Then place him  centrally on the cover so future viewers will get the feeling that he's  playing an important part in it. I'm convinced that this is the biggest  marketing trick that ensures the necessary revenues. As a viewer, you  feel cheated though.  Yep. The \"Die Hard\" star adds just another B-movie to his record of  achievements. I must admit that the beginning of the film provided a  momentary enthusiasm. For a moment, I had a feeling the old Bruce  Willis was back and I was getting ready for some cool one-liners and  beaten up opponents. Yippie kai yee! The result was a short-lived  excitement, because before you know it the Willis marketing trick  reveals itself and he disappears like a white rabbit during that  well-known magic trick. Not in a black hat, but in the murky world of  terrorists who captured a device called CONDOR. When activating this  device, telecommunications will be disabled worldwide. Or something  like that.  Time for Kellan Lutz to show up. He plays Harry Turner, a CIA analyst  who would love to follow in the footsteps of his father, but his  application is always refused by the respective services. Until the day  comes when someone kidnaps his father Leonard (Bruce Willis). Despite  the explicit prohibition of his superiors to get involved, he still  heads out to defuse that CONDOR. And this with the help of this other  field agent Victoria (Gina Carano). And what a surprise, she's someone  Kellan had a brief relationship with before. Who would have thought of  that? What follows is just a cheap Secret Service action movie with the  necessary fight scenes. And with of course the obligatory locations  such as a biker bar (starring some billiard balls and a broken jukebox)  and a trendy nightclub. Carano showed already in \"In the Blood\" that  she can stand her ground in such dark clubs.  The story brings nothing new and is full of familiar clichés. Even the  denouement at the end was predictable. Not quite a good movie, you  might say. The same can be said of the performances. Willis plays  another comatose role and looks quite pathetic and uninterested in the  few moments when he's on screen. Lutz and Carano make the best out of  it and during the action scenes, the entertainment level rose a bit.  And then there's the fact that Carano's curves are certainly a feast  for the eye. I wouldn't date her though. Not with this  testosterone-filled chunk of energy. Before you know it, you're stuck  in a stranglehold that can be fatal. For now I've lost all hope for  another brilliant Bruce Willis movie. Yippie kai ... yeah yeah yeah!","user":"peterp-450-298716","rank":[43,45]},{"title":"totally disappointed in this","rating":4,"date":"24 December 2015","review":"Extraction (2015) is probably the worst film of this genre put out in the year 2015 that featured a well respected actor. I'm quite stunned to see that out of so many producers on this project that it looks as if not one of them done anything to make the film worth watching.<br><br>Extraction is a film which is riding the coattails of Bruce Willis, knowing that with his name on the picture a lot of people would go check it out. I've always been a fan of Bruce Willis and what I saw in this movie truly upset me to see, the film is horrible. The movie has hardly any script or direction, the acting from 90% of the actors is at TV Commercial level; what were they thinking? I was really hoping this film would've at least been entertaining to some level.","user":"MattyAndAnnika","rank":[41,48]},{"title":"Simply awful","rating":1,"date":"20 December 2015","review":"This is one of the worst movies of the year, if not the decade. If this doesn't end Carano's and Lutz' career, nothing will. <br><br>Dull, boring, totally inconsistent and full of gaffes. They seem to have shot this for a low budget and then had to finish it off in 2 days. There are so many holes in the plot that the viewer is expected to write half the script of the movie. <br><br>Action scenes are okay, but they look incredibly choreographed and lack credibility. After a 5 minute fight, the actors look as fresh as having come out of the shower. <br><br>Lackluster performances from all main characters, even DB Sweeney who usually us pretty solid. This movie is a waste of time.","user":"peo-19","rank":[64,79]}]