[{"title":"Very different, but well made Retro-Horror. In today's environment though many will likely find it boring...","rating":7,"date":"25 October 2019","review":"First and foremost, I want to comment that I feel that the movie is very well made. The cinematography, pacing, lighting, nice slow Classic camera movements and suspense, and most especially the acting, were truly all very well thought out, created, and executed.<br><br>Now, with that said though, this is a VERY different kind of film. As other reviewers have said, there is not a lot of what people think of as 'Horror' in the movie. But, what I feel makes it very engaging is that it is put together so well that the characters, suspense, and flow of the story do carry you along. If you are looking for anything extreme here or shocking, you will not find it. It IS pretty much written with a younger audience in mind. BUT... even so, I think that if you have a very active imagination, an almost 'childlike' one, then I think there is a good chance that you may really get caught up in it.<br><br>There are quite a few Horror films where young people of this age are featured that I find totally unbelievable, forced, unrealistically vulgar, and quite frankly very poorly done. Many of the critic's reviews were quite strong about this one, and in this case I agree with them.<br><br>Yes, the film is very vague as far as the 'Plot' or what is actually happening, but again, for me personally regardless of the Genre of the movie, what usually catches my attention is the quality and thought that are put into it and how well it is acted and put across. This is a VERY simple, low-key Horror film compared to a lot of the extreme stuff we see these days, so many here have indeed stated how 'Boring' the movie is and give it a '1' But, to me, that is not the point... If you want more exciting Horror, then fine... watch something with more punch to it; there are many excellent strong Horror films out there. But, that is not the focus of this one. This one is quite deliberately engineered to help the audience enter the mind of a child that age, and it works beautifully. That doesn't mean that you will necessarily be thrilled with the 'story' as it is, but the journey throughout is quite well worth it in my lowly and wretched opinion.<br><br>Probably most impressive, and many films these days do NOT have this quality, is that the acting was VERY realistic and believable. Far more believable than some very popular young people oriented shows on now. It never seems contrived or artificial, and also something that really made me smile several times, is the well placed but very simple humour in some of the throwaway lines. Many times, with young actors the writers try to make them seem 'smart' or 'clever', but end up way overdoing it making it come across as false. But, the writers / creators of this film interject just these few, genuinely funny low-key lines here and there which I feel really add to the overall enjoyment and engagement of the movie.<br><br>Again, a very low-key, simple Horror film geared towards young people. But, one that I truly feel is above average. With the right expectations and understanding of just what KIND of film this is, I think people who appreciate movies that are well done will find themselves more caught up in this story than they would have thought...","user":"lathe-of-heaven","rank":[5,5]},{"title":"So much better than expected","rating":10,"date":"30 October 2019","review":"I read the reviews going into this movie and I wasn't expecting much from jump but I was sucked in from the opening scene to the very end. It was so much better than I expected. The acting was great and genuine, you really feel for the characters and the story was fun and entertaining. The ending was a major twist you never see coming. If you love horror/thrillers or just a fan of good movies or if you love stranger things you will love this movie. Definitely worth watching","user":"mwillis-12221","rank":[7,8]},{"title":"It took me back...","rating":8,"date":"28 October 2019","review":"Its not a movie that will keep you clinging but all the characters will keep you involved and execution is great. It felt like old horror movies where you feel emotionally invested. I loved it.","user":"ridamazhar","rank":[7,8]}]