[{"title":"Some decent anecdotes, and absurd melodrama.","rating":6,"date":"22 October 2019","review":"A religiously devout sermon from the church of Quentin Tarantino.<br><br>An opportunistic hatchet job of easy target Harvey Weinstein.<br><br>And a vanity project for its own self anointed brave female director, who feigns fighting the good fight and sticking it to the man to bring us this exciting exposé pried straight from the fangs of the big bad wolf (Weinstein).<br><br>Look, this is a fawning frivilous featurette assembly which had some interesting anecdotes from a few of its interviewees, but basically glosses over any critical analysis of its worshiped subject.<br><br>There's no mention at all of the tumultuous and contentious relationship between Tarantino and his Video Archive's colleque (and fellow Academy Award winning \"Pulp Fiction\" co-writer) Roger Avary who also contributed seeds to \"True Romance\", \"Natural Born Killers\", and \"From Dusk Till Dawn\".\nMuch is said about Tarantino being so \"original\", but just one snickery quotation screen is all this film devotes to the absolute fact that Tarantino ruthlessly steals from both friends and foreigners with abandon, while deliberately neglecting to be gracious or forthright about their immense contributions to his own pastiche driven tweeks and rifts. So that's a major rock left unturned - it's maybe nudged slightly, but the dark underbelly of Quentin's ambition for validating acclaim at the expense of others is not examined with any vigor whatsoever.<br><br>I did especially appreciate that his editor Sally Menken was given due credit here. In my opinion more of such notice should have also gone to his cinemtographers - especially Robert Richardson whom is no mere technician for hire by any stretch.<br><br>But why is Tarantino's other writing and acting film work not given more attention? I'd be intersted to learn more about his relatonships to Tony Scott, Oliver Stone, and Robert Rodriguez. What about his script polishing work for \"True Romance\" director Tony Scott on that filmmaker's subsuquent \"Crimson Tide\"? Tarantino disowned and disavowed Oliver Stone's deconstruction of his \"Natural Born Killers\" script and refused to ever watch it. Has that changed? What about the fact that Quentin went on to commandeer Oliver Stone's long-time cinematographer/collaborator Robert Richardson (who helped much in making NBK an experimental departure from QT's script)? Or that Tarantino later co-starred in his own scripted \"From Dusk Till Dawn\" with \"Natural Born Killers\" star Juliette Lewis. For that matter Robert Rodriguez's \"From Dusk Till Dawn\" is barely even cited as existing, even though it is written by and co-starring Tarantino and even has \"Tarantino-verse\" Big Kahuna Burger/Red Apple Tobacco brands in it! And what about Tarantino's great scene stealing cameo in Rodriguez's \"Desperado\" - how much original writing did Tarantino contrubute to his big monologue for that scene and did he lend any other additions?<br><br>This doc doesn't say anything about Tarantino's adamant stance and ardent leadership in preservation for physical chemically processed Film negative vs digital capture - as a shooting medium (it does glance over his unenthusiastic attitude for the sterility of digital projection, however). I particularly find QT's very vocal distaste for the digital camera revolution in Cinema to be wholly appropriate and his railing against the trend of easy technological inferiority of aesthetics to be inspiring.<br><br>So, instead of delving into any of these intersting aspects of Tarantino's Cinematic impact and interplay - we get a trivial and cheesy \"E! True Hollywood Story\" level display of histrionics with accompanying ominous soundtrack undertones about Harvey Weinstein - who was nothing but a daddy warbucks to Quentin. Yeah, I get it - he was a big fat sweaty odious creep of no redeeming value (except for producing the best autered Cinema of the 90's) who suffered no qualms in taking advantage of the ambitions of ingenue starlets to their sub-advantage (sometimes resulting in their burgeoning careers in return). Wow, news flash - heterosexual men have sexual appetites for young beautiful vivacious women and some of those men will use whatever means at their disposal to satisfy that. It's just shocking to learn the heinous revelation that women whom profit primarily by using the fleeting allure of their ripe supple nubility upon the beguiled male-gaze to fake intimate relations in front of camera lenses for such approval, would be subjected to quid-pro-quo solicitation in exchange for opportunity - that's a totally unnatural progression of their aspirations. I for one just can't fathom why the profession of actors has always been equated with the oldest profession... Hey, but what about Tarantino's questionable liaison with his actress Uma Thurman? Wasn't QT once engaged to Mira Sorvino (who claims to have been abused by QT mentor Harvey)? How exactly does the circle curve anyway? What about QT's degenerate fetish for female feet that he indulges in many of his masterpieces? I mean, since we're going to get tawdry, why not at least stay on target? Reeks of disingenuous opportunism to divert off into an exploitively melodramatic conformation bias of a zeitgeist's preoccupation toward an ancillary's extraneous misdeeds while glossing over the proteged primary's less than always stellar professional etiquette in even equal balance. I merely must mention it here, to say that it wasn't worth more than a mention there, and to illustate the exasperatingly un-nuanced glibness with which it is handled. I think the time consuming tack-on was tact-less.<br><br>Then to fill out the feature length running time of this doc we get treated to the epic behind-the-scenes saga of its director as she pretends to have really stormed up that hill and took on the system to regain the rights to complete this lazy puff piece away from the crumbling Weinstein Company by essentially just waiting for it to all collaspe. For my tastes, this sidenote is a little too much self aggrandizing vanity from a mediocre sycophant to insert herself into the narrative and pat herself on the back about it. Whatever, guess she had an ax to grind and figured she'd sandwitch it in here, no matter how inelegantly.<br><br>So, in lieu of more interesting and pertinent material, we get unnecessary tangents that are unrelated to the actual contextual content of examining the creative factors that made Quentin Tarantino into the most iconic filmmaker of his generation.<br><br>I enjoyed much of what was presented here, I just wish it was deeper and more consistantly focused on its primary subject in earnest.","user":"octagonproplex","rank":[24,35]},{"title":"Never make the Doc about you.","rating":6,"date":"22 October 2019","review":"It was kinda enjoyable. I loved the nostalgia and some of the cast interviews. I didn't really learn that much but it was still interesting.<br><br>The Weinstein topic felt tacked on. I get it; he's a creep. However it just felt like a VH1 special that had to have a \"Drama\" moment.<br><br>The closure of the doc was derailed by injecting the director into the subject matter. This part was more suited for a blue ray extra and not an actual part of QT's legacy.","user":"LawrenceOfAlabama","rank":[13,18]},{"title":"voice of his generation","rating":8,"date":"2 December 2019","review":"Greetings again from the darkness. Quentin Tarantino has been praised as the cinematic \"voice of his generation.\" His influence on other filmmakers is as obvious as those who have influenced him. This is a celebration of Tarantino the filmmaker, and also somewhat of a response to his critics. Tara Wood's documentary never hides that she's a fan, and to her credit, she hits head-on the 3 controversies associated with her subject: the use of the \"N-word\", Uma Thurman's stunt car accident while filming KILL BILL, and his friendship and business relationship with the despicable Harvey Weinstein.<br><br>Tarantino has publically stated that he will retire from filmmaking after directing his 10th film. Ms. Wood's film covers his first eight, from RESEVOIR DOGS in 1992 to THE HATEFUL EIGHT in 2015. Because this documentary was tied up and delayed in the Miramax quagmire, there is also a brief mention of Tarantino's 9th film ONCE UPON A TIME IN HOLLYWOOD, released this year. The film kicks off with some background information from Producer Stacey Sher, mentions of his writing for TRUE ROMANCE and NATURAL BORN KILLERS, and a fascinating tidbit involving how QT used his pay from appearing as an Elvis impersonator on \"The Golden Girls\" to initially fund his career in filmmaking.<br><br>Ms. Wood then divides her film into three chapters, thereby categorizing and providing insight on each. \"Chapter 1 - The Revolution\" includes RESERVOIR DOGS and PULP FICTION, both ground-breakers in their own way and they announced \"an astonishing new voice\" in movies. The best behind-the-scenes bit comes courtesy of actor and Tarantino regular Michael Madsen who initially objected to being Mr. Blonde, complaining \"I didn't want to get killed by Tim Roth.\" Of course, it was PULP FICTION that elevated Tarantino to a new stratosphere - oh, and it also allowed for the stunning comeback of John Travolta.<br><br>\"Chapter 2 - Badass Women and Genre Play\" covers JACKIE BROWN, KILL BILL and DEATH PROOF. The first of those films, each which featured very strong women, was an ode to the Blaxploitation era, the second was influenced by Hong Kong cinema, and the third is described by Zoe Bell as Tarantino's 'thank you' to industry stunt people. Perhaps the most important element of this chapter was that, despite the affirmations, he refused to serve up a repeat PULP FICTION ... yet another thing that set him apart from other filmmakers.<br><br>\"Chapter 3 - Justice\" finishes up the catalog with INGLORIOUS BASTERDS, DJANGO UNCHAINED, and THE HATEFUL EIGHT. 'Basterds' is renowned for what may be the most fascinating opening sequence in any movie, 'Django' shows his love of westerns (especially Italian), and 'Hateful 8' stands as a 'western RESERVOIR DOGS'. With his many references to earlier cinema, Tarantino shows no hesitancy in spinning or changing history to fit his story. While many disparaged the infamous Hitler scene in 'Basterds' (and subsequently the Manson killings in his latest), Tarantino firmly believes that viewers know they are watching a movie, and can easily separate this from real life and historical fact. It's noted that this is what story telling is all about ... asking 'What if?\"<br><br>Many of Tarantino's collaborators offer insight and memories. Those appearing include: Samuel L Jackson, Christoph Waltz, Kurt Russell, Michael Madsen, Jennifer Jason Leigh, Diane Kruger, Lucy Liu, Bruce Dern, Jamie Foxx, the late Robert Forster, Tim Roth, Eli Roth, and Lawrence Bender. Most obvious in their absence are Uma Thurman, Pam Grier, Leonardo DiCaprio, John Travolta, and Tarantino himself. There is also a nice segment included as a tribute to the late Sally Menke, Tarantino's long-time film editor.<br><br>Quentin Tarantino has been described as an overzealous geek with the talent to back it up. In reality, he's a walking and (fast) talking encyclopedia of movie knowledge, trivia and history. He is also described as creating an exuberant infection with cinema, and his frequent scenes of ultra-violence are interpreted by Christoph Waltz as \"opera\". It was October 5, 2017 when the Harvey Weinstein story broke, and immediately, since many films connect them, Tarantino was part of the story. It's a blight on his record, just as it is for countless other actors, celebrities and film industry types who knew and chose to stay silent. But when it comes to making movies, few have ever done it better. There is an on-set clip where Tarantino says \"One more take. Why? Because we love making movies!\" It's clear from the interviews here that QT reveres making movies. He also loves watching movies - so much so that he bought and renovated the New Beverly Cinema. He's a proud film geek. Ms. Wood's film is pure pleasure for QT fans and will explain a lot for those who aren't so sure about his work.","user":"ferguson-6","rank":[9,12]}]