[{"title":"A really fun ride!","rating":8,"date":"21 January 2017","review":"A film that plays with time in a fun way, with great direction by Christoper Smith, fantastic cinematography by Christopher Ross, and really believable acting by Tye Sheridan and the rest of the cast. I loved this film, but I thought it could have been better paced. The film sometimes slows down quite a bit, especially in the first half of the film. I feel that 4-5 minutes could have been cut. But that didn't really hurt the film to much, it was a great ride with a story that was really interestingly told. It's not a new way to tell a story but it's a fun take on the \"Pulp fiction\" time line story telling. So if you want a really fun ride with great filmmaking then watch Detour! So I'd say watch it and enjoy!","user":"sherlock-holm","rank":[35,49]},{"title":"Brilliant Writing, Directing, and Acting... An Underrated Movie","rating":8,"date":"28 April 2017","review":"I came across this movie by coincidence , and I am so glad I decided to watch it. Why did I? Well, simply: Tye Sheridan. He impressed me so much with his acting in 'Mud', that I knew he is going to turn out to be a good actor. I was also impressed by Emory Cohen in this movie. I like actors who are versatile.I am going to keep an eye on these two.<br><br>The way the movie is written, shot, and directed is brilliant. I usually do not enjoy movies that go back and forth in time, but this is done well and for a purpose, which is revealing a twist every time, eventually putting together important pieces of the story. <br><br>Moreover, this is a movie that has wit in all the elements I have mentioned above.<br><br>Bottom line: it is a good movie that deserves to be seen. People should stop going after movies with \"star power\", in other words, movies with more famous actors, and should give such movies the appreciation they deserve.","user":"gpride2009","rank":[15,19]},{"title":"Not Your Typical \"B\" Movie","rating":8,"date":"27 January 2017","review":"From Christopher Smith, the director of \"Triangle\" a movie that I personally love and that was loved by many, I thought i'd give this movie a chance without knowing much about what I was going into.<br><br>And it was definitely a surprise, knowing that actually the budget of this film isn't high at all and won't hit the box office, I lowered my expectations but then what I got from the film raised them up.<br><br>The film is actually very entertaining and engaging, and there's a very cool plot twist almost in the middle of the movie, I felt like this movie interacts with the viewers in a really cool way. <br><br>What I liked the most about this film is that it feels unique, it shows you how simple decisions could change lives, and not to mention the cinematography was very beautiful.<br><br>Without spoiling anything, I thought this movie was a very cool underrated thriller that deserves to be more known than this, so give it a try with an open mind.","user":"Samirsbureau","rank":[23,32]}]