[{"title":"So much going for it - but painfully slow","rating":5,"date":"22 August 2017","review":"This is a dystopian movie about a young woman left out in a lawless desert with some real choice characters. <br><br>This film starts off very brutally but calms down considerably after the first few scenes.<br><br>The characters, acting, production and filming are really good. The story is adequate for needs. The scenery and leading lady are absolutely gorgeous.<br><br>So why the low score? The pace of this film is cripplingly slow. There are tedious scenes that should be time lapsed but are run in real time, there is lots of staring and grimacing in silence. You really can go and make yourself a sandwich during this and be safe in the knowledge that you are unlikely to miss anything.<br><br>A lot of potential, I really wanted to like this, but it is just so slow I was fighting to stay awake.","user":"thekarmicnomad","rank":[140,168]},{"title":"Dreadful stuff","rating":4,"date":"3 October 2017","review":"I went against my instincts when it came to watching 'The Bad Batch'. Every nerve in my body was telling me it would be dreadful, but the words cannibals, Jim Carrey, Keanu Reeves and Giovanni Ribisi kept repeating over and over in my head until I finally gave in and made the fateful mistake of watching it. My god, how is it possible to make a story this boring out of cannibals? Every single thing it tries to make itself interesting with completely falls flat. When you manage to get a completely dull and forgettable performance out of Jim Carrey you know you're doing something terribly wrong.<br><br>The film tries to be thought-provoking (at least it seemed like that was what it was going for) but none of the concepts it presents are in any way actually worthy of a second thought. It also goes for a lot of style, however it again falls short. In a futuristic desert wasteland setting there a thousand different concepts you could use to create an interesting story. For some reason 'The Bad Batch' chooses a story that could have been told in any setting and in any time period. That's about as lazy as story-telling gets. If you do make the mistake of selecting this one up on Netflix brace yourself for a long and painful couple of hours.","user":"jtindahouse","rank":[97,125]},{"title":"It so desperately wants to be cool, but continuously misses the mark.","rating":4,"date":"5 October 2017","review":"I'm very liberal when it comes to rating movies. Not everything can be \"The Usual Suspects\" - I understand that.<br><br>Holy crap, does this thing drag on and, man, is it trying desperately to be hip, edgy, cool, or something. It's like it comes up to the edge and I think, \"Ooh, it might happen here!\" and then it doesn't.<br><br>Dang. <br><br>It's not fun. It's not even really fun in a bad way. It's just ... bad.","user":"bigfatmouth-23883","rank":[55,70]}]