[{"title":"Goes Down Fast","rating":4,"date":"20 November 2016","review":"Officer Downe is an action film starring Kim Coates in the title role. He is a cop who can be brought back from the dead every time that he is killed. As such he is a fighting machine taking on the criminal underworld of L.A controlled by the criminal organization known as the Fortune 500 led by the Lion, the Vulture and the Tigress. <br><br>Based on a graphic novel this film is very violent and has a lot of gore, swearing, nudity and sexual situations. There are arms dealing nuns with machine guns led by Mother Supreme as well as ninja assassins trained by a teleporting assassin known as Zen Master Flash. And all of them try and sometimes succeed in killing officer Downe. But not for long...<br><br>There are some corny one liners and some comedic moments although these tend to be flat for most of the film. At times Officer Downe has the look of a gritty graphic novel. However for most of the film it seems that the focus was on style rather than substance and the movie suffers for it. At times the violence is very excessive with heads being blown off, and limbs being removed. The levels of gore will probably not appeal to everyone.<br><br>The camera work is shaky at times and both the acting and the dialogue tend to be weak at certain times although not for the whole movie. So a mixed bag. Could have been much better if the story was more developed with better dialogue. On the plus side there are at least four members of the band Slipknot appearing in various small roles in the movie. So that might appeal to their fans.","user":"nebk","rank":[19,22]},{"title":"Planet Dredd on acid","rating":7,"date":"1 March 2017","review":"Very weird, but it seemed all purposeful and coherent. Maybe except the way how the tension was handled: wasn't much different from most movies, but something felt off. Somewhat anticlimactic, despite many climaxes indeed. It's a very healthy mixture of cliché behavior leading to deconstructive results. I like when a movie can surprise me. This was disruptive of what other movies trained me to expect. It was stupid and gory, but not grim. One more surprise here, as recent productions just have to be dark and gritty. This is like Dredd (2012), except that it's not some of the characters being on drugs, it's the movie makers. Really reminds me of Planet Terror (2007).","user":"madameminty","rank":[10,13]},{"title":"Maniac Cop meets Hobo with a Shotgun","rating":6,"date":"19 April 2017","review":"first off, this is way better than 4.6 average score. if you're into grind-house, over-the-top-violence, b-movies and/or heavy metal music, this is right up your alley. and yeah, there is some stuff which is really silly, but hey, it works within the film and for me, so, I'm okay with that. for sure, it's not for everyone, hence the bad score, but if you enjoy \"Hobo with a Shotgun\" or \"Fathers Day\" or any Troma release, go for this one. (on Netflix US now, April 2017)","user":"ConqueringRuler","rank":[8,10]}]