[{"title":"Black comedy, all is not what it seems..","rating":10,"date":"28 December 2016","review":"Black comedy (in my mind) is an art form where you know you shouldn't laugh because the subject is taboo but you can't help yourself . And so is \"Down Under\".<br><br>Taken in a literal sense this movie doesn't work; but let's face it, if you want to watch a doco on the Cronulla riots go watch a doco. No, this is far deeper than that and frankly I thought it one of the funniest movies I've seen in a long time.<br><br>The two main groups in the movie are such exaggerated clichés they are a parody of themselves, the stoners are too stoned to do anything; the \"Lebs\" are too busy arguing with each other to get anything done. They are all so hopeless its funny. None of them could organize a beer in a brewery. None.<br><br>I felt sympathy for Evan the downs syndrome lad; but he delivers some of the best comedic moments of the movie. In fact Evan was about the only likable person in the movie; he deserved to be looked after better than he was.<br><br>One of the highlights was David Field playing full-on rice queen Vic; selling a gun to one of the \"Leb\" gang.. with x-rated gay porn on the tele while discussed the deal with the gang members... champagne comedy and a role I'd never picture David in..<br><br>If you are part of the PC fun police, or are really immature or have a low IQ please don't bother with Down Under; you won't get it (or worse still, you will take it seriously... believe me it is not serious; it is a massive p*ss-take on the parties to the Cronulla riots.. in case you haven't figured that out by now..).<br><br>If you enjoy a good black comedy/satire; you'll struggle to do better in the genre. This is no mainstream film, but its a 10/10 for me.","user":"davidhinecpa","rank":[16,24]},{"title":"best black comedy I've seen in a while!","rating":10,"date":"18 January 2017","review":"To see this film rated at 6.1 is complete crap, it definitely does not deserve anything less than an 8. After reading a couple bad reviews, it looks like some of you idiots went expecting something closer to real events, but if you just look at it just as what it is, a hilarious black comedy, its amazing! I laughed my ass off the entire film, the acting was perfect, the story really was interesting for a comedy, and every second of the film was incredibly entertaining! I really thought it was damn near perfect for a black comedy, some of you people need to realize that this is not documentation, nor a true story, its a comedy, a really funny one!","user":"mkparker-53380","rank":[13,20]},{"title":"Top notch comedy with a great story and message to share","rating":10,"date":"4 August 2016","review":"An outstanding film with top notch comedic performances from the cast as well as great dramatic performances. Abe Forsythe is a special talent and with his great writing and directing with this film has managed to do something incredible and make a film centered around the cronulla riots and 2 groups so different yet so alike and is a film that is gives of a powerful message that. Underplays throughout the film and really brings the message with the powerful conclusion . Abe makes a top notch film that is both funny and dramatic and captured the audience and takes them on a great ride and Balances them perfectly taking the audience on a great journey,an absolute ripper of a film Australians should get out and see this great film it's well worth it","user":"bazza_mckenzie02","rank":[25,47]}]