[{"title":"A thriller without any suspense nor tension","rating":3,"date":"8 March 2016","review":"I'll have to admit,Hangman have a rather interesting and provoking premise. But,that's as far as what you can get from this movie. All you will get is a \"thriller\" movie that fails as a thriller,lacks in thrills,lacks of character,Plot-less and empty storyline,cringe worthy dialogue,and an Editing so bad,it feels like you're watching a high school student's film project. I know that this movie is a low- budget indie movie,but this movie is just pitiful.and the main plot of the story itself lacks in explanations,and it will leave you scratching your head on what's the point of the story,and what's going on in this movie.<br><br>It has a sloppy visual editing,and a sound editing so bad,that in some unnecessary scenes,there's a sound that will blow your eardrums without any apparent reason. It also has a soundtrack that really didn't help,or maybe ruin a scene that's supposed to be tense.<br><br>If you are looking for a full of tense,groundbreaking,jittery independent horror flick,then this movie is not for you.Period.","user":"onerickyisneverenough","rank":[20,21]},{"title":"Lost the plot","rating":3,"date":"23 October 2016","review":"The movie started out well and had a lot of potential but didn't deliver. The family had no idea that they were being watched and that's a pity. That's where the real thrill would have been. The shock, terror, disbelief etc would have made this film 10 times better. They died so quickly, not knowing what's been going on under their noses. There were parts in the middle of the movie that were dragged out and could have been replaced by a better ending. Was the mother pregnant? With the intruders child? Why did the son say his dad told him not to say anything? Disappointing watching movie and looking forward to the family finding out the horrific truth only to discover that they never do.","user":"shirinvawda","rank":[11,11]},{"title":"Boreman (2015)","rating":3,"date":"2 February 2017","review":"Zero originality whatsoever is to be found here.<br><br>Follows the mold of every single found footage stalker movie made just a little more oversimplified is all.<br><br>With a 30 minute plot (40 at the most) stretched out to 81 minutes and most scenes mainly being day to day scenes of the family doing regular things at home this movie is far more boring than it is disturbing.<br><br>The acting is... okay I guess, the family does act kind of like a family does. The stalker we only see from time to time and he's weird I guess, which makes sense.<br><br>I just looked at the credits and saw that Amy Smart was in it which surprised me, she was in it in retrospect but you couldn't really see it was here because she was only in one scene sitting by a table with the \"hidden camera\" being very far away.<br><br>So yeah if she is what makes you want to watch this don't bother. But then there is no real reason to bother watching this period.","user":"Seth_Rogue_One","rank":[8,8]}]