[{"title":"A Few Laughs, a Few More Bikinis","rating":3,"date":"28 April 2015","review":"A giant crocodile from \"Black Lake\" is captured by muscle-bound Stephen Billington (as Beach) and hook-armed Robert Englund (as Jim Bickerman). This is so a team of scientists can experiment on crocodile and snake DNA. The animals escape and begin to eat people. Six miles away, the attacks continue in \"Clear Lake\". Fish and wildlife officer Corin Nemec (as Will \"Tull\" Tully) from \"Clear Lake\" teams up with \"Black Lake\" sheriff and neighbor Yancy Butler (as Reba) to investigate...<br><br>This Syfy TV movie combines three concepts; we have the \"Lake Placid\" series, the \"Anaconda\" spin-offs and the \"vs\" match-ups. This story is not three times as good, however. This is average fare. \"A.B. Stone\" and writer Berkeley Anderson have the most fun with a couple of secondary items. First, clumsy deputy Oliver Walker (as Ferguson) is good comic relief. Second, there is a generous amount of screen time given to beautifully-proportioned young women in tight-fitting bikinis.<br><br>*** Lake Placid vs Anaconda (4/25/15) A.B. Stone ~ Corin Nemec, Yancy Butler, Robert Englund, Oliver Walker","user":"wes-connors","rank":[16,20]},{"title":"What in the absolute hell?","rating":1,"date":"21 May 2017","review":"I was a fan of the Lake Placid movies and the Anaconda movies ever since I was a young child. I absolutely adore reptiles, and I thought hey, the two are going to battle it out? What a movie this will be!<br><br>Well, I was wrong. I have never been so disgusted with the characters of a movie in my life. My absolute pet peeve for this movie though? The leader of the college girls group (whatever her name is). This woman is the definition of a b*tch. Not to mention the absolutely obsessive and narcissistic Mrs. Murdoch. I watch these movies because I love the creature action, but the characters make it that much harder to even enjoy the film at all.<br><br>So let's talk about the actual creatures themselves. The Crocodiles are no larger than perhaps 8 feet. A very small comparison to the original Lake Placid monster. The anaconda does not seem to eat any of the crocodiles, rather it simply squeezes them so hard that they explode. In one scene the snake uses its tail as a whip that cuts a crocodile in half. What on earth was that?<br><br>This is the first film I have seen that I KNEW would be a cheesy piece of junk, but I wasn't expecting it to be THIS bad!","user":"NerdBat","rank":[7,8]},{"title":"Speechless","rating":1,"date":"25 July 2015","review":"Watching this movie made me really speechless. It is not the bad script and cheesy lines that made this movie bad. It was the terrible acting from all the actors. You will have to watch this movie for yourself and be the judge to everyone's acting in this movie. It is amateur hour on screen, very stiff acting, terrible expressions and poor chemistry. When I saw the ratings on IMDb, I thought to myself 4/10 ain't that bad. So I told to myself why not give this movie a try, I knew what I was getting myself into, but never expect it to be this bad. Anyone out there who can give this rating above 5, you are definitely not watching enough movies or actually sober to give this movie a rating, or you are a dude just giving a high rating for the boob flashes in the movie.","user":"zackow","rank":[14,21]}]