[{"title":"Thought-provoking at times, but overall boring","rating":4,"date":"22 July 2019","review":"The best way to sum up this film is that nothing really happens. There's plenty of drugs, sex, swearing and vomit, but it's a lot less exciting than all of that sounds. I went to this movie expecting it to be raucous, shocking and funny. Instead, it just kind of dragged, with some thought-provoking moments that made you think about real life problems, but plenty of parts that were just boring. I didn't really enjoy this film to be honest, and I don't recommend it.","user":"pokemon_trainer_lucas","rank":[20,27]},{"title":"Sadly, did not really feel it ...","rating":5,"date":"14 December 2019","review":"So I get the point of this movie ,, girl gotta be her own self .. If she wants to be someone she's trying to be she should not be depending on a husband or a friend or whatever ... I mean cool idea .. not original though ,, didn't read the book ,, but I watched an interview once for Emma Jane Unsworth (the writer of ANIMALS the book) and she kinda gave a clear idea that she wants an all girl movie just because girl power ... which is amazing, don't get me wrong.. but apparently the book itself isn't that strong for this ...<br><br>The cast were okay though,, I like Alia Shawkat, she's like 30 now but she still has that funny quirky overstepping girl kinda vibes and she had a good back and forth with Holliday Grainger ,, anyway, the script, hence the book, didn't help but still the whole cast tried.<br><br>Anyway, this is not a good choice for a family movie night ,, but If you feel like there's literally nothing to watch ,, try to find some old DVDs you have or something, and if you couldn't then Aaah what the heck, you can watch it , who know's you might not hate it.","user":"Aktham_Tashtush","rank":[7,9]},{"title":"Slow and boring","rating":3,"date":"17 July 2019","review":"Went to see this after the trailers made it look pretty funny but i was disappointed. The movie was slow and dragged on with no surprises. It seems all the good bits were in the trailer. Unless you can connect with the characters this will be a drawn out movie you'll be happen what ends.","user":"apcyberax-18037","rank":[15,23]}]