[{"title":"Not entirely sure about this one.","rating":4,"date":"8 October 2017","review":"This is a difficult movie to review. It had both good acting and bad acting. Good visual effects and bad visual effects. Interesting story line and a boring story line. The start played out kind-a-like a 90s B movie and then it got better, then it got worse, then better, then worse.Christopher Lloyd appeared all of 10-15 minutes throughout. Tommy Wiseau said 1 - 2 lines...so giving them first billing is dishonest. Overall there were some OK scares and I Liked the bizarre imagery at times. Otherwise the story was a bit disjointed and the editing felt a bit jerky. It wasn't good enough to like, but not bad enough to hate. 4/10","user":"Leethal1","rank":[24,31]},{"title":"If you like 80s horror I think you might like this one","rating":8,"date":"18 October 2017","review":"If you want a movie with some chills and thrills I feel like this might be a movie you would be interested. in For a movie based in the 80s I feel like the movie hit on the campy style that a 80s horror movies had and this is coming from someone who really enjoys the horror/thriller genre. As someone who has read and enjoyed the book that this movie is based on I feel like the movie was right on with the source material. The movie gave many of the same chills that the book did and having watch it twice I found I really enjoyed the feel of it. While the plot line is not 100% exact I still found there were few plot points like character deaths that were right on. Now if you walk into this movie expecting the modern horror movie effects then yes you will likely be disappointed. But if you like the old school horror/thriller feel I think you will very much enjoy this movie. This is definitely a movie that I will watch again.","user":"nessapalmer","rank":[13,18]},{"title":"Cold Moon: Interesting but flawed","rating":6,"date":"16 October 2017","review":"The nice thing about Cold Moon is that it near immediately gripped me, this is a movie that got my attention early on.<br><br>Set during the late 80's the tale is told of a young murdered girl and her family seeking justice while the killer is besieged by terrifying apparitions.<br><br>The film looks beautiful with a decent cast including the living legend that is Christopher (Doc Brown, Uncle fester) Lloyd.<br><br>It delivers and is a very riveting interesting piece of cinema that thoroughly fell under the radar.<br><br>Sadly it gradually loses steam and when the vague and open to interpretation ending happens and the credits roll I was left finding myself sad that a few lose endings still remained.<br><br>Cold Moon is a decent enough film, I think it could have benefited from another 30 minutes to flesh it out but kudos to all involved for a damn fine effort.<br><br>The Good:<br><br>Very impressive cinematography<br><br>Christopher Lloyd<br><br>Great sfx<br><br>Genuinely creepy<br><br>The Bad:<br><br>Feels a bit incomplete<br><br>Inconsistent in its quality","user":"Platypuschow","rank":[9,12]}]