[{"title":"Doesn't Ring True","rating":2,"date":"21 December 2016","review":"Looks like so far among other reviewers I'm in the distinct minority here, as I felt this rom-com just didn't work for me on any level, and I felt it was just one mess of a movie. The dialogue came across to me as quite stilted and awkward and the characters just didn't ring true.<br><br>Cristin Milioti, whose appearance and demeanor reminded me of Sarah Silverman, portrays Sonia, who's in a long term relationship with Chris, played by Dan Soder. However, when Chris makes another attempt at proposing, Sonia is hesitant to accept, and thus they'll be a severe strain put upon their future together.<br><br>First time director and writer Sasha Gordon appears to also make a less than subtle attempt to switch gender roles here. The groom will be crying during the wedding ceremony, two men will be dancing at the reception, they'll be a male midwife, and there's a scene in Rome where Sonia allows a man she just met to shave her nether regions, which I thought was beyond the pale.<br><br>To note there were no subtitles on my DVD copy.<br><br>All in all, I see this film worked for others, but it definitely was not my cup of tea.","user":"larrys3","rank":[6,6]},{"title":"Quite good...but...","rating":7,"date":"6 April 2016","review":"\"It Had to Be You\" is a decent romantic comedy. However, despite my having a reservation about the plot (which I'll get to in a moment), I don't want to miss mentioning something really important about this film. The director and co-writer of the film, Sasha Gordon, is a successful composer for movies but has very, very limited experience in directing and writing. In fact, it's the first full- length film she's ever made...and I really think it's important to remember this. After all, with experience, I can only see her films getting better and better and this is an amazing film for someone with her limited experience.<br><br>The plot is what bothered me a bit about the picture...and it might be worse because I am a trained psychotherapist. The couple in the film probably never should have been together and the nice ending, to me, made the counselor in me want to jump up and yell \"Don't marry her!!!\". Let me explain more about this...<br><br>When the film begins, Sonia stumbles upon her boyfriend preparing for an incredibly romantic evening where he's going to ask her to marry him. Instead of staying, she sneaks out of the apartment and phones her friend to tell her how horrified and confused she feels...as she doesn't want to get married. Unfortunately, when she turns around, Chris (Dan Soder), happens to be standing there...hearing how his beloved isn't thrilled about marriage or his elegant attempt to propose to her. Naturally he's heartbroken but they soon patch things up when she convinces him that she just needs more time. Unfortunately, months later she still is ambivalent about marriage. She does love Chris in her own way...but Sonia seems to love her independence more. Chris, on the other hand, sees the writing on the wall and is ready to leave and find someone willing to commit herself to him completely. After all, he's 32 and wants to marry, settle down and have a family.<br><br>So here is my problem with the film. Although I loved the characters, the direction as well as most of the writing, it's a hard sell to base an entire romance movie on a main character as unromantic and commitment-phobic as Sonia. Plus, they both have the right to want what they want...but never should have stayed together. In real life, a marriage with folks like this would likely be doomed and is anything but romantic. It naturally makes the movie a bit of a hard-sell as a romance. Folks will enjoy the quirky dialog, situations and characters....but many might be put off because when a film features someone (man or woman) who doesn't want to get married, it just doesn't exactly sound like someone you'd want to see in a romance! So, in some ways the romance isn't very romantic..at least for more traditional and old fashioned romantics like me. But it does some lovely moments and a few laughs. Plus, the film still works reasonably well and when I learned that Gordon was new to writing and directing, I felt amazed! Not a perfect film but a worthwhile film nevertheless...and hopefully the first of many more feature films from her.","user":"MartinHafer","rank":[8,11]},{"title":"Best rom-com in ages and ages and ages ... Sally Hawkins comes to America!","rating":8,"date":"5 December 2016","review":"As a reviewer, I try to see as many films as I can and then I try to review them all.<br><br>Many of these are supposed rom-coms, or attempts at rom-coms, and although I have seen a large number in recent years, I cannot readily remember one as fluid or as entertaining or as well-written as this one.<br><br>Props to Director/Writer Sasha Gordon for putting together a project that, in its own way, competes with classics like Bridgit Jones.<br><br>And props to actress Cristin Milioti for finally bringing to American audiences the cross-Atlantic equivalent of a full-blown \"Sally Hawkins\" character. (Take a look at the wonderful Happy Go Lucky 2008 to see the similarities in the performances, camera angles, reaction shots, setups, and so on.) <br><br>Refreshing, breezy, thoughtful, and highly recommended.","user":"A_Different_Drummer","rank":[13,21]}]