[{"title":"Holidays: Mediocre","rating":5,"date":"8 January 2019","review":"I had such high hopes for Holidays, I adore horror anthology's and one featuring the writing of Kevin Smith and starring Seth Green and Harley Morenstein! Sign me up.<br><br>Sadly it didn't quite meet my expectations, and that is such a blinding shame.<br><br>You see horror anthology's are generally 3-4 stories and a wraparound, Holidays dismisses the wraparound and instead tells a whopping 8 short stories (Each one based on a different holiday).<br><br>This heavily reminded me of the ABC's of Death (2012) which was another horror anthology I was super excited for but turned out to be dire. That as well had a vast number of stories, different directors, writers and similar themes. Thankfully Holidays isn't that bad, but only because of a couple of the tales.<br><br>Truth be told several of the 8 are really bad and I mean really bad. They're the kind of shorts you'll see on YouTube that leave you scratching your head afterwards, unsure as to what you just witnessed and what the point of it all was.<br><br>Thankfully there are a few entertaining nuggets in there, some decent star power and sprinklings of charm. The stories range from weird, to gory, to oddly clever, but none exactly blew me away.<br><br>My pick would be Valentines Day as the most entertaining with St.Patricks Day being the worst...........or possibly Mother's Day.<br><br>Holidays on paper should have been fantastic but some disastrous writing near killed it for me, such a shame.<br><br>The Good:<br><br>Jocelin Donahue and Harley Morenstein<br><br>Solid visuals<br><br>The Bad:<br><br>Some really stupid stuff","user":"Platypuschow","rank":[14,14]},{"title":"Complete rubbish","rating":1,"date":"27 April 2019","review":"I've given it 1 because I can't give it 0. A woman giving birth to a snake and a Cross between Jesus and the Easter Bunny. Yes really! It just feels cheap and pointless. It's not even stories, it's scenes. Nothing is ever explained or finished. Everything is just pointless!!! Thank the lord this isn't something I bought!!!","user":"andynorton24","rank":[8,9]},{"title":"You Want Them All To Be Good, But They Aren't.","rating":5,"date":"22 July 2016","review":"Holidays does a few things right, and a lot of things wrong, and because of this, Holidays becomes a one time viewing. I don't ever see myself revisiting this flick intentionally.<br><br>Let me start off by talking about some of my favorite parts. Easter was a creepy highlight. But it didn't flesh anything out enough to make you care about it. This is a problem that almost all the parts have.<br><br>Christmas was my favorite part but it might just be my Seth Green bias. The ending wasn't as predictable as New Years, Valentine's Day, and Halloween.<br><br>Halloween was... stupid. And sadly, after Xmas, Easter, and New Years this might be my fourth favorite. You could tell it was Kevin Smith directing it. That doesn't help in my opinion.<br><br>New Years was actually a lot of fun, with 2 awkward characters. You could see the twist coming a mile away but that didn't stop me from enjoying it.<br><br>Valentine's, St Paddy's Day, Mother's and Father's Day all were lacking severely with the worst of them being Mother's Day. The ending was just abrupt and confusing. Father's Day had a lot of good build up to an awful ending. Valentine's Day really reminded of something out of Creepshow. Again it was predictable and the characters were way too over the top and just not believable in the slightest.<br><br>St. Paddy's Day had a lot of potential as it had a little girl who was seriously creepy. The ending was just bizarre and the whole build up was a \"WTF\" moment. It went from Day 12 to Day 366 in an instant.<br><br>All in all this was not a good anthology movie, nowhere near Creepshow or Trick r' Treat quality.","user":"BatesMT","rank":[14,18]}]