[{"title":"Awful with Fake Rating and Reviews","rating":3,"date":"5 August 2018","review":"IMDb used to be a serious site and an international reference for movie fans. Unfortunately since the last modification, IMDb has become a manipulative site with fake ratings (probably with the use of robots) and reviews (many of them with one or two lines only).<br><br>The boring \"Blue World Order\" is one of the worst movies of the adventure genre. The screenplay is a complete mess and the pace is absolutely inadequate for the genre. The poor direction associated to terrible performances make this flick an unbearable entertainment. However the IMDb User Rating (7.1) lures many viewers (including me). My vote is three.<br><br>Title (Brazil): Not Avaliable","user":"claudio_carvalho","rank":[40,46]},{"title":"How embarrassing","rating":3,"date":"12 May 2018","review":"What can I say about this movie? I am from Canberra, Australia, and this movie was filmed in the surrounding region. I get this is a low budget film, but did it really have to be this bad? I can only say I am embarrassed for the fledgling Canberra film industry.\nI'm not sure if it's worthwhile talking about the plot, but here goes. It more or less invokes 'On the Beach', with a nuclear war (I think) devastating the northern half of the world and people having to survive in the southern half of the world. The hero is Jake and he has to do some stuff to save his daughter. Billy Zane also turns up as a judo coach. Probably the most perplexing character of the lot is Stephen Hunter as Madcap. I'm not sure why the director chose to insert a hobbit in medieval clothes into this ostensibly science fiction film, but that's pretty much what you get. Another character in the film that is completely incomprehensible is Bolude Fakuade as Marion. I suspect both Stephen Hunter and Bolude Fakuade would be up for Razzies if this film even gets noticed anywhere other than Canberra. Canberra insiders will also notice the cameo of our loathsome 'chief minister' (or 'mayor' if you like), Andrew Barr. The great thing about his appearance is that Mr Barr is frozen, unable to move or speak: I wish that was the case all of the time. Just seeing Mr Barr frozen out was maybe, just maybe, worth the price of the movie ticket for this movie. I won't be buying the DVD though.","user":"andrew-53316-53896","rank":[49,64]},{"title":"IMDB should audit this movie´s ratings","rating":3,"date":"30 July 2018","review":"It is suspicious an evaluacion so high to a movie that we are able to grade it as a 4 film right from the trailer. Come on!!!. I am a fan of indie, trash, B movies. But I also know it´s not Apocalipse Now. \nI admire your fan base that was capable to achieve that amount of votes. Congratulations! Here in Brazil we did the same with an biography of a \"pastor\" that lured his flock to vote. Thousands elevated the ratings of that movie.","user":"vlacarvalho","rank":[26,32]}]