[{"title":"Dolph Lundgren vs. A Shark! Looks like Sharnado on 4 instead of 11.","rating":4,"date":"7 October 2015","review":"As a kid from the 80's growing up in Lundgren's prime, I still find the man massive on the screen, especially when he's not doing a movie that evolves other action heroes, which I have not seen him do in a while.<br><br>The big man plays a convicted wild life trafficker trying to make contact with his daughter who's being protected by a small town sheriff who took her in after he went to jail. Now it seems only Lundgren can stop a shark infestation happening on the lake they all live on. I make it sound more action packed than it really is. <br><br>It's the most original antagonist Lundgren has ever faced. It's too bad the special effects on his antagonist was so crappy or they could have really had something good here. <br><br>It tries to be Jaws but nothing can top that. It rips of Piranha 3D, but at least those movies are not trying to be something they are not.<br><br>Although Shark Lake did have it's fun moments, like a Steve Irwin type who hunts down fish for the BBC, it's funny for all the wrong reasons.<br><br>With that said, It does have a, so bad it's good, quality to it, and is worth watching just to smile at how horrible it is.","user":"subxerogravity","rank":[19,23]},{"title":"The Opposite of Jaws","rating":1,"date":"3 October 2015","review":"It amazes me that Jaws was made 40 years ago and its still the best shark movie ever made, even though effects have come a long way since then. While Jaws did everything right, this movie did everything wrong. With Dolph Lungren in this movie, I thought at least the special effects would be good. They are atrocious! The attacks are atrocious! The suspense is atrocious! And the acting is a bore! If I could have given a zero, I would. Totally forgettable.<br><br>One of the worst scenes was a shark barreling into the boat and the effect of water pouring in was laughable. Why did I waste 90 minutes of my life for this. Learn from my mistake and don't do the same.","user":"jamdifo","rank":[32,42]},{"title":"Mix the love part and a better horror element and maybe....","rating":4,"date":"19 November 2015","review":"My quick rating - 3,5/10. Really bad. I do appreciate the CGI swimmers against a underwater backdrop that has to be public domain video at this point. The movie is laughable to that level and the only shimmering glimpse of hope is the story? Did I really just say that? If you take away the stupid supposed horror element of normal sized bull sharks hanging out in a lake you actually have a somewhat interesting idea. The romance involves the dealer that sells exotic animals and something he lets lose in the water happens to have babies and is a shark. OK, dumb there, but when it is revealed for other purpose just seemed like the story warped two together since he did so to get back with his ex. OK, sounds dumb, but I saw a glimmer of hope, didn't say it was great. Either way, avoid this movie but maybe Jerry Duggan has something up his sleeve(if he hangs onto his screenplay writer) for something better.","user":"jackmeat","rank":[10,12]}]