[{"title":"A Western with Heart","rating":9,"date":"28 October 2017","review":"I love an underdog--who doesn't? With The Ballad of Lefty Brown, Jared Moshe gives the audience a chance to revel in what happens when a bumbling sidekick (expertly played by Bill Pullman) loses his left-hand man (Peter Fonda) and is compelled by love and honor to take revenge. The cinematography is gorgeous--think Andrew Wyeth landscapes at sunset--and the mood of the film remains true to its genre: pensive, a bit wild, and ripplingly tense. <br><br>The film succeeds most when it juxtaposes Lefty's incompetence with his determination. Lefty doesn't take action with grace and style like so many other Western heroes--It's just not in his nature. Even his friends think he's too incompetent to manage a ranch let alone outsmart some highly capable bad guys. Lucky for us, his tenacity reveals strength within a love that compels him to do what everyone around him thinks impossible. <br><br>As the film progresses, our desire to see Lefty \"win\" takes on a deeper meaning. Not only do we want him to succeed because justice is pleasurable to witness--Lefty's success is also proof that courage comes in all packages and that true grit reveals its own type of grace, one that is often overlooked when we dismiss those at the bottom of the pecking order. <br><br>The Ballad of Lefty Brown is a meditation on what happens if we stop worrying about our flaws and instead explore how we can work with them. Who knows, maybe one of our weaknesses could come in handy some day...","user":"jhphrydas","rank":[88,105]},{"title":"Bill Pullman is terrific in this slow moving but heartfelt film","rating":8,"date":"13 December 2017","review":"Pullman gives an idiosyncratic, detailed performance as Lefty. <br><br>Watch Pullman closely for only a minute or two, and then you will not be able to take your eyes away from watching his inspired acting in this wonderfully filmed western.<br><br>Needed more development between Lefty and his long-time friend Edward (Fonda) though - so we the audience feel the deep friendship as well.<br><br>Pullman as Lefty, in spite of his drawbacks as a simple, but well meaning ranch hand totally convinces us that heart, loyalty, friendship, and honor do indeed matter.<br><br>Never ever count out that person to do the right thing all the way to the end. <br><br>We would all be lucky to have a caring, determined friend like Lefty. - AVS","user":"DouglasHall","rank":[43,54]},{"title":"Pullman is a force","rating":7,"date":"6 November 2019","review":"Sooo....how have I NEVER heard about how incredible Bill Pullman is in this movie??? Everything else in the movie ranges from decent (visual beauty, solid drama) to downright bad (Caviezel, little kid), but Pullman...my God. He's a force.","user":"matthewssilverhammer","rank":[7,7]}]