[{"title":"A character study of living in (and beyond) the fallout of a void","rating":8,"date":"17 June 2019","review":"\"American Woman\" follows Debra, a thirty-something single mother in small-town Pennsylvania, whose young adult daughter, Bridget, disappears mysteriously. Debra is left to raise Bridget's infant son, Jesse. A volatile and reckless personality as it is, Debra does not take Bridget's disappearance easily, and finds comfort in her older sister, Katherine, who lives across the street from her. The film charts the family's lives together over the next eleven years.<br><br>One of the better dramas I've seen in recent years, \"American Woman\" is a well-written and evenly paced character study that follows a woman in the precarious situation of having her child go missing. Surprisingly, though, that is only halfway what this film is really about. The bulk of the script's weight lay in the fallout of the disappearance, and the ways Debra navigates life and raises her grandson.<br><br>In the wrong hands, this kind of story could easily go sideways, but the writing here is strong, and the performances are stellar. Sienna Miller brilliantly portrays the small-town wild-child mother who begins the film as a drunken, chain-smoking grocery store worker, and finds her in a much different state by the conclusion. The character arc is fraught with emotion, and Miller handles it beautifully. Playing counterpoint (also brilliantly) is Christina Hendricks, who has a softer presence as Debra's regimented, responsible sister. Pat Healy and Aaron Paul portray two of Debra's troubled lovers, while Sky Ferreira appears as Bridget, who is only in several scenes in the beginning, but whose presence haunts the film like a ghost. What is truly great about the film is that it captures human relationships in a manner that feels authentic; everything from the dynamics between the family members, to Debra's small-town ennui, to her various relationships with men feel true. If you aren't one of these people, you know one of them, and the slice-of-life nature of the film never manages to devolve into caricature or cliche.<br><br>Another surprise here is that the film is genuinely moving. The last thirty minutes contain several moments that are fraught with emotion, including one that had me fighting tears. I am not someone who tends to cry during films (in fact, it's only happened with one other), but the emotional thrust of the film snuck up on me without my really seeing it coming. Several reviews have complained that the film sidelines the missing person/crime plot in favor of exploring other components of Miller's character, but I think those people are missing the point here; this is not a \"missing person\" film, but rather a drama about people who experience having a missing family member. We tend to forget that the lives of families of missing persons go on, albeit under the pressure of the past resurfacing at any moment. When it does, it brings the audience to their knees as much as it does Miller's character. I think it precisely because the film follows this chronological, true-to-life trajectory that it manages to strike an emotional nerve.<br><br>As well-done as the film is, I unfortunately don't believe it will get the audience it deserves. It appears to have received essentially zero marketing, and has been quietly dumped in theaters at the beginning of the summer blockbuster season. The title is also a bit misfitting for the film, which doesn't help either. It's truly a shame, as \"American Woman\" is a moving, brilliantly-acted drama that finds human truth more often than many of its counterparts. 8/10.","user":"drownnnsoda","rank":[87,95]},{"title":"American Woman","rating":8,"date":"11 September 2018","review":"Gripping performance by Sienna Miller as a smalltown young mother / grandmother, coping with the mysterious disappearance of her teenage daughter and left to raise her grandson on her own. The film spans over many years and exhibits interesting character growth as life goes on. Christina Hendricks also delivers an excellent performance as her next-door sister, as well as the rest of the family. It's been awhile since I've seen a good drama and American Woman has delivered the goods. Best film I've seen in the Toronto Film Festival so far.","user":"ArtistGrl","rank":[64,75]},{"title":"Best film of 2019, well for me it was.","rating":10,"date":"4 September 2019","review":"Great story, great cast, and the best film I have seen in 2019 and I watch a few hundred a year. It surprises me the overall low score, and don't get it why people scored it so low, sure no action, no superheroes or vampires that walk in sunlight, just a well written drama that hooked me from the minute it started, the last 20 minutes gave me shivers.<br><br>Superb film 10 out of 10 and shame on those that scored it so low, or is it just an indicator of what the public deems a great film these days?","user":"DoNotTrustImdb","rank":[51,66]}]