[{"title":"Please Be Quiet.","rating":1,"date":"8 January 2016","review":"You know one day they'll find a way to write a horror movie that doesn't revolve around stupid people. I have a bad feeling about this. Nope let's do it anyway. We should stay here and survive. Nope lets go out and track down someone we know is as good as dead. Please be quiet, it'll hear us. Nope, let's keep yelling. Let's completely ignore every warning put in front of us and go blindly into danger. <br><br>No characters deserved death as much as these sisters. If that's what you could call them, I guess you can, since they were written way, I guess you have to. Please stop screaming and being as loud as possible. This just drove me crazy. they couldn't have died fast enough. <br><br>Terrible, terrible film. Watch at your own risk. Still better than the Poltergeist remake.","user":"sirchristo-447-951030","rank":[43,47]},{"title":"syfy movie is syfy movie..","rating":3,"date":"26 October 2015","review":"I watched another syfy production, around a year ago, Scarecrow, which I liked, the monster concept, the almost plot, acting the whole package got me curious. This one seemed to be a copy cat but I was wrong, really wrong.<br><br>The Hollow is a very weak movie, from a very bad script, to a director that couldn't do much, to actors that did not convince whatsoever, to plot holes and so many other things absolutely impossible to explain and so on, and so on. It got a 3 from me, probably its grade will be rounded up to a 4 and a little, but I honestly believe it deserves less. <br><br>We all know that syfy channel doesn't bring huge productions, but it is known to pleasantly surprise from time to time, yet right here, they looked like The Asylum. Bad all the way. The most absolute horror moves will be used in The Hollow.<br><br>Cheers!","user":"gothic-fiction","rank":[34,39]},{"title":"The shallow pit of horror genre","rating":3,"date":"3 November 2015","review":"Imagine a movie where almost every conversation start with random character sneaking up on each other and then followed by obnoxious shrieking, this is what Hollow has in store for you. It tries to invoke scare from out of nowhere, opening doors, dropping items and even people standing still are accompanied by startling sound effect. Coupled with rehearsed plot and horror clichés, this bottom of the barrel movie would net lowest score if not for its decent creature design.<br><br>This is the story of three sisters trapped in an island, their main role is to shout each other's' name literally the entire movie. The youngest one is the clairvoyance type whose hobby is running off towards danger, she's only there for sympathy bait and cryptic messages. The other two don't have much better character development either, they would bicker constantly, then panic and suddenly go into hero mode.<br><br>Other supporting characters are there mainly for unintended comedic purpose. They would deliver some backstory or advice, which the sisters would ignore, and these extras would die in the span of next few minutes. It's appallingly bad, not to mention these girls decide on the worst plan more than one occasion. The movie sometimes turns into clips of weird vision and it repeatedly plays out the same plot over again.<br><br>The saving grace is its creature and practical effect. The design is pretty well done, admittedly better than typical B-movies. Some effects for gore are also dauntingly brutal. The setting of small faraway town could create good atmosphere. However, these are not integrated well into the story, resulting in uninspiring use of said creature.<br><br>If you have seen the poster, you have seen the best part, the rest is muddled plot, utterly tiresome characters and unintentionally comical occurrences.","user":"quincytheodore","rank":[23,27]}]