[{"title":"Oh hello, helena bonham carter! Says, The Oscars...","rating":8,"date":"21 October 2018","review":"When I saw this movie, I didn't have an idea as to what to expect. I clicked it because I saw HBC plus, Hillary Swank... I mean come on, those 2? Who wouldn't be interested in a movie that has them as the lead stars... Ok so, Helena gave an award-worthy acting on this movie. She was impeccable! I couldn't say much about hillary because her acting here is just ok, her role didn't really bring out the best of her acting ability. All in all, you should see this film because of the powerful message it wants to convey! I highly recommend this.","user":"sammybuzz-45443","rank":[24,27]},{"title":"Courage with a capitol C","rating":9,"date":"9 April 2019","review":"I watched this movie with more than 65 Patients Rights Advocates at our annual CAMHPRA meeting. We thank you all for making the film, it reaffirms our passion for the struggle of Patient Rights and their Civil Rights\nThe Actors should be given awards and in my opinion big abrazos for protraying Eleanor and Collette and Mort (RIP we miss you so much). and for bringing to light an issue that everyone takes for granted.\nWe know the battle was long and heart breaking but we thank you for the end results. We may not always win but when we win our clients win big.\nPlease watch the film. Please support the mentally ill, we all break at one time or another and we need to support each other.\nI highly recommend this film\nGloria h/fresno","user":"iwapgh","rank":[8,8]},{"title":"Relationships, Communication, Compassion!","rating":9,"date":"18 October 2018","review":"This movie is nothing less than a gem. What makes it so compelling is that although the issues are clearly and boldly presented, we never lose our connection to the individuals portrayed. The balance achieved is rare. Also, Eleanor and Colette are such different women, but the evolution of their relationship is believable and astutely rendered. Above all, how wonderful was it to see a story about generosity, compassion and high ideals?","user":"patricia-beaury","rank":[12,13]}]