[{"title":"The best movie about murderous pastries you will see all year!","rating":7,"date":"1 May 2017","review":"This movie is stupid, but if you are even here, you pretty much know that. Its about donuts that gain sentience and kill people. Again, no surprise that this isn't Ben Hur. The acting is passable, the female lead Kayla Compton as a standout and is a better actress then this movie would suggest. I assume in 2022 after becoming a more mainstream actress and getting better roles, she will be teased for being in a movie with such a ridiculous premise. <br><br>Again, basing this review on you are already aware that this movie is about killer donuts, Im reviewing it as such. The cgi donuts murdering people don't look so bad, and are as believable as your desserts coming alive to kill you can be. Some comedy horror movies are actually devoid of comedy or jokes land flat. There's some solid laughs here too, if you aren't going to be too judgmental of something with rainbow sprinkles on it trying to kill you. I've seen a lot of b movies and turn 60% of them off halfway through. I got through this with some friends and had a good time.","user":"eboogyman2","rank":[28,36]},{"title":"Do-Not miss ( I really enjoyed) if you like b-movies .","rating":7,"date":"6 May 2017","review":"I saw this last night, I wanted too see something fun, silly, (after long week at work), this was perfect for me. <br><br>It was a lot better then I expected to be. ( unfortunately I have seen Rise of the Animals 2011, which was really horrendous bad, I seen my share of some really bad movies, with really low budget) and this is not one them, no were near. <br><br>However saying that, the budget is low, which dose show in places from the movie.<br><br>Like at the start, where the male lead, who I think looked a little to old too play his role, as for a time I thought his mum was is wife! ( that one of the down side).<br><br>I enjoyed the rest of it, there were some very funny moments, I laughed a number of times, some jokes did fall a little flat at times.<br><br>I enjoyed how the donuts attacked people, it was really well done, (it reminded me a lot of Attack of the killer tomatoes, Which I really liked) <br><br>Some of the death scenes were very creative and very funny, one of them will be very memorable. <br><br>The acting was okay, for this kind of movie, I have seen a lot worse (Backslasher (2012) which is UN-watchable) this is not!<br><br>I will definitely watch this movie again,( what the hell, I'm going to watch it again tomorrow) <br><br>I'm going to give this 7 out of 10 <br><br>Please let there be a sequel","user":"atinder","rank":[13,19]},{"title":"Good For A Few Chuckles","rating":7,"date":"3 May 2017","review":"If you enjoyed 'Return of the Killer Tomatoes', then this movie is right up your alley.<br><br>It's a fairly standard B-movie guys. Low budget. Bad acting. Asinine plot. Laughable production values.<br><br>All that being said, I found this gem of a flick entertaining for it's 98 minute run time. It had plenty of laughs and the CGI of the jumping and murderous donuts is hilarious to say the least. And people off-screen throwing the donuts to show them in pursuit? Brilliantly moronic.<br><br>I've seen B-movies that I had to stop after the first 20 minutes or so, they were too awful to watch even for the sake of trying to ironically enjoy a cheap movie. Not the case here. Sure it will never win any awards and is never destined to become a cult classic, but for this flick to remain fairly unknown is a pity. I, for one, was entertained.","user":"wilderunn-629-115567","rank":[13,19]}]