[{"title":"Too Contrived--Like a Soap Opera","rating":5,"date":"7 September 2017","review":"This film is beautifully shot with its cinematography of the streets of New York City. Also, the characters here are rich and beautiful and, at times, they'll be some clever dialogue.<br><br>However, I also found most of the characters here quite manipulative and shallow and lots of the scenarios came across to me as contrived, like a soap opera in other words. To note, this is an adult drama, with some sex scenes, explicit references, raw language, and on screen drug use.","user":"larrys3","rank":[7,7]},{"title":"Chronically Metropolitan is the new Tragically Hip","rating":20,"date":"20 June 2017","review":"Everything that happens in this film is right off the \"indie quirky cute funny sad happily ever after wealthy dysfunctional family drama\" checklist.<br><br>While the story line is unfailingly familiar, the characters are played by mostly engaging actors and the film doesn't bog down in any one place for too long so you are able to watch to the end without getting bored or surprised. <br><br>This film was described in one blurb as clever and cynical, and maybe it was back in the '70s, but now it's just tame and typical.","user":"smoke0","rank":[21,28]},{"title":"Uneventful plot with lethargic performances","rating":1,"date":"1 September 2017","review":"This film tells the story of a young writer, who goes back home to New York to find that his dysfunctional family is falling apart. To top that up, his ex-girlfriend that he cannot get over with is getting married to another guy in a few days.<br><br>\"Chronically Metropolitan\" is basically a showcase of how not to make a film. The plot is boring and tedious. It is just plain and uneventful. Camera work is really plain as there are many long shots showing conversations, and this would have been broken up to close up on the speakers in other films. The point of view for the viewers is almost like an passive bystander, without any engagement with the characters or the situation they are in. The actors are mostly devoid of any emotions, as they sleepwalk through their roles, delivering lines in a passionless and lethargic manner as if they were kids being forced to read texts reluctantly. The only exception is Josh Peck, who at least muster smiles and look energetic in his role. If not for Josh Peck, the film would have been completely bad.","user":"Gordon-11","rank":[11,14]}]