[{"title":"Nepotism Is The Word You're After","rating":5,"date":"6 June 2015","review":"What attracted me to this film was the name Robert Duvall , who is almost certainly America's greatest living character actor . Add to that he also directed WILD HORSES so this looked like a film worth going out of my way to see and while not being a complete waste of time I expected better <br><br>In reply to my fellow IMDb peer Arfdawg I agree the actress playing the lead Texas Ranger is rather dreadful . The actress birth name was Luciana Pedraza and is now known as Luciana Duvall . I guess that answers a few questions doesn't it ? Despite having a few other well known names in the shape of Franco and Hartnett most of the story is told via Pedraza/Duvall's female Ranger and she's just not a good enough actress to carry the film and gives a very wooden and stilted performance which becomes annoying . On top of that the film moves at a very slow pace which made me think the director was copying wholesale the Coens' style from NO COUNTRY FOR OLD MEN . Unlike that film WILD HORSES is far from compelling and feels like two separate stories , one featuring a crime drama and one featuring a angst ridden family drama stuck together in a rather unsatisfying manner and means we're left with an unsatisfying film","user":"Theo Robertson","rank":[35,47]},{"title":"I honestly couldn't finish the film","rating":2,"date":"8 June 2015","review":"Having watched nearly all of this last night i felt i should air my opinion lol for what its worth, Having Franco,duvall,hartnett splashed all over the movie cover i though wow thats a great bunch of actors! But there was something so rotten that it killed off the quality that those actors brought to the film....Luciana Pedraza... Oh dear shes terrible. totally ruined the film her slow speech and her wooden acting killed this film for me. also the kid that played her son looked so uncomfortable it was making me cringe. just watch the first scene at the BBQ lol so bad. The fight scene outside the bar was a farce. Sorry but what a stinker.","user":"pltb","rank":[32,44]},{"title":"Two Stars","rating":2,"date":"6 June 2015","review":"Bad directing. The first thing you notice is too much time between actors giving their lines to each other. I hate that. Duvall's wife can't act. English isn't her first language and may have a small part to do with that, but she rubbed me the wrong way right off the bat. Did not buy her as a ranger and her delivery was too slow as well. Duvall himself made me anxious because of his breathing. He seemed to be straining for each breath, yet lights up a cigarette, cause that's what cowboys do! Did he also allow himself some ad libbing here and there? Scenes were choppy. Fade to black then start up again without any smoothness whatsoever. James Franco is a great actor and besides Harnett was the only one worth watching. I kept wanting to give up so many times watching this but stuck with it.","user":"judyjholland","rank":[44,64]}]