[{"title":"Great","rating":10,"date":"23 February 2020","review":"In this 2nd installment of John Wick, the stylish visual and hard core action returns twice the level of the first film. So prepare for another suspenseful and cliffhanging sequences flow from this action movie when you watch this. The story goes deeper and the action scenes were incredibly entertaining! The revenge theme was still part of the movie's plot but this time the focus is the personal backstab of Wick. Keanu Reeves delivers again a notable performance as a titular character. This film is what a sequel movie should be - justifying the connection to the predecessor movie that made it successful by expanding its story and maintaining the elements that made it a superb film. The ending of this film opened the possibility of many more franchise of this movie.","user":"MR_Heraclius","rank":[43,48]},{"title":"Huh?","rating":2,"date":"31 May 2019","review":"Where to start... Apparently everyone is an Assassin, yet cannot shoot to save their lives. Only John Wick can shoot people like that. In the head. At will. The movie also gives off this weird James Bond vibe with all the different guns and suits John Wick can have just for asking for them. And I guess there are no police or anything around EVER when literally 100's of people are getting shot and killed with impunity. And people are just walking around like that's totally normal. Way far fetched, and waaaaay too over the top for words. Ridiculous.","user":"jtab-10108","rank":[102,150]},{"title":"Nobody fears John Wick anymore...","rating":3,"date":"12 February 2017","review":"Sin 1: Tossing out established canon.<br><br>The coolest bit of lore about the first movie is completely lost in the sequel. That alone is a sin you cannot redeem yourself for. In the original, it was established canon that John Wick was not a man to mess with. Even the main villain, respected and feared his abilities.<br><br>In John Wick 2, however, all of that is gone. Nobody fears John Wick. Nobody is afraid to take him on. His past deeds and reputation mean absolutely squat.<br><br>The new villain, never thinks twice about double crossing Wick. Every hit-man on the planet, and according to this movie they are every where, has no qualms about trying to take Wick out.<br><br>Sin 2: No main character growth In the first movie, we travel along with Wick as he avenges his dog and in the end moves forward with his grief. The video of his wife tells him to get up and move on. In John Wick 2, there is zero character growth. He is no different at the end of the movie as he is when it starts. Sure his circumstances have been altered, but as a character he has overcome nothing. That makes for a boring story.<br><br>Sin 3: Weak plot The original movie had a simple, but strong plot. Revenge. The plot of the sequel is weak, even by action movie standards. Wick has been called into service to kill a criminal, if he refuses he dies... but wait if he accepts, he also dies. The whole movie could have started and ended with the original premise of refusing the contract. It would have made more sense to refuse the contract and fight off the baddies coming to enforce the blood oath.<br><br>Sin 4: Video Game Bad Guys Wow. There is evidently a plethora of John Wick cannon fodder. They just keep coming, and there really is no logical reason why they do. The body count is so high that it becomes comical. The original had a big body count, but it was divided among 5 big action scenes and, for an action movie, seemed plausible. This one doubles the body count but there are so many, the coolness of each kill is lost in an over abundance of victims.<br><br>Sin 5: Invincible Superhero Hit by two cars, stabbed and shot numerous times and he just keeps on going. Must be seeing the doctor and getting pain pills, right? Nope no doctors in this one. That kind of logical realism may interfere with the killing of cardboard bad guys. At one point a fellow assassin, holds a pistol point blank in Wick's abdomen and fires a couple shots through him. No biggie Wick has another 42 bad guys to kill.<br><br>Sin 6: James Bond Gadgets I love the Continental, don't get me wrong, but the secret underground hit-man hosting hotel just goes too far in this one. Bulletproof suit coats that can be held up like Batman's cape to shield yourself from bullets? Silencers so quiet that two adversaries can have a shootout in a subway between bystanders and nobody knows even though bullet holes are being blasted into the walls around them? <br><br>Sin 7: Shallow Villains Yes there are the 140 plus cardboard video game baddies, but in the first John Wick, the main villain had a moral dilemma: turn over his son to save his own butt. The bad guys in Wick 2 have no interesting character motivation or dilemmas. The closest you get is Common's desire for revenge after Wick kills his client. And that was the most interesting bad guy on the screen. It is hard to believe the two movies were written by the same folks.<br><br>Sin 8: Soundtrack John Wick 1 had an unbelievable soundtrack that actually set the mood as he moved through the action scenes and the emotional scenes. This soundtrack just plain sucks. There is nothing memorable in it, and it does little to impart any emotion on a given scene.<br><br>Sin 9: Pacing Even the big action scenes in this movie are too long. In their desire to up the body count they went with longer action sequences. It really messes with the pace of the film. The first movie did a great job of dividing the action and keeping the viewer engaged. The longer these scenes go, the less believable they became which pulls the audience out of the moment.<br><br>Sin 10: Rehashing things that worked in the first movie There are some great scenes in the first Wick, and the director knew that so they tried to repeat them. This is a classic sequel mistake and unfortunately Wick 2 falls victim to this trope. You liked the interaction with Jimmy? We will get another one in there. Like the reload and kill? We will put a twist on that one also. It was great to see the pencil kills, that is how it should be done. Don't show us the same thing but different. Show us new, that may have been mentioned previously.<br><br>Making the next sequel look better then this one. The end of this movie sets up a very interesting plot for a third movie and almost everyone that walked out was excited to see it. That is wonderful, except when that movie actually sounds more interesting then the one you just watched. You should have just made that movie instead.<br><br>All in all Wick 2 falls short of the first one. Once again we are treated to an amazing movie whose sequel just doesn't capture the magic of the first one. I'm looking at you Red 2, Donnie Darko 2, Matrix 2, etc...","user":"offers-99264","rank":[802,1]}]