[{"title":"There are limits...","rating":3,"date":"7 November 2016","review":"I appreciate a pretty wide variety of films. I wouldn't call myself an indie junkie, but I like creativity that gets me to think or be aware in a new way and indie can certainly do that. Of course, sometimes aspects of a film will evade me (what was X about? what did Y mean?) and then I seek out others--and IMDb--to fill in the gaps.<br><br>I have to admit, I left this film lost and unsatisfied. Too MUCH of it was a gap for me. Sure, I had some basic insights: how the normal-ness of life is worthy of attention and how the painful constancy of loneliness exists in so many lives. The acting was good. I found the long pans and the \"un-action\" movie action interesting. At least for a while. But by about halfway, that was it. Those insights just repeated themselves. I spent the second half hoping for something to shed light, to at least tie some loose ends together. But it never came.<br><br>And it wasn't just me and my friend. As we sat in the emptying theater after the movie, discussing our thoughts about it, an elderly lady shuffled out behind us and said, \"I don't mean to blow my own horn, but I have a Ph.D. in English Literature. And STILL I can't figure out what that movie was about! Do you?\" So it wasn't just me.<br><br>This is all I can conclude: This film slowly detailed 3 vignettes, suggesting there was something being told. Then it had nothing to say. Maybe it's a Zen thing. But it wasn't a satisfying experience for me. The stories came out of nowhere and went nowhere, albeit with some beautiful scenes and emotions presented along the way and excellent acting. When it was over, there was no \"there\" there for me. I think that's what left me feeling unsatisfied. It was like a pretty mosaic left in pieces. I can infer that someone formed a design with it and I want to see that design. But it's in pieces and, try as I might, I can't put the pieces together. In fact, it feels like some pieces are missing. So I walk away baffled.<br><br>Maybe this says more about me than this movie. Whatever the case, I walked away unsettled and not in an enlightened way. That didn't feel good.","user":"eyasta","rank":[113,154]},{"title":"Lugubrious plot and stillborn character arcs sink this Montana themed triptych","rating":3,"date":"3 December 2016","review":"Kelly Reichardt wrote and directed this triptych of a screenplay set in Montana, based on a collection of short stories by Maile Meloy. Reichardt is known for slow-moving plots and prefers character studies to fill out her often lugubrious narratives. In each of the three segments that constitute Certain Women, Reichardt's protagonists are women who attempt to maintain a quiet dignity despite being stifled by people devoted to blocking their self-actualization.<br><br>In the first segment, Laura Dern plays attorney Laura Wells who is unable to shake off disgruntled client Fuller (Jared Harris), who seeks to re-open a civil suit but has been informed by both Laura and her attorney colleague that he has no legal leg left to stand on. When Fuller takes a security guard hostage at his former place of employment, Laura is called in by the local police to act (in the unlikely scenario) as hostage negotiator. When Fuller lets the security guard go and asks Laura to give him a head start as he scurries out of the back of the building, Laura immediately informs the police of Fuller's whereabouts, and he's placed under arrest.<br><br>In the second and least successful of the segments, Michelle Williams plays Gina who is married to Ryan (James Le Gros). Gina is constantly annoyed with her husband who appears to indulge their rebellious teenage daughter. Gina has placed herself in charge of building a new family home out in a rural area—all she has to do is convince Albert, an elderly family acquaintance, to part with the sandstone on his property which she would like to use in the construction of the new home. Albert tentatively agrees to selling the sandstone and soon afterward, Gina's workers come to take possession of it. But when Gina waves to him as her stares out the window from his home, he doesn't react. Did Gina intimidate him into doing something he didn't really want to do? This is perhaps the only real ambiguity in Reichardt's \"what you see is what you get\" narrative.<br><br>The third segment features Jamie (Lily Gladstone), a young Native American ranch hand, who stumbles upon a continuing education class on educational law taught by attorney Beth Travis (Kristen Stewart). Beth amazingly travels four hours each way to teach the class and Jamie ends up taking an immediate liking towards the moonlighting attorney. Soon afterward they go out to eat a couple of times at a greasy spoon but eventually Beth fails to show up at the class, much to Jamie's chagrin. Jamie discovers that Beth stopped teaching because she could no longer tolerate the travel time.<br><br>Jamie decides to make the four hour drive to see if she can find Beth. When she finally tracks Beth down, they have a brief conversation but nothing comes of it. Lonely Jamie makes the trek back to the farm. End of segment.<br><br>Certain Women is very loosely interconnected by a few plot strands. Laura has been having an affair with Gina's husband, and Beth happens to be employed in the same building where Laura works. <br><br>If you can't stand lugubrious plots, Certain Women is an immediate \"no-go.\" In terms of character development (the area where Reichardt is supposed to shine), that part of the narrative is also exceptionally weak. None of the three protagonists has much of a discernible internal arc, except maintaining the aforementioned \"quiet dignity.\" One wonders what to think of Laura and Gina—their egos are intact and they seem to accomplish their goals—despite the obstacles put in their way (in Laura's case, it's resolving her \"bad client\" problem; with Gina it's consummating the sale of the sandstone and moving ahead in spite of her husband and daughter's \"bad attitude\"). Yet nothing much happens except for the quiet satisfaction of weathering a few not very dramatic opponents.<br><br>The case of Jamie is a bit different. She's the only protagonist who doesn't get what she wants, and is perhaps the only \"sad sack\" of the three. Sad sacks unfortunately don't make for good drama so when Jamie arrives back home, we're forced to revel in her failure.<br><br>If you must see Certain Women, see it for the plush Montana landscapes and the capable acting on the part of the principals. Unfortunately, good parts for women in the cinema today remain hard to come by. Certain Women certainly fails to contribute to such a pantheon.","user":"Turfseer","rank":[45,64]},{"title":"2 hours you can't get back.","rating":1,"date":"25 November 2016","review":"When I saw high reviews for this, my wife &amp; I settled in to be entertained. So we waited, and waited...being from a small town I thought perhaps I could relate. Not many people will \"get this\" movie. Follow 3 small town people around for a day or two. Exciting? Not at all. Something's gotta happen soon!.....end credits. Pretty much every day life for some of us, nothing exciting, as much drama as watching the neighbor let the dog out...and sometimes that's more interesting than this film was.<br><br>Apparently this is one of the director's best works. I'll dust off the cobwebs, and skip those other movies as this was a complete aimless bore. Just one opinion from a speechless movie fan that was waiting to be entertained and would have had more fun watching paint dry. The only people that will find this compelling &amp; entertaining (you have to be pretty damn desperate) is someone who has never lived in a small town, or the Mid-West, and then you probably won't understand it. To think money was spent producing such an empty plate, is beyond me.","user":"superoldies","rank":[54,81]}]