[{"title":"The young arctic couple and their adventure.","rating":7,"date":"13 October 2017","review":"It was another film about life in the Arctic. That's wrong! Surely it sets in the Canadian Arctic region, but it was much more than a simple drama. As the story progress, you would come to know the depth of the film. It does not expand, but the characters become stronger. With unexpected twists and turns, the narration heads to the other end.<br><br>From the director of 'War Witch' that nominated for the Oscars. What you learn from the title is about three persons, but there's a fourth. The father of one of the lovers. Except in the initial stage, the film is all about them. The young couple in a remote frozen town begins to witness their relationship breaking away because of one of them leaving the town very soon. With a brief breakup, they mend it up and then decides to face any obstacle together. Hence the adventure begins.<br><br>The financially struggling couple, plans to overcome the situation by taking the snowmobile to reach their destination. It was not an ordinary road trip you had seen in other films. In a vast deserted land, you never know what might happen any time. Till now it was a casual drama like that happen in anybody's life. But their trip brings to the film a different tone. The adventure with a little thrill. When they are about to catch in an unforeseen blizzard, they take a shelter in an unusual place. After that, everything is about to change for them forever.<br><br>There's nothing is the story. It was like someone's real life who are in the relationship and their daily activity. But the adventure changes everything. A perfect atmosphere to give away the secrets. Most of you would have already guessed it, though what it reveal, the way it reveals was good. Makes sense, every doubtful event that occurred before. But it was not designed to keep everything suspenseful for its viewers. So that makes us acceptable the film being what it is.<br><br>❝If you hurt yourself, you hurt me.❞<br><br>Indie films are commonly small budget, but it was good enough to enjoy quality. It was not anything about the environmental issue or the Arctic people's struggle. It was just a young lovers tale. Once I have got confused between literal and metaphor, what the film is actually trying to tell. With being a bear on one side and a trouble giving father another, I anticipated some kind of brief flashback to explain the stuffs. But that was never required once it opened up all in a straightforward narration.<br><br>This is a beautifully written film. For a small film, they really had some tough time shooting in a tough conditions. The locations were breathtaking. Especially in the second half. In those parts, many scenes were totally unexpected, contrast to the first half you have got used to. That change makes the film very interesting.<br><br>Apart the overall film, the end was decent. I don't think everybody would be happy with that. Even I was not sure, I'd liked the film or not after seeing that kind of conclusion. Something is sure that it might not be a perfect cinematic end as we're used to, definitely that's one of the possibilities in real life. If the end would have been compromised to satisfy its viewers, then the result too would have been much better. But I think the unusual and unexpected ending is much better than a cliché, any time.<br><br>Both the lead actors, Dane DeHaan and Tatiana Maslany were very good. The characters were not challenging, but the performing in the given tough conditions were. The entire film was about them, where the other characters come only for a very brief. It is worth a watch for them, despite it might not be their career best. They are being a couple on the screen is what striking the most. Because what you had thought about them, against the transformation of their roles in the next half, spices up the story.<br><br>I have heard that they had used the real bear. I wondered how they did it being made on a tight budget. Simple and cutely done. Initially I thought it could be a fantasy. But that's the point the story had to hold back for the later part. This is one of those films gone unnoticed. Not every film has to be top notch. Telling the same story in a different atmosphere using its resources could work out sometime. Whatever. The film was not the bad for why it was ignored so far since its release. People not aware of its existence could be the reason and turning it down after seeing low rating. But I think if you are looking for a refresher from the regular cinema, this is the one to go for.<br><br>7/10","user":"Reno-Rangan","rank":[7,9]},{"title":"A different kind of love (story).","rating":7,"date":"21 February 2017","review":"I can't believe I'm the second one to review this. <br><br>When I started watching, I didn't know what to expect. I wasn't quite familiar with the two actors. DeHaan I knew from some supporting roles. Maslany's mostly known for her role on Orphan Black. A show I chose not to watch because I didn't like the clone angle. <br><br>Essentially this is a story about two people (lovers as it says in the title) spending their days near the Arctic circle, trying to leave their past behind them. A task that proves almost impossible as the story unfolds. Darker than expected.<br><br>And yeah, there's a bear. Sounds not that compelling? Well, I was pleasantly surprised.<br><br>The film depends very much on the actors' performances and, to my surprise, they didn't disappoint. The chemistry is very much OK. Direction is quite good too. I think I'll watch War Witch next by the same guy. 7.3/10","user":"sanjin_9632","rank":[13,21]},{"title":"Amazing film well deserving of festival awards","rating":10,"date":"19 September 2016","review":"This was my favorite film from the 2016 Cannes Film Festival; and a must see. The entire audience loved it and it was shown in what was likely one of the largest theaters I had been in prior to Cannes. The plot and shots make it seem very Canadian, but it is a great film and should be watched by everyone. <br><br>It is well written, directed and the cast does a very good job. The cinematography is great and does a good job at immersing the audience in the story.<br><br>The director is now one that I will follow.<br><br>Thanks for making such a wonderful film.<br><br>Go check it out!","user":"dperrierus","rank":[35,71]}]