[{"title":"Brilliant in its simplicity.","rating":8,"date":"17 March 2018","review":"After hearing of one of my favorite actor's, Anton Yelchin, passing - I was devastated. I wanted to watch what he had left to be seen beyond his death, film wise.<br><br>This was the final movie he filmed before his passing and I was just now able to view it, after wait almost two years...<br><br>It is a simple glimpse into a single night, shared between two lovers. It gives a view from each perspective, both before and after their passionate night, and shows how a single night can leave a lingering effect on the heart and soul. Some loves are meant to last and some, like theirs, never gets to live beyond a night. There are no special effects, CGI, or drawn out plot points, which is why this movie communicates more in its hour and ten minute (not including credits) than the standard Hollywood fare. <br><br>Created on actual film stock vs. the standard digital format, it gives it a more timeless feel and gives it more warmth. Not to say this is a warm movie - it is heartbreakingly beautiful in its tone and content.<br><br>As a fan of Richard Linklater, it reminded me very much of Before Sunrise, but without near as much dialogue. It is also works well as a final goodbye from a tremendously talented actor, who was taken from the world way to soon.","user":"jonvansickle-227-428631","rank":[15,16]},{"title":"Raw, real and beautiful - a real meeting for real people","rating":8,"date":"9 June 2017","review":"Honestly, I am very glad someone made this film in a time when love-movies seem to have everything except love. It's one of those films that lives with you long after watching it. Because it is raw, it feels real, it is deeply sad and simply beautiful. But it is definitely not for everyone. Porto is that kind of film only those will really appreciate who had something similar in their lives. A very strong connection with someone that lasted just a brief period of time. A week... maybe only a night. <br><br>It is shot on film, and looks fantastic, it feels poetic though it is never over stylised. <br><br>It shows love and connection in a painful yet very elegant and poignant way. The peace is slow, the atmosphere is strong. A truly independent and \"human\" film. <br><br>It doesn't show anything new, it might be a bit too simple - but its honest approach makes it absolutely watchable. For those who have ever really loved someone, and then they said goodbye - it could be an important experience.","user":"blzs","rank":[24,30]},{"title":"states of memory. or states of soul","rating":9,"date":"26 February 2018","review":"I admitt - I saw this film especialy for Anton Yelchin. and this motif whas enriched by each scene. because \"Porto\" is a love story but so special, poetic, delicate , unconventional, old fashion, fascinating, lirical , than it is more than one of many stories about love. because to defines it as an old fashion love film is wrong. it is a subtle, precise and real rare exploration. of yourself. old romancies. people across your life. links who, after decades, remains unique and precious and defining everything from you are. \"Porto\" is a story about states. as magic expressions. and it is enough. for write a deep trait. in your memory. sure, like others films in which Anton Yelchin gives admirable roles.","user":"Kirpianuscus","rank":[11,14]}]