[{"title":"Poorly Done","rating":3,"date":"23 November 2019","review":"The idea behind this movie isn't bad but the video and audio quality are very poor, the dialogue is terrible, the acting is quite amateurish and all the horse scenes (only a few short ones) are very pitiful. The other review is right, if a bit cruel. I think they just had no budget at all to work with. Skip this one unless you have to see every horse movie ever. Also I'm not sure why my copy was called \"A Horse for Christmas?\" To market the movie and trick people into buying it at Christmas time? It really has nothing to do with Christmas...","user":"gregberne11","rank":[0,0]},{"title":"Cant even be a students project","rating":1,"date":"19 August 2017","review":"This is literally the worst crap ever written, acted and filmed on this planet. It's worse than Birdemic. It really is.<br><br>I've been suggested this movie in German with 8,6 stars on IMDb, which is a load even for high quality movies with top actors. A glance at the low budget and low self esteem cover made me wonder how this could be a good movie, but... I gave it a chance. And I was... I can't even express how wrong I was.<br><br>Starting with the fact that it is a horse movie, but in the about three short riding scenes nobody ever rides any faster than a baby on a tricycle could (I mean it. No Trot. No Canter.) There is only the smallest hand full of actors because one couldn't afford walk-ons. Which is fine! Fine! You got a good story, good scenes, god cameraman, let's keep it clean! But this script must have been written by someone that hasn't even written a children's poem before.<br><br>The absolute greatest, greatest moment of the film was, when they could not afford filming the main character taking a real jump, so they cut a scene of a professional riding event right into the movie. Just like that. No photoshop involved. Just like: \"Yeah sorry as you know our main actor can't ride and we can't even afford a real upright, so, yeah, here, have a foto of how we imagined that scene in our heads, and now back to business.<br><br>Plus - the \"top special sport horse\" in that movie was really only a fat pony.<br><br>The plot was the worst family drama I have ever seen, told in the worst way I've ever witnessed, and now I'm so heartbroken over the 88 minutes of my live I have lost that I need to get drunk. Enjoy the movie! Would love to hear other opinions. Let's make it a drinking game.","user":"lisa-885-717122","rank":[1,2]}]