[{"title":"Triumph of Talent Over Budget.","rating":7,"date":"22 February 2020","review":"If this film can say anything, it says that with a heart and dedication many can be achieved! It tells the story of 3 scientists who seek the answer to one of the oldest known questions of man kind...Are we alone ?<br><br>It's not your typical first contact film, it's a film about friendship, about losing, gaining and bonding. The film was made a lot of heart and passion, the plot was clearly studied, the CGI was sufficient when needed and the performance was adequate by all yet I believe the main challenge was placed on directing as to how hold the audience attention for over 2 hours with a story line which based mainly on 3 characters and I believe this was achieved smoothly in the most parts, I'd only take few things on the movie like the lights was a bit over used in some scenes and unrealistic sometimes, yet over all Cosmos is a great sci-fi flick for fans of the genre who mainly seek a movie with a story.","user":"Impartial-Critic","rank":[41,50]},{"title":"Don't listen to the haters.","rating":8,"date":"9 November 2019","review":"This movie was really good. A lot of talking, but if you are one of those people who love looking up at the star at night, always hoping to see something, then you will really love this movie. I always wanted to do this as a job, but I messed up in school.","user":"k_frend","rank":[63,85]},{"title":"Great Flick, Awesome Look from another view","rating":7,"date":"9 November 2019","review":"First of all, Cosmos is a masterclass on low budget high production value.\nIt's awesome seeing what they talk about from a whole new view scape.\nYes it's not paced to the best of it's ability and some time could be cut out easily, but once things finally kick off, it's actually a great Flick with some heart pounding scenes.\nThey have obvious influences and wanted to set a tone based on those influences, and I think they nailed it.\nDefinitely worth a watch especially for any space lovers.","user":"wlwhited9","rank":[53,71]}]