[{"title":"*uckin' awesome movie. Not your regular Bollywood trash. Strong, realistic n brilliant acting by Mr. Devgan.","rating":10,"date":"31 July 2015","review":"I thoroughly enjoyed this movie inspite of seeing the Japanese movie not the novel. Ajay was brilliant. He got into the skin of the character. He looked like an ordinary guy. He lost all his muscles. Even the kind of shirts he wore with full sleeves did justice to the role. Tabu acted well too. I think she should settle down as she was looking old. The movie is something very different from your regular Bollywood trash. I have seen many Korean, Japanese, French, Hollywood thrillers. And drishyam was a good drama/ thriller too. I am *uckin' fed up with majority Bollywood stars and movies. Even if the script doesn't require, the hero is showing off abs and dancing skills. Majority of 'em is filled with vulgar item songs which is getting monotonous. People who enjoy thrillers should check out the treatment, confessions of a murder, bereavement and malevolence, marshland, poker night, 13 sins, the secret in their eyes, the shrine, freeway killer, ittefaq (borrowed from signposts to murder ), adam green's spiral and frozen, the keeper of lost causes, cell 211. People who expect item songs, hero bashing goons ala matrix style action, hero showing dancing skills, hero flaunting abs, the same *uckin' monotonous Bollywood obnoxious films should be with care before watching this film.","user":"Fella_shibby","rank":[104,127]},{"title":"Edge-of-the-seat thriller with surprising twists and turns","rating":9,"date":"31 July 2015","review":"Casting – 4/5<br><br>Acting – 4.5/5<br><br>Story – 5/5<br><br>Screenplay – 5/5<br><br>Editing – 5/5<br><br>Cinematography – 4/5<br><br>Background Score – 4/5<br><br>Wow, finally a good thriller movie after a long time. Drishyam is a remake of the Malayalam movie by the same title.&nbsp;The movie is nestled in a Goan village, the kind where everyone knows one- another. The protagonist is a middle-class Goan&nbsp;Vijay Salgaonkar( Ajay Devgn) for whom his family's well being is paramount.<br><br>Ajay plays the role of a 5th class school-dropout who runs a local cable-service provider shop. He is a big movie-buff and spends most of his time at work looking at the motion pictures. &nbsp;<br><br>Vijay has a cozy life with his wife Nandini(Shriya Saran) , elder daughter( Ishita Dutta, 'Poonam&nbsp; from Ek Ghar Banaunga'&nbsp; &amp; Tanushree Dutta's sister) and younger daughter(Mrinal Jadhav).&nbsp; The coziness of his family is shattered one night following an offhand chain of events.<br><br>Vijay's character development is myriad throughout the film and it compels you to think away from the extreme principles of black vs white,&nbsp; right vs wrong, yin vs yang.&nbsp; His strong will and steadfastness to protect his family at all costs forms the backbone of the story.<br><br>The unfateful night's chain of events leads to a massive police search headed by the stern and steely IPS Meera Deshmukh (Tabu).<br><br>Tabu's acting is top-notch in multiple interrogation&nbsp; scenes throughout the movie with a distinct no-nonsense persona on display at all times.<br><br>Ishita Dutta is remarkable in her Bollywood debut with a wide palette of emotions. Mrinal Jadhav plays the role of the innocent and adorable younger daughter splendidly, generating a few interspersed audience laughs.<br><br>Rajat Kapoor has a knack for playing the upper-class, businessmen –roles and is casted perfectly as Tabu's husband. However his character is a bit monochromatic, probably due to the script.<br><br>The movie has multiple twists arousing the curiosity of the audience culminating into a superb climax.<br><br>Even though the film is 2 hours and 43 minutes long, it binds the audience to their seats till the very last scene.<br><br>I strongly recommend this film, especially to the thriller genre lovers.<br><br>P.S. The film also teaches you why watching movies can impart you with paramount life-skills. So, definitely a connect with the movie buffs :)","user":"harshcalling","rank":[68,82]},{"title":"Family Drama With an Exciting thrill","rating":10,"date":"31 July 2015","review":"As everyone is aware it is a remake and the movies made before are exceptional. So, definitely the expectations would be high at least by the people who have seen it.<br><br>The movie is super entertaining and comes off as a new genre. The first half gives you a beautiful picture about the characters, how they are simple, funny, trying to meet ends and commoner. <br><br>Just before the interval you get a glimpse of the story and how it is going to screw everything up.<br><br>Second half is just an intellectual battle between Tabu and Ajay. How they try to out do one another. The climax is brilliant.<br><br>Ajay makes up for the time he was away from serious movies and excels scene by scene, Shriya is gorgeous and does well too. Tabu is menacing and yet a mother aptly supported by Rajat. <br><br>Its a must watch!!!!!","user":"chillax_amit1986","rank":[82,101]}]