[{"title":"A welcome addition to the MLP franchise","rating":1,"date":"27 September 2015","review":"My initial review of this film might've been a little harsh.. I think I was just a little off put by the short length of it. But... after rewatching it, my opinion has changed. This is probably the best movie of the Equestria Girls series, if only because it establishes its own identity and doesn't rely heavily on the the \"Friendship is Magic\" show. I like FiM a lot more, but this EqG series does have heart and its own soul. Which, to add on to that, I love how while these human characters are still the counterparts of ponies in Equestria, they still have their own individual personalities.. they're similar but definitely not the same.. their own souls and spirits, etc. <br><br>The music is good, which is the norm for a DHX/Vancouver / Hasbro production. The animation is on par with Rainbow Rocks. The acting is on par with the show and the direction from Rudell is great... he does a fantastic job. So I'd love to see a fourth film in the EqG series. If a fourth film was on par or better than these films, I'm sure it'd be a fine film... hopefully they'll try to finally break past the 72 minute mark. I think they need a little more time to flesh these stories and characters out.<br><br>Nice job MLP staff. Keep on doing your thing.","user":"directorianballinger","rank":[19,27]},{"title":"The Best Hasbro Has To Offer","rating":9,"date":"2 October 2015","review":"In the third installment in the Equestria Girls franchise, viewers are taken on a magical journey once more to Canterlot High School, in more ways than one. DHX Media and Hasbro Studios prove once again that they have the capability to create quality entertainment for the whole family. Though very fun and imaginative, fans of the My Little Pony can grow to appreciate the depth and deep morals expressed in a show that looks as if it was made with all the colors of a crayola pastel box. The best part in my opinion would have to be the phenomenal music originally composed by Emmy winner Daniel Ingram, who shows us all that music is just as magical as the movie itself. If you are fan of anything animated and or gripping, this movie is the one for you.","user":"smittyt0198","rank":[9,14]},{"title":"MLP Milgram experiment","rating":9,"date":"29 September 2015","review":"This review contains some spoilers<br><br>I think this movie was creepy in a terrifying manner. It is a MLP version of Milgram experiment on Twilight, a perfectly good and well intended person cracking under peer pressure and doing things against her personal moral code. <br><br>Also the outburst of Sunset Shimmer toward Twilight was something. Typical frustration nonthinking outburst (we all do from time to time) doing irreparable damage to a weaken confused and depressed mind. <br><br>This movie is very dark in all significant places regardless of its shiny and colorful presentation. <br><br>This movie for me have left other 2 in the dust. Well done HASBRO.","user":"funestis","rank":[9,15]}]