[{"title":"Disturbing, eye-opening","rating":8,"date":"20 September 2016","review":"I screened #GOAT starring #BenSchnetzer and #NickJonas and although the hazings in the film can get over the top, one can't help but wonder if hazings in real life frat out there can really get that violent, especially since the college I attended didn't have Greek houses so I never personally experienced pledges. But GOAT has its own way of rattling your comfort zone. The psychological pain the characters inflict on each other is more disturbing than last year's \"The Stanford Prison Experiment.\" <br><br>Directed by Andrew Neel, in GOAT, Ben Schnetzer's character, Brad Land earlier on in the story goes through an initial violence so traumatizing that it pretty much sets up his motivation throughout the entirety of this film. He joins his brother Brett's (Nick Jonas) fraternity and as the pledging ritual moves into hell week, the stakes grow more violent, more humiliating, and more torturous, all in the name of brotherhood, or is Brad trying to prove something else? Based on Brad Land's memoir, co-written by Andrew Neel, David Gordon Green and Mike Roberts, the film deals with the questions of which rites of passage are worth taking and which ones are not and where do you draw the line. There are plenty of hazings in this film, you really don't know what to expect because each of them is shocking in its own way, it becomes ingrained in Brad's psyche or his belief that this may be what is needed to be done for him to punish himself for the earlier event that victimized him. And to some of these brothers, this frat life has become all they know, this is all they have, they think it's the center of the universe so if you go against it, then consequences ensue. It's very intriguing to see Brad and this brotherhood collide and the effect they have on each other.<br><br>GOAT is not a college comedy, it shows the darker, harsher side of what college life can offer. It's raw, unforgiving, and it punches you in the gut. You will feel uncomfortable watching GOAT and that is one of the film's main goals. I'd be very interested to see a featurette or behind-the-scenes videos showing how they shot some of the hazing scenes, just to see how the actors mentally prepped for them. I'd like to believe that GOAT doesn't necessarily intend on demonizing frat or Greek houses, I'm sure there are many brotherhoods out there that don't go over the line in their rituals but it does show that when we join a group, any group, it's best to analyze whether or not that group would be beneficial for our personal growth given our previous life experiences.<br><br>-- Rama's Screen --","user":"Ramascreen","rank":[51,75]},{"title":"At times it's intolerable","rating":6,"date":"1 February 2017","review":"There is one review that describes GOAT as \"Full Metal Jacket meets Animal House,\" which might be true if this movie were at all a comedy, or even a movie that examines the long-term effects of psychological abuse. There is a lot that Andrew Neel tries to say from the director's chair, but aside from a few interesting moments here and there, it seems like he may have bitten off more than he can chew.<br><br>The story follows Brad (Ben Schnetzer), the older brother of an all-around popular college boy (Brett, played by Nick Jonas). The film opens with Brad offering a ride to a set of strangers in the dead of night. He offers only because he believes they are coming from the same party. Right away the suspicions are tingling. A 20-minute ride down a deserted road finally has Brad come to terms with his situation: that he is mugged, beaten, and left for death in the middle of a field on the outskirts of town. His face is scarred, bruised, and his ease with strangers is never the same.<br><br>The movie is something I was not expecting, an odyssey into the mind of fear along the lines of a film Harmony Korine might admire. Where I was prepared for an dark yet entertaining film like Whiplash, we delve into the bowels of a film that more closely resembles \"Spring Breakers,\" another hypnotic story with similar themes of the recklessness of millennials.<br><br>As the story falls into place, Brad finally decides to start college (we assume he took a year off after high school, since his younger brother is already well into his degree). Even before classes begin, Brad attends a Fall party at Brett's fraternity. The house is run- down, jammed, full of empty plastic cups and vomit in every corner. It's not so much a symbol as a right of passage: to belong to this house is to have a brotherhood that always has your back. James Franco (a producer on the film) has a brief but memorable scene as a former classmate who seems to hang around at the house a couple hours too long. Stuck in the past, he nonetheless shows Brad that this is an institution to which you can belong and be protected.<br><br>And so begins the odyssey. \"Hell Week,\" as it's notoriously dubbed, is the hazing process where Brad, his roommate, and others, attempt to win the trust of the fraternity and eventually get \"pinned\" before the school year is out. The name is aptly given. Pledges are brought down to the basement where they are stripped, tied up, urinated on, and made to drink to the point of nausea. They drink cups of hot sauce. They are slapped. This is only day one.<br><br>The comparison to \"Full Metal Jacket\" would seem appropriate on a surface level, but the film rarely dives into the psyche of Brad, a boy who is torn between fear and commitment to pleasing his brother. Just as he allowed strangers to abuse him in the film's opening, so does he (poetically) allow it to happen again, this time for acceptance. In fact, maybe the abuse comes to represent a window into the connected world. Life is full of people who come and go, but what's the true test of a friendship if you literally go to hell and back.<br><br>The abuse, of course, is the highlight of the film, and the vivid scenes of torture are at times a bit overwhelming. We know going in that this is a movie based on actual events (events in which the death of a student was the culmination of the abuse), and as such each new scene comes with a heightened sense of dread: will this turn deadly? The violence is so relentless that I doubted I would even end this film with a positive thing to say about it. Filmmaking and production is one thing, but if you are making a movie about violence solely for the sake of violence, then what is the point?<br><br>I found Schnetzer's performance something that was both fragile and determined. While I at times failed to see motivation in certain scenes, his portrayal of Brad is fully-realized and the basic moral compass of the movie. From beginning to end, the story can be simplified to that of a boy who learns to no longer be afraid. It's a small arc, muddled in with a plot of hazing that does very little for the cause of the overall picture. On an intimate level, this was a story I could get behind. Everyone likes a happy ending, don't they?","user":"artmania90","rank":[16,22]},{"title":"Superfluous","rating":2,"date":"12 January 2017","review":"This is the story of the experiences of two brothers who join the same college fraternity, one year apart. I think that it did not take much talent to come up with the story. Start off with a violent beating of the younger brother to get the audience's attention, emphasize the hazing events during hell week, toss in some sibling interactions, and end with the fallout from a tragic consequence of the hazing. The acting is pedestrian and there is such a lack of depth to the characters that it is difficult to care about them. The deepest conversation goes along the lines of, \"Hey man, how's it going?\" followed by \"Fine.\"<br><br>The \"based on true events\" comment at the beginning does not add much value, since what is presented does not go beyond stereotypical material.<br><br>Several years ago I read the book \"Goat Brothers\" by Larry Colton. I thought this movie might be based on that book, but, aside from the one small part of the book dealing with hell week, they are miles apart. The book traces the lives of five fraternity brothers over a period of twenty-five years and, opposed to \"Goat,\" you wind up really knowing them.","user":"bandw","rank":[16,26]}]