[{"title":"One of the best LBT sequels","rating":8,"date":"13 February 2016","review":"After the horrendous Wisdom of Friends, I was super skeptical about this film. This movie felt like it was being made to cash in on the success of Jurassic World, another NBC Universal product. The director, Davis Doi, did a good job of bringing that LBT nostalgia and magic back. I found the movie very reminiscent of the earlier films (Parts 2-6), especially for a seemingly unnecessary FOURTEENTH installment. This movie was surprisingly not a bad film.<br><br>So what is this movie about? Littlefoot is excited that his father, Bron, is making his annual visit to the Great Valley. However, he learns that his father is trapped in the wilderness when the \"fire mountain\" erupted, which left the rest of the herd to go on without him. Littlefoot and company decide to venture out into the Mysterious Beyond and try to rescue Bron.<br><br>What makes this movie good? For starters, the plot line is actually quite interesting. It's miles better than whatever the heck the writers were thinking back during Parts 11-13. I loved how Littlefoot's bravery was portrayed in this movie. The stress of possibly losing another parent is apparent and is very well-done. Chomper and Ruby actually have a role in this movie and aren't shoved to the side, which I was worried about. Props to the writers for the inclusion of Yutyrannus and Carnotaurus, as well. The pacing is isn't necessarily bad, either. It's well-done enough, and the animation is gorgeous. There are some scenes in which obvious CG makes it slightly jarring to watch, but there are others where the CG actually looks nice.<br><br>Overall, this is a nice return to the Land Before Time franchise.","user":"magnusplin","rank":[8,10]},{"title":"A very nice comeback","rating":8,"date":"2 February 2016","review":"After the very mediocre wisdom of friends I was a bit worried, but this new director brought that Land Before time magic back for me. This isn't a perfect movie but it is leagues above the 13th movie simply by not having new annoying characters shoved down on our throats and hogging screen time for the main characters.<br><br>First I'll talk about the positives. This movie gives a really good reason to focus on Littlefoot and reminded us how brave he was. The stress of possibly losing another parent really get's to him and we see that done very well. The other four all have a good role in the movie and are'nt just shoved to the side like in the thirteenth movie. Ducky is without a doubt the heart of the group and it's shown beautifully hear when she's the one who more or less convinces Cera the reason to leave Littlefoot was selfish.<br><br>As fun is this movie was there are a few issues that I do have to address here. Firstly the movie moves a bit too fast in certain places, it's not an annoyance but it is something I noticed. Also while Chomper and Ruby do eventually leave the valley to help search for the others, I would have preferred they had a bigger role. Lastly the voice for threehorn sounds off, maybe it's just cause I'm so used to the original voice but this new guy does not sound like he's giving his all in his performance.<br><br>Aside from the negatives I mention I do think this is a great return to the Land Before time series and hope we get to see more movies.","user":"anthonygrieco-43119","rank":[4,6]},{"title":"Good overall","rating":6,"date":"8 February 2017","review":"I very much looked forward to this film, after the long wait between the films. At first its hard not to shake the original voice actors out but i thought i would give it a chance as some of the original voice actors have sadly past. I am definitely glad i continued watching, it is a lovely comeback and i hope we see the return of more films following these characters. <br><br>The voice acting could be improved as some of the feeling gets lost especially with three horn and in parts with grampa long neck i noticed a big difference but this could be down to me remembering the original voice actors and comparing. <br><br>For any future viewers it is a lovely comeback to the series with new voice actors but give it a chance. Overall a really sweet lovely comeback.","user":"bronwenjones","rank":[1,1]}]