[{"title":"Clever, Inventive Low-Budget Filmmaking - But Deeply Disturbing","rating":8,"date":"17 January 2018","review":"Man, what a ride! I love it when I know absolutely nothing about a low budget film and don't expect much - and then get completely surprised at how good it actually is.<br><br>This little gem is an unpredictable, often times either darkly funny or deeply disturbing thrill ride that should not be me missed by genre (or generally film) fans.<br><br>It's beautifully shot, acted and written, and I'm sure we'll hear more from filmmaker Chris Peckover in the future. This is clever, inventive low-budget filmmaking at its best, and it goes to show that a lack of money is not an obstacle that can't be overcome by sheer talent. <br><br>Good stuff: 8 stars out of 10.<br><br>Favorite films: IMDb.com/list/mkjOKvqlSBs/<br><br>Lesser-Known Masterpieces: imdb.com/list/ls070242495/<br><br>Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/<br><br>Favorite TV-Shows reviewed: imdb.com/list/ls075552387/","user":"gogoschka-1","rank":[129,185]},{"title":"Better AVOID SPOILERS, You'll be Glad You did","rating":7,"date":"24 December 2017","review":"Let me give you some advice: the second that you finish reading this review, get off imdb.com, steer clear of any ratings or stories about this movie, don't watch any trailers, and don't ask anyone about it. Just find the movie, and watch it. Go in with a totally clean slate and enjoy. <br><br> I don't really want to say much more than that out of fear of ruining any element of the movie. I can tell you that it's part scary, part funny, largely surprising, and totally entertaining. The performances are great. I don't want to describe why they're great because that could give something away. Just know that they're superb. <br><br> Plot-wise, the most I can say is that an attractive female babysitter comes over to watch a junior high school boy while his parents go out for the night. After that, visitors arrive and stuff happens. Lots of stuff. <br><br> This is by far the shortest review I've ever written, but I've said all that I want to say. Now go watch the movie.","user":"Jared_Andrews","rank":[91,129]},{"title":"Not disturbing or funny","rating":14,"date":"14 October 2017","review":"I don't see the appeal here. This is just the sad, unpleasant rape/murder fantasy of a child. There's nothing particularly dark or disturbing here that we haven't seen much worse of in other, better movies. It starts out acting like it's going to be a comedy too, yet nothing funny happens after the kid's annoying reign of terror begins. It's not scary and it's not funny, so what exactly is the big deal here? It's just a couple of annoying children acting like stupid, inept villains.","user":"horrorgasm","rank":[122,213]}]