[{"title":"I am anxious to teach GIANT LITTLE ONES in my film analysis class","rating":10,"date":"25 January 2019","review":"GIANT LITTLE ONES is a solid film, the kind that is great to discuss as it successfully does something that most films (unfortunately) don't do: it re-incorporates its themes throughout in big and small ways with major and minor characters.<br><br>For example: You'd think that the minor character Mouse is meant to be nothing more than comic relief and a throwaway character (meaning that the screenwriter could omit Mouse from the script, and the rest of the film would not be harmed significantly for that loss), but you'd be wrong; she is enormously important in relating the movie's core Theme.<br><br>Mouse makes Franky really think about the value of owning one's sexuality, and she cites examples of people who don't care what others think about them and, as a result, they are respected for their confidence and ownership of Self. And she is an example of accepting others as they wish to be seen without question -- a lesson that other characters need to learn including Franky (our protagonist).<br><br>The relationship between Franky and his father for much of the film seems stagnant and forever distant, but it's not. It takes a long time, but watch as it starts to shift; it is indicative of a shift in Franky's perceptions about his own sexual fluidity... AND his ability to own it. In other words, he takes Mouse's words to heart and, in time, he owns his sexuality -- whatever it may be.<br><br>Not knowing what happened between Franky and Ballas in bed is an excellent directorial choice because, like the other characters, we don't actually know the truth for quite a while. So, like the other kids at school, we can only assume (perhaps incorrectly) who did what to whom; we don't actually know the truth. And neither Franky nor Ballas know or acknowledge their own truths.<br><br>And the ending is terrific. It is not neatly tying up all the loose ends of Franky's relationship with Ballas (as most people expect and/or want) because, at its core, the film isn't about that. This film is about the acts of Ownership (particularly of Franky's ownership of his own sexuality) and Acceptance (particularly of his dad and Ballas).<br><br>In the end, Franky recognizes that Ballas has had extreme difficulty owning his own sexuality. Franky can finally see that Ballas is suffering, and he lets Ballas know that he is aware of that... but loves him anyway, as a friend... and maybe more (though, again, that doesn't matter).<br><br>Franky matures enormously through this film, and we know by its conclusion that after this movie is over, he will be patient person with others and make an excellent friend, an excellent sexual partner and an excellent father. In his confidence, he is owning Self and accepting of others.<br><br>Loved it.<br><br>And a final thought about the title -- I don't think it's a reference to growing up (\"little ones\" being kids). I have a sense that \"little ones\" refers to the cautious baby steps we take in life, and sometimes we need to take giant, confident grown-up steps in life in order to change for the better.<br><br>10/10","user":"ActOne","rank":[111,142]},{"title":"Wow. Stick with it. It's an AMAZING movie.","rating":21,"date":"21 June 2019","review":"Giant Little Ones (the odd title is never explained) starts out like it's about straight teenage boys -- making out with girls, bragging about \"doing it\", and other crap I don't want to see or hear. I almost turned it off, figuring the only thing gay about it was going to be the side story about a father who ran off with another man.<br><br>Then, after it took a gay turn, it seemed to be showing that homophobia is even worse in Canada than it is here, which could have been great (I'm tired of hearing that Canada is so much better and more progressive than the US) if it hadn't been so brutally upsetting that I had to skip over some of it.<br><br>Finally, about halfway through, it turned out to be something completely different, not like any other movie I have ever seen, and everything about it is excellent.<br><br>It's the story of lifelong best friends Franky and Ballas (where they got that name is beyond me, but it's highly distracting, and it's my only major complaint about the movie) who do everything together and obviously care a lot about each other. They both have affluent and supportive families (Franky's dad is the gay one, but he's still actively involved with his kids and his ex-wife) and go to an affluent, suburban and evidently all-white public high school in Ontario (filmed in Sault Ste Marie, but that's probably irrelevant). They're both good-looking, smart, popular, and on the school's swim team. They both have attractive, popular girlfriends, although Ballas is the one who brags about what he does with his.<br><br>During a very drunken sleepover after Franky's birthday party, Ballas gives Franky a bj (shown only as moving covers on a bed in the dark with sound effects). Afterward Ballas is terrified, so he preemptively tells his girlfriend (and therefore the whole school) that he woke up with Franky giving HIM the bj. Some already-hinted-at homophobia at school breaks out of the closet (especially, and predictably, on the swim team), and Ballas leads an unbelievably cruel, prolonged and relentless verbal and physical attack on Franky. The fact that they'd been so close is what makes Ballas's cruelty so extraordinarily hard to watch.<br><br>What sets this movie apart from and above every other movie about teenage coming-out is the amazing but entirely believable way Franky deals with what happens. I won't say any more, but this is far and away the best such movie I have ever seen (I've seen them all) or anyone else will see in several lifetimes.<br><br>Franky is an amazing and completely original character, and Josh Wiggins, the actor who plays him, cannot be praised highly enough. I've never been a Kyle MacLachlan fan, but he's perfect as Franky's dad, as are Maria Bello as his mom and Darren Mann as Ballas. There are no weak performances in the movie, and the screenplay and direction are perfect as well.<br><br>Even the brutal homophobia (which I'm sick of seeing in movies) is essential and never gratuitous, and it is totally transformed by Franky's amazing and transcendent -- and yet completely believable -- response to it. Very, very, VERY highly recommended.","user":"jm10701","rank":[25,35]},{"title":"A Giant Little Film","rating":8,"date":"1 August 2019","review":"This is a very well made, well cast film. The main subject is adolescence, and how painful it can be. While most of the reviews here seem to be wholly focused on the sexuality aspect, it is also largely about how teens navigate the ebbs and flows of their social relationships, both with their peers and with their parents. Sexual experimentation is on view, to be sure, as is unchecked homophobia and the havoc it can wreak. The film presents no easy resolutions to the problems encountered along the way. Just like real life.","user":"kbraidi","rank":[17,23]}]