[{"title":"Should Be Better Known","rating":10,"date":"10 October 2017","review":"Another reviewer here asks a very pertinent question as to why this film is not better known. If you watched this and didn't enjoy it then I reckon you must be dead. First off, the acting is superb. I'm not one for American child actors. They are often bizarrely moppet-like and unappealing, but this child is absolutely marvelous. She steals every scene she's in, and, like her uncle, Frank, I just sat back and wondered at her charm. Chris Evans does a fantastic job with this role. He plays it understated, which works incredibly well. There are some genuinely funny moments--I particularly liked the one-eyed cat, Fred, and his rescue from the (euthanasia) shelter. He's just sitting there with two other cats waiting to be put down. No one dies on Frank's watch. Great acting, interesting plot, genuine emotion, questions about the meaning of life and the debt we owe to our talents, all wrapped up in a great-looking movie. Just watch. You'll love it.","user":"johnwiltshireauthor","rank":[105,113]},{"title":"'He's a good person. He wanted me before I was smart.'","rating":10,"date":"30 July 2017","review":"Screenwriter Tom Flynn offers a well-considered and genuinely moving story about how we deal with gifted children – and adults. GIFTED is also about family connections and the impact on children whose parents are lost to them by separation whether in death by natural causes, by suicide, or by desertion. Marc Webb who has gathered an impeccable cast to enact this touching drama directs his sensitive story with aplomb.<br><br>Frank Adler (Chris Evans) is a single man raising a child prodigy - his spirited young niece Mary (Mckenna Grace) in a coastal town in Florida. Frank's plans for a normal school life for Mary are foiled when the seven-year-old's mathematical abilities come to the attention of Frank's formidable mother Evelyn (Lindsay Duncan) whose plans for her granddaughter threaten to separate Frank and Mary. Octavia Spencer plays Roberta, Frank and Mary's landlady and best friend. Jenny Slate is Mary's teacher, Bonnie, a young woman whose concern for her student develops into a connection with her uncle as well. The story explores the relationship between a caring uncle who salvaged his niece when the mother of the girl (a brilliant mathematician) commits suicide – yearning to offer the brilliant gifted niece a 'normal life' despite custody battles and grandmother opinions.<br><br>Chris Evans continues to prove that he is one of our more important serious actors of the day and eleven year old Mckenna Grace demonstrates why she is on of the most frequently seen young actresses in the young role parts. Octavia Spencer and Lindsay Duncan offer definitive performances in tough roles. This is a film with many levels of message and one that should be seen by a very wide audience.","user":"gradyharp","rank":[84,90]},{"title":"I rarely watch this type of movie - but this was worth watching more then once","rating":10,"date":"11 February 2018","review":"I'm going to make this a simple review - acting was outstanding for almost everyone. What I'd really like to know is how did Hollywood figure out how to take an very talented adult actress and make her look like a seven year old?\nMckenna Graces performance is well beyond her years. I expect we'll see many great performances from her in the years to come.\nChris Evans has come a long way from Johnny Storm and I look forward to seeing him in more dramatic roles.\nOctavia Spencer was great in Hidden Figures but in this different type of role, I think she did just as good of job with the amount of screen time she had.\nAnd on a final note, let's give Fred a big round of applause in a \"supporting role:","user":"brien1951","rank":[49,53]}]