[{"title":"We Still Steal the Old Way: Now chav free","rating":7,"date":"8 December 2018","review":"Sequel to the 2014 We Still Kill the Old Way, the majority of the original cast return for a superior outing.<br><br>This time the Archer gang are up for a prison escape, but can the old timers still do it using the \"Old ways\"?<br><br>Truth be told I had a great appreciation for the first film despite only hitting it with a 5/10. It was very well made but the realism and subject matter made me a tad uncomfortable and it damaged the film for me. This time around most of that subject matter is absent and with the same cast and fantastic writing it was logically bound to be better.<br><br>Sadly also absent is James Cosmo who played Arthur in the first film, he was a great character and he was missed. Thankfully the remaining cast are present and do a fantastic job without him as well as the new villian Billy Murray and fellow industry veteran Patrick Burgin.<br><br>A third movie has been announced but the more I look into it the more I get the impression its been cancelled or at best delayed. I'd love to see this rounded out into a trilogy because regardless of my opinions on the first film they're very well made movies.<br><br>The Good:<br><br>Well put together<br><br>Solid cast<br><br>The Bad:<br><br>Violence looks oddly tame in places<br><br>No James Cosmo<br><br>Things I Learnt From This Movie:<br><br>America is no longer the home of the free and the brave.............actually I already knew that one","user":"Platypuschow","rank":[16,16]},{"title":"Rubbish Brit gangster film. Just like the old days","rating":1,"date":"14 April 2017","review":"The problem with making a gangster film with a bunch of geriatric actors is that they are too old for the action scenes. So here we get a bunch of old actors talking about what it was like back in the old days and swearing a lot.<br><br>Richie Archer and his crew are back, caught in the middle of a heist in a bank vault but it was really a ruse to get inside a prison to help break out their old pal George Briggs whose wife is seriously ill with Alzheimer's. <br><br>Trouble is another gangster, Vic Farrow who is inside another prison also has an interest in George, but to get rid off him rather than help him escape.<br><br>We Still Steal the Old Way is a dismal film, too slow, it has little action and when we do get a prison riot at the end, it is laughably badly staged. It lacks the wicked wit of the first film which frankly was not even that good in the first place.","user":"Prismark10","rank":[23,41]},{"title":"What color is this one?","rating":9,"date":"6 July 2017","review":"Another upbeat crime tale by Sacha Bennett who also wrote himself a small role. The \"not quite over the hill gang\" lead by Richie Archer (Ian Ogilvie) gets caught performing an old fashion bank heist...deliberately. Their plan is to go to prison and spring George (Patrick Bergin) so he can visit his dying wife. Rival Vic Farrow (Billy Murray) \"He's not the devil, but he comes a close second\" throws a wrench into the works.<br><br>This production smartly moves between a crime drama and a prison drama with the right amount of humor mixed into the dialogue. Julian Glover has a minor role as compared to his billing. Not to give too much away, but the film sets up for a better sequel. I loved the scene when they all have on reading glasses attempting to make out the color of an alarm wire.<br><br>Guide: F-word. No sex or nudity.","user":"nogodnomasters","rank":[5,7]}]