[{"title":"The Funhouse Massacre: Take your brain out fun","rating":7,"date":"5 February 2019","review":"The Funhouse Massacre is a comedy horror which actually manages to deliver on both fronts, not to groundbreaking levels but is regardless some real take your brain out fun.<br><br>It tells the story of a group of inmates who are broken out of a top secret asylum for the worst of the worst. Being Halloween there is a nearby horror attraction which they descend upon for a night of carnage.<br><br>With Robert Englund in the opening scene and the whole thing looking the part my hopes were fairly high within the first few minutes and I have to say they were met. This is never going to win any awards for originality but it sets about doing everything you'd expect and does it above par.<br><br>Also starring uber industry veteran Clint Howard as one of our psychopaths I was shocked just how well comedy blended with the subject matter all things considered. With a couple of comedy psychos and a hopefully inept deputy who cracked me up throughout, alongside your usual array of stereotypical 20-somethings it's roster is very strong.<br><br>The sfx are entirely practical with lashings of gore, some inventive kills and absolutely no mercy.<br><br>It's a slasher film with character and some genuinely enjoyable comedy. Take it for what it is and you might actually find yourself having a laugh riot.<br><br>The Good:<br><br>Robert Englund<br><br>Some funny moments<br><br>Decent opening<br><br>Looks great<br><br>Oddly good performances<br><br>The Bad:<br><br>Some stuff defies logic","user":"Platypuschow","rank":[9,10]},{"title":"Great Fun...","rating":7,"date":"15 June 2016","review":"What a fun film! Loads of blood and guts, terrible acting (in the best possible way!) and you even get to see a naked breast(!!) I think a lot of people are going to miss the point of this movie - it's one big homage to the old slasher/80's teen horror genre. There are so many in-jokes and references to other films...in fact (I think) this is a remake of a film from 1981! I was expecting a low-budget but entertaining little movie, but never did I think it would be such a great roller-coaster ride of ripped heads and gruesome gore , all served up in almost comic-book style.The practical make-up FX are great, if a little OTT (more 80's influence), the lighting is brilliant and the sets are really clever (very realistic fun-house type set up). I review loads of movies in my Facebook group \"Jaded Horror Hound\" so I am not easily impressed, but I was really entertained and amused by this film. If you like your horror with a twist of camp and a dash of retro, this is the film for you!","user":"seservicessa","rank":[22,30]},{"title":"The Funhouse Massacre (2015)","rating":6,"date":"17 May 2017","review":"This is the first time I've seen Shout Factory actually distribute a film. I'm a bit of a BluRay enthusiast, so I know of this film through seeing the title in other peoples collections. I'm very into all types of horror films and am willing to give anything a chance. Even if its of the cheesy variety, I can find a way to enjoy it since I'm very open to it. I didn't really know what tot expect from this one but I can't say I'm overly amused, however it has its moments which make it fun.<br><br>This film is about a group of psychopath killers who escape from prison after they are broken out. They inhabit a local funhouse carnival and go on a murderous spree of killing while there. A group of dead end working restaurant workers also go to the funhouse and we follow the chaos that ensues. We also get a cool cameo from Robert Englund and even Jere Burns stars in it.<br><br>The film is low on plot points, its just a giant free for all murder spree after a while. There isn't any real depth to anything going on and this is fine as a brainless gory horror film. The film has its comedic moments, it was definitely going for that comedic horror element. I do kind of like carnival theme based horrors so I did enjoy some of the setting and how it creeps into the films mood. Don't question the ending, its really dumb but its basically the ridiculousness of horror films of the heydays reimagined for a modern film.<br><br>The film is quite gory. It has head ripping, limp cutting, blood spouting brand of body horror. Its not gonna appeal to everyone but I have no problem with this and thought it worked well in this film. The protagonists are kind of one dimensional but so are some of the killers. You don't really get a glimpse into motivations or extended backstories but who really cares? The film definitely tried to market some of their villains. Like the main psycho clown killer and the Harley Quinn knockoff (aptly named Ms. Quinn). I think this can possibly be a cult classic in the future, it has the ingredients for it thrive in that niche.<br><br>6/10","user":"rockman182","rank":[5,6]}]