[{"title":"Unbelievably good, brings back all those Paddington memories","rating":10,"date":"13 November 2017","review":"I used to read all the Paddington books when I was a small boy and my wife when she was a little girl. We both loved all the crazy escapades that Paddington got into and he did it all with a good heart.<br><br>I very much enjoyed seeing the first Paddington but did feel it wasn't quite Paddington with the scary woman and the scary scenes.<br><br>Paddington 2 completely captures the essence of the the books and really wrings out the most of some of the characters.<br><br>Brendan Gleeson is superb as the 'nasty' Knuckles who quickly warms to Paddington. This might sound far-fetched but the whole film is very childish. Now that's not childish in the sense of \"silly and immature\" but in the other definition of \"appropriate to a child\". The whole film shows and plays scenes as a child might imagine things to be - for example how the prison works and especially the lovely idea that the warden reads the inmates a bedtime story to help them all get to sleep.<br><br>There are superb performance from all the actors and a huge number of cameos. Even the small scenes put in by the like of Joanna Lumley and Rob Brydon are clearly done with great love from the actors. Hugh Grant puts in a superb over the top performance as the baddie, which really let him flex his vocal talents!<br><br>The whole film is done in bright colours and with a superb musical backing track. When you are watching the film be careful to pay attention to all the small details, such as the newspaper headlines and the To Do list in the Brown's Kitchen, there a huge number of little jokes in the background and I suspect I'll spot a whole load more when I watch this again on Blu-Ray!<br><br>Not really spoilers but there is only one really 'scary' scene near the end but it is so beautifully done and you know that Paddington will win so even the little ones won't cry. And make sure you stay for ALL the credits as they play out to an amazing \"what happened after\" montage.<br><br>I have noticed that that at the time of writing this review there were 927 votes and 15 people have given the film a 1-star. Now I know everyone is entitled to their opinion but in this case I suspect these people might not really understand Paddington and what he's all about, if you have young children and they love Paddington then they will love this film.<br><br>This film is suitable for young children aged 4 to 104 :)<br><br>Let you into a secret, when my wife and I went to watch this film there were a lot of people in the cinema but not one was under 18! From the looks of it the audience was aged 20 - 80!<br><br>I cried and I laughed through the whole film and rekindled my inner Paddington.","user":"NikolaiDante","rank":[110,122]},{"title":"For once a sequel that doesn't disappoint","rating":9,"date":"10 November 2017","review":"I was hugely surprised at just how good the first film was and was tentatively cautious when this sequel was green-lighted that perhaps it might cheapen Michael Bond's beloved family friendly creation.<br><br>However, fear not, for this sequel is absolutely terrific on all levels. Firstly it is as funny and witty and as brilliantly animated as the first film. The excellent cast from the first film is also enhanced by a superb turn from Hugh Grant, who hasn't been as good as he is here in a long time. In fact it is quite clear to the viewer that Grant is thoroughly enjoying himself by playing against type and sending himself up as a faded egotistical actor and total cad who sets Paddington up to be the fall guy (or should that be Bear?) for a dastardly deed. There is a touch of the pantomime villain to his performance, but it works splendidly and it fits his character perfectly.<br><br>All the wit and heart of the first film is still evident here and in some ways, built upon. Brendan Gleeson is also excellent as an old lag and prison cook who loses his angry nature when he succumbs to Paddington's charms and talents in the kitchen. There are also loads of great jokes too, some pitched at younger children and some deliberately aimed at the more adult viewer.<br><br>All in all this is a worthy sequel and a great memorial to Paddingtons creator, Michael Bond, who died whilst this sequel was still being filmed. It is full of laughs, thrills, action sequences, great characters, some wonderful animation (one scene is an obvious nod to the 2D paper cut-outs of the human characters in the 1970s children's TV show) and you would have to have a hard heart indeed to not burst into tears at the wonderful ending. Also, don't leave the film until you watch Hugh Grant gloriously send himself up with a musical song and dance act as the end credits roll. <br><br>Thoroughly recommended to anybody who wants to see 100 minutes of family friendly fun that isn't either sickly sweet or too dark for youngsters and still thoroughly watchable to adults too. Great fun and a worthy sequel to one of the best British films in recent years.","user":"trevorwomble","rank":[74,84]},{"title":"602nd review: A Superb Children's Movie","rating":9,"date":"12 November 2017","review":"Paddington 2 really is a fine children's movie. In fact, I would go as far as to say one of the best children's movies I have seen. It is not just charm and whimsy and genuine laughs though it has those in buckets - it is a real plot, and a solid caper movie to boot. By building on an ingenious crime element and real plotting it has turned from a sentimental journey to something more. As an avid reader of the books as a child, the main worry is the spirit of the bear who believes in the good in everyone, while creating untold chaos around him, will get lost to serve the storyline or some idea of updating Paddington. Luckily, none of the spirit is lost, and instead, we have an immensely enjoyable, fun, funny, and charming film. The whole family loved it - and we all laughed, cried, and cheered. Just be sure to stay seated for the credits. A really excellent children's film.","user":"intelearts","rank":[59,67]}]