[{"title":"Axe To Grind, Maybe?","rating":8,"date":"2 April 2015","review":"I went on to check some of the credits of the women in this film after watching it and I came across a needlessly negative review, so I just wanted to offer my take.<br><br>I've known actresses (or should I say actors?) in this business as well as casting directors and I hate to say this documentary has it right. It's especially rough for women in this business and I think it's good for people to see smart, articulate women speaking about their experiences. In a way it's hard to compare this to the previous film about male actors because I think this is about so much more.<br><br>I guess I was bothered by the previous review I read because A) I actually think this is a better produced film than THAT GUY... and B) I think squashing the voices of some pretty impressive women working in this business by telling people not to see this is counterproductive. But that's what opinions are for, I suppose.<br><br>Anyway, cheers to these women who have found peace and joy in being working actors, who know how lucky they are, even with all the challenges they've faced along the way.<br><br>I kept thinking of Patricia Arquette at the Oscars while watching this. Did the filmmakers know she was going to give that speech?","user":"HerveVillechaize","rank":[17,25]},{"title":"An Important Documentary","rating":10,"date":"13 April 2015","review":"I really enjoyed That Guy... and was very excited to learn that the filmmakers were giving the ladies of Hollywood their fair shake as well. This is a very well made doc, the women who are interviewed are insightful, funny and excruciatingly self-aware. I think this is an important movie because it's one thing for us to hear well-known female stars talking about inequality in Hollywood when they are making big paychecks and have their names above the titles. But it's a wholly different thing to hear from the women who have been working their butts off in Hollywood and are barely known. If you don't recognize who most of these women are I think it proves the point. They are literally in every thing and have been for a long time. Because they are not Gwyneth or Sandra, Julia or Jennifer doesn't mean they should be invisible. It doesn't make their stories or their work any less valid. The men and women featured in these documentaries are the backbone of the industry and we should be paying more attention to them. Bravo!","user":"jenmaravegias-58204","rank":[9,12]},{"title":"Brilliant, honest, heart-breaking yet inspirational documentary on Hollywood","rating":10,"date":"11 April 2015","review":"Documentaries on movie stars can be found virtually everywhere. But this doc (as well as its predecessor \"THAT GUY...\") tells compelling stories about some of those great actors whose names aren't above the title. \"THAT GAL...\" is a brilliant, honest, heart-breaking yet inspirational look at the intrepid pros whose names may be hard to remember but whose performances are unforgettable. <br><br>You'll recognize Paget Brewster from the 2015 season of \"COMMUNITY\" and Roxanne Hart from the legendary sci-fi classic \"HIGHLANDER\". Roma Maffia was particularly memorable in \"DISCLOSURE\" as well as the Johnny Depp thriller \"OUT OF TIME\". And Jayne Atkinson has been a pillar of \"HOUSE OF CARDS\",\"CRIMINAL MINDS\", as well as \"24\". What these and the other actors in the documentary illustrate are the often harsh but occasionally glorious realities of the acting business. This is not a puff-piece and it's not a tawdry expose. It's a refreshing peek into what it takes to make it as a professional actor -- namely: passion for the art form to motivate yourself and the grit to endure the tough times. This is a must-see for all aspiring actors as well as for those struggling actors who want to remind themselves that this business is hard for almost everyone but worth it if you can keep going.","user":"danabrams999","rank":[9,12]}]