[{"title":"Gore, sadism and more gore.","rating":6,"date":"10 June 2017","review":"Ferrigno, (Special Forces fighter John Bradley) left the army six months ago, and is suffering PTSD. After travelling to the UK he's drawn into the world of Razor (Jerry Anderson), a drug dealer with a very sadistic nature. This is the usual trope that we see in these movies: Razor's henchmen rape Bradley's daughter on her dining room table, and commit other awful acts, which are meant to convince us viewers that what follows is perfectly justified. <br><br>There is no tongue-in-cheek humour in all this and I kept wondering how all this mayhem could be going on with no apparent police reaction.<br><br>I like watching action and war movies but frankly, this film was a bit too hardcore for me. If you like gore and sadism it'll be your kind of movie.","user":"oldvinyl","rank":[14,16]},{"title":"Charles Bronson-style revenge!","rating":9,"date":"5 May 2017","review":"One of the hottest things in the action genre over the past decade or so is the 'Old guy gets back into the killing game to get revenge for a friend or family member'. Any actor over the age of 55 has pretty much done this movie. Liam Neeson, Michael Caine, Sly Stallone, Clint Eastwood, and most recently, Keanu Reeves has gotten into the game. Now, it appears that even bodybuilding legend and former Incredible Hulk Lou Ferrigno has decided to knock the dust off of his old leather jacket and get some sweet Charles Bronson-style revenge! This film delivers in every way the action, the soundtrack, the ultra violence, girls, sweet revenge and lots of kills! The choreography is brilliant and Ara Paiaya makes Lou look amazing at fight scenes and shoot outs. Lou Ferrigno is 65! and moves like a 30 year old in this film. The Director obviously taught him a lot looking at his previous action films. One can only hope for more of the same! A must buy.","user":"j-43695","rank":[13,19]},{"title":"Great action film, they should do a sequel.","rating":10,"date":"4 May 2017","review":"This is a well made revenge action film, Its director Ara Paiaya, made a great job in the martial arts choreography that fitted well with Lou Ferrigno's talents. Ferrigno's acting was very good for an action centered film. They should do a sequel or at least a few more action films. This is not a high budget film but the story treatment and editing is more than adequate for its limitations money wise.<br><br>This should just be good start of a series of more Ferrigno action films.","user":"barbosavive","rank":[13,20]}]