[{"title":"Fifty-fifty, maybe less","rating":5,"date":"22 August 2017","review":"The gorgeous images deserve that you watch this film.<br><br>The dreadful dialogues might ruin the moment for you, however.<br><br>Now I'll just develop a bit, so you can skip if it's TLDR : I don't know if the same person conceived the visuals and wrote the text, but the former are wonderful while the latter is unbearable. The maze's sets, effects, even costumes are imaginative and fantastic. They keep the promises that made you curious about watching the film.<br><br>The dialogue, on the other hand, is written by a slacker. It's the kind of film where the line you hear the most is \"Are you okay ?\" surrounded by countless other platitudes and a distinct lack of real emotion. Drivel, simply put. Vapid, out of place, lazy, oafish, and much, much less. That's what makes the story. That's also what makes the viewing an ordeal. Thus I can't be sure about the actors : I have a bud of an opinion, but in their defense they had to work with trash.<br><br>Likely, you can't predict if you'll endure the talking, which way it will tip your balance. I'm feeling generous, thanks to the handcraft, and I think Jim Henson would have approved.","user":"voyou-703-655350","rank":[38,51]},{"title":"Underdeveloped","rating":5,"date":"3 September 2017","review":"I had been looking forward to \"Dave Made a Maze\" since seeing its trailer. It looked like a quirky modern version of Cube and Labyrinth, two of my favorite films. <br><br>It starts off decently enough. The plot and the maze itself are intriguing. I also liked some of its quirkiness and humor. Unfortunately, the film gradually unravels. <br><br>The story, characters, and dialogue are underdeveloped. Despite only being 80 minutes long, by the third act I was patiently waiting for the film to end. For me, the climax and conclusion didn't come together in a compelling way. <br><br>It is unfortunate, With a bit more development it could have been something of a cult classic or hidden gem.","user":"solemnphilosopher","rank":[23,32]},{"title":"Extremely original, bizarrely inventive, beautiful to look at, and quite amusing!","rating":9,"date":"15 August 2017","review":"'DAVE MADE A MAZE': Four and a Half Stars (Out of Five)<br><br>An indie horror-comedy adventure about a struggling artist that somehow magically creates a giant maze in his living room, that's contained inside a small cardboard fort. When he gets lost in the dangerous labyrinth, his girlfriend leads a team of their friends into the maze to rescue him. The film was directed by debut feature filmmaker Bill Watterson, and it was written by Watterson and Steven Sears (a debut feature screenwriter). The movie stars Nick Thune, Meera Rohit Kumbhani, Adam Busch, James Urbaniak, Frank Caeti, Scott Narver, Stephanie Allynee, John Hennigan and Kirsten Vangsness. I found the film to be extremely original, bizarrely inventive, beautiful to look at, and quite amusing.<br><br>Dave (Thune) is a frustrated artist that feels like he hasn't created anything significant in his life, even though he's now over 30-years-old. While creating a cardboard fort in his living room, Dave somehow (magically) creates a gigantic maze inside it. The maze is full of deadly booby traps and vicious creatures, including a monstrous minotaur (Hennigan). When Dave gets lost in the maze, his girlfriend, Annie (Kumbhani), leads a team of their friends into the cardboard fort to find him (against Dave's warnings).<br><br>The movie is definitely unique and creative, but it's also surprisingly beautiful to watch at times. The filmmakers really made the most of their budget. It's kind of a horror movie, but it's never really gory or even truly violent. You'll have to see it to know what I mean for sure, but I've seen far worse on Adult Swim (and even network TV). The actors are all funny in it, and well cast, and the story is kind of sweet hearted even. I had a fun time watching it, from the opening credits scene (which is also impressively creative) on. I think most film fans, looking for something different, will have an equally good time watching it too.<br><br>Watch an episode of our movie review show 'MOVIE TALK' at: https://vimeo.com/230044658","user":"Hellmant","rank":[37,60]}]