[{"title":"Silly but funny","rating":7,"date":"9 May 2018","review":"When daughter Alex is denied the university scholarship the town had promised her (because creepy head councilman Bob has embezzled it), Scott and Kate team up with down-on-his-luck friend Frank to start an unlicensed casino in his house, with the intention of running it through the summer and then using the profits for Kate's tuition and to save Frank defaulting on his mortgage.<br><br>This film is deeply silly. It is also consistently funny. I watched it in a small auditorium with about 20 people, and there was frequent laughing out loud. There is a lot of bad language, some violence, some drug misuse, some sexual frankness (though, as usual, no nudity), so it is very much ini the modern style of being crude, crass, tasteless and offensive, but it always remembers to be funny.<br><br>Will Ferrell's Scott is an idiot when necessary (he can't cope with numbers) and scarily competent at others - the character is completely inconsistent, depending on the demands of the plot. Yet it works well enough. There are similar character inconsistencies with both Kate and Frank, yet you are prepared to overlook this because they are likeable characters, and you want them to get away with their activities despite, how can I put this, the dismemberments etc. they are responsible for.<br><br>There is a fairly extensive supporting cast, all of whom are well enough drawn that you enjoy seeing what they are doing, and the various mishaps which happen to them. The violence is graphic but slapstick.<br><br>I was always interested to see where the story was going - it wasn't always where I expected. And I enjoyed spending time with these daft people in their foolish but funny story.","user":"neil-476","rank":[24,28]},{"title":"Don't pay attention to the bad reviews.","rating":7,"date":"14 September 2017","review":"Switch of for 90 mins. Enjoy a movie for what it is. Don't compare to others, criticise, judge or hold a candle. Just watch the movie with no bias and expectations and ask yourself at the end did I like it?<br><br>I did that and I enjoyed this movie. It made me laugh. Will and Amy were great as the quirky couple who will do anything to make sure their daughter gets a good start in life. The supporting cast were funny and believable (In that zany movie dimension) and I enjoyed the other characters as much as the main cast.<br><br>\"Will it win an Oscar?\" Hell no... \"Will it go down in history?\" I doubt it.... \"Is it the funniest film ever?\" No way.... But give it a try. It's ten thousand times better than most of the garbage that's been released this year.","user":"TheWalkingDood","rank":[79,109]},{"title":"Loved it","rating":9,"date":"15 April 2018","review":"Look it is completely brainless humor.... So funny! Like all great comedy you either love it or hate it. I loved it!!!!","user":"AaronRon","rank":[22,30]}]