[{"title":"A Great Comedy-Romance For All The Family.","rating":10,"date":"4 June 2017","review":"Paris Can Wait is absolutely a great comedy-romance movie from the talented director Eleanor Coppola.<br><br>It is an entertaining movie from the beginning to the end. Great scenery of Paris ,amazing acting, enchanting romance,delicious French food and stunning direction.<br><br>Rated PG and suitable for all children .Adults would definitely enjoy it especially when they learn that this movie was screened in the Special Presentations section at the 2016 Toronto International Film Festival.<br><br>God Bless The Amazing Eleanor Coppola (The Wife Of The Great Director Francis Ford Coppola).<br><br>Indeed:\" Behind A Great Man There Has To Be A Great Woman.","user":"HealthyLove","rank":[206,246]},{"title":"Loved it! Always love Diane Lane!","rating":10,"date":"19 June 2017","review":"What a nice change to see a movie that is just a lovely little vignette in a mature woman's and man's lives, that was shot on location in one of our planet's beautiful countrysides, that contains mature sexual innuendo without gratuitous acts or nudity, that contains no profanity, that stars one of the most appealing actresses ever, the one and only Ms. Diane Lane, and that left me hoping for more movies like this one. Would have liked more of Alec Baldwin's humorous character -- one that suits Mr. Baldwin's comedic acting talents. Congratulations to Ms. Coppola for directing such a wonderful movie at age 80!","user":"rrhew","rank":[81,108]},{"title":"no spoiler here","rating":10,"date":"5 July 2017","review":"\"Paris Can Wait\" is a pathway to joy offered in the splendid rendition of french culture, beautifully written and directed by the wise and gifted Eleanor Coppola. Thank you a million times, Madame Coppola, for your artistry and diligence in offering a miraculous escape from our wonderful, but exhausting, existence in a fast-paced, worrisome, volatile discourses in so many areas, of our contemporary, modern lives. I breathed a welcome sigh of relief when I first saw the movie and, so delighted in the mere joy and charisma of it, its magnet pulling me, I did find myself re-entering the movie theater another four times to see it again. I admit I am hooked on the beauty of the movie and cannot wait until the DVD comes out, the waiting list on which my name already appears.<br><br>To have this visual travel into the calm nuances one finds in the true beauty of the scenery and culture of France is invigorating to our spirit, and the marvelous accompanying musical score, enhancing each scene, adapts so well to the enticing dialogue between these amazing actors.<br><br>Diane Lane is without question the epitome of elegance in her reactions to a less than dedicated husband, and her acquiescence into a less than perfect marriage, but her tolerance of the french man, Jacques, with his passion for her so obvious in each look and expression, was masterfully handled by her effort at humor and her consistent sophistication and is appreciated by many women today who have found themselves in a similar situation. Most noteworthy here is kudos must be given to the wardrobe mistress, as the clothing ensemble she chose for Anne was beyond stunning, modeled perfectly by Ms. Lane and her beautiful comportment.<br><br>The actor Arnaud Viard was perfection in his role and perfectly cast also. The movie is a tranquilizer for our troubled times, a welcome escape. We need more beautiful movies that remind and inform us of the beauty of the world, and Ms. Coppola has done that magnificently.","user":"stom37","rank":[58,78]}]