[{"title":"false expectations","rating":4,"date":"25 August 2017","review":"There were so many clever and new ideas that I have never seen in any other movie, let alone any found footage movie, but the movie was way too heavily edited to be found footage, for example the (rec) symbol is on everything, the eyeball wouldn't record audio and if it did, it would be very muffled:FIX: create plot where he wears an external mic.<br><br>The voices of the characters sounds like they were recorded in a studio and just dubbed in:FIX: use the natural audio from the DSLR and the... go-pro?... because it is actually supposed to replicate found footage.<br><br>The night vision effect was just plain lazy:fix:use an actual night vision camera and not a green filter... your not fooling anyone. <br><br>when he moved his eye his other eye moved too... I mean there are no muscles attached right? I'm not a biologist... and I think it would make great comedic relief if his eye just stayed in place <br><br>another thing that bothered me was that there was a soundtrack... do I really have to explain.<br><br>I don't know what anyone else looks for in found footage, but I look for realism and even a toddler can tell that its fake... and that not good.<br><br>the hype made me really want this movie to be good... but sadly it wasn't <br><br>other than that it had a kinda unique story to it that had so much potential..... probable remake????????????","user":"rbrandonmiles","rank":[15,18]},{"title":"Laughable","rating":3,"date":"21 July 2017","review":"Well, let's see here, I've been busy touring continental Europe with my favourite band this past month, and as a result, I've not seen many films lately, and this is a PG-rated found footage flick, which didn't get a Thursday night preview screening, and only has a scant IMDb page , doesn't have a Wikipedia page at all, or a Boxofficemojo page, and its Rotten Tomatoes score is a zero.<br><br>So, obviously, it's just calling my name, and begging me to review it. <br><br>I didn't even know this was a thing that existed until I saw its name ( misspelt as, Gracefeld Inciden ) on the cinema marquee. <br><br>Moron is filming his wife, not paying attention while he is driving to hospital for wifey's ultrasound​, gets into an accident, loses an eye, and his wife loses the child. She stays with this moron, and ten months later, he is building a plastic eye with a video camera in it, ( in a scene which vaguely reminded me of the eyeball scene from The Terminator ) to record every​ second of a trip to a cabin in the woods with friends. <br><br>This sextet witnesses a meteor crash, finds a rock nearby it, takes it as a souvenir, and is set upon by an unseen creature in pursuit of the rock, which it turns out, has its unborn offspring in it.<br><br>Ridiculously complicated setup for a generic found footage flick, where logic and cohesion goes out the window in favour of shaking the camera, and plot goes out the window in favour of expositional dialogue, which this film is loaded with. <br><br>They try for a deep and meaningful, profound twist ending, and fail so miserably.<br><br>Again, this is a ridiculous movie, with a couple of lengthy, one-sided lectures about child birth being a \" gift \" , and from out of nowhere scenes about the lead character's alcoholism ( which isn't mentioned any other time ) which is worthwhile only for unintentional laughs.<br><br>I was never mad or angry at this movie, just bored, which is why I rated it 3/ 10, but really, there's no reason to watch this, even for free on Netflix. The biggest surprise was that I was not the only person in cinema for the showing. There were a half dozen people there with me for this one, which is more than can be said about Phoenix Forgotten, from earlier this year, or even Free Fire.<br><br>Without the opening and closing credits, the film is only about 75 minutes long. ( Edit: apparently, this was filmed sometime in late 2013 or early 2014, as proved by the date the trailer was posted on YouTube, 19 May 2014: https://m.youtube.com/watch?v=z1p1Ms_BXM4 , but then heavily re-edited, with entire subplots about government conspiracies and cover- ups dropped, not released until July 2017 )","user":"Zbigniew_Krycsiwiki","rank":[42,58]},{"title":"Awful","rating":1,"date":"27 July 2017","review":"I created a profile purely to rate this film as terrible. Like, truly awful. If I could go back in time and punch myself in the dick for ever wanting to see this film, I would. The acting is terrible but I can see the story working in some way. if it wasn't in this film. do yourself a favour and watch something else.","user":"jamesallanward","rank":[41,61]}]