[{"title":"Nevermind the bad reviews","rating":7,"date":"10 May 2016","review":"It's not state of the art, or Oscar-winning material, but........ The movie is quite entertaining... it's everything that we should expect from the same studios that brought us Z-Nation. If you like mindless action, with lots of blood and gore, and you are just looking for something to entertain you for some time, you can't go wrong with Dead 7.<br><br>OK, the acting is not good (but I've seen worst), the plot is weird, and it's a TV-movie, without top-notch FX... but still, if you're not expecting Zombieland, Dead Rising, Night of the Living Dead or Dawn of the Dead, you will have a very nice time.<br><br>Try it out.","user":"dctr666","rank":[19,24]},{"title":"Oh Carter","rating":1,"date":"8 June 2017","review":"Being an old fan of Nick Carter, I decided to check out the zombie film, Dead 7. And well, let's put it this way, he needs to stick to singing. <br><br>The acting was terrible! One thing I noticed about this movie is that there were different types of accents that the actors were trying to pull off. Yet they would seem to forget they were in character. One minute one of the male actors, if you can call him an actor, sounded like he was in the old west (where this movie is supposed to take place) and then the next he didn't have an accent at all. And I'm not talking about one actor in particular. There were a few laughs. Joey Fatone (*NSYNC) with his lover, the Rum bottle, and AJ McLain (Backstreet Boys) as a Joker type villain. The only thing good about Carter's performance was his looks. He didn't do well in his other films so making another was a huge mistake. Other stars of this failure include Jeff Timmons of 98 Degrees, Erik- Michael Estrada of O-Town and one of the 90's decade's most talented singers (at least in my opinion) Jon Secada. With TV host Carrie Keegan playing the female lead. <br><br>The plot doesn't start off well, and it doesn't develop at all. It's easy to root for the \"boring\" zombies. I'll say it again, Nick Carter needs to stick to singing. Maybe he had a good idea when starting this script and it didn't turn out well. Or maybe he just wanted to help himself and his fellow former heartthrobs get some extra dough. <br><br>I hate to be another viewer giving this film a bad review but let's face it, this one should have stayed back in the Old West where it came from. One should be used to bad Syfy channel movies by now! But this is one of the worst. I give Dead 7 1 out of 10 Washed Up Boybanders.","user":"ctldy","rank":[5,5]},{"title":"90's Hearthrobs Make a Movie","rating":2,"date":"3 April 2016","review":"If you think that a bunch of 1990's boy-band singers getting together to make a zombie/western movie in 2016 was a bad idea, you'd be right. It looks and sounds exactly like what you'd imagine; just awful.<br><br>Looking at the disparity in the votes between male and female on this one makes me think a large number of women, who were about 14 in 1995, checked in to scope out their old crushes, and they still have a thing for them (it would explain all the \"10\" votes for this). Nothing wrong with old infatuations, but I think their fond memories of these guys had them overlooking some very big flaws in Dead 7.<br><br>A good screenplay is the basis for any good film, and good actors are needed to get those words effectively on screen. This movie has neither of those things. In fact, this is just tough to watch all the way through. There is nothing here to draw your interest. No sympathetic characters, no witty banter, not even any fancy CGI. I'm not a big fan of desaturated color in films either, and Dead 7 really overdoes it. If you want to take that much color out of a film, just make a black and white movie.<br><br>The point is, unless you were a huge fan of the Backstreet Boys, 'NSync, O-Town or 98 Degrees, you're just wasting your time watching this.","user":"Calaboss","rank":[22,30]}]