[{"title":"Very Original. Best I've Seen In A While","rating":6,"date":"22 November 2017","review":"I won't go into the plot because it is already posted on the IMDb page and that makes a boring review. I'm also not going to spoil it for you, but what I will tell you is this.. I watch mainly independent and foreign films because mainstream Hollywood is too predictable and repetitive. I found this film to be very original, I could not predict it at all. That alone made it worth the watch for me. <br><br>I guess you would call it a drama, but it had a very creepy feel which kept me intrigued. It did have a slow start and you only see three people throughout the entire movie, but there is still plenty of dialogue. What I didn't like is that I felt right when it was hitting its best moments it ended. This obviously means it did leave a couple of unanswered questions which was slightly disappointing. Nonetheless, it's very hard to find an original movie these days and these one gets points for that. We've Forgotten More Than We Ever Knew is definitely worth a watch. It's only around 88 minutes so what do you have to lose?","user":"Amira-Says","rank":[32,39]},{"title":"Its a metaphor","rating":7,"date":"7 April 2018","review":"***Spoiler warning***<br><br>\nThe entire movie is a metaphor for relationships and lying/cheating.<br><br>Here is as brief as I could explain it without discussing every single moment of the movie. <br><br>The movie starts out on an established relationship where the two people are co-dependent on one another, but they arent equal partners. The man tells the woman false stories to encourage her to go on, similar to how some men tell women lies about the great life they will have together after they're married. The woman is dependent on the man for these glimmers of hope but she performs the domestic roles while in the wild, such as providing meals and even going so far as to give up things (like the empty water can) so the other person can be happy. <br><br>The woman is gravely injured, and while the man returns to her, he leaves her (more symbolism) alone in the night and goes to the massive towers that are within a VERY short walk. These towers represent a false version of the promised life the man kept giving, but hes tired of dealing with the hardships so he just suggests accepting this new, easier life, rather than the life the woman was constantly promised by the man. This is a betrayal of trust and likely also a metaphor for the \"where are we\" talk that occurs in complicated relationships. The woman doesnt want to accept this new, easy life, but instead she wants the life that was promised to her, but eventually relents and accepts it too. <br><br>The two massive buildings also represent the emptiness of their relationship, with scenes of past memories still there but without the two people each scene would otherwise show. The banquet hall is more important to the woman as its like a photo album of happier times together, whereas the man focuses on the happiness of other peoples relationships.<br><br>Another theme are the mirrors, in which the only other character, who will become a replacement relationship, happens very early in the film after the woman first enters the banquet hall. Though it is front and center, his reflection is easy to miss. <br><br>The rest of the movie continues the themes of a broken relationship as the man withdraws into unimportant hobbies, such as reading and listening to the tapes, while paying little attention to the woman. He also seems to be more interested in other people being happy together than his relationship with the woman. The woman, on the other hand, continues to search for a greater meaning and purpose. Also, one of the first rooms the woman finds after the banquet hall is the kitchen, which mirrors her role in the wilderness, and which she continues in during the film, as traditionally the kitchen and providing meals to her man was seen as a \"womans place\".<br><br>At one point, after a sexual encounter with the man, the woman wakes up and has morning sickness, suggesting she is pregnant, but the man does not know this. After this, the woman changes drastically, shaving her legs, applying make up, and wearing increasingly revealing and sexy clothing. She literally \"brings to life\" the odd statue man with her stories and affection, which threaten the relationship between the man and woman.<br><br>At the end, the man and woman return to how things were, wear comfortable but practical clothing that is reminiscent of their earlier clothing before they arrived at the twin buildings. They leave the safety and comfort of the buildings for the harsh reality of trying to reach a \"home\" that the man promised them, without knowing if they will ever truly reach it together. <br><br>Throughout the film, mirrors play a key role in many things, showing us the \"reality\" of things, revealing hidden places and characters, and informing the woman (and the audience) that something isnt right here, and that the mirrors are a key to it. The man even discovers this early on when he sees a room in the mirror but cannot reach it in the real world. He quickly dismisses this mystery but later this knowledge helps him reach the woman when she is in a new abusive relationship. <br><br>For those of you who are confused or disappointed by the film, try to see it in a slightly different light than the surface level or gave you a better appreciation of the film and allows you to shrug off the unanswered questions of the sci-fi elements. <br><br>In summary, pretty much the entire plot and everything that goes with it is highly metaphorical with relatively few things that dont fit. While watching it, I kept seeing the metaphors but it wasnt until I checked the reviews and re-watched the earlier scenes that reinforced my view. What happened to other people isnt important, nor is the answer to 'what is the odd man?', at least not in the context of the sci-fi story. The man makes the woman reliant on him, chasing others away from their relationship, creating a sense of solitude between the two. The odd man is groomed by the woman to make him look more dashing in his suit rather than his old baggy clothes he once wore, and she slowly builds a new relationship with this quite, blank slate of a man until she discovers he is abusive.<br><br>I hope this breakdown helps some of you out there to see the movie beyond its surface level.","user":"jwcstorage","rank":[24,35]},{"title":"Never underestimate your need to each other","rating":7,"date":"19 July 2018","review":"Entire movie is full of metaphors about relationships. I usually don't like that much metaphors but I found this film very well crafted. Even though I couldn't get some of metaphors meanings. But thanks to the IMDB reviewers I will be able to understand most of them. Although some of them still stayed in the dark, nevertheless I like a lot of things about this film. I did not only understand it also be able to feel it through out the movie. This was truly astonishing. After finishing the watching I could not stop myself thinking about it. Relationship are in their best through out searching, building something together but in comfort zones everything starts to get ruin easily. I guess this is very true. So this film makes its points by reminding us something very important for the healty relationships. Stay on the road of searching and never underestimate your need to each other.<br><br>1# Mirror used very creatively. To understand another person feelings &amp; needs are not easy. Scenes like looking mirror and seeing something is not there reminded me that when our internal look reveals things but we can't find a way to express them or find ways to solve them, we find ourselves right in the middle of everything, puzzled, helpless. Usually we try to ignore this facts untill some traumatic events force us to do something about it. His love to his wife makes him find a very interesting way like going backwards while looking that broken mirror piece, (by going backwards also mean doing things obversely) and surely his wounds not stopped him doing everything opposite whatever he wanted or believed for. I found this very touching indeed. <br><br>2# Firstly the man healed the woman's wounds by his regrets, may be even wraped this wounds with his regrets. The effects was astonishing and when the man had broken to the pieces and had a deep cut, he let her healed him.","user":"sukrancetik5","rank":[7,9]}]