[{"title":"A more balanced and fair argument than it's given credit for.","rating":7,"date":"15 September 2015","review":"Despite his over productivity and well-known biases, Alex Gibney is always an essential documentarian to watch, especially since his Oscar winning film. He's already made the best documentary of the year thus far with his attack on Scientology, Going Clear, anything else is icing on the cake. While that film is a revealing call to arms, his Steve Jobs film The Man In The Machine tries those same tricks but it's coming a little too late, especially as the film frames itself over the outpouring of grief over his death. Not that the film is a poor effort. As Going Clear illustrated what we already knew, so does this film. It's not a 2-hour attack as reported - along with the justifications to question society's hero worship towards him are all the reasons he's beloved and considered a visionary that changed the world. Those later Apple announcements with the awed cheers for Jobs earn a similar spine-tingle as the Scientology congregations in Going Clear. It's more endearing here.<br><br>The negative reaction to this documentary's criticisms almost highlight that hero worship he still harnesses, but it's difficult to argue over the hard facts of his bullying, both minor and major as documented here. Ultimately, Gibney poses the film as a reflection on our emotional connection to our technology and how that extends to its creator, but while it's an interesting conversation it results only in vague existentialism asking similar questions that he started with. Yes, we've grown dependant on our tech and Jobs' death sparked fear that innovation will slow, that's more or less where the grief comes from and nothing to do with Jobs' life or business tactics. His image as an icon is Goliath and this film is a little David and it offers a small but fair chiseling of that towering statue. It's not Gibney's best work and it spends this year in the shadow of two significant films, but it's still solidly produced and worth a watch for an insight into Jobs' life, especially with Danny Boyle's biopic on the horizon.<br><br>7/10","user":"Sergeant_Tibbs","rank":[33,33]},{"title":"All these reviews/reviewers are mental.","rating":8,"date":"6 September 2015","review":"Steve Jobs: The Man in the Machine is being accused of not being a very uplifting view of Steve Jobs himself. The interviews and actually footage of Steve Jobs speaks for itself. It's not mean spirited; it's actual events, conversations and scandals that took place. <br><br>Make no mistake, Steve Jobs was a brilliant man. This well-made documentary is self aware of his genius mind and how he controlled and oversaw every aspect from concept to completion of Apple corp, products and NeXT. It explored how he was David and took down Goliath (IBM) and now in the 21st century, has taken the rein as Goliath and isn't afraid to stomp on the little man.<br><br>Director Alex Gibney poses the question(s): Why are we all so obsessed with Steve? Why did we all mourn for a man we've never met? What emotional connection ties us all with our products to the man himself? <br><br>If you're interested in this type of pop culture, definitely check it out. Great perspective on a man and company that have changed/dominated our culture in many, many ways.","user":"pullmyfinger85","rank":[53,60]},{"title":"Now we get to see the Real Steve Jobs","rating":9,"date":"12 September 2015","review":"I loved the parts about how they built \"blue boxes\" to hack the phone company way before they ever considered Apple. I'd read about Captain Crunch (John Draper) and the phone hacking boxes about 50 years ago when I was in college and this just confirms the story which was also published October 1971 issue of Esquire magazine. <br><br>Steve Jobs was not a very nice guy. He ripped off his friends, denied his own daughter, and bullied his employees. He was also a genius and designed excellent products that have changed the toy-box of America and the world. Without Steve Jobs ripping off Palo Alto Research Center (PARC) of their graphical user interface, the mouse, laser printers, and ethernet, these technological advances might have languished on the shelves of that Ivory Tower for years before they made it to the public market place. And remember that Steve Jobs designed the first real usable smart phone and pocket media player. <br><br>Unlike other Steve Jobs movies, this one is a documentary with real camera footage of the two Steves (J &amp; W) in their early and later days. The Dylan musical background made me want to skip back to play some songs again and again.<br><br>This movie does not glorify nor defile Steve Jobs, but only tells it like he really was, with home movie footage to back it up. Very well done and easily held my interest and attention.","user":"ezriderz","rank":[21,23]}]