[{"title":"This is as Generic as it gets","rating":3,"date":"27 November 2019","review":"Me and 3 other friends went to go see this at a dollar theater as a joke knowing it would be bad. But to my dismay it was actually not as bad as i expected it to be. There was actually a few things to appreciate (as minimal as they were). For one the voice acting ranged from decent to really good. I really enjoyed John Cleese's performance as the main antagonist. It's like he knew how ridiculous his role as a mechanical walrus was so he chose to have as much fun with it as he could, and it really does show and it was his performance alone that saved this movie from being completely awful. But unfortunately that's the only real redeeming quality this movie has. The rest is utter garbage. I guess where i'm getting at is i didn't hate this movie in it's entirety surprisingly. It's just so laughably generic. You could make the argument that this movie was intended for children and not four 17 year olds, but even then i think the movie failed at that cause we never heard one chuckle from the audience and a 3rd of the families there walked out of it. At least me and my pals got something out of it.","user":"MonkyMangler","rank":[11,13]},{"title":"I think \"underwhelming\" is a fitting word","rating":3,"date":"21 December 2019","review":"A lot of people have described the film as \"generic\", which I don't disagree with, but at the same time, I think \"underwhelming\" is a good term. So much aspects of the film, ranging from the plot, the characters, the setup, and so on - just feel so uneventful. I imagine they had difficulty making this into a full-length film, because there's nothing remarkable to really say about so much aspects.<br><br>The voicing cast is pretty good, I'll admit, so that's at least one plus I can think of, and if I had to think of another, I guess the character designs aren't too bad either, but other than that, there's not much special aspects of the film.<br><br>It's not a horrendous film, don't get me wrong, I mean, it's not \"Foodfight!\" level of bad, however, it's also fairly below average too. I think it would've been to have the film as a TV special or anything similar, because it really struggles to present itself as a film.<br><br>Granted, I know the film probably isn't intended for 18-year olds like me, however, the film has so much wrong with it that I don't think a lot of children would feel particularly interested, because the film just feels like something that's already been done before, and in much better ways too.","user":"gavintheshiba","rank":[3,3]},{"title":"It's a waste of time and money","rating":1,"date":"15 December 2019","review":"The characters are unlikable and bland. The animation looks cheap and the story is clichéd. I do not recommend this movie.","user":"jamesgrove-73570","rank":[3,3]}]