[{"title":"Could have been so much better with its great premise","rating":5,"date":"1 July 2017","review":"The film is an underwhelming, underachieved Portuguese horror film about (without giving away spoilers) two people who meet each other at a popular suicide spot after going there on the decision to commit suicide. I really wanted to give this film a higher rating because it (again, without giving away spoilers) had a great idea but it was just clumsily done falling into cliché horror tropes that really didn't serve it any good. It feels like exposition that initially has good premise but just can't argue to save itself. The black and white cinematography serves the polar motives and overall mood nicely with emptiness and shallowness but the film disappointingly fell apart when it could have taken a great idea so much further with greater meaning and better execution.","user":"williammjeffery","rank":[8,9]},{"title":"An intriguing if overall disjointed affair","rating":7,"date":"18 October 2017","review":"Meeting in a strange forest, a disparate couple comes to a sacred spot in the forest looking to end their lives in a location chosen for the same feat only for their troubles to start once she takes matters into her own hands and forces far more pain and suffering on him than he expected.<br><br>For the most part, this was an exceptionally engaging and enjoyable effort. One of the film's better qualities is the fact that there's a rather profound and chilling nature of the material present throughout here. Being filmed in black-and-white gives this a far more evocative and poignant feel to coincide with the subject matter, for this one is so deeply rooted in Catholic guilt that the two are blended together in absolutely stellar quantities where they grow closer together due to his past moves this along nicely. From the guilt he experiences over failing his family and not preventing his daughters' death to the general callousness regarded for life is allowed to come together in the way they show this being filmed as there's very few wasted shots or potential throughout here with everything intertwined throughout here. The woods are haunting and disturbing, the desolate nature is truly felt and the entire segment has a realistic tone that is quite engaging as it's a brief section of the film that doesn't feel anywhere near as long as it does which makes it stand out extremely well. While nowhere near as potent, the film's second half is a strikingly fun and enjoyable stalker effort with the grieving family completely unaware of the actions that have taken place in the forest. This stellar home-invasion effort features some absolutely fun moments, from the initial scenes featuring them being followed home that is quite creepy, her early prowling around the house which gives this a rather eerie feel to the actual attack on the family members themselves that hold this section together, there are some rather interesting and enjoyable ideas throughout here. This is perhaps the kind of strangely art- house take on the setup which is unique and gives this a different enough take on the style by itself which gives this the kind of appeal anyway.While these here work for the film, it does have a rather problematic feature about it. The film's main problem is that there's quite a differing tone present throughout here that doesn't really do this much favors. Going from the first half which is a solid and introspective take on the nature of suicidal guilt and what's going through a person's mind, this naturalistic take vanishes in the second half which just screams to belong in a different movie. It's all way too scattershot and varied in what's going on and doesn't make any sense what's going on which is a far cry from what happened previously, never offers up anything about what's going on and just makes for a baffling series of actions that don't connect at all to what happened since the entire sequence feels so different from what came previously. It's the main topic holding this one down.<br><br>Rated Unrated/R: Graphic Language, Violence and intense themes of suicide.","user":"kannibalcorpsegrinder","rank":[4,7]},{"title":"My Review Of \"The Forest Of The Lost Souls\"","rating":10,"date":"1 August 2018","review":"The film's premise focuses on the dark nature of people who contemplate and act upon thoughta of suicide. Lopes explores these \"lost souls\" in a well-paced, arthouse style. Shown in black-n-white \"The Forest Of The Lost Souls\" places the macabre nature of his subject material upfront, while maintaining a sensitive heartfelt approach. The film never meanders into exploitative ground.<br><br>The film isn't a thriller in the mainstream sense. There is no shock or gore and the pace never really hits the high octave levels of horror, but Lopes' film never intended to be that kind of movie. Instead it is a chilling, slow-burn character study which develops into a psychological overture of sorts. The dialog is minimal but when present, very substantial and compelling. The cast bring these characters to life and worthy of investment. And the twist that happens midway through is brilliant.<br><br>Overall \"The Forest Of The Souls\" is a well thought out slice of expressiveness. Created solely from the point of view of arthouse, the film is intended for a select audience. Mainstream, non-adventurous, horror fans will not enjoy this one. For the rest, especially those who are into exploring different storytelling mediums, this is a masterfully, dark and captivating slice of macabre.","user":"ASouthernHorrorFan","rank":[5,13]}]