[{"title":"A Winter Wonderland","rating":8,"date":"15 September 2016","review":"Although Romanian cinema has been 'mainstreaming' of late, this year has brought some old-school/new-school movies received to widespread critical acclaim, like Cristian Mungiu's Bacalaureat (Graduation) or Bogdan Mirica's Caini (Dogs). Both pictures, alongside Puiu's Sieranevada, were premiered at Cannes and between them they picked up the Un Certain Regard prize (Dogs) and the best director prize (Mungiu). Interestingly enough, Sieranevada will be Romania's push for the Academy Awards Foreign Film category, in spite of being the most demanding of the three movies. <br><br>At almost three hours' breadth, preponderantly shot inside an apartment of fifty square meters and with more than ten characters coming together for a forty-day memorial service since the passing of the family's patriarch, it amounts to a real-time experience of the event. There isn't a lot of narrative to go about: we start with the oldest son, Lary, and his wife, Laura, dropping off some shopping and organizing the evening for their child, before setting off to the family apartment, where everyone else is gathering. In spite of being late, most guests arrive after them, until the apartment is overflowing with a heterogeneous, inter-generational group of people and their many opinions. The event takes place just around the Charlie Hebdo shooting, which sets the stage for a prolonged conspiracy theory discussion about 9/11. But seemingly countless topics are sprung to life, whether in the bedroom (the story of an abusive husband), in the kitchen (communism versus monarchy versus religion), in the small office (the memorial service traditions), the dining room (the convergence point for most discussions) or even the tight hallway (an inebriated stranger dropping in), from where we constantly pivot. We only escape the apartment once and, really, it makes you wish you were back inside, after a vicious public scene caused by a ridiculous triviality. <br><br>And so it goes on for most of its runtime, brimming with family tension, personal frustrations and everyday minutia. If anything, Sieranevada has no actual climax, but it elevates smalltalk to an art form, masterfully managing an engrossing and complex conversational ebb and flow between characters you struggle to familiarize yourself with. It will take quite a while to get to grips with who is who and how everyone is related, which is part of the reason why the movie is so demanding, requiring your attention throughout. But if you stay tough, you'll figuratively be eating dinner with them by the end, as a member of this daunting family event. <br><br>Puiu creates a claustrophobic atmosphere within an oppressive, environment, whether inside or outside the apartment. To some degree, the viewer becomes attached to Lary, who leads us through the movie and mostly stays above the bickering and the conflicting undercurrents. He is a stoic figure and creates a sense of being the only 'normal' person in the room for most of the time, the adjudicator, in this fresco of the harrowing micro- and macrocosms of present-day Romanian society. The backdrop of the memorial service is decisive, because it sets the expectations of a sombre tone, yet the ensuing moments are anything but sombre. In essence, this contrast between excessive formalism and improvisational realism is the defining conflict of Sieranevada. It is also the cause for so much strife and malcontent in Romania, as we fail to either commit or compromise, feeding the urban anxiety of big- city life. <br><br>Still, this is not a movie for any time of day or any state of mind. The conversational authenticity is fascinating, but it wears you down, just like when you're invited to a reunion with a bunch of strangers and sit silently in the corner. It makes you want to shout out, but you are too foreign to do so. The nearly 180 minutes it stretches over makes it hard to keep the momentum going at all times, with the last quarter suffering the most because of it. And with all the arising themes, you will need at least some understanding of Romanian clichés and history to get on board quickly. <br><br>Overall, however, I feel it is worth the time, because Sieranevada feels true. It's a bit of a nightmare, sure, but it also manages to find and weave its story with quality fabric, highlighting meaningful contrasts between society, family and the individual and their 'forced' cohabitation. And it is ostensibly a universal story about the inner workings of family life, a hardcore version of movies like Margot at the Wedding or August: Osage County. With any luck, you will also share in Lary's laughter at the end.","user":"tributarystu","rank":[41,55]},{"title":"Not for everyone","rating":10,"date":"30 October 2016","review":"There are two things you need to be willing to embrace before you watch this film. First, the film is not going to make the connections between the characters easy for you. If you are a lazy viewer who is not paying close attention to the dialogue or you do not grasp the connections between the various dramas that are played out, you might be frustrated with what superficially appears to be a lack of direction and feel the film is \"pointless\". Second, the film is EXTREMELY Eastern European in character. If you want a Hollywood ending you will not find it here.<br><br>However, I simply love films like this that propel you into a difficult family situation and spend most of the film time there, allowing you to try to figure out for yourself what's going on. \"The Godfather\" is one example; I was also a huge fan of Roman Polanski's \"Carnage\". For people who like that kind of thing this film is a huge treat. It is only at the very end, after the slightly odd car monologue by the main character, that you really feel satisfied with what the film has accomplished and that you have come to understand a subtle coherence within the mess of individual failed narratives. Every character in this film is a self-actualized, 21st century individual who has come up with their own personal story about how the world works. The film's plot makes that obvious, but the remaining questions are up to you: where are the lies? Where is the truth? What happens to the main character at the end? This is a rather beautiful puzzle to behold.","user":"sabertooth-tiger","rank":[25,37]},{"title":"Only for eastern europeans, I guess","rating":10,"date":"29 August 2018","review":"I don't know why but I found this movie really good. It resembled to the the high school book I had to read in my time, Enigma Otiliei or like Morometii book &amp; screen play. \nLike all Romanian movies, it has that drama-parody of being a post-communist member; like all the good post-revolution movies. This movie is from the same category. But! And there's a huge \"But\". This movie has a really tangled and well-structured story line. The characters are really complex. I loved the \"detailed\" small-talks that took place alongside the main story. Also, like many Romanian families, you have that huge abundance of relatives that you have to deal with. You have that \"It's family!\" saying that your mother told you every time you couldn't stand your cousin when you were little. Also, all the actors seem to play their parts really well. I've seen almost all the good Romanian movies and I can say that these are some hardcore actors. They fit so well with their characters and their performance is almost perfect.\nYes, it has the downsides that all Romanian movies have: the static scenes and the bad sound quality. You have to have subtitle otherwise, most of the time, if you are Romanian, you won't understand a word. \nAll of this being said, enjoy! It's just a pure South-Eastern Week-end story event!","user":"mihai-mirosanu","rank":[4,5]}]