[{"title":"There's only one Adventures in Babysitting....","rating":3,"date":"12 April 2018","review":"....and this is not it. Where have all the Hollywood writers gone? Is everything now just a remake? Are studios just lazily taking short-cuts to profit earnings? I don't know who decided that one of the most quintessential 80s movies needed a remake for the pre/early-teen Disney generation. Somethings should not be touched. Elizabeth Shue's version of Adventures in Babysitting is absolutely one of those things. The writers took the script of the 1987 version and tweaked it jusssst enough so that kids today could find enjoyment and in doing so, they created a poorly acted cheap thrills forgettable TV movie that fails to capitalize on the legendary status of it's namesake. For what it's worth, I'm a parent and I watched the original version.....and this version......with my kids. They enjoyed the original version more than this one (bonus points for the Thor lookalike). There's no reason anyone should have ever made this film and there's no reason you should ever feel the need to waste an hour or so watching this version as long as the original version still exists.","user":"MinistryofDoom","rank":[14,16]},{"title":"Don't mess with the babysitters","rating":5,"date":"24 June 2016","review":"For its 100 made for TV movie the Disney Channel launched its publicity machine for about six weeks. I'm not sure there wasn't one person within the range of a Disney affiliate in the world that did not know that this remake of the 1987 brat pack comedy Adventures In Babysitting. Nothing beats the Disney publicity machine when they want to push one of their products. <br><br>Having said that this was an easy to take teen comedy with Sabrina Carpenter and Sofia Carson as rival babysitters who lose one of their charges when she runs off to the big city alone, the big city here being where the film was shot Vancouver. Carpenter and Carson have to team up though they are poles apart in personality. Carpenter is most uptight, especially where heartthrob Kevin Quinn is concerned. Carson is a free spirit who seems to drift not knowing what she wants out of life.<br><br>Carpenter, Carson, and Quinn are Disney Channel regulars and young Max Lloyd-Jones who plays a most hunky police officer shows every signs of becoming a Magic Kingdom mainstay. The film borrows quite liberally from the Home Alone franchise where a bunch of McCauley Culkins outwit a pair of singularly inept crooks who want Carson's camera.<br><br>Nothing special here, but Adventures In Babysitting Redux is entertaining enough.","user":"bkoganbing","rank":[10,14]},{"title":"Predictable Pandering, Pandering, Pandering to the 4 and 5 year olds","rating":10,"date":"10 February 2017","review":"First off, this remake was completely unnecessary, but EVERYTHING has a remake/sequel now, so yeah. The Disney Channel has been playing a heavily censored version the original 1987 film for years now, so I guess it was time to make their own G-rated \"updated\" version with cell phones and all that. They throw in quotes (\"I'll guard her with my life\") and scenes (like singing rap instead of blues on stage) from the original.<br><br>Whether comparing it to the original or as a stand-alone TV flick, it is still lackluster in every way. The characters are such clichéd, forgettable cookie cutters that you can see everything coming from lightyears away. The two babysitters are total opposites, but oh no, will they have to learn to get along for the kids, then end up becoming buds and taking selfies together at the end? Will they each get a BF with zero development and personality? Will the emo girl also get a generic BF and stop being an emo because she has a \"deep\" 20 second talk with him? Will the JonBenet Ramsey wanna-be have to do the babysitter's hair at the end to impress a guy?<br><br>Of course. I rolled my eyes so many times I lost count. Sure, the plot of the original was far-fetched, but this one is so unbelievable it's almost Spongebob. I know it's intended for kids, but that doesn't mean we should treat them like idiots and spoon feed them pandering, predictable crap.<br><br>The original balanced both dark and lighthearted scenes, so it's entertaining for a wider audience. This one, however, caters to only the youngest viewers, making it intolerable for anyone over the age of 7. As if the characters and plot aren't bad enough, there are a lot of loud obnoxious scenes filled with childish humor that will make it that much more grating for parents to have to listen to. I gave it 2 stars because the only use this movie has is to babysit your 4 year old for 90 minutes while you do house chores. Aside from that, the only people I see enjoying this are tweens who are fans of the two lead actresses and their previous Disney Channel roles. They do try, but they're not given good material to work with.<br><br>For everyone else: stay far away from this one, ESPECIALLY fans of the original. It will do nothing but annoy you.","user":"Kukui-Seed-Butter","rank":[7,9]}]