[{"title":"It's more like torture porn than comedy.","rating":17,"date":"17 May 2016","review":"Not long after resolving their issues with the Delta Psi Beta fraternity and its devious leader Teddy (Zac Efron), Mac (Seth Rogen) and Kelly Radner (Rose Byrne) agree to move to a bigger house in anticipation of their new baby girl. But after they enter into a thirty-day escrow on the sale of their old house, the Kappa Nu sorority takes up residence next door. Afraid that the rowdy group will scare off their buyers, the couple initially tries to reason with leaders Shelby (Chloe Grace Moretz), Beth (Kiersey Clemons), and Nora (Beanie Feldstein), before soon realizing that their problems explicitly echo the previous conflict. As Mac and Kelly attempt to get the girls evicted, and Kappa Nu fights back to stay put, both sides engage in a free-for-all of lying, cheating, and stealing that quickly forces everyone involved to decide just how far they're willing to go to win.<br><br>It all begins with awkward intercourse and queasy stomachs, wielding the exact same bodily-fluid humor found in the previous picture. It's even more extreme, however, as sex toys, marijuana paraphernalia, colorful cursing, and the exclamation \"black cock!\" is paraded about in front of the Radner's toddler. Since \"Neighbors 2: Sorority Rising\" is aiming for laughs through shock value alone, it's not surprising that nearly every scene is cringe-inducing, like a moment from a torture-porn horror movie. This feature dares audiences not to look away from the repulsiveness on screen, hoping that they'll find the gross-out gags to be enough of a bombshell to distract from the utter lack of genuine humor.<br><br>And if the graphic male nudity, tampon prank, and bedbug caper aren't enough to provoke people into covering their eyes in fear, the depiction of friendless, uncool college girls might just do the trick. Essentially blending preteen, juvenile, sleepover party frolicking (showcasing the sincerity of a Barbie movie) with the hard R-rating of a raunchy adult comedy, this movie never really knows in what age group its target audience ought to reside. With a major sexism motif circulating around all the race jokes (the role reversal of prejudicial black cops violently apprehending white crooks before taking it easy on black drug dealers is the funniest routine in the entire project), the religion jabs, and the Holocaust riffs, it's difficult to peg whether or not the movie is even aware of the messages being delivered. Young versus old and the naive versus the experienced seem like worthwhile contrasts, but the script never focuses on one idea long enough to land a memorable line. It does, however, repeat the same slapstick gimmicks over and over again, completely uninterested in their effectiveness the first time around.<br><br>It may have been a novel idea to switch from a fraternity to a sorority for this sequel, enabling the filmmakers to repeat nearly everything witnessed in the original but from a slightly different perspective; but the basic concept is never fleshed out to the point that it develops into a significant plot. In fact, the funniest moments are the unrelated, extraneous conversations that fill up space between physical actions. Just like the previous endeavor, returning director Nicholas Stoller is more concerned with making viewers momentarily uncomfortable than in crafting a movie that can be remembered beyond the start of the closing credits.<br><br><ul><li>The Massie Twins</li></ul>","user":"GoneWithTheTwins_com","rank":[113,154]},{"title":"One of the worst comedies ever made.","rating":1,"date":"21 May 2016","review":"Just when you thought they couldn't top the mindless nonsense in Neighbors along comes Neighbors 2, which seems to have been written by a 12 year old on weed in about four minutes. There is basically no plot other than the couple from the first movie is selling their house and by some means becomes enemies of the fledgling girls sorority next door. The rest is just them trying to hurt each other with even more implausible scenarios. The acting is robotic and the lines they have to say are some of the worst ever written.<br><br>At one point the girls are openly selling illegal pot from a booth at a school event and instead of calling the cops the \"adults\" decide to steal it from them which then turns into some sort of scavenger hunt for this giant bag of weed.<br><br>As in the first movie the sorority breaks about 25 laws including robbery, breaking and entering, sexual assault, theft, etc that the adults could have called the cops on and had them arrested. But that would have ended the movie 20 mins in.<br><br>At one point the girls steal all the belongings out of the adults house and start selling it at a garage sale. The adults say they can't call the cops because they stole the girls weed. Which makes no sense.<br><br>Avoid this unfunny disaster.","user":"headly66","rank":[117,161]},{"title":"Nobody laughed.","rating":1,"date":"22 May 2016","review":"I'm serious, literally no one in the theater laughed. There were a very few chuckles but not a single laugh. The movie was like torture because they kept using the same joke over and over and over again. A joke that wasn't funny the first time it was used was delivered multiple times. The first Neighbors movie was funny, not the funniest movie made or anything like that but pretty funny. This movie is beyond lame. Remember when I told you they kept using the same jokes over and over again? There was literally a 10 minute timeframe in which the movie used the same joke about 5 times. Around that time I looked at my watch and saw that I was only 20 MINUTES INTO THE STUPID MOVIE! Basically, the problem with this movie is that it isn't funny and kept reusing the same jokes. They even use jokes from the original movie multiple times. It was just plain sad. Another thing, I think SETH ROGEN HAS BECOME THE NEW ADAM SANDLER. He keeps playing the same character in very single movie, and he has finally and completely wore out his welcome. This will be the final time I pay money to see a Seth Rogen movie. Another thing I learned is that Chloë Grace Moretz is officially an awful actress. Everyone loved her as Hit-Girl and ever since KickAss she has gotten a free pass from everyone (including myself) but in this movie we get to see a ton of her acting and it is like watching rejected scenes from a TWILIGHT MOVIE. You get sick of her after about 40 minutes. Man, I know everyone involved in this movie did it for a paycheck but I think it is ultimately going to hurt more than a few careers. I WARN YOU, SAVE YOUR MONEY AND DO NOT PAY A PENNY TO WATCH THIS MOVIE. IT SUCKS. You've been warned.","user":"TheOneThatYouWanted","rank":[189,269]}]