[{"title":"James Franco fails to deliver the best in Steinbeck's story","rating":6,"date":"27 February 2017","review":"\"In Dubious Battle\" was one of the movies I wanted to see more than any other film from Hollywood in 2016. My original enthusiasm faded quickly only after 10 minutes into the film.<br><br>Let me explain: \"In Dubious Battle\" is one of the best Steinbeck novels, as important classic as its companion piece, the unforgettable \"Grapes of Wrath\", which not only happens during the same time period, also deals with the same issues of this era. \"In Dubious Battle\" hasn't been filmed before, for obvious reasons, as it has much more clear political message in it, as the main characters are members of the American Communist Party, who are sent on a mission to fight for fair wages among the apple pickers, who are mostly vagrant families and other victims in the downfall of the economic collapse, which lead to the Great Depression. Unlike \"Grapes of Wrath\", \"In Dubious Battle\" is mainly about how destructive and unfair the labour laws were during that time, which enabled rich land owners to exploit the destitute workers to the maximum, giving them basically wages which wouldn't have even covered the expenses of food and shelter.<br><br>However... I find it near inexcusable for what the writers and the director have actually done to this masterpiece of source material. Some of the most memorable scenes and events in the book, have been completely either written out or have been softened or edited into something completely different, which no longer does any justice to the original Steinbeck novel. This has lead to very visible and easily noticeable mistakes and clear errors in the production of the movie. There are totally unforgivable errors of fluid continuity via truly strange film editing, mainly in form of abrupt cutting, which even leave seriously weird time gaps: -As an example, one of the most memorable scenes in the book, is the first meeting between Al and the newly arrived Jim &amp; Mac, has been butchered to a bare minimum, which fails to deliver any of the originally intended importance of this meeting. This is the first truly odd of really weird cuts throughout the film, which leaves in amateur like time-lapses. There should have been a complete scene, where Al prepares for them a free meal out of sympathy and after being flattered, a hamburger steak with mashed potatoes and thick brown gravy, which is described meticulously in detail by Steinbeck in the book, using almost two pages to underline both the hunger of Jim &amp; Mac, and to establish the future important relationship between Al, his father and Jim &amp; Mac.<br><br>I would see the main culprit for this travesty being mainly the director James Franco. His direction clearly shows he doesn't seem to have any emotional attachment for telling this important story, which is evident in how much has been actually left out from the original complete story. Franco hasn't done anything to cover the obvious and weird time gaps and missing events in this movie. It would be justified to say that Franco probably hasn't concentrated nearly as much as he should have. Could be out of interest or just lacking adequate motivation. In any case, I am not impressed with Franco's directorial work. He is still much better as an actor. As a director he has made silly mistakes and unforgivable editorial choices, which do effect the entire movie's atmosphere and how well the story is being delivered to the viewers. As it stands now, the movie lacks emotion, dynamic and empathy for the story or the characters.<br><br>The second fail point for this movie is its casting - Almost the entire cast of the main characters appear to be far from being motivated, and this has lead to a display of some of the most mediocre acting performances of 2016. The only exception to the rule is Vincent D'Onofrio, who is playing London, and even in his case, just barely. I find just about everything disappointing in this film, cinematography certainly isn't doing any justice to it either, and this could be possibly because the sets aren't in any way convincing that this is early 1930's, the camera angles are to put it mildly, unconventional, there are close shots, when the scene would have rather called for medium or even long shots and then there are long shots in place of close shots. In some places the seriously weird cutting disrupts even viewers ability to follow the story, as the cuts don't make any sense. The third low point is the soundtrack, which doesn't fit the movie, or the time-line, when the movie is supposedly happening.<br><br>Finally... Even with all the shortcomings in this movie, it is still watchable and even enjoyable (with strong reservations), but don't expect a clear and concise masterpiece. It works also much better for those people who haven't read Steinbeck's novel, but fails to convince most of the film scholars and academics, who will easily spot the many flaws in this production.","user":"FilmCuckoo","rank":[31,40]},{"title":"Despite Its Flaws Has an Important Message","rating":7,"date":"1 April 2017","review":"A powerful all-star cast, with varying degrees of screen time, in this film adaptation of a John Steinbeck book. It can drag at times and I felt it was overly long, but the message of the movie is quite important, in my opinion.<br><br>Set in 1933 (during the Great Depression), in the apple orchards of the Tongas Valley, in California, James Franco and Nat Wolff star as two radical organizers who infiltrate the apple pickers in that region to get them to fight back and band together against the landowners who are exploiting them.<br><br>The orchard owners will do anything to protect their interests and, as one would expect, the two groups will violently clash and chaos and bloodshed will ensue. I might note Vincent D'Onofrio gives a superlative performance here as London, a giant of a man elected to be the leader of the workers.<br><br>All in all, despite its flaws this movie serves as a good reminder of how bad things can get if the pendulum swings too far between the interests of business and their workers. In the seemingly rush of our Washington D.C. politicians to give free rein to corporations, perhaps this film can illustrate again that we're still fighting some of the same battles today some 80 years later.","user":"larrys3","rank":[12,19]},{"title":"Timshel","rating":1,"date":"9 July 2018","review":"Perhaps one day a faithful adaptation of Steinbeck's novel will be produced. This movie has nothing in common with the book it supposedly bases itself on aside from some names of the characters -- there's nothing wrong with the choice of cast -- and the setting -- the locations could have set the scene for a wonderful film.<br><br>The speech in Steinbeck's novel is authentic and believable. The scriptwriter could have transplanted it directly and with a little imagination expanded on it.<br><br>What a terrible shame!","user":"kahantzaddik","rank":[6,8]}]