[{"title":"50% of porn. 50% of cliche dramas.","rating":2,"date":"16 February 2020","review":"One of the worst films ever made on the face of the earth. A movie that nothing happens, everything is fake and meaningless, has no story, no plot, the sex scenes are bland and has the worst car chase of all time.","user":"MR_Heraclius","rank":[47,49]},{"title":"Fifty Shades Bored to Death","rating":1,"date":"18 February 2018","review":"I have to be honest. I am not a fan of the series. Nor the books nor the films. It just didn't speak to me. However... My better half insisted this will be a fun movie. She prepared me it is no Dostoyevsky we were about to see but god almighty was I in shock how far it went. This must be the least coherent, most half-arsed, pointless movies I have ever seen in this sharade we call life. The sheer boredom spread through the unbearable laziness of the script, the empty looks of the actors, the meaningless cuts, senseless sequnces of the scenes... I just couldn't believed it... This was greenlit by someone?! Good god. Made me miss Twilight...","user":"kofila","rank":[188,239]},{"title":"Well.. Black Panther still looks good, right?","rating":2,"date":"10 February 2018","review":"Here we go again..<br><br>I genuinely hoped.. there would've been change.<br><br>Sadly, I have to state the obvious: this is among the worst trilogies of film-making I' ve seen. <br><br>Acting? Bad. They were both there for a paycheck and nothing else.<br><br>Story? Well you see them getting married in the trailer.. and then you see her ex-boss picking up a gun, right? well there you have it. <br><br>Cinematogrophy: Worst than the first, but better than the second. Nothing to add there. <br><br>Dialogue: ... let's not go there..<br><br>All in all, i would give it a 1/10, because it was nice to look at some landscape for time to time. This review is short, because the movie was done short. it was bad from beginning to end, with horrible dialogue, with unstable emotions of both characters.. you get a sense of where this franchise couldve gone and done it right at the very end... but by then it meant nothing. god... I hate the writer who wrote it and I condemn writers like that back to wherever they came from.","user":"gangstah_vino","rank":[114,146]}]