[{"title":"The very last of the summer wine","rating":5,"date":"23 November 2017","review":"Just saw this in a film festival. Sadly it has the potential to be a good topical movie on cultural boundaries, integration and hypocrisy. We get arranged marriages, Sex for college fees, drug dealing, murder, sex tapes, poaching, family rows and a large dollop of last of the summer wine type scenes. It is very confusing and the editing is all over the place. Gabriel byrne's character is a bit of a mess. Characters turn up for a scene (his wife) and are never seen again. Gabriel byrne shoots some bottles of home brew and flies a kite. Dogs seem to mean something. The main female character is excellent but is let down badly by the rest of the movie. The Pakistani wedding looks like a bit of fun. The pivotal final scene is unintentionally funny and it involves taking a very very long time to drive a very very short distance. Will pass a confusing couple of hours.","user":"pauear","rank":[12,16]},{"title":"Haram","rating":12,"date":"12 March 2018","review":"A Pakistani family living in England. A patriarch who is holding on to the traditions of his culture, by forcing his two daughters to marry money. The oldest daughter Amber who is a lawyer, is living a secret life as a rich-man's mistress and is rebelling her patriarch dad, not to force her younger sister into a marriage, to the same man she herself got away from. Donald (Gabriel Byrne) is helping Amber. Donald has no knowledge of Amber's culture and what they call \"honour\" so it ends like it ends for many Pakistani girls who are dishonoured. \nThe first hour I had no clue where this movie was heading to. 2 times I was ready to leave this movie, but glad I did not. It is confusing yes, but I think this movie pictures the distance and understanding of the brutal patriarch Pakistan culture. A culture where a brother, a father or husband kills his daughter, sister or wife, in the name of something called honour? Disgusting yes, but most murders in the west are also related to \"crime passionnel\" or jalousie, ex boy/girlfriends ex men or wife's. \nNow one thing is sure, I need to see this movie at least one more time.","user":"franka_van_loon","rank":[6,8]},{"title":"Tedious","rating":3,"date":"2 February 2018","review":"I wonder what that was about. An excuse to make a movie?","user":"aerobix","rank":[13,23]}]