[{"title":"Really good but its not going to cause a seizure","rating":7,"date":"10 February 2017","review":"Really enjoyable but will not win any awards.<br><br>This is a thoroughly entertaining affair. Sharon Stone's character could be an allegory for Hillary Clinton; clinging on to ill-thought out causes that do more harm than good; perhaps Billionaire's have too much money.<br><br>The cast were generally unknown, particularly the horses, and there was no disappointment.The (unknown to me) leads were splendid. As was Sharon Stone whose character was preposterous - though credible through the prism of recent events.<br><br>I wanted it to last 20 minutes longer. The smallness of the film added to the experience. It wasn't Saving Private Ryan or Forrest Gump. <br><br>If you desire high-art then probably look elsewhere; if you desire feel-good ephemera then this is pretty good fodder.<br><br>I loved it.","user":"glindsay34","rank":[18,21]},{"title":"Second chances, love of horses","rating":6,"date":"22 May 2018","review":"This is a movie about second chances. If you're an animal , horse loving person, this is a hearty film about second chances. It's also surprising to see in the end credits that Sharon Stone is also the producer although her role in the film is more of the usual conniving queen bee. It's good to know that she gives way for younger, less established actors to shine.","user":"NikkoFranco","rank":[6,6]},{"title":"This is a pretty good family movie that talks about deeper aspects than the Hallmark movie I was expecting","rating":5,"date":"10 April 2017","review":"\"In ninety days you're going to lose everything.\" Stella Davis (Pham) has recently lost her husband and is in danger of losing her ranch. Looking for ways to raise money she decides to try and tame a herd of wild horses on her property and sell them. Needing help she begins to work with convicts in a rehabilitation program where they work with the horses. Things are going great until Meredith (Stone) shows up and tries to convince everyone what Stella is doing is a danger to the horses. This is a movie I wasn't expecting anything out of at all. I was thinking it was going to be a cheesy hallmark type movie. There's nothing wrong with movies like that, they just aren't my thing. While this film did have shades of that for sure this was much much better than I was expecting. It brought up some very interesting ideas and it made me think, which is something I wasn't expecting to do watching this. Overall, there are a few swear words in this but besides that this is a pretty good family movie that talks about deeper aspects than the Hallmark movie I was expecting. I liked this and surprisingly give this a B+.","user":"cosmo_tiger","rank":[8,9]}]