[{"title":"Beautiful soundtrack","rating":9,"date":"15 April 2017","review":"I'm a musician, and there is one thing I absolutely HATE: careless, sloppy, unsystematic soundtracks, especially in documentary films. I know that it's hard to discover good music, but: COME ON! If it's true, Traceroute had a *total* budget of $15,000. There are no excuses anymore!<br><br>A great soundtrack is more than just a collection of great songs. A great soundtrack pulls a story along while somehow effortlessly blending into the background. The right one can help define a movie; a terrible one can ruin an otherwise decent film.<br><br>Traceroute relies heavily on its amazing soundtrack to convey the mood of childhood and rebellion, nostalgia and counter-culture, traveling and arriving. There's a retro-electronic vibe present in most of the tracks, but also classical music, and all-time favorites like Vera Lynn's 'We'll Meet Again.'<br><br>I'm glad the track list is here on IMDb. I need it for my own road trips!","user":"Peervo","rank":[9,9]},{"title":"7000 miles of nerddom","rating":9,"date":"13 April 2017","review":"I discovered this documentary through Jason Scott, a digital historian and filmmaker, who is one of the people featured in Traceroute. Jason recommended the film, and now I understand why. It is a dense, colorful and challenging road trip through the history of nerd culture. Our host, artist and self-proclaimed nerd, Johannes Grenzfurthner shares his life, his obsessions and his worldview with us. I have to admit that I never heard of him before watching the film, but now I want to go grab a beer with him. Two thumbs up!","user":"korn-32204","rank":[9,9]},{"title":"From the Command Line to the Highway","rating":9,"date":"13 April 2017","review":"It's funny that I find myself explaining what \"Traceroute\" is, this command line utility that's almost as old as the Internet itself. Basically, it's used to show how your packages reach a certain destination on the internet from your computer.<br><br>Now I almost feel like using this movie to describe what Traceroute is. Johannes goes on a kind of coming-of-age journey though he's a full blown adult, tracking the origins and path of his own nerd personality through visits to friends, heroes and important landmarks throughout the US.<br><br>Johannes knows how to entertain using himself as the material as well as how to drag friends, associates and circumstances to round out the whole journey. Personally, I'm clamoring for a sequel!<br><br>(I'd give it a 10 out of 10, but I'm in the movie for a blink so it can't be perfect.)","user":"nick-43424","rank":[9,9]}]