[{"title":"Strong effort","rating":6,"date":"3 November 2016","review":"In The Last House/Breath of Hate we meet Love who is an escort. One of her clients is in love with her and wants to be with her. She pretends to not be interested but of course is. They spend their time in awful discussion trying to see who is smarter. Some interesting things are said about relationships though. She announces to her pimp that she's resigning but he's got one final job for her.<br><br>Her pimp sends her and two other girls to a job at a fancy mansion that is for sale. There they meet their three clients. The guy in charge, called supposedly Hate, his sidekick Selma, played by the smoking hot Monique Parent, and some not very bright assistant. Instead of getting it on, Hate gives these weird speeches. When they finally couple up, Hate goes with Love, Selma with the ugly girl, and the assistant with the hot blonde. The assistant undergoes some transformation or so he thinks and chews off the girls neck. Selma in the meantime has some kinky fun with her girl, who unfortunately is so unattractive that it makes a scene that could be fairly erotic far less so. Of course Hate has to keep talking once he's with Love. It's more of that obnoxious contest of smarts. It's not clear what he's up to or what he wants in life. But as it turns out, Love is the girl he has been looking for. He binds her arms and has her hanging from a ceiling but she manages to free herself and starts taking revenge. This too is just what Hate wanted.<br><br>Love's wanna-be-boyfriend starts looking for her, has some run-ins with her pimp, and eventually makes it to the mansion.<br><br>The movie goes on though, and it's not clear what is going on or how it's possible.<br><br>The story isn't told linearly at all, but starts somewhere in the middle, then goes back to the beginning and keeps throwing in scenes from later on until more or less the two timelines meet up.<br><br>The movie is a bit confused about what it wants to be and wants to do. It throws in some mild violence/torture, some erotic bits, some mental issues, some ghosts, too. And it doesn't work all that well. The performances keep you engaged, they are all strong. And of course watching Monique Parent is always a delight. Like all lower budget movies, there's a lot of talk going on. And it's a problem here because a lot of it is annoying. The writer who is a bright guy no doubt couldn't really get over himself and Love, her boyfriend, and Hate are similar characters in the way they talk. They are smart but think they are even smarter and have to show it off. And there's only so much of that one can take. All this babbling even gets in the way of some very good ideas and perhaps even the main point of the movie.","user":"TdSmth5","rank":[3,6]},{"title":"Grimy indie","rating":2,"date":"19 December 2018","review":"THE LAST HOUSE is another grimy indie horror outing with little to recommend it overall. The story's about psycho patients in a house and a kidnapping followed by a rescue attempt. There's zero horror content here, but a lot of pervy scenes of women gyrating in their underwear and the like.","user":"Leofwine_draca","rank":[1,2]},{"title":"THE ONLY CHOICE YOU CAN MAKE DEPENDS ON YOUR OPTIONS","rating":4,"date":"9 May 2018","review":"Love (Lauren Walsh) is a stripper/escort and Ned (Jason Mewes), a customer, loves her. Love is ready to leave and run off with Ned but is coerced into doing one last house. Here the three escorts meet Hate (Ezra Buzzington) a man introduced earlier spouting religious theology and we know he is sadistic and evil. The main plot intersects with flashbacks and flash forwards, clearly an editor on drugs, assuming they had one. The soundtrack was pretty decent. The twist/plot was slightly different. I was confused by the Felissa Rose walk-on. Did we need that?<br><br>Guide: F-bomb, sex, stripper nudity (Joanna Angel)","user":"nogodnomasters","rank":[1,2]}]