[{"title":"Perfect title for the movie, I was tricked into watching","rating":4,"date":"18 July 2017","review":"Didn't know a thing about this movie going it, except that it involved some magic (ala Now you see me)<br><br>While there are some magic, it doesn't even try to base it on actual magic. all camera tricks &amp; editing that can't be done in real life. And the story doesn't really make sense if you look into it.<br><br>***SPOILERS***<br><br>This supposedly smart 'engineer' implanted an electromagnet in his arm that looks like he got in a car accident. Then later on, tells us that there are fine wires running down his arms to his hands UNDER his skin (with no scars). REALLY?! You got an infected car wreck on your upper arm and then tell us that you have wires surgically implanted in the rest of your arm with no scars, all by yourself with one hand?! And the purpose of this is to levitate/move metallic object. Again, none of the writers seem like they took basic science. Magnets has no effect on precious metals or LEAD! So you can't levitate a silver ring, rip out gold teeth or stop lead bullets. <br><br>Also, why make him this smart (seemly moral) dude if you're just gonna have him deal drugs, steal from his friends and dealer. If he really is smart and made an electromagnet implant that work, why doesn't he just sell it. And no bs about magic secret, a lot of magician sell their tricks &amp; props for profit. And the whole reason he got into magic was to find out one trick, which that magician told for free. There is nothing in this movie that shows he's as smart as the movie claims. Everything in this movie makes him out to be a hustling hood rat (with a heart, but only for 3 people) who hates being a hustling hood rat. That's like saying peter parker hate being spider-man when he could be rich selling his web fluid.<br><br>Lastly, on him owing his dealer money. He needed 9 grand, why not sell his car? He could've easily gotten 10k for it. Again, this dude is suppose to be smart?!","user":"fuckface-80132","rank":[31,35]},{"title":"Downtrodden but world-class magician resorts to crime and betrayal. Oh yeah, and magnets can stop bullets.","rating":2,"date":"6 May 2017","review":"I tend to put a lot of store in Metacritic and IMDb scoring, and chose to see this film based on those. The acting and production values are adequate, but the story is completely preposterous. Not only does it completely disregard any notion of physics. but assigns zero value to the brilliant sleight of hand the protagonist displays, and instead shifts into unnecessary and gratuitous \"hood\" action. It even largely ignores its own bizarre reality. Worst of all, the protagonist seems to have no moral compass at all, willing to screw anyone without the slightest regret. I give it a two for being competently made, but the script deserves a -10. Disgusting.","user":"nesdon-2","rank":[35,43]},{"title":"What happened...","rating":4,"date":"8 May 2017","review":"\"Sleight\" had SO much potential. The magic sequences were entertaining. The performances were believable, and the characters had time to develop. The tone was set from the beginning to be tense, and the buildup was incredible. The film would keep making you think the girl would be kidnapped throughout the film, but when it finally happens, it cheaps out BIG time. All the subtleties are suddenly exaggerated. Things got silly all at the last moments of the film. The climax was boring. There was no sense of urgency anymore. The tone just INSTANTLY changes. Is this supposed to be epic? Am I supposed to be laughing? I didn't know anymore, and it didn't help that everyone's performances got goofy. The trailers were trying to sell this film as some sort of urban superhero tale, but since it took so long to get to the kidnapping, they had to cram all the heroics in at the last minute, thus wasting all the time they took developing everything including my time. What an absolute disappointment.","user":"jasonsharden","rank":[42,54]}]