[{"title":"I seriously thought a 5th grade drama class put this film together 🤦 or...","rating":3,"date":"17 January 2020","review":"...a bunch of biker strip-club owners and their dancers. Then after the movie, I see the writer and director was an experienced filmmaker, Thomas J. Churchill. Seriously? A 5th grade drama class could've done a better job.<br><br>The directing was atrocious... terrible camera work, even worse directing his cast. I mean how could you miss that nasty strand from the fake wig Bruce Dern was wearing? Don't get me started on the lame and terrible 1970's quality action sequences. Does anyone know how to hold and shoot a gun lol? Editing was just as bad, like someone shredded the film and taped it back together randomly. The screenplay I know for sure a 5th grader could've done a better job... did anyone else proofread it? It's a real shame though, as the story-line certainly had its merits, and actually was the only reason I saw the film to the end, never minding the various plot and technical issues. But the long dragged out scenes and slow pacing made the 86 min run-time feel like 2+ hours. I will say though that some of the gore scenes were actually decent and well put together. But the the constant, annoying and overbearing score, non stop... uhhhg! Sound was also off, like no one has ever heard of boom mics. Then the acting... I get Bruce Dern and Chuck Liddell are known for b-grade films, but next to the rest of the terrible acting, they just dropped themselves in being cast in a c-grade movie. I'm being very generous with my 3/10 for this one.","user":"TheTopDawgCritic","rank":[22,32]},{"title":"wow, lot of non genuine reviews on this steamer","rating":3,"date":"23 February 2020","review":"Bad acting, the worst southern accent ever, sloppy bad camera work,crappy effects, crappy stunts, crappy directing, crappy writing, crappy storyline and that horrible excuse for a Marine uniform!..I will give them credit that thay made a movie, albeit not all movies are gonna be great and lots are gonna to be bad, but you have to start some where right? But there is good news! The next time we see any of these guys in a film it's gonna be ten times better kinda hard to get any worse.","user":"redwolf28386-893-90262","rank":[3,4]},{"title":"More FAKE Reviews","rating":1,"date":"2 February 2020","review":"Does Bruce Dern need the money? He's in his 80s and showing up in every piece of garbage there is.<br><br>This is one of the worst movies ever made.\nIt fails on every level.\nNot worth your time and shame on the three clowns who give this garbage a 10. They are fake reviews.","user":"arfdawg-1","rank":[11,29]}]