[{"title":"Sailing movie about capsized trimaran & crew","rating":8,"date":"16 September 2015","review":"Made for TV movie (true story) about a capsized trimaran yacht and how it's crew survived for over 100 days. Well done and reasonably accurate about the sailing offshore in a performance multi-hull. Unlike most disaster / redemption films this one obviously was done by people who knew their topic.<br><br>I enjoyed this film as unlike most it made me feel they did not dumb down the content assuming everyone watching could not truly understand the situation. As a sailor I found this film quite realistic.<br><br>I feel the actors did a good job of representing the people in the crisis and they avoided overacting with restraint. <br><br>I'd heard about this situation and the controversy, so seeing the film added a lot of context to news from the other side of the world.","user":"billstrosberg","rank":[22,26]},{"title":"Authentic sea story","rating":9,"date":"31 October 2018","review":"I watched this with a few sailing friends and all, myself included, were impressed. It is a sea story well told.<br><br>But let's stand back from the actual real events for a moment. Here's a film that departs from the current trend in several important and positive directions: The story-line is clear. The voices are intelligible (even if the accent is from the far side of the globe for me). The flash-backs are clearly differentiated from the front-line story. There are not 1026 sub-plots. There is no sexual spicing up of the main story. As far as I could tell there was no subliminal advertising. What a pleasant change from the unintelligible mixup-gatherum of multi-plot nonsense that bombards us these days.<br><br>Now back to the sea. I found the story moved along nicely with variations in mood and happenings. It is rare for a true story to be so well told and to maintain interest. It even had the authenticity of a self-righteous skipper who was lavish in his criticism of his crew. My sailing friends wondered why he had no real crew in the first place. Yes, indeed.<br><br>Would this appeal to a non-sailing audience? I think it would. There is not exactly an excess of sailing jargon and the four main characters have an adequate range of personalities to maintain interest. Don't expect dramatic back-ground music and people posing on the bow! The story.is a true one and it shows.<br><br>The film is known by two different titles, \"Abandoned\" and \"Stranded\", neither of which really match the story but then almost any other title would give away too much.<br><br>One thought to finish with: one of the most important things to have when your boat is taking a tumble is a mirror.","user":"redisle","rank":[10,11]},{"title":"The right side up","rating":9,"date":"13 July 2016","review":"This film is based on a true story, which makes it very interesting. It's a survival tale set on top of a giant collection of water we call the ocean.<br><br>The production is convincing and maintains immersion. I thought the casting was perfect, and the actors do an excellent job conveying their characters.<br><br>I scored the film high because I felt it presented different aspects of the human spirit which is observed through the characters response and interaction to the situation, themselves and each other. <br><br>There is no waste or filler in the film, everything is well paced and contributes to the story which is well written.<br><br>I love stumbling on rare gems like this.","user":"toystein","rank":[21,26]}]