[{"title":"A review from someone that was actually there","rating":10,"date":"26 March 2017","review":"I was there living in Boston at the time of the bombings. I was in the city to try to get a look at the Marathon finish line. Luckily I didn't get that close. I did see and hear the bombs go off. My God the blood was everywhere I could see that from even where I was standing. It was absolute chaos.<br><br>This film is incredibly accurate. Mark Wahlberg's character is based on several police officers experiences. There are some trolls on here saying there was a political agenda or the facts are wrong in this film?? They are completely out of their minds. Not even a hint of it. Just the truth of what happened. I know I was there and I LIVED it. Nothing hinting left or right.<br><br>I had the bad luck of working only a block away from where they captured the last terrorist in Watertown. I was stuck in our office sitting on the floor with State troopers giving us water bottles for like 12 hours. No one complained. The city was in lock down. I shouldn't have even been in work. <br><br>When the police and FBI captured him people came out of their houses onto the streets clapping and celebrating as the police came by. It was a lovely thing to witness. Rarely do films do it right like \"Patriots Day\" but they some how managed to recreate that same atmosphere. It was an extraordinary time to live in Boston with everyone coming together and this film really depicted that.","user":"damhnait-75533","rank":[172,204]},{"title":"Don't let the fact that you already know what happened dissuade you from watching this. I highly recommend this","rating":8,"date":"10 April 2017","review":"\"Two people took many days and weeks to plan out hate but love responded in an instant.\" Tommy Saunders (Wahlberg) is a Sargent in the BPD. He is assigned to the finish line of the 2013 Boston Marathon. As the race is winding down the unthinkable happens and Tommy is right in the middle of one of the worst terrorist attacks in history. Now, with little evidence or leads Tommy, the FBI and every cop around conduct a manhunt to try and catch those responsible. For some reason I was not really looking forward to watching this. I think one of the reasons may have been the fact that it is still too close to the actual events and I remember watching it unfold on TV so I didn't think this would be that interesting or new. That being said I couldn't have been more wrong. The fact that this story is less than 4 years old really worked for it because it really milked the events prior and it felt tense, then once the bombs went off the pace really picked up and even though you know how it ends you are still tense and on the edge of your seat. I have said many times that there have been movies that are still able to pull off tenseness and excitement even though you know the entire story. This is one of those movies. Don't let the fact that you already know what happened dissuade you from watching this. This is much better than I was expecting and highly recommend this. Overall, tense and exciting. I really really enjoyed this and was engrossed the entire time. I give this an A.","user":"cosmo_tiger","rank":[45,61]},{"title":"Hollywood star Mark Wahlberg","rating":7,"date":"22 February 2018","review":"Various people's lives cross path in the 2013 Boston Marathon bombing and its following manhunt. It is directed by Peter Berg and starring Boston native Mark Wahlberg.<br><br>Originally, I feared Mark Wahlberg. He's not the greatest of actors although my bigger fear is that they would make the movie about him. That partly happened. Honestly, I cringed when he started yelling at Kevin Bacon and I rolled my eyes when he showed up to interview the Chinese guy. By placing him in the center of every aspect of the investigation, the movie loses a sense of reality. There is no need for him to be at every aspect of the manhunt. I do love the walk-thru with the security cameras. Otherwise, his role should be cut in half. This shouldn't be a vehicle for Mark.<br><br>On the other hand, I am overjoyed with the other people's stories. I love the Chinese guy and MIT security guy. This could cut back Wahlberg mugging for the cameras and add work from the other cops. Give me more J.K. Simmons. This movie should not be an one-man story if it purports to show the events in its entirety.","user":"SnoopyStyle","rank":[27,37]}]