[{"title":"Decent plot but long","rating":7,"date":"17 September 2018","review":"While this film is overly-lengthy with long, drawn out dramatic scenes, to its credit it has a totally unique plot and storyline that makes it worth the watch. There are plot twists aplenty with no strings left hanging. The magician theme adds a bit of mystery to this, while the overall mystery keeps the story going nearly to the end.<br><br>I do feel the lead male part was played by an actor who looked far too young and innocent for the depth of the part played. That was a casting decision and I believe the wrong one; his youthful appearance (for me) disrupted the reality-index throughout the entire film. <br><br>Aside from that the film was well done, and a few of the sets rather awesome considering the lack of visible CGI. All in all a decent story and worth viewing.","user":"Snootz","rank":[6,6]},{"title":"Korean director with all Japanese cast.","rating":7,"date":"23 March 2019","review":"Kaze no Iro is about a man,Ryo, who suddenly lost his girlfriend, Yuri. They spent time taking each others' photos before she suddenly disappeared. Later on, he finds out that she was already dead.<br><br>Once, Yuri told him something fascinating. In Hokkaido, there is someone resembles her, but her doppelganger possesses traits which she doesn't have.\nThe girl she mentioned is jovial, prettier and smarter than her.<br><br>Ryo makes his way to Hokkaido and performs some magic stunts in public which caught Yuri's doppelganger (later known as Aya) attention.<br><br>On the other hand, Aya watches Ryo in complete bewilderment as he bear a resemblance to her beau who vanished into the sea while performing a life-threatening magic trick. Ryo and Aya get to know each other and fall in love.<br><br>plot twist.\nRyo learns that Yuri is not dead but instead, as good as dead. She \"committed suicide\" and let Aya lives (no wonder they got no funeral..lol). Same occasion for Ryo, whom his other self, Ryu, vanished. Ryu's reason of dying is somewhat excruciating and heart-rendering. He conscious of Ryo's existence and wished he will love Aya. The couple soon revealed to suffer from Dissociative Identity Disorder.<br><br>Nearing climax of the movie, Ryo along with Aya, creates another personality (Leon and Mathilda) before performing the menacing magic trick Ryu had done. Ryo succeed the magic performance.<br><br>Albeit the couple lost their other selves, they still end up with each other. No matter with what name they call themselves, what personality they potray, they are made for each other.<br><br>What makes me fond of this movie?\n1) mini crush on Furukawa Yuki\n2) Captivating cinematography.\n3) i have soft spot for winter.\n4)excellent string of plot twist","user":"anisss-81727","rank":[0,0]},{"title":"Bittersweet Romance with Depth","rating":9,"date":"1 December 2018","review":"This was a movie that started off like a normal and basic Japanese movie, but it then turned itself around and created this sort of atmosphere that just pulled you in. It got better and better as I watched it. The acting was good, but the story and script is what really made me love this film. The words they spoke were beautiful and had underlinings of so much emotion and depth, it's easy to tell that the writers are really wise and intelligent people. The chemistry between the leads doesn't jump out at you or anything, but there is obviously some deep feelings between the two. I could feel their emotions well, more so during the last half of the movie. The cinematography was also amazing, it showed the city and parts of nature in gorgeous angles. I recommend this movie for anyone that likes a deeper story line that extremely original and breathtaking.","user":"camcat2002","rank":[1,2]}]