[{"title":"Great movie, Outstanding performance by Jessica Chastain!","rating":10,"date":"27 January 2017","review":"This is a powerful female driven film about the title character and politics. <br><br>It's one of Jessica's best performances if not the best. This character allows her to show so many things of her skill set. She's so believable, every nuance, every line she delivers is just so perfect. She should have been nominated for this role for every award show...<br><br>Miss Sloane is a great movie which has a very fast pace. You can't predict what's coming next, great performances by everyone on the cast.<br><br>Forget about the bad reviews, even if you don't like politics this movie will keep you interested. <br><br>It's upsetting that It bombed at the box office. I think It's because of the subject matter and people might had enough of the political climate in real life. But It really deserves to be seen. <br><br>I highly recommend this awesome, very underrated movie.","user":"ipekevamy","rank":[215,274]},{"title":"From the standpoint of a dispassionate observer separate from the tangled mess that is US politics.","rating":10,"date":"27 January 2017","review":"From the standpoint of a dispassionate observer separate from the tangled mess that is US politics. <br><br>One of the best movies I have ever seen. The intensity of the movie is unrivaled. The genius who designed the plot of this movie deserves a whole host of accolades for them personally. <br><br>Twists and turns around every corner making it engaging on a level similar to that experienced when deconstructing a Shakespeare play. This movie is for anyone who desires not only a piece of quality entertainment but also something that stretches their intellect. Aside perhaps from the role of Tony Stark I have never encountered a more badass main character.","user":"edwardgaremo","rank":[164,222]},{"title":"Awesome film","rating":10,"date":"24 December 2016","review":"Loved it. Jessica is very believable as uptight and smart, her lines are delivered with sharp intensity and she is just darn right sexy.<br><br>Beautiful sets and cinematography. Cool wardrobes. Excellent whistle blowing. Any film that exposes truths about how massive greed and corruption are is a needed film to see.<br><br>The hidden message is NOT about gun control, it's about corruption and how deep it goes. <br><br>Seeing an educated, powerful women with needs also shows realism. <br><br>The score is also nice.<br><br>This is a great film and is very underrated!","user":"dj_shamrock","rank":[221,315]}]