[{"title":"You get what you expect","rating":5,"date":"1 September 2017","review":"I am guessing the main reason to watch this movie is the cast, and it delivers. Everything you would expect to be there, is there - in full.<br><br>Dialogue is a bit stilted, but then again: to be expected. Acting and story also not amongst the strengths of this flick.<br><br>All in all: one of the breast movies of 2017.","user":"nooneheremovealong","rank":[104,127]},{"title":"absolutely lame","rating":1,"date":"14 September 2017","review":"Absolutely horrible.Terrible plot. Attempt at humor: someone farting in the car and the others characters' reactions.Their hot air balloon falls on a kids birthday cake.Kate Upton is a terrible actress-she f bombs her way through the plot on one emotionless level. An absolute waste of time.","user":"jeralhou-20224","rank":[47,68]},{"title":"too hot problem","rating":5,"date":"24 February 2018","review":"Meg (Kate Upton) and Kate (Alexandra Daddario) are best friends since childhood. The two Seattle roommates are struggling and Meg decides on a girls trip to Fort Lauderdale. They have hunky Ryan (Matt Barr) sitting in between them and a competition ensues. The plane is diverted to St. Louis due to a hurricane. They stay at a hotel with fellow passengers. The threesome join passenger Craig (Matt Jones) on a drive to the Fort.<br><br>William H. Macy tries his hand at directing. It's questionable how two of the hottest women on the planet would fight over the same guy. Sure he's hunky but these girls could snap their fingers and get any guy they want. As for their acting talents, Kate Upton functions well for an SI Swimsuit model. Daddario actually has some comedic skills although that's not her natural talents. It's also weird to have her as a less-hot side kick. That standard role has a pantheon of great actresses. I don't think she is build to play one. While this has some slapstick fun, it can never overcome the hot-girl-struggles problem. Daddario is too hot to be the dumpy best friend. Although I love Daddario, her role needs to be given to a real comedian. The script is nothing to write home about. I do sympathize with the girls trying their best.","user":"SnoopyStyle","rank":[21,28]}]