[{"title":"Seen at Toronto After Dark Fest","rating":7,"date":"20 October 2018","review":"I was really excited to see this movie because of JJ Abram's involvement, and the trailer absolutely sold me, so when I saw this was showing a couple weeks early I made sure not to pass up the opportunity.\nSo how was it?\nIt was really good. I didn't think it was great, but it has some really cool stuff that was very entertaining, and overall I had a good time. The first thing I'll get into would be the VFX, which I believe were created by ILM. The gore effects were incredible and made me squirm in delight, and the opening sequence of the squads plane getting shot down over France was spectacular. It looks absolutely stunning and is equally terrifying, especially with the excellent sound design.\nThe cast for the most part was good, I wouldn't say anyone was outstanding but they were really good. One comedic character in particular worked very well, and the dynamic between the leads was fun and interesting, but it never goes too deep. But let's face it, I didn't go to the movie for deep characters, I went for the WWII Nazi zombies.\nI was a little let down to be honest with the amount of zombie material in the movie. Maybe that's a little nit picky but a lot of the best zombie stuff was shown in the trailer, and although it's more fleshed out in the final film, it would've been nice to have seen some other crazy stuff that we hadn't already seen bits of. Then again, the zombie sequences and effects that are in the movie are fantastic, both creepy and undeniably fun. I guess I just would've liked a little more.\nI guess I'll end this by saying if you want a fun WWII/zombie movie, go see this. We need more R-rated blockbusters like this, so go support this one.","user":"BenHarley1138","rank":[187,295]},{"title":"The Most Expensive Nazisploitation Film Ever Made","rating":8,"date":"6 November 2018","review":"This is not the first time when J. J. Abrams put the finances into the risky project (remember \"Cloverfield\"), but this is definitely a curious choice for such a filmmaker. \"Overlord\" is the rare hybrid of a WWII film and a zombie horror - kind of movies that were prosperous back in 1970s and early 1980s, but has been long gone since then. And even in those times most of them were cheap and cheesy exploitation films, full of gore and nudity. (And yes, lots of people nowadays will think not of grindhouse cinema, but rather of \"Call Of Duty\" or \"Wolfenstein\" game series, which is an obvious point of reference here.)<br><br>And \"Overlord\" nearly perfect in assembling those pieces of a Nazi zombie horror movies into one single story. The plot is simple, action-packed and has it all: lots of fighting, shootings, machine guns and flamethrowers. The characters are schematic, almost one-dimensional, because it's not WWII drama, and that's enough. The SFX are great, there's a lot of blood and guts here, exactly what one can expect from a film which involves Nazis, experiments with (un)dead, and covert military operation.<br><br>However, there's some minor but annoying mistakes in presentation of some important plot elements, which hard to left unnoticed. Perhaps the most striking example of such retroactive anti-militaristic message is when Cpl. Ford decides to stop Nazis once and for all near the end of the film: his attitude looks a bit anachronistic in 1940s and such views for an U.S. soldier were much more credible rather after Vietnam War than during the WWII. There's also a very implausible fight between two main characters before the final onslaught, which looks ridiculous within the context of the upcoming Overlord operation.<br><br>But it all can easily be put aside, because \"Overlord\" is the Nazispoltation at its best: dark, bloody, action-driven horror about zombie soldiers trying to take over the world. Take it for what it is, and have fun.","user":"Krush_Burner","rank":[200,337]},{"title":"Going to turn into a Cult Classic","rating":8,"date":"9 November 2018","review":"Overlord is essentially a B-movie with a Hollywood budget, great action, and a TON of gore. I really enjoyed this movie quite a bit, especially in the opening scene, which was shot very well. This movie is an action-horror set during World War II when a bunch of American Soldiers discover that the Germans are up to something sinister in one of their bases, and that is all I will say about the plot. It's awesome to watch. The films cast doesn't consist of any A-Listers or Superstars, but has a lot of recognizable faces such as Wyatt Russell, (who's performance reminded me a lot of his dad Kurt in The Thing), Pilous Asbaek and Jacob Anderson of Game of Thrones fame, John Magaro and Bokeem Woodbine, and newcomers Jovan Adepo and Mathilde Olliver as the leads. To sum it up, Overlord is the type of movie that is going to develop a fanbase years from now, it is very fun and will satisfy those both looking for intense action and gory horror, and I can easily recommend this. We can all thank Julius Avery for directing such a fun movie and J.J Abrhams for deciding to NOT turn this film into a Cloverfield movie.","user":"jrugg19","rank":[202,347]}]