[{"title":"Disappointing return to form from John Woo","rating":4,"date":"19 December 2018","review":"When I learned that legendary action director John Woo was out with a new film that promised to be in the same style as classics like \"The Killer\" and \"Hard Boiled\", I was pretty pumped. But my feelings at the end of my viewing of the movie were much less subdued. To be fair, not all of the downfall of the movie can be put on Woo's shoulders. When characters in speak in English, they seem to be badly dubbed with awkward sounding dialogue that doesn't sound natural at all. Even worse is the script. The story has more than its share of incoherent plot turns, and many linking scenes seem to be missing (though Woo might be to blame for that last one.) Also, there are some plot turns and developments that are... well... just pretty stupid. If the characters had been a lot smarter, the conflict would have ended a lot quicker.<br><br>As for Woo's contributions to the movie, he doesn't manage to be able to do much. To be fair, he keeps the movie moving at a pretty fast pace, enough that you might not notice some of the poor scripting. But when it comes to action sequences, the action is just not up to the action in his past efforts. The farmhouse shoot-out and the climatic action sequence have their moments, but even those two moments don't really hold a candle to what Woo did in the past. The other action sequences, while not really bad, seem pretty routine for the most part.<br><br>In the end, the movie is kind of a disappointment. Those who are really into Asian action movies may get some enjoyment out of it, but I think even they will see its many weaknesses, and see why it was released directly to Netflix.","user":"Wizard-8","rank":[12,15]},{"title":"A lukewarm and predictable manhunt at best...","rating":4,"date":"7 June 2018","review":"This Japanese and Chinese collaboration of a John Woo directed movie turned out to be one of the least interesting of John Woo's career. And here I am only thinking about his work in Asian cinema.<br><br>The story portrayed in this movie was straightforward, but it was so straightforward that it offered no surprises, no twists, no nothing. So you just basically sit back in the seat and strap yourself in for the ride. Except you need not worry about the straps, because the ride here was plain and downright boring.<br><br>The action sequences were adequate, although hardly outstanding in comparison to many other Asian movies.<br><br>It was gutwretching to listen to the dialogue performed in English, because it was abysmally poorly delivered.<br><br>This movie came and went without leaving any lasting impression. Heck, it hardly even left a dent.<br><br>I love Asian movies, but this movie is not one that I ever plan to return to watch a second time.","user":"paul_haakonsen","rank":[10,14]},{"title":"A deliriously stupid return to the action-crime thriller genre for John Woo","rating":3,"date":"14 September 2017","review":"There was fair reason to be excited for \"Manhunt\". It was John Woo's return to the modern crime action film, his signature style, after more than a decade away from it. On top of that, it was his first film of this style made in Asia since 1992's \"Hard Boiled,\" in many ways the apex of his powers. However, while \"Manhunt\" checks a lot of boxes on what one would want from a classic John Woo shoot 'em up; a story of a cop and criminal and their relationship with one another, slow motion gunfights, doves, et cetera, in can't help but feel like its only artificially copying the key tropes of Woo's classic films without having the soul embodying it that made his other films action classics.<br><br>While no one goes into a Woo film expecting a smart, nuanced story, it is fair to expect that its stupidity is at least kept in check. In his best films, \"The Killer,\" \"A Better Tomorrow,\" and, \"Hard Boiled,\" he briefly indulges in moments of excess and melodrama that are reined in by well written characters and stories that deal with universal themes, such as the conflict between faith and the needs of reality, or the issues with loving one's family in spite of their sometimes heinous actions. Then there are Woo films that use melodrama and stupidity to their advantage, such as, \"Face/Off,\" that are aware of their own ridiculousness and ham it up for maximum effect, aware that it is all they are good for. But \"Manhunt\" occupies an awkward place that fits successfully into neither area. It's a film with no brain on its shoulders that still seems to take itself too seriously. It's a deadly combination that bring down the film more than anything, although there are still some elements of classic Woo that make it in.<br><br>One farmhouse gunfight sequence in the middle of the film is as close as anything Woo has done since \"Hard Boiled\" to capturing his classic style, with expertly choreographed fighting, excellent use of editing and slow-motion, and inventive use of the space and setting briefly create a classic John Woo bullet-ballet of yore. However, the rest of the action in the film doesn't hold up quite as well. The film's opening scene sets expectations high with its slick, tight camera movement, but unfortunately the rest of the film is plagued with overly tight, shaky camera work that makes the action hard to appreciate. It's a shame, since it was Woo's slick, clean quality to his action that always made him stand above other directors making similar work.<br><br>The film also isn't helped by Woo's apparent sudden obsession with digital filmmaking technology. There is nary a shot nor cut in the film that isn't altered by some effect, whether simple cuts are created into crossfades for seemingly no reason, shots are sped up and slowed down at random, creating a jagged, jittery mess, and different coloured filters and visual distortions warping our perception. It appears as if Woo went through every single setting in After Effects just to try everything out, and it is almost never necessary for telling the story efficiently, and often works against it. The story itself is a predictable conspiracy thriller about a pharmaceutical corporation using its products for brainwashing purposes crossed with a classic mistaken identity thriller, but the film's constant need to cut away to other scenes and flashbacks and awkwardly transition in and out of scenes with no sense of pacing or rhythm means that the plot becomes overly complicated when it really never needs to be.<br><br>Hanyu Zhang and Stephy Qi both hold their own with fairly naturalistic performances that compliment the more gritty aspects of the story, but Masaharu Fukuyama plays Detective Yamura like a cartoon character, leading for an awkward tension between the scenes he shares with Zhang where their styles never quite match up. It doesn't help either that the film floats between being spoken in Cantonese, Japanese, and English, with none of the actors seeming to have a firm grasp of all of them, leading to some poorly fitting and unconvincing ADR all throughout the film that looks like a bad Kung-Fu dub, except they are being dubbed with the same language they are speaking.<br><br>All in all, \"Manhunt\" really just highlights the sad reality that maybe John Woo doesn't have that special ability that he used to have that made his classic films the classics they are. My only hope is from this experience he can realize that and start focusing on trying to make something new and challenging him that will better suit where he is at now in his career instead of trying and failing to recapture his glory days.","user":"nick_white_5","rank":[36,64]}]