[{"title":"Rooted in Familiar Horror Tropes","rating":8,"date":"10 March 2018","review":"The Body Tree is heavily influenced by films such as Ten Little Indians, and The Thing, with a group of people in an isolated location trying to second guess who the killer is. However, the plot turns things on their head in an original way.<br><br>Yes it's got plenty of cliched jump scares and slasher movie stereotypes, but this is definitely one of the better horrors I've seen in recent years. The Siberian setting (not the snowbound variety) is distinctive, the acting is decent enough, and the characters are developed enough to have some investment in their fates. Admittedly some are unpleasant.<br><br>The group are brought together to celebrate the life of a mutual friend who was murdered. There are some flashbacks that reveal more of the events of that incident, and it keeps the story flowing and entertaining.<br><br>It's well worth a watch, and I'm surprised it hasn't had a more positive reaction.","user":"Spike_the_Cactus","rank":[20,24]},{"title":"Irritating characters and an average story","rating":4,"date":"7 May 2018","review":"I didn't really liked The Body Tree. Maybe I expected too much of it. The story is just not that great to keep you interested, at least not for me. And that was due to some really annoying characters. Plus the acting was not good from everybody. The characters are basically arguing and yelling during almost the entire movie, trying to find out who's the murderer, and at one point I couldn't care less who was the murderer. The plot was also not the greatest I ever saw. Maybe it could have been better with another cast and characters. It's also obvious that this is not Siberia so that's also a thing that bothers me. Just do some research and find a right place for it if you want it to look like Siberia.","user":"deloudelouvain","rank":[8,9]},{"title":"I liked it","rating":7,"date":"18 June 2018","review":"Overall, I thought it was interesting. I thought it was an original storyline on the 'who done it?' With a side of paranormal thrown in. My main complaint is Helen. Geez if a killer is after you, screaming is probably a dumb idea. I wish she had a heart attack on the way up so she wouldn't have been in the majority of the movie.","user":"mercedes_sk","rank":[3,3]}]