[{"title":"Original and well executed","rating":9,"date":"11 September 2019","review":"I left the cinema with a strong emotional bond with the protagonist.\nThe story seems to surface from a documentary, with several reference to post-ww2 Italy: music, people, strip of homemade tapes. But the pace, the rhythm, the editing, is not a documentary one, it sometime remembers a music-clip.\nThe more you sip form the environment, the more its flavour changes, because the situation changes, and so does the main actor. It is really easy to bend to its arch, and little by little you find yourself absorbed into his prospective, his vision, his twists.","user":"giuppichan","rank":[23,31]},{"title":"Delirium and knowledge","rating":8,"date":"17 October 2019","review":"Quite faithful to the book for what regards the plot, but really different in ambientation: this movie transports London's story in a middle 900s Napoli and adapts the situation to Italian features. This choice, however, doesn't screw London's concept, that instead is maintained as well: the story of a man that for love tries to transform himself from a popular condition to a life of richness and knowledge.<br><br>But love, in this story, is just the narrative input: it is instead the tragedy of a man that wants to pass in bourgeois world and than discovers all human limits of that universe (made of lies and unrespectful behaviours) and at the same time loses part of the ancient world. The suicide is the unique form of freedom for this man strange between men. With an excellent interpretation of Marinelli and wonderful landscape and photography, this movie manages to maintain London's aims and at the same time gives them the beauty of italian atmospheres.","user":"anthonyf94","rank":[14,19]},{"title":"A small but nice Italian film - I'm biased because I'm Italian - with the added bonus of make you think about so many things","rating":9,"date":"8 December 2019","review":"The story is quite simple: a young sailor - who represents the writer himself, namely Jack London, being the novel largely an autobiographical one- he falls in love with a young, beautiful and educated girl of a bourgeois family\nThe book is set in the San Francisco of the early 1900s , while the film is set in Naples and surrounding Campania in an indeterminate age , even if there are so many references to reconstruction of Italy after the www2<br><br>Martin, engrossed in knowledge, starts reading mountains of books and begins to write stories with the intention of elevating his social status and thus being able to marry Ruth His novellas are published, he achieves success, money, recognition as a writer, Ruth who had left him begs him to forgive her, ... but at the height of success instead of being one happy and accomplished person he becomes a cynic man, no longer believes in his passions and loses his enthusiasm. What happened ?<br><br>To understand this turning point it is necessary to know the political / social thought of Jack London; the history of love between the two young people is only a pretext, while the intention of the writer is to put in highlight and criticize other ideas and values:<br><br><ul><li>individualism is the first one; it is certainly a good thing to be able to rely on yourself, but if you are driven to excesses produces people who completely lose interest in the needs of the others and who are not able to see beyond their own personal interest</li><li>The capitalist system, in the beginning of the 1900s in the hands of a minority of people, creates masses of low-paid workers, subjected to arduous work and in practice reduce people to a fate of slavery</li><li>We also have a criticism of the educational system whereby knowledge is reduced to \"status symbol \", while on the contrary culture should help people to improve and grow themselves</li></ul><br><br>The soundtrack is very beautiful and suggestive: these are light music songs in vogue in Italy in the '50s and '60s , while the photographic narration of the story borders on poetry; often the main narrative is interspersed with old documentaries or clips of amateur videos that give the sense of poverty and of the hard life of the post-war years in Italy, the years that represent our roots,\nthe basis of our current development","user":"giorgiomalvezzi","rank":[12,16]}]