[{"title":"Worse than inexplicably bad","rating":1,"date":"28 February 2017","review":"I saw this movie via my satellite TV's movie package, and it was such a waste of 90 minutes of my life. The movie drew me with its cast of former action stars Don \"The Dragon\" Wilson, Cynthia Rothrock and Oliver Gruner plus Tia Carrere but gosh, the (lack of) acting, plot, flow and everything else made it one of the worst movies ever. Please do yourself a huge favor and avoid this turkey.","user":"peter07","rank":[23,28]},{"title":"This really is the poor mans Expendables.....","rating":3,"date":"15 May 2016","review":"And if you think that sounds bad, wait until you try and make sense of the 'plot'.<br><br>The main star of the film is someone you've probably never heard of, and he gets shot by Matthias Hues and Shang Tsung from Mortal Kombat.<br><br>Then we flash forward however long it is, and now he's working with Casper Van Dien as private investigators.<br><br>To cut a long story short, Tia Carrere is married to Mark Dacascos, they are on holiday, for some reason Matthias Hues and Shang kill him, so she goes to them so they can capture them.<br><br>The film is totally incoherent, and unfortunately, an uneventful mess. It's clear from the beginning that this was someone's dream project, and after the success of The Expendables, why not get the best of the straight to Video action stars of the early 1990's?<br><br>Well they do, but only in the final third, when Dacascos (who directed this) decides to turn the final act into a rip off of the rescue mission in Predator.<br><br>It's all lethargically done, the action is below par, and despite having all these martial artists involved, the action sequences are really poorly done, and the CGI explosions are laughable.<br><br>What should have been a big slice of nostalgia, turns into nothing but a chore to get through.<br><br>And it's really only worth watching to see just how out favourite C-list action stars of yesteryear have changed.<br><br>And for at least three of them, the years have not been kind.<br><br>You'll be desperate to see Wayne's World after this....","user":"FlashCallahan","rank":[21,28]},{"title":"crap movie made by a Russian fake bodybuilder Arnold-wannabe","rating":1,"date":"14 May 2016","review":"Man the actors in this movie must've really been hurting for money. The plot seems like it was copied and chopped from much better movies. The lead actor tries way too hard to copy Arnold's speech-pattern and mannerisms. I'd like to know why Dacascos had anything to do with this movie, frankly it stinks and most of the actors seem to know it. Avoid at all costs. Tia Carera looks like an old worn out porn actress showing off some droopy cleavage. Don Wilson hops around like a lame rabbit. The local filipinas are portrayed mostly as hookers and bar girls as is the norm in these cheap productions. Tagawa looks like he's semi-conscious in most of the scenes he's in. Casper tries to act but given that the material is garbage its a wasted effort. The ending is just a whole bag of stupid. Where does this Russian guy get the money to fund these movies? I suspect he's a crony capitalist or has connections with the old Russian govt.","user":"mangkaynor","rank":[23,34]}]