[{"title":"One WolfCop too many.","rating":4,"date":"25 February 2018","review":"Another WolfCop? Well, no actually, it's the same one as before-police officer and werewolf Lou Garou (Leo Fafard), who upholds the law by tearing apart the criminals. This time around, Lou tries to stop shady businessman Sydney Swallows (Yannick Bisson) from using his new line of stout beer-Chicken Milk-to impregnate the locals of Woodhaven with reptilian alien spawn. <br><br>As before, the emphasis is on excessive gore and low-brow humour, but the result isn't quite as effective, the sequel lacking the freshness of the original while throwing in too much poorly conceived eclectic absurdness that simply doesn't gel. Of the best stuff, Lou's crazy sex marathon with six-breasted werecat Kat (Serena Miller) is worth a giggle or two; of the less successful material, Kevin Smith as Mayor Bubba is the definite low point, a talking penile parasite that emerges from the stomach of Lou's sidekick Willie fails to generate the intended laughs, while the finale at a supposedly packed ice hockey match suffers for having a 'crowd' of approximately thirty fans.<br><br>3.5 out of 10, rounded up to 4 for IMDb.","user":"BA_Harrison","rank":[10,14]},{"title":"Not as fun as the first one, kinda dull honestly","rating":4,"date":"21 June 2018","review":"Another Wolfcop: Written and directed by Lowell Dean<br><br>We're back with more Wolfcop fun for the sequel. Well sort of. The first Wolfcop was a wild delight of an insane movie. It caught me by surprise and I loved it. I was very excited by the prospect of another romp with Lou Garou. I know what I say about expectations. They can be poisonous to an experience especially when the movie doesn't do what you expect it to. This is not one of those instances. <br><br>I was excited for another film but my excitement disappeared the longer the film went on. I realized very quickly this movie had no ideas. The wolfcop barely does anything in it. It just recycles jokes from the previous film and then it became one dick joke. 73 minutes of it. It also goes back to the well and reuses jokes from the first movie with a mild unexplained alteration.<br><br>I appreciated the craziness of the movie and the absurdity of it all. The first one was a lot of fun but this one felt like it was missing that fun. It felt like it was trying too hard. The chicken milk joke is driven into the ground and it wasn't that funny to begin with. <br><br>It's tough to talk about bad comedies. What do you say when something just isn't funny to you? I will admit that the wolfcop anthems they have for this movie are pretty great. I simply can't recommend this and I know that this should probably be the last one. I give this movie a D.","user":"mherrin-43253","rank":[7,9]},{"title":"That Same Old Fun","rating":7,"date":"5 December 2017","review":"Alcoholic werewolf cop Lou Garou (Leo Fafard) springs into action when an eccentric businessman with evil intentions seduces Woodhaven's residents with a new brewery and hockey team in this outrageous horror-comedy sequel.<br><br>\"WolfCop\" is one of the greatest horror films of the 2010s. One might want to say one of the best \"horror comedies\" or \"Canadian horror films\", but let us not be too restrictive. The gore, the humor, the originality... it really set a high bar for other films, especially films from otherwise-unknown creative teams.<br><br>And being such a great film (and instant cult classic), a sequel was inevitable. But the challenge was put in place: could a sequel live up to its namesake? As hard as that is to do, \"Another WolfCop\" succeeds. This is the same gory, wacky, frenetic thrill ride from the first time around. In some ways, perhaps even crazier... but at the very least a worthy follow-up.<br><br>The gore is most definitely increased, and along with it the body count. The weird factor is up slightly, with the inclusion of an alien-type clone being (not sure how to describe it). Some of the characters and plot lines do dangle a bit, creating the appearance of an incomplete film... but oddly enough, this works, making things even stranger than necessary that not all questions get answered. What is the creature in the strip club? There are other were-animals? Do werewolves have different genitals than their human counterparts (apparently so)? <br><br>The inclusion of Kevin Smith is a bit distracting, but he actually does a fair job acting. If I was not aware of who he was he might not have seemed out of place. I suppose that is the risk you run when you try to include a cameo from a hockey-loving director who is currently in the middle of a Canadian trilogy.","user":"gavin6942","rank":[9,18]}]