[{"title":"2 and a half hours of cliche after cliche","rating":5,"date":"17 February 2018","review":"All you're gonna see in this movie is a continuous stream of cliches.\nSure, if it was released say, in 1970, when none of the superhero/sci-fi/fantasy that today is flooding the audiences was present, it would have been quite enjoyable and watchable.\nBut in today's market it brings nothing new. I could constantly guess what was going to happen at the end of certain action scenes, and don't even get me started about the helicopter scene... that one was supposed to be dramatic and some kind of fitting twist but just left me enraged at the stupidity of the screenwriters/adaptation.<br><br>In the end it's quality is on par with the other 2 similar series (Divergent and Hunger Games), so, gets a 5 star \"meh\" out of me. Good for kids but intelligent people beware!","user":"atomikbuster","rank":[203,255]},{"title":"Maze Runner: The What Now?","rating":1,"date":"18 February 2018","review":"Generic. Filler scenes. No story. Random events unfolding in random order. People looking out through windows. People looking towards the horizon. Somebody cries and then somebody says something heroic but entirely without meaning. People pointing guns at each other without actually intending to pull the trigger. Not a single word of original dialogue. Royalty free filmscore from Youtube. Underwritten love story and underwritten characters. Hollywood executives laughing on their way to the bank.","user":"tha_hawk","rank":[328,431]},{"title":"Not Maze Runner: The Not Zombie Cure","rating":2,"date":"16 April 2018","review":"This is my first review on IMDb and maybe my last but I would just like to selfishly join in on the fun of kicking the dead horse.\nJust to be clear I haven't read the books nor am I usually a fan of the subgenre of \"dystopian future saved by young people overthrowing tyrannical rulers\".\nI watched the first 2 movies back to back the same day and watched the third the day after. Needless to say the second and third movies are actual trash while the first has it's merits. \nThe first Maze Runner worked well enough because it only provided enough information to the audience required as well ASKING QUESTIONS. As soon as the series devolved into \"evil big company is putting kids in a maze for literally no reason so they can find a cure for a zombie virus\" it turned into something a middle schooler got a B- on. That's really sad considering I even got tiny feelings of \"Cube\", a cult classic of sci-fi death maze movies, during the first Maze Runner.<br><br>With that preface out of the way how about I list off some fun little plot holes and inconsitencies that I could find within The Death Cure with some tying back to the first 2 movies. I'll try and go in order of appearance.<br><br>1: 6 months supposedly has passed since the ending of Scorch Trials and start of Death Cure but for some reason WCKD is only just now transporting Minho and others from some unknown location to their headquarters.\n2: The plane they hijack is alone and lands for no reason when they corner Jorge and Brenda instead of just shooting them.\n3: Thomas is dead set on saving Minho, who he doesn't even know for sure is alive, and barely gives notice to Aris or the other people he could be saving. Also Aris and the rest make no apperances besides the first 15 minutes and ending.\n4: Minho is being tortured in a simulation, which he doesn't realize is fake for some reason, which begs the question why WCKD wasted massive amounts of time and resources building a huge maze when they displayed and admitted the simulation works. This also begs the question of why they wouldn't just treat the immune people very nicely so they would have no reason to care if they are being tested.\n5: Thomas, Fry and Newt drive slowly through a tunnel they are highly suspecting is full of zombies when they could easily have driven faster to avoid them.\n6: All other cities have been reduced to rubble but Jorge upon seeing the walls says they are new implying the city was still shining and fine before they raised the walls. If it wasn't shining and fine this implies enough people had resources to rebuild a ruined city to modern comfort.\n7: Thomas and other tagged people aren't trackable by that tag until it is convenient for the plot.\n8: Gally survived the ending of the first Maze Runner somehow even though he was infected and punctured through the lungs with a spear. This implies people arrived very shortly after Thomas and the others were flown away, removed the spear, performed surgery, and have been giving him serum for a minimum of 6 months. Gally may also be a cure considering a girl later in the movie was only infected for 3 weeks and still turned into a zombie even after serum injection. Nobody turned him over to WCKD for any profit when he was clearly a test subject. This is where I would have left the theatre.\n9: Thomas never considered that his blood was a cure 6 months after Brenda was treated because he is a moron. WCKD was apparently also full of complete morons to not realize Thomas was a cure before the events of the first Maze Runner.\n10: Gally was correct in that they did not need Teresa to enter WCKD HQ as they only needed her thumbprint. They could have done what he suggested and cut it off and saved themselves large issues while also maintaining her hostage. Thomas stopped him because he still had feelings for her even though she was the direct reason for Minho's capture as well as the deaths of many others.\n11: Gally, Thomas and Newt suddenly have WCKD security uniforms supposedly because Teresa acquired them to use but they still insist on bringing her along as well as stupidly removing their masks at one point.\n12: They raid the cell block but do not arm the immunes with the weapons of the guards they just took out as well as leaving Gally to retrieve the serum when Newt could have immediately used it upon acquisition. They also do not simply use the helicopter they have to extract the immunes under the pretense of guarded evacuation.\n13: Thomas and Newt have the opportunity to incapacitate or kill Janson while alone in the elevator but simply avoid suspicion even though it backfires. Teresa also locks them in later although she could have easily stated Thomas and Newt were in the elevator leading to their capture faster with less incident.\n14: Gally leaves to find Thomas and Newt but is revealed to have just been outside the building later.\n15: Thomas, Newt and Minho lock themselves in a room with a lock that should not exist, survive a jump from at least 5 stories into a pool they do not know the depth of with no injuries as well as Janson or the soldiers deciding not to shoot them when they have clear shots from a vantage point.\n16: The bus full of immunes driven by Brenda somehow makes it to exactly where it needs to be without being stopped as well as not falling soon after being lifted.\n17: Brenda and Fry return to the outcast hideout only to sit and do nothing even though the entire city is exploding in the distance.\n18: The outcasts destroy the entire city even though they wanted in and it does not benefit them in almost any way. They also could have entered the walls the same way Thomas, Gally and Newt entered earlier but were too stupid to do so.\n19: The helicopter Jorge flies in does not get shot down although there is no indication it isn't WCKD controlled. A scene of a different helicopter being shot down is shown later to confirm this could happen.\n20: Newt turns into a zombie even though outcasts clearly had access to serum they could have taken with them in case Newt started to turn. He also had the opportunity to disarm himself before turning but did not for no reason.\n21: Janson shoots Dr. Paige even though she would be a valuable scientist regardless of affiliation due to her knowledge on the virus. Also the bullet does not pass through her into Thomas.\n22: Janson has no qualms about killing either Teresa or Thomas even though they are both now very valuable to his plan of vaccine monopoly. They also do not threaten him with this fact\n23: The glass on the zombie enclosement does not shatter when missiles hammer the building but shatters on it's own when an injured Thomas hits it with a microscope.\n24: Thomas kisses Teresa and empathizes with her even though she was the direct reason many people were killed as well as Minho's capture.\n25: Teresa could have made the jump to the helicopter as she was not injured like Thomas. The argument about the helicopter not getting closer is somewhat defensible due to the massive heat updraft that would surround the building as well as wind splash off the roof possibly disrupting flight stabilization.\n26: Thomas carves Teresa's name on the rock although it would quickly be defaced as a portion of the people who died are also carved on the rock.\n27: Thomas is the potential cure for a zombie virus that has destroyed almost all of humanity but is now isolated with no evidence shown people have the knowledge to create a cure from his blood.<br><br>PHEW, and that's just the stuff I could find easily. One of the few positive things to come out of this movie is how NOT to write things. The only reason I gave it a 2/10 is because of how nice some of the effects and sets are even though sadly they are in a trash movie.","user":"ttster777","rank":[90,114]}]