[{"title":"Beatiful story, but if you are expecting action, keep looking","rating":8,"date":"21 May 2018","review":"I felt the need to write a review as the ones I have seen are incredibly harsh. This movie is a beautiful parable of a young girls struggle in dealing with the realities of her life told through her avoidance and diving into her vivid imagination and courage of spirit. While I havent seen the trailer all I can say is if you are looking for a Pacific Rim poorly scripted CGI sensory onslaught keep looking, but if you are open to a beautiful heart warming story of fantasy and adventure more akin to The Enchanted Story then this movie is bound to put a smile on your face and will become a staple for kids dealing with sickness and loss. Wonderful to see and deserving of much higher ratings if expectations arent in the action adventure arena.","user":"lukeshulver","rank":[170,202]},{"title":"Well I liked it !!","rating":9,"date":"4 June 2018","review":"I watched the movie cold with no idea what it was about. I thought the story was great and the acting and production was very good. OK the CGI was a bit low budget but I don't think that's what the film was about. When I put two and two together and realized what was really going on the light bulb shone. The young actors should be commended for their performances. For me it was a very satisfying movie and an interesting way of telling a story. Then again I'm just simple folk. Well done to all involved","user":"spmika","rank":[104,128]},{"title":"I Kill Giants","rating":18,"date":"18 May 2018","review":"I read several reviews before I started watching the movie and all those reviews totally slammed the movie. Don't listen to those reviews. This movie is every bit as good as A Monster Calls and Phoebe In Wonderland. In each movie the child is faced with life and death struggles, fear and denial. Watch this movie and keep at least one kleenex in your pocket. My family is dealing with the same thing. And none of us is handling it well.","user":"r-ellenh","rank":[65,79]}]