[{"title":"Yes!","rating":8,"date":"5 August 2019","review":"I must first confess that I was pleasantly surprised by the exceptional performance of the actress <a href=\"/name/nm0565250/\">Melissa McCarthy</a> who is (was?) almost-systematically accustomed to cinematographic pieces of junk such as <a href=\"/title/tt5619332/\">Life of the Party (2018)</a>, <a href=\"/title/tt1289401/\">Ghostbusters (2016)</a> or <a href=\"/title/tt0160127/\">Charlie's Angels (2000)</a>. I sincerely hope that this film will mark a turning point in her career, with a before and an after.<br><br>Then, the subject is not really bankable: no superhero, no sexy actress, no Computer-Generated Imagery. In addition, the main characters are two insignificant loosers who will attract the wrath of the FBI because of their secret activity of a two-penny faker and will then be within an inch of jail. Of course, with such a script, the movie will probably not be a hit at the world box-office.<br><br>Nevertheless, the movie is delightfully excellent and describes with subtlety and sensitivity an ineluctable descent into the abyss. Lee Israel (<a href=\"/name/nm0565250/\">Melissa McCarthy</a>) was a writer with some success. One of her books was even mentioned in the New York Times best sellers. But, success is now part of the past and she regularly has huge difficulties in paying her rent. By chance, in an old book of a public library, she discovers a real typed letter from a well-known female writer. Begins then an improvised career of a scammer with false letters from real personalities that she skillfully engineers within her shabby apartment.<br><br>As a synthesis, <a href=\"/title/tt4595882/\">Can You Ever Forgive Me? (2018)</a> is excellent! 8/9 of 10","user":"FrenchEddieFelson","rank":[40,45]},{"title":"Want to buy some illusions?","rating":21,"date":"21 October 2018","review":"The celebrity biographer Lee Israel was in her own way an expert spinner of \"alternative facts\" and \"fake news\" decades before both became commonplace in the digital age. Plenty of people who should have known better were willing to accept these \"facts\" and spread this \"news.\"<br><br>Melissa McCarthy reaches an artistic career peak with her performance as the late writer who had been one of the top names in her field in the 70s and early 80s before cultural evolution (or devolution, depending on how you look at it) combined with her own abrasiveness and alcoholism led publishers to shun her work. McCarthy adapts her familiar techniques perfectly to this particular character.<br><br>With bills mounting, and facing loss of prestige and income, she began drinking heavily and sinking into a deep, almost psychotic, depression when, half by chance, she discovered that a lot of money could be made by selling letters from famous people like Katharine Hepburn and Fanny Brice. The juicier the content, the more cash they commanded. A talented and witty writer herself, she was familiar enough with the style of the such figures as Noel Coward and Dorothy Parker to forge imitations that convinced professional collectors of their authenticity. Quotes from some of her fakes even ended up in respectable publications. Eventually she resorted to doctoring correspondence which she stole from libraries and selling the results for high prices to sometimes shady dealers. Here was someone who loved and respected outstanding writers and their works but was driven by circumstance to, in effect, falsifying their legacies.<br><br>Some of the little touches that deepen our understanding of her character include a scene where she is watching the 1941 film version of \"The Little Foxes\" and starts delivering the dialogue along with the actors and even accurately imitating Bette Davis's distinctive giggle. Much of the time she is swilling scotch and her ever-so-slightly slurred speech reflects this half-inebriated state.<br><br>The movie is shot in New York, making use of locations that still look much as they did more than a quarter of a century ago, when the classic New York of the early-to-mid 20th century, an environment conducive to Israel's own earlier success, had mostly faded out. Julius, the bar where a few key scenes are set, existed then and still exists now. (A conversation therein about her illegal shenanigans is softly underscored by Marlene Dietrich's recording of \"Illusions,\" Dietrich being the subject of one of Israel's Noel Coward forgeries.)<br><br>Most of the interiors (book stores, archives, Israel's funky apartment, her agent's more elegant and expansive one) are genuine.<br><br>McCarthy is strongly supported by Richard E. Grant in a showy, colorful performance as a fellow alcoholic and partner in crime, Stephen Spinella as a kind but increasingly suspicious rare book dealer, Brandon Scott Jones as a fussy book store clerk who, to his regret, rubs Israel the wrong way, Jane Curtin as her no-nonsense literary agent, Anna Deveare Smith as an old friend and numerous others.<br><br>\"Can You Ever Forgive Me?\", based on and named after Israel's slender autobiographical recap of this period, is a highly intelligent and detailed rendering of a complex human being, by turns endearing and repulsive, brilliant and stupid.","user":"mukava991","rank":[142,178]},{"title":"Thoughtful work from a comic actress","rating":8,"date":"9 September 2018","review":"After the abysmal Ghostbusters remake and the endlessly panned Happytime Murders, true fans of McCarthy will be glad to see her redemption in this dramatic turn. McCarthy really shines in her role as author Lee Israel and effortlessly portrays the loneliness and insecurity of her character. Her rapport with Grant (and even with the cat) is wonderful, and the writing is clever. This was a surprising and delightful highlight at Telluride this year.","user":"Lionesse20","rank":[133,186]}]