[{"title":"A non-exciting and predictable hijacking movie...","rating":3,"date":"24 April 2017","review":"You know that this is going to be one of those movies, yet there is just something that makes you want to sit down and watch it. And now that I have, I wish that I listened to the voice in the back of the head that said \"don't\".<br><br>Granted that the movie stars Denise Richards and has Dolph Lundgren along on the ride for someone to lure in an audience, then the movie never really got up into a gear that makes it particularly watchable or entertaining.<br><br>The story in \"Altitude\" is about a hijacking of an airplane, and that is essentially the core of the story. But wait, hasn't this been seen a million times before in other movies? Yes it has! So do \"Altitude\" offer anything new or exciting to the genre? No!<br><br>Denise Richards trots through the movie on auto-pilot, but that doesn't necessarily make the performance any more interesting. And Dolph Lundgren had only a minor role in the movie, and when he was on the screen he sort of was displaying an attitude of not really wanting to be on set for that movie.<br><br>\"Altitude\" is horribly predictable and offers no plot twists or surprises anywhere. As such, it just march on at a very monotonous pace. And there are far better movies available if you enjoy a good airplane hijacking movie.<br><br>The movie wasn't dealt a very advantageous hand from the very beginning, and director Alex Merkin hardly managed to lift the movie up and make it outstanding in any way.<br><br>Furthermore, should you manage to sit through the entire movie, like I did, then chances are slim to none that you will return to \"Altitude\" for a second viewing.","user":"paul_haakonsen","rank":[38,42]},{"title":"Mission Implausible","rating":3,"date":"13 June 2017","review":"\"Altitude\" defies logic, science and common sense in a manner so blatant to border on contempt for the audience. <br><br>For example:<br><br>Automobiles have sensors to warn the driver of various problems. Even motorcycles have switched that prevent operation if the kickstand is down. But the commercial passenger jet in this movie takes off without the pilot knowing that a door is open. <br><br>Part of the plot involves switching out a major component on the plane, but components on aircraft are serialized and extensive records are maintained of all maintenance operations, ensuring the switch would be discovered. <br><br>At one point the plane takes off with somebody more than halfway outside the door. The takeoff speed for Jet aircraft in the 130 – 155 knot range, which is the speed of major hurricane winds, powerful enough to flip over vehicles and blow barns away. Anybody clinging to the door would be swept away.<br><br>At one point, two individuals do a tandem parachute jump simply holding on to one another. When a parachute is deployed, the individual experiences a jerk of 3 – 4 g. I believe this means somebody weighing 120# will momentarily seem to weigh about 420#. You really need sturdy straps and harnesses for a tandem jump. <br><br>The plot entails an elaborate scheme to hijack an aircraft in order to steal something being carried by one of the passengers when it would seem much easier to hijack the guy's taxi or limousine on the way to the airport. <br><br>The film also defies logic by getting made in the first place. Each year, about 50,000 scripts are registered with WGA. Probably an equal number are written, but not registered. In 2015, 727,000 new books were self-published. While not all were novels, there are countless stories written each year that could be adapted as screenplays. Why would anybody invest hundreds of thousands of dollars, if not millions, in a script with obvious problems when there are countless better scripts that could be acquired at modest expense? As a writer, I've read dozens of better scripts and novels that could be adapted and produced on a comparable budget. It seems grotesquely inequitable that a writer is able to sell a script that is poorly researched and constructed when so many better scripts can't even get read. <br><br>Dolph Lundgren and Denise Richards do as well as can be expected with the material they're given. The glaring incongruities and implausibilities shatter the willful suspension of disbelief and the story isn't sufficiently interesting or involving to sweep the audience along. The characters aren't particularly likable or interesting. Without impressive fight choreography, chase scenes or special effects, the film needs either a fascinating plot or interesting characters, but offers neither.","user":"ginocox-206-336968","rank":[11,12]},{"title":"Worse than Snakes on a Plane","rating":1,"date":"17 June 2017","review":"I think the review title says enough. Sub par plot, clueless cast topped off with a boring ending make movies like Snakes on a plane look like a piece of art. Do yourselves a favor and stay away from this piece of crap. I am only typing this extra line in order to submit my review","user":"mani-in","rank":[20,24]}]