[{"title":"My review of \"Fassbinder\"","rating":3,"date":"17 September 2018","review":"Whoever thought it was necessary to kick Margit Carstensen's dogs underneath the table and use Rammstein as background music. The decision to put a modern twist on this documentary was superficial and felt like an unnecessary attempt to be different. <br><br>If anyone reading this hasn't seen Christian Braad Thomsen's documentary about Fassbinder (titled: \"Fassbinder - Love Without Demands\") I highly suggest you watch it. It did his life and career more justice and painted an intimate, affecting portrait of the man himself.","user":"steffansonic","rank":[4,5]},{"title":"The man makes the movie","rating":6,"date":"16 June 2015","review":"This is a 90-minute documentary movie from 1.5 months ago written and directed by Annekathrin Hendel. It is entirely about German filmmaker Rainer Werner Fassbinder and his approach on film. Obviously, the highlight here are some old recordings, for example the way in which he reacts after he is publicly booed at a screening. Also, this film serves as a decent summary of Fassbinder's body of work and you can make up your mind very nicely what films to watch first if you are new to Fassbinder's films. I would not necessarily that the quality if this film is due to Hendel. It's really much more thanks to the subject here being so incredibly interesting and also the interviewees in here are all longtime friends or colleagues of Fassbinder who have a lot to say. The questions and comments by Hendel are really more of an interruption than a worthy addition in my opinion and I am glad she did not narrate the film herself. One year before this one here, Hendel made another documentary about a German writer (Sascha Anderson) that I am not familiar with.<br><br>Also we get a nice insight into Fassbinder's approach to film, his relentless attitude towards himself (which also may be one reason for his premature death), but also towards the people working with him in his movies. Fassbinder died roughly 33 years ago, but he is still very much in the public eye. Not too long ago, his film \"Baal\" was finally released and now he even has another documentary centered around him. No doubt, he is seen as one of the most impactful German filmmakers of all time. He himself would certainly agree. Actually, he says something similar in the documentary naming Wenders and himself as Germany's best filmmakers. I personally never found his films so interesting or they just did not have a great impact on me (except \"Angst essen Seele auf\", but I cannot deny that there is something truly fascinating about Fassbinder as a character. One of the few criticisms I have about this documentary here is the inclusion of Rammstein's \"Sonne\". There is really no reason at all why this was put in here. The song was made long after the filmmaker's death and, thus, was not featured in his works. Yet, Hendel uses it repeatedly in here. I guess that was a way to give it her personal touch, but in my opinion the inclusion was failure, even if it's a decent song. One contradiction I found in Fassbinder himself was how he said he just cannot work with non-professional actors as it's impossible to reach his creative goals with an untrained cast and yet he cast several of his partners (sexual) in his films. Then again, it only adds to the mystery that surrounds him. \"Fassbinder\" is a good watch thanks to the incredibly interesting central character.","user":"Horst_In_Translation","rank":[4,6]}]