[{"title":"A wonderful documentary about the life of the man who played Spock","rating":10,"date":"10 September 2016","review":"This documentary about the life of Leonard Nimoy was entertaining and informative. I thought I knew a lot about the man and his career, but had many \"I didn't know that\" moments, as I imagine will most Trekkies and other fans. The film focuses on the man and his many diverse achievements, but avoided the false light of perfection, showing Leonard's ability to experience setbacks and grow throughout his life, both professionally and personally. Putting celebrities on pedestals isn't good for us or them and this film avoids doing that. The film is honest in ways that will undoubtedly surprise many. Leonard Nimoy is not synonymous with Spock, but even hardcore Trekkies should enjoy depth of the film and learning more about the man, rather than just the character. A big \"bravo!\" to Director Adam Nimoy, aka Son of Spock, and his team.","user":"angie-42715","rank":[25,28]},{"title":"For the hard-core Trekkie, and anyone else with an affinity for Spock","rating":9,"date":"7 September 2016","review":"Star Trek's been in my life for a week shy of 50 years at this point. I was saddened by Leonard Nimoy's death in early 2015 both because of my affinity for Mr. Spock and because I was able to work on a TV show for one day with Nimoy. So when I got a chance to contribute to the making of this movie through Kickstarter, I jumped at it. This documentary, made with a heap of love by Nimoy's son Adam, chronicles the life of the actor starting with his move to California in the 1940s, follows him through his salad days in the 1950s working as an actor for no more than two weeks at a time, and then describes his big break, diving off the cliff into Star Trek. As the movie will tell you, Roddenberry wrote the role of Mr. Spock specifically with Nimoy in mind. What happened after that resulted in one of the most durable characters on both the big and small screens, alien or no. If you followed the saga of Star Trek for all or even part of the last half century, then you will definitely want to see this film.","user":"steven-leibson","rank":[29,34]},{"title":"Mandatory for Any Fan","rating":7,"date":"20 January 2017","review":"In 2015, Leonard Nimoy passed away at the age of 83 in Los Angeles after a successful career especially in the role of Mr. Spock, the science officer and first office of the star-ship Enterprise from the original Star Trek series. His son, the unknown director Adam Nimoy, sees the chance to show to the fans a little of the history of his father through interviews of various fellow actors, actresses, directors, personalities and fans of Star Trek and Spock and footage of home videos. The documentary is mandatory for any fan and gives nostalgia from the period when the series was broadcast for the first time. It could be shorter since the participation of the cast of \"The Big Bang Theory\" is excessive and uninteresting. In the end, \"For the Love of Spock\" is a great homage to the beloved character and cult-actor. My vote is seven.<br><br>Title (Brazil): Not available","user":"claudio_carvalho","rank":[9,10]}]