[{"title":"Cover your eyes, little children","rating":7,"date":"21 April 2017","review":"\"Child Eater\" is a more than admirable attempt to revive a specific type of sub-genre, namely films that are probably best described as \"boogeyman horror\". Movies that bring to life eerie monsters that were initially invented to petrify little children, but then turn out to be frightfully real for kids and adults! In this context, I spontaneously think of semi-classics like \"Jeepers Creepers\", \"The Gate\", \"Troll\", \"Monster in the Closet\" or \"The Boogens\", but \"Child Eater\" is actually a lot darker and more sinister than those. The tone, atmosphere and evil nature of the boogeyman here is more reminiscent to \"Candyman\" or the original \"Nightmare on Elm Street\". Mind you, I'm not saying the overall film is as good as those classics, but merely that the titular monstrosity is truly nightmarish and his background story is ultimately morbid. Writer/director Erlingur Thoroddsen – I think we better keep an eye on him – makes it clear straight from the beginning that the tale he wishes to tell is dead serious. During the atmospheric opening sequences, the camera follows around a blond little girl who wanders around all alone in the woods. Only when a person approaches her to offer help, she turns around and we learn that the poor kid is holding her own eyeball in her hand. Don't know about you, but this is definitely one of the spookiest yet most attention-grabbing intros I've seen in quite a long time! 25 years later, the same area is still under the spell of the notorious child murderer Robert Bowery. He used to be a friendly petting zoo owner, but a dreadful disease caused him to go slowly blind  and utterly mad. Bowery became convinced that he wouldn't go blind for as long as he murdered young children and ATE their eyes. But that was a long time ago. Bowery was killed, his story became an urban legend and only occasionally there are still reports of a mysterious figure dwelling around in the woods. When 7-year-old Lucas comes to warn his babysitter Helen that there's a monster in his closet, she sends him away because she has more serious problems on her mind. But then Lucas vanishes into the night. As Helen goes further and deeper into the woods to look for him, she begins to realize that the monstrous killer is back. I really enjoyed \"Child Eater\" a lot. It's definitely not the most original horror story, but it benefices tremendously from the desolate ambiance, grim set-pieces and the menacing titular monster. Bowery is a tall creep with thick dark glasses, ginormous ears, rotting teeth and a constant petrifying grin on his face. He actually looks a lot like Michael Berryman... Thoroddson doesn't waste any energy on unnecessary humor and there's plenty of room for gore and bloodshed next to the eerie suspense. The acting performances are adequate enough and although there are some minor flaws, \"Child Eater\" is an impressive long-feature debut.","user":"Coventry","rank":[14,18]},{"title":"Child Eater overcomes most of its faults and manages to provide an enjoyable horror experience","rating":7,"date":"24 March 2017","review":"Based on the short film of the same name, Child Eater comes to us in a feature length horror film from director Erlingur Thoroddsen (who also directed the short), and it features enough spooks and blood to please plenty of horror fans, but it lacks in a few areas to come out on top.<br><br>Helen ( Cait Bliss) has a busy night of babysitting Lucas, a young boy who loves horror and thinks a monster lives in his closet. It doesn't help that the house the boy has moved into was the same house where a bunch of murders took place. Helen thinks nothing of the boy's fear, but it isn't long before he vanishes into the night and Helen runs off into the woods to find him, running straight into the creepy Robert Bowery (Jason Martin), the child eater.<br><br>It's pretty evident Child Eater is inspired by the many '80s horror films that we all grew up with. It features many of the same tropes and gives us just the right amount of gore to keep most horror fiends satisfied. Unfortunately, the film falters when it comes to diving into the character of Robert Bowery. We don't know much about him, save for a bit of third party related backstory. The ending of the movie does leave things open for more, but spending more time building up Robert Bowery in this film would have been very much welcome.<br><br>What Child Eater does well, though, are the creepy setpieces. The abandoned theme park is a frightening place to be chased around in at night, and the film makes sure to give us plenty of chase scenes.<br><br>As for acting, I've read other reviews where people were put off by the main actress Cait Bliss, but I think she did a rather nice job at conveying the babysitter in distress. Child actor Colin Critchley, who plays Lucas, also delivers an excellent piece of work and that's saying something, as I usually dislike most child actors in horror films.<br><br>Thankfully, Child Eater overcomes most of its faults and manages to provide an enjoyable horror experience, while introducing us to a new creature that deserves to have a sequel made. Hopefully, the sequel, if it gets made, spends more time on some backstory and character development.<br><br>This review originally appeared on the website Reviews From the Mind of Tatlock.","user":"michael-tatlock","rank":[12,18]},{"title":"Creepy fun","rating":6,"date":"8 June 2018","review":"Sure, it's not the best acting or the highest budget, but this was creepy. My husband asked me if I saw the figure when the closet door opened, and I had to rewind it--still didn't see it. Just the door opening on it's own made me regress to being six years old and terrified of my closet. lol It's definitely a good watch for fall or around Halloween. Watch it in the dark.","user":"staciarose20","rank":[4,5]}]