[{"title":"Another great debut film","rating":9,"date":"12 July 2019","review":"2019 has been a great year for debut films. Directors, Adam VillaSenor and Reza Ghassemi, have created such an intriguing world in their debut film. I don't think I've seen a movie like this one. It is equally poetic and thrilling. The real stand out aspect for this movie is the cinematography and shots. Really well done and creative. It is somewhat slow in certain spots which is why Im giving it a 9 rather than a 10. But I will give the parts a pass because of how great the film is overall. Also, the boxing sequences at the end of the film are truly amazing. Don't think Ive seen it done like that before. I will recommend to anyone who likes slow burn and visually interesting type of films.","user":"acheampongwamekwame","rank":[11,11]},{"title":"I'll make it simple. Watch this movie. It's gorgeous, carrying depth, humanity and passion throughout. Go. NOW.","rating":10,"date":"12 August 2019","review":"There is beauty in this film that you will rarely find in cinema nowadays. Every single shot has been so painstakingly crafted, colors exuberantly vibrant, with the scenery carefully chosen for each location so uniquely palpable it's breathtaking at even the most simple of moments.<br><br>The story is about a boxing match, but if you think that's the core of its purpose, you are inherently mistaken. This is about a fight yes, but a fight within ourselves is harder to overcome than merely hand to hand combat.\nThe score is absolutely incredible, transcending you with each scene as it lays perfectly balanced with you emotionally.<br><br>'I suppose everyone is lost in their own wilderness.' To quote Masahiro, you will definitely find yourself in the wilderness of our characters, as there is everything you'd want in this story, with challenges and relationships built that you will carry with you long after this is over. You will laugh at loud at some moments, breaking you from the weight this fight has over beloved main characters. It does more than entertain, its invokes FEELING.<br><br>The battle between these two warriors and within themselves is elegantly fought, purposely displayed for our minds to wander into our own battles.\nIt's passionate. It's rage. It's palpable emotionally. Its cuts deep into the true unwavering reminder of our own mortality.\n'Life is so tragically short, but beautiful.'<br><br>It's everything I want in a story, and it's everything YOU should want. Well done team, well done.","user":"tormond2","rank":[8,8]},{"title":"My favorite of the year, so far","rating":9,"date":"23 October 2019","review":"I was able to watch this movie at the festival that came to my city in Oldenburg. There was some hype to which I was quite interest. I dont know what I was to expect when watching, but was quite literally blown away. It wasn't because it was terribly shocking or twisty, but because of how much heart went into the project. Its felt from the beginning. A lot of poetry is on screen. Much beauty and awe can be sensed from the film. The more I reflect on the movie, the more I find myself thinking it might be the best of the year. It's clear that this is the work of people who love cinema. The two actors who portray the boxers really moved me. I still think back to certain scenes with questions, and though I may never know the answers, Im pleased with the wonder. My suggestion is to know that this film more thoughtful film, so know that it isn't action, CGI or spectacle. It is beauty that holds dear here. Loved it.","user":"matthewjacobsen-86629","rank":[4,4]}]