[{"title":"Clowns deserve better","rating":2,"date":"7 July 2016","review":"This movie is utter trash. Pure and simple.<br><br>I could go on about the atrocious acting, mediocre gore, run-of-the-mill baddies and so on and so forth but instead I'm gonna tell you this - stay away from this trash.<br><br>I do love myself a good clown horror - clowns have this mix of \"always smiling, yet at the same time emotionless\" type of thing. These clown all lack that. Some people will go for this flick because of the nudity which again - it is there, but in this movie you end up feeling like \"tits? oh whatever\". Unless you are a teenage boy you are going to roll your eyes and fast forward to the next scene. To avoid acting that is.<br><br>Do yourself a favor and look elsewhere. <br><br>Jon Watt's \"Clown\" is one option.","user":"filipsalapa","rank":[35,52]},{"title":"Every cliché in the book.","rating":29,"date":"29 August 2017","review":"Before watching it, I knew nothing about this movie. Just that people who liked movies I watched had liked it. I guess I was expecting it to be a Troma-type low budget gore fest but it was more, and somehow less at the same time. It had the look and feel of a big budget movie but the script and acting of a movie made by children. While they managed to get the hot girl naked and murdered before the opening credits, it wasn't so good after that. At one point a girl loses her phone. After driving for a long time they decide to call her phone and the guy who answers tells them to keep driving and make the next left and he will meet them there. And they do it! One thing that distinguished this from a Troma flick was the distinct lack of gore. We see the hot girl get killed by a machete that doesn't even cut through her shirt and then later we see one bloodless stabbing. Overall I'd have to say this movie is very average for the genre. Definitely worth watching once.","user":"TheMeanGreenMidget","rank":[9,11]},{"title":"The Town That Dreaded Grease Paint","rating":2,"date":"14 July 2016","review":"Seems this film has divided IMDb forum folks into the \"Worst Ever\" and \"I Liked It\" groups. I can only say that within a bit of both is where the film falls.<br><br>On the pro side, the film was well shot, not the typical for low budget hand held or camcorder affair. Lighting was also well done, never too dark, never too anything but mood appropriate. Also the music was well designed and used appropriately.<br><br>Some nods to classic slashers were not unnoticed and were a welcome tip of the hat. Most prominently was a tip to \"Halloween\" with a key family named after the principal character (no not Myers). And if you are really into horror from all decades one of the killer clowns resembled Conrad Veidt from the silent thriller \"The Man Who Laughs\" (a man who is disfigured via torture to always have a wide grin - said to have been the inspiration for The Joker in the Batman comics).<br><br>On the con side, well... acting was not anyone's strong suit. The clowns who had no dialog, sans the lone female laugh maker, fared best as ,w ell, they had no dialog! Everyone else was one dimensional, wooden, fiberglass... anything but natural.<br><br>The script was abysmal as it had the characters doing some truly idiotic things; none of which ended well at all. First and foremost among the nonsense was the plot device used to lure the group heading to a concert to the almost abandoned town where \"clowns ruled\". How the clowns came to be rulers of the sorry place is never quite explained enough. Something to do with a train wreck and a couple creepy pre-teens (in the opening flashback; again a nod to \"Halloween\"). This lack of origin made for a nagging issue during the entire run. Hey, even Myers and Jason had background stories! I gave this a two based on the pros which are not really enough to recommend. Wait for Rob Zombie's \"31\".","user":"songod-95003","rank":[7,11]}]