[{"title":"Not really a horror movie, more mystery/fantasy","rating":6,"date":"9 October 2018","review":"This is a pretty decent movie.<br><br>It's all shot(98%) with a handheld camera by the girls(mostly claire) and is not bad at all compared to a lot of horror movies that try this style.<br><br>The story is not original but it works,same with the acting,I didn't feel any of them were bad.<br><br>The things they did look pretty much on point with what a group of teenage girls would do in those situations.<br><br>Overall the movie is not bad and if you like fantasy/mystery movies I would say give it a chance.","user":"Zucroh","rank":[30,40]},{"title":"Not My Demographic","rating":4,"date":"11 October 2018","review":"Being of an older generation, I realize that this movie was not geared for my demographic and may appeal more to younger viewers. But since there are not a lot of reviews as I write this, I'll try and give my opinion.<br><br>Five teens from a high school in Maine band together and form a coven on a site where centuries before suspected witches may have been pursued and murdered by the townspeople. By using chants and the power of group thoughts, they begin to realize these thoughts can be transferred into actually making their wishes become reality.<br><br>At first, it's a rather harmless use of their new powers, but as things progress they begin to realize there will be a steep price to pay for their actions. Plus, it will eventually become clear that there's a more sinister force at work among the five teens, one that will have to be fought for their own survival.<br><br>I thought, at times, this fantasy horror film had some surprising moments where it didn't take a path you would expect. Also, the dialogue and characters were more interesting than I anticipated.<br><br>However, overall, I just found this B-movie to be rather hokey and, as mentioned earlier, may appeal more to a much younger crowd. Thus, not awful, but not my cup of tea.","user":"larrys3","rank":[25,33]},{"title":"Witch movie","rating":7,"date":"17 February 2019","review":"After seeing that it starred a batch of teen age girls, I was expecting all the hollywood formula stuff. Lots of sexual content, teen girls who hated their families or who's families hate them, evil male caucasian antagonists, drug content, foul language\n-- the little hope kernel inside me was hoping for a movie that was focused on witchy stuff, so I started watching it, and I kept on watching it\n--My wife and I enjoyed it\n--I was a little disappointed in the ending, the last 15 minutes was pretty predictable, however I would probably rewatch it in the distant future, it is about witchy stuff after all, I dig these kind of movies.","user":"the_doofy","rank":[15,19]}]