[{"title":"Novel idea, but result is incredibly bad","rating":1,"date":"8 July 2017","review":"A look at the modern world but with one alteration: people are essentially neanderthals or cavemen in their development and only communicate through grunts and signs.<br><br>A very interesting premise, which is why I watched the movie. However, from the first minute the movie doesn't offer anything beyond novelty value. The plot is pretty random and pointless and seems set up mostly to shock the audience. Many scenes which, while aiming to shock, made me just roll my eyes.<br><br>Even the main idea - people behaving like they're in the Stone Age - doesn't work well. The people involved live in modern home with modern technology, yet eat with their hands and don't appear to have any degree of intelligence. The concept was not grafted seamlessly into modern life at all.<br><br>End result is an absolute mess. Even worse, it's a pretentious mess. One of the worst movies I've ever seen (and I've seen over 5,000 movies).","user":"grantss","rank":[13,15]},{"title":"Dumbest of the dumb","rating":1,"date":"4 November 2017","review":"AAAAAAAAH! is undoubtedly the dumbest film I've seen in a long time, which is no surprise given that it's the brain child of the constantly overrated Steve Oram. The aim of the film is to depict a modern society with one key difference - mankind has devolved to the level of apes and can no longer speak a proper language. What sounds like a potentially interesting premise turns out to be a mere excuse for crude gags, bad taste scenes, and the expulsion of bodily fluids. There's sex and violence here presented in a matter-of-fact way, but the most shocking thing is that good actors including Julian Rhind-Tutt and Toyah Wilcox somehow thought it would be a good idea to get involved.","user":"Leofwine_draca","rank":[6,7]},{"title":"One of the very worst pieces of garbage that I ever had the misfortune to suffer through, it isn't fit to even be called a f***ing film.","rating":1,"date":"2 January 2018","review":"Urgh, this thing, about god knows what, was simply horrendous. It was like watching a group of imbeciles who had all snorted copious amounts of coke and had begun to mime out vague scenarios just as it was kicking in! There was just not one redeeming quality, it was never anything but annoying and boring, there's nothing here! They just screamed at you, it was disgusting, and the sheer idiocy of its concept rapidly p*ssed me off within the first five minutes. I knew I was in trouble as soon as I realised there was no dialogue whatsoever, and that I'd have to listen to that mindless twaddle for the entire duration. Was it intended as a joke? I mean why would they do this? Who looked at this canker sore when it had wrapped and went \"Ok, let's put this on TV, for millions of people to watch.\" Shame on you! I'm disheartened at the thought that there will actually be those 'auteurs' out there who will convince themselves that they'd enjoyed this and that it was in any way shape or form good, just because it was so ~original~, which apparently alone counts for so very much in the movies these days.. Who cares about story when we got originality on our hands, this 'movie' sure didn't! In what world could anyone seriously get anything out of this except for maybe a bad headache? I can occasionally enjoy bad movies and I had no expectations one way or the other when I decided to watch this, but it was way outside my tolerance level of s*it in a movie, at least B-movies can make you laugh. This was no film, it was a tedious comedy sketch stretched out to the point of absurdity. I could perceive no progression from the first minute to the first hour, it was just sequences of idiots screaming and yelling leading into additional scenes of screaming idiots, and then it ended! I did force myself to sit and watch it all because I was determined that such a gruelling monstrosity of a watch wasn't going to get the best of me, and I suppose it was kind of mesmerising in the way that a car wreck is, I could not help but keep staring agog just to see if it was actually going somewhere, and it never did.. Well knowing is half the battle(!) Many shoestring budget movies are very good, but there was no real effort put into this one. It's like they thought the concept of modern humans acting like Neanderthals could carry it, but however you look at it, that concept was horribly executed, as they're in a modern city surrounded by modern technology, so why would they be acting like apes? Not for me thanks, I would never consider myself any kind of expert when it comes to movies but I do know that I prefer them with acting, and a semblance of thematic structure, and not a bad interpretive stage play that I will never watch again ever. \"Aah\" indeed... Beware!","user":"Foreverisacastironmess123","rank":[5,6]}]