[{"title":"Intimate look at the amazing Misty Copeland","rating":7,"date":"1 November 2015","review":"\"A Ballerina's Tale\" (2015 release; 85 min.) is a documentary about the life and times of Misty Copeland, an African-American ballet dancer at the American Ballet Theater. As the movie opens, we see Copeland at a young age (13 or 14?) at a ballet practice. We are then informed how few ballet dancers make it into the elite dancing troupes, and of those that make it, how very, very few African-Americans or dancers with a 'muscular' body make it. After that we start following Misty Copeland , as she goes about her day-to-day routine. To tell you more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is not an earth-chattering documentary by any means, yet it serves a good purpose, namely to shine the light on the lack of diversity in the ballet world. Or, as one of the 'talking head experts' phrases it in the movie: why does ballet look like the Alabama Country Club in 1952?\". Or as the New York Times put it in a major article: \"Where Are the Black Swans?\". Other topics that this documentary looks at include the issue of injuries, which Copeland also has to deal with, unfortunately for her. Ballet dancing at the elite performance companies such as the ABT has become so much more demanding in recent years (and it always was quite demanding before that too). Then there is the footage of Copeland performing. Even though she didn't start dancing until she was 13, you can tell from the footage of those first years how much talent and grace she had from the get-go. Watching Copeland dancing Sawn Lake is pure delight. Final note: from the end credits, it looks like the movie was funded through Kickstarter (it looks like hundreds and hundreds of people contributed).<br><br>\"A Ballerina's Tale\" opened this weekend at my local art-house theater here in Cincinnati. The Sunday early evening screening where I saw this at was attended okay but not great. Regardless, if you like ballet, or are simply curious to learn more about the amazing Misty Copeland, you cannot go wrong with this movie, and I would readily recommend you check this out, be it in the theater, on VOD or eventually on DVD/Blu-ray.","user":"paul-allaer","rank":[4,5]},{"title":"The Wonder of Misty","rating":7,"date":"15 October 2015","review":"Greetings again from the darkness. You may have seen her \"60 Minutes\" segment earlier this year, or you may have heard the announcement over the summer when she became the first African-American Principal dancer (prima ballerina) at American Ballet Theatre. Or perhaps you recognize her being featured in advertisements for Under Armour or T-Mobile. If none of this sounds familiar, then you may be totally unaware of Misty Copeland, and director Nelson George has just the documentary for you.<br><br>One need not be an expert on ballet to recognize the ability, tenacity and stage presence of the lovely and incredibly athletic Misty Copeland. The grainy footage of her dancing at age 15 can't prevent this star from shining. Soon enough she is the only black dancer in the American Ballet Theatre troupe of 80, and from there she just continues to advance.<br><br>The film touches on her unusual and challenging childhood, and also provides a brief primer on the history of ballet (15th century Italy, 17th century France), before naming the few names of the African-American ballet dancers over the years. See, skin with color and a muscular body were considered taboo in the lofty world of ballet  and it became even worse during the era of famed choreographer George Balanchine. His vision of the perfect dancer led to a culture of eating disorders, depression and impossible standards for body image. The point is that Misty Copeland not just broke down color barriers, but also body image expectations  even though she went through her own struggles (Krispy Kreme, anyone?).<br><br>We are also provided a peek at the physical grind and incredible strain that these dancers go through to appear so graceful and effortless on stage. A stress fracture in her shin threatened Misty's career, and the film follows her recovery and remarkable ability to become an even better dancer after the injury and surgery.<br><br>Most interesting is the relationship that Susan Fales-Hill cultivated with Misty. This mentorship helped Misty fight through the personal and social challenges, while also connecting with the movers and shakers throughout the African-American community. The film's best sequence has Misty connecting with Raven Wilkinson, who was a ground-breaking dancer from the 1950's. Watching these two ladies (separated by multiple generations) bond through dancing is heart-warming and extraordinary.<br><br>Of course, we also are treated to a few extended dance performances from Misty – both live performances and the under-appreciated practice sessions. This culminates with her being cast as Odette/Odile in \"Swan Lake\"  yes, a black 'white swan'. Her talent leaves us in awe, and is surely inspiring an entire generation of young dancers. The film certainly would have been better served by allowing us to connect with or understand Misty the person  but we must be satisfied watching Misty the dancer.","user":"ferguson-6","rank":[6,10]},{"title":"Could Have Been Better","rating":3,"date":"2 March 2016","review":"Not clear whether the mixed race parents she spoke about were her biological parents or her adoption parents. It would have been a more complete and accurate life story to know the relations between those parenting groups. Also missing was the vast turmoil that dominated her early life in regard to who was guiding her, and with the substratum of economic ramifications. Not discussed and certainly an important part of her story. <br><br>If it wasn't constantly conveyed that she has some African genetics (i.e. she's black), at first I thought that she was Mediterranean or perhaps near/middle East or even India subcontinent. So the biracial emphasis seemed almost displaced, and also that she was told by her mother to always check the \"black\" box unless it was for advantages in economic and other affirmative action assistances. <br><br>Again, strange that even though she was promoted as a trail blazer for women of color in ballet, it was only towards the end that there was acknowledgment of such women present in that art from half a century and more previously (especially in the more accepting Europe). Most egregious was the lack of mention of Maria Tallchief who went to even greater ballet acclaim world wide despite an even more discriminatory cultural, political and economic milieu for Native peoples than was faced by African-Americans (an easy history check if doubted). Making me question the accuracy of \"A Ballerina's Tale\" were two comments concerning Balanchine where he was intimated to be a primary source of American ballet's supposed obsession with overly white ballerinas, yet guess who he championed - Maria Tallchief.","user":"westsideschl","rank":[6,12]}]