[{"title":"I cant find words..","rating":1,"date":"25 June 2018","review":"I was looking forward to see this movie, the poster looked promising.\nGirls in bikini chased by T-Rex while navy SEALS trying to protect them.\nOhh boy was I up for a dissapointment.\nFirst of all, the navy SEALS are not navy SEALS, they have US Coastal Guards uniforms, and none of them are so stupid they send only 2 soldiers with barely equipment to survive a day to a abandoned island. Yeah yeah, I know its only a movie, but still...<br><br>After about 5-6 minutes I was sure I hit my FireFox button and had started a episode of 'Girls Gone Wild', and it was a long episode too, close to 30 mins with girls and boys with little clothes on, doing what they use to do during spring break.<br><br>After this, its rapidly going down the drain, the missing Sci-Fi and Horror parts never shows, they are all missing. The girl in bikini beeing chased by a dinosaur is missing.\nWe do see dinosaurs, some really bad CGI gives us some blurry small ones, most likely intended to be raptors, but hard to tell. AND we get a perfect 3 second view of a T-Rex ass.<br><br>Carlos Perez have a reputation to write not too good scripts, he dont fail on the failing part here either.\nDirector Lisa Palenica have little to no help from the script, but then again she too have a reputation to direct not too good movies. I really hope she start to learn soon.\nThe actors does as god as its possible I guess, with the bad script and low energy from the director.<br><br>To sum it up, its impossible to give -1 star, I really wish it was possible because this movie deserve a -1 star...","user":"SpecialWeirdo101","rank":[4,5]},{"title":"Thank you teaching me all this film stuff","rating":1,"date":"29 August 2017","review":"A group of college kids on spring break take a trip to an island and crashes...T-Rex and raptors. The film is being watched later by 2 Navy Seals on the same island who attempt some MST-3000 humor but fail miserably.<br><br>The first 30 minutes or so is spring break activities with girls grinding in bikinis and doing upside down splits on a stripper pole...followed by the worst filmed sex scene by design...at least have the guy curl his toes during climax if that is all we see. We already know the ending...and plot spoiler (?) when a character becomes annoying they die,..sort of like sex was a prelude to death in early slasher films. Acting was fairly sorry too.<br><br>Guide: F-word. Sex scene of a foot. Girls in bikinis.","user":"nogodnomasters","rank":[1,2]}]