[{"title":"Enjoyable","rating":7,"date":"28 April 2019","review":"This is decent movie . The boy is exceptional and gives a very scary performance at times. I do think it's hard to make a decent horror now and obviously you think of Damian. It's not that good but the suspense is good with plenty of jumpy bits. It's well worth a watch.","user":"steveevans-35154","rank":[83,105]},{"title":"Meh...","rating":3,"date":"13 May 2019","review":"I remember seeing previews for this movie and then never heard about it again. Should have been a sign when I was then surfing Redbox, but I'm willing to give movies a shot that are basically straight to dvd release, I've been pleasantly surprised before. The Prodigy was not one of those times.<br><br>This movie lacked a real \"heart\" and solid ground storyline that could then be grown upon and shaped into a horror or thriller movie to stand alone on its own two feet.<br><br>Issues I had:<br><br>The passing/skipping of this movie. We go from birth to 8/evil within the first 10 min. I realize they wanted to show the beginning evil man being murdered/Miles being born to cover the soul jump, but was that 3 min scene really necessary? Could they not have had that be researched and found later on? Or could they not have then showed a progression of Miles being evil throughout his life? With such a time jump and being thrown straight into the movie, there is 0 to none character development. What do we have when there is no character development? Lack of care of our characters and their journey/stories. I could care less about this family. The dad is barley even in it to start, I thought maybe they would make the evil soul be his father, Miles grandfather, explaining the soul jump. But no, it is only alluded he had a POS dad so he could then be absent throughout Miles' transformation. The whole movie is way too choppy, like they rushed at the end and just threw scenes together to make the final cut.<br><br>Speaking of, the soul jump. It is completely random and does not make any sense other than Miles being born when the evil man dies. There is no common thread there, complete and utter strangers. None. Zip. Made for no real impact on whose soul was in him or why.<br><br>Soul jumping. We go from a therapist to a what I can only assume an \"expert\" in this soul jumping within a scene. No discovering, no research, no doubt or other theories. \"My son has a problem, listen to what he said in his sleep\" to \"He has an evil soul in him, seen it before, you have to let the evil soul/person finish his business before you can have your son back.\" Period. The mom does not believe it at first; but what do you know? Within the next scene she is a firm believer, I think bc of the jump scene of Miles having a man head or something. Yawn.<br><br>The dog. I am so sick of \"scary\" moves killing the family dog. It's been done. It's played out. It's annoying. Leave the dead horse alone. The second I saw the dog, I said it will be murdered. Why? Bc it has to. Why? Ummm, I don't know stupid directors, you tell me why? Just to emphasize how \"evil\" your characters are. Boring and over it, it's actually become a movie pet peeve for me these days. Come up with something new, you dud.<br><br>The ending. Was predictable as all get out.<br><br>This movie was so forgettable and not well made, I wish I hadn't even spent the $1.49 or whatever Redbox costs these days. Don't waste your time on the choppy mess.","user":"sugarnspices","rank":[31,38]},{"title":"A watered down 'Orphan'","rating":6,"date":"8 February 2019","review":"It was interesting. I liked the acting and the plot twist was a nice/new one. Reminded me a lot of orphan","user":"Marc22722","rank":[68,94]}]