[{"title":"Arnold can actually pull off drama....","rating":7,"date":"7 April 2017","review":"This was a very interesting experience, to watch an Arnold Schwarzenegger film without laughing or thinking \"damn what a bad ass\". Instead the film is emotionally tough and Arnold really pulls it off to make you feel pitiful and sad from the opening sequence. And the film becomes interesting by showing two perspectives of a very complicated and sad situation. The film makes you think about morals and revenge in a very \"deep\" way, something i would have never expected from an Arnold Scharzenegger film. Respect to Arnold for evolving as an actor.<br><br>Not a casual watch but definitely a very good film. (must see for Arnold fans)","user":"DrGordn","rank":[133,166]},{"title":"Not bad, but not good either. Average.","rating":6,"date":"27 July 2017","review":"This is not a bad movie, like most of the other reviews make it look. However, It wasn't good either. It was average - a movie that I wouldn't watch again because there is nothing new to see or discover the second time.<br><br>I didn't hate the movie. I thought the acting at some points was poor and the script was forced, but apart from that, everyone did their job. Some parts could have been improved in terms of making it more realistic.<br><br>Overall, I am giving Aftermath a 6 out of 10. I really wanted to like the movie more but I just couldn't.","user":"epramatarov","rank":[38,46]},{"title":"A. Schwarzenegger will surprise you...","rating":6,"date":"31 May 2017","review":"Not exactly the best film and the filmography surplus, but this film still manages to pull viewer into a story that is, simply put, sad. The sequence of events takes characters through many years of deep regrets and pain, showing us that one event can leave an indelible mark on us. Despair and pain can lead even most average person, who lives completely average and peaceful life, to become furious madman in the hunt for something that will never be. <br><br>This is far from Oscar material, but it is a certainly watchable movie, which, in some moments, makes you think \"what would I do?\".<br><br>Arnold S. showed his \"emotional\" side, which to be honest is very warm, paternal and sensual but at the same time ... Well, look at the film. It is not a waste of time, but do not expect too much","user":"caelum-natura","rank":[38,46]}]