[{"title":"A Shrewd Romantic Comedy - Fresh & Original","rating":9,"date":"4 May 2016","review":"\"I'm a superficial narcissist\" \"I'm lazy and judgmental.\"<br><br>This is how the two romantic leads in \"My Blind Brother\" introduce themselves to each other, and I fell in love with them both immediately.<br><br>Then, when they both reveal that they perversely wish they could be invalids so they'd have an excuse to lay in bed all day and watch TV, I fell in love with screenwriter Sophie Goodhart. Add in a blind guy, jaded and bored with his own infirmity, who is smoking weed unabashedly in public, even with the police nearby, who says, \"I could shoot up in front of cops and they wouldn't do anything,\" and I love this movie in full. It manages to be morbidly dark, joyfully funny and unsentimentally touching all at the same time.<br><br>The storyline itself is genuinely fresh; unlike so many other films at this festival, I can't think of another previous movie to compare it to. Robbie (Adam Scott) is a champion blind athlete and local philanthropic hero doted on by the community (and his parents) and seemingly incapable of wrongdoing. His apparently well-earned egotism is fed by his frequent, televised crusades to rise above his \"disability\" while also raising money for charity, where after each successful feat, he is surrounded by gushing reporters who never seem to notice that he tells the same, lame joke every time: \"You look beautiful today,\" Robbie the blind guy tells every female member of the press.<br><br>Robbie's hapless, unassuming brother Bill (Nick Kroll) knows the real Robbie to be arrogant, selfish and rude, but he still guide-dog- faithfully runs every marathon by Robbie's side and never makes a peep when he doesn't receive any accolades, or when even his own parents continually criticize him. One night, Bill escapes the relentless Robbie- worship by hitting up the local bar, where despite his best efforts to present himself as unworthy and unappealing, he gets lucky with an attractive and like-hearted woman named Rose (Jenny Slate). Bill is guilt-ridden because Robbie's blindness was the result of a childhood accident in which he was involved. Rose is a guilt-ridden because immediately after she told her fiancé she wanted to break up with him, he distractedly crossed the street and was hit and killed by a bus.<br><br>After one pitiful, anti-romantic (yet soul-soaring) night together, Rose flees without leaving her phone number. Nonetheless, Bill thinks his karma might finally be coming around and that he's found his sad-sack love-match. But his fantasy is soon squashed when his brother introduces him to his own new paramour - the very same Rose, who (without knowing he is Bill's brother) has started dating blind Robbie in an attempt to make herself a better person. Now Bill must decide if he will put himself second again or finally stand up to his blind brother.<br><br>Kudos to writer/director Sophie Goodhart for opting against a \"when bad things happen to good people\" script and instead going with \"when good things happen to bad people.\" Goodhart's two, guilty, self-loathing characters are amazingly charming and lovable. Robbie makes a wonderfully heroic antagonist, whose capability and determination we slowly come to dislike more and more as the story unfolds. (The fact that actor Adam Scott looks quite a bit like a smugly smiling Tom Cruise doesn't hurt.) And Goodhart's ingenious twist on the conventional love-triangle takes the sentimental weight out of the usual wet blanket that hangs over traditional romantic comedies. This movie is bright and buoyant and makes us laugh at ourselves more than at mere jokes.<br><br>Goodhart's head-on attacks of our socially-correct attitudes toward both the physically handicapped and noble self-sacrifice are deftly executed dark humor that captures what's funny about resentment, bitterness, and condescension. Her sharp jabs at \"those less fortunate\" never feel like bullying and never fall into rude buffoonery. Even as the movie escalates into full-blown wackiness, it still maintains its shrewd edge.<br><br>Another strength to this film are the secondary characters. Rose's prissy, eye-rolling, sarcastically unsympathetic roommate (Zoe Kazan) ends up with the stoner blind guy. Ha! It's just another delightful quirk in this defiant film where apathy and under-achievement are treated as virtues and perfection is the problem to be overcome. Finally: a romantic comedy with mutually flawed lovers, where no sacrifice or self- improvement is necessary for them to win happiness and each other.<br><br>Just be fair, I will say that there are a few small spots where the script veers into impossible interactions - stupid things that could or would never actually be said. These mini-moments wouldn't stand out so much if all the other moments in the script were not so true and all the other lines were not so witty. I am not usually a great lover of comedies, and the fact that I am calling this film One of the Best of Tribeca 2016 means it is truly something special.","user":"helen-51122","rank":[16,21]},{"title":"One of those under-appreciated comedies that really does deserve a much wider audience.","rating":8,"date":"24 February 2017","review":"'MY BLIND BROTHER': Four Stars (Out of Five)<br><br>A romcom about an overachieving blind man, and his under-appreciated brother, that both fall for the same woman. The movie stars Adam Scott, Nick Kroll and Jenny Slate. It was written and directed by Sophie Goodhart. The film received an indie theatrical release at the Box Office, while it was also made available on video on demand, and it's received mixed review from critics as well. I found it to be mostly entertaining, and well made. <br><br>Robbie (Scott) is a blind man that's always trying to prove how much he can still do, despite his disability. He's become quite a cocky asshole because of it. His brother Bill (Kroll) is always forced to assist him on his ventures, while receiving none of the credit. So a very abusive relationship has formed between the two brothers. This only becomes more complicated when they both fall for the same woman (Slate).<br><br>The film is very darkly comedic, in a really clever and mostly believable way. The characters all seem like real people, and the performances are all great. This is one of those under-appreciated comedies that really does deserve a much wider audience than it's gotten. Hopefully more people will discover it over time. It's definitely worth a view, I'd say.<br><br>Watch our movie review show 'MOVIE TALK' review at: https://youtu.be/RO7ghqXHCCY","user":"Hellmant","rank":[6,7]},{"title":"Brotherly Love (and Hate) is Blind","rating":4,"date":"16 March 2017","review":"A story of disability, rivalry and jealousy; My Blind Brother raises the interesting conflict of duty vs. desire in the form of its two core protagonists: Robbie (blind) and Bill (brother). This dichotomy is only further enhanced through the introduction of Jenny Slate's character of Rose, who provides a very literal representation of the metaphor at the film's heart.<br><br>Conceptually, the idea is fun and functional enough, however this does not elevate the action much beyond- what feels like - very low production values and generally low ambition; especially when considering the relatively high profile of the likes of Adam Scott. Admittedly, some of the scenarios which are devised or concocted do lead to genuinely enjoyable character interactions and memorable moments, yet there are times when glaring plot holes are concerningly evident; and worst still character motivations, decisions and actions are left unexplained (or probably more likely left on the cutting room floor). Considering its potential, this was a somewhat disappointing effort from a cast and plot capable of much more.","user":"christonr-64261","rank":[5,7]}]