[{"title":"Annoying first person view and lots of questions","rating":4,"date":"12 July 2016","review":"The most annoying thing about this movie is that it is filmed through \"smart glasses\" (they are basically google glasses) of the main character. Now, i personally love well done found-footage horror movies but this is just plain annoying. e.g. voice recognition turns on randomly and starts playing music during an intense scene... yeah, as stupid as is sounds, it happens.<br><br>Until a good portion of the movie is over we learn absolutely nothing of interest to the main plot. And even after the movie we know so little about what actually happened.<br><br>The plot goes like this: Two girls go on vacation in Jeruzalem. They have fun there and meet two nice guys. One of them starts having a bit of a bad feeling blah blah blah. Suddenly we see fighter jets bombarding the town and the a long long escape follows. All we know is that basically judgment day is about to happen. That's it.<br><br>There are only very few monster encounters. All of them except one don't feel creepy one bit, unfortunately.<br><br>I think the premise of the movie is decent but badly chosen first person view and a long hysteric escape makes this movie not really worth to watch.","user":"lukasbaehler","rank":[16,17]},{"title":"A Massive Letdown","rating":3,"date":"25 January 2016","review":"Such a disappointment for a film that started so well. I liked the Google Glass POV concept - much more believable than lugging an open laptop or a video camera around, and the early glimpses of the bat-winged demons of the apocalypse was excellently done. The characters developed nicely, the acting was quite acceptable (despite Yon Tumarkin's wooden and unconvincing contribution), and Jerusalem beautifully shot.<br><br>Just a pity that the director had to go and spoil that magnificent build-up by unaccountably jamming in ever single one of the most ridiculous found-footage and horror movie tropes you could think of.<br><br><ul><li>The lunatic rescue mission to the darkened insane asylum (I kid you not!). </li></ul><br><br><ul><li>The cracked camera lense for that really cool disjointed and shattered film look. </li></ul><br><br><ul><li>The inexplicable insistence on dragging a bitten and obviously infected friend along with you. </li></ul><br><br><ul><li>The absurd crying and screaming in the dark and dangerous tunnels where silence is essential.</li></ul><br><br>Have these people never SEEN a horror movie before? It's like they're DETERMINED to die.<br><br>I just couldn't make it to the end - giving up on the film after 15 minutes of unwatchable dark, broken footage as they crawled through the cave of the demon bat beasts. All I could think was \"won't this mewling woman EVER shut up?\". I do hope she got eaten.<br><br>What a waste!","user":"karlsaville","rank":[70,85]},{"title":"film would have been OK if it wasn't for Sarah","rating":3,"date":"29 January 2016","review":"This movie had so much potential. The premise was OK, if not just a bit too convoluted. And there wasn't very much explanation, so you're kind of disjointed. It was almost like there were two different directors for the first and second halves. It seemed to be going in the right direction, but then just went from bad to worse. I believe if they would have just killed off Sarah at the beginning of the movie, then things would have been alright. Every other character was likable,and not a douche like Sarah, but instead we had to suffer through the whole movie with this needy, snivelling, annoying, I'm gonna get everybody killed because that's what I do, character. I couldn't even enjoy the film because I had to fast-forward through all of her whining, self-righteous bull-crap. So that was pretty much the whole movie. Thanks a lot Sarah. If you can stand a character like that and have some time to kill, then go for it. Otherwise, don't regret it like I did, and find another movie.","user":"vernonw70","rank":[28,32]}]