[{"title":"A lot was done right here","rating":6,"date":"23 November 2016","review":"\"Egon Schiele: Tod und Mädchen\" is a co-production between Germany and Luxembourg that resulted in a 110-minute German language movie from this year (2016). The director and co-writer is Austrian filmmaker Dieter Berner and with the script he got a nice deal of help from prolific Austrian actress Hilde Berger. I mentioned the Austrian impact several times already and this also impact also results in the language in here being Austrian German, a dialect of standard German and I as a German had occasionally difficulties to understand all the dialogues. But it is not so bad that you need subtitles either. There are also very brief inclusions of French language for example and you also won't need subtitles for these parts either. This is the story of Egon Schiele, a successful Austrian artist early in the 20th century. Despite his untimely death under the age of 30, his name is still known to many today, especially those with an interest in the world of painters. The title character is played by actor Noah Saavedra in what is easily his career-defining performance so far. He played a very small part in the latest James Bond movie \"Spectre\" as well. But in this movie we have here he is in basically every scene from start to finish.<br><br>The title could also be \"Egon and his women\" as the movie is packed with young attractive females crossing Schiele's professional (and inevitably also his personal) path. These would be Moa, Edith, Wally, Gerti, Adele and others and the good thing is that despite this quantity of women, all of them have their very individual strengths in which ways they add to the film. If there is any suspense in this film, then it is which of these women actually married Schiele eventually and she is also the one that died right next to him as we find out right at the beginning. One of the film's strengths is that it is a biopic. It is based on real events and real characters. Of course, parts were added for dramatization purposes I am sure, but this is not a problem at all. I am sure the crucial elements, such as the child abuse trial, are all based on facts. The film needed a little while to really start becoming interesting, but this may be just my personal bias as I have little to no interest in the world of painters. But it is even more impressive that Berner managed a film that still entertained me well, probably because the focus is on Schiele's personal life and yet it still never loses the professional life from the plot. It succeeds in both areas and the filmmaker nicely walked the fine line here. It is not so personal that it could have been about everybody and it is not so artistic that it really just would have been for art lovers. Really well done. More impressively, the film comes close to the two-hour mark and it almost flew by in my opinion. Yes none of the performances (including the lead) were majorly impressive, but they all were also fairly decent. Maybe Maresi Riegner was the best from the bunch. And there was even one really touching moment, namely when we find out about Wally's death (strangely not about his wife's death, which is not half as touching). The title is also a good reference, not just in terms of Schiele's most known work, but also in terms of the two different times when the film plays. All in all, this is one of the best period pieces from 2016 I have seen so far, maybe even the best. I was certainly positively surprised with this one and I found it clearly superior to the much older film starring Mathieu Carrière as Schiele. This 2016 movie is absolutely worth checking out, even for people with little interest in art and painters like myself, or maybe especially for those. One final note: I think they missed the perfect opportunity here to give us the ending credits the moment when we see Schiele dead, but that's just a minor criticism. The very brief epilogue afterward was unnecessary and did not add anything really.","user":"Horst_In_Translation","rank":[9,10]},{"title":"Beautiful, erotic, sad, and poetic","rating":10,"date":"1 November 2018","review":"I've always been in love with Egon Schiele's work. He's probably my favourite painter. So, I was a bit skeptical about this film. But I loved it! The cinematography is beautiful, the performances are great (especially Noah Saavedra, Maresi Riegner, and Valerie Pachner), and the music is sublime. Egon produced in his short life around 300 canvases and around 2,000 water colours and drawings. And they are all amazing. I would have preferred a bit more about the paintings and less of the women, but overall, it's a wonderful film. Egon Schiele: Tod und Mädchen is a beautiful, erotic, sad, and poetic film. A real gem. 10/10","user":"antoniatejedabarros","rank":[8,9]},{"title":"a diligent but anodyne biopic","rating":6,"date":"22 November 2017","review":"A biopic of Austrian painter Egon Schiele (1890-1918), what instantaneously catches our eyes is the pulchritude of its leading actor Noah Saavedra, whose Adonis appearance becomes almost too distracting for the movie's own good, but it shouldn't take the credit away from Saavedra's immersed embodiment of the ill-reputed expressionist, who leaves a vast legacy to this world after his own ephemeral and turbulent life. <br><br>After opening the picture with a frenzied sequence of some sort of familial turmoil and envisaging a moribund Schiele smitten with the Spanish flu pandemic in his last days, director Dieter Berner discerningly unspools Schiele's final decade chronologically through the relations with his models: from his underage sister Gerti (Riegner), with whom he forms an intimate bond teetering on the brink of incest, to a tableau-vivant performer Moa (Breidbach), then his bona-fide muse Wally Neuzil (Pachner), whom he first encounters in the studio of his mentor Klimt (Obonya), until his ill- matched bourgeois wife Edith Harms (Marie Jung), only to coyly divulge Schiele's feckless penchant towards his conquests, chiefly for the sake of artistic inspiration and utilitarian purpose, art first, women second, seems a fitting watchword for him.<br><br>It is Egon and Wally's romantic liaison highlights the narrative, and a sylph-like Valerie Pachner gives her best in projecting Wally's emotional gamut out of their artist-and-muse equilibrium, in particular during Schiele's scandalous trial of pornography and pedophilia (another taboo topic subjected to an ambiguous brush), her conflicted reaction stays with audience longer than the artist's outrage of witnessing one of his paintings being torched. But Berner ultimately sweetens the pill of their fallout, which prompts the name-change of the film's titular painting, out of the reverence to Egon's posthumous fame. <br><br>As picturesque as a painter's biopic could ever be, Berner's diligent but anodyne work doesn't pack a substantial punch which would be in concordance with his subject's singularities, especially that unique characteristic stemming from his licentious, tempestuous persona, still eludes us after him shuffling off this mortal coil.","user":"lasttimeisaw","rank":[8,10]}]