[{"title":"A closing chapter on an amazing series","rating":15,"date":"15 February 2017","review":"These last few weeks I watched all of looking and its movie, and I can safely say that there aren't a lot of shows out there that were able to touch me as much as this did. This film does a really fantastic job of allowing us closure on the events of the season 2 finale while seemingly exploring the ideas and themes that made the show stand out as much as it did. Jonathan Groff's work throughout the series really deserved to be praised. He makes it all look incredibly easy but going on this journey must not have been easy, and his effortless charm, longing, and internal emoting really make it an incredible performance that will be hard to forget. I will miss this show and its character dearly.","user":"Red_Identity","rank":[26,26]},{"title":"Perfect closure to adventures of Patrick, Agustin and Dom.","rating":9,"date":"30 July 2016","review":"I just finished re-watching TV-Show, and with huge expectations prepared myself for Looking: The Movie. Yup, I can say it's amazing. Atmosphere and aesthetics of the show are visible, Andrew Haigh really is capable or capturing emotions of those characters in sublime way. This expression has been used a lots of times, but it really does feel like you're just watching real people, not just actors act.<br><br>Acting is great, Jonathan Groff is wonderful here, although he wasn't among my favorite performers on the show, he really shines in the film. I do love the fact that he ended up with Richie, but scene with Kevin is probably my favorite from the film. It was really heartbreaking, and like their fight at end of Season 2, their conversation here is so real, vivid, authentic. The way Kevin kisses him for the last time was so hard to watch, it was really emotional and touching. As well as Richie coming back to the club, and kissing Patrick. It was breathtaking.<br><br>My only complaint is that it doesn't focus on Dom at all, which is shame, because he's my favorite character and Murray Bartlett is perfect in the role, but here he doesn't have much to do. But, considering I love all these characters, it was really nice to see them together again, and when they all met up in the club at the beginning of the film, I literally couldn't but not smile all the time, to see them all again. Afterwards, as I said, it mostly focuses on Patrick, and Agustin and Eddie wedding, and it's nice to see things conclude like that.<br><br>Ending almost made me cry. I really will miss these characters. I hope we get another special like this, but if we don't, this film feels like perfect closure to ultimate tale of friendship, that we had pleasure to watch and enjoy.","user":"sekula32","rank":[38,42]},{"title":"Unsung, Understated Masterpiece","rating":10,"date":"11 August 2016","review":"Understated masterpiece - that's what I feel Looking is as a whole, with the movie being the final installment, perfectly wrapping up the television show. The trials of Patrick upon returning to San Francisco for a short visit - on the occasion of Eddie and Agustin's wedding - are explored from many different angles, allowing us a beautiful, final look at the journey of this young man and the people who surrounded him and changed him along the way.<br><br>Upon finishing the movie, I wished I could personally thank every single one of the people involved in making the show and in ending it with this gem of a film. The series was interesting, daring, different, honest, artistic and, while the show was a slow burner so it took its time getting there, it was also very entertaining. The movie picks up and continues this stroll effortlessly while giving us an idea of how much better still the show could have been had the creators been given a longer time frame for each episode. the film drove home how good, how brilliant even, this creative effort has been, making me both incredibly happy and grateful that we got this movie as a send off and utterly blue that there's going to be no more Looking.<br><br>The unique brilliancy of the show stretches into the movie with the beautiful, melancholic cinematography, the nuanced build-up, the way that everything tied in together in such a way that you could find the ending along every step of the way (you could find the film's ending present in the show itself as well as along the movie) and the insistence on taking a deep, inquiring look at characters, their development and the dynamics of their most intimate relationships. I have some things I may have wanted to see done a little differently, but not enough to take away from how incredible an experience this ride has been. The movie summed everything up in a way which was so right, I'm still emotional over it after having watched it more than once. <br><br>SPOILERS FROM THIS POINT ON <br><br>Beyond all the general praise, I have to give a special round of applause to how the show wrapped up the story-line of Patrick's love life and his eventual ultimate romantic choice. The movie goes through a variety of options of how Patrick might end up in that respect - alone, with a new love interest (explored through a one night stand with a younger, much less inhibited guy than Patrick ever got to be), with Dom (the best friend turning into a surprising love match scenario), with Kevin and in each of these scenes we get a little glimpse of why that isn't quite right. In each of these, Patrick's feelings for Richie are present in some way (in certain scenes it's more explicit than in others). <br><br>In contrast with these scenes - which seem to explore an idea, a notion of a certain future for Patrick, always coming up with the sense it's not it - we get scenes with Richie. From the get go, they're the only ones in which it feels like we don't just have an explored notion, but also actual growth and change in their relationship, as Patrick has changed and matured and Richie seems to become acutely aware of this, changing something critical from their dynamics in season 2, while still maintaining the same sense of longing you got between the two of them during said season.<br><br>Personally, I'm glad it ended with them being together and at peace. They've been through too much pain along the way, maybe necessary pain, but this hurt is a part of why I really wanted exactly such an ending for them. The final scene, in which Patrick and Richie can both lean on each other and let go of their burden, is beautiful. Beyond my personal wishes, I simply have to applaud how masterfully the movie moves these two men, in love and in pain, towards each other, to the moment when they can be with each other, a climax of the romance without relinquishing Looking's overall commitment to telling this love story with a focus on dynamics, intimacy, honesty and communication, at how do two people know each other in this messed up world, how do they share themselves with each other and find their place together. It's this raw honesty that resonates so much and makes the couple's story so powerful. It's a testament to how right they are for each other, that at the end, Richie is the guy that Patrick seems to be most open, most honest and most himself with. <br><br>Overall, I would highly recommend the show and the movie to anyone and the only thing I'm truly saddened by is how many people are missing out on this gorgeous work of art and love.","user":"matanil","rank":[27,30]}]