[{"title":"A pleasant surprise","rating":8,"date":"12 August 2017","review":"Being a devout science fiction fan I've developed a philosophy: \"We have to suffer for our sci-fi.\" Meaning that until recently there have been so few choices in sci-fi and even though most low budget attempts are mediocre and cheesy, we suffer through them anyway because we love the genre.<br><br>Every now and then a low budget indie comes along that surprises us by being even better than most high budget kin.\"Time Lapse,\" \"John Dies in the End\"and \"Revolt\" are prime examples of these overachievers. \"Science Fiction Volume One: The Osiris Child\" is also in this category.<br><br>Set in the future, the story of SFVOOC, (abbreviated title)is about a disgraced former space pilot who sets off on a barren planet with a convict whose escaped the prison from hell in a race against time to save the pilot's twelve year old daughter -- a cross between \"The Road Warrior\" and \"Alien.\" It's a gritty Aussie film with few pretensions a good story and good acting. Released around the same time as \"Alien Covenant,\" it is head and shoulders above Ridley Scott's ponderous, idiotic remake of his sci fi classic. I would go so far as to recommend skipping AC and watch SFVOOC instead. You'll have a lot more fun and be far less annoyed.<br><br>SFVOOC is not a perfect film like \"Ex-Machina\" but an enjoyable effort worthy of our time.","user":"mzand-751-539572","rank":[70,87]},{"title":"Decent good budget sci-fi effort","rating":8,"date":"19 July 2017","review":"This movie has decent acting for the most part, very good effects and CG, a good score and a reasonable story - you get involved, care sufficiently about the characters and so forth. Its not earth- shatteringly original, but I didn't feel short-changed at any point. There is a lot of attention to detail, nice shots, some really nice sci-fi ideas (Love the perpetually revolving prison cells, for example...). Some bits are a little annoying, like the daughters diary voice-overs, a bit Terminator rip-off, but the whole thing works well, looks good and feels suitably polished to warrant your time. Its not going to break any new genre ground, and the gobby title will put off some, but this could easily be a decent pre-marvel cinema release, and I enjoyed it a lot. Some other reviews here look like shills, but it really is head-nodding-at-the-end decent.","user":"mark-179-360743","rank":[82,107]},{"title":"Better than recent \"Sci Fi\" blockbusters","rating":8,"date":"25 July 2017","review":"An interesting film from start to finish, far more polished a presentation than the budget would suggest. It's a mixture of previous film styles like Star Wars, Alien and Mad Max but none the worse for that with a good well paced story line. <br><br>No one will be up for an Oscar but the standard of acting was really good with well filled out characters that you actually grew to care about or dislike!.Throw in some good special effects and photography together with a quality sound track and you've got a good film to watch. The only drawback for me was the last part of the film where it seemed an hours worth of story had been condensed into 30 minutes. It may be the film was cut to fit a 90 minute time span rather than 100 to 120 minutes but it seemed very choppy at the end. <br><br>Any one interested in Sci Fi should find this an excellent afternoons entertainment.","user":"ianmudd","rank":[53,74]}]