[{"title":"Nothing predictable about this, nothing whatsoever..","rating":7,"date":"2 January 2017","review":"As a prolific reviewer, you tend to often discuss a film in terms of traditional arcs, and riffs off those same arcs.<br><br>Which is why it is always a treat when a film comes along that throws the script template out the window and forges its own path.<br><br>This is such a film. It reminded me of THE INCREDIBLE SHRINKING MAN 1957, the first legitimate A-list sci-fi that, like this film, started off in what seemed a traditional manner -- and then went down a plot superhiway that no one had ever seen before.<br><br>It is not a perfect film. It has some flaws. For example, the first 30 minutes are better (more impact, more empathy, more entertaining) than the last 60 minutes. Which is not to suggest that the last hour is bad, merely that the first half-hour is drop-dead stunning and unforgettable.<br><br>And the director often seems confused about who the real star is? Ditto for the PR dept of the studio. If you check the IMDb reference, you will see that the young girl so brilliantly played by Sennia Nanua is given billing lower down on the cast list. That's an error. Sennia IS the film -- she practically picks it up and carries it to the finish line. The scenes without her are weak, the scenes with her are wonderful.<br><br>Nice iteration of a \"really smart\" zombie film. Recommended.","user":"A_Different_Drummer","rank":[228,290]},{"title":"Stands out from the pack","rating":8,"date":"10 May 2017","review":"Let me say first that I am not a fan of zombie movies. Since George Romero's \"Night of the Living Dead\", most have been derivative. There have been some better than others (so I've been told) but none that really stand out from the pack. I think, though, that \"The Girl with All the GIfts\" is one that does stand out in this genre. I read about it and decided to take a chance on it...I figured if I didn't like it that I would just fast forward it and be done with it in about 15 minutes. So I took it out from my local library. Well, I got hooked from the beginning. I would recommend that if you want an interesting, unexpectedly well done movie then give this movie a chance","user":"ganason","rank":[72,90]},{"title":"Highly recommended, and vastly superior to most of the genre.","rating":8,"date":"27 September 2016","review":"Excellent performances and interesting source material (MR Carey adapting his own novel), plus imaginative direction (Scottish director Colm McCarthy), create a chilling sci-fi tale of hungries (zombies) versus humanity.<br><br>The opening sequence sets the tone. Melanie, a young, polite, and courteous girl manacles herself into a wheel chair. She seems entirely innocent and harmless, yet her captors fear otherwise. She and other children, each similarly restrained, are given an armed escort to a classroom. It's an arresting start and it grabs our attention. Sennia Nanua plays Melanie and the story revolves around her. We watch society collapsing through her eyes, see her threatened by the human beings around her, and fear for her. We watch her do terrible things, and yet we root for her. Everything is uncertain. Nothing is as it seems. It's a brilliant performance from a new talent, and it serves the film perfectly. <br><br>Melanie is surrounded by contrasting emotions from those nearest to her. Gemma Arterton is excellent as protective and caring psychologist/teacher Helen Justineau, fiercely defending Melanie against the machinations of Dr Caroline Caldwell (Glenn Close) who sees Melanie as a specimen to be dissected. Paddy Considine convinces as Sergeant Eddie Parks, a tough, no- nonsense soldier fighting a losing battle. <br><br>Colm McCarthy brings this all together superbly, belying the film's modest budget. Striking visuals and frenetic action are never allowed to overwhelm the characters, who take centre stage. And at it's heart is Melanie. Confusing, ambivalent, terrifying, lovable Melanie. It's a wonderful turn from Sennia Nanua.<br><br>Highly recommended, and vastly superior to most of the genre.","user":"Artless_Dodger","rank":[158,225]}]