[{"title":"Why?","rating":3,"date":"28 November 2018","review":"It takes a lot for me to leave the cinema but this film achieved it. From the over the top bow and arrow fights that feel like something out of black hawk down to the bizarre mix of costumes it's just all wrong. I'm really not sure who thought 100 million budget was well spent making this steaming heap of a film.","user":"amazon-39490","rank":[448,548]},{"title":"I wanted to like it. I couldn't manage it.","rating":1,"date":"26 November 2018","review":"If anyone reads this, it's likely because you're either reading a bunch of reviews because you can't decide if a ticket is worth it, or you hated it and are reading all the 1 star reviews so you can say \"thank you\" multiple times when you read a criticism you agree with. If you're the latter, welcome, you're among friends. If you're the former, I'm not going to tell you that you shouldn't see or love this movie, clearly some people do, I'm just going to lay out why I can't.<br><br>It's built on clichés and one-liners, and scenes seem to be written around setting that up, if they set it up at all. Even in the credits, next to the actors name and icon, the most dramatic quotes their character had is written next to them. Most of the lines are written to serve the drama as opposed to being substantive or sensible. There's even a scene with a mildly villainous character doing the maniacal laugher ended by angry scream with the dramatic music in the background, and it literally comes out of nowhere. There was no set up for that character doing that, and it made the whole thing feel silly. Imagine a play built only on the soliloquies of Shakespearean tragedies mixed with every cliché about love giving strength in despair, but lacking any real sense of plot or structure. That is this film.<br><br>Also, the action sequences are filmed like an over the top modern war movie. There's literally a slo-mo scene where some of the characters are driving away from an explosion. I'm not saying there's no place for that in a period movie, but it was executed lazily and without much thought about how to do that and do justice to the combat of the time period.<br><br>Basically this is just a standard subpar action movie with a Robin Hood skin. Splashy effects and dialogue with no effort given to make it cohesive or new or worthwhile. I'm usually the person in a group who's more forgiving of bad movies than others are, but I just can't with this one. I kept trying to enjoy it throughout the movie, and it felt like it was fighting me the whole time.","user":"valarik564","rank":[640,795]},{"title":"Primark clothed, badly staged, legend wrecking, stinker","rating":1,"date":"24 November 2018","review":"Went to see this today... and it was really bad. A real stinker. They have just 5 sets. The town, the church, a kind of bow and arrow Iraq war, the mine with random flares (what are they mining?) and a place for doing speeches to the peasants. The costume department clearly raided primark and you keep thinking how did a man with one hand get handcuffed twice in this film? And when are Blake's 7 going to turn up to ask for their footwear back. There is a scene with dialogue from most English speaking accents... Irish, Cockney, American, Australian but none of this is meant to be funny. The best bits are the super unrealistic close combat bow and arrow shooting... and then end after the excruciatingly bad \"false ending\". Help.","user":"roberteburne","rank":[420,530]}]