[{"title":"Just don't know why...","rating":3,"date":"9 June 2019","review":"I don't know why this was made. Poorly acted and bad script. Highlight is watching the cliches fly through the plot. Love Mira Sorvino. But this was just a mess.","user":"jmbovan","rank":[32,48]},{"title":"I liked it","rating":6,"date":"28 June 2019","review":"I personally liked the movie. Those saying the beginning haf nothing to do with the movie must not have paid attention.*SPOILER ON HOE THEY ARE CONNECTED*<br><br>\nLittle boy was obviously Whitley and the little girl was the hotel clerk. In beginning of movie when little girl was outside she had half an apple and was humming while she buried the bird. Fast fwd. To end of movie.. The lady was burying the body and put the apple tree over the body and put in the nails with it while humming the same song she did as a little girl when burying the bird...","user":"jeniferbehrens","rank":[16,22]},{"title":"A complicated journey; great actors and strong performances make it well worth the ride.","rating":9,"date":"6 March 2019","review":"Adam Marino's Beneath the Leaves takes you on a complicated journey; strong performances make it worth the ride.<br><br>Warning: the subject matter is troubling. Abused foster children, and the perpetuation and outgrowth of that abuse. On the surface, it's a film about a psychotic child killer with a particular class of targets, four of whom escape, grow up, and move on with their lives...kind of...but carry with them layers of damage. When the killer breaks out of prison and begins systematically hunting them down, they are thrust back into the place of their nightmares.<br><br>Underlying the plot is a deeper question of family and belonging that is unique to foster children as the unmoored fragments of society. Such children, unless adopted and fully integrated into a family, often remain emotionally unmoored and carry damage from their original abandonment and the mark of being unwanted. Add subsequent abuse, mistreatment and psychosis to that mix, and you have a real problem.<br><br>Doug Jones, best known for playing exotic creatures (e.g. the Amphibious Man in The Shape of Water), plays James Whitley, a damaged soul who decides to \"rescue\" children like himself (orphaned foster children), reuniting them with their birth parents by euthanizing them.<br><br>Kristoffer Polaha (Atlas Shrugged, Ballers, Get Shorty, Wonder Woman 1984), Christopher Backus (Bosch, Roadies), SerDarius Blain (Jumanji) and Christopher Masterson (Malcolm in the Middle) play the grown-up versions of the four victims who got away. The back story of their abduction, confinement and escape is told incrementally in well-placed brief flashes inserted into the present timeline.<br><br>Polaha's portrayal of the perpetually drunk and frustrated victim turned rescuer - Detective Brian Larson - is emotional and among the strongest of his career.<br><br>Academy Award winner Mira Sorvino plays Detective Erica Shotwell, Larson's partner and lover. Her performance is understated and mysterious. Shotwell is an outsider to the community. She has a chip on her shoulder and a past that she keeps from everyone, including her partner. Sorvino shines in the action scenes and is particularly strong in tense gun-drawn sequences, including pursuing and battling an escaped convict early in the film, and similarly pursuing Whitley through the woods in a climactic scene.<br><br>When Larson is pulled from working the case of his own childhood abductor, Shotwell goes from working with a partner with whom she had way too much chemistry, to one with whom she has none. The pairing of Mira's Shotwell with Aaron Farb's (Kill the Messenger, The Originals) eccentric Detective Abrams makes for an entertaining contrast. At times, you can't tell if Abram's quirks are Columbo-like put-ons designed to lower the defenses of those with whom he engages in the course of an investigation, or if he's forgotten about the investigation altogether. Shotwell can't tell either.<br><br>Farb's Abrams would be the odd man out in the story if not for \"Rose,\" the equally odd hotel manager/madam. Melora Walters - known to Seinfeld fans as George's girlfriend in the classic \"shrinkage\" episode - is weirdly terrific as Rose.<br><br>Mira's father, screen icon Paul Sorvino, anchors the film as the father-like Captain Parker, who we learn from old interrogation video was involved in Whitley's original arrest and conviction several decades earlier.<br><br>Chris Backus' performance as Matt is subtle perfection. No actor could better capture the permanent effects of childhood trauma PTSD than Backus does here. To drive the point home, even the lovely Jena Sims (Sharknado, Attack of the 50-foot Cheerleader) as Alexa, can't break through Matt's shell.<br><br>Chris Masterson's George is creepy as hell and worlds away from his most famous role of Francis on Malcolm in the Middle.<br><br>Veteran actress Marla Adams (Splendor in the Grass, Days of our Lives, etc.) gives a solid performance as the well-meaning foster mother of the abducted boys.<br><br>Don Swayze as Whitley's abusive foster father is appropriately disturbing. Even the kids in this film are outstanding. Of note, young Ashlyn Jade Lopez sets an emotional tone in the first frames of the film that stays with the viewer throughout.<br><br>As noted above, the subject matter is dark and the story is a complicated journey. Outstanding performances make it well worth the ride.","user":"VCH81","rank":[49,84]}]