[{"title":"Good job from Steven Shainberg","rating":7,"date":"6 April 2017","review":"Like most of the time before watching a horror movie I look it up on IMDb and look at the ratings it gets. And most of the time when the ratings are low, like for this one, I just read a couple positive reviews to try to give me an idea of what to expect. And when it seems plausible that it might be better then the ratings tell I give it a shot. So did I with Rupture, and I'm glad I did. Rupture deserves way more than it's actual ratings. The point of a good horror movie is that you are captivated by the story and that it keeps you on the edge of your seat. All credits go to the director Steven Shainberg that gave me everything I expected in a horror movie. Good actors, an intriguing story, a good soundtrack and choice of filming, but above all a lot of suspense. And if you honestly find there is no suspense in Rupture then you must have pay no attention to the movie. Rupture deserves better and if you like suspense without to much bloody details you will like this movie.","user":"deloudelouvain","rank":[62,87]},{"title":"Just Ok.....","rating":5,"date":"6 March 2019","review":"Not terrible. Sort of interesting, and sort of scary conceptually. Noomi Rapace makes this movie watchable. Without her, my rating might have been a \"2\" at best. Her acting sells the story, and provides some emotional connection for the viewer.","user":"nyjazzman","rank":[8,9]},{"title":"genuinely on the edge of my seat","rating":9,"date":"7 January 2017","review":"Looks like there are either some disgruntled ex-lovers/colleagues leaving reviews, or something else is going on here (from the bad reviews that I have read). If you want a genuinely disturbing film, Definitely watch this. I am a movie lover, and, have also studied film for several years. This has a good cast, and, genuinely left me on the edge of my seat. I can't really say any more without giving a major spoiler alert, but, if you are a fan of suspense, this is a MUST watch. I liked how the plot developed, and, where it really succeeded, was, in giving the audience a sense of being enclosed, trapped, and, isolated. My heart was actually pounding that much, I felt I was therewith the main protagonist. A very good film.","user":"zanty","rank":[75,115]}]