[{"title":"Had the right ideas but lacked the right amount of spark","rating":6,"date":"4 September 2016","review":"Before anyone reads this, I am glad to read that some movie goers found the movie great. However, this is just my personal take when I saw this film.<br><br>Without going into too much detail about what this film entails, I felt as though there were a few moments in the film which could have been better.<br><br>1/ The ending was slightly disappointing... and for those who do not understand why then I am sure it will become clear in the end. I just expected more.<br><br>2/ I felt as though more connection was needed between Morgan and the audience. I found the clips of her as a child sweet and warming. I even felt sympathy towards her after she had attacked her first and second victims. However, in the end I felt as though I lacked sympathy for her character, after she became more and more out of hand. This also ties into the first point to do with the ending. I was expecting to be moved, riveted. But instead I felt a mixture of \"Really... after all that, that's how it ended?\", along with a sense of the lack of what I felt was emotion. <br><br>3/ I wanted to understand more about why and how the members of staff loved her so much. OK, she was special - but why did they love her the way they did, even after it became clear that she was starting to become dangerous? Why didn't one of them even question themselves over how out of hand things were getting?<br><br>Just a couple of points. Apart from that, the film was good enough to hold the majority of my attention throughout and definitely had the potential to be very, very good indeed. Credit where it is due, the film's intentions did seem surprisingly in the right place, but certainly more spark... more depth was needed.","user":"hlcajc","rank":[85,120]},{"title":"Good movie - worth watching","rating":7,"date":"24 December 2016","review":"After reading many of the reviews (good and bad), I have decided that until IMDb offers the service to select favourite reviewers, that this will be the last review I write. I do this because there are reviewers who wouldn't know a phone was up their rear end, even if it rang. But I retire mainly because there are reviewers who just don't have my tastes in movies, and there are those that do. I only want to read the reviews of those that like most of the films I like. Then if the majority of them say a movie is OK, it is likely I will agree. And vica versa. Therefore I am wasting my time writing reviews for people who don't have my tastes in movies.<br><br>This is a very good film - period. By all and any measures. The direction is exactly what needed to be done for this movie - the acting is very good - and the sound is also right. This is not a movie for a star to grace the stage with their brilliance (or several) - it is a solid example of the craft of 'old school' suspense/action movies.<br><br>It is clear from watching this movie after reading many reviews, that this is far too 'intelligent' a movie for many reviewers. There is a level of understanding that requires the viewer to think. I guess too many Marvel action movies have dumbed them down, and made them demand clear and concise sequencing and plot development. <br><br>Over and out - until I can read the reviews of my favourite reviewers.","user":"bbv-69237","rank":[184,278]},{"title":"I Was Skeptical at first but...","rating":8,"date":"6 July 2017","review":"very intrigued by what I watched in this film.I felt the momentum build-up to the very end of the movie...........then BANG! What a climatic ending to Morgan. It was definitely NOT what I was expecting to see towards the ending of this movie.I have to admit I really did not expect too much out of what I was gonna watch and with all those who gave this film bad reviews of what I read before borrowing this movie to watch.","user":"sevenseven7","rank":[20,26]}]