[{"title":"Nocturnal Animals - an analysis","rating":7,"date":"3 August 2017","review":"Hello, dear reader - if by some miraculous coincidence you stumbled upon this review, hidden among others.<br><br>This will actually be more of an analysis. Two friends had me explain WHAT THIS FILM WAS EVEN ABOUT when they saw I liked it on Facebook. I've also noticed that - as with many art-house movies -- reviews vary from \"A masterpiece!\" to \"This is about NOTHING\". I understand - a lot of films I myself don't get at all or I don't think they deserve the hype. \"Nocturnal Animals\" I get pretty well though, and I can tell you for sure it's not about nothing. So I'll share my thoughts.<br><br>Spoilers ahead, read after you've watched the film.<br><br>1. Who is Susan? <br><br>This movie is best to watch putting yourself in Susan's shoes. You don't have to like her, but you have to understand her. That's especially important when it comes to analyzing Edward's book, since it's obvious that the events from the book that we see on-screen are filtered through her mind. We get drawn into the fictional world when she starts reading and come back whenever she stops.<br><br>So, who is she? For me Susan is, first and foremost, a person who doesn't fit anywhere.<br><br>She's pragmatic and cynical, and she knows it. She doesn't like it about herself though; rather she's resigned to accept it. So when as a grad student she bumps into Edward - her brother's childhood friend and her teenage crush -- who infectiously believes she can be more than that, she falls into his arms.<br><br>One manifestation of what she escapes is the story of her brother. He's gay; their parents have practically disowned him; Susan hates them for it. She tells Edward that her brother once had a crush on him - his reaction: \"I should call him more often\". His different, soft, human approach is what draws her to him.<br><br>On the other side stands Susan's mother. She's stern and dogmatic but she loves her child. She immediately knows that Susan and Edward aren't right for each other. She warns her daughter that \"We all eventually turn into our mothers\", and that when Susan's organized nature starts showing, she'll hurt Edward.<br><br>Later it turns out she was right. Edward insists writing is his calling, but he isn't any good. Susan eventually stops believing in him. She needs stabilization. She leaves him for another man, Edward's complete opposite. She aborts Edward's child.<br><br>But then it turns out she suffocates in her new neat life, too. Her only constant: she doesn't fit. Whomever she's with, she suffers from insomnia (the \"nocturnal animal\", Edward once called her).<br><br>These are the opposites Susan fluctuates between: chaos and order; Edward's softness and pragmatism that runs in her blood.<br><br>2. The book. What does Edward say to Susan? However Susan understands the book is indicative of what she thinks Edward wants to communicate with it. So it hints at what happened between them in the past, a lot earlier than the film actually spells it out. Prepare to watch Susan's reactions and then put the puzzles together through her flashbacks.<br><br>Only after seeing the end do you realize what game Edward was playing all along.<br><br>He gave the book a title that was their private joke, then dedicated it to Susan. She knew the book was about him -- he'd never stopped \"writing about himself\" when they were together. (That's why she saw Tony as Edward and why Gyllenhaal played both roles).<br><br>Edward knew Susan felt guilty for what she's done. For a long time after she must have identified Tony's family harassers as the eponymous animals - her counterparts in the book - he kept her uncertain of their intentions. Will they hurt the family? Will they leave them alone? Finally, they killed them, as Susan destroyed her and Edward's relationship and aborted their child. Edward portrayed Tony's grief, letting Susan know: \"Here's what you did to me\". Then he expanded on Ray Marcus -- a mindless psychopath -- sending the message: \"Here's what you are to me now\". Finally, Tony kills Ray and dies himself, which means: \"Writing this killed me, but at least now you're dead too\".<br><br>Edward's revenge might seem childish. But it shows what power those once-close hold over each other. Edward doesn't have to spell it all out to Susan. She knows she hurt him once and he knows that she knows. He knows that what gives her some peace is the thought that perhaps, with time, he forgave her, or at least understood. He takes that comfort from her.<br><br>What did Susan do? She left a man she wasn't compatible with. She aborted a baby she didn't want. Whatever your personal opinion of it is doesn't matter; that's not the point. The point is that such things people live with. But Susan now has to live with more than that: the knowledge that she made a person she once loved suffer for the next 20 years. Suffer enough to regret his own softness and humanity (Tony's qualities that made the murder possible). Enough to turn into a man she didn't recognize anymore and to write a book just to make her suffer in turn.<br><br>3. The ending.<br><br>I've seen people write THERE IS NO ENDING AT ALL.<br><br>What happens in the end is this: Edward and Susan arrange for a dinner to discuss the book; she comes and waits; he never appears.<br><br>It might seem anti-climatic; but if you were in Susan's place, I guarantee you wouldn't say so. She realizes she'll never be absolved; that the worst possible interpretation of Edward's book was the intended one; that this story will soon be published. Maybe become a bestseller. Her past has caught up with her.<br><br>Thank you for reading and have a great day :)","user":"thing4m4jig","rank":[913,961]},{"title":"Secretly Philosophical","rating":8,"date":"26 August 2018","review":"I think IMDb doesn't give a good synopsis for Nocturnal Animals. So I'm going to give it a shot. A lot of people were disappointed with the ending, but you have to think about it for awhile to realize it's a sort of poetic/philosophical movie. The whole time everyone's telling Edward he's weak and sensitive. So he writes a book for his ex wife. In the book his wife and daughter are murdered by these terrible hooligans and the whole time he's trying to get revenge. He does and then immediately dies. Because of how well the book is written, his ex wife starts getting feelings for him again and reaches out to meet him. He stands her up and it ends. That's the movie. Sounds average. But break it down. The book is him getting stronger; it's not his wife and daughter getting murdered, it's Edward's weakness dying and his ex wife would be the murderers giving him reasons to get stronger. In the book, he spends time mourning and fantasizing about revenge. He finally gets his revenge and accidentally kills himself. How perfect is that? A part of Edward had to die to get over his ex and he wanted her to know. Now she finally wants him again and he's orchestrated this entire book/plan to just stand her up and prove that she's the weak one. Kind of a lot to process and maybe sounds cheesy, but I thought it was a good time.","user":"wisneskilife","rank":[179,209]},{"title":"Can't people enjoy movies any more?","rating":9,"date":"12 February 2017","review":"Listen, I'm not a movie guru, I don't study arts, I'm just your average Joe that loves movies. I've seen lots of movies, I don't discriminate, terror, drama, action, animated you name it, I can perfectly differentiate between a bad from a good movie, I don't need the biased comments of the so called movie critics on IMDb. Thanks God I didn't pay attention to all the misguided comments about this movie, Nocturnal Animals is a beautiful &amp; stylish movie, great photography, solid acting and a solid plot that will stay with you long after you finish it. I don't understand why there's so much envy and hate in the film industry, the wannabe movie critics can't take that a guy who came from the fashion world actually can created a pretty good movie. My fellow reader, please don't miss the chance to see this movie.","user":"descobarledesma","rank":[696,882]}]