[{"title":"A life unexamined is not worth living...and a life examined is no bargain.","rating":6,"date":"9 January 2017","review":"Leave it to Woody Allen to add that ending to a quote by Socrates.<br><br>Woody Allen is so prolific that he can't possibly knock one out of the park every time. Though \"Cafe Society\" has a bittersweet, thoughtful quality about it, it's not one of his best.<br><br>Jesse Eisenberg is the Woody character, Bobby, who moves to LA from the Bronx in the 1930s and drops in on his highly successful agent uncle, Phil Stern (Steve Carrell). Bobby has only been trying to see him for three weeks, but Uncle Phil finally comes through. He has Bobby work for him doing errands until he can steer him toward something better. He also asks his secretary Vonnie (Kristen Stewart) to show Bobby around.<br><br>Bobby falls for Vonnie immediately, but unbeknownst to him, she's having an affair with his uncle, who is married. Phil decides he can't leave his wife and breaks it off with her, and she and Bobby wind up falling in love. But later, it falls to Vonnie to make a choice. <br><br>Cafe Society is a little on the slow side - the acting is good, there are a few jokes, it's historically accurate (I'm always looking for films about old Hollywood to goof up like Barton Fink), and the photography and fashions are beautiful. <br><br>Woody is talking here about the road not taken and showing us two people who think about that other road often. Of course there's no answer, but it is something we all wonder about especially as we age.<br><br>I just don't think the story was tight enough - it seemed to meander.<br><br>I'm not familiar with Kristen Stewart. She has a special beauty and a nice presence and fit into the film well. Eisenberg, like most actors doing the Woody character in Woody films, takes on some of Allen's inflections. He's likable. Steve Carrell's role does not play to his strengths but he pulls it off. Someone on this board complained about Bobby's parents. I thought Jeanie Berlin, whom I haven't seen in years, was terrific and gave a very realistic performance. <br><br>Not a heck of a lot goes on in this film - it's not serious like Crimes and Misdemeanors and it's not Bullets Over Broadway, which was a comedy with serious undertones about art. I think here Allen making a choice about which it would be may have been a good idea.","user":"blanche-2","rank":[23,24]},{"title":"Café Society","rating":8,"date":"15 May 2016","review":"Set in the 1930s, a young Bronx native moves to Hollywood where he falls in love with the secretary of his powerful uncle, an agent to the stars. after returning to New York he is swept up in the vibrant world of high society nightclub life. <br><br>Café Society opened this year Cannes Film Festival and is the latest film directed by Woody Allen. It's a story that mixes various parts of the Allen back catalogue to varying degrees of success. A film that wants more than anything to entertain. In many ways Café Society could be said to restate almost all of the key ideas and themes of Woody Allen's films in one way or another: life, chance, fate, love and guilt. <br><br>It also comes from the movie providing the performances. Jesse Eisenberg is so seamlessly cast as the prototypical Allen protagonist that when the film shift from Allen's voice over to Bobby speaking it feels continuous. Bobby's broken heart has caused him to undergo a Bogartian growing up: from a gauche boy to a mature disillusioned man, trapped in the wrong marriage. Moreover, Kristen Stewart sad eyes, throaty delivery and slightly heartbreaking aura make her almost interesting, ad an easy chemistry between her and her third-time co-star Jesse Eisenberg and he fits perfectly into his role while she simply overflows the screen. <br><br>But if Café Society is Allen quoting Allen, sometimes literally, at least he's quoting his better bits. Surprise comes from the movie providing the honeyed cinematography by V. Storaro which uses silhouette, graphic compositions and glowing close ups in an often genuinely breathtaking manner. \"Life is comedy, but it's one written by a sadistic comedy writer\" says Bobby. The comedy writer Allen on display here is more wistful and nostalgic for the very concept of unfulfilled true love, for the heyday of the Hollywood star system, for a New-York of gangsters and back alley craps game and stolen kisses at dawn in Central Park. And all of that nostalgia is okay. Because we were getting pretty nostalgic for the good odd days of warm, witty, fond and funny Woody Allen too. <br><br>Make no mistake Café Society is still late-period Allen. Men are described in terms of their characters and complications, while women are still described in terms of their beauty and their effect on said men. When Blake Lively's character motherhood becomes the butt of an exchange between two men, about how women who become mothers devote way too much time to their children (and ultimately not enough to their husband); it's a sour note that reminds us that Bad Allen is always there, underneath. <br><br>Overall, this film is Woody Allen's most charming film since Midnight in Paris and maybe most beautiful to look at, maybe ever. It's a little pretty little reminder of what once was","user":"abouhelier-r","rank":[70,100]},{"title":"That teardrop on the elegant profile","rating":8,"date":"12 May 2016","review":"Woody Allen's latest, which opened yesterday in Paris and at the Cannes Festival, is a gentle and thoughtful examination of love. Jesse Eisenberg, best known for his portrayal of Mark Zuckerberg in The Social Network, plays Bobby, a young New Yorker who heads out to Hollywood in search of an exciting future. He falls for Vonnie (Kristin Stewart of Twilight fame), the secretary of his Uncle Phil (Steve Carell), a successful producer, and is soon confronted with the fact that she has a mysterious lover. The resulting confusion is worthy of Allen's mentor, Anton Chekhov. In an interview in the French magazine l'Obs, Allen remembers his own experience in Hollywood, talking to a producer who cut him off to take a call from Fred Astaire. We soon meet all of the rest of Bobby's family, including a gangster brother and a sister who is married to an intellectual, who offers such wisdom as the quotation, \"Live every day like it's your last and some day you'll be right.\" With brilliant cinematography by Vittorio Storaro and great performances from Eisenberg, Carell and Stewart, the film is one of Allen's most enjoyable in years. The poster features a stylized profile of a woman with a teardrop - love always includes an element of sadness, even as it brings laughter and self-realization. A French review of the Cannes opening compares Allen to Ernst Lubitsch, master of urbane comedies of manners in the 1930's.","user":"An_American_in_Paris","rank":[70,103]}]