[{"title":"Horrible film","rating":1,"date":"17 October 2015","review":"Navy Seals vs. Zombies (English) 1/10 Genre: Action/Horror/real crap Director: Stanton Barrett Cast: Ed Quinn, Mikal Vega, Damon Lipari, Michael Dudikoff Year: 2015<br><br>I don't know who makes this kind of crap and even bigger question, why did I watch it? I guess only because of Michael Dudikoff as it's his comeback film after 10 years although his screen time is not more than 5-10 mins. I have seen a lot of bad films but this one is a whole new level of bad film, it's like the Ben Hur of crappy films. Normally I don't like to criticize films no matter how bad they are as an appreciation for the people who put in their hard work but this one surely doesn't deserve any. Two minutes into the film and I knew I made a huge mistake of watching this one. I felt asleep ( I swear to God I did) and only if I didn't have this principle to finish a film once I start watching it no matter how bad it is I would have never dared to complete this film and turns out to be the most painful experience I ever had and I was desperately waiting for it to finish. Acting, direction, story, editing, sound and everything else is horrible and I think the best part of the film was it's trailer. Just to give you an idea of what's in the plot, Five Navy Seals go on a rescue mission to save the Vice President of the United States in a town infested by Zombies. I mean really, you will just send five guys with one chopper (not sure how did they manage to got the chopper) to rescue the Vice President of US. The Zombie make up was laughable, I have seen better make up in my office during Halloween, acting was worse than a Kindergarten play and...Forget it, it will go on and on. Stanton Barrett who is some stunt guy should stick to doing stunts or should seriously take a crash course in film direction before his next film. The actors were more painful but It was good to see Michael Dudikoff, not for his acting or anything, he even had this stupid scar oh his face to make him kinda look bad ass. If you love Dudikoff and miss him on screen re-watch American Ninja or any of his previous films till he comes out with any decent one. This is not a review, this a warning message to stay away from this film as I have already suffered and don't want others to go through the pain.","user":"soumit-nath","rank":[28,33]},{"title":"Worst zombie movie ever!","rating":1,"date":"16 November 2015","review":"This movie is horrible in every aspect. I mean, how low could that budget have been? Please get a loan or something and at least put some good zombie makeup!! Special effects like fire look like they made it up with a phone movie editor app. Zombies look like my friends at Halloween with hand made makeup.. Navy seals look like they ate 10 times at McDonald's before they filmed.. Please get in shape!!! I am so upset for wasting almost 2 hours of my life!. Please save your time and if you like Zombie films go watch the walking dead or something like it.<br><br>This truly sucks!","user":"ace_ventura-69654","rank":[23,31]},{"title":"A battle that is even more dead than the zombies","rating":3,"date":"16 April 2018","review":"'Navy Seals vs. Zombies' was a film oddly enough where part of me wanted it to be a guilty pleasure at least. The idea was a pretty decent one and the title sparked some intrigue. So did not want 'Navy Seals vs. Zombies' to be bad or watched it trying hard to dislike or be prejudicial towards it, would never do that to a film as it is an unfair way to do so. <br><br>Unfortunately, 'Navy Seals vs. Zombies' is yet another film where a decent idea is completely squandered by really lame execution. Very little works or is good, although not a film with no redeeming qualities and that it doesn't feel as much of a rip off as other films seen is a point in its favour. There are far worse films overall and of the genre granted, but it is always really hard not to be annoyed when potential is not lived up to.<br><br>The scenery and music are serviceable, more so than most low-budget films seen recently. Ed Quinn also does his best to keep things afloat and interesting and is above average as a lead. <br><br>It is sad though that the rest of the acting is very bad. Even amateurish, with a mix of looking constipated, bad overacting, having the inability of acting scared or fearful of their situation and just acting emotionless. None of their characters are likable, they have cardboard personalities- once you get over the fact that there is literally every cliché in the book- and are severely undeveloped, with a mix of dull as dishwater and cartoonish.<br><br>Although films like 'Navy Seals vs. Zombies' are not to be seen for technical refinement, the technical values are Z-grade budget. The editing is atrocious, some of the most confused and shoddiest ever seen, as are even more the ridiculous (to the point of unintentional comedy) look of the seals.<br><br>Dialogue is just painful, the interplay is awkward and the actors look even more uncomfortable delivering it while the scripting itself is shallow, on the wrong side of camp and rambling and if you're looking for sense you won't find it. The story is erratically paced and dumb, with a good deal of dullness and with rushed action, the conflict is dull to deadening effect and is silly. The direction never rises above lame. <br><br>Overall, weak. 3/10 Bethany Cox","user":"TheLittleSongbird","rank":[4,4]}]