[{"title":"Making bad decisions in the worst circumstances.","rating":8,"date":"1 February 2016","review":"I've seen this movie gotten some criticism, mostly comparing it to the first installment (Klovn). It has been too long since I saw the first one for me to compare the two - but I had a great time with this one. The plot is fairly simple, Casper is moving to LA, when Frank needs him as a friend. They're publishing a book together about their friendship, which makes the situation even harder for Frank. The plot then becomes, well, something like a train wreck in slow motion.<br><br>I am a big fan of Curb your Enthusiasm and that kind of \"cringe\" humor, and this is very much in the same spirit. Only dirtier and at times quite juvenile. But the jokes are not really juvenile, but rather uses sexual situations and ideas as a source of embarrassing situations. And it works quite well.<br><br>While Curb your enthusiasm has some sort of realism, it's also often really over the top and playful. Klovn is at times like this, but what impresses me the most is that no matter how bizarre the situations are, they usually manage to build up to it in a way that feels realistic. They have established characters that you believe can make the worst decisions in the worst of circumstances. Maybe the point where the realism breaks is how accepting and open the friends and families of the Frank and Casper are. I","user":"peefyn","rank":[17,23]},{"title":"Very mediocre and predictable","rating":3,"date":"1 January 2016","review":"I had expected more from this release and found it very mediocre, bordering to boring and very predictable. If you thought this is good you will find the previous movie better, more mind exceeding and sometimes very embarrassing. This release is a waste of money and not recommended. Seems as if this release are only made to pull the last out of an already familiar setup and generate additional income for those involved. The only fun scenes are those with Frank humiliating himself by showing various naked body parts. There are too many scenes that is not necessary for the already very limited storyline.This could have been an OK youtube film lasting 5-10 minutes.","user":"rebelinc-34204","rank":[6,24]},{"title":"DISAPPOINTED!!!","rating":3,"date":"6 May 2018","review":"I was expecting a lot from Klown Forever, especially because I loved the first Klown movie. But Klown Forever was very disappointing and the whole movie kinda felt lackluster compared to the first one. Bigger doesn't always mean better.","user":"petervd","rank":[1,3]}]