[{"title":"Action Adkins !!!!","rating":8,"date":"11 June 2018","review":"... this one took me back to the days of action flicks with Van Damme, Norris &amp; Seagal back in the 80's &amp; 90's , and i really enjoyed it.\nNo mucking around straight into the story and great action scenes, great little action flick!!!","user":"Moviereeeels12","rank":[12,12]},{"title":"Solid B-Movie Vibe with Good Action Scenes","rating":5,"date":"2 December 2016","review":"So Scott Atkins pretty much always means extraordinary action scenes. Here however, the first five minutes feel more like a gritty drama. Especially the first two minutes with Scott doing his exercises and looking with intense sadness at something made me think this could be something different than the usual stuff he is doing - well nope.<br><br>The plot is all over the place. Scott and his movie daughter are apparently in witness protection and some dudes invade his home out of pure stupidity and coincidence. So Scott has to let out his superhero alter ego and brutally murder everyone. Except his daughter of course. Well, since he is all over the news now, he is kind of hunted by the crime boss he was hiding from in witness protection. <br><br>Cinematography is actually quite nice. Good camera movement for the nearly exploitative action scenes. Also good editing - you always have an overview what happens, and if you don't, it is intended and enhances suspense a little. The flick uses toned down colors to convey the gritty and realistic feel. In total, I would say the movie is competently shot on a technical level.<br><br>The actors...well there is Scott Atkins, who is not known for his acting ability, but for his amazing martial arts. But I think he became quite convincing in the last years. The thing is, he never really has a role that needs his acting chops. It's not different here. Apart from him, there is maybe the main bad guy that is somehow memorable. He does have the physical presence needed, he seems intimidating when he is walking along with his firearms. Acting wise, there is not much happening though.<br><br>So in essence, the film could have been better with a more interesting script and maybe more interesting dialogue. Some people die and you should be feeling something, but you don't. That is the fault of the script. It is very bare minimum story as set up for really really good action scenes. So really, good movie for Scott Atkins fans and martial arts enthusiasts. The rest of potential audiences won't get much out of the movie though.<br><br>Five out of ten for general movie competence and action scenes.","user":"idontdodrugs","rank":[22,29]},{"title":"Better Than Most Bargain Bin Action Flicks","rating":6,"date":"23 December 2016","review":"At first I did not expect much from Eliminators.But As a fan of Scott Adkins brand of action, I'd say it ranks as one of his better films. This isn't the thinking man's type but more of a simple, straight forward, one man army 80/90s action movie . For that much it is entertaining and somewhat of a hidden gem. Adkins proves he is a solid yet underrated action star by providing some kick ass and innovative fights with some cool locations for it to take place in. Unlike most bland, low budget action films shot in eastern Europe this was actually shot in London which added to the movie. Sure, acting may not be a strength of the movie and the story may not be the most original but it is leaps and bounds better than other low budget DTV films like the crap washed up action stars like Seagal churn out every few months . Overall, Eliminators is a fairly decent entry into the sub-genre of the direct to DVD/VOD action movies. Adkins brings the goods and racks up a healthy body count and one of the better movies made by WWE studios.<br><br>6/10","user":"ActionFan-Reviews","rank":[11,14]}]