[{"title":"Mediocre","rating":5,"date":"4 October 2018","review":"A young boy, nicknamed Darc, witnesses his mother murdered by a Yakuza boss. Several years later and the boy is a man, and has just been released from jail. An Interpol agent organised his early release: he wants Darc to find his daughter who has been kidnapped by the same Yakuza boss. Darc now has two reasons to hunt the man down...<br><br>Mediocre. The movie had the potential to a good, gritty action-drama but misses the mark in so many respects. The plot is pretty basic, full of holes and incredibly contrived. Nothing really makes sense, except that the plot is set up to maximise the number of action scenes. Heaps of shoot-em-ups and beat-em-ups just for the hell of it, just jammed in for no rhyme or reason.<br><br>Lead performance is woeful. Nothing wrong with strong, silent types as the lead character but Tony Schiena overdoes the silent part, to the point of irritation. Quite unconvincing whenever dialogue or actual acting was required - I guess he was just there for the action scenes.<br><br>It's not all bad though. The action scenes are done well and there is a momentum and intrigue to the movie that keeps it interesting. I guess there had to be - if you had a chance to think you'd realise just how dumb the plot is...","user":"grantss","rank":[9,10]},{"title":"Old school action entertainment.","rating":7,"date":"26 May 2018","review":"Saw this on a dvd. The trailer was amazing n the film a solid action packed entertainment.\nThe plot is from the 80's. This is the director's first film as a director. Most of the Steven Seagal's 90's film's were produced by this director. So obviously a lottuva cliches n of course the one man take down the whole nasty business.\nThis film has plenty of hand fights, gun shot sequences n some amazing sword fight too. Basically a yakuza film without the katana n tattoos would look fugazi.\nThe male lead lacked the muscles n was a bit unconvincing cos the film never showed how he learnt sword fighting or hand combat.\nI found the actress Dawn Olivieri attractive. Will be watching Traffik only cos of her.","user":"Fella_shibby","rank":[27,39]},{"title":"Great action film that I could easily watch again","rating":8,"date":"2 May 2018","review":"This is a great action movie, watched this without looking at any reviews and glad i did, from start to finish it was pretty good acting (your not going to get Oscar level acting in a film like this), action packed and a simple but well scripted story.<br><br>I have not seen Tony Schiena in anything before, but judging solely on his acting and fight scenes in this film, I would watch a film just because his name was in the credits.\nGo watch this film, if you like your action films you wont be disappointed, there is some romance and adult subjects but mostly its action, action, action!","user":"goonerchris-161-428318","rank":[36,56]}]