[{"title":"For a very low budget film, it had its good moments, but also its avoidable flaws","rating":6,"date":"14 February 2018","review":"This is a very low budget indie film, primarily with C &amp; B actors, and will rate it as such on its own merits. <br><br>Novice director and writer Reese Eveneshen did a surprisingly impressive job with directing the cameras and scenes, and for the great cinematography and decent score (the only reason I rated this high), but poorly in directing his actors, and even worse in the writing and screenplay. <br><br>How can anyone let certain scenes make the final cut? For example at the start, Rhett's sister gets shot and Rhett just stands there like an idiot. Seriously? Then his sister towards the end of the film says she doesn't know how to use a gun, but starts shooting like a marine. And there's much more in between. <br><br>This screenplay needed a huge make-over and needed to be cut down from a ridiculous 101 mins to around 70 mins with a faster pace. Many scenes were dragged out far too long with annoying, confusing and unnecessary dialogue. Had the producers invested in a better screenwriter instead the costs involved for the lousy, unnecessary and ridiculous gore (was this film even rated horror/gore?), this film would have been much better.<br><br>The acting was atrocious, part blame the actors and part to the director for not directing them during their scenes. The only decent actors were Rhett's sister and Dennis Andres as Pierce. Colin Paradine's character Rhett was unconvincing, boring and very stale. All the rest were pretty much embarrassing. <br><br>I know this film will get slammed as most amateur IMDb reviewers will rate this equally and comparable to a huge Hollywood blockbuster production, so I am giving it a generous 6/10 for the great cinematography and directing, and for a fair attempt to produce this type of film on such a small budget.","user":"TheTopDawgCritic","rank":[19,24]},{"title":"Low Budget is not an excuse for a bad job...","rating":2,"date":"14 February 2018","review":"There are lots of nonsense in this movie, and there are many flaws. Too long with unnecessary scenes.. Bad acting... Bad directing. (few scenes are not bad tough) \nI gave 2 stars comparing to a decent Sci-Fi. I don't believe low budget cause these problems. it could be better even with only a better montage.","user":"abdullah-19","rank":[15,19]},{"title":"I don't know why they made this film.","rating":1,"date":"12 March 2018","review":"This film was based on a worn out theme with no new twist.\nThe direction, acting and dialogue were very low quality.\nThe foul language and graphical sadism added nothing to the story.\nNo idea what the ending meant and I lost track of the dark haired women that kept appearing.","user":"meyuk","rank":[14,18]}]