[{"title":"Fantastic Franco.","rating":5,"date":"1 October 2017","review":"Why him? I tell you why, because I can't think of any other actor who can transform this this cinematic excrement into a gourmet dish. There is a matteroffactness in his character that lives somewhere between Rupert Pumpkin and Howard Hughes, the thing is that the life James Franco gives to his character is absolutely real. The film could have turned into a horror thriller, because Franco forces you, in the most entertaining way, to feel slightly off-balance. That alone keeps you glued to it in spite of the moronic lack of ideas. Bryan Cranston, of course, is sheer perfection. Reacting hilariously to the absurdity with infinite generosity - A trait of great actors - I wish them a Billy Wilder next time or a Preston Sturges or...you know. Fearless originals just like Franco and Cranston.","user":"littlemartinarocena","rank":[98,112]},{"title":"Epic fail...","rating":3,"date":"22 March 2017","review":"Honestly this movie scares me, the fact that it has a score higher than 6 makes me afraid that this is the future of comedies, targeted for the new generation. I was hoping to see a Superbad style movie but this one is just full of absurdity, completely unrealistic, everything feels forced and absurd, the dialogue is just ridiculous... I don't understand how these good actors accepted to star in this massive garbage of a movie... huge disappointment...","user":"cherchezan","rank":[84,123]},{"title":"Why him? Should be called 'Why Bother?'","rating":2,"date":"27 December 2016","review":"Brian Cranston is the traditional father who struggles to bond with his daughter's boyfriend, James Franco is the boyfriend, a Tech millionaire who wants to win him over in order to marry his daughter. There's frequent forced humour, with particularly lots of bathroom humour. This film drops the 'F' bomb frequently (too frequently for me anyway!).<br><br>The audience had a few laughs, I think I remember laughing 2 or 3 times. The trailer showcased the very few 'funny' scenes and makes this look like a much funnier film than it really is. <br><br>If your idea of funny is frequent swearing then (unfortunately) this film is definitely for you. Overuse of the 'F' word soon wears thin, makes you realise it was used instead of clever humour. Please don't waste your time and money supporting this nonsense or they will make 'Why Him2'. <br><br>In summary, poor plot which has been done better previously, boring, gross and vulgar. I wouldn't recommend to anyone, whether 15 years old or older. <br><br>Would not watch again.","user":"brankovranjkovic","rank":[87,128]}]