[{"title":"Weird Vs Pretentious","rating":9,"date":"27 June 2019","review":"I'm convinced that the internet has erased all meaning from the word \"pretentious.\" It once meant exactly what it sounds like, pretending to be something other than what you are.\nThis film, along with all non-standard films, has evoked countless online accusations of pretense, which in the world of online movie reviews actually just means that the reviewer found it weird and boring.\nThe film does not, and be aware of this is if you plan on watching it, contain a plot-based, narrative fantasy for viewers to follow to a satisfying conclusion. What it does is combine together short slice-of-life vignettes with the reading of various bits of aesthetic and philosophical manifestos.\nIts appeal will be limited to only people who find the rantings of tortured souls interesting. I have actually read quite a few of the bits that were included in the film, and I find the whole absurd reality of artistic manifestos and philosophical creeds fascinating, so I enjoyed the film. If you're not that kind of nerd, you won't like it.\nBut is it pretentious? No. It did not pretend to be anything other than what it was: a presentation of some famous manifestos in combination with scenes from ordinary life. It is certainly weird, and it will certainly bore most viewers.\nAs always Cate Blanchett's performance is incredible. The cinematography is impeccable.","user":"dwankan","rank":[8,8]},{"title":"Too artistic for me","rating":3,"date":"3 November 2017","review":"This film tells the story of twelve people who make manifestos about art and life in general.<br><br>The captivating thing about this film is that Cate Blanchett plays twelve different characters in various walks of life. It gives her the opportunity to shine bright as usual. <br><br>However, there is little story in the film. The scenes are merely there to convey the manifestos. It is a daring project, but it is probably too artistic for me. I appreciate the concept and the artistic achievement, but I cannot say I enjoyed watching it.","user":"Gordon-11","rank":[26,36]},{"title":"Cate Blanchett and the intelligent art direction make the film with an unconventional premise work","rating":8,"date":"1 July 2017","review":"Cate Blanchett once again displays her vast array of talent as she plays 12 different characters in 12 different settings decontextualising some of history's famous manifestos, bringing humour and new meaning to them, or perhaps no meaning, to stress a view of meaninglessness to them. There is no conventional narrative here but the film still has urgency to keep you watching through its compelling art direction and wit.","user":"williammjeffery","rank":[20,30]}]