[{"title":"dumb white girl problems","rating":4,"date":"13 October 2017","review":"15 year old delinquent skater girl Freddie (Joey King) leaves suburban San Diego to join Nick and his group of petty criminal druggies. When a needle is found in the van by LAPD, she takes the fall and in short order, she gets released from jail. It's a rough neighborhood and she skirts danger every step of the way. Meanwhile, Nick is trying to close a deal with Donny.<br><br>This is trying to be quirky indie but mostly, it comes off as quirky lowlife stupid. Freddie is suppose to be a smartass but she's not so smart. I don't blame Joey King whom I hope for better things. It's all in the writing. Freddie has no common sense or any sense for that matter. She's written as a smart character who does dumb things. She is too annoying and too self-destructive to root for. Joey King can't play dumb anyways. This could still work as a night road trip through LA but the movie keeps going back to Nick, Donny, and the rest of them. As flawed as Freddie is, Joey King is still compelling enough to make this work but Jena Serbu doesn't know where is the best part of the story.","user":"SnoopyStyle","rank":[14,20]},{"title":"A delightful romp through gangland","rating":4,"date":"3 April 2019","review":"If a child wrote a movie about how they picture the drug trade and life on the street, it would look something like this. It's a simplistic, immature take on some very serious subjects, with people going out of their way to force racial slurs into every exchange. The whole thing felt like it was straight out of a little kid's imagination, and the jokes were terrible.","user":"danterenzulli","rank":[4,5]},{"title":"Strong performance by Joey King ruined by Jena Serbu's asinine writing","rating":3,"date":"13 September 2017","review":"**Spoilers**<br><br>So the protagonist, 15 y/o \"Freddy\" brings together two rival gangs, one of which wanted to gang rape her until she escaped, to rob another passing stranger that wronged her. And this after walking all night. And witnessing a murder and multiple shootings. And smoking crack for the first time. <br><br>Jena Serbu's the one smoking crack.","user":"plato-42119","rank":[9,15]}]