[{"title":"a gentle Brit-com laced with upper-class ridicule and feminist self-discovery","rating":7,"date":"26 February 2018","review":"It is said that American comedy laughs at people whereas British comedy laughs with them. Whether you agree or not, there is a difference and it is difficult to define. A late-life marriage break-up, two deaths, two funerals, and dementia might sound serious but they are perfect comedic fodder in Finding Your Feet (2018), a gentle British rom-com laced with upper-class ridicule and feminist self-discovery.<br><br>After four decades of marriage respectability, Lady Sandra Abbott (Imelda Staunton) discovers that her husband has been having a long-term affair with her best friend. She storms into the life of her hippie older sister Bif (Celia Imrie) seeking refuge in her modest flat on a London council estate. In true British style, she dearly clings to her title until she realises the locals don't give a toss about uppity types. Just when she despairs about her future, she revives a passion for dancing and glimmers of romance appear in the most unlikely places. The local dance class becomes a touring troupe that includes her sister, a scruffy romantic named Charlie (Timothy Spall) and the hilariously haughty Jackie (Joanna Lumley). Meanwhile 'Lady' Sandra reverts to ordinary Sandra as she discovers that life can begin again at any age.<br><br>Films like this give divorce an attractive name. Depending on how existential you want to be, the story can be about the innate power to find yourself in the most adverse circumstances or, on the other hand, a barrel of smirks about the idiosyncrasies of the British class system, the joys of getting older and wiser, and the role of fun in living well. The casting is impeccable and their performances are A-class as you would expect in a quality British production. Although the ensemble are uniformly excellent, Imelda Staunton and Timothy Spall are the standout duo as they depict polar opposite social types who find themselves in each other.<br><br>The same plot with a younger cast might struggle, but somehow watching older people dismantle and rebuild their joy of life under the wet blanket of British social conventions is always amusing. There are no outrageous laughs nor are people or situations held to ridicule. The film's pleasure comes entirely from an intelligent script that makes wry observations of life's ironies and people's peculiarities. It's not all funny, but the tears and sad moments are brief. The delightfully corny ending ensures you leave this warm-hearted film feeling good.\n","user":"CineMuseFilms","rank":[36,41]},{"title":"VERY FUNNY, VERY MOVING AND VERY UPLIFTING!","rating":9,"date":"7 February 2018","review":"Watched this absolute gem of a film at the Telegraph's special screening at the Vue cinema in London's West End last night. I went with my friend who is much older than I am and is much nearer in age to the target demographic but I will certainly be recommending it to my friends as I came away feeling that age had nothing to do with it. It was about tacking life's issues with courage, humour and strength, no matter how old you are. Haven't laughed and cried in a cinema like that for years and looking around at the end when the lights came up I definitely wasn't the only audience member. I'm probably not going to go out and join a dance class but I will remember Sandra and Bif's sense of humour and spirit for a very long time.","user":"Girlystyle","rank":[42,50]},{"title":"A must watch fil","rating":9,"date":"26 February 2018","review":"26 February 2018\nFilm of Choice at The Plaza Dorchester Tonight - Finding Your Feet. This is a great film about growing older and learning to enjoy it. It's a film with happiness, sadness, joy and disappointment. Starring some of our favourite older actors and actresses this is the story of Sandra (Imelda Staunton) who, as she is about to embark on her golden years with her husband, discovers he has been having an affair. Sandra immediately decamps to her sister's tiny flat and proceeds to fall apart. What happens next is a tale of survival and reinvention as she puts her life back together. I thought this film was great, we met people with problems and secrets of their own who came together to forget about it all in a weekly dance class. I hope we can all age like this, there was very little that was graceful about it but my goodness they looked like they could have some fun. A great cast including Timothy Spall, Joanna Lumley and the utterly fabulous Celia Imre, I urge you to go and see his film, even if for a couple of hours to escape your own life. Funny, moving, outrageous and lots of fun.","user":"Figgy66-915-598470","rank":[24,28]}]