[{"title":"doesn't offer a new thing but is still gory at moments","rating":7,"date":"9 November 2015","review":"This one picks in on the remake from 2010. I wasn't really satisfied with the remake because it went completely over the top. But here Jennifer Hills (Sarah Butler) is back under another name. Being in therapy with a group who all were involved in rape she slowly turns back into her bad habits, going out to kill the rapists. <br><br>It takes a while before she goes berserk and you will see the best, read gory, parts of the 2010 version. When her new girlfriend is being killed by her ex-boyfriend it's time to search the guys responsible. The first kill is the one you will remember the most because she goes for a blow but not with a happy ending for the guy. From there on it's a bit of the same as in the 2010 version. Except that we do have a little message hidden throughout the movie itself. The victims aren't the ones being helped by the authorities. <br><br>It's so weird to see Sarah turning into a sickie, especially towards the end when she thinks all men are the same, have been talking to her and in fact have seen her again the day before I watched this flick at a convention. <br><br>Does this flick offer anything towards the franchise, to be honest it doesn't but t is still worth picking up. <br><br>Gore 2/5 Nudity 0/5 Effects 25/5 Story 2,5/5 Comedy 0/5","user":"trashgang","rank":[16,18]},{"title":"Nothing like the other 2 movies in this series","rating":3,"date":"11 October 2015","review":"I give it a 3 out of 10 for some brutal deaths and the fact that they brought back the girl from the first one. Other than that, this movie wasn't very good at all... Seems like the director is probably one of those \"low budget\" type of filmmakers that shoots stuff that airs at 2 am on HBO or Showtime... If you liked the first film, Then it's natural that you would want to see this, but trust me, this film has absolutely nothing to it other than very bland storytelling and a very low budget feel<br><br>I was actually bored about halfway through the movie when I realized it was going to be nothing like the other movies, sure the deaths are brutal, but so what? They spend a few scenes trying to make you dislike a guy, they show him only a few times, and then kill him expecting the audience to actually care","user":"ripsmoke","rank":[23,28]},{"title":"Mindless and hate-filled","rating":3,"date":"21 June 2017","review":"I SPIT ON YOUR GRAVE 3: VENGEANCE IS MINE is another mindless hate-filled addition to the series, barely any different to the two films which preceded it. Okay, the formula is slightly different this time around, as the main character isn't raped at the outset, but the grisly revenge killings are, while the self-help circle material is frankly a bit dull. The problems with this film are myriad, but the weak writing is the foremost issue, with one-dimensional characters and tepid pacing throughout.<br><br>For the sadists among us, there are some very graphic and nasty death scenes here, meted out to men who are more than deserving of their fate. Even so, this ventures into torture porn territory and would be quite disturbing if the CGI effects weren't so terrible. Elsewhere, lukewarm, occasionally histrionic acting also mars the experience, along with a cast filled with unlikeable characters, leaving this a sadistic chore for only the most hardened gore-seekers.","user":"Leofwine_draca","rank":[5,5]}]