[{"title":"Laugh-out-loud bad","rating":1,"date":"23 May 2015","review":"The film gets 1/10 for the plot, but the acting is lame and unconvincing, the dialogue predictable, and the special effects laughable. Especially the hippo. Disney hippos were more convincing in Fantasia.<br><br>The stock footage of a giraffe in the African Savannah, shoehorned into footage of two people in an LA canyon took some balls. Also there is no way a couple celebrating their 40th wedding anniversary by buying a diamond necklace, would have booked a dirty bedroom full of cheap furniture and a nursing home chair in an expensive hotel.<br><br>Dreadful, dreadful, dreadful. Although it did make me laugh out loud several times, at each WTF!! moment.<br><br>Avoid.","user":"rookapadia","rank":[83,93]},{"title":"What a train wreck of a movie","rating":1,"date":"24 May 2015","review":"It'd difficult to know where to begin. Firstly I guess it's my own fault for not looking too closely, but this wasn't the movie I was expecting to be watching. A friend of mine worked on \"San Andreas\", and I know his FX work is way better than I was seeing on screen. The next big mistake was to carry on watching it. What an absolute pile of trash. 80 odd minutes I've lost for all time. Please take my advice, don't bother watching this movie, It's VERY badly acted, technically..! It would be very insulting to decent film and media students to compare them. And the....... actually, there's really no need to break it down any further. It is simply AWFUL.","user":"pault-webster","rank":[122,142]},{"title":"Horrible","rating":1,"date":"25 May 2015","review":"This is the first time I have ever felt compelled enough to write a review... That being said, this movie was so incredible awful that I had to contribute to the already terrible ratings (which I should have looked into prior to watching). Like many others before me, I simply do not know where to start. The acting, the story, the special effects- ALL just absolutely horrible. I was actually under the impression that this would be the 2015 San Andreas movie starring \"The Rock\" - clearly that is not the case, but I decided to give it a shot anyway. This is where my review ends - I cannot possibly waste any more of my precious time on this planet discussing atrocious excuse of a amateur movie. :( sad panda","user":"kapitanovtsi","rank":[42,48]}]