[{"title":"Just another generic sci-fi B-movie","rating":3,"date":"11 June 2017","review":"I quite liked the premise of this film - but that's because it's basically The Terminator with a storm thrown in for good measure. The US has created an artificial intelligence called Echelon which becomes self-aware and turns on its creators. Our only hope is in a clinically inept woman and her robot buddy who are following a series of cryptic clues to stopping Echelon left to her in a VHS tape by her dead father, one of the creators of Echelon. Our bungling heroes are doggedly pursued by evil Echelon robots and psychotic government agents, neither of which are fully explained due to formulaic, lacklustre writing. The murder of the girl's father, Echelon's ability to manipulate the weather, the sudden appearance of the VHS tape at just the right moment and the father's use of cryptic clues to lead his daughter to the 'kill switch' instead of just telling her straight up on the tape could also have used some explanation.<br><br>Despite a relatively promising story, the film is let down by a terrible cast of Z-list TV actors and a director with a background in mannequin restoration. Sometimes it's possible to salvage a bad film with good editing, but the editor here had very little to work with and with this being his first film was completely out of his depth. <br><br>The CGI is also terrible. I've come to expect bad CGI in low budget films from 10 years ago, but this film is less than two years old. It seems anyone with even a little experience in Cinema 4D and After Effects thinks they can start their own visual effects company and make feature length films. If only it was as easy as that.<br><br>This is a prime example of a low budget film where no-one in the production was prepared to give 100% or even lift a finger if they weren't paid extra for it. Everything about this film is cheap and formulaic. If you've seen one SyFy film, you've seen them all and there's certainly nothing about this one that makes it stand out from any of the others.","user":"home-96","rank":[9,10]},{"title":"Don't Expect Any Oscar-Worthy Performances Here","rating":3,"date":"4 June 2016","review":"A real dog of a movie. But I wasn't really expecting anything different. A bunch of X, Y and Z - list actors and actresses fresh from acting school coupled with a few hacks who call themselves writers and directors and toss in Adrian Paul for good measure and you've got yourself a SyFy movie for the ages. This convoluted nonsense is part Terminator, part Day After Tomorrow, and part every other SyFy channel \"movie\" that you've ever had the misfortune to sit through without slitting your wrists. Where to begin? Something about drones being taken over by some unknown entity and some weird looking bald dude without eyebrows who for some reason has an identical twin, and for extra effect are called Cain and Abel. Then you've got this psycho government agent who simply goes around taking head shots at everyone he can for no reason whatsoever. There's this terminator like guy who has really bad long hair and is in need of lessons on how to use a razor blade properly who is the \"good guy\" and of course you've got the hot little chick who works at the local newspaper who gets sent a cryptic video cassette that turns her life upside down. The least that the director could have done is give the audience a gratuitous bra and panty shot of her as a way of thanking us for watching this garbage. But alas, that was not to be. So, Yada yada yada, time passes, people fight, people die, then the characters wind up on an oil rig out in the middle of the ocean fighting for their lives and the fate of humanity. I really didn't know what the hell was going on in this movie. If you've got a couple of hours to waste then go ahead and watch it. But I think you'd be better off seeing how many times you could rub one out in the time that this movie runs.","user":"stanrogersmith","rank":[11,18]},{"title":"Hahaha !","rating":3,"date":"20 January 2019","review":"Hahahaha ! :-D\nThe digital effects are for laughing ! Modern computer games have much more realistic explosions !\nJust avoid it ! Unless if you like old B movies with old amateur digital effects !","user":"Filmreader","rank":[5,7]}]