[{"title":"Road \"Kill\"","rating":1,"date":"6 May 2015","review":"Mark Atkins directed, editor, writer? What happened, did they withhold your paycheck? This isn't even a comical event of errors. Cars driving in the background at the mining city, new trucks parked in front of buildings, (i guess the owners wouldn't move them unless they were paid) and what happened to Dallas,(Spoiler?) the lead actor? Forgot him at the end? (maybe he was in the trunk!) This is not even worth a B movie category. Shame on yourself Mark Putting Mad Max and 28 days in the same review as this movie is a disgrace. Better off watching Doomsday with Rhona Mitra. The only person who closely represents a professional actor is Cole Parker, but even he should stick with stand up comedy. The beginning of the movie, at the gas station, actually started out OK, but then rapidly disintegrated. This is the type of movie you keep watching, thinking it might get better. If you want to watch a slightly better caliper theme, turn on Z-Nation on SYFY. At least that is only a 43 minute show and the acting is better. then again, almost any acting is better than this trash.","user":"mkealey","rank":[15,20]},{"title":"I expected little and I got it","rating":6,"date":"3 August 2015","review":"Obvious attempt to cash in on Fury Road, and it's from Asylum, so you know to go in with low expectations. But, I'm a fiend for post-apocalypse road war stuff, so I had to give it a chance. And... it was okay. It benefited from low expectations.<br><br>The cars are at least good enough to have maybe passed for extras in some of Fury Road's crowd scenes, so there's that. Unfortunately, they don't really get to do much. There's only one real chase scene and it's brief and doesn't entail much except driving around, with no real stunt work. The cover shows lots of vehicles and explosions. You get about five or six cars, and no explosions. As for the driving scenes, director's never going to be confused with George Miller.<br><br>Plot-wise it's Mad Max cross-pollinated with I Am Legend. Society's broken down and the few survivors and scavenging for everything. Gasoline seems to be more plentiful than water, though, since petrol's the one thing they don't seem to fret about much. A lot of people have become victims of a \"vampire virus\" and, since they luckily have a biochemist on their team, they're trying to work on a cure. One guy who may be immune shows up; the filmmakers are so desperate to make him seem like Mad Max that he has an Aussie accent, and they even have him wearing a black leather jacket with one shoulderpad.<br><br>Their big problem is they're running out of ammunition to fight off the nightly attacks from vampires, and to look for more they'd have to leave the only known source of water. Mostly they sit around talking about this, when you'd rather they were driving. It's not really that difficult to make one of these movies more satisfying -- just get decent-looking cars (which they did) and show them driving around a lot (which they didn't).<br><br>So, it's not very good, but it's still better than most of the Italian Road Warrior ripoffs that swarmed the video stores back in the days of VHS, so, I cut it some slack. Production values aren't bad, the survivors looked suitably skangy, and the acting's not great but isn't painful, either. And the plot's not compelling, but there is one and it's not overly clumsy. It's an okay way to kill 90 minutes as long as you're not expecting too much. Better than most Asylum films, but that's damning with faint praise.","user":"zwolf","rank":[7,8]},{"title":"A total waste of 90 minutes.","rating":1,"date":"4 May 2015","review":"I often wonder how these movies ever get made ,let alone why studios pay to have them made. This movie takes place in an abandoned California Gold mine town, there is a loose story, and I mean loose. In fact I would say someone has watched a Mad Max movie and a Zombie movie and come up with a really bad Script involving Weird people, Zombies, Guns, flamethrowers and Average /bad actors. The only good thing about this film was the ending, It was over and No more time was wasted watching Garbage. Also the music by Ilir Zenili was pitiful and performed by Peg leg something. Head banging garage band stuff. So in reflection, don't waste 90 minutes of your time watching the rubbish,wait for the new Mad Max Fury road.","user":"johnhdavison","rank":[18,27]}]