[{"title":"An Unorthodox Look at Two Outstanding Individuals","rating":8,"date":"2 October 2018","review":"As a punk hardcore kid myself, I went to the London premiere expecting a traditional rock documentary. You know, the regular talking heads, the story of the band, the ups and downs of life on the road....The Godfathers of Hardcore delivers something different.\nThe director chose to focus on the human side of things, the two contrasting personalities whose friendship kept the band alive for almost 40 years now. I believe that adds so much more depth to the movie and it's quite a different way of telling the story. It feels more like a documentary about life than music itself.<br><br>Yes, it's a niche film and if you're not familiar with hardcore/punk and the overall history of Agnostic Front you will feel a bit left out sometimes. This is not a biopic of the band and its members. Maybe a bit more context could have been added at times to back some of the past events that are presented, and the more recent live footage from the gig in Germany doesn't really add that much to it, other than the \"on-stage\" perspective that the director explained further in the Q&amp;A.<br><br>Ultimately this is the story of two special individuals that grew up in a very specific (and rough) time and place and a snapshot of what they done with their lives and the challenges they face in getting older. It's a very unorthodox and beautiful perspective, something that appeals more to human emotions than nostalgia.","user":"ematos06","rank":[5,9]},{"title":"This will be looked back decades later as one of the great rock documentaries...","rating":10,"date":"6 September 2018","review":"With the plethora of music documentaries that have come out in the last few decades, few work on the level of an actual movie. The Godfathers of Hardcore, you can tell is a labor of love from director Ian McFarland. It has all the hallmarks of a great movie... It's beautifully shot, it has real life characters that have totally different personalities yet are both engaging and important to each other. This movie takes you on a journey that will make you laugh and cry and feel happy at the end. Vinnie Stigma could have easily been a lead character in a Scorsese film and stolen the show.... But he's the real deal. He embodies New York City and it's Hardcore Punk Scene. You feel his sadness for a city that is being sold out to the wealthy and elite. It doesn't matter if you're a fan of Punk or Hardcore or Agnostic Front.. if you're a fan of great documentaries, watch this!!!!","user":"thisshowsuckspodcast","rank":[5,10]},{"title":"Hardcore/Punk Music, NYC, Friendship and Beyond","rating":10,"date":"7 September 2018","review":"There have been many films documenting Punk Rock, Hardcore, Metal etc but none quite like The Godfathers of Hardcore. It goes beyond any \"life on the road\" cliches or tired band origin stories as it is far more personal and engaging. Along with its inherit NYC grit, it tells the story of 2 friends who have taken a band, Agnostic Front, from the streets in the early 1980s to one that tours the world over to thousands of die hard fans. You come away learning a lot more about Roger Miret and Vinnie Stigma and what drives them after 35 plus years of music. Without disclosing too much, you also learn about Roger Miret's harrowing and troubled childhood, as well as some issues he faces currently, that the brunt of Agnostic Front fans are likely not aware of. This aspect of the documentary really sets it apart from the pack. The documentary itself looks and sounds fantastic and is very well shot and produced. I definitely see this as a film that could appeal to music and documentary fans period, going way above the core Hardcore/Punk audience. I caught the film at its NYC premiere in 2017 and look forward to seeing it again!","user":"Inh722","rank":[4,9]}]