[{"title":"captivating narrative and dialog","rating":8,"date":"1 February 2017","review":"Very similar to his work on Philomena. A brilliant narrative investigating a mass shooting and the tortured soul on trial. Much more that a legal drama. Its a dark journey into a barbaric (and hopefully much remedied) prison system in South Africa.<br><br>Steve Coogan has carved himself a specialty with these films. He brings intensity and brilliant deduction into this character and his scenes.<br><br>Also of note is that this appears to be from first time writer and a first time director. Very pleasant surprise that they are so good at delivering a moving subject in their first venture to attract the talented Mr. Coogan.<br><br>The young murderer is also very well cast and I can expect other large roles in his future.","user":"michaeljtrubic","rank":[21,22]},{"title":"Richly filmed, compelling courtroom drama","rating":10,"date":"25 June 2016","review":"This beautifully filmed drama, set in apartheid era South Africa manages to be at once brutal and sensitive. Steve Coogan and Andrea Riseborough face each other in the trial of a psychologically broken prison guard, accused of a multiple murder. Graphic and harrowing at times, delicately picking an unconventional course to its conclusion. Effectively a period piece, convincingly set in 1980's Pretoria, filmed in Cape Town in pleasing detail. Centred in the courtroom, but repeatedly flashing back to the accused's past as a prison guard on death row and following Coogan's progress through the trial in his defence. The prison and execution scenes play out in sickening detail, with a host of convincing supporting actors. The courtroom too has several well observed characters, from the judge to the bereaved relatives. The accused guard is well played; too, too young, and a mental and emotional shell of a man, opening up painfully slowly during the piece. Coogan though is the star; at first reluctant, then intrigued and finally quite determined as the defence counsel. The camera holds him close in this very convincing portrayal. The whole film is beautiful, cleverly lit and stylish, with great attention to all the details of the time and the place. The Afrikaaner Warrant Officer quietly chilling, the courtroom relatives, glorious. A genuinely emotional and thought provoking film, touching on several aspects of the capital punishment debate. It alternately brought to mind Oscar Pistorius' trial and Billie Holiday's 'Strange Fruit'. Be prepared for mixed feelings at the end!","user":"philneal-67740","rank":[43,49]},{"title":"Thought-provoking courtroom drama which plays against expectations","rating":8,"date":"22 June 2016","review":"Set in apartheid South Africa, this courtroom drama is based on true events. It looks at the case of a young white man accused of shooting dead seven black men in a seemingly motiveless scenario. It soon became apparent that he worked in a high security prison as a guard in the death row unit, where his daily routines had him simultaneously look after the prisoners and also lead them to the gallows. His defence team tried to prove his actions were a direct result of the psychological trauma that came from such a disturbing and stressful environment.<br><br>I thought this was a somewhat unusual courtroom drama. In most examples of the genre we are presented with a clear cut scenario where the film-makers make it quite clear who we will be rooting for. This one, by contrast, operates almost exclusively in shades of grey. Unlike how it is usually done, the lawyers on both sides of the argument are presented fairly. In most films of this type the opposing lawyer is generally shown to be a moral degenerate; in this one the prosecution attorney, played by Andrea Riseborough, is often represented as more reasonable that the main protagonist, the defence lawyer played by Steve Coogan. This measured approach is to be commended, as it comes over as more realistic and less manipulative. It also serves to ensure that the courtroom scenes are slightly underplayed, meaning that the flash-back scenes to the parts depicting the executions seem even more horrific by direct comparison. These scenes in particular are perhaps what ultimately defines this film as they show capital punishment in intensely graphic detail and are very disturbing. It's many of the little horrible human details of the process that will stick long in the memory.<br><br>The story itself resolves itself in a way that is more complex than these films usually allow themselves to be. Coogan essentially wins his case against the system but in doing so gets his client a deal which feels – to me in any case – far too lenient and it is the black under-class who ultimately do not fully get justice. While at the same time, the reason given for triggering the murder seemed, to say the least, questionable. The case actually seemed horribly like a miscarriage of justice in an unfair society in all honesty. But through this case many things are examined quite effectively. Chief of these being the sheer horror of the death penalty mechanism and the way that it can sometimes be forgotten that it is ultimately a very violent and disturbing process. I think this film was highly interesting in that it is not about comforting resolutions - the resolution made me feel very uneasy in fact – but it feels truer to life for all that. It makes you ponder issues of justice, capital punishment and – even though it never comes out explicitly – racism. A very thought-provoking film overall.","user":"Red-Barracuda","rank":[15,17]}]