[{"title":"Fails Screen writing 101","rating":3,"date":"21 November 2016","review":"No spoilers yet, will let you know.<br><br>I wanted to review this film not because it wasted 80 minutes of my weekend -- which it did -- but because it had so much potential that was ultimately frittered away. And not through poor film-making either. The direction was fine, the movie itself is professionally shot, and the effects/gunshots/gore are all well-done. What killed this film was its screenplay, which violated dramatic story guidelines that have been in place for a hundred years for one reason -- they work.<br><br>The first half hour of this film is very promising. Two brothers are driving through the desert. Before long, based on human behavior, it becomes apparent that the setting is post-apocalyptic. Very Road Warrior/Mad Max-ish. Lots of scavenging and cold-blooded killing going on.<br><br>(Begin spoilers) One of the brothers is damaged or mentally injured somehow, and is fully dependent on his sibling. The other tougher brother is one mean hombre, capable of pistol shots that I would call impossible in real life. He's a very interesting and mysterious character, and between their relationship and deadly challenges we get plenty of dramatic action. They wind up in a deserted town where the survivors hide like mice in dilapidated trailer homes. This town is run by a cannibal army with a vicious Joker-like boss named Doyle. I don't know about you, but I usually eat this stuff up.<br><br>(Begin serious spoilers) Then they're captured by Doyle's goons, and the tough brother is killed straight away. Admittedly, this can work in certain dramatic situations. But in \"Drifter's\" case the tough brother was the best, most interesting character in the film. Taking him away absolutely ruined any momentum it had, leaving only textbook cannibal gore and a dozen characters you care nothing about. I therefore spent the last 45 minutes of the movie bored to tears and wishing it would end. So, if nothing else, \"Drifter\" serves as an object lesson in dramatic tension: If you have only one good character, don't kill him off till the end.","user":"medelste","rank":[26,28]},{"title":"Drifting in and out of homaging better films.....","rating":4,"date":"22 November 2016","review":"What little story the film has, it involves two brothers, criminals of course, who are on the road, stealing and killing when necessary.<br><br>They venture into unknown territory and get more than they bargained for when they hit the middle of the second act.......and there's no Danny Trejo vampire cameo in this?...<br><br>Within 10 seconds of this film starting, you can just feel the writer wants to be the next Tarantino/Ritchie/Smith/add any director who made a change cinematically once, by the attitude of the victim. It's been done a thousand times before, and since 1996, it's not been hip or cool to be showing attitude to someone who has a gun in your face.<br><br>Talking about 1996, within two minutes of the film starting, I guarantee 100% you will think of From Dusk Til Dawn. If you don't, then you haven't seen the film. It's just so blatantly obvious, it verges on the offensive.<br><br>So like the Brothers Gecko, we have the smartish one, and the slightly off kilter one, the latter being beaten within an inch of his life several times.<br><br>Moving on to the second act, and the film decides to ditch Rodriguez, and go for The Hills Have Eyes remake meets The Crazies, and it's baffling. So our two anti-heroes drive into a strange town and instantly get terrorised and seduced by a very strange community, and then the writers try to shock the viewer by Doing......... Something.......... You'd............ Never............ Expect........<br><br>Then we get to the final act, and from remakes, the writers decide to go back to the seventies and royally rip off The Texas Chainsaw Massacre, with a little bit of some random actor trying to be a villain from some other comic book film.<br><br>And this is where the problem lies. Whilst you are watching the film, you cannot help but think about other, better films, and it distracts you from the narrative of this film.<br><br>I will give it one thing though, there are some beautiful shots of the desert, and it has a psychedelic feel to it, but other than that, it's nothing more than a rip off of other films.<br><br>Which you would rather be watching.","user":"FlashCallahan","rank":[18,20]},{"title":"They tried so hard","rating":2,"date":"5 May 2017","review":"Have you ever seen a kids school project where they try so hard to do something awesome but the end result is just something sad and a mere shadow of what could have been something good?<br><br>Well this is like that.<br><br>The videography is beautiful. The movie itself could have been something good. But they just tried to damn hard to be like other directors (see Tarantino) and instead the entire culmination of all of their hard work went to pieces.<br><br>At least the scenery was nice.","user":"havenceles","rank":[10,11]}]