[{"title":"What the heck is up with all the fake reviews?","rating":4,"date":"10 February 2017","review":"OK so this is my first movie review. I felt obligated to write it, and this is why....<br><br>This movie deserves MAYBE a 3 out of 10. After checking, all of the users who gave this movie rave reviews have only written one review ever, which was for this movie alone. Basically people that are probably associated with the creation of the movie that want to make it sound amazing, when it really just isn't. <br><br>To be honest, this movie just had no substance. No suspense, no actual scary moments (I say this because horror is listed as the genre), no decent or interesting characters that you end up caring about at any point. Don't get fooled by the fake reviews, I would highly suggest not bothering with this one.","user":"goodbyebluesky27","rank":[28,34]},{"title":"Awful awful awful.","rating":3,"date":"3 August 2018","review":"This is a bad movie. Don't waste your time. Derivative, predictable, no suspense. Badly written, badly directed, badly acted. Unoriginal tosh. There is nothing to recommend this drivel. Any good reviews are fake.","user":"sjsharp-05433","rank":[7,7]},{"title":"Weak, Boring and Uninteresting. Bleh! Go for a walk instead.","rating":3,"date":"5 February 2017","review":"NO TRUE SPOILERS IN HERE BUT SINCE IT IS SUCH A SUBJECTIVE THING, RATHER THAN RISK IT, I ALWAYS MARK THE \"SPOILERS\" WARNING TO BE SAFE!!!<br><br>I was very, very impressed with the \"persons associated with the film\" (shills) reviews. They are getting better at reducing the amount of their annoying brown-nosed \"gushing\". Don't get me wrong, they still do a yeoman's amount of sucking-up while writing many lines of \"text\" on their knees.<br><br>But, when all said and done, for the most part, I didn't vomit while reading their absolutely useless reviews. To avoid ruining the suspense, I won't tell you how many of the \"early reviews\" are shills (but there are a lot of them, more than 4 but less than 7 at the time of this submission). Of course, it is likely that some of them, after reading my review, will get new accounts and write indirect rebuttals. Keep an eye out for those. It happens about half the time. <br><br>That all being said, my opinion of the movie puts it somewhere between a homemade and a B-movie film. This movie is not horrible and it's production values were good. The acting, while not brilliant, for the most part was adequate. The the actors had to struggle with the limitations of the script. Photography was good.<br><br>The plot of this movie was sound if not a gnat's footprint away from being a cliché'. Sadly, this movie had some decent sets and plot points but failed to maintain the momentum they initially created. There were several locations along the way where the screen writers could have improved the script but didn't. <br><br>This movie was NOT exciting, not suspenseful, not interesting and not a real horror movie. It appears as if the director had placed cast in the movie who were well thought of in order to direct attention away from the weak screenplay (or weak directing). The ending was clichéd and stupid, most people will be annoyed by it. I didn't find any of the characters particularly strong, compelling or interesting. <br><br>Overall, I consider this movie a waste of time. Unless you are playing it as a source of background noise to drown out your neighbor's barking dog, I wouldn't suggest watching it. I certainly would not pay real money to watch it. Rather than buy the DVD, I would recommend using the money for something else or donate it to charity. Save yourself and ignore this one. Several more shill reviews have appeared (marching morons)!<br><br>Thanks for reading my review. Other View","user":"nospam-25-374977","rank":[16,20]}]