[{"title":"To be or not to be","rating":4,"date":"18 September 2016","review":"And I wish Charlie 'not to be'. Oh, this flick is predictable and mostly boring! It has some good moments mostly within the first half hour but overall it's so been done before.<br><br>The opening of the story is certainly an attention grabber with Charlie leaving that 'Christian rehab center and smashing the stain glass window! Then being given a ride with a woman suffering cancer. Something surely of substance is going to unfold before us -- no not at all. Charlie calls a friend and the friend takes him home to Bel-Air to his very wealthy family. From this point on everything about this story is so predictable. Who couldn't figure out the father would put his political career first and the mother would be the go between for father and 'druggy' son? Of course there's the on again off again doped-up girl for Charlie, his friend Adam who accepts Charlie for what he is (and by-the-way Adam is the only character in the whole move with a personality), and Charlie is on the street then off the street then on the street.<br><br>The ultimate message here is that no one can change their life until they decide to do it themselves. This is symbolically shown when Charlie sweeps up the broken bottles at the beach house - his life at 18 years old is also a broken mess and it's time to clean it up. An hour and a half to get to the message everyone already knows. The end.","user":"cekadah","rank":[19,25]},{"title":"Being Charlie","rating":8,"date":"21 September 2015","review":"Whats not to like....Real world for a change..No Fluff...See it when ya can....Aside from all the cast giving all believable under the top performances the writing does a good job of blending high funny ha ha and low tragedy ..Drug problems embedding themselves in all families comes close to home here...Reiner both the older and younger collaborate on a film level and more importantly as a dad and son as it gets very close to home ..We the audience are allowed to observe from afar at times ..In . The rehab facilities one gets to see life from the inside out rather than peering in as outsiders...The writing takes us there..All in all get your popcorn ready ur in for a film that u will remember awhile from now..","user":"Bmcine","rank":[19,26]},{"title":"Great acting, writing and directing makes this less of a movie and more of an experience. I recommend this.","rating":8,"date":"27 September 2016","review":"\"Acceptance is the first step to recovery.\" Charlie (Robinson) is a drug addict who has been in and out of rehab. After escaping from his current treatment clinic he returns home, only to fall back into his same routine. Now, given the choice between another try at rehab or going to jail Charlie attempts to turn his life around. What he finds is that rehab is easier than dealing with his famous father (Elwes) in the middle of his run for Governor. This is a very tough movie to watch, due to the actions of Charlie and his father. You are rooting for Charlie the entire time, and you really feel when he is faced with a choice and you feel the tenseness that he does. The movie makes you really feel the roller coaster of emotions that Charlie is on and that really adds to the involvement and impact of the movie. Overall, great acting, writing and directing makes this less of a movie and more of an experience. I recommend this. I give it a B+.","user":"cosmo_tiger","rank":[13,17]}]