[{"title":"Woodshock (2017)","rating":5,"date":"24 September 2017","review":"I thought this looked like Melancholia from the trailer so I was immediately intrigued. I love Kirsten Dunst, I find her very attractive and think she's quite underrated (please see Melancholia and Fargo Season 2 before disagreeing). I generally love independent films that focus on visuals and the aesthetic component of film so I thought I would be in for a treat with Woodshock. Unfortunately though, there is very little to write home about here.<br><br>The film is about Theresa, who recently experienced a tragic loss in her life. She is quite clearly emotionally sunken from the loss and takes a mind and reality altering drug that takes effect on her life. I wish I could say more about the film but its really hard to grasp or explain what else was going on. This isn't even a confusion in a good way. The film has nothing logical going on and doesn't even feel real. It tries to mimic profound films of a minimalist nature but fails to capture any interest or compassion for the work.<br><br>The filming style is worth viewing. Kate and Laura Mulleavy certainly have an eye for cinematic style. The use of superimposition was a huge favorite for this one. Neon lights, hazy atmosphere, and a powerful score also make the technical aspects of the film to look and feel top notch. The film does feel in tune with its drug fueled high atmosphere. That's really it. I think Kirsten Dunst is really good in this. She has really mastered the role of a depressed, grief encompassed woman. She's not at fault for the films shortcomings.<br><br>While I think Kate and Laura Mulleavy impressed with their style, their writing needs more work. Its hard to care and really follow what's going on. I am a patient person for films like this but they have to have a real impact with its minimal story. This film unfortunately does not do that and was a frustrating experience. Definitely not worth the time and effort.<br><br>5/10","user":"rockman182","rank":[36,46]},{"title":"Aimless movie goes nowhere, leaves me unmoved","rating":3,"date":"30 September 2017","review":"\"Woodshock\" (2017 release; 100 min.) brings the story of Theresa. As the movie opens, we see Theresa taking care of a woman we later learn is her mother. Theresa, upon her mother's request, gives her a spiked joint to smoke. Later, when we see the room empty, we understand Theresa is grieving for the passing of her mom. Meanwhile, we get to know Nick, Theresa's boyfriend, and Keith, Theresa's colleague at the medical marijuana dispense store. At this point, we are 10-15 min. into the movie, but to tell you more of the plot (as it is) would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this movie is co-written and co-directed by the sisters Kate Mulleavy and Laura Mulleavy, who are respected fashion designers without any prior film-making/directing/writing experience. I admit that I knew very little about the movie going in, other than it starred Kirsten Dunst in an indie movie about someone grieving. That sounded it might be in the realm of \"Melancholia\", so sign me up! From the opening moments of \"Woodshock\", it all feels quite \"artsy\" and you are left on your own to figure out what is going on. I have absolutely no problem with that, and figure that if the movie is good, this will sort itself out at some point. Here we are left wondering, and wondering, and wondering Things play out on the big screen and at one point you hope to be emotionally involved and invested. I couldn't have cared less about any of these characters, whose random scenes left me utterly unmoved, if not bewildered. There are a couple of plus points, including the at times gorgeous scenery (when Dunst goes walking among the sequoia trees, etc.), and of course Dunst herself. She tries her best, although looking equally lost as we are, and in vain looking for clues (at one point literally, as she searches her house top to bottom for  what exactly?).<br><br>\"Woodshock\" opened this weekend at my local art-house theater here in Cincinnati, and I couldn't wait to see it. The Friday matinée screening where I saw this at was attended poorly (just a handful of people). About 30 min. into the movie, I mumbled to myself \"what's going on here?\", and the guy seated a few rows before me turned around and said \"you and me both!\". This will give you an idea as to the state of affairs in \"Woodshock\". I honestly cannot recommend this movie in good conscience to anyone, but of course encourage you to check it out in the theater (although I cannot imagine it will play more than a week or two, tops), on Amazon Instant Video, or eventually on DVD/Blu-ray, and draw your own conclusion.","user":"paul-allaer","rank":[22,31]},{"title":"Enchanting and melancholic experimental arthouse goodness.","rating":7,"date":"2 January 2018","review":"It's always very hard for me to rate and review these types of films, but I'll try my absolute best here. A lot of people will not like this movie, as it is clearly not intended for the mass appeal. These art films rely almost entirely on aesthetic elements such as intricate and thought-provoking visuals, unconventional use of symbolism, creative directing, imaginative editing and experimental music. Here we have a surprisingly strong directorial debut by the Mulleavy sisters. The film is beautifully directed and edited all the way through. Some of the scenes are very artistic and aesthetically pleasing. The plot becomes hard to follow at times, but that is something you would totally expect in a film like this, as the main focus is clearly the art direction and production design. Peter Raeburn crafted a beautiful score that fits perfectly with the atmosphere and overall tone of the film. Acting is a bit weak at times by some of the supporting characters, but Kirsten Dunst delivers an amazing performance as you would expect from her in a leading role. If you're in the mood for a sad and melancholic arthouse flick, go ahead and give this one a chance, it might be a pleasant surprise.","user":"JDreviews101","rank":[11,15]}]