[{"title":"Man returns to past places, people, and memories.","rating":10,"date":"15 November 2015","review":"KAILI BLUES: A DEMANDING, STUNNING EXPERIENCE<br><br>KAILI BLUES is an extraordinary film.not just a good first feature, not just a good independent Chinese film.but an imperfect dazzling masterpiece. <br><br>Audiences who watch normal films bring strong ideas of what makes effective, satisfying storytelling.I came expecting another good festival art film from China, yet even as a film director/critic, it took me 45 minutes to suddenly realise and understand what the director was brilliantly achieving with fresh cinematic language and vision. From then on I was mesmerised and deeply moved. <br><br>This film doesn't satisfy cinematic art or entertainment preconceptions.It is unique, thrilling personal cinema, that communicates on different conscious and subconscious levels, conceptually, visually, emotionally.<br><br>BI GAN, the very young film director/poet in his 20s, is already an honest, open, accomplished artist, with well-deserved self-confidence (ego firmly in-check), dynamic creative ambitions, and skills to accomplish them. I don't want to burden him with this, or sound pretentious and preposterous – but I couldn't help flashing on Orson Welles during \"Citizen Kane\".<br><br>Wang Tianxing's cinematography was stunning, perfectly merging with the dynamic style and viewpoints of the story. No matter how many camera persons were used or their professional experience, everything flowed seamlessly emotionally. The magical 41-minute single moving shot is as revolutionary as Sokurov's landmark \"Russian Ark,\" with greater psychological and emotional resonance. Memory, fantasy, and reality weave through and around each other.<br><br>Film crafts and cinema language are used smoothly and very effectively: visually powerful rural locations in Kaili, Guizhou Province, China (used with subtlety and respect), \"costumes\" (real lived-in clothes), props (from real homes and villages). Production design, sound, and editing are all creatively professional. <br><br>The Producers did a remarkable job during pre-production, shooting, and post-production, because there must have been daily stressful problems to overcome.<br><br>The actors – 99% non-professional - are perfectly cast and directed. Chen Yongzhong's memorable presence holds together all the wonderful characters in the 110-minute film.<br><br>Traditional Chinese, Miao, children's song, local band, actor's song, new music, and terrific end credit duet, are all evocative and touching.<br><br>KAILI BLUES should be seen at least two times, and discussed by film students in every international serious film school, and by audiences who are passionate about cinema in all countries within and outside China.<br><br>(Since this is a glowing review, I must say that I have absolutely no connection with the film or anyone who made it.)","user":"asiafilm1","rank":[37,42]},{"title":"Mesmerizing, meditative and wonderful!","rating":7,"date":"2 November 2015","review":"I ended up going alone for Kaili Blues for a 10 PM screening at the Mumbai Film Festival 2015. In accordance with standard procedure, I entered the cinema hall baked and ready to enjoy what my cousin described the night before as simply mesmerizing. At first, the theme of the film is familiar. It is essentially a mission to rescue someone (Weiwei) whom the protagonist (Chen) loves. As the film progresses, it takes on an increasingly surrealistic tone, almost losing its way from reality into the imagination of Chen as he travels the hills of China in search of his beloved nephew. The highlight of Kaili Blues is its cinematography. But there is a directorial element that I absolutely adored; the extended shots! Almost reminiscent of Birdman or a Tarantino film, the camera effortlessly follows our hero on bike, foot and boat uninterrupted, as he experiences his past, present and future. I wish this film all the best and hope it releases in a cinema near you!","user":"adityaalamuru","rank":[15,17]},{"title":"Bi Gan is very possible, \"the\" most electrifying discoveries of recent Chinese cinema","rating":8,"date":"12 July 2017","review":"Chinese filmmaker Bi Gan's awards-winning debut, KAILI BLUES, in fact, the literal translation of its Chinese title is \"roadside picnic\", which appears to be the name of a frayed paperback collection of poems we can glance in one scene relatively near the beginning, and indeed poem suffuses in Bi's oneiric idiom, told through the voice-over of our protagonist Chen Shen (Chen Yongzhong).<br><br>The opening shot is a nearly 360-degree roving take setting against in a fixed position, a sparse clinic where Chen works with an elderly doctor (Zhao), they live in Kaili, a foggy, soggy, slight crummy town in China's southeast, subtropical Guizhou province. In lieu of plying audience with Chen's backstory, Bi cogently puts beauty derived from quotidian scenery in a salient place where a laconic storyline takes its form most subtly, the place where a young boy Weiwei (Luo) and his father Crazy Face (Xie) lives is decrepit and noisy to a fault, but strikingly there is a cascade just in vicinity, which promptly gives the said place an almost surreal grandeur, also Bi manifests his ingenuity by capturing the reflection of a passing train on the wall, a blunt intrusion brutally shattering the homely equilibrium but who can deny its aesthetic signification, plus, a passing train would later give the film's ending a divine \"turning-back-time\" coup-de-maître.<br><br>Soon it transpires that Chen is an ex-convict, and Crazy Face is his brother, but there is bad blood between them (which always has to do with family inheritance, properties in particular), Chen notices that Crazy Face is a deliberately negligent parent and suspects that he is going to sell Weiwei. So when Weiwei is sent away to Monk (Yang), a former gangster ringleader Chen once worked for and for whom he is locked behind the bars, he embarks on an excursion to look for his nephew Zhenyuan, and concurrently, to locate his colleague's old flame, who has Miao pedigree and now falls gravely ill. <br><br>The magic occurs when he reaches a town called Dang Mai, where Bi employs an audacious long take running over 40 minutes following Chen and other people he meets there, in particular, a local girl Yangyang (Guo), who is going to work as a tourist guide in Kaili and a young man also named Weiwei (Yu) who overtly carries a torch for her but she seems not to reciprocate. When reality, past, dream are entwined in that bucolic loop, Bi even risks betraying the camera's own existence in order to achieve this cinematic wizardry, is this Weiwei is a future version of Chen's nephew? Does the hairdresser (Liu) he meets is a reincarnation of his deceased wife? When Chen wears the shirt which is delivered to his colleague's Miao lover, is he reliving an imaginative past to give away the cassette, the pledge of romance and courtship? There are cues and incongruities, but the whole enterprise is so remarkably done that should it be singled out as an absolute high water mark from a tenderfoot in the sphere of filmmaking. <br><br>Taking the mantle from Chinese indie trailblazers (Jia Zhangke is the obvious object of reference), Bi Gan has a particular knack of marshaling amateur cast and sampling everyday settings to evince a strangely, but also affectingly enigmatic quality bordering on an amalgam of warmth, other-worldliness and allure, converging with its poetic undertow, kismet-galvanized mythos, beguiling scenery shots, peculiar camera composition and astonishing visual fluidity, plus other perverse quirks: the movie's title materializes roughly 30 minutes into its duration, and its opening credits are read out loud which harks back to Pasolini's THE HAWK AND THE SPARROW (1966, 7.5/10) where the credits are given a singsong treatment, KAILI BLUES is the whole package for art cinephiles, and more encouragingly, Bi Gan is very possible, \"the\" most electrifying discoveries of recent Chinese cinema.","user":"lasttimeisaw","rank":[12,14]}]