[{"title":"Anita Hill was the Jessie Smollett of her time","rating":7,"date":"7 March 2019","review":"If this was a reasonable film it would have both sides of this story, including the dozen women who worked with Thomas and who made it clear that Thomas was being smeared.\nJust google: clarence thomas witch-hunt<br><br>Hill is simply a documented liar, even the cheer-leading mainstream press documented clear untruths by her. This was (another) lynching of a black man by Democrats.<br><br>I recommend looking at Hill on meet the press in 1998 where she made her motives clear:\nAppearing on \"Meet the Press\" in 1998, Hill was asked to respond to Gloria Steinem's defense of President Clinton following allegations he'd groped a White House volunteer. Steinem had said, \"The truth is that even if the allegations are true, the president is not guilty of sexual harassment. He is accused of having made a gross, dumb and reckless pass at a supporter during a low point in her life. Hill AGREED.\nWhen \"Meet the Press\" host Tim Russert asked her if she had a double standard for sexual harassment claims made against Clinton, she said, \"There are larger issues, larger issues than just individual behavior.\"\nJust google: youtube Anita Hill<br><br>This rationalization of it being ook for partisan interests reasons to make up claims of sexual harassment or ignoring those by Democrats because of the \"larger issues\" (ie PARTISAN interests making lies and smears ok) also accused recently with Kavaugh hearings where after that circus we saw two of the accusers withdraw accusations, one have theirs totally debunked, and the fourth, a Democratic Party activist, not able to recall when where or who committed the assault.","user":"random-70778","rank":[14,26]},{"title":"A Supreme Court confirmation hearing becomes complicated by Anita Hill's charges of sexual harassment against Clarence Thomas.","rating":10,"date":"22 April 2016","review":"The movie did a fine job of condensing the confirmation hearing of Clarence Thomas for the Supreme Court, and Anita Hill's accusations that Thomas had sexually harassed her on numerous occasions and was morally unfit to become a justice. Various issues are explored, including sexual harassment in the workplace, sexual harassment by an African American in the workplace, and sexual harassment by an African American male directed toward an African American female in the workplace. If there is a villain in the piece, it is neither Anita Hill nor Clarence Thomas (beautifully portrayed by Kerry Washington and Wendell Pierce respectively), but the Democratic chairman, Joe Biden (Greg Kinnear), of the Senate committee debating Thomas's qualifications. From start to finish Biden is presented as a wuss, easily swayed and manipulated by Republicans to present Thomas in the best possible light. Along the way, Biden also loses witnesses to affirm Clarence Thomas's alleged behavior toward Anita and other women. The movie confronts the cowardliness of liberal white men (all the Democrats on the committee) dealing with sexual harassment charges that concern a black man, with the possible exception of the late-blooming Edward Kennedy who finally comes to Anita Hill's defense. For the most part, Republicans have a field day in attempting to destroy Anita Hill's reputation with bogus charges while Democrats remain mute. Greg Kinnear is completely credible as Biden as is Treat Williams as Ted Kennedy. The movie stresses how this confirmation hearing resulted in the country's growing sensitivity to sexual harassment. But it also shows how Joe Biden's ineptness results not only in Clarence Thomas's confirmation, but a generation of conservative opinions from the Supreme Court.","user":"grimalkin-2","rank":[20,42]},{"title":"Thrilling Political Drama","rating":8,"date":"1 May 2016","review":"The HBO film, \"Confirmation\" documents the grueling events of Judge Clarence Thomas' US Supreme Court confirmation hearings. For a young person that is not as familiar with the history behind his confirmation to the US Supreme Court this film was very shocking and very upsetting. Before watching this movie I did not know about all of the controversy that surrounded his nomination and I had never heard of Anita Hill. When President Bush nominated Thomas (Wendell Pierce) to replace Thurgood Marshall the nation was overall convinced that he would be confirmed by the Senate. However when Anita Hill (Kerry Washington) is asked to come forward to with her testimony of sexual harassment against Thomas the chaos begins. The director Rick Famuyiwa includes news clips that were live during the hearings which enhances the audiences' experience. The news clips make the viewers feel as if the hearings are taking place now. Also this film includes many behind the scenes looks into what occurred without the public's knowledge and it is very disturbing. I would recommend this film because of the outstanding acting and the important message.","user":"gmclean-24636","rank":[15,31]}]