[{"title":"NOT a friend of the director!","rating":2,"date":"27 October 2019","review":"This is a pretty useless effort all round. There is nothing frightening about it and the story is boring. There's a bit of gore but it's film school stuff. Plus, there's an annoying white guy doing a bad Rastafarian act the entire way through. However, there is one amusing scene in the film, which includes the annoying white guy, so he gets a half-pass. It's also the only reason it got one extra star. Avoid this 'film' like the plague.","user":"GilesEnsor","rank":[23,27]},{"title":"Got fooled by the fake reviews again..","rating":3,"date":"30 October 2019","review":"Nice title, I'll give them that. It's certainly not a good film. The production values are poor and the cast is average at best but overall unconvincing. There are much more worse films out there but this one is weak and lacks tension.<br><br>There is some gore but even that's hardly worth an hour and a half of your time.","user":"homecoming8","rank":[18,21]},{"title":"Not overly great, watchable but still tedious","rating":1,"date":"3 November 2019","review":"Not an overly good thriller movie.<br><br>It's watchable, actors are ok. Story hums along, but nothing special.<br><br>I would give this higher marks, but as I was one of the financiers on this project, I am going low because they did not give me any credit in the film, not even a thanks - and I sure am not getting any money from any rentals or sales in any form.<br><br>As I have given money for this film, the very least they could have done is keep my name in the credits when they were added - and they took it out for whatever reason - as well as my production company which was at one time listed because of the financing and marketing which we handled for this film.<br><br>So, to the director, producer and anybody involved in the creation aside of me...I don't know what's going on in your head - but when somebody funds your film and they are not getting any kind of retrun on it - YOU BETTER GIVE THEM THE CREDITTHAT THEY DESERVE.<br><br>My company and myself funded your movie and also promoted it - and you don't have the decency to give any thanks.<br><br>You don't derve anything better than 1 star - regardless of how good it may be.<br><br>I was listed back some time ago and then you deleted my name from the credits.<br><br>NOT COOL.<br><br>\nI hope future funders see this and then realize that they may be wasting their money and efforts on your projects - regardless of how good or bad it may be.","user":"casablancavic","rank":[12,19]}]