[{"title":"Vazante: Gendering Brazil","rating":9,"date":"12 April 2018","review":"This visual arresting film is about 1800s colonial life in central Brazil depicting the harsh life of slavery plus a forbidden love story and vengeance. Its cast produces wonderful performances like the main protagonist, \"Antonio\" played by Adriano Carvalho.<br><br>The story unfolds as \"Antonio\" tends to his settlement, a place of numerous slaves and marries his recently deceased wife's teen niece, \"Beatriz\" (played tenderly by Luana Nastas). The strength of this story is the focus on gender, since its female characters dominate this film. From the master's maternal household to the slave women used for sexual affairs and labor for Antonio, this cast of diverse women characters solidify the storytelling. <br><br>This film is met with visceral imagery as it was shot entirely in black and white. Thomas's depiction of plantation work and visual references of Minas Gerais (known for its mining history) follows great Brazilian photographic traditions. There is almost no music soundtrack (although Brazilian legendary musician, Tom Ze has a track in the film) letting the viewer take in sounds from the landscape of birds chirping to food cooking throughout the house.","user":"babyjaguar","rank":[15,22]},{"title":"Terrible","rating":1,"date":"5 September 2019","review":"Pacing, plotting, and storytelling clearly aren't this director's forte. I don't know what her forte is, but it's definitely not making watchable films. This travesty jumps around wildly from scene to scene, never letting you know if it's the same instant or weeks or months later. The characters' motivations are inscrutable and never explored, and what little information we do get is supplied through forced, clunky exposition between characters. Truly terrible.","user":"ninjawaiter","rank":[1,3]},{"title":"A false depth.","rating":5,"date":"26 March 2019","review":"Good photography. Good performances. Predictable script. Completely boring rhythm.","user":"fivelocks","rank":[1,5]}]