[{"title":"Not Very Good","rating":2,"date":"15 October 2016","review":"This stand up special is not very good. I think it probably is just as simple as Kevin Hart having done too much stuff too quickly and too recently. <br><br>I have liked his stuff in the past including his stand up comedy appearances and also his early movie roles. But his more recent stuff including starring movie roles in lesser quality movies and especially his stand up comedy are just not up to the same quality I'm used to seeing from him.<br><br>I hope he takes some time off to write and develop some stronger stuff instead of just churning stuff out this quickly in the future, to bring the quality up.","user":"johns6087","rank":[68,80]},{"title":"Stand-up that makes you stand up and leave","rating":4,"date":"5 November 2016","review":"I love stand-up specials. I've loved Kevin Hart's stand-up specials so far, even though I have never found his \"preshow\" and \"aftershow\" sketches funny at all. He has some again and I gotta tell you, this was so incredibly boring, I barely remember what was it all about. When finally the show started, I got excited - this is where Kevin is powerful. He has a full stadium (!), a great stage, everything looks perfectly prepared. Then, 20 minutes after the start of the show, I realized I haven't even smiled once. I almost forgot I'm not alone in the theater because it was really, REALLY silent. Even the black people next to me were absolutely quiet and were shrugging at the \"jokes\" - and black people not laughing is a very sad thing for every black comedian.<br><br>His jokes were actually stories. 5-minute stories that started from nothing and went nowhere. After an incredibly unfunny 5-minute joke about a woman missing a shoulder, the first 4 people left the theater. And not because it was a dark joke - but because it wasn't funny at all. Kevin was yelling on his golden mic, making poses, yelling again, but was just as funny as a circus clown and that was kinda sad.<br><br>Kevin Hart has obviously lost his touch with reality and the money he made got to his head. He was performing as the greatest comedian ever, while he was not even average. If he started out with jokes like these, he'd be getting booed off the stage in 3 minutes.<br><br>I have left a theater prematurely only twice in my entire life and this was the third time. It was unbearable. I might download this from somewhere when it comes to DVD just to see how it ends but I ain't paying more for it. Better go to your local comedy club and see an open mic. Most of them will have way better jokes, for sure.","user":"dangershark7","rank":[49,57]},{"title":"Kevin Hart's worse performance","rating":3,"date":"13 November 2016","review":"I'm glad that this is Kevin Hart's last stand-up.. because it was downright awful. He uses the same formula as his last 4 stand ups. Stories about his family, relationships, and lots of screaming. It's more similar in style than Infinity Warfare is to Black Ops 3. But that's not even why it's bad..<br><br>The jokes just weren't funny. Toilet humor, some sex toy jokes, and other cringey jokes. Some of the jokes that were decent was so drawn out that it became very awkward. Even the faces from the fans looked like they were trying hard just to chuckle at his jokes. Literally his last joke at the end was the only one that made me laugh.<br><br>I really didn't want to be believe the prior reviews, but this stand-up is hands down his worse and I think a 3/10 is a very accurate rating considering he is one of the the best selling comedians of the decade.<br><br>Just to let you know, I am still a Kevin Hart fan. I've watched his last 4 stand-ups at least 3 times each. But this did not even come close to expectations. I would not pay $5 or $10 for this. I would watch it online for free. If you are looking for something funny and new I would watch Chris Tucker's \"Live\" on Netflix. It has authentic humor and only gets better each time you watch it. (I'm actually re-watching it right now as I write this) I also logged in just to write this review. My first log-in in 5 years. (Surprised I still knew my password)","user":"Demerson30","rank":[39,47]}]