[{"title":"Surprisingly good movie.","rating":7,"date":"11 October 2016","review":"I was actually very surprised by this movie and how good it was from start to finish. The time flew by and the actors all did a great job. I won't give any spoilers away and don't want to be so vague but it's basically a movie about a group of friends that are on a weekend to try and help their buddy deal with feelings that have been suppressed. There are some very funny moments and the actors do a great job with what they were given to make you feel as though you are there with them. The way they all interact was quite well done and you get a real sense that these people actually care deeply about one another. It's a comedy with a serious topic and they do an excellent job. I highly recommend this indie type movie that deals with sadness with a bit of partying and friends with a good sense of humor.","user":"Christian1967","rank":[13,19]},{"title":"You'll laugh, you'll cry. You'll remember it for Middleditch","rating":10,"date":"28 September 2016","review":"I haven't been more pleased with a modest indie this year as I was with the daringly (and misleadingly) named Joshy, starring some very bright funny young comic actors, including Silicon Valley's hero Thomas Middleditch.<br><br>It's not a stretch to say that Middleditch holds Mike Judge's usual- spot-on-brilliance together on the HBO series, yet it's tempting to relegate him to playing a very good \"young tech type\". Jeff Baena's Joshy doesn't exactly discard that perception of Middleditch but it's a fantastic vehicle for the actor's emotional range.<br><br>But this film isn't a one man show. It's a brilliant ensemble cast of (mostly) guys, drawn together after disparate periods apart from each other to support Josh (Middleditch) who's suffered a pre-marital setback that redefines Awkward. It's such a clever device that I won't reveal it, though it comes in the first five minutes of the film.<br><br>Adam Pally, Alex Ross Perry, Nick Kroll, and Bret Gelman kill with rapid-fire, naturally delivered one-liners that perfectly capture their age, maturity-level (or lack thereof), time and place (Ojai, CA -- very now), and most importantly their relation to each other as well as their biases, fears, and prejudices. It's been said the key to all drama is conflict and it works even better for comedy here. All the guys in this film have a lot going on, much more than they'd disclose about what they're really thinking, about Josh's horrific plight and about each other. It's also refreshing to see a film about guys being guys in Tech Culture 2016 without resorting to some half-baked Big Bang Theory clone. Even better, the indestructible Jenny Slate and Aubrey Plaza join in to kick the feminine factor through the solar-paned roof. Joe Swanberg even shows up in a hilarious cameo, inadvertently toting his wife and kids to this weekend-long drug and booze-filled orgython.<br><br>Most impressively, Joshy could even give the tired Mumblecore genre, where \"nothing and everything happens\" a good name again after some recent major-league misfires (\"Results\"). The flow of events in Joshy is, like its so-appalling-its-almost-funny McGuffin, so organically developed and executed that it almost seems plausible.<br><br>And just when you think there may really be *no* point, Middleditch slam-dunks an extremely cathartic last act monologue that is pain-filled and hypnotic.<br><br>I really did not expect this from the director of Life After Beth or I Heart Huckabees. It only makes Joshy all the more sweeter.","user":"bob_meg","rank":[13,22]},{"title":"Really enjoyed this!","rating":8,"date":"5 October 2016","review":"I watched this with no prior knowledge of what it would be and was very pleasantly surprised. There's a great cast, all of whom I've seen and enjoyed in their various TV shows. The story is about a group of friends on a weekend retreat bonding after a traumatic event and it's mostly just conversations and mundane character interactions, usually involving drinking and drugs.<br><br>Some of it was absolutely hilarious and some of it was very emotional, yet it all felt very real. It's not a mind blowing or deep film but it's brisk, fun and well acted. A great low key adult comedy! Definitely recommended.","user":"erolsabadosh","rank":[10,16]}]