[{"title":"A very beautiful film directed with vigor and taste","rating":8,"date":"15 November 2016","review":"A very beautiful film directed with vigor and taste. To classify this film as biopic does not do justice to it and it is even misleading. I read so many ill directed criticism on what is and what is not historically accurate in the movie. Who cares? Who would criticize the Greek poet Kavafy for misrepresenting historical figures in his poems? For me 'The Dancer' is a poetic film on beauty and the passion for creativity and it was a pleasure to watch. For two hours I was immersed in the film's world, relishing every bit of it; the elliptical decor, the unreal almost lighting, the spectacular dance, the energy. Indeed what I liked most was the fact that the film did not make an effort to faithfully reconstruct an era, but rather create its own unique universe combining various elements in a coherent whole. Let alone the amazing amount of work that went into it, the production design, the choreography, the music. The audacious directorial approach is justified by the result. Soko's choice to play Loie Fuller was excellent as she brought into the part her own fierce determination to develop in the show and music business matched with confident and truthful acting. The film is an amazing feat anyway, but even more so as a debut feature.","user":"maria-douza","rank":[16,22]},{"title":"an engaging bio pic of an avant-garde Parisian dancer","rating":8,"date":"5 October 2017","review":"Historians have a way of sterilising cinema. So many words are wasted on whether a film is accurate instead of understanding and enjoying film as an artform. The Dancer (2016) is a bio-pic based on the life of Loíe Fuller who pioneered a hybrid dance performance that integrated visual spectacle and physical movement. Historians can fuss over facts, but others will enjoy what is an aesthetically intense story of creative innovation in late 19th Century Paris.<br><br>The story opens with Loíe (Soko) raised by her drunken father on a farm in America. A keen reader with a vivid imagination, she dreams of a career as an actress. After her father dies, she uses money stolen from a would-be seducer to cross the Atlantic in search of fame. She stumbles upon a Parisian theatre looking for a performer to fill the stage during interval. As a talented artist with an eye for design, she conceives of a dance act that disguises her modest dancing talent and creates a dramatic serpentine performance using a costume of batons and swirling bedsheets. Her act is immediately popular. Although physically arduous, the performance evolves to using silk, coloured lights, and dramatic music, and suddenly Loíe is the toast of Paris. When the talented teenage dancer Isadora Duncan (Lilly_Rose Depp) joins the troupe, the stress of dancing on Loíe's body, her penchant to overspend, and her emerging sexual ambivalence, all begin to take their toll.<br><br>This is a luscious film to watch. Its rich colour palette, top-shelf production values and unconventional characterisations create the dramatic energy which drives the narrative. Undoubtedly, it is Soko's physicality and her acting style that makes this film work. She has an almost androgynous beauty that the camera exploits; in some scenes she appears dashingly handsome, in others, sublimely feminine. With an emotive range that switches effortlessly from ingénue to sophisticate, she transfixes with her gender-free expressiveness, even under the on- screen competitive pressure of the beautiful young Isadora. The serpentine dance performances are mesmerising. They hang in a space somewhere between classical ballet, modern jazz, and a gyrating living sculpture draped in wings of silk accompanied by Vivaldi under spotlights. It's easy to understand their immense popularity as a dramatic innovation in stage performance. Above all else, The Dancer captures this spirit of excitement.<br><br>Reading this film as history gets in the way of enjoying it as visual spectacle and engaging narrative. Loíe Fuller was praised by luminaries of her time, such as Yeats, Toulouse-Lautrec, and Rodin, but largely forgotten in her native country. The Dancer is a tribute to an avant-garde artiste whose legacy lives on in theatrical dance effects that have become an artform in their own right.","user":"CineMuseFilms","rank":[8,10]},{"title":"A hybrid product. But well-made and with the fantastic Soko","rating":8,"date":"3 December 2016","review":"\"The Dancer\", Stéphanie di Giusto's first opus, is an exciting, if not faultless, first film. Ambitious and finely crafted, this achieved project undeniably deserves praise but to some extent only.<br><br>Let's begin with its merits. Its most obvious one is pedagogic. \"The Dancer\" indeed makes known to the general public the existence of an exceptional artist, Loïe Fuller, this American lady who revolutionized dance in New York first and then in the Paris of the Belle Epoque... before falling into unjust oblivion. To get back to Fuller, she was an amazingly inventive artist who, though no more than ordinarily gifted as a dancer, created a style unprecedented in the art she practiced. Not content to just dance, she managed to captivate audiences in her own personal way, the novelty of her manner lying in her waving robes extended on bamboo batons while rotating at the same time like a whirling dervish. And as if that were not enough to make her a sensation, she enhanced her performances by means of lighting and mirrors, thus creating a magical aura around her. All that made her so successful that she was immediately copied and had to file patents to discourage such imitations. Her being admired by such important figures as Toulouse-Lautrec, Rodin and Marie Curie is a further indicator of the powerful fascination she exerted on her contemporaries. Another asset of the film is its good production values (the settings and costumes really give you the feeling that you have been traveling through time and that you ARE in America and in France at the turn of the 20th century). Also of note is di Giusto's talent for filming the dance sequences. The Serpentine Dance and the Mirror Dance in particular are performed and filmed with such magic that the viewer just cannot watch them otherwise than agape. Danced by the amazing Soko to musical fireworks (notably Vivaldi arranged by Max Richter), these two sequences are really an out of this world experience. Naturally, not all the film can live up to such heights, but at least they exist: shown independently of the full movie, one could go as far as to call them masterpieces. The last strong point of \"The Dancer\" is its two main actresses : Soko, first, who has more than one common point with Loïe Fuller : no greater beauty (by traditional standards) than her and almost her lookalike, she is not either a great dancer (or even a dancer at all) but following Fuller's example in real life, she managed by dint of demanding physical training to equal her model. As for the younger Lily-Rose Depp, graced with a slimmer, more elegant body, and whose dancing is gloriously gracious and effortless, she is perfect for the role of Isadora Duncan, another pioneering performer who, although discovered by Loïe, would not be long in superseding her sponsor. <br><br>But, as I put it before, this globally good film is not totally satisfying. To be more accurate, it can be... but if and only if you did not know anything about Loïe Fuller before viewing it. Supposing you did, you will probably feel irritated and frustrated. For is \"The Dancer\" supposed to be a biopic, following its central figure from cradle to tomb ? Or is it a fantasy inspired by her, in other words an original creation faithful to her spirit but taking liberties with the facts (like for instance Ken Russell's \"Music Lovers\" or Joann Sfar's \"Gainsbourg, vie héroïque\"). The trouble is that the finished product is... a bit of both. Actually, some parts of the narrative are true to the facts (Loïe discovering the effect she has on people while acting a scene of hypnotism during the play \"Quack Medical Doctor\" in 1891; Loïe at the Folies Bergère; her hiring the Sada Yako Japanese company during the Paris 1900 exhibition as well as her signing Isadora Duncan in 1902). But others are downright made up: Loïe was not born in the Wild West but in a Chicago suburb; her father, Reuben Fuller, was not a French born adventurer but the owner of a boarding house and then of a hotel, her mother was not only a starchy temperance activist, but also<br><br>a dedicated supporter of her daughter who went as far as to accompany her to Europe in 1892; Loïe was not courted for a decade by a French drug- addict noble but was married for three years to a rich industrialist who proved to be a... trigamist; she craved being hired at the Opera de Paris but unless I am mistaken, her dream never really came true. Worst of all, whereas she gave up heterosexuality after her disastrous marriage, turned to Sapphic love and had a lifelong relationship with Gabrielle Bloch, her collaborator and admirer, nothing of the kind appears in the film. If Gabrielle IS shown by Loïe's side in many sequences, it is only professional reasons. How come? Why on earth erase this aspect of Miss Fuller's life if it is to replace it with \"traditional\" male-female sex attraction? Might Di Giusto be homophobic ? Not really, if you take into account that Loïe is seen having sex intercourse with her protégé Isadora. But even in these conditions there is a catch: the two latter women's relationship is seen as sorrowful for Loïe whereas she was very happy with Gabrielle. Does the author mean to say that unorthodox loves must be punished? I hope not.<br><br>In any event, those reservations should not deter you from seeing \"The dancer\", a globally well made movie which, in spite of everything, constitutes a loving tribute to a great name of dance. Well interpreted and at times even inspired (the already mentioned dance sequences), it is well worth seeing. Simply, the definitive filmed version of Loïe Fuller's rich life and innovative art remains to be made.","user":"guy-bellinger","rank":[8,10]}]