[{"title":"About moral character, accountability, and spiritual redemption","rating":8,"date":"4 October 2016","review":"While The Unknown Girl, the latest film by Jean-Pierre and Luc Dardenne (\"Two Days, One Night\"), is suggestive of social and political issues such as immigration, unemployment, and economic imbalance, its main concern is with moral character, accountability, and spiritual redemption. Like many other films of the Dardenne Brothers, it is simple, natural, and direct, without using a musical background or resorting to sentimentality. Consistent with recent exceptional performances from established actresses such as Cecile de France in The Kid With a Bike and Marion Cotillard in Two Days, One Night, Adele Haenel (\"Love at First Flight\") is transfixing as Dr. Jenny Davin, a young general practitioner in Saraing, Belgium whose quiet strength, professionalism, and fierce determination dominate the film and make it a worthy addition to the two-time Palme d'Or winners' oeuvre.<br><br>Shot by cinematographer Alain Marcoen (\"Two Days, One Night\"), the film begins at a small clinic where Jenny has been filling in for the retiring Dr. Habran (Yves Larec) but must soon decide whether to accept a more lucrative position out of town. When a young boy has convulsions, Jenny deal with it promptly but later calls out her intern,, Julien (Olivier Bonnaud) for letting his emotions get the better of him, a dressing down that causes him to rethink whether or not he wants to be a doctor, though she later confesses to him that she was being high-handed. Her next admonition to Julien, however, has much more serious consequences.<br><br>When they hear an after-hours buzzing on the intercom, she instructs him to ignore it, telling the young intern that he cannot let patients rule him. When a young African woman is found dead on the opposite side of the freeway by the river Meuse, however, Jenny is riddled with guilt. It is soon clear that the deceased woman was the same person who knocked on their door late at night, yet without any identification papers, discovering her identity and the cause of her death is a challenge which becomes the central focus of the film. Though it deals with a possible criminal investigation, it is less of a \"whodunit\" than an exploration of the many ways in which people deal with feelings of guilt.<br><br>Realizing that if she had answered the ring, the young woman might still be alive, Jenny takes it upon herself to conduct a solo investigation. Hoping to discover the victim's name and find anyone who knew her in order to give her a proper burial, Jenny walks around the town, talking to adults and children who may have seen the woman, showing them her photo and reassuring them that any information they provide will be held in confidence. Though most are in denial and refuse to cooperate, Jenny is able to pick up important signals, especially in an interview with a teenager (Louka Minneli) when his accelerated pulse rate indicates that he may not be telling the truth.<br><br>The Unknown Girl is mostly muted with little variation in tone, but there are moments of joy when two young male patients sing a lovely song they wrote for Jenny, and when an elderly woman throws a gift of a panettone out the window into Jenny's waiting arms. It also touches on the spiritual when a man asks Jenny, \"Why should I screw up my life if she's already dead?\" and Jenny replies, \"Because, if she were dead, she wouldn't be on our minds.\" While a too-neat resolution and a lack of the element of surprise keep the film from being in the top rank of the Dardennes' works, its message that healing can only begin when there is a willingness to communicate and to be responsible for one's actions is as good as any that have been delivered in previous films.","user":"howard.schumann","rank":[31,40]},{"title":"A crime thriller from the Dardenne brothers","rating":8,"date":"17 October 2016","review":"A dead body near the riverbank. An inconclusive police investigation. A prostitution network, operating from a shady bar. It sounds like the classic ingredients for a Raymond Chandler crime story. In reality, it's the set-up for 'La Fille Inconnue', the latest film by the Belgian film makers Luc and Jean-Pierre Dardenne. <br><br>With this crime story, they explore a new genre. Usually, their films are social dramas about people on the fringes of society and their daily struggle for life. With this approach, they have made many very intense and moving films. But in my opinion, they were starting to repeat themselves. 'Deux Jours, Une Nuit', from 2014 was much acclaimed but overrated. <br><br>In many of their films, the plot development is secondary to the emotional power of the performances. Not so in 'La Fille Inconnue'. The plot is exciting and functional in carrying the story forward. The central character is a young doctor, who gets obsessed by a murder case because the victim rang her doorbell minutes before being killed. The doctor didn't answer the bell, and blames herself for it. She is determined to reveal the identity of the victim and starts an investigation of her own. Because she is a doctor, she is bound by an oath of silence and can't share her information with the police - a very clever script element. At the end, she manages to solve the crime. But at the same time, the truth confronts her with the fact that the victim would still be alive if she had opened the door. <br><br>Of course, this is not a classic crime thriller in the style of, let's say, Claude Chabrol. The Dardenne brothers remain true to their trademark hyper-realistic style and to their social conscience. The young doctor is treating poor, displaced, and lonely people. She herself is a solitary, business-like character. The film is set in the gritty industrial town of Seraing near Liège, the home base of the Dardennes. It's populated by working class people. They don't show emotions easily, and that goes for the doctor as well. <br><br>The crime element makes 'La Fille Inconnue' stand out in a positive way. It's one of the best films the Dardenne brothers have made in a long time. And it's definitely one of the best films coming out of Belgium this year. Never mind the lukewarm reception of this film in Cannes.","user":"rubenm","rank":[32,46]},{"title":"guilt and responsibility","rating":6,"date":"17 October 2016","review":"It's a small and dull city as many other in Belgium and Europe. It is inhabited by a mixed population, 'local' Europeans, more recent but well integrated Europeans (some of them are police inspectors), recent immigrants, some legal, some not. Again, as in many other cities of Belgium and Europe. This quite typical landscape of a place like many other in an Europe in change is the setting for 'La fille inconnue' the most recent film of brothers Jean-Pierre Dardenne and Luc Dardenne and as in many of their recent movies the characters fight not only the dullness of life and problems in communication but also face moral choices and need to assume responsibility for their acts.<br><br>The lead character is a young doctor in the community, who deeply cares about her patients. Being just a professional is not enough if you are a physician, this kind of message is quite obvious and smartly developed, as the best scenes in the film are the ones where we see doctor Jenny Davin interacting with her patients, taking care of their bodies but also of their life conditions and eventually of their souls. When faced with the guilt of not having answered a ring at the door much later than her work hours, which led to the tragic death of a young woman apparently followed by some bad people, the feelings of guilt will lead her to run her own inquiry with the main goal of discovering the identity of the victim and ensuring her family knows her fate, and that she is properly put to rest. This will let to the eventual discovery of the murderer, in a case that involves a non-negligible dose of shared responsibility of the people who surrounded her.<br><br>The film is very much based on the lead character, one of these people who are capable of showing compassion and giving almost everything in there personal lives in order to help their human fellows. From this point of view it resembles another film of the Dardenne brothers which I liked a lot - The Kid with a Bike (Le gamin au velo). There are bad people in this world, but there are also good ones, and it's worth making films about them - this seems to be the shared message of the two films. 'La fille inconnue' however lacks the magnetism of The Kid and although Adèle Haenel gives a remarkable performance, this is not enough to fill in for the lack of pace and the rather unconvincing ending. Brother Dardenne's characters may seem to good to be true, and they do not owe anybody an explanation for being so - that's fine, but in the absence of a solid motivation there need to be more dramatic substance in the story. This is exactly what is missing in this film, just seeing good people in action in a difficult community may be enough for a documentary, but not for a full feature.","user":"dromasca","rank":[14,23]}]