[{"title":"I tried to like it. I really did...","rating":2,"date":"8 February 2016","review":"Let me preface this by saying I have never seen 50 Shades of Grey. I've seen the reviews, I know the story, but after seeing 50 Shades of Black I feel like I've seen the actual movie it was parodying. Wayans' comedies have devolved from clever self-aware satires to blatant movie rip-offs with sporadic laughs. The difference is, unlike the Haunted House movies, there are next to no laughs in 50 Shades of Black. It's essentially deconstructing every scene in 50 Shades of Grey to show the audience how dumb it is, which would be fine if it was actually funny. But no, this humor is scraped right from the bottom of the barrel, reusing the same stupid gags from previous spoofs and rehashed awkward shock \"humor\" that comes across more cringe-worthy than anything.<br><br>I like Marlon Wayans, I really do. He seems like an awesome guy and he was actually a great writer one point, and a great actor too (to this day I'm blown away by his performance in Requiem for a Dream), but his talents must have gone to his head because he isn't tapping into his genius anymore. It's just easy joke after easy joke, and as simple as the jokes are, none of them land. In fact, at one point after a painfully awkward dinner scene that went on 5 minutes too long, I couldn't help but laugh, for the wrong reasons mind you, thinking, \"Jesus Christ, this is a real movie?\" It was painful. <br><br>All of me wanted this movie to be good, but part of me knew it would be a disaster. Well, that part of me was right. Sure, I chuckled at a few scenes, but I also chuckled a few times in A Haunted House 2 and that's still a terrible movie. The difference is 50 Shades of Grey is even lazier and somehow even less clever than AHH2. I anxiously await the day the Wayans brothers come out with another great spoof movie, but I have a feeling it's going to be a long, long wait.","user":"lnvicta","rank":[73,91]},{"title":"50 Shades Of Shite","rating":1,"date":"17 February 2016","review":"After weeks of being teased by the trailer I was so excited to see this film! I was expecting 50 Shades Of Grey meets Scary Movie- you know, a parody that actually worked. But I couldn't have been more wrong. It was more 50 Shades Of Shite. <br><br>Five minutes in to the film and I knew i'd spend the remaining 1 hour 27 minutes with my palm on my forehead, cringing for my life at it's stupidity.The film had potential to be very funny but the idea was crushed by the terrible acting, and pathetic excuse for dark humor. I can account for the two times, throughout the whole movie, I let out a slight giggle- well it was more of a scoff but at least it triggered some kind of emotion eh. <br><br>As a kid I loved the Haunted House and Marlon Wayans was brilliant in it; I think this is why I expected great things. I think he should stick to his PG rating films. It's crude sexual content contained stereotypical 'humor' that could be considered racist towards African American's and many people could take offence. I find it offensive that we are expected to pay as much as £5 to watch this. Watching paint dry is more entertaining. <br><br>I was counting down the painful minutes, praying for the movie to end. When it did, sheer disappointment and disgust was how I was left feeling about this movie. This film is a waste of time and a waste of a cinema slot.","user":"oliviafrancesca_x","rank":[56,77]},{"title":"Funny if you know what kind of joke to expect","rating":8,"date":"11 April 2016","review":"People should be used to the kind of humor coming from movies with Marlon Wayans, so I don't get the point of people complaining the humor was offensive. If it's not your thing it's obvious you won't like it, the least you can do is learn that some actors/directors make movies you simply don't like.<br><br>I only new enough about 50 shades (the book) and can't tell there is no need to watch the movie before watching this. <br><br>At the beginning the movie doesn't really know where it's going, but after a while it finds its pace and delivers. Me and my friends had good laughs.","user":"andre2999","rank":[29,40]}]