[{"title":"Embracing and Hopeful","rating":9,"date":"1 September 2017","review":"I was pleasantly surprised by the strong acting and professional quality of this film. \"All Saints\" depicts the struggle of a fledgling pastor to revive a nearly-defunct church, while trying to meet the needs of a wave of refugees from war-torn Burma. While many faith- based films focus on miraculous conversions and battles with the secular, this film dealt with the more prevalent problems many congregations experience. Shrinking membership and aging populations, as well as the financial struggles of maintaining buildings--these are the painful reality for many faith communities. Poised for dissolution, the All Saints Episcopal church is about to be sold off, and the members scattered. Rather than go along with the sale, the people band together--old and new--to try to save the church through growing produce. The story is powerful, and the filmmakers have mixed professional actors and actual congregation members in the cast. This, and the use of the actual church and grounds for the filming location, brings a strong authentic feel to the film. Audiences will resonate with both the dilemma--and the solutions found by the main characters. Kudos to all for a relevant and uplifting film!","user":"katetsubata","rank":[20,26]},{"title":"Share this story with your children","rating":10,"date":"2 September 2017","review":"Based on a true story. Great back story. Relax and escape the stress of your life while in the theater routing for the success of these people. Run, don't walk to the theater. The story line is one of determination and who doesn't need that right about now. Go see the movie and then hear me say, \"I told you so.\"","user":"lmbeene","rank":[16,24]},{"title":"This movie will make you cry","rating":9,"date":"27 August 2017","review":"Its the true story of Burmese refuges, a new pastor with a dying church. Disclosure I background actor on the film. (I'm on the cutting room floor) So knew what the story was in general a year ago. This film moved me to tears 3 times after seeing it for the first time. Even if you are not person of faith, this will move you. Don't want spoil it just go see it in the theater!","user":"pezcleo","rank":[13,19]}]