[{"title":"\"The movie is a \"thinking person's horror film\"\" -- IMDb reviewer beenishraza, 29 November 2017","rating":3,"date":"23 April 2018","review":"Kelly Johansen, (Rose McGowan), a freelance debunker of the paranormal, is seen at a farmhouse (located, inexplicably, in the woods) where she is investigating a young boy's report of nightly disturbances. She asks the boy's father if there are any airports nearby because, apparently, aircraft noise can cause spooky sensations. (This rather begs the question: why haven't people been complaining about such fearsome effects since the Wright Brothers demonstrated powered flight in 1903? But never mind.)<br><br>Anyway, Pop replies that there are no airports or helicopter landing pads within 200 miles.* Ms. Johansen has a sudden inspiration, and inquires if any of the neighboring farms have been having their crops dusted -- at night. This turns out to be the correct solution to the mystery. I guess crop dusting in the dark makes a kind of sense. Sort of like having a blind person paint a house; the coverage might be sporadic, but the results would definitely be original.<br><br>The rest of the film is mainly Ms. Johansen investigating the haunting of an abandoned subway station in Toronto, which she does by meandering around a small, dim set with a flashlight while heavily sedated. Altogether, this goes on for thirty-five minutes or so. She also examines her computer screen to analyze \"low frequency sound waves\" on software that looks like Audacity or Winamp circa 1997, and as her screen shows only one waveform spectrum we can conclude she records the data for her expert analyses in mono on her laptop's built-in microphone.<br><br>After finding a CG corpse and contacting the police, the corpse disappears but a detective shows up. He goes to the bathroom, returns to find Johansen asleep, wakes her up and advises her to \"get some rest.\" (I am not making this up.) Later, for entirely inaudible and incomprehensible reasons, he forces her at gunpoint to prove that ghosts don't exist. Then he gets trapped in a small room where, for even less comprehensible reasons, he explodes. In addition, CG moths fly out of a cement wall, a creepy doll sits on top of a cabinet, and a spectral Christopher Lloyd periodically replaces some light bulbs with flux-capacitors before heading back to the past.<br><br>With all this, and more, you might expect there to be some coherent, unifying, explanatory lynch-pin. On the contrary, the movie can't quite decide why the station is haunted in the first place, but we are given three possibilities:<br><br>1. The suicide forty years before of a mentally disturbed young woman.<br><br>2. The existence of a tunnel connecting the station to a now closed asylum at which, in proper accordance with the doctrines of movie psychiatric medicine, terrible abuses occurred. (Exactly why this absurd piece of cryptoportical architecture was constructed is never discussed, but perhaps it was to provide a means for the suicide to get to the subway without asking the audience to believe that she strolled out of the asylum, and through the streets of Toronto, barefoot and dressed only in a hospital johnnie.)<br><br>3. The subway runs through an old Potter's Field and the resident dead are not happy about having been evicted and told to take the train.<br><br>All things considered, I think the general story is supposed to be something like this:<br><br>The day Ms. Johansen is exploring the subway station is also the thirtieth anniversary of an assault she suffered as an eight year old child. This event was so traumatic that she was institutionalized at the very asylum that is connected to the station, but it is unclear whether she recalls this. Things such as the creepy doll, (which was hers), the combustible detective, and Christopher-the-Friendly-Ghost help her get a handle on this personal situation, as well as an understanding that the moths are the trapped spirits of the dead from the suicide or asylum or cemetery, (feel free to mix 'n match). In a dramatic, cathartic moment, boyfriend arrives just in time to help her liberate the little winged digital souls by opening the door to a shed at ground level. The spirit moths swarm out and, after a tense, hurried meeting of responsible officials, the city of Toronto places emergency calls to Orkin and Ghostbusters. Ms. Johansen's skeptical narrow empiricism is properly placed in the recycle bin, and she signs off of her debunker blog thingy forever -- or does she?<br><br>But one is left with more questions inspired by this thinking person's horror film. If the paranormal is exists, what about the para-abnormal? What would have happened had the spirits been caterpillars? Or cocoons? Could a no-pest strip have resolved the issues more efficiently? Is The Sound of Music (1965) an example of White Noise? Does noise come in decorator colors? How DO you solve a problem like Maria?<br><br>There are so many questions that my puzzler hurts. Maybe I'll take a Jawbreaker (1999) and lie down.<br><br>XYZ<br><br>* Assuming a circle of radius 200 miles, this implies no airport within an area of (pi)(200)^2 mi^2 &gt; (3.14)(200)^2 mi^2 = 125,600 square miles. This is 18.26 times larger than the 6,880 square mile area of Kuwait, where this film was released, and Kuwait has an airport. Rhode Island, the smallest US state, has an area of only 1,214 square miles, or about 0.9665%, (slightly less than one percent), of our hypothetical circular area, and I know for a fact that it has at least one airport too!<br><br>Remark: The Apple product placement is particularly shameless here. Multiple shots practically framed around the computer's glowing insignia, and when searching for a signal with the phone held at arms length toward the camera you can almost hear a low frequency voice saying, \"Rose, honey, remember not to let your fingers cover the logo.\" (Just once I'd like to see a Linux based movie.)","user":"AlexanderAnubis","rank":[31,34]},{"title":"Disappointing","rating":4,"date":"29 September 2017","review":"I like to think of watching horror movies like going on first dates: Does it have a likable personality? Is the memory of this film going to stay with me till the next night? Is it something I can go back to watching and still enjoy? <br><br>With The Sound, the only thing I'm left with is the thought of what it could have been. I could not be disappointed if I didn't have somewhat high expectations for it. The title is sufficient to pique my interest. I would have been satisfied if this was about a particular creepy sound. So many horror movies rely on visuals that it would be very refreshing.<br><br>It starts out promising: a campy little story with likable faces. But you soon realize it runs far too long for the punches it packs, which are barely a handful. Your mind starts working overtime to entertain you where the movie fails to, which includes not only imagining how different scares could be built up where there aren't any, but also poking fun at the vague and rushed plot. All this makes the movie a disappointing watch.","user":"cjs6547","rank":[48,56]},{"title":"Disappointing and Boring","rating":2,"date":"28 May 2018","review":"First 10 minutes were promising. Leader character is out to prove ghosts aren't real, and gets contacted online about a haunted subway. The build up was promising, and then we get to the abandoned subway, where things take a nose dive. You'd think a dark abandoned underground subway, where a woman committed suicide would be at least entertaining, but it ends up being boring. This was such a waste of a set up. A talented writer and director would have made the most out of this, but it falls flat. Poor Rose wasn't given much to do, except stare at things, walk around, and tweet on her phone. FYI you don't have to hashtag every single word in your tweets! She has the exact same facial expression throughout. <br><br>The dialogue is lifeless. In one scene rose's character rambles on and on about nothing, in run along sentences. It gets so mind numbing that you can see the look of complete boredom on the detective's face. Neither actor wants to be there, and are just waiting for their paycheck.","user":"80sJoker","rank":[10,11]}]