[{"title":"Surprisingly entertaining","rating":7,"date":"8 June 2016","review":"Like just about everyone I'd never heard of the short lived TV series, but decided to give this a go with crossed fingers, having been burned too often by a catchy title hiding a dull film.<br><br>The story, about two very low profile costumed heroes stepping up to the big money league, is never too original (except right at the end), but it's saved by a snappy script and two very likable leads. It doesn't take itself too seriously, and there are plenty of laughs in what ends up being a lighthearted romp.<br><br>It's not overlong, coherent, witty, well acted and a fun way to spend 80 minutes, especially if you have a fondness for superhero films. You may not rave about it to your friends like you do the big budget blockbusters, but you WILL get them all to watch it, and that's the mark of a good flick.<br><br>Sequel please.","user":"alan_holloway_2","rank":[27,38]},{"title":"This is what happens...............","rating":1,"date":"20 December 2018","review":"When you get two people from You tube who have zero talent. A stale, generic show that seems to be aimed at the handful of people outside of YT who know who these people are. The show is going to fail hard.<br><br>Grace is famous for acting like a moronic 12 year old and Hannah is only famous for drinking, yet some idiot thought they could hold up a show. Even tho every show/film these two have been in has bombed or faded away before it's even started.<br><br>Maybe now Producers and Directors will learn that outside of YT no one cares who these talentless people are.<br><br>If there is nothing left to watch on the planet, I would still skip this cancelled trash.","user":"Krugerharn","rank":[13,19]},{"title":"What Have They Done To These Two Heroines?","rating":2,"date":"11 July 2019","review":"As a fan of the short-lived TV show, I was actually excited for this, as it was looked like it would be a good parody of how superheroes are used by Hollywood to make money. However, after buying this and watching the entire thing, I was shocked at how Sid and Marty Kroft would allow Legendary Digital Studios to portray these two underrated heroines who were the female version of the 1960's Batman show.<br><br>While I have no beef with Grace Helbig and Hannah Hart as the two heroines, since I thought they were okay, my problem is the overall tone of the characters. Unlike the TV show, they act like complete jerks, like one scene where Electra Woman tells a woman with a peanut allergy to eat all of the snacks with peanut butter in them. I mean, is that how a superhero is supposed to behave? Another problem is the use of blood and gore (one scene has Dyna Girl ripping a masker robber's arm off with a gadget, and the ending basically has the two defeating the main antagonist using a peanut, because the villain is Bernice, which make the ending not only anti-climatic, but also pro-allergy bullying).<br><br>Also, the movie is set in an alternate universe where superheroes are used to sell products due to supervillains no longer existing because of an event Electra Woman calls the Shadow War. While it is a good departure from the usual good vs. evil stories of the Marvel Cinematic Universe, but it fails due to how the story is written. The humor is not funny, and the characters are uninteresting. Steer clear if you like the original series.","user":"jeremycrimsonfox","rank":[5,7]}]