[{"title":"\"We didn't need dialogue. We had faces!\"","rating":15,"date":"15 June 2018","review":"I thought of that line from Sunset Boulevard several times this afternoon as I sat, the only person in the theater for a 2:50 matinee, watching this *Seagull*. Not that the script, based on Chekhov's play of the same name, was negligible. To the contrary. It was well delivered by a cast who, for the most part, knew how to do so with telling effect. <br><br>But what struck me, over and over, were all the close-ups of the faces. Wonderful faces, characterful faces, belonging to actors young and older who never knew the silent screen era and yet know how to act just with their faces. Faces often perfectly lit, so that we saw the fresh beauty of the young - Saoirse Ronan, as Nina, out on the lake with Boris Trigorin and elsewhere in the early parts of the movie - and the cruel wrinkles and crowsfeet of those to whom time has not always been kind (Annette Bening, as the aging actress Irina, who delivered her dialogue wonderfully, but did so much more with her face alone when she considered, at the odd moment, that she might in fact no longer look appealing to her younger lover, Trigorin). If you like to watch actors act with their faces, as Norma Desmond and her generation knew how to do, you will find this movie a feast for the eyes.<br><br> But it is also beautifully filmed. The exteriors were evidently shot up in northern New York State, and they are like landscape paintings. The interiors, with period costumes, are wonderfully shot as well.<br><br> But it is the performances that you will remember. In addition to those already mentioned, Brian Dennehy, now 80 years old, is winning as the aging Sorin. Billy Howle does a fine job with the young playwright Konstantin, so convinced that he sees a new way to do theater and yet so very wrong. I was less captivated by the Doctor and Boris Trigorin. Elisabeth Moss had a difficult assignment, because Masha is such an unsympathetic character, particularly self-centered in a story about self-centered people.<br><br>Another thing that struck me repeatedly as I watched this movie was how cruel most of the characters are to each other, in their own very decorous ways, mostly because they are so wrapped up in themselves that they do not consider those around them. Well before Antonin Artaud and Jean Genet, *The Seagull* is definitely an example of the theater of cruelty. <br><br> Because this was released in the summer, it will, I suppose, be forgotten by Oscar time. More's the pity. There is a lot of very good work here, in the acting, the lighting, the cinematography and the direction. This is definitely a movie that could be savored more than once.<br><br>----------------------------------------<br><br>I subsequently reread the play, in Laurence Senelick's 2006 translation. I was surprised to see how much of the script is taken verbatim from that. The person who did the fine screen adaptation removed references to things that contemporary audiences would not know, shifted locales for certain episodes to produce the sort of visual variety you can't have in a play but need in a modern movie, and trimmed back certain passages so that subsequent events, such as Nina's appearance at the estate near the end of the movie, come as more of a surprise. Other than that, this movie is a remarkably faithful transfer to the screen of Chehkov's play.","user":"richard-1787","rank":[50,53]},{"title":"Far from Chekhov","rating":1,"date":"29 September 2018","review":"When you make a 98 minute movie of a play that usually clocks in at about two hours or so, a great deal of text is bound to be wasted. It's the case with this latest version of \"The Seagull\", and Chekhov is not an author whose lines you can simply discard.<br><br>Dorn, the doctor, has been known and remembered since the premiere of the play in 1896 for prescribing his idiotic \"valerian drops\" (which according to Stanislavski's memoirs was something that Chekhov himself used to do, somewhat mockingkly, since he was a doctor himself). It's not in this movie.<br><br>Trigorin's magnificent monologue to Nina about never being able to compete with Tolstoi or Turgueniev - one of Cheklovs finests - was butchered and becomes meaningless. Konstantin has a long and heartfelt conversation with Sorin at the beginning to explain his problematic relationship with his mother. It's brutally cut. Polina, Masha and Medvedenko are reduced to a useless bunch of shallow losers.<br><br>Director Michael Mayer was apparently more concerned with beautiful landscapes, lakes, boats and gardens. And a soundtrack (very sweet and nice, I might add) that reminds us constantly of a romantic comedy of the eighties. As it's been pointed out, here, the movie is \"beautifully made\". But it has nothing to do with Chekhov.<br><br>The cast is very uneven and the roles are poorly developed. Director's fault. Saoirse Ronan is ok, and her smile lights up the screen. But no real depth. Corey Stoll is excellent but his role was pulverized so he doesn't have much to do with his Trigorin. Same with the brilliant Brian Dennehy's Sorin. Annette Bening is good but lacks the necessary charisma for Arkadina. The sweet, sad and loving Masha turns to a neurotic drunk by Elisabeth Moss. Mare Winningham's Polina is just a whiny and annoying matron. And Billy Howle is very weak as Kostia.<br><br>For people who wish to come in contact with this wonderful play, I recommend the flawless 1975 version with Blythe Danner, Frank Langella, Lee Grant and Kevin McCarthy. Or Lumet's 1968 movie. And for real aficcionados, the 1974 russian version, with great Irina Miroshnichenko as Masha.","user":"bernardoarquivo","rank":[33,45]},{"title":"A pleasure","rating":9,"date":"30 June 2018","review":"First, let me say that this film is not for everyone. If you don't have an appreciation for the tragedy often present in real human relationships and often chronicled by Russian authors you may not enjoy this movie to the fullest. On the other hand, if you have some familiarity with Russian literature you may be pleasantly surprised. The cast performed wonderfully.","user":"craig-359-543502","rank":[27,39]}]