[{"title":"As predictable and interesting as watching grass grow on a meadow.","rating":1,"date":"2 August 2015","review":"Let's just say that each time the \"shark\" ate someone, I was hoping it had room for one more. I simply cannot understand how anybody would want to invest other than time in watching this piece of crap, and I do believe the producers should have their heads examined along with the people conceiving the plot. I actually like and respect Danny Trejo as an actor, but he should definitely have passed this part along with the remains after his breakfast. More specifically, it is the profound idiocy in this movie that really turns me off. I don't mind watching D-movies as long as they are have a certain minimum of innate logic, and to point to some examples I better first write this:<br><br>SPOILER ALERT:<br><br>Don't read this if you want to see this movie without first learning about some of its more blatant flaws. The actual action starts when this 3-headed fish arrives and for some reason decides to rip a large underwater research facility apart. At first it just swims a little around and is spotted by some visitor named Brad who see its shadow, complete with a large tail fin swinging from side to side some distance away. Now, everybody knows of course that a whale will swing its tail up and down, but Brad, who according to his own statement (\"Nah, it's fine professor. We've all kicked it with whales before!\") should have known better, mistakes this typical fish-mode of swimming for that of a large whale and waddles out in the water to have a better look. The water is not deep at all so when this guy almost reaches a large collection of floating debris it reaches no higher than a little bit below his knees. In the mean time wee see this gigantic shark, which I estimate to be something like 15-30 meters long (its size seems to fluctuate throughout this movie) and perhaps 2-3 meters tall and with a back fin no less than 2 meters in height, approaching with its head immediately underneath the floating debris. The back fin turns out to be no problem because it somehow manages to tuck it away so it does not stick up through the floating debris, thus warning Brad. Then it finally comes close enough to initiate a giant leap out of the water, and we are talking a leap at least twice as high, relatively, as one of the great white jumping sharks you might have seen on TV, and who requires at least a depth of 4-5 times their body lengths to build enough speed for the jump. Brad is of course just standing in his knee-deep water with open mouth and an expression of surprise all over, and then the shark slams right down on him and disappears deep below the surface of what must obviously be solid sand. Amazing. The rest of Brad's buddies on shore then run for the only safe place on this atoll that have probably been above sea level for hundreds of years - yes, they of course run deep down into the facility, which is then trashed by the shark, that also manages to snatch some guy sitting on a toilet by jumping up through the floor. At this point in the movie I actually started to expect the shark to start jumping out the faucets, but no. Then they all run upstairs and decide to swim out to a little boat one by one rather than staying in complete safety on land, and the rest is so stupid that it is hard to fathom. Why can't the shark catch a couple of slow swimming \"actors\" when it has no problem swimming faster than a speedboat on other occasions? How come the water is completely still around the boat while the \"actors\" discuss their options when we have just seen one of them fire it up at half speed? Why would I waste maybe half an hour of my precious life writing this critique when I have seen at least ten movies just as bad, or worse? Who reads these reviews anyway?","user":"modeldyr","rank":[15,17]},{"title":"SyFy seems to not even care any more","rating":1,"date":"20 July 2015","review":"This is a horrible movie. The animations are terrible and the plot is pathetic. It's obvious they rushed the editing to get this movie out for shark week, but come on SyFy, we can see other boats in the background and they are clearly in a channel with land all around them when they are trying to find a place to get to with the boat. The boat that was sinking one minute, with bodies all over it, was perfectly fine minutes later. One mistake after another. Perhaps you could also try and find actors who can really act next time. The level of acting here is grade level. I get the \"B\" grade quality of your movies and we normally enjoy that but even we were hard pressed to make it through this stinker. Terrible, terrible movie.","user":"jmstanton","rank":[17,20]},{"title":"Really bad","rating":1,"date":"7 August 2015","review":"I am a fan of B-movies and appreciate the humor in them. They are aware of the audiences expectations and delivers.<br><br>But this movie really tries to be a real movie. My expectations were very low and only wanted a bit of brainless entertainment. But the brain could not relax with all these unnecessary flaws. Going full speed and barely make any waves. Badly broken things are suddenly whole again. Using the same cut scene over and over and ... again. At least some laws of physics?<br><br>I seldom regret watching a movie but this one can with good continence be skipped. It only makes you feel bad that you gave it a chance.<br><br>All though Danny Trejo saves it a little it's way below par for B-movies.<br><br>Let it slip by you unwatched.","user":"hotkewi","rank":[18,22]}]