[{"title":"I find it impossible to fault","rating":10,"date":"1 April 2016","review":"A brilliant funny movie that still respects the sadness that happens in life but tries to show you that fun and laughter can still be our main focus. <br><br>I think this is the best so far of Taika Waititi's films and recommend it to anyone to see. I saw it after a long-tiring week at work and I half expected to nod off in the cinema theatre because I was so tired. But I didn't. I laughed and chuckled most of the way through the film and came away re-energized and very happy I had gone. <br><br>Would see again if the opportunity came up, which is likely as most of my friends are raving about it and a few are wanting me to go with them to see it again!","user":"benedwar","rank":[158,184]},{"title":"See this film!","rating":10,"date":"3 April 2016","review":"I saw this movie last night in Hokitika. There was a queue outside, which caused comment enough amongst the locals, as this never happens. The cinema was packed with an amazing demographic of people, for example, on one side of me were toddlers with their Mums, on the other a lone hunter-type and behind me a group of retired farmer ladies. I think this speaks volumes on the draw of this film. To put it simply, it ticks all the right boxes. Everyone in Aotearoa (NZ) will know these characters in some form or another; from the gruff old bushman, to the earthy mother figure and the chillaxed cop. It is that familiarity that makes it more engrossing and funny. But not just here, its mix of subtle bathos and pathos will make it universally appealing, of that I am certain. In short: Good on ya, Taika! 'Marvellous' film!","user":"fleable","rank":[109,131]},{"title":"Has heart and is genuinely funny","rating":9,"date":"31 March 2016","review":"Taika Waititi is starting to make some real waves in the film making industry. It's as simple as this - every film he makes, people like. In fact, people like them so much he's been trusted with the directorial duties in the next 'Thor' film 'Thor: Ragnarok'. That's big and shows people trust him with making their film. That decision was made prior to the release of 'Hunt for the Wilderpeople' but I can confirm that this film will do his reputation no harm. In fact it's going to do it a lot of good. It's a very fine film and in my opinion his best yet. <br><br>I thoroughly enjoyed 'What We Do in the Shadows' but my one qualm with it was I felt it lacked a story to drive the humour. The man learns from his errors fast though and there is no such problem here. The story, while simple, is a driving force and makes sure things never get mundane or boring. Also helping this is a terrific cast of actors. Julian Dennison in the lead role blew me away and showed comedic timing far beyond his years. Sam Neill was as fantastic as ever and every cameo throughout is terrific and hilarious in its own way. <br><br>The film not only manages to make us laugh though, it also has a heart. There are some very sad and moving elements to the film which are handled exquisitely by Waititi. He makes us think and sobers us occasionally but never takes us away from the fun time we're having with the story. There's a lot more to the film than I expected going in. It has layers and works on a lot of levels. I can't say enough good things about this film. An absolute pleasure to sit through.","user":"jtindahouse","rank":[114,139]}]