[{"title":"Beautiful story about two true under-appreciated cinema legends","rating":7,"date":"20 June 2016","review":"This is the story of Harold and Lillian Michelson who were a showbiz couple who enjoyed a 60 year marriage. These guys weren't your typical showbiz people, however, as they worked the whole time under the radar and behind the scenes. Harold was a Hollywood storyboard artist and Lillian a film researcher. This may not sound like a lot but this film makes it very clear indeed that it in fact was rather a lot. If you need one individual piece of proof, look no further than the iconic shot of Dustin Hoffman framed by Anne Bancroft's leg in The Graduate (1967). An image that not only encapsulated so much of the dynamics of the film itself but more than that is generally considered to be one of the most iconic images in movie history. This was not the idea of the man who won an Oscar for directing the film, Mike Nichols, nor Robert Surtees who was nominated for an Oscar for best cinematography. It was the idea of Harold Michelson, the man who story-boarded the film. He didn't win an Oscar. He wasn't even credited.<br><br>This is but one example of the sorts of ideas Harold regularly brought to the table that were then used in a large array of films from the classic era like The Ten Commandments (1956), West Side Story (1961) and The Birds (1963), up to special effects bonanzas such as Star Trek: The Motion Picture (1979) and beyond. Harold's work once again shows if proof is needed, that film-making is a collaborative effort where the director tends to get the credit for everything in spite of this fact. Throughout the film we see examples of Harold's beautiful drawings, which were so invaluable for directors trying to work out how to visualise the screenplays they had to work with.<br><br>His wife Lillian was a film researcher who set up a library that became an invaluable resource for many of the greatest film-makers in Hollywood. Circumstance led her to move it from place to place including Paramount Studios, Francis Ford Coppola's American Zoetrope Studios and ultimately at Steven Spielberg's DreamWorks. This library supplied the information on everything from the type of pants worn by Jewish girls in the late 19th century to the ins and outs of the hard drug trade. Of the latter, Lillian was even offered to go on a trip to Bolivia with a drug lord to see the operation at first hand! So these two individuals have made an immeasurable impact on the films coming out of Hollywood over a period of decades. And this film celebrates not only them as individuals but also as a loving couple whose marriage lasted for decades in an environment which is notoriously volatile for relationships. Charmingly, the movie is story-boarded throughout with cute drawings illustrating the narrative. There are also many film insiders on hand to offer their recollections of this fine couple, including Danny DeVito, Mel Brooks and Francis Ford Coppola. Its overall a very rich and rewarding bit of work about people who fully deserve the recognition it affords them.","user":"Red-Barracuda","rank":[17,17]},{"title":"Beyond the amazing Hollywood history is a truly inspiring love story","rating":10,"date":"13 May 2017","review":"The first time I saw it I was inspired as I learned about a truly great unsung Hollywood craftsman who was the secret weapon of several iconic directors.<br><br>The second time I saw it, I marveled at the force of nature that is Lillian Michelson, whose remarkable research library guided generations of filmmakers.<br><br>The third time I saw it, I finally saw it — my fascination with Hollywood no longer distracting me. I saw it for the truly touching yet not romanticized love story that is at its heart, all the more real and deeply human as it plays out against the backdrop of Hollywood make-believe.<br><br>I can't think of another documentary I've seen more than twice. Go see it at least once on the big screen while you can.","user":"parker-37041","rank":[10,11]},{"title":"A fascinating portrait of a charming (and influential) couple","rating":9,"date":"23 May 2017","review":"This film could very well have flown under my radar. I saw it during a one-week engagement at our town's small art house theater, and I don't always keep up with what they're showing. Similarly, Harold and Lillian Michelson flew largely under the radar of Hollywood. Most film buffs probably have never heard of them (I certainly hadn't); Harold was a storyboard artist and a production designer, and Lillian a researcher. But someone decided they would make a good subject for a film, and indeed they do. Harold had passed by the time the filmmaking began, but there was a large amount of archival footage on him. Lillian (age 87) is still alive and sharp as a tack. Both are charming, eloquent and endearing. I was greatly entertained by this film. The couple are great storytellers, and they have great stories to tell! I was amazed at the impact they have made on many films I have seen. Harold made indelible contributions to such films as 'The Birds,' 'Spartacus' and 'The Graduate'. Lillian, similarly, has had a hand in many iconic films. This is warm, fascinating documentary that will leave you with a big smile on your face (and a tug at your heart).","user":"nikatnyte","rank":[9,10]}]