[{"title":"I enjoyed this movie","rating":7,"date":"23 February 2020","review":"It showed a lot of potential with the premise, but it spends most of its time hovering between wanting to be a smart character study of how a businessman can become a ruthless gangster through prison, and a violent action/thriller that focuses on gangs and how they operate. By not fully committing to either, some potency is lost. But is it bad? Not at all. In fact, with a captivating central performance of a complex character from Nikolaj Coster-Waldau and enough interesting ideas to hold your attention (particularly when it comes to the effects and inner-workings of a prison), it's still pretty entertaining.","user":"MR_Heraclius","rank":[38,40]},{"title":"Wow, why have I not heard of this film or seen any trailers?!","rating":10,"date":"25 July 2017","review":"I am blown away after watching this masterpiece after hearing a friend talk so highly of it. I asked them what it was about, and they said \"just go watch it\". Well, every now and then a film comes along that will leave an impact on you that will make it hard for you to forget. This film is one of those.<br><br>This story was told with such realism, even the actors did not seem like they were acting. At first I was hesitant when I saw that Nikolaj Coaster-Waldau - Jaime Lannister from Game of Thrones was cast, but wow did he nail his role. His transition from a white collar to jailed convict was perfect. Even Jon Bernthal's acting was great. For that matter, every character was cast perfectly and were very convincing in their roles. <br><br>The writing and screenplay is what truly made this film so great. It's a story told really well, transitioning back and forth at just the right time from back-story to current time, although I wish it had opened with the white-collar scene first, then how it led into the incarceration, and then additional back stories filled in. Had the transitioning not happened, it would have been the best documentary-type film I've ever seen, and felt even more realistic. Nevertheless, I still enjoyed the way the story was told as well as the unpredictability and surprise twists. By the end, I was left wanting more!<br><br>Stunt-man turned writer/director (also both for this film) Ric Roman Waugh did an outstanding job converting the screenplay to a very convincing on-screen masterpiece. <br><br>The cinematography and editing were perfect, but the score could have been a little better.<br><br>I hope that based on the ending, there is at least a part 2 that comes out very soon. It's a well deserved 9.5 rounded up to a 10/10 from me. So now, just go watch it!","user":"TheTopDawgCritic","rank":[265,317]},{"title":"Pleasantly surprised.","rating":10,"date":"11 August 2017","review":"It has been a long time since I wrote a review but this movie deserves my time and attention. I definitely did not expect this movie to touch me in the way that it did.<br><br>The Pros:- -It is so well edited that I had to recheck the run time of the movie when it ended. Two hours flew past like the wind.<br><br>-The acting is great.<br><br>-The plot will reel you in and never let go. This is simple story telling at it's best.<br><br>-The dialogue will never feel boring and the prison scenes are shot in a way that will leave you in awe.<br><br>-The score is one of the best I've heard in recent memory. Reminds me of Sicario, another great film. Some people said it could have been better but I disagree. The score had me wishing I can write music that good for movies. It had a certain twist to it, sounds of flutes or sounds of Arabian music undertones.<br><br><ul><li>The directing? All hail Ric Roman Waugh. I'm going to search for some of his other movies. If half are as half as good as half of this film, I might pass out with glee.</li></ul><br><br>The Cons: There are non I can think of. I wrote this review a few days after seeing the film so that I can write a honest review absent attachment to the film.<br><br>Go see it.","user":"MrSelfPaid","rank":[56,65]}]