[{"title":"\"Reason is the Soul of Law\"","rating":18,"date":"18 April 2019","review":"In the bonus track of the DVD of \"On the Basis of Sex,\" it is revealed that the nephew of Ruth Bader Ginsburg wrote the screenplay for this film biography. One of the strengths of the film is the very intelligent script that finds a way to make potentially dry legal cases and legal jargon intelligible and dramatic.<br><br>It was mentioned as well in the extras track that the film sought to depict \"one of the greatest love stories of all time.\" While this statement may have been an exaggeration based on all the time that Marty and Ruth Ginsburg devoted to their careers rather than the enterprise of love, the film was successful in blending biography with an influential legal case that argued discrimination on the basis of sex to be unconstitutional.<br><br>Armie Hammer performs role of the litigator husband Marty, who is assigned the role traditionally given to long-suffering housewives. Marty cares for the children while Ruth spends long days teaching at Rutgers, where her classes are filled with young, intelligent women with a token male student. In the kitchen, Marty wields a knife like a surgeon as he dutifully chops vegetables while Ruth prepares to take revenge on her sexist male professors from law school.<br><br>The film is worth viewing as a civics lesson. As a liberal attorney and later Supreme Court Justice, Ginsburg is a perfect illustration of how the powerful courts engage in \"legislating from the bench,\" as opposed to strict interpretation of the Constitution. In Ginsburg's argument before Denver's Tenth Circuit Court, the result was a change related to tax law that had ramifications for universal revision of gender equality in the marketplace.<br><br>The phenomenon of the court flexing its muscles demonstrates how our separation of powers work, especially when Congress is foot-dragging in failing to change the law to suit the times, as apparent in this film in gender discrimination. The epigram of \"Reason is the soul of law\" appeared in the courtroom of the Denver Circuit Court, demonstrating that a persuasive legal argument may cause the powerful judges to rethink the application of individual laws.<br><br>The film was crisply directed primarily on location in Montreal. The costumes were effective in evoking the timeframe of the film primarily from the 1950s through the '70s. Felicity Jones was outstanding in the role of Ginsburg. Although her Brooklyn accent wasn't always consistent, she nonetheless captured the poise and determination of Ruth Bader \"Kiki\" Ginsburg. The relationship between Kiki and her feisty daughter Jane was especially well performed.<br><br>From start to finish, Jones delivers a moving performance of the little fireball Kiki Ginsburg. First in her class at Harvard and Columbia law schools, Ginsburg is a demonstration of how one person can truly make a difference in the world. This is a film to be watched and enjoyed by the entire family.","user":"lavatch","rank":[11,11]},{"title":"Brings on Flashbacks","rating":8,"date":"11 January 2019","review":"My wife and I, both professionals about 15 years behind the real RBG, found this movie both fascinating and painful--almost as painful as the negative reviews that object to the Subject on the basis not of sex, but of politics. Too bad the knuckle-draggers can't get past their own biases to enjoy this very good and intellectually engaging movie. And yes, we did find it suspenceful. My wife, too got directed to the typing pool after four years of college and three of grad school, and I hope I was half as supportive as Marty. We thoroughly enjoyed this reminder that even today the arc of history doesn't bend itself, and that the only way to achieve your goals, especially (gasp) equality, is to keep pushing. And we thought the acting was first-rate, and loved the physical mismatch of the tiny Jones and towering Hammer.","user":"theRetiree","rank":[199,273]},{"title":"We loved it!","rating":10,"date":"20 January 2019","review":"Hubby and I are Canadian seniors who just saw this movie and we both loved it. I was fighting back tears at the end and experienced a range of emotions throughout. RBG's indomitable spirit, hers and Marty's commitment to each other, and when she truly and passionately finds her voice - we found it truly inspirational! RBG is obviously a remarkable legal mind and the USA is lucky to have someone of her quality on their Supreme Court.<br><br>One thing though: I don't understand the reviews that slam the movie as being \"political\" all we saw was a lawyer sincerely trying to ensure everyone received the same treatment under the law.<br><br>Long may she serve!","user":"parons-50432","rank":[112,164]}]