[{"title":"A good story that tries to get it right","rating":8,"date":"3 July 2018","review":"When a movie is made about a real life person, it should try to get the story accurate. It seems some criticize this movie because it doesn't pack the action of a James Bond movie. Well, then go watch a James Bond movie! The Bond series was authored by someone who worked in British intelligence (Ian Fleming) and the details of his actual career read much like that of Moe Berg.<br><br>Real spying isn't action packed. It's not supposed to be. A good spy is supposed to blend in so as not to attract attention. I liked this story because it portrayed the action in that way, in the periphery, as part of the plan but not the core part of it.<br><br>Period newspaper articles in the United States, and Moe Berg's biography openly say that Berg's all important mission in Switzerland was to ascertain the probability of Heisenberg's ability to create a Nazi atomic bomb, and if he determined there was a chance, to kill him.<br><br>It would be illogical to put an OSS spy in vicinity of someone like Heisenberg without a plan to assassinate him. The only reason not to is the effect on the scientific community should history record that the United States assassinated Heisenberg despite reasonable knowledge he wasn't able to build the bomb.<br><br>The decision point that Moe Berg faced was one of the most interesting of the entire war. Perhaps the strongest reason against assassination is that Heisenberg was one of several leading Nazi scientists working on the atomic bomb. Killing him likely would have had no more impact than leaving him alive would have. <br><br>Ultimately, post-war analysis of the Nazi's work, by those who led the Manhattan Project, proved that the Nazi program never had a chance of success. This because they never advanced past the theoretical, and even much of their theory was proven wrong by the actual research and development of the American project. So, Berg made the right choice.<br><br>Regardless of that, the Presidential Medal of Freedom was not lightly awarded, not even to OSS spies who operated in neutral territory nor behind the lines. This is another indication that Berg's mission was presented reasonably accurately in this movie, as it shows the extreme risks he took, even as he sought to stay behind the scenes. It took another Nazi spy to recognize Berg's mission.<br><br>In terms of movies that showed the efforts of OSS espionage, this movie might be among the most accurate. If you want the big explosions and body count, again, go watch a Bond movie and enjoy the entertainment. If you want to know what true spy craft looks like, then this movie provides a very good insight.<br><br>It's mainly brains, the ability to think on one's feet, sum up a complex situation quickly, be physically fit enough to meet the demands, and be willing to employ the violence when the mission calls for it, but in a way that the public does not see -- exactly as this movie shows in telling the story of a true American hero. <br><br>Moe Berg perfectly fit all the OSS requirements and this movie showed why.","user":"kenstallings-65346","rank":[94,109]},{"title":"The Difference Between Spy Flicks and Spy Biopics","rating":8,"date":"17 July 2018","review":"What comes to mind when we talk about a spy films? Something like Mission Impossible, James Bond or a little different ones like Salt, Red Sparrow and so on... ?<br><br>Well there is a basic difference between spy fiction and the reality of spy trade-craft. Although the most exciting of the spy thrillers try to capture some of the elements of real world spying but those are mostly technical aspects which are adopted to give these movies a certain credibility; to make them believable to some extent. <br><br>Spy biopics like 'The Catcher Was a Spy' are different from these spy action thrillers because the titular characters are not out there to perform stunts. They are out there to gather real and sensitive information. Information which could decide the fate of a real war and a real man's life. The thrill in this movie comes from the grand scope of the mission and the conversely understated actions of a spy so as to avoid all attention. There are no guns blazing here. <br><br>This is Paul Rudd's classic regular guy performances at it's best. The real life Moe Berg was an anomaly. A sportsman with unexceptional career but a genius mind of sorts. Quite simply a good candidate for a spy in second world war but not of much use afterwards. <br><br>If you are watching this movie for the spy thrills then you might be disappointed. However, if you want to get a glimpse of what an American spy must have found out after talking to people like Werner Heisenberg about the nuclear weapons program of Nazi Germany, then it might be worth it.<br><br>I can compare 'The Catcher was a Spy' to a bit more contemporary spy biopic like 'Snowden'. Although completely different in tone and nature, both these spy biopics have something in common. They are about getting to know the mind of the person. Both these movies try to bring out the inner complexities of these people who are quite literally doing a job that demands them to be secretive, deceptive and yet charming.","user":"organicsocial","rank":[53,62]},{"title":"The spy who never came in from the cold","rating":7,"date":"4 July 2018","review":"Ben Lewin has brought Nicholas Dawidoff 1994 biography about the mysterious Moe Berg.\nAnd Moe Berg remained a mystery until he died.\nHere's food for thought: when you think of Jews in baseball Moe Berg's name doesn't easily come to mind. Hank Grrenberg, yes. Sandy Kofax, for sure. Not Moe Berg who played for the Boston Red Sox during the 20s and the 30s.\n 'The Catcher was a Spy' is a conventional film with a fascinating 'hero': a polyglot, a polymath, born of Eastern Europeans Jews who settled in Harlem. \nAnd yet, Berg, played by a charming Paul Rudd who like his character celebrates tight lip secrecy.\nIt is to Rudd's credit to have learned smatterings of six or seven languages to give body to his character who know many, many more. \nBerg graduated summa laude from Princeton when few Jews could attend. A lawyer from Columbia law who passed the bar before he finished his degree.\nYet baseball was his life as was spying.\nThe script writers give short shift to the spy Berg when he went to Japan with an all-star team that included Babe Ruth. We get the idea Berg dresses up as a Japanese in full kimono, armed with a camera films from the roof of a hospital Tokyo Harbor which had a dual use as a military facility.\nIt would have taken too much to explain the prewar politics and the role of Japan invading Manchuria, testing America's and European empires' turf in Asia.\nSo, although Berg was acting on behalf of a rudimentary US spy agency, Lewin's script white washes it as an act of a patriot.\nThere is a 'love' story, but beneath the surface the film there is a flaw, a 'moral flaw' for the time. Was Berg queer? Probably. A scene of a night visit to the waterfront frequented by men, and non reputable bars frequented soley by men.\nNow to the film: Wild Bill Donovan, founder of the OSS, predecessor to the CIA, recruits Berg after Pearl Harbor. Donovan asks him if he's queer. And without a beat, Rudd replies, 'I know how to keep secrets'; to which Donovan replies, I don't care wo a man f--ks, I'm only interested if he's wants us to win the war'.\nBerg's assignment is to kill Werner Heisenberg, father of the German nuclear bomb. And here the film takes wings...and a high moment of the 'Catcher was a Spy' is when Rudd and Strong play mental chess, to fathom have the Germans the bomb.\nAnd here we see Berg has a dialectical frame of mind, he's willing to spare Heisenberg for an answer that Germany's nuclear project is not very advanced. (Heisenberg is the object of an award winning play \"Copenhagen' that infers Heisenberg purposefully delayed Hitler's plans for a nuclear weapon.) \nThe camera turns all over the place Japan, Italy, New York and Switzerland.\nLong shots, close shots, it runs the full alphabet of film making. \nRudd speaks his languages fairly well with a good accent, but slips briefly when it comes to French.\nThere is nothing dramatically wrong, but the film never plumbs the secretive Moe Berg. At the end we are told Berg never married and spent time in libraries. And yet he never left the CIAin mind and spirit and died the loner he was.","user":"jakob13","rank":[44,54]}]