[{"title":"Nuthin New on the X Files Front","rating":4,"date":"7 January 2018","review":"A mystery thriller with solid acting, solid production (tv-scale) and well, a story that boild down to its core is VERY standard (todays term: generic) and predictable, even the end is a genre cliche par excellence. <br><br>Anyway, if you like such movies with a little X Files taste, you may dare to watch, it won't kill you, but just don't expect anything outstanding like some of those super-positive (fake!?) reviews try to sell you. An okay watch for a rainy afternoon with nothing else to do.","user":"Tweetienator","rank":[30,39]},{"title":"A low budget attempt at creating Invasion of the body snatchers with a dash of creatures resembling from The Pack (2010). 7/10.","rating":7,"date":"6 May 2018","review":"Saw this on a pirated dvd few days back. Been on my radar for a very long time after watching the trailer.\nThe film starts with a driver whose car breaks down in the middle of nowhere n he approaches a farm house which is the only single house in an isolated country side. The place n the house has an eerie vibe to it. Good opening with a sense of dread.\nThe driver tries calling out but nobody responds. He hears some sound from the basement n he steps on a bear trap. He painfully manages to remove his leg but .......\nThis shud b suffice as i want others to watch this well made, low budget horror film. \nMinor drawback is that the film has very less bodycount, tension is lost during the final scenes as the confrontation wasnt that creepy. The star cast is decent. Shawn Ashmore apart from X-men has become more synonym with horror/thriller films. His twin brother's film The Shrine is one of my fav horror film.\nThis film has shades of The Pack (2010) n Blood Creek aka Town Creek, both good horror films. One may also find shades of Invasion of the body snatchers.","user":"Fella_shibby","rank":[35,47]},{"title":"Devil's Gate: Passable entertainment","rating":5,"date":"11 January 2018","review":"Set in the fictional town of Devil's Gate a federal agent teams with a local officer to investigate a missing wife &amp; child. Trouble is their investigation leads them to the unbalanced husband and his trap filled home.<br><br>I expected horror, it was advertised as horror..........it's not really.<br><br>Milo Ventimiglia and Shawn Ashmore star in this interesting but ultimately flawed sci-fi movie which looks great but lacks in too many areas that matter.<br><br>Jonathan Frakes from Next Generation also stars and is particuly good, shame his role was a tad too small.<br><br>I liked the plot I did, even though I'm not a big sci-fi guy I think they did a good enough job here and left it open for potential sequels. Sadly it doesn't flow all too well and something just didn't sit right for me.<br><br>Watchable effort and this may really appeal to some, for me it was a deeply average offering.<br><br>The Good:<br><br>Decent plot<br><br>Jonathan Frakes<br><br>Great opening sequence<br><br>The Bad:<br><br>Poorly paced<br><br>Seriously, stop killing pets in every damn movie<br><br>Things I Learnt From This Movie:<br><br>Milo Ventimiglia plays unhinged characters far too well<br><br>I would happily live in that house, yes I'm weird","user":"Platypuschow","rank":[28,38]}]