[{"title":"So much better than this rating","rating":7,"date":"15 April 2018","review":"I'm gonna keep this spoiler-free as I really want to speak to potential viewers BUT I will mark clearly at the very end some spoilers so that you can avoid it. But I wanted to cover that bit a little.<br><br>So, I gave this a chance despite the low rating as I don't really trust IMDB ratings anymore. I'm really glad I did. This turned out to be a nuanced, complex, and interesting film. I only discovered afterwards that the 22 year old young woman who played the lead also co-wrote it, directed it, and produced and/or wrote most of the songs in it. She is someone to watch as it's so surprising to me that somebody so young could get across such complex ideas.<br><br>What I loved is there is no Bad Guy/Good Guy-everyone is just human, with good qualities and bad. I don't think the trailer conveyed that. It leaves a lot of questions unanswered which some have complained about, but I still find it satisfying as Miss Shephard gave us enough clues that we can fill it in. Many audiences today prefer not to have to think and ponder and use their imagination, they just want stories with simple plots that tell them everything. I found it wonderful. To wrap up, give this a chance!! Especially if you enjoy unusual indie movies.<br><br>SPOILERS NEXT. LOOK AWAY IF YOU DONT WANT TO SEE!<br><br>****<br><br>I loved this ending, I really did. Those last few scenes weave together perfectly. The way it ended with her teacher was fantastic. He showed respect for her and it was obvious on her face that that meant the world to her. She felt valuable. And we are left reminded that even people who make very very poor choices, can have moments of maturity and kindness. Lovely film!","user":"rachellesuzanne","rank":[27,30]},{"title":"I'm looking forward to more from Quinn Shephard","rating":8,"date":"17 February 2018","review":"\"Blame\" treads on some risky territory, but Quinn Shephard handles it with maturity and nuance far beyond her 22 years. The acting is solid from all involved. Kudos to Chris Messina for working with this young filmmaker and portraying a man who is certainly flawed, but is not evil.<br><br>Some reviewers have thrown around the word \"pedophilia\" and I suggest they look up the word in the dictionary. While the relationship between the teacher and the student is inappropriately close, it is mostly an emotional affair between 2 lonely souls.","user":"Paula57","rank":[29,33]},{"title":"damn","rating":9,"date":"3 February 2018","review":"Well, I'm blown away! I was binge-watching trailers on youtube and stumbled on this title. then I decided to go for it because, ya know, seems promising.<br><br>and all I could say now is just, wow. I can't believe the lead actress is also the director and writer and the producer herself. like, this is great stuff. and she's still so young. I'm finding myself thoroughly enjoying this movie.<br><br>really looking forward to another Shepherd works in the future.","user":"deadwishes","rank":[19,23]}]