[{"title":"Breaks away from the formula","rating":22,"date":"22 March 2017","review":"This film tells the story of a young woman who is forced to drop out of school because of financial problem. She continues to pursue her passion, and organises a one night only hip hop version of Romeo and Juliet in the local theatre.<br><br>\"Honey 3: Dare to Dance\" surprises me a lot, because it doesn't follow the typical formula of the characters taking part in a major dance competition. Rivalry takes place between the two leading ladies, but there is little rivalry between groups. Indeed the usual rivalry takes a back seat here, and people actually cooperate, which is a refreshing change. It is also interesting to see a hip hop Shakespearean play. I like this film because it breaks away from the usual formula.","user":"Gordon-11","rank":[3,3]},{"title":"All About Dance - Not Much Of A Story","rating":4,"date":"10 September 2016","review":"Dancing is the prime thing of the film, not much of a plot though. <br><br>While watching the film its feel like someone amateur neighborhood kids is trying to make a movie as an experiment or a summer project. I will not say that the acting was terrible but the thing is nothing about this movie was professional- not the acting or the camera work. And the story was too predictable without any twist or turns, also there was no story build up at all. Things were happening as script writer wants no correlation between the scenes.<br><br>One thing happened a lot in film and it was dancing and the sad part of it was most of the dancing was out of context. Sadly I was not impressed by the dancing either.<br><br>To Sum It Up : Not Recommended.","user":"niaz_islam","rank":[7,12]},{"title":"I simply wasted my time and money on this movie.","rating":2,"date":"11 August 2017","review":"This has to be the worst movie I have ever watched in terms of story-line and casting. It infuriated me so much that I just had to write this review whereas I have never seen the need of doing one before.<br><br>The story-line is such a cliché! What was unique apart from the Romeo and Juliet drift?? What dance moves were different whereas this is a movie released in 2017? All the step-up movies beat this movie hands down.<br><br>Secondly, I know this will make me sound biased but how is the movie based in Africa and the main cast is full of Americans? Never have I ever heard of Americans studying in Africa in all those numbers, maybe just one-off cases of student exchange programs but not an entire 30-squad dance crew.<br><br>Africa is full of amazing dancers and our African music is just as amazing. This would have been the movie's selling and unique point. Incorporating African music and dances is what would have made this dance movie different from the rest.<br><br>Next time you shoot and produce a movie in Africa, duly note that there is mad talent here and we want our stories told as a representation of who we are and not false representation of us being the same as Westerners.<br><br>I'm out. Stay Woke!","user":"danqueezy","rank":[6,10]}]