[{"title":"Not a great film, I'm afraid.","rating":3,"date":"17 March 2018","review":"Yes, the performances are decent (Sophie Turner acts better than she even did in Game Of Thrones and Dylan Mcdermott shows, once again, that he's a hugely under-rated actor) but it's rather slow and uninvolving and the 'big twist' is so blindingly obvious...","user":"kevcoe","rank":[30,40]},{"title":"Kept Me Engaged Throughout But Premise is Preposterous","rating":6,"date":"30 May 2018","review":"Looks like I'm in the minority here and I know it's not for everyone, but I did find this indie rather engaging and clever, that is if you don't think about the premise too much which is preposterous for sure.<br><br>Why is a very sexy teen (Sophie Turner), who has just moved in to a motel, coming on to her new neighbor (Dylan McDermott), who is much older than her and quite shy and lonely, with his best friends being two pet tortoises?<br><br>As the movie progressed, I pretty much figured out why, but that didn't prepare me for its most violent finale. I found this film kept me interested throughout its duration and wondering where it all was going to end up.<br><br>To note, there were no subtitles on my DVD copy obtained at Redbox, but I was able to access them through the closed captioned option on my remote.","user":"larrys3","rank":[11,14]},{"title":"\"There is no such thing as justice, all the best that we can hope for is revenge.\"","rating":8,"date":"5 May 2018","review":"(Quote by Emilie Autumn)<br><br>Honestly, I don't understand why this movie got such negative reviews, I full-heartedly enjoyed it, from start to finish. I feel this film has been wrongfully reviewed and, as such, decided to dedicate it my first ever movie review, so understand that I am not a Movie Critic or connoisseur, I merely enjoy them.<br><br>To me, watching this movie was very much like reading a book: the passing was excellent, the introduction of the characters was fluid, the environments were scarce, yes, but they were well structured in the narrative, all good things that came together with a very curious story.<br><br>To put it in simple words, the story surrounds Hank, a lone man who likes fishing, and only wishes to live a quiet life with his two tortoises. The only people he interacts with are some of his neighbours, an oldish couple Gordie and Martha, and Romero, only because they talk to him and try to open him up to the community. \nHanks's dull life transforms when Josie, a transplanted high school student, rents the house right across from his, and enters his life very suddenly, shedding light all around. As the story progresses, you learn more about Hank and the people in his life, and how high school kids will always be insufferable, and how strange human relationships are, and then... The twist!\nYou see, there is a reason why Hank is the way he is, there is a reason why Josie went to that Southern town, and there is a reason I really enjoyed this movie.<br><br>I will not spoil it for any of you because I feel I don't need to in order for you, the reader, to be interested in this movie, but I will tell you that I was NOT expecting that twist, damn! It was phenomenal! What I thought the story was about, it derailed me and left me speechless, I was completely blown away, something that doesn't happen in most movies nowadays. Maybe I'm not as smart as the other reviewers, but I was pleasantly surprised with the ending.\nAnd the actors were terrifying in their performances, they lived their characters's stories so well, Sophie Turner and Dylan McDermott were perfect for their role, as well as all the other minor characters, I specially liked Robin Bartlett character, Martha.<br><br>In short, kudos to all involved with the making of this movie, I truly enjoyed it, I really did. Thank you.\n\"But then, why only rate it eight stars?\" Well, although I really enjoyed the story and the characters, there were minor things that bugged me and although the ending was astounding I felt it was rushed, a bit. And I would have preferred if it had been Josie talking in the end instead of Hank, I think it would have suited the story best, for various reasons (check the \"No Spoilers\" tag, watch the movie and tell me if I'm wrong!).<br><br>Give this movie a chance, please, if you like good storytelling and complex characters. I'm telling you right now, you will enjoy this.","user":"Karmylla","rank":[27,41]}]