[{"title":"Great cast, pretty awful movie","rating":4,"date":"21 October 2017","review":"I hated to see such great actors coming together in a pretty bad movie. The plot was silly and some of the characters were overdone and equally silly (Poppy). The Elton cameo was good for the first scene then was way over done. So many things wrong after a pretty good first movie. Please don't make another one.","user":"dziemke","rank":[261,375]},{"title":"Lame, Forced comedy fills this instantly forgettable sequel","rating":3,"date":"24 September 2017","review":"Why is it that so many fun, inspired originals are followed by such lame, poorly written (and juvenile) sequels? <br><br>The first one was a hugely entertaining spy flick with some comedy in it to be sure, but this one puts the accent on the comedy, and is impossible to take seriously whatsoever. This would not have really been an issue if it was genuinely funny; but instead of wit and clever wordplay, we are 'treated' to an abundance of uninspired, vulgar and childish humour. Elton John repeatedly dropping the F-Bomb (Please, don't go on), a attractive woman asking someone to urinate on her (I can't stop laughing), or an old man stating that he has just soiled himself (Stop, my sides are hurting). Actually, my head hurt after sitting through 141 minutes of this. (Well over half an hour too long). I recommend waiting for Netflix.","user":"franciswaterson","rank":[265,386]},{"title":"SILLY SEQUEL: Here are the 10 Top Reasons to watch this crap:","rating":26,"date":"26 November 2017","review":"SILLY SEQUEL: Here are the 10 Top Reasons to go and watch this crap:<br><br>(1). You want to see 5 Oscar winning people to the lowest point of their career.<br><br>(2). You want to hear Elton John saying constantly \"F-ck You\".<br><br>(3). You want to see a girl telling to a guy that she wants to pee on her.<br><br>(4). You want to see 2 people turn to ground meat.<br><br>(5). You want to see a man eating a hamburger made from human meat.<br><br>(6). You are enjoying lame green screen effects and CGI.<br><br>(7). You want to see another spy plot based on a deadly virus.<br><br>(8). You are enjoying silly, kindergarten jokes.<br><br>(9). You want to experience first hand the \"Curse of the Sequels\".<br><br>(10). You like fake butterflies.<br><br>Anyway, despite the (manipulated by the studio?) 7.2 here in IMDb, the consensus is that this movie is terrible.<br><br>It has nothing to do with the original, and is just a generic and forgettable action movie, that should probably wait to see on TV, next year.","user":"Dr_Sagan","rank":[251,371]}]