[{"title":"It's harmless, but funny enough to keep, at least myself, entertained.","rating":7,"date":"6 April 2017","review":"A small, little indie comedy about a father who has to team up with his daughter's ex-boyfriend in order to find out where she is after it appears to be missing. J.K. Simmons plays the smart ass, witty father; Emile Hirsch takes the role of the \"down on his luck\", well intentioned but simple ex-boyfriend. Both of which are phenomenal actors and they do fine work here, but I feel as though their talents were almost wasted in this movie. Do not get me wrong however, I thought that this was a decent movie and I do recommend it as a light movie that you could pop on in the afternoon or early evening if you wanted to kill some time. However, I felt as though these two actors should be given much more challenging material than something like this which doesn't supply much depth in terms of character. Putting that aside though, I thought they did a good job and probably kept me from declaring this movie as something forgettable. <br><br>The film has some laughs and does capture the awkward moments of their circumstance very well without falling into \"Meet the Parents\" styled humor territory. It does have a secondary character, played by Taran Killam, that after a while I found to be slightly grating but I never found it to ever completely break the movie. The two leads run into some quirky characters and cumbersome scenarios that kept me entertained. I should clarify though that this movie isn't quite like most shenanigans movies where the characters go through their personal arches over the course of a single night a la \"Adventures in Babysitting\", \"License to Drive\", \"Hollywood Knights\", or \"Stretch\". This plays the shenanigans a tad bit more low-key and realistic rather than completely over-the-top or all that wacky. It still does show the leads run into a pickle or two and have a few colorful characters along the way; and they do have their own character arches that they go through which are done well enough here.<br><br>All around, I thought that this was a passably entertaining movie with a good moral or two. Has a good amount of chuckles. Good actors that may have actually elevated the film to be as decent as it is. It's well made, the narrative is relatively predictable but I like that it never makes anyone the villain when it so easily could have in some cases. So if you feel like watching a quirky, innocent comedy that will entertain you for an hour and a half then I think this will do.","user":"johnplocar","rank":[28,33]},{"title":"A pretty nice movie","rating":7,"date":"27 March 2017","review":"A nice movie to watch, at first it was a bit plain but then it got really funny.<br><br>The actors are good, I did not get bored at any point. Maybe the first 10 minutes did not have much action but then everything changed.<br><br>It s funny but it also makes you feel like you have been there, in a similar situation.<br><br>It s more of a laid-back movie, not one with a complex scenario but it wasn't a waste of time. Made me smile and made my day better.","user":"vladmirona","rank":[31,39]},{"title":"Great adventure, loved this movie!","rating":9,"date":"10 October 2017","review":"I loved this movie. I could see why the dad didn't like the boyfriend in the beginning. And then it made me want to find out how they dealt with one another through the night. This movie got shitty ratings on rotten tomatoes but like all good movies it had my attention from start to finish. It was a fun adventure and I loved it the entire time. I rented a movie yesterday with a 90% rating and I couldn't even finish it so the current rating system has to change. I loved this movie, the actors, the story, and it made me feel awesome. That should be all that matters. Death to Rotten Tomatoes!!!","user":"shaywillandben","rank":[10,13]}]