[{"title":"Entertaining.","rating":8,"date":"19 April 2018","review":"I was not certain as to what I was about to watch, but I am pleased with having done so. Why such a positive rating? I enjoyed not only the script, but the acting.<br><br>Taylor John Smith is excellent as a young and budding actor. His facial expressions are extraordinary, projecting extreme joy to extreme hurt and angst. Of course, the end was predictable. I mean, how could it have ended any other way?<br><br>The family challenges, obstacles and dynamics are far more common in America today than some might want or hope to believe. In fact, I surmise that similar family \"quakes\" have occurred in every generation and will continue well into the future.","user":"fiercecelt","rank":[7,7]},{"title":"Many Wolves to Consider","rating":8,"date":"6 March 2017","review":"The title: Wolves. 1. The name of a high school basketball team with a star player up for college recruitment. 2. Predators that viciously exploit human addictions. 3. Pseudo Protectors that devour our hopes and dreams.<br><br>There are many wolves in this film, feeding in subtle and not so subtle ways.<br><br>It's a film that shows us how easily our human weaknesses can destroy all that we love. Yet, even when redemption is possible, we also see how some are beyond redemption. Such is the role of Michael Shannon as the father- who is extremely good at playing the wolf in sheep's clothing.<br><br>The plot has some cliché moments and the ending is wrapped up far too neatly for my liking however overall it's a very good film.<br><br>Considering what's out there in theatres at the moment, Wolves is top on my watch list.","user":"soundinfinite-791-948065","rank":[7,8]},{"title":"Execution defines character","rating":7,"date":"23 July 2017","review":"Anthony (Taylor John Smith) attends St. Anthony's diverse school in NYC. He is the star of the basketball team and is looking at attending Cornell. His father is a college professor (Michael Shannon) with minor alcohol and major gambling issues which weighs on Anthony's tuition, etc. Anthony's problems compound as the film goes on until it gets to the point he has to step up and go above and beyond.<br><br>This is a high school basketball drama. The film uses the N-word in a less than racist, and causal manner, that does not go unnoticed and corrected. I thought Taylor John Smith was less compelling in his star role than his support cast. Michael Shannon provided us with a complex antagonist, a role that sometimes take center court and front of the DVD cover.<br><br>Guide: F-word. Implied sex. No nudity.","user":"nogodnomasters","rank":[2,3]}]