[{"title":"Best viewed as Forbidden Kingdom -- Lite","rating":7,"date":"27 December 2016","review":"The word on the street was that this was a riff on one of my all-time favorite films, Forbidden Kingdom 2008, so I could not resist checking it out.<br><br>(Word to the wise, if you have not already seen FK, and you like MMA and/or Wushu and/or Fantasy and/or Adventure, check it out. FK has humble beginnings, features two of the greatest cinematic martial artists of all time - Jackie Chan and Jet Li -- a killer script, great scenery, and solid performances. Some reviewers, including this one, think it is one of the best of its kind ever done.) <br><br>Let's start with what Warriors Gate was intended to be, and work from that.<br><br>The production team clearly thought they would \"improve\" on FK by adding more \"teen humor.\" Presumably they also felt this would more than compensate for the film's considerably lighter \"feel\" and the awkward void formed by not having ANY famous film martial artists at all.<br><br>Also, Forbidden Kingdom had a certain edge of malice and unpredictability in the script which, oddly, only increased its impact and its fan base. This film lacks those features as well and, on its best day in its best suit, comes across more as \"Forbidden Kingdom Lite,\" or perhaps even a Disney knockoff of the original.<br><br>Which is not to say it is not worth a watch. A lot of effort was put into the humor aspect (as explained above) and this does keep things moving along.<br><br>(For example -- if you are film buff, you will remember fondly the famous tag line from Airplane 1980 - \"Don't call me Shirley\" which became a sort of iconic inside joke for years afterwards. This script contains a number of attempts to mimic that sort of dialog, my favorite being -- \"KILL HIM! -- slashing noise -- \"NO, NOT HIM. HIM.\") <br><br>Bottom Line: One hour and 45 minutes of reasonable entertainment. However, it suffers from the \"curse\" common to all knock-offs. Unless you see the original, you will never know what you are missing.","user":"A_Different_Drummer","rank":[55,74]},{"title":"mindless entertainment","rating":5,"date":"20 January 2017","review":"A bit funny, but trying too hard only to give us a mindless entertainment. With the presence of a very good actor Dave Bautista and an action-packed trailer, it's very unfortunate to get what seems to be a spoiled food out of a sought after delicacy.The cast has a lot of potentials however they were all murdered by poor scripting, and exaggerated acting by some actors.The plot is somehow interesting, to see some kind of a gamer turned to be the actual hero himself, but only turned out to be a cheesy fantasy action film that only exists if there's a beautiful woman to be saved.Another downside of the film were its special effects, where it seems to forget that it's already 2000's and we are in the era where visual effects are one of the most significant factors when it comes to fantasy films.Anyway, despite these disadvantages, the movie delivered decent action sequences (martial arts and sword fights) and a cool bike chase scene.","user":"nhojnivra","rank":[16,21]},{"title":"A funny, entertaining, lighthearted, original movie","rating":8,"date":"19 August 2017","review":"I saw previews for this movie and it originally caught my interest but I came with no high hopes of it being significantly good. While it's not the most amazing movie I've seen to date, it is an original story that includes martial art elements, comedy, action and overall fun. I thought the fight scenes were very well choreographed and they threw in some lol moments throughout the movie to keep the tone light and easy going while still having enough action to keep the pace going. I was very surprised at how much I enjoyed this movie. The lead actress is also stunningly beautiful and the main kid actor did a very good job holding his own with actors like Dave Batista also in the movie. Overall, a fun, lighthearted, interesting and original movie.","user":"dawgsfan92","rank":[7,8]}]