[{"title":"Bad theology but not entirely lacking in entertainment","rating":28,"date":"28 August 2017","review":"Although I don't agree with the premise of the theology of this film, I thought it was well made for what it was and an entertaining story. I understand that some people who don't believe in God will come up with stuff about how terrible it is because they don't get it, but if you are willing to watch it without that kind of bias, you might get into the story and think it is worth your time somewhat, in spite of the main story line being representative of an American made theology.","user":"rkevinwilliams","rank":[9,13]},{"title":"Prepare to waste 90 minutes from your life.","rating":3,"date":"9 March 2017","review":"One of the most boring movies I have watched. The story, the plot and the characters, nothing is special about it. Maybe the first few minutes where you see cars crashing suddenly and people disappearing, you can get excited, but after that it is not up to the expectations. The movie has some glitches and could have been written better. Finally, the whole idea of the movie doesn't really make sense.","user":"waelabboud-74845","rank":[14,23]},{"title":"My God (literally)","rating":1,"date":"27 November 2016","review":"Not with high hopes I watched this movie expecting some typical sy-fy channel level 90 minutes of mediocrity to pass the time. What I didn't expect was some a bible thumping story line that was so clearly funded by some right wing propagandists that would become a an hour and a half Christianity PSA. Now this isn't to take away from the amateur acting or the college level production values. This film is just all around terrible. So much so that after nearly 500 reviews on IMDb, I confirmed my email just to write a review for this film alone. I can enjoy a campy film for it's authenticity to be cheesy, but this one dressed up like a scifi thriller only to be a rapture story with a meaningless cliff hanger, no real resolution or climax I had no choice but to give it one star.","user":"ahorgan100","rank":[23,42]}]