[{"title":"A Stretched Out Story with Many Wrong Turns.","rating":4,"date":"5 March 2020","review":"There's a limit to how scary grass and being lost can be! In the Tall Grass is about a brother and a sister decide to help a little kid find his way back after calling them for help, they decide to go into a field of tall grass yet soon they discover that the grass field is not what it seems and there may be no way out.<br><br>The movie start interesting but falls short by its repetitive nature as you find yourself by the middle of the movie - as you get used to the sequence - stuck in a story loop that repeats itself too much that it gets frustratingly. The poor casting choices of the lead characters (the siblings and the boyfriend) who can barley act adds to this frustration which leads you to simply lose interest.<br><br>Clearly the keys of the plot could've be summed in half the duration of the movie and still delivers. It's an example of how an interesting idea can be ruined by dragging the story for too long.","user":"Impartial-Critic","rank":[35,38]},{"title":"The Tall Grass, The Giant Rick,The Church= The Redeemer","rating":8,"date":"6 October 2019","review":"This is one of those movies, if you fail to miss a small scene, then it will really confuse the hell out of you. My understanding of this movie is that the big giant rock in the centre of the field is linked to the church. In the bible, the New Testament the redemption word group is used to refer both to deliverance from sin and to freedom from captivity. The two main characters story is that Becky is leaving to give her child away to another family and leaving her husband. When they both hear a voice of a child calling for help. Both go into the field searching for him.<br><br>What happens next they are all lost and searching for one another. Why I say the Rock is the redeemer, you touch it and it shows you the way back out? Simple- Ross has touched it and instead he turned into a greed man, who wanted nothing but to keep selling the idea of touching the rock is amazing- resembling a liar of a salesman; at the beginning of the story you see him on the phone talking to a member of staff regarding being untruthful, deceptive. That's why he would never show others the way around as he just wanted other to buy the idea of touching the rock.<br><br>Tobin touched it; he was a child and said he knew the way out at the beginning- told Travis to touch it but he didn't. Tobin was free of sin and that's why nothing had happened to him.<br><br>Becky; didn't touch the rock but the rock showed her a big lesson- of not giving the child away by feeding her the child, one flesh.<br><br>Cal touched it; he Continued to die every-time, why because loved his sister more then he should, he kept telling her to continue the journey it giving your child away and leaving the father, he pushed Travis- attempted murder and continued to sin.<br><br>Travis touching the rock- killed Ross first who was a man of sin to save himself and the rest. By touching the rock he did find the way out, sent the child back to stop Becky and Cal every entering the grass and stopping Travis every coming to search for them. The boy turns up in the church a person free of sin to send a message to Becky that taking the child away from his father is a bad idea, so she decided to return and stop by the police station to help the child as his parents are dead, dad being a sinner and killing his wife.<br><br>It is a moving maze with only one way out, touch the rock and if you are sin free you are redeemed back into the church.","user":"thebahrams","rank":[436,537]},{"title":"For those confused....","rating":7,"date":"7 October 2019","review":"Basically 6 people are stuck in a time loop that lures them into a field. For those that watched this thinking what the hell did i watch, i'm so confused, the best i can offer is this.<br><br>The grass is in front of the church, thus the grass is pergatory, the rock is the is the judge of who is a sinner and who is not. The grass is punishing you for your sins, and then only releasing those that pass its judgement.<br><br>By travis admitting his sins he was granted a second chance at life and saved along with those he loved. Tobin is either an innocent and was spared, or he was kept there also after being judged by the stone as his parents talk about how he is badly behaved early on. The church is where those that absolve their sins are sent to move on. Tobin's dad continued to sin whilst being judged, and is doomed to live in pergatory. Animals arent supposed to have souls in some religions, and thus couldn't leave. Tobin's mum isnt explained but i assume she too failed the sinning test since she also can't leave. The tree people are tortured souls unable to move on due to continued sin, and are driven mad from eating grass seeds for sustainance. Becky is forced to eat her child as punishment for considering aborting it and having it out of wedlock.<br><br>The cars at the church of the cars of those that didnt past the test in the field saying this has been happening for ages and is unstoppable. The dude crushing his wife's head?!! No idea, Im guessing perhaps a glimmer of the suffering that will await you if you are judged to be evil?\nThe phone call to herself was to show her you can't change fate, this has been planned all along and is not stoppable. The scenes with multiple bodies of themselves dead is to show how many times they have failed and force them to see or a punishment for each sin.<br><br>All i got. If I'm wrong, someone please explain it!!!","user":"Craigelink","rank":[210,263]}]