[{"title":"Dark Humor About A Truly Dark And Humorless Time","rating":9,"date":"1 April 2018","review":"This is an excellent film. And its treatment of the Stalin Era of the Soviet Union is both darkly humorous and actually very unflinching in its depicting the monsters and their monstrosities for what they were.<br><br>I was worried that, in an attempt to extract humor from the situation that they might've glossed over just how monstrous the key characters actually were. To Iannucci and Schneider's credit however, there was absolutely no glossing over at all. Beria, for instance, is portrayed as every bit the monster in human form that he was - this, even as that portrayal is also made darkly and delightfully humorous at times.<br><br>The whole cast played their parts well and played them \"straight\" - which only heightened the humor and the horror of what life was like under Stalin in the Soviet Union. Even the nominal \"hero\" of the tale, Nakita Khrushchev, is realistically portrayed as being just as conniving and callous and power hungry as everyone else. Buscemi would seem an odd choice for that particular role but he pulls it off with style and excellence. So too does Simon Russell Beale in his portrayal of Beria. <br><br>This is a nicely done film with excellent production values, a great script, fine acting, excellent pacing, and a compelling tale that is well told.<br><br>I highly recommend it!","user":"thorr97","rank":[168,192]},{"title":"How difficult to make a parody built around the death of one of the worst men to ever live...","rating":8,"date":"2 November 2019","review":"... and yet this film does just that. It revolves around the power struggle that occurs at the death of Stalin in 1953, a man who had an iron grip on Russia for 30 years and enforced his will with terror, often randomly.<br><br>So when the sycophants who surround him are suddenly bereft of his soul, they are all jockeying for power while finding it very difficult to do the one thing that would get you tortured and killed as long as they can remember - independent thinking, or even making suggestions for that matter. A simple show of hands vote becomes a hilarious demonstration of group think. They all have a collective case of Stockholm Syndrome when it comes to Stalin, still afraid of a man who is dead.<br><br>Jeffrey Tambor is doing his character Hank from the 90s sitcom \"The Larry Sanders Show\", and Steve Buschemi, as Nikita Khrushchev, doesn't look like any picture of Khrushchev that I ever saw at any point in his life. Plus he's basically doing his \"funny looking guy\" schtick from Fargo, and yet it all works.<br><br>When Lavrenti Beria, head of the secret police and probably responsible for untold terrors, gently tells Stalin's daughter that she needs to leave Russia because people who are strange like she is don't live very long, it is practically a sweet intimate moment that runs counter to everything we know about the guy.<br><br>This is a bleak yet hilarious comedy built around real events. I'd highly recommend it.","user":"AlsExGal","rank":[17,19]},{"title":"Gallows humour with hollow laughs","rating":8,"date":"21 October 2017","review":"There's no avoiding truths rapidly passed over in this depiction of chaos following the death of an evil dictator. Stalin had charm...to those who were not his subjects and were never a threat to his authority. He fooled many so-called intellectuals in the West but everyone around him knew the truth, and, most managed to tip-toe over eggshells in order to stay alive. To thrive in such an environment requires a certain kind of callous ruthlessness...perfectly depicted with suitable crass humour here. The cast is perfectly chosen...each very accomplished actor adding their particular star dust. There's more than a single sittings' content in this film which deserves another viewing. Impressive and engaging story-telling based on real life events. Bravo all.","user":"PipAndSqueak","rank":[160,221]}]