[{"title":"Very impressive","rating":9,"date":"15 September 2018","review":"So glad this came up in the Netflix recommended section. Anyone interested in modern European history should watch it. Acting and direction throughout was excellent I thought, it really did seem like we were witnessing wartime Amsterdam and all the hopes and fears of the brave people who resisted a brutal foreign occupation. Not for the faint hearted either. The movie gives a very realistic &amp; sometimes graphic account of how a primarily civilian resistance movement not only has to outfox military intelligence, but also the craven collaborators amongst the ranks of their fellow citizens, and the consequences of such acts of heroism.","user":"rugbysharks","rank":[46,49]},{"title":"Very Good Story","rating":7,"date":"12 September 2018","review":"Hey folks,<br><br>As an American and unable to speak any language other than English, I rarely watch any foreign films. The story itself did seem interesting, and when I found the film on Netflix was in English and included subtitles, I thought I would at least give it ten minutes or so to see if I would find it worth watching. <br><br>While I knew none of the actors or others who produced this film, I did find the story to be quite captivating even though I did not understand the banking mechanics involved in financing the resistance. The acting was very good in my opinion, and I found I was able to navigate the story well enough with the English speech and subtitles. <br><br>If one is expecting an action-adventure film, one would be better off skipping this film. On the other hand, if one can appreciate a well paced film that tells a very good story, then this film does that quite well. I have always loved a good story.<br><br>Best wishes,\nDave Wile","user":"davidwile","rank":[46,50]},{"title":"Impressive Cast and Cinematography","rating":9,"date":"18 September 2018","review":"Outstanding job, Cast! I felt it was a great ensemble effort. To the film crew and set designers, beautiful work.\nI don't speak Dutch and enjoyed the native language and would have been disappointed to watch it in English. Turn on the subtitles and enjoy the authenticity of the real actors and not the voice-overs. \nNot understanding those who gave this film such low ratings. You might find that a great story, like this one, has to develop slowly and intently in order to convey the depth of the script and story line. The pace was beautifully executed. This film delivered perfectly. \nThank you Netflix for bringing this to the American screen. A story that needed to be shared.","user":"pbottjen","rank":[16,17]}]