[{"title":"Underwhelming housewife, underwhelming movie...","rating":2,"date":"27 April 2019","review":"Nothing stands out, mediocre everything, starting with the story. The actors were not bad, perhaps with a better story and directing they might show more talent. Directing reflected the overall tone- dark to hide inefficiencies, muted conflicts and watered down sex, mischievousness nought.\nDidn't care much about this movie that ended with a yawn.","user":"Call-Me-Mr-Smith","rank":[5,5]},{"title":"Do yourself a favor. Stay away from this stinker!","rating":1,"date":"27 June 2019","review":"Terrible acting. High score rating is obviously from friends of the cast and crew. If you like to watch drug abusing strippers suffering from paranoia and other mental illness this movie fits you. Trust me when I say it's a wast of time, watching paint dry is more interesting.","user":"psxexperten","rank":[3,3]},{"title":"A case study in sexual repression","rating":1,"date":"19 April 2019","review":"This movie is a frat boy's wet dream. It begins with 45 minutes ominously (LOL) leading up to a threesome, highlighting just how understanding and hardworking this woman's husband is. Then the big bad pot smoking stripper comes along. Gasp, they have a threesome, and it's the lamest sex scene in cinema since the Cider House Rules. The scene is BARELY over when the sexual repression and shame kicks in. Like literally they can't stop talking about it. Then, for no reason whatsoever, the hot stripper professes her unyielding love to the lame wife. Even the actress didn't believe her own lines. The faithful wife turns her down, proclaiming her LOVE for her HUSBAND GEEZ (who she's been bored with like 90% of the movie let's be honest.) Then the husband gets to tell the big bad lesbian off. \"It's OVER\" he says \"She's pregnant\" placing one of Eddie Izzards flags down in her womb like a British soldier. Because, obviously, nothing automatically ends an affair like semen. Then, by the POWER OF CASUAL CONTACT WITH HIS PENIS and getting punched by a bad guy, the stripper not only leaves her career and drugs behind, but reforms her life and moves in with her FATHER! Yuck. Another boring homophobic movie by a guy with a lesbian fetish (who can safely explore said fetish only if he can dominate the big bad lesbian in the end because BABIES.) I recommend this movie to the sexually repressed and successfully gender subjugated who can only handle a flash of panties and neon lit bikinis before their sex hating deity catches onto what's going on beneath their blanket.","user":"aprilme","rank":[6,9]}]