[{"title":"Equal parts funny and harrowing; an enjoyable \"true story\"","rating":7,"date":"10 April 2019","review":"Authenticity is perhaps the most important currency in music. Bands who can legitimately say \"it's all about the music\" and actually back that claim up are automatically head and shoulders above their less authentic rivals, who may sing a good game, but who live a very different life. Think of how fake <a href=\"/name/nm1655276/\">Guns N' Roses</a> made the glam metal bands of the 80s look. Think of how pampered <a href=\"/name/nm1110321/\">Nirvana</a> made Guns N' Roses look only a few years later. With this in mind, Lords of Chaos looks at late 80s/early 90s Norwegian black metal, and asks, \"was its extreme image authentic or manufactured\".<br><br>Adapted from <a href=\"/name/nm9657667/\">Michael Moynihan</a> and <a href=\"/name/nm7520458/\">Didrik Søderlind</a>'s 1998 book, written for the screen by <a href=\"/name/nm0536370/\">Dennis Magnusson</a> and <a href=\"/name/nm0959774/\">Jonas Åkerlund</a>, and directed by Åkerlund, the film depicts black metallers as fostering an image of a cult-like group of militant anti-establishment Satanists who practised human sacrifices, championed suicide, and advocated anti-Christian violence. Behind the scenes, however, most of its adherents knew such declarations were simply marketing, not to be taken literally. Lords of Chaos is about what happened when some black metallers took them very literally, leading to suicide, arson, and murder. Equal parts darkly funny and unflinchingly disturbing, Åkerlund's film never takes the scene as seriously as it takes itself, and, depending on your perspective, that's either its greatest strength or its most egregious failing.<br><br>Oslo, 1987; it is three years since Øystein \"Euronymous\" Aarseth (an excellent <a href=\"/name/nm0191412/\">Rory Culkin</a>) established his band, Mayhem, determined to create a new subgenre of \"true Norwegian black metal\". The band has met with little success thus far, but that changes when they hire Pelle \"Dead\" Ohlin (a superb <a href=\"/name/nm5451410/\">Jack Kilmer</a>) as lead singer. Showing self-destructive tendencies from the start, as time passes, his behaviour becomes more erratic (cutting himself at gigs and spraying blood into the crowd, sniffing from a bag containing a dead bird before performances), ultimately resulting in his suicide. Meanwhile, Euronymous meets awkward fan Kristian \"Varg\" Vikernes (a very creepy <a href=\"/name/nm1710309/\">Emory Cohen</a>), on whom he initially looks down, but who he soon welcomes into the fold. However, as time goes on, and Varg becomes more and more extreme, a dangerous power struggle between himself and Euronymous slowly develops.<br><br>An extreme offshoot of thrash metal and death metal, black metal was generally derided by the mainstream and criticised for its misogyny, racism, homophobia, and glamorisation of suicide. It was also seen as both anti-semitic and anti-Christian, and a number of practitioners have been accused of neo-Nazism and hate speech. Often wearing \"corpse paint\" and flaunting Satanic iconography, musical integrity was paramount, and to remain a true black metaller, one couldn't court mainstream success.<br><br>One of the film's most salient aspects is that black metal wasn't simply a genre of music; it was a way of life. However, Åkerlund (himself a co-founder of black metal band <a href=\"/name/nm9656934/\">Bathory</a>) isn't especially interested in valorising the movement, with the majority of the film designed to chip away at the image of black metallers as evil incarnate. In this sense, the story is primarily about image and marketing. Euronymous isn't an especially gifted musician, but he is an astute businessman, particularly when it comes to selling himself, knowing exactly how to cultivate the reputation he wants - a picture of a corpse here, some \"evil\" lyrics there, and soon the mainstream is in a frenzy and doing his work for him. Proto-outrage culture, if you will. Whereas some of the others saw evil in a literal sense, he saw it in terms of branding. Nowhere is this clearer than when he finds Dead's body, taking pictures which he would subsequently use as an album cover to bolster the band's reputation as extreme.<br><br>It's in relation to the manufactured nature of black metal's evil that much of the film's ironic humour is to be found. Euronymous and Dead's answering machine message is a growled, \"we can't come to the phone right now because we're too busy sacrificing children\". Describing their style, Euronymous proudly declares, \"when people hear our music, we want them to commit suicide.\" Later on, he admits, \"all this evil and dark crap was supposed to be fun.\" One member of Mayhem is shown riding a pushbike. Euronymous has to borrow his parents' car to get anywhere (it's difficult to be taken seriously as a purveyor of terror when you're in your dad's Volvo). An impassioned speech about the nature of black metal is interrupted by someone being told their kebab is ready. Euronymous complains of Christianity, \"they're oppressing us with their kindness and their goodness\". And in easily the funniest scene in the film, as Euronymous and Varg wait outside a recording studio, a group of elderly women emerge, with Euronymous running up to them and growling, \"Hail Satan!\"<br><br>Where the film treats its subjects more seriously is in relation to things such as Dead's depression, which ultimately results in his suicide, and the misogyny of virtually every member of the movement (it's telling that the first time we see Varg exert authority, it's in a scene where he forcefully tells (fictional) groupie Ann-Marit (<a href=\"/name/nm3650037/\">Sky Ferreira</a>) to take off her clothes). In relation to Dead, when he cuts himself on stage for the first time, the camera shows us he is utterly unmoved, suggesting he doesn't even feel the pain anymore (when he is first introduced, there is a shot showing scars up and down both arms). As he sprays blood on the crowd, the camera pans over to Euronymous, whose face betrays a mixture of horror and jealousy - he knows, even at this early stage, that he could never be that extreme.<br><br>From an aesthetic point of view, the film features three notable scenes; two murders and one suicide. All three scenes are long, shot matter-of-factly by cinematographer <a href=\"/name/nm0252277/\">Pär M. Ekberg</a>, and sparsely edited by <a href=\"/name/nm2845760/\">Rickard Krantz</a>. The two murders feature repeated stabbings that seem to go on forever, but it's the suicide that really got under my skin. I'm not sure if it's the length of time it takes (Dead slowly slits one wrist, then the other, he waits a bit, then cuts his own throat, waits a bit more, and then shoots himself in the forehead), if it was <a href=\"/name/nm1997507/\">Mattias Eklund</a>'s sound design wherein we can literally hear the knife tear the flesh, if it was the lack of cutaways, or if it was the close-ups of the wounds, but I found the scene harrowing. Brilliantly done, but harrowing.<br><br>Another aesthetic element worth mentioning is that the actors all speak in English with their own accents (think <a href=\"/name/nm0000125/\">Sean Connery</a> in <a href=\"/title/tt0099810/\">The Hunt for Red October (1990)</a>). Personally, I find this far less distracting than everyone speaking English but with Scandinavian inflexions - why would Norwegians be speaking English to one another in Norwegian accents? It's a little jarring at first, but you quickly acclimate yourself to it, and it ultimately proves far less distracting than an actor with a God-awful accent.<br><br>In terms of problems, some will take issue with how ironically the film approaches the material. The repeated shots of band members leaving their parents' homes does seem to betray something of a judgemental jokey disdain. Additionally, the film never tries to convey just what drove these young men to make this kind of music in the first place, or why these poorly recorded ultra-depressing songs garnered such a fanatical following. It wouldn't have taken a huge amount to address this, and the absence of any material which speaks to where the black metal ideology came from leaves a sizeable lacuna. A knock-on from this is that the film downplays the movement's more horrifying activities; suggestions that they were just dumb kids who let things get out of hand provides an excuse that isn't justified, and undercuts the severity of what some of them did. The film also avoids the racism and homophobia in the movement.<br><br>In one respect, Lords of Chaos is an act of de-mythologizing, attempting to show that this frightening group of Satan-worshipping church burners and murderers were really just middle-class kids with a case of ennui. On the other hand, it illustrates that what had started out innocently led to some serious real-world ramifications. Euronymous is depicted as a wannabe cult leader, but one who doesn't subscribe to his own ideology of violence and rebellion, and is completely at a loss how to put the genie back in the box when certain members take his words literally. Lords of Chaos is his story before it is the story of black metal, and this is a vital point. Unafraid to show that the movement was built on a flimsy hodgepodge of paganism, Satanism, and Nazism, Åkerlund suggests the underpinning ideology is convoluted nonsense. For adherents, this will prove offensive. For everybody else, the ironic humour, harrowing violence, and thematic nihilism gel to form a fascinating film that's well worth checking out.","user":"Bertaut","rank":[70,91]},{"title":"Hilariously bad.","rating":18,"date":"18 January 2019","review":"This works great as a parody. What is presented here has nothing to do with the real events, most characters are straight out of an American teen movie, every character is completely different from the real life version in everything (looks, behavior) and the story is insultingly false. The book was already bad, the movie is about 100 times worse. No band gave the rights to its music, even bands that had no real involvement in the true events that the movie is trying, and failing spectacularly, to portray. I love the few good reviews and the downvoting of the one negative review that says the truth, the movie will bomb either way. If you want to see an American teen movie with romance, sex, American humor and a bit of fake drama then this is for you. If you want to see a serious drama based on tragic events then avoid it like the plague.","user":"j_glentzes","rank":[205,360]},{"title":"Don't believe the haters","rating":7,"date":"28 February 2019","review":"I didn't expect to like it, but it was pretty good! Brutal scenes and seemed to stay true to much of the information I've accrued over the years. Varg hates everything, but this seems to be more of his angle on what happened, which in general terms was that Euronymous was a \"poser\" and took credit for things that weren't his. Hey, it's a movie not a documentary. Only Varg really knows what happened that night and he's already told the his side of things. It's well made, entertaining, and very brutal at times. Give it an honest go and see what you think.","user":"continual-one","rank":[81,137]}]