[{"title":"What comes at night?","rating":4,"date":"30 August 2017","review":"I must confess I was expecting way more of this \"horror\" film. <br><br>It started off quite well (hence the 4 rating) but after the first 30 minutes went downhill. No questions were answered, you are left with a large list of plot holes and an ending that couldn't be more predictable and boring.<br><br>Don't get me wrong, it isn't the worst \"horror\" film I ever saw but is avoidable especially if you like HORROR.<br><br>I'm still waiting for what comes at night.","user":"Meckiezinha","rank":[466,692]},{"title":"Horrible Movie","rating":1,"date":"3 July 2017","review":"This movie had a 5 million dollar budget, and I feel like 1 million was spent on the movie and the other 4 spent on fake reviews on sites like IMDb. This movie was one of the largest pieces of garbage I have ever seen.<br><br>*Spoiler*<br><br>Nothing comes at night. If you read the positive reviews for this movie they like to pretend you should imagine what would come at night. I did not pay $13 a ticket to imagine anything. On top of that, one of the main characters is left tied to a tree through a night or 2 and guess what... Nothing comes to eat him, make him sick, or even tickle his toes. We saw this movie at the Alamo Draft House and I was very confused when they started handing out checks as that usually happens after the climax of a movie, and this movie never had that. To sum the movie up, his grandpa is put down like a sick animal at the start of the movie then nothing happens for about 20 minutes. Some guy shows up at his house by breaking in, they go to pick up this guys family and some goats. While on the road, they run in to a couple of guys who they beat up and kill. At this point, they lead you to believe the guy who wandered up to his house knew the people in the forest, but they just ignore that and bring the guys family and goats home. Then you spend another 20 minutes with nothing happening and then the dog runs away. What did the dog run away to chase? You never find out. The dog shows up sick a few nights later and some how this \"door that only the dad has a key to gets unlocked\". How did that happen and why did everybody blame the kid when the dad has the only key? Well, if you asked that, you will never find out because they just go \"Oh well, lets all go to our separate rooms\". While in their rooms the mom hugs and kisses her kid, the kid who touched the other little kid. Why did the kid die at the end from the disease and the mom not die? How is the disease spread? Nobody took proper precautions to prevent the spread of a disease. Putting a mask on for a few minutes doesn't protect you if it's airborne as you are all still hanging out together. Hugging and kissing your kid who may be infected is also an easy way to get the virus, disease, whatever it was. Save your money, this movie is full of plot holes, almost no story and just plain sucked. I am disappointing I didn't go see the house instead. That one got bad reviews, but at least I would have known that going in to it and wouldn't have been lead to believe this movie was going to be good by a bunch of lying hipsters. Seriously, read their reviews, this movie is not \"profound\" or even a movie you need to \"think\" to understand. It's a piece of garbage, low budget movie that was passed off as a blockbuster with a bunch of fake reviews.","user":"clid-44670","rank":[561,871]},{"title":"nothing comes at night","rating":1,"date":"29 August 2017","review":"nothing of significance happens during the whole movie. its slow, not scary, and a waste of time. no answers to any of the questions the film poses. just a bunch of people in the wood who don't trust each other and some fatal disease that just kills everyone. in all truth...Nothing comes at night throughout the whole film. i wouldn't even pirate this movie.","user":"cdxxdickie","rank":[353,548]}]