[{"title":"Not another spy thriller","rating":8,"date":"29 July 2018","review":"I don't care it is not filmed in Beirut. It is a good spy thriller that is unlike most others. It does not have car chases or thousands of bullets flying or naked men &amp; women decorating the screen. It has depth and is thought provoking. A wife died and the husband grieved. A child lost his mentor and he seeked another, who led him to a totally different path. There are deceptions but there are also trust and friendship. It is a movie that keeps your brain churning instead of your adrenaline rushing.","user":"esther70","rank":[52,57]},{"title":"Extremely Entertaining","rating":8,"date":"8 January 2019","review":"One reviewer indicated this was not filmed in Beirut and the city wasn't in the condition as depicted. Not ever having been there I won't dispute but the images of the damages and treatment of individuals were horrifying and set the tone for the film. But, terrorist activities in the area has been well documented since recorded history. Jon Hamm was exceptional in the development of his character and Rosemary Pike may have been somewhat miscast but she managed her character fairly well. What was most disturbing was the probability of sacrificing one to maintain a precarious \"peace\" in the Region. And, of course, there is the issue of corruption by a U.S. official in another country (go figure). All in all it is a complex story with something of an unlikely conclusion but it was still extremely entertaining.","user":"schubej-1","rank":[14,15]},{"title":"A Solid Thriller, Enjoyable, Should be on Your List","rating":8,"date":"8 August 2018","review":"As a movie this is a solid, dependable thriller with a really solid performance by Jon Hamm, as well as by a range of supporting players who turn in good, taunt performances. The one exception is Rosamund Pike whom is a great actor, but is ill-used. I suspect there were a number of scenes left on the editing floor.<br><br>This movie will be controversial because of its depictions of Beirut, as well as lack of agency of the Lebanese people. These criticisms are valid, but at the same time it is very hard for Hollywood, let alone a Western director and writer to get the right nuance and tension of the period AND make a successful movie. To the critics, you have a point, but this is a thriller, not a documentary.<br><br>If you are looking for a modern spy/espionage movie, this should be on your list. Plus I would love to see more Jon Hamm in these types of roles...well done.","user":"rbolepdx","rank":[34,44]}]