[{"title":"Realistic and terrific dive into the French Muslim terrorists","rating":12,"date":"12 August 2016","review":"This film was doomed because it was made before the January 2015 terrorist attack in Paris, I mean the FIRST terrorist attack. And this movie was supposed to be released just after the SECOND terrorist attack, in November of the same year, the one against the Bataclan and many other places. Mass killings that made more than one hundred and forty casualties. Useless to say that no theatre nor distributor dared to show this movie. No one. They feared about riots among the audience, where you have a huge Islamist community. Dimitri Storoge is outstanding as the leader of the group of fanatics. He is convincing at the most. Malik Zidi plays the undercover cop who is sent to infiltrate the French ISIS cell. His character is the weakest, the less convincing, annoying at the most. Predictable at a scale you can't imagine. He has an authentic traitor's face. His double character is too obvious to be believable. A real undercover cop or agent would never behave like this, unless to have suicidal tendencies. I guess there will not be many other movies speaking of this topic. Not so close I mean. But we can watch and interpret this feature from many sides, with many points of view. It is really a hot subject. And the more the time goes, the more it will be hot. We see here the inside of those fanatics groups, as Paul Greengrass did ten years ago with UNITED 93, about the 9/11 attack terrorists. But in a quite different manner although. We can think and try to analyse their motivations, even if we of course don't approve them. <br><br>A very interesting film.","user":"searchanddestroy-1","rank":[13,16]},{"title":"This MUST SEE realistic thriller should be seen by all","rating":10,"date":"9 September 2016","review":"The movie is a great thriller but when you realize it is real life events happening all around us - you get one hell of a ride. I hope Muslims will make their kids and family watch this so the Muslim Religion will be parted away from this current way of recruiting the weak and troubled - to do horrific acts of terror . I wish this movie will be part of the school teaching - just as movies to avoid drug use or other acts of violence . Go see this and give a high rating .. you will encourage others to watch it too . The characters were interesting and the directing was superb . I'll try to look out for more movies by this director.","user":"dankori","rank":[16,25]},{"title":"Good, not great","rating":7,"date":"23 January 2018","review":"A well-made film, good acting. It is essentially essayistic: it argues less for dramatic cinema than it does to inform, like a documentary but not a documentary. The film that I would suggest as followup -- and works better as dramatic film -- is *Carlos* directed by Assayas (the mini-series is complete and longer than the feature film version). *Carlos* is the historical setup for *Made in France*; the former lays the groundwork, twenty-five years earlier, for the context of *Made in France*.","user":"gsking-75108","rank":[0,0]}]