[{"title":"Funny","rating":8,"date":"10 June 2019","review":"I find it's a good family movie. My daughter and I wanted to watch something one night and this popped up. My daughter said we were gonna watch a movie about a boy named Rufus...i was pretty impressed with it. My daughter and I enjoyed it. It wasn't a drawn out long movie but it had comedy.","user":"pearson1994","rank":[2,2]},{"title":"Cute movie","rating":7,"date":"2 December 2016","review":"I thought the movie was cute.....although I am an adult. My yellow Labrador Retriever was used as a back up in the film. One reviewer posted it was a Golden Retriever, however it was actually a Labrador. My dog is in the scene in the beginning where he is looking out the living room window. <br><br>Thus was my first introduction to a children's TV movie, but I thought it was well done and the child actors did a good job. I did think the movie would be longer in length than it was. The story line was OK, but there didn't seem to be enough interaction between the actors and the dog.","user":"estagg-94331","rank":[3,5]},{"title":"You know when you should stop making movies when....","rating":2,"date":"24 January 2016","review":"I honestly have no respect for Jace Norman whatsoever, he's a generic tween actor that will be forgotten in a couple of years. I expect what he's in is bad, but this proceeded my expectations. The plot is very cliché'd. It's about this necklace that can turn you into a human? i don't know much on since the movie doesn't and we meet our bland and text book new student being a nobody from Texas, hey at least they didn't make him a stereotype, they just made him bland. Trying to impress the textbook crush played by Haley Tju, who i also didn't like. My same reasons for Jace except more forgettable. Rufus is the golden retriever, while walking him they find that necklace i said before. It turns him into a human, when taking it off it turned him back to normal. In fact there's a scene where the dad comes in and yet doesn't show him. Why? it';s not like he's going to say no to it. I can tell up to that, because the rest is unnecessary boring filler, the only jokes are \"Ha ha get it, he's a dog in a humans body\" and etc. The climax is when Textbook new kid gets kidnapped and textbook climax happens a fake out death and a happy ending. Oh wait a squirrel is talking to Mr Black because that was his boss, what?","user":"nukeman-00359","rank":[2,11]}]