[{"title":"Almost there, but not quite","rating":6,"date":"2 December 2016","review":"This movie is one of those that should and will resonate with everyone. A heart filled, crazy, emotional, and tender look at family. How and why we can drive each other crazy, drive each other away, yet just as easily lift each other up, pull each other through, and make each other strong – when not trying to kill one another.<br><br>Danny Glover back on the big screen heads up the strong cast as the patriarch of the Meyer family as they deal with the loss of the beloved matriarch whom held them altogether. Mo'Nique brings her A game as the over the top, flamboyant, hard drinking, shoot from the hip, no bull@$#&amp; aunt. J.B. Smoove is Uncle Lonnie, his typical fast talking shuckin' and jivin' self as only he can be.<br><br>The soundtrack is great. From the opening credit sequence it sets the perfect tone and pulls you into the story and is as impactful as a soundtrack should be.<br><br>For all the positives of this film, however, I found the pacing (especially the first half) extremely uneven. I found myself repeated pulled in and engaged in the fun/drama only to have punctuated drawn out moments of \"meh\" wash over me and my interest wane. Fortunately, the second half of the film hits its stride and the movie finishes strong, including some nice outtakes at the beginning of the end credits.<br><br>I did get some good laughs and even teared up a couple of times, but, I'm going to give this one a 5.5 and suggest it as a rental/stream.","user":"stilloopless1","rank":[9,12]},{"title":"Almost Christmas is inoffensive and got some laughs out, but not enough to make it a holiday tradition","rating":5,"date":"18 November 2016","review":"We're only a week away from Thanksgiving, and yet most people seem to be planning their holiday season before they even think about turkey. While I wish that the November holiday got a little more attention, who can blame people from wanting to bring in the magic of the Christmas season? Our world is now dazzled in bright lights, red and green colors all over, and a chance to better relationships. Something about life seems warmer whether were selecting a tree or the living room, lighting a new candle for Chanukah, or simply wishing someone a better new year.<br><br>For a lot of people, the holidays mean having to visit family. I think it's safe to say that no matter who we love, there is at least one person in your family that you'd rather not speak to on a daily basis. So why do we put a lot of focus on our family gatherings if we know that things won't change? I think it's a matter of both keeping tradition, but of also gratefulness. The odd feeling with family is at least some feeling as we could be in a position without any loved ones (like how some people are unfortunately in that position). One family in Almost Christmas deals with a father trying to bring his kids together without drama. <br><br>In Atlanta, Georgia, the Meyers family seems to be a nice crew of people to be with around the holidays. The patriarch, Walter (played by Danny Glover) is a retried mechanic who has let his wife Grace handle the majority of the meal planning while letting their four children run amok. Tragically, Grace dies from an unspecified heart condition, making Walter question just how he can handle his old home and keeping his adult children together.<br><br>First to arrive is his eldest daughter Charyl (played by Kimberly Elise) who is a dentist and has brought her husband former basketball star Lonnie (played by J.B. Smoove) and their daughter. Next is eldest son Malachi (played by Romany Malco) who is trying to spend time with his family while running for congress. Then we have youngest daughter Cheryl (played by Kimberly Elise), whose seems to be in between jobs while raining her daughter. Finally we have youngest son Evan (played by Jessie Usher) who is a football star at his college. Oh, and Grace's sister aunt May (played by Mo'Nique) Can Walter manage to keep the family at peace in his first Christmas without his wife?<br><br>The trouble with trying to get out a good Christmas movie (and I LOVE Christmas films) is all about creating realistic conflict that we can relate to and why the holidays are a good time to resolve them. Almost Christmas plays off like a lot of those television movies on Hallmark, which usually means that their never great. This is defiantly no Christmas Vacation, Home Alone, or Elf, but this is far from even the worst. The movie has its moments where it's drama seems genuine, especially whenever it focuses on Danny Glover and his children.<br><br>While I'd like to follow Glover, the rest of the family doesn't have much interesting. I don't blame it on the actors, but the script gives them cliché moments like the cheating husband, the father that works too hard, or the grief of loosing a mother. I don't have a problem with any of this, but Almost Christmas doesn't find any new ways to tell that story. As I said, actors like Danny Glover, Mo'Nique, and J.B. Smoove did get a laugh out of me and are enough to keep the movie going when it needs to.<br><br>I'll give this five sweet potato pies out of ten. At it's worst, its boring. But at it's best, it's inoffensive. As far as Christmas movies goes, I could easily see this playing on a Sunday afternoon on Hallmark or TNT. Those that aren't bothered by tired story elements will probably find this one passable. I doubt I'll spend more time with the Meyers family, but don't see any reason for other people to join them.","user":"RforFilm","rank":[13,20]},{"title":"It ends on a feel-good note and is tolerable, but it just doesn't bring enough to the table to break out of its generic shell.","rating":5,"date":"11 November 2016","review":"For the record, I love Thanksgiving and am not a fan of putting up Christmas trees this early, but I can appreciate a feel-good holiday film anytime of the year.<br><br>Unfortunately for director David E. Talbert, this delivered few laughs and some grunts and sighs. It's to be expected, though, as these sorts of films make their rounds ad nauseam during the holidays.<br><br>Almost Christmas brings together a recognizable cast, which includes Danny Glover, Mo'Nique and Gabrielle Union, that surely makes the characters more appealing to moviegoers. The premise for this film surrounds a family reunion during Christmas in Birmingham, Alabama, months after Walter's (Glover) wife, Grace, dies. The once- functional family struggles to get along due to implicit and explicit frustrations among one another.<br><br>Ain't No Woman Like the One I Got by the Four Tops softly plays in the background as a very quick opening montage through the years shows how Walter, Grace and their family loved each other. What struck through the first half hour was a sense of composure, which some of these one-time holiday films usually fail to achieve.<br><br>As the five-day countdown until Christmas began, the comedic writing by Talbert kicked into gear and shoved more of the serious tones out of the window. Aunt May (Mo'Nique) is very outspoken and makes her presence known from the minute she appears. Most of the personal insults come from her, but not all were cringe-worthy. I even found myself laughing in-between the more heavy-handed jokes, but it was almost too obvious in moments that the stage was her's.<br><br>However, there were far too many cheesy moments and exactly that: heavy-handed jokes. Yeah, we get it, children love their iPhones and documenting everything for social media. But do we need to hear them shout, \"Worldstar!\"? Yeah, we also get that Uncle Lonnie (J.B. Smoove) is making Santa Claus butt jokes, but you don't need to linger on the fact that they're butt jokes. Make 'em and move forward, except for the Worldstar joke. Don't ever make that joke again.<br><br>The movie also introduces Jessie T. Usher for the first time since Independence Day: Resurgence. Usher plays Evan, Walter's son and a star college football athlete who has everything, yet is addicted to painkillers he was prescribed for his once-injured shoulder. The film uses his drug use to teach a lesson later in the film that was oddly placed in-between another conflict.<br><br>Rachel (Union) and her sister, Cheryl (Kimberly Elise), have a bad relationship to boot which ends up being the best relationship/conflict throughout the film. The other relationships were  eh, forgettable. There's a weaker subplot which involves Christian (Romany Malco), Walter's son-turned-politician, and it feels like it's no more than a stopgap for the \"Christmas miracle\" of the film. It was added to the list of generic moments triggered by the film's screenplay.<br><br>Glover adds little to the film as it moves on other than stopping arguments and reminding his children and family that they need to love rather than shout. It's understandable why he's soft-spoken throughout the entire film after losing his wife, but this showcases that his best acting days may be behind him.<br><br>I feel the movie will resonate well with audiences that can truly relate to the dysfunction of dinners during the holidays. There were many specific moments where the theater was in raucous laughter and others that struck heartstrings. There's fun found in a dancing scene, and Almost Christmas ends as it began: with the Four Tops. Seriously speaking, it ends on a feel-good note and is tolerable, but it just doesn't bring enough to the table to break out of its generic shell.","user":"jjprofetto","rank":[5,7]}]