[{"title":"The hangman","rating":4,"date":"4 June 2016","review":"I don't know how many films about hangmen, and only them, were made during movie history. I remind Jack Smight's TRAVELING EXECUTIONER back in 1970. But this feature from Singapore is a real hit in the face. It draws a portrait of those men, at least in this country where the capital punishment is hanging...It would be interesting to see how the hangmen in the USA proceed with the electric chair or the gas chamber... Anyway, you deal here with a powerful piece of work, accurate, astounding movie pulled by performances that I repeat hit you in the face. The struggle of a new prison guard who becomes the hangman's assistant, long time after his own father was himself executed by the same hangman. Those schemes about forgiveness, guilt or vengeance have already been told a billion times before, but this one, in this very feature, is absolutely unforeseeable. You can't expect what will eventually happen. Impossible. No clichés here. None of them. No bad guys or good ones. No cruel prison wardens or cold executioner scheme, on the contrary, everything is so human. So true. So real. <br><br>A real must see.","user":"searchanddestroy-1","rank":[18,23]},{"title":"Shadow of the Noose","rating":8,"date":"20 June 2016","review":"When deciding to see a prison movie you have already prepared yourself for a gritty, realistic experience. When you know it's a prison movie about an apprentice executioner, you have to prepare yourself to pre-mourn the dead men walking you are about to meet. But Apprentice doesn't focus on the prisoners; it's a story about the guards and how they manage to do the worst job in the world.<br><br>Aiman (Fir Raham) is drawn to small places. As a boy he would hide in a cupboard and as an adult he leaves the army for a job in the prisons. He's there to do good, and thinks he can help to change the prisoners. But his positive intentions can't stop his fascination with the Condemned Block. His attention is caught by the gate that bars his entrance and the men that work behind it. In particular the white haired Chief Executioner (Wan Hanafi Su) catches his eye, and as Aiman volunteers, ingratiates and manipulates himself into that world, The Chief becomes his Miyagi.<br><br>But there is no repetitive car waxing here. Death Row doesn't wait for laborious life lessons. However, just like Daniel Laruso, Aiman does have to learn new skills, and his relationship with the older man is the centerpiece of the movie. The Chief sees something of himself in young Aiman. He laments modern rules and regulations, knowing that leaders don't come from following the rule book and he likes that Aiman has some rough edges. They are both single and while the movie doesn't bother itself with any forced romantic subplots, we learn The Chief was married once but his job got in the way and there has been no-one since. His business card rarely goes down well at speed dating nights.<br><br>Apprentice doesn't delve into any extraneous relationships at all. Aiman lives with his sister, Suhailia (Mastura Ahmad), who provides a Jiminy Cricketesque presence for him, but even her boyfriend exists only on the blurry fringes of the frame. Everything about Apprentice is brutally efficient as the Singapore prison system.<br><br>The word 'gallows' is too elegant a word for what it describes. The journey across the double 'l's' over the 'o' and into the curve of the 'w' doesn't do justice to the trip the inmate takes from his cell to the door in the floor. Their Lord provides them comfort, but their legs often desert them and they need to be supported down the hallway,. But once the hood is on, it's mercifully quick. The Chief pulls the lever and we hear the snap right where it should for a perfectly executed execution.<br><br>Modern societies like to think they have evolved beyond the brutality of capital punishment, but this film doesn't make it a political discussion. Instead it's a personal question for the characters. When Aiman wonders whether one of the prisoners deserves to die for 'only' drug trafficking, The Chief isn't affronted because of his political or philosophical views, he takes it as an attack on his very existence. He has prided himself on fulfilling a vital role and doing it to the best of his ability. The rights and wrongs are not for him to decide.<br><br>While the characters don't spend too much time discussing the moral question of capital punishment, it's impossible for the audience to ignore. From the angle that Director Boo gives us, we often see the guards through windows and bars making them look a lot like prisoners themselves. But while they get to leave they are still tethered, only really free for the hours between their shifts, and even then it appears that the horrible shadow of the noose has them living like prisoners anyway.","user":"shaunjmaher","rank":[10,12]},{"title":"delicacy","rating":18,"date":"18 October 2017","review":"a delicate theme. brilliant script. fine performances. and the most inspired manner to explore the guilt, the past, the friendship, the duty. in essence, a water drawing. touching, precise, admirable for the courage to not be prisoner of clichés. because it is one of the admirable exploration of subjects who, very easy, could be traps for many directors. and occasion of fascinating meet between Wan Hanafi Su and Firdaus Rahman.","user":"Kirpianuscus","rank":[7,8]}]