[{"title":"A delightful French farce that is funny and sad and loaded with charm.","rating":7,"date":"12 December 2016","review":"You'll search far and wide to find a positive review of this film but you have found one here. Like every romantic farce, Up For Love (2016) is a comedy based on situational humour rather than dialogue or action. It's a genre that shows people revealing themselves by how they react to the unexpected and this one is funny and sad and loaded with charm.<br><br>The plot line is simple: a beautiful lawyer loses her phone and a caller offers to return it if she will dine with him. Freshly divorced Diane (Virginie Efira) is trying to move on and is vulnerable to the smooth-talking Alexandre (Jean Dujardin). When they first meet she is stunned to find that the high-profile architect is 4 foot 6 inches tall. It is a hilarious scene of studied avoidance and shifting glances. But they hit it off and start dating, and each situation into which Diane introduces Alexandre is a farcical study of how people react to his diminutive stature. Throughout it all, Alexandre endures the stares and jibes with good-humoured acceptance despite the callous insensitivity of people towards those who are different.<br><br>There is an unmistakable feeling of guilt in laughing at how Alexandre copes with everyday moments in his life, like needing to jump up into a normal size chair and see his dangling feet not reach the floor. But that is the whole point: how would we react in the situation? Dujardin is a pin-up star of French cinema and he plays here with irrepressible warmth and forbearance despite his short straw in life. Efira is his perfect match and plays middle-class embarrassment to perfection. Critics have complained that the digital effects to down-size Dujardin are clumsy. It is true that if you look for it, you can notice some between-scene differences in scale and perspective that slightly alters his size in relation to the frame. Just ignore it. The whole of cinema involves suspension of disbelief and this story has more than enough going for it to be spoilt by minor hiccups with experimental technology.<br><br>Love stories between mismatched souls have always been the lifeblood of romantic comedy, so in one sense Up For Love is just another take on an ancient theme. If your glass is always half empty, then this film is a flawed cliché. For others, it is a delightful romance that doubles as a serious essay on dealing with difference. It is heart-warming and awkward, original and familiar, all at the same time.","user":"CineMuseFilms","rank":[10,10]},{"title":"Love is stronger than, erm, midget","rating":7,"date":"2 September 2016","review":"This is the classic French romcom with a twist. A dashing architect and a big girl lawyer fall in love with each other. Who wouldn't, they've got everything going for them, so much so that it's sheer willpower that keeps them from falling heels over head in love with themselves. And every man should take a few pointers from Alexandre how to properly woo a woman. The only hitch is that this French lover stands barely 1,40 m tall. Although this predicament is obvious from the start, and I felt a bit nauseous about how truly wonderful Alexandre is (he's great at anything), the movie still provides a lot of momentum and keeps the story going. It's especially fun to watch how they make the 1,82 m tall actor Jean Dujardin appear to be only 1,36 m tall by a number of old school tricks (his counterpart Diane (Virginie Efira) standing on a box, or Jean Dujardin kneeling) and CGI (green screen).","user":"Karl Self","rank":[11,14]},{"title":"It made me, seriously, laugh","rating":8,"date":"2 March 2018","review":"First the long review from the other is not fair. It sounds like someone who admits being shorter is an issue. So can be being taller than the average. We are dealing with an Oscar winner and some really clever movie tricks and set design etc that is what is to appreciated also and the creativity and fun to show it. I don't want to spoil it but I find it has a general positive attitude. It teaches us to appreciate what's between the two ears and maybe legs also as it often does not match the rest of the body automatically. I have met several people who needed injections to grow, very costly treatments that maybe could have been approached in the movie also.\nSee it and make up your own opinion.","user":"vstapelb_sa","rank":[4,5]}]