[{"title":"Absolutely warm movie, glad I watched!","rating":10,"date":"30 January 2018","review":"A very nice take on an autistic person life, dreams, difficulties. I watched with pleasure and every scene was so convincing. I simply cannot understand why this movie does not have higher scores. The Star Trek stuff was cleverly inserted into context and as a fan of science and space fiction that could not be better. Go watch it, if, as a Vulcan, you don't mind shedding some tears!","user":"suripat","rank":[63,73]},{"title":"Good Enough","rating":7,"date":"8 March 2018","review":"Heartwarming enough to keep it interesting till the end, this movie is simple, dramatic enough, and just that. No overplaying the autistic card, not overreacting, no tragedies. A simple story, about an autistic girl who wants to make her dreams come true and live a normal life. And it's worth watching it.","user":"pennyelenabooks","rank":[15,16]},{"title":"Intriguing and Accurate Portrayal of Creative Autistic Youth","rating":8,"date":"9 February 2018","review":"I was very impressed with this film. The portrayals are fairly accurate and positive. I think that's important.<br><br>This film is about an autistic girl named Wendy, played by Dakota Fanning. Wendy is a humongous Star Trek fan who runs away from her caregiver and heads to Paramount Pictures to enter her script in a Star Trek writing contest. <br><br>The first thing that I must talk about is the fact that the main character is a female autistic girl. I am on the autism spectrum myself. Specifically, I have high-functioning Asperger's syndrome. It's a common misconception that autism occurs mainly in boys, yet this film has a female lead who's on the spectrum and I love that. Autism has such a wide spectrum and effects 1 in 100 people. There are a lot of us out there and, aside from this movie, I can only think of a few other fictional characters on the spectrum and that upsets me. It's rare to see autistic people represented, until recently and they are interesting people. The traits shown in this film are accurate. For example, there's a scene when Wendy sings to herself while covering her ears to block out the loud noises. I can relate to that since I do that too. It's good that the traits shown are correct.<br><br>Wendy is a character who you can't help but want to root for. I relate to her passion for writing, as I am also a writer. I wanted her to succeed so badly. Also, all of the Star Trek references actually have a purpose. At first, it just seems as if her love of Star Trek is just her special interest, as many autistic people develop special interests. But the movie actually uses the Star Trek references in a much more meaningful way. There's a scene where one of the characters explains to his mom that Spock has trouble with his emotions. He uses this as an example of why Wendy might be obsessed with the show. To be honest, I thought that metaphor was incredibly creative. <br><br>However, I'll be honest, the older sister, Audrey, really bothered me. I understand Wendy is lower functioning. They show early on how Wendy would freak out and start hitting herself when she was overwhelmed. But, the only reason that Wendy runs away is because her sister doesn't trust Wendy being away from her caregiver, therefore Audrey won't drive Wendy to the post office to drop off the script. I know caretakers will connect with Audrey as it can be difficult to care for people with challenges. I just hope people take away from this movie an understanding that people with challenges can still accomplish great things. Autistic people are extremely creative and deserve more credit and opportunities. <br><br>I give this film 4 out of 5 stars and recommend it for ages 11 to 18. <br><br>Reviewed by Calista B., KIDS FIRST! Film Critic. For more reviews by youth visit kidsfirst dot org.","user":"rannynm","rank":[31,36]}]