[{"title":"The power of love makes you love the Lovings","rating":10,"date":"19 October 2016","review":"I had the chance to see this film at the Austin Film Festival, followed by a QA with the writer/director Jeff Nichols. Having already been familiar with this story from the made for television movie in 1996 starring Timothy Hutton and Lela Rochon as Richard and Mildred Loving. Many would ask why now or why remake this film? Well many people are simply unaware of this couple's story and their groundbreaking supreme court case, because it's certainly not mentioned or taught in public schools. So was the case for the writer/director, as mentioned he was not aware of their story. He carefully followed the documentary and archived records about them, while imagining what their conversations and dialogue would have been like between them. I found the landscape of the cinematography beautiful and breathtaking. The acting chemistry between Ruth Negga and Joel Edgarton was so tender and sincere, as you witness their love and vulnerabilities on screen, it makes you love the Lovings. Ruth Negga really shines as the quiet young woman who becomes the matriarch and leader of her family after watching the march on Washington DC, she decides to write a letter to then Attorney General Robert Kennedy. You see the transformation of two introverted people during the civil rights era become activists for change in their own way that is very powerful in this film. Historically many of the biracial descendants of this country's slave owning founding fathers never benefited from the wealth and privilege of the white ancestors. That is part of what what made their case was so monumental, in that it reversed segregationist slave laws that considered biracial children mongrel bastards and prohibited the rights of marriage and inheritance of interracial couples.","user":"dham629","rank":[62,78]},{"title":"The story of Richard and Mildred's incredible love as it conquers racism of the south in the 1950's","rating":8,"date":"11 September 2016","review":"Loving Review<br><br>Jeff Nicolas newest film centres around the true story of Richard and Mildred Richard, the couple that fought the supreme court to legalize interracial marriage. On the surface this story seems interesting but over done but the way Jeff Nicolas tells this story makes it incredibly unique. Instead of focusing on the big story about Civil Rights Nicolas focuses on the very personal story of Richard and Mildred. By bringing the story down to a very personal scale Nicolas told the story in a far more impacting and effective way. This movie isn't about a revolution or a grand battle this is truly a movie about two people being in love. The movie doesn't try to rant or preach it just tries to tell a human story. Ruth Negga shone in this movie. She gave an honest, and emotional performance that really made Mildred seem like a person instead of just a character. Acting against her or more accurately with her is Joel Egerton. The character of Richard is fall less emotional so therefor Joel has less opportunities to show off, instead Joel utilized the quiet moments with his character to give a strong performance. Together the pair creates a believable, balanced relationship that shows us they're in love instead of just telling us. The accents at first are distracting and can be hard to understand but as the movie continues the audience becomes more immersed in the world and it feels natural. The major issue with the movie is its repetition. Due to the nature of the story the movie hits similar points multiple times, by condensing the events the movie could have been more efficient.The movies greatest strength is it's characters. The characters never feel like roles in a movie, instead they feel like actual people. The movie shows us small yet very personal moments between the characters that really make them come to life. From simple glances to quiet laughs you really believe that these are humans with thoughts, feelings and emotion. Tis makes the audience care much more about their story and therefore become more invested in the movie. The soundtrack much like the movie is quiet yet effective. It gives the film a very distinct optimism to it. The camera work is gorgeous. It's ability to focus on details then go to sweeping landscape shots is very impressive.","user":"Laurynwatters","rank":[48,63]},{"title":"Let them be","rating":7,"date":"9 November 2016","review":"Greetings again from the darkness. Imagine you are sound asleep in bed with your significant other. It's the middle of the night. Suddenly, the sheriff and his deputies crash through your bedroom door with pistols drawn and flashlights blinding you. You are both taken into custody. For most of us, this would be a terrible nightmare. For Mildred and Richard Loving, it was their reality in June of 1958. Their crime was not drug-dealing, child pornography, or treason. Their crime was marriage. Interracial marriage.<br><br>Writer/director Jeff Nichols (Mud, Take Shelter) proves again he has a distinct feel and sensitivity for the southern way. There is nothing showy about his style, and in fact, his storytelling is at its most effective in the small, intimate moments  he goes quiet where other filmmakers would go big. Rather than an overwrought political statement, Nichols keeps the focus on two people just trying to live their life together.<br><br>Joel Edgerton plays Richard Loving, a bricklayer and man of few words. Ruth Negga plays Mildred, a quietly wise and observant woman. Both are outstanding in delivering understated and sincere performances (expect Oscar chatter for Ms. Negga). These are country folks caught up in Virginia's Racial Integrity Act of 1924, though as Richard says, \"we aren't bothering anyone\". The counterpoint comes from the local Sheriff (an intimidating Martin Csokas) who claims to be enforcing \"God's Law\".<br><br>Nichols never strays far from the 2011 documentary The Loving Story from Nancy Buirski, who is a producer on this film. When the ACLU-assigned young (and green) lawyer Bernard Cohen (played with a dose of goofiness by Nick Kroll) gets involved, we see how the case hinges on public perception and changing social mores. Michael Shannon appears as the Life Magazine photographer who shot the iconic images of the couple at home  a spread that presented the Lovings not as an interracial couple, but rather as simply a normal married couple raising their kids.<br><br>In 1967, the Supreme Court decision in Loving v. Virginia, unanimously held Virginia's \"Racial Integrity Act of 1924\" as unconstitutional, putting an end to all miscegenation laws (interracial marriage was still illegal in 15 states at the time). In keeping with the film's direct approach, the Supreme Court case lacks any of the usual courtroom theatrics and is capped with a quietly received phone call to Mildred.<br><br>Beautiful camera work from cinematographer Adam Stone complements the spot on setting, costumes and cars which capture the look and feel of the era (over a 10 year period). Nichols forsakes the crowd-rallying moments or even the police brutality of today's headlines, but that doesn't mean there is any shortage of paranoia or constant concern. We feel the strain through these genuine people as though we are there with them. The simplicity of Richard and Mildred belies the complexity of the issue, and is summed up through the words of Mildred, \"He took care of me.\"","user":"ferguson-6","rank":[35,45]}]