[{"title":"Shapeshifter time","rating":6,"date":"11 February 2019","review":"The original title of this movie was Shapeshifter, which gives you a better idea of what it is about. A foreign production with mainly American actors including the always excellent Josh Stewart, but even the foreign ones are speaking English. As a horror movie goes it's OK, the acting is decent, there are scares, gore, some thrills, just not enough of any of these things. It doesn't stand out as being anything really different from so many other horror movies today, and is completely forgettable. The Shapeshifter creature is excellent though, a genuinely frightening creation. It seems some money was spent on effects, this isn't a movie where monsters look like a rubber mask from a dollar store. Just a shame they didn't add in more scares and a more coherent script. By the time it ended on a somewhat preposterous note, I'm still not sure what was going on. 6 stars for being somewhat interesting, not a bore, a great monster, and a cut above the many low budget horror films floating around.","user":"hampersnow-28905","rank":[39,48]},{"title":"I've seen worse","rating":3,"date":"26 October 2019","review":"Wasn't great. Wasn't horrible.\nThe setting was the most interesting part of the film.\nThe characters you feel most for are the rats.","user":"heatherlyinn-630-338757","rank":[4,4]},{"title":"Watch \"Discarnate\" at your own Discretion","rating":5,"date":"28 October 2019","review":"This is definitely an average foreign, horror film with English speaking actors. We've seen all the storyline line before. A group of scientists gets together and tries to unravel what happens in the afterlife. To achieve this goal they all inject themselves with a crude hallucinogenic serum. That, of course, gives them more than they wished more. The researchers discover a shape-shifting \"bogey-man\" that eats people. Previously this creature had killed two children that belonged to two different people in the group. Now that they all had special serum in their bodies the monster could see them as before it could only see young kids. As predictable as any bland horror movie, the shape-shifting creature (done fairly well) then proceeds to slaughter everyone until the last remaining girl somehow kills it with a shovel. She says aloud, \"I wonder if that's the only one?\". Then the obligatory final scene shows a hilltop with dozens of the \"bogey-men\" shape-shifting creatures spawning on it. Setting up a possible sequel but I wouldn't bet on it. Like I said, watch at your own discretion and only if you're bored.","user":"knightox","rank":[3,3]}]