[{"title":"The problem with Colossal is not Colossal's problem.","rating":7,"date":"25 August 2017","review":"Fist off, this is a good film. Let me get that out of the way. To h*ll with the haters. It's smart. Clever. Unique. If you pay attention there are plenty of gags. Hathaway shines and all the rest. It's just NOT the film the trailers lead people to believe, and I really hate that. The trailers filled seats with people who were expecting to see some quirky romcom and instead they got 'Annie Darko' and wound up hating it. And this is a major pet peeve of mine. The same thing happened with \"White God\" This kind of advertising always backfires. The PR dpt just puts together any trailer they think will fill the seats on opening night, then it brings the wrong audience and hurts the film in the long run. Colossal should have been advertised like \"Motorama\" or \"The Dark Backwards\"... or \"Eating Raul\". It's a dark edgy comedy and it's not supposed to be of the 'wacky wild hilarity' genre'. OK, it's not a life altering cinema, but it is far better than most of the critiques I've read. And one thing all those critiques had in common...? They all said it wasn't what they were expecting, or it couldn't figure out what it wanted to be. Wrong. The film was exactly what it was trying to be. The viewers just couldn't figure out what it was doing because they all thought it was trying to do something else.... primarily because of the way it was presented. Not that it's easy to describe. Just abandon your preconceived notions before you watch. I actually like it better than the film I thought it would be.","user":"pazu7","rank":[159,203]},{"title":"This is a love-it or hate-it movie.","rating":7,"date":"23 August 2018","review":"This is a love-it or hate-it movie. If you were looking for a RomCom or Kaiju movie, you may be in the hate-it camp. If, however, you want the clever outworking of a dark metaphor presenting itself as a mystery, you may have found a film you can appreciate. That might, also, have been the draw for the cast. Unusual roles for all the actors, performed well. Anne Hathaway held our attention. In terms of storytelling, there were times when the metaphor and the mystery collided with each other and the audience may be left (ironically) scratching their heads, trying to fit the pieces together. With that said, I am giving this film a 7 (clever) out of 10. {A Dark Metaphor}","user":"nancyldraper","rank":[27,31]},{"title":"Curious fantasy drama is flawed but still worth a look","rating":7,"date":"29 May 2017","review":"Colossal is a film from Spanish director Nacho Vigalondo. It stars Anne Hathaway as Gloria, a thirty-something wastrel who would much rather be out all night drinking with her friends than growing up, getting a job etc.<br><br>When she is dumped by her boyfriend (Dan Stevens, channeling Hugh Grant) and kicked out of the flat they share, she returns to her hometown and the rental house her parents own where she almost immediately meets old school friend Oscar (Jason Sudeikis) who not only has always had feelings for his old school friend, but also happens to own a bar and employs Gloria as a waitress.<br><br>One drunken evening ends with Gloria spending the night on a playground bench, the same night a giant monster appears over Seoul wreaking havoc. Gloria slowly begins to realise that she may have something to do with this event, in fact the monster may actually be her...<br><br>This is a strange film, let's be frank - you ain't going to see something like this again this, or any, year. It is like a Godzilla film seen through the prism of indie self-improvement films like Garden State. Or, if you prefer, something akin to Juno with a Kaiju.<br><br>It is a film that is a little unsure of itself, despite the brilliant idea at its core. It is not a comedy, though it is fitfully amusing and the presence of Sudeikis, nor is it a 'growing up' movie, instead it is closer to a monster movie, but the monsters involved are not necessarily the obvious green stompy thing flattening Seoul, more the monsters that live within each and every one of us. However it never quite pulls all of its themes and plot threads together satisfactorily, perhaps it never could, and its tone is a little uneven in places. This is a film that does not go where you think the premise might take it. This is a surprisingly dark film, with unapologetic, unlikable characters that are obsessed with nihilistic, destructive emotions and struggle to repress and control them when really they wish to embrace them.<br><br>Hathaway, as far away from her traditional elfin princess appearance as she's ever been, is effective as Gloria, though we never really warm to her. It is a measure of the actress's skill that we are clearly not meant to ever love and root for Gloria, but we do wish the best for her, we hope she makes the 'right' choices that would assist her goal to get her life under control even though we know, deep down, she's hopeless. Peering out from under an unflattering fringe, hair unkempt and unbrushed, black eye make-up and cracked lips she bears an uncanny resemblance to UK TV presenter Claudia Winkleman. Hers is a performance of charm, darkness, obsession, addiction and cruelty.<br><br>The revelation is Sudeikis who initially delivers his standard, unimpressive, nice guy schtick- a performance he is very good at, it's just not hugely stand-out - but as the film, and Oscar, take a darker tone, Sudeikis subtly shifts gear, moving into menace and threat. It is an unstable performance, shifting suddenly and violently between nice guy and monster A man unhappy with his life, Oscar the bar owner is a thin veneer of respectability and decency wrapped around a cruel narcissistic bully. Sudeikis brilliantly shows the veneer cracking, splitting and revealing the monster that inhabits the man. It is a very impressive performance.<br><br>The dark themes, twisted characters and bonkers premise was never going to be completed satisfactorily, and it isn't. The plot demands the mystery is resolved and the threat dealt with and the film does so, but not as neatly or imaginatively as you might hope. It proves impossible to reconcile the two parts of the story, monster in Seoul and monster in soul, in a way that serves both threads well. It is hard to root for Gloria as she finally steps up the the heroine role the monster in Seoul story thread demands, because we've seen she's really a bit of a hopeless selfish drunken stupid girl. <br><br>Colossal is imaginative, flawed film blessed with exceptional performances from Stevens, Hathaway and especially Sudeikis. It is not a comedy, it is not a monster movie (though there are loads of loving homages in shots and music cues), it is not an indie redemption movie, it is all of those things together, and it is not a total success, but nor is it a total failure. It is a curiosity, and if you are cinematically curious, you should check it out.","user":"soxlade","rank":[107,137]}]