[{"title":"Not the worst, not the best","rating":6,"date":"27 April 2017","review":"I read on here that some think it is a horrendous movie and others think it's a very good movie. It's none of the above. Saying it's horrendous is ridiculous because it isn't that bad. Saying it's a very good movie is also ridiculous because there are way better movies in the same genre then this one. It's an average movie worth watching once and then forget about it. The cast isn't bad. All actors did their best playing their respective characters. It's just the story that could have been better. It's all a bit guessing what happened but it's just a bit too slow and too long before you get some answers. They try to make it creepy but it isn't really and that's why it's just an average movie for this genre.","user":"deloudelouvain","rank":[31,35]},{"title":"Ignore Bad Reviews - This is a Good Story and Entertaining Thriller/Mystery","rating":9,"date":"7 May 2017","review":"I don't understand the bad reviews. The one that first came up said the movie was slow and boring. It is for only about 10-15 minutes, but then the story picks up and it is a very good story. The eeriness is a key element of this movie and it is a true mystery. We all enjoyed it very much and would highly recommend it if you enjoy psychological thrillers.","user":"sanclan","rank":[24,31]},{"title":"Absolutely loved it","rating":9,"date":"19 March 2017","review":"This was an unsuspected surprise. I did not have much exception about this film and by the end I was surprisingly satisfied by the experience. This is a ghost story that glides on atmospheric buildup and unhurried storytelling. Unlike the current series of horror movies that rely on hyperkinetic scenes to get a jump scare out of the audience, Lavender creates a world of hallucinatory reality. I would not indulge on the story line here but I would brush on number of elements that I really enjoyed about this film<br><br>1. Soundtrack, incredible amount of work has gone into creation of this soundstripe. This is an orchestral piece which is composed of many many layers of unique instrumental arrangements. They are quite original and composition really enhances the haunting visuals.<br><br>2. Photography, as with the soundtrack, the movie is inhabited with many equally stunning shots that brings out the almost fairy air amidst the horror. <br><br>3. Abbe Cornish is clearly in command here. I would say that she carries the movie all on her own. She delivers a multi-layered character performance which is mesmerizing on every scene she is present.<br><br>At the end if you like a old fashioned ghost story which has no shortage of talent in every department give Lavender a try","user":"geneariani","rank":[41,57]}]