[{"title":"that's enough of Jack Whitehall's testicles for a lifetime..","rating":8,"date":"21 August 2015","review":"Okay, so going into this film i had seen just two episodes of the series so wasn't that familiar with the characters. The show has made me laugh though so i knew that it was at least funny. British sitcoms being translated to the big screen can be very hit or miss, i was hoping it would be funny even with a loose plot like The Inbetweeners Movie or Alan Partridge: Alpha Papa and it delivered.<br><br>Jack Whitehall returns as brilliant as ever as the bad influence teacher Alfie Wickers. Bad Education follows the British comedy trend of taking its characters on holiday, this time in the form of a mental school trip to Cornwall. As you can imagine, this leads to crazy antics. It sounds like more of the same, there is a good twist towards the end though. I don't want to ruin it as it wasn't in the trailers or anything and is actually unexpected. This twist got a bit silly towards the end, but the whole film is pretty silly so it isn't so silly that it completely takes you out of the film. I doubt this will get an international release, but if it does i don't think it is one that will appeal to an American audience. In an interview Jack Whitehall said that exact same thing, the humour is so British, and British at its finest. There are a lot of Jack Whitehall's balls though. I don't ever want to see his balls again. Although, this film features the single most intense scene of a man teabagging a swan EVER. I was genuinely scared for the guy.<br><br>As a fan of the show, i'm sure you will be delighted to see all the characters on the screen again. Actors from Matthew Horne to Harry Enfield reprise their roles and all of the class are here to. They all get moments to shine as well which i like to see in a film with so many characters. In the end, i haven't laughed harder at a film this year. The plot isn't anything complicated, we have seen this sort of humour before, but as a British person if you don't come out of this film feeling you have had even a little bit of a good time then i will be surprised. I advise anyone up for a good laugh to check out the Bad Education movie, it may be silly, but a film with an opening that is an ET spoof featuring Anne Frank deserves to be seen.","user":"kieranbattams","rank":[29,39]},{"title":"Very Enjoyable","rating":8,"date":"24 August 2015","review":"As far as British comedies go, this was one of the best I have seen. Contending with the likes of The Inbetweeners and Mrs Brown's Boys the title stands it's ground.<br><br>Throughout the film the comedy is well timed with some unexpected outbursts and classic schoolboy/girl humour and it is not as corny as you might expect from a film based in Cornwall. The actors have done a good job of continuing their on-screen persona and have added their own flare to the roles.<br><br>The criticism I would give is that in some of the members of Class K there is not a lot of character development. But this is supported by the TV show where viewers of both the show and film will know many of these characters well, whereas an outsider like me couldn't even remember some of their names. This was partly due to the film's plot-line being very heavily based around Jack Whitehall's character, Alfie Wickers. And his testicles.<br><br>I would definitely recommend this movie to anyone wishing to have a seriously good laugh whilst learning just a little bit of History.","user":"joeyjl","rank":[22,31]},{"title":"Enjoyable, but watch series first","rating":7,"date":"15 September 2016","review":"This movie is funny, though I recommend watching the series first, which may even be necessary to actually enjoy the movie. <br><br>The movie in short: The class goes on a trip but of course, nothing goes as expected.<br><br>Since the series has many more or less deep characters, the movie cannot compete in terms of character development. While the series contains on average 6 episodes per season at roughly half an hour (way too short for its quality in my opinion), the movie has to cope with introducing the various students and teachers within the first part of the movie. I am not sure if that is enough to really \"understand\" the situation/background story at \"Abbey Grove\". The characters may seem a little flat/stereotypical if one has not yet seen the series. Granted, \"form K\" pretty much has a member of every socio-demographic (?) group in it that I could think of of the top of my head. This makes the series more interesting, may seem a little forced to be funny in the movie.<br><br>Regarding the humor in the movie, it is exactly what you would expect after watching the series. It is about the same level of sometimes beneath the belt but makes you laugh more often than cringe.<br><br>Personally I am pretty happy with the movies ending. As most people may have experienced, it is an awful feeling when a series that one has really enjoyed watching comes to a close and leaves a feeling of emptiness. \"The bad education movie\" fills the void that the series left perfectly and at least for me, gives the whole story a finish that I can live and close that chapter with.<br><br>I did enjoy the series more than the movie, though it is still a movie I'd recommend.","user":"florp1","rank":[4,4]}]