[{"title":"Entertaining enough, a step to recovery for Willis","rating":24,"date":"24 June 2017","review":"An ex-Los Angeles detective turned PI seeks out the ruthless gang that stole his dog.<br><br>Director, writer Mark Cullen's entertaining beach bum action caper which sees Bruce Willis as Steve Ford return to centre stage instead of small cameos. Thankfully Willis isn't just there to just pick up a pay cheque, its very much his own film, and he's as cheeky and charming as ever. <br><br>The on location feel captures the heat of Venice Beach and Cullen offers plenty of colourful locale visuals. The characters are all quirky and larger than life including humorous Jason Momoa as mumbling gangster Spider and Steve's heartfelt troubled friend Dave (excellent John Goodman). Things get more and more outlandish as Steve tries to solve a number of weird cases. Sadly, Famke Janssen is wasted as Katey Ford. <br><br>With echoes of the recent The Nice Guys (2016) there's a few shoot outs and double crosses with hints of watered down Tarantino thrown in for good measure, Cullen like the moments of comedy set these up with perfect timing thanks to some effective staging and Matt Deizel fine editing.<br><br>Overall, while not Willis' best it's an almost return to likes of Last Boy Scout form rather than Die Hard, still it's good fun and worth a viewing.","user":"amesmonde","rank":[42,54]},{"title":"Don't believe the hate.","rating":7,"date":"8 July 2017","review":"Man, the critics are so full of crap...I don't understand what's wrong with them. Whatever crawled up their ass and destroyed any sense of humour they might have had must have been pretty bad...Personally I found this to be an enjoyable and really quite funny movie. It made me chuckle several times. It also distinctly has some of the same feel to it as some classic 90's movies, which I also very much enjoyed. Rent it or something if you're unsure, but I recommend watching this movie on a relaxing evening when you don't have anything special to do. It's not a complex or intricate movie that requires you to use your brain, and won't win any awards, it's just good old simple fun. Don't expect too much action though. There's very little. This isn't Die Hard. This is, first and foremost, a comedy. One that I, personally, enjoyed.","user":"Eiriksterminator","rank":[45,65]},{"title":"Really wish this movie was good","rating":5,"date":"21 June 2017","review":"Bruce Willis with most famous for his Die Hard series and probably one of the best action hero in cinema history but in the past few years he kinda stuck with a bunch of horrible action movie which really upset me cause i used to be his fan.When i first heard about a movie called Once Upon a Time in Venice staring Bruce Willis with a very talented cast i though damn this movie might be good comeback for Bruce but the result is..... not that great.It may not as bad as some of his previous work i give you that it still not enough to bring Bruce back from the hole.Describe as a action comedy movie with a run time about 1h- 34min but in fact it a slow burn movie mainly about Bruce as a private detective(a very shitty one) solving crime around Venice until his dog get kidnap by a local drug dealer played by Jason Momoa(Yeah Aquaman himself).The movie does have some good sense of humor but sometime it feel force as hell.For the action part it not that much only near the end but it very unsatisfied and the terrible ending just add more bad taste in my mouth.It not a good movie in any mean but if you a Bruce Willis fan you can check it out","user":"phanthinga","rank":[35,53]}]