[{"title":"Smart, sweet, and surprising","rating":9,"date":"11 June 2018","review":"This film defies gravity, which is kindof a miracle. <br><br>I was shocked because it's one of the stronger artistic products I've seen by a creator who had been well known for his work in the industry - Mirvish has directed films before, but he's also written helpful books on independent filmmaking and promotion and was a principal at the Slamdance Film Fest. Normally, entertainment industry folk (in music as well as film) create things and you're like, that's cute, now go back to your spreadsheets. But this film is really smart and beautiful, and Mirvish's artistic choices are almost entirely sound. <br><br>I was also surprised by this film because it is a film largely about dudes' relationships with women - men being flummoxed by women, hurting them, having their friendships affected by them, finding personal growth through them, etc. - a subject which might seem slightly out of fashion to pursue, given the events of the last couple of years. But even though this is the subject, and it does at times feel like it was written by a male from an earlier generation with some slight updating (Sasha Alexander stuck in the orbit of two patently lesser males; outsiders' perspectives on Millennials and their \"apps\"), the screenplay is sparklingly witty, quotable, and even touching.<br><br>And finally, the film's acting is particularly fine, which is usually the Achilles heel of an independent dramedy. (I call it a dramedy because it's not a romcom, and it's not entirely a comedy although there are some laugh-out-loud lines - it's in the same extended family of films like Carnal Knowledge and Sideways.)<br><br>Overall, a really enjoyable film, one that's smart, sweet, and surprising - you gotta see this one.","user":"brian-511","rank":[5,12]},{"title":"male angst","rating":7,"date":"13 June 2018","review":"From a jules Feiffer script kicking around from a long time, we have the story of Bernie and huey, two \"adult\" males, still waiting to grow up. the story, told with flash backs of their younger selves, is not without charm. keep your expectations low and you might have a good time.","user":"cdcrb","rank":[3,7]},{"title":"Not a bad time","rating":7,"date":"15 April 2020","review":"The first thing we must do is write a proper synopsys for the movie, since the movie's creators did not bother to do so: The movie's main character is Bernard, a 49-year-old failed poet now working as a book publisher, who is revisited by his old friend Huey he hasn't seen in 25 years. Huey is just out of a divorce and he needs a place to crash, so he temporarily moves in with Bernard, and reconnects with his daughter he left when she was 10 years old. Lots of sex ensues. (The movie is highly sexual)<br><br>Now, the review: I have to say, while this is classified as a comedy, the movie is not funny, nor did it make me smile once. That is NOT to say that the movie is bad, because it is not, it's just not what the category says it is. It is more of an interesting character study that does not try to be funny. The relationship between Huey and Bernard is unlike anything I have seen before, Bernard is a catalyst for Huey's success, in fact, he seems to help others to succeed while he himself remains a failure. Understandably, this bothers him. And the pair forgives so much to each other without it ever having to be brought up, that was an interesting thing about this movie: it does not create drama out of situations where any other movie would do so. So in that way, it is more true to life.<br><br>There is an interesting scene at the start of the movie where Huey is gravely out of his element, and this scene has an interesting parallel towards the end of the movie that I appreciated, it was a full circle moment of realization. The movie jumps back and forth between different timelines, but does it in a way that is easy to understand so you can follow the story. The movie is definitely stronger in it's second half and delivers a satisfying ending.<br><br>Overall, if you want to watch an introspective movie on a quiet night, Bernard and Huey might just be what you are looking for. It's unusual and balanced, not a bad time at all.","user":"bugger-17071","rank":[0,0]}]