[{"title":"A moving film about depression with a fantastic lead role","rating":8,"date":"24 November 2016","review":"I'm going to write this review as if you had not heard the sensational and tragic story of Christine Chubbuck. If you are unfamiliar with Christine's story then I suggest you do not read into it before seeing this film. I shall reveal very little of it here.<br><br>The story concerns the real life story of Christine Chubbuck, a reporter in Florida in the 1970s. As an opportunity opens up at a bigger news station, Christine finds herself attempting to adopt the station manager's sensationalist approach to the news. The film details her struggle with depression and it's impact on her personal life and work.<br><br>The depression is seen as both the result and cause of Christine 's difficulty in connecting with others. Many characters throughout the film reach out to her only for her to pull away. The cyclical nature of depression is all too familiar but what's interesting here is that each character who reaches out to Christine is well meaning but insist on viewing her depression in their own way instead of actually speaking with Christine.<br><br>At one point Christine screams \"why is no one listening to me?!\" and it's true. No one listens to Christine. Her mother is certain that she just needs a man. The anchor on her news show is certain she just needs therapy. Her friend at the station is certain that she just needs ice cream. Everyone is so quick to offer possible remedies and solutions that Christine is actually overlooked.<br><br>This is exemplified in the \"Yes, but\" game as seen in the trailer for the film. In the game the speaker tells the listener their problems. The listener then suggests a solution to which the speaker replies \"yes, but\" and points out the issues with that solution. The idea may be to get to the heart of the speaker's problems or for them to simply run out of problems and start thinking about solutions but the effect is clear. The issues and concerns of the speaker are being dismissed, one by one. Often with just a few words.<br><br>This portrayal of the isolating effects of depression is very affecting. We see Christine attempt to bury herself in work, buying a radio scanner to listen in on police frequencies in an attempt to find the gruesome story she needs to gain recognition. As we see her hunched over her notepad listening to two police officers brag about sexual conquests, we can see the cracks starting to appear.<br><br>The entire film hinges on Rebecca Hall's ability to play a character who is simultaneously spiralling out of control and deeply sympathetic and fortunately she accomplishes this extremely well. She is magnetic to watch even as she shrinks into the backgrounds of the scenes in which Christine finds herself. Her awkwardness and frustration are told through tiny movements and gestures.<br><br>The film takes some liberties with the real life of Christine Chubbuck. Some people on her life have been omitted and some incidents have been made to occur later than they actually did for dramatic effect. However if you walk into this film without knowing how Christine's story ended then I am sure you will be as shocked as the world was back in 1975 and hopefully you will reflect on how you personally react to depression, in yourself and others. If you're anything like me you will emerge from the cinema desperate to know more about this enigmatic and tragic young woman.<br><br>The film is a very tense and uncomfortable slow burn with some surprisingly funny moments. Performances are excellent all round but this really is Hall's show and is an excellent showcase for her talents as a screen presence.","user":"paul_a_salt","rank":[64,77]},{"title":"Utterly depressing movie is well-made and well-acted","rating":7,"date":"13 November 2016","review":"\"Christine\" (2016 release; 115 min.) is a movie about the final days of TV news reporter Christine Chubbuck. As the movie opens, we see Christine conduct an imaginary interview with President Nixon, who is under fire for Watergate. It is the summer of 1974, and Christine is a reporter at a small TV station in Sarasota, FL. She is not happy with her role at the station (dreaming to be promoted to a bigger anchoring role), and not happy with her life in general (living with her mom, no romantic interest in her life, etc.). At this point, we are 15 min. into the movie, but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this movie, \"based on true events\" we are reminded at the beginning, is a stunning look at the downward spiral of a lonely but ambitious woman, who is determined to make it 'big' in the TV news business, yet seemingly can't catch a break. Director Antonio Campos does an excellent job, capturing the zeitgeist of the nation at that time, replicating the looks and feel of the summer of 1974 almost to perfection (including a bunch of radio hits from that era--now sounding pretty horrible). Even though Christine finds some outlets (volunteering at the local children's hospital), it isn't nearly enough to prevent the sad and horrifying ending. Since we all know going in how this is going to end, it makes for a pretty depressing experience, even though the movie itself is quite good. Rebecca Hall shines as Christine, and she carries the movie on her shoulders from start to finish, but equally outstanding is Tracy Lets as her boss Michael, the TV station's manager who keeps urging Christine to \"just make your stories juicy\" and \"if it bleeds, it leads\". Guess he never imagined Christine would take that to its ultimate conclusion...<br><br>\"Christine\" opened this weekend at my local art-house theater here in Cincinnati, and I couldn't wait to see it. The Saturday early evening screening where I saw this at was attended okay, somewhat to my surprise. It looks like there is some interest out there to find out what drove this woman to do what she did. I don't know that I can recommend this movie all that strongly, since this is an utterly depressing viewing experience, but let me be clear that \"Christine\" is a well-made and well-acted movie for sure.","user":"paul-allaer","rank":[18,20]},{"title":"Not a simple review","rating":8,"date":"10 January 2017","review":"Let's start with a truism.<br><br>Simple reviews are for simple films. This is not a simple film.<br><br>On the one hand, you have a drama based on a true story of a reporter in the 70s who had a nervous breakdown and ultimately self-destructed.<br><br>Films with \"known\" endings are always a challenge because, you have to ask, what is there to hold the attention of the viewer if you already know what happens? Here we have an answer: to hold the attention, we have Rebecca Hall's best-ever performance of her already-solid career. Dressed down, no makeup, she not only disguises her natural beauty (clearly seen in other films she has starred in) but actually creates a character that simultaneously engages and horrifies the viewer at the same time.<br><br>Her portrayal of real-life reporter Christine Chubbuck is not unlike one of those \"suspense\" films about a time-bomb that needs to be defused before it explodes and takes an entire building with it. The manic energy Hall builds is a show-stopper and one cannot avoid the prediction that this performance will be noticed, and honored, down the road.<br><br>On an entirely different level, however, director Antonio Campos never misses an opportunity to paint this story against a broader canvas, a canvas that is as appropriate to the events of today -- this review written on the eve of the Trump inauguration -- as it was during the 70s, when incoming president Ford \"pardoned\" outgoing president Nixon.<br><br>Campos achieves this by clever edits and inserts, the selection of a specific sound bite here, the choice of a special movie Chubbuck watches by herself there (for example, Christine on her free time chooses to watch Carnival of Souls 1962, a film about a heroine who goes quietly insane because she is not sure about who she actually is.) The fact is that the news media is no better today than it was then, and likely much worse. Years ago, MAD MAGAZINE did a satire on the NYT's motto \"all the news that's fit to print,\" re-imagining it as \"all the news that fits, we print.\" An argument can be made that the west's news services (90% of which are owned by only six corporations in 2017) are merely glorified ad agencies. At best, they are pushing endorphins. At worst (check out the 2016 scandal over the DNC) they are pushing ideas into people's heads that are partial and biased.<br><br>If Ms. Chubbuck were alive today, one doubts if she would be any more pleased with the job she so desperately tried to perform.<br><br>Highly recommended.","user":"A_Different_Drummer","rank":[38,46]}]