[{"title":"This Movie Has Nowhere To Go","rating":3,"date":"13 September 2019","review":"Deep character studies can make fantastic films if you have a great performance behind the character. Movies about post-traumatic stress can add a level of drama that a lot of films simply can't. In the case of Lucy in the Sky, this is a film that deals with both for the entire duration. So, what went wrong here? This movie is proof that not every true story will make a worthwhile feature film. This is one of the worst films of the year.<br><br>Following Lucy (Natalie Portman) as she arrives back on Earth after a mission in space, a combination of wishing to go back and not wanting the life she original had begins to take her over. Not only does could that set-up lend itself to a fascinating character study, but I would have preferred it to not be a true story. As I said, this story doesn't have enough depth to lend itself to a full feature film. After setting up where this character has been and where she is now, Lucy in the Sky has nowhere to go.<br><br>Natalie Portman is completely committed to this character and is easily the biggest saving grace of this film. On top of her great performance, there is a very unique way this film is presented. With aspect ration constantly changing throughout the film, it felt like a neat little experiment to have the shape of the screen feel like it was how Lucy was feeling in the moment. Sadly, both of these elements deserved a better film to be a part of. Never once I feel that this was a great character being explored, but rather just a great character, not being explored enough, placed in a terrible film.<br><br>I could try to find positives in the fact that the space sequences are beautiful to look at in terms of visual effects, but those sequences end after the first five minutes. The addition of performers like Jon Hamm or Zazie Beetz should normally feel like an elevation, but they're ultimately underused. The climax of this film felt like it should have taken place toward the middle of the movie, because it wasn't all that exciting and like the rest of the movie, pretty much goes nowhere and makes you question what the point of this movie even was.<br><br>I'm not one who usually bashed on a film, because I like to see the good in most movies, but it's very difficult when a director like Noah Hawley, who I have loved on many television projects, chooses a poor first outing for his feature film debut. After watching this film at the Toronto International Film Festival, it became the first film that I've ever seen at a festival that I straight-up disliked. There are saving graces when it comes to Natalie Portman, the visual presentation, and even the direction by Noah Hawley, in terms of getting great performances out of everyone, but this is one of the weakest stories that I've seen on the big screen in years.","user":"kjproulx","rank":[131,163]},{"title":"It's a mess","rating":3,"date":"13 September 2019","review":"Pretty disappointed in this one. While Natalie Portman's performance is excellent, as is Jon Hamm's, nothing could save this mess of ideas from itself.<br><br>Lucy Cola comes back from space and can't adjust to the smallness of her life. Her husband can't understand. It seems like maybe Mark, a fellow astronaut who's done more tours that she has, does, so Lucy begins an affair with him. But Lucy's displacement is making it hard for her to stay grounded, per se, and she slowly delves into her own madness. There are side storylines about Lucy's take-no-prisoners grandmother and how Lucy became as strong as she did, as well as Lucy's teenaged niece, who is staying with them. But basically, the story is threadbare. It should have relied on strong characters. But nothing felt very authentic to me - not the emotions, not the way the characters reacted. For a film that seemed to be celebrating, or at least admiring Lucy's strong work ethic in a man's world, I felt that the filmmakers dove a little dangerously into archetypal female reactions at times.<br><br>There were a few moments when the form follows function aspects of the filmmaking (letterboxing to widescreen, fisheye lens, background sound) worked very well, and more moments where it was completely incongruous to the story and felt like the filmmakers were just trying to make something artsy and cool (superimposing the moments over the stars, so cheesy; conveyor belt for hospital scene). In the end, the whole thing just didn't hold together and the themes seemed muddled at best. Wish I'd liked this more.","user":"tiff-ing","rank":[65,85]},{"title":"Just a mess of a movie","rating":2,"date":"4 October 2019","review":"This movie is just really painful. I wanted to walk out a few times. The story is just lame and a real mess. Portman does a decent job in the role... but the movie doesn't know what it is or what to do with it's actors. In the end I didn't care at all about the characters and the story just didn't' go anywhere.<br><br>Seemed like it might be interesting... but ended up being just a bit waste of time.","user":"prberg2","rank":[55,75]}]