[{"title":"Intense true story that hits close to home.","rating":26,"date":"26 November 2018","review":"I'm not one to write reviews, in fact this is the first one I've ever done, but I felt I had to for this movie. I saw Every 21 Seconds in Chicago while it was in theaters. I honestly hadn't heard of it (I was planning on watching Black Panther but I was late) Anyway, I thought the poster was very intriguing and it was about to start so I figured 'what the heck, why not'<br><br>It wasn't until the film started that I found out it was based on a true story. That was only the first surprise. I then found out that it was about a TBI survivor. This hit close to home as my sister is also a TBI survivor after a bad car accident. As the story progressed I couldn't take my eyes off the screen. The pacing was perfect, the characters were developed well and the performances were nothing short of amazing. In particular the lead actor, Shannon Brown, who played the TBI survivor. Again, it hit close to home. I saw so much of my sister in his genuine, honest and powerful portrayal of a TBI survivor. His angst, his sudden mood changes, going from happy and smiling to being unhinged in a matter of seconds. His confusion and panic, having to relearn simple tasks that most of us take for granted. It was exactly how my sister went through this living hell. Just a brilliant performance by Brown, I'm now a fan and will be looking for more of his movies.<br><br>The female lead, Kelly Theibaud, was also fantastic. She plays Brown's wife and main supporter. I could easily sympathize with her struggle. I could feel her pain and frustration. The chemistry between the two leads was palpable, so strong. These two brilliant actors were perfectly cast to lead the audience on this intense journey. The entire cast was strong, in addition to the leads, the main Dr played by Jim O'Heir was great. He found a way to give some much needed levity without compromising the intensity of the story.<br><br>The director and producers hit a home run here. Great portrayal of a true story and the film was cast perfectly. Other than one of the friends, there were no bad performances. Even the kids were wonderful!<br><br>So, I ended up not seeing Black Panther that day. Instead, after watching this, I immediately called my sister. I picked her up and we went back that same day to a later showing and we watched it together. She cried more times than I could count. At the end, she had tears of joy. She said this movie perfectly portrays what it's like to have a TBI. It's a great movie purely as movies go, but it's a must see for anyone that has a TBI or has a loved one who does. Thank you for making this movie!","user":"ToddKatzzz","rank":[25,29]},{"title":"A True Human Drama Simply Well Done","rating":7,"date":"21 April 2019","review":"Every 21 Seconds is not as such meant to entertain. It's meant to be a palatable yet realistic look at the aftermath of senseless traumatic brain injuries. It should be said that there are many who never get to attempt to re-gain any new normalcy as this is serious stuff. Brian Sweeney was in the wrong place at the wrong time and he has paid a great price losing so much. His wife, kids, parents, siblings and friends were all affected with those closest suffering along in great measure. The beautiful part is Brian made a fantastic recovery becoming a new version of himself with enough left to build upon. I'd say for whatever meager budget this movie has it gets these core things right to personally engage the viewer. It is a well done piece that celebrates strength in the bonds we share with those we love and the respect we should afford all of our fellowmen. It does so without being preachy or concerned with minutia . It is a very human drama that speaks for love being the ultimate healer. When I was a kid I was moved by the movie Brian's Song and I must say I felt much the same watching Every 21 Seconds. Just park your need for big-budget flicks and production for a well made modest movie with a nicely nested important message.","user":"AudioFileZ","rank":[12,13]},{"title":"One of the better low budget movies out","rating":6,"date":"25 April 2019","review":"Held my interest..acting could be better but it was believeable.. I was happy to find the movie.. worth the watch","user":"wanderer15701","rank":[7,7]}]