[{"title":"Nice try, but not even mediocre","rating":1,"date":"3 December 2019","review":"First things first.\nI hope the team enjoyed the production.\nUnfortunately the film uses almost every bad cliché you can imagine.\nThe mask and special effects are poor. That may have been due to the budget, but it would have been nice if the zombies hadn't all looked like tired panda bears.<br><br>The story isn't very complicated, with a little more effort they could have made it more interesting.<br><br>What bothered me most about this movie, though, was the underground choreography of the fights. It's so bad that you want to shout to the makers: Guys, watch some sword fights on Youtube, you can learn a lot in the process.\nOr better yet, go to some live role-playing games and you'll get to see some good masks too.<br><br>I showed the film to my son (11) to give him a feel for how depressingly badly planned fights can look.\nThe actors try hard, but unfortunately they don't get beyond that.\nIt may have been the script, but most of the time they just seem confused.<br><br>I recommend everyone to save time and to avoid the film.","user":"Kremer-Thomas","rank":[6,6]},{"title":"Shame so much work went into movie... it was generally wasted","rating":4,"date":"4 December 2019","review":"Clearly a lot of time and effort went into this movie and it's nicely acted ( I think the script sometimes makes the actors seem more wooden than they actually are ) and generally well shot. Sound is good too.<br><br>The pace is so slow. The story is simple. Pick up the pace though<br><br>The fight scenes are ridiculously choreographed ( more of a dance than a fight ) with the actors stood waiting for their turn to fight it looks stupid.<br><br>VFX is ropey and please get someone new to sort out your Greenscreen work as you can see an edge around all the greenscreen clips. ( either that or you've tried to fake a depth of field and it hasn't worked and it looks like badly cut out greenscreen )<br><br>I'd love to see more from this group with another movie and another story.","user":"future_release","rank":[4,4]},{"title":"Necromancy","rating":3,"date":"29 December 2019","review":"From the studio that brought you The Jurassic Games, here comes Tower of Silence, which has been described (by its PR department) as \"a fantastical, dazzling love letter to The Princess Bride and Stephen King's The Dark Tower.\"<br><br>When the great sorceress Kaeis captured by a mysterious enemy, her young followers devise a plan to rescue her. So you know, if you enjoy fantasy films about quests and whatnot, this is probably way more for you than me. I mean, it has necromancers and an undead army in it.<br><br>This is director Erik Flynn Patton's first film and he's in his early twenties, so let's hope he can deliver on the promise that he shows in this. It's not a bad first effort and if you enjoy magical mythologies and whatnot, it's probably more for you than me.","user":"BandSAboutMovies","rank":[0,0]}]