[{"title":"What just happened?","rating":4,"date":"29 September 2017","review":"Either this movie sucks, or I didn't understand one bit of it.<br><br>I kept waiting for something to happen... Some event that would clear things up... but it never came.<br><br>The characters weren't particularly likable and their true motivations were never revealed. <br><br>somehow i'm still thinking I might have missed something. they couldn't just have pasted together a story with random people doing insignificant things, right?<br><br>wrong?","user":"strawberrydaiquiri-05361","rank":[31,32]},{"title":"Pointless and makes no sense","rating":3,"date":"24 September 2017","review":"Why on earth would the main character keep the real identity of the kid from his wife when he keeps saying he isn't his therapist? Why on earth did the Parole Officer think the kid was so special? Why on earth would he sleep with a random college student? Why on earth did they mention the teacher possibly molesting him but then nothing ever came from it? Nothing was ever delved into or explained. The therapist knew what Danny did (he admitted it to him), knew he was stalking him and his wife, yet still didn't call the police and kept trying to \"help\" him. And the ending...what the heck was that??","user":"gallagherkellie","rank":[38,41]},{"title":"If I could beat a movie to death with a shovel this would be one","rating":1,"date":"7 September 2017","review":"You have seen this cookie cutter paint by numbers 'mystery/thriller'a million times. Manipulative genius sociopath who has everyone conned, who gaslights everyone because they are too stupid to know any better. A creepy stalker who breaks into people's homes threatens them and gets them to apologize to him and/or gets the people he threatens arrested. This is a tired worn out boring story. It was tired and worn out 50 years ago. Every single stereotypic angle from every single movie remotely like this was thrown in. It is the stupidest most frustrating rich white people doing the dumbest things imaginable movie you will ever watch. It's so aggressively dull it's a new art form.","user":"xhidden99","rank":[44,51]}]