[{"title":"Highly underrated film, refreshingly different.","rating":9,"date":"22 July 2019","review":"Using the Sci-Fi premise of her not being seen was just a vehicle for this movie. The acting was good, the human element off the scale and the feeling potent and heartwarming. A nice change, I will recommend it.","user":"rwgilmore24","rank":[20,25]},{"title":"Hidden gem...","rating":9,"date":"31 July 2019","review":"This movie is wonderful. Such a great message involved within too. They could have ruined it by trying to make it a hero based film, but the later they chose was more relatable and sensitive.","user":"spenceralyce-81949","rank":[13,16]},{"title":"A great refreshing idea, but a little disappointed by the production","rating":8,"date":"19 December 2019","review":"Undoubtedly, the star of the film is Olivia Thirlby, who shines (by herself, ironically), as the girl who no one can see or hear or smell. You might know her as the sidekick in Dredd and I didn't expect her to be this good. And when I say \"by herself\" I mean I am a bit disappointed with the direction and editing of the film, probably due to budget issues, but still. With better, more careful attention, this film could have been a new hit.<br><br>As such, Olivia Thirlby and Alan Ritchson carry the movie, while all the other actors are obviously out of their depth and without direction. But it doesn't matter much, since those two are the main characters anyway. There are some interesting ideas in the film. The \"semantic\" invisibility, not an optical one, where perception is altered completely, is one. It's not a superhero origin story (although it would have made a great one), but a metaphor on how people become unnoticed. The other idea, the main one, is something I don't like to spoil, the root cause of that invisibility, and you have to watch (unfortunately) almost two hours to get to it.<br><br>The story could have been better, though. Holly makes some choices that I don't think Shayne would have ever forgiven. Some of the moments in the plot defy belief, while others are either presented for too long or added at the end, with exposition, like an afterthought.<br><br>Bottom line, great premise, lovely interpretation by Olivia Thirlby, an interesting moral. The rest is kind of mediocre.","user":"siderite","rank":[5,5]}]