[{"title":"Excellent Movie","rating":10,"date":"10 October 2015","review":"Gone are the college days where I had time for anime. However, made time today with some friends to watch the limited release of Boruto: Naruto the Movie, and am so glad I did! <br><br>Excellent tribute to an anime that captivated so many of us! Started a bit slow, but of course eventually picked up. One of the best Naruto movies without a doubt! Hope that the creators of the original Naruto series continue to develop future adaptations, and that we don't lose this enjoyable anime.<br><br>The quality of animation has improved so much, it is mind-boggling. Two thumbs up and ten stars for sure!","user":"Jsam654","rank":[22,26]},{"title":"Moving, funny, and nostalgic","rating":10,"date":"10 October 2015","review":"This movie is the close to it all Kishimoto wanted and he wrote it beautifully. He has a knack for that, and for hitting what I feel are the most important emotional points of a story. The characters are consistent and complex, Sasuke has redeemed himself, everyone has a sense of new wisdom to them, and there are several perfect lines of advice for teaching/parenting which is a strong theme in the series. Beautiful, inspiring, and entertaining film, with more than a little homage paid to notable fights and characters. Must see for anyone who has read and/or watched the series, and if you haven't, please give it a try, at least so you can understand the meaning behind what is happening in the film. You will appreciate it so much when you do. Enjoy!","user":"taitr","rank":[8,9]},{"title":"Let's be honest every naruto movie has been shoddy at best.","rating":10,"date":"22 January 2016","review":"Personally I love the Naruto series, but was always disappointed by the movies. This one however is by far the greatest anime movie I've ever seen before by far. I have never cried during a Naruto scene before, but this one brought me to tears and is likely to be one of the only movies to ever get me to that level emotionally. Well crafted battle scenes, theme, and overall story. P.S. keep watching after the credits as there is an extra scene. Can't wait to see the next series in the naruto franchise because if it'still anything like this movie it will definitely be well worth the wait. Definitely buying this movie on bluray.","user":"oaksquared","rank":[15,20]}]