[{"title":"Movie makers need to learn","rating":2,"date":"8 May 2016","review":"This movie was bad on so many levels.<br><br>1. unrealistic, the \"freedom fighters standing in mid open places, with 5 guns pointing and hooting at them and they don't get hit, after like 100 bullets go past them, and if they had missed at least they would hit the people behind with how center clustered they stood. as well as standing in the middle of a hallway, no cover. not hit once, not before you give the \"guy we don't trust\" a gun to prove himself, then they drop like flies.<br><br>2. When the movie uses the name jar head 3... claiming to be a sort of sequel down the genre.. At least follow the premise from the other movies. Jarhead 1, damn good movie, you follow the protagonist, you get to experience what he feels and how he perceived things, you are in the story, good job! Jarhead 2. Little worse than the first but stile decent enough for entertainment, it follows somewhat the lines of the original.. then you got this thing.... Just going thru all the action movie stereotypes, just as if the director had a list in front of him that he had to check every box on as he made the movie... At least the two first movies tried to be realistic, opposed to just pure classical action movie setup, that no one wants anymore.<br><br>3. The comic relief, the douche bag, and the black hype up guy, and the annoying guy who are useless... WHY ALL THESE STEREOTYPES? seems like the director, just check every box again... <br><br>4. The literal second the last guys die... the rescue comes in, nonchalantly, not even trying to secure the area in case more enemies comes in... I mean, if the rescuers, were so close, that the second the propane tank had exploded and the dust settled, they could walk in... then one would expect they were within firring range to help shoot right? or at least lob a grenade.... So poorly made, in terms of realism.<br><br>5.the plot was weak...","user":"pandalarve","rank":[26,32]},{"title":"Horrid","rating":2,"date":"30 August 2018","review":"It's not often I turn a movie off and don't finish it, but I did with this one. How do you make a military movie, but have absolutely no military guidance in the acting? At about 20 minutes in when they do the training scenario, they fly past every room without clearing them. Then Albright head shots the terrorist holding the HVT without having his weapon shouldered properly or even looking through the optics. That was enough to know this movie was all Hollywood and no military accuracy. <br><br>Don't waste your time","user":"mikek-64990","rank":[5,5]},{"title":"The usual shooting gallery with corny bravado and odd found footage gimmick","rating":4,"date":"9 February 2016","review":"It's originally a delight to see B-movie with more emphasis on realism of marine life than merely blasting guns. Scott Adkins looks better in acting department too as he plays the high rank officer and there's good effort to develop intense scene from military part. However, it soon crumbles with poor Jason Bourne imitation for shady opt, uncomfortable missed machismo and a particularly strange silly man of supporting character.<br><br>The first misfit comes in the form of Blake, the documentary guy. He sticks out like a sore thumb in every scene, throwing needless jokes and ruining the high octane sequence. If there is a need for comic relief, then it has to be done with more finesse and less unsavory method. The film gives almost half of its runtime to create a sense of dread, yet this nagging character singlehandedly ruins it, even more so when the other actors trying to deliver a more serious performance.<br><br>Scott Adkins is more comfortable here, he has good mentor-student relationship with Albright (Charlie Weber), the protagonist. The rest of the squad are decent as well. Then, it suddenly introduces a tough female character who may or may not be a spy, in Top Gun-esque bantering. There's also mandatory nationalism angle, which is not entirely bad, but seems shoehorned in as emotional bait.<br><br>After halfway point the movie pushes the shooting to the maximum volume, gunning for most bullets shot per minute. It's the usual gunslinger military stuff, which is admittedly expected. Nothing too grand, although there are some oddities like people running away from covers and even though Scott Adkins is here, this is not martial art movie, so those expecting intricate hand-to-hand combat might be disappointed.<br><br>\"Jarhead 3\" is the expected cinematic rendition of soldiers filled with testosterone and gunpowder, and also unfortunately a few out-of-elements ridiculous antics.","user":"quincytheodore","rank":[9,11]}]