[{"title":"Threadbare. Uneven. Underrated. HYSTERICALLY Funny.","rating":7,"date":"25 March 2017","review":"I found STORKS in the way that you're supposed to find underrated/cult classics: by accident. When it was released, I bought into the collective sigh of underwhelm that most critics expressed and that was my mistake. It's easy to understand why the critical community didn't like it: in an era where Pixar, Disney and even Dreamworks keep churning out magnificently multi-layered heart-warmers that set the bar stratospherically high, STORKS doesn't register all that well. We've been spoiled by excellence. As a result, we've lost the ability to enjoy the simple pleasures of pure entertainment.<br><br>And that's what STORKS delivers better than babies or packages: entertainment.<br><br>You might have noticed people commenting on how forced and thin the storyline is and how uneven it feels, and those complaints are accurate. The plot is extremely thin (virtually an extended sitcom-sized premise stretched into an epic road-trip format), and the story moves so quickly that it goes too far too fast with nary any breathing room to savor the experience or give the characters the tension or time to build any real catharsis or change. But the characters are so authentic to themselves that you know just about everything you need to know about them from their first scenes.<br><br>I think the main reason STORKS gets such middling reviews in print and here on IMDb is because it's an old-fashioned type of comedy: a screwball-slapstick hybrid. The emphasis on sight gags, pain-humor, and wackiness has generally been avoided in animated films as passe and vulgar--low comedy. The rapid-fire snark between the main characters of Tulip and Junior hearken back to the old Howard Hawks workplace comedies of the 1930s, which is definitely an acquired taste in the post-narrative style of humor found in kids entertainment today--where non-sequiturs and punchlines exist in a vacuum and visual comedy is derived from abstraction rather than plasticity. But the comedic energy and the variety of jokes from modern \"Office\"-style cringe (Pigeon Toady) to the machine-gun-speed HIS GIRL FRIDAYy-style verbal sparring (Tulip &amp; Junior), absurdism (the wolves), post-modern meta-humor (the boy and his parents) to classical WB slapstick of yesteryear, and the film is riotously funny because of it. At the end of the day, that's what STORKS wants to be: FUNNY.<br><br>STORKS is not a great film. It's not a masterpiece like TOY STORY or UP. It won't win any Oscars and it won't be everyone's cup of tea. But there's an excellent chance that it will live on as a multi-generational favorite for the same reasons as dumb-fun-with-a-heart-of-gold treasures like SPACEBALLS, DUMB &amp; DUMBER, THE NAKED GUN, and NATIONAL LAMPOONS CHRISTMASs VACATION:<br><br>Because you can watch it 1,000 times and it will NEVER stop being funny.<br><br>So try it out. There's a 50-50 chance you'll be among the ones who can't stop watching it.","user":"amnesiac12001","rank":[48,51]},{"title":"Underrated - this movie is one of the best animated films out there","rating":10,"date":"12 January 2017","review":"If you want a movie that is entertaining, funny, action-packed with twists and turns throughout - then this movie is for you! The animation quality is as good as any out there. <br><br>The voice actors are sensational. Kelsey Grammar and Andy Samberg and their back and forth bantering is totally brilliant and any of us involved in business can understand the dynamic and completely understand the humour.<br><br>It is one of those movies that you can watch again and again and never get bored.<br><br>Kids love it and there is plenty of content to keep adults laughing.<br><br>This movie is a terrific and I can't understand how anyone could not thoroughly enjoy this movie!","user":"jemseletaria","rank":[48,54]},{"title":"Highly Underrated","rating":8,"date":"29 October 2016","review":"I entered to watch Storks expecting the worse. However, I got an really enjoyable movie.<br><br>The Characters are charismatic and they have good chemistry. In Fact, I LOVED Tulip and The Wolfs were hilarious.<br><br>If you want a funny and heart-warming film, then Storks is a great option for you.<br><br>It's such a shame to see how uninterested was Warner in marketing this film.<br><br>I Trust that in a few years Storks will have the recognition that it deserves, and a big fan base.","user":"grebeigna","rank":[65,82]}]