[{"title":"Hints at a more interesting film than is delivered","rating":6,"date":"17 October 2016","review":"With one of the most recognisable faces in the world, Daniel Radcliffe seems to be making a full-throttle effort not to go down the same road taken by many child actors, and has tried to cast as wide a net as possible when it comes to film roles. Whether it be a man sprouting horns in, erm, Horns (2013), a hunchbacked assistant in Victor Frankenstein (2015) or a farting corpse in this year's Swiss Army Man, his desire to shake shake off the ghost of Harry Potter is nothing but admirable. With Imperium, there's no extravagant make-up or gimmick to hide behind, or in fact any hair, as he convinces as a bookish FBI agent turned white supremacist infiltrator.<br><br>While it certainly doesn't match the intensity of Russell Crowe in Romper Stomper (1992). Edward Norton in American History X (1998) or Ryan Gosling in The Believer (2001) - movies all set within the same world - it is undoubtedly Radcliffe's finest performance. When we first meet his character, Nate Foster, he is bespectacled and brown- suited, taking a literal back-seat as the Bureau successfully entrap a suspected terrorist. We then see what he can offer, speaking fluently in Arabic and using his people skills to settle the suspect down enough to talk. With caesium-137 on the loose and Middle Easterners the target, Nate's boss Angela Zamparo (Toni Collette) feels the FBI have forgotten that threats also lurk from within, and turns her focus instead to a white supremacist hate group.<br><br>Many of the Imperium's best moments are the scenes between Nate and Zamparo, and Collette makes the most of what is a relatively straight-forward role. We also get an idea as to why Nate, someone who is bullied by his colleagues, is the perfect man to go undercover and try to work his way into the inner-factions of the group. He is quiet, mild-mannered and spends most of his time outside of work on his own, but he is also highly intelligent, observant and, most importantly, victimised. While the many skin- heads Nate encounters are indeed burly and terrifying, they all share a sense of misguided victimhood, channelling their frustration and hatred towards a country they feel has betrayed them. Nate may not share their views, but he can empathise on an emotional level, which makes him a perfect fit to feel somewhat at home in such surroundings.<br><br>Director Daniel Ragussis, here making his feature debut, hints at a more interesting film than he manages to deliver. It touches on the inner psyche of these hateful people, and offers some shocking facts about America's dealings with terrorism, and just how much of it has come from white people. However, Ragussis's desire to tell a neat- and-tidy story means that Imperium never rises above routine thriller territory. A few key scenes in which Nate feels the wall closing in on him are very well done, and the script-writing input of Michael German, a former FBI undercover agent turned best-selling author, adds a feel of authenticity. I would also like to highlight the terrific performances of Chris Sullivan and Tracy Letts, the latter stealing every scene he's in as radio hate preacher Dallas Wolf. Imperium is a solidly-made, well-acted film that sadly doesn't strive to be anything more than an exciting thriller.","user":"tomgillespie2002","rank":[56,69]},{"title":"Great idea for a movie, but poorly written, directed, and acted","rating":3,"date":"20 August 2016","review":"If you want to see a film about a conflicted FBI agent infiltrating a modern day white supremacist revolutionary group, seek out the far superior 1988 Costa-Gavras film \"Betrayed\"<br><br>The script follows a basic Screen writing 101 format. Toni Collette, as a cliché seasoned FBI agent bucks the system and all her superiors who stubbornly dismiss her ideas, and she recruits an inexperienced young agent, played by Daniel Radcliffe, to infiltrate local white supremacists on the hunch that, just maybe, they are responsible for missing weapons grade radioactive material.<br><br>Fine... I'll swallow this premise if they can make it somehow realistic and interesting. Nope. The film makers not only showed almost no understanding of how the FBI operates, what these organized white supremacists actually do, but also little regard for common sense. <br><br>This inexperienced FBI agent manages, not only to infiltrate a group of thuggish skinheads, but also to rapidly rise up and infiltrate an organized separatist militia, but an inner circle of careful planning terrorists... all very quickly and easily, simply because the film makers were too lazy to write realistically and just wanted to move things along.<br><br>Radcliffe's undercover FBI agent character, for some insane reasoning of the writer, uses his real name and identity to infiltrate, and does not use any documentation to support his phony backstory of military experience. It also seems as if the only direction he was given was to constantly fidget and look nervous and scared at all times... as though this constant erratic guilty behavior wouldn't worry even the dumbest of people he was trying to fool. <br><br>It is lazy storytelling wherein events unfold and problems are resolved with great ease, because showing the difficulty of infiltrating and investigating would require the film makers to actually think through their story.<br><br>Yes, the subject matter is important and the threat of homegrown separatist groups is a serious threat... far more serious than this movie even seems to understand.<br><br>Important subject matter is no reason to overlook bad film making.","user":"Brendan3","rank":[109,178]},{"title":"Imperium is a powerful drama that will interest those who follow domestic terrorism.","rating":8,"date":"20 August 2016","review":"Radcliffe at first might seem like a poor choice to be cast as a skin head/Nazi, but in fact his characteristics make perfect sense in the film. Radcliffe is a young FBI agent that is chosen to infiltrate a local white power movement to prevent a credible domestic terror threat a la the Oklahoma City bombing from the 90s. This is not an action film with brawls and fire fights; this is a drama that tries to honestly show those involved in the white power movement. Overall this film is engaging and engrossing on its own, but also challenges itself by giving these social villains some screen time.<br><br>It is a very standard film in terms of plot, this is not a film to watch and expect twists and turns. But it tells a very compelling story through character. Each white power figure we see has their own ideas, goals and as the story progresses it shows us not only about white power, but racism and any type of extremism as well. Sam Trammell, Chris Sullivan and Tracy Letts are all brilliant in pulling us into their lives and succeeding in avoiding the obvious stereotypes that all too easily could happen. The scenes of Edward Norton trashing convenience stores and killing from American History X are left out, these are men with families, family/financial problems, hopes, dreams and its fascinating to see how their sometimes noble goals are corrupted into extreme racism.<br><br>The weak point is the ending, and everything has to be knotted up in a 2 hour film. This has the feel of the first 2 episodes of an HBO mini-series. I was left only somewhat satisfied, and genuinely curious about what would happen to each character next – and I guess that is good film making.<br><br>Eye opening and well directed. If you are looking for a drama with almost no action, that mostly avoids cliché pitfalls (other than the obvious but well enough done ending) then this is your flick!","user":"fxdx4","rank":[86,155]}]