[{"title":"Reminds me of a lot of other Scottish and Irish islander comedies.","rating":7,"date":"25 May 2017","review":"'WHISKY GALORE': Three and a Half Stars (Out of Five)<br><br>A British World War II comedy, that's based on the 1949 film of the same name. The movie tells the story of a group of Scottish islanders, on the Isle of Todday, that attempt to steal 50,000 cases of whiskey from a ship stranded offshore. It's set during the 1940s, when whiskey rationing was in effect. The film stars Gregor Fisher, Eddie Izzard, Sean Biggerstaff and Naomi Battrick. It was directed by Gillies MacKinnon and it was written by Peter McDougall (a veteran TV writer). The film has received mostly positive reviews from the critics that have reviewed it. I enjoyed it as well.<br><br>The story is set in 1941, and it's loosely based on true events. The Scottish islanders living on the Isle of Todday were suffering from severe whisky shortage (due to the rationing that was in effect during World War II). When they hear about a ship stranded on the rocks just offshore, called the SS Cabinet, that was carrying 50,000 cases of Scotch whiskey to America, they decide the opportunity to steal the whiskey is just too good to pass up. They're only problem is a Home Guard officer, named Captain Wagget (Izzard), who is determined to maintain law and order on the island.<br><br>The movie is funny and extremely upbeat; even given the subject matter of theft on a grand scale (and in reality a large amount of money was stolen from the ship as well). It reminds me of a lot of other Scottish and Irish islander comedies I've seen (like 'WAKING NED DEVINE'). If you enjoy that type of film, you'll probably get a good kick out of this. I think it's a well made and enjoyable movie, but it's also nothing too memorable though.<br><br>Watch our movie review show 'MOVIE TALK' at: https://vimeo.com/226937840","user":"Hellmant","rank":[13,15]},{"title":"A lovely wee \"shot\" of a different time and culture","rating":9,"date":"12 May 2017","review":"This lovely and humorous little production of a classic tale really made my Saturday night, I came out both invigorated and satisfied. I chuckled and tutted (at the characters) along with the whole audience, and I could feel others tapping their feet along, or really enjoying the music.<br><br>Gregor Fisher proves himself a masterful comedic character actor again, playing a grumpy but wily father and postmaster in the lead role. Eddie Izzard deserves commendation for given depth to a character screaming to be either played as an outright fool, or as a serious and glum two dimensional character. The rest of the cast are fantastic and skillfully directed.<br><br>Overall I would recommend this movie to any lovers of independent feel good movies, it definitely reminded me of how I felt upon leaving a screening of Amelie years ago. Very family friendly, and an ideal antithesis to the stream of ridiculous Hollywood action movies of the Fast and furious 8, triple x ilk.<br><br>And regarding people saying it didn't need to be remade, how preposterous to review a production this way. Stories are retold constantly, its the nature of the beast. One of the beautiful things about the cinema and theatre is the diversity in which a simple tale can be re-imagined, bring it to life in new ways. I can only assume this opinion come from purists who love the original so much they would hate to see anything even slightly different, so any real opinion on this production is unbelievably biased.<br><br>I never give 10/10, because I would reserve that for such amazing pieces of cinema like the Godfather and alike. So understand 9/10 is a very good score.","user":"nlaing1","rank":[18,22]},{"title":"Nothing of the charm of the original","rating":5,"date":"19 January 2018","review":"If you haven't seen the 1949 original - do! it's wonderful and available in blu-ray. \nI'm afraid that this has none of the original charm. I have a love of western Scottish culture, and Patrick Doyle's music is Irish-flavoured, certainly not Scottish. There's plenty of Scottish music available - why didn't they use it?\nI didn't find the fake-Hebridean accents too annoying, as I thought they tried hard.\nSome rotten tomatoes.\n* How was the hold of the 'Cabinet Minister' fully illuminated, when the ship had been wrecked for a couple of days?\n*The church was clearly not an island church - it was in Fife.\n*The music at the wedding was a small orchestra, rather than the fiddle that would have been playing. I found the accompanying music to the whole irritating and out of context. I loved Doyle's music for Henry V, but this is not in the same league.\n*Why were all the cars and tractors straight out of concours motor shows? not a spot of mud on them!\n*Since the DVD cover tells me that much of this was shot on the East coast of Scotland, it explains why the land was all wrong for a Hebridean island.<br><br>Go back to the original!!","user":"jal-76494","rank":[12,15]}]