[{"title":"A movie you just watch once.","rating":6,"date":"12 January 2019","review":"Two guys, a young and an older one, on the road having debates about life and how to live it. On their road trip they stumble on unexpected circumstances and they deal with it in their own way. That's basically the story of The Long Dumb Road. It's easy to watch, mildly entertaining, but it isn't a bad movie. I would not say it's a movie that I'm going to remember in the future, as I probably will forget anything about it in a week. Tony Revolori (Nat) and Jason Mantzoukas (Richard) play the two major characters and it isn't bad, but it's just not mindblowing. Maybe it's just the script as I really liked Tony Revolori's performance in The Grand Budapest Hotel. Nonetheless The Long Dumb Road is just fine to watch once.","user":"deloudelouvain","rank":[12,14]},{"title":"A fun movie good for everyone","rating":9,"date":"25 November 2018","review":"Greatly enjoyed this fantasy film of a young man driving to LA to continue his education in photography and on his way he gives a stranger a ride to Vegas. The stranger is both a life lesson, to the young man, in the realities of living beyond the protective parental middle class environment and in self discovery.<br><br>A very well scripted, acted, and photographed film of a road trip story! My only grip with story is the nominal ending of the flick.","user":"cekadah","rank":[9,16]},{"title":"Some Laughs But Film Deteriorates","rating":4,"date":"6 February 2019","review":"This road trip movie started off well with some humor and a solid set-up but, unfortunately, it just deteriorated as the film progressed, in my opinion. There were some laughs along the way, but most of the misadventures of Tony Revolori and Jason Mantzoukas just didn't work on screen.<br><br>Expect very raw language throughout with numerous sexual references and situations. There are a number of known screen names in the movie but they can only do so much, as the film just never seemed to get its act together.","user":"larrys3","rank":[6,10]}]