[{"title":"Who wouldn't want to spend an hour with 'The Stig'","rating":9,"date":"8 January 2016","review":"An hour and ten minutes with Ben Collins ( The original 'Stig' in Top Gear in case you didn't know ) while he drives cars and flies in planes. It's very much like a Top Gear episode under some slightly dodgy premise of finding a car for a stunt job he's been recruited for, that didn't quite work for me but nevertheless it's a entertaining hour as we know Ben is a formidable race driver and very much respected ( except perhaps by the BBC ). All the same, the man in the white suit comes across as personable and camera friendly. CGI was a bit iffy but the production was top rate. If you are a fan of Top Gear then you'll enjoy this.","user":"gofast14-944-269255","rank":[3,4]},{"title":"I AML","rating":6,"date":"12 April 2019","review":"The film is a semi-documentary look behind the scenes as Ben Collins must pick out the right car for a scene he is going to shoot. He has 48 hours to do so. The whole premise was silly. I can't imagine cars being decided by their performance ability as opposed to their looks and film sponsorship, i.e. Audi supplied the film with vehicles to use.<br><br>The car must be able to accelerate quickly with speeds up to 200 MPH, be used for both on and off road, have some decent maneuverability, and be able to take a few bullets. It went through a gauntlet of vehicles to point out to the audience why each great car wouldn't work, things Ben Collins would already know, but is pretending he is finding out for the first time. It was similar to a reality TV show.<br><br>Eventually we do get to see the scene being shot and the only car in the world right or this combination of driving.<br><br>6 stars for what it was (a car commercial).","user":"nogodnomasters","rank":[0,0]},{"title":"It was like watching a car commercial","rating":2,"date":"16 January 2019","review":"This movie is more like a paid promotion by lot many car manufacturers, the movie offers nothing. Avoid if you can.","user":"sauravjoshi85","rank":[0,0]}]