[{"title":"Terrible","rating":2,"date":"2 September 2017","review":"Some momentary chuckles were the highlight.<br><br>For goodness sake get an Australian actress next time you want an Aussie accent. Wasn't even close and then she only kept it for about 2 lines.<br><br>Don't spend money on this","user":"aloveday-16904","rank":[95,123]},{"title":"Another Swing and a Miss In Female Comedy","rating":1,"date":"9 August 2017","review":"I had a Rough Night seeing this film (Ba-dum, tsh!).<br><br>It's a comedy but all of the jokes and gags I remember from it are ones that are well past their due date. Toilet humor, creepy swinger couple, STD jokes, bad fake accents, and the dumb selfish best friend that ruins the main character's life and acts like a hypocrite just to name a few. There's also much pop culture riddled throughout the film which will likely already date this film within the next couple years or so, such as when the film tries to make a jab at president Donald Trump by having a fictional political candidate who gets praise for posting dick pics to Twitter.<br><br>Scarlet Johansen is the highlight of this film, which is faint praise considering what I think of her performances in Ghost in the Shell, Lucy, and Sing, and the character's friends are almost entirely intolerable and if this were reality she would be best off without them, but of course this movie has to be about how friends are the most important thing in the world even when they're self-centered alcoholics who literally get off with manslaughter. It's a minimum-effort dark comedy which fails to do both at the same time, which is quite important to do as the two tones literally clash with each other and the movie has to backpedal to try to remind you it's a comedy.<br><br>YouTube comedy musician Bo Burnham also makes a minor appearance in this film, and he ends up being both more funny and charismatic than the actual male lead in the film despite his limited acting experience.<br><br>There is very little in terms of plot in this film. It's Weekend at Bernie's with women instead of men. The movie ends with the cliché sort of happily ever after type ending, confirming the characters are all terrible people and having them gloat in being rewarded for it.<br><br>This feels like a product made by machines and algorithms rather than actual human beings, and just perpetuates the stereotype that women are unfunny.","user":"Scarefish","rank":[101,141]},{"title":"Give it a Swerve","rating":2,"date":"21 August 2017","review":"Wow, I don't know how I can even have given it 2 points - everything about this movie sucks; it's badly written, bad acting, totally unfunny and a bunch of characters I couldn't care less about. It's absolute rubbish, totally predictable and you've seen it a million times before - you have been warned, watch at your own peril!","user":"neil-43355","rank":[76,109]}]