[{"title":"\"How to Be a Latin Lover\" is predictable, but pleasant, sweet and funny.","rating":7,"date":"30 April 2017","review":"Eugenio Derbez. Recognize the name? If not, you're probably not a big fan of Latin cinema. But even if you watch only English-language movies and avoid subtitles like the plague, you're likely to hear more about Derbez. He's a Mexican actor, comedian and writer, as well as a director and producer of TV and movies. According to Wikipedia, Derbez \"is one of the most influential creative forces in Latin America, and is one of the most recognized actors among the Spanish-speaking population in the US.\" His 2013 comedy-drama \"Instructions Not Included\", which he starred in, co-wrote and directed, became the first Spanish-language film to top $100 million in worldwide box office. In 2014, Variety magazine called Derbez \"the most influential Hispanic male in the entertainment industry.\" 2017 marks his first starring role in a (mostly) English-language feature film, the comedy \"How to Be a Latin Lover\" (PG-13, 1:55).<br><br>Maximo (Derbez) is living the dream. He's well-ensconced in the lap of luxury and he's a kept man – thanks to his very rich and much older wife (Renée Taylor). This was his plan all along – to use his Latin charms to get a sugar mama and never have to work a day in his life. Maximo was doing great, living in a mansion, driving expensive cars, etc., until his benefactor decides to give him his walking papers, which, in this case, is a copy of the prenup that he signed years earlier. With no money and nowhere to live, he wants to move in with his fellow gigolo, Rick (Rob Lowe), but that wouldn't go over very well with Rick's rich (and kinky) aged lover, Millicent (Linda Lavin). This lands Maximo on the doorstep of his estranged sister, Sara (Salma Hayek), single mother to nerdy, sweet, 10-year-old Hugo (Raphael Alejandro). None of the three of them are particularly happy about this turn of events, but, hey, family is family, right? Maximo fully intends for his humiliating slumming with Sara and Hugo to be a temporary arrangement. He's on the prowl, looking for his next mark. He thinks he finds her in an extremely wealthy widow named Celeste (Raquel Welch), but she seems impossible to get to, especially with her chauffeur (Rob Corddry) doubling as her omnipresent gatekeeper. While Maximo works out a plan, he gets money by conning a couple of bone-headed local businessmen (Rob Riggle and Ron Huebel) and working for the manager (Kristen Bell) at a frozen yogurt shop. Maximo thinks he sees his way into Celeste's life when he learns that Hugo has a crush on his classmate, Arden (Mckenna Grace), who happens to be Celeste's granddaughter. But getting his foot in the wealthy grandmother's expensive doors will require Maximo to teach his nephew how to be a miniature Latin lover and win Arden's affections, while distracting Sara by pushing her into the arms of a neighbor (Ilan Arditti) with whom Sara shares a mutual attraction.<br><br>\"How to Be a Latin Lover\" is predictable, but pleasant, sweet and funny. Although formulaic, its basic premise is fairly original and enjoyable. Derbez is equal parts charismatic and entertaining, while the rest of the talented cast is game for whatever the writers and director send their way. Besides Derbez, this movie also marks a coming-out party of sorts for screenwriters Jon Zack (with only a couple previous feature films to his credit) and Chris Spain (this being his first IMDb writing credit), as well as director Ken Marino. Marino, after acting in over 100 movies and TV shows, doing some writing for each medium and directing for eight different TV series, makes this his feature directorial debut.<br><br>These filmmakers bring us comedy that's a mixture of slapstick, juvenile humor and just good, old-fashioned strange situations and strained family relationships. And all that comes with at least some family values and growth on the part of the main characters. It's somewhat simplistic, but almost always fun. And, yes, there are occasional subtitles (during some of the scenes in which Maximo interacts with another Spanish-speaking character), but this movie is funny and heartfelt enough to entertain all but the most jaded Movie Fans – and strong enough to earn Derbez many more English-speaking fans. \"B+\"","user":"dave-mcclain","rank":[36,43]},{"title":"haters gonna hate","rating":10,"date":"4 June 2017","review":"So reading all the negative comments AND all the positive comments (usually the most suspicious due to fake promoting a movie), I decided to see this love/hate reviewed movie for myself. <br><br>I have to say it was one of the most funny and entertaining comedies I've seen this year, if not THE funniest! Non stop laughs, all star cast (every actor was amazing!), great story, great directing, and a heartwarming ending. <br><br>I have nothing bad to critique about this movie. It was perfect! <br><br>I'm shocked at all the hate for Rob Lowe and Salma Hayek! They played their parts perfectly! And Eugenio Derbez was on point! The Spanish translated dialogue added even more comedy to the performances.<br><br>I'm not sure what all the negative remarkers were expecting, nor what they are comparing it to make it so bad, but this one is a real winner and I suggest you see it and hopefully give this the higher rating it really deserves to out-weigh the miserable low scores.<br><br>10/10 because I can't think of what could have made this movie any better than what it was!","user":"TheTopDawgCritic","rank":[45,59]},{"title":"wear your love like salsa","rating":8,"date":"16 May 2017","review":"Truly silly, but fully enjoyable, \"How to Be a Latin Lover\" hits all the right notes. Eugenio Derbez plays a Mexican who marries a rich woman from Beverly Hills, only to get dumped years later with no money and no idea how to work. Moving in with his hard-working sister (Salma Hayek), he quickly learns that there's something to be said for pulling one's weight...which in this guy's case means some truly awkward things! The movie also takes the time to poke fun at lazy rich people who spend their money on extravagant things (such as a birthday party featuring a certain satirical singer). But mostly, it's just an excuse to have fun. I suspect that they had a lot of fun filming it. The rest of the cast includes Kristen Bell, Raquel Welch, and former \"Daily Show\" correspondents Rob Corddry and Rob Riggle.","user":"lee_eisenberg","rank":[23,31]}]