[{"title":"Smells Like 1980's Spirit","rating":9,"date":"26 July 2019","review":"Bumblebee is the 'unofficial' sixth installment in the Transformers' franchise and it is actually a spin-off. I bought the DVD before coming back home last week, with the idea that it would be a good family movie, and I was far from being wrong. This is not only a great film to watch with the kids, but also the best episode in the saga. 'Bumblebee' takes us back to the year 1987, and it looks and smells like if it was made in the 1980s with a great cast and an awesome soundtrack. I am listening to it while I am writing this review and I am already looking forward to watching 'Bumblebee 2' in theaters in 2022.","user":"OMTR","rank":[27,33]},{"title":"Are you kidding me? Who is rating this movie!?!","rating":4,"date":"1 January 2019","review":"I'm sorry but clearly these have to be biased reviews because that movie got all the hype and it felt like I was watching a straight to dvd movie. Bad acting, except Steinfeld, maybe 15 min of total action, lame and corny jokes. Maybe with the exception of maybe 20 min, the story line was so out of sync and no flow. I was excited to watch this and it left me in utter dissapointment. A movie probably great for preteens, but it was the corniest and worst \"blockbuster\" I have watched in 2018 that was hyped. Terrible. Best part of the movie was the first 10 min.","user":"pcapistrano","rank":[544,942]},{"title":"Heartwarming prequel, but the writing was too amateurish and childish","rating":7,"date":"19 January 2019","review":"Heartwarming story, but seems tailored to be more enjoyable to the 8-12 year old's as an upgrade from the 80's animated series. It's not your expected typical adult action filled Transformers installment. You can tell this was written by an inexperienced amateur writer, Christina Hodson. The directing was fairly decent, considering this was Animator Travis Knight's first live action film he's directed. Not sure why the producers (especially Michael Bay and Steven Spielberg) decided to cheap out on these key elements, and then have to pay for pretty much every fake 10/10 review this film has on here. The film's soundtrack was a good throwback to some good 80's songs. Hailee Steinfeld was perfect as always, but pairing her up with Jorge Lendeborg Jr. and his banana seat bike, made them both look like they were 12 years old. Although still enjoyable, I expected more. Would I recommend it? Yes for kids, not really for adults. Would I see it again? Nope, but I'm sure my 8 year old nephew will. It's a 7/10 from me.","user":"TheTopDawgCritic","rank":[152,252]}]