[{"title":"Come on! It wasn't that bad!","rating":7,"date":"20 May 2018","review":"I mean it may be a bit tongue in cheek, but so were movies like Blazzing Saddles!\nThis is not a Dirty Harry, but then again, all those Clint Eastwood movies were not really any better than this movie or this movie is just as good as !\nThe actors won't get Academy Awards, but they did a fair enough job, it has twists and some predictability, but entertaining enough.\nSo what if the ending doesn't meet expectations. If the crooks do a little bit of good and hurt bad people in the process it's pretty much how the real world is.\nI liked it. The least crooked get to walk off into the sunrise.\nGave it a seven because it's worth more than a six. There are a Hell of a lot really bad movies being, this one is NOT.","user":"Australian1","rank":[7,9]},{"title":"Yeah, I Know....But It Wasn't That Bad","rating":7,"date":"19 May 2018","review":"Yes, it takes place in New Orleans. Yes all the characters are cliched for region. Yes, the entire plot and premise are truly fantasy. But.....It Wasn't That Bad.","user":"PurpleCrayon2014","rank":[11,19]},{"title":"This Independent Film has plenty to offer","rating":9,"date":"21 May 2018","review":"After reading some pretty harsh reviews of Carter And June, I was inspired to add my differing opinion of this film. First off- it is rare to find a movie that has humor, explosions and \"bad guys\" you find entertaining. This movie is aimed at adults with a sense of humor. The humor IS there and hits the right notes. From the main character being more focused on what he's being beaten with than the actual beating to the so-called \"fancy\", \"bedazzled\" strip club owner showing up the Commissioner at a shotgun range; it may not be riotous laughter, but there was out-loud laughing from the viewers.\nSure, there is no clear-cut \"good guy\" in the film, but that isn't meant to be a narrative on the actual city of New Orleans. Just a fun romp in the plausible antics of a group of not always law-abiding citizens of a hyped-up NOLA. \nThe characters of Spencer Rabbit (Tim Omundson) and Darla Mae Twitty (Lindsay Musil) were the highlights for me. Having been a fan of Omundson, I highly enjoyed his performance as a southern gay, flamboyant, gothic gangster strip-club owner. He has some fantastic mini-monologue rants and one-liner quips that steal a scene. He is not the usual clichéd representation of a gay character and, in my opinion, stands up for himself and other LGBTQ characters during his time onscreen. I highly recommend other movie writers to take note of how to write better gay roles from this one. (And his character is a very snazzy dresser to boot.) Lindsay's morally-bent religious character had me tearing up with the amusing high ground her character takes in the name of the Lord. Everyone needs to watch this movie just for these two performances- but stay for the whole thing as it is a fun ride.","user":"kovarfamily-1","rank":[6,12]}]