[{"title":"Cute film with a sloppy story that was hardly a comedy","rating":6,"date":"21 February 2018","review":"This film is Gregory Erdstein's first full length feature film (10 previous credits for short films) as director, producer and co-writer alongside Alice Foulcher who was also the lead.<br><br>It's a cute film directed fairly decent, but with a sloppy story that really had no point to it, and was certainly not a comedy (I did not laugh once).<br><br>It's clearly a low budget Aussie flick that made a decent attempt to tell a story, but failed so in the screenplay. In the beginning, it was hard to tell which twin was in certain scenes. Although the story was based on the struggles of one of the twins chasing her acting career and riding the coattails of her sister, at the end of the film you are left saying \"that's it? so what?\". There was no point to this film.<br><br>The acting was however fairly decent, the score a little too obvious in certain scenes, and the editing could have been tighter. This film missed the mark in telling the story better. Certainly not 10/10 material the other two fake reviewers posted, of which are clearly a spoiler plot summary. Would I recommend it or see it again? Nope. It's a very generous 6/10 from me only because it's a low budget indie Aussie flick and for its \"cuteness\" factor.","user":"TheTopDawgCritic","rank":[13,19]},{"title":"Not a bad film.","rating":7,"date":"6 March 2018","review":"This film tells the story of Polly who is an actress and so is her identical twin. While her twin takes whatever job she is offered, Polly wants the big important meaningful role. Polly turns down a role on a soap as she thinks it is beneath her. However her twin takes it and is catapulted into international stardom. <br><br>The film was enjoyable and well acted. Polly and her twin are played by the same person. Although her twin is not seen all that much. It is quite slow in places and Polly doesn't always come over as that likeable. She does seem to be her own worst enemy. I think an only child would struggle to relate to the film, especially when the parents try to make Polly feel important but they know it is the other twin who really is. <br><br>I am glad Polly decided at the end to become the fat nurse (you need to watch the film for it to make sense)","user":"LLgoatJ","rank":[4,5]},{"title":"Wonderfully funny film","rating":10,"date":"13 June 2017","review":"This played at the Sydney Film Festival to a packed house, and was an absolute delight.<br><br>Alice Foulcher, plays an identical twin, Polly, whose sister Amy is winning all the acting roles. Things get worse and worse for Polly, as she gets mistaken for Amy, and passed over for auditions due to being \"the other one\". Her parents seem oblivious to what she is going through, and it only gets worse when her sister is all over the internet due to dating Jared Leto. Whereas Polly, when she googles herself, is nowhere.<br><br>All the cast are strong. Belinda Misevski as flatmate Ariel is great. So is Rowan Davie as Oliver, the modern-day hookup from hell.<br><br>The ending is bittersweet albeit a bit quick, and leaves you wanting more. There would be room for a sequel: perhaps Polly could have another (even more disastrous) stab at Hollywood.<br><br>It is mystifying how they made it on a budget of $60k, it easily looks like a $1m+ production. The only time it looked slightly tighter on budget is with the LA scenes, but they're also some of the funniest and most poignant. Isabel Lucas is brilliant here as another Australian actress who has kind of made it in Hollywood, but is still struggling for roles. According to the director, Lucas's scenes (supposedly set in LA) were actually filmed in Australia due to scheduling, with Foulcher the only cast member actually filmed in LA. The continuity is so flawless that you can't tell.<br><br>Definitely see this one if you get the opportunity. While it's an Australian film, it's not self-consciously so. It's simply a very funny contemporary comedy that happens to be set in Melbourne.","user":"istara","rank":[11,24]}]