[{"title":"Not the finest moment in the Cthulhu mythos...","rating":5,"date":"12 October 2016","review":"I am somewhat at a loss at how I feel about \"Howard Lovecraft &amp; the Frozen Kingdom\". On one hand then I think it was a nice enough way of opening up the bizarre writings of H.P. Lovecraft to a young audience through means of an animated movie, and without it being too weird and too heavy on the cosmic dread. But at the same time, then I feel that this animated movie, while having the heart at the right place, hardly did the writings of H.P. Lovecraft very little justice.<br><br>The storyline is easy to follow, and even my six year old son was entertained enough by watching it, at least to the point of his attention not drifting away from the animated movie and the story.<br><br>However, what I think was the biggest anchor around the animated movie was the CGI and the textures. It just looked like the movie was halfway done. The textures were blank and featureless, making it appear that the CGI department hadn't had time to go over the finished product to fill in all that was missing. As such, then it just felt like watching a half-finished animated movie.<br><br>When talking about an animated movie, then voice acting is also a very crucial factor. And without proper voice acting, then the animated movie suffers terribly. The voice acting in \"Howard Lovecraft &amp; the Frozen Kingdom\" was mediocre. Sure, some were doing good jobs, but then others were doing half-hearted jobs and they were dragging everything down. But it was impressive with the names that they had managed to get aboard for this project; Ron Perlman, Christopher Plummer, Jane Curtin and the iconic Doug Bradley.<br><br>I am a huge fan of the immortal writings of H.P. Lovecraft and everything Lovecraftian in general. And I can now check this 2016 animated movie off the list and say that I have seen it. It wasn't a memorable experience, not by a long shot. And it is not an animated movie that has enough contents to sustain more than a single viewing, provided you manage to sit through it to the end of course.<br><br>In overall, then \"Howard Lovecraft &amp; the Frozen Kingdom\" was a mediocre animated movie which definitely could have prospered from more levels of detail in textures and CGI. It scores a meager and mediocre five out of ten stars from me.","user":"paul_haakonsen","rank":[15,16]},{"title":"Rather Disappointing","rating":10,"date":"10 September 2016","review":"After visiting his father in Arkham Sanitarium, young Howard Lovecraft accidentally uses the legendary Necronomicon to open a portal to a strange frozen world filled with horrifying creatures and a great adventure.<br><br>When this film arrived for review from Shout! Factory, I have to say I was intrigued. Although I have not read the graphic novel, I do appreciate the work of H. P. Lovecraft and I generally like animation. But this ended up being rather disappointing. The Lovecraft elements are strong, but the animation aspects are terribly weak.<br><br>The animation itself is choppy and reminds me of the old computer game \"Alone in the Dark\". In some sense, this is oddly appropriate, because the game had some Lovecraft elements to it. But if you are going to animate with computers, it probably shouldn't look like you're using a 25-year old animation program.<br><br>The voices are also really strange. Some of the actors deliver the lines naturally, and really understand their roles (not surprisingly, these seem to be the bigger names). But others seem like they're reading off a page without context or inflection. Conversations start and stop in very awkward ways. It's pretty awful.<br><br>What may be the biggest stumbling block of all, however, is the complex plot. Those familiar with Lovecraft may find it perfectly natural, but most viewers (including the children this is presumably aimed at) might be confused. The Great Ones, Old Ones, Deep Ones are hard to keep straight, and most challenging (even for me) is why Cthulhu has another name. This never really clicked for me.<br><br>As much as I support getting more Lovecraft into the mainstream, and introducing him to children, this seems like a less than perfect way to do it. From the sound of it, there might be some sequels coming, and I don't hold out much hope for those either.","user":"gavin6942","rank":[20,28]},{"title":"Take the horror of the ages and market it to kids","rating":4,"date":"18 April 2017","review":"The animation was in this weird in between of god awful and OK. Some parts looked amazing others not so much. Im gonna be honest i couldn't handle watching the whole thing. <br><br>Lets take the story of Lovecraft Cthulhu and all that which is known for being dark, twisted, horrific and make a kids movie out of it a+","user":"elmokun","rank":[4,4]}]