[{"title":"How did this get made??","rating":1,"date":"6 March 2016","review":"You take good actors, good movie technicians, cameras, lights etc. and you make a movie scripted by your sister's brother in law's hairdresser's pool cleaner. (Sorry for the slur, pool cleaner's of the world, you don't deserve it) Then you direct it while playing video games on three screens and randomly yelling \"Action!\" \"Cut!\" and \"Print!\" (Do they still say \"Print?\" Whatever) You hire an editor whose last job was making sandwiches, big sandwiches, overstuffed with filling. You don't bother with a composer, you have a soundtrack CD from some other movie, which you randomly add in, at inappropriate volumes, in inappropriate scenes. I suspect that if the folks at the Youtube channel \"What's wrong with...\" Attempt to do their thing with this movie, they will give up at the 25th minute of the movie as they've already made an hour long video!","user":"lightningslim","rank":[29,33]},{"title":"learn to knit rather then watch this","rating":1,"date":"1 March 2016","review":"Holy crap this is a horrible @#$@! movie. DO NOT WASTE YOUR TIME WITH IT. NOTHING in this movie was good in the least please i beg you learning how to knit for the hour an a half runtime would do more for you then watching this. We could talk now about the cinematography, the lighting, the special effects, the acting, the story, but in the end there is nothing left to say. This was a huge waste of time, I wish I had watched Spongebob instead. Playing a moba would be more fun than watching this. At this point I'm running out of analogies. But the review has to be ten lines. So I'm sorry but. I'm never going to give you up, never going to let you down, never going to run around and desert you. Never going to make you cry, never going to say good bye. Never going to tell a lie and hurt you. Like this show did.","user":"sizleswears","rank":[46,57]},{"title":"Utterly dumb, boring SF.","rating":1,"date":"18 March 2016","review":"I got a simple answer for you, Detective. John Kennedy once said, \"The cost of freedom is always high, but Americans have always paid it.\" \"And the path that we'd never take, is to choose the path of surrender or submission.\"<br><br>I have a weak spot for low-budget, straight to DVD, B-movies. Occasionally you'll come across such a piddling, unknown and unloved film, which surpasses some blockbusters in terms of content and design. But \"Weaponized\" is the first crap movie this year. I had a hard time watching it till the end. Actually everything is wrong in this monstrosity of a movie. There's absolutely no logic, performances are pitifully poor and the special effects are so bad it would be better they skipped it. This is an example that you realize afterwards that the idea wasn't so bad (even though it was used several times), but they screwed it up big time due to incompetence. I wonder why actors like Tom \"Private Ryan\" Sizemore and Mickey Rourke participated. For those two it's a sign on the wall.<br><br>It all starts with a terrorist attack on the Pentagon (with really awful special effects used on historical footage of the Pentagon). The son of Kyle Norris (Tom Sizemore), CEO of the company Black Sun, dies during this attack. This incident makes Kyle an avid supporter of the fight against terrorism. He wants to use the technology developed by his company, with the assistance of Clarence Peterson (Mickey Rourke), for this fight. This technique allows a soldier to briefly take over the consciousness of an opponent, so this person can eliminate himself and other terrorists. Subsequently it turns out this technology is being misused (who would have seen this one coming?) and it's time to bring in detective Mitch Walker (Johnny Messner) so he can save his family, humanity and the entire universe from a possible dictatorship. Intriguing, exciting and original? Nope!<br><br>It all sounds pretty Orwellian and the idea could have been the base of a vibrant, entertaining action-SF. What we get however, is a bland, uninspired, nugatory story, stuffed with hackneyed events, horribly choreographed action scenes set in a fake scenery. There was even at the beginning of the film a military vehicle that was made out of cardboard, according to me. The story is a mishmash of story lines, that were used already in several movies, linked together in a random way. It wouldn't surprise me that they have organized a raffle to pick any possible storyline and knit it all together. And what the heck was that tin robot doing there in the end? Firstly it looked terribly old-fashioned. Robots in \"Robot Overlords\" looked more high-tech compared to this. Secondly, the way it was eliminated, is too ridiculous for words. And why was it displayed in a prominent place on the poster, since it contributed absolutely nothing to the story?<br><br>I can be brief about the acting : painfully poor and extremely boring. Johnny Messner looks impressive when you look at him, but acting is his weakest side. Sizemore tries to be the bad guy, but this attempt was only partially successful. And I don't know where they dug up Rourke. He looked extinct and deathlike anyway. The most ridiculous part can be admired in the end. Despite they have to deal with a rather large organization that possesses a life-threatening, demonic weapon, the amount of troops rushing in at the denouement, is truly laughable. A collision with a pedestrian ensures that more police will show up. Luckily it was going towards the end of the movie, because the urge to throw a heavy object at my TV screen, grew rapidly.<br><br>Should you read somewhere \"Weaponized\" is an action-packed SF with a superb quality of images and sound effects, you can be sure that person has watched this film with an overdose of Prozac in his blood. Even watching for hours at leaves fluttering down while staring through a window, is less monotone and boring.<br><br>PS. Moments you shouldn't miss : An American soldier having troubles with land-mines. Benny Hill would have made a hilarious gag out of it ! And the car trunk on fire. What an amazing stunt.<br><br>More reviews here : http://bit.ly/1KIdQMT","user":"peterp-450-298716","rank":[14,17]}]