[{"title":"a vendetta for all","rating":3,"date":"27 February 2018","review":"Its a bloody movie nearly from the start, a vengance- like kidnapping,extortion and torture,lots of beating and screamcrying.then another one bites the dust as number one victim gets free,but is stupid enough to not run(as i wouldve)then comes the third and fourth guy,like the trolls in the ash-lad fairytails.lots of talk, really angry men,and so on, though fairytails have a happy ending this film doesnot,thereb is a winner,but its not the good guy.there are also some females involved,but they all hate the guys.<br><br>its a film about money,sex,hate,cells , pc's and gravedigging. its a cheap production,so dont expect much, the editing are like showing the whole world war 2 in 5 minutes ,very sparse and few locations.the music are as taken out of a UFO-movie form the early 50*s\ni give 3 stars for stamina,''story''and the acting actually....","user":"ops-52535","rank":[9,10]},{"title":"Sean Patrick Flanery is a gem in this thriller","rating":7,"date":"6 March 2018","review":"Agenda: Payback is a joy to watch, especially if you're a fan of revenge thrillers. Sean Patrick Flanery's Steve Walsh is a witty film producer who has rubbed one too many people the wrong way. He's kidnapped and beaten by Eric Belfour's Peter, who is offering people an opportunity to exact torturous revenge on Steve for money. Based on the premise, one could expect it to be a strong meditation on anger begetting anger, but Agenda: Payback is much more. Between the action-packed story, witty dialogue, innovative editing, and powerful performance by Flanery, Agenda: Payback is a fun watch for anyone looking for an hour-and-a-half of high-octane thrills.","user":"zcorona-27830","rank":[4,6]},{"title":"Actions have consequences","rating":4,"date":"28 March 2018","review":"Steve Walsh (Sean Patrick Flanery) sets up deals that all seem to go south. His investors lose everything and he gets rich. He also cheats on his wife. A lot a people want a piece of him. Peter Farrell (Eric Balfour) one of the victims sets things up as the rest of the film is a guy tied to a chair in a basement getting beat up and tortured. And just when you think the film is going to change gears, we go back to a guy tied to said chair getting beat up and tortured....And just when you think the film is going to change gears, we go back to a guy tied to said chair getting beat up and tortured. They could have used some effective flashbacks to break up all the basement scenes.<br><br>Guide: F-word. Opening sex and nudity.","user":"nogodnomasters","rank":[1,3]}]