[{"title":"Finnish boxing champ loses fight but wins fulfillment","rating":8,"date":"12 February 2017","review":"Spoiler alert: Olli Maki's happiest day was the night American boxer Davey Moore beat the hell out of him for the featherweight world title in Helsinki. Olli held his own in the first round but couldn't make it through the second. <br><br>Why the happiest? That defeat enabled the skilled, disciplined but very modest Finnish boxer to withdraw from the high-powered and highly-financed arena of world engagement and settle into the richer rewards of a simple life with his sweetie Raija. <br><br>That's all Olli ever wanted. He was fine with being European champ, but he's pushed into the world title match and burdened with the onus of Representing Finland by his windy manager Elis. <br><br>Elis hates Olli's modesty and simplicity. His ego demands Olli give him glory. His financial straits require he court rich backers and land a big time purse. <br><br>Elis's marginalizing of Raija drives her back to their \"backwoods\" (Elis's term) hometown, to Olli's frustration and loss of focus. Elis keeps Raija out of the photos and documentary film in order to sell a poster of Olli posing with the stiff and much taller (i.e., incongruously mismatched) Miss Finland. <br><br>The film is as much about Finland as about its historic boxing star. Olli is relieved to walk out of the formal post-fight banquet, preferring to skip stones with his Raija. Finland can similarly be satisfied with its own cultural and economic life, participating in Europe, but not feeling the need to take on the empty glitz of America and the world arena. <br><br>For such unnecessary aspiration is hubris, which In the fight was Olli's error: \"I couldn't see him coming at me. I think I held my chin too high.\"<br><br>In its own modesty the film is shot in black and white, like the documentary we see being filmed, everything low-key and human. Its charm is simplicity and the poignant. Like the dedication on the couple's wedding rings: just the names and date. Like their engagement, outside the bus that takes Olli away, the couple standing apart and not even touching after her acceptance. It's even playful, as Raija's acceptance seems conditional upon him winning the fight — which we know is out of character for both.<br><br>Finally, a reminder why you should always read the full credits at the end. <br><br>In the last scene the young lovers pass an elderly couple holding hands. \"Do you think we'll be like that?\" Raija asks. \"Old?\" \"No, happy.\" \"Of course we will.\" The last credit identifies that elderly couple — whose faces we don't see — as the real Olli and Raija Maki. Their presence confirms this reading of Olli's happiest day.","user":"maurice_yacowar","rank":[10,13]},{"title":"Boxing pic falls short of pre-event hype","rating":7,"date":"12 October 2016","review":"With a prize at Cannes, favourable reviews and complimentary buzzwords (such as 'delightful' and 'impeccable') all in the mix, you could be forgiven for believing that European cinema had chanced upon the next 'Cinema Paradiso' or 'Amelie' and unearthed the next great take on heartwarming universality. Despite this, my suspicion is that the average cinema goer will ultimately come away from viewing 'The Happiest Day in the Life of Olli Maki' slightly underwhelmed.<br><br>It would probably help to accurately define what it is, but here the film isn't shy of a bit of bobbing and weaving. Is it a boxing movie, is it a love story, is it a lovingly recreated slice of history, is it a tale of 'the little man facing mighty odds', is it a wry look at sporting optimism tainted by commercialism and self-interest? In truth, the movie invites each of these elements into the ring, feints and jabs with them, but without ever really hitting any of these targets square on.<br><br>The bulk of the story is devoted to Olli's pre-fight schedule, in the days immediately preceding the big match. So there's plenty of sparring, running and sweating on view, but this is also interlaced with the multiple promotional and commercial events Olli must attend in order to satisfy the sponsors and financiers of the bout. Rather than developing Olli's character (which remains fairly fixed as an affable, modest everyman) this routine is most successful at conveying how an event, which is billed as one man's dream, can incrementally drift away and become something he almost no longer recognises as his own. A man who merely wishes to test his talent, suddenly finds himself as a performer in a grand spectacle, carrying the weight of a nation's expectation on his shoulders. It's not 'one giant leap' to imagine a biopic of astronaut Neil Armstrong treading a similar path.<br><br>If I haven't mentioned the love story until this juncture, it's probably because, despite it producing some of the film's best moments, its presence feels a little token. Narratively, it teases us with the possibility that Raija is a distraction for Olli, dislodging his focus from 'his dream' or instead that she is actually the only genuine thing he has left to hold on to; especially given the fickle nature of the 'media circus' surrounding him. Whether it's preparing for sleep in a children's bunk bed, a stolen kiss at a local wedding reception or stealing an evening for themselves away from the pre-fight hoopla, Raija's wide-eyed openness and Olli's shuffling chivalry certainly imbue the film with some much needed emotional texture, but it's not enough. Given that we've had no access to them before the whole machinery of the 'big event' is in motion, for the most part, it's difficult to see them as much more than chess pieces in a game not of their own making.<br><br>The performances of the two leads and that of Eero Milonoff, as Olli's scheming promoter, all do the film credit, and as an impressively rendered piece of history, it's easy to see the film resonating with a domestic audience. But the rest of the art-house crowd may find the current 7.8 average IMDb rating a little generous; 6.8 is probably closer to the mark. (insert your own joke about the film not being a 'knockout' here)","user":"rossumrobot","rank":[25,43]},{"title":"Falling in love and rising in boxing!","rating":7,"date":"14 March 2017","review":"This is a Finnish sport-biopic that was an official submission for the 2017 Oscars, but did not make it. Despite inspired by a real person, the film only focused on one event, a big event of his life. Sets in the early 60s, the country's one of the biggest sporting event is about to take place. So the pre-event incidents, including the preparation and all those related affairs were detailed in this film.<br><br>It's hard to say that everybody would end up liking it. Especially the sport segment. That's a major drawback of the film, but the other way around this is still very good. Only if you are okay with the facts over entertainment. So as I'm who already saw the film want to give a piece of advice for those who are yet to see it that watch it as a romance film. Yep, it is a better romance film than a boxing film. That's not how the pre developments swings, but it gets there a little late and then ends with an unexpected twist.<br><br>An amateur boxer Olli Maki got a shot at pro boxing, so he's heading Helsinki and making preparation to face the strongest opponent coming from the United States. Not just for him, but for the whole country, it is a historical event. So the pressure is on Olli's team to make the right progress, especially to please their sponsors. Seems it was a smooth ride, until Olli find himself in an unwanted distraction, particularly at that time which is a turning point in his professional life. This is the flavour of romance and the boxing, can those two go along? Is what the remaining film carefully revealed.<br><br>❝This is the shittiest moment to fall in love.❞<br><br>Like any sports films we had seen, this film as well all about pre event hype and the final act is given to the grand finale on the ring. Looks 'Cutie and the Boxer' should have been a perfect title, but this is nothing like that documentary film. It was not Olli's whole life, it was his falling and rising. Falling in love and rising to be a great boxer in Finland. But the problem is, both the things happening on the same time. More like romance versus profession. It's off the ring battle for Olli and can he win it, followed by a real battle.<br><br>Now you would remember other awesome boxing films where love story and boxing had met like 'Rocky', 'Cinderella Man' and many more. This film is not comparable with them, that's the saddest part of it. It's a black and white film, and the filmmakers say that's because to take us 60 years back to Finland. They used film rolls like the old way of filmmaking. Indeed, it worked, it was the backbone of the film along the great cast. There are many characters, but revolved around only 3-4. The dialogues were minimised and let the pictures talk.<br><br>The good news it was a 90 minute film with a decent pace. The one who played Olli was really good, but even in little lesser than that role, Raija enchants us. I can't forget that smile, it still appears front my eyes. Not just Olli, you might as well fall for her (at least for the actress who player that character). I also come to know the real couple's cameo for a brief was in the final scene. This is not the finest Finnish film I've seen, but I respect biopics as they tell the truth. It seems a better film for the older and matured guys, like above 30-35. But stay away if you are looking for a pleasure.<br><br>7/10","user":"Reno-Rangan","rank":[4,5]}]