[{"title":"This is what happens when non-actors try to act","rating":1,"date":"26 September 2016","review":"I've seen a fair few KSI and Casper Lee videos over the past few years. I'm 20, so their videos are aimed for that kind of age. I didn't expect this film to be good, because KSI has tried to do things outside of making Youtube videos, for example: rapping, and they just do not work, and my expectations were not disappointed. It's his ego that is the problem. Casper, I feel, is more likable as a \"Youtuber\", but this film? It is just so, so bad.<br><br>It's the typical \"we don't have a good script so we'll just use loads of crude jokes\" kind of film, it lacks depth or any sort of meaning, it just, exists. It's not funny, the jokes are old and painfully predictable. KSI's brand of loud-mouthed swearing is boring now and this film really shows that, he just has no idea what he is doing. In saying that, neither does Casper. Acting is just so far out of these guy's world and it really shows in this film. <br><br>I didn't expect a film with KSI in it to be any good, but this is an absolute disaster of an attempt to make anything entertaining, meaningful and/or enjoyable.","user":"MovieGuy_abc123","rank":[50,68]},{"title":"Finally, a Movie to Rival ShawShank Redemption","rating":10,"date":"2 October 2016","review":"This movie has everything. British people. Scathing social commentary. A hilarious pun for a title. It wasn't until the fifth viewing that my boys and I realized that 'Laid in America' is a play on MADE in America. Once Peter, our youngest, pointed this out, we blew our milkshakes out of our noses. Whatever wordsmith was responsible for such exquisite wit deserves nine Oscars immediately. I'd even say give him ten titles, but I wouldn't want the creators of this gem to get big headed about it. <br><br>Even the slogan. \"You'll Always Remember Your First Time\". That alone tells an infinite amount of stories. That's how layered this film is. First time? First time for what? Sex? That's what the title of the film implies, but how can we really tell? *Spoiler Alert* It was about sex! <br><br>Brilliant. Brilliant all over the place.","user":"obeyjordanedward","rank":[63,91]},{"title":"Laid out to Die","rating":1,"date":"3 October 2016","review":"That's what should be the name of this movie because it's so God awful. It stars two guys from Youtube. Well, hell. I mean if Youtube could give us the Biebs, surely it could give us it's version of Thelma and Louise, Riggs and Murtaugh, Laurel and Hardy, Turner and Hooch....Caspar and Olaji...ummm...KSI, two Brits whose comedic finesse is nothing short of a disgrace compared to the legends of British comedy like The League of Gentlemen, Monty Python, the Mighty Boosh. <br><br>In a lot of ways, this movie is like American Pie...but without the babes or the humor or the good actors. I suppose you could say it is sort of like those later direct-to-DVD National Lampoons' movies....but worse. Surely you know what I'm talking about. However, as I think more about it, If I were Caspar or KSI and someone offered me a boatload of money to do a movie, however terrible it is, I would do it too. After all, more money to purchase a new....Lamborghini. B*tch I know you see me! In my Lamborghini!!","user":"MinistryofDoom","rank":[32,45]}]