[{"title":"A rare insight into the CULTure of Jehovah's Witnesses","rating":10,"date":"31 May 2018","review":"As an ex-JW from a neighbouring area, I am blown away by the accuracy of this film. Kokotajlo has masterfully pieced together a dynamic representation of the life of a JW family. One that is being torn apart and a story that all JW's have experienced, to some degree, either directly or indirectly. The viewer is transported to a place that is closed off from \"the world\".","user":"lq-68438","rank":[84,101]},{"title":"Authentic and truthful (I was a JW for nearly 40 years)","rating":10,"date":"21 July 2018","review":"Last night my wife and I went to a screening in Sheffield and the film's writer and director was there to field a far too short Q &amp; A session afterward.<br><br>It wasn't an easy film to watch and, in hindsight, it really only exposes the tiniest tip of what is, in reality, a truly gigantic, ugly iceberg. For someone like me who was a JW for nearly 40-years and had been either a ministerial servant (deacon), or elder for most of that time, it had an additional layer of uncomfortable poignancy.<br><br>Notwithstanding all the remedial good we've done, or attempted to do since we came \"out\", with a fly-on-the-wall film like this you can't help being reminded of the harm you undoubtedly caused even though the \"help\" you were trying to give at the time may have been well-intentioned. The road to hell truly can be very often paved with good intentions.<br><br>The film will have a very strong emotional impact for ex-JWs dependent on a number of salient factors. How long they were in...how long they've been out...how much deprogramming they have had or pursued subsequently, and how much damage they suffered during both their time \"in\" and/or how they've been treated following their exit.<br><br>Virtually the whole of the audience was comprised of ex-Witnesses. (This did not surprise me.) Represented there were young and old, men and women, disfellowshipped, disassociated or some that simply faded away. One thing that was agreed on by all, though, was that even though it was a work of fiction that the director had woven his own experiences and memories into, he had managed to encapsulate a real truthfulness into every one of the characters.<br><br>The hard-hearted and judgemental elders. The gossipy sisters. The rather awkward courtship/pairing rituals. The ordinary folks who are emotionally torn and battling to suppress their inner humanity in obedience to directives from \"above\". And overshadowing everything - a naïve, blinkered and unthinking mindset. <br><br>I use the word \"unthinking\" advisedly. Our received mindset actually decried and tried to suppress independent thinking and we instinctively tried to hide from the facts of history as they pertained specifically to the Watchtower Society. Many of us are \"out\" now because we managed to climb over that particular hurdle and start, maybe for the first time, to REALLY start to think!<br><br>It was great that after the screening we were able to have some really good, meaningful conversations... as well as the opportunity to compare scars. And it will be great to possibly meet up with some of them as a way of continuing to provide some much needed support.<br><br>If you haven't seen \"Apostasy\" yet, by all means, search out an opportunity to do so. However, bear in mind that if you are an ex-JW (or a naughty current JW) and do decide to watch it, you may experience some degree of triggering.","user":"bandjblackmore","rank":[78,95]},{"title":"It's grim being a JW","rating":10,"date":"7 June 2018","review":"This film is about being a part of a Jehovah's Witness family in the North of England. I was brought up as a JW in England and this film captures the faith and community perfectly. The location of the film fitted the subject matter with its 'grim up North' Ken Loach style. It is very gritty, painfully accurate, and it captures the personalities of a typical JW extremely well. The performance from the actress playing the mother was very strong. I could see her in so many of the JW parents that I encountered when growing up - \"just come back to the meetings\" is repeated ad nauseum just as it is in the JW religion. This is by far the most realistic portrayal of the JW religion that I have ever seen.","user":"clennox-36208","rank":[82,104]}]