[{"title":"A nice thriller with lots of dialogue. And a twist.","rating":7,"date":"9 November 2016","review":"'Money' is a well-made thriller flick revolving around some dough which is earned unethically by two white-collar friends. A smooth talking professional criminal gets a whiff of the dough and comes to snatch it upfront. But the plan goes haywire and the story takes a twist. Relationships are tested under stress and people don't remain same anymore. 'Money' somewhat reminded me of another great thriller from last year, 'The Invitation', which had somewhat similar settings and premise.<br><br>The movie ticks all the boxes of a good thriller with lot of dialogue and couple of twists thrown in. Script is well knit. The setting of the story is small and neat. Almost whole story is located in a posh residence and its neighborhood. Jamie Barber playing the suave professional criminal with a hard British accent provides a nice touch to the story. But there are a few unrealistic moments in the film where the director and writers took artistic liberty for sake of keeping the story thrilling. And the screenplay is a bit slow paced for a thriller.<br><br>It's refreshing to see Jess Wiexler in a serious role. I'm her fan since I saw 'Teeth' during my grad days. She has a substantial role in this story and it's satisfying to see her in a mature talking role.<br><br>All in all, 'Money' is a good one-time-see thriller which can be enjoyed anytime of the week and any hour of the day. Running for some 1 hour 20 minutes only it packs a decent return on time. <br><br>My vote: 6.5/10.","user":"Prabhat_KS","rank":[26,37]},{"title":"Clever, elegant and excellently paced thriller","rating":9,"date":"13 November 2016","review":"There is not an extra word or an extra shot in Money. Everything is brilliantly calculated to take the audience on a smooth ride. There are no explosions or fireworks in here. It's all about humans making choices and making mistakes based on their darkest ambitions. I enjoyed very much the performances and how the script can flip the circumstances upside down in just a second. There is some kind of seductive coldness in this film. It didn't make me care particularly for any of the characters. Instead I was fascinated watching their actions and decisions. The film kept me intrigued until the very end. The premise is simple yet the unfolding is quite elegant and believable. I recommend this film to anyone that likes smart thrillers that rely on human psychology.","user":"alvaro-congosto","rank":[24,34]},{"title":"A very interesting and intense thriller","rating":7,"date":"26 November 2016","review":"It seems to me that 'Money' is a perfect, elegant and flawless product; a very stylized classic drama. While I was watching it, movies like The Rope (Alfred Hitchcock, 1948) or Wait Until Dark (Terence Young, 1967) came to my mind. The movie is concise, pragmatic and straightforward. Its goals are clear and they know how to reach them. Its message is, on top of that, beautiful, illuminating and not indulgent. The tension is built up in a superb manner for a movie that needs to keep us in suspense. And the director's work with the actors is sublime. With perhaps the exception of Kellan Lutz, more inexpressive, they are all splendid, and that makes the text shine and the credibility of what is taking place escalate. In that sense, the actor's direction is spectacular. At times, the necessity of filming hastily is noticeable, but not so much because of the editing, which is perfect, with just some isolated glimpses that can be observed. However, it is more noticeable in the staging: it looks like there wasn't time to plan a proper communicative meaning beyond what's functional. There is not a genuine relationship between the characters and the space, not a single shot provides more information than what the characters verbally announce. It would have been a spectacular movie if they had taken more risks in that sense. It would have been even better if they had what every movie lacks of: time! But, in spite of that, everything in 'Money' is believable, accurate and intense. Concision, focusing on a single location, a right pace in the dialogues, witty replicas and great performances are but a few of its virtues. In that sense, 'Money' is a complete success.","user":"labutacaazul","rank":[17,23]}]