[{"title":"Compentent independant sci-fi","rating":6,"date":"8 April 2018","review":"Pluses- the mystery and suspense, the sound effects and sound tracking, the camera work, some good thoughtful dialogue and the leads acting which holds together the movie\nMinuses- some wooden support acting, and the plot doesn't entirely make sense how it ends. \nOverall, work a watch if you don't mind more amateur indie sci-fi and don't expect too much, but if you expect something Hollywood polished, action driven, special fx driven or mindbendingly crafted, give it a miss.","user":"drael64","rank":[13,15]},{"title":"Everybody's a critic","rating":8,"date":"28 July 2018","review":"As a rule, critics hate everything. And the few exceptions that prove that rule, show conclusively that art's general audience and the art critics are rarely on the same page. This movie is a good case in point. The critics categorically hated it. And lots of viewers who either never knew or forgot the point of what the general public calls sci-fi hated it, too. Unfortunate.<br><br>It's of note, that within the writing community (and I means books, not screenplays) sci-fi is usually regarded as an insult. For them, it evokes trite stories of little thought, frequently involving large lizards stomping on cardboard towns in Japan. Among serious writers, the term sci-fi has been replaced with s.f., and it's not just a rebranding. s.f., almost always lower case, stands for speculative fiction. The use of the term is intended to remind writers that if a story isn't genuinely speculative, it's probably just sci-fi (meaning crap, usually). s.f. is fundamentally about speculation, not about sets, actors, directors, budgets, or any of the other things that \"critics\" like to harp on, perhaps just to sound smart. To be sure, those things do matter, just like the production quality of any art does. Just not as much as the speculation.<br><br>This movie contains two core aspects of speculation, one well-known and frequently used, and the other fairly original. The first, of course, is time travel. And it's used in this story in the usual way, to travel back and change the past. Arguments abound in s.f. and in science about that possibility, as well as the practicality. The second is the use of nested time travel. Though it's appeared in a few stories over the years, it's not common. It's very difficult to plan and plot. Planning is the process of designing what happens and why. Plotting is how you tell the audience what happened and through which character's eyes. One of the interesting things here, though not explained, is the amnesia in the subjects. Without that apparently trivial thing, there would have been no story because she would have known everything in the moment she woke.<br><br>Think through the plan with me. Wells dies, she finds him. A month later she goes back, as Alex said, and this time, decodes his clue and watch's the video. What's unclear is that if she decides to kill Thomas, why did she need to travel back in time? She could have just killed him in the present. Instead, she protects the video, puts the camera back, buys a rifle and leaves it under her bed. Then she waits several days and sneaks in (somehow) and jumps back a few days, never intending to come back. So did she ever intend to kill Thomas, or just to make her other self *think* she had? Then she hides out giving her other self warnings and clues. What \"other self\" you ask? You'll see shortly. She waits for her other self to go to Thomas and get taken into the lab. In the confusion she sneaks in again with her bomb to blow up the time machine while her other self watches her from Thomas's office. She jumps back, the machine blows up, and she *becomes* her other self with amnesia in the June 2 wake up scene. A straightforward plan.<br><br>But the *story* is only of her other self. And it all works, not because of time travel as much as the amnesia. No, wait. The amnesia, as far as we know, happens after you come back. And she never did come back. Or, did she do another jump, in between, *just* to come back and cause the amnesia. Or, perhaps she ...<br><br>See? Isn't that fun? And speculative, even a bit of science (sort of) thrown in. The real measure of s.f. is how long you keep speculating after you finish the story. And, contrary to the critics, this movie delivers. Are there paradoxes? You bet. Are there mistakes? Yes. And finding those inconsistencies is the other half of the fun.<br><br>There's plenty here to speculate on here.","user":"wlfithen","rank":[16,22]},{"title":"Promising Premise, Reasonable Development, Terrible Conclusion","rating":6,"date":"4 March 2018","review":"While grieving the death of her husband Wells (Noah Bean), who committed suicide, Helen (Lyndsy Fonseca) meets his partner Tomas (Glenn Morshower) that asks her blessing to proceed running their company. Helen returns to her work and out of the blue, she has a blackout for several days. She wakes up at home and receives a phone call from herself warning that a man is coming in a BMW to kill her. She flees and goes to the house of her friend Alex (Zach Avery) to ask for help. They head to an isolated cabin that belonged to Helen´s father and soon Helen learns that she had sent herself to the past using a time machine invented by Wells to stop herself from committing a murder. <br><br>\"Curvature\" is a low-budget sci-fi film with a promising premise, reasonable development and a senseless commercial conclusion. The screenplay is intriguing but could have been better written since there are scenes absolutely ridiculous that should have been improved. Helen overturns Alex´s truck on the road and nobody comes to see or help. Helen, Alex and Kravitz fight in a hotel room and nobody comes to investigate what is happening. The cameo of Linda Hamilton is deceptive for her fans. The senseless conclusion with Helen receiving a correspondence with a flash memory is terrible. But in general the film is not bad and works on the video. My vote is six.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[23,35]}]