[{"title":"We are all low lives","rating":7,"date":"12 June 2016","review":"I write this having been in anticipation of seeing this film for about 15 months. <br><br>Contributing a small amount to their Kickstarter campaign - though that doesn't mean I have a vested interest; it's not like I'm getting a share of the profits or anything - 'Lowlife Love' is the debut self-produced film from London-based Asian cinema distributor Third Window Films. In the game for just over a decade now, Third Window have developed into specialising in a certain brand of Japanese cinema, bringing some of the more quirky Japanese comedies and dramas to the English-speaking world, as well as releasing some modern day Japanese classics from the likes of Takeshi Kitano and Shinya Tsukamoto. <br><br>I was in no doubt, therefore, as to what to expect from director Eiji Uchida's latest work. A former pinku eiga director himself, 'Lowlife Love (gesu no ai)' works to explore the seedy side of low level filmmaking in Japan and how all involved are to some extent low lives.<br><br>To start, you may think you're watching the wrong film: appearing- in-releases-with-increasing-regularity Kiyohiko Shibukawa stars as Testuo, a director that had a minor hit some years back and has been a bit of a bum since in a scenario that feels incredibly similar to the role he recently played in Akira Osaki's 'Obon Brothers'. Ever since, Testuo has spent his days exploiting aspiring actors and filmmakers by demanding high fees to be part of his filmmaking club. Lazily teaching and working on low-level POV porn films with his partner in crime Mamoru, he sleeps with wannabe actresses when not accidentally masturbating over his sister while still living at home, despite now being thirty-nine. <br><br>Though one day, young actress Minami and writer Ken respond to the film club's advert and pay the signing-on fee. With Ken's script one he sees potential in, as well as seeing even more potential in Minami's underwear, he sees an opportunity to re-ignite his career. But not wanting to 'sell out' like others before him, he finds himself struggling to find funds, as well as talent, in realising his ambition, soon realising that all in the film industry are low lives. <br><br>'Lowlife Love' is very much a self-aware piece as a low-budget independent film with some titillation about low-budget independent films with some titillation. Based on many of Uchida's own experiences, the scenes expose some of the realities that those wanting a career in film need to go through, comparing filmmaking to 'falling for a no good slut.'<br><br>Not wanting to be a 'sell-out', Tetsuo is left with little more to do than become a sex addict; the more successful Kano is realises he had to fight hard to get where he is, now exploiting young actresses for his own ends; and Minami, a once meek Christian, soon rises to stardom, using sex to get her way up the ladder, now looking down on Tetsuo whom first realised her talent. Each have to go against their convictions to get where they want to be, whatever they may have once been. <br><br>A low-budget, independent film from a rookie company, there are signs of this throughout. Many scenes are filmed with long takes and perhaps not always the greatest sound recording, though it would appear the budget has been well spread, with less spent on less pivotal scenes to allow for more important scenes towards the film's conclusion to get greater focus. The cast is nicely put together, however, featuring those that have appeared in previous Third Window releases.<br><br>Included in the official selection at the Tokyo International Film Festival in 2015, campaigning for the term 'gesu' to get an official inclusion in the Oxford English Dictionary and soon to get a wider release after its run on the festival circuit, all signs point to this low life possibly giving a little reminder to the Japanese cinema industry of its many weaknesses, though we still fall for it, anyway. <br><br>politic1983.blogspot.co.uk","user":"politic1983","rank":[8,9]},{"title":"...misunderstood?","rating":7,"date":"1 March 2017","review":"...film making before anything? Keep it true to art? be idealistic? have a constant way of life? or be some kind of hopeless guy that do not know another way to live than give a damn about anything? This movie has all these premises and more. Also has very classic camera movements and solid low budget cinematography. You will see rookie actors; aspirants; old lowbrow glories; yakuza; all mixed in a parallel world of filming. Most actors want to play lead rolls or shine a bit in a well produced movie; now here all they are at the bottom so they are trying hard; some with their acting talent; some seducing; some utilizing the power that they have; all trying to succeed in a very difficult industry that devours all your dreams if your a naive. Is a battle; you win or you lose forever.<br><br>Very good song and great finale.","user":"Hombredelfuturo","rank":[5,6]},{"title":"Rather Slow","rating":2,"date":"3 May 2019","review":"I liked the scenes of Japan but the film itself is rather slow and boring. Some hot chicks -- especailly the one right at the beginning who's naked. Japanese girls shoudl do more porn in my book.","user":"arfdawg-1","rank":[0,5]}]