[{"title":"The Kaiser in exile in Holland","rating":10,"date":"2 July 2017","review":"The Exception (2016) was directed by David Leveaux. The movie was produced in Belgium, but the dialog is in English. <br><br>The film is not meant to be a documentary, so we can't take it at face value. However, the basic outline of the story is true. Kaiser Wilhelm II was forced to relinquish his throne after World War I. He spent his remaining years at a secluded mansion in Holland. When Holland was invaded and conquered by the Germans, Wilhelm came under the direct authority of Germany. <br><br>In the movie, a previously wounded German army captain (Stefan Brandt, portrayed by Jai Courtney) is sent to be the commanding officer of the Kaiser's guard. Brandt is a loyal officer, but he is disgusted by the SS atrocities. He falls in love with one of the maids, Mieke de Jong, portrayed by the beautiful Lily James. She is Jewish, but Brandt isn't anti-Semitic, so he pursues his romance with Mieke.<br><br>Historically, Heinrich Himmler, the Reichsführer of the SS, did, indeed, visit the Kaiser in Holland. That visit is the lynchpin to the plot. (If the visit had been invented for plot purposes, we wouldn't believe it. However, Himmler really did visit.)<br><br>The key role in the film is that of Kaiser Wilhelm II, played brilliantly by Christopher Plummer. Plummer is a consummate actor, and he makes the role come alive. <br><br>I think that the manner in which the Kaiser is portrayed takes the movie the furthest away from historical reality. In the film he's shown as a more-or-less kindly old man who loves to feed his ducks. According to Wikipedia, he remained a harsh, haughty aristocrat. However, the movie will only work if we believe that the Kaiser also has a softer side, so that's what we see.<br><br>I want to alert IMDb readers to watch for the work of Janet McTeer, who portrays the Kaiser's wife, Princess Hermine. She has no great love for the Nazis, but she is willing to go to any lengths to see that her husband returns to Germany and is restored to his monarchy. She is a German Lady Macbeth--cold, calculating, and decisive. <br><br>We saw this film at the wonderful Little Theatre in Rochester, NY. It will work well on the small screen. The movie carries an anemic 6.8 IMDb rating. It's much, much better than that. The plot is interesting, the acting is outstanding, and the direction is excellent. Don't be fooled by the low rating--this is a movie that I highly recommend.","user":"Red-125","rank":[105,116]},{"title":"Christopher Plummer","rating":7,"date":"7 July 2017","review":"This is the main reason to see this picture, an old-timer at the top of his game at the ripe old age of 87. Acting skill and impeccable timing still at its best as he enters the character of Kaiser Wilhelm hoping to make a comeback as the ruler of his beloved homeland. He gets scant help from the two principals, Lily James and Jai Courtney, and you find yourself waiting for Plummer's next appearance. <br><br>The story which has been recounted in other reviews is good and is basically a love story between James and Courtney. There is little action in this character study, but mention must be made of Eddie Marsan, who gives a hypnotic and creepy performance as Heinrich Himmler, Hitler's Gestapo Chief. His portrayal is chilling and repulsive and he is an arresting presence on screen (no pun intended). \"The Exception\" is interesting and absorbing - especially when Plummer is front and center.","user":"GManfred","rank":[40,46]},{"title":"An underrated movie with great acting.","rating":8,"date":"16 July 2017","review":"This is a movie and in my humble opinion is totally underrated. Yes, there are a few flaws but don't most movies have them? The story starts off slow but soon picks up and keeps you interested to the final credits. Christopher Plummer as usual plays the part to perfection. As do most of the characters in the movie. I really enjoyed this movie and highly recommend it.","user":"kendmonk","rank":[42,53]}]