[{"title":"Decent thriller but nothing new if u have seen Eden lake, Storm warning n Preservation.","rating":6,"date":"5 October 2017","review":"Saw this recently on a pirated DVD. It is about a couple who retreat to the woods on a romantic camping trip. Things don't go well....... Nowhere close to Eden lake, Preservation or Storm warning. These names should be suffice to explain in short what this movie is about. In Eden lake, the tension, violence n the ending was shocking. While in Storm warning, the gore n the killings were brutal. Preservation was decent but Killing ground failed to impress. Well, it wasn't boring or messed up but at times i found it hard to sit through certain scenes. Two things i cannot bear even on screen is rape n any harm towards kids. Thankfully the director avoided abusive scenes but even some off screen scenes were a bit too hard for me. The character development of the bad guys were done well. They are given nearly as much screen time as the main leads. The bearded villain looked like Mel Gibson from Blood father. The movies non linear approach to story telling might appeal to some viewers but there isn't any originality in it.","user":"Fella_shibby","rank":[37,48]},{"title":"It Almost Made It!","rating":6,"date":"3 August 2017","review":"I give this a six because honestly I had planned on giving it an eight. That is up until the end. I won't give it away, of course, but simply saying here it is the reason for a two point drop in rating pretty much says I feel it seriously damaged the film.<br><br>Now this may be my opinion only. May be my pet peeve, actually. Back when IMDb had a forum I would rant often about the current trend in movies to have such endings as this, and thankfully found I was not alone in my dislike.<br><br>What about the rest? Very suspenseful film making with a unique twist to what would otherwise be another \"Deliverance\" meets \"Wolf Creek\" psychos in the wilderness tale. The time anomalies were at first hard to grasp but once grasped became compelling (two time lines between two sets of characters yet you are not aware of the time disparity till, well, you become obviously aware that these people are not in the same time though are in the same place). Once everything catches up and the story is happening in the same time frame the film continues to be hectic, surprising, and nerve racking.<br><br>The performances all around were good. No sour notes or bad actors among them.<br><br>So what bothered me? Well... like I said, the end. There wasn't one. Not a proper one anyway. The fate of one character is never addressed, just left hanging, and the two main characters never have that conversation that they so desperately needed to have and share with us! The film simply went to a blackout. And so like the fate of that hanging character, we the audience are left hanging. At least I was.<br><br>The lack of proper denouement in current film is to me a sign that writers and directors simply have no idea how to end their projects; and so they don't, chalking it all up to \"art\". It isn't art it is laziness. That or poor education.<br><br>This film could have been a classic.","user":"songod-95003","rank":[26,35]},{"title":"KILLING GROUND shows how good a survival movie could be if it is well scripted, acted and doesn't try to cash in on cheap tricks.","rating":8,"date":"4 August 2016","review":"Young couple goes on a trip to an isolated beach and discover that they are not alone. Someone else had put up a tent there and then abandoned it. As time passes by and the owners of the tent do not return, the newcomers start to suspect the worse. Then all hell breaks loose <br><br>If you are a horror fan like myself you'd know the premise of KILLING GROUND. It all had been done before. What makes this movie stand out is its extreme realism and \"no holds barred\" attitude. It is at times a hard, edge of the seat viewing, but a rewarding one in the end. KILLING GROUND shows how good a survival movie could be if it is well scripted, acted and doesn't try to cash in on cheap tricks.<br><br>The story moves back and forwards, explaining bit by bit what happened to the first family and adding a sense of danger to the present. The villains are despicable, but down to earth real, which makes them even more terrifying. The performance of Aaron Glenane is particularly good. He gives us a small town psychopath, for whom murder is nothing but a daily routine. <br><br>The film does not shy away from gore moments, but does not glorify them. The pictures our mind can draw are much scarier than what's on screen, and it's what makes KILLING GROUND tick. <br><br>With all its tension KILLING GROUND is a pretty much conventional survival horror film, but there are so few good ones are out there. You may complain about its \"unoriginality\" but it is a horror movie you won't soon forget.<br><br>QUICK FACTS<br><br>During Q&amp;A director Damien Power said that the inspiration for the film came to him as an image of an abandoned tent and a thought – what the worst could have happened with its owners?<br><br>While shooting a film, Damien Power wanted a viewer to feel that \"the rule book of horror was thrown out of the window\" and that \"no one is safe\".<br><br>KILLING GROUND will go on general release in 2017.<br><br>(Please read my blog here:http://pashasfilms.blogspot.com.au)","user":"mjfhhh","rank":[53,84]}]