[{"title":"Not Good Enough","rating":4,"date":"18 May 2018","review":"I have not watched the anime yet, nor had any other background information on the story. Therefore, I can't say if this movie follows the anime perfectly or it was a disastrous live action. For what is worth, it was kind of enjoyable, though it was so fast paced and idiotic at some points that lost the good qualities that this movie actually had. Yamazaki is back again with another student character, this time though, with super powers and bright pink hair. I do like him as an actor, to be honest, and it was the only reason why I picked up this movie. But, in here, he's just okay. Not bad, but not outstandingly good. Maybe the script didn't help him, however. The other actors were okay as well, even though that girl did overreact at some points. The plot, on the other hand, tried too hard to make the movie anime like and some of the jokes ended up to be just silly comical scenes. Unfortunately, I doupt that I'll remember even watching this movie.","user":"pennyelenabooks","rank":[5,7]},{"title":"The Disastrous Life of Saiki Kusuo live action is a total disaster","rating":1,"date":"3 December 2018","review":"If you a fan of the manga or the anime please do yourself a favor that is save your time and money and not spent it on watching this load of hot turd cause watching this movie is like watching an extremely talkative Kusuo who hate coffee jelly to the guts or a boring ass Nendou or a so over the top version of Teruhashi to the point that it make the anime counterpart of her seem bearable and if all of that not a big middle finger from the director Yuichi Fukuda who I highly praised for the excellent job at adapting Gintama into live action movie to the source material and the fan then I don't know what else.","user":"phanthinga","rank":[7,13]},{"title":"So cute and funny","rating":10,"date":"25 March 2019","review":"Honestly this was so refreshing! The cast is so colorful, and they play up their anime counterparts so well. As someone who's enjoyed the anime, I think they did a fantastic job translating everything into live action. The low-budget effects of the floating cars and fake backgrounds really lended themselves well to the gags.<br><br>I especially loved how well the main character kept a straight face. It almost felt sometimes that he was almost about to burst laughing, but he always kept it together. I also thought the wigs and costumes were done especially well. It's obviously fake hair, but with how colorful the uniforms and setting is, everything blends quite well. The fact that every character is ridiculous, and strange occurrences are dismissed really helps with immersion. Instead of focusing on how bizarre their world is, the characters allow the story to move along.<br><br>The short of it is this: this is a live action adaptation that stays true to the anime (it doesn't try to re-write any characters or anything frustrating like that!). It is colorful, most of the acting is quite good, the gags are funny, and it's light-hearted. This isn't some deep drama, I'm surprised the other reviews are so low. If you enjoy the silliness of the anime, it's reflected quite well in the live action, especially considering the budget and that it is real live people.","user":"its_mida","rank":[2,7]}]