[{"title":"What a pleasant movie for both kids and adults","rating":8,"date":"29 June 2016","review":"I almost missed this movie - that my daughter at 8 and her coisin at 10 wanted to see - after reading the harsh comments here on IMDb. 5/10? come on!... But I decided to give it a go. And what a pleasant surprise it was. The animations are superb, I missed nothing here compared to Pixar and Dreamworks. And the story and screenplay was above average too. I could name dozens of high profiled animation movies with worse stories. I was entertained all the way, and had to stop myself from breaking out in applause at the end. There's something this studio does in its own way, which is not typical the big studios, and thats refreshing. Looking forward to their next piece. Im giving it a solid 8 out 10, and will definitely recommend this film to everyone. A very fine piece of art. Thank you.","user":"clj-5","rank":[30,42]},{"title":"Near Pixar Quality Animation, Not Pixar Quality Storytelling","rating":5,"date":"16 April 2016","review":"It may not be fair to compare an independent Belgian animation to industry dominators like Pixar, but the film industry is competitive. <br><br>This film has excellent animation considering it was made by an independent company. Many vibrant colours are featured, and although the don't burst of the screen like Rio, it does add to the aesthetics of the film. Yet, it does feel like the film is very self contained, but it doesn't impact it in a good way. The setting explored (or not) has a lack of scope and the film clearly suffers from this. But for kids, this will not be a problem.<br><br>Despite strong design and animation, the direction is nothing notable. There are a maximum of two slightly interesting ideas (in the form of transitions) but other than that, everything else seems average, with no courageous attempts add to adding anything to the story.<br><br>Unfortunately, the film falls flat on the storytelling (particularly through dialogue) which just results in everything being cliché and predictable; it brings nothing new to the table. It appears that the writers just gave up, a shame considering if the dialogue wasn't so forced then the film wouldn't suffer so much. There isn't even an innuendo to keep the adults entertained. <br><br>This film is a good way to keep the kids occupied for 90mins, but nothing that adults will obtain any pleasure from (unless you are in awe of the animation which I doubt you will be).","user":"tiagodb","rank":[30,42]},{"title":"Not as bad as reviews say","rating":6,"date":"8 March 2018","review":"I went into this movie not expecting much, the reviews I had read where not very promising but I thought well it is still worth a try. It is not as bad as reports say. The story was fine, I like when movies take another point of view of a well known story, makes you look at things in different ways. The characters were entertaining and the graphics were good so I don't see much of a problem with it.<br><br>I will say the two of my kids that I watched it with (ages 10 and 3) did walk away from the movie to do other things but I don't think that was due to the movie but interest in doing other things at the time but take it as you will.","user":"zzzorf","rank":[4,4]}]