[{"title":"The best Christian movie yet","rating":10,"date":"4 July 2019","review":"This is a heartwarming and very well done story of a young girl who is struggling with grief and the horse that helped her to overcome it and find a new lease on life. The acting is superb, the directing is excellent and the script is real life and emotionally engaging.<br><br>From the beginning I connected with the actors and the story, through the ups and downs and the difficulties. It reminds me of movies that were once made but now are rarely seen coming out of Hollywood, or anywhere else for that matter.<br><br>To my mind it's the best Christian movie I've seen yet.. it's not preachy as some are, nor is it cheap feeling with poor acting or scripting. From beginning to end it shows that with love, support and trust we can face the life issues we all must face at one time or another, and in that find the courage to stand up with trust and faith and continue on in spite of whatever might come our way in life.","user":"johnironbear","rank":[10,15]},{"title":"Horse From heaven was funny, inspiring, and I want to see it again","rating":10,"date":"15 June 2018","review":"I just attended the premiere of this movie and it was one of the most fun audience experiences for me and my family. The whole audience was laughing, crying, and commenting during the whole show because we could all relate to the very likable characters...as well as some of the more sassy ones. <br><br>I overheard one of the young audience members say, \"I wish there were more films like these.\" I couldn't agree more. These days, it is so challenging to find a movie that the whole family can enjoy without being concerned about alarming language or bathroom humor. Even the animated movies are awash with cruddy messages.<br><br>This film is filled with lessons about faith, trust, honesty, friendship, stewardship, compassion. It reminded me of the great Sunday night movies that Disney used to broadcast back in the 70s.","user":"joelletjed","rank":[10,20]},{"title":"Wonderful movie for the whole family","rating":10,"date":"11 June 2018","review":"A Horse from Heaven is a tremendous film. The story is relatable, despite the fact that I am neither a horse or animal lover. It is a story about relationships, faith and healing. The movie has fantastic acting, great cinematography and good humor thrown in occasionally.<br><br>I highly recommend seeing this movie!!","user":"evan-711-309762","rank":[9,18]}]