[{"title":"It's not what you think","rating":10,"date":"8 September 2017","review":"No matter what you might think this is about from the title, you're wrong. IOW, don't not see the film because of it. It's neither a polemic mocking religious faith, nor does it say anything about religion except maybe why don't we all just sit down and start over. All four primary characters are superbly cast, including Danny Glover who is about 3 steps above anything I've ever seen him in before. The subject matter is handled respectfully, albeit with liberal amounts of humor which zeros in on the fact that most religions take themselves way to seriously--which the production company apparently takes to heart, naming itself Pigasus (sic) Pictures.<br><br>This is about as perfect as you can expect an independent film to be. It's only flaw is there being too much lipstick on Daniel--which is so obvious, I wondered if they just wanted to give the audience something to criticize. Needless to say, there's no actual action for the action junkies, but the dialogue and the subject matter are outstanding--and at times, profound. This is my second \"10\" of the year, (18th all time), the first being only a week ago, so I was wondering if coming out of the summer movie drought has something to do with it.<br><br>It' doesn't'.","user":"Stewball","rank":[23,30]},{"title":"Very good movie, but that \"end\"...","rating":7,"date":"9 September 2017","review":"A lot to think about, that's what this film gives you;there will be laughs,and also tense and sad moments;my friends and I had an interesting discussion after watching it, but most of all :no one liked the end ... frustrating ...you see, there's a lot of stories with 'open ends',and most of the times it works; as for this one, we all wanted to see EVERYTHING on the screen,without having to decipher anything at all.Wren Schmidt is lovely here;Glover:finest work ever;Mcginley, hilarious as usual but also moving(must see);Spicer was a revelation to us: very good acting.Don't miss this film!","user":"uqbarino","rank":[15,19]},{"title":"Fascinating Story","rating":10,"date":"23 February 2017","review":"I was lucky enough to see this film and thoroughly enjoyed it! I knew some of the basic story line, but found that I was still glued to the screen as the movie progressed. I was pulled in by the actors and felt their emotions and points of stress! It was fascinating watching how the story grew and changed and how the characters dealt with it all. I work in a church and could relate to the well-acted subtleties of having \"church\" in the mix! <br><br>The movie has some really funny parts and very serious and tense parts. This is the kind of movie that sparks conversation. Please don't miss it!","user":"jebrinkworth","rank":[31,52]}]