[{"title":"Not a lot happens","rating":4,"date":"10 February 2016","review":"The entire movie in brief...<br><br>Waste of space guy with telekinesis has heart attack<br><br>Decides to use his abilities to help people <br><br>Challenges drug dealer to a fight<br><br>Drug dealer shoots his friend in the arm<br><br>Guys friends are angry at him<br><br>Goes back to being a waste of space<br><br>Friends like him again<br><br>Guy beats up drug dealer <br><br>Guy gets to pick up his estranged son from school<br><br>THE END<br><br>This could have been a good movie as the cast do a credible job with what they have been given, unfortunately that wasn't much. A lot of drinking, drug using and partying fill in the gaps where they seem to have run out of ideas and some unimaginative scenes where the lead character uses his powers make up the rest of the movie.<br><br>I was looking forward to seeing this movie but spent my entire time waiting for it to go somewhere, it never did.","user":"syked_31","rank":[11,12]},{"title":"If you are expecting something like Hancock you will be disappointed.","rating":2,"date":"21 December 2015","review":"Based on the description, I was expecting something similar to Hancock about a superhero with deep character flaws and an alcohol problem that gets his life together. While this movie can be described as such, it really isn't. The hero of this movie primarily used his power as a parlor trick and only fights crime for like 3 minutes. The remainder of the hour and a half you are bored to tears waiting on the superhero to show up while being subjected to watching a waste of oxygen get drunk and high over and over. The powers seem more like an afterthought than it should be for a movie billed as a superhero movie. In fact they could have completely left out any powers at all, deleted the 3 minutes of action and had essentially the same movie. <br><br>I will say that the actors and director did a good job with the script they had, and if this wasn't pushed as a superhero movie, I might have rated it higher. Based on what I was looking for I found it slow and boring.<br><br>Bottom line: If you are looking for a superhero movie like Hancock this isn't it. If you are looking for a movie about overcoming addiction, then this might fit the bill.","user":"maverickz-33-530388","rank":[41,58]},{"title":"Closer-to-life version of Jean Grey and Professor X","rating":6,"date":"12 December 2015","review":"It may be strange that a mockumentary crew follows a random underachiever guy who just lost custody of his son and sent to community service. After a while it turns out he has special power, a straight up X-Men material also accompanied by his best buddy in wheelchair. The movie later follows his squandered life, which is quite identifiable because he struggles with daily problems even with his superpower, although the cycle of his drug abuse can be monotonous at the end.<br><br>Superheroes movies usually opt for mix of fantasy, using outlandish power, and connection to the character, displaying their flaws to humanize them. American Hero clearly leans towards the latter as Melvin (Stephen Dorff) stumbles even on ordinary problems, let alone crime fighting. He looks stoned and disheveled almost the entire time. There's a good quality in his character, though one must look deep enough.<br><br>I remember Stephen Dorff from Blade as the cool named antagonist Deacon Frost, as Melvin he's the complete opposite, albeit ironically still with super power. Melvin is talented and smart even without the gift, yet he's using the telekinesis power to grope women with random objects and score drugs. The movie invests so much on establishing that he's a screw up, it has repetitive party montage for a good portion of the runtime, which tends to get stale after a while.<br><br>Eddie Griffin as Lucille, the sidekick in wheelchair is also Melvin's moral compass. He's a charismatic comedian, cracking jokes and having tendency to flirt with women, but he presents good brotherhood relationship for Melvin. It's also nice that the movie adds some interviews with supporting chars to establish heroic or mundane atmosphere as well as adding slight realistic flavor.<br><br>This is in heart, a comedy drama, not an ambitious use of super power like Chronicle. It does have solid special effect for some sequences, but it's still limited and might not look superbly authentic. The ones that work better are those seemingly happen out of nowhere and its use of mockumentary serves these tricks well.<br><br>American Hero might not be as grand as the title or premise suggests, but it brings more connection with the characters than larger sci-fi or action movies. Melvin is not the hero we deserve, he's the one we will have to make do.","user":"quincytheodore","rank":[21,29]}]