[{"title":"The Title Is Not Wrong","rating":8,"date":"19 April 2018","review":"I did have a bloody good time, in both senses of the word. This gorefest is a horror fan's delight. Its references will keep you entertained, but you'll stay for the witty one-liners and endless fountains of blood. <br><br>The movie begins in the early 20th century where Dracula leaves off. The Harkers move to America to escape their past. Of course, as with any past, it follows and we end up in the present day with three siblings, descendants of Mina and Jonathan, about to lose the family homestead.<br><br>I was actually pleasantly surprised by this movie. From the first 15 minutes or so I thought I might be sitting through yet another adolescent boy fantasy. But as with any decent adolescent, the movie soon stars to grow up. That doesn't mean it's not still funny and disgusting. But the movies central theme-the bonds of family and friends-begins to shine through, creating a Cairo-blood, red filter of kinship. <br><br>If you are the type of horror fan that gets their comedy straight from your horror movies, or the type that enjoys the odd horror comedy, you're going to love this movie. <br><br>And if anyone involved is reading, I'd love to see a sequel.","user":"genderarm","rank":[10,14]},{"title":"I also had a bloody good time","rating":8,"date":"21 April 2017","review":"The movie is really not taking itself serious. The movie is very silly but has a lot of heart. It's tough to tell if this will resonate with you or not. If you can just relax and sit back and just enjoy this ride, do it. I watched it at a Festival, so I got the reaction from others too (was very well received), so try to watch it with friends.<br><br>8 may a bit high, but I do recognize it when a movie succeeds in being go silly. That's a lot tougher to do than some may imagine. Also the \"acting\" is good at being bad, the relationships between the characters is plausible and the \"story\" flows along nicely. Likable, down to earth madness, that is over the top with its humor ...","user":"kosmasp","rank":[8,15]},{"title":"I had a bloody good time at house harker","rating":6,"date":"7 April 2019","review":"I really did. When it started soooo low budget I thought for sure I'd be turning it off soon. Nope. It's hilarious. It was a fun movie. The writer and everyone involve obviously love horror. If you're looking for some humor with your horror, you won't go wrong with this movie.","user":"acesheila","rank":[3,4]}]