[{"title":"Good light-hearted fun - if you were there in the 70s","rating":7,"date":"20 May 2017","review":"Well I enjoyed this movie from start to finish. It probably isn't for everyone, e.g. if you are too old or too young or from another planet. But if you remember British cop dramas from the 70s and 80s – with a bit of Starsky and Hutch thrown in (and if you have a sense of humour) then you should find some real laugh-out-loud moments here. I found it great, light-hearted, rather slapstick fun, and I will enjoy seeing this again some day.","user":"alangmcw-850-641963","rank":[28,36]},{"title":"I laughed my eyeliner down my face","rating":9,"date":"18 May 2017","review":"Mindhorn is the ultimate treat for anyone who has an appreciation for ludicrous humour. The film is set on the Isle of man which in my eyes sets the plot up for greatness as the clash of action and crime with understated countryside life is always a winner for me! I love to see the quaintness of British life being fondly ridiculed by a silly parody action sequence! Mindhorn is immediately funny and the 80s Mindhorn montage sequence reached both people who feel nostalgic about the 80s action genre (my dad was roaring) but it also tickled a 22 year old like myself. I love the parody form and Mindhorn's purposefully cheesy devices landed with rip-roaring comedic success.<br><br>The acting in this film was spot on because the actors had amazing command of physical humour and timing and the script didn't scrimp on funnies! Visual comedy is a really intelligent and inventive form of humour and the mark of a good script. Mindhorn has some brilliant moments of this and you can clearly tell from watching the film that the art department had a whale of a time! l also thoroughly enjoyed the use of garish colour in this film there was a strong use of carefully considered yet brazenly bold costumes and set. A piece of art as well as a good comedy! I'm sure I could pick faults but because I laughed the entire way through I don't think I need to.","user":"esthercross","rank":[28,40]},{"title":"A fun spoof of '80s UK crime drama set on the Isle of Man","rating":7,"date":"10 March 2019","review":"In the 1980s Richard Thorncroft found fame as Mindhorn, the Manx detective with an artificial eye that could literally see the truth. After three series he decided it was time to head to Hollywood, burning his bridges as he goes. Twenty five years later he is living in a flat in London and his only acting work has been the occasional advert. Now a deranged murder suspect, self-dubbed 'The Kestrel' is saying he will only talk to Detective Mindhorn; this leads to his return to the Isle of Man. Here he is both caught up in the hunt for the killer as well as meeting former colleagues who went on to live more successful lives than him.<br><br>If you are looking for anything serious you will definitely be disappointed but if you like the idea of a mild spoof of '80s UK detective shows this is worth watching. As others have said 'Mindhorn', the TV show, was clearly 'Bergerac' with a bionic eye... something which the film constantly acknowledges with an ongoing joke about Thorncroft losing roles to John 'Bergerac' Nettles. Most of the humour comes from the Richard Thorncroft character; he is almost a copy of Alan Partridge at times... most notably in scenes featuring Steve Coogan as a secondary character in 'Mindhorn' who left for a far more successful spin-off series. The plot in many ways mirrors the style on an '80s TV show as does the acting; something I'm sure was deliberate. The cast does a solid job with just about everybody looking more than a little ridiculous at times. The ending is inevitably rather cheesy but that fitted in with the general feel of the film. Overall I certainly wouldn't say this is a must see but would still recommend it to anybody who enjoys slightly cheesy silliness.","user":"Tweekums","rank":[4,4]}]