[{"title":"A Real Pleasure","rating":1,"date":"1 October 2018","review":"A visual masterpiece that depicts mystery beyond well and rises to glorious fun and adventure with the reveal.","user":"Donald-Stormy-Trump","rank":[242,274]},{"title":"The Good And The Not So","rating":6,"date":"21 November 2018","review":"The film is gorgeous to watch and begins with an interesting premise. The scenery and the intrigue are enough to power the viewer to motor on. The bulk of the story, however, really makes little sense. That so many otherwise smart or aware people would either be conned or allow themselves to be herded and do nothing to resist is inexplicable. Scripts need to try harder nowadays The reference to Ivanka and Donald is gross - I assume even in deep Republican country ... I hope - and should be disturbing to most.","user":"xkh-33182","rank":[199,234]},{"title":"It is legitimately better than the rating...","rating":9,"date":"14 October 2017","review":"I'll never understand why some movies end up rated the way they are. This is one of those movies. It's not groundbreaking. It's not mind blowing. But it is a great example of what a quality movie is. The acting is good to excellent. The cinematography and visuals are exceptional. The story is a little odd, but so what? Since when does a movie plot have to be within the realm of \"Normal\"? It is what it is, and this one actually all comes together relatively well. The pacing, although a long movie, is actually pretty good. You'd think 2-1/2 hours is too long. After watching this movie, I'd have to disagree considering the fact that everything that happened contributes to the story and slowly builds suspense. I can see why some people don't like that, but it's unfair to rate a movie poorly simply because you don't like the style. It's not a frantic seat-of-your-pants thriller horror movie. Why do people insist on rating movies how they think they ought to be, or how they thought it was going to be, and not simply how it is?<br><br>I sit here and can't help but think I might be completely crazy. I just finished watching \"Transformers: The Last Knight\" before this movie. That movie was incredibly bad. I mean, literally the only thing going for it was special effects and, a few of dozens of attempts at humor that were actually funny. How on Earth is the aggregate user score only 1 point lower than this movie? That blows my mind. Or how about \"Get Out\"? I liked that one too, but I cannot fathom how it's better than this movie in any way! They are both \"it's not what it seems\" type thrillers. Is it because of the racial element or something? I'm sorry folks, but \"A Cure for Wellness\" is a far better movie in every way. <br><br>I implore you to watch this one if you enjoy \"it's not what it seems\" type movies. I can't remember enjoying one like this since \"shutter Island\" with Leonardo DiCaprio. Don't believe the 1/10 reviews on this. It's a shame people have to be so shallow and misuse the rating system. If people rate this movie anything less than 6/10, it's because they have no idea how to judge elements of a film. The only legitimate gripes about this one are the length and the slightly bizarre plot. But those are elements that worked for it IMO. <br><br>After using IMDb for years to get my reviews, I just now decided to make an account. Because I can't stand seeing a very good movie like this rated so low. It's a 8.5/10 movie and nothing about it is bad at all. You may not like it, but you can at least try to be objective about it and give it a rating it deserves... I mean, come on people. Captain America is 8/10 and this is 6/10!? Give me a break...","user":"ambitionz","rank":[340,406]}]