[{"title":"I wanted to hate this film but I couldn't. Instead, I really liked it.","rating":9,"date":"25 August 2017","review":"I've said many times in past reviews \"I wanted to like this film, but I couldn't\". This is the first time in my over 250 reviews I'm saying the opposite.<br><br>Going into this, I had very low expectations, and from the very start, those expectations were met with the very poor acting and dialog, followed by the start of an outrageous story-line.<br><br>As the story continued, I began to notice that the camera angles (poorly aimed in some scenes) were similar to video games like Call of Duty. Then I noticed the background music was similar as well. For a few minutes I thought to myself \"oh boy, this movie is gonna be a waste of time\", but oddly enough, all those factors started to grow on me, including the bad acting/dialog.<br><br>Then I started to notice the directing and cinematography were actually quite good - and those poorly aimed camera angles actually made the scene very realistic, especially for a B-type low budget film with two amateur directors, Cary Murnion and Jonathan Milott.<br><br>Oddly enough, I also started to look past the poor acting and dialog from Dave Bautista and Brittany Snow and instead, became fond of their characters, and able to relate to them as just 'average Joe's' trying to survive. As I grew up in Brooklyn, I realized it wasn't bad acting/dialog, but instead their characters were spot on Brooklynites! For that matter, Dave Bautista nailed his character as a passive war vet turned janitor who lost his family.<br><br>All of a sudden, BOOM, I was engulfed in this film and was really enjoying it. You can't compare a low budget B-type film to the blockbusters, and as such, to review it on it's own merits, this film was outstanding! I really felt like I was right there where all the action and suspense were happening, and was rooting for the Brooklynites. <br><br>Sure one could argue about plot holes and an un-realistic story, but this is pure fiction (although it does make you think), and the screenplay was written so well with the pacing spot on, I felt like I was watching a live newscast in a war zone. What I also really liked (and respected) was the fact that there were zero clichés in this film, and it was pretty much unpredictable. Even the ending (not going to give it away) was a shocker and certainly not expected.<br><br>It's sad to see such a low IMDb score from people comparing this to blockbuster films, or inserting their political opinions and agendas into the story. This for me was simply a fun ride, a great suspenseful adventure thriller, executed very well from every perspective. It left an impact on me, wanting more, and I do hope a part 2 is considered.<br><br>I will watch this again, and it's a well deserved and much respected 9/10 from me... great job to all those involved in the production of this sweet little gem.","user":"TheTopDawgCritic","rank":[146,209]},{"title":"Cheap, but mostly in a good way.","rating":8,"date":"9 January 2018","review":"Two people get stuck in a city-wide gun fight.<br><br>The camera trails about six feet behind the main characters as they scamper from one besieged house to another.\nThe action is pretty intense!\nPassers by and pedestrians in the back ground get gunned down or embroiled in their own personal dramas.<br><br>This is not an expensive film and its lack of budget is both its strength and weakness.\nIt has a gritty feel to it and there is no big Hollywood star waiting to rip his shirt off and everything has a degree of realism about it.<br><br>But some of the action scenes do suffer from a lack of funds.\nSoldiers wait patently for stuntmen to do their thing before spurring into action, or beat at invisible flames that the CGI team didn't get time to add.<br><br>This feels very much like a computer game.\nThere is not a whole lot for the characters to do except run and dodge and shoot, but the film is kept under the magic 90 minute mark so that was ok.<br><br>They try to add some meat to the characters in a couple of quite dull dialogue scenes that didn't really work.\nI only know the characters from their backsides so I only need to know them about as intimately as I know third storm trooper from the right.<br><br>The final sequence falls apart a bit as the sets are just too small for the extras to comfortably fight over.<br><br>This is a great, cheap little run-and-gun action movie.\nQuite gritty and thrilling.","user":"thekarmicnomad","rank":[27,38]},{"title":"Fun one-shot mayhem","rating":7,"date":"26 August 2017","review":"Like others, I heard about the film because Aesop Rock posted on Facebook saying he was doing the score. So I wasn't expecting much beyond a cool soundtrack...<br><br>From the first scene, it's apparent that winning an Oscar isn't the top priority. The dialogue isn't fluent and the acting is stunted, and we're thrown in with the action almost right away: streets are burning, we don't know why, let's get the hell out of here. The top priority, it seems, is creating a video game-like war-torn corner of NYC through which the protagonists must try and survive. And it does this well.<br><br>It only took a few minutes for me to start honestly enjoying it. The main driving force is the perspective: a single hand-held camera doing long continuous takes, so the whole movie, having been edited to cut different takes seamlessly together, runs like an entire 90 minute one-shot. It makes you feel as if you're there with them, experiencing the action unfold, no tea break, and the ridiculous plot and forced acting combine to make it feel like you've stepped directly into a '90s B-movie or a shoot'em up arcade game set in Brooklyn. It's really pretty cool, and almost makes me think that the silly plot and acting were intentional. Maybe, maybe not.<br><br>If you're looking for a political thriller, a thinking man's action movie, cool martial arts/fight scenes, or any amount of emotional realism, look elsewhere. But if you're happy with a mindless yet oddly engrossing bang bang movie, this might be fun.","user":"brshill","rank":[72,112]}]