[{"title":"meh","rating":6,"date":"25 January 2018","review":"First it seems like a haunted house trope, but no, then a ghost hunt, nope, then some kind of mystery thriller, but neither... It´s ultimately a grief film that drags on and on, relying exclusively on Kristen Stewart to sustain everything. It´s so subtle is almost not even there. To people who might make it to the end here´s a fine minimalistic drama that holds back from many clichés, a serious story, too serious maybe. There are a couple of great moments but it isn´t really rewarding. It just disguises a realistic drama as a ghost story, which is not the best idea cause it calls for an audience bound to be disappointed. I´m trying to like it but it´s just not good enough, it seems to add slightly relevant events just to fill the runtime. And it is confirmed, Kristen Stewart can´t smile. She tries at one point and it was like watching Wednesday Addams all over again.","user":"axapvov","rank":[41,49]},{"title":"Unique/Engaging Character Study of Loss and Grief","rating":9,"date":"22 April 2017","review":"I saw this movie a few days ago and have been haunted by it ever since. I am writing this review more to clarify my own thoughts and feelings rather than to try and influence anyone to see (or not see) it. I have always believed the sexiest/most compelling thing about a woman is her confidence, and, for me, Personal Shopper is the cinematic equivalent of that belief. I cannot remember ever seeing a movie so supremely confident in itself, which kept my eyes glued to the screen wanting to know more. Director Olivier Assayas managed to create a film that is so sure of itself it defies all genres, conventions, and expectations. He found a perfect balance between not caring what the audience thinks about his movie without alienating or insulting his audience with how much he doesn't care. No emotional manipulation or trying to cater to/please the widest possible audience here, which is so very refreshing. This is what he has to say. Take it or leave it. Love it or hate it. So, while it is not the best movie I have ever seen and has it's flaws, I am still giving it a very high rating for daring to be different. On a side note, taste in movies is extremely subjective, so I can understand and respect the reasons why other reviewers gave this movie such low ratings. However, I do not agree with the common practice of putting down other reviewers/calling them idiots for having different opinions. In a perfect world, I wish we could all just agree to disagree without being hateful/hurtful. Peace.","user":"kstevens-88033","rank":[130,176]},{"title":"The last 10 minutes","rating":2,"date":"2 February 2018","review":"I loved this film.\nI watched it twice and went back to the final minutes of the film, starting with the note telling Maureen to go to Room 329.\nMaureen goes to the Plaza, Room 329 with the bags of Cartier jewelry, She goes to meet the person who she suspects killed Kyra. \nIn the room, she puts the jewelry on the bed, she then sees someone that we don't see and then, the scene fades to black.\nThe next shot is of the hotel elevator and hotel doors opening and closing as if an invisible being is walking out. \nIs this Maureen's ghost/spirit? Was Maureen killed in room 329?\nIt seems so.\nBack inside, the next scene if of Ingo exiting room 329 alone, leaving the hotel and being accosted by the police. He escapes..\nFrom there to the end, Maureen is only a spirit.\nIn Oman, she finally realizes that what has happened. \"Is it me?\" she asks.<br><br>(Many commenters about the film seem to doubt that a Personal Shopper is an actual job. Yes, it is. There are personal shoppers in high-end stores that assist the wealthy as well as helping photographers, filmmakers and other professionals find the needed clothing and accessories for their project. Personal Shoppers also work for celebrities, as in this film. It's not an easy job because of the demands and responsibilities.)","user":"satxfan","rank":[60,78]}]