[{"title":"This is why you don't close your forums IMDb","rating":10,"date":"12 July 2017","review":"Something is wrong when the downvotes are massive on a film with no real release. Then you realize its about the armenian genocide.... This could have been revealed in the discussion page rather than people posting fake reviews, but here it is, you made your page less informative because you were so afraid of trolls you ripped out and erased a basic feature for your site, you lost the ability to pick the brain of the world.","user":"yavoyavo","rank":[361,446]},{"title":"The overall rating is false: it's being down-voted by genocide denialists.","rating":10,"date":"2 August 2017","review":"Well, screw those who would destroy History because truth hurts their feelings. The Armenian genocide happened, and whoever tries to censor this film will do so in vain, or so I hope.<br><br>The movie is good, in general Oscar Isaac doesn't disappoint, and Le Bon adorably shines. That said, the crude, sad part is hard enough to watch, especially when you consider what's been shown is a mild version of what happened.<br><br>It's a good movie, even though a ten is too much, I have to over-vote it to compensate for those who willingly down-vote in order to bury the truth in the sand. Worth to get to know what happened, if only because many wouldn't want you to.","user":"isabelg_miranda","rank":[269,348]},{"title":"Wonderful Film","rating":8,"date":"24 September 2016","review":"Many films that debuted at this years Tiff were based on unfortunate periods of history. I hope that some of them can learn from this film. This has at its heart a love story. It also depicts what a nation is capable of doing to an ethic group when its leaders (both secular and spiritual) reduce the value of life of different cultures to nothing if it is not theirs - Islam. <br><br>This film is from the same director that brought Hotel Rwanda to the festival a few years back. That presentation was a wonderfully moving experience for me as this one was also.<br><br>This film is not all about murder thankfully. Its about the people who were once a vibrant part of the former Ottoman empire that find all of their hopes and dreams for the future suddenly crushed. It has at its core a wonderful love story and it has attracted many fine actors to portray these memorable roles. I found the female roles to be particularly well designed and delivered. Excellent female roles in this film.<br><br>FYI: At my screening (2nd) the director told us that there were 1400 seats at the first screening and that there were already 4000 negative reviews on IMDb - yes he reads these reviews. I don't believe 100's of Turks would come to a film festival only to learn about the Armenian Holocaust. No one at my screening cried foul. <br><br>People that maintain it didn't happen are still trapped in a loop of denial. <br><br>If we cannot remember the past we are doomed to repeat it.<br><br>This film is careful not to delve to strongly into the depiction of violence. I think this film might be appropriate to teach children about history and also to teach children about people who want to cover up history.<br><br>It is October 5th, almost a month now since the premiere. Currently 54,000 negative reviews for a film that hasn't opened yet - that must be some sort of a record.","user":"michaeljtrubic","rank":[516,753]}]