[{"title":"Turner is brilliant in this original, touching drama","rating":10,"date":"26 March 2019","review":"This movie had an uneasy delivery. Initially called Look Away, it then went under the title Beautiful Darkness before settling on the final title Love is Blind. This rather bland title is the only thing about it that lacks original thought. Beautiful Darkness would have suited it better. Such an intriguing premise - a girl who cannot see her mother. It has so much resonance and if you like to watch a movie and leave with all your questions answered and everything neatly tied up in a bow, then this is not for you. All of the cast are excellent but Shannon Tarbet and Aidan Turner deserve particular credit for bringing convincing psychological realism to something that treads a fine line between realistic drama and magical realism and always manages to keep that delicate balance. Aidan Turner is devastatingly good as Russell, the guy who just wants to disappear. It's beautifully shot and unfolds gently and seductively. It deserves a much higher profile than it's had and lingers in the mind long after the end.","user":"joannamaryward-49852","rank":[25,31]},{"title":"Fabulous!!","rating":10,"date":"26 March 2019","review":"Aidan Turner is fabulous!!\nHollywoods new throb and he can act!!\nFrom Mitchell, dante R and Ross Poldark\nWelcome to America🇺🇸🇮🇪","user":"beck-98704","rank":[17,22]},{"title":"Worth the Wait","rating":9,"date":"25 March 2019","review":"We've been waiting a long time for this film to come to us. First it was called \"Look Away\"..in 2015. Then it was changed to Beautiful Darkness. We waited in anticipation for 3-4 years for this to move through post production, to find a distributor and to get a release date. We poured over unofficial trailers. And still most of the world outside the UK is waiting to see it....Personally, I was not disappointed. I was waiting up at midnight on the 25/3/19 in the UK to see it. The best of indie style film making with glorious cinematography. In essence a good old fashioned love story around the premise of falling in love with someone who you can't see. Except the Princess is a Prince in Aidan Turner, destined never to be seen by his true love and each character is marooned in a lake of their own self made loneliness and isolation. But throughout there is hope, the idea of altered perception in each and everyone of us... where we only choose to see what we want to see....and the very real dilemma of being careful for what you wish for.....Finally, we all need a tree house just like that one.... It's a real gem of a film ... made out of human foibles, weaknesses, hidden strengths and belief in others.... Special shout-outs to a recreation of Buster Keaton and to Ferris Bueller in a head bandage. Here's to all that is Dark in All of Us.","user":"joanellis-92973","rank":[17,22]}]