[{"title":"Absolutely terrible writing and dragged-out unnecessary dialogue","rating":3,"date":"20 September 2017","review":"A negative rating for Negative.<br><br>I'm not sure what accomplished director/producer/cinematographer Joshua Caldwell was thinking taking on this project. <br><br>This film has got to be the epitome of terrible writing and should be a classroom example of 'what not to do' when writing a screenplay. Why would Joshua take on (clearly) amateur writer Adam Gaines script is beyond me. Even his good directing and excellent cinematography could not save this disaster. <br><br>Aside from the super obvious plot holes and very poor story overall, the dragged-out unnecessary dialogue made this film unbearable and extremely boring. The way too long 1h 39min film length felt like 4 hours and I found myself saying \"get on with it already, who cares!\" when the two leads would just ramble on about nothing relevant. This movie may have been interesting if it was a 30 min short film (which oddly enough is the only minimal writing experience Adam Gaines has). <br><br>The acting was decent and Katia Winter was very easy on the eyes to look at, but her chemistry with Simon Quarterman was very unconvincing. Maybe it was the boring dialogue they had that made their chemistry absent.<br><br>Even the maybe total of 10 minutes of action scenes were overly dragged out. The rest of the film was primarily useless garbage dialogue with absolutely no point to the story - start to finish.<br><br>Don't waste your time with this one. See the trailer, and that's all the good and interesting parts you'll need to see.<br><br>This gets a 3/10 strictly for the directing and cinematography.","user":"TheTopDawgCritic","rank":[19,26]},{"title":"Don't worry about spoilers nothing happens with this dross","rating":1,"date":"21 September 2017","review":"I watch a lot of movies and I like to give them all a chance just in case there is something interesting or exciting to warrant a viewing Unfortunately this movie has none of these features it is pointless and offers nothing in the way of story line,acting or direction The plot is non-existent with the actors just going through the motions and the dialogue is sooo boring its embarrassing. I wish the previous reviewers had posted earlier as this would have saved me 95 mins of my time","user":"pensterlab","rank":[15,23]},{"title":"Total Skip!!","rating":1,"date":"16 April 2018","review":"I rarely stop watching a movie although how crappy it is. Well for this one I made an exception since its beyond boring. I cant leave long reviews so this is it.. SKIP IT","user":"madsyy","rank":[7,10]}]