[{"title":"Poor Storyline","rating":3,"date":"3 January 2018","review":"So PP 1 &amp; 2 were fun to watch, hell I've watched them a whole bunch of times... The storylines were ok, regards an Aca Contest blah blah blah... but this... this takes the cake... They go on a quest to compete with two other bands and a rapper??? And end up being 007 agents blowing up a boat after being kidnapped??? <br><br>REALLY???<br><br>I feel this would have been a better movie, if the Bella's had gotten jealous of the younger hotter Bella's and competed against them... Maybe the Younger Bella's introduced guys to the group, and the Older Bella's teamed up with the Tones...<br><br>THIS would have made WAY more sense... Com On guys - you spoiled a great franchise there...<br><br>Wait for the DVD - or even TV...","user":"petewill","rank":[61,74]},{"title":"who knew a full movie about fat amy was a bad thing?","rating":4,"date":"4 January 2018","review":"I knew i would not like this movie when *SPOILER* it was nonchalantly mentioned jesse (skylar astin) and beca (anna kendrick) had broken up and he'd moved on way too quick. way to character assassinate. it just got worse from there. rebel wilson is a comedic actress, but too much of her is just obnoxious and that is what this movie is-obnoxious. i rarely laughed and i didn't recognize most songs they sang. i must be getting old. i have to say my favorite in the series is 2. there is no puking i have to fast forward through. and beca and jesse's cuteness makes up for everything else. elizabeth banks and john michael higgins are hilarious as always. basically, this movie only gets four stars because of who is in it, not for its story.","user":"katiefanatic-791-306918","rank":[39,50]},{"title":"Weak storyline but I enjoyed the music","rating":8,"date":"8 January 2018","review":"8 January 2018\nFirst Film of the year and first Film of Choice at The Plaza Dorchester Tonight - Pitch Perfect 3. So I hadn't seen the first two, I thought I better catch up, one mega acapella binge watching session later I'm fully caught up and ready for the third instalment. It didn't really matter much about the plot which was probably just as well, as long as the music entertained........and I reckon they didn't do too bad. This instalment sees the Bellas all grown up and beginning to make their way in the world, only it seems they can't make it without their acapella sisters. A little regret on parts of each of the girls makes them jump at the chance to take part in entertaining troops on the USO European tour. It's all the old crew with Beca and Fat Amy leading the way, add some competition in the form of a lean mean girl band, a rock/country group and put them slap bang among aircraft and helicopters on a selection of US naval bases and you have a fun light-hearted film which is guaranteed to keep your feet tapping throughout. Rebel Wilson is gloriously unfazed by all she says, sings and does and the whole film is once more led graciously by Anna Kendrick from disaster to singing magnificence as the film reaches its crescendo. You can almost keep your eyes closed throughout as the music is bouncy and easy to listen to, and ever so slightly leaves you wanting more. Aca-enjoyable.","user":"Figgy66-915-598470","rank":[29,38]}]