[{"title":"What happened?!","rating":5,"date":"25 November 2018","review":"I was quite liking this film then all of a sudden - nothing! It just stopped.<br><br>It was obvious that some of the cast were either inexperienced or lacked direction, but it didn't detract too much from the overall story.<br><br>The editing could have been a lot tighter in places. Sometimes a shot would linger just a little too long which detracted from the overall flow.<br><br>It seemed that the film was just one big build up to something that was never delivered. Just when there was a bit of interesting action in the film that could lead to some very interesting scenes it just stops dead in it's tracks. There is no payoff whatsoever for the viewer who is left wondering what the hell the film was all about.<br><br>It was as though the ending was rushed in at the last minute and a large chunk of the story had been culled.<br><br>This is yet another film that had great potential if a little more thought had gone in to it's production. As it is, the film just ends up being a waste of time.<br><br>Such a shame because I really wanted this film to be good when it started.<br><br>One to miss for sure.","user":"mjsreg","rank":[30,34]},{"title":"Like reading a book with the last 3-4 chapters ripped out.","rating":3,"date":"25 November 2018","review":"Really a short film dragged out for a full movie. Also the ending is nowhere to be seen. I would say its the worst ending I've seen in awhile, but there wasn't an ending at all. I myself can't see why anyone would rate it over 3\\10, but to each his own I guess. Creepy factor was also non existent. I've seen short 5 min films do 10 times more.","user":"richierichyyyy","rank":[42,50]},{"title":"Nothing to see here","rating":3,"date":"27 November 2018","review":"ASTRAL doesn't really give you much to get excited about. The story is very much centered around the protagonist. While there are other characters in the film everyone else gets pretty much left by the wayside giving you zero to no insight surrounding their dynamics as a group of students attending university. Little to no character development went into this film and even less attempts at standing out as more than a run of the mill jump scare movie, which doesn't didnt even succeed at that. With other films like Insidious exploring the astral projection area of horror this one falls drastically flat in every way. I had hoped that when we finally arrived at the big bad demon of the movie which had little to no build up ,we see it for only a few moments and then nothing. I expected this movie to be more exploratory of the astral plane but I guess the budget didnt allow for more. Give this one a solid pass","user":"sicbassman","rank":[20,24]}]