[{"title":"Excellent horror movie!","rating":10,"date":"21 July 2016","review":"I personally think this movie is one of the greatest horror movies ever! Teresa Palmer and Gabriel Bateman's acting is very good, absolutely credible, almost like Rosa Byrne's performance in Insidious, which was flawless. The cinematography was good, dark scenes pretty clear, intense sound effects well achieved.<br><br>If you go to the cinema with your childhood fears, you will really enjoy this movie. It's full of scares and if you put attention to them, they are the kind of scares that you really fear when you are a kid.<br><br>I don't understand why people cannot leave their critics-attitude at home and simply enjoy this movie or any other movie. If they do it, you'll enjoy it a lot.","user":"dlora_santana","rank":[347,444]},{"title":"Novel idea but needs more","rating":6,"date":"20 August 2016","review":"Lights Out is an interesting stab at a horror movie based on a 2013 short film of the same name. The movie's novel concept is a creature that can only be seen and manifest in the dark. Turn a torch on, and it disappears. Naturally, this means that a lot of the movie is spent in the dark but this works well.The use of lighting is one of the movie's strong points and allows for some creative, and occasionally funny, uses of torches, candles and even car headlights. This technique generates a lot of the scares and atmosphere and given the movie's title, this is a must. Definitely top marks for the director on this part.<br><br>Teresa Palmer and Gabriel Bateman do well in the lead roles as the unfortunate kids with a crazy mother, played by Maria Bello. The problem with the movie is that apart from its main concept, it doesn't add much else. Clichés abound and yes, there is the mandatory dark basement (groan). Most of the scares are jump-out-at- you shocks and it's all been done before. Hollywood seems to have forgotten how to use psychological horror and churns out movies that are just twists on the same theme. This is probably a bit harsh as the movie is enjoyable enough and it's well-written, but I long for something new that isn't so long in the tooth.<br><br>The supernatural horror is effective and does elicit a genuine threat to the characters. Maria Bello, in particular, does well to ramp up the threat levels and makes you wonder who is going to make it out alive. As already mentioned, this was based on a short film and it really still is, coming in at around 80 minutes. Perhaps there wasn't enough material to make a longer movie but there's a feeling that it ends just as it gets going.<br><br>Lights Out is a decent film if you feel the need for a dash of supernatural horror but don't expect anything stand-out; it just doesn't deliver enough of a impact to make it memorable. It's good for what it does but don't buy too much popcorn as you may not have time to finish it.","user":"knight_ca","rank":[19,21]},{"title":"Worth the watch!","rating":8,"date":"30 July 2016","review":"This movie will get your pulse up fast, revealing the \"horror\" very early on. Interestingly enough, it keeps that pulse up throughout the movie despite of this. The concept of something that can only appear and be seen if it's dark (and with a somewhat supernatural ability to destroy light bulbs) is bound to lead to a jump scare or ten whenever it appears. Towards the end you've almost gotten so used to it that the scare effect wears off a bit, and is one of two reason I don't rank this a 10. But thanks to a good story and good actors, the movie still holds its ground to the very end.<br><br>The characters are really good, well written and performed, and with a young boy that if not before, totally kick started his future acting career with this movie. Who doesn't love a young prodigy? The plot has some weight and emotion to it, and with a solid ending that wraps things up in a much more satisfying way than most similar movies.<br><br>The other small drawback with this movie for me was mostly because of slightly unrealistic behavior from our main characters, occasionally. Like when miss heels from Jurrasic World is worried that when she releases T-Rex it won't be able to follow her if she runs. So, she waits for it to come close, walks for a bit, then runs. Those kinds of unrealistic behaviors. But I've seen much worse, and this movie doesn't take the \"unrealistic\" very far, or often, so I suggest you just put this on and roll with it!<br><br>All in all you get everything you want from a jump scare movie with Lights Out, with a good plot and good actors that deliver, and a scare factor we all can relate to. You might not be so happy with turning of your lights going to bed later that night, so if you have a weak stomach you might wanna sit this one out.","user":"robert-b-norby","rank":[115,157]}]