[{"title":"Batman Unlimited Monster Mayhem: More kiddie family Batman action","rating":5,"date":"27 December 2017","review":"Alike Batman Unlimited: Animal Instincts we see Batman and various other DC heroes facing off against another random villian team up in very kiddie friendly action set in a futuristic alternate universe.<br><br>This time The Joker leads Scarecrow, Silver Banshee, Solomon Grundy &amp; Clayface in a plot to take over the world using a virus that renders electronic devices useless.<br><br>Much alike the first this is not a diehard Batman outing and more like a feature length Saturday morning cartoon. It however does have it's moments and is take your brain out entertainment at it's core.<br><br>One thing that does always bother me is Solomon Grundy, I adore the character he's freakin awesome so why is it that everytime he's in one of these things he's the comedic relief?<br><br>Batman Unlimited is one for the kids and one for huge Batman fans, but nobody in between.<br><br>The Good:<br><br>Batman rides a mechnical dinosaur, enough said<br><br>The Bad:<br><br>Why do they always make Solomon Grundy a comedy character?<br><br>Very \"Kiddie\"<br><br>Things I Learnt From This Movie:<br><br>I don't remember Clayface being able to do half of that<br><br>Solomon Grundy should be ripping heads off not eating ice cream and playing hide and seek *Sadface*","user":"Platypuschow","rank":[8,8]},{"title":"Presenting star-studded cast, but ultimately just the usual straightforward affair.","rating":6,"date":"17 August 2015","review":"Those who have watched animation series or played video games recently would be familiar to the voices in Batman Unlimited: Monster Mayhem. These are veteran actors who do the characters justice and the movie has the advantage of bringing them together for one spectacle. However, the plot is bland and lacking intensity of other DC animations.<br><br>Joker assembles his group of misfits to take over Gotham, while Batman is being helped by other vigilantes to stop the villainous act. It doesn't attempt to deliver thrill or alternate personalities like the previous animations and it definitely opts for a lighter tone. The mild vibe is clearly geared for younger audience with bits of humor as well as less visceral action.<br><br>The dubbing is definitely in high quality. Batman and Joker resemble their counterpart on the games, it might be slightly jarring to hear them in more vanilla fashion. Each of the superheroes, and also villains, is presented with their typical gimmicks, it's a nice showing for the troupe but it doesn't develop their characters much.<br><br>Animation is passable, it doesn't have the pace or well-choreographed fighting like Assault on Arkham. It does get the job done and some of the more futuristic details are appreciated. The action scenes consist of mostly one on one fight between the opposing forces, it's done pretty well albeit might be repetitive later on.<br><br>Batman Unlimited: Monster Mayhem is an average animation boosted by its great production on voice acting. It does entertain, but for fans wanting heavier intrinsic or presentation it may be a bit underwhelming.","user":"quincytheodore","rank":[12,16]},{"title":"Disappointed!","rating":3,"date":"11 August 2016","review":"This flick ruins the DC animated movies. The story makes no sense, the title has zero connection to the actual story. It is like the Monster Mayhem, a marketing trick in order to get money by kids! At the time of the recording I am close to lose faith to the Cape Crusader for those movies are a shame to Bats' films.<br><br>As for the villains,totally underused and their plan is stupid to put it softly. The designs of the City and the characters are bad and only a kid under ten would like them. For the rest of the people who love the comics mythology this a must not see for it is an insult to us as fans, as devout audience and as humans in general!<br><br>To be honest, watching this film ache more than a kick to the head when I was in karate lessons. That is who much I despise it. Not watch it for any reason in God's Earth!<br><br>Man that was a piece of junk. It is along the Mayhem one of the worst animated films Ihave seeing and I have a pretty big record to show to prove it!","user":"tankace","rank":[6,9]}]