[{"title":"Very Entertaining and Refreshing Action/Comedy","rating":8,"date":"19 September 2015","review":"Veteran initially comes off as a typical, if still very good, action comedy in which we're introduced to Seo Do-cheol, a skilled detective who is in the process of busting up a car smuggling ring. In the first ten minutes we get both plenty of comedy and action as Do-cheol and his fellow officers show themselves as more grounded and relatable, despite Do-cheol's excellent martial arts skills. While we do get plenty of quick hitting action, we also get cops who get winded, criminals who run without shooting, and other foregone clichés that might exist otherwise. However, it isn't until we get to the meat of the story that we start to see the unconventional turns take place.<br><br>The story truly starts, about 30-40 minutes in, when Do-cheol meets Jo Tae-oh, a spoiled, rich, and sadistic executive at the powerful Sun- jin group. When Tae-oh becomes responsible for the near death of one of Do-cheol's friends. It sets in motion a cat and mouse game, with Do-cheol the unstoppable force and Tae-oh blocking him at every point. The film isn't especially action packed, though we do get a few moments of action here and there. Much of this is mixed between comedy and crime drama. What makes the comedy especially good is that it's not only somewhat unconventional for a crime drama of this sort, but that our characters are made relatable and realistic. Despite how they may be set up to be more than average, we're quickly reminded that they're still only human. The interactions are also wonderful, as we witness their personal connections and how they defy the clichéd character types. Do-cheol himself, played wonderfully and charismatically by the excellent Jeong-min Hwang, defies his first impression by having to navigate the legal system to catch Tae-oh in a way that is more about outsmarting his opponent than beating him up. He may act like a supercop, but as we see in the film, his more brutal actions come back to bite him. Tae-oh, played by an equally charming but far more sadistic Ah In Yoo, is a little more clichéd. He's a typically hated bad guy who has no problem embarrassing those around him, beating people up, and pushing his responsibilities onto others. Suffice to say, he plays a typical spoiled rich brat here. But it works. There's a scene early on which demonstrates this well, having a father get beaten in front of his son. He's a truly despicable.<br><br>The film is constantly entertaining all the way through and rarely lets up. We do get great scenes of drama and emotion, and the film does an excellent job of making Do-cheol likable, but it's at it's best when Do-cheol is navigating the roadblocks being placed in front of him and overcome his obstacles, which become increasingly more dangerous. When Do-cheol and Tae-oh finally confront each other, it will have been well worth it and the confrontation is something to be relished. This is a very well crafted film that balances all it's elements just right, never coming off as too melodramatic, and much of what works is owed to the excellent writing and acting by the two leads. Korea strikes gold again with this excellent film.","user":"cadillac20","rank":[18,23]},{"title":"Amazing action movie","rating":10,"date":"23 January 2016","review":"I rarely watch Asian movies, I made an exception for this one because I liked the description and the poster. I didn't regret watching it. The way the drama/comedy/detective/action is combined is truly amazing. It made me cry a little, laugh a lot, smile and be sad trough the movie. The detective's perseverance and the limits that he pushes makes it a wonderful story. I liked that we get to see a bad ass woman detective in a secondary role that we rarely see in Hollywood, (a thing that is something normal in Asian movies). Also, the fact that the main character was not a martial arts master is a big plus. A truly inspiring family and friends relationships between characters and real life situations is what makes this movie almost a masterpiece. The level of the actors, their playing deserves and Oscar or at least some international appreciation.","user":"cristina-679-5038","rank":[17,22]},{"title":"Finally a Confident Blockbuster","rating":8,"date":"30 September 2015","review":"With a summer filled with less than mediocre domestic films busting blocks in box office we get a quality entertainment from director Ryu Seung-Wan. This is not an entirely original film but Ryu packs it with enough real life relevance and intrigue in the plot to keep the audience thoroughly entertained.<br><br>The plot which has the same structure as \"The Public Enemy\" series, very popular and also from Korea, follows a hardboiled cop trying to take down a psychotic rich kid after his acquaintance ends up in hospital. Both parties do what they do best. One follows leads and the other does whatever it takes cover it up.<br><br>As mentioned above, the film's action scenes and its general tone (comic reliefs, charismatic yet evil rich baddies) are very similar to Public Enemy series. However the story is more focused here with director Ryu's confidence in his own style.<br><br>The entire cast turns in solid performances but the standout is Ah In Yoo, making a real nasty playboy who can convincingly smirk and get under your skin. Also worth mentioning is Hae Jin Yoo who's presence in a film almost always indicate solid performances. He plays a man who needs to juggle around running the company and keeping the young maniac under control. In its final action sequence, fans of Korean cinema will chuckle at a familiar face making a goofy cameo.<br><br>So far Ryu hasn't made a single film that wasn't worth the admission price. Sure, his film can come off cheesy at times but they were never boring. Ryu's style can also compensate for not entirely original plots in films like \"Veteran\" and \"Berlin Files\". A great success in box office, this film will pretty much guarantee the director to make any film he wants to make next. Anything he makes, I'll be first in line.","user":"parknourie","rank":[12,16]}]