[{"title":"Even with some strong gags and enjoyable moments, it's only average.","rating":5,"date":"18 February 2018","review":"I might be one of the few people on this planet that saw this over Black Panther. Sorry.<br><br>I really enjoy Aardman's work, especially from shows like \"Shaun the Sheep\" and \"Wallace &amp; Gromit\". Their claymation is unique, the slapstick is inventive, the British wit is keen, the characters are endearing and the stories are funny. Only a few of these qualities could describe Early Man, a movie that's pleasant and wacky enough but felt rather uninspired. Which pains me, because I know Aardman could do better.<br><br>What are the positives? First off, the claymation has the same offbeat charm as almost every Aardman film ever, so expect that. A few jokes are inventive and got some giggles outta me (like the replay footage in a soccer game is a literal puppet show. Whenever the caveman team wins, the puppeteers wildly exaggerate what happened). Some of the details of how the cavemen live their lives was amusing. The pig was adorable and the end picks up its pace with an entertaining soccer game. Nick Park has a knack for world-building, and this was no different.<br><br>But I think that's where the main positives end. What shocked me the most was how formulaic the story was, since you could predict what EVERY SINGLE PLOT POINT was if you've seen enough animated movies. Some of the gags are clever and quirky, but a good chunk of them are also lazy and tired. It seems to rely on dumb puns (\"looks like the caveman caved!\") and overused physical humor over genuinely witty jokes. The \"look at that caveman! He's so dumb!\" running gag got old after the first 15 minutes and any chances for good absurdist humor (giant man-eating duck) lost its steam along the way. The CGI backgrounds look tacky and dull compared to the claymation, so it doesn't fit. The characters are likeable but also stereotypical (hero wants to save land, villain loves money, love interest is good at soccer, chief leader is cautious, sidekicks are dumb yet useful), just like the majority of this movie.<br><br>But it's not a painful watch. It's sometimes funny and amusing, but with every good moment you still have a thin premise, predictable plot and cliches to move the story forward as an amiable but weak experience. It's the type of movie you could show your kids on a Sunday afternoon or on an airplane, but the eccentricity, wit and creativity just isn't enough to make it worth seeing by yourself in a theater. You might smile, but it won't stick to your mind. It's not painfully average, but it isn't Wallace and Gromit. 5.5/10<br><br>I love that Shaun the Sheep 2 teaser though!","user":"RockoDaFoxxo","rank":[59,77]},{"title":"Although it's far from Aardman's best, 'Early Man' is still a wonderfully entertaining family film that will appeal to all ages.","rating":7,"date":"28 January 2018","review":"Although it isn't Aardman at the top of their game, 'Early Man' is still a fantastically entertaining film with excellent stop-motion animation and a satisfyingly energetic cast. Their newest film from Oscar winning director Nick Park tells the story of a prehistoric tribe that have to work together in order to save their home from the impending doom of the Bronze Age. Aardman once again uses expert sight gags and word play to generate multiple laughs from the audience and, although the jokes don't always land, they are all genuinely clever and you can't help but appreciate the thought that has gone into them all. The film is however let down slightly by its somewhat generic and predictable story, but the fast pace and constant humour doesn't make this into a huge problem. <br><br>Overall 'Early Man' is a very well crafted, extremely entertaining family film that will appeal to all ages, which includes an excellent voice cast who are clearly having just as much fun as we are. 7/10.","user":"domtaylor","rank":[33,44]},{"title":"Sending up the Stone Age and football","rating":8,"date":"31 January 2018","review":"Although not the biggest fan of football, that it's from Aardman (responsible for gems like 'Wallace and Gromit', 'Creature Comforts', 'Chicken Run' and 'Shaun the Sheep', have not seen anything bad from them actually), being a family film/animation fan and that it had so many talented actors in the voice cast was enough to convince me to see 'Early Man'.<br><br>Seeing it, 'Early Man' is not one of Aardman's best and it doesn't see them at the top of their game. Then again, with a studio as consistently very good to great as Aardman, that is not a standard that can be reached constantly. It is nonetheless a very worthy effort from them and as a family film, and a film in general, 'Early Man' to me was immensely enjoyable. There is a lot of talent on board and the film doesn't waste it. <br><br>'Early Man' does lose a little of its lustre, in pace and material, towards the end, the one part where the story's predictability is most obvious (up to this point the gags, inventive visuals and puns made things feel fresh) and less overlook-able. The easily foreseeable conclusion is also a little too pat.<br><br>Otherwise, as clichéd as it sounds, could find little else to fault 'Early Man'. Visually, the film is a delight. It is rich in colour and detail, the characters are adorable and cleverly modelled and there is some nice visual invention here, like the cave paintings. One is genuinely immersed in this colourful Stone Age world. The music score is suitably energetic and really gives the film its momentum and adds to it.<br><br>As to be hoped, 'Early Man' really entertains...hugely, both in sending up the Stone Age and football. Despite how mismatched it sounds having Stone Age inhabitants having their version of football, the combination actually goes very well. Any film that helps me appreciate football better, like 'Early Man' did, is worthy of any kind of credit. <br><br>The gags come thick and fast, there's plenty of them and they are subtle, clever and often hilarious, in typical Aardman fashion. Love their versions of technology, like the beetle electric shaver and the crocodile clothes pegs. There are some inspired puns and wordplay, like the duo of football pundits, primordial soup and the name Goona. 'Early Man' makes a lot of effort appealing to kids and adults alike and succeeds in doing that.<br><br>Kids will be thoroughly absorbed in the action and the inventive ideas and technology while adults will love, or at least appreciate, the puns (which they are actually more likely to get) and there is even a Mud reference to get nostalgic over. The pacing is spirited and tight throughout, and while the story is not much new and loses steam towards the end the energy and that it never goes wayward are to be applauded.<br><br>Characters are uniformly engaging, from the likeable protagonist, hilarious supporting characters to the camp villains. The voice cast are a talented bunch and they are all terrific, even those who raises some initial surprise in their involvement (i.e. Eddie Redmayne and Maisie Williams) do a great job, while Timothy Spall, Mark Williams and Tom Hiddleston (experienced in villain roles and not unfamiliar to voice work, both of them obvious) are standouts.<br><br>In summary, immensely enjoyable family fare for something for all ages. 8/10 Bethany Cox","user":"TheLittleSongbird","rank":[28,38]}]