[{"title":"The Rewards of a Slowly Paced Movie","rating":9,"date":"9 June 2019","review":"This is not a titillating, first date two kisses and in the sack movie. This is an excellent character study. I left with a strong sense that the writer compiled singular or multiple experiences from which to weave a story. For some it may be too slow. I prefer to view it as thoughtful, allowing a better development of the individual characters. Although the ending might be slightly saccharin, this was overall a very rewarding story and well played by each actor.","user":"gasket360","rank":[3,3]},{"title":"Predictable, but funny, movie about a star-crossed marriage","rating":16,"date":"16 October 2016","review":"Do You Take This Man (2016) was written and directed by Joshua Tunick.<br><br>This movie is a romantic comedy, starring Anthony Rapp as Daniel, a 40-year-old man, and Jonathan Bennett as Christopher, a 30-something man, who is going to marry Daniel the next day. As in almost all movies about weddings, things go wrong at the last minute. Some people who should be there aren't, and some people arrive unexpectedly.<br><br>And, of course, there's a major, core problem that has to be overcome. (Actually, it could have been overcome easily, but then there'd be no crisis. Crisis is very important in a movie like this.)<br><br>The lead actors are talented, the supporting cast of actors all do brilliant work, and there are plenty of laughs. (Predictable laughs, but that's OK.) There's also a fair amount of pscyhobabble, but maybe people really do talk and think that way in the Los Angeles/Hollywood setting.<br><br>This is the type of film that's worth seeing if you are already at a festival, and have all-event tickets. I wouldn't seek it out, but I wouldn't avoid it either. IMDb isn't accepting votes for this movie yet. If I could vote, I'd give it a 7.<br><br>We saw this film at the excellent Dryden Theatre at the George Eastman Museum. It will work very well on the small screen. Do You Take This Man was shown as part of the outstanding ImageOut Rochester LGBT Film Festival. The film was one of 22 movies that had either their New York State premiere or their East Coast premiere at ImageOut. My compliments to the ImageOut Programming Committee for bringing so many new films to Rochester.","user":"Red-125","rank":[13,20]},{"title":"A Pointless Film Full of Cliches","rating":3,"date":"24 October 2018","review":"About 20 minutes into Do You Take This Man I was thinking it'd be an OK film for mindless viewing. But as it progressed it became a real chore sitting through it.<br><br>There's nothing interesting about the story and actually there's really not much of a story. The attempts at making the film seem complex and dramatic feel like an amateur's idea of what makes for a good plot.<br><br>Except for one of the main guys being highly irritating the rest of the characters are so forgettable as to be difficult to even notice. The irritating main charactrer is passive aggressively needy, subtly working to be the center of attention and ready to fly off the handle if things don't go his way. Even his love for his soon-to-be husband feels self centered.<br><br>The film looks OK though the house it's shot in has a lot to do with that. The music, though spare, is incredibly manipulative. It felt like the music was nudging me and whispering \"This is sad...This is warm and meaningful...<br><br>If you want something queer to watch and you like TV drama you might enjoy this. Anyone else really shouldn't bother.<br><br>.","user":"meaninglessbark","rank":[7,10]}]