[{"title":"Nocturama","rating":3,"date":"24 February 2019","review":"*** This review may contain spoilers ***<br><br>*Plot and ending analyzed*<br><br>An overlong and extended pretentious foray into the metaphysical aspects of violence, this film is not without its interest, yet it fails ultimately.<br><br>A group of youth, who seem to be idiotic, as well as without any clear ideals, wander what seems like forever in the Paris subways and streets. You can tell right off that they're up to no good. No one pays them any attention.<br><br>Bombs explode and they all rendezvous at some shopping mall. There they become even more disinterested and fatigued. More dull scenes fill in the gaps until the fateful ending.<br><br>Could have been a five minute film treatise, instead, Director Bertrand Bonello drags it to past the 2 hour mark.<br><br>Extras include Director Bertrand Bonello's 'short films', equally tedious, and an interview with another pompous and overblown Frenchman (interviewer) praising Director Bertrand Bonello's 'merits'.","user":"osloj","rank":[8,8]},{"title":"A promising material for short story/movie – a psychological portrayal of how terrorism is born","rating":4,"date":"7 May 2017","review":"I love the Metacritic summary for Nocturama\": some young folks, tired of the society they're living in, plan a bomb attack over Paris before to take shelter for a night in a shopping center... So simple, so elegant. Unfortunately, I can't say I loved the movie itself. Nocturama\" is artsy in a bad way, all high concept and lacking in every other aspect. Also, at 130 minutes, there's nearly not enough going on to justify the length. Sure, it's a promising material for short story/movie – a psychological portrayal of how terrorism is born. On paper, any summary of \"Nocturama\" would seem rather captivating... but, sadly, the result is frankly dull and lifeless. The screenwriter-director Bertrand Bonello's approach to storytelling is alienating (the characters are emotionally distant from the viewer and each other), and he likes to stretch many scenes, however empty, so long that it tests the endurance of the viewer. Some filmmakers use this conceptual aloofness and emptiness very effectively, such as Jim Jarmusch, who can make the most trivial on screen actions or details seem meaningful. Sadly, Bonello is not one of those filmmakers. The emotional distance makes sense as (part of the) general message of Nocturama\" – modern life has made us cold and empty – but constantly testing our endurance without payoff does not. At least not to me.","user":"kaptenvideo-89875","rank":[27,39]},{"title":"Enter the void","rating":1,"date":"28 December 2018","review":"Bonello obviously wanted to deliver a generational hit, a formal jewel with a shock plot, young actors and a well-made soundtrack. Despite this letter of intent, the director misses his target.\nLet's cut to the chase, the film is super boring. Protagonists keep walking and walking, in streets, stairs, hallways, corridors. And that's almost all they do. Okay guys, you know how to use a stabilizer, but do you know how to build tension and unforgettable characters?\nActors deliver their lines, like brats from banlieue. Most of the time, they lack belief in what they're supposed to do. Their characters have no dimension at all.\nWe don't expect to root for terrorists, but these ones are so empty, we finally do not care at all about what may happen.\nThe \"climax\" is like the rest, boring and above all, really ill-made. SWAT Teams shoot firecrackers. Ok. Maybe to make us accept this movie is just a dud. The result is limp and boring.\nA pure disappointment from an ambitious filmmaker. Sometimes it's better to play with heart and guts rather than apply a formula.","user":"jasonradar","rank":[14,19]}]