[{"title":"Pleasantly Surprised","rating":8,"date":"29 May 2016","review":"I am a fan of older Adam Sandler movies (Billy Maddison, Happy Gilmore, and old SNL with Farley). Everyone knows Sandler has done some terrible stuff in the past while, but this one wasn't the worst.<br><br>He wasn't terribly over the top or in your face like he is in roles for films like Zohan, That's my Boy, Jack &amp; Jill. This film had genuinely laugh-out-loud moments; the cast really helps (Kathryn Hahn, Matt Walsh) - even David Spade is funny! <br><br>The movie isn't a classic. It isn't going to be one you're quoting. The film is enjoyable! If you're looking for a laugh, it's a good film to watch.","user":"heidi-717-706300","rank":[56,77]},{"title":"Its Adam Sandler at his best.","rating":7,"date":"8 July 2016","review":"Adam sandler....... you either love his work or hate it.<br><br>For me it is a relief like on mid summers afternoon; which is provided by a cool beer. Life in itself is too short, and this movie delivers that message with a punch. you looking for shakes'perian drama, or Quentin Tarantino's mystical direction, you are missing the message. It's Adam Sandler at his best after the Growns up's.<br><br>It's classic in terms of his way of doing movies. i will not spoil it with details but only a suggestion watch when you are burned out and have some time with a cold one.<br><br>Its the most irrational, fun, adult entertainment to bring your spirits up.<br><br>Peace out brothers.","user":"killferd","rank":[23,29]},{"title":"Sandler back?","rating":8,"date":"27 May 2016","review":"This movie I was expecting to be as bad if not worse than The Ridiculous 6 which I couldn't even finish, but I was pleasantly surprised with The Do Over. The movie has a good amount of laughs, and at some points kept me on the edge of my seat. I think that this is one of Sandler's best movies within the past 6 years. I was also very happy with David Spade's performance. I was expecting him to be just like he was in Grown Ups, as a stupid immature old man, but he surprised me as well. He kept the movie funny as well as maintained great acting the entire movie, as well as the whole cast. Overall, the movie was great. Great acting, great laughs, great action(which still surprised me), and one of Sandler's best in the past few years.","user":"earnyandberney","rank":[66,101]}]