[{"title":"A superb production and deeply moving","rating":9,"date":"13 April 2016","review":"I cannot understand how few reviewers here are complimentary. Michael Gambon delivers a magnificent performance, true to what we know of Churchill's personality and complex nature. It doesn't matter to me that the actor doesn't look very much like the great man - he PRESENTS a great man in a health crisis to perfection. LIndsay Duncan is 'Clemmie' exactly as I remember her from the public image of the time. The way her hair is done is exquisitely correct. I was eleven and I remember the drama of Churchill's illness from the newspapers. I remember, as a boy, noting that Churchill's personal doctor was a certain Lord Moran who came and went initially at the famous front door of Number 10. We all knew that Chartwell was the Churchill country seat (not his 'ancestral home' which, as we know, was Blenheim Palace where he was born.) It was wonderful that the filming took place at Chartwell. We also knew that Churchill's children were difficult, particularly the boorish Randolph, and that Sir Winston was probably to blame for having neglected them through his undoubted self-absorption. Romola Garai, as always, creates a memorable personality with her entirely believable ace nurse. The casting is superb, the settings perfect and the art direction highly sensitive. And the cars! How I loved the shiny cars of my childhood. There's a pristine, bulbous Austin that I remember admiring as a boy. Delicious visual details are abundant in the film. There were many moments when I was surprised by my own tears, notably when Lady Churchill, having warmed sufficiently to the newly-met young nurse, poured out the story of the child she and Winston had lost; to this wise, down-to-earth, delightful young woman.<br><br>These were probably the last days of the \"right to rule\" self-image of the Tory Party. For England's powerful middle classes it was still normal to think of a Labour Government as a temporary aberration. The moment I saw the book that Winston inscribed to his nurse I recalled that not even the first volume of \"A History of the English-Speaking Peoples\" had yet been published. But it didn't matter in the slightest. It was not a gaffe. It was an inspired and moving moment in the plan of this outstanding film. The acting skills on display in 'Churchill's Secret' are - I submit - breathtaking. Why do we take for granted the artistry of our wonderful British actors? We need to show them our love with the compliments they deserve.","user":"vanilla_airlines-776-350384","rank":[19,20]},{"title":"Absolute masterclass in acting.","rating":9,"date":"3 March 2016","review":"A look at the later life of one of Britain's most famous Prime Ministers, Winston Churchill, running the country at 78, having recently had a stroke, is taken home by wife Clemmie to have absolute peace away from Cabinet. Desperately ill, he is Nursed by the wonderfully capable Nurse Millie Appleyard.<br><br>I have to say I am at a loss to read such poor reviews for Churchill's Secret, I too waited with huge anticipation for this drama, and I have to say I wasn't disappointed. A lavish production, a great story seldom told, I thought this was rather captivating. The part where Clemmie tells Millie about the death of the child was heartbreaking, but incredibly well acted.<br><br>What a phenomenal combination Michael Gambon and Lindsay Duncan are, two of my all time favourites, each showcasing their true majesty. Gambon added a gravitas, a stubbornness, and somehow a fragility into Churchill, when he is on screen, it's simple, you watch him. Lindsay Dunca, too, just awesome as his concerned, but very British wife, Clementine. Add the likes of Romola Garai, Bill Paterson and Tara Fitzgerald, and there was only really going to be one outcome.<br><br>Jonathan Smith's novel, brought beautifully to life by Stewart Harcourt and co. Worth the wait, and well worth seeing. It was moving, with a slight dash of humour, interesting, a brilliant piece of drama.<br><br>9/10","user":"Sleepin_Dragon","rank":[36,41]},{"title":"Great Britain's hidden crisis","rating":7,"date":"11 September 2016","review":"Michael Gambon as Winston and Lindsay Duncan as Clementine Churchill lead a good cast in a good recreation of the 50s and the hidden crisis that the United Kingdom had at the time. If you can imagine a situation where Barack Obama suffered a stroke and Joe Biden was also incapacitated with bad jaundice then you have some idea of what Great Britain was going through. And the media stayed silent. <br><br>After leading the Conservative Party to victory in 1951 Churchill two years later sustains a serious stroke and it's touch and go. Anthony Eden as Foreign Secretary was considered the heir apparent, in fact he had even expected to lead the party in 1951, but patiently put his ambitions on a backburner.<br><br>Alex Jennings plays an increasingly impatient Anthony Eden who felt that Churchill had just stayed on and Eden was ambitious to have his turn at the top of the greasy pole. What you're seeing here concerning them is true enough. What is not shown is that when the torch passed Eden got himself and the country in a royal mess over the Suez Canal and his government barely lasted two years.<br><br>My favorite is Michael Macfayden as Randolph Churchill. Winston's only son was the belligerent drunken lout you see here. But like his three surviving sisters could never come out from so great a shadow. Oddly enough Winston's relationship with his father Randolph was somewhat the same.<br><br>The only equivalents I can see in our history was when Grover Cleveland had that cancer operation one of the very first performed in his second term and no one knew until 20 years later. Also Churchill's counterpart FDR spent an entire month during World War II almost in seclusion at Bernard Baruch's estate in South Carolina and the public never knew at the time. Roosevelt was in almost terminal exhaustion from war leadership and he would die within two years of that.<br><br>Churchill's Secret is good history for the viewer.","user":"bkoganbing","rank":[13,14]}]