[{"title":"Funnier than others reviewed","rating":7,"date":"25 September 2018","review":"Think it depends on people's sense of humor. We thought it was funny. A mild funny but funny dad and son coming of age hunting movie. The scenes were beautiful. Give it a chance.","user":"luluslounge","rank":[9,11]},{"title":"Suprising","rating":8,"date":"15 July 2018","review":"I thought the movie was quite good. If your looking for an action packed movie look elsewhere. A father son bonding type movie in a hunting setting. The layout is actually pretty true to a hunting type predicament. A dad tries to reconnect with his son and show him the beuty of the natural world, and what he does for a living, while the son doesn't really want any of it but tries at some points. Danny McBride played a good, sometimes vulgar but, not over the top comedic relief. At some points in the film the acting feels forced, but when you look at the whole of the movie, it actually would be that way in real life because of the situation the characters are in. Ex alcoholic dad who is never there trying to reconnect with his son. All in all it's a good coming of age, father/son bonding, nature vs. technology type movie. It's also a great movie for a hunter especially slightly older one. They will say it hits the nail on the head.","user":"slapshotgoon","rank":[12,16]},{"title":"Not Terrible, but Definitely not a Must-Watch","rating":4,"date":"17 July 2018","review":"The greatest problem with 'The Legacy of a Whitetail Deer Hunter' is that it's a comedy, but it's not funny. While it has the rhythm and beats of a typical comedy, nothing funny is ever done or said. <br><br>The film begins with a mockumentary intro of Josh Brolin playing Buck Ferguson (the summer of Brolin continues! sort of), a man attempting prove through his series of DVDs that he's the world's greatest hunter. <br><br>Actually, the first ten minutes are promising. The film is self-aware and mildly amusing. Sadly, the remaining 70 minutes fail to deliver on the early promise.<br><br>It tells a typical fathers, sons and legacies story that has been done many times before and often done much better. Buck, along with his friend and cameraman Don, takes his 12-year-old son Jaden on their first big hunting trip together. Buck, who hasn't seen Jaden as much since the divorce, hopes to capture a loving father-son story on video and simultaneously help his son fall in love with hunting. <br><br>Neither of these efforts is particularly successful because Jaden is preoccupied by his girlfriend and his cell phone (darn kids these days!). A frustrated Buck lashes out at Jaden and Don, damaging both relationships and putting a serious damper on the trip. <br><br>But this is a movie, so if you manage to watch this whole thing (it's only about 80 minutes) you'll see Buck attempt to redeem himself and mend the relationships with the two most important people in his life. <br><br>On the acting side, Brolin is fine, while the kid is a rough watch, though better writing certainly would have helped him. The bright spot is Danny McBride as Don. He's the heart of the movie-the most likable and relatable character. He's also the only one who succeeds in providing any sort of comedy. <br><br>It's not a spoiler to say this is: the ending is interesting. I don't mind an ambiguous ending, and I think this one is worth pondering.","user":"Jared_Andrews","rank":[10,13]}]