[{"title":"Half a story","rating":7,"date":"3 November 2017","review":"A film like this is viewed through the lense of our experience. In the 60s I was politically active, adored Bobby Kennedy and despised LBJ. So naturally I think the film was too kind to LBJ and too unkind to Bobby. But let's put that aside and look at the film itself.<br><br>The acting by Woody Harrelson and Jennifer Jason Leigh is excellent. You think you're watching the real thing. They are the only two actors who do such great job, and the others do OK.<br><br>There is a real sense that this is a docudrama rather than a film.<br><br>My main criticism is that the film makers stopped in mid film. The story of LBJ didn't end with the passage of the Civil Rights Act of 1964. It continued through the devastation of the Vietnam War. The true story is how Johnson squandered the legacy of JFK with his foreign policy, and all that is left out.","user":"drjgardner","rank":[52,59]},{"title":"Safe Non-Offensive Look at the 36th President","rating":6,"date":"18 September 2016","review":"Few things are as comfortable as a Rob Reiner film. The director who is still commonly referred to lovingly as Meathead by fans of the iconic All in the Family television series has been directing films since the early 80's and his films are consistently entertaining inoffensive fair marketed to mass audiences. The Princess Bride, A Few Good Men, The American President and The Bucket List are just a sampling of the director's filmography that audiences will be familiar.<br><br>Those that watch Rob Reiner on the talk show circuit would know that the outside of being an actor and director, he is very political activist who uses his celebrity status to bring attention to equal rights and to social issues such as violence and tobacco use.<br><br>So it is a bit of surprise that Rob Reiner has never made a film that might leverage his strong activist lifestyle. Until now, that is.<br><br>LBJ is Rob Reiner's film about the 36th President of the United States, Lyndon B. Johnson, who was thrust from the Vice-President's chair to the Oval Office desk after the assassination of John Fitzgerald Kennedy on that fateful November day in 1963.<br><br>Woody Harrelson plays LBJ and the film takes us backwards and forwards in time from LBJ's unsuccessful run for the Democratic Party nomination through JFK's assassination and ultimately through the President's fight for an Equal Rights Bill.<br><br>The heart of the film comes from LBJ's battle within his own party. Robert Kennedy (Michael Stahl-David) is hardly a fan of the foul-mouthed Texan who was hand-picked by brother John for the Vice-President position. The two will battle wills and disagree on almost all political talking points throughout their tenures. Also providing resistance to LBJ's forward thinking is Senator Richard Russell (Richard Jenkins) from the state of Georgia. Russell is portrayed as a racist that does not believe that individuals of color deserve the same rights and freedoms as all other Americans. LBJ does his best to try and win the trust of Russell and LBJ walks the thin line of keeping Russell in the fold before he abandons his friendship with the Senator in his attempt to fulfill the inroads JFK had made in his equal rights efforts prior to his assassination.<br><br>Harrelson is barely recognizable as the title character. The make-up is thick to ensure he resembles the former President. At times, the make-up is brilliant. The big ears and receding hairline of LBJ is captured expertly. But at other times – particularly in close-ups – the make-up looks like Harrelson was an extra in Warren Beatty's Dick Tracy film.<br><br>LBJ is obviously the focus, but there is ample time given to JFK. And the assassination in Texas is captured with valuable attention to detail. The assassination is a key point in the life of LBJ and Rob Reiner takes the time to film it correctly (it was filmed in Texas exactly where the shooting took place). Jeffrey Donovan (televisions Burn Notice) plays Kennedy and brings subtle touch to the role not attempting to overdo the Boston drawl.<br><br>As with all other Reiner films, LBJ plays it safe. Audiences may learn a few things about the complicated man along the way. His foul mouth, how he would have meetings while sitting on the toilet, and his insecurity always believing that he was not loved by either his inner circle or his country (he did win re-election by the widest margin in American history). To my embarrassment, I didn't know that LBJ was in a procession car with JFK the day he was killed. But LBJ is no Lincoln. Where the Spielberg film was brilliantly written and a character study of both a political family and the process to which they battled, LBJ skims the surface like a rock skipping along calmer waters. Gritty, LBJ is not.<br><br>But safe entertainment can still be good entertainment and Reiner is surely a master at that craft. There is plenty of humor in the film to keep the characters interesting and keeping the story non-linear works to valued effect. LBJ will not be considered Rob Reiner's best work, but it is exactly what you can come to expect from the director. And slipping into a comfortable shoe can be so so comfortable.","user":"gregsrants","rank":[53,67]},{"title":"A chapter on a very thick book.","rating":5,"date":"22 January 2018","review":"Lyndon Johnson gets a very sympathetic (while RFK does not) look from the most unlikely of defenders in liberal film maker Bob Reiner's LBJ. The grossly misleading title about this larger than life character however covers little of his career, deciding instead to zero in on the period around JFKs assassination, Johnson's ascendancy to the Presidency and passage of The Civil Rights Bill. It offers an interesting look at power play at the highest levels as Johnson intimidated to begin with by all the Harvard intelligentsia in the cabinet attempts to establish himself. <br><br>Woody Harrellson's LBJ passably captures the crassness and incertitude but fails to deliver the man in full that as Senate Majority leader bullied and cajoled members into line. There are flashes of the famed abrasiveness but they are far out weighed with a pouting, insecure LBJ huddling with Lady Bird. Anyone familiar with this man's public career know the material Reiner had in his arsenal to make an outstanding character study. Instead he only gives us a chapter of an incredibly controversial career when we are expecting a book. LBJ shortchanges.","user":"st-shot","rank":[14,17]}]