[{"title":"Keep the spirit of 90s martial arts movie","rating":8,"date":"2 August 2017","review":"I still think N.B.D 2 is a fun movie but thank god they get rid of those pretty boys in this one cause Michael Jai White is the only reason why i watch this series and he get to flexing his muscles a lot this time.Get back on track after what happen last time Case Walker played by the talented Michael Jai White find himself in Thailand face off with a gruesome fighter named Braga.The movie is fill with good choreographed fight scene with some very realistic MMA moves and you can't believe Michael doing all that despite the fact that he about to turning 50.The movie is light-hearted with some cheesy moment about friendship but that what these kind of movie about so i enjoy every minute of it and hope one day to see Case Walker vs Yuri Boyka","user":"phanthinga","rank":[7,7]},{"title":"Jai White with Charisma To Spare..","rating":8,"date":"6 June 2016","review":"1. Big fan of Michael Jai White, which I made clear in my other reviews, especially Blood and Bone, which is a must-see. Called him \"the most under-utilized MMA asset in Hollywood.\" <br><br>2. Guess he got tired of waiting for a phone call, because MJW as \"director\" cast himself in Never Back Down 2 which, for a low budget effort, was a really tight little indie and seems to have given his career a well-deserved second (third?) wind.<br><br>3. At 48 years young, MJW is 15 years younger than Steven Seagal, who keeps cranking out Direct To Video productions that should more correctly be called Direct-to-Forget. Except that MJW looks ten years younger than he actually is, and SS looks ten years older than he actually is.<br><br>4. This film, NBD3, is unlike anything MJW has done before and even unlike NBD2. It can be considered MJW's personal version of Rocky. (And of course has virtually no connection to NBD1 other than the name.) The script is slow in spots but contains sly humor one does not usually find in these sorts of films. The fight scenes totally rock and there is a new \"trope\" that MJW (as director) seems to have invented that involves \"forecasting\" a fight just before it happens, using slo-mo shot in Black and White. Cool! <br><br>5. There are two very strange cameos by Tony Jaa and Rampage Jackson which I am still trying to figure out. Ditto for another walk-on by a female Thai martial artist who looked like she weighs 75 pounds soaking wet. And the \"big finish\" for the story is taken straight from the playbook in Red Belt, another great (and overlooked) MMA film.<br><br>RECOMMENDED (!) as both solid entertainment and something different and unexpected. And please remember to see Blood and Bone and NBD2 if you have not already. Also rec Bronson in 1975's HARD TIMES.","user":"A_Different_Drummer","rank":[16,24]},{"title":"Solid work","rating":8,"date":"2 January 2017","review":"What a nice surprise. Michael Jai White did excellent work. He managed to refrain from unnecessary Hollywood-overkill and instead just told a story that flows nicely and rewards the viewer with some spectacular fight scenes. It's actually a bit understated. A rare thing to find these days. I'll give you an example. During the finale of Hard Target 2 all I could think of was: My God, does the shooting never stop? What could have just been a gritty survivalist martial arts movie, had to be made into an over-the-top action vehicle. But it didn't look like the production crew had the money or experience to pull their ideas off. It just ends up looking disappointing. Thankfully, Michael Jai White had no illusions about his project. <br><br>Not everything about this movie was top notch. But it just seemed to work for me. I got exactly what I needed. And maybe you will too. I hope MJW will be involved in many more good projects like this one.","user":"dschlatter","rank":[3,3]}]