[{"title":"Try hard Indie flick","rating":2,"date":"10 December 2018","review":"The intro scene was captivating with it's mood and colours. But after that, it became a mess. The director has painted the villains black and white like Sin City but the pacing is off, a bit too slow and never really gets your attention. I get that this is low budget but with skill, it should engage the audience and sadly it failed to do this. Other scenes they used soundtrack Eric throws the mood continuity of the movie and it now felt like a mish mash of music videos that makes you wonder what is this movie trying to show??? After 20 minutes, I still couldn't figure it out and the acting has just become worse and amateur that I decided to turn this off. So here I am writing a review to warn you that you can waste your time on something better.","user":"oceanmaya","rank":[11,14]},{"title":"Awful","rating":1,"date":"9 August 2018","review":"When I went to see this movie, I did so because it had a 7/10 rating. I had expected it to be a good movie, but what I was met with was a trope and cliché filled attempt at a revenge film by a director/writer who is trying way too hard to be Quentin Tarantino.<br><br>Imagine Tommy Wiseau directing \"Kill Bill\" and you would get something in the vicinity of this movie. It's been a while since a movies dialogue made me cringe this badly.<br><br>I feel it is my civic duty to warn others away from seeing this, so I made an IMDb account with the sole purpose of writing this review. That is how disappointed I am with this film.","user":"camerongrant-77384","rank":[20,35]},{"title":"A flawed gem","rating":8,"date":"7 August 2018","review":"This is one of those rare films when one individual wears too many hats - and succeeds.<br><br>Novice director, writer, producer, cinematographer, sfx, vfx, and editor Usher Morgan makes his full length feature film debut in most of the above categories in this low budget (350K) B-grade indie film with many novice actors.<br><br>Sure it's not an original production (the theme paying homage to Sin City and Kill Bill), and it had its writing flaws, overplayed cliche's, overzealous cartoon scenes, overloaded with cringy slow-mo's, and the acting was certainly not Oscar-worthy. But let's remember that this was an ambitious independent low budget production and should not be compared to big budget Hollywood productions with A-list actors. I can see many of the wannabe critics on IMDb will slam this film and not appreciate its production values. Having said that, I really enjoyed it. It felt like it was a \"industry friends and family get together to make a fun film\", and fun it certainly was. Most of the cast members wore more than one hat as well, and for such a small production, it showed really well. The cinematography was nearly flawless and the directing really good. <br><br>This neo-noir crime film isn't for everyone, but I for one can look past the flaws and see it as a gem, one that certainly qualifies for a cult following. Would I recommend it? Absolutely. Would I see it again? At least one more time. A well deserved 8/10 from me.","user":"TheTopDawgCritic","rank":[16,30]}]