[{"title":"Fun from the first minute!","rating":9,"date":"15 October 2018","review":"This movie was incredibly animated. Dynamic camera angles, incredible color palate, the works. The action scenes were brutal and bloody, but also didn't sacrifice the reality of the universe of the film. The only star i didn't give was because of the love story. I feel like that part was a little forced in the ending scenes and it would have been better if the movie ended on a different note.","user":"firepaw4395","rank":[26,32]},{"title":"Creative Fun pushing forward","rating":9,"date":"16 March 2019","review":"Sub culture at its best. Fun &amp; action from the first minute.\nExtraordinary visual in different styles, very creative.\nI can not understand mediocre reviews from mainstream media (old men?)","user":"skptika","rank":[23,29]},{"title":"This has a target audience.","rating":8,"date":"2 January 2020","review":"I think some movies are always going to be affected by the lens you watch them under. I'm a massive fan of a horror movie called \"The Collector\". About a jewel thief who breaks into a house only to be forced to battle a serial killer who's created elaborate traps to torture the family who was supposed to be on vacation. The movie has an amazing soundtrack, great writing and cinematography, but at the end of the day it's a gory horror, difficult appreciate for anyone excepting film makers and horror fans.<br><br>MFKZ is stuck in a similar position. Its a scifi neo jpop gangsta animation that both embraces thug culture aesthetic while at the same time pointing out how miserable it is and being an epileptic seizure inducing animated scifi comedy superhero film.<br><br>Whos the audience for that? Well I guess I am. I loved the refusal to adhere to a consistent animation technique. I loved the style and I cheered at the shoot outs.<br><br>I think its awesome in the same way \"Into the spider-verse\" is awesome. Its action filled, kinetic and as an artist, inspiring. If I had a complaint Id say some of it is a bit been there done that, as far as the story goes. If youve seen anything like Kill-La-Kill youve seen this before. Still, I personally loved it.","user":"just_in_case","rank":[6,6]}]