[{"title":"I Know the studios are bought by China","rating":11,"date":"11 August 2019","review":"And the Chinese characters are supposedly needed so Chinese characters go watch the films, but give these women something to do! If you watched kong or Pacific Rim they keep putting these women in these films and they have nothing to say or do!\nCome on.\nI mean she was thin and had nice air, but even as a love interest device it did not work. She had a child. I mean sure as a man anyone would tap her, but 'love' interest? No.","user":"vadimarlyn","rank":[123,147]},{"title":"Honest Thoughts On The Film By Jason Statham And Director Jon Turteltaub","rating":10,"date":"10 August 2018","review":"Although I've just watched this film, this is not a review in the traditional sense. I just wanted to make this clear, because I don't mean to mislead anybody. Rather than giving you my own two cents (well, I WILL give you those, but later), I would like to let the people directly involved in The Meg share their - refreshingly honest - thoughts on it, because they had some very interesting things to say that helped me better understand what I'd just seen. Let's start with Jason Statham's recent interview with Frosty Weintraub. You'll notice Jason tries to be diplomatic, but he has a very hard time concealing the fact that he's not too happy with the finished product:<br><br>\"The film changed a lot. The script was totally different. There was so many different ... sometimes you just go: How did it happen? How did it go from this to this to this to that? I guess if you have the control to keep it a certain way you would, but you don't. They have so many people deciding on what action stays and what scenes stay. How the characters ... In the end they want to put something at the beginning. The whole thing at the beginning where I *spoiler* do a rescue on a sub? That was not in the script that I read. That was all brand new stuff. Good or bad, I'm just letting you know. But (originally) there was other stuff at the beginning that was ... I'm, you know. I'm just saying it was radically different.\"<br><br>\"I guess in some ways your imagination and your own perception of what it's going to be is its worst enemy. John (Turteltaub)'s interpretation of this is a fun end of summer movie. It's full of humor. He's put his very light-hearted way into it(...). It's a little bit more directed to a different taste of what my own is in terms of I like more gory adult stuff. You go: Where's the effing blood?! It's like, there's a shark. I'm a lot older but I can't speak for what this film could possibly speak to a younger audience. I might have made a film that not many people wanted to see. I'm not a filmmaker.\"<br><br>\"I'm sort of an actor that's going to portray a role. I go there but I've learned not to get too attached with your own idea of what something could be. I don't know. As an audience goer you're spared all of that sort of things that can ruin a movie for you. I think as you're involved in these films you get more and more critical and going: That bit there should have spent more money on the CG. That bit there they should have made that more gory. Where's the other bit that was in the original? You get very critical.\"<br><br>And director Jon Turteltaub had this to add in a recent interview with a horror-oriented film site: \"I am so disappointed the film wasn't more bloody or disgusting. My wife is glad about it, and I'm glad my kids can see the movie, but the number of really horrifying, disgusting and bloody deaths we had lined up that we didn't get to do is tragic. We shot or even did a lot of visual effects for gory scenes. There was some really good shìt that didn't survive to the final cut.\"<br><br>As Statham and the director both alluded to in their interviews, apparently, during post-production the decision was made that The Meg would have to be appropriate for teenagers, and the film was significantly re-cut. When Turteltaub was asked if he would like to see his own, unrated version released, he said: \"Yes. Mine would have a lot gorier, but funnier, deaths for people. It's just awesome. Killing people in movies is a lot of fun.\"<br><br>So there you have it folks, the star and the director seem none too pleased about studio mandated changes to their movie in their assessment of the theatrical cut. I've watched the film despite myself, and it's actually nowhere near as bad as I feared - it's fun in a harmless, forgettable kind of way - but what Statham and Turteltaub are implying is spot on: the whole film constantly teases you with unfulfilled potential. Now let's hope we get the better version upon home release.","user":"ripleyspussy","rank":[488,609]},{"title":"Excellent Comedy","rating":2,"date":"27 December 2019","review":"Dry humor and absurdism all over. It condemns people (like me) who pay and spend time watching this tripe... it condemns materialism, and people who have no quality control (like me)\nWatch it so the studio can laugh at you. That is how stupid this film is.<br><br>There is one thin feminine woman in the whole thing and she has her child with her!?!? Am I supposed to fall for her??","user":"iutocam","rank":[65,76]}]