[{"title":"Ten things about Fallen Kingdom","rating":4,"date":"14 June 2018","review":"1) It's bad. I didn't like Jurassic World, but this is worse. It's got broad characters, lackluster set-pieces, a noisy score and the kind of script which should be punishable by throwing its writers to sharks. At least Jurassic World, mediocre as it was, had the good sense to copy the first Jurassic Park. Fallen Kingdom foolishly imitates The Lost World instead, with a semi-watchable first half on the island and an abysmal last act with dinosaurs wreaking havoc back to civilization.<br><br>Kudos to the late John Hammond for building his park on a volcanic island. Also, I hate to ask but, since it's a plot point that dinosaurs will face extinction (again!) if they are not rescued from Isla Nublar... what happened to Isla Sorna (Jurassic Park 2 and 3)? There were dinosaurs on it as well. I'm sure some novelization or website makes up a lame excuse, but the movie doesn't.<br><br>2) Stop overcomplicating blockbusters. Jurassic Park featured a smart sci-fi premise, but the actual plot had an elegant simplicity to it. Fallen Kingdom is the opposite, dumb but convoluted, tossing in betrayals, cloned little girls and evil corporations selling dinosaurs to warlords.<br><br>3) Speaking of that, enough with the \"dinosaurs as military weapons\" nonsense! This is a concept which appealed to all of us when we were kids (\"I want to ride a T-Rex! With a rocket launcher mounted on its back!\"), but you cannot have War Dinosaurs in anything that wants to be taken seriously by adults.<br><br>You know why Navy SEALs don't have trained lions? Why no army breeds rhinos to ride them into battle? Because nobody in modern warfare would spend millions for a huge beast which would be an economical and logistical nightmare to raise, train, feed and manage, especially when a random enemy soldier could blow it to smithereens with a 100 $ grenade. Someone should tell writer Colin Trevorrow that war elephants aren't a thing anymore, while firearms and explosives are.<br><br>Note that the dinosaur boogey of this movie, the Indoraptor, is so ineffectual that it repeatedly fails to kill its unarmed preys in the endless climax. Some infallible weapon: there is a scene where three characters are pinned under a tree and the Indoraptor manages to... scratch one of them in the knee before they escape. You know what could have killed them more efficiently than your War Dinosaur? One guy with a pistol!<br><br>By the way, the Indoraptor is trained to attack targets after you point a laser at them and emit an audio cue. Wait a second - if you are already pointing a gun with a laser beam at someone, can't you just PULL THE TRIGGER? It's a 30 cents bullet versus a 30 millions dinosaur. Bad guys, do your math.<br><br>4) Fallen Kingdom assumes you are really, really interested in Blue, the Chris Pratt-trained Raptor from Jurassic World. This is understandable, since Owen's relationship with his Raptors was one of the few bits from the previous film which at least felt novel. However, the script retcons Blue into a sympathetic, heroic creature which displayed diligence and empathy since it was young; funny, I recall her killing several innocents in the previous movie and attacking Chris Pratt himself with no provocation in their first scene.<br><br>5) Since we mention Pratt: much like Jurassic World, this movie doesn't know how to use him. Pratt is ideally cast not as a badass, but as someone who *thinks* is a badass - a character who is capable but still out of his league. He works so much better as a slightly comedic, self-deprecating protagonist than as a tediously infallible, dead-eyed action figure.<br><br>His Owen never changes. There is more character development implied with a small prop in Jurassic Park (the Raptor claw Grant uses to scare a kid at the beginning and then throws away after bonding with Tim and Lex) than in all Owen's scenes in Fallen Kingdom.<br><br>6) Howard is inoffensive but unremarkable as Claire: she is just kind of there, blandly good-looking, doing no damage but adding little value, like a lettuce in a sandwich. Her two sidekicks (Scared Nerd and Tough Latina) are insufferable though.<br><br>(By the way, how is Claire not rotting in jail as the aftermath of Jurassic World? She is directly responsible for the dozens of casualties there, poorly handling the Indominus' escape and refusing to evacuate the island. She must have one hell of a lawyer.)<br><br>7) Poor Rafe Spall, a competent actor (see The Ritual, a much better monster movie), plays Greedy Corporate Guy, an antagonist so flat and obvious that I was disappointed he didn't get an Evil Laugh Scene... you know, he throws his head back and bellows \"Bwahaha!\" while the camera cranes up.<br><br>I love how Rafe Spall builds a containment facility for dinosaurs under James Cromwell's mansion. Cromwell plays Old Sick Naive Rich Guy. Sorry, I don't care how old, sick and naive you are: you have no excuses if you don't realize someone is HIDING DINOSAURS IN YOUR BASEMENT. Really, Trevorrow? Is this some kind of spoof?<br><br>8) CGI is fine but overused. It's a visually busy movie.<br><br>I'll give them credit for making the Indoraptor more visually distinctive than the Indominus. At least they sort of splashed some yellow on it.<br><br>9) While Bayona's direction is competent (certainly better than this script deserved), I didn't care for most of the set-pieces. Remember how Spielberg took his sweet time with the T-Rex breakout or the Raptors in the kichen? Here most action beats are over right after they begin (the Baryonyx, the Carnotaurus...). There is no build-up, no crescendo. It's the cinematic equivalent of premature ejaculation.<br><br>It's not just a matter of screentime though; the Dilophosaurus appeared in the first film for two minutes and is more memorable than any of the new creatures here. You have to do something creative and unique with your movie monsters. For example, the bunker attack could have been carried out by any carnivore; if you wanted a Baryonyx (which was possibly a semi-aquatic predator like the Spinosaurus), why not put it in the sinking gyrosphere scene?<br><br>I did enjoy the prologue with the T-Rex and the Mosasaurus, although... why would the Jurassic World engineers build a giant door which allows the Mosasaurus to reach the ocean? What kind of scenario were they envisioning where the escape of the humongous sea monster would be a positive outcome?<br><br>I mean, come on. I'm not usually a nitpicker, but this movie seems to be trolling anyone giving it a minimum amount of thought. A plot hole doesn't automatically ruin a story, but the cumulative effect of all this nonsense conveys a staggering lack of thought and care.<br><br>10) The silly ending sets up another sequel. I guess we'll finally get the inevitable War Dinosaurs.<br><br>*sigh*<br><br>4/10<br><br>To people asking \"What were you expecting in a film about dinosaurs?\", I answer: \"Something maybe not on par, but at least in the same league as Jurassic Park, one of my favorite movies of all time\".","user":"petra_ste","rank":[1,2]},{"title":"IMDB seriously needs to start screening for fake accounts and fake reviews/scores","rating":14,"date":"14 June 2018","review":"There is no way so many people would be AMAZED at this POS movie and even compare it to Spielberg's original JP masterpiece or call it one on its own right.\nThis movie isnt even worth to be an episode in an average cable tv show. Its the blandest, most predictable and lazy part of the series so far. There is not even the slightest hint of originality or anything fresh in the whole film. Nor is there any tempo to the story. And barring quite good Goldblums speech, the whole 100% of dialogues are forgettable as are all of the action scenes that you feel like youve seen already 100 times in (or any generic) previous films. \nIt is a horrible, horrible product with no personal touch or vision from the director or any refreshing qualities that might bring the light back to this now utterly pathetic sad pathetic Jurrasic Park franchise. \nNot worth seeing. And IMDB please start screening the fake accounts,you can tell them from a mile away.","user":"sumtim3s00n","rank":[976,1]},{"title":"Good movie but....","rating":9,"date":"26 October 2018","review":"Basically it's just a remake of Jurassic Park 2: The Lost World. Same premise and plot. Main characters go back to island with a group of people who are allegedly trying to \"save\" them. Our heroes find out they are trying to sell them and use them as weapons. Dinosaurs transported back to mainland via ship, Dinos get free, havoc ensues, people die, heroes save the day.","user":"jeffdreamweaver","rank":[246,378]}]