[{"title":"A Christian paranoia movie with a weak plot","rating":1,"date":"5 February 2018","review":"(Spoiler alert) Mahatma Gandhi and Martin Luther King Jr. and their commitment to non-violence are being discussed in a high school AP history class. A student Brooke asks if this is similar to the teachings of Jesus. The teacher Grace Wesley responds that it is and make some references to the bible.<br><br>The movie's plot collapses right at the beginning. The bible references are enough to get her dragged to the principal's office where she is forced to either recant her statements or face the end of her teaching career - a highly, unlikely scenario to begin with. Grace was only answering a student's question. She wasn't leading her students in prayer and she wasn't preaching from the bible as though she were teaching Sunday school. The mere references to the bible, however, are too much for Brooke's freethinking parents and the \"evil ACLU.\" Brooke's parents file a lawsuit against Grace.<br><br>As the courtroom drama starts to unfold, we learn that ACLU lawyer Peter Kane's goal is to \"prove, once and for all, that God is dead.\" In the jury selection process, \"Duck Dynasty\" fans are considered reliable to the defense, while \"Pretty Little Liars\" fans are considered helpful for the ACLU. Brooke's parents are never shown mourning the recent death of their son in a traffic accident, and are hoping that the winnings from the lawsuit will finance Brooke's going to college at Stanford. The movie overlooks the probability that a high school teacher is most likely not a person with deep pockets. As if making a mountain out of Grace's molehill response to Brooke's question wasn't bad enough, the movie goes off on tangents about the separation of religion from government and the historical existence of Jesus.<br><br>I'm assuming the makers of the movie didn't hire a legal consultant to provide them with advice on the fine points of trial procedure. In the real world, an attorney cannot compel his own client to take the stand, and would definitely not treat her as a hostile witness. The ACLU attorney should have been raising objections to the defense bringing in Christian apologists to prove the existence of Jesus (or at least he should have brought in his own expert witness who could have shown there is no evidence to support the historical existence of Jesus). The whole court room scene would make any 1st-year law student laugh.<br><br>There are a few subplots going on in the movie. The atheist-turned-Christian blogger Amy Ryan who found in \"God's Not Dead 1\" (GND 1) that she had advanced cancer learns that the cancer is in complete remission and believes that it was cured by prayer. The Chinese student Martin Yip, who became a Christian in GND 1, is disowned by his father who has arrived to take him home. Brooke discovers that her late brother was a Christian. Eventually, she becomes a Christian (what a shock). Like GND 1, the movie ends at the Newsboys' Christian rock concert.<br><br>And just to add a little fuel to the conspiracy fire, a group of ministers are told by their senior pastor (Fred Dalton Thompson is his final film role) that their sermons for the past three months are being subpoenaed -- never mind the fact the such a subpoena, which screams First Amendment violations, is never likely to be issued in the first place. He never says who issued the subpoena. At the end of the movie after the credits, Pastor David Hill (another character from GND 1) is arrested for refusing to comply with the subpoena. In the real world, the ACLU would have helped the ministers defeat the subpoena.<br><br>As in GND 1, non-Christians are held in low regard. They are portrayed as either shallow (Brooke's parents), rigid (Yip's father), or devious (ACLU lawyer Peter Kane).<br><br>The cases listed, by the way, in the closing credits which claim that Christians are being persecuted for their beliefs have almost nothing to do with religion in public schools. Their focus is instead on requirements for birth control coverage under health insurance laws, and laws against discrimination based on sexual orientation.<br><br>The message of the movie is that Christians are victims and are under attack from all sides by evil \"secular rationalist forces\" that control the government - even in Arkansas (the state's never mentioned by name but its flag and the state capitol building are shown on a few occasions). The movie is made by Christians for Christians who aren't going to ask hard questions about how it's so out of touch with reality.<br><br>In the real world, some Christians (but not all) want to tear down the separation of religion from government so that they can use the government to spread their religion. Roy Moore, Pat Robertson, et, al, rail for mandatory prayer and mandatory bible studies in public schools. The non-Christians (Moslems, Jews, atheists, among others) that stand up against these high-and-mighty leaders are the ones who have been targets of hate and violence. They sometimes have had to classify themselves in lawsuits as John or Jane Does. They're not likely to have large crowds supporting them outside the court, like the crowds cheering the ACLU in this movie. Usually, they'll face angry crowds.<br><br>In recent years, some Christians (but not all) have been portraying themselves as victims for not being able to discriminate against LGBT individuals.<br><br>Note: As a historian, I would have responded to Brooke's questions by pointing out MLK's references to Jesus in his \"Letter from a Birmingham Jail\", which Grace's lawyer referenced in the court. I would have also mentioned that Gandhi said, \"I like your Christ. I do not like your Christians. Your Christians are so unlike your Christ.\" (Christian Europeans, especially the British, in Gandhi's day treated non-Christians and non-whites like second-class people or worse, which hardly reflected a belief in \"love thy neighbor.\")","user":"PeaceAndLongLife","rank":[55,74]},{"title":"Remarkable Movie","rating":8,"date":"28 April 2016","review":"A fascinating sci-fi alternate reality thriller with a fundamental reality twist that would put Hitchcock and the writers of the Twilight Zone to shame. Imagine a world where Christians were victims of oppression and persecution in the United States. As hard as it may have been to conceive of such an outlandish alternate reality (much less make a film about it), the team behind GND2 were Kubrickian in making this film. The idea itself is worth 10/10 stars on its own, all the way to its conclusion of an ordinary schoolteacher besting an Orwellian justice system. It puts everything in perspective, as the oppressors become oppresses (the shoe is on the other foot, so to speak). The film carefully parallels the persecution of non-Christians by seemingly earnest (but deceptive) believers, and completely switches it around! There were some faults, of course. Some of the legal jargon was misused (as it depicts a civil suit, yet the heroine is warned of criminal liability), and the presence of some expert opinions didn't really seem to be relevant to the case. Also, the dialogue did seem, well, unrealistic (but such is to be expected of Sci-Fi films). Overall, however, I felt transported to another dimension at the film's onset, one where Christianity was routinely shunned in the US. I felt as if I were really there. The one thing that stuck out, though was the audience: It didn't seem like a sci-fi prone audience, although the other viewers seemed even more convinced of this truth of this alternate universe than I was. I give it 8/10 stars.","user":"spencerkberry","rank":[158,271]},{"title":"More Christian paranoia with no basis in reality.","rating":1,"date":"7 August 2016","review":"God's Not Dead 2 is another paranoid fantasy where Christians are being persecuted for their beliefs in the US. A teacher, Grace Wesley, is asked a question about Jesus in history class and gives an innocent answer. Suddenly, an arsenal of evil atheists led by the ACLU takes her to court for violating the separation of church and state. Meanwhile, pastors are forced to hand in their sermons for review by a government agency in a subplot that is introduced and then dropped and never resolved. <br><br>The whole plot is ludicrous. In the real world, the villains obviously wouldn't have a case because Wesley didn't actually preach to her students. But for the sake of the plot she's taken to court so that we can get to hear \"expert witnesses\" like Lee Strobel tell us that Jesus really existed, as if that's what the case was really about. In the closing credits, about a dozen real court cases are cited as inspiration, but if you read the summaries about them not even one of them is even remotely similar to the case in the movie. This just shows that the whole premise of the movie is a complete straw man with no basis in reality, designed to feed the persecution complex of some Christians. Movies like this only makes Christians look ridiculous.","user":"NoWireHangers","rank":[124,222]}]