[{"title":"a great little comedy","rating":8,"date":"19 June 2019","review":"Its a never ending action comedy movie, about a little girl and her friend , wanting to make a horror film. her father does not like the idea. it will all be further complicated by her older sister coming home with a surprise. shes going to get married. to her lesbian girlfriend. dad doesnt approve to that either, so when the strange inlaws invades this house and family , the fun stuff appears much more and better than expected.<br><br>its an all family producton, and the young actors are really natural and good. it has also some glimpses of a blimpin family that tries to have at least a toe near the ground, but takes of to the sky dreaming of a marriage you will forever remember.<br><br>the grumpy old man found zilla and zoe so attractive and good, and made my afternoon so comfortable that i have to recommend it to everybody","user":"ops-52535","rank":[9,10]},{"title":"A cute blend of horror and comedy genres","rating":9,"date":"30 June 2019","review":"As the characters are being introduced and developed, the plot thickens! New twists are happening as we see the character personalities clash with each other, often with humorous results.\nFilmed mostly in \"keep Portland weird\" adds a sense of craziness to the plot as the film winds it way through the antics of the families planning the perfect wedding for the \"brides\" who finally discover that they really don't want the perfect wedding.\nCute and funny, weird and crazy; the ending brings it all together in an all-out \"Thriller\" scene, only missing is the voice of Vincent Price!\nI enjoyed the film; see it for fun!","user":"chipandwine","rank":[3,4]},{"title":"A Real Treat!","rating":10,"date":"30 June 2019","review":"Loved this film! A real treat! Creative. Different. It's not easy to infuse true humor into a horror film, but the director and cast succeeded! The acting was excellent. The plot was different and interesting. The cinematography was good. We enjoyed the character development. Loved the ending! Kudos to the cast and crew on a film well made!!!!","user":"teambergie","rank":[3,4]}]