[{"title":"bad ending, lots of messaging","rating":1,"date":"29 September 2019","review":"Moral of the movie is witches are real, and they are good, they try to fight evil with their witchcraft.\nand there's secret cult like groups serving the devil, and they win, the end.,<br><br>seriously the bad guys win in the end. who writes a script like that? must be a sociopath.","user":"rektaronis","rank":[13,23]},{"title":"Fun Thriller!","rating":9,"date":"2 October 2019","review":"Enjoyed the jump scares .. had good humour in the right places - solid film from start to finish...keeps you engaged.","user":"ravdeesh","rank":[3,12]},{"title":"PUTS A CLEVER NEW SPIN ON URBAN LEGENDS WHILE PAYING LOVING HOMAGE TO MIDNIGHT HORROR","rating":9,"date":"5 October 2019","review":"I'm a sucker for urban legends and real life ghost stories, so I was pumped to see this film from the synopsis alone. Fortunately, THE CURSE OF BUCKOUT ROAD does not disappoint. I had an absolute blast with this well-paced and engaging film that's part dramatic psychological thriller, part supernatural mystery, and part satisfying throwback to 80s grindhouse horror. It kept me guessing throughout, and filmmaker Matthew Currie Holmes does a great job balancing the tonal shifts as the film moves effortlessly from humor, to drama, to creeping suspense.<br><br>CURRIE HOLMES BRINGS AN EXPERTISE AND ASSUREDNESS BEHIND THE CAMERA THAT REFLECTS THE WORK OF A MORE SEASONED FILMMAKER. He also demonstrates a strong ability to elicit powerful performances from his talented cast. To put it plainly, this film looks incredible. Creative filmmaking choices are used to great effect for the re-enactments (shown through dream sequences) of the creepy urban legends the road is famous for.<br><br>THE CURSE OF BUCKOUT ROAD is a supernatural love letter to the midnight movies of the 1980s that Currie Holmes grew up on. The captivating dream sequences play out as mini films within a film, each shot in its own unique style. The scenes - which include three witches being burned at the stake and teens being terrorized by albino cannibals - pay homage to genre tropes and the various cinematic stylings of the 70s and 80s. They are as disturbing as they are visually compelling. Rich textures and thoughtful costume design add a sense of authenticity to the nightmarish sequences.<br><br>This is a film made for horror fans by someone who is also an avid fan. At no point does Currie Holmes talk down to or pander to the audience. There's a genuine affection for the genre and genre fans that's infused in every scene, every line of well written dialogue, and every convincing characterization. There's an attention to detail that highlights both the expertise and the heart behind the camera.<br><br>MEANWHILE, IN FRONT OF THE CAMERA, THE CAST REALLY SHINES.<br><br>Veteran actor Danny Glover is every bit as good as you'd expect to him to be, and his presence in the film instantly lends a sense of gravitas to the proceedings.He's joined by two other seasoned, powerhouse actors, Henry Czerny and Colm Feore. Both more than deliver, especially Czerny who is every bit the scene-stealing showman he was in the recent horror hit Ready or Not. But it's not just the pros who bring their A-game. Young actors Evan Ross and Dominque Provost-Chalkley are exceptional.<br><br>Ross plays his character with a subtle hard edge while remaining utterly likable and sympathetic. Provost-Chalkley is a standout and simply mesmerizing to watch on screen. Additionally, Kyle Mac and Jim Watson add great comedic relief as a pair of endearing, fraternal stoner twins.<br><br>There are a few solid shocks and a subtle, restrained use of gore. But don't go into this film expecting an over-the-top bloodbath or a jump scare-fueled ghost film. Instead, Currie Holmes relies on well developed characters and intelligent storytelling to build suspense and make you care. There's also some interesting subtext about the eternal battle of faith versus fact that adds surprising depth to the film.","user":"bkgreenhaw","rank":[1,9]}]