[{"title":"Waste of time.","rating":1,"date":"24 April 2016","review":"I'm sorry but the film was just horrible. I watched it the other day, and it felt like a 10 hour long film rather than a less than 2 hour one. The acting from the protagonist was so bad that I fell asleep several times watching it. Don't listen to the other reviewers.<br><br>I have watched other WWE movies in the past, so the measuring stick for this movie wasn't that big going in and despite that, this movie couldn't reach the top of it. There are other wrestlers in WWE who could be great actors if given the chance, but the promotion is very corrupt and biased, so only the backstage favorites get that chance. I wish they would let someone that can act get an opportunity like this for once.","user":"piercedavid-71648","rank":[19,32]},{"title":"Has a great and tense story that actually makes up for the lack of dramatic acting and is actually pretty good in spite of itself","rating":5,"date":"5 April 2016","review":"\"We have a bomb strapped to a kid somewhere in the city that only an unidentified dead man knows the location of, and we have 6 hours and 42 minutes to find him.\" Ray (Ziggler) is a detective who hasn't been the same since he lost his son. He keeps crossing the line and is finally facing suspension. When he finds out that a young boy has been kidnapped and strapped to a bomb he ignores his suspension and sets out to find him before its too late. Now, facing a deadline Ray and IA officer Julia Baker (Isabelle) put their differences aside in order to save the boy. This is a movie that has a great plot, it is very tense and exciting to watch it unfold. The one thing it is missing are the actors to really pull off the drama needed. Going in, since this is a WWE movie that is to be expected but it still seemed to hurt the movie. That said though, this is perhaps the best WWE movie to date. Overall, a movie with a great and tense story that actually makes up for the lack of dramatic acting and is actually pretty good in spite of itself. I surprisingly give this a high B.","user":"cosmo_tiger","rank":[9,22]},{"title":"Intense action movie","rating":7,"date":"19 April 2016","review":"For DZ's first feature film, I thought he did a pretty phenomenal job, though I felt some moments he kinda felt stoic and not portraying enough emotion. The emotional backdrop of Ray Thompson's loss of his son was one thing I thought he shined with. He's a bit of natural, he's got it there but just needs to improve and show that he can take up a serious role. The story was absolutely intense, from the chases to the brawls to the crazy explosive escape. Everything was top there! It's no masterpiece but it's another great cop film with a very tense premise and real life atmosphere. My only disappointment was the WWE Live event setting, i thought it was going to be the main setting of the entire movie kinda like Sudden Death with Van Damme. All of the live action was just within the first act but the last half of the movie was just as intense as the beginning. Countdown is great but far from any action set masterpieces such as Die Hard. I give this movie a 7 out of 10.","user":"TJMBuddlake","rank":[6,13]}]