[{"title":"Many personal insights from a major public figure","rating":6,"date":"3 December 2017","review":"I didn't know what to expect from the film going in, but I thought it was a learning experience ultimately. I learned about some of the things that drive Bill Nye that I didn't know. Why does he continue to talk to rabid opponents of science? How does he examine the evidence? <br><br>Revealing personal and professional details that are sometimes unflattering helped to give this film s bit of self-awareness that's not always present in follow-this-famous-figure films. Some things are left unanswered--is Nye's the right strategy for dealing with some raucous topics in science? What will his legacy ultimately be? <br><br>I think it's worthwhile to see the stories of folks on the front line of science battles as we think about how we want to make decisions on education, health, and environmental issues going forward. It's not easy to stand there, but I'm glad some have the courage to take it on. And seeing them as regular people may be helpful.","user":"MEMangan","rank":[19,37]},{"title":"An Essential film at a pivotal moment!","rating":9,"date":"5 November 2018","review":"First the big hulahoo is that Bill Nye is not a Scientist. He never says he's a Scientist, he's an Engineer and people call him Bill Nye The Science Guy cause he did a Science show and comments on science topics. That doesnt make him disqualified to talk about important issues affecting all of us like Climate change. He makes it a point in this film to actually visit the Climate Scientists who are freezing their bones in the artic to study the history of our climate and to present their findings to us. It's sheer hypocrisy to reject his points by saying Bill Nye isn't qualified enough when these same people reject the conclusions of the International Climate Science Coalition which collates research from tens of thousands of climate scientists from hundreds of countries around the world.\nAnother major issue many people have is that science isn't consensus? By consensus scientists mean the same experiment being tested repeatedly by different scientists and giving the same results..that is how new medicines get tested. If people are critical of scientists then dont depend on their work. For every dam cold &amp; headache you need your precious medicines..you can't live without your smart phones which wouldn't be there without Mechanical Engineers &amp; Physicists. You can't pick and choose the reality you live in: Its either there or not there. And CO2 is definitely here otherwise where do you think all that smoke from vehicles and factories and planes go to?","user":"richard-abeysinghe428","rank":[6,9]},{"title":"Scientist...NOT!","rating":1,"date":"29 October 2018","review":"Agenda-driven show.<br><br>Any scientist that says science is determined by consensus isn't a scientist. Science is determined by facts.<br><br>Any scientist that says \"The science is in, the discussion is over\" isn't a scientist. A scientist abides by the \"Scientific Method\". By definition, any hypothesis continues to modify, due to further observation, testing and experimentation.<br><br>Bill was good at explaining some novice science to children, but fails outside of that venue.","user":"rsvp321","rank":[23,55]}]