[{"title":"A touching film","rating":6,"date":"6 October 2019","review":"I am terrible at writing reviews, and rarely see the point in doing so, given that there are so many that are fake or of otherwise negative intent. But I felt compelled to review this film.<br><br>I grew up starving for a positive male role model, and so I related quite strongly to this story. I can understand those who don't have that connection finding the film slow or outright boring.<br><br>For my part, though, I very much enjoyed a story that spoke to the need for such a figure in a young boy's life.<br><br>My uncle actually moved in with us for a time, and I relished it--but my mother thought his dating lifestyle was a negative influence, so she kicked him out. It was agonizing to me. And yet I said nothing.<br><br>We are human beings that have needs. Being ignored and/or abused and/or ridiculed relentlessly are not among them.<br><br>Thank you for telling a worthwhile story from such an incredibly rare angle.","user":"non-shill","rank":[50,58]},{"title":"Underrated movie...","rating":7,"date":"10 October 2019","review":"Again and again i just can't understand why we sometimes underrated some movies, and sometimes overrated others!!! this move as i seen -humbly- so simple, quiet, small budget, but so touchy, and as in Breaking Bad series, Aaron paul give us entertaining performance, besides the kid Dany Murphy, with flowless, quiet soundtrack. Simple movie, but convenance. simple movie but so convincing in performance, directing, soundtrack, scenario and the story.","user":"riffat-87805","rank":[30,37]},{"title":"Very Poignant","rating":9,"date":"27 October 2019","review":"As someone said, it is VERY slow moving. But it's such a good story that it is a MUST SEE! The boy hardly speaks during the film, yet he conveys such emotion with his expressions. Deaf in real life, young Danny Murphy needs the help of his parents and teachers. Then he bonds with a fugitive who needs HIM for food, medical care, and his trust. The way the criminal gets him to stand up to a school bully is priceless. The boy hardly gets along with his distant father, yet develops a deep feeling of love for the violent man on the run. The ending might make you cry, as I did. Highly recommended for movie fans who aren't expecting a lot of action.","user":"jdavid55","rank":[17,20]}]