[{"title":"A bland retelling of a powerful novel","rating":4,"date":"25 July 2016","review":"One of the most acclaimed graphic novels of all time has now come to the big screen. Not only is this one of the most acclaimed novels ever but it's one of the most controversial. The story is basically an origin tale for the infamous Batman villain, The Joker. When this movie was initially announced back at the beginning of 2016 there was some serious hype surrounding it. Especially when it received an R rating. One thing that really made me nervous though was how quickly this actually released. Obviously, it could've been in production long before it was announced back at the beginning of the year, but after seeing the film, I don't think that's the case.<br><br>The first thirty minutes of the film is a kind of prelude involving, mostly, Batgirl. It talks about how she came to quit being said superhero and draws a thread between her and Batman. Now, this story is controversial for a reason. Not only does it explore tough themes but it shows the details of these horrible things. The story in the graphic novel is brutal, uncompromising, and pretty tough to get through.<br><br>However the film is just the opposite. It tries hard to retell the story seen in the novel, yet any emotional drama is all but lost. This mainly has to do with the length of the film itself. Being only 80 minutes, it's rather short. As I said, the first thirty minutes revolves around Batgirl. And this segment of time is absolutely the worst to sit through. It's tedious, overly long, and so cliché and predictable that there's nothing remotely enjoyable.<br><br>While, this part of the film is undoubtedly the worst from a storytelling standpoint, there are a number of things that remained consistently bad throughout. Most notably was the animation. From a studio like Warner Bros you'd expect some decent art work, but not here. The back drops nor art design is well put together. It's clunky, with no style to be found.<br><br>It looks like they took the animation from a rough draft of the animated series and colored it in. This issue becomes even more clear whenever it attempts 3D animation. The other blaring issue that continues through the film is the music. Which is completely contrived and formulated to the point of it being so cliché that is, in fact not cliché.<br><br>As the film ended, a crowd that once cheered for the lights dimming, was left in stunned silence. Not a good stunned silence like you get after watching 'Gone Girl', this type of silence is the kind where people don't know what they just saw. For me, this had to do with the complete lack of any emotional resonance. When it attempts to recreate the power of the novel it fails. <br><br>It doesn't commit enough to the drama of the story. Even with its R rating it doesn't draw the same toughness the novel does. It lacks the rawness that the novel has to make it's audience queasy. It's not graphic enough to be disturbing and it's not lighthearted enough to be fun. It just bounces from scene to scene with little connecting one to another. The best way to describe it is that it goes from this scene to that scene and than it ends. That's about it. ​This is one film that should have been great. All the pieces are there. It has a great studio behind it, an excellent voice team, and a brilliant story. But it lacks the emotional power that the novel has. Even though it has its R rating it doesn't fully commit to it, or anything for that matter. Without coherent direction and the overall first draft vibe of the film it's hardly the experience we've been lead to believe it is.","user":"Rendanlovell","rank":[99,128]},{"title":"Guiltily Laughing...","rating":10,"date":"28 July 2016","review":"Much of the controversy around this movie surrounds the first half, so I am going to concentrate on that portion. People in the theatre I went to said they would have loved The Killing Joke, if not for the first half. I argue that the second half would not make any sense without the first. As perhaps one of the most famous hero and villain duos in all of fiction, it is easy to see Batman and the Joker as diametrically opposed in their approach to crime. I believe the first portion of the film serves to demonstrate some of these differences, especially Batman's tendency to control everyone/everything around him (as opposed to Joker's outright nihilism), and stands them on their heads. We start to see Batman as imperfect, and perhaps not so different from any Gotham resident.<br><br>This imperfection serves to develop some of the sympathy we feel towards the Joker and his ultimate goal regarding his confrontation with Batman, regardless of his twisted techniques. Evidence of this comes with some of the Joker's quips, which come with a visceral laugh despite their macabre nature.<br><br>The only area for potential complaint comes with the animation in certain scenes, though I'm not sure this was unintentional due to rushing for completion or due to intentionally demonstrating something quite \"off\" about the whole situation at hand.<br><br>4 out of 4 stars.","user":"tjsdomer2","rank":[20,27]},{"title":"They wasted good material and awesome actors...on this?","rating":3,"date":"28 March 2017","review":"I was a fan of the graphic novel, so I will admit that already set a high bar to please me. I would never have considered watching it but for the voice talents of Hamill and Conroy. <br><br>So I got comfortable and watched, hoping to be 'disturbed.' I was...but not in the manner which I had been expecting. It was FLAT. Like a soda you enjoy left open in a warm room allowed to lose every bubble of carbonation as well as achieve a temperature of lukewarm tepid. My mind wished I could somehow spit it out now. But no... It is there now. Any fond memories of the graphic novel...gone. Replaced with this.<br><br>Keeping this \"spoiler free\" was extraordinarily easy as it is already a spoiled mire of good talent and incredible source material wasted.","user":"kronoase","rank":[19,26]}]