[{"title":"Ancient stuff of the last generation","rating":4,"date":"3 December 2015","review":"Halo has been a flagship title for Xbox consoles for more than a decade, it has spawned numerous titles and spin-offs, but apparently animation movie is not a priority. The CGI is incredibly stiff and design is equally lackluster, there is barely any shred of production value of the game here. This will no doubt disappoint the fans while probably won't attract any casual movie viewers.<br><br>It tells the story of John / Master Chief, the main protagonist as he goes through his training and childhood. He is not the easiest character to transition to cinema as he's a silent protagonist on the game. The animation delivers his story by narrations from other characters, while Joh himself is pretty one dimensional. His interactions are mostly military oriented, leaving little room to expand.<br><br>To make matter worse, it utilizes the same formulaic sequences like those in Universal Soldier films. Also, characters' facial expressions are extremely bland. Animation can barely produce any quality equivalent to today's game cutscenes. It's just plain rigid motion and uninteresting setting for one hour, and that short runtime will not amount much in term of narrative anyway.<br><br>The low quality visual will most likely upset gamers, and it's certainly not the introduction story Halo would like to represent the franchise on animation genre.","user":"quincytheodore","rank":[32,42]},{"title":"Missing the heart of the book it was based on","rating":4,"date":"12 February 2017","review":"I have read the Halo: The Fall of Reach book a few times and was actually reading it around the time I saw this movie. <br><br>Basically the movie follows the outline of book fairly well, but...<br><br>Somehow they managed remove the parts of the book that made it so good.<br><br>In the movie: John is kind of a dick, there isn't really any relationship between John and Chief Mendez (John is supposed to really look up to him and respect him), Captain Keyes is kind of a dick, the relationship between John and his fellow spartans is hollow. Everybody felt very 1-Dimensional. I think these problems are because of the lack of detail in the movie and the bland animation, the sometimes very off-key voice acting. <br><br>Honestly, if the people who made this movie would have just payed attention to why the characters in the book were so good and why the relationships were compelling we might have gotten something much better. That's too bad.<br><br>The book has great potential for a movie, but it was wasted with this attempt. <br><br>If you want some quick general backstory on Halo, watch this. If you want entertainment and a compelling story with compelling characters - read the book.","user":"matthewprevallet","rank":[7,8]},{"title":"Terrible, horrible. F.","rating":2,"date":"3 March 2016","review":"First off, let me start off by saying that I've read the book, off of which this movie is supposedly based, cover to cover, multiple times over. If you're a fan of the book, you're going to be very disappointed.<br><br>This movie is deplorably bad. The voice acting is absolutely terrible. Dr. Halsey is voiced by the same voice actress who voiced Cortana, which is appropriate based on the books. In addition, the voice actor who voiced the chief - Steve Downes - has a few lines. This is where the good stuff ends. The rest of the voice acting is absolutely terrible. Sometimes their tone is off, sometimes the children sound like they're shouting - for literally no reason at all. You truly never realize the importance of talented voices in an animated film until you don't have them.<br><br>Moving on, the writing is terrible, too. Heath Corson, a screenwriter with nothing to his name besides a web series, a couple shorts, and a handful of superhero cartoons, bears the blame for this monstrosity. Anything of value from the book has been stripped away from the script, including its namesake - the fall of Reach. That's right, the climactic end of the book is nowhere to be found. The dialog from the book - which was powerful in its own right - is practically nonexistent. The parts of the story which do exist are only partially correct, seemingly re-imagined for brevity instead of drama. Kellogg's should sue this guy, because the dialog in this movie makes them all sound like Fruit Loops.<br><br>But maybe bad writing and poor voice acting could be saved by good cinematography. That is, if there were any. The space combat, all three minutes of it that exist, is the diamond in this proverbial pile of dung. The 3D animation in this movie could've been great if they'd used any of the technology created in the last two decades. Instead, we get stiff, poorly animated characters who rival marionettes controlled by a triple amputee. Their mouth movements have zero effect on their face, their body movements are glitchy and copy-pasted to the little chief and all his companions. The camera angles are atrocious. The action is sloppy and mundane. There's zero tension in any scene throughout the entire movie. Nothing looks natural. It's visual heresy.<br><br>The worst part of this movie is that they had the audacity to say \"based on a book by Eric Nylund\", because that's an outright lie. If you paid a cent to watch this, you should be furious. I had the opportunity to watch it free of charge, and I still feel ripped off. Your move, 343.","user":"rjhall-291-668108","rank":[14,19]}]