[{"title":"Awesome concept","rating":7,"date":"19 September 2019","review":"Tugs at the heart strings that's for sure. Beautiful animals and the characters were well played.","user":"sarah_kay2007","rank":[5,5]},{"title":"A Must Watch, Mainly for Animal Lovers","rating":10,"date":"21 January 2019","review":"It's such a pity this film isn't more popular! The pace of the narrative is great. It is engaging from the first minute. It's also evident to see how long they've taken to film it, as the boys grow along with the lion - about three years. While it focuses on the relationship between Mia and this wonderful lion, it also deals with family ties, connection with nature and the hard way in which these animal farms have to survive. Super recommended!","user":"anablue-28948","rank":[30,44]},{"title":"a very important message to share about tourism and hunting.","rating":8,"date":"1 May 2019","review":"REVIEW - MIA AND THE WHITE LION<br><br>Occasionally while watching all of the films I find a gem, a film that stands out and as an impartial independent reviewer I can write without influence.<br><br>This is one such film, whilst the acting could be better and the editing is terrible the subject matter and of course the white lion truly make this a film too watch.<br><br>Simple story but what I absolutely loved about this film is the time it took to make, it must have been filmed over a period of about 4 years because you literally see the same lion grow from a lion cub to maturity and the children grow also!<br><br>Of course the actual white lion steals every scene Charlie is in and the actors were in my personal opinion very very fortunate to have the opportunity to work with such a beautiful creature.<br><br>Easy to follow but with a very important message to share about tourism and hunting.<br><br>One to watch but as I've said acting isn't the best and the editing is terrible but on this occasion I can forgive.<br><br>Rating 8 out of 10","user":"markthomassintek","rank":[14,19]}]