[{"title":"What you fear the most is what you manifest","rating":4,"date":"7 October 2018","review":"This film was written, directed and starred Mario Van Peebles and family. 10 years after an operation that went bad, Chief (Mario Van Peebles) is contacted by members of his crew who are all heavily armed and spout conspiracy theories about being exposed to a biohazard that makes them all goofy. Chief decides to help them, investigating the man who worked with him and is going to marry his ex-wife (girlfriend?) in India. Oh yea, someone kidnapped a Catholic school girl. <br><br>The film was all over the place by design. I will admit Peebles writes some clever dialogue, especially in the barber shop scene. However, his seemingly anti-gun message was confused when a good guy with a gun stops a bad guy with a gun. Otherwise, the film is very pro-gun control and anti-Trump. I would recommend MVP get some help developing a plot. <br><br>Guide: F-word. near rape, FF nudity (Shakira Barrera, +others)","user":"nogodnomasters","rank":[6,6]},{"title":"Stop Making Movies Mario Van Peebles...","rating":1,"date":"22 December 2018","review":"This man made the most dumbest &amp; insane movie on the planet... A very bad low budget film... The only movie I liked from him was \"We The Party\", but this movie wasn't exciting to watch... Dont waste your time watching this movie &amp; most scenes will be too stupid to watch!","user":"darnellrice","rank":[5,5]},{"title":"I really really wanted to like this movie...","rating":5,"date":"29 September 2018","review":"I really really wanted to like this movie... I didn't hate it, but I didn't like it enough either. I feel there was a concept here that could have provided a great story, but I got lost in the plot and character build-up. Mario Van Peoples should have brought in help when writing this movie translate it properly to big screen.<br><br>(Spoiler Alert) I love the idea of hallucination and a 6th sense kind of feel and plot, but there were too many symbolism's and lost translations that hurt this movie at times where it should have helped. The quasi romance between the main character and the girl half his age came off as creepy more than romantic and friendship with his imaginary friend was too over the top. I mean who scales a billboard and plants explosives to successfully; and does so to make a point to his old colleague.<br><br>To many roach visions which also took away from the film, it added zero value.<br><br>Good try, but next time get a little more basic in your movies Mario.","user":"desmondsmith-252-66701","rank":[4,4]}]