[{"title":"Worst. Movie. Ever.","rating":1,"date":"12 June 2016","review":"I have seriously, never in my entire life, seen something on screen that was this painful to watch (including Jackass and Klovn). <br><br>Poorly written, poorly executed, unenthusiastic acting from otherwise talented people. Just awful. I feel hurt and betrayed. I want my money back. And my time (finally out of the house, with my fiancé. Great date. NAHT.) From the outrageously racist jokes, the fat jokes, the stereotypical comic reliefs, the utterly pointless scenes and unbelievably unrealistic characters - Just the worst. <br><br>I expected a pointless, turn-off-your-brain low quality romcom but never did I imagine it being SO BAD. To a few of my favorites acting in this film: Please - PLEASE - have more ambition in the future.","user":"lenamaradottir","rank":[66,103]},{"title":"Disappointed","rating":3,"date":"1 September 2016","review":"I'm really disappointed with this movie. Scenario had only couple funny sentences, and that's it, and I assume this should be a comedy. If you expecting romantic movie you will be disappointed, because the only thing we see there is some people with some inessential problems, and making big thing out of it. Slow development of story, although is unpredictable because you can't expect that someone will devote such attention on not important details. The only bright thing in this movie is cast, which is making me confused why did they do this especially Sudeikis. It's cast with big experience i just don't understand need for this.","user":"mr_miyagii","rank":[25,36]},{"title":"to call it average would be over-selling","rating":4,"date":"3 June 2016","review":"don't get me wrong, i GET the movie is supposed to be a light, popcorn movie..your average clichéd chickflick...and i love them....somedays you just want a silly corny cheesy movie to put a smile on your face...<br><br>the problems is that it fails at even that...it is not a romantic comedy...it does not explore the parents-kid relationship beyond the whole \"oh im a man i cant say tampon\" cliché...it is not about friendship....i mean what was the point of even making this movie...<br><br>i love interconnected romcom movies...but this is just ..pointless...i have no other words to describe it..<br><br>and the only thing that was more horrible than julia roberts wig was the direction.","user":"dilpreet-558-519088","rank":[37,58]}]