[{"title":"The Darkest Black Comedy I've Ever Seen","rating":9,"date":"23 October 2016","review":"\"Middle Man\" is about the character of Lenny, a recently unemployed man whose mother just died and now decides to chase the \"American Dream\" by going to Las Vegas so he can be a comedian. The film stars Jim O'Heir, Josh McDermitt, Andrew J. West, Anne Dudek, and Tracey Walter, and is directed by Ned Crowley. I saw this film at the 52nd International Film Festival this year, and is hands down my favorite film from the festival.<br><br>Jim O'Heir plays Lenny, an awkward but sweet man who seems to be stuck in the past. He still listens to 50's comedy sitcoms on his cassette player and memorizes them line for line, he drives his old '53, and always does what his Christian mother told him. O'Heir was hysterical as this man stuck in the middle of a crazy situation. Josh McDermitt plays the character of T-Bird, the biggest A hole who's the comedic sensation at the \"Yuck Stop\", it was a very cool contrast from his character in The Walking Dead. Andrew J. West (also played Garrett on The Walking Dead) plays the cool, confident, and mysterious Hitch, who tags along as Lenny's \"manager\" and is also a psycho killer who burns up easily in the sun. West was just as up to par with O'Heir, and the complete contrasts of their characters really brought a unique character duo.<br><br>\"Middle Man\" does not pull its punches, the film keeps on bringing the comedy and every joke that was made in the film was always answered by a laugh from the audience. The film has such a sick sense of humor which I love. I've never laughed so hard at a man getting his head blown off or a man disposing of a dead body. Now despite this film being laugh out loud funny, it is extremely dark, especially during the last 30 minutes of the film. The film is like a cross between Martin Scorsese's \"King of Comedy\" (1982) and David Lynch's \"Blue Velvet\" (1986).<br><br>After the screening of the film director Ned Crowley and Jim O'Heir came to the front and had a very cool Q&amp;A, and I got to meet and take a picture with O'Heir as well which was super cool. \"Middle Man\" is a very original and balls out film that never takes itself seriously and delivers one hell of a black comedy.","user":"horitaj","rank":[29,42]},{"title":"Superb film","rating":9,"date":"22 October 2017","review":"A great film. Script is terrific. Acting is lovely. Hilarious at times. Some really memorable scenes. The IMDb rating is a real insult...but then again, look at some of the Hollywood Formula garbage that gets high ratings. Point: ignore the ridiculously low rating. This is a gem of a movie; do not miss it.","user":"kjr032","rank":[10,13]},{"title":"Low Budget But Powerful","rating":8,"date":"11 June 2017","review":"If you get just as sick and tired of big budget Hollywood hit-n-misses as I do you're going to love this one.<br><br>'MiddleMan' packs the biggest punch on a shoe-string budget you could ever hope for.<br><br>Jim O'Heir portrays Lenny, a borderline mentally ill butterfaced nobody who's infected with some naïve dream of becoming a stand-up comic, and he gets his wish unexpectedly through murder and mayhem.<br><br>I was surprised how long the story went on and how nuanced it was. While the characters start out as a cheap joke, they turn into something very real half way out and to the end.<br><br>For some reason I was reminded of some other grade B Classic flicks like 'Eating Raoul' from 1982.<br><br>An astonishing accomplishment that will be unfortunately forgotten in no time.<br><br>This film, at least, will stick in my mind for a very long time.<br><br>Loved it.","user":"rioplaydrum","rank":[10,14]}]