[{"title":"The Devil really is in the Details","rating":8,"date":"29 April 2017","review":"This writer has always felt that the job of a reviewer was not merely to whine and prattle about what does (or does not) happen on screen, but rather to try to introduce the film to the discerning viewer in a way which assists the decision as to whether to see it ... or not? It is projects like Dark Song, however, that make such a simple ambition seem ever so complex.<br><br>For starters, I will suggest that the best (and most recent) analog I can name is the excellent 2016 Autopsy of Jane Doe. Both films are clearly of the horror genre, both films work their magic by confining two strong personalities (and superb actors) in a confined space, and both films follow the Prime Directive of possibly every horror film ever made, namely \"whatever can go wrong will go wrong.\" <br><br>But that's where the similarities end. Autopsy of Jane Doe is merely a solid and workmanlike exposition of a clever, entertaining, theme. Dark Song is simultaneously the debut of a writer/director with a distinct, clear and uncommon \"voice\"; and, at the same time, a horror tale so intricately involved with the minutiae, the moment-to-moment, of true ritual magic (is there any other kind?) that at times you almost, just for a split second, wonder if you are watching a reality show instead of a fictional drama? <br><br>No small feat, that. Especially from a country that can lay legitimate claim to having produced one of the only genuine, verified, ritual occultists in western history (Aleister Crowley). To watch a film like this aware that there are individuals who literally dedicate their lives to such practices takes the viewer to new levels of awareness ... and terror.<br><br>The end result is something about as distant from the dozens of currently popular \"found footage\" films ... as the earth is from the moon.<br><br>Plainly put, to appreciate this film, to drink in and savour every nuance, the viewer himself (or herself) must be willing to commit to the movie to the same extent that the central characters commit to the core ritual.<br><br>That is to say, lock yourself in, don't leave your seat, and, whatever happens, do not break the circle of salt.<br><br>If you do all that, you may not get to meet an \"angel\" willing to grant your special boon, but you will get a film experience you will likely never forget.","user":"A_Different_Drummer","rank":[241,302]},{"title":"Subtle and powerful","rating":10,"date":"23 August 2017","review":"It makes such a change to get a supernatural movie that makes the viewer use their imagination, rather than bombarding them with CGI and men in rubber suits. This is a study of the old chestnut, 'Be careful what you wish for'. A young mother whose son had been murdered, seeks revenge on his killers via a magic ritual invoking angels. It's clearly influenced by the \"Bornless Ritual\", an invocation used by Aleister Crowley to summon his Holy Guardian Angel and the Sacred Magic of Abramelin the Mage which Crowley attempted at Boleskin House on the shores of Loch Ness. The ritual allegedly requires at least 6 months of preparation, celibacy and abstinence from alcohol. However, it also includes the summoning of the 12 Kings and Dukes of Hell, to bind them and remove their negative influences from the magician's life. Crowley was in the process of performing the lengthy ritual, when he was called to Paris by the leader of the Golden Dawn. According legend,he never banished the demons he had summoned, leading to strange happenings occurring in and around Boleskine House. But I digress.<br><br>There have been reviews that bang on about how slow this movie is, and it's lack of pace and excitement. But if you have any understanding of the supernatural, and this movie has been meticulously researched, you'd realise that the real horror lies in fear and what happens in your head. This woman, who so craves revenge, is on her own personal spiritual journey. She realises, at the 11th hour, that revenge and hatred offer nothing but pain and emptiness, and that forgiveness, both for her son's killers and herself, is what she really needs to find any peace.<br><br>I liked the dynamic between the woman and occultist, the loathing and disrespect, the sharing and mutual need. There's one really funny moment where they both share their recurring dreams.<br><br>The film is subtle in its suspense and horror, with a nice slow build and some really creepy effects. The ending seems a bit clichéd, but was saved from being corny by illustrating the power of forgiveness over revenge, and good over evil. On the whole, one of the better horror/supernatural movies of 2017 so far. I loved it.","user":"MikeWright75","rank":[79,98]},{"title":"Intriguing slow-burn film, didn't love the ending","rating":6,"date":"4 May 2017","review":"As other reviewers have noted, if you're looking for an \"Insanitarium\"-style splatter-fest then this film is not for you. The first hour of \"Dark Song\" is a mysterious, deliberately-paced psychological thriller with two interesting characters stuck together in a house for months, feeling each other out. An occultist (Joseph) is trying to help a woman (Sophia) contact her dead son. This requires dark rituals, fasting episodes, and sleep deprivation. Their motivations and honesty are both in question, leading to plenty of dramatic tension. What's real, in terms of both past and present? Who's lying to whom? The film takes its time exploring these questions, and for the first hour at least, the viewer's patience is well-rewarded. I especially liked Steve Oram's occultist character, who doesn't fit the classic mold of \"actor\" or \"hero\" one bit, and is all the more fascinating for it. I won't go into deeper detail for spoiler reasons, but suffice to say that both characters fall into the logical traps of mistrust, manipulation, and frustration after being cooped up for so long.<br><br>My problem with \"Dark Song\" was its ending. It made sense from a dramatic standpoint, and of course there were several directions it could have taken. The fact that I wasn't satisfied doesn't mean you won't be. But along the way I had some really freaky ideas that I hoped would be explored, and they weren't.<br><br>In any case, I still recommend \"Dark Song\" as a mature, well-made, and disturbing psychological thriller.","user":"medelste","rank":[70,93]}]