[{"title":"Punches all my buttons: segregation, space, engineering, computers","rating":9,"date":"7 January 2017","review":"I'm an engineer. I designed computers, I grew up in the south during the 1950s and 1960s. I was heavily involved in the space race at an early age and watched every launch and recovery on black-and-white TV. I never saw separate restrooms and drinking fountains for \"colored\" but they were there. I never rode on segregated public buses, but they were there and I knew it. This movie, \"Hidden Figures,\" brings all of these worlds back to me. No, it's not a painstakingly accurate picture. NASA didn't have flat-panel screens back then. Communications between the ground and the Mercury capsules were not static-free. But a lot of this movie feels real. Very real.<br><br>The protagonists in this movie are three women of color working in one of the most unwelcoming environments they might hope to find: NASA Langley, Virginia, in 1961. As women, they were employed as human \"computers\" because they were less expensive and they got their numbers right. As \"colored\" folk, they got their own separate (and sparse) restrooms and their own, separate dining facilities. This was not America's shining hour, even in some place as lofty as NASA.<br><br>At the same time, civil unrest was rising in the towns. This is the time of Martin Luther King's rise to prominence. It's a time just before the rise of militant civil rights groups. It's a time when resistance to segregation and discrimination was still civil, but as the movie shows, that resistance was beginning to firm up and become widespread.<br><br>There are several reasons to see this movie: from a civil rights perspective; from a feminism perspective; from the perspective of the early space race when we lagged the Soviet Union, badly. If you lived during this time, see the movie to remember. If you were born later, see this movie to see what things were like.","user":"steven-leibson","rank":[470,618]},{"title":"Good movie but, sadly, Hollywood must tinker with facts","rating":8,"date":"23 January 2017","review":"I really enjoyed watching Hidden Figures. The story was compelling and laid out neatly for our viewing pleasure. It shone a spotlight on a part of history with which I wasn't familiar. And, most importantly, it made me want to learn more about Katherine Goble Johnson, Mary Jackson, and Dorothy Vaughan. What a shame the screenwriters felt they had to preach at me about racism rather than just tell the true story of these amazing and talented women. They weren't amazing and talented \"in spite\" of being black or \"in spite\" of being women, they were just amazing and talented in their own right. One day, perhaps, Hollywood will get a clue and give audiences credit for having a brain.<br><br>Much of the atmosphere of racism in the movie did not ring true for me. In many cases it didn't even make sense, so I looked into it. The first question I had for the internet was \"Did Katherine Goble have to run half a mile to use a bathroom on the NASA complex?\" The answer is no. For more info on the conditions and life of Katherine Johnson check out the interview with her here: https://youtu.be/r8gJqKyIGhE. In particular check out 11:49 where she says she \"didn't feel segregation\". Everyone was working. The job was important and they weren't going to jeopardize the mission with foolish racist antics. She was part of a team. I would've liked to have heard so much more about Katherine and her mind and work, less about the social issues of the 1960s! <br><br>I understand screenwriters have to condense a large amount of information into a couple of hours but the ham-handed and, let's be honest, false representation of racism at NASA and the treatment of these women was a repeated and unwelcome intrusion into what should have been a very interesting and educational movie about such remarkable women. For example: I strongly suspect Katherine Goble never, ever would have been so unprofessional as to scream at her boss and co-workers like she does in what Hollywood probably sees as a \"cathartic\" scene. It was completely out of character and a distraction from what should have been the real story, that of Katherine's accomplishments. Goble was a conscientious and intelligent woman who would've never done such a thing which, to my way of thinking, says a lot more about her than this silly, manufactured scene. <br><br>But I don't want to run the risk of being just as ham-handed in my review and I'll leave my criticism at that. I'll only add, don't let the prospect of being bludgeoned by an anti-racism message keep you from going to see Hidden Figures.","user":"maricam","rank":[188,272]},{"title":"I first gave it a 9 then almost gave it a 4 but have settled on 7","rating":7,"date":"17 February 2017","review":"First I would like to say that I thought this was a tremendous movie. It is well written, acted, directed, and the story is amazingly compelling. Then I read a bit about the true story of these amazing women. There were such great liberties taken with their stories that I was a bit appalled. While it did a great job making us feel just how amazing these women were it failed to show the role NASA played correctly. I will simply paste the wiki of the reality of the mindset of NASA as well as the real story, in a super condensed way. Science is anti-stupidity and racism is stupid. I wish that NASA and science had been presented in a bit better light. Paste starts here:<br><br>The film, set at NASA in 1961, depicts segregated facilities such as the West Area Computing unit, an all-black group of female mathematicians, who were originally required to use separate dining and bathroom facilities. However, in reality, Dorothy Vaughan was promoted to supervisor of West Computing in 1949, becoming the first black supervisor at the NACA and one of the few female supervisors. In 1958, when the NACA made the transition to NASA, segregated facilities, including the West Computing office, were abolished. Dorothy Vaughan and many of the former West Computers transferred to the new Analysis and Computation Division (ACD), a racially and gender-integrated group.<br><br>Mary Jackson completed her engineering courses and earned a promotion to engineer in 1958, becoming NASA's first black female engineer. Katherine Johnson was assigned to the Flight Research Division in 1953, a move that soon became permanent. When the Space Task Group was formed in 1958, engineers from the Flight Research Division formed the core of the Group and Katherine moved along with them. She coauthored a research report in 1960, the first time a woman in the Flight Research Division had received credit as an author of a research report. <br><br>The Space Task Group was led by Robert Gilruth, not Al Harrison, who was created to simplify a more complex management structure. Vivian Mitchell and Paul Stafford are composites of several team members reflecting common social views and attitudes of the time. Karl Zielinski is based on Mary Jackson's mentor Kazimierz \"Kaz\" Czarnecki. John Glenn, who was much older than depicted at the time of launch, did ask specifically for Johnson to verify the IBM calculations, although she had several days before the launch date to complete the process.","user":"sam21462","rank":[56,76]}]