[{"title":"A journey to nowhere","rating":3,"date":"3 June 2019","review":"Watching 'High Life' was like traipsing through a post-modern art exhibit. You know the type of thing. Long black corridors lit with neon strip lights, illuminating grainy images of naked people masturbating with fruit. The kind of art that illicits raised eyebrows, wrinkled noses and puzzled tilts of the head before you shuffle off to the next monstrosity.<br><br>I'm a sucker for cool visuals, and the unusual premise about death row inmates who agree to take part in a space mission in exchange for their lives had, I thought, potential. Unfortunately there was precious little else to absorb from the full 110 minutes that we don't already see in the 2 minute trailer.<br><br>Aside from some haunting, austere visuals and a tense, oppressive atmosphere, there is absolutely nothing to engage with. The plot is little more than a loose thread from which the director hangs a series of vague and 'provocative' brain farts about human sexual impulse, violence and reproduction. The catalytic character in all of this is Juliette Binoche's Dibs, an over-sexed scientist who seems bafflingly preoccupied with harvesting the semen of the male crew members and inseminating one of the younger females to achieve a perfect viable fetus. Why, is never clear. We don't know if this was a mission given to her by the space program, or a twisted personal obsession. It does, however, set up some bizarre, grotesque set pieces involving sleep rape and a turkey baster.<br><br>Another conceit in all of this nonsense, is that none of the crew are permitted to have sex with one another and must instead relieve their frustrations in a specialized masturbation chamber, introduced with an indulgent scene of Dibs riding a mechanical dildo while ominous synth chords rumble in the background. It feels so incongruous and artificial that it becomes impossible to take any of it seriously and whatever subtext or ideas Claire Denis was attempting to provoke were lost on me.<br><br>The editing doesn't aid comprehension. Events are revealed in fragments, hopping fitfully between past and present with no clear visual cues to signal change of time.<br><br>All the characters aboard the doomed vessel, with the exception of a sweet cuddly baby, are soulless robots with no likable traits and no real arc.\nThe dialogue is sparse and weirdly obtuse. Binoche sometimes sounds like she doesn't quite understand the words that are coming out of her mouth. In one scene she casually boasts about her crime to the other inmates, in another she's crying about it. It makes no sense.<br><br>There is no structure, no climax, no resolution, just a vain concept that goes nowhere.","user":"Deathstryke","rank":[188,240]},{"title":"No fun at all","rating":2,"date":"9 April 2019","review":"I see a lot of movies. Way too many movies. So I've obviously seen some horrible stuff. This isn't the worst, but it's pretty close.<br><br>There's no rhyme or reason to the entire movie. The lead (Pattinson's Monte) is an unlikeable character that lacks credibility as an actual person that could exist anywhere. His redeeming trait is that he doesn't want anything from anyone. He mostly mutters to the audience and punches other characters in the face when he's not caring for a baby.<br><br>The lead antagonist is an even more convoluted character. She's a criminal? scientist? Sex freak? In charge of the mission? She collects sperm and is for some never explained reason trying to make a radiation proof baby. I think they tried to make her sexy, but it just comes off as disgusting.<br><br>If you're looking for a super slow flick with a wailing baby and a muddled story line with no payoff at the end, then you should give the High Life a watch. Otherwise, you're better off drinking a High Life and playing on your phone.","user":"ghykal-343-903350","rank":[299,426]},{"title":"Esoteric and poetic, but very singular; certainly not for everyone","rating":7,"date":"30 May 2019","review":"A science fiction thriller from <a href=\"/name/nm0219136/\">Claire Denis</a>? The uncompromising darling of French art house cinema, adored by critics and met with general puzzlement by audiences? And it's in English? And it stars the guy from <a href=\"/title/tt1099212/\">Twilight (2008)</a>? You have to be making this up.<br><br>Not at all. However, as intriguing as that may sound, it's a deceptive overview. Yes, it is Denis's first English-language film, and yes, it is set in space, but it's a science fiction film in name only, and has more in common with <a href=\"/title/tt0062622/\">2001: A Space Odyssey (1968)</a> and <a href=\"/title/tt0069293/\">Solyaris (1972)</a> than with anything in the Star Trek or Star Wars franchises. And just for the record, the guy from Twilight has developed one of the most eclectic recent CVs of any actor in Hollywood. The long and short of it is that Denis has not sold out, and High Life is as multiplex-friendly as anything in her oeuvre (which is to say, not in the slightest), covering several of her more familiar themes - the darker aspects of desire; the notion of being an outcast; parenthood; the inescapability of death; the beauty of the human body; the relationship between violence and sexuality. The presence of <a href=\"/name/nm1500155/\">Robert Pattinson</a> will probably draw in a lot of unsuspecting folks, who will have no idea what to make of Denis's slowly paced existential musings, resulting in a slew of \"worst film ever\" reviews. But although it's not Denis's best (that remains either <a href=\"/title/tt0209933/\">Beau travail (1999)</a> or <a href=\"/title/tt2821088/\">Les salauds (2013)</a>), it's a fascinatingly poetic and original film that is utterly uncategorisable - a space thriller about a mission collapsing in on itself; an ecological allegory positing that we don't have a huge amount of time left to save the planet; an analysis of the psychological ramifications of long-term incarceration; an erotic skin flick obsessed with bodily fluids; a metaphor for the perils of imperialism; a fable on the subject of paternity; a story about loneliness and grief; a literalisation of the premise that no amount of evolution, philosophy, or esotericism can ever change the fact that we're biological organisms controlled by our sexual yearnings and impulse to procreate - desire will always trump the social contract; we can place as much artificial limitation on our carnality as we want, but ultimately, desire will betray us.<br><br>Like I say, very multiplex-friendly.<br><br>Deep space. On an unnamed ship marked only with the number #7, Monte (Pattinson) lives alone with his baby daughter Willow (<a href=\"/name/nm9770529/\">Scarlett Lindsey</a>). However, this wasn't always the case, and as the film begins, Monte is releasing the bodies of his deceased crewmates into the void of space. How this situation came to pass is revealed via an achronological flashback narrative structure. A group of death row were offered a pardon if they undertook a mission to investigate the viability of the \"Penrose Process\" - a theory developed by Sir Roger Penrose whereby energy could be extracted from the area close to a black hole. However, the groups' de facto leader, Dr. Dibs (an ethereal <a href=\"/name/nm0000300/\">Juliette Binoche</a> oozing uninhibited sexuality from every pore), a criminal herself, is using the journey to conduct biological experiments on the crew; harvesting the men's semen and attempting to artificially inseminate the women. Monte, however, refuses to comply, arguing that his chastity gives him strength. His obstinacy fascinates Dibs, who determines to get a sample from him by any means necessary.<br><br>High Life, written in French by Denis and her regular writing partner <a href=\"/name/nm0267288/\">Jean-Pol Fargeau</a> in 2013 and translated into English by <a href=\"/name/nm3563262/\">Geoff Cox</a>, begins with pseudo-Edenic shots of lush vegetation, before slowly revealing we're seeing a garden on a spaceship, surrounded by and subservient to technology. We then hear a baby crying. This opening, mixing vegetation, technology, and biology, signals both the film's tone and demonstrates the economy of Denis's visual language, telling us much of what we need to know about the upcoming film. Denis and director of photography <a href=\"/name/nm0494617/\">Yorick Le Saux</a> employ similarly precise storytelling tools in shooting everything on the spaceship on HD video, whereas the few scenes on Earth are shot on 16mm - this gives the space scenes a sleek polished sheen, whilst the Earth material looks grainy and gritty, more lived in, setting up an instant visual contrast.<br><br>I'd also be remiss whilst discussing the film's aesthetics, if I didn't mention the very energetic masturbation scene with Dibs. On #7, all sexual activity between the crew is prohibited, although they are free to use \"The Box\", a room designed to facilitate masturbation, which all but Monte visit on a daily basis. In one particular scene, Binoche commits herself entirely to Dibs's masturbatory excess, making full use of the ceiling mounted stirrups and the metal dildo in the middle of the room. The scene is beautifully shot, bathed in a glorious blue light that softens everything it touches, whilst Le Saux shoots Dibs entirely from behind, focusing on the contraction and expanding of the muscles in her back, as if a figure from a Sandro Botticelli painting has wandered into a room designed by <a href=\"/name/nm0317592/\">H.R. Giger</a>. Furthermore, the scene is edited by <a href=\"/name/nm0496327/\">Guy Lecorne</a> with the use of fades rather than hard cuts, giving a sense of contemplative peace which contrasts with the energies of the character. And never has the human back looked so sensual and magnificent!<br><br>Thematically, rather unexpectedly, the film has a lot in common with <a href=\"/title/tt6053438/\">First Reformed (2017)</a> ; both deal with the looming end of existence; both examine the possibility of finding hope amidst the oncoming cataclysm; both see the human race as essentially not worth saving; both focus on a spiritual character facing a crisis of faith - in First Reformed, that crisis concerns Fr. Toller's Catholicism, whereas in High Life it's Monte's belief in the importance of self-discipline and chastity.<br><br>Of course, on a more prosaic level, the film is obsessed with sexuality. Fluids are a recurring motif throughout, whether the blood that several characters shed, the sperm with which Dibs is obsessed, the oil that keeps the ship's systems running, the water that nourishes the garden and that keep the crew alive. Speaking of fluid, perhaps the film's most haunting image is a shot of one character lactating; her body producing nourishment for a baby she can't feed, as Dibs has taken it from her, the milk running down her body going to waste. Interestingly enough, at the film's world première in Toronto, this scene sparked a considerable number of walkouts, almost every single one of which was male. Make of that what you will.<br><br>The subject of fluids is introduced from the onset. One of the first things we hear Monte saying is telling Willow that even if it is recycled, one should never eat one's own faeces or drink one's own urine, as such behaviour is \"taboo\". If we accept that the ship's garden is Eden, then Monte and Willow are our Adam and Eve, and, as we all know, what comes next in Genesis is temptation and desire. Thus Monte's emphasis on taboo in this opening scene becomes ironic given that later in the film, he will come face to face with an even more controversial taboo.<br><br>In terms of problems, the film will be far too abstruse for some. Denis obviously intended for High Life to be esoteric, and she's unconcerned with CGI spectacle or any of the tropes we've seen rehashed a million times in other sci-fi movies. For some, however, the film will cross the line from esotericism to impenetrability, with Denis allowing the socio-political themes overwhelm the film's identity as popular entertainment, refusing to explicitly reveal its fundamental meaning. And for those more used to films that openly reveal themselves without the audience having to put in much effort, High Life will prove too abstract.<br><br>In this sense, Denis's litany of themes does come across as a little haphazard, as she jumps around fairly randomly between them. This results in something of a thematic pile-up, which, by definition, can feel like a bit of a dead-end. I don't agree with people who say the film \"has no point\", but I can certainly see from where such criticism could arise, as Denis leaves several ideas frustratingly incomplete. Another issue is that the journey of #7 is never presented in any way urgently, meaning there's rarely tension, as life on ship moves along at its own lethargic pace. And I have to admit, at times my attention began to wander.<br><br>Nevertheless, High Life is a fascinating film that fits right into Denis's oeuvre. Although it recalls the clinical detachment of 2001 and the psychological intensity of Solaris, High Life is very much its own animal. Asking questions about our inability to recognise the oncoming extinction, it offers a savage and pessimistic corrective to the idealism of films such as <a href=\"/title/tt0816692/\">Interstellar (2014)</a> and <a href=\"/title/tt3659388/\">The Martian (2015)</a>. Positing that mankind is a monster driven by its desires isn't going to earn Denis legions of new fans, but for those of us who were already on board, there's much to be relished here.","user":"Bertaut","rank":[157,228]}]