[{"title":"And Another","rating":4,"date":"23 November 2015","review":"Lori Loughlin finds a sense of place, falls in love with handyman Dermot Mulroney and, oh yeah, saves her aunt's country hotel and Christmas while she's at it, in the second of Hallmark's annual \"Northpole\" series.<br><br>\"Open for Christmas\" grafts a standard Hallmark romantic comedy onto NORTHPOLE's elaborate magical thesis in a workmanlike fashion. However, there is little in the way of dramatic tension to make this worth watching. Ms. Loughlin inherits her aunt's hotel; it has no guests and no source of income. Even so, there is little sense of financial urgency about the outcome once Donovan Scott as Santa tells Ms.Louglin he is depending on her, despite the occasional histrionics.<br><br>The performances are fine. I won't claim that Donovan Scott has cornered the market on Santa, but he has performed the role once or twice a year for more than a decade. Pierre Jodoin's cinematography is excellent; he manages to capture that grey afternoon snowfall light that shows up around Christmas. Yet the script itself never manages to make the viewer think that the inevitable romcom happy ending is ever in doubt.","user":"boblipton","rank":[11,13]},{"title":"Adorable Kids and Simple Plot","rating":9,"date":"30 November 2015","review":"Although it seems to me that Christmas in America has turned into Black Friday for adults, every year I look for a Christmas movie(s) with adorable kids, lots of silly magic, and a simple plot. Unfortunately, most Christmas movies are adult romances with not a child in sight. Because Bailee Madison (Bridges to Terebitha, Cowboys and Angels) and Ava Telek (Flowers in the Attic) are listed as main characters I acquired this and was happily surprised. Bailee is one of the few child actors who has become even more adorable as a teenager and together with Ava, they light up the screen with their smiles. Even now, days later, I giggle thinking about them. They remind me nostalgically of my girls when they were small and Christmas happy.<br><br>OK, the plot is a remake of a hundred other kid and matchmaker and Santa Claus movies. Thats fine with me, I like the variations of this often repeated story and, year after year, try to find the movie that does it best. This may not be the very best of all time (Miracle on 34th Street and The Grinch Before Christmas might be), but I clapped at the end. <br><br>I also might note that the opening credits montage is worth the price of admission. Also, I hope Bailee continues to do family movies and doesn't get sidetracked into depressing teenage sex and drugs chic flicks.","user":"AmakoaAkana","rank":[10,12]},{"title":"might be okay for kids","rating":5,"date":"24 December 2018","review":"This Christmas Movie may be fun to watch for kids, but is really odd for adults. The romance plot could not be more linear and the part of reviving someones christmas spirit has been played exactly like this hundrets of times....also some of the dialogues and lots of coinsidences are really weird and just there to make up they had no clue how to give the plot a constant flow.","user":"MJoseG","rank":[2,2]}]