[{"title":"Defend yourself, sir.","rating":8,"date":"5 June 2018","review":"Again, a successful example of a Spanish thriller-detective, who informally became a separate genre of world cinema. Moreover, the guest was shot by Oriol Paolo, a man who put his hand to such important tapes as \"Enlightenment\" (as a screenwriter) and \"Body\" (as a director and screenwriter).<br><br>Quite often in Spanish cinema, the action does not immediately gain momentum, but only after a while. This film did not become an exception. Initially, \"Guest\" may seem boring and slightly tightened, but soon enough the story begins to add to the dynamics and does not let the viewer go until the final credits. It is worth noting how well the director builds the narrative, differently presented the same events and deftly manipulating our expectations. The story line perfectly fits the chic atmospheric music.<br><br>In addition to the script, which is the main advantage of the tape, it is worth mentioning the cast of actors, represented by the colorful and highly sought-after in modern Spanish cinema Mario Casas (\"Three meters above the sky\", \"Witches of Sugar-Murdi\"), Jose Coronado (\"Body\") and Anoy Wachener (\"Beauty\"). The presence in the frame of recognizable faces, undoubtedly, goes to the film for good.<br><br>If you are not a connoisseur of the detective genre, or have not seen the previous work of Oriol Paolo, then the film outcome will certainly seem unpredictable and somewhat shocking to you. And those viewers who saw the same \"Body\", for certain will notice a certain similarity of these two pictures and the repetition of the director himself. All this, however, does not cancel the fact that the \"Invisible Guest\" is quite a worthy representative of its genre and at least one viewing deserves it.<br><br>The invisible guest is a one-time and far from ideal but intriguing and atmospheric psychological detective with elements of a thriller with worthy acting work, an ornate story and worthy final revelation.","user":"BiiivAL","rank":[156,173]},{"title":"Completely shocked","rating":9,"date":"4 July 2017","review":"Over the past months I've realized how much improvement have Spanish movies and series done in their works. However, when it comes to thrillers, I tend to be very selective and delicate because there are a lot of elements to take into consideration.<br><br>The Invisible Guest accomplish almost all the elements in any checklist of a perfect thriller-suspense movie. The script forces you to think quickly, you can't get distracted for a second because you'll miss an important detail.<br><br>The story is told in a puzzling-kind of way, letting you feel like you finally know what is going on, just to tear your expectation apart with a new shocking truth.<br><br>Some of the actors did a pretty good job. A remarkable performance was the one from Victoria Goodman.<br><br>The music is absolutely engaging. The twisted feeling you get with the melody traps you into the story. The different tones and volumes of the music actually happen in agreement with the intensity of the sequence.<br><br>100% RECOMMENDED.","user":"mongeortiz","rank":[172,194]},{"title":"Hollywood stop for 2hrs, watch this movie, take note and LEARN!!!!","rating":10,"date":"6 May 2018","review":"I wont explain anything, it would be a waste of time. My only review is this: WATCH THIS MOVIE RIGHT NOW!!!!!!","user":"vellaruben","rank":[223,257]}]