[{"title":"Horrors are not unreal","rating":9,"date":"15 November 2017","review":"How do you craft horror for an audience that knows a reality that is often scarier than anything they've seen on-screen before? If you're writer/director Issa López, you take that real horror and, by adding a little magical realism, you end up with a brilliant piece of on-screen horror where tangible humanity is scarier than ghosts could ever be. Set in a lower-class neighborhood of an unnamed Mexican city taken over by a criminal gang known as Los Huascas, who have left a trail of abandoned children in the wake of their many murders and executions, \"Tigers Are Not Afraid\" follows recently-orphaned Estrella as she tries to find a new family in Shine's gang of street children while supernatural forces seem to follow her.<br><br>The film is very much a homage to Guillermo del Toro's filmography, with a symbolic insect right at the start of the film, magical chalk, scary-because-they're-hurt ghosts, clear references to well-known fairy tale tropes, horror elements used more to reflect on humanity than to scare and the overall style of mixing brutal humanity and brutal fantasy in an oddly hopeful way. It is also very much its own thing as, while Guillermo del Toro has usually chosen wars (specially the Spanish Civil War) as the perfect setting to showcase the evil in all humanity, Issa López's focus is squarely aimed at the own brand of evil of an specific human demographic: Mexicans.<br><br>GdT's ghosts are often things of gory beauty; López's ghosts and corpses, covered in blankets and plastic bags are just savage (and savagely real at that), considering real drug cartels' penchant for dramatically using corpses covered this way to \"send messages\" and create their self-images in Mexico. López also tackles Mexican street children and their curse word-ridden slang, Mexican politicians and their unbelievable PR-cultivated images, Mexican police ineptitude and a number of other idiosyncrasies of this culture. The end result is a film crafted in a way that does not necessarily alienate those outside the culture, but is still very clearly made by and for people belonging to it. The way it is made is also worthy of note as López's approach to filmmaking is refreshingly total. She embraces set design, costume design (I particularly loved the character of Chino wearing what is now well-known in Mexico as a preppy \"politician's vest\" at a key period of the film), camera-work, music (some dramatic moments are clashingly scored with the most popular of popular Latin American music styles, to brilliant effect), acting and CGI to tell her story the best way possible. In these aspects, her unquestionable MVP is young newcomer Juan Ramón López, who plays Shine. In a movie full of surprisingly good child actors, Juan Ramón simply runs away with the movie in one of those on-screen debuts that captivates and makes the viewer hopeful for all future work by this force of nature.<br><br>The movie is not perfect: some of the CGI, while brave, just doesn't work on either the technical or creative levels; the editing is a bit choppy at crucial moments; the script's usually high standard only makes the instances of bad plotting and dialogue stand out much more but these issues only hurt the end result minimally. While this is not Issa López's first movie (it is her third feature film as director), it does feel as something of an opera prima of a new stage of her career, one that \"Tigers Are Not Afraid\" suggests could be promising. As it stands now, to this Mexican cinephile, the film is a brilliant work that succeeds in making one confront and recognize personal and cultural demons, monsters, ghosts and tigers.","user":"linkogecko","rank":[30,41]},{"title":"Excellent!!!","rating":10,"date":"8 March 2018","review":"I've finished watching the movie and I'm crying with joy, horror and sadness. What a shocking, real, charming, innocent, evil and disheartening movie. A work of art of the genre made of everyday reality, where an inoperative government, corrupt and alien to its governed has allowed such a real atrocity in Mexico. A lacerating, outrageous, violent reality, without law or justice and a childhood torn, strangled and murdered by interests foreign to its purity. Beautiful allegory of innocence, camaraderie and revenge of a people whose citizens, fed up with corruption and impunity, shout justice even if it is from beyond the grave.","user":"deniro3","rank":[25,35]},{"title":"Fantasy horror with a message","rating":9,"date":"9 October 2018","review":"In the slums of Mexico five young children try to survive the horrors of cartels, drug trafficking and outright kidnappings. Their most recent member, young Estrella (Paola Lara), has managed to gain three wishes, but like in many fairy tales, especially the darker ones, you have to be careful what you wish for.<br><br>I saw Tigers Are Not Afraid on a film festival. It was marketed as \"The best Guillermo del Toro film he never happened to direct\", which has some truth to it. The film has a lot of similarities with Pan's Labyrinth. The realms of fantasy mixing with the horrors of the real world, a young girl trying to survive and even thrive in such an environment and the overall mood being quite not as depressing as one would assume, given the subject matter.<br><br>First of all, I have to praise the child actors. All of them are terrific and more than manage to sell the horror, desperation and determination needed of them. Paola Lara as Estrella is of course excellent, but the best performance was without a doubt given by Juan Ramón López as Shine, the leader of the children. Especially the way he managed to sell the combination of toughness and vulnerability he can only show to Estrella and even then only under duress.<br><br>Unfortunately I was not so impressed by the fantasy elements. They didn't seem to have any reason or rhythm to them. The actual three wishes were just about perfectly handled, but everything else fell flat. For example, the children have this phone with a dragon on it. At one point the dragon takes flight and flies out to explore. Then, a few scenes later it comes back. And it's not on the background, either. The camera follows the dragon and the story is briefly paused for it to do so. But for what? Nothing it gained, it doesn't connect to anything and even the children's reaction is pretty blase. The whole film is full of little moments like that. Those things that stay on the background or are just there to be window dressing are perfectly fine, just world building, but quite often the film focuses our attention on them. And usually for nothing.<br><br>Tigers Are Not Afraid needs a bit polish and thought given to its elements to be a truly great film. As it is, it's worth a watch if you're a diehard del Toro fan and want something in his particular style.","user":"Vartiainen","rank":[14,18]}]