[{"title":"I need to write something","rating":4,"date":"9 February 2020","review":"The review below is totally distorted and beautify the movie. The theme is drug, sex, violence but it wasn't to the level it described so deeply. Kinda boring indeed.","user":"ks-60500","rank":[6,8]},{"title":"weird but not in a good way","rating":4,"date":"20 February 2020","review":"I have seen many messed up movies in my days. low budget flicks that became cult classics. As much as this movie tries to be that.... it was bland and will not be remembered by anyone except the writer and the cast.<br><br>4.1","user":"natcalgary","rank":[5,7]},{"title":"No, no! Don't listen to the naysayers, watch it!","rating":9,"date":"1 December 2019","review":"They bash it because it doesn't fit in a genre? Why does art have to fit in anything? OK, I'll give them a genre, it's \"fish&amp;chips western\"! Fresh and new! We've had \"spagetti westerns\" and they were successful, now somebody is brave enough to bring a new genre and that's what I call it. The script is very solid! Funny as hell at times (Pot growing junkie: \"- What's wrong with my life? I'm a self-employed businessman. See, I'm one of this\ncountry's... interpreters.\" Imaginary friend: \"You mean entrepreneur\" Pot growing junkie: \"Yeah, whatever\"), bluntly realistic at others (depicting drug addiction at it's worst and the lengths an addict would go to get his hit). It hints at a lot and embraces multiple influences: \"Natural Born Killers\"- like lead characters, \"Guy-Ritchie\"- like philosophying underworld characters, Robert Rodriguez gore (and bombshell female lead!!!), \"Ennio Morricone\"- like score and I'm certain many more that I've missed on my first view. Acting is top notch! Upcoming talent and heavy-hitters alike. I mean, you have Steven Berkoff in it... 'Nuff said! Everybody did their job and made the characters believable. Photography was also good and speed was at junkie pace. Nothing wrong with this movie, got me from the first five minutes! Great \"Fish&amp;Chips Western\"! Welcome a new genre!","user":"xmutee","rank":[7,30]}]