[{"title":"Excellent message -- deserves to be seen by everyone","rating":10,"date":"1 May 2017","review":"My usual disclaimer: I am not Indian. I live near Washington DC. My wife and I have been watching Bollywood movies for over 10 years, and we see probably 20+ a year, + DVDs. I subscribe to Filmfare. <br><br>We've noticed a trend in Bollywood--a good trend. Women are shown as more independent and powerful. This is good! The director Maneesh Sharma is a great example of this -- all his movies feature strong, independent women. I met Maneesh several years ago, and he seemed like a great guy.<br><br>But there are still movies like Badrinath Ki Dulhania that are painful to watch. It made me cringe throughout at the treatment of women. It was an embarrassment to the Indian film industry, and in terms the director might understand, it brought shame upon him and the entire cast (see below).<br><br>So Lipstick under My Burkha was a welcome addition to feminist movies. The Indian censor board had the good sense to approve it, even if it was after an appeal. We saw it yesterday at the DC Film Festival, and the screening was almost sold out -- and Indians were a small minority of the audience.<br><br>The movie makes two points I completely agree with. I suspect some people will say that I am culturally biased, etc. etc. but I think this goes beyond that. There are certain things that are simply right and other things that are simply wrong. It doesn't matter what your culture is or where you come from. And things that might have been acceptable in 1300 or 1850 or even 1950 are not acceptable today. They should be condemned.<br><br>First, shame. The male characters in the movie use the word \"shame\" a lot -- \"You will bring shame upon the family,\" etc. No one -- NO ONE -- can bring shame on you except you yourself. If you don't believe this, you need to wake up and change.<br><br>Second, human rights. I'm going to be shamelessly (joke) culturally bound and quote from that nice 18th century Enlightenment document, the US Declaration of Independence: <br><br>\"We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\"<br><br>They key idea here is that \"rights\" are NOT given to you by the government, a king, or your husband. They are given to you by God. And they are \"unalienable\" = they can't be changed or taken away -- by anyone, for any reason. So when a husband talks about \"allowing\" his wife to work or parents talk about \"finding a husband\" for their daughter, they are violating human rights. Again, if you don't believe this, you need to wake up and change.<br><br>The movie itself has an interwoven plot. Four women of different ages live in a \"manzil\" or block of buildings in Bhopal. A college student wears a burkha ordinarily, but changes into a T-shirt and jeans every day as soon as she gets to her college. Because she's been repressed so much, she has fantasies about boys. Because she is so inexperienced, she is vulnerable. She comes very close to disaster. The second woman is a wife and mother of three boys. Her husband works in Saudi Arabia and only comes home a few times a year. Somehow he is stupid enough to think that all the children are his. His wife works, secretly, for a department store as a saleswoman, and she is very good at her job. Her husband has a mistress, and the wife discovers this and confronts the mistress. The husband's reaction: \"Why are you trying to embarrass me?\" Again, let me repeat: his own actions should embarrass him. Not something his wife does. But he doesn't understand this. A third women is \"modern\" and fairly independent, but she is about to be married to a man she doesn't like. He wants her to live the rest of her life at home with his large family. That's her idea of Hell. She has a boyfriend, and together they try to earn money by photographing weddings. Eventually the finance finds out about the boyfriend, and again the idea that she has \"shamed\" him comes up. She walks away. Good for her! The fourth woman is a 52-year-old widow who lives with relatives in the manzil that she (they?) own. She reads racy romance novels and has fantasies about a young swimming coach. She gets up enough nerve to take swimming lessons from him, and after several unsuccessful attempts she gets him to have phone sex with her--but of course he doesn't know who she is. Eventually she is exposed, her family throws her into the street, and of course they say that she has \"shamed\" them.<br><br>What makes it a good movie, apart from the social message, is that each character is described in enough detail that you feel that you know them. They are not just stock characters, as in many movies: \"the widow,\" \"the slut,\" etc. The acting is first rate. And there are spots of humor scattered along the way. It's not all doom and gloom. It should be required watching -- and not just in India.","user":"mamlukman","rank":[50,65]},{"title":"Of dreams and despair - but succumbs to clichés","rating":6,"date":"27 July 2017","review":"Lipstick Under My Burkha is not a perfect film... Far from it actually... But this is an important film that leaves one happy, sad and disappointed at same time...<br><br>Happy - because Alankrita Srivastava dared to navigate through a subject that is usually a taboo to be even discussed openly by women, and does that skillfully without resorting to titillation or sleaze, rather using interesting metaphors throughout the script.. she dared to dream just like she wants the Rosie in each of her four protagonists to dream and live that life..<br><br>Sad - because here are four very ordinary women presented with their day to day struggle to even live a life of little common pleasures, where they are all strangulated to even dream, where they and many around them are all living dual lives and making peace with it not attempting to change anything because they possibly know its not worth the effort..<br><br>Disappointed - because this story told could have been so much more. Disappointed because the script resorts to a clunky end of using the clichéd smoking metaphor as an equivalent of liberation and sisterhood bonding. Disappointed because the script still appears forced and jarring at times to drive home some subtle points. Disappointed because it still takes a pseudo feminist stand in places showing mostly one dimensional male characters, and does not work enough on the script to make it smooth and integrated enough. Disappointed because the film still seems more focused on impressing the festivals circuits, rather than telling a simple story simply.<br><br>The film benefits immensely by getting the cast right though.. Ratna Pathak Shah is outstanding as the gutsy Usha Parmar and is the lifeline of this story.. Konkona Sen Sharma is extremely good too as expected.. I found these two stories much stronger than the other two personally, though Aahana Kumra and Plabita Borthakur perform well too.. Ahana's Leela and her track was the most defocused and weak in my opinion though..<br><br>Overall, there is a lipstick and a burkha that exists in the life of every woman and a shade of Rosie who lives deep beneath every soul, and this film will drag them out from the dark closets of everyone.. triggering identification to one or more of these characters.. and creating moments that are impactful.. Well done Alankrita for showing that courage..<br><br>How I wish though that an idea like this could get a much tighter treatment and finer finishing that could have made it as haunting a film as the subject demanded.. Sigh!","user":"thirdvantagepoint","rank":[14,19]},{"title":"\" A Bold & Hard-Hitting Women-Oriented Film \"","rating":8,"date":"23 July 2017","review":"\"Lipstick Under My Burkha\" was screened at various film festivals across the world prior to its theatrical release,receiving huge accolades from renowned film critiques,making it a highly anticipated film for the moviebuffs in India and abroad.The news that the makers had to plea to the appellate authority(FCAT) for a release after getting a no from CBFC marked up the excitement surrounding the film that has finally managed to hit the silverscreen after bidding adieu to all the dark clouds spread over it.<br><br>What made the censors reject the certification and to make derogatory remarks like \"the story is lady-oriented,their fantasy about life\" is shocking and alarming for the future of Indian movie scene that has remained heavily censured from time immemorial.Ironically,I felt the opposite that the best thing about the movie is that it could succeed in making strong statements without being offensive for a second,something that calls for a gifted writer-director like Alankrita Shrivastava.The key to narration used here is dark humor that's there in sumptuous amount for the whole of the narration.<br><br>The movie focuses on the lives of four women who rebel against the social stereotypes quartered on them and the never ending contrast conflict between their dreams and the vested interests of the patriarchal society has been strikingly reproduced in the narrative without any reservations,unnecessary cinematic liberties or over- melodrama unlike many recent movies that handled the same issue(Leave aside Leena Yadavs's riveting drama feature \"Parched\").Th word \"Burkha\" in the title is used to represent the veil over feminine dreams and no way targetted at hurting the religious sentiments of the Muslim community in the country.<br><br>The universal truth that the sexuality of women and their desires can never go hand-in-hand with the misogynistic pre-assumptions that's prevalent in the society has been enlightened by the movie at various situations in the narrative.In one scene we get to see a groom-to-be saying to his prospective bride that fortunately they have bought a new television set at their home so that she can be happily relaxed inside the home once they are married and in another shocker of a scene our protagonists makes a sigh that their biggest mistake is that they dream too much,an eye-opener into the plight of numerous women who are nothing but slaves inside their own homes.<br><br>Even though the movie isn't heavily censured,abrupt cuts were felt at few point in the narrative which could have been taken care of while on the editing table.The conclusion of the movie was predictable and slightly weaker on comparison with the rest of the narrative.Solid performances stand as the backbone of the griping narrative and it was delight to watch all the lead-ladies perform well on the screen.The pick among the cast I felt was Konkona Sen Sharma and debutante Plabita Borthakur who both gave excellent performances in their respective roles.Ratna Patahk Sha and Aahana Kumra too were equally good and made their roles memorable.Vaibhav Tatwawaadi,Sushant Singh,Vikrant Massey etc gave good supporting performances.<br><br>Music by Zebunnisa Bangash and Mangesh Dhakde was adequate for the narrative.Technical side was handled really well even though the budget of the movie was very low in comparison with other biggies from Bollywood.<br><br>Overall,Lipstick Under My Burkha is a daring and whole-hearted women-oriented film that's worth a watch from the cinemas at the earliest!","user":"afsalthodupuzha","rank":[12,19]}]