[{"title":"An American girl in the Amazon Jungle.","rating":6,"date":"4 November 2016","review":"This is the tenth film in the 'American Girl' franchise. And this time the theme is a rescue mission. Like I mentioned in the 'Grace Stirs Up Success' (the previous film), I haven't seen all film in the series. This is for children, particularly the preteen girls. So for the grown ups it is like a joke, especially if you are a man. But basically I watch anything, there's no restriction to that, because I want to be an all-rounder. Despite I'm not the target audience, I think it is just an okay film, I mean an average. Though the response from the kids would differ, so watch for them, with them, if you have got one in your family.<br><br>Well, the 'American Girl' films never followed the order or the cast had ever returned. It is so random from the story to the characters and the timeline. So this tale is about another American girl called Lea Clark, who loves adventures and the wild animals, but it is a far more dream than reality to her. But when her family receives a message that her brother gone missing in Brasil, she packs her bag along with her mother and lands in Manaus. While her mother making an effort to bring him back, Lea makes her own attempt and while doing that, she gets lost in the Amazon forest. From there how she makes back and what about her brother, all comes solving in the final quarter of the film.<br><br>\"What one finds is not stolen. Whoever lost was careless.\"<br><br>The little girl Maggie Elizabeth Jones from 'We Bought a Zoo' all grown-up to a teenager. Looks like another young artist who might make big in the filmdom in the near future. Because many who played in this series are now the well known names. Maggie's role was decent, but the issue was the story's silly and predictable. Anyway, that's how a children's film looks like, without the adult contents and explosions. So if you want to watch this, you must compromise on those stuffs, otherwise don't go for it.<br><br>As I have heard, the story takes place in the Amazon forest, but the filming was done in the African rainforest. But I guess some of them were the settings. Overall, the locations are very beautiful and they make good use of it tell the story. Since it takes place in Brasil, some of the lines are in Portuguese. This is suppose to be a comedy, but the theme was very serious, still somewhat it manages to produce a few jokes now and them. A good mix of everything, like a whole family can sit and watch together.<br><br>Not all the films in this series were the theatrical product, but this one was with a couple of others. One thing I always fascinated with this franchise is that they all gives a good message to the youngsters. So every time with a different topic and on the bottom line, takes a bit sentimental dip as well. This time it is highlighted the poaching and its related problems. The wildlife and the forest conservation is a good message to teach kids in this global warming era. So I think it would be a good watch for them. It's nearly time for the production house to announce the next film, so I'm looking forward to know what theme they would choose. Meantime, if you think it is not for you, at least show it to your kids.<br><br>6/10","user":"Reno-Rangan","rank":[2,4]},{"title":"An American Girl film","rating":4,"date":"16 May 2019","review":"10 year old Lea Clark (Maggie Elizabeth Jones) loves his brother Zac. He comes home for a visit with his new girlfriend Paula Ferreira. He is going back to Brazil to pursue poachers. He doesn't tell anyone except Lea. When he goes missing, Lea and her mother go down to Brazil to search for him. Lea drags Paula to follow Zac's trail into the jungle where they are helped by native girl Aki and her tribe.<br><br>This seems to be a mishmash of shooting locations. Some of the exterior actually looks like Brazil although apparently, it's mostly shot in South Africa. It simply looks fake a lot of the times. Authenticity is a big problem for this movie. Aki is oddly racially insensitive and I really don't know about the tribe. It feels too much like dress up. The movie could have added authenticity with more Portuguese but I can understand that this doesn't want too much subtitle. It would have made more sense to rewrite the thing for South Africa if that's where it's filmed. It's not like it's Shakespeare. Lea could have gone on a safari. Lea is too brash and Paula is too high maintenance. The combination is supposed to be humorous. None of this is actually funny unless pineapples get funnier. There is some allowance to be made since this is a kiddie movie although it has pretentions of being serious like many of the American Girl movies. There is much too much conveniences in the plot. When the mom hangs up on Lea, there's no reason why Lea wouldn't call her back. The writing is not thought all the way through. It gets a bit too dangerous for a kiddie story. The production is not good and the movie struggles.","user":"SnoopyStyle","rank":[0,0]}]