[{"title":"Naked Lies","rating":8,"date":"20 February 2020","review":"Forget everything you know about Ned Kelly. Or don't. It doesn't really matter as this film, is not even attempting to be an accurate historical film. \"The True History of the Kelly Gang\" by Australian director Jeff Kurzel, is based on the 2000 novel of the same name which gives a fictionalized account of the famed 19th century Australian bandit.<br><br>Many historical films have the tried and true phrase 'based on a true story' and then go on to distort, misrepresent, and fabricate. This film is honest in its dishonesty: the opening text says that nothing you're about to see is true. As the other words fade, the 'true' lingers and becomes part of the title. This itself is a lie, because this this depiction of Ned Kelly is a blend of lie, legend, as well actual true facts about the Kelly gang. There are layers upon layers of subtext and metatext in this film on the topic of posthumous storytelling. Ned Kelly is the perfect subject: he is a man haunted by his past and the lies leveled against him, a man who wrote lengthy letters giving his side of the story, and to this day is still hailed a hero and a villain.<br><br>Another misdirect by the film, is that this is not about the crime-spree of the Australian outlaws but focuses much more heavily on the life of pre-infamy Ned Kelly. Edward \"Ned\" Kelly is the eldest son of a poor Irish family. His father is sent to prison when Ned is young and a variety of potential father figures - some law enforcement, some criminals - flow quickly in and out of his life. The constant is his mother with whom he has strange, deep yet toxic relationship. Ned is shown to mostly be a good person but has pushed him into a life a crime through unjustified (but also justified) persecution. His decision to become an outlaw seems to be done as an act of protest. It seems everyone in his life is tied into the eternal struggle of authoritarian police and anarchist outlaw, which is extrapolated further to be a conflict between the English and the Irish, centuries old rivals.<br><br>Despite being the focal point of the film, Ned remains an enigmatic figure throughout. He wordlessly stares for an uncomfortable amount of time, the gears turning in his head, before suddenly acting and the reason for his decision is often left for the viewer to decipher. This also gives the sense that some of the plot lines weren't fully developed. Perhaps cutting back on certain scenes to focus more on others could have also helped the uneven pacing. The film is a slow burn that doesn't so much gradually grow into madness, but suddenly lurches headfirst into the depths. George MacKay is captivating as he goes from the wide-eyed nervous staring, to the chaos that is the final act. Kurzel has a great eye and even during the slower segments, there are enough beautiful and intriguing shots to keep viewers engaged; some may find the journey to the brilliant climax to be arduous.\nAnd it would be a shame if people gave up before the end. Kurzel's 'Macbeth' is bookmarked by inventive and memorable action scenes and in the same vein, 'The True History of Ned Kelly' culminates with one of the most adrenaline pumping action scenes in film. It is bloody; it is brutal; it is grotesque; and most importantly, it feels real. Many blockbuster action films give a sense of being an observe to highly-choreographed, consequence-free twirling. The combination of visuals and sound design in this film make the viewer feel like they are part of the chaotic firefight.<br><br>Beyond just the sound design, the score deserves great praise as well. The composer Jed Kurzel (director's brother) uses string, percussion, and folk instruments to create a rich sonic atmosphere. There are fun, adventures songs where the bass is cheerfully plucking away, but where Kurzel excels is in the intense. Though this core may not be overall as haunting as his masterful work on 'Macbeth', there are still pieces where low notes pound away like an oppressive heartbeat as the abrasive, off-key high strings become almost overwhelming.<br><br>This movie is not without controversy. Despite telling the audience from the first sentence that this is not a factual depiction, you can find numerous angry user reviews and articles from Australians upset at two aspects of the film: the cross-dressing and homoerotic undertones. The Kelly gang is not trying to be women; they adopt dresses as part of their battle dress (pun intended) in a way that can be interpreted to be an act of protest to masculine ideals. The world of cops and robbers is hyper masculine. Men size each other up, posturing to be the tougher man, sticking guns in each other's faces. The constable's desire to subdue Ned is like a passionate obsession. Robin Hood is oft joked to be gay, living in the woods with his merry men, and Ned Kelly being the Australian Robin Hood... It seems to me as a logical progression, and a delightful deconstruction of the ultra-masculine.<br><br>So, did we learn anything about the Kelly gang at the end of this two-hour journey? With fact so entwined with fiction it's hard to say. So instead, one can mull over the multitude of ideas and themes and meta-commentary that this film provides long after it's over. Not that there are any clear answers there either. Or one can just appreciate the moments of great acting, interesting visuals, top-notch score or memorable finale.","user":"reigntall","rank":[24,31]},{"title":"Watch the first half then turn it off","rating":4,"date":"26 January 2020","review":"Entertaining for the first half with some good performances. Then it turns into absolute incoherent drivel, you won't miss anything if you skip the second half of the movie entirely.","user":"gemfesty","rank":[54,77]},{"title":"Overall incoherent and dull","rating":13,"date":"13 January 2020","review":"The promoters of this film have decided to go with \"limited release\" due to poor audience reaction. Frankly after seeing this in Turin I have to agree. Of the ten or so film so films based on Ned Kelly this has to be the most ambitious -- and the least well actualized. In the end it is a disjointed jumble, with a couple of well played roles -- but overall, incoherent and pointless.\nDressing Ned up as a woman may seem brave, but really it just comes off as a put on. I am not put off by it, but one has to ask: what is the point?","user":"random-70778","rank":[52,77]}]