[{"title":"Not worth your time","rating":2,"date":"15 March 2016","review":"I am a movie goer reviewer so there will not be an in-depth a analysis of production or the like.<br><br>Advertising for this movie was quite misleading. By giving it the title 'The Perfect Match' and showing clips with Cassie and Terrence J engaging in romantic encounters, they give the impression that the focus of the movie will be them and the evolution of their relationship. However, the audience hears more about the wedding plans of supporting characters are we are supposed to believe that Cassie and Terrence J's characters actually fall in love. Let's see...they had sex in a public bathroom, also in his home, made out in a pool and he photographed her. That's about it. Now how is that he fell in love with her and was heartbroken to the point that he said damaging things to those he loved? This movie seemed like an excuse to cast 2 good looking people to make out - and one of them lacks any type of acting skills. I cannot recommend this move to anyone who desires to be entertained.","user":"dmayo-28425","rank":[22,29]},{"title":"Despite some of the negative reviews, I really enjoyed this","rating":9,"date":"3 March 2018","review":"Really happy I gave this film a watch, had been considering it for a while but some of the negative reviews put me off. I now know to always trust your instincts and not to take too much notice of other reviewers.<br><br>It's not going to be to everyone's tastes, but I really enjoyed this and could really relate to the lead character, this film taught me a life lesson. The L.A scenery used in the entire movie was absolutely stunning, a real beauty. Great job by Terrence J, Cassie Ventura and all the supporting cast. Nice cameo from Bad Boy Records superstar French Montana. Probably the younger more \"hip\" audience would be into this one, I say check it out!","user":"amaanq","rank":[8,9]},{"title":"Not perfect in anyway","rating":4,"date":"22 March 2016","review":"The movie tries hard not to be your typical Romantic comedy. It's a little too up beat and hip and does not focus on the romance or the comedy as much as it should<br><br>Charlie is the archetype alpha male with the fly job the fly crib and a odd hang up about settling down that makes him vastly different than his two married friends, and gives us a bunch of scenes of them sitting around drinking lattes or working out where they can debate about this. Than he meets that chick who changes his mind about it.<br><br>I got to admit, that I did like how the situation develop, it was an interesting twist.<br><br>But Charlie does follow the formula for the rom-com lead to the tea, making it hard for Terrence J to shine his charm through the staleness of it. I did enjoy seeing him try, however. <br><br>Paula Patton's role as Charlie's sister is way too short for it to be such a key note that it was. It's almost like they added it afterwards in order to make the movie make more sense than it would have without. <br><br>I wished it was funnier than it was, too. Not even Donald Faison whose job it was to be funny as Charlie's best friend, was making me laugh.<br><br>Maybe I should not say anything about French Montana's over dressed cameo appearance. He was not in the movie cause he can act, but man, could they not find someone better on camera for this?<br><br>Even the hot love scenes were kinda bland after awhile.<br><br>Overall, I did like how the story played out, not enough to make it worthy of my cash at the box office. Catch it when it comes on cable late at night.","user":"subxerogravity","rank":[7,9]}]