[{"title":"Strong 4 // Quietly powerful","rating":8,"date":"25 August 2018","review":"The Cakemaker is melodrama fodder. A married man, a young son, a gay affair, death, deceit, revelation - the setup has all the trappings of a trite lifetime movie. It's not though, far from it. Instead, it's one of the quietest and most delicate films I've seen this year. It trades dramatic fireworks for quiet rumination, diving deep into the psychology of grief rather than indulging in scandal. The performances are beautifully restrained, the dramatic weight carried on the slightest of expressions. Character motivations are left largely unarticulated, challenging the viewer to empathize and draw their own conclusions as to their thoughts and feelings. The languid pacing may be patience-testing for some, but I found myself comforted and calmed by the stillness of the film. The drama is quite layered as well with cultural, social, and religious themes impressing upon the core triangular relationship. Perhaps what I admire most about the film though is the broad, non-judgmental way in which it depicts love and loss, unbound by social and cultural divides. A beautiful, honest, and melancholic piece.<br><br>Strong 4/5","user":"ccamp89","rank":[24,29]},{"title":"German baker and his Jewish lover's widow fall in love.","rating":10,"date":"30 June 2018","review":"The film opens and closes on images of Thomas's poignant mix of solitude and passion. In the first he's kneading his dough - that's the activity in which he finds both his self-realization and his antidote to loneliness. At the end he rides his bike away from his Berlin bakery job. He's going home - as usual, he thinks - alone, but still warmed by the memory of his beloved Oren and Anat. \n But he's not alone. Anat has tracked him down. She glows with anticipation of their reconnecting. The last image - the clouded skies - signify their challenging but promising future. The film stops before we know if and how they will recover their love. We may guess as we prefer.\n Thomas doesn't lock the front door when he leaves that cafe then. Maybe it locks itself upon closing. Or his leaving it unlocked may signify his openness to Anat's return to his love. This film's metaphors work that naturally, like Anat's radiance at eating Thomas's cakes and bread - that's love at first bite. So too the sensuality of Thomas's baking, the comforting softness in his colour, fleshiness and overall nature. Here love is not romance but an openness to emotions and to life. \n This film abounds with scenes of such quiet suggestions, revelations, nuances in relationship. In the first scene the two men are already familiar with each other - Thomas remembers what pastry Oren doesn't like. \n Arriving in Jerusalem, Thomas's isolation is caught in one shot where he's shrunk to the lower right of the screen, passed by two gesticulating orthodox Jews. The framing and extras define him as alien. In the shower room at Oren's club Thomas looks at a handsome Jew, then down at his - we infer - uncut alternative.\n After stealing a smoke outside after her shabbes dinner, we see Anat boxed in the window frame luxuriating in the verboten last crumbs of his Black Forest Cake. She licks her plate. That frame evokes the religious restriction Moti imposes that she must transcend to find fulfilment with Thomas - as, too, her later discovery that her present lover was her husband's first. \n Wordlessly Thomas warms Anat's runaway son, then involves him in icing the cookies. As with Anat, Thomas slips into an easy bond with the boy, despite his uncle Moti's impediments. \n In scene after scene the import is in a glance, a gesture, hardly ever verbalized. \nThomas (and we) never learn how Oren's mother twigged to his affair with her son. We just see her immediate warmth towards him, her generosity, and her tacit knowing. \n That understanding lies beyond Anat's brother Moti, whose initial disdain for \"the German\" takes cover under the formal strictures of the kosher. in his shares invitation. Moti makes an effort to accept Thomas - as in his shabbes invitation. \n But Oren's mother and son are instinctively drawn to Thomas - as is Anat. In their first sexual engagement Anat takes the initiative. Thomas's intention has only been to help her. The passion is unexpected.\n Perhaps the key to the film's conception of love lies in the scenes where Thomas asks Oren to describe his most recent love-making with Anat. Initially we might read the scenes as simply erotic. But the context gives them rather more depth and characterization. There is no jealousy, no bitterness. \n Rather Thomas's embrace of Oren is so complete that it can include the other objects of Oren's love, his wife and his son. When Thomas makes love to Anat later it is with the memory, gestures and emotion he recalls from Oren. \n Here is a film where love might conquer all. Hence all the divisions that are set up - German vs Jew, Berlin vs Jerusalem, bereaved Insider family vs embarrassing Outsider rival, gentile vs Jew, wife vs lover, heterosexual vs homosexual love, etc. \n Thomas's and Anat's love for Oren make their falling in love with each other seem entirely credible - however unconventional. How many lovers discover they have any such strong bond in common? Oren's mother loved him enough to accept his lover Thomas; so Anat apparently grows to, too. \n But that acceptance too takes faith. Maybe that's why Thomas's cafe is called Credence. You have to believe.","user":"maurice_yacowar","rank":[31,41]},{"title":"Beautiful but illogical","rating":6,"date":"8 May 2018","review":"There are beautiful shots of Jerusalem, including the call to Shabbat, and Berlin. Indoor scenes are dressed simply but effectively. But ...\nOren, who travels frequently to Berlin on business, tells his wife Anat he is having an affair and is leaving her. But as he moves out to a hotel, he is killed in a car accident. Soon after, a mysterious German (Thomas) shows up at Anat's Jerusalem café, becoming a regular customer while asking for a job. As Anat also juggles with 7-year-old son Itai, Thomas is hired as a dishwasher, but he manages to start baking, and the café soon becomes famous for it, even if it loses its kosher designation and some of its customers.\nAs Anat seduces a willing Thomas in the kitchen, Hanna (who seems to be Oren's mother) invites Thomas to see \"his room\". Is there a degree of willful blindness going on?\nThe most glaring illogical point is the \"damming evidence\" in unheard, unanswered calls on Oren's phone. Another is Thomas insisting on getting Anat to knead dough, when she could have been delegated easier tasks like cutting and chopping (she earlier teaches Thomas to core peppers for stuffing). And while scenes with Oren shows Thomas being straight-curious, does that really end in his willing participation in intimacy with Anat?","user":"chong_an","rank":[21,32]}]