[{"title":"Death has never been as blunt and honest","rating":10,"date":"10 March 2019","review":"The first half of the movie, I previously thought, was superficial. Skye and Calvin had so much dynamics together yet it could have been executed in a way that viewers could find it more profound. While Maisie Williams had an amazing performance, Asa Butterfield's acting fluctuates throughout the movie.<br><br>However, the second half shows why it deserves a 10 stars for me. In theatre, this type of illness-death story has been told plenty of times, creating a good number of conventions and cliche for the genre. This movie gives you something completely different. It depicts a beautiful and wonderful platonic friendship that people have rarely seen even though we desperately need one (despite the fact that deep down inside, we still ship them because of the chemistry they had together). In addition, it deals with cancer and death in the most brutal yet very blunt and honest way, which hits you really hard at your emotion.<br><br>I love the direction it chose to take. It's cute and vibrant and filled with energy, even till the last minute of the movie, despite how tough the problem they were dealing with.<br><br>Personally, as a person around their age who is also working on figuring out myself, I relate to them considerably and feel inspired significantly by this movie. It's an important one. One that I would love to recommend to everyone.","user":"chubbygirl-06930","rank":[33,34]},{"title":"pleasantly surprised!","rating":9,"date":"2 February 2019","review":"This was not my type of movie but somehow I went to see it. I was very happy that I saw it. Yes, there were laughter and tears and I'm male. All cast did a great job in making the movie feel alive. It's definitely worth seeing","user":"leong_tommy","rank":[46,51]},{"title":"great movie","rating":10,"date":"4 February 2019","review":"A film deeper than it seems at first, I liked it a lot","user":"allegria789","rank":[41,47]}]