[{"title":"Not good","rating":1,"date":"29 March 2018","review":"The 7 points rating is clearly a scam. I gave this movie a shot only because of that rating, so now I must let everyone know that the movie sucks.<br><br>A couple goes out into the woods in one of those group game experiences where the theme is Horror/Horror Movies. After finding some clues and solving some riddles, people start dying. The main character has to fight for survival while trying to figure out what's real in the game or not. A good premise, but it all goes straight to hell fast,<br><br>The main problem with this film is probably the acting, along with a feeble script and characters we couldn't care less about. All the clichés are there and even if this was an attempted homage to horror, it failed miserably. <br><br> It gets ridiculously predictable by the end and the ending itself comes as a relief after the hour and a half we just wasted. <br><br>Definitely: avoid.","user":"susana-c-fernandes","rank":[36,56]},{"title":"Average at best","rating":5,"date":"22 July 2018","review":"Given it 5 stars out of 10 for it's attempt at something a little different from the norm, also given the obvious low budget, the film does not look cheap and the actors were decent enough.<br><br>There is another older movie in the name of 'April Fools Day' a 1986 film which is similar in some ways to this one, but does it a whole lot better!","user":"julian-kendrick-451-691654","rank":[15,21]},{"title":"Slightly above average","rating":6,"date":"31 July 2018","review":"This is not a dream, this is really happening! <br><br> Horror, Camping, Riddles,....and drugs. A couple embarks on a make-believe slasher camping trip, very much like LARPing or those zombie survival fantasies. The girlfriend seems hesitant as she's not a horror fan, the boyfriend doesn't really either, he just doesn't seem to fit the profile honestly lol. The outing is a mix of scavenger hunt, mystery solving, and scare tactics...honestly it feels more like playing one of those hidden object games or Resident Evil (To find one half of the coin you must collect the ruby and the emerald, put the emerald in the zodiac sign of the twins, put the ruby under the picture of \"The Grey Lady\" etc etc) but still something you haven't seen a trillion times in other horror movies....having said that...everything else is. Scary woods....yep blair witchy. People chasing and scaring the hell out of you...yep Houses October Built. Horror movie fans filled with quotes and trivia...yep Scream. Traps where you have to choose who lives and dies, only there's a trick to the lock...yep Saw. It turns out everybody was in on it and this was just to scare the hell out of you...for fun....yep April Fool's Day. But I'll be honest, despite the fact that I was able to predict everything that happened long before it did (from the moment I saw her (Checkov's) necklace, I knew she'd be using it as a makeshift weapon) to the April Fool's Day twist, even to the secondary twist that her boyfriend was a villain. I still found this movie very watchable and sometimes intriguing; despite being a mish-mash of other horror movies thrown into a blender it still somehow managed to gain its own identity and kept me watching without becoming horrifically bored. I probably wouldn't watch it a second time, but I don't regret watching it the first time....not terribly unique but still enjoyable.","user":"df4205","rank":[9,15]}]