[{"title":"Beyond Perfection","rating":10,"date":"21 July 2016","review":"I found myself really enjoying SULTAN. Ali knows how to push all the right buttons to keep the audience engaged. Ali's writing and directing are flawless. This is without a doubt Ali's best ever movie. Nushki is an acting diva and she is making her way to be the next great actress since Aishwarya Rai. I love love love Nushki, I truly adore her and always will. She's my love ;) xxx I must confess that I could watch Nushki in almost anything, but here she really delivers a performance that may be her best yet . . . and I've seen almost all of her work. Nushki elevates herself to a league of her own. She is a beautiful girl who is talented enough when playing \"regular\" characters, such as the journalist in \"PK\". But as a high profile corporate executive in \"NH10\" and in this film as a musclebound wrestler, she takes it to a level most female actors couldn't. You can tell how hard she worked to make this role believable because when she wrestles you forget it is Anushka Sharma in the ring. SK is always a pleasure to watch. Here his character's sizzling chemistry with Nushki is completely adorable and that moments of sweetness will surely MELT your heart. SK gives an incredible performance that will undoubtedly propel his career. Overall it is one motion picture that should never be missed nor put aside when selecting movies to be seen on a weekend. SULTAN is a sure winner for all.","user":"billionhearts","rank":[352,379]},{"title":"Salman Rise among inspirational Leads","rating":10,"date":"7 July 2016","review":"perfectly crafted story of an individual who never gives up in life always keen to fight within him n challenges for his dignity this films gives passion to create your own entity and while the convener is alike SALMAN Khan things become much easier to impact on Hearts, Salman did full justification to rule so did Anushka. Transformation on character was made tremendously well by Salman Khan as he not only shaped his body accordingly but also on his accent. I rate this 10/10 as story leaves a message to society as well. this movie worth watching while a sweet love stories leads an inspiration all the way till the end of the movie. I extend my best wishes to cast n crew of the movie for putting up a remarkable effort<br><br>Regards","user":"farrukh-hussein","rank":[133,148]},{"title":"Brilliant performance by all...A inspirational and motivational sport drama","rating":10,"date":"7 July 2016","review":"The movie is one of the best sports drama ever produced in Bollywood. Can't see why some people are rating it so low, perhaps they don't know much about films. Salman's performance was outstanding and so was Anushka's. The movie is based on the life of a wrestler and how the biggest opponent of any wrestler is he himself. The dialogues in this movie are so appropriate and most of the people.The movie is an inspiration to the aspiring wrestlers and other athletes. The movie gives a strong message about how one should stick to his roots to achieve success in his life. Todays generation is filled with wannabes, what they don't realize is you can't beat someone in their own game i.e if you copy someone, you cannot get ahead of them. The only drawback in this movie was that its a little fast-paced. Otherwise a very nice. The action was realistic and very well choreographed, sound effects was one of the best in Indian cinema.","user":"hemantnaagar","rank":[136,154]}]