[{"title":"a slow introspective study of how we make sense of our lives","rating":7,"date":"28 May 2017","review":"Everyone is a storyteller in their own way. Some use the big screen, others a book or a painter's canvas, but most of us tell stories to ourselves. In 1967, acclaimed literary theorist Professor Frank Kermode published a seminal book called The Sense of an Ending: Studies in the Theory of Fiction. He argued that we all internally write the fictions of our lives into a coherent pattern so things appear to have a logical beginning, a middle and an ending. We do this for one simple reason: to make it possible to \"coexist with temporal chaos\" and to \"humanise the common death\". This philosophical insight inspired the 2011 Julian Barnes novel of the same name that is now adapted in the film The Sense of an Ending (2017). Joining these dots help us to understand what this film is about.<br><br>The film plot is simple but the story complex. Retired divorcée Tony (Jim Broadbent) is known as a curmudgeon by his ex-wife Margaret (Harriet Walter) and daughter Suzie (Michelle Dockery). He busies himself in his tiny shop selling second-hand Leica cameras when one day a lawyer's letter arrives that reopens memories of his first love. What follows is a jigsaw of glimpses into an old man's obsessive quest for redemption as he becomes haunted by an act of spite that he believes led to the suicide of his best friend. When he renews contact with his first love Veronica (Charlotte Rampling) he must confront unresolved emotions that were buried beneath the fictions he has constructed about his life.<br><br>This slow and serious film is not for everyone. Younger people are too busy making memories to be rewriting the story of their lives. Older audiences will recognise what Tony is experiencing and empathise with his need for a 'sense of an ending'. Despite the film's stellar cast and fine acting, none of the characters are especially likable, so it is possible to leave this film disengaged with the people while having been thoroughly immersed in the story. This is a well-directed dialogue-driven film. Its multiple flashbacks capture the disjointed half recalled fragments that many of us store as life memories. Most of all, it is an introspective and insightful essay on how we make sense of our lives.","user":"CineMuseFilms","rank":[46,47]},{"title":"Telling a life story","rating":7,"date":"16 March 2017","review":"Greetings again from the darkness. In 1967 Cat Stevens wrote \"The First Cut is the Deepest\" and the song has since been recorded by many artists (including Rod Stewart and Sheryl Crowe). The song's title is also an apt description of director Ritesh Batra's film version of the popular 2011 novel from Julian Barnes. It's one man's look back at the impact of his impulsive actions more than 50 years ago.<br><br>\"When we are young, we want emotions to be like what we read in books\". So says the narrator and lead character Tony Webster (as played by Jim Broadbent). Tony runs a tiny second hand camera store (specializing in Leica models) while leading a mostly benign life – rising daily at 7:00am, coffee with his ex-wife, and periodic errands for his pregnant daughter. One day a certified letter arrives notifying him that he has been named in the Last Will and Testament of the mother of a girl he dated while at University. And so begins the trek back through Tony's history and memories.<br><br>Of course, a film version can never quite cut as deeply as a novel, but this preeminent cast works wonders in less than two hours. Curmudgeonly Tony is accessible and somewhat sympathetic thanks to the stellar work of Mr. Broadbent, who always seems to find the real person within his characters. Harriet Walther (\"The Crown\") turns in a tremendous performance as Margaret, Tony's most patient and quite wise ex-wife. Michelle Dockery (\"Downton Abbey\") is their pregnant 36 year old daughter Susie, and just these three characters could have provided a most interesting story. The film's best scenes feature the comfort and familiarity of a once-married couple, as Tony and Harriet talk through previously never mentioned topics. However, there is so much more to explore here as Tony's thoughts bring the past splashing right smack dab into the present.<br><br>Billy Howle does a nice job as young Tony, an aspiring poet, who falls hard for the enigmatic Veronica (Freya Mavor). Complications arise when Tony spends a weekend with Veronica at her parents' estate. It's here that Emily Mortimer energizes things (and clouds thoughts) with minimal screen time as Veronica's mother. It's also around this time where new student Adrian Finn (played by Joe Alwyn of Billy Lynn's Long Halftime Walk) captures Tony's imagination and a friendship bond is formed  only to be later shattered in a most painful manner.<br><br>There is so much going on that director Batra's (The Lunchbox, 2013) low-key approach is often misleading. Looking back on one's life can lead to the twisted version that our mind has edited/revised in order to make things seem better or worse – definitely more colorful – than they likely were at the time. Tony's distorted view of history crumbles when documented proof of his actions is presented at his first face to face meeting with Veronica (the great Charlotte Rampling) in five decades. It's at this point that regret and guilt rise up, and the only question remaining is whether this elderly man can overcome his repressed emotions and self-centeredness in order to make the best of what time he has left. Each of us has a life journey, and though few of us ever actually tell the story, there are undoubtedly numerous lessons to be had with an honest look back.","user":"ferguson-6","rank":[57,65]},{"title":"\"The Sense of an Ending\" is a relatable, entertaining and thought-provoking character-driven drama.","rating":8,"date":"24 March 2017","review":"We all reminisce. Older people have more to mull over than their younger counterparts, but we all do it. To what extent are our memories accurate representations of what actually happened? And how do the things that we forget, choose to leave out or just misremember affect how we view our past – and our present? These are the kind of questions the British drama \"The Sense of Ending\" (PG-13, 1:48) so eloquently and engagingly poses. Based on the 2011 novel of the same name by famed British author Julian Barnes (who won the prestigious Man Booker Prize for the book), this film has the potential to entertain all Movie Fans – and give them plenty to think about, regardless where they are in their lives, but those contemplations will vary depending on the stage of life they occupy at the moment.<br><br>Tony Webster (Jim Broadbent) is a disagreeable, semi-retired 70-something curmudgeon living in London. He used to make his living as a doctor, but now he owns a small vintage camera shop. Tony is long divorced from Margaret Webster (Harriet Walker), but they remain quite friendly, mutually supporting their pregnant single daughter, Susie (Michelle Dockery from TV's \"Downton Abbey\"), and sometimes meeting to discuss their lives over a spot of tea. Obviously comfortable (if not entirely happy) living out the narrative of his life (as he sees it), Tony is about to be shaken out of his complacency.<br><br>Dr. Webster receives a letter informing him that he has been bequeathed an old diary by the recently departed mother of his college girlfriend. Questions abound. Tony wants to know whose diary it is. When he tells his ex-wife about the letter, she's curious why the mother of a long-lost love would be leaving him anything in her will. As Tony struggles with the family's lawyer to get his hands on the diary (or at least get some answers), he begins telling Margaret stories from a past that he has never before shared. She gets frustrated when she senses that he isn't telling her the whole story, while the audience is left to wonder what he's leaving out, why he's leaving things out and if he even realizes he's doing it.<br><br>Tony's story slowly unfolds (and is later revisited and built upon) in flashbacks throughout the movie. As a young man, Tony (played during his school days and college years by Billy Howle) begins dating the young, fetching and quirky Veronica Ford (Freya Mavor). As they figure out how they really feel about each other and where their relationship is going, Tony spends a weekend at her family's country cottage, where Tony hits it off with Veronica's mother, Sarah (Emily Mortimer). Eventually (not a spoiler – it's in the theatrical trailer), young Tony's best friend, the very intelligent but very maudlin Adrian Finn (Joe Alwyn) emerges as a rival for Veronica's affections. As a mystery unravels both in old Tony's rearview mirror and in his present, he finds old Veronica (Charlotte Rampling) and demands answers.<br><br>\"The Sense of an Ending\" is a relatable, entertaining and thought-provoking character-driven drama. This impressive collection of English thespians all give heart-felt and layered performances, while Nick Payne's script and Ritesh Batra's direction sensitively and insightfully develop the story, but still leave room for individual interpretations. How a person sees this film will have as much to do with his or her age, perceptions and individual experiences as the story itself. And when all is said and done, the film's ending still leaves room for discussion among Movie Fans. Rather than a clearly defined ending, we get the sense of an ending. Or is it a beginning? It's for each of you to decide for yourselves. Getting there does require you to go along for the ride on a slow-moving cinematic train, but it's well worth the journey – especially since you may be surprised where you end up. \"A-\"","user":"dave-mcclain","rank":[40,46]}]