[{"title":"Tom-Yum-Goong Ong Bak The Karate Kid Bloodsport et al","rating":3,"date":"16 May 2016","review":"I do not want to write another word, methinks the title of this review is sufficient to suggest the long and short of it. However, I must write something sizeable for IMDb to publish it . So here it goes.<br><br>Tiger Shroff flaunts his impressive martial arts skills in this unimaginative and highly unoriginal action movie. There is no depth to any character and everything conveniently revolves around either action sequences or cheesy romantic angles. <br><br>The viewer doesn't have a clue why the story progresses the way it does . If the script is weak and worn out so is the screenplay. <br><br>However, there is a silver lining in this all-the action sequences. The movie is this respect is a homage to Chinese martial arts cinema.<br><br>Given he fact that I do not expect mainstream Bollywood to dish out original strong stories, I abstain from commenting further and would advice you to watch the movies mentioned in the Title of this review to gain further insights on the issue.","user":"lediscipledessocrates","rank":[15,19]},{"title":"Monkey can Jump too!!!!","rating":1,"date":"23 December 2016","review":"Straight words: Monkeys can jump too, but they won't make a movie!!! Tiger Shroff's agility is commendable but just doing the same thing as Tony Jaa, is a bit too redundant and he was not as sharp as Tony. The movie was such a copy, it will put a photocopier in utter disgrace!!!<br><br>Fights had same old round house kicks and some, it seemed, figure skating moves, specially bouncing off of the wall was like the figure skating queen doing a jump in the air.<br><br>The story was a garbage. It was as if the producer got a man who can do a lot of kicks and so he thought why not throw in some paragraphs from here and there and voila!! There is this Baaghi movie!!! Tasteless!!! I won't recommend wasting 2 hours on this pile of cow dung. Just see a few trailers and you will enjoy what Shroff has to offer. No need to waste time.","user":"tmashuk","rank":[5,6]},{"title":"Tiger Shroff should look for some other profession.","rating":1,"date":"16 June 2016","review":"Okay, So where to start from. <br><br>Story - 1/10 (full of cliché, unrealistic and cringe-worthy settings, romance and drama).<br><br>Acting - 0/10 (Okay, this is my favourite part. HOW IN THE HELL is Tiger Shroff an actor ? His acting is as good as a wooden stick. Goes to show that how big impact can Surname make in bollywood. And let's not talk about Shraddha Kapoor, literally same attitude and acting in every movie. You can cut out her scenes from any other movie and paste in this movie, you would never notice the difference). <br><br>Fighting scenes - 3/10 (Now some people are saying that this movie did good at what it was supposed to do. Not really. It was average at best.)<br><br>Overall - 1/10 (The movie is full of clichés, VERY VERY cheap romance and songs, every other person showing off their pecs and abs. Tiger Shroff should really look for some other profession. There are countless number of struggling actors who can act million times better than him. Only positive thing in the movie is fighting sequences, which aren't as good as people are saying. Average at best.)","user":"arunrathee411","rank":[16,26]}]