[{"title":"Interesting subject matter but flawed execution","rating":5,"date":"28 April 2017","review":"I like psychological science fiction movies, so I'm probably going to be more generous with my review than the average person would be. I feel like the material involved here has the potential to be a good. The acting and production quality are generally acceptable and fairly typical for a lower budget movie. Probably where the film suffers the most is with the editing. It makes the pacing slow and the plot goes in circles repeating things that have already happened or that don't really drive the plot forward. Some things also made me cringe, in particular the older pervert who uses trickery in attempt to seduce the younger woman who purportedly works for him. Overall the movie is definitely not as engaging as it could be, but it's not a complete disaster either, it's the sort of movie that I just watch casually because I am interested in the genre. But there are definitely better movies in this category such as 'Get Out'.","user":"franklindf","rank":[6,6]},{"title":"\"The Holly Kane Experiment\" Fails to Achieve Primary Endpoints","rating":4,"date":"12 April 2017","review":"You're likely familiar with the phrase \"slow as molasses\". But I'm willing to bet you're not as hip to the one that goes \"slow as 'The Holly Kane Experiment'\". Well, friends, consider yourself formally initiated. Good GRIEF this British flick wasn't just slow, it was damn near STAGNANT! <br><br>Ambitiously promoted as a \"Twisted, Cerebral, Sexy Thriller\" this snoozefest is accurately described by exactly ZERO of these adjectives aforementioned. If you'd be generous enough to indulge, allow me to break it down word-for-word if I may. And I PROMISE this won't take long.<br><br>\"Twisted\". This seems to imply that we can expect senses scrambling, reality wrecking, psychedelically spectacular fun, right? Oh my, how wrong we would be. Incredibly, NONE of this brain-blowing behavior occurs to any meaningfully effective degree AT ALL during the course of the over hour and a half we must keep our eyes pried open to finally reach the end of this moronic marathon. However, if the mood should strike to indulge in such far out and freaky fare then be advised to scope out 1980's \"Altered States\" instead. Oh, woooowww. Trip you out, man.<br><br>Pressing on, did somebody mention \"moronic\"? Perfect, as that now leads directly into our next egregious marketing misnomer, \"cerebral\". The preposterous premise presented here of mind control and the reprogramming of the human subconscious is nothing more than mindless mealy-mouthed manure that is both atrociously articulated and then repeatedly recycled ad nauseam until our noggins are nefariously numbed.<br><br>And finally let us explore the woefully weak excuse for what evidently is intended to pass for \"sexy\" during this miserably misguided misadventure in motion picture making. If a creepy cuss in his '70's arriving at climax with a dazed damsel in distress in the time it takes to describe such, and a pathetically pandering perspective of a straight razor roaming over a beleaguered babe's bare breasts are supposed to elicit erotic emotion within, then......yeah......try again, guys. On second thought, please DON'T.<br><br>\"The Holly Kane Experiment\" ranks as one of the more rank examples on record of the most minuscule germ of an idea exploding into an entertainment-empty epidemic of......what shall I call it......hmmm? <br><br>I GOT it.........<br><br>Eeeccchhh.","user":"jtncsmistad","rank":[57,82]},{"title":"Decent idea","rating":4,"date":"11 July 2019","review":"Decent idea, plodding execution. The movie needed so much more editing. It just went on and on.","user":"smolsoft","rank":[2,3]}]