[{"title":"Find this movie. See it.","rating":10,"date":"12 November 2016","review":"Within 5 minutes of the beginning of this film, my wife leaned over and whispered, \"I love this film.\" I had just been thinking the same thing. \"Burn Your Maps\" is incredibly well written, acted, and directed. You don't realize in the first 5 minutes that the director is going to take you on a journey that will skillfully stir so many emotions, but that is exactly what Jordan Roberts does. The characters, brilliantly portrayed by Vera Farmiga, Jacob Tremblay, and others, are all lost in their own way and spend the film journeying to find themselves and to be found by others. Movies that touch on so many emotions can often seem manipulative of the viewer. Not this one. That's where \"Burn Your Maps\" really shines. It is incredibly crafted to take you on the journey. I'm usually really time sensitive on movies, very aware if parts seem to drag or are uneven. Honestly, I have no idea how long this movie lasted. From those first five minutes through the closing credits, I was immersed in the story that kept me at a pleasing state of \"feeling\". Go see this movie. You'll be glad you did.","user":"farrago510","rank":[31,45]},{"title":"All I want is to watch this movie again...","rating":10,"date":"9 September 2018","review":"Like other reviewers here, I saw this movie at TIFF in 2016 and it has stayed with me since. It is an exceptional story with brilliant performances. I check this page every so often to see if it's picked up distribution. DEAR NETFLIX: please please please acquire the rights to this movie so I can see it again!<br><br>This is my first ever IMDB review.... that's how much I need to see this movie again.","user":"kelseyarob","rank":[16,27]},{"title":"Finding out who you really are","rating":10,"date":"18 October 2017","review":"\"Burn Your Maps\" is one of those perfect films, a rarity in today's market where too many films leave you feeling nothing. Not so with \"Burn Your Maps.\" The story alone will stay with you for many heartbeats. In fact, you'll probably observe that many adults are not as intuitive or as open as Wes, 9 years old, and one of the main characters in the film. I rarely rate a film as 10, but the acting, the writing, the directing and the cinematography all come together and create a wonderful cinematic moment that will resonate with the viewer forever.","user":"fubs-22-609005","rank":[16,28]}]