[{"title":"Nice effort, but not that much","rating":4,"date":"21 October 2018","review":"Executive summary: not a waste of time, but you won't missing a thing if you don't watch this one.<br><br>If you are a movie buff, I challenge you to the following exercise:\n1. watch this movie,\n2. imagine making this movie in the 1970's, with no digital cameras, no digital editing tools, no digital post-production with no Kodachrome preset...\nAlmost every good thing in this movie is borrowed from someone else, or is accomplished only through technical means.\nDon't get me wrong: anyone can see that this is a movie made by talented people. But it fails to bring anything new or remotely remarkable. I guess the main problem is the plot: it's as thin as a stripper's g-string.\nThe acting is good, but just enough. The script is good, but just enough. The dialogue... not enough. The characters... not enough.\nThe only notable thing in this movie is the stunning beauty of the supporting actress.","user":"carlos-pires","rank":[6,10]},{"title":"Queen Mary, or \"what goes down on the Boulevard\"","rating":6,"date":"24 October 2018","review":"The titular Queen of the titty-bar, wizened beyond her years, Mary weaves an eccentric path through the day of her 60th birthday; a day on which she will revisit the past, engage the present, and reflect on the future. Taking its aesthetic and cinematographic queues from 60s and 70s (X)ploitation films, Queen of Hollywood Blvd maintains a coherent style, meandering through familiar and sleazy genre-appropriate tropes, imagery and lines at a syncopated but languorous pace.<br><br>Whilst derivative, it maintains interest throughout its run-time, chiefly through the colour and texture of its main character, and that of its key supporting cast. The film's greatest asset is also its greatest weakness; Rosemary Hochschild's Queen Mary is given to moments of uneven delivery, more like momentary character-drops than revealing idiosyncrasies. This issue, which could have been recovered in the editing suite, as well as the similarly easily-remedied (and brief) problems with overall cinematic cadence, is where Queen of Hollywood Blvd loses points. Pulp Fiction this film is not, but TQoHB is still an entertaining ride worth your time, if you have some to spare.","user":"troy-boulton","rank":[4,6]},{"title":"Intriguing...","rating":5,"date":"8 May 2019","review":"On her 60th birthday, the owner of a Los Angeles strip club finally has her twenty-five-year-old debt to the mob called in, leading to a horrific spree of violence and revenge throughout the seedy underworld of Los Angeles.<br><br>Rosemary Hochschild's performance as Mary is the real reason to watch this film. The mother of director Orson Oblowitz, she owns the screen every single time she stalks the screen.<br><br>The film starts with Mary's 60th birthday. All she wants is a simple celebration, but fate has different plans as the mob soon kidnaps her son as part of the debt that she must pay. Soon, she has issues with the club and Grace, a girl sold to her as a dancer. She sees something of herself in the girl and wonders how she can help her become free.<br><br>While awash in neon, this is a dark film that grows darker with each moment. It telegraphs the grim fate of its protagonist right in the beginning and rams that fact back in your face at the close, still surprising you even though you know what's coming.<br><br>If you're the kind of person that enjoys adult films, keep your eyes open for appearances by Charlotte Stokely, Asphyxia Noir and Holly Hart.<br><br>This is the last movie of Michael Parks and features the music that Bobby Beausoleil - yes, the Manson family member - intended for Kenneth Anger's Lucifer Rising.","user":"BandSAboutMovies","rank":[1,1]}]