[{"title":"Not Your Typical War Hero","rating":7,"date":"11 June 2017","review":"Part way through I began to feel the story was a bit slow moving, maybe a little flat. I realized this is not an indictment of the film, but of Americans' movie going habits. Everything these days is a blockbuster - LOTS of action, tons of special effects, one- dimensional super hero characters. Megan Leavey is a quiet, understated film about real life and real people, and they are not always pleasant, exciting or interesting. If you like your war heroes shiny, perfect and larger than life - this film will not be for you. Megan Leavey is about a flawed, troubled, not very likable young woman who joins the Marines with no heroic idealism - she is just looking for an escape from her miserable life - made so very much by her own doing. And Rex is not Lassie. There is no instant, feel-good bond between a girl and her dog. Rather, the story illustrates the importance of showing up - taking one step at a time, and that with hard work and patience - redemption and second chances are possible. Not an easy feel-good film but worth the effort, as is true of most important things in life.","user":"scatswalsh","rank":[34,45]},{"title":"Very enjoyable exploration of emotional bond between a human and animal","rating":9,"date":"21 May 2017","review":"I really enjoyed this film. It explores the emotional bond between an animal and a human being.<br><br>The film is based on the true story of marine corporal who forms a unique bond with a bomb-sniffing dog. Megan Leavey (Kate Mara) enlists to get away from what seems to be a hopeless civilian life. She is an aimless young woman with a deadbeat mom, Jackie (Edie Falco). Megan struggles to fit in as a Marine and, after a disciplinary hearing due to misappropriate behavior, is caught urinating outside of the Provost office after a night of drinking. She is assigned to clean up the K- 9 unit under the command of Gunny Martin (Common). Gunny Martin is a commander who uses tough love while being a mentor. <br><br>My favorite scene in the movie is when Megan finds out that she will get a dog to train and it turns out to be a can. It seems that newbies practice training a dog with a can. It is a bit humorous but shows Megan's determination to get a real dog. Megan bonds with an aggressive German shepherd name Rex and is given the opportunity to train him. Megan and Rex end up completing more than 100 missions, but an IED explosion injures them both and puts their fate in jeopardy.<br><br>Megan Leavey has lots of wartime violence, strong language and intense themes including trauma and grief. It also shows the strength of women and their accomplishments while not focusing on the brutality of war. This is an inspiring film that I believe is most suited for ages 13 to 18 as well as some adults. I give this film 5 out of 5 stars. It opens nationwide June 9, 2017 so, be sure to go see it and learn what happens to Megan and Rex. <br><br>Reviewed by Juanita Seon L. KIDS FIRST! Adult Juror.","user":"rannynm","rank":[66,95]},{"title":"\"Megan Leavey\" is a solid and touching, but slight movie.","rating":6,"date":"11 June 2017","review":"\"Megan Leavey\" (PG-13, 1:56) is technically a bio-pic about a U.S. Marine serving as an MP during the Iraq War, but what it's really about is that Marine's relationship with her partner, a military working dog named Rex. Throughout history, militaries, such as the Egyptians, Greeks, Persians, Britons, Romans and Americans, used canines in a variety of roles, such as in combat as attack dogs, and as hunters, trackers, searchers, scouts, guards, sentries, messengers, mascots and therapy dogs. Military working dogs in K9 units are assigned a specific handler, with whom the dog bonds, trains, serves and, when necessary, protects. The special relationship between such dogs and their handlers has been portrayed in various forms in movies like 2017's \"A Dog's Purpose\" and 2015's \"Max\", which mirrors the real-life story of a dog named Lex, who went to live with the family of his handler after the handler was killed in Iraq. An increasing number of military working dogs are adopted by their handlers after the military deems the dogs' military service complete and retires the dog from active duty, but it hasn't always been that way. \"Megan Leavey\" is the true story of a U.S. Marine's bond with her dog and her long fight to adopt him.<br><br>Megan (Kate Mara) was drifting. After high school, she had no purpose in life. She lived with her mother (Edie Falco) and stepfather (Will Patton), but didn't actually do much of anything, especially after her best friend died from a drug overdose. Seemingly on a whim, Megan joins the Marine Corps. After she completes basic training, she is trained as an MP, but her lack of self-discipline is still a problem and she quickly gets in trouble with her commander. Her punishment (or \"corrective training\", as the military calls it) is to work for a hard-nosed Marine called Gunny Martin (Common), cleaning out the kennels of the military working dogs. Megan develops an interest in the K9 unit, but she has to convince Gunny Martin of her reliability and dedication, so she is given an ammo can attached to a rope which she is forced to pretend is a dog on a leash that she puts through its paces on a K9 training course. When a handler preparing for deployment is bitten by his dog, Private First Class Leavey is ordered to step in.<br><br>With little time left before that scheduled deployment to Iraq, Megan works hard to train up, complete Rex's training and bond with her new partner. Rex is known as a very difficult and aggressive dog, but Megan manages to tame the savage beast and they end up making an effective and respected team while serving in combat. Megan and Rex are called upon to patrol ahead of everyone else in an effort to find IEDs before they can harm American troops. After some success, Megan and Rex get separated. She begins to work tirelessly to find Rex and, ultimately, to get permission to adopt and care for him. In the midst of all this, Megan works through challenging relationships with Gunny Martin, a K9 unit mentor (Tom Felton), a flirty fellow dog handler (Ramon Rodriguez), her clueless mother and stepfather and her birth father (Bradley Whitford), but all the while, Megan's biggest concern is her relationship with Rex.<br><br>\"Megan Leavey\" is a solid and touching, but slight movie. The script by Pamela Gray (\"A Walk on the Moon\"), Oscar nominee Annie Mumolo (\"Bridesmaids\") and Tim Lovestedt (co-writing his first film), and the direction of Gabriela Cowperthwaite (\"Blackfish\"), give us a realistic look at military life and combat deployments, while keeping the focus mainly on the affecting relationship between Megan and Rex. The subplots of Megan's human relationships give us a good picture of who she is as a person and are well-balanced from a story-telling perspective. But in the final analysis, this is still \"just\" a story about one Marine and one dog, presented as if similar situations had not happened before or since (which they have). The writing, acting and directing are all strong and produce a film which many Movie Fans will appreciate, especially those interested in military life and those who love four-footed heroes. \"B\"","user":"dave-mcclain","rank":[42,63]}]