[{"title":"As memorable as my first teeth cleaning","rating":3,"date":"25 October 2018","review":"This made for television movie is listed as a \"Thriller\" genre but in reality it should be rated as \"a waste of time\". There is little mystery as to the reasons why murders and missing girls seem to follow Ellie around. I guess the suspense is supposed to unfold as the cheerleader Ellie (Samantha Boscarino) decides to travel by car to remote sites all by herself as she tries to play our amateur sleuth. Such corny writing that even the dumbest movie viewer can see through the directors blatant attempt at creating suspense when what is really happening is a flagrant abuse of some cheap background music to try and keep our attention.<br><br>Nothing to see here. I rate this made for TV film a 3 out of 10, and hopefully there will not be a sequel.","user":"Ed-Shullivan","rank":[2,2]},{"title":"Quite a high body count for Lifetime","rating":6,"date":"15 September 2019","review":"A girl believes she is cursed because her sister and father were killed by her sister's ex boyfriend. Years later her cheerleading freinds are snatched and one is murdered. There is quite a lot of violence for Lifetime. It's fairly invovling to see who the murderer is. The actress is alright.<br><br>Ok for one watch.","user":"phd_travel","rank":[1,1]},{"title":"Easy on the Eyeliner","rating":4,"date":"29 April 2016","review":"Here's the set-up Startlingly full-figured 13-year-old Samantha Boscarino (as Ellie Davis) thinks she is cursed. A van full of partying cheerleaders apparently crashes. Next, a young man appears to expire at a party. Finally, another young man enters Ms. Boscarino's house and shoots half her family. The last shot occurs off camera. That could be a suicide, or an unseen family cat. The important part of what you saw in the opening minutes was the murder of Boscarino's father and sister. The other stuff is part of the curse. Three years later, Boscarino is a sweet 16-year-old high school student. Her cheerleader friends mysteriously disappear and it seems like the curse has returned to frighten Boscarino and quite possibly take her life...<br><br>The words \"Inspired by True Events\" introduce this TV movie...<br><br>It does not seem possible that a real \"curse\" was at work here and the story offers no evidence. Now and then, a dead character seemingly offers support. Possibly, the curse and its connection to a ghost or imaginary character were clearer in writer Matt Young's original story. Director David Jackson, with Eric Potter's editing, moves \"The Cheerleader Murders\" around by artfully positioning characters into scenes with surprise and relating events with quick inter-cutting. There is very little to warrant this attention, however. Boscarino is very attractive. Her boyfriend Austin Lyon (as Nicholas \"Nic\" Ryder) is stable (until his final scene). Devin Crittenden (as Ben Forester) is sufficiently creepy, but you may be better off watching the eyeliner.<br><br>**** The Cheerleader Murders (4/9/16) David Jackson ~ Samantha Boscarino, Austin Lyon, Tessie Santiago, Devin Crittenden","user":"wes-connors","rank":[2,4]}]