[{"title":"I get the feeling that this is actually trying to take itself seriously...","rating":2,"date":"20 June 2019","review":"If you want to know what \"intense\" truly means, then, by all means, do subject yourself to this painful ordeal and when the runtime clock hits the 1h08m mark, keep. Your Eyes. On Jason. London because there is some edge-of-your-seat quality, method-nodding acting happening right there and your mind will be blown and, I mean... you're welcome?<br><br>To save you the trouble: Yes, there is no need to judge me for wasting my life reviewing this crap on top of watching it, to begin with. I judge myself aplenty.<br><br>Forgive me, Godard, for I have sinned.","user":"pauliecorleone-72628","rank":[9,12]},{"title":"Absolutely terrible movie.","rating":27,"date":"27 June 2019","review":"In summary, avoid watching this at all costs, if I could take back the time I spent watching it I still wouldn't - because I have sacrificed it for any of you who happen to read this review.","user":"psxexperten","rank":[5,8]},{"title":"Enjoyable Exploration Film","rating":10,"date":"4 July 2019","review":"Marriage Killer is another successful movie by Concord Films! As couples sit at home watching television, there are more than will admit to having wondered about the experience of \"members-only night clubs.\" This film is a voyeuristic journey into the complexities of introducing a bit of \"spice\" into a marriage that has become somewhat routine.\nThe actors are long time favorites including the handsome and relatable Jason London, charming and beautiful Barbie Castro, and the sexy troublemaker played by Kristen Renton.\nThis is an entertaining film, with emotional drama and a suspenseful undertone. I would HIGHLY RECOMMEND watching Marriage Killer to anyone who would like an escape from their daily routine, and enjoy the opportunity to be drawn into a dramatic story.\nThe film quality, cinematography, and acting are all top notch.\nEnjoy the film :)","user":"debkanemasu","rank":[2,3]}]