[{"title":"I'm A Grown Man And I Literally Cried!","rating":10,"date":"16 February 2016","review":"We Americans have a lot to learn from other cultures. Most Americans think they are \"the best\" in the world - IN EVERYTHING - AND THAT'S UTTER NONSENSE! It's a form of social control used by various elites to keep the average American from knowing what is possible with the great wealth and power our country has accumulated. We have been brainwashed into taking crumbs and believing that's all we deserve from our society.<br><br>We are also deliberately kept ignorant about the rest of the world and how much better many countries treat their citizens - since our school systems pretend that most of the world outside of Mexico, Canada and a few large countries in Europe and Asia - simply doesn't exist. It outrageous. We are such fools! <br><br>I'm an extremely well-informed person and I didn't even know about half of what Michael Moore mentioned in his film! I can only imagine all the dunderheads out there who have never even heard the names of some of the countries mentioned in Where To Invade Next! Be curious about the rest of the world. It has a lot to teach us!","user":"interestingfunstuff","rank":[122,145]},{"title":"Brilliant","rating":10,"date":"23 December 2015","review":"Just like Mr. Moore's previous works, brilliant, raw and based on the truth and statistics. The contrast was overwhelming and sickening but he finished it on a positive note. That if only we realize we, the people, realize we have all that it takes, we can bring the wall down, one hammer and chisel at a time. But as one of the guys in the movie said we have \"a long way to go\". He covered all the relevant issues of our today's society, from women's equal pay to nutrition, from student loans to bankers getting away with murder, from criminalization of drugs and its connection to race to police brutality, from an overworked and underpaid society to disappearance of middle class, from capital punishment to mistreatment of the incarcerated, and more....It is eye-opening and educational, to say the least and makes you wonder why we we \"go home and are okay\" with all of this. Because \"nobody should be\".","user":"izadifar","rank":[124,151]},{"title":"American exceptionalism may not be as exceptional as people think","rating":8,"date":"4 March 2016","review":"If you are at all interested in six weeks of paid vacation, an extra month's salary and a two-hour lunch break, you just might have to go to Italy to find it. Filmmaker Michael Moore (\"Capitalism: A Love Story,\" \"Sicko\"), a welcome voice for sanity, returns to the big screen in his first film in seven years to tell us that perks like this exist, just not in the United States. His latest documentary, Where to Invade Next, is a satiric look at what much of the world has to offer that is not available here. Underneath all the wit, however, the film has a serious purpose, calling our attention to what works and what doesn't work in society, regardless of what may be considered the \"right\" thing to do and the label you might put on it. In simple terms, so-called American exceptionalism is often not as exceptional as most people think.<br><br>Though the title of the film may suggest an exposé of the government's penchant for endless war, Moore has something else in mind. His intention is to show how other nations treat their citizens in the workplace, schools, and prisons, including their attitudes towards women and sex, leaving it to the viewer to make comparisons. In the opening scene, a tongue-in-cheek Moore is summoned to appear before the Joint Chiefs of Staff to offer his advice on how to stop losing wars. His suggestion is to allow him to conduct the invasions from now on, pledging to do better. Taking his camera crew to Italy, France, Finland, Slovenia, Tunisia, Portugal, Iceland, and Germany, he interviews workers, teachers, students, CEOs, government officials, and ordinary folks who tell him about the advantages they have.<br><br>When he departs the country, he makes sure to plant the American flag to signal his success in stealing its ideas. Though Moore's bewildered, \"are you kidding me?\" shtick becomes a bit tiresome by the end, it mostly suits the \"wow\" nature of what he uncovers. In Italy, the wide-eyed director can only shrug his shoulders when he hears from young workers that they have thirty to thirty-five paid vacation days a year, not including holidays, paid maternity leave, or a paid honeymoon. Seeking an explanation for this, he turns to the CEO of a motorcycle company who tells him that the happier the workers are, the more production they achieve and hence the more profits for the company, though Moore does not discuss the overall economic problems of the country.<br><br>In France, Moore teases us by taking us to what he calls a gourmet five-star restaurant in Normandy only to reveal, much to our calculated astonishment, that we are in a typical school cafeteria that serves five-course meals, planned each month by the school and city representatives. Eating with the students, he offers one girl a can of coke but is summarily rebuffed. In looking at Finland's school system, Moore discovers that students have no homework and more free time to socialize and enjoy time with their families. He learns that Finland has no private schools so that the community is dedicated to making the public schools work.<br><br>According to Moore, Finland's school system has risen from the depths to become number one in the world.<br><br>From there we travel to Slovenia (not to be confused with Slovakia) which has a free university system, especially inviting for foreign students, to Germany where factory workers toil 36 hours a week while being paid for 40 hours. Oh, yes — if they get too stressed, they can go to a spa at company expense to work it all out. Pausing for a serious look at how one country deals with its unpleasant past, Moore explores how educators and students confront the Holocaust in Germany, even though it is uncomfortable to face.<br><br>In Norway, we see how prisoners are treated as human beings, even mass murderers like Anders Breivik, even though Breivik has threatened to go on a hunger strike because of what he claims are \"deteriorating\" living conditions — isolation from the other inmates and allowing only contact being with health care workers and guards. While the energy sags a bit in the last two segments in Portugal and Iceland, Where to Invade Next delivers a sharp, meaningful message though not as impactful as Moore's earlier work. Contrary to his critics, however, it does not disparage America, but suggests that a great people can be even greater if they are willing to learn from others.","user":"howard.schumann","rank":[56,69]}]