[{"title":"Pleasantly surprised with this one...","rating":7,"date":"29 July 2017","review":"I've learned the hard way as to just how defeating it is to get your hopes up about modern day horror films(and that goes for b-movies, as well as for the big budget Hollywood films).. The let down is bad, and its exactly why I've learned to curb my enthusiasm in regards to upcoming horror films. <br><br>This low budget indie was quite enjoyable and I found much entertainment in watching it last night. I, unlike so many others, am actually a fan of the supernatural horror sub-genre that deals with a lot of the paranormal themes including ouija boards, seances, and even hauntings/possessions.. This indie had all of that and more.<br><br>Was it a thrill ride? No, but it was entertaining and yes, I will actually watch it again at some point in the future (IMO, always a tell-tale sign of a good horror film is if it holds up in repeated viewings).","user":"jswindter01","rank":[23,29]},{"title":"Contains Spoilers -Writing and acting subpar","rating":4,"date":"8 July 2017","review":"This could have been a better movie had the writing and acting measured up. To often the acting and storyline seemed forced. This is where I will reveal a small spoiler so please be advised. There is a scene where one friend is locked in the bathroom and has no control of her actions as the friend who is now inhabited by an evil spirit has revealed she plans to kill her. Rather than both the remaining males run to the bathroom and at least attempt to break down the door they merely stand there watching the possessed friend make hand gestures. These forced pauses are throughout the movie along with poor acting just makes this incredibly hard to watch. With all the great content available why waste 90 minutes of your life on this dumb movie. Consider yourself warned!","user":"mtjohnson-61001","rank":[18,22]},{"title":"Disappointing beginning and end of movie","rating":1,"date":"3 September 2017","review":"This is one of those movies that pulls the old did anything really happen? The movie begins and ends with the same scene. We see Jo arriving in her car to a class graduation party. We then move to the party where during the night the usual party games are played. Games like have you never ever,good ole strip poker and of course the ever popular seance, where of course they forget the very important step of making the spirit leave. <br><br>The rest of the movie is a mish mash of unbelievable things happening that have you screaming impotently at the screen trying to get the actors (very weak actors I might add) to have a little common sense.<br><br>Then comes that ending that I despise more than a person should where it ends in a big old circle that makes you wonder why you wasted over an hour or however long this movie lasts.","user":"remotiger","rank":[12,14]}]