[{"title":"A Mess of the Highest Order","rating":1,"date":"11 August 2018","review":"I don't know why my local library stocked this, according to IMDB, hardly anybody has seen it, and I can see why. I don't how to review this total mess of a movie, so I'll just give you a few things that happen, and it is a found footage movie. First of all, the stars Eric Roberts has less than two minutes in the movie, and Tom Sizemore, has less than 3 minutes at the most. Some invading giant parasite has appeared in the Atlantic Ocean, and sends out these little parasites, that either causes peoples head to explode, or the people become zombies. The whole movie is told to us, from a lady that has viewed the tapes, and some kind of book that explains it all, but we, the audience gets no clue what it says. that's enough, the movie makes zero sense, the acting is horrible, and I have no idea where the writers ever got the idea to make this piece of crap. I would really like to know, if anybody else was silly enough to watch this. As I said, it didn't cost me anything, but anybody that borrows it from the library, is going to ask WTF. anyway, 1/5 and that one is for some of the practical effects that were not that bad. Stay way way clear of this trash....","user":"Indyrod","rank":[23,28]},{"title":"skip this one.stiff acting","rating":1,"date":"14 September 2018","review":"Stiff acting. Bad edit, shots, all.\nbad direction..\n B movie that is not campy .\nbore fest. \nsorry to be so negative about it. worth 3 for effort.<br><br>the director must have some connections to have this made, maybe its a sort of demo? but it dosnt show good directing influences or inspiration.","user":"surfisfun","rank":[9,10]},{"title":"Extraordinarily bad.","rating":1,"date":"23 December 2018","review":"Never ceases to amaze me that so much effort and money can be poured into a film for so little. I find it surprising also that Julia Roberts brother and Tom Sizemore are in this. Just goes to show they have no idea until the end of filming what the result will be, maybe they don't care. Best part of this film is the out takes at the end.","user":"sidneygchambers","rank":[5,5]}]