[{"title":"Dark, brooding, ominous.. and the Original title made more sense.","rating":6,"date":"7 December 2018","review":"I went into this with the clear understanding that this was an effort of love by an independent film company.<br><br>The story centers around an unlikely trio of dwarven miners who find themselves trapped in the belt of a mountain and their struggle to survive with limited resources and their own limitations.<br><br>I loved the idea that the movie wasn't about great warriors or dwarven mobility, but rather about a working class dwarf. I was not disappointed.<br><br>I only wish they'd been able to work in more dwarven detail into the mine. Pillars, runes etc","user":"matthewlitton","rank":[11,14]},{"title":"My Review Of \"Dragon Mountain \"","rating":4,"date":"18 August 2018","review":"Raney's film is well produced, straightforward and engaging as far as writing and character development. He offers a potentially captivating story-arch, focusing on these characters and their dire situation as they struggle to survive in a subterranean \"prison\". The atmosphere is ominous and suspenseful with plenty of opportunity to excite and build a thrilling story. For the most part, though, we are only teased mildly, with little gratification. <br><br>\"Dragon Mountain\" is filled with a lot of missed opportunities to become the titillating watch that the synopsis suggests. First, no dragons- well a really cool fly over the mountain chain by a quality CGI lady heading to her den takes place in the opening scene. But that is it- technically the dragon is eluded to a couple of times through dialog. Beyond that the movie pulsate as a character study of crises. <br><br>There is fantasy, but subtext and suggestion reigns supreme to get you there. The dwarves are recognizable and familiar. They take the main stage in Raney's movie, but they could easily be replaced subconsciously with human persons going through this struggle. There is a creature in the tunnels with them and a human in killer Cosplay steampunk gear, however both are little more than cameo characters and missed before they really ever fill the screen.<br><br>Overall \"Dragon Mountain\" is kind of a let down. Toss aside the fact that 'no dragon' in a movie whose title sells you on dragons. Forgiven. With the actual story- four guys trapped in a clasped mine- the writing and acting is top notch. The cinematography is okay, lighting issues plague crucial moments that were necessary to amp up the entertainment value. Unfortunately it all boils down to bad moods, grumpy dialog and emotional anxiety between disgruntled workers that seems to put a drag on the fluidity of the movie's pace, making it a rather boring movie.","user":"ASouthernHorrorFan","rank":[9,15]},{"title":"Perfect combination of skills that can not be quantified by \"budget\"","rating":9,"date":"23 July 2018","review":"Money can't give you an aptitude to excel in a skill, in short, \"talent\". Talent in writing, talent in acting, talent in setting up character-centered scenes. The word \"budget\" becomes meaningless, when your movie's only location is a cave, instead of grand visuals you have to put your faith in the talent of your costume designer, the actors, the writers and they all did a flawless job in this one.<br><br>If you want to turn your brain off to enjoy CGI destruction on a grand scale featuring 2-dimensional characters in an action flick without a hint of anything that makes a story well-written, watch one of those 300+ mil comic book adaptations.<br><br>If you enjoy good acting, well-written dialogue, and in general, movies that are driven forward by their characters instead of CGI city blocks exploding in your face, you will definitely want to give this one a chance!","user":"domonkos-horvath","rank":[15,30]}]