[{"title":"Lovely film","rating":10,"date":"7 December 2018","review":"Really surprised at how much I enjoyed this film. Most Netflix movies are cheesy and predictable, but this one is truly heartwarming. The story is great and the dialogue feels natural. Dolly Partons songs are a real highlight as well, and the message is delivered organically in stead of being shoved down your throat. I would recommend this for a nice Friday film night.","user":"stasiakoroleva","rank":[190,239]},{"title":"If you only watch this for how female friendships are portrayed...","rating":9,"date":"8 December 2018","review":"... that will be plenty. The young (and older) women in this film are supportive and kind to each other. Netflix has plenty of titles where women are enemies (or frenemies), undermine each other, try to get revenge, and are generally nasty in their own selfishness to be fulfilled. It is insulting to me as a women to be portrayed as though I feel like every other female is a competitor in some zero sum game where if they succeed, I lose something. So it's nice to see a film where women are not catty and petty.<br><br>Furthermore, it's great to see a film whose star is not a skinny gal, but in which skinny gals aren't portrayed as horrible people. No one \"type\" is a jerk, except a couple of rando high school guys, but there are plenty of male characters who are lovely. Most, in fact.<br><br>The movie avoids so many tropes typical to all cinema, but especially these Netflix rom-coms.<br><br>1) Put-upon outcast goes crazy and does something harmful. I was truly nervous when Will walked into the alteration room and saw all of the pageant dresses. Many other offerings would have had her trash the dresses to teach her mom a lesson or something, but she was so focused on her love of her late aunt, the whole scene ended up being darling.<br><br>2) Frustrated/confused love interest takes some meantime action on the side. The guy who was interested in Will never wavered.<br><br>3) Speaking of #2, though, the love interest angle wasn't even the most important one. The story is based most prominently on the relationship of Will to her late aunt, and stemming from that, her best girlfriend. And Will's fragmented relationship with her mother. And then the friendships of other high school girls who make up the pool of (eventual) pageant contestants.<br><br>I watched several Netflix original movies during TV hiatus this summer, and many were downright alarming. I wanted to like \"Kissing Booth,\" but in the end, it was a story about two brothers who felt inappropriate possession of a common girlfriend. \"Sierra Burgess is a Loser\" and \"F the Prom\" both had characters who ended up doing horribly mean things, which we are supposed to nod and understand because they felt rejected. I didn't get past the first 30 minutes of \"When First We Met\" or Groundhog Day II or whatever.<br><br>I'm just saying this movie is a cut above most of the Netflix originals, and doesn't have an overarching problematic theme. Definitely feel-good, and you can genuinely like most of the characters.","user":"gatannahfiles","rank":[84,105]},{"title":"warm and perfect","rating":8,"date":"8 December 2018","review":"\"Find out who you are and do it on purpose\" - Dolly Parton<br><br>Damn, Julie Murphy. You wrote every fat girls story. I knew this going into the movie tonight, this cold December night I tucked myself into bed with a box of tissues, some pizza, and my cat. I was prepared. Ready to experience one of my favorite books on the \"big screen\", not to mention all the Dolly and Jennifer Aniston my heart desired. Well, Julie, I cried the entire time, mission accomplished, job well done. The movie is as bright, delicious, and strong as the book, with a little extra sparkle and zhuzh.<br><br>I hope everyone out there takes a minute to think about the fat girl inside of yourself, whatever that means, and think about fondly wishing her luck on her mission to finding out who she is on purpose.","user":"amcedelstein","rank":[127,163]}]