[{"title":"So where is the rest of the film?","rating":4,"date":"15 January 2018","review":"Three American tourists use a mysterious map to find an ancient temple deep in the jungles of Japan. <br><br>Their adventure soon turns into a nightmare when malevolent spirits trap them inside..........<br><br>So the film starts with an interrogation scene featuring someone in a germ safe wheelchair. They are asked to look at some 'found footage' and then the narrative begins.<br><br>Temple had the makings of another perfectly perfunctory found footage movie, but the makers decided to turn this into more of a J-Horror, and the first act is very interesting, there is clearly tension between the two males regarding their mutual ward, but as soon as we reach their destination, that's almost forgotten about, albeit a little argument toward the end.<br><br>The problem is that the film doesn't hide anything up its sleeve, and any horror veteran would know the little boy is just apparition as soon as he is first introduced.<br><br>Then night comes and......... not much happens really. We see something paranormal, then we go back to the interrogation scene, and this takes you away from the main narrative, especially when you realise the person they are questioning was fluent in Japanese all along.<br><br>But the biggest flaw in the film is the ending. Much like The Devil Inside, it just ends, with no real conclusion and it appears that all loose ends remain untied.<br><br>It had potential, but as soon as they reach the titular place, it falls apart.","user":"FlashCallahan","rank":[20,22]},{"title":"It's an unlucky place.","rating":5,"date":"12 September 2017","review":"The film starts with a survivor of a tragedy in a wheel chair telling a story of what happened, including the parts when he wasn't there.<br><br>Kate (Natalia Warner) wants to film rural Shinto and Buddhist temples as part of her research. Her boyfriend James (Brandon Sklenar) comes with her as well as her lifelong friend Chris (Logan Huffman). It takes 30 minutes for them to get to the remote evil temple with a murdered monk, missing children, protected by shapeshifters. Then it takes another 30 minutes for something to happen.<br><br>The drama aspect of this horror film was fairly good. It had the makings of something decent. They made it clear they didn't know how to end the feature, so they just left a confusing mess.<br><br>Guide: sex scene. No swearing or nudity","user":"nogodnomasters","rank":[21,24]},{"title":"When cinematographers direct","rating":3,"date":"3 September 2017","review":"Oh wow guys. This represents Western ignorance? Man, that's deep. I know I've sure never seen a horror movie before where young American idiots ignored piles of blatant warning signs and got themselves killed in the woods by supernatural forces of evil. Thank goodness this brought Japan in to teach us this valuable lesson, especially since they're known for being so respectful of other cultures. Hur hur. <br><br>Forget about that though. Let's talk about how this movie is only 78 minutes long and is made up of about 63 minutes of build-up (and credits), leaving only around 15 minutes of jumbled, unsatisfying, lukewarm horror. <br><br>Let's talk about the fact that this movie has to promote itself by trying to invoke the names of more popular movies like You're Next and Blair Witch, but if you actually look at the credits you'll find that this was only written by the same writer of those, and was actually directed by that guy's brother who has nothing but cinematography credits to his name. <br><br>Makes sense though, doesn't it? The one positive thing I can say about this is it was certainly a well-shot film. Other than that though, it's an empty waste of time. Nothing but sightseeing shots and filler.","user":"horrorgasm","rank":[43,57]}]