[{"title":"A great positive sign for the Italian cinema","rating":8,"date":"14 March 2016","review":"An incredibly well-written modern chamber play that submit us a really interesting question: What would actually happen if a group of friends that affirm to know each other perfectly puts the smartphones altogether where everyone can hear the calls and read the messages? Yes A big mess<br><br>The brilliant starting idea is developed in a wonderful crescendo that transforms rapidly the situation from a nice dinner with old friends into a bloody battleground that reveals the darker secrets.<br><br>The movie is both funny and dramatic and so is the bitter-sweet final (wonderful inception tribute).<br><br>Great cast, good directing and good cinematography.<br><br>Vote: 8.5","user":"andrea-bertazzoli9","rank":[89,101]},{"title":"Roller-coaster of emotions","rating":10,"date":"17 December 2016","review":"What a fantastic piece of art. A movie containing an abundance of emotions, psychology and surprises. <br><br>It has been a while I have been both touched by tears and laughter at the same time.<br><br>An incredible scenario, fantastically written, composed and acted upon. Interpersonal relationships at its finest.<br><br>The constant twists in the plot, along with great acting makes the movie to be fascinating from beginning to end.<br><br>If you like Woody Allen movies, you should definitely watch this one. Simply amazing!","user":"gewoon_filip","rank":[41,50]},{"title":"9/10","rating":9,"date":"14 August 2016","review":"Seven long time friends are having a meet up at Rocco (Marco Giallini) and Eva's (Kasia Smutniak) house. As the dinner starts to evolve the theme of cellphones emerges bringing in very different points of views on the matter. The friendly bickering evolves to the point that the seven friends decide to play a game. Everyone is to put their cellphone on the table and any and every message, call or notification that arrives during the dinner is to be shared with everybody. What will emerge is in fact that all of these lifelong friends might actually be, fittingly, perfect strangers to one another.<br><br>Paolo Genovese, an Italian director who in the past had made decent, yet never really remarkable efforts in Italian cinema has now come out with what is the best film of 2016 so far, the film you have to watch this year, a nail biting thriller, that takes your breath away with its first reveal and never lets you catch it back, not until long after the film has ended. If there is one feature you will have to look out for in 2016 this is the one to go for.<br><br>What is most surprising about what Genovese and all of his co-writers have achieved is how simple the whole thing is. It is a basic premise. It is shot unstylishly. The plot weave has two, three at best turn points. The packaging of the film is so simple it almost puts into discussion the visual nature of film itself. Yet, what Genovese does as a director and what the screenplay achieves with its tight and relentless pacing is filling all of the simple surface of the film with a dark and riveting twist that manages to hold the viewer's interest without ever calling attention on itself.<br><br>All of the scenes are shot with basic coverage. There is no shot in the film that calls attention to itself. Where this is compensated is with incredible blocking, masterful editing and overall impeccable timing. Just as Lumet in 1957 manged to make twelve men in a room visually interesting, Genovese, even if to a slightly lesser extent, manages to take this setting and charge every action and dialogue line with a climactic effort.<br><br>When confronted with such a screenplay a director has to realize he has to step back and make the lines breathe, make the actors relevant, give the dialogue a flow and a meaning, trying not to make it become irrelevant. That is what Genovese does and to a brilliant effect, just like last year Danny Boyle made Sorkin's words enlighten the screen with energy, the director here gives the dialogue the spotlight and supports it with one little action at a time, all of which prove to be genius moves.<br><br>It could be so easy to give all the credit to these brilliant actors, who admittedly rise to this occasion and give a collection of amazing performances, yet what Genovese those is so understated, so brilliantly unnoticeable it is the mark of a superbly directed movie. He walks perfectly the line between being a showman and being laid back, he ends up forging that perfect balance which makes every edit matter and what comes out on the other side is a white-knuckle thriller.<br><br>Still, this screenplay has to be taken into account as the primary reason of success for the feature. Its character outlining is remarkable, everyone of these people feels fully rounded, you can sense all of their history weighing in on their shoulders. Every line further develops the relation between these people and takes a step forwards in defining them, you simply cling to every word trying to get to know them, their reality feels so interesting you want to be a part of it. It has almost a voyeuristic nature that is not too unlike Hitchock's \"Rear Window\". Naturally all of these actors have their A-game on which is the final ingredient into the craft of this overwhelming film.<br><br>Were you wondering what film is missing from your catalog this year? Well here's this Italian one-room thriller that will take you by surprise and leave you with an ending that is brave and original, which seals the deal on the film and charges it with the most thematic effort it could have ever had.","user":"James_De_Bello","rank":[52,65]}]