[{"title":"A well shot mess.","rating":4,"date":"26 May 2018","review":"Feral is not a good movie. I wasn't that impressed with the ads and mostly just saw it because of the leading ladies. Scout Taylor-Compton (Rob Zombie's Halloween films), Renee Olstead (Unfriended), and Olivia Luccardi (Channel Zero) are the leads who, along with a couple of lame guys, go on a camping trip after finishing college then run across werewolves er, ferals. <br><br>This movie starts with a gore soaked cold open in which special guest star Lew Temple (The Devil's Rejects, 31, The Walking Dead) seemingly tortures a monsterous female to death. While watching this, I had two thoughts. The first was that this is a pretty cool start to the movie. The second was this terrible feeling that this was probably the best part of the movie. And, aside from endless cleavage shots of its lead actresses, it is. <br><br>And yes, this movie is so bad that the cheap, juvenile thrill of pretty girls in tank tops ends up being a major highlight and that is a majorly bad thing. <br><br>The five kids on the camping trip are boring and annoying AT THE SAME TIME. There's a sort of vague, millenial SJW vibe to these kids that made me think I wasn't even supposed to like them. There's a listless, bored quality to the most of the actors, who never seem that worried about what is going on, to the characters, that are lucky to have one trait a piece, and to the pace, which is just slow and dull. <br><br>This movie could REALLLY have benefited from a sense of humor, some gratuitous sex and violence, dumb humor, anything! It's just so boring. By the end I was checking emails and just waiting for it to be over. <br><br>I like Scout Taylor-Compton but her character is such a Mary Sue. She kind of reminded me of the ridiculously capable gal from You're Next but lacked even that character's charm. She's really just too capable too early and the character has nowhere to go. Lew Temple is equally one note and Renee Olstead isn't even in it that much. Olivia Luccardi is the only one that manages to develop much personality and I had the impression that was mostly because of quirks the actress threw in herself, like flipping a character the bird behind his back because he's being a jealous prick to her.<br><br>The only memorable thing here, if you can call it that, is that the lead couple is two girls instead of a hetero normative couple. The movie doesn't do anything with them though so, really, instead of getting a bland, underwritten romance between a man and a woman, we get a bland, underwritten romance between a woman and a woman. <br><br>The creature effects are okay but that's about it. I didn't like this movie and only gave it a 4 because I had the impression that at least some people involved were trying. The DP shoots the film well, the makeup effects are solid, and Scout and Olivia Luccardi do what they can with their roles. Still don't recommend spending money on it though.<br><br>In short, as I said at the beginning, Feral is just not a good movie.","user":"Kolobos51","rank":[44,47]},{"title":"My quick review.","rating":3,"date":"3 December 2018","review":"This movie is about a zombie virus and 6 people.<br><br>The zombie virus is the most likeable character.","user":"josh_therealdeal","rank":[15,15]},{"title":"Another low budget silly zombie/virus film on the lines of Cabin fever n Mutants.","rating":4,"date":"5 June 2018","review":"The trailer was good. The movie started well with a man in a cabin waiting to kill a tied up zombie/infected person n cut the scene n we get to c a group of friends trekking in the woods. During the nite, one fella walks out of the tent to take a pee n we get to a c a creepy creature lurking in the dark. The first kill was decent but the movie turned bad after this.\nThere is absolutely no tension or suspense.\nMost of the characters r shown to be medical students, especially one studying to become an epidemiologist but the kind of stupidity they show towards the infected victims is annoying.\nThe source of the virus is never explained n the ending was meh.\nThe director's earlier effort Tooth n Nail is much better than this lousy film.","user":"Fella_shibby","rank":[30,34]}]