[{"title":"2 Lava 2 Lantula!: Somewhat of a let down","rating":5,"date":"20 August 2017","review":"The first Lavalantula (2015) was a surprisingly entertaining movie especially as it had the same vibe as the Sharknado franchise. Another blend of two things (Lava and Tarantulas) and starring three of the original stars of the 1980's Police Academy movies I had a lot of fun with it.<br><br>I was surprised to see a sequel created, even more so when I realised all the cast would be reprising their roles and was eager for more flamey spiders.<br><br>Though not bad it didn't live up to my expectations and in a way felt like a rushed sequel cashing in on the current popularity of these cheesy scyfy original movies.<br><br>For a start Guttenbergs character has gone from endearing to deeply annoying and that hurt the film, the amount of movie references packed into the film as well looked desperate and was sorely not needed.<br><br>Overall 2 Lava 2 Lantula is a definite watch for fans of the first but if this is the direction these movies will go then best stop here.<br><br>The Good: <br><br>Still do like me some flamey spiders <br><br>One particularly horrific death scene <br><br>Martin Kove is excellent as always <br><br>The Bad:<br><br>Guttenberg is deeply annoying this time round <br><br>Things I learnt from this movie: <br><br>Actors are apparently trained to fly grade A military helicopters for roles <br><br>4hrs of training is still fresh in a persons mind 25yrs later <br><br>Somewhere through the years Marion Ramsey forgot how to act","user":"Platypuschow","rank":[6,6]},{"title":"\"Steve Guttenberg Returns To Kick More Spider Butt!\"","rating":5,"date":"14 August 2016","review":"Steve Guttenberg returns in this 2016 sci-fi action sequel to kick more spider butt. In this installment, actor, Colton West (Guttenberg) tries to save his step-daughter, Raya (Michele Weaver) and Florida from a new batch of destructive, lava-spitting tarantulas. This isn't a bad follow-up that shouldn't be taken too seriously. Like the first film, it has obvious CGI effects and some intentional overacting from Mr. Guttenberg. The film also pokes fun/references \"Scarface,\" \"Miami Vice,\" \"Crocodile Dundee,\" \"Cocoon\" and even \"The Karate Kid\" in which co-star, Martin Kove appears here as Military Colonel, Jester. Guttenberg's \"Police Academy\" co-stars, Michael Winslow and Marion Ramsey also reprise their roles as Marty and Teddy. This is a cheesy, but fun flick I still recommend.","user":"gwnightscream","rank":[5,5]},{"title":"2nd Time 2 Much 2 Silly","rating":15,"date":"15 January 2017","review":"2 Lava 2 Lantula! (2016)<br><br>* 1/2 (out of 4) <br><br>Actor star Colton West (Steve Guttenberg) is on the set of his latest movie when his daughter is attacked by the giant lava spiders. West and Marty (Michael Winslow) must race there to try and save her as well as the rest of the world as these spiders are much bigger and much more damaging.<br><br>2 LAVA 2 LANTULA! just doesn't work. I will gladly admit that I enjoyed the first film as it was rather fun considering what it was. With that said, this sequel here is pretty darn lazy from start to finish and whatever entertainment the first picture had is certainly missing with this sequel. The biggestproblem is that the film really doesn't know what it wants to do. At times it's a straight monster movie and at other times they have it being so campy but these camp moments are more annoying than anything else.<br><br>Guttenberg was a lot of fun in the first movie but here they've got him over-acting so much that you can't help but not enjoy the performance. For some reason his line delivery is constantly changing as sometimes he speaks normal and other times he's way over the top with the macho guy routine. He does get to team up with POLICE ACADEMY co-stars Winslow and Marion Ramsey again so fans of that series will enjoy that.<br><br>The special effects are pretty much what you'd expect from a SyFy movie. The spiders here are mildly entertaining but there's no question that this sequel just feels rushed and it's rather annoying. It's really too bad because I enjoyed the first film but the spoofs and campy just doesn't work this time out.","user":"Michael_Elliott","rank":[2,2]}]