[{"title":"Tragic","rating":1,"date":"26 December 2017","review":"The entire movie is an absolute waste of time. The only reason I watched the movie is due to the fact that I am a hormonal girl who is madly in love with Freddie Highmore. I do not recommend this movie to anyone at all. Please, I beg you if you are reading this review do not waste two hours of your life watching 'Almost Friends'. Instead, why don't you take a two-hour nap you and your body will thank me later.","user":"cortesjanet","rank":[28,43]},{"title":"This Story is Worthy of a FollowUp!","rating":7,"date":"24 November 2017","review":"I'd like to see a followup to this sobering charmful character story. I think what makes the main character endearing is his propensity for honesty. He shows a child like willingness to put him self out there and reach out for the person, who will be the one to bring out a desire to ask more of himself. She reminds him that he's worthy of the pursuit of asking more of himself. He learns that to have the one he wants, he has to do himself a favor and become the person he wants to be. Until he does, the one cares about the most won't be able to pursue him wholeheartedly. I hope to see a sequel that will show his career unfolding and hopefully a further developing romance.","user":"davidrflowers-234-94049","rank":[15,23]},{"title":"The Good Doctor Gets a Girlfriend","rating":7,"date":"12 December 2019","review":"I enjoyed this movie. I'm not a huge fan of Freddie Highmore or anything but I did enjoy him in the Good Doctor and this looked like the introspective, thoughtful kind of movie that I sometimes enjoy so I gave it a watch. Freddie plays the odd bird character quite well and this was no exception - though I did feel at times like he brought just a slight touch of the Good Doctor's autism to this character. But it worked well enough - especially in the scenes with Odeya Rush. She really... I don't know, they both seemed to bring something out in each other. I thought they worked well together - so much so that I found myself glad when it got to the next scene between the two of them. Anyway, if you're looking for an awkward but sweet almost love story, give this a watch. And ignore all the negativity, it was well worth it.","user":"gofishbish","rank":[3,3]}]