[{"title":"The Risk May Be Worth It For Some","rating":6,"date":"11 June 2017","review":"The reviews for this documentary are all over the place. Reviewers who are firm advocates of WikiLeaks tend to over-exaggerate the film's virtues, while those who find the organization's actions reprehensible tend to hate it. I watched the film as an objective reviewer.<br><br>Some have called the film a sleeper and there are parts of the film that live up to that branding. These occur mainly at the beginning of the film when scenes shift quickly and conversations are somewhat baffling and vapid.<br><br>Assange emerges as an emotionally remote character who hides his true personality behind his dedication to WikiLeaks. He even states that what he does is more important than who he is. The only scene in which we get a glimpse into his repressed character is when he is interviewed by Lady Gaga, dressed in her Wicked-Witch-of-the West costume. Ms. Gaga, like most celebrities, tries to hide her insecurity behind false bravado and seemingly unfiltered, carefree questions which tell us more about her than Assange. In a clear case of projection, she asks about his relationship to his parents, wherein Assange claimed his father was \"abstract\".<br><br>We do get some glimpses into the life Assange lives within the Ecuadorean Embassy. We learn about his relationships with his team and find out a few ways that the organization keeps itself protected from government intrusion. This may hold some interest for some viewers.<br><br>The latter half of the film is more interesting, especially when he talks about the DNC hacking. I only wish this were expanded more as it is more timely. It is at this point in the film that Assange talks about the earth as so interconnected that any action must be considered a global action. It is an interesting an important viewpoint that should be considered. It is not simply \"think globally, act locally\". It is more that even a small local action may have global implications.<br><br>The film leaves many questions unanswered and, as a whole, doesn't flow very well. It could have been better made. There is nothing compelling in it, meaning that a viewer may be tempted to stop watching the film entirely at certain points. There is no hook that makes us want to see how it ends. There are no compelling relationships and some issues seem unresolved that could easily have been. Still, a few scenes are definitely worth seeing.<br><br>For those interested in the world of cyber security, political intrigue, and government surveillance, this documentary may be of interest. For the general public, however, it may simply be too dull.","user":"SteveMierzejewski","rank":[23,27]},{"title":"Ballad of a Vain Man","rating":7,"date":"19 September 2017","review":"The ability of whistle-blowers to leak sensitive, and even secret, information is an essential check on the potential abuse of power by government. But Julain Assange, founder of Wikileaks, a website established to assist such whistle-blowers, is a deeply problematic figure: an egoist who falls out with his own collaborators with amazing frequency; a man who seemed hardly to take accusations of rape seriously; an instinctive anarchist who sometimes seems to be fighting not government tyranny everywhere, but exclusively in America. This documentary was conceived as a friendly venture (in fact, the film-maker quietly reveals she is not exactly a neutral party in the story), but the essential vanity of Assange is clearly on display. Ultimately, it's hard to avoid concluding that whatever good Wikileaks might have done has been fatally compromised by the man at its core.","user":"paul2001sw-1","rank":[15,19]},{"title":"Disappointing","rating":9,"date":"9 December 2017","review":"This film tells the first hand story of Julian Assange, and his life after launching the leaks website.<br><br>It is very interesting to see what goes on around Assange up close, as there is probably very little opportunity to do so. The opening of the film is strong, as the characters try to get in touch with senior government officials. However, the film goes downhill quickly, mostly because there is little narrative to what is shown on the screen. For example, there is a scene where Julian puts a device on the window sill, and I have no idea what is going on. The scene where he gets a haircut, and doing boxing can be enhanced by a narration that he could not leave the embassy. To me, the documentary is so personal to the filmmakers, that they forgot that viewers are not in the middle of it. Viewers can't follow the scenes as they could.","user":"Gordon-11","rank":[5,5]}]