[{"title":"A wonderful continuation of an idea that still has plenty of ground to cover","rating":8,"date":"8 March 2016","review":"Riley's First Date? is one of presumably several short sequels Pixar Animation Studios will make to further the world of their latest success story Inside Out. That film had the ability not only to inspire a wide-variety of ideas that could continue to develop the characters, but also managed to end by setting up the emotional banter and wit that ensued when the focused shifted into the heads of other characters. Inside Out's first short sequel plays with this by taking another look inside the heads of Riley's mother and father during nearly every parent's most feared situation.<br><br>When a young boy named Jordan (voiced by Ben Cox) comes over to Riley's (Kaitlyn Dias) house to hang out, Riley's mother and father (Diane Lane and Kyle MacLachlan) immediately assume the \"worst:\" she has a boyfriend. Being that Riley is now twelve, she is inching ever-so closer to being a teenager, so similarly with Inside Out gradually hinting at the loss of childhood innocence by way of natural development, Riley's First Date? continues to expand on that idea. The short, in just under five minutes, focuses on how Riley's mother and father go about reacting to Jordan, despite no comment or indication that the two are dating. Riley's mother, whose emotional headquarters is lead by a less-brazen version of \"Sadness,\" decides to try and pander to her daughter in way of cheap slang and lingo, while Riley's father, whose emotional headquarters is lead by a more conservative form of \"Anger,\" decides to play defensively to try and intimidate Jordan.<br><br>The short's brevity is a nice feature, as this isn't a lofty topic and, unlike Inside Out, which is almost entirely played seriously to showcase an eleven-year-old's emotions, this is played for laughs based on a recognizable situation. With that, Riley's First Date? is a sweet and sincere continuation of an idea that, despite its heavy pop culture exposure in the last few months, still has the ability and the promise it did when we first came into contact with it nearly a year ago.<br><br>Voiced by: Kaitlyn Dias, Diane Lane, Kyle MacLachlan, and Ben Cox. Directed by: Josh Cooley.","user":"StevePulaski","rank":[12,15]},{"title":"A great first date","rating":8,"date":"26 December 2017","review":"Absolutely adore 'Inside Out'. One of my favourite Pixar films and ranks very highly by when it comes to animated films in general. Pixar have been responsible for some classic short films. 'Riley's First Date?' is not one of the classics but it's very good and at its best great all the same.<br><br>'Riley's First Date?' may lack the imagination of 'Inside Out' and it is for my tastes too short, would have given it a couple more minutes myself. Having said that, it was really fascinating seeing how a very relatable and relevant subject, that a vast majority of people go through, affects Riley's parents with the same idea with the emotions as with 'Inside Out'.<br><br>It's a great looking short, vibrant in colour, very rich in detail and with natural and expressive character designs. The music is a nice fit in how it's orchestrated and the mood it creates. <br><br>Writing is very funny (Anger in particular) and very sincere, and there is a sweet, fun and touching story. The characters are easy to engage with and the voice acting is very good from particularly Diane Lane and Kyle MacLachlan. Didn't think personally that Kaitlyn Dias was too old.<br><br>Overall, very good and great at its best. Would have been even better with a longer length. 8/10 Bethany Cox","user":"TheLittleSongbird","rank":[4,5]},{"title":"Funny little add-on","rating":6,"date":"11 November 2015","review":"\"Riley's First Date?\" is a 4.5-minute animated short film that takes place after the end of Pixar's very successful \"Inside Out\". The question mark in the title makes a lot of sense as this is not really a date. Sadly for Riley's parents (and luckily for us), her parents aren't aware of that and try to ask her and the boy in their house what is going on. I thought the first 2 minutes were really funny and the second half was merely okay. The director is Josh Cooley, who also already made the \"Up\" sequel short film \"George &amp; A.J.\" and he voiced Jangles the Clown in \"Inside Out\".<br><br>But back to this short film here. On a very positive note, they managed to get all the voice actors from the \"real\" movie in here as well. It is impossible to pack as much emotion and drama into such a short film as there was in \"Inside Out\", so they did not even try and made this 100% comedy here. And it's a job well done. Seeing the emotions inside everybody's heads just never gets old (or not yet) because it is something that looks different for every character and the moments we get to look inside Jordan's head were among the very best of this short film. I generally found the (lack of) conversation between the dad and Jordan funnier than Riley and her mother. The youth language thingey has been done many times already and it kinda stops being funny at some point, for me pretty quickly. But that's my only criticism. \"Riley's First Date?\" is a funny little movie and I recommend it to everybody who enjoyed \"Inside Out\". Thumbs up!","user":"Horst_In_Translation","rank":[4,7]}]