[{"title":"Better Than Average Horror","rating":7,"date":"20 September 2015","review":"Back in 2009, director Sean Byrne brought The Lovely Ones to the Toronto International Film Festival (TIFF). The film won the Midnight Madness People's Choice Award, but it somehow never really caught on amongst horror film enthusiasts. I myself must admit that I missed it. I missed screening it at the 2009 Festival and I made the mistake of overlooking the feature for a few more years. When I eventually did screen the film in 2011 I was shocked at how such a fun, violent and well shot horror film escaped my screen habits. I began to champion the film amongst my tiny circle of friends and even though the film has a release date in 2009, I listed The Lovely Ones as the best horror film of 2011. So it is with incredible anticipation that I screen The Devil's Candy, Byrne's latest film which will again compete for the People's Choice Award at this year's Midnight Madness.<br><br>Unrecognizable Ethan Embry plays Jesse – husband of Astrid (Shiri Appleby) and father to teenage Zooey (Kiara Glasco). Jesse is an artist without a muse who uses heavy metal music to both propel his adrenaline and inspire his paintings. Looking for a change, Jessie and Astrid put a bid on a remote Texas home. The house is ample for the family of three but the real selling point is the large barn on the property that Jesse foresees as his art studio. The home has a selling price that is ridiculous for the market. But there is a catch. The realtor is obligated to reveal the history of the home. And the history is death. Jesse and Astrid seem unfazed when they learn that a mother fell down the stairs and the husband killed himself in his grief of the loss. But an early scene shows us a different story. One of murder and maniacal behavior. The house may be haunted with supernatural forces tormenting its residents to freakish behavior. And Jesse and his family might just be in situational danger that could cost them their lives.<br><br>It doesn't take long for the things to start going awry when the family moves into their new home. Jesse is particularly affected and he begins to paint on canvas pictures that represent the dark and the macabre. His involvement with his work draws a rift between him and his daughter. But these fractured feelings are put aside when Ray (Pruitt Taylor Vince), the large homicidal son of the former owners of the home begins to lurk around Jesse's family.<br><br>Ray is unstable. He hears voices in his head that can only be muted by the loud obstruction of noise generated from his electrical guitar and amp. He rocks and rolls with intensity while further slipping from sanity. Ray is a killer. The worst kind of killer. A killer of children. His weapon is his massive frame (well, that and any large rock he can get his giants palms around). Ray's rampage is exhibited in a shallow grave not too far from his childhood home. It's here luggage containing the remains of children he has killed and cut up are buried. Ray's next target is Zooey but the young lass will not go quietly or without a fight. Fueled by satanic forces, Ray is persistent in his pursuit of Zooey. And his objective will leave a trail of bodies in his wake.<br><br>The Devil's Candy is the brainchild of Sean Byrne who catapulted himself onto the horror scene with 2009's The Loved Ones. Byrne both wrote and directed The Devil's Candy and although it is not as refreshing as The Loved Ones, it is a competent and crowd pleasing horror film that has the look and feel of a Rob Zombie film but with much better results. Pruitt Taylor Vince is perfectly cast as the tormented Ray and Byrne keeps the film simple with a trickled down call sheet and a story that never fails to move forward.<br><br>Although The Devil's Candy may be considered horror, it is more psychological thriller. There are some elements of gore but the crux of the film is on the individual characters all of which are interesting and authentic. With a heavy helping of heavy guitar riffs, The Devil's Candy is a surprising hard rock pleaser filled with atmosphere and sweat. It was given a world premiere as part of the Midnight Madness series at this year's Toronto International Film Festival and it will surely find an audience upon release.<br><br>http://theintestinalfortitude.com/","user":"gregsrants","rank":[52,67]},{"title":"don't let the cliché description put you off, this is a great horror.","rating":8,"date":"15 September 2017","review":"When i first saw the description of this movie, I thought \"oh yeah, just another possession movie ... yawn, probably going to be a waste of my evening\" ... but then I took a look at how many positive reviews It was getting and decided to give it a go ... and to no disappointment! This movie was well done, lots of original material, well crafted cinematic horror, good acting, good plot, actually reasonably scary and suspenseful... it's a solid horror movie. I recommend it strongly to other horror fans and trust me I don't give that recommendation out easily, there is plenty of 'horror crap' out there, but this is horror gold. Good job.","user":"georgeaaronterencerevell","rank":[33,41]},{"title":"Horror Worth Watching","rating":8,"date":"31 March 2017","review":"Wow a great Horror Movie. I was slightly put off by the cover art of this movie and almost missed this one thinking it was a slasher film, it is not. I am not a fan of simple gore slasher movies and I visually categorized this as something akin to \"Devil's Rejects\" which is the type of movie I despise. Fortunately, I stumbled upon a good review of this movie which made me pick it up. Anyway, this may be one of the better horror movies of 2015. Pruitt Taylor Vince performance is very memorable and disturbing. Everything from his demeanor to that dirty red tracksuit. Ethan Embry (Late Phases, Incident on a Mountain Road) is no stranger to horror films but I barely recognized due to his long hair and grunge rock appearance, he gives an outstanding performance of a disturbed painter and father who receives an overwhelming urge to paint a sinister painting that is invading his mind. Interesting to note, the voices that the antagonist and the protagonist are hearing are NOT THE SAME. They are different which I think becomes apparent by the end of the film. This movie is full of tension with strong supernatural undertones. There is surprisingly little gore in this movie though we see multiple scenes of bloody aftermaths.","user":"parsonm2","rank":[51,68]}]