[{"title":"Movie made with goofs","rating":1,"date":"11 July 2018","review":"The followings are some of the things I've learned after watching the \"211\" movie with the Nicolas Cage as the main character.<br><br>1. When you are transferring the money to list of the accounts, you must randomly type on the keyboard and when the progress bar reach the end to show the completion of the transfers, it must reset and start from the beginning.<br><br>2. When the SUV is bullet-proof it can accelerate in a short distance and run to a bulldozer and magically get destroyed.<br><br>3. The criminals prefer to kill their only source and go to a local bank in a small town to steal the money instead of torturing the source to give up the account numbers and get back the money the easy way.<br><br>4. The person who got bullied in the school must be punished or get expelled from the school because he shows violence when he got bullied.<br><br>5. The Interpol is investigating an international case with using a single agent in the field because showing the actual investigation is way too costly and probably would make the movie good.<br><br>6. The gun shop man and a veteran must be too careless to leave his keys on the locked guns and also lie about his friend while the picture of them is hanged right above his head.<br><br>7. The criminals who want to create distraction, think planning a bomb in a small café is a good idea. And while they would end up dead in the end of the movie, why not kill some more people to make them look dangerous and who cares if they also get arrested, they would probably die for their crimes.<br><br>8. When you are going for a bank rubbery, it's also a good idea to park your gate-way car in the red zone and make it easier for the cops to notice your car.<br><br>9. When the sniper has a clear shop of the side and the back of the police car, magically does not have a clear shot of the side of the car where the police officers and the kid is taking cover.<br><br>10. When the bank rubbery goes wrong it is always a good idea to start killing the hostages, specially the high rank employees or the bank manager.<br><br>11. You can die from a gun shot wound in your leg even if you already stop the bleeding.<br><br>12. The police officers and swat using blank bullets while the criminals using real bullets and most of their shots are successful. The cops cannot shoot and hit the target in a straight line and kill the criminals with no cover other than the bank curtains. Also, the police offers cannot shoot even in a close range while a high school student know how to use a gun and shoot better than the cop.<br><br>13. It is also a good idea to not listen to the Interpol agent who is in-charge of the investigation for the same criminals and go with your own plan to get your man killed. There was a need for the \"I've said so\" somewhere in the end of the bank rubbery scene.<br><br>14. When your phone is turned off because of the low battery, you can charge your phone with a normal battery and turn on your phone immediately.<br><br>15. Apparently you can answer the phone call on mobile devices by taking it out of your pocket and moving it near your ear. Also while phone is ringing the screen stays black and does not show the caller. Also it's important to leave the dying patient and answer your phone in the hospital.<br><br>16. When your family has problem and the family members are not close as before, you need to kill or nearly kill a family member to make them close again. Also invite a random guy to a family party because he has a phone and always use his phone to take pictures and videos so he can take a new family photo for you. <br><br>As you may have mentioned, I've written some of these with sarcasm while the rest are dead serious stuff that I've learned from watching this movie. In just few simple words, I can describe this movie as \"Just another crappy bank rubbery movie\" or \"Just another bad Nicolas Cage movie\".","user":"masoudhaghi","rank":[93,115]},{"title":"They can't get the simplest things right","rating":3,"date":"10 June 2018","review":"This movie by Nicolas Cage and company is another to add to the bad. Opening credits blew it when they pan a laptop showing a active transfer while she randomly strikes the keyboard senselessly. What were they expecting this to add more realism you could see she was not typing and nothing appears on the screen except the transfer process. Obviously the film's editor should cut this to the floor but they probably thought nobody would care, that's why this is a B movie.","user":"rowpotdroid","rank":[67,92]},{"title":"Bored After 10 Minutes","rating":1,"date":"16 July 2018","review":"This was a mishmash of a movie. Wooden acting. Unrealistic. Bad plotting. Starts with a woman typing frantically on computer during a download. Why? Then people get blown up and killed for no apparent reason. Then the movie begins with a contrived situation about bullying so some kid can go on a ride along because it's in the script. After that, you have the tried and tired daughter and estranged father conflict. I like Nicolas cage. I think he's made some great movies -- i.e. Face/Off and Family Man -- but nothing worthwhile in at least 10 years. And worst of all, the acting was like planks of wood interacting. I could smell the ham from my computer. Someone obviously owed someone else a big favor otherwise this movie would never have been green lit.","user":"harjac-58517","rank":[49,66]}]