[{"title":"Defying Compromise","rating":9,"date":"21 May 2016","review":"Films rarely put forward leading characters that they then choose to vehemently punish throughout. But this is Mungiu, who has already proved more than adept at creating authentic and ruthless portrayals of society and in Bacalaureat he scrapes at the edges of our souls. His tale of generational change is predicated on the dismantling of a profoundly patriarchal state of being. To this purpose, he crafts a story of remarkable complexity and depth, which cuts across so many layers, that taking them apart would be counterproductive.<br><br>In short: Eliza is sexually assaulted one day before her 'bacalaureat', the final set of high-school exams students sit in Romania. She had been awarded a conditional scholarship at a university in the UK, but her impairment, both mental and physical, poses a threat to her getting the grades she needs. Cue in the father, Romeo, a local doctor, whose life is about to encounter quite the upheaval in his desire to ensure Eliza fulfills his own botched 'destiny' of leaving the country. Things take a turn for the complicated as he is more or less inadvertently offered an opportunity to guarantee the results his daughter needs. The circuit of corruption is as informal as it is intricate - a friend of a friend situation, one hand washes the other kind of thing. And beyond all this mess, Romeo also has to keep up the facade of his marriage, while dating a single mother, Sandra, who happens to be a teacher at Eliza's high-school. <br><br>What makes Bacalaureat instantly and distinctively good is the attention to detail, which breeds both familiarity and authenticity. But unlike Mungiu's previous major success, 4 Months, 3 Weeks, 2 Days, the grimness does not stem from the subject matter, or the dry (non-)stylization of the story, but from how intertwined the many strands of this one case prove to be. Shadowing the father along it is painful because his shortcomings are obvious from afar. But it is his demise that is so important to ensure a new generation comes along which will set itself apart from the current one. He is tragic, because not only can he not escape his destiny, but he doesn't recognize his role in propagating that which he abhors. Romeo's willingness to compromise in order to ensure his daughter's chance of being the change he desires is part of the hereditary disease plaguing any such social construction. <br><br>Taking a wider view, it isn't coincidental that every moral-institutional junction is safeguarded by a man - a doctor, a police officer, a former mayoral figure, a school commissioner, a prosecutor. Contrasting this are the female characters, the strength of Eliza, the stoicism of Sandra, the wisdom of Romeo's wife, Magda. It's a battle of utilitarian and deontological ethics, posing the question of whether moral pragmatism can be moral at all. There is little doubt where Mungiu sides, as the male 'keywardens' are at least one of: cynical, unfeeling, self-serving, hypocritical. Masculine instincts are both highlighted ('it wasn't a rape, it was just a sexual assault!') and criticized. Even as it seems that a pair of male characters come along that are understanding and humane, there is a strong pinch of self-interest that dictates terms, which is why they are punished with a fine ironic touch by the director.<br><br>For all that happens, there are two scenes which summarize the journey we are on. Firstly, when 'someone' (life?) throws a stone at the apartment Romeo's family is living in, thereby breaking a window, he rushes out confidently, as if finding the culprit were a matter of when, rather than if. Then, towards the end of the film, as Romeo's life unravels by the virtue of his poor choices, he decides to venture after the assumed perpetrator of the assault on his daughter; now, however, he loses the trail instantly, finds himself wandering confused in the shadows of apartment buildings, jumping at every unexpected noise coming his way. The grip, the control over how society is run, ever loosening.<br><br>If anything, I would criticize Mungiu for being overly and overtly moralistic. There are several moments where characters are used as props to portray said moral perspectives, scenes which feel artificial and pedagogically pedantic. Also, the bureaucratic coldness conveyed by almost all officials (one moment dictating an official statement concerning Eliza's rape, the next discussing trivialities) feels uninspiring by now - there is a sense that themes are contained within a national frame, that our sole focus is alleviating the burdens of the past, more than the challenges of the present. And although this is hinted at during the film, the matter of exam fraud was as rooted as it is illustrated here about ten years ago, when I myself was finishing high-school. Hence, it feels against the times in a way, but then this can also be viewed as the last vestiges of an era, Romeo's solution being retrograde especially in such a light.<br><br>Bickering aside, creating such a complex and highly integrated story that feels true to itself almost all the way is quite splendid indeed. It's not an easy ride for viewers, who will suffer the pain of compromise, of systemic contortion against the individual - ultimately, Romeo has good intentions, the world just seems to require of him to do what he does, to right a wrong with a wrong. Yet, it remains the individual that decides, which is why the 'bacalaureat' is such an important stepping stone for change and for maturity. Mungiu's film is a comment on the precipice we are finding ourselves on now, where we see the change more clearly, are even enacting it, but it is the follow-up that will define us as a people, as a generation. Funnily enough, he proves to be an optimist.","user":"tributarystu","rank":[49,54]},{"title":"Exposes favoritism, influence trading, and codes of silence","rating":8,"date":"29 October 2016","review":"Philosophers throughout history have wrestled with the question of ends and means, right and wrong, and good or bad. Socrates said, \"It is never right to do wrong.\" Others maintain that it is right to act in such a way that it produces the most desirable consequences whether or not it follows society's rules. For Dr. Romeo Aldea (Adrian Titieni), a well-respected doctor in Romanian director Cristian Mungiu's (\"Beyond the Hills\") latest film, Graduation (Bacalaureat), his goal is to do whatever it takes to secure a better future for his daughter, Eliza (Maria-Victoria Dragus), who has been conditionally accepted for a scholarship to Cambridge University in England depending on the grades in her final exams.<br><br>As a result, his personal integrity is tested in an environment where greed, corruption, and opportunism are the norm. Romeo and his wife Magda (Lia Bugnar) live in a small apartment in Cluj, a Transylvanian city, together with Romeo's mother (Alexandra Davidescu) whose health is rapidly declining. Aware that he is having an affair with Sandra (Malina Manovici), a teacher at Eliza's school who has a young boy, Matei (David Hodorog), of her own, Magda seems to be in a state of constant depression. According to Mungiu, her depression reflects the state of the country itself where people are living in a state of paranoia, dramatized as the film begins with a rock crashing through the window of Romeo's house.<br><br>The mystery of the perpetrator's identity soon gives way to another. Before the final exam that will determine whether or not Eliza receives a scholarship, she is assaulted and nearly raped on her way to school by an unknown assailant. Defending herself, she breaks her wrist and is forced to wear a cast on her right arm. Fearing she will be unable to properly write her exams, Romeo follows the advice of Ivanov (Vlad Ivanov), a friend in the police department, and pulls some strings with the school administrator and the town's Vice Mayor Bulai (Petre Ciubotaru) to ensure that she receives a qualifying grade, but every compromising decision leads to another until even the tangled web he weaves even threatens the good will of his daughter.<br><br>Attempting to solve the two mysteries of who threw the rock and who assaulted Eliza, Romeo suggests to Eliza's biker boyfriend, Marius (Rares Andrici) that he is hiding the truth about her assault but their confrontation turns physical and only serves to escalate the problem with his daughter. Romeo clings to the idea that he is a decent person who is only trying to create a better life for someone he loves but it is clear that he has become part of the system he detests. Co-produced by the Dardenne Brothers, Graduation has the Dardennes' naturalistic look and its gritty realism but Mungiu's effortless subtlety and the power of his moral compass is his own.<br><br>Mungiu says that \"If you tolerate your own compromise you will tolerate the compromise around you. You will lose the moral power to speak out, because deep inside you know you have done something that is not so moral. We all complain in Romania about the level of corruption without understanding that we are responsible for it.\" Though there are no consequences apparent for any of the wrongdoers, many unanswered questions are simply left hanging, and the film's abrupt ending is less than satisfying, Mungiu succeeds in exposing the favoritism, influence trading, and codes of silence that permeate Romanian society, an exposé that may just be the catalyst the country needs to rebuild a more just and ethical society.","user":"howard.schumann","rank":[29,32]},{"title":"Complex issues are handled with great care and compassion","rating":8,"date":"21 June 2016","review":"When a man's daughter is assaulted the night before her final exams, her future, which he has set up so well, is thrown into question. Graduation is all about the lengths a father is willing to go for his children. Whether motivated by selfish reasons or genuine desire, the father wants nothing more than to get his daughter out of the morally corrupt environment that permeates their town. To accomplish his plans however, he starts to cross lines and partake in the system he openly reproaches. Christian Mungiu tackles these sensitive topics with care and compassion. Using long takes and unobtrusive camera work, Mungiu emphasizes character above all else. Every character is redeemable in some manner, but no one is innocent. Though the ending brings in an unnecessary police investigation that seems to beat the point home, it is redeemed by the haunting final image that gives a lot of disastrous implications about generational connections. As favors and obligations start to stack up, the father becomes entangled in a web of questionable decisions. The question ultimately becomes, \"do good reasons make up for bad decisions?\" <br><br>Graduation (2016) Directed by: Cristian Mungiu Screenplay by: Cristian Mungiu Producers: Cristian Mungiu Starring: Rares Andrici, Valeriu Andriuta, and Eniko Benczo Run Time: 2 hours 36 minutes","user":"wcoleparks","rank":[23,27]}]