[{"title":"Just awful","rating":1,"date":"23 September 2017","review":"This is just terrible. I don't know if it gets any better near the end buy I seriously doubt it. I made it about 20 minutes into it. The very first scene with dialogue is drowned out by the music. The CGI could have been done better with whiteboard markers on glass held in front of the camera. The acting was worse than a porno. The main guy comes out of the forest and looks over a valley with houses, the next second he's looking down on a bad CGI city in ruins. I looks like it was shot in a local park in Newcastle frequented by hobos and junkies. Do not waste your time.","user":"blzbub666","rank":[12,13]},{"title":"What are you going to do about it","rating":2,"date":"21 August 2017","review":"A little girl playing with a slinky causes an apocalypse with mutant creatures. Within a few minutes only Pvt. James Conroy (Warren Otteraa) and Australian astronaut Garry Freeman (David Leeming) are left alive and later we find out Elizabeth (Alana Tranter) is alive too. For much of the film they chat, put colanders on a stick, and kill mutants with CG fire with a quadruple barreled pistol.<br><br>First off, if I was they only military man alive on earth, I would make myself a general. The acting was comical. In one scene James is running and killing mutants. Due to the budget all we see his his face making growls and the scope of the gun. Our astronaut is in a space station that has the same gravity on earth. No explanation required as \"the space station set was built in the backyard shed of the Directors house he was renting.\" There were many scenes where a person was talking and the sound track muted out what they were saying, something they could have fixed in post had they bothered to screen the product before putting it out to market. The whole film was sloppy. Several scenes were \"so bad it is good\" especially the fighting scenes and system warning labels.<br><br>This is Christopher Jacobs first attempt at writing, directing, and producing.<br><br>Guide: F-word. No sex or nudity.","user":"nogodnomasters","rank":[13,15]},{"title":"Terrible","rating":1,"date":"26 September 2017","review":"Wow, was this bad. As the last reviewer said I made it through about 20 minutes of this film and it was awful. The SFX were horrible blurry images, and the way t was shot was just bad. I'm not sure what kind of camera was used or if that was just the style they were trying to achieve but as I said the video was blurry and sometimes hard to make out what was being shown, especially when showing CGI. I think it was shot like that because they knew the FX were horrible so they had to do something in order for the viewer to not see just how bad they were. So overall I would not recommend watching this it's a waste of time when you could be watching something A lot better.","user":"brandonbyrnes-91372","rank":[1,1]}]