[{"title":"Fantastic debut by Greta Gerwig","rating":9,"date":"20 July 2019","review":"Lady Bird is the directorial debut of Greta Gerwig revolving around a seventeen-year-old girl played by Saoirse Ronan coming of age in Sacramento and without a doubt it instantly takes the spot as one of the greatest directorial debuts of all time.<br><br>I wouldn't exactly call the premise of Lady Bird original due to clichéd coming of age movies being made almost every year but the story and dialogue are realistic enough and with masterful directing and all across the board fantastic performances Lady Bird easily makes up for it. Also, Lady Bird is mature enough to learn from and it doesn't use annoying and cheesy clichés which makes its plot least seem original. Aside from the acting and directing the presentation of this film is beautiful as it explores a few cities and a lot of well-shot locations thanks to the wonderful and underrated cinematography by Sam Levy. The best part of Lady Bird is its social commentary which is very relevant to the 2002 setting.<br><br>Overall Lady Bird is a great coming of age movie filled with well-written characters and great performances. I would recommend it to anyone except to the people that get easily bored with Oscar-bait dramas.<br><br>Final Score: 9/10","user":"Aaron_Kyle","rank":[296,335]},{"title":"A solid, mature and bittersweet coming-of-age tale that manages to shy away from its genre's conventions","rating":8,"date":"21 July 2018","review":"Lady Bird is surprisingly set in a post-9/11 Sacramento in 2002 , which is an un-usual but refreshing era for a modern coming-of-age story. While coming of age stories can often fall in to their charming but conventional trappings, Lady Bird shines in that it doesn't shy away from showing the faults of the characters it follows throughout its run time, almost to the point that you want to see even more of their journeys through life.<br><br>Lady Bird has excellent cinematography and believable characters with identifiable flaws and traits that really ground the movie. Lady Bird takes influence from the 'mumblecore' sub genre (a drama with emphasis on natural dialogue and personal character relationships over plot) and ties it nicely with a coming of age structure that doesn't over stay its welcome and definitely takes its own path you can relate to as a viewer. <br><br>Saoirse Ronan is particularly charming as our main character and bounces well with Laurie Metcalf and Tracy Letts filling in as her parents. The movie addresses a few subjects that aren't touched upon in most conventional coming of age movies, which gives the film a mature feeling. Particularly the 15 certificate in the UK meant the film didn't have to pander towards a younger audience, which is exactly want you want as a viewer of this genre because teenagers swear, talk about sex and abuse alcohol/drugs.<br><br>Some viewers may find its general pacing, structure and tone to be not particularly entertaining and up beat as many other coming of age movies but I found it enjoyable, funny and grounded. The soundtrack also wasn't particularly that memorable but does include some nods towards that era and adds some licensed tracks that some may appreciate. <br><br>A decent coming of age movie that shakes genre conventions but nothing particularly groundbreaking.","user":"SharkByteAudioProductions","rank":[53,57]},{"title":"Pure coming of age escapism","rating":7,"date":"29 September 2018","review":"This film is a blissful piece of nostalgic joy. \nI was nowhere near Sacramento in 2002, but whilst watching I genuinely felt as if I was there. <br><br>The relationship between Ladybird and her mother is the underlying thread throughout and they pull off a believable dynamic that's fun to see. There are also a bunch of other sub stories that are beautifully woven in. <br><br>I highly recommend if you want a nice relaxing film that is not too long and makes you smile at the end.","user":"aleeward","rank":[37,40]}]