[{"title":"Another wonderful French movie","rating":9,"date":"8 July 2016","review":"I ask myself time and again... how do the French do this? They have a superb knack for taking a very simple story and turning it, without sentiment, into a beautiful, moving, intelligent and uplifting experience.<br><br>This is another such gem. Beautifully acted by all players, a simple story of a girl who always 'fails' is turned into a story about how we all are... just humans who are trying to find our way. And sometimes it takes a stranger to see who we really are. Definitely one for parents who might need to put on their thinking caps.<br><br>Highly recommended. Delightful.","user":"eyeintrees","rank":[25,26]},{"title":"Grumpy old man meets nice (but stubborn) girl","rating":8,"date":"28 July 2016","review":"Another french feel-good comedy, once more with two outsiders helping each other getting on with life. Though a bit formulaic, this is a good one - entertaining, funny, well paced and with some feeling AND even an \"edgy\" or slightly unexpected ending (at least for a feel-good comedy, that is). First landlord and lodger, the grumpy old widower Henri, and the nice but shrewd and stubborn student, Constance, soon become a bit more invested than each of them planned to.<br><br>The high points are the three main actors (Henri - he gets most laughs; Constance; and Henri's 40ish son, Paul, who initiated the whole lodging scheme so his father is not all alone). Other characters (among them Paul's wife) get rather shortchanged. The movie is based on a stage play, so the dialogue is snappy and very funny; the downside is that the whole thing is not very cinematic - I guess it wouldn't lose much on a home screen. But I recommend seeing this with a weekend crowd in the theater, always a nice experience with those comedies!","user":"IndustriousAngel","rank":[9,9]},{"title":"Bel et le bete","rating":8,"date":"29 June 2016","review":"I sometimes wonder if - should I ever relocate to France and have access to a steady diet of films of this quality - I would eventually become jaded and long for a London where, if you're lucky, you'll get a half- decent French film every other Fall. I doubt it because films as good as this are the oxygen of my cinema going despite what the trained seal at filmsdefrance says and if a certain actress is featured you could say I'll be there with Bels on. Now that she has just turned 40 Frederic Bel is not getting the ingenue roles she did in the three films she made with Emmanuel Mourcet - though this film is very much in the style of Mourcet - and here she is the much-married wife around whom the plot resolves given that her father-in-law, the great Claude Brasseur, despises her and bribes student Noemie Schmidt with the offer of a six- months free rental provided she will do her best to break up the marriage. Hardly War And Peace but entertaining and loaded with charm for all that. Put my name on the first DVD off the line.","user":"writers_reign","rank":[7,7]}]