[{"title":"I write this only to spare your time. Also most likely SPOILERS.","rating":2,"date":"4 February 2016","review":"I do believe this is the first review I have ever made on IMDb. As I know next to nothing about what goes into making a film I usually stick to the comments and leave the reviewing to people how do know something of the art.<br><br>But...<br><br>I watch a lot of movies. And I watch a lot of bad movies. I like, and on occasion love, bad movies. So believe me this film has almost nothing to recommend it on any level.<br><br>In it's favour I will say it didn't look overly cheap as far as the filming went. It looked better than you would expect given the rest of its shortcomings.<br><br>Also in terms of bad movie positives it contains a scene with what is the worst delivered monologue I have ever seen. Monologue isn't quite the right word but it is the only lines this character has and to call the delivery wooden would be sparkling praise. ALMOST worth seeing for that.<br><br>The two women might be considered attractive to some and one with generic brand implants is naked for a short scene and the other nude for half a second. That might be a plus for those without the internet.<br><br>Beyond that it is not good enough or bad enough to be worth watching. Just bleh. And to top it all off they appear to have run out of money and just ended the movie at a random point.<br><br>Admittedly this seems to be part of a series. Maybe, somehow, my opinion would be altered if I had seen it/them. With luck I will never be bored enough to find out.<br><br>Reading a review like this I would probably be egged on to see for myself. Please just think that I was moved, for the first time, to say DON'T.","user":"OccamsBarber","rank":[9,9]},{"title":"Worst. Movie. Ever.","rating":1,"date":"30 September 2016","review":"This is my first review (and probably my last on IMDb). I don't typically take the time to write written reviews because 1. what weight does my opinion hold and 2. every opinion on anything subjective should be taken with a grain of salt. However, after watching this movie I felt compelled to say something. I am a horror fanatic. I love horror (specifically 80's horror films and B horror films). The cheesier, the better. That being said, this movie was a travesty in film making. This is, by far, the worst acted film I've ever seen. The audio was awful, as if they had only one boom mic for the entire room in every shot so some of the lines were completely inaudible and others were as if someone was screaming in your ear. There was absolutely zero plot development. No character development. One of the worst scripts I've ever sat through. Nonsensical event/line and another. I just don't know where it stops. Everything about this film is horrible. It almost seems as if somebody made a bet with somebody who had no experience in film saying \"I bet with $20,000 you couldn't write, produce or direct your own film\". Normally, I'm a very forgiving critic but this is one special film. Avoid it at all costs. I wish I could get that 60+ minutes back from my life but unfortunately that's impossible. Oh, and the ending? I won't spoil it but suffice to say it ends mid-shot of the climax (for whatever reason) as if they ran out of film and said \"Oh well we've got enough, that's a wrap people\". Rene Perez should be banned from ever doing anything in show business ever again.","user":"fitz_316","rank":[6,6]},{"title":"Don't watch, absolute dirt","rating":4,"date":"4 February 2016","review":"I don't even want to waste time and energy to review this awful film, sufficed to say, the acting was bad, the script terrible, the whole thing terrible, i skipped through most of it, and discovered that at the end, instead of having an ending, its just ends, almost like they ran out of money to shoot the final scenes, just ends,mid-scene, just ends. Again, awful film, predictable dirt. I have to have a minimum of ten lines apparently to review, anywho as i was saying, do not watch this, unless you like terribly bad horror, bad acting and the like, I feel almost bad for the actors who may have thought they were doing something presentable, though as soon as they read the scripts they should have known not to do it. Also one girl was totally just cast for her huge breast implants, and when she takes her bra off we see it was a botch job, just awful.","user":"ruairisean","rank":[12,14]}]