[{"title":"I wanted to like this film....","rating":1,"date":"16 May 2019","review":"I wanted to like this film, I really did. The 50's inspired pulp poster was great, the cinema was packed with a pumped-up audience &amp; the director was there. The movie started with an original, interesting premise but petered out 2/3 of the way through. What started as a cool, weird mystery ended as a shoot 'em up blood bath and no satisfying conclusion. By the time it was over I was dying to get out as fast as possible. Could have been so much better.","user":"mantisshrimp1000","rank":[7,15]},{"title":"Be careful with this one","rating":8,"date":"5 January 2020","review":"This is purely an assumption on my part, but I bet the director grew up with exploitation movies. I do enjoy it when they use what they've learned from them to make something unique.<br><br>Now, as the subject line suggest, this might go a bit far for some... most people. If a movie ever needed a parental guidance page, this is it. There's extreme sex, drugs, a lot of alcohol and we are in no way protected from seeing the results of the quite horrific violence. So, beware. Oh yeah, the there's smoking. That being said, if you don't mind all of this, I think you'll enjoy this movie.<br><br>It looks great for it's budget. You sort of know where it's going at all times, but not quite. It always manages to go just a little bit further. This is exploitation, so it's all about eliciting strong reactions, but the movie manages to use those shocks to construct something very memorable and interesting.<br><br>This definitely isn't a date movie. You really need someone as dead inside as myself to enjoy this, but for those few of us, this is definitely worh seeking out.","user":"h79423","rank":[1,1]},{"title":"Stay on the plastic","rating":4,"date":"7 July 2019","review":"Paul (Luke Sorge) is dishonorably discharged and is a mess, living with his sister Jill (Brenna Otts). Jill sends Paul to an unusual therapist who recommends he keep on drinking and have fetish sex. She gives him an address and things are not what they appeared to be. Eventually, sis must go vigilante.<br><br>The story could have been better. It was rather short and needed a third feature. Very little character development of the main actress.<br><br>Guide: F-word, sex, nudity (Iva Nora)","user":"nogodnomasters","rank":[1,1]}]