[{"title":"Surprisingly emotional - A tale of redemption and sacrifice.","rating":8,"date":"10 March 2019","review":"A surprising and beautiful combination of classic western themes with French twist. Profound. I started out feeling disinterested by the predictable characters and ended with tears and a smile. Stick with it; a truly great film.","user":"camillelyningram","rank":[67,82]},{"title":"Jake and Riz have a formidable bond!","rating":10,"date":"9 September 2018","review":"I had an opportunity to watch it early at TIFF 2018, so please ignore the average low imdb rating. Audiences gave \"The Sister Brothers\" a five-minute standing ovation following its debut at the Venice Film Festival. To summarize this movie, its a old Western ramble that's super funny, smart and watchable. It's utterly strange, utterly lovely postmodern Western\nJake! What can't this guy do? Ahmed brings depth and texture, plus a winning idealistic vibe, to what could have been a bland straight-man role. But As good as the others are, this is John C Reilly's film.\nFYI, The Sisters Brothers doesn't have the same vibe as, say, Unforgiven, but it has the same quality of making us look at things from a different perspective.","user":"rahulshrestha-53145","rank":[221,296]},{"title":"One of the Best Westerns in Years","rating":8,"date":"3 October 2018","review":"The Sisters Brothers is a superb narrative driven western that doesn't hold back on it's true colors. John C Reilly and Joaquin Phoenix star as an incredible dynamic brother duo, working as assassins chasing Riz Ahmed along with Jake Gyllenhaal, a pair recent pair from Nightcrawler (2014). With outstanding performances all around, the actors create a terrific sense of realism in the relationships between characters, John C Reilly stands out, as he delivers one of his most outstanding serious and heartfelt performances yet. The film takes it times establishing itself as a true but unique western with charm and intensity, but the film hits it's prime in the third act delivering brutal and vigorous scenes. The score fits perfectly into the vibe and tone and elevates scenes to higher and more emotionally gripping spectacle. The cinematography is also notable, with exception use of gun flashes in the dark, and alluring composition. As an entirety, the film is extremely compelling and is one of the best westerns in the past decade.","user":"Zachary_goodwin","rank":[150,207]}]