[{"title":"Half decent but all over the place","rating":5,"date":"7 October 2018","review":"In one word it's 'naff' in another word 'intriguing'. <br><br>The plot does just enough to keep you watching,, and the payoff is decent (just don't watch the trailer before hand or it will be spoiled)<br><br>The characters though are awful, only 3 of them are consistent but the other 3 literally change their personality from one scene to the next, making it a bit frustrating as a viewer who dislikes lazy writing. But, there is still fun to be had here. Just go into it expecting the worst and you'll have some entertainment.<br><br>Ps; I hate kate, she was just the worst.","user":"donttouchmeprimate","rank":[80,101]},{"title":"The Creature With No Instructions.","rating":3,"date":"7 October 2018","review":"SUMMARY (in case you don't want to read the whole long-winded bit):<br><br>Unpleasant and highly dysfunctional British family comes together at the family home, together with a brother-in-law and the scion's girlfriend, to \"celebrate\" Christmas. Early the next morning the family discovers the house has been entirely encased in some strange, black substance; escape proves to be impossible. Family solidarity, virtually nonexistent to begin with, completely collapses in short order as cryptic instructions begin appearing on the widescreen TV. Almost instantly, everyone is literally at each other's throats. The strange, black substance turns out to be a \"parasite\" (as eventually described by one of the characters) comprised of innumerable thousands of black tubes that operating in unison like tentacles, each individually about three-quarter inches in diameter. By the end of the movie everyone is dead except the newly born baby. A closing aerial shot reveals that this particular home is not the only one affected.<br><br>FULL REVIEW:<br><br>If we tick off all the things a movie needs to be an enjoyable, entertaining experience (high production values, good music, talented cinematography, satisfactorily skilled and experienced actors, attractive lighting, high quality sound engineering, etc.), AWAIT FURTHER INSTRUCTIONS has them all... except an even vaguely passable story. The fundamental premise of the movie is that a giant monster (or monsters), consisting of untold thousands of lengths of tough, black three-quarter inch diameter tubes, has suddenly taken over at least one neighborhood (that we can see) and the course of the movie is an account of one family's experience with this frightening and unexpected situation. Throughout the movie, never is there even a rudimentary attempt to account for how this comes to pass, what the nature of the creature or creatures may be, no insight as to what its or their objectives may be, and so on. Just \"here's your monster; deal with it\".<br><br>Tacked on moments before the end are some references to the thing's desire to be \"worshiped\", and we could TRY to read this as a motive. But this could be just as easily accounted for as being the result of the fact that the unhinged patriarch of the story DID start worshiping the monster as one of his many random attempts to cope with what was happening and the monster simply picked up on it. Given the \"story\" of this movie, this is entirely possible because this hose-monster is evidently magically capable of any skill or insight necessary to clumsily shove the plot forward. Somehow the creature knows how to: invade and control the complex electronics of TV sets so that it can display any image it wants; selectively disable only the clocks in the house, apparently knowing what clocks are; invade a dead human body and control it like a puppet, even to the point of making it speak English; PERFECTLY macerate an entire skeleton with clinical exactitude in seconds while leaving a fetus enclosed therein utterly untouched other than being rendered squeaky clean. And by the way, the baby had been left inside the dead mother for quite some time at this point; HOW is it still alive, again?<br><br>Fundamentally, there are only two significant plot points for the entire picture. There is the shocking discovery of the entire house being encased in some unknown substance (not known to be a living thing at that point in the movie), and secondly the giant reveal and resultant dénouement close to the end of the fact that the mystery substance is actually a giant, living hose-monster (yeah, I know; I said \"hose-monster\". Stop giggling.). Since there are only these two plot elements to cover the entire picture, some method of wasting the other eighty minutes had to be found to pass the remaining airtime. So, instead of having an interesting movie where a determined and close knit family intelligently explore and combat a new and frightening enemy with determination, family loyalty, and resourcefulness, what we get is a pack of giant a-holes raking away at each other while being goaded along by a piece of the hose-monster hiding in the family TV. As an example, at one point, the sociopathic, inferiority-complexed patriarch of the family hog ties his own son and proceeds to work him over with a box cutter and other sharp instruments because... the TV told him to. THERE'S family values for you.<br><br>A bankrupt and un-interesting \"story\" driving universally repugnant characters, whose behavior towards each other would only have been marginally better even had the monster never made an appearance, makes for a movie experience that is mostly irritation and frustration. Literally NOBODY is a sympathetic character in AWAIT FURTHER INSTRUCTIONS. The primary reaction one feels towards ALL of the characters is that they need to be lumped up with a set of golf clubs because they're either a mentally deranged sociopath OR they're a bleeding moron too weak willed to lift a finger to halfheartedly defend themselves, nevermind anyone else.<br><br>Every character is a stereotype of themselves: the detestable old creep grandfather; the mentally unhinged patriarch, probably that way because of decades of psychological torture from the old creep grandfather; the weak and whiny matriarch (\"can't we all just get along...\"); the dumb jock brother-in-law and husband of the pregnant sister whose IQ can't be more than three or four; the whiny and entitled pregnant sister; the \"good\" brother whose only purpose is to virtue signal his way to happiness; the East Indian girlfriend of the \"good\" brother whose only purpose is to help reveal how everybody is a racist except her virtual signaling \"good\" brother boyfriend. Somebody PLEASE... shoot me in the head. Clearly, WAY more than anything else, AWAIT FURTHER INSTRUCTIONS is nothing more than an orgasm of icky British guilt.<br><br>The only possibly salvageable character would be the newborn infant. But you should bear in mind that the ONLY reason I'm suggesting the freshly newborn infant might... MIGHT... garner a pass is because it's only on screen at the very end for a few seconds. So we don't really know anything about it. But I'd place better than even money that if we HAD gotten to know it, given the family it came from, we'd have decided it was in desperate need of a nice tuneup from a number one titanium Titleist as well.<br><br>The moment the house became engulfed in the parasite the family was doomed. There was never a possibility they might survive this. There's a great story for you: doomed as a family, doomed as individuals, just doomed doomed doomed. Wowee.<br><br>AWAIT FURTHER INSTRUCTIONS is listed as horror, mystery and sci-fi. There's nothing sci-fi about it. \"Science\" doesn't make an appearance in this movie. It COULD possibly be a mystery since it's definitely a mystery why anybody would write such an inept story. It IS definitely horror because incompetent horror writers often make no effort to make any sense or offer a coherent plot. And that describes this movie PERFECTLY.","user":"S_Soma","rank":[121,170]},{"title":"This is the worst movie I have seen in years.","rating":1,"date":"13 February 2019","review":"The main premise of the movie is an intriguing one: a broken family wakes up to find their house encapsulated in some sort of metal (trapping them inside), while cryptic instructions appear on their tv, of which they are supposed to follow.<br><br>At first you may think that some sort of sadistic, advanced killer is playing games with these folks, or, as the characters suggest, a govermental plan has been put in place as a result of terorism. This is not the case although anything would've been better than the true antagonist.<br><br>No, the real villain is some sort of wire alien portrayed by the worst special effects since the blob, that has taken over the world and wants people to worship it and can mainly communicate through glowing green letters on really old tv's.<br><br>The acting isn't awful. The characters have various background issues that are intended to keep the viewer interested but ultimately affect nothing in the real plot.<br><br>I actually made an IMDB account just to vent about my time being wasted by such a disgracefully bad film.<br><br>Please watch anything else or even an old show as this movie will do nothing but disappoint and make you angry for your lost time.","user":"cmgtxrock","rank":[51,68]}]