[{"title":"Birdman, or How to Make an Audience Not Care What Your Movie Is About","rating":3,"date":"15 November 2017","review":"You can't watch \"The Ornithologist\" as a traditional movie. You have to instead approach it as you would a poem, just opening yourself up to sensations and images to see what they might say to you.<br><br>I can and have really enjoyed this kind of movie watching -- I'm thinking of a film like \"Last Year at Marienbad\" or any number of David Lynch's movies. But they have to be done extremely well to work, and \"The Ornithologist\" just isn't.<br><br>The motifs in this film are largely either sexual or religious/spiritual. A bird watcher finds himself lost in the wilderness when his canoe capsizes. He's captured by two fellow hikers who intend to castrate him as part of some strange ritual, but he escapes. He comes across some random dude and has sex with him on the beach before stabbing him. He comes across some other dudes dressed like birds and engaging in some kind of midnight bacchanalia. Toward the end, the actor playing this man is replaced by the actual film's director. Along the way, the director shows shot after shot of birds when he seemingly has nothing else to do or say, and sometimes we even get shots of the protagonist from the birds' perspectives.<br><br>Of course one will be tempted to impose meaning on all of this randomness and will probably be frustrated by the film's resistance to making that task easy. I was fine just going along for the ride, but once I realized this film wasn't saying much to me, I gave up on it and stopped caring much about anything happening on screen. It doesn't help that I'm not a remotely religious person, and that the strong religious themes in the movie meant nothing to me. Perhaps someone who is more interested in the big questions surrounding God and faith would find more to enjoy, but I'll never know.<br><br>Grade: D","user":"evanston_dad","rank":[26,35]},{"title":"Truly Awful - Surreal without Sense","rating":2,"date":"4 July 2017","review":"A mash-up of \"Dead Man,\" \"Swiss Army Man,\" and \"Birdman,\" with none of the charm of those films, in the end this never-explained mystery seemed more like \"Blair Witch, now in Color!\"<br><br>Viewers familiar with the biblical story of St. Anthony might find a plot where I found none - What I saw was a series of improbable/nonsensical events, thrown in a blender, with a dash of male and female nudity to get the sheep into the theater.<br><br>The only aspect I found interesting, was the combination of timeless elements (lost in the forest, the struggle for survival) with timely influences like cellphones and lots of plastic water bottles.<br><br>Adding to the confusion: despite losing most of his supplies, his food and his meds, the lead character doesn't seem very interested in rescue. He receives text messages on his phone but never tries to reply, ignores a helicopter overhead, and turns down an offer by a group of topless women to literally call him a ride.<br><br>Is our protagonist, a self-avowed atheist, trying for a spiritual journey? This viewer was left in the dark.<br><br>In the final shot we have returned to the city, but have our lead characters (now a couple) survived, died, or transformed? The end credits clearly offer a clue, but it only made the movie more mysterious - and less palatable - to me.","user":"g_imdb-43","rank":[27,41]},{"title":"Totally mesmerizing and completely baffling","rating":8,"date":"7 September 2017","review":"When I came out of The Ornithologist I was totally perplexed and unsure of what I had just seen. At one point I thought it was a film about one man's descent into madness, at another I thought it was a tale of the mystery and spirituality of nature and the unknown, a film about loneliness and despair, then I thought maybe it was a character study of queerness and male sexuality. For all I know this film could be all of these things or none of them whatsoever.<br><br>Because I don't want to spoil anything - and because I can't describe what happens in this film without sounding like a lunatic, I'll say this: the film follows a solitary Ornithologist who gets lost in the forest and the increasingly strange things that happen to him as he tries to find his way home.<br><br>Funnily enough, The Ornithologist plays almost like a parody of an art-house film - and like most art-house, this is not a film for everyone. Consider yourself warned. In terms of its structure, the unfolding of its narrative as well as the way it uses images and sounds to unnerve and to hypnotize you - this is either going to infuriate or bewitch viewers. I can happily say that I was completely bewitched. I fell under its spell, it got under my skin in a way that I cannot describe and I couldn't stop thinking about it after I saw it. I am under no illusion that I understand most of what I saw, but watching it I could tell that this is exactly the film that director João Pedro Rodrigues wanted to make - it makes no compromises for anybody.<br><br>The Ornithologist is daring and strange - there are so many unanswered questions, and I couldn't possibly explain to you what it's about or what happens without sounding certifiably insane, but I am so fine with that - I was completely mesmerized. Give it a chance; you might hate it with every fiber of your being or you might love it and be as enchanted by it as I was.","user":"Jesse_Ung","rank":[29,46]}]