[{"title":"A warning, not a review.","rating":1,"date":"25 December 2015","review":"I'm actually an hour and fourteen minutes into this movie while writing this. A brief summary; a meteor lands in a small town turning all the dogs into crazed killers and the people into mindless idiots. This movie is not scary, only annoying. Horrible plot, horrible acting and horrible characters. I really don't care if any of these people survive. I'll watch it to the end only because it's been a long day and I'm too tired to care. But please don't make the same mistake I've made and stay far away from this one. Watch the Green Inferno instead, at least it had some laughs.<br><br>It mercifully just ended, one of the worst movies ever. Pray there will not be a sequel.","user":"andreask-07174","rank":[21,23]},{"title":"Cats!!!","rating":7,"date":"10 June 2017","review":"Did any of the good citizens see the cats high up in the trees? Generally dogs don't climb trees. Cats do. These cats had enough sense to get as high above the ground as possible! If I look up and see hundreds of cats in a local tree they'll soon have company. ME!! And no entry here has mentioned the cats!","user":"ronaldt49","rank":[5,5]},{"title":"If you love truly terrible movies, watch this one","rating":1,"date":"8 October 2016","review":"This is one of the worst movies I have ever wasted 2 hours on. It has little to no plot and none of it is original. Something happens and dogs begin attacking and eating people. Bleh! The characters in addition to being 2 dimensional make every wrong choice they could possibly make. <br><br>Usually the point in disaster movies is to survive whatever has happened. Not this one. The characters do everything possible to get attacked by the dogs except perhaps hanging raw steaks around their necks.<br><br>I've seen some bad movies in my time; Mysterious Planet were you can actually hear the guy in charge (I will not use the term Director) yelling directions to the cast and Plan 9 From Outer Space which I still don't understand and this one ranks right up (or down) with them.","user":"sorceress2","rank":[5,5]}]