[{"title":"Seen it all before","rating":5,"date":"7 May 2019","review":"Run-of-the-mill cliche horror with jump scares you see coming a mile off. The characters make baffling decisions and the ending is poor. You may have some fun if you go in with extremely low expectations.","user":"dynamiteheaddy-43387","rank":[124,150]},{"title":"The Curse of La Llorona cries itself to sleep with ineffective jump scares and a repetitive plot.","rating":3,"date":"6 May 2019","review":"\"The Bad Spell of My Sharona\". \"What's the Capital of Arizona?\". \"I'd Rather Be in Barcelona!\". The metaphysical entity that has now manifested into \"The Conjuring Universe\" has certainly had its highs, mostly with James Wan involved, and lows. \"The Benefits of Swedish Krona\" may just be the lowest point that this franchise has dipped to. It's rare, especially for me, for a horror film to be completely ineffective yet director Chaves (his debut!) releases a relentless amount of jump scares that were both predictable and tamer than a domestic cat. A case worker uncovers a dark secret involving a weeping ghost known as La Llorona who haunts families and takes children. It comes as no surprise that she starts experiencing her curse.<br><br>\"The Woman from Oklahoma\" is frustratingly poor, mostly stemming down from the atrocious writing. The expositional script is nearly absent of any character depth for both the titular ghoul and Velma (forgive me, but Cardellini will always be my Velma). The loose connection with \"The Conjuring Universe\" is that the father, who explains the entire motives of La La Loner, is the same character from the original 'Annabelle'. That's it. The amount of exposition, for a plot that really doesn't need any whatsoever, is atrocious. And yet, somehow, we practically have no idea why La Macarena is stealing children and how she came about doing this!? All these pathetic explanations and no frickin' depth.<br><br>Cardellini was sensationally good. Seriously she saves the film from being the worst of the year (thus far...). Displaying a range of emotions for her children and a ridiculously commanding presence. Sweet lord, I love her. But Velma clearly needed the rest of Mystery Inc. to satisfyingly unmask La Diploma. When Chaves decides to unveil the ghost in the opening sequence in her full form, it leaves little to the imagination. This therefore results in every jump scare (and there are many...) and suspense-driven camera movements to be ineffective.<br><br>There is some ingenuity used in various scenes, the umbrella scare was minimally chilling and the long take following Velma throughout her house was well executed. But it's not enough to differentiate itself against every other generic horror film one could easily find on Netflix. The quality and effectiveness that mostly exists in this cinematic universe is not present at all! Predictable right from the bloody start. Velma's children make so many stupid choices that she should've just given them to La Lymphoma. Do not get me started on that doll sequence as the girl reaches out for it on their porch. There's plenty of choking. Eggs explode blood!? Lord, take me now!<br><br>Cardellini deserved better. Way better. It started off with an interesting approach on child abuse, but no. Should've known it would throw that out of the window. What should've been a decent mainstream horror turns out to be a supernatural disaster. \"I'll See You in Roma\" wept its last tear.","user":"TheMovieDiorama","rank":[122,153]},{"title":"Flat, boring and filled with clichés","rating":3,"date":"2 May 2019","review":"Honestly I'm surprised with all the good scores in the user reviews. I'm surprised as this was easily one of the worse movies I've ever seen. The acting was subpar, the plot was so incredibly flat and easy to guess beforehand, the dialogue was futile and almost like something a writer threw together in a day or two.<br><br>If it wasn't for the decent effects, the mostly atmospherical suspense and the children's surprisingly decent acting I'd give this an even lower score. It's that bad. Don't waste your money on this like I did.","user":"Jimztah","rank":[70,87]}]