[{"title":"Worth it for Hoult and Spacey","rating":7,"date":"5 May 2018","review":"This may be an old-fashioned bio-pic, but there's nothing terribly wrong with that. It's subject is intriguing, the story it tells is emotionally engaging and - unlike so many recent, showier bio-pics (The Imitation Game springs immediately to mind) - it doesn't play so fast and loose with the facts that you're left questioning whether it was really worth the effort. It's slickly directed and boasts a cast of extremely fine actors, among them Victor Garber, Hope Davis, Jefferson Mays and Sarah Paulson. But the two main reasons for watching are Nicholas Hoult and Kevin Spacey. Hoult gives his best performance since A Single Man, while Spacey (as Salinger's teacher and mentor) pretty much steals every scene he's in. If recent revelations result in Spacey being forever black-listed by Hollywood it will be a great shame.","user":"ozjosh03","rank":[16,17]},{"title":"not really a people person","rating":6,"date":"6 September 2017","review":"Greetings again from the darkness. \"Holden Caulfield is dead.\" So states Jerry's letter to his mentor. You likely know Jerry better as J.D. Salinger, and he wrote that while hospitalized with Post Traumatic Stress Syndrome after WWII. Of course, we know this proclamation is premature, as Holden Caulfield is the main character from Mr. Salinger's famous (and only) novel, \"The Catcher in the Rye\"  a high school literature staple for decades. <br><br>Imagine your dream is to become a great writer, but your own father continually reminds you that \"meat and cheese distribution has been good for this family.\" Your restlessness often works against you, and though you are hesitant to admit it, a mentor for writing and life direction is desperately needed if you are to avoid the family business. Enter Columbia professor Whit Burnett (Kevin Spacey). <br><br>This is Danny Strong's first feature film as a director, though you would surely recognize his face from his frequent acting appearances – often as a weasly character. He is also the creator of TV's \"Empire\" and wrote the screenplays for THE HUNGER GAMES: MOCKINGJAY (Parts I and II) and LEE DANIELS' THE BUTLER. Strong does an admirable job in showing the commitment required to hone one's writing skills and proving \"the difference in wanting to be a writer and actually being one.\"<br><br>Jerome David Salinger is played well by Nicholas Hoult. His scenes with Spacey's professor are the film's best, and Hoult also shoulders the responsibility of Salinger's writing frustrations, personal life challenges, military service, and finally, his decision to become the most famous and long-lasting recluse (by comparison, Howard Hughes was an amateur). <br><br>We learn that Burnett was instrumental in getting Salinger's first short story published, which finally gave Jerry the answer needed for a writer's most dreaded question, \"Have you been published?\" Quite a bit of time is devoted to his odd romantic relationship with Oona O'Neill (Eugene's daughter and the future, long-time wife to Charlie Chaplin). Zoey Deutch (daughter of Lea Thompson) plays Oona as an enigmatic lover attracted to Salinger's genius, but incapable of being patient for his career that might happen (and might not). She opts for the sure bet.<br><br>Salinger's military service included Utah Beach on D-Day, and nearly as remarkably, his toting the tattered manuscript 'Catcher' pages throughout his tour. He returned home in 1946, and in 1951 \"The Catcher in the Rye\" was published. It's been referred to as the Great American novel and a rite of passage, while also being banned and derided for its whiny Holden.<br><br>Director Strong emphasizes Salinger's turn to Zen Buddhism and his sessions with Swami Nikhilanda, as well as his evolving distrust of stalking fans and two-faced media. Support work is provided by Sarah Paulson as Salinger's salty agent, Lucy Boynton as his wife, Victor Garber as his father, and Hope Davis as his supportive mother. Just as in real life, we get nothing of Salinger's later years of solitude and isolation in New Hampshire, where he died at age 91. <br><br>The book has sold more than 65 million copies, and continues to sell well today. In a shift from the recent documentary SALINGER by Shane Salerno, and the book \"J.D. Salinger: A Life Raised High\" by Kenneth Slawenski, this dramatization doesn't dig too deep, but it does allow a new generation to personify the legend. Perhaps it even paints a picture of a better/nicer man than what his real life actions showed. Regardless, the older Salinger certainly seemed to embrace the cause of \"write and get nothing in return\".","user":"ferguson-6","rank":[42,53]},{"title":"Nicholas Hoult is excellent in this film.","rating":9,"date":"21 December 2017","review":"A fascinating portrait of J.D. Salinger. My concern is that people may skip it due to the Kevin Spacey scandal. it deserves consideration.","user":"artholst","rank":[29,36]}]