[{"title":"Movie that I thought would be good but really made me upset","rating":6,"date":"16 April 2017","review":"I was expecting the movie to be more about the kids, but it was mostly about their horrible parents.<br><br>Tony's mom was dumb, rude, and sexist. Jake's dad needed money that was rightfully his to support his family. He tried to be as reasonable as he could and offered her a fair deal, which he was not legally obligated to do. She argues that she doesn't owe him anything, even though she does, and continuously insults him. She claims that his father cared more about her and thought it was wrong for a woman to financially support her husband. When she finds out his family needs the money she says that it's not her problem, even though it technically is. She also brings her son down into the feud.<br><br>Jake's dad is not much better. He evicts Jake's best friend without considering how it would affect Jake. He doesn't want Jake to hang out with the only friend he has. When he yelled at Jake in the car, I wanted to kill him. He calls Jake selfish when all Jake wants is to keep his best friend. He gives no regard to his own actions. He even insults Tony's acting skills. He is supposed to be the adult, but his son was the real adult in the family. I was disappointed at the end when Jake apologized to his father, as if he did something wrong.<br><br>I loved the kids. They were both really lovable characters and really cute. I admired their friendship and that they didn't let anything destroy their friendship even when their parents actively tried to. If this movie focused just on the two of them, it could have been great.","user":"benghill","rank":[12,14]},{"title":"Enjoyable enough...but it doesn't quite hit the mark.","rating":5,"date":"9 April 2016","review":"\"Little Men\" is a film I just saw at a film festival. While I have nothing against the movie, I did find that it left me feeling a bit flat...like the film just didn't quite hit the mark. The ending certainly contributes to this feeling.<br><br>When the film begins, a family moves to Brooklyn from their home in Manhatten. This is because the grandfather has died and they've decided to move into Grandpa's home. The son, Jake, is a loner who loves to draw and you assume this move will be tough on him. However, their downstairs renter has a son, Tony and the boys soon become best buddies. But when a rent dispute occurs between Jake and Tony's family the story comes unraveled and just ends.<br><br>The picture has some nice things going for it...such as Michael Barbieri's nice performance as Tony. But the ending left me and some others in the audience a bit disappointed as the resolution just seemed flat.","user":"MartinHafer","rank":[38,52]},{"title":"A severely underdeveloped wasted potential","rating":4,"date":"6 January 2017","review":"Had this movie been more about the boys and less about the hard-to-like adults, it could have been something pure, fresh, exciting. Unfortunately, it turns out to be nothing but a constant skidding into the margins of a plot that never gets past the original idea.<br><br>Was this filmed with the sole purpose of indulging the viewer with a superbly shot, colorful urban reality? It gains ground there. Maybe we were supposed to pour out our emotional responses on account of Greg Kinnear's, admittedly very talented, ever-downcast writhing eyebrows? Because that would be another minor win for Little Men.<br><br>Alas, I don't think either of those points carry any sort of validity so, all in all, it all wraps up into a sad 'no'.","user":"pauliecorleone-72628","rank":[19,25]}]