[{"title":"We laughed on and off most of the way through the film...the problem is that this isn't a comedy","rating":3,"date":"1 November 2016","review":"We just saw this newly released film. It is another in an ongoing stream of films that target the movie-going Mormon audience. <br><br>First of all, I applaud the efforts of film makers to produce family-friendly, watchable and uplifting movies. Sometimes however the quality just isn't there...and that is the problem with this effort.<br><br>The basic story line: Mormon missionaries are serving in Australia while the 1956 Melbourne Olympics were on the horizon. The challenge is that the Australian Olympic basketball team is pathetic and the coach needs help. He discovers an unexpected resource that might just solve his problem - North American missionaries who grew up playing the game, but as missionaries will they be permitted to play? <br><br>OK, about the film, in a word it is disappointingly amateurish and painfully low budget. The script includes dialog that is so predictable and painful that my wife and I looked at each other on and off throughout the film and alternated between chuckling, laughing out loud and groaning.<br><br>Don't get me wrong, this is a fantastic story and one that deserves to be told but the presentation of some of the characters, e.g., the mission president, his wife, the missionary's parents and some others were just too much - only caricatures of reality and all too predictable!<br><br>There were also some things that were distractions in the film that pulled my attention away from the story. The film-makers apparently didn't do much in the way of fact- checking and you can see artwork hanging on the walls of various rooms that are pieces that were produced well after the 1950s. I won't say which ones but they were pretty obvious to those familiar with modern Mormon artwork. <br><br>BTW if you are hoping to see some good basketball footage in this story (that revolves around basketball), sorry, it's just didn't happen. The basketball scenes were over- choreographed and there was very little actual ball playing that made onto the film. And the footage that was included revealed that the main actors weren't very good ball players. Maybe it would have been better if they had just filmed some cast members and extras actually playing. It's OK if a main cast member isn't a very skilled player. <br><br>To sum up...<br><br>Story potential = 10; Script = 2; Acting = 3; Continuance and accuracy = 3; Casting = 2; Cinematography = 2; Sports reality = 2<br><br>I wish my review was more positive, but this movie isn't very good. <br><br>Lest anyone think that this review is a bash at Mormonism, I am a fully active member of the Mormon Faith and I too served a mission. It's just that IMO that movie left a lot to be desired.","user":"holysmokes6","rank":[17,26]},{"title":"This Is a Winner!","rating":9,"date":"7 March 2017","review":"After reading the review in the local newspaper I decided to skip seeing this in a theater. Then I heard raves from my cousin and his wife and decided to check it out with my wife. So glad that we did as we really enjoyed the film. Based on true story that we were not familiar with but one that was fascinating to learn about. Mormon haters will go on hating Mormons but any reasonable person will find this story of missionaries getting involved with helping train a team about to compete in the Olympics to play better basketball is exciting and inspiring. Now out on DVD I highly recommend it to sportsmen and families who love faith building movies.","user":"blue-7","rank":[5,7]},{"title":"Excellent! A Heartwarming Story That Uplifts","rating":10,"date":"21 October 2016","review":"This is an upbeat story the entire family will enjoy. It just told a wonderful, true story.<br><br>It contained absolutely no objectionable material of any kind. Hollywood take note. We want more movies like this.<br><br>The actors were genuine.<br><br>The 1956 setting was believable.<br><br>There were a couple inside jokes but if you've watched The Other Side of Heaven then you'd get it.<br><br>We watched it in Provo, Utah and the audience applauded when the movie was over. What a great compliment. You will be uplifted and happy you watched it.","user":"writeexpress","rank":[11,20]}]