[{"title":"The Age of Shadows","rating":10,"date":"4 February 2020","review":"Jee-woon Kim isn't coy about the narrative, we know where the character's loyalties lie and who/what they are playing. You'd think this would suck the tension out of this kind of movie, but it merely shifts the plot's focus to more interesting areas.","user":"MR_Heraclius","rank":[37,39]},{"title":"The movie you have to experience","rating":8,"date":"12 September 2016","review":"Based on the real story that happened during the time that Japan ruled the Korea, The Age of Shadow is very successful history-based movie. It is a fine mixture of Korean characteristics and Western characteristics. Until these days, many Korean movies have sought for ways to put Korean-exclusive stories into the frame of Western film-making. The result has been somewhat successful but also somewhat disappointing. It fulfilled Korean people's wishes to watch Hollywood-ish Korean movies. However, it couldn't convince foreign people of the reason to watch Korean movies instead of Hollywood movies. I mean, no matter how hard Korean movies try, the budget is lower than Hollywood, and spectacles are also lesser.<br><br>However, this movie, The Age of Shadow, is different. This one is unique. I'm not going to praise action scenes, or comedy scenes because they were not that outstanding. What I want to praise is atmosphere in this movie that keeps suspense alive throughout the whole running time. Well, for better understanding I could use Quentin Tarantino as an example. Even though he is famous for violence in his movie, many people who watch his movies for the first time find them very non-blockbuster like but still quite amusing. The Age of Shadow is quite similar. This movie's acting, dialogue and visuals give this movie a special atmosphere that keep audiences' focus. I'm not saying that this movie is Tarantino-like though. Kim Jee-Woon and Tarantino are similar in a way that they use special atmosphere throughout the movie but their atmospheres are different. Kim Jee-Woon has the ability to form a Korean-exclusive atmosphere that is based on Korean culture. I'm not sure how to name it but it is something that can move Korean people's heart without stating it in a specific way. And I believe this movie will be quite amusing and also exotic experience for you if you are not Korean. This movie is not like other Korean movies, but also the most Korean-like movie. I recommend it.","user":"kanyeezy-28832","rank":[31,44]},{"title":"So much in this film it feels like watching a Beethoven Symphony!","rating":10,"date":"15 September 2016","review":"Mil Jeong (밀정 ~ The Age of Shadows). <br><br>Viewed at 2016 Venice FilmFestival. Tremendous Korean epochal drama about life and resistance under the oppressive Japanese occupation in the early decades of the century. Director Kim Jaewoon really knows how to set up drama and suspense mixed with blazing action. There was so much in this film that I felt like I was watching a Beethoven symphony. Dark Sepia toned photography used to good effect enhances period feel. Musical soundtrack employs jazz and adrenaline tensor stretches and the final shootout in the train station is orchestrated deftly to Ravel's Bolero.<br><br>139' running time is long and winds up with several anticlimactic codas but never lets you out if its grip. For Koreans this is clearly a film with heavy patriotic messages. The final theme is \"Don't let your failures stop you -- build on them and rise to the next level\" -- until victory is achieved. I would love to see this film with a Korean audience and would expect to see people on their feet cheering at the end... A young Italian I met afterwards said he loved it even though he knows nothing of the history involved. I could easily see why -- in a way this is something like a Kimchee spaghetti western and charismatic actor Kang-ho Song, 49, has got to be the Korean equivalent of John Wayne, or at least, Robert Mitchum.","user":"alexdeleonfilm","rank":[22,36]}]