[{"title":"4.5 millions for this","rating":1,"date":"3 March 2020","review":"2020 they still make movies like this, badly shot in the first place... poor Jeff Kober really great actor, reduce to playing in z grade horror movies.<br><br>Nothing new and more stupid teen getting drunk and stupid. Pass this one up","user":"kaefab","rank":[9,10]},{"title":"A boating disaster","rating":1,"date":"9 March 2020","review":"Although the concept of rich college kids battling hillbillies has been massively overdone in the film industry, the genre still attracts viewers when done right (Like me!).<br><br>Well, this title does nothing right...<br><br>For the first time in my life, I wanted all the characters dead, right after they had a few minutes of screen time. There was nobody for me to root for... not the stupid kids, not the dumb fishermen either.<br><br>How do they make movies as bad as this one and not retire from the whole industry, feeling ashamed of the outcome?<br><br>P.S: I didn't get the kiwi references that kept popping out now and then. It must have been a kind of an inside joke.","user":"bcansevgisi","rank":[1,1]},{"title":"A fun Ride No Matter Your Generation!","rating":9,"date":"3 March 2020","review":"I'm a sucker for suspense thrillers and I have to say this was such a pleasant surprise! Despite my being part of Generation X, I completely enjoyed the dynamics between the younger Millennial crowd, as some things always remain the same. The Have and Have Not's of young adult social networks permeate every generation and you see a lot of that playing out in the undercurrent here. We've all been there, Jocks, Trust Fund kids, Prom Queen and that everyday Joe that somehow becomes lucky enough to be invited into the inner sanctum. So what happens when you slam them all together in a flight or fight scenario on the water?<br><br>Particularly notable performances include Jeff Kober (as to always be expected), the salty source of unease which juxtaposes well against the frivolities of youth, especially wealthy unbridled youth. Also worth mentioning is the always quirky offbeat humor of Matty Cardarople (Stranger Things) and the shadowy ominous performance of John Bellman as Bobby, Jeff Kober's first mate on this boat destined for hell it would seem. We follow this cast on a unplanned adventure into deep waters where no one can hear their screams and their their wallets can't pay asking price for survival. It's definitely a fun watch especially for those who secretly always wanted to see the popular kids have a dose of reality.","user":"breemichaelwarner","rank":[4,9]}]