[{"title":"Demon","rating":9,"date":"25 February 2017","review":"The Jewish legend of the \"dybbuk\" is earning prominence in horror cinema; and, to be honest, I find the movies employing it more creative than most of the tales about Catholic exorcisms. I think The Unborn was the first one I saw, and the simple change of mythology was enough to bring it a fresh and different atmosphere; The Possession put a girl in danger, with unexpected spiritual consequences; and more recently, it was the turn of Demon (probably the first Polish horror film I have ever seen), whose interpretation of the dybbuk is adorned with copious references to Jewish culture, possible psychological explanations and abundant black humor which lightens the experience without diluting its general impact. It might even be more adequate to classify Demon as a black comedy, or maybe as a psychological thriller, because even though the first minutes seems like an usual horror introduction (the opening of a secret tomb), the rest of the tale lacks of the formulas commonly associated to this genre: there are no shocks, or violence, or special effects; we simply have a man erratically acting during the noisy reception of his wedding, while the guests try to find a rational explanation to his behaviour. Besides, the affair of the dybbuk can be taken as a metaphor of the abrupt change implied by the marriage, altering the life of the bride and the groom who will never be able to recover their individual identities; or, in the worst of the cases, it might represent an analogy of those people who discover they got married to someone very different than what they expected too late. Or maybe, it might be a comic farce in which the humor arises from the contrasts between the joyful family celebration and the groom's internal turbulence, possessed by an evil spirit, or a ghost looking for justice, or the fear to marital commitment. Anyway, I found Demon a fascinating variation of a sub-genre which rarely offers innovation, supported by the excellent performances from the whole cast (highlighting Itay Tiran, who brings an amazing work in the leading role) and a bizarre energy. In summary, a unique experience which might or might not belong to the horror genre... until we get to the somber ending, and we remember why the dybbuk belongs to that genre.","user":"Argemaluco","rank":[16,18]},{"title":"'Demon' is the strangest wedding movie ever!","rating":7,"date":"26 September 2015","review":"Every couple has their own expectations and fantasies for their wedding day. It's usually filled with flowers, rings, songs, and tons of drinks, hugs, and kisses. Every goes home, snuggles with their loved one, and almost always lives happily ever after. Most people say that your wedding day is one of the best days, if not the best day of your life, but that's not the case with Marcin Wrona's 'Demon', which is more or less an odd tale about the Jewish myth of the dybbuk.<br><br>First off, this film is beautifully shot. Wrona's eye for such a haunting atmosphere such as this setting is unlike anything I've ever seen. Even though the film takes place over the course of someone's wedding day, the mood and setting is extremely uneasy, as you'd expect something very sinister to pop out at any moment. There is a very Kubrick-ian feel to the movie as well, letting shots linger to build suspense and tension. The follows Piotr and his soon-to-be bride as they cross a river to a family plot of land to exchange their vows and dance the night away at their reception.<br><br>Soon enough, Piotr hears some strange noises, inspects these sounds outside and falls into a pit of mud. Next thing you know, he's cleaned off and about to marry his beautiful bride, but he starts showing some very strange behavior in the form of having seizures, speaking different languages, and seeing things in the distance. The wedding party, mostly his brother-in-law and father-in-law begin to think the worst and try to calm the guests from having a meltdown, which was strange, because most all the guests at the party are either drinking heavily, having sex, or dancing with a mixture of all three at certain points.<br><br>It was a bit of comic relief for sure, but the one person who might know what's happening with poor Piotr is a Jewish professor, who does indeed believe Piotr is possessed by something on his wedding day. Things eventually play out fairly slowly in a very 'Shining-esque' way, which is also similar to Kubrick here, which was nice to see. I wouldn't say 'Demon' will scare the socks off of you, but it builds some fairly good suspense throughout until its reveal, which will have you thinking back to the very beginning of the film and everything you've seen up until then.<br><br>It's a shame and very sad that director Marcin Wrona suddenly passed away less than a week ago from writing this review, because if this film 'Demon' is any pre- cursor for what he could have done behind the camera, we would have seen greatness.<br><br>Recommended!","user":"bryank-04844","rank":[31,42]},{"title":"I guess this might be a spoiler but everyone is missing an important point","rating":10,"date":"16 October 2017","review":"A little unpleasant Polish history is beneath (no pun intended) this story. After the Germans invaded and murdered Poland's two million Jewish citizens, a lot of vacant property was left behind.<br><br>That's all I will say, except this is a wonderful ghost story and it's truly sad that the director chose to take his own life.","user":"prathert","rank":[16,20]}]