[{"title":"The movie is really good, but it does not tell the whole story.","rating":9,"date":"7 September 2018","review":"The movie is really good, but it does not tell the whole story.<br><br>The director explains it by telling that he wanted to show the humanity of the Kursk's crew members from one side, and the bureaucracy of the upper military officials on the other side. And that he wanted to leave the politics out of the movie. <br><br>In my opinion, the director missed one important fact from the Kursk's story.\nAs you know, the sailors in Russia are drafted to serve in NAVY. And many of them are not willing to sacrifice their lives for sake of competition between superpowers. This movie misses the fact that sailors in one sinking compartment heavily beaten their officer who closed the door between the compartments, thus preventing them to escape from the doomed compartment. This fact was discovered by investigators after reading the note found on the drown officer. I think, this fact should have been reflected in the movie, too.<br><br>\nThe second important fact is that all families of dead sailors received, first time in the history, serious monetary compensation (ten-year salary) and apartment for living in major Russian cities. And almost all of them accepted this compensation, and we cannot blame them for that!","user":"sergey-vasilyev2007","rank":[217,265]},{"title":"An excellent made French-Belgian dramatic production.","rating":9,"date":"21 February 2019","review":"This film was excellent in every aspect. Directing by Thomas Vinterberg was amazing (except for the annoying black edges at the start and end of the film - why?). Writing/screenplay by Robert Rodat was great. Cinematography near perfect. Casting was outstanding - as were the performances by all. The score/music was bang on. S/VFX were perfect. My only critique is that the almost 2 hour length felt longer due to some slow pacing issues. Otherwise, an excellent film that leaves an uneasy feeling in your stomach, knowing that this film is based on actual events. A well deserved 9/10 from me.","user":"TheTopDawgCritic","rank":[69,86]},{"title":"Almost 20 years ago now","rating":7,"date":"8 April 2019","review":"I remember watching the tragedy unfurl in real time when I was in the Russian army. That was on BBC and I don't remember the Russian media covering the story as objectively. The film is enjoyable","user":"sandland","rank":[32,39]}]