[{"title":"Human Destruction","rating":6,"date":"10 February 2017","review":"Good ol' Third Window Films have been tagging this new release from Tetuya Mariko as 'The most extreme 108 minutes in Japanese cinema history.' Not 97 minutes, or even 124 minutes. Specifically 108. Now, lines like this will typically only ever lead to disappointment. But, trusting Adam Torel at Third Window's cinematic filter, I went into this one with anticipation, but a slight air of trepidation. <br><br>We open with a scathing guitar over shots of a sleepy harbour, where Shota spies his brother, Taira (played by the now more grown up Yuya Yagira), being beaten up by a gang of local thugs. Chased off by Taira's boss, he dusts himself off and chases off into the distance, to escape his everyday life and court death. <br><br>The next sixty (not quite 108) minutes or so are a beat 'em up style journey as Taira makes his way into town, picking a fight with literally any male he comes into contact with. He provokes, encourages and goads any would-be opponents to hit him, taking some beatings, but always coming back for more. Without a thought in his mind, like a rabid dog, he only wants to fight. <br><br>His rage of destruction leaves a trail and soon gains him attention, picking up the cowardly Yuya along the way, an irritating accomplice that films his actions; a youth desensitised to morality, taking satisfaction only in what he can share on social media, eventually building up the meagre courage to hit those weaker than him; while Taira hits out at anybody in his path.<br><br>This is quite uncomfortable viewing. The fights are often filmed in single takes, with actors tiring, turning fights into grapples, rather than the cinematic endless fist fights often portrayed in movies. The impact of blows is felt through the screen, without dramatic sound effects in accompaniment, leaving their severity to speak for themselves. The first two-thirds are simply violence without any real purpose, other than the understanding that Taira has lost all sense of meaning for the world. In parts, this is delivering on its extreme promises. <br><br>However, with films of this nature, an endless stream of violence will only end up becoming boring for the audience. Once seen long enough, you too will become desensitised to the violence. This is perhaps where 'Destruction Babies' starts to lose its way, if Taira already hadn't. Fleeing the town with the kidnapped Nana, they lack a clear direction, as does the film momentarily, sitting in wait until Nana's fury is unleashed at her situation resulting in murder. A brief return to senseless violence draws the trio's screen presence to a close. <br><br>We then switch back to Shota, where we started, searching for his fugitive brother to no avail. It is in Taira's opposite, his more sensitive younger brother, that we find a sense of meaning in all this violence. His earnest search for his brother fruitless, he is left abandoned by friends and family, the result of violent self- interest. <br><br>Just before the film's conclusion, we see the traditional portable shrine race, with two competing groups vying for superiority. A raucous and violent affair, we see all men pushing and fighting each other for position. The event is eluded to throughout the film, indicating violence is all around us, celebrated and nothing new, and these 'destruction babies' are a product of a long line of history and cultural norms. Though this violence now takes new forms: Yuya's cowardly ways of attacking those weaker than him, filming the deeds for prosperity, and social media sharing, perhaps the most destructive of a youth seeking faster and more immediate extremes. <br><br>Taira's re-emergence in the final shot states that violence is here to stay, with the path to destruction for humanity only to continue.","user":"politic1983","rank":[10,16]},{"title":"Utter rubbish...","rating":1,"date":"20 April 2019","review":"Right, well all I knew about \"Destruction Babies\" prior to watching it, was that it was a Japanese movie, which was essentially all that was needed to make me watch it. Well, and the fact that the title was pretty interesting too, did help of course as well.<br><br>Oh my god. Seriously? This is one of the worst movies I have seen in a long, long time. There was nothing to the storyline at all, no meat on this puppy. The entire movie, well at least the 1 hour and 5 minutes of the nearly 2 hours it ran for, that I endured, was nothing but one continual fight. Sure, the guy went from area to area and fought different people, but that was it. Seriously? Fighting? You can't base 2 hours of movies on senseless fighting and then try to spice it up with shallow subplots. It just doesn't pass as being entertainment.<br><br>I am a big fan of Asian cinema, but \"Destruction Babies\" (aka \"Disutorakushon beibîzu\") was just, and let me be perfectly blunt here, rubbish. Utter garbage and a serious waste of time, money and effort.<br><br>I managed to endure 1 hour and 5 minutes of rubbish, nothing more than a guy picking fights with just about everyone crossing his path. That was essentially the entire essence of the movie. Talk about being ludicrous and lacking proper contents. I just gave up at that point. I was ready to give up 20 minutes into the movie, but decided to keep watching it, as surely there had to be more to the story than just random fighting. Turns out there wasn't.<br><br>The actors in this movie required no acting skills, because it was just random laughable fighting and tossing out a random line of dialogue every now and again. So don't get your hopes up on seeing anything Shakespearian in \"Destruction Babies\".<br><br>This movie was rubbish, pure and simple. And there is no chance of me ever returning to finish the rest of the movie, because it was seriously a complete waste of time and does nothing to enrich your viewing experience in any manner. Stay well clear of this movie. Trust me.","user":"paul_haakonsen","rank":[1,2]},{"title":"Japanese film violence 101: lean and mean","rating":8,"date":"5 March 2019","review":"\"Destruction Babies\" is a film that perfectly illustrates Japanese movie violence-lean and mean. The plot revolves around a violent, nihilistic young man (played with menacing gravitas by Yuya Yagira) randomly picking fights with strangers. Despite being battered to the bone, his peverse persistence attracts another troubled young man (played brilliantly by Masaki Suda) who becomes his wingman. The wingman character films himself and his boss on their beating spree-even kidnapping a young shoplifting cabaret girl (played by the beautiful Nana Komatsu) in the process. They all escape from town but is cut short when the beating spree becomes national news. The violence in this film is relentless-all the fight scenes are very gritty and realistic. Hardening back to the early Takeshi Kitano films (particularly Violent Cop), the violence is quite spontaneous, just how suddenly the nihilist and his wingman picks a fight with anybody on the street. On a thematic note, the film does shed light on the state on current Japanese society. As the fights gain more public attention, the crowds do very little to stop the conflict but rather ignore or film the occurrence on their smartphones. It shows that there is a combine of repressed anger in Japanese society, under the innocent and peaceful facade. The nihilist is an extreme example of a defiant sociopath, while his wingman and young girl represent the cowardly cruel youth, but then transform into monsters that are nastier than the main character. The way the nihilist spreads his act of violence to other characters like a virus is a not too far-fetched-apparently the director Tetsuya Mariko based the film on a real life anecdote. It's not the movie violence of sword slashing and decapitating body parts-it's beat ups that wastes no time, like real street fighting.","user":"bock_g","rank":[1,2]}]