[{"title":"I actually saw the entire movie","rating":8,"date":"4 January 2020","review":"This fast-paced, 1.5 hour, animated film is fictionalized history meant for Spanish kids. The plot is for the fleet to sail west, past the Americas, get spices from the Moluccas, and sail back to Spain, all while avoiding the Portuguese. The portion that Filipino reviewers (who haven't even seen this movie) complain about lasts for about 5-7 minutes, when the protagonists make a brief stop in Cebu and Mactan islands. Lapu-lapu, the Mactan chief, appears for a few seconds and is a brave, muscular guy, as opposed to the corpulent Humabon, the king of Cebu. The battle of Mactan lasts for about a minute. There is nothing about \"colonization\" in this film. It is all about survival and discovery in the first circumnavigation of the world. Oh, and by the way, I am also Filipino.","user":"iacintus","rank":[5,5]},{"title":"Family film","rating":10,"date":"12 November 2019","review":"Elcano and Magallanes la primera vuelta al mundo it's a film produced in The Basque Country, where Elcano was from, the one who managed the first voyage around the world, and he is the hero of this film, cause the important issue is that they completed the first voyage around the world.","user":"jlandaluze-40458","rank":[11,16]},{"title":"Educational and almost perfect","rating":9,"date":"17 February 2020","review":"I've just seen the movie and I didn't see anything offensive to anybody, except maybe to the Portuguese who were depicted as the villains in the movie. I do not understand what the hullabaloo is all about as nothing is insulting to my sensibilities. In fact, the opposite is true - they tried to be as accurate with their \"Visayan\" language as possible and for that I thank the producers. Watch the movie and learn. I AM A FILIPINO, from MACTAN who teaches college Philippine history AND who has shown this movie to my students. ANd We Learned a Lot Watching This Movie.","user":"emilioacedo","rank":[3,3]}]