[{"title":"James McAvoy Carries This Film","rating":8,"date":"2 July 2018","review":"A fantastic performance by the film's star, James McAvoy is reason alone to watch this film. Every personality on display is distinct to the other, and he is so interesting to watch. Anya who was breath-taking in The Witch does a fine job here too. This is a film where M. Night Shyamalan reasserts himself as a serious director following a string of poor films. I absolutely cannot wait for the sequel and the conclusion of the Unbreakable series arriving in January. 8.5/10.","user":"arniecage","rank":[171,192]},{"title":"Great story telling","rating":10,"date":"13 August 2018","review":"What a remarkable film! The premise of the film seems quite superficial at first but as the layers are peeled back there's so much more beneath.<br><br>It's a horror film without special effects gore, an action flick without any car chases. A high-tension psychological thriller for viewers with active imaginations, who don't need to be spoon-fed every explanation.<br><br>The acting is top-notch, the script sympathetic, the cinematography and set fantastic, and the music/sound subtle enough not to be noticed, consciously, while building the tension inexorably. It's gripping, un-turn-away-able.<br><br>Seriously impressive. I don't give 10's lightly.","user":"zlifb","rank":[146,175]},{"title":"Great movie! James McAvoy is awesome.","rating":8,"date":"2 July 2017","review":"This movie will keep you watching waiting for the next character coming out of James McAvoy. He should have won some awards for his performance of a man with many different personalities. James was very convincing in every part he played. The end is great but I don't want to give anything away so I won't comment on that at all. Well written and the actors were perfect. Watch it today, just don't make the mistake of downloading a different movie called Split about bowling. I did that and that is one of the worst movies I ever saw!","user":"sherryismyrealtor","rank":[194,239]}]