[{"title":"A sixth sense comedy","rating":10,"date":"18 August 2018","review":"I read the first review and I must admit-- at first, I had a feeling about expecting a somewhat \"The Diary of a Wimpy Kid\" sort of vibe but, boy oh boy I was wrong. This looks and sounds much better than I expected. The movie itself speaks to me in many levels, bringing me back to my youthful years, and making me feel like I wish I had that much creativity unleashed. What a wonderful, creative and interesting way to portray a wonderful, heart-warming story. <br><br>Not to mention, I didn't even see it coming-- the sixth sense reference. I read the blurb/pitch/short-description of the movie and I was ecstatic to find out in the end that \"Leo\" was actually the younger brother who died. <br><br>A very interesting closure for a wonderful movie. Although, I wish I could have seen a bit more of connection between the Rafe's teacher and his mom. Then again, I think this one was already enough.<br><br>kudos to the makers of this movie! \nhoping to see more like these in the future.","user":"magsirover","rank":[6,6]},{"title":"I actually thought it was pretty good.","rating":6,"date":"8 October 2016","review":"Honestly, It was one of those days when I just wanted to see a movie and anything would do. So I went to see Middle School as it was playing at the time I showed up. I herd of the movie, I did not have low expectations, and did not have any exceptions.<br><br>So what I got is a very entertaining movie. This genre of movie has never peaked my interest, so I was real surprised how much I actually liked it. It's pretty funny. A lot of good jokes that I generally enough to appeal to a large variety of people. A few laugh out loud moments, and a lot of small ones that really keep the momentum going. <br><br>This is despite the fact that the cast of characters was pretty generic and mediocre, except for one named Georgia, the little sister of the main character Rafe. Should have been more of her on the screen. <br><br>Was also surprised at how deep the movie got. It's main plot of letting children be creative individuals did not spark much inside me, but the subplots of dealing with the lost of a family member did hit home, and was delivered perfectly.<br><br>Plus, there was some cool animation in it, and I'm a sucker for that. <br><br>Overall Middle School: The Worst Years of My Life was worth the ticket. It makes me feel differently about movies like this overall.","user":"subxerogravity","rank":[17,21]},{"title":"Fun, adorable, and heartwarming","rating":9,"date":"7 October 2016","review":"#MiddleSchoolMovie made me cry. I didn't expect the story to be so sad, but it really was, and it's all in a good way. The film is fun, adorable, heartwarming and it just makes you want to hold your loved ones closer than ever. There needs to be more and more movies like this.<br><br>The story is quite simple, it's about this young kid named Rafe (Griffin Gluck) who has an active imagination. He loves drawing stuff on his notebook and the characters come to life in this quirky animation which is part of the film's appeal. But Andrew Daly's character, the school principal is anti-creativity, so he's always on Rafe's case. So Rafe strikes back with all kinds of hilarious pranks. But at home, his mom is dating a jerk of a boyfriend who's giving him and his sister a hard time. So all in all, it hasn't been a good school year for Rafe, not to mention his family is still trying to recuperate from a certain tragedy.<br><br>Without spoiling any important plot points, let me just say that the fun parts are fun and the dramatic parts are truly dramatic, this is not a movie that insults anybody's intelligence just because it's a PG movie for younger viewers. Based on James Patterson and Chris Tebbetts' novel that I haven't read yet, but this film sure motivates me to buy a copy, what I think makes MIDDLE SCHOOL effective is that the comedy aspect isn't mean to get your guard down, and the emotional aspect isn't quickly dropped like some kind of anvil. It also opens your eyes, you realize that even a middle-schooler can go through a lot We sometimes underestimate them, we often forget that those formative years are crucial to a human being and so I think the film does a good job of showing that.<br><br>Actor Andrew Daly has played this type of douchebag authoritative role before and so has Rob Riggle in a role of a jerk, so both actors are comfortable in their element, they know what they're doing and they got it down to a science. It's absolute pure joy watching them do what they do best even if we may not like their characters. Kudos to all the kid actors as well, especially Griffin Gluck and Alexa Nisenson who seem so effortless in their performances. What other actors may have to learn for years in order to get to that point of exposing their emotions and shedding it for the screen, these kids make it seem like a walk in the park 'cause they wear it on their sleeves. What an incredible talent for such a young age. This movie's got tons of animation as well that will be sure to put a smile on your face. You will come out of the theater a much better person than when you were when you enter in. That's how surprisingly positive and powerful this film is.<br><br>-- Rama's Screen --","user":"Ramascreen","rank":[19,24]}]