[{"title":"Boring, with a side of terrible acting","rating":4,"date":"17 December 2016","review":"The acting is terrible and overly dramatic. Every scene the actors seem to be waiting for each other to say their lines to each other. Not much comes through as genuine in this movie. Even the organizer of the triathlon (Candace's) fight with cancer isn't heart felt or moving. She's got an amped up persona of a comedic tough chick that fails miserably. The movie comes off extremely scripted and I had a hard time being inspired or empathetic to any of the characters. Near the end there's a death, I won't say who for those that haven't seen it yet, but even those scenes lacked real emotion. The movie tries to use music to substitute for real emotion and that came across over done as well. I was honestly more inspired by watching old news clips of Julie moss as the main character was looking for inspiration. I'm not sure how this ended up with a 7.3","user":"sassy-14613","rank":[5,7]},{"title":"Could Have Been So Good...","rating":3,"date":"17 December 2016","review":"Triathlon is a sport that lends itself to tales of heroism, personal endeavor and triumph over adversity. It's great source material and one day, someone will make a really great triathlon movie. But unfortunately, this is not it.<br><br>As a triathlete myself, I really really wanted to like this film. But the corny story, the cheesy script and the obvious low budget undercut the good intentions of the producers. And it could have been so much better with little or no increase in budget. We all remember training for our first race particularly if (like myself and those in the film) you're starting off from the couch and there are so many great comedy moments that they missed (e.g. your first OWS is always, erm, \"special\"!)<br><br>It would have been nice if the makers had taken inspiration from NBC's always excellent Kona coverage. <br><br>And don't even get me started on the hackneyed ending. You don't get too many \"Julie Moss moments\" in olympic tris, let alone two in one race!<br><br>Oh and PS - no one wears cycle gloves in an olympic! :-)","user":"sm-38721","rank":[4,6]},{"title":"Booooooring","rating":2,"date":"24 February 2020","review":"How can a movie about sports have no pace at all? Just watch this one and you will know. Everything goes slooooooow. Dialogues, scenes, the whole thing is just a waste of time. A movie about tri-athletes and the challenges they have could have so much more than a cheesy story with some lousy acting.","user":"pjgross","rank":[1,1]}]