[{"title":"MotoGP Aficianado's Short Review","rating":10,"date":"12 September 2015","review":"I have waited for years for another MotoGP film. If you've been a fan of other motorsports racing and have thought; \"Why not 2 wheel?\" Have a look! As a neo-rabid fan of everything from Formula One to slot cars, I can tell you from my chair; you aren't going to be disappointed. A much anticipated film to us who already follow the sport; and from the excellent stable of Director Mark Neale. Should this be your first viewing of this form of FIM Grand Prix racing, you'll be pleased to find his other superb MotoGP films are: \"Faster,\" and \"Fastest.\" A totally-complete, excellent review exists also at IMDb, (and I especially liked his Brad Pitt/ Tyler Durden remark). So, \"C'mon in, climb-over and hang on! You are going to be in for a ride!\"","user":"Air America","rank":[29,32]},{"title":"596th Review: Simply One of the Great Sports Documentary","rating":10,"date":"21 May 2016","review":"Moto GP is the fastest track race for motorbikes - Formula One for superbikes. What Hitting the Apex does is make you understand that it's not the machines that make the sport but the riders. These riders risk, literally, their lives for sport and unlike most documentary in other sports Hitting the Apex manages to capture this element well. It also notes that Moto GP has an incredible safety record given how dangerous the sport is.<br><br>The cinematography is top notch, capturing every rev, curve, and spill - above all it captures the rivalries of men who are driven to want only first place.<br><br>This is an excellent and exceptional documentary that captures the excitement, thrill, and drive of an exceptional bunch of individuals, their machines, and crews. It is one of those sport documentaries that shines as it transcends its sport and tell compelling stories about courage and drive.","user":"intelearts","rank":[7,8]},{"title":"Beyond my High Expectations, Outstanding!","rating":10,"date":"23 November 2015","review":"I was at the International Motorcycle show this last weekend in Long Beach and met Mark Neale who I got my DVD through. Just sat and watched the movie with my wife and two boys and it was one of the best movie nights we have spent together because this movie was amazing. We were riveted from beginning to the end. The way the movie followed and built on the racers kept you riveted to your seat. My wife loved it also because it became so personal with the racers and really gave depth to what really goes on in MotoGP. Brad Pitt as the narrator put this movie over the top. Thanks for making it that much better Brad. I regret not getting Mark Neale's Faster while I was at his booth but luckily I can purchase it. Whether you are into racing or not you will not be sorry you watched this movie. Mark we are looking forward to the next one, keep them coming.","user":"stukafgm","rank":[9,11]}]