[{"title":"Lego DC Super Heroes Justice League - Attack of the Legion of Doom!: Very underwhelming stuff","rating":3,"date":"17 January 2018","review":"This is the third Lego DC movie I've watched and continue to be very unimpressed.<br><br>I don't know what the problem is. DC? Check, Lego brand of humour? Check. So why are they so poor?<br><br>The comedy value is lacking, the story is beyond basic and the only thing that it truly has going for it is a solid voice cast (But then again they always do).<br><br>Justice League vs The Legion Of Doom and Martian Manhunter makes his lego debut. Yep, that's basically the complexity of the story right there.<br><br>Silly, simple and sad that this is the state of Lego DC.<br><br>The Good:<br><br>Tony Todd<br><br>The Bad:<br><br>Ending is dumb<br><br>Simply not funny<br><br>Things I Learnt From This Movie:<br><br>I simply can't take the name Legion Of Doom seriously<br><br>DC seems to have forgotten their products main demographic","user":"Platypuschow","rank":[2,3]},{"title":"Two \"ofs\" in the title?","rating":6,"date":"12 February 2017","review":"I did quite enjoy the first entry in the LEGO DC series but the subsequent movies have let me down. Perhaps it was because the first one was based around Batman instead of sharing the time between multiple heroes and because the Gotham City setting was far more atmospheric than the bland Metropolis. There's very little atmosphere to be had here, the backgrounds look like something from Paw Patrol. It would be foolish to expect this to have the same quality as the Lego Movie but it's annoying because I know that they can do better.<br><br>The story has Lex Luthor break into a government installation (Area 52, a joke already done in Looney Tunes: Back in Action) to free a seemingly hostile alien and recruit him to their newly-formed Legion of Doom. Hi-jinks follow. The action is bombastic, chaotic, and hard to follow but the overall interplay between the characters is amusing enough to keep it tolerable. However, the casting of Mark Hamill as Sinestro AND the Trickster (the latter being a role he has now played across three incarnations of the Flash) doesn't fit well with John DiMaggio playing the Joker. Why even have the Joker in there at all if Hamill isn't voicing him? Why is his voice for Sinestro the EXACT same voice he does for the Joker. It's quite confusing.<br><br>Despite getting off to a decent start I am becoming quite indifferent to these movies, we'll see how the next one goes before I checkout completely.","user":"CuriosityKilledShawn","rank":[2,4]}]