[{"title":"Spooky, scary, and great visuals","rating":7,"date":"20 June 2018","review":"This was actually really spooky. The film has some great visuals and an eerie tone. It is a different take on the haunting/possession genre and quite frankly one I enjoyed immensely. This will no doubt go down as a classic.","user":"paulclaassen","rank":[6,6]},{"title":"dark, gloomy and unique, definately worth a watch","rating":8,"date":"23 June 2018","review":"I went into this movie with no preconceptions and I came out satisfied. This is a foreign movie, with subtitles, but this gives it more character and in my opinion adds to the overall unique experience. I watched this with my 13 year old son and he was engaged the whole way through. The plot is tried and tested and nothing new but it is well played out with enough good twists in the plot to keep it interesting and the scares are not overdone or predictable. The epic aerial shots of the snow covered building somewhere in Russia are breathtaking and chilling and add to the uneasy cold gloomy feel that this movie maintains from the first scene. The acting is fresh and authentic and the characters are well cast and presented and are captivating and genuinely likeable, there is a authentic feel to this movie that a Hollywood blockbuster could never achieve. I absolutely loved every second of this movie and will definitely watch it again","user":"garybenade","rank":[4,4]},{"title":"Well crafted, very moody, atmospheric Russian Horror with an EXCELLENT soundtrack... Blu-ray: Excellent A:10 V:9","rating":7,"date":"17 February 2017","review":"Let me say this first, even before the opening credits start, the sound design grabs you right away. It is unusually moody and atmospheric, at least it really had that immediate effect on me.<br><br>Finding English subtitles for it took a little work, since the Blu-ray is released in Germany and has only German and Russian audio and only German and Russian subtitles, but I found them :)<br><br>For me personally, when I watch any films but particularly Horror movies, the thing that really grabs me first and foremost is the tone, mood, and atmosphere. And, let me tell you, this movie has it BIG time! So, if you are like me and you really like that aspect of Horror, you should really like this one. Again, I cannot say enough about the sound design. It is rather dominant and is a large part of the film, but I felt that it added tremendously to the Intensity and Surreal nature of the movie. It isn't aggressive in the sense that it is super harsh or loud, but has a deep, creative, ambient style that genuinely adds to the Suspense of the movie. Some people who may find strong soundtracks intrusive in their Horror films, MIGHT not like it. But, I feel that IF it is done well, it can really add to the feel of the film. It kind of reminds me of Retro Horror movies of the past where soundtracks were more aggressive.<br><br>I can't speak for other people, but I personally kind of preferred the German track to the original Russian. I'm probably going to watch the movie again with the Russian track, but for me, I kind of liked the smoother, calmer sound of the German as a counterpoint to the Dread and Suspense of the film. But, that could just be me; since the disc is German you will have a choice. Being in the U.S. and watching foreign films, it didn't detract really from the movie at all. The German was synced quite well with the actors. Now, with some movies that can really make a BIG difference. One Spaghetti Western I had had a German soundtrack. And, try as I might, it sounded really jarring and I just couldn't buy the Spaghetti cowboys speaking German. But, in this case being a Russian film, to me it blended just fine. That will be up to you which language you prefer...<br><br>I also really liked the pacing and calmness of this film; it had a very classic feel to it, rather than artificial jump-scares or quick editing being dominant. The acting, considering the age of the actors, was actually done quite well I thought. With nice restraint and believability that you usually do not see so often in modern Horror films.<br><br>Since there are SO many different kinds of Horror movies and people have their preferences, I would say that primarily for this film you would have to like the type of Horror movie where atmosphere and mood is emphasized over brutality and gore. There IS some of that here, but this is no Torture Porn film. So, if you are into the 'Action' more so than the Mood for Horror movies, then I'd say you may not care that much for this one. BUT... if you DO really like moody, atmospheric Horror films like I do, then I think there may be a very good chance that you might like this one...","user":"lathe-of-heaven","rank":[12,18]}]