[{"title":"Perhaps this could have been titled \"The death of the IBM PC\" or \"The Rise and Fall of Compaq\".","rating":8,"date":"28 January 2017","review":"\"Silicon Cowboys\" is a new documentary from Jason Cohen and Steven Leckart and it's about some modern history that most of us just take for granted. It's all about the rise of the Compaq computer company as well as the death of IBM in the PC markethardly the stuff to excite everyone. Most folks don't really care about the history of computers—they just want their iPhones and PCs to work. But if you are like me, a bit of a geek as well as a retired history teacher, then seeing this film is a must.<br><br>The film begins in 1981. Three friends are all working for a computer industry giant at the time, Texas Instruments. The three would love to start their own company but they aren't even sure what that company would sell! They'd talked about opening a Mexican restaurant but finally settled on going into the personal computer business. Little did they know that the world would drastically change based on this choice.<br><br>Up until this time, the IBM Corporation had near sole possession of the personal computer industry. While a few tiny companies sold computers for home use, all the computers used by companies were IBM mainframe, mini and microcomputers. So, the notion of this new company, Compaq, fighting to get into the microcomputer market must have seemed ludicrous. But somehow, these guys succeededeven if their first 'portable' computer weighed as much and was larger than a sewing machine! How they then managed to eventually beat IBM is amazing and it's just something you'll have to learn when you see this engaging documentary.<br><br>OkayI am a geeky history lover. But you, too, may well enjoy this film if you give it a chance—particularly if you are old enough to remember these old days of computing when many folks just thought the home PC would be a fad! The film is well made, always interesting but also works well because most of the people involved in creating Compaq were available to be interviewed and seemed to genuinely like talking about these times.","user":"MartinHafer","rank":[11,11]},{"title":"Silicon Cowboys: A Great History of the Role of Compaq in the Rise of PCs","rating":9,"date":"11 March 2017","review":"Silicon Cowboys was very well-received at its world premiere at Austin's SXSW Film Festival. Whereas the narrative of the era is usually the competition between Apple and IBM, this film based on a book by Compaq's founder, refocuses the narrative on the competition between IBM and the PC clones led by Compaq. The film's David vs. Goliath narrative arc is absorbing and entertaining. It presents a highly entertaining history that avoids getting lost in technical detail that would overwhelm and confuse non-tech geeks. They focus on intriguing accessible concepts such as the Compaq's introduction of the concept of first portable PC – weighing at 28 pounds - as the predecessor to the modern laptop and eventually the tablet and the smartphone. The filmmakers were able to dig up tons of entertaining archival footage and conduct extensive interviews with most of the major players in the 1980s clone wars. The editing and the music are fabulous. The period music and look evokes the nostalgia for the 1980s. Highly recommended for those who want to try to understand a technological revolution that they may have lived through, but didn't fully understand at the time.","user":"JustCuriosity","rank":[8,8]},{"title":"Nerds win!","rating":6,"date":"16 September 2016","review":"Greetings again from the darkness. After countless projects spotlighting Steve Jobs and Apple, it's about time the tech-nerdy Texas entrepreneurs behind Compaq get their moment on the silver screen. Filmmaker Jason Cohen turns his camera on Rod Canion, Bill Murto, and Jim Harris  none who have the persona or magnetism of Mr. Jobs  and tells the story of how they took on Goliath IBM at a time when most wouldn't dare.<br><br>Taking us back to 1981, the 3 friends (and Texas Instruments co-workers) quit their jobs to start a new company – only they have no real plan on what that company should be or even what industry it should be in. There is a re-enactment of a conceptual drawing of a mobile computer on a diner's paper placemat  a drawing that helped them secure a big investment from Ben Rosen at a time when Venture Capitalism was non-existent for technology companies (yep, 35 years ago).<br><br>Those early days of a slow developing Silicon Valley featured more hobbyists and non-commercial efforts than anything going on these days. Mobile computing was not really even a product category when Compaq stuck a handle on their case  the visuals of businessmen toting them through airports is comical. This was truly the beginnings of the home computer era, and even the tech start-up. The film serves as a historical perspective of the times, while also documenting how Compaq fits into the evolution of the personal computer.<br><br>It's pretty easy to draw comparisons to the great and powerful IBM ignoring the \"little guys\" to the 1970's when GM and Ford overlooked Honda and Toyota. It's always easy to chuckle at the arrogance of big corporations, and when Compaq computers were more compatible with IBM software than IBM computers were, it's a real head-scratcher. The dawn of \"clones\" were more than a thorn in the side of Big Blue (IBM), and eventually it got worse for them. Head-to-head advertising campaigns of IBM's Charlie Chaplin vs. Compaq's John Cleese further emphasized the contrast between those out of touch with those who clearly understood the market.<br><br>Normally a movie that spends much of its time interviewing such down to earth guys as Canion, Murto and Harris, would feel like it's dragging, but the historical significance is such that contemporary comparisons to Dell, Google, Apple and Facebook keep it briskly on track. Though the electronic background music seems out of place, many viewers will enjoy watching a true story where the nerds win!","user":"ferguson-6","rank":[19,22]}]