[{"title":"A brave and authentic gem","rating":9,"date":"21 November 2016","review":"What does cinema mean to you? To me it means emotions and stories, told with moving images, with music and with words. And, in my opinion, for cinema to be at its greatest it needs to brave and vulnerable.<br><br>Center of My World is exactly that: brave and vulnerable. And intimate. And true.<br><br>Its is the story of Phil, a standard teenager, who is just a little gayer than the rest. But him being gay is really not an important part of the story.<br><br>He struggles with his family, with deeply hidden secrets of the past and their effects in the present, which may break his family apart. And he falls in love for the first time. That's really it.<br><br>And while watching this in the cinema some people laughed at the film. Because it shows how love is, unironically and over-the-top. It dives deep into Phil's emotions and shows us not only the center of his world, but maybe even the center of THE world (hence the original German title \"The Center of the World\"). And most people can not let themselves dive into these depths.<br><br>And if you want to experience this small gem of a movie, you have to make yourself vulnerable, too. Leave your irony at home, just watch this movie as you are - naked and vulnerable.<br><br>Then you may see what cinema can do, what cinema is for.","user":"SunParakeet","rank":[33,38]},{"title":"Wonderful film, one of the best of 2016","rating":9,"date":"20 November 2016","review":"To start with, I completely disagree with a previous 2/10 review. <br><br>\"Center of my world\" / \"Die Mitte der Welt\" was and is one of my most beloved novels I first read end of the 90ies shortly before it has been released. It's a wonderful book I always return to. I didn't know how it could be brought to screen - until now.<br><br>When I first saw the trailer I was already roped back into the world of Steinhöfels book. I needed to see this film and I did on the first weekend. While they removed several parallel and back stories of the book to create a better narration for the screen, they managed to keep the dreamy atmosphere of the book for the whole 2 hours. The main cast is more than perfect, from Louis Hofmann as Phil to Sabine Timeteo as his mother, to Jannik Schürmann as Nicholas. I fell in love with each of them. The setting in the small town and the enchanted home of the \"different\" family was a perfect match to the tone and style of the story. It was wonderful to live, laugh and cry with the characters throughout, a very emotional, dreamy, wonderful journey, accompanied with a beautiful soundtrack. The love story between the two main characters blew me away, so real, intimate and wonderful to watch. <br><br>I didn't see any other film this year that I embraced so much like \"Die Mitte der Welt\". Maybe I will see it a second time in the cinema but the Blu-ray will be on my shelves on day one. Go and watch it, it won't get better this year.","user":"Tye-J","rank":[30,37]},{"title":"A coming of age movie that works","rating":9,"date":"26 March 2017","review":"The German film Die Mitte der Welt was shown in the U.S. with the translated title Center of My World (2016). It was written and directed by Jakob M. Erwa.<br><br>This movie can be interpreted in many ways. It's a coming of age movie, a gay love story, and a melodrama with many twists and turns. <br><br>Louis Hofmann plays Phil, a gay young man, who is looking for a boyfriend-lover-partner. Jannik Schümann plays Nicholas, who is handsome and athletic, and becomes Phil's boyfriend and lover, if not partner. Both Hofman and Schümann are fine young actors, and they do admirable work in this film. Also involved in the plot is Phil's twin sister, who may or may not have some special powers. <br><br>For me, however, the acting honors go to Sabine Timoteo as Glass, Phil's mother. She brings men into the family, and then sends them away, with devastating results to her children. Timoteo brings acting skills that allow her to inhabit this role. You can't take your eyes off her as she lives--and messes up--her life and the lives of others. She always tells just enough of the story to make you aware that she knows more than she tells.<br><br>The film will work well on the small screen.","user":"Red-125","rank":[21,26]}]