[{"title":"Fifty Shades of Sadie","rating":5,"date":"21 March 2018","review":"This was a weird movie. Lots of strange characters and scenes, lots of dream sequences, lots of sex, lots of empty dialogue. A few cheesy scares here and there, and some peculiar but nice visual imagery. I'll give that to the movie, the sets look beautiful, the castle is gorgeous and the visuals in some scenes are odd yet mesmerizing. The movie is a bit too experimental for its own good however, it is hard to take the story seriously when all the movie seems to want to be doing is look artistic and surreal. It also seems to take a few hints from Fifty Shade of Grey, but in a gothic-horror setting. Analeigh Tipton is an interesting actress but deserves better than this weak story-telling. Overall, a very bizarre film that just isn't very good. Added a point for the fine visuals.","user":"KawaiiKiwi","rank":[28,31]},{"title":"Think of this as theater","rating":5,"date":"26 February 2018","review":"Sadie Glass (Analeigh Tipton) writes erotic thrillers based on her real life experiences as she enjoys choking and other oddities. Her boyfriend Alex (Jakob Cedergren) is made out to be the villain. She meets up with him in Turin, Italy along with Francesca (Marta Gastini), a performer. It becomes a weekend of drugs, \"Eyes Wide Shut\" and ritual. Not much a story line. Craig Goodwill is no Tinto Brass. If you enjoyed the 50 Shades of Mediocrity series, you might like this one. <br><br>Guide: F-word, sex, nudity (Analeigh Tipton, Marta Gastini, + extras)","user":"nogodnomasters","rank":[11,11]},{"title":"Appropriately Sexy, but Otherwise Inane","rating":4,"date":"7 March 2019","review":"Before the initial credits appear, Sadie (Analeigh Tipton) is engaged in an intense sexual act with her ex-boyfriend, bearded Alex (Jakob Cedergren). Interposed are brief back-shots of her in various sexual proclivities.<br><br>After the credits, Sadie is the guest of honor at a book tour in Turin, Italy, where, in describing her autobiography, she relates her sexual feelings to a gathering. Her latest boyfriend is Thierry (Valentin Merlet). After the gathering, Alex, who is around, invites her to a seamy club, where she meets Francesca (Marta Gastini), who is as attractive as Sadie is. Alex invites Sadie and Francesca to his business-partner's villa, really a 17th century walled fortress decorated with magnificent art and statues. For some insipid reason she accepts.<br><br>At the villa Sadie and Francesca take drugs (pills) with alcohol. Sadie develops a lesbian relationship with Francesca. Meanwhile, bizarre rituals occur and masked guests attend wearing strange attire. There is a ritualistic killing, a \"black magic\" type of ceremony. Is it all a dream? Bloodstained fingers say no. When Sadie questions Alex the next day, he says she should have known what she was getting into.<br><br>Thierry then appears at the villa for some reason, but is rebuffed by sexually-charged Sadie. Later it is Thierry who is tied up and on the sacrificial agenda. Sadie is given a knife. What will Sadie do? Will she ever escape her dilemma? Is her name a derivative of sadism?<br><br>This is an artsy type of film like \"Last Year at Marienbad\" (1961), an entirely different film, but also difficult to understand. Despite its colorful sets, erotic scenes, and on-location filming, \"Compulsion\" makes little sense. The screenwriting and plot are weak, and the film unmemorable.","user":"romanorum1","rank":[7,7]}]