[{"title":"A strange, uncomfortable and fascinating look at society","rating":8,"date":"20 July 2017","review":"This is a hard film to describe and an even harder film to review but I'm going to try my best to express how I felt about it. <br><br>In an attempt to put it simply, The Square follows a modern art museum curator named Christian (played by Claes Bang), and some increasingly strange experiences which shape his views and understandings of the world he lives in and the people around him. <br><br>I had the chance to see this film on opening night at the New Zealand International Film Festival, and I am so glad I did. The Square plays like an increasingly bizarre farce, and while the film is indeed very funny (sometimes in shocking ways) it provides a consistently fascinating look at our behavior as people in society. Now I realize that isn't necessarily innovative for a film in 2017, but that said, The Square dares to pose increasingly uncomfortable questions to its audience.<br><br>From the inherent narcissism of even the most ordinary of people, to the shallowness of popular culture, to the complex behaviors and interactions between people of disparate backgrounds. Again, these ideas are not necessarily novel, but the film presents them in a way that is consistently entertaining - even when certain exchanges on- screen are uncomfortable. There is a scene that takes place at a gathering of elite artists and sponsors that is as squirm-inducing as anything I've seen all year. I also must point out the constant use of dead-pan humor with verbal and visual gags throughout as one of the film's secret weapons.<br><br>I would warn that this is not a film for everyone. The pacing is uneven, the structure is unusual, and there isn't a whole lot of forward momentum to propel the film forward. But, if you are willing to meet the film halfway, I think you're in for a fascinating, shocking, hilarious and uncomfortable (skewered) mirror into the society we live in.","user":"Jesse_Ung","rank":[193,231]},{"title":"A mixed result","rating":6,"date":"1 January 2018","review":"A few days are chronicled in the life of Christian (Claes Bang), a curator of a modern art museum in Stockholm. He faces various challenges, the main one being the loss of his wallet and phone and the consequences of what he does to get them back.<br><br>The situation mentioned above is the best one in the movie despite an unnecessary over-the-top dramatic scene in a rain-soaked garbage dump. The film's deepest flaw is that it takes on too many sub-stories that end up just barely touching the surface despite some fascinating scenes in all of them. This takes the viewer in too many directions and leaves a jumbled feeling by the end.<br><br>The most renowned scene of the film is one in which a group of wealthy museum patrons are at a dinner and \"treated\" to a performance artist (Terry Notary) who acts like an ape-human and causes havoc on some of the guests. The scene is brilliantly executed. It is easy for the viewer to feel the fear of the patrons wondering what the beast-man will do next and who his next victim will be. But the major events that took place are never even referred to later on. It's like this scene was an extra short film on the side and had nothing to do with the general narrative.<br><br>In some ways, \"The Square\" resembles \"La Dolce Vita\": an attractive, self-involved man who is very high on the social scale in a cosmopolitan setting feels a soullessness in his surroundings. Writer/director Ruben Ostlund - who did such a great job with \"Force Majeure\" a few years ago - shows great potential here as well. His occasional jabs against pretense, especially where modern art is concerned, are more than welcome. But overall, \"The Square\" might have been great if it hadn't taken on too much.","user":"proud_luddite","rank":[65,77]},{"title":"Satirizing the Cultural Elite","rating":8,"date":"22 November 2017","review":"Director Ruben Ostland has followed up his 2014 Golden Globe nominee Force Majeure with Cannes Palme d'Or winner The Square. The film is both a satire of the cultural elite of Stockholm and a sad commentary about the separation between individuals both within circles and between circles. The lead character, Christian (Claes Bang), is the curator of a museum of modern art that seeks to draw attention and donors through avant-garde exhibits and over-the-edge social media campaigns. The film follows Christian through a few weeks of his life when one of the hot new exhibits is \"The Square\", an actual square in the museum courtyard that is meant to be \"a sanctuary of trust and caring.\" But rather than show trust and caring, the movie The Square raises a number of troubling questions: How thin is the veneer of civilization? Can political correctness substitute for empathy? Is art whatever a curator chooses to put in an art museum? And enveloping these questions is the separation of the circle of Stockholm's cultural elites from the City's homeless and immigrant population, as well as the separation of individuals within the City's cultural elite. One set piece in particular portrays the inability of the Stockholm's elite to communicate on a human level: It is Christian's meeting with Anne (Elisabeth Moss), a publicist, the day after a night of sex—and a bizarre argument over what to do with a used condom. In this scene Christian is totally unable to say the needed words about what had happened between them. (Anne, an American, comes across as much more able to relate to others than any of the Swedes in the movie.) Another memorable scene is the one in which a banquet for museum donors is interrupted when the performer (Terry Notary), playing an ape, goes out of control. The diners, who are initially frozen by their need for decorum, or perhaps by their need to display political correctness, ultimately go ape themselves. Perhaps not a total surprise since the same donor diners had earlier stampeded their way to a luncheon in a lighter scene. There are many sub-plots in the film—some satirizing interactions within Stockholm's upper class, others between classes— perhaps leaving some viewers displeased by the way the film jumps without warning from one set piece to another. Others may dislike long stretches of art-film inactivity in many of the episodes—something that explains why the movie lasts for 2 hours and 22 minutes. Nevertheless, The Square does capture the alienation of modern society, and does it with plenty of dark humor.","user":"kyanberu","rank":[95,120]}]