[{"title":"Open Season: Scared Silly is decent for kids...","rating":5,"date":"28 April 2016","review":"While it has its perks, Open Season: Scared Silly is not exactly a great movie. <br><br>The first problem i have with it is it doesn't seem to align with the rest of the series. In the previous movie, the characters Elliot and Gizelle were previously married and had three children. Another character Ursa was also introduced into the series from the previous movie. Neither Ursa nor the children are found in this movie, and no explanation was given for this. It also seems that Elliot and Gizelle have completely forgotten that they are married, as Gizelle also states \"im going to find a nice quiet place to call a mate\" right in front of her supposed husband. Two new characters, Ed and Edna are also introduced in this movie. However The character Shaw (who was the villain from the first movie) addresses the two as if they were introduced previous, in which they weren't.<br><br>The next problem is that the characters seem to have been dumbed down by a large margin, especially the character Elliot, who constantly leads his friends into near death scenarios at every turn. The character has only has two goals in mind the whole movie, being to go on a camping trip with his best friend Booge, and to catch a were wolf to ensure open season is closed again. The characters action result in many misgivings for him and his friends, including a scene where they almost die in a plane crash because of him. I don't understand why the characters had to be dumbed down for the humor however, the original movies did a good job with the humor. The humor almost solely resides in poop jokes now.<br><br>The humor in this movie is almost strictly for a younger audience, but at the very least the movie like this isn't without its poop jokes. An entire scene from the movie focuses entirely on Elliot \"studying poop\" in which he consumes it in order to find the where wolf (I now hate the word \"poo\" thanks to this movie). As usual a movie like this includes other potty humor, but the eating the poop is enough for me anyways.<br><br>From what i know none of the original actors stayed for the ride, but they at leased replaced them with half decent not well known voice actors who did a pretty decent job, at least up until they scream, in which they do a half donkey job of inside yelling which doesn't really fit the expressions the characters make when they yell.<br><br>Overall its not a bad movie for kids, but from a more focused perspective this movie is full of filler, and the conclusion is not very satisfying. Although like i said kids seem to like it very much, as my younger brother just watched it for the 40th time. This movie is recommended by me for kids ages 5 and up.","user":"javierl-87541","rank":[3,3]},{"title":"Should have stopped at 1!","rating":1,"date":"25 February 2016","review":"Don't need a lot of words for this one. My 5 year old nephew doesn't even like this. I never saw a 5 year bored while watching an animated movie. I seriously wounder what were they thinking. Considering they were thinking at all. The original cast is gone, meaning we have no attachment to the film. I can just fill these lines with words but I still won't know why they made another Open Season. Just close the season and be done with it, please. Never has a fan asked you so nicely... From one fan to another, don't waste your time watching this movie. You could rather watch a Donald Trump speech over and over again. It is more entertaining than this excuse of a movie. Don't mean to be harsh but I feel offended by this movie...","user":"shaqthms","rank":[14,22]},{"title":"Close the season already.","rating":3,"date":"27 December 2016","review":"Sigh, another day, another Open Season sequel. That also means another day that Sony opens up it's wallet, throws whatever small amount of money they can in other studio's faces and tells them \"Go make an Open Season sequel but with less of the good humour. Oh and none of the actors from the other films.\" <br><br>At this point though, Sony must have honestly given up. <br><br>Too content with making really huge blockbusters *coughcoughStinkers*, they decided the baton must be passed to the Canadians. And thus nearly all of the production was done in Canada, the animation (done by Rainmaker Entertainment, same ones who did Reboot back in the Mainframe days and Ratchet &amp; Clank), the voice acting (who actually do a much better job then anyone in the 3rd film though it's nothing to run home and shout about), maybe even the writing was done by Canadians.<br><br>Too bad then that ever since the 3rd sequel, the franchise has ditched the word \"Funny\" and decided a bunch of measly Christmas cracker jokes would do instead... oh and poop jokes too, lots of em. Therefore you probably won't be laughing at anything these critters say but you'll instead be thinking \"How the devil are Sony still making these?\".<br><br>And the plot's a load of codswallop too, the whole film is basically Elliot trying to scare the living daylights out of Boog.<br><br>Yeah, would have worked as an 8 minute cartoon, a 10 minute episode of a show or even a 22 minute TV special. But as an 87 minute film, paah ha ha ha ha you're having a laugh there chums! There's only so much they can do with this kind of material and by the time the mystery of whatever that Werewolf Elliot keeps talking about is finally revealed, the only thing you'll be doing is checking your watch.<br><br>So yeah Open Season: Scared Silly. Not as bad as the other films I've seen so far (hence why it gets the 3 rating) but still Sony, this season has gone on far enough and little old me says it's time to close it for good and let the animals have peace for once.<br><br>Then again, Sony's probably not caring since they're rolling around in money like Scrooge McDuck. Beats me.","user":"l-62911","rank":[5,9]}]