[{"title":"So bad it's wonderful!","rating":3,"date":"27 February 2018","review":"Take a bevy of actors and give them an awful script with risible dialogue and you get this...a small group overacting and running around an old Star Trek set. Stef Dawson's character 'Milly Piper' could've died after she first open her mouth as far as I'm concerned, she's THAT bad. The quest to find a lost brother is their aim, except for Kelsey Grammer's Mason who is really trying to track down the elixir of life...bwah ha haaaa (twirls imaginary moustache). The main threat to their journey is hundreds upon hundreds of deadly spiders who appear to be made of black shiny leather and can hiss and squeak...Yes, you read that right...hiss and squeak.\nBy all means, watch this, suspend all disbelief, let the film wash over you and drown in its ridiculousness. It's a real hoot, soon to be considered a classic amongst godawful movies that you can say \"Yes...I sat through that film and survived.\" Now go and enjoy!","user":"mk57","rank":[58,67]},{"title":"Give it a chance.","rating":7,"date":"25 February 2018","review":"Sometimes you get fed up of Hollywood films and big blockbusters. Saw the trailer to this, thought it looked ok. Well watched it, and must say I enjoyed it. It was not brilliant, but neither rubbish, but I thought it was good, well it entertained me for an hour and half. Isn't that what films are supposed to do, entertain. Give it a watch, it aint that bad.","user":"finesherry","rank":[74,99]},{"title":"Wow.... What can I say.","rating":7,"date":"5 September 2018","review":"This film was begging for Nicholas Cage. Dr Fraser Crane held the post but there's nothing that some good old fashioned Nic Cage wooden acting wouldn't have done to put this film up in the Oscar nominee category.\nIf you like spiders that growl, ok-ish CGI, sets where cast walk through one door (scene cuts) and they walk back through the same door the other way to a different mediocre set .... then this bad boy is for you!!<br><br>Likes: 1) the spiders are considerate enough to always leave a web free safe passage for the cast tonthe next scene\n2) these spiders have learnt to growl - it's about time our arachnid friends had a voice\n3) Kelsey Grammer accent keeps you guessing and on the edge of your seat for the length of the whole flick<br><br>Dislikes: no Nicholas Cage. <br><br>Summary: You'll be gutted if you don't watch this and the awards start rolling in at the oscars, baftas etc etc etc etc. <br><br>**SPOILER*** The only thing that would make the plot and cast of this film better is if 'Fraisers' 'Niles' popped up at the end and rescued his brothers soul.","user":"clarethebear","rank":[12,14]}]