[{"title":"Travel back in time for a great adventure!","rating":8,"date":"14 November 2015","review":"I just came back from watching this and oh boy this exceeded my expectations. I just love the build up and the climax of this story, and also how it plans out. I'm going to go over some details so the people thinking about watching this can read this and get persuaded.<br><br>The story is very interesting for a regular show episode. It takes part in the past present and future, but I'm not going to ruin the details. I just love seeing the characters interact with each other, and I also love how the story ends. One last bit of comedy.<br><br>The animation is a higher budget regular show style. Exact same as the actual series, but with some things that tell you that this is a film. Kinda like spongebob the movie (The first one). Also love how some items in this world seem 3D.<br><br>The music... I found myself digging out to this music and also the intro song. I've gotta find the full version somewhere. Also love how certain songs play in certain scenes. It really does help set the scene.<br><br>I have no idea why one of the reviewers hated this, but I'd say this is a good special and I can't really find any problems with it. This is a great film and I don't recommend seeing this at the cinemas, but at home with blu ray. This isn't the sort of film to be shown at the cinema, but the film to be seen at home. <br><br>One thing I can point out is that there's less comedy. I think they were going for this style however just to make this film more serious and engaging. This film still has its share of funny jokes, so you don't need to worry.<br><br>For now, I'd say this is a great film with a good balance of action, drama but slightly less comedy.<br><br>8.5/10","user":"mcfarlanejjm","rank":[19,20]},{"title":"Great movie","rating":10,"date":"26 November 2015","review":"I loved this movie. Regular Show is just getting better and better. I was scared for the show a couple of months ago when they were putting out episodes that I hated. I thought the show was running out of material and was going to get canceled, but then they came out with a weeks worth of episodes that I absolutely loved. Then, the movie came out, and my fear of the show getting canceled got completely terminated. This movie was the best. I am no longer afraid for the show's future anymore. They couldn't make it any better, and it DEFINITELY exceeded my expectations. OMG, this is going to be something that I will watch again and again. I am very impressed that they actually pulled off an hour and a half long movie when the longest episode they have ever done was only thirty minutes. I had NO IDEA it would be this good. It was funny, intense, and sad all at the same time. I never knew Regular Show would actually make me cry, yes, I cried twice during the last half of it. I also think that they did a great job with the tone. I thought that this movie's tone was going to be just like a regular episode, except longer, but they actually made it look like a film. Very, very impressive. I never knew the creators had it in them. According to me, Regular Show has made its way back up to being one of the best cartoons out there. I am looking forward to next week's set of new episodes. Keep up the fantastic work!!!!!!","user":"TheEightBitGrandpaShow","rank":[11,12]},{"title":"A Regular Movie","rating":7,"date":"27 March 2016","review":"Regular Show is one of my favorite cartoons in Cartoon Network. Could Regular Show The Movie also be my favorite animated movie? Let's see.<br><br>To be honest the plot doesn't make any sense at all but this is Regular Show and when did it ever make sense, right? Characters are still lovable like in the cartoons. It was quite an adventure to be exact. This movie also doesn't run out of conflicts too. What's unclear to me is that originally, Mr. Ross wants to get revenge on Rigby for some reasons then later in the movie, his goal changed. He now wants to destroy time and the universe? It's kinda bothering me but all in all, it's a decent animated movie. <br><br>In conclusion, Regular Show The Movie is a decent animated film. If you love Regular Show, then go watch this movie.","user":"Shad_Critic","rank":[6,6]}]