[{"title":"Best Mission Impossible movie ever!","rating":9,"date":"22 February 2020","review":"Thrilling from start to finish with intrigue, action and romance crackling throughout, this is the new standard in non-superhero action films. Add to that Tom Cruise doing his own crazy stunts and it is indisputable that Mission: Impossible is better than Bond, better than Bourne.","user":"MR_Heraclius","rank":[54,59]},{"title":"It's not bad for a blockbuster movie but does it really deserve this much positiveness 🤔","rating":26,"date":"26 October 2018","review":"Metacritic critics gave this movie 86/100 score(based on 59 critics). RT critics gave this movie 8.5/10 rating(it has 49 reviews). Metacritic critics gave TDK 82/100 score(based on 39 critics). RT critics gave TDK 8.3/10 rating(it has 52 reviews - not including some click baiting trash bloggers🤢🚮)<br><br>Yeah, I know. I'm just a random dude 🤷‍♀️👩 who criticizes these hypocritical critics and some of you don't even care about my opinion, but really 🤔 how can they rate TDK so low and this movie so high😡How dare they❗<br><br>First off, there are needless plot twists that you cannot understand. Why did Erica Sloan turn against IMF? Her reasons are just not reasonable enough. How did August Walker's men infiltrate Sloan's team? We don't know much about it. They don't tell us. Sure, it was cool but my immersion was ruined. They could've been written it more subtle. Second of all, the elevator scene. Walker shows a picture of Ethan's ex-wife(clearly he carries it all the time 🤣) to Ethan and says this and that, but the reason why Walker didn't kill Ethan is his evil friend has a plan for him after he supposedly suicided. But wait, 30 minutes after that scene, Walker shoots to kill Ethan with a machine gun. This right here is the definition of lazy writing. They just tucked a stupid reason in the movie so that they could just ignore and make a fool of the audience. Thirdly, why is Julia in this movie? Don't get me wrong, It was nice to see a familiar face, and she gave herself a pretty good closure, but here's what wouldn't have happened if she wasn't in this: They wouldn't have had to put a reason, which was a really big turn off for me, not to kill Ethan. We wouldn't have gotten an awkward wire cutting scene. We wouldn't have gotten weird dreams. And probably I wouldn't be writing these negative things. Fourthly, Solomon Lane, a pretty genius guy, pulls his enemies to their objective and fights with them face to face. That's pretty cool but why? Why did he aggro'd them? Why did he even decide to stay and choose to die? This writing could've been much much better. They could've given him more clever things to do. Fifthly, the unstoppable bomb stopped by 3 people because they ''figured it out''. Sixthly, a countdown. Suprise, surprise. I really wonder why evil people put a countdown on these things. Can't they just press the damn detonator button when the time is right? Guess what happened in the end. The good guys lost and the bad guys won. Billions are dead. That was totally unexpected and hard to guessed. 10/10 original writing right there 👌💯 But hey, let's look on the bright side, they executed that last shot perfectly. The sunset almost had me for a second. Finally, the ending. You don't leave the theater with ''holy cow!1'' or ''😮'' expressions because they've already ended the movie before the end. Sure, it has a deserved and a great dark/grim ending which every plot and dialogue constantly instigated throughout the movie but you didn't get goosebumps like you did get after the TDK ended. Or, you didn't sit like you did sit after the Infinity War ended<br><br>These are just small things that TDK, a film that critics rated lower than this movie, doesn't harbor. Overall the movie is not bad. It's just that the writing could have been much more in-depth. Or maybe it's just me. After seeing that god tier praises from the critics, I expected something better than TDK. But the dialogues weren't even that close. I guess critics don't care about these small things<br><br>But wait, they do care about the small things. I mean look at their rating for ''Black Panther'' That movie currently at 8.9/10 rating with 51 reviews on RT. And on Metacritic it at 88/100 score with 55 reviews. I wonder what makes that movie so special for the critics 🤔 Is it the stunts or the unpredictable plot twists? Maybe it's because of its beautiful CGI effects. Nah, that doesn't make sense. Maybe it's because of its absorbing and original story. Yeah, that does make more sense. Because we don't see everyday a black man who tries to be king in a fantasy land want to rule the whole world. Yeah, that sounds about unprecedented and 8.9/10 rating worthy 👌💯 But put yourself in some of the big directors like Christopher Nolan position and think that every film that you made got more negative reviews than Black Panther. What do directors need to create to get praised by these critics nowadays? A black Harry Potter❓<br><br>And the worst thing is that these hypocritical critics are overshadowing people's own judgments with their dependent opinions that polluted by politics and mindsets like \"we're not fond of pretentious directors\", ''we don't like blockbuster movies that has bad morals'', ''if you're going to make a blockbuster movie, it has to have family friendly morals and good political interests''. The quality of the film is in the second place when it's come to politics. And their opinion is essential for people who can't form an opinion, and nothing can change those people's mind other than the critics. Now let me say how does this work<br><br><ul><li>A blogger(Some of them are SJW who's prone to give a good review to those blockbuster films that has a good moral code and political interests about homosexual people, strong women, what's right and what's wrong, etc. They love to insert their ideas like ''We want to see more feminism in movies'', ''We want to see more movies with black leads'', ''We want to see more homosexuals in movies'' etc.) watches the movie before everyone else.</li></ul><br><br>\n<ul><li>They give their reaction to the site(to the RT) before the audience.</li></ul><br><br>\n<ul><li>People of US see those reactions because they told to do so.</li></ul><br><br>\n<ul><li>They make their mind according to those reactions and everything starts here.</li></ul><br><br>\n<ul><li>If bloggers' reactions are good, they watch the movie without any question. They don't care if it's bad or not. They already have a preconceived decision.</li></ul><br><br>\n<ul><li>If the reactions are mixed, they watch the movie with questions. They already think it's not that of a good movie because that's what they're expecting.</li></ul><br><br>\nThe next big movie that critics are going to bash will probably be \"Once Upon a Time in Hollywood (2019)\" But not that kind of a big bash. Small bashes like they did for \"The Dark Knight\", \"The Shawshank Redemption\", \"The Usual Suspects\",\"Interstellar\", ''Fight Club'', \"Se7en\",\"Inception\"... These films, they don't have a family friendly moral code, and they all look so pretentious with their big plot twists, prominent cast and independent directors. But these professional critics don't want to promote these kinds of films, they have to say irrelevant things about them to criticize it so that they could look \"cool\" to the audience and click bait them. But of course, at some point, they have to keep their reputation maintain too. That's why they show love for some of the classic movies like \"The Godfather\", \"12 Angry Men\", \"Pulp Fiction'', \"Seven Samurai\" When they saw a Cult classic movie alike they'll eat each other to praise that film like ''Roma'' They don't want to see depressing movies, or they talk about the importance of ''entertainment'' in a movie, but after they watch \"Schindler's List\" they forget all about the importance of entertainment. The films that made by docile or unknown directors have always been more convenient for them to praise. IF the message and the moral codes is right, they have to praise those movies that involve feminism or politics, like ''Dunkirk (2017)'', ''Wonder Woman'', ''Get Out'', ''Black Panther'', ''Moonlight''... If the message isn't right, those movies are just another trash for their dump, like \"Sucker Punch\", \"Fight Club\", \"Watchmen\"... Or maybe I'm wrong. Maybe they didn't like them because they all looked too pretentious. Or maybe they completely misinterpreted the whole message like they misinterpreted \"Blade Runner\", \"2001\", \"The Shining\", \"Psycho\" They've always been inconsistent and always will be. Next year they're probably gonna say baseless things about Once Upon a Time in Hollywood like \"there was too much violence in it\", ''there was too much N word in it'', \"there was too much blood in it\", \"the characters were too cold\", etc. without considering movie's content. Because they don't like prominent materials. They must say something out of place to criticize it. What they do is something like declaring a horror movie \"too scary\". The only thing they have is politically overwhelmed and subjective opinions that their big names on. They won't support their opinions with reasons because it's a risky approach. If a random person say the exact same things about a movie like them, nobody would take that person seriously. We wouldn't even care. I'm not saying they shouldn't criticize the big movies, just tryna point it out that their motivation, their method of criticizing is inefficient for the audience. I mean just tell me, how can the same people rate Batman Begins 6.8/10 and Black Panther 8.9/10? Don't we all have eyes to see the difference or are we all just blinded by the politics? Some of the critics made a hobby of bashing pretentious directors who loves to put his/her signature in his/her films. But, unfortunately, some people really worship these critics and nothing can change those people's minds. In their eyes, those critics are always right, no matter what. But put yourself in those directors position and try to envision critics panning your movie for the things they don't understand and people believing them blindly. They want attention and people giving it to them. But still, who am I to judge, right? I don't have some kind of a degree like those guys have. You're probably making fun of me ''But they're critics, that's what they do you stupid.'', \"Who are you to make a comment about critics' methods\", \"An idiot on the internet DESTROYS professional critics with ASSUMPTIONS and LOGIC 😂😂\" You have every right because you're right 😂👌🔥💯","user":"nothimme","rank":[931,1]},{"title":"Best action movie you'll see in years","rating":10,"date":"29 September 2019","review":"The good: Wow. The music, the stunts, the actors, the cities and landscapes. Everything put together amazingly well. And an ending scene that you will never forget. Cruise and McQuarrie did a stunning work here.<br><br>The bad: Im no expert, but Cavill's acting seem from time to time, poor. Something that you don't notice in the fighting scenes. Also, some people may find the plot quite complicated, and it is. You really need to pay attention. I recommend watching MI5, and, if you have time, all the others. There is reference to all of them along the movie.<br><br>See this movie on a big screen with good sound!!! Enjoy the full experience","user":"zaloc","rank":[41,62]}]