[{"title":"Thoughtful, surprising and genuinely entertaining","rating":9,"date":"28 December 2016","review":"Don't Think Twice is a tremendously satisfying film about a very specific world, and anybody familiar with the gruelling hustle of comics, writers and improvisers vying for any measure of success in those fields will recognize many of the characters and small details that Mike Birbiglia has written into this film. Outsiders, though, don't have to worry that this is all \"inside baseball\" for comedy nerds because the emotions and relationships that propel this film are pretty universal. Driven by a talented ensemble and featuring as many poignant moments as genuine laugh lines, this humble film may stick with you a lot longer than you'd expect.","user":"renbostelaar","rank":[52,61]},{"title":"Very good dramedy","rating":9,"date":"28 December 2016","review":"One of the best movies of the year. Grounded, realistic, funny, and bittersweet. If you want a pure comedy, this isn't the movie for you. It certainly is funny, but it is also spend a fair chunk of the movie on characters and conflict. It's dramatic parts actually ended up working better than the comedic elements for me. <br><br>The acting was surprisingly very good for actors who have made their names in comedy and improv. Gillian Jacobs and Chris Gethard were the standouts, though each of the actors has at least one standout moment.<br><br>Not for everyone certainly, but very good and one of the best of the year. I think I'll finally get around to seeing Birbiglia's other movie \"Sleepwalk With We\" now.","user":"miniotd","rank":[42,49]},{"title":"Don't Think Twice--Just Watch It!","rating":8,"date":"9 December 2016","review":"\"Don't Think Twice\" is a movie about a group of friends who have kept alive an improv group known as \"The Commune.\" One \"show- boater\" (played by Michael Keegan-Key) in the group lets loose during one night's performance because he knows a scout from a knock-off of \"Saturday Night Live\" television show will be in the audience. Lo and behold, he and his girlfriend (expertly played by Gillian Jacobs) land auditions while the rest of the troupe, albeit through clenched teeth, wish them good luck.<br><br>I think the one huge mistake about the movie is its promotion. Billed as a \"comedy,\" that is just an incorrect and very misleading label. Yes, there are some comedic moments, but this is a serious look about these peoples lives. When some of them come to the realization they have made it as far as they are going to make it, well, it's just painful to watch. <br><br>Comedian Mike Birbiglia, who wrote and stars in this movie, is just amazing. His ensemble cast are also top-notch. One of the most poignant parts of the movie is when Gillian Jacobs' character pretends she is at the bottom of a well and replies to her boyfriend, \"it's okay for me to be at the bottom.\"<br><br>I can see why some people are disappointed, and I will strongly caution (again) this is NOT a knee-slapping, gut-busting comedy. It is an all too real lesson about life. Rated R for language and adult situations.","user":"dcarsonhagy","rank":[49,59]}]