[{"title":"Fascinating romance between two people on the autism spectrum","rating":9,"date":"4 August 2018","review":"Keep the Change (2017) was written and directed by Rachel Israel. <br><br>It stars Samantha Elisofon as Sarah and Brandon Polansky as David. This film could be called \"Romeo and Juliet,\" because Sarah and David are star-crossed lovers. Sarah loves David in her way, and David loves Sarah, in his way. The problem is that their ways don't always match.<br><br>I was really moved by this movie, because both leads are, indeed, on the autism spectrum. Director Israel took a leap of faith that her actors would come through, and they did. It was wonderful to realize that Elisofon and Polansky didn't just watch people on the spectrum, and then try to act like them. They themselves don't have to fake it, but being on the spectrum doesn't always allow people to demonstrate their skills. Both of them are wonderful actors, and director Israel had the talent to make us appreciate their acting. <br><br>We saw this movie at the excellent Dryden Theatre in the George Eastman Museum. It was part of the wonderful Rochester Jewish Film Festive. It will work well on the small screen. Keep the Change has a terrible IMDb rating of 6.3. Did the people who rated the film see the same movie that I saw? Find this movie and watch it. You won't be disappointed.","user":"Red-125","rank":[12,13]},{"title":"A Lovely Surprise","rating":9,"date":"14 September 2019","review":"When I decided to watch Keep the Change my idea of what it would be about was pretty wrong. I had no idea it was about people on the spectrum. It was during the first scene of the support group that I started to understand that it was, especially when it zeroed in on Sarah. It took a while longer to realize that David too was on the spectrum; the character's desire to make people think he was just an average guy with \"allergies\" worked... for a while. And this was a big part of the film: David's coming to terms with who he was. In contrast, the character of Sarah was just so confident and comfortable within herself, she was a joy to watch. She's spontaneous, expressive and creative the way a child is. She also has the innocence of a child which is all the more striking as part of her acceptance of who she is includes sexuality! I believe it's the character of Sarah that gives the film its feeling of joy, which, in fact, David can't help but get swept up in himself. I just love how Sarah is so strong while being so innocent and childlike. Even in the end, she performs a heroic gesture, which was ultimately both moving and gratifying for me.","user":"Moviegoer19","rank":[6,6]},{"title":"Really moving.","rating":8,"date":"25 July 2018","review":"I have seen many movies and know which ones have real substance. I just want to say that this is a very inspiring movie about the persistence of love minus the social biases that we normally attach to what is socially good or bad, clever or stupid, funny or demeaning. All our judgements are based on false paradigms. This movie cuts to the chase. Well done. Also brilliant acting.","user":"markallan","rank":[12,14]}]