[{"title":"i n c r e d i b l e Film","rating":10,"date":"31 January 2019","review":"I saw it at Sundance a couple of days ago. I was enthralled by it and sad when it ended. The opening is narratively engaging, yes, with humans and story. That is fascinating, but the film really gets going when it get's past any promise of overall narrative, and begins with its true purpose: to offer a privileged window into the true awesomeness of the water on this planet. Frozen, still, turbulent, graceful, violent, beautiful, it is all there, painstakingly captured with top shelf equipment and cinematography. It is a cinematic poem and of visual glory, awe-inspiring power and incredible natural sounds, mixed and designed in Dolby Atmos surround. The sound is immersive in a way that no other film I have seen has been, and it invites one to surrender and sink into the film. It is not a narrative journey, but a visual and sensual one, that allows time and space to contemplate part of the world we live in, both in celebration and contemplation of human's impact. It is not an overtly environmentalist film, other than to remind us of the power and beauty of nature, and to show some of how we interact with it.\nThere are moments where the film is scored, with Finnish heavy metal. This worked very well. I had the impression that power chords and distortion may be the only fitting texture to score images of such raw power as thousands of tons of turbulent waves of water.\nThe visuals sometimes get abstract in a beautiful way that reminds me of the films of Stan Brakhage, specifically Mothlight and Window Water Baby Moving. Again, it invites one to just let it wash over you, and to enjoy the ride.\nI can't wait to see this film again, next time hopefully in true 96 fps, which I understand unlocks an entirely new visual experience.\nI fully expected an uproarious standing ovation at the end of the screening. I was surprised to hear an average reaction from the crowd. I think people need to approach film with more openness and patience, and not fall into the trap of judging it in the narrow context of \"entertainment\". This is a cinematic poem on an epic scale and I am so very grateful for its creation.","user":"tom-796","rank":[28,36]},{"title":"splash and moan","rating":7,"date":"29 August 2019","review":"Greetings again from the darkness. This is not your father's Nature documentary. It's more like Mother Nature giving us a glimpse at her most beautiful, peaceful, ferocious and terrifying self. And it's just water. Simple H2O. Only it's not so simple. In fact, water takes many forms, and Russian filmmaker Victor Kossakovsky serves up some stunning water photography from around the globe.<br><br>The film begins with a rescue team working frantically to pull out a car that has fallen through the ice. When the camera finally does pull back, we see the vast space of the lake covered in ice. Other cars speed across the frozen body of water as if it's a sport or thrill for the driver. When another mishap occurs, we realize the tragedy is blamed on ice that has melted \"3 weeks\" earlier than usual. So we brace ourselves for another lecture on climate change.<br><br>It's a lecture that never comes. Surprisingly, there is no narrator. Perhaps Morgan Freeman signed a non-compete with the penguins. Kossakovsky allows the camera and nature to show the story, albeit with periodic musical accompaniment from composer Eicca Toppinen - sometimes with heavy metal chords, sometimes with soothing strings. Filmed in Greenland, Venezuela, Siberia (Lake Baikal), and Miami, Florida, where we see the effect of Hurricane Irma, water is shown in its glory. At times peaceful, at times violent. A sailboat captain fighting a storm might be followed by a breath-taking waterfall, which might be followed by a flooded town ... and even a swimming horse is photographed underwater.<br><br>Waves, glaciers, whales and dolphins combine for an unusual cinematic experience, and the most staggering sound comes courtesy of the ice moaning and water running. It's one best enjoyed with theatre screen and sound, and a film that will likely lose something even on the finest home systems. Filmed at 94 frames per second (rather than industry norm of 24 or 48), the visuals are truly breathtaking ... and sometimes disorienting. As George (on \"Seinfeld\") once said, \"The sea was angry that day, my friend\"; and now we have witnessed the anger for ourselves.","user":"ferguson-6","rank":[8,9]},{"title":"Entertaining, but often not spectacular","rating":28,"date":"28 August 2019","review":"My favourite film is \"Koyaanisqatsi\", which is a documentary about nature and urban life. It's probably not a well-known film, but that doesn't matter to me. I absolutely love it and it made me cry the first time I saw it. When I went to see \"Aquarela\", I was hoping it would be like \"Koyaanisqatsi\" and I guess you could say it's kinda similar, but it didn't blow me away. I feel a bit disappointed. Maybe my expectations were too high? I dunno, but I still enjoyed it.<br><br>\"Aquarela\" is basically a documentary about water and ice. Like \"Koyaanisqatsi\", there's no narration. We're just shown footage of water and ice, among other things, like people boating and people getting cars out of water and ice. There's a scene where I think people are trying to rescue someone who may be drowning. You don't see them successfully rescue that person or recover a body. Did the person die? Maybe the filmmakers know, but you don't, at least just by watching the film. Is it fair to criticize the fact that you don't find out? Granted, you don't know anything about this person, but after the film is over, you might still be thinking about him or her. I don't know if there's a message or a dedication in the end credits.<br><br>I feel disappointed that you don't hear that much music to go along with the footage, but when you do hear music, it's pretty good. The footage itself is nice to look at. You see waves of water, ice falling, etc. There were only a few times when I thought the footage looked utterly amazing, though. There is one part that I had trouble watching because it was quite overwhelming for my eyes and not in a good way, but I'm not sure how to distinguish that part from other footage in the film.<br><br>Does \"Aquarela\" have anything to do with climate change? I'm not sure. You can think about that yourself if you see the film. This is probably one of those films that isn't for everyone. Maybe you'll be really bored watching it, but I wasn't. I liked it. Some of the footage is really quite breathtaking and when there's music, it suits the footage. I think I might've liked the film more if there was a lot more music.","user":"EclecticEnnui","rank":[8,10]}]