[{"title":"What was that really?","rating":1,"date":"19 December 2015","review":"I do not tend to exaggerate, but I can say for sure this makes the top five of the worst films ever. Never in my lifetime of watching films have I ever seen a film that has kept me so uninterested, so bored, so frustrated with its meaningless events, its miscreation and constant super effort to become something important and special. There was no acting, there was nothing that could actually save this. From the very beginning to the very end a void. A void that was so vast that engulfed everything and everyone that were and took part in this. I do not know what \"inspired\" and led these people to be part of this production. Bottom line? No, no, no, never again!","user":"opiostheloego","rank":[41,48]},{"title":"Embarrassingly bad.","rating":1,"date":"10 October 2015","review":"This movie had about the same budget as any given old-school Power Rangers episode, but with worse acting and even worse special effects. I feel sorry for the creators of it, because they seriously lack talent at what they do. Asylum has a long history of shitty movies, and quite honestly, I don't how how they can afford to keep making garbage like this. All of the actors were disinterested in their roles, and you could almost read the \"man this movie is crap, when do I get paid?\" expression on their faces. As for the script itself...if you were to give a child a box of crayons and a handful of paint, I promise they could create a better script than this. It's truly embarrassing that this movie even passed the brainstorming stages.<br><br>1/10","user":"lordkrythic","rank":[62,75]},{"title":"possibly the worst acting, sfx, and lighting in recent years","rating":1,"date":"22 December 2015","review":"So, there are some great scenes and lighting and then all of the sudden two of the male leads are in tank tops and tee shirts, on mars. Are you serious, did they run out of money for wardrobe? The 3d modeling and compositing is pretty good, but it really looks like something from the knight rider days.<br><br>Now, the acting, is absolutely tragic. I wonder often, who casts these people and how confusing it must have been to see so many bad actors line up that these are the best they could find. Is snakes on a plane worse or better than this? Every now and then these beautifully lit scenes that look like deadspace are ruined by soap opera lighting, and I can't figure out why. why? The inconsistency from pretty good to absolutely wretched is amazing. I think this video should be the 'oh my god i am in this' not 'my friend is a lead in this'.<br><br>I hope this is fun, a joke like sharknado, because it is really bad.","user":"kristoffe-brodeur","rank":[20,27]}]