[{"title":"Happily Surprised!","rating":18,"date":"18 January 2017","review":"I will be the first to admit that often movies in the Christian genre are cheesy, outdated, heavy, and, honestly, a bit embarrassing for the Christian community. I was delighted to see that The Resurrection of Gavin Stone has broken the previous mold. I appreciate that there are characters designed to basically poke fun of the Christian stereotypes (guess what? We get it. Most people outside of our community think we are lame. That's OK). This movie addresses those stereotypes directly in a lighthearted way in a broader communication to showcase the acceptance and welcoming community that a church can be. Not everyone has that experience at a church every time, but to showcase the example of what it should and could look like is beautifully done. The skepticism and acceptance of people brought on both sides of Christian characters and non-Christian characters is spot on. Overall, this is lighthearted, an excellent story of finding one's way in life, and ultimate acceptance of who people are and where they are in life. I will be seeing it again.","user":"mindyr-70476","rank":[41,51]},{"title":"Entirely underrated and a cut above most Christian film fare","rating":7,"date":"15 July 2017","review":"I remember seeing the trailer for THE RESURRECTION OF GAVIN STONE and thinking what a great concept and a great cast. It had all the signs of being an above-average Christian film, even with its Christianity so blatant—not a bad thing, necessarily. After the movie came out, I waited eagerly for reviews from moviegoers—Christian moviegoers, at least. But I heard nothing. I literally heard nothing. Surely someone had seen it, I thought. So I asked my Facebook friends, via a status update, for someone, anyone to review GAVIN STONE. I got no reply at all. I read the PluggedIn review, which gave it a fine rating. But I sort of expected that, unless it really, really stunk. Then, a few weeks later, I asked again, \"Has anyone seen this film who could offer a review?\" Again, no answer. Apparently no one saw it. I assumed Rotten Tomatoes would give it negative reviews, as they are notoriously anti-Christian, regardless the quality of the Christian film, be it described as one and they did. Well, I saw THE RESURRECTION OF GAVIN STONE recently, at last. And I was disappointed. Not in the film but that this inspirational comedy didn't get a fair shake. It was a really good movie. The leads were well cast, with Brett Dalton (AGENTS OF S.H.I.E.L.D.) in the lead as the title character, a narcissistic, has-been child actor whose life hits the skids due to a moment of indiscretion that results in him having to do 200 hours of community service for a church in Chicago. He begins doing janitorial work. But when he learns that the church is rehearsing for a play about the life of Jesus, Gavin convinces the pastor to let him audition—after lying to him and telling him that he is a believer. He gets the role of Jesus and masquerades as a fellow Christian with frequent hilarity which pokes fun at the Church and those outside the church who would presume to understand it. The bedrock of the film is a message about redemption and the power of Christ to change a seemingly hopeless life. With comedienne Anjelah Johnson-Reyes and veteran actor D.B. Sweeny adding some fine performances, taking nothing from the rest of the cast, this film does indeed rise above the usual Christian fare. The only criticisms I have are that some of the supporting Christian characters were cringe- worthily stereotypical—nearly unforgivable in a Christian film made by Christian—and that the plot was predictable. However, the thrust of message, at the film's climax, although expected, was delivered exceptionally well in a way that made up for any flaws and genuinely touches the heart. Christian movies never get a fair shake from Hollywood, mainstream critics and the liberal elites, the ones people pay attention to. The films MOM'S NIGHT OUT (a very, very funny comedy) and PERSECUTED (an excellent suspense thriller), both released in 2014 were treated with similar derision, and for no good reason. It saddens me that more people, especially Christians, didn't bother to see and support these deserving films that have raised the bar for Christian movies. It saddens me even further that a fine actor like Brett Dalton may never consider lending his talent to another Christian film because of the critical reception of GAVIN STONE. Same with Anjelah Johnson-Reyes and D.B. Sweeny. In closing, may I encourage you, especially Christian believers or those who don't mind a Christian worldview in a film, to, even now, rent these films. They're good films—exceptional in most cases. And let the filmmakers and producers know that you want to see more film like them made that say something good and reflect a more virtuous point of view. Support Christian films—we need them! And don't let critics determine your opinion before you've seen themor any more to follow.","user":"kevinmkraft-371-970996","rank":[12,13]},{"title":"Feel Good Inspirational Drama. MUST SEE!","rating":10,"date":"7 January 2017","review":"In Theaters on January 20th. Guaranteed you will laugh out loud, likely you will cry and cheer as well, as you get the opportunity to peer into a slice of life in this character driven comedy drama with broad appeal. The Resurrection of Gavin Stone is an exceptional script using a \"fish out of water\" story telling formula to effectively pull off the delicate balance of engaging and likable characters, anecdotal comedy and is sprinkled with sidesplitting humor. Brett Dalton is perfectly cast to play the role 'Gavin Stone' an arrogant self-centered childish man who runs into trouble with the law. Gavin Stone is an actor with tremendous talent, a 'has-been' child star. After his mom's death and endless string of indulgent partying left him out of the scene and off the screen for years. One \"off the hook rager\" lands Stone sentenced with 200 hours of state mandated community service hours to be served at local Masonville Bible Church. A party boy in a church lends itself to a hilarious string of missteps that make you laugh and still love seeing the changes in Gavin as he engages with the locals and eventually come to care about more than just himself. Stone gets out of mopping bathrooms by playing Jesus Christ in the Church's stage production. Three quirky characters, local church boys, come around Gavin to help him, and he in turn then helps them be better actors in the play. You will love these 3 amigos. John Mark - hilarious bible nerd with a heart of gold. Anthony – a wanna be actor and über Stone fan boy. And the most surprising character, Doug. Doug is a tough guy biker, dedicated to helping others in need, played convincingly by Shawn Michaels. At the same time, Gavin has a volatile relationship with his father (played by Neil Flynn) and a budding interest in Kelly (Anjelah Johnson-Reyes) the director of the play, who by the way is the Pastors Daughter. This movie may be categorized in the Faith Based Movie genre and still will appeal to the larger market of movie-goers as a top shelf feel good inspirational drama. The Resurrection of Gavin Stone sits next to my favorite inspirational films, sports dramas, and 'It A Wonderful Life' type films that I truly enjoy with the entire family. In short, it's a must see!","user":"baPhatz","rank":[32,47]}]