[{"title":"Cute B-grade film, but...","rating":6,"date":"30 November 2018","review":"I'm sick and tired of the producers thinking they can trick their viewers with fake reviews! 16/16 reviews are all fake, pathetic! Producers need to learn that a review should be honest and from their viewers, and instead, not paying for fake reviews. That money should have went towards better writing.<br><br>This film was cast perfectly and all actors performances were excellent. Writer/director Henry Barrial directed this film very well, but his non-climatic pointless writing was where this film missed the mark. It was a good premise about the Uber/Lyft driving scene, but that's all it was, a bunch of passenger stories that went nowhere, and that were dragged out and paced way too slowly. I was expecting something relating to Leonards music background to happen, like catch a break somehow, or win some grand DriverX award for his efforts, or something to happen with his marriage, but nothing. The entire last act with the rock band and the girl was even more pointless. The writing was lazy and could have been much better. Henry Barrial should've stuck to directing and hired a better writer to re-write his story. As such, the ratings for this film are certainly not worth anything above a 7 (in considering a low budget B-grade film), which is what I would've given this film, but it loses a star for all the fake and dishonest reviews. Thus a 6/10 from me.","user":"TheTopDawgCritic","rank":[35,42]},{"title":"A Note From The Producer","rating":10,"date":"4 December 2018","review":"Oh, boy, I am so not supposed to do this...<br><br>I couldn't help responding to some of the reviews my film is getting. I know, I know, but this is a very personal film for me--self-financed, and four years of my life--and I just want to set the record straight on a couple of things.<br><br>First, the film was made on a micro-budget. I hope it doesn't show, but when I'm not paying for a script supervisor or most other typical crew members, I can assure you, I am not paying for reviews here on IMDB! It's a little presumptuous to assume that just because someone likes a film more than you did that they must be \"fake\" reviewers, or bought and sold. So, how in the world could there be so many reviews before the film even officially opened? Because for a year we took the film to film festivals. And at every film festival I attended (which was every one of them), I asked audience members that if they liked the movie, to please go to IMDB and rate and review it. Now, I suppose I could have also requested those who didn't like the movie to do the same thing, but what kind of idiot producer would do that? Asking people to review the film was as far as it went between them and me. What they said was up to them. And I don't know any of these people. Their opinions--and that's all any of this is anyway, right?--are completely theirs, but they are no less valid than anyone else's.<br><br>Second, I understand that no movie will please everyone, and I would argue that independent films especially and by design, challenge audiences more than bigger commercial films do. That's kind of their point. I appreciate hearing what people liked and disliked about our movie. It's not a perfect film and we're not perfect filmmakers, but I'd like to respond to one issue a few people are having. Filmmakers are not supposed to \"explain\" their movies, and I won't be doing that. And I didn't write or direct the film anyway, so Henry's opinion is not expressed here. But one of the reviewers explicitly asked for a response to their critique that the film didn't have an ending. Or probably more accurately, didn't have the kind of ending you'd expect in a commercial movie. That reviewer even suggested an ending that they'd probably want to see, something like a Rider offers Leonard a job that solves all his problems.<br><br>To this question of the ending, I'll say first that we certainly believe the film has an ending, as subtle as it may be. I'm not going to try to explain what that is because certainly it will be different for different viewers and I don't want to be reductive. I can say that the movie's overall ambition was to be honest and authentic. Perhaps we succeeded at that, perhaps not. But speaking as a 54 year old (about the same age as Leonard), who is looking at his life and where it has led him (in much the same way Leonard is doing in the film), and how it has not ended up as planned and dreamed, acceptance of this fact (or I suppose suicide), is the only realistic response to finally realizing you're not young anymore and maybe that dream will never come. It's not realistic to assume someone is going to hand Leonard a magic key that's going to solve all his problems. It hasn't happened to anyone else my age. Does that happen to you? In a Marvel movie or another flight of fantasy, we fully expect that kind of ending. But would you really want to see that in a movie that attempts to portray life as we know it?<br><br>I love all kinds of movies. Movies with happy endings and movies with sad endings and movies with subtle and even ambiguous endings. A famous writer once said that Art isn't supposed to answer questions. Art is supposed to ask them. Maybe DriverX doesn't quite qualify as Art for everyone who sees it, but please know that that was our intention. And absolutely, to entertain as well.<br><br>Thank you for indulging me.","user":"markstolaroff","rank":[32,41]},{"title":"Worth watching","rating":9,"date":"7 December 2018","review":"This is an engaging slice-of-life portrait of a rideshare driver who's struggling with aging, fatherhood and marital issues.","user":"beshid","rank":[5,6]}]