[{"title":"Tight, well presented miniature action-war film.","rating":7,"date":"24 August 2016","review":"This is a little hidden gem of a film, you probably won't find it running anywhere as it has a limited budget and almost zero media behind it. But you SEE every dollar on the screen and it looks like it cost twice the sum, so stick with it. Very much a war film, behind enemy lines and a plot that, while based in Korea, is one we know very well. French resistance type of action. Liam Neeson makes a very good MacArthur (much better than Tommy Lee Jones and Sir Laurence some time back), at times catching even the face quite right. (Greg Peck has the high honor). But here we have a straightforward story of brave men doing brave deeds with honor. We should remember such men, and this film gives their heroism a chance to shine. BTW this may be a fictionalized plot but it is based on true events. All told, well worth the time.","user":"reisen55","rank":[31,50]},{"title":"Odd mix","rating":6,"date":"2 December 2018","review":"Part spy thriller, and part action film this is a weird mix film. The spy aspect is done well, with good tension, and the framing scenes about the preparation around Macarthur are well done, but also largely irrelevant to the main story. But then things go wrong, the film becomes an over the top action film, with bullets flying everywhere. If it had been one or the other it would have been better, but the two aspects make for strange changes in pace which don't really gell well.","user":"nickboldrini","rank":[5,6]},{"title":"Nothing special - conventional, gung ho war movie","rating":4,"date":"8 July 2018","review":"September 1950. UN forces under General Douglas MacArthur are poised to invade and retake South Korea at the port city of Incheon. However, the operation, Operation Chromite, is fraught with risks and has a high probability of failure. In order to gain more intelligence on enemy positions, especially the placement of sea mines, MacArthur sends a team of eight Korean spies into Incheon. This is their story.<br><br>So-so. Had potential to be a gritty war drama, telling the story of the Battle of Incheon, which was a stroke of military genius. Instead it is a fairly conventional, gung ho war movie. Historical and military accuracy, and general plausibility, is sacrificed at the expense of action scenes, melodrama and empty sentimentality. <br><br>Dialogue is generally over-the-top and quite ridiculous at times. Every kind of cliché you can think of, MacArthur (played by the unfortunate Liam Neeson) gets to utter. Add in a character whose sole job seems to be calling out the names of comrades as they get hit and otherwise being sullen and whiny, and some pretty hammy acting and you have a recipe for a pretty average movie, at best.","user":"grantss","rank":[6,8]}]