[{"title":"Here's how it ends- all 5 times.","rating":2,"date":"3 April 2018","review":"SPOILER: I'm going to start off by saying that I typically love bad horror movies. I can suspend disbelief like a champion. But this goes beyond hand-waving and into the realm of lunacy. <br><br>The first 3/4 of the movie were exactly like you'd expect. Set up the experiment, establish the characters, ignore the harbinger, and get down to business. Things look promising and then, of course, things start to go terribly wrong. <br><br>Unlike most horror movies, though, the characters don't get killed off one at a time. The vast majority of them go down in one fell swoop. And then... then things start getting weird. \nOur hero seems to be the only Titan that *doesn't* die or go mad, and instead does... nothing. He loses the ability to speak and apparently also, the ability to mouth words, gesticulate, write, or do anything except stare meaningfully at his wife. His house is attacked by soldiers who rival Stormtroopers for mass ineptitude, and he just... runs away. \nENDING ONE\nHis wife finds him, and they stare into each other's eyes and kiss. A military helicopter flies toward them, fade to white. \nENDING TWO\nThe wife wakes up in a hospital bed back on the base. She has lacerations on her face. The head scientist apologizes that she was \"roughed up\" and explains that she needs to convince her husband to go to Titan. He brings her to where the titan is locked in a glass box. \nThe head scientist tells her that the titan is refusing to leave because he has too many attachments to earth. He tells her that she needs to give him an injection, which she protests as being a \"lobotomy.\" He will forget everything.\nThe chemical lobotomy is in a special glass vial nestled in a special foam box right next to an identical glass vial labeled SALINE. \nObviously, she switches the vials. There are an additional ten minutes of unbroken eye contact, and then the wife rushes to leave. Inexplicably, she takes the head doctor with her. The doctor who is the one who did all these experiments and also *lied to her face* about what was happening- now in this very moment becomes one of the good guys. \nJust for good measure, the doctor realizes what happened and shouts \"you switched the vials!\" clarifying the transparent ruse for audience members who may have dozed off during the scene. Behind them, the Titan pauses for dramatic effect and then attacks at the last moment. \nENDING THREE\nThe wife and the head doctor pick up the son (played by a mannequin for the rest of the movie) and run full tilt for the exit. They're met there by the injured titan who has escaped and gotten in front of them despite being pursued by about fifty soldiers. \nThe head scientist shows up with more soldiers and orders them to shoot our four fleeing heroes. They refuse, and instead turn their guns on the head scientist. Grateful, the wife runs back to the titan and they hug some more. <br><br>There is no resolution to this scene. \nNot kidding. There is none. \nNo explanation for why the head scientist suddenly decided he needed to kill the one successful participant in his experiment. No resolution for the head doctor. No explanation of this base's command structure or what consequences there were for the soldiers who refused to follow orders- if any. Nobody explains what they planned to do with a lobotomized titan in space. No follow up on anything whatsoever. <br><br>ENDING FOUR<br><br>Opens on an airplane. The titan is in an iron lung and the head doctor is there. Some guy I don't recognize tells the wife that her family is a miracle and that the titan changes everything and 'gives us hope.' Why? No idea. It fades out over a nightime cityscape. <br><br>ENDING FIVE<br><br>The wife is in some kind of lab, analyzing soil samples. She goes outside and looks up into the nighttime sky. The camera zooms in on the sky and then pans to the side a little bit to reveal a huge yellow orb. It's rocky, so... probably not Saturn? \nIt cuts back and forth between the wife staring into the night sky and the now-junkless titan standing on what is, presumably, Titan the moon. Also he has wing membranes now so there's that.<br><br>The music would indicate that this is a dramatic and happy ending. I am... completely baffled. I'm not sure where she was standing, if it was supposed to be out in space somewhere, or if it was back on Earth. I have no idea what he is eating all alone on this moon of his. As far as I can tell, the human race is still more or less doomed. <br><br>I have no many questions.","user":"blahsblahjunk","rank":[313,350]},{"title":"Good acting... bad story","rating":2,"date":"3 April 2018","review":"Training people to live on an uninhabitable planet because the earth is becoming... UNINHABITABLE. Say that again slowly. Why does he have to go to Titan? Why can't they just train his body to survive the new harsh weather on earth? I don't have a problem with the acting and special effects, I just feel like the story was not well thought out.","user":"cjnicolas-97438","rank":[107,120]},{"title":"Why was the jelly not in the refrigerator?!?","rating":4,"date":"9 April 2018","review":"4 hours after watching the movie and I am still greatly bothered by this.","user":"rymad","rank":[63,70]}]