[{"title":"Film shows the raw reality of the north.","rating":8,"date":"8 March 2018","review":"I saw this film at a private screening in Yellowknife. I am very skeptical and I expected another B-List film. While the cinematography styles may have left something to be desired, there was no lacking in the plot. The film was well presented in a way that is not \"over the top\" but is also not \"lacking\". While the ending of the film felt a bit abrupt, almost as though they forgot to add the last scene, the journey to get to that point was thrilling and exhilarating at almost every point.<br><br>I enjoyed this film more than any big name film that I have seen in the last two years.","user":"fillionlandscapes","rank":[12,16]},{"title":"Surprisingly Great","rating":10,"date":"28 November 2018","review":"I watched this film in Australia and wasn't sure what to expect. The story was so simple and well told that I somehow forgot that I had just been introduced to new characters and a place/part of the world I had never been. Truly exceptional indie film... I hope more people get the chance to see.","user":"brunocapouillez","rank":[5,7]},{"title":"As good as anything I saw in 2018!","rating":7,"date":"4 February 2019","review":"Competently directed and superbly acted, this great little film has an awful lot to teach the big directors and studios who sink millions into projects which are not nearly as good. This can't have cost much to shoot, but makes the most of its three shining stars, the two lead actors and the amazing scenery of Arctic Canada. Just gorgeous.<br><br>There's nothing hugely original here and not much of a story - it's a character piece and, to be honest, doesn't even need the few minutes of drama it contains (though these work well enough). But those characters! Writer-director Kirsten Carthew has created a rare urban princess who is neither irritating nor pitiable, brilliantly played by Devery Jacobs. A total fish out of water, this absolutely real and thoroughly frustrated character never moans but struggles to come to grips with her new environment, rather than blindly kicking out against it - therefore we love her and want her to succeed. The hunter character meanwhile is super laid-back and again completely believable, as opposed to the irascible arms-length hermit-types we so often meet in movies like this.<br><br>Not everything is done as well as it might be. The cross is OTT and the very passive reaction to a situation which cries out for the kind of aggression on show at other times is just the opposite. And the last five minutes, where the director rushes to tie up every conceivable loose end, are best forgotten. But small imperfections cannot spoil what is an excellent little film and a thoroughly enjoyable viewing experience. As good as any film I've seen this year.","user":"freydis-e","rank":[3,4]}]