[{"title":"After 10 minutes....","rating":2,"date":"14 October 2017","review":"This is an unbelievable waste of air time. The plot starts off slowly and confusingly. Only to develop into a predictable mess. Filled with poor acting and a story line that has faults all over. Like bolt cutters appearing by accident, just at the right moment and injured people able to run away, at speed with life threatening wounds. The law officers in this county were looking for two escaped convicts? More like they were looking for a tin of custard in a supermarket and did not bother to look in the tinned custard section of Walmart. I have tried not to include spoilers, I dare you to watch this and then give IMDb an honest opinion in reviews for yourself. It really is that bad, that it needs to be proved as such by viewers worldwide.","user":"davey184","rank":[20,31]},{"title":"Kinda bad.","rating":4,"date":"14 October 2017","review":"OK. Let us begin: the camera work will be the first thing you'll notice. It's weak and amateurish.Then the actors and their supposed job: by indie standards, both hit the floor. Plot: started obvious, has a better change to it towards the finale, a little of this and a little of that. <br><br>Is it recommendable? Far from it. Does it have any horror to provide? Again, no! Just a lot of nonsense overall. Sorry to say so but you won't find anything entertaining here. Plot holes, bad acting, bad kill shot and horrible fake deaths. <br><br>American Gothic translates into American NoNo. Try instead: Intruders (2015), Hush (2016) or even Don't Breathe (2016).<br><br>Cheers!","user":"gothic-fiction","rank":[14,23]},{"title":"Surprisingly good!","rating":8,"date":"3 December 2017","review":"I saw the low ratings this movie got, but decided to check it out, just in case.<br><br>No idea how the time flew by so fast, but the next thing you know, the credits were running.<br><br>That alone should be a good indicator of the movie's promise of entertainment.<br><br>The story is simple, contains no shocking surprises but still worth the attention it deserved.<br><br>Don't listen to naysayers, they know not what they speak of.<br><br>Check it out.","user":"deelolazjourney","rank":[6,10]}]