[{"title":"Fans of Yorgos Lanthimos will love it. I'm not sure about everyone else","rating":7,"date":"20 January 2019","review":"The Favourite, the seventh feature from Greek auteur <a href=\"/name/nm0487166/\">Yorgos Lanthimos</a>, is a film that eschews both convention and expectation. On the other hand, it's also Lanthimos's most accessible by a country mile. A savage morality play, a camp comedy of manners, a Baroque tragedy, an allegorical study of the corruptive nature of power - it's all of these and yet none of them. A film I liked but didn't love, on the one hand, it's too long, the plot too threadbare, and the metaphors and allegories too ill defined. On the other, the acting is flawless, it looks amazing, the first half is very, very funny, and the end is very, very dark, with the last shot one of the most haunting/disturbing images I've seen in a long time.<br><br>Set in England in 1708, the film tells the story of Sarah Churchill, Duchess of Marlborough (an icy <a href=\"/name/nm0001838/\">Rachel Weisz</a>) and one-time scullery maid Abigail Hill (<a href=\"/name/nm1297015/\">Emma Stone</a>, charting a course from doe-eyed ingénue to vicious Machiavellian intrigant) and their increasingly bitter rivalry for the affections of Queen Anne (an absolutely mesmerising <a href=\"/name/nm1469236/\">Olivia Colman</a>), and is the first film Lanthimos has directed which neither he nor <a href=\"/name/nm3328207/\">Efthymis Filippou</a> wrote (the script was originally written by <a href=\"/name/nm7629302/\">Deborah Davis</a> in 1998 and later refined by <a href=\"/name/nm1110111/\">Tony McNamara</a>). Although it deals with real historical personages and events, historians probably won't be too thrilled to learn that Lanthimos is relatively uninterested in either historical actuality or socio-political contextualisation (to say nothing of the slam dancing). This is a story about a love triangle, with everything else just the background noise against which that triangle plays out.<br><br>And it is most definitely a Yorgos Lanthimos film, with his peculiar Weltanschauung omnipresent. The emotionless and monotone delivery of dialogue has been scaled back considerably from <a href=\"/title/tt3464902/\">The Lobster (2015)</a> and <a href=\"/title/tt5715874/\">The Killing of a Sacred Deer (2017)</a>, but everything else you'd expect is here - the pseudo-omniscient judgemental glare; the dark absurdist humour; the formal rigidity; the emotional isolation of the characters; the surrealism; the games of psychological one-upmanship; the alienation of the audience; the thematic centrality of shifting power relations; the lack of distinction between poignancy and joviality; the use of self-contained and closed off pocket universes where characters must play by rules differing from those of the outside world; intimate familial conflict (except in bigger rooms than in his previous films); and a disorienting score. Similarly, whilst The Lobster was a savage dystopian-set allegory for discipline and conformity, The Favourite is a merciless satire of decadence and pettiness, taking in such additional themes as class, gender, love, lust, duty, loyalty, partisan politics, patriarchal hegemony, and women behaving just as appallingly as men.<br><br>As one would expect from Lanthimos, the film is aesthetically flawless, with many of the compositions having the appearance of a fête galante painting, so meticulously integrated are <a href=\"/name/nm0694309/\">Sandy Powell</a>'s costume design, <a href=\"/name/nm2356249/\">Fiona Crombie</a>'s production design, and <a href=\"/name/nm0752811/\">Robbie Ryan</a>'s cinematography. Powell's costumes are historically inaccurate, but thematically revealing, with the situation of the characters at any given moment directly influencing the design, especially in relation to Abigail as she climbs the social ladder. In a more general sense, the black-and-white colour scheme of much of the wardrobe contrasts magnificently with Crombie's predominantly brown production design, with the actors effortlessly standing out from the backgrounds.<br><br>Of Ryan's photography, perhaps the most impressive feat is that, despite the many scenes tracking characters through rooms, up stairs, and out doorways, there's not a single Steadicam shot anywhere in the film. He also makes copious use of 6mm fish-eye lenses, which distort the spaces the characters occupy whilst also showing much more of the environment than a normal lens, creating the sense of characters lost within an overload of background visual detail. Combined with the whip pans seen throughout the film, the cumulative effect is a world rendered strange, a place of distortion and unnatural compositions. As with most of Lanthimos' work, the film also uses natural light, which makes for some stunning candle-lit night-time compositions, partially recalling the paintings of someone like Jean-Antoine Watteau or, even moreso, Georges de La Tour.<br><br>In terms of acting, there really are no words to describe just how good Colman is. Utterly inhabiting the character, she is able to elicit empathy mere moments after behaving thoroughly shamefully, communicating a sense of both tragic inevitability and a childlike refusal to accept reality. The character could easily have been a grotesque villain or a pitiful broken shell, but Colman finds a nobler middle ground, straddling both interpretations without fully committing to either, moving from one to the other seamlessly throughout the film. Yes, she can be a horrible person with appalling manners and questionable hygiene, but she is also deeply lonely, a survivor who has lost 17 children in childbirth, a woman whose health has made her old before her time, a tragic figure too naïve to see how badly she is being manipulated by Sarah and Abigail. Rather than trying to downplay the contradictory facets of the character, Colman leans into them, illuminating Anne's humanity amongst her least appealing characteristics, and finding both wit and pathos in a character whose mercurial nature and excessive neediness could easily have rendered her the film's antagonist. It truly is one of the finest on-screen performances in a long time.<br><br>The film's most salient theme, one could argue its very raison d'être, is the dynamic of gender politics. For starters, it's headlined by three actresses (something which is still rare enough as to be notable), whilst the men are portrayed as petty, vainglorious idiots. Men, in general, are background players, existing only to be mocked, exploited, and duped - with their ridiculous wigs and heavy makeup, they exist only to support the women. However, what's especially interesting about the film's depiction of gender is that the world of women is anything but a utopia. Yes, it's relatively free of toxic masculinity and the male gaze, but in most other aspects, there's no real difference between the matriarchy and the patriarchy. Sure, the women are much smarter than the men who surround them, but they are no less greedy or cruel. At the film's post-première press conference at the Venice Film Festival, Lanthimos explained, \"what we tried to do is portray women as human beings. Because of the prevalent male gaze in cinema, women are portrayed as housewives, girlfriends...Our small contribution is we're just trying to show them as complex and wonderful and horrific as they are, like other human beings.\" Similarly, when asked by the Hollywood Reporter if a film about females treating each other badly might be considered a setback in a post #MeToo era, Colman explained, \"How can it set women back to prove that women fart and vomit and hate and love and do all the things men do? All human beings are the same. We're all multifaceted, many-layered, disgusting and gorgeous and powerful and weak and filthy and brilliant. That's what's nice. It doesn't make women an old-fashioned thing of delicacy.\"<br><br>As regards criticisms, although I personally wouldn't class them as flaws, some people will probably dislike the same things that many have disliked in Lanthimos's previous work - cold formal rigidity, perverse sense of humour, and irredeemable characters being irredeemably horrible to one another. There will be those who find the obviously intentional anachronisms too much, whilst others will take umbrage with the disregard for historical authenticity. For me, whilst I admire Lanthimos for trying to bring something new to his oeuvre, especially when compared to Sacred Deer (which just repeated the beats of The Lobster), I felt the film was oftentimes trying to work its way through an identity crisis, unsure of exactly what kind of tone to settle on. I had similar feelings about the allegories that run throughout, and are never what you would call fully fleshed out. Obviously, it's a treatise on power and the ridiculous opulence of royalty, but that's not exactly an untapped issue in cinema. Additionally, one of my biggest problems with Sacred Deer was how utterly pointless it felt, and although I got a lot more out of The Favourite, I had something of the same reaction to it. It could also be argued that the characters are a little two dimensional, and filmgoers who need a protagonist to latch onto, someone to root for, will be left rudderless.<br><br>Superior to <a href=\"/title/tt1859446/\">Alpeis (2011)</a> and Sacred Deer, but not a patch on <a href=\"/title/tt1379182/\">Kynodontas (2009)</a> or The Lobster, The Favourite will probably attract a sizable unprepared audience because of awards buzz, positive reviews, and excellent trailer. Undoubtedly, for a lot of people, this will be their first exposure to Lanthimos, and I can only imagine what people expecting a Merchant Ivory costume drama will make of it all. Neither morally enlightening nor historically respectful, The Favourite offers a bleak assessment of humanity's core drives; not Lanthimos's bleakest, but a hell of a lot more nihilistic than an average multiplex goer will be used to. The characters within the film live in a milieu of egotism, narcissism, sexual cruelty, psychological bullying, greed, and hunger for power. There's barely a hint of sentimentality, and very little that could be called morally righteous. I would have liked it to have more meat on its bones, but at the same time, one cannot deny that it presents something of a faithful looking-glass, as Lanthimos continues to corner the market in pointing out not just humanity's worst foibles, but its most egregious eccentricities and lamentable character defects.","user":"Bertaut","rank":[312,395]},{"title":"Lanthimos Delivers... But The Ending Could Use Some Work","rating":8,"date":"22 September 2018","review":"Sumptuous and stunning. With THE FAVOURITE, director Yorgos Lanthimos delivers his best film yet - one that works as both a historical drama and a sex comedy that features beautiful cinematography courtesy of Robbie Ryan (Lanthimos really loves him some fisheye lenses) and gorgeous costume design courtesy of Sandy Powell (just give her the Oscar already because wow). Lanthimos, working for the first time with a screenplay that he didn't co-write, deals primarily with themes of power and the way it impacts the three women at the center of the film. Despite not having had a hand in writing the screenplay, Lanthimos seems to be in his wheelhouse, crafting a stirring yet (darkly) humorous rumination on humankind's innate desire to posses power, whether it be political, sexual, or anything in between. Granted, Lanthimos is also working with some of the most talented actresses working today and the big three (Olivia Colman, Rachel Weisz, and Emma Stone) all deliver some of the best work of their career. As crazy as it might sound, however, and despite Colman's Best Actress win at Venice for her portrayal of Queen Anne, this is Stone's film. I'm already frustrated by the fact that she will be campaigned in the Best Supporting Actress field despite the fact that the film wholly follows her arc. That's not to take anything from Colman, whose performance is likely the most impressive of the three, but I do feel it's something to take note of.<br><br>However, the film isn't flawless, and it once again demonstrates that Lanthimos' greatest weakness as a director is his inability to deliver a satisfying conclusion. I loved THE LOBSTER, but the last ten minutes left a bitter taste in my mouth that I detested. I was a bit cooler on THE KILLING OF A SACRED DEER, and the last ten minutes proved a bit too dark for me. This time, even a great final shot isn't enough to save the last fifteen minutes of the film from seeming necessary. The film simply (and suddenly) runs out of steam before it crosses the finish line - an unfortunate occurrence considering the fact that nearly everything before it proved wickedly entertaining. That being said, I'm excited to see what Lanthimos does next. I just hope he nails the ending.","user":"roblesar99","rank":[441,646]},{"title":"Wow!!","rating":9,"date":"20 February 2019","review":"In early 18th century, the friendship between Anne, first Queen of Great Britain and Lady Sarah Churchill, the wife of the Duke of Marlborough, was very close and then deteriorated because of their differing political views and the growing influence of another favorite, Abigail Masham. The film focuses on the rivalry between these 2 women, Abigail and Sarah: lousy tricks, alliances, treacheries, ground shiftings, sex, ... Everything is allowed to obtain the favors of the queen!<br><br>The actors, the photography, the costumes, the 18th century atmosphere despite voluntary anachronisms, the rhythm, the dialogues, the soundtrack, ... This is an excellent achievement. Smart, dark, irreverent, cruel and immoral.","user":"FrenchEddieFelson","rank":[60,82]}]