[{"title":"Nice and fun","rating":8,"date":"6 January 2017","review":"Well, I didn't know this was a Christmas short. It somehow ended up in my laptop and now that I've seen it, I thought why not review it especially because it has Dr.Watson or Martin Freeman in it.<br><br>It's a fairly simple story with Martin Freeman's Stick Man, who lives with his family and one fine day decides to go for a jog and finds himself in an adventure he wasn't really expecting. That's it. No complications, no hidden meaning. Simple and fun.<br><br>The animation had a stop-motion kind of a feel to it. I mean, it looked like stop-motion but nowadays animation has reached such heights that it's difficult to tell the difference between actual stop-motion and artificial. Stick Man's youngest kid is the cutest Stick I've ever seen. The dialogue in the movie consists of rhymes that are said by various elements in the movie like the frog or the pigeon etc. It was basically Toy Story with twigs, oh sorry, Stick Man. Martin Freeman really plays these funny, frustrated characters really well and he conveys it only by the grunts when he slams into an oar and also how his tone changes every-time he says the poem.<br><br>Definitely give it a watch. It's only 27 minutes long which has 5 minutes of credits in it. It reminded me that shorts and even full- length films can be made just for the fun of it and this one made me feel like a kid again.","user":"Pramitheus","rank":[13,13]},{"title":"On my way home","rating":7,"date":"29 January 2016","review":"Stick Man is an endearing adaptation of Julia Donaldson's children's book featuring the voices of Martin Freeman, Sally Hawkins and Hugh Bonneville. It remains faithful to the rhyming text.<br><br>Stick Man lives in the family tree with his family. Stick lady and stick kids or should they be twigs?<br><br>However while he is out for a jog he gets snatched by a dog and there begins a series of events leading him to be taken further away from home and seemingly no chance of finding his way back to the family tree as the seasons come and go. Luckily for Stick Man there is a festive tinged ending in sight for him.<br><br>Stick man takes a lot of knocks in this heart-warming CGI cartoon adaptation but he is a kindly soul but at a loss as to why people do not see him as a person but just as a stick.<br><br>As a slightly cynical parent it is easy to be dismissive of these types of Christmas day special cartoons but I found this to be charming.","user":"Prismark10","rank":[6,7]},{"title":"Another success for Donaldson","rating":6,"date":"31 December 2015","review":"\"Stick Man\" is a British television short film from the writing team of the 2 Gruffalo short films and \"Room on the Broom\". It's not difficult to see that, also without the trademark squirrel and the rhyming verses from start to finish. It is about a stick man, who is mistaken for a stick and unlucky coincidence makes it that he gets taken away further and further from home as the film goes on. It goes on for 26 minutes and the thing takes place at Christmas. In the end Santa gives to the stick man after the Stick Man helped Santa before. A cute little film, mostly for younger audiences, but grown-ups can also have fun. The cast includes Oscar nominee Sally Hawkins, Emmy winner Martin Freeman (for the main character) and Golden Globe nominee Hugh Bonnevill voicing Santa. Not bad for a television production. I personally thought this was a good watch. No truly great moments, but certainly worth checking out during the holidays.","user":"Horst_In_Translation","rank":[3,3]}]