[{"title":"On the road of rural France","rating":5,"date":"12 August 2017","review":"'Four days in France' is not for everyone. Don't take me wrong, the sex is tame. It's the French who discuss grand ideas and philosophy which ill befits at time the American character. A gay man walks away from his long time lover for reasons unknown. A man feeling the existential angst of approaching middle age and takes to the roads of rural France in Auvergne and the foot hills of the Alps. He looks very youthful with hints of wrinkles around the eyes. In search of adventure with an app on his i phone to hook up for anonymous sex. Along the way we see the majesty of rural France in all its natural setting: a France hollowed out by abandoning small towns for the cities, for comfortable homes closer to larger cities. The countryside is a wonder to see, but the length of the film (2 hours 17 minutes) deserves cutting. Pierre Thomas the footloose protagonist is feckless, indecisive; he's versatile and if all else fails will play the dog in his trysts. Paul his lover tracks his wandering lover by the use of the i phone and maps as he tracks Pierre. Very little flesh, very little sex, but a 'disquisition' on life and loneliness. Matthieu the 20 year old he spends the night with...Pierre sees in this pretty young 'David' his own life: leaving a stifling village because he's gay..arriving in Paris fresh and fresh as a peach; affairs and then an older man who turns this 'Pygmalion' into a Parisian...with finer tastes, an Alfa Romeo...you get the picture...and this he's willing to leave on a quest that remains as unformed as his reasons to go on the road. The stronger personalities are the woman he meets on his journey, along the winding curving narrow roads of France. Lonely women whose life is unfulfilled. There a wonderful cameo with Judith Pierre's aunt, the overripe actress who declaims, with expressive hands and scarlet painted nails, and a mouth with bright blood like lips before a mirror in tones of Corneille's 'Medea' the sadness of her life of one night stands, only to end up in rural theater with a woman director who may be her lover. She suggests Pierre should think twice about running away from life; his old French school teacher running a rare bookshop who is lonely in a small town where she's 'someone', not the one of the nameless millions in Paris; a thief whom Pierre gives his watch, clothing and manuscript...a fed up elderly lady who threatens to call the police owing to the endless anonymous sex in a woods near her house; a salesman with whom Pierre wants to become physical sex, but in a powerful sequence, each on the other side of adjoining motel rooms masturbate with deeper and deeper breathes. An elderly gay man who rejects Pierre because he smells down there and avoids physical contact but his penchant for fellatio. And finally Marie France to whom Pierre delivers a letter and a package. She has buried herself, a hermit she, deep in the countryside that likens to Poussin's paintings tempered by the hills of southern France. As 'Jours de France' draw out, Pierre drives in deep fog to the French Italian border. He turns his back on escaping further south and to another country, and here we know he's made a decision. The denouement: no surprise here Paul finds Pierre...they embrace .. a Hollywood ending? But the film continues to the shores of the Mediterranean where Napoleon returned from Elbe and where the child Paul was happy. This is all lost on Pierre who childlike sleeps the sleep of the exhausted.","user":"jakob13","rank":[9,9]},{"title":"Only in France","rating":5,"date":"23 June 2017","review":"I truly wanted to like this film; it has much going for it. The acting and cinematography are superb, taking the viewer to parts of France rarely seen in film. Unfortunately, the filmmaker is more interested in cobbling together a series of set pieces featuring the philosophical musings of odd characters encountered by the protagonist than he is in telling any sort of coherent story. Pierre skips out on his long-time partner, Paul, one night and drives (and drives and drives) aimlessly. After a lone sexual encounter, Pierre crosses paths with a series of quirky individuals with much (but actually very little) to say. As presented, Pierre is a pleasant-looking cipher who seems to serve only as a vehicle for setting up the odd encounters which, in and of themselves, do not sustain enough interest for the viewer to care about this very slow trip through France. Paul frantically searches for Pierre, tracking him through Grindr(?!). Will he find him? Who knows? Who cares? This is a slow-moving film presented in a style peculiar to French cinema with little, unfortunately, to sustain it.","user":"jrcham94","rank":[10,13]},{"title":"Cogitative French gay road movie","rating":7,"date":"28 May 2017","review":"When the main protagonist steps into his car, riding away from his humdrum life and partner, Grindr at hand, ready to have it off with half the male population of France, I was on board too. I anticipated for there to be many casual encounters between him and other men. He drives from one renowned public cruising hot-spot to another, guided by comments left online or in magazines that indicate that a certain public restroom or parking place is teeming with potential homosexual liaisons after sunset. There are a few of these chance encounters in the film, but more than sexual frisson, the focus is on conversations and the non verbal dynamic between these men. One of the depictions of a spontaneous meet, is a very clever reference to Jean Genet's eponymous short film \"Un Chant D'Amour.\" And I believe there are a great many other references to other French gay luminaries from the past throughout the film.<br><br>This road movie can be considered gay, but it is also largely focused on intersections with women - who function as commentators on male homosexuality - and the protagonist's vices and virtues. The story plods along extemporaneously, from one interaction with an eccentric stranger to another, exposing in each encounter, a particular idea about relationships, incongruities in people's personalities, some sage observations, or just plain awkward behaviour. <br><br>The main protagonist, (and his boyfriend following him hot on his heels), stumble upon one idiot savant after another, and these haphazard meetings are all contrived into one long poetic story, which, although it takes some patience, does come to a worthy rewarding cohesive conclusion.","user":"sugarfreepeppermint","rank":[8,11]}]