[{"title":"Good movie but lack of chemistry.","rating":5,"date":"9 February 2017","review":"I saw the title for the movie a few weeks ago, and I've been wanting to see it since then. I'm a little disappointed.<br><br>The plot was good, believable. It made so much sense, i'm actually happy. Yes, it's predictable. But when one has seen so many movies of this type you know the ending for all of them. Even the subplots make sense. The character were good too though, but...<br><br>What disappointed me was the lack of chemistry between the two leads. I have never seen them act before, but every time Scott talked to Olivia I felt he was uncomfortable. Olivia is a nice character trying to save her dad's company, and she did it great, but I felt she was indifferent. I was happier with her dad's story and Karen and Peter's.<br><br>Despite that, It was a nice movie, enjoyable, but if the leads do not have that spark, I feel that the movie is somehow empty.","user":"MIssM19","rank":[14,14]},{"title":"Forgettable","rating":4,"date":"8 July 2017","review":"This rom com isn't very involving or memorable. An interior decorator is laid off and goes back to help her father's moving company. She falls for a guy who is working there. Nothing to distinguish this from any other Hallmark movie. Ambyr Childers is the lead - a pleasant if not too memorable performance. Her love interest is Keegan Allen of PLL. He isn't very good at romantic roles. Needs some acting lessons. Some subplot about small businesses and big businesses taking them over.<br><br>This is the kind of movie you can have on in the background while you are doing chores.","user":"phd_travel","rank":[2,2]},{"title":"Formulaic romance movie","rating":7,"date":"10 June 2017","review":"Typical modern Hallmark type formula: Girl meets Guy Perpetually in Need of a Shave (GPNS). One or the other has a bad BF or GF (BGF in this case). There is a misunderstanding, then a pursuit and they end up together. An outstanding difference here is that after the pursuit, the guy suits up and shaves!!! Added 2 stars for that alone.<br><br>The Hallmark Heroine (HH) is Olivia, the daughter of widower Neil (Jerry from Parks and Recreation), who runs the family moving business in California. She's a designer in NYC that is fired for being too textbook in her designs, so she accepts an invite to her dad's 25th business anniversary. She meets the GPNS upon arrival, and there is a minor conflict. As time goes by, we learn he had taken the LSAT and scored very high. He of course has a BGF, and this comes to a head later.<br><br>The family business is in trouble due to competitor Acme undercutting them. Business soon drops to zero, and after the HH uses her design skills to help convince the GPNS' grandma to move into a retirement home, they hit on a successful formula. They offer staging as part of the move, and are back in business. The local Acme guy realizes his boss is evil and goes to work with them.<br><br>The GPNS and BGF part ways after they realize they want different things- BGF wants the GPNS to work for Acme movers, but he wants to be a lawyer.<br><br>The grandma moving, widower dad's GF, and another couple are subplots that are all positively resolved.<br><br>The misunderstanding takes place when the HH sees the GPNS hugging the BGF. Of course it was innocent, but she takes off back to NYC.<br><br>Near the end, the GPNS sees an invite to the HH's event. He pursues her there wearing a suit and is clean shaven. He's going to law school on the east coast and explains the misunderstanding. They kiss and live happily ever after.<br><br>It's a basic entertaining Hallmark type of romance movie. I'd normally rate it mid-range, but was so impressed a character actually took the time to look professional in a suit I added 2 stars.","user":"darkavenger77","rank":[1,2]}]