[{"title":"A totally unexpected Omar Sy","rating":8,"date":"27 January 2017","review":"I though I knew Omar Sy from his other work: \"Intouchables\", \"Nos jours heureux\", \"Chocolat\". But this is something else! Excellent performance! He's so into his character that it feels he isn't even acting, just being. The plot twist towards the end is a real surprise. You go on guessing the story line, but it goes to and fro a few times. Along the way, you're really rooting for more than one person! It's a tale of \"deserving\" versus \" rights\", feelings versus facts. Clémence Poésy did her part very well too and so did Antoine Bertrand, madly in love with his work, thinking very fast. The tempo and timing looked good, I did not feel its length of nearly 2 hours. All in all, a good movie, certainly worth watching, for men and women alike.","user":"fotopfw","rank":[42,49]},{"title":"YES FRANCE!","rating":8,"date":"26 April 2018","review":"What a delight to watch a movie where the situation is reversed from one of the biggest clichés in American cinema. Black protagonist with better conditions for a child's creation where the mother, white, would be the problematic. This is rare in hollywood movies. Thank you France! <br><br>Comedy-like drama with good actors and a simple text, but that makes us think about our responsibilities. Very beautiful movie!","user":"philipfalzer","rank":[16,20]},{"title":"Not too bad a remake","rating":7,"date":"14 September 2017","review":"This was made as a European version of the Mexican original. The original was released in 2013 and called \"No se aceptan devoluciones\" or \"Instructions Not Included\" and this one was released in 2016 and is called \"Demain tout commence\" or \"Two Is a Family\" Both are bilingual. This remake is pretty good but as with almost all remakes, not as good as the original. This version does skip past a few scenes and key story points but otherwise is almost scene for scene the same.","user":"mark_derry","rank":[11,13]}]