[{"title":"A solid adaptation, albeit with a bit too much alpaca-based comedy","rating":7,"date":"11 November 2019","review":"Written and directed by <a href=\"/name/nm0822582/\">Richard Stanley</a> (his first film in 25 years, after he was infamously fired three days into production on his long-gestating dream project, <a href=\"/title/tt0116654/\">The Island of Dr. Moreau (1996)</a>), Colour Out of Space is a modernised adaptation of <a href=\"/name/nm0522454/\">H.P. Lovecraft</a>'s 1927 short story \"The Colour Out of Space\", and takes a good stab at depicting one of Lovecraft's most oblique entities. Mixing humour and body horror (perhaps weighed a little too much towards humour), the film gives <a href=\"/name/nm0000115/\">Nicolas Cage</a> another opportunity to go full-Cage, and boy does he lean into it - this is the most ludicrous, histrionic, and borderline farcical performance he's given since <a href=\"/title/tt0098577/\">Vampire's Kiss (1988)</a>, and how much latitude you give him may well determine your opinion of the movie.<br><br>Just outside the city of Arkham, MA (the fictitious setting of many Lovecraftian stories), Nathan Gardner (Cage), his wife Theresa (<a href=\"/name/nm0000613/\">Joely Richardson</a>), and their children Benny (<a href=\"/name/nm2063811/\">Brendan Meyer</a>), Lavinia (<a href=\"/name/nm4699715/\">Madeleine Arthur</a>), and Jack (<a href=\"/name/nm6623135/\">Julian Hilliard</a>) have moved into Nathan's deceased father's property, with Nathan embracing rural life by raising alpacas on the property's farm. On an otherwise normal night, the sky fills with pulsating light and a meteorite crashes onto the Gardners' land, and as time passes, the Gardners start to experience ever-more bizarre events - unnaturally localised lightning storms that seem to come from nowhere; huge fuchsia-like plants that seem to grow overnight; a horrific odour that only Nathan can smell; a gigantic purple mantis flying around; radios and the internet cutting out more than normal; the water turning strange colours; the family's dog, Lavinia's horse, and Nathan's alpacas starting to acting strangely; even time itself appears to be corrupted. And soon enough, the family members themselves begin to show signs of unnatural change.<br><br>After some basic narrative preamble and a contemplative sub-<a href=\"/name/nm0000517/\">Terrence Malick</a>-style voiceover, the film features one of the most inorganic expositionary scenes I've ever seen, as Nathan and Theresa stand on the porch, and spend a good five minutes telling each other things that they both already know. Thankfully though, the clunkiness of this opening isn't a sign of things to come, and one of the film's most consistent elements is the subtlety with which Stanley depicts the entity, or rather, doesn't depict it. Lovecraft felt that if humanity were ever to encounter real cosmic beings, they could be so unlike anything in our experience as to be impossible to describe, or even process in our minds, and one of his aims with \"Colour\" was to create an entity that doesn't conform to human understanding - hence the only description is by analogy, and even then, only in relation to a colour beyond the visual spectrum. With this in mind, Stanley wisely keeps everything as vague as possible - vibrant, modulating pulses of light that seem to be emanating from somewhere just outside the frame, vaguely-defined spatial distortions, colour manipulations with no obvious source, etc.<br><br>Important here is the colour itself, and instead of attempting to create the indescribable colour featured in the story, director of photography <a href=\"/name/nm0995132/\">Steve Annis</a> chooses to go the route of not settling for any one stable colour - every time we see the effects of the meteorite, the hue appears to be in a state of flux - so although we can say the colours are recognisable, they're never identifiable as any one specific colour, which, is probably the best choice the filmmakers could have made.<br><br>As we get into the third act, the film abandons all sense of restraint and goes completely insane, with the body horror which has threatened to break through from the earliest moments finally unleashed, foregrounding the exceptional work of special effects supervisor/creature designer <a href=\"/name/nm2087361/\">Dan Martin</a>. These scenes are heavily indebted to <a href=\"/name/nm0000343/\">David Cronenberg</a>, especially his earlier work such as <a href=\"/title/tt0073705/\">Shivers (1975)</a>, <a href=\"/title/tt0076590/\">Rabid (1977)</a>, and <a href=\"/title/tt0078908/\">The Brood (1979)</a>, although the most obvious touchstone is <a href=\"/name/nm0906901/\">Chris Walas</a>'s work on Cronenberg's masterpiece, <a href=\"/title/tt0091064/\">The Fly (1986)</a>. A lot of Martin's creature design also seems inspired by the legendary work of <a href=\"/name/nm0001964/\">Rob Bottin</a>, and there's a direct visual quote of one of the best moments in <a href=\"/name/nm0000118/\">John Carpenter</a>'s <a href=\"/title/tt0084787/\">The Thing (1982)</a>.<br><br>It's also in the last act where Cage is turned loose, signalled by an epic meltdown when he discovers Benny hasn't closed the barn door and the alpacas have gotten out. From there, it's Nicolas Cage unrestrained. There is a problem with this, however. Full-Cage has been seen in films such as Vampire's Kiss, <a href=\"/title/tt0119094/\">Face/Off (1997)</a>, <a href=\"/title/tt1095217/\">The Bad Lieutenant: Port of Call - New Orleans (2009)</a>, <a href=\"/title/tt5462326/\">Mom and Dad (2017)</a>, and <a href=\"/title/tt6998518/\">Mandy (2018)</a>, but each performance has felt fairly organic, never becoming self-conscious. In Colour, however, to an even greater extent than in the virtually unwatchable <a href=\"/title/tt0450345/\">The Wicker Man (2006)</a>, Cage crosses into self-parody, with his performance having as much to do with people's preconceived notions of a Nicholas Cage performance as it does with finding the character. There are a couple of scenes here that seem to have little to do with legitimate character beats and more to do with Cage winking at the audience.<br><br>Which might be entertaining and all, but which doesn't serve the film especially well. For all its insanity, this is a relatively serious movie, but Cage's performance is so manic, that it affects everything around it. For example, after the aforementioned meltdown (\"Don't you know how expensive those alpacas were\"), which just about fits with what we know of the character, as Nathan is walking away from Benny and Lavinia, he stops, turns, pauses, shouts \"ALPACAS\", pauses again, and then walks away. This got a huge laugh at the screening I attended, and it was undoubtedly funny. But does self-reflexive humour by the leading man help tell the story or even create the right tone? No, not in the slightest. In essence, this scene marks the point where the character ceases to be Nathan Gardner and becomes a version of Nicolas Cage.<br><br>The other characters all have a kind of internal logic to their crumbling sanity; the meteorite affects each of them differently, with their minds disintegrating in different, but consistent ways. With Nathan, however, Stanley seems unwilling, or unable, to establish the parameters by which his mind is breaking down, seemingly going for laughs rather than something more cogent.<br><br>This issue notwithstanding, I enjoyed Colour Out of Space a great deal. Stanley's return to the director's chair is to be admired for its restraint and how faithful it remains to the very tricky Lovecraftian original. The body-horror in the film's last act will appeal to fans of the grotesque, whilst others will take great pleasure from Cage's insanity, as narratively unjustified as it is. The film is ridiculous on many levels, but it's extremely well realised and well made, and is to be applauded for not trying to attach an explicit meaning to a story which avoids any kind of thematic specificity.","user":"Bertaut","rank":[178,240]},{"title":"Even the very thought out and carefully planned Cage Rage cant save this boring film.","rating":4,"date":"14 March 2020","review":"Inspite of being a fan of Nic Cage's over-the-top, grimacing, eye-bulging performances, I was totally disappointed with this film.\nAnd since this is the third collaboration between Cage and XYZ films, (the awesome Mom And Dad and Mandy), the expectations were high.\nThe expectations went further high as this is directed by Richard Stanley (Hardware, Dust Devil n The Abandoned) but the end product turned out to be boring.\nNic Cage goes crazy aft 60 mins n that's when the movie picks up for few mins and then goes downhill.\nIt has lots of colors, lots of flickering lites n lots of hazy n blurred scenes.","user":"Fella_shibby","rank":[31,41]},{"title":"Great Cosmic Horror but Mainstream Audiences May Not Like as Much","rating":8,"date":"10 October 2019","review":"We were all excited about this year's H.P. Lovecraft Film Festival (HPLFF) and the Pacific NW premier of Richard Stanley's colourful Color Out of Space adaption of Lovecraft's famous story.<br><br>Color shows why Stanley should do more feature films (hopefully more Lovecraft or weird tale adaptions) as his passion and his knowledge of the source material shines through... much like Lavinia's forehead. It is also a very personal film for Richard as it touches on elements from his own life.<br><br>Over all the film is solid and I think the cinematography is great with very well-done CGI. Richard focuses on the family as he should but it feels like the movie has been edited down as we have gaps in the appearance of certain characters who only appear in the first and last acts. The most creepy and unnerving scene is with actor Tommy Chong near the end of the film... it is really perfect. The weakest part of the film for me is Nicholas Cage ... he is okay but distracts from the film at times. I would have preferred to have seen more of Madeleine Arthur as Lavinia Gardner.<br><br>Overall I am giving this an 8 since it is a serious attempt at a Lovecraft adaptation and hits the cosmic horror nail on the head... however I think most mainstream viewers won't get the love to source material and give it a much lower rating.<br><br>\"It was just a colour out of space - a frightful messenger from unformed realms of infinity beyond all Nature as we know it; from realms whose mere existence stuns the brain and numbs us with the black extra-cosmic gulfs it throws open before our frenzied eyes.\" -- H.P. Lovecraft, The Colour Out of Space<br><br>Lovecraft was very proud of \"The Colour out of Space\" calling it \"my best tale\" and \"the only one of the lot which I take any pride in.\" Richard should take pride in his adaption as well.","user":"accts-696-251131","rank":[135,204]}]