[{"title":"Swing and a miss","rating":5,"date":"2 August 2018","review":"I love a good post apocalyptic thriller so I was looking forward to this one. It starts really well, and then quickly becomes odd, then frustrating, then just plain eye-roll worthy. <br><br>The entire movie jumps back and forward between timelines but does so in a way that feels very jarring. The entire relationship between the two leads felt unrealistic... so many plot points and character decisions just became too much of a stretch for me. I can suspend my disbelief to a certain point but c'mon guys... <br><br>I really wanted to like it, it was shot beautifully, the creatures were genuinely creepy, and it had potential. <br><br>Points for originality, I definitely wasn't expecting what I saw (though I did call the 'twist' about 20 minutes before it happened). The message that the writer tries to leave us with is a nice one but feels out of place in this genre and left me with too many questions.","user":"julyanstephens","rank":[36,49]},{"title":"Metaphorical ending...","rating":8,"date":"4 December 2019","review":"I enjoyed the movie overall (even the ending) but I was a bit disappointed in critic's take on the final scene. I did not once consider that Jack had returned as The Reaper. I believed that the monster had regained just enough strength to make one final attack on Julia, which was a gentle clawing down her face. Immediately this reminds Julia of her rocky marriage with Jack. She is able to see the beauty within the monster (foreshadowing from the art gallery) and gives her a chance to finally say 'I love you' and 'goodbye'. But what do I know 🤷‍♂️","user":"davidjkovalik","rank":[14,17]},{"title":"Hostile is How I Felt After Suffering Through It","rating":2,"date":"15 June 2019","review":"Starts out interesting enough, if a bit clichéd. When the girl takes a sharp turn off the road and traps herself in her car the film takes a turn toward interesting...and then slides into unbelievable, and then down to tedious, continuing to the depths of tediously unbelievable, before tumbling with a splat into the sucky-tank. There are some decent scenes in the trapped vehicle which are then disrupted by flashbacks revealing unlikable characters and unbelievable relationships. Then everything decent about the post apocalyptic sequence is hurled out the window as the pain of a broken leg is, for the most part, forgotten; monster behavior is inconsistent (supposedly hates a flashlight beam but will move toward a brighter flare pointing at it?) and even the leads ability to aim a gun, or a willingness to use it effectively varies as the \"script\" requires. Cap that off with the stupidest, least believable or logical ending I have seen in decades! I understand it's supposed to add unexpected depth but it is so far fetched and contrived, and worse, rather obvious before it occurs, that it is the thinnest thought passing itself off as an idea.\nAnd it didn't help that, not only did I hate the lead character, I thought the actress playing her was equally bad.\nI kinda hate myself for watching it.\nLife is wayyyyyyyyy too short.","user":"zandertowne","rank":[31,44]}]