[{"title":"A thought-provoking and darkly comedic drama with lots to say.","rating":9,"date":"4 December 2017","review":"\"Three Billboards outside Ebbing, Missouri\" marks a milestone for writer/directer Martin McDonagh and is an idea piece on a mother's struggle with her town after posting billboards containing a call to action in regards to her murdered daughter. With outstanding screen writing and near perfect editing, this powerhouse of a film is easily one of the best all year and is driven with force and intensity by its lead, Frances McDormand.<br><br>What begins as a narrow and focused drama, gradually escalates to a film with big themes and ideas, relevant social commentary, and much more subplots than anticipated. \"Three Billboards outside Ebbing, Missouri\" is packed with questions and a few answers about anger, revenge, violence, and kindness. The story shows people in a realistic light I've never quite seen before. We're presented with characters and their genuine emotions. Nothing feels sugarcoated of fluffed but it never lacks emotional impact either. <br><br>The movie balances its seemingly contradictory tones beautifully by crafting a dark comedy that feels heavy due to strong subject matter, while at the same time, utilizing comedic moments that feel completely natural to the character's motivations. It's obvious great care was taken into this script and the method in which it's constructed. <br><br>One of the most talked about elements to this film are the strong performances; particularly by Frances McDormand and Sam Rockwell. Rightfully so, this is some of their best (if not their best) work these eyes have beheld and they steal the show in every film they're in. That's not take away from Woody Harrelson and Lucas Hedges, as well as the entire cast who give memorable performances and paint shockingly believable characters that we feel we know personally. <br><br>If there is anything that might turn audiences away from this film, it might be its harsh subject matter despite none of it every being depicted as well as its language and execution with the material. Personally, this has a strong impact and I wouldn't have changed anything about it. It's a highly recommended film with a lot to ponder at the end and is definitely a contender for best movie of the year. Definitely don't miss this one.","user":"tyson-hunsaker","rank":[385,531]},{"title":"Fires Of The Heart","rating":9,"date":"4 December 2017","review":"Frances McDormand is, without question, one of the very best actresses of hers or any generation. Wow! And like most of the greatest she goes for characters who don't ask for sympathy. The truth is in her eyes, always. So, naturally, I followed her every inch of the way. She is surrounded by a fantastic group of actors. Woody Harrelson is just extraordinary but perhaps the biggest surprise is Sam Rockwell making his one eighty not just believable but very moving. Martin McDonagh's writing is the magic potion that keeps everything together and when I say everything I mean everything. Humor and horror as if it were practically the same thing. The dialogue is brilliant and Frances McDorman deserves the last paragraph. Her face is a wonder. Superb performance. Don't miss it.","user":"damian-fuller","rank":[325,463]},{"title":"Anger, what it begets, and what to do about it","rating":9,"date":"17 February 2018","review":"When you think about great cinema, you often imagine some grandiose epic setting which all that greatness builds upon. The likes of Gone With the Wind or Godfather or The Shawshank Redemption, such films span through decades or cover the major historic events.<br><br>But a great story isn't necessary grand on the outside. Three Billboards Outside Ebbing, Missouri is like a tiny rabbit hole size of those three wooden screens, but stick a head in - and you'll see a huge empty space laid with people's sorrow, guilt and regret. And that emptiness sucks you in and leaves no way to stay untouched.<br><br>But there's also hope. Hope for justice. Hope for retribution. And maybe even hope that it's still not too late to change something, or to change yourself. That nothing is absolutely black and white. That even in the darkest moments of our lives there's some room for a sense of humor, maybe a sad and bitter one but still one worth a warm smile.<br><br>This world is a crooked place, where crime often goes unpunished. And Peter Dinklage's small role in this film, as a reference to another not so pretty world where the \"happily ever after\" way doesn't quite exist, is a stinging reminder of that. TBOEM does not, however, try to pull the magic sword out of the stone and go crush the wicked and protect the righteous. Instead, it shows that sometimes, crumbling under the weight of the evil things that fall on us, we lose our own limits and become those who sow evil ourselves. Anger does beget even more anger.<br><br>And maybe the reason that makes America great indeed is that, with all the messed up stuff happening without and within, it's in your culture to value forgiveness, something Christianity teaches everyone but not everyone tends to listen. To suffer without guilt, yet to offer a helping hand to your offender when he's down and wounded. To break the circle of evil and help each other wake that yearning for decency that everyone has inside them, albeit dormant sometimes. Forgiveness is tough, and, just like revenge, it doesn't bring back the things - or people - we've lost. But at least it helps to hold onto what could still be here.<br><br>Yeah, it's just a movie, and most people aren't as deep and philosophical as the movie characters can afford to be. But if some unrealistic complexity (and sometimes even wisdom) of the simple people could make some real regular people on the other side of the screen stop and think over their own real regular ways, maybe that's exactly what we need from time to time. Because life is still here, and so are the multiple choices it gives, And which road to choose today, we can still decide along the way.","user":"Semisonic","rank":[198,280]}]