[{"title":"Mixed feelings (no pun intended)","rating":6,"date":"26 June 2017","review":"This isn't an awful movie and it does have some good moments, but I struggle to think that it really works. Firstly the story itself is pretty improbable although the idea of a mad surgeon wanted to experiment is not new it is still a bizarre thing to want to do, especially to worry about the quality of her work when changing the guys sex to female. Michelle Rodriguez does a pretty good acting job but never really convinces that she is ever male. From the outset it looked like a girl with a beard, apart from the shower scene where they must have used either CGI or good prosthetic. She also didn't really convince as an assassin and made some pretty silly errors of judgement but I guess that is down to the script rather than acting. So over all I have mixed feelings. It isn't a bad movie just not a great one.","user":"nicholls_les","rank":[27,30]},{"title":"I am trans and was looking forward to this!","rating":5,"date":"10 March 2017","review":"Forget the uproar from sensitive trans groups, this film was never transphobic, it was just a classic revenge thriller. Waking up as the opposite sex is the worst thing imaginable for the overwhelming majority of society and tat's the crux of the film - not an attack on trans. If anything, its success would spark a franchise of a kick-ass trans-woman - talk about giving trans the spotlight! I am trans myself and I was looking forward to it as it seemed to be a throwback to the films I grew up on in the 80s when one man would avenge his life being ruined (usually his family being massacred). However this film was dull and muddled and riddled with exposition.<br><br>The biggest problem is that it's told in flashback and with lots of - literally - one character 'talking' the story to another (Frank to the camera, the Doctor to the other doctor) and as a result there was no tension only on the nose dialogue. The other problem was a completely unlikeable anti-hero in Frank and a completely unbelievable performance by Michelle Rodriguez who never once convinced she was a man with her female frame, female build, female skin and female voice. Similarly, Weaver's The Doctor was lacking. I appreciate she was playing an aloof, detached character but there was nothing to her character. There was no bad guy you wanted to root against just as there was no protagonist you wanted to root for.<br><br>This film could have been a solid, action-filled romp had it been told in a linear fashion and with stronger characterisation. As it was, it was a boring affair with too little action, style or interesting characters. The IDIOTS who say it's transphobic are, well, idiots. It's no more transphobic as Death Wish was phobic to people who have been raped and murdered.","user":"MsJackieO","rank":[76,103]},{"title":"Very Strange Movie","rating":5,"date":"4 March 2017","review":"I write this review utterly confused. I am tempted to pan this flick on account of bad acting, a weak plot and some outrageously ridiculous make-up stunts . But as I said, I am utterly confused. Could the director actually have intended the movie to be so ? I , for one, do not know.<br><br>Nevertheless, to begin things Sigourney Weaver ,synonymous with the Aliens franchise , is cast in the movie by the director ( Walter Hill , the producer of the Alien Franchise) an an intelligent surgeon . One can see obvious attempts to play Hannibal Lecter in some sequences. <br><br>Michelle Rodriguez lives through of one the worst make-up jobs I have seen in this genre. She plays a male-hit-man for the first few minutes in the movie . She looks very funny , though to her credit she doesn't act funny.<br><br>The action sequences are quite simple and matter of fact. Michelle comes in point the gun and shoots people without much ado. This is a relief because frankly I am tired of watching extended chase sequences shot with unsteady cameras, highly stylized but futile hand to hand combat scenes ( a trend started by the Jason Bourne series ).<br><br>Nothing much is kept from the audience and another good part about the screenplay is that characters confront each other and say things for they are . Despite some scenes of useless pseudo-philosophical banter involving Weaver, the movie is globally clean of complexity. <br><br>Even as I write this review I tempted to increase the movie's rating. Just did. <br><br>I wouldn't advise watching it deliberately. If you are on a flight or want to watch something to pass your time , it may serve the purpose very well.","user":"lediscipledessocrates","rank":[29,42]}]