[{"title":"Desolation: Bland but passable","rating":6,"date":"13 January 2018","review":"Going into Desolation I had no idea what to expect, it was a nameless pick &amp; mix movie for me.<br><br>It tells the story of a pair of friends and a teenage boy who go hiking in the woods only to be stalked by a mysterious figure in black.<br><br>It's very paint by number stuff but is done well enough to be entertaining.<br><br>Our delightful stalker has no gimmick, he has no motivation and I really didn't like that. This Rob Zombie looking git had no character at all which hurt the film.<br><br>Ultimately it delivers provided you aren't seeking originality or surprises. Its copy and paste the movie with every cliche in the book, but is just good enough to get past that.<br><br>The Good:<br><br>Well made<br><br>Fairly tense<br><br>Decent finale<br><br>The Bad:<br><br>Nothing original<br><br>Dull antagonist<br><br>Things I Learnt From This Movie:<br><br>Maybe the killers motive was that kid being really annoying","user":"Platypuschow","rank":[38,44]},{"title":"Middle of the road, but enjoyable","rating":5,"date":"17 May 2018","review":"This is a decent film. There's not a whole lot that's memorable about it, but it's not terrible by any means. There's a good chemistry between the two lead actresses and the actor who plays the son holds his own. There are a few moments of decent tension throughout, but nothing that really made me jump or put me on edge. Depending on who the viewing audience is, I think it could be rather effective. <br><br>I liked the fact it didn't follow all the standard tropes you might expect something like this to fall into. That was a pleasant surprise for me. The movie moves along at a good pace and the short runtime is actually to its benefit. I think any longer and there would have been too many 'hurry up and get moving' moments.<br><br>It seems this was done on a lower budget and there are times when it's obvious, but it doesn't affect the story so I can give it a pass when it comes to those moments. I'll warn you if you're a gore hound and looking for a lot of gore, this film has next to none. If you're looking for everything to be telegraphed and laid out for you, you may not enjoy it. There's a lot left up to the viewers to figure out and piece together. But, it's a horror/thriller and I personally don't really need everything explained, I can just go with it. I know that's not the case for everyone. So, be warned, if you're that type of viewer, you might want to skip it.","user":"AverageJoesDriveInPodcast","rank":[8,10]},{"title":"Could have been a lot better","rating":4,"date":"12 December 2019","review":"Nothing really new here except I don't think that I've ever watched a movie where the protagonists decide to go to sleep when they know they're being stalked through the woods as much as this group did...who would be able to sleep?!?!<br><br>The small cast did good with what they were given. The initial set-up was tense enough and the killer was somewhat interesting in a mysterious way when he was kept farther away from the group.<br><br>But as soon as the killer reached their campsite, the characters start doing dumb things and the killer wasn't so interesting anymore. I was surprised he was able to attack anyone in the dark woods considering he never took his sunglasses off! He had a very blank expression on his face throughout the movie and the most emotion that comes from him is when the kid breaks his sunglasses LOL!","user":"Lizlynn_1111","rank":[3,3]}]