[{"title":"Works as a creepy drama, Falls flat as a horror film","rating":5,"date":"2 February 2019","review":"I was surprised by how much I enjoyed most of this movie. Good character development and chemistry between the actors; with the acting being rather impressive, and likely best thing going for Beyond the Woods.<br><br>If this film were just a straight up drama about some old friends dealing with becoming different people in the interim time from when they last got together until this trip, it would have been rock solid. Even some of the creepiness was at first very well conceived, and could be explained away in the story by the drug/alcohol use and human anxieties they cycle through during their time secluded in the wilderness. It really would have been just fine if left at that. Unfortunately, it was originally developed as a horror flick and so the filmmaker ruined a 7 star indie drama by eventually forcing it into becoming a cliched supernatural slasher. I feel like that's a pretty big shame because the final twenty minutes was just super cheesy and so jarring when compared to the bulk of the story. Things just escalated too fast and it felt out of place. 5/10","user":"umimelectric","rank":[53,55]},{"title":"Good acting, solid script","rating":6,"date":"2 February 2020","review":"I was actually pretty impressed with this film. I was expecting more of a floppy script and cheesy acting but they had a good bunch of actors and the film had everything you would want in a drama, horror film. A top quality movie to watch on the weekend.","user":"irina_rivers","rank":[40,41]},{"title":"Great acting. Carpenter-esque character driven horror","rating":7,"date":"3 February 2020","review":"I was quite surprised with this film. A very misleading poster alluding to a slasher of sorts. If it's a gory slasher you want this isn't what you're looking for. Very light on gore and on screen kills Beyond The Woods does character better than most horror films. A very naturalistic ensemble really sells the story of a group of friends who haven't been in touch as of late. The acting is really outstanding and the small number of special effects are solid too. My only niggle would be I would have loved more horror early on particularly out in the woods during daytime. Best scene in the movie is a guy getting lost in the woods early on which was gripping it really built suspense to breaking point for me. Would have loved to have seen the holy well at some stage too. More horror and I would rate higher but a great film nonetheless. Atmosphere and tension in spades.","user":"jakeben","rank":[39,40]}]