[{"title":"Chilling and effective. A slow-motion nightmare.","rating":5,"date":"5 August 2016","review":"This is the kind of slow-burn horror film that really, truly gets under your skin. the type of horror film that America doesn't make (although the last two years that has been changing, with flicks like The Babadook, It Follows, and The Witch). This won't be for every horror fan, especially those that want more craziness or loud jump scares. Instead, what the film does is establish its characters very well and from then on it lurks and creeps you out until you become more and more terrified by what's happening on screen. It's exactly the type of film that really lingers on the mind and I really hope more people seek it out.","user":"Red_Identity","rank":[34,50]},{"title":"The new and improved Rosemary's Baby","rating":7,"date":"11 December 2016","review":"A subtle horror film not without its moments of suspense and utter creepiness. We follow Elena (accountant turned housekeeper, for some reason) who gets close to her employers (a couple who live in an isolated house without modern amenities, for some reason). She wants to save money quickly to go back to her son and so agrees to be surrogate mother for their baby.<br><br>The film was too slow for some, so if you need quick doses of jumpscares and shock tactics, this isn't one for you. However, I found the departure from mainstream action horror and script to be very refreshing. I was not bored at any point in the movie, because it does an excellent job of building character and relationships in the first half hour. If anything, I was impatient to see where it was all leading, because the story has some unpredictable turn of events.<br><br>Not a lot was answered by the open ending, so you need to pay attention to little details throughout the film, and theories will inevitably run amok with plenty of evidence for more than one horror scenarios. Also, it is always a good sign when you can sympathize will ALL of the characters (which are few to be sure, but very well played).<br><br>It is the most convincing horror movie to come out in a while, and I recommend it to anyone who can get roped into a horror story without a sense of urgency.","user":"cjs6547","rank":[15,20]},{"title":"Eerie, dark, and effective","rating":7,"date":"9 August 2016","review":"Granted this film is a slow burn but the cinematography, dark atmosphere, acting, and score was top notch. Should watch when you are more relaxed and patient cause when you get there you will found it was worth the wait. I am a huge horror fan and I am sick and tired of the basic 90 min horror films that throw all the things at you in the first frame but with this director you have to have patience to fully understand the movie. There was 3 scenes I had to rewind that I missed the first time of viewing this movie. I agree with the thought of Rosemary's Baby by the way of David Lynch and I think it deserves a view. This is a solid horror film.","user":"maryann_blair","rank":[17,26]}]