[{"title":"Endearing Documentary on a footballing 'Miracle'","rating":8,"date":"22 October 2015","review":"'I BELIEVE IN MIRACLES' tells the remarkable story of Nottingham Forest FC and their catapulting into footballing folklore in the mid-late 1970's,thanks to arguably the most flamboyant,controversial yet charismatic and talented manager in English football history,the late Brian Clough,who took them to the height of success not just in England but Europe as well.<br><br>The movie starts when Clough's career was seemingly at the crossroads;after winning the English League Championship with Forest's East Midlands rivals Derby County in 1972,Clough departed along with his assistant Peter Taylor after a series of feuds with the club's directors,and after a brief and unsuccessful spell at Brighton and Hove Albion,rather surprisingly became manager at Leeds United,a club he had often fiercely criticised publicly,along with its manager Don Revie,who ironically hailed from the same industrial town as Clough himself,Middlesbrough.Equally unsurprisingly,Clough's tenure was short-lived in the light of such mutual hostility,and the fractious TV interview alongside Revie is perhaps an appropriate way for the film to begin,progressing from the ridiculous to the sublime.<br><br>By the beginning of 1975,Clough was appointed manager of Nottingham Forest,a club with past traditions in the FA Cup (having won the trophy twice),but not the sort you would expect to win League Championships,as indeed Derby were until they triumphed three years earlier;Derby themselves would go on to win the league at the end of that same season with a different manager (Dave Mackay),whereas Forest ended in mid- table mediocrity in the then second division and expected to remain so or even worse,Brian Clough or not.<br><br>However,the following two seasons saw a gradual improvement,to the extent that Forest won promotion to the first division,albeit narrowly in third place.Not much was expected of them in the new season,being made up of apparent footballing journeymen,cheap signings and unheralded also-rans,with such names as John McGovern,John Robertson,Martin O'Neill,Larry Lloyd,Kenny Burns and Tony Woodcock.Yet thanks to Clough's extraordinary skills of man-management and attractive football,he moulded them and others (most notably goalkeeper Peter Shilton) into a championship winning squad by the season's end,and even more astonishingly went on to win the European Cup two years in succession,acquiring the first million pound signing,Trevor Francis,along the way,who scored the winner in the 1979 final against Swedish club Malmo,in perhaps the least fashionable coda in the tournament's history.<br><br>The story seems woefully far-fetched to the uninitiated yet it did actually happen,and it is all likeably put together in a straightforward but efficient manner by director Jonny Owen,via pithy and amusing reminiscences by long retired players like Burns,Shilton,Lloyd and O'Neill interspersed with highlights of such heady days.The one who comes out of it best of all is Brian Clough himself,who could be both maddening and enchanting,belligerent yet charming,overtly confrontational but intensely articulate,and never remotely dull.<br><br>Inevitably,because director Owen keeps the story down to those remarkable years between 1977 and 1980,many aspects relating to this period and after are conveniently skipped over;the hooliganism that plagued English football at the time,his eventual acrimonious falling out with Taylor,his steady decline due to his alcohol problem and Forest's relegation in his final year in charge,plus allegations of financial misdeeds in his later years.But this was perhaps the right thing to do as the film intends to project a relentless feel-good factor,and it achieves it all very enjoyably with a warm glow by it's finish,helped on immeasurably by a Funk/Northern Soul soundtrack comprising of such tunes of the era which is very well judged and executed,adding to the purveying atmosphere of nostalgia.<br><br>In these days of billionaire benefactors and opulent signings of players from every corner of the globe,this is a timely reminder that the underdog can occasionally triumph against all the odds,thanks to team spirit,outstanding management and attractive football which is genuinely inspiring.And with the likes of an individual like Brian Clough no longer with us,it looked as though it would never happen again,yet barely six months after the film was released, Forest's East Midlands rivals Leicester City performed a footballing miracle of their own when they won the Premier League for the first time in their history with the affable,charming Italian Claudio Ranieri at the helm.But we can still celebrate and enjoy such victories in years past too with such a thoroughly endearing film as this.<br><br>Rating:8 out of 10.","user":"BJJManchester","rank":[12,15]},{"title":"The greatest football film ever made? I think so","rating":10,"date":"18 March 2016","review":"Brian Clough...the man, the legend, there aren't enough documentaries or films about the tandem he and Peter Taylor formed...with the absolutely insane achievements they conquered. Absolutely impossible these days...for a team to get promoted, and then win the 1st division league, 2 league cups and 2 UCL is just the stuff dreams are made of, utterly impossible nowadays, exception made for Leicester...maybe, season ain't over yet. So the film tells the story from the main protagonists perspective, holding nothing back in a humorous tone, a journey back in time to the days of The Beautiful Game, where you really didn't need to work so much on tactics, where you could have a drink before the match, play a game after Sunday roast...the good days. An absolute feel good, whether you love football or not.","user":"in-chaos-we-trust","rank":[4,5]},{"title":"Brian Clough - O.B.E. - Old Big Ed - Legend.","rating":9,"date":"8 January 2016","review":"To football fans in the United Kingdom, the name Brian Clough needs no introduction or building up. Thanks to the release of The Damned United in 2009 his name got noticed outside of Britain, I Believe in Miracles is the perfect follow up to that movie, a sort of explanation as to why there has been a film and documentary about the man and his charges.<br><br>Director Jonny Owen assembles members of the great Nottingham Forest (always Notingham, never Notts) side of the late 1970s, interviews the key players and gets brilliant anecdotes out of them. Concurrently he offers up archive footage and a bitch funky period musical score. Clough is the leader, whose mantra is not one of assembling super stars, but of actually putting a team of men together and asking them to work hard, believe in themselves and be all that they can be. This is not Hollywood, every inch of this doc is true, no artistic licence here.<br><br>The team is a mixture of smokers and jokers, drinkers and jinkers, cloggers and sloggers all responding to Clough's (and his equally important side-kick Peter Taylor) less than normal football training and management methods. Everything here goes against the grain of today's football managers, I mean what manager today would run his men through nettles and then go for a pint with them afterwards?! Players smoking at half time, surely not? Wonderful. This is a true underdog story, a film for footie fans to rejoice in - regardless of who any of us in our tribal leanings support in British football. 9/10","user":"hitchcockthelegend","rank":[5,7]}]