[{"title":"A good film but cannot compare to the 1964 film","rating":7,"date":"21 January 2019","review":"I thought that the film was very enjoyable, however, even though I've been cautioned not to I cannot help but compare this film to the original 1964 film with Julie Andrews and Dick Van Dyke. There's so much to like in the 1964 film.","user":"weekilter","rank":[91,121]},{"title":"Mostly Magical in Every Way!","rating":10,"date":"19 December 2018","review":"Growing up Mary Poppins was one of my favorite films. When Saving Mr. Banks came out a few years back I re-watched the original for first time in years and found a depth I didn't pick up on as a child. So I wasn't really looking forward to a follow up given that the first movie was practically perfect in every way. More to the point who but Andrews could ever do the character justice? Nonetheless, I ventured to see this today because Rob Marshall (he directed the great Chicago) was the director so I had a little bit of hope this would be OK. It is not only OK but it is a wonderful fellow-up to the original film and in some ways closer to the books. My only complaint, and it is exceedingly minor given that it is a family film, is the overall template of Mary Poppins is rather obvious. The new adventure is a bit like the old one and there's a lot of analog scenes between the two films. But given that Mary Poppins returns to help the Banks children again it feels correct that this is the case. The film is surprising in its details, but comforting in its large familiar strokes.<br><br>I think, and I can't believe this is true, Blunt is the main reason for this. Andrews is the gold standard but Blunt is almost her equal. Her Poppins is funny, stern, warm, knows more than she let's on, has everything in hand and is utterly charming. Blunt is everything you would want from the character and more. I was most surprised by her vocal performance being as good as it is. Jack (Bert's stand in and family relation) is also a great character. Miranda gives an crackerjack performance of charm, wit and wisdom. Best (and weirdest) of all Miranda uses a bad cockney accent all the time (and while singing!) that *somehow* manages to be obviously bad yet believable and adorable. Everyone is so good in this and the thing I thought most likely to sink the picture is the best part.<br><br>Not to overlook the score because it is so good I just brought it. It is not quite as memorable as the original but it is solidly singable and ear wormy. So while, say, \"Can You Imagine That?\" is not quite as perfect as \"A Spoonful of Sugar\" it is a brilliant song in its own right. The real standout is \"A Cover is not a Book\" as it is clever, funny, and carries a lot of weight in the story. I think I will playing this on a loop for a while.<br><br>The film is quite technically polished. I would argue that the integration of the live-action and animation is done better here than in the original. The cinematographer, art director, and custom designer did a better job of making the various wolds far more seamless here than in the 1st film. The music hall scene is fun and exciting as well as being a marvel.<br><br>I thought this film was going to be a disaster. Turns out it is among the best of the year.","user":"CubsandCulture","rank":[408,667]},{"title":"Such a huge disappointment","rating":3,"date":"28 December 2018","review":"Story line was all over the place. Song's were boring, I wouldn't have minded the movie being that long had it been good, I only stayed because I thought it had to get better boy was I wrong. Mary Poppins movie is supposed to be magical this definitely was not. The only good thing I can take out of it was the few minutes of Dick Van Dyke. So upsetting Disney ruined what could have been a truly wonderful movie.","user":"ozzy-57047","rank":[248,440]}]