[{"title":"Tried to turn it off but just couldn't","rating":7,"date":"2 January 2018","review":"I read a few reviews before deciding to write this and what I read was they felt this movie was an attack on men in general and that in order to enjoy this movie you had to be a hardcore feminist. Well that's just nuts, as a male I for one liked this film. at one point after I read the reviews I tried to stop watching , I guess I felt that I had to support y gender since that is what they thought. But I just couldn't. There was something that pulled me into it. made me want to watch it all. The reviews that I have read that critic this movie in a negative way are not really critiquing the movie but how they side with the story being told. Saying the movie is bad because its unfair towards men is a weak critic about the movie itself and more of a view into what that person thinks about strong women to begin with.\nThe movie itself is rather slowed paced but always kept me intrigue enough to want to sit and watch it all. Its not my typical type of movie , I am more of an action pact movie guy but every now and then I find myself captivated by a slow paced film such as this.","user":"garycbelleville","rank":[23,35]},{"title":"Excellent","rating":9,"date":"6 December 2018","review":"A harsh look at rape culture in the U.S. Some things I particularly appreciated were the presence of a female promoting rape culture (Sanders) and the portrayal of the rapists. They weren't shown as obvious villains, or as men who couldn't find a willing participant. To take from Noelle's words, they just decide where they want to stick their dicks and then stick them there with no thought to what their actions mean (rape) or to the victim's well being. Honestly I loved Noelle. Do I think all rapists should be murdered? I don't know. I don't think I would mourn their loss, but I'm also not sure if I think it's OK to outright make rape a capital offense. For now, I'm neutral.","user":"dnabney","rank":[8,10]},{"title":"Hugely satisfying payoff","rating":10,"date":"28 March 2018","review":"I loved this movie because the director went all out. Hugely satisfying if you hate rape culture, hate rape, and hate ignorance. This was therapy. <br><br>I felt the film was well researched and thought out. There was meticulous attention to detail on each and every scene.<br><br>For the haters that think the rape vigilante didn't go far enough? Not much revenge? I guess you've never been mutilated by scissors... LOL. Wow some of the comments are just so mind numbing. I guess that's the society we live in. <br><br>It's not a man hater movie, it's a call to attention on an important topic and conversation that is finally relevant. Some people want to be a part of the conversation, others do not. Watch the movie if you want to be a part of the conversation. There's plenty of likable men/characters. But our heroine is a female badass who takes the law into her own hands and dishes revenge on the men who committed atrocities. She dishes revenge without apology. But just to clarify, female killing male movie does not amount to \"man-hater movie.\" If that were the case, then all the movies made about men killing women should be categorized as \"woman-hater movies.\" <br><br>So yeah, if you want to see a rape survivor dish some major pay back to the bros that ruthlessly rape and get away with it... this is the film to see. Francesca Eastwood is so badass. I loved the ending.","user":"freeflowacademy","rank":[17,25]}]