[{"title":"the best indian movie in the history","rating":10,"date":"23 February 2020","review":"If I would I've seen this movie in 2016, it certainly would have been in my list of best movies. If you're going to this movie thinking Aamir will be flexing and showcasing his acting prowess then well and good but the girls are the highlight of the movie, hands down. SCRIPT - Major props to bringing out a story which is inspiring and one which India needs right now. The story is kept grounded in reality. No over-the-top gimmicks. The songs blend in very well with the premise. None of the scenes linger on for a long period of time. There was a very natural flow to the story which helped engage the audience for 2 hours and 41 minutes. Even movies like Mary Kom or Bhaag Milkha Bhaag started to drag by the end but hats off to Piyush Gupta and Shreyas Jain. I have said this that dialogue shouldn't seem like dialogue unless it is a musical or a re-imagining of a play. The dialogue in this movie is a lesson as to how dialogue should be used. Little nods and grunts and expressions serve more than an explanatory conversation. I am not a fan of narration and I wasn't really liking it here either. It was fine for the light-hearted scenes but the serious scenes required silence but I can give it a pass. The only scene which felt a bit off is where Mahavir gets locked up in a room before the final fight. If it didn't happen in reality then it was really unnecessary. DIRECTION - Chillar Party was a movie with some serious message but was a little preachy and Bhootnath Returns went full preachy. Nitesh Tiwari toned down that preaching to a very natural level in this movie. Every single topic that has happened or still happens in a family was touched upon. Beginning from the sleaziness of men to child-marriage to the sacrifice parents make, everything was utilised to the advantage of the movie. None of that brought the movie to a halt. The first half of the movie had a good amount of comedy and that gelled into the second half with ease. The thing that many might not notice that there are no pay-off scenes except for the last scene. If the audience reaches a peak before the ending then the pay-off wouldn't have a solid effect, if used multiple times. Pay-off scenes are those scenes where the characters are shown to be doing things in extra slow-motion to have an orgasmic effect on the audience and the director cleverly used it at the end in order to give proper tribute to the art and the character. FIGHT CHOREOGRAPHY - This section needed a category of it's own and quite deservedly. I saw Mary Kom, Sultan and Saala Khadoos which had extensive fight scenes and all of the movies had extremely lack-lustre fight scenes. The camera moved too much in order to cover up the actor/actresses' incapability to fight. In comparison to all those movies, here the camera just followed the fighters. No wide-shots of the fight from the audience's perspective because that allows the stunt double to come in. All the fights had the actresses in the scene and hats off to all of them for their dedication. ACTING - Like I said before, the best performance among some amazing performances was of the newcomer Fatima Sana Shaikh. That said, it will really be unjust to name one performance as the best performance because everyone was amazing in this movie. Aamir Khan, Sakshi Tanwar, Sanya Malhotra, Aparshakti Khurana,Zaira Wasim, Suhani Bhatnagar,Ritwik Shore and Girish Kulkarni gave amazing performances. As Aamir had put on so much weight, that altered his physicality a lot which enhanced his performance to another level. Sakshi Tanwar should be doing more movies. She gave a very subdued and nuanced performance. Sanya Malhotra as the grown up Babita had very few scenes but her eyes spoke when she didn't have any dialogue. Zaira Wasim and Sulhani Bhatnagar were awesome, just awesome. I was in awe how they are able to emote so much at their age. Ritwik Shore and Aparshakti Khurana together made Omkar a memorable character. I think they had some of the best scenes in the entire movie. I wanted to kill Girish Kulkarni after Ugly and after this I still want to kill him and that's a compliment. The side actors who formed the audience and little roles like the Dangal organiser and the guy who had sleazy theatre also gave substance to the movie. FINAL VERDICT - I am sure everyone has seen this movie by now and if you haven't then please do. It's a complete movie and it is very rare to see a complete movie, without gimmicks nowadays. I loved how they had such eye for detail because they gave that damaged effect to Aamir's ear. Many wouldn't notice it but it's great to that they did to provide authenticity to the character and the movie. It's a 10/10 for me and one of the best movies of 2016.","user":"MR_Heraclius","rank":[41,43]},{"title":"Omg what a great movie.","rating":10,"date":"23 January 2019","review":"I watched this because my son wrestles and I didnt know it was a inspirational but also a tear jerker. Never heard of this movie until our wrestling community here in Ohio talked about it. Definitely one to watch!!","user":"lykansdonnie","rank":[24,27]},{"title":"Aamir is back with a stellar performance of a decade !","rating":9,"date":"21 December 2016","review":"DANGAL is a masterpiece. A terrific film that stays in your heart and remains etched in your memory much after the screening has concluded. A brilliant film that restores your faith in Hindi cinema. Actually, it won't be erroneous to state that DANGAL is the finest film to come out of the Hindi film industry in a long, long time and mark my words, it will be remembered as a classic in times to come. It blends drama, emotions, sportsmanship and patriotism extraordinarily the icing on the cake being Aamir Khan's towering act. This rich-in-merits film has a major advantage too -- the holidays ahead Christmas and New Year -- which will ensure a glorious run at the ticket counters. A must, must watch!","user":"gskrocks","rank":[158,212]}]