[{"title":"Salma Hayek trying to be Sofía Vergara for 90 minutes...","rating":1,"date":"1 May 2019","review":"Awkward, cringe-worthy \"jokes\". So incredibly boring. I don't even know what the plot was. And I love Alec Baldwin. I'm baffled.","user":"kellypryde","rank":[52,66]},{"title":"Great cast with a script written by a 5th grader","rating":5,"date":"20 April 2019","review":"Was Fred Wolf drunk when he wrote this screenplay? The story's concept was good, but the writing was horrible. The written comedy was so stale and stupid, it flopped any potential this film had. A 5th grader could've written a better script - and made it funnier. And I'm sorry... I am a fan of Salma Hayek, but she was utterly annoying in this film. The rest of the all-star comedic cast were great, but clearly their potential was underwhelming from the lousy script. The directing was ok, although certain scenes jumped all over the place, were convoluted, or cut to soon before needed information was given. It's a shame, as this film had potential. It certainly isn't deserving of any 1 or 2's, but is nothing above a 7 either. It's an honest 5/10 from me.","user":"TheTopDawgCritic","rank":[49,65]},{"title":"Baldwin and Hayek should sack their agents","rating":26,"date":"26 April 2019","review":"As a screenwriter myself I know how difficult it is to get anything produced let alone a movie. It is all the more mystifying then that something as awful as this ever saw the light of day. What is even more of a mystery is how two actors of Alec Baldwin and Salma Hayek's stature were persuaded to sign up for it in the first place. I can only guess at their motives but I suspect they were doing it as a favour to the director or one of the producers. If not, both should sack their agents immediately.<br><br>The leads do their best to navigate their way through what is a painfully unfunny script but, ultimately, this will probably go down as the low point of their careers. It's a real shame as Baldwin in particular has turned in some great performances over the years - his cameo in Glengarry Glen Ross being one of my personal favourites. He and Hayek will no doubt bounce back from this but the director and co-writer, Fred Wolf - a former stand-up, unbelievably - may struggle to put this stinker behind him.","user":"cheekysausage","rank":[28,36]}]