[{"title":"Australian Indie is Engaging","rating":7,"date":"27 May 2018","review":"Set in the small Western Australian town of Corrigan, in 1969, this Australian indie has loads of concurrent themes abounding, including a murder mystery, the blatant racism of the time, sexual molestation, infidelity, loyalty, friendship, and the list goes on.<br><br>Although the film may have thrown \"one iron into the fire\" too many, I still found it to be quite engaging, and it kept my interest as to how this would all play out.\nThere's a strong cast here as well, led by Levi Miller, Toni Collette, Angourie Rice,\nAaron McGrath, and Dan Wylie.<br><br>Overall, this coming-of-age tale, directed by Rachel Perkins, with a screenplay by Shaun Grant and Craig Silvey, based on his novel, may not always work, but it contains some solid twists and surprises and it kept my interest throughout.","user":"larrys3","rank":[11,12]},{"title":"Moving and relevant","rating":8,"date":"17 March 2017","review":"When a bookish teenager helps solve a mystery death to avoid his aboriginal friend being blamed, he digs deep to find the courage to sort out the mess of his family and friends' lives.<br><br>Set in a rural 1960s town, a young Levi Miller takes a worthy turn at a Mark Twain style hero who, sustained by a childhood wonder about important things like Batman's superpowers, is caught up in a tragedy which uncovers far more about the dark nature of people than any child should know. Toni Collete as a depressed mother and Hugo Weaving as a the town's recluse give the story emotional depth, and director Rachel Perkin brings out the simmering malevolence in an everyday setting. <br><br>Based on a contemporary novel, the casual racism and intolerance is particularly relevant to our times. Worth seeing for- Levi Miller &amp; Hugo Weaving. 8/10","user":"Screenwriter10987654321","rank":[28,36]},{"title":"A good family movie (from a ever dwindling supply)","rating":9,"date":"30 July 2017","review":"These days you have a hard time to select a movie to watch as a family. With the moral fiber of the world worn thin and the moral compass of the industry spinning out of control, it is good to find a gem ever so often. And where better to find it than Australia. I took note of the other reviews being a little from Aussie to Aussie, so I just had to break borders and rate from across the sea, albeit it still in the Southern Hemisphere. (I am sure that a Christmas tree in summer must seem a bit odd to the Northern viewers, but we are very comfortable with that, thankyouverymuch. The movie is very well acted and has the two talented youngsters Angourie Rice and Levi Miller supported by none other than Toni Collette (big fan) and Hugo Weaving. And I mean supported. They do not take center stage in this coming-of-age drama. The story is well told and the elements of racial tension and bias is well crafted and well resolved. 1969, and even if Australia is a world away, the world intrudes. We all enjoyed the movie tremendously, and even though it deals with adult topics, it makes it accessible for all ages. If you want an easy watching movie with the family, this is a good pick. You will be surprised.","user":"eyefordetail","rank":[18,22]}]