[{"title":"One of the better psychopath movies","rating":7,"date":"1 December 2017","review":"This movie tells the tale of an overzealous straight A student (Lucas) and a teacher with a conviction to do the right thing. Lucas is pretty much the antithesis of an hero. He is driven by a desire for excellence but is ultimately flawed in character due to his unwillingness to accept criticism. This becomes quite apparent in the first act of the movie. As the movie progresses his English teacher grows suspicious because \"unlucky incidents\" start to happen after a little confrontation takes place. At first his teacher just tries to shrug it off but as the severity of the sabotage increases he grows uneasy about the situation. Wondering how far Lucas might go to get what he wants. As expected things escalate towards the end in a final showdown between the two protagonists.<br><br>I personally really liked the movie because it was focusing on a more realistic portrayal of psychopathic behavior. I'm also glad to see that at least 1 of the Sprouse twins is still acting.","user":"antoniokowatsch","rank":[34,38]},{"title":"Better than Expected","rating":8,"date":"26 November 2017","review":"This movies description was very vague, so I was hesitant to watch it as it seemed like it would be another cliché movie. To a certain extent, it was, it was predictable at some moments. Ultimately, the acting, especially by Dylan Sprouse, was fantastic. He played a believable deranged character, something very different from what he had done in the past and has now made a great return to acting. The movie was overall quite entertaining and highly interesting as a thriller. I encourage people to check it out.","user":"gabicooper-47100","rank":[41,47]},{"title":"Great what you can do with a low budget","rating":7,"date":"25 November 2017","review":"Just watched The Snowman and Hangman multi million pound thrillers and this beats both of them hands down.<br><br>Great acting especially from the two main relatively unknown actors, smart story filmed well and although its not massively original \"Apt Pupil\" being brought to mind it does what it does well and is well worth a watch if you are looking for a decent thriller.<br><br>This is the type of film that proves you don't need a massive budget to make a good film.","user":"omendata","rank":[48,56]}]