[{"title":"Tries Hard","rating":3,"date":"19 June 2018","review":"This type of movie has been done over and over since about the 70's. Animal House (1978) comes to mind. I tried very hard to like this and watched it to the bitter end, but failed. Watch for the bloopers during the credits, they were the funniest part of the movie.<br><br>Two stars for the acting, while the antics at times were infantile, the acting really was pretty good. There was nothing wrong with how the actors acted, the problem was what they did and said while doing it.<br><br>The third star is for the sporadic moments that I actually laughed, unfortunately they were not often enough for what could have been a pretty good movie.<br><br>Brendan Michael Coughlin's character really sucked the most and he probably should stick to Days of Our Lives.<br><br>Avoid this if you don't like infantile and toilet humour.","user":"nowego","rank":[11,18]},{"title":"Very good movie for certain ages","rating":9,"date":"21 June 2018","review":"Me being a 15 year old boy my opinion of this movie was great. I think this movie would appeal more to teenagers like me and not to older people who have watched movies very similar to this such as animal house. I don't know very much about acting but the acting was great and there were moments in the movie that were extremely funny and moments where the jokes were ok. Some parts of the movie had kind of cheesy parts, but they managed to work comedy in there. I watched this movie on a website and have watched it 3 times so far in the past 24 hours (which i do not think is normal at all).","user":"kalanid-92150","rank":[10,18]},{"title":"Give it a chance...","rating":6,"date":"9 February 2019","review":"Personally, I think a mere 3.8 rating is very mean. I found the movie to be hilarious throughout, with fantastic puns and gags. The acting was very good, with Richard Alan Reid (playing the lead 'Elliot') and Brendan Michael Coughlin (playing the dumb, frat-boy 'Joey') standing out.<br><br>Granted, the story was a bit contrived; Elliot graduates from university to find out that his mother has got engaged to an American lover. However, the movie comes across as lighthearted and undemanding to the viewer. Also, Frat Pack (to it's praise) also had very little in terms of pop-culture references. I feel that movies can often be too forced with topics, like social media and technology. However, to my surprise, there was very little in that sense.<br><br>The only area where the movie lacked would be the character development. All the characters were kind of thrown in front of you with their weird quirks, with anticipation that you already knew them. The reason movies, like American Pie, were so good was because they allowed the viewer to build an emotional connection with the characters whilst keeping the humour and lightheartedness. Frat Pack just felt a little bit too cold in this sense. I would have liked to get to know each character a little better and for the relationship dynamic to be more natural.<br><br>If you're into lighthearted, coming-of-age movies; Frat Pack is worth the watch","user":"jacklowriewilliamson","rank":[1,1]}]