[{"title":"Script Let This Movie Down","rating":4,"date":"11 August 2016","review":"Race to Redemption is quite a decent movie. You might even like it a lot if it did not had the weak script.<br><br>Let me write about the good things first. Although the actors and actresses did not depict a great acting skills but they gave their one hundred percent in the film. They tried their best to act natural which I admired the most about the movie. The movie tracks are good, they perfectly match to the scenes, the location was great and the camera work was also commendable.<br><br>Now thing that I did not like. The movie has a very weak script with some terrible dialogues. They deliver the same dialogue twice in the same scene, as if there is nothing to. Hello! you already said that, is there any lack of words in the English dictionary. And The script tried to set up every character with some other character by forcefully creating unnecessary characters, which was not needed at all. And there was no story build up either in the script, things were just happening one after another without creating any interest in the viewer's mind.<br><br>So to round up, this is definitely not a must watch movie. but if you have some spare time then you can give it a try.","user":"niaz_islam","rank":[5,7]},{"title":"Leaves much to be desired","rating":2,"date":"27 October 2016","review":"I wish I could give a better review of this movie but I just can't. I'm really not sure what caused the horribly painful to watch acting but I think it was the script and the director/producer. I've seen Luke Perry and Danielle Campbell act and they are better than they were in this movie. This could have been a really great and moving film and it's a shame that it wasn't. I like Danielle Campbell and Luke Perry which is why I watched the film in the first place. There should have been more real emotion. I've seem both actors give better performances. The horse riding was awful. The dialogue was fake it seemed trite. Very disappointed. Too bad it can't be remade with a better script and directors/producers. This could have been a really good movie, shame it wasn't","user":"rscbmr","rank":[2,4]},{"title":"Heartwarming","rating":7,"date":"23 January 2019","review":"So, after watching this film, I have to say that it was very good! By no means is it Oscar worthy, but, there was no profanity, no violence and thank goodness, no nudity! I enjoyed it!","user":"ldux","rank":[1,2]}]