[{"title":"Plot less soft-core tawdry attempt at Canadian Blue is the Warmest Colour","rating":3,"date":"4 April 2017","review":"Pretty obvious spoilers.<br><br>I was excited for a lesbian movie set in my beautiful city. They had so much to work with, and yet they did nothing with it. The plot was cliché and overused, and somehow, even then, minuscule. The acting was embarrassing. I wanted to like Erika Linder because she's beautiful and she has perfect eyes, but no one in this movie could act to save their lives. The dialogue was pitiful. I think I have watched D list horror flicks with better dialogue.<br><br>The movie was marketed as being sexy. That would have worked if it were sexy. I can understand directing the women to not moan like porn stars, but neither of them looked like they were enjoying it. It was absolutely uncomfortable to watch two women hump each other disinterestedly.<br><br>I thought that this was trying to be the Canadian Blue is the Warmest Colour, but instead it was a soft core porn flick set in Toronto. Although, to be honest, I've watched porn with a thicker plot than this movie had. Also, apparently the only way lesbians get off is with dildos and rubbing their vaginas against each other. TIL.<br><br>Main character's (MC) boyfriend goes away for the weekend (or a week? I don't even know). MC meets lesbian with a hot name, doesn't discourage any of her advances, hooks up with her a day later, they have sex the whole time. And then the most predictable thing happens - the boyfriend comes home early and catches them. Who saw that coming? Everyone. Just insulting to the viewers' intelligence. Boyfriend and MC try to have sex, can't, and then a black screen later and MC and hot lesbian are together again.<br><br>The best shot of the movie was literally the lighting of a cigarette 15 minutes in. It felt like Film School 101. There were no real inspired shots of the city, which was extremely disappointing.","user":"emolosesgirl","rank":[60,80]},{"title":"This movie grew on me","rating":8,"date":"4 August 2017","review":"I initially rated this movie 6.5 but have found in the two days since I can't stop thinking about it so have come back to rewrite my review and up my rating.<br><br>Some reviewers have trashed the acting but I think Erika does a fine job as the butch \"lady-killer\" and Natalie is fantastic in the role of the femme, Jasmine. The problem for me was that until they start having sex both the main characters are pretty unlikable, to the point I almost stopped watching. Dallas is a self-serving asshole, and Jasmine appears to be stuck-up and has no qualms about lying at work to get what she wants. However, once they start having sex they drop their respective facades and have a sweet little affair, with a fair amount of hot, explicit sex. Yes, the plot is thin but that's typical of lesbian fiction.<br><br>In my earlier review I kind of trashed the writing. I thought they fell short in explaining why Dallas was such an asshole. But again, this isn't based on great literature, and once I got past that annoyance I started to consider other things that weren't explicitly stated but still came through in various scenes. Like the fact that, while Jasmine and Rile have a decent relationship, it's still a lonely existence for Jasmine as he can't quite connect to her playful nature. And in scenes of Dallas when she's alone she's obviously unhappy. And it's truly heartbreaking to watch Jasmine try and return to her straight life. I think Natalie Krill's performance nails it.<br><br>So yes, I liked the movie. It's not a light and fluffy, feel good movie like \"Imagine Me &amp; You.\" Instead, its a simple story told fairly well.","user":"valinvancouver","rank":[33,43]},{"title":"Accurate Representation of Androgynous Lesbian's Lifestyle","rating":10,"date":"13 January 2019","review":"As an androgynous lesbian, it is safe to say this was an extremely accurate movie and I wish there were more movies like this. Best lesbian movie I've seen by far. From personal experience this is exactly how androgynous lesbians meet women. Straight women or Bi-curious women are usually attracted to androgynous folk. The timeline of the movie is over one weekend, that's usually how fast these flings start and end. Movie has a cheesy (unrealistic) ending because a woman never wins in real life - sad truth is that men always win over androgynous folk in real life. Overall, this was an accurate representation of my lifestyle, which was reassuring and exciting because I've never seen people like me on the big screen have a lead role and win the girl. I'd give it 11 stars because someone like me was finally represented in entertainment in a positive light. 😊 wish more people supported this movie!!","user":"pipschandra","rank":[26,33]}]