[{"title":"Beautiful cinematography, but one mess of a script","rating":6,"date":"25 January 2018","review":"Takashi Miike is know for his great directing, and \"Blade of the Immortal\" once again proves, what this man is capable of when it comes to large-set fight/battle-sequences. The cinematography is breathtaking at parts, i particularly liked the opening, shot in black and white - reminded me of the old works of Akira Kurosawa. If only the narrative part of this movie would be as well-crafted as these fight scenes. Honestly, there are so many flaws in the script, i gave up counting after the 80 minutes-mark of this movie. First: Our protagonist is a totally useless, unsympathetic, whiny little girl, who doesn't work at all in this kind of plot. I understood the idea behind her character (fish out of water etc.), but i couldn't connect with her on a emotional level. She was just not interesting enough (the actress was great by the way, so don't blame her). I mean, you have all these overpowered beings in the plot, but the only \"human\" character does not serve well enough as a leading figure? That's one hell of a problem. Second: There are way too many situations in the story, where any sort of set-up is missing. Sometimes things happen without any proper explanation. Characters change their mind without any reasoning behind it. Thirdly: The pacing of this movie is totally off. It felt like i was watching Ben Hur at times. Maybe the removal of some fight scenes, would have been a good solution for this problem. Last but not least, there is just so much unused potential. Yeah i know, this movie wants to be like a fun action-trashfest, but you really could have told a genuint emotionally touching-story with this concept. It lacks some real depth. Although there are some interesting scenes sprinkled throughout the story (some neat interactions between pro- and antagonist; the moral ambiguity of certain characters actions - even the character-conflict of Manji). Still, if you want to see a good student-mentor-story even with pretty similar characters, than go and watch \"Logan\". It may not have that well-crafted fight scenes, but there for more heart and a better screenplay. \"Blade of the Immortal\" has a breath-taking opening-sequence, some interesting story-bits and twists and a astounding cinematography, but it lacks real emotions, neither does the screenplay live up to the potential of the basic concept. The actors are good, the soundtrack is catchy and you can have fun with this movie over all, but don't expect one of the great works Miike has accomplished over the years.","user":"bw-22361","rank":[26,30]},{"title":"An entertainingly violent, action packed film from Miike.","rating":8,"date":"5 May 2017","review":"Viewed on opening night at Namba Parks Cinema in Osaka, Japan. <br><br>\"Blade of the Immortal\" takes place in Japan during the mid-Tokugawa Shogunate period and follows the deeds of Manji, a skilled samurai who has a decisive advantage: no conventional wound can kill him. In the past, his actions of vengeance (for the death of a family member) led to the deaths of 100 other samurai. Near death himself, he then becomes immortal at the hands of an 800-year-old nun named Yaobikuni. Decades later he befriends a young girl who desperately wants to avenge the death of her parents, who were slayed by a master swordsman who is attempting to take over all other dojos. Can Manji fight thru the villain's clan of assassins and secure justice for their deplorable actions? I was a bit surprised when confronted with the opening 10 minutes of this movie – which are legitimately outstanding. I'm not going to tell you exactly what happens, but even Miike's most vocal critics – and there are a lot of them – should admit that that sequence is fantastic. It's basically \"critic proof.\" And it also establishes a darker tone than one might expect from the trailer. This movie gets violent and harrowing very early on, and I liked that.<br><br>\"Blade of the Immortal\" is an action film first and foremost, so it really needs to succeed on that front in order to work overall. Most fortunately, I think that this is a very effective action extravaganza. There is a ton of fighting in this movie, which is an obvious positive, but the placement of the action is very nicely spaced. In my recent review of \"Call of Heroes\", I mentioned that Benny Chan is very good at spacing out his action and maximizing the pacing of his action films. Miike does the same thing here with \"Blade of the Immortal.\" There are a few huge battles, but also a lot of one-on-one duels (or scuffles with a small handful of characters) that are peppered throughout. \"Blade of the Immortal\" keeps moving and there always seems to be a fight right around the corner. I really liked that about this movie and consequently, its 140-minute runtime flies by much faster than you may think. The overall quality of action is good too.<br><br>In terms of performances, they are also generally good. Takuya Kimura carries the movie quite easily, Sota Fukushi handles the villain role well, and Erika Toda steals the show whenever she shows up. I liked the lead actress (Hana Sugisaki) too, but she does tend to scream her lines a bit too much. I think Miike should have dialed her down a bit.<br><br>I did not have subtitles while watching this in the Japanese movie theater, but the story and characters seemed rather basic and simplistic. Not a big problem in my eyes for a full throttled action movie like this, but a few of the side characters seemed to be wasted, like Chiaki Kuriyama's character (who did not do much at all, actually). The filmmakers probably wanted to insert more characters from the manga into the film, so a few of them feel like they were shoe-horned in. One thing I did like is how, at certain times, the villains are placed in the same bad predicaments as the protagonists which means that they occasionally have a common enemy.<br><br>This is an entertainingly violent, action packed film from Miike.","user":"ebossert","rank":[52,67]},{"title":"Bloody human nature","rating":8,"date":"29 November 2017","review":"Almost plays out like a Greek tragedy but with a whole lot of bloody gore. When the film reaches the third act there are no more actual villains in there and the number of killings in this film might be good enough for a record. Yet, beyond the action, it still manages to touch on a lot of subjects on human nature.","user":"Jithindurden","rank":[17,20]}]