[{"title":"IQ dropped 30 points watching this (spoilers)","rating":1,"date":"10 November 2019","review":"I'm baffled that this movie has a 6.8 rating at the time of this review. The acting is so incomprehensible bad and cringy.... not to mention that the actors are beyond bland and stupid. The movie would've made more sense if the main characters had been premised as autistic people or suffering from some type of neurodevelopmental disorder; otherwise, the irrationality displayed in this film will turn your brain into pudding-that is if you have any shred of common sense and average IQ.<br><br>Spoilers:<br><br>I had to stop halfway through the film. How can a character just be so dumb? The girl doesn't realize she has a super rash around the finger where she recently started wearing a new ring... until other people point it out:<br><br>A) she doesn't consider taking the ring off\nB) fails to communicate her concerns about the blatantly creepy behavior of the villagers or the incident in the bathroom\nC) the boyfriend unnecessarily withholds info about creepy behavior he's seen from the girl with no justification.<br><br>D) Girl claims she doesn't trust that place or villagers, yet happily drinks \"secret\" tea giving to her.<br><br>E) Crazy man with a cane keeps incoherently warning the girl and boyfriend, yet fails to just get it to the point and explain to her what's going on.<br><br>Whats the point of horror movies like this? Can't they make a mystery/horror movie where the characters are legitimately smart and have to surmount actual threats? Ugh... don't waste your time","user":"deinb","rank":[17,22]},{"title":"Don't understand the hype.","rating":4,"date":"4 November 2019","review":"Its an ok kind of a movie involving cults and stuff. A couple comes to a village which has a depressing cold setting and overtly friendly neighbourhood but the neighbours have ulterior motives something we have seen in movies like Rosemary's Baby. To top it all it was slow in the beginning and never caught much pace even till the end and ends without much drama or explanation which might leave the viewer unsatisfied.","user":"tariqzafar-12020","rank":[13,19]},{"title":"Creepy, atmospheric and surprisingly refreshing!","rating":9,"date":"18 October 2019","review":"Really enjoyed this. Thoughtful and original with some nice inspired performances. It looks amazing too, the fog scenes at night look great.<br><br>Don't expect a fast paced, gory horror with lots of jump scares. This is a classy, atmospheric film that makes you think and certainly stays with you.","user":"simon-alphastar","rank":[18,31]}]