[{"title":"If you feel like watching 15-20 minutes of actual content","rating":2,"date":"21 September 2015","review":"This \"special\" is by far the strangest (not in a good way) I have seen as far as \"Stand-Up Comedy\" goes. And I watch a lot of that. (It will also take you longer, to read this, than it took Jeff to deliver his comedy whilst I was watching him on stage.)<br><br>Disclaimer: I don't feel like I have spoiled anything for anyone wanting to see this / \"witness\" this for themselves. I will describe the format and content of this show. All the funny parts are still intact and anyone having seen anything Jeff has delivered before, you should know what to expect and realize I couldn't possibly have spoiled anything by sticking to that. However, saving someone from wasting time and money... I do hope I do!<br><br>Executive Summary: Jeff seems to have felt it is a good idea, to let us get his comedy in YouTube-sized portions, plastered together with nonsense we don't want to watch and actual ad's within his programming, and plugging of completely useless music-bits that are nowhere near being funny. He has also further advanced his \"problems\", from being doll-related to happening more than 4 times during a show, fixing them and restoring order (making up over half of his actual stand-up time on stage) every time. The simple fact people are paying to see him, Live or from the couch, is to get the \"full uninterrupted version\" of him. Otherwise we could just turn on AdBlock and watch him on You-Tube! This boggles my mind but I felt like giving a short version of this. . .<br><br>Longer version: The show has a running time of 41 minutes, of which the first section of stand-up is 5 minutes long.<br><br>\"Act 1\" is apparently what we are to consider this. After intermissions with useless sketches containing characters and actors customers of this product, have not signed up for or requested. We are at last, greeted by Jeff and he gives a very brief sketch.<br><br>\"Act 2\" thankfully is a few seconds longer than \"Act 1\", just over 5 minutes. But troubled with him pretending to make mistakes, or is it real because I have never seen him do THIS mistake before (so I guess it has to be real...) ?<br><br>Followed by an extremely awkward infomercial of Jeff Dunham's new income-source. He is seriously spending an awful long time, on demonstrating and promoting his $95 doll. Trying to cover over the fact, by using comedy that the whole thing IS very disturbing and by trying to reach out to his customers hearts by saying there are too few doing his profession.<br><br>What a load of crap to get showed down our eyeballing-throats. He ends the whole thing by being the only person I have ever seen, running across the stage on all 4, holding a doll that he is chasing.<br><br>More interruptions of comedy follows this plug. Now finally...<br><br>\"Act 3\" is given to us and contains some actual content we \"came to see\". But Jeff fumbles and we only get seconds of actual comedy, instead we are fed like so many times during this show, witnessing Jeff pretending to encounter troubles and correcting them. He cannot consider, people being so ignorant, that they would agree and say \"OK, I'll continue to pay for you to do this on a stage\"?<br><br>So following this trickery is nothing anyone expects, a country- singer I never want to hear about enters and takes over. He gets the most screen-time of any segment! Over 5 minutes! After this they have a segment that ACTUALLY contains dialog saying \"and we are in commercial, back in 3\"... except this was meant to be a \"funny\" intermission. But it has nothing to do with Jeff and why people show up to see his show. So we have now been waiting, for over 8 minutes, or 11 if you felt ripped off in \"Act 3\".<br><br>A very expensive looking car rolls in (second in this show), with the face of a known character. It is a cool set-piece but looks more like a giant sign: \"Thank You guys for loving and paying so much for my funny acts that I'm currently ripping you off on!\"<br><br>\"Act 4\" brings in the biggest star of the show, the one we have been waiting for! We are greeted with TWO minutes of actual comedy, yes 2. Before the star is interrupted by Jeff's brilliant idea to continue enraging the audience with having \"problems with the dolls\" like hundreds of times before. Completely ignoring that we have all seen this a hundred times. Fine if he wants to always bring with him the \"good old stuff\" but the entire SHOW is made up of his problems! (It doesn't happen once this time, but after 3 I stopped counting during this act.) This occupies the rest of the show, which is about 3 minutes more, yes THREE minutes left. Before Jeff waves his customers goodbye and runs off-stage to meet his new customers wanting to follow orders (probably \"Premium Editions\" would be signed during the show?) and buy his dolls.<br><br>My mouth was actually open when this was over, I couldn't believe I had just wasted such a large portion of an hour and gotten less comedy than the average news-show (and they are SHORTER in total length!).<br><br>And PS: I really like most of his prior work, this one however saddened me.","user":"u_urcle","rank":[28,39]},{"title":"Unhinged in Hollywood? More like control chaos for Achemed","rating":8,"date":"8 August 2018","review":"I nearly missed watching this cause if the ratings but it not really bad at and even far better just as long you get his jokes.\nAnd for me, due to the fact I nearly laugh my lungs out, it's really good. 4/5.","user":"louisnicka","rank":[3,3]},{"title":"Same old same old","rating":6,"date":"20 January 2016","review":"This is very American, but in a very lovable way, we all know the characters, more or less how the show will go, but this is not as entertaining as previous shows, maybe because it is a bit to obvious.<br><br>It is comedy, taking news and stories and putting them into jokes, in this case wrapping it all in a ventriloquist act, it works out okay, but it is very American, kind of like a talk show where the host tells a joke and the audience laughs.<br><br>It is okay and I would love to see him live, but it is missing something new, it is the same old same old, still entertaining and give some laughs, but something is off and just not as fresh as it used to be.","user":"osj2507","rank":[3,6]}]