[{"title":"So disappointing","rating":2,"date":"28 November 2017","review":"I was looking forward to watching this movie. The premise sounded interesting and I love a good Christmas TV movie. Alas the reality of this terrible story line just mad me mad and frustrated. Who writes this tripe???? It's 2017 (when I watched it) and released in 2016 NOT the turn of the century. I'm sorry but I do NOT recommend this movie at all. <br><br>I gave it 2 stars because I do like the actors in it and have seen them in MUCH better productions.","user":"kiwijws","rank":[15,18]},{"title":"This is not a feel good Christmas flick","rating":1,"date":"21 November 2016","review":"So the movie starts with a strong female lead who has been working hard for several years building the family business. Low and behold her sister rocks up to announce that she's getting married Christmas eve. All hell breaks loss because apparently there is some family contract which states which ever girl marries first her new husband gets the business...WHAT, l know crazy talk right, but on no that's the premise.<br><br>If you want to watch a Christmas flick with a selfish sister, parents who let their daughter work hard to get passed over, then this is the movie for you. I on the other hand, enjoy my Christmas movies to make me feel good at the end and although often predictable, happy at Christmas.<br><br>All this movie will do is make you angry and ask why a channel like UP would even think this story line was worthwhile. Sorry people but I'll be sticking to my Hallmark movies from now on at Christmas.","user":"ms-fit","rank":[24,31]},{"title":"A feel good movie. NOT","rating":5,"date":"13 February 2017","review":"This movie started out so well .. I had high hopes but it just didn't make sense by the end!! I'm giving this 5 stars because it had great acting, I loved the main characters .. I just feel like the script needs a bit of tweaking... Because this just didn't feel like the feel-good-movies I'm used to .. and just when I thought I discovered another TV network to look forward to its movies 🎥<br><br>I really liked the hero and heroine, they had great chemistry. Loved the sisters relationship, because it came off so real.<br><br>I liked the film, I just wish it was better. But maybe that's just me. Take a chance on this movie, you might like it.","user":"AngelCullen","rank":[9,11]}]