[{"title":"Very Enjoyable","rating":8,"date":"27 May 2017","review":"I have to admit going into this a little unprepared and not sure what to expect. I hadn't read any write ups and went in with very little knowledge of what the movie was about. <br><br>I nearly always like Shirley MacLaine movies, she rarely does a bad one and Amanda Seyfried usually does OK. This was no exception and Shirley MacLaine really shines in this one. The roles is not really new, we have seen her in this type of role before so it is one she is either picked for or picks for herself.<br><br>Amanda Seyfried does quite well, but the real performance to look out for is from AnnJewel Lee Dixon, she really does make for a fun movie and steals some of the scenes she is in from Shirley MacLaine. <br><br>Word of warning, if you don't like the use of foul language by young children you may not like this movie, be prepared for that.<br><br>Some would say this is a predictable movie, so be it, it probably is, but it is also very entertaining and worth the price of admission.<br><br>8/10 for me and I would see it again.","user":"nowego","rank":[34,43]},{"title":"This great mix of well-established talent with others just starting out makes for one enjoyable film.","rating":8,"date":"3 April 2017","review":"Actress Shirley MacLaine has had quite a career – and an interesting life. She was ahead of her time in being a very independent-minded career woman and developed a reputation for being difficult to work with. She had a decades-long marriage which ended in divorce, but produced one child, a daughter. In her later years, she has remained active in trying to shape her legacy, which is clearly seen in her 2017 comedy-drama \"The Last Word\" (R, 1:48). Advertising executive Harriet Lauler has had quite a career – and an interesting life. She was ahead of her time in being a very independent-minded career woman and developed a reputation for being difficult to work with. She had a decades-long marriage which ended in divorce, but produced one child, a daughter. In her later years, she has become active in trying to shape her legacy, which is what the 2017 comedy-drama \"The Last Word\" is all about. Now, art-imitating-life parallels aside, playing Harriet serves to remind us how busy MacLaine has remained, on screens big and small, even as her 70s drifted into her 80s – and what a singular talent she remains.<br><br>\"Control is very important to Harriet,\" one character observes. That's an understatement – and an incomplete one too. Not only has Harriet Lauler (Shirley MacLaine) always exerted control over as many parts of her life as possible, she was always been very disagreeable as she did so. Years ago, she angrily quit the ad agency that she helped to found because she didn't like how one of her clients conducted a focus group. She once told her gynecologist(!), \"When I want your opinion, I'll give it to you.\" Her parish priest even admits, \"I hated her. So much.\" These days, Harriet's retired. She lives alone in her big house and exerts her brand of rude control by chastising her gardener for trimming her hedges from top to bottom, instead of from bottom to top, as she has instructed him, \"many times\" he admits with a sigh. Then, when she reads someone's obituary in her local newspaper, she finds something else to control.<br><br>Harriet visits the paper's offices and asks the editor, Ronald Odom (Tom Everett Scott), to introduce her to the obituary writer, Anne Sherman (Amanda Seyfried). Sitting behind Ronald's desk, Harriet gives Anne the assignment to write her obituary now, so she can be sure she'll be satisfied with what will be published about her in the newspaper after she is gone. Ronald tells Anne that Harriet had been a great friend to the paper when she did ads for Ronald's father and implies that she might remember the paper in her will. \"Make her happy,\" is Ronald's simple instruction to Anne, who reluctantly gets to work. The problem is that there just isn't much to say about Harriet beyond her past career accomplishments – and Anne can't find a single person to say anything nice about her – even from the list of names that she received from Harriet herself. Naturally, Harriet is dissatisfied with Anne's first draft – and tells her so.<br><br>Harriet has read a number of obituaries and determined that there are four things that make a good obituary: a loving family, the respect of co-workers, touching the life of someone who needs a helping hand and a wild card, something unique in the life of the deceased that provides the proverbial icing on the cake. Harriet knows that Anne won't write anything about Harriet that is not truthful, so she gets Anne to help her \"shape a legacy\". Without giving away how all of this shakes out, I'll just say that this journey puts Harriet and Anne in touch with Harriet's ex-husband (Phillip Baker Hall), Harriet's estranged daughter (Anne Heche), a former co-worker (Joel Murray), an at-risk youth (AnnJewel Lee Dixon) and a charming disc jockey (Thomas Sadoski). And as the two women work together on Harriet's unusual project, she does some unwelcome, but well-intentioned meddling in Anne's personal life as well.<br><br>\"The Last Word\" is a relatively original and very well-done genre film. Sure, it's formulaic, but movies use formulas for a reason. The real question is whether the film tells its story effectively and this one definitely does. The script from Stuart Ross Fink (writing his first feature) creates a fresh take on the trope of examining a life not-so-well-lived and gives us interesting characters. The excellent actors bring out the nuances in those characters and director Mark Pellington (\"Arlington Road\", \"The Mothman Prophecies\") gives the film a great balance of comedy, drama, life lessons and just plain fun. The film's ending may be predictable, but getting there is a very rewarding experience. Movie Fans (especially fans of Ms. MacLaine) will likely be thankful that, with other projects in the works, this film won't be the last word in Shirley MacLaine's stellar career. It also makes us look forward to much more to come from the talented Seyfried, the spunky newcomer Dixon and rookie writer Fink, with this impressive debut. This great mix of well-established talent with others just starting out makes for one enjoyable film. \"A-\"","user":"dave-mcclain","rank":[31,44]},{"title":"Yes!","rating":10,"date":"5 July 2018","review":"SUCH a wonderful movie, it's pretty inspiring and you're definitely going to cry (some tears will be happy). Couldn't picture 3 more perfect people to represent the leading ladies. \nIt's hard to explain to other people why they should watch a movie and feel the things that you feel while watching it. But I kind of think that's a lesson from this movie. Feel however you want, do what you want, but \"make it matter\".","user":"hannahj-81120","rank":[7,8]}]