[{"title":"Shut up with those fake reviews.","rating":6,"date":"13 April 2018","review":"You just can't rate this film with 1/10 or with 10/10.\nThis film is not trying to be mystery/thriller original.\nEven the film poster suggest what can you expect from this.\nMain girl cast was excellent, she did a great job, you won't believe she was 26 y.o. at film's premiere.\nActing was very good and directing was well. Story was okay, but not so shocking. Camera angles were good, but I didn't liked the editing much.\nNot very violent film in my disappointment.<br><br>I will not watch this again, but there were entertaining 92 minutes today.","user":"louis-170","rank":[134,169]},{"title":"For this genre it's not a bad movie at all.","rating":7,"date":"21 April 2018","review":"Haha I just read a review where it said that this movie is worse than Twilight. Really? Did you really watched Twilight? That's one of the worse movies of this genre, only good for kids that didn't reach their puberty yet. Wildling is actually not a bad movie at all, considering that this genre has been milked over and over again. The performance of Liv Tyler was spot on, a young girl estranged from the real world, discovering things she had no clue about, to ultimately find out she's not like the others. To me it could have used a bit more horror but even without it, it still is an entertaining movie if you like those kind of stories. It's not the best movie in this genre but it certainly is high above the average stuff we got to see in the past.","user":"deloudelouvain","rank":[72,90]},{"title":"Predictable, But Really Good!","rating":8,"date":"14 April 2018","review":"Honestly I loved it myself, but I can definitely see where others will be able to pick some things apart with this film. <br><br>The movie is predictable, you'll figure it out after about ten minutes. Regardless of that fact, it still pulls you in from the very first moment. You will want to see it through to the end, I promise!<br><br>Bel Powley really shines in this movie. Her acting is superb, and she portrays the character extremely well. Matter of fact she pretty much carries this film by herself. I've never seen any other movie she has been in, but after this, I can guarantee she is someone you will want to keep an eye on. The supporting cast did a really good job also. <br><br>Do you want to be entertained, or do you just want to complain? Leave it all at the door, just watch it and be entertained. It's not meant to be the best film ever, and win hundreds of awards. <br><br>I wouldn't so much call it horror, more of a thriller. I really liked the idea of the wildling creatures. I wish they had made the movie just a tad bit longer and fully played out some of the ideas that died towards the end. <br><br>Overall the movie was good, nothing award winning, but definitely a movie to keep in the collection. Watch it, enjoy, don't overthink this.","user":"tryniti987","rank":[72,92]}]