[{"title":"A collection of stereotype characters in a warmed over, seen-that-before storyline","rating":2,"date":"15 January 2018","review":"First off, any review that includes the director's name in the first line or paragraph of the review was clearly written by the movie's publicity department (see all previous reviews before this one).<br><br>The movie is about a flamboyantly-dressed high school teen, the bullying he attracts (big surprise there), the kids who befriend him and the witless father figure and absent mother. ...and this movie is dreadful. I was looking forward to a \"be your own self\" coming of age movie and the trailer looked interesting but this one makes no sense and is as unrealistic as any story could be. None of the relationships are believable, you can't figure out why the school jock would befriend this over-the-top rich kid, and everyone else is a stock stereotype. Even Bette Midler's performance, whose casting also brought me to the movie, is ridiculously over acted. I'm not sure what they intended the film's title to refer to because to call the main character a Freak Show would be bullying in itself and to call the whole thing would be, well...more accurate.","user":"pebsdad","rank":[53,86]},{"title":"Let your freak flag fly","rating":8,"date":"23 January 2018","review":"At the start of the movie Billy Bloom (Alex Lawther) does come across as being a little too fabulous in his behavior and appearance. I can see why that would be off-putting to many people. And possibly that was the point. We judge others based on first impressions which are almost always superficial because we don't have anything more to consider. <br><br>Billy's parents are separated and each show only a shallow, mostly hands-off interest in their son. Florence, the housekeeper, is passively sympathetic and protective, but unable to be meaningfully supportive. Billy is essentially alone and coping with his confused sense of self by being as provocatively freakish as he can be.<br><br>When Billy starts at a new school, he deliberately alienates himself from the other students by letting his \"freak flag fly\" in the most flamboyant way imaginable. He is understandably the target of bullying both trivial and physical.<br><br>Then, for reasons not easily understood, he attracts the friendship of one of the school's most popular, decidedly straight, male students, Flip Kelly ( Ian Nelson). Flip becomes the catalyst that helps Billy tone down his provocative, defiant and flamboyant behavior because he is possibly the first person in Billy's life who appears to care for the person beneath all the make-up and glitter.<br><br>Yes, the movie is filled with a supporting cast of stereotypical characters, but stereotypes exist for a reason and the exceptional characters are significant because they stand apart. While Billy is purportedly the stellar example of an exceptional person, the most meaningful, influential and exceptional character was Flip Kelly.<br><br>Great performance by Alex Lather, but Ian Nelson's acting was \"exceptionally\" good. Bette Midler lent her name to the cast listing but her appearance in the movie was largely insignificant.","user":"Suradit","rank":[20,47]},{"title":"Bullying","rating":6,"date":"22 February 2017","review":"Trudie Styler's first feature film is about staying loyal to yourself and what you stand for despite being bullied and physically assaulted. That this theme touched a nerve during the Berlinale, where it was shown in the Generation14+ youth section, was clear with a raving audience afterwards and long lines waiting before the cinema.<br><br>Bullying is still not taken serious enough in our society: nearly all people have experienced it at some time in their lives, either at work, school, leisure, at home or in the public space. Leading often to violence by the bullied person, or depression and in the worst cases suicide, the latter being the leading cause of death among the age group of 15-25. So this movie will be a good education tool for schools to discuss the theme.<br><br>The movie is fluently directed, well edited by Sophia Copolla's frequent editor Sarah Flack, has wonderful costumes and the soundtrack plus score is fitting. Although mostly aimed at a youth audience, Bette Midler and John McEnroe have small roles so the parents aren't left out. The young British actor Alex Lawther (the young Alan Turing in The Imitation Game) played the lead character Billy Bloom and has some future ahead I guess.<br><br>There is an interesting parallel with Mean Girls, as the part where Billy analyses his voters and classmates has the same kind of sociological and psychological analysis that made that movie so interesting.<br><br>During the Q&amp;A afterwards Trudie talked about how certain bullies receive great power, sometimes even leading to the White House. And bullying is indeed often associated with the so-called dark triad (narcissism, Machiavellianism and psychopathy).","user":"diand_","rank":[21,54]}]