[{"title":"Scraps of better action films","rating":3,"date":"2 May 2017","review":"This film obviously has a limited budget, but it's biggest handicap is limited imagination and innovation.<br><br>These actors are given nothing to work with but scraps from other action films. The quiet stretches are the strongest parts of the film, and they're not strong.<br><br>The real weakness is when action scenes are shot and it's obvious only one take was in the budget.<br><br>The scene between Rhys-Meyers and Gigandet at the conference table sounds like bad adult film dialogue. I'm guessing this entire film was shot with one take per scene.","user":"vicstevinson","rank":[32,37]},{"title":"A hodgepodge of derivative plot elements","rating":2,"date":"10 May 2017","review":"The Shadow Effect suffers from a very weak script. Ideas seem plundered wholesale from other movies where they were executed much more effectively, including The 6th Day, The Manchurian Candidate, A Clockwork Orange, Edge of Tomorrow, Total Recall, The Bride and Universal Soldier. The derivative nature of key plot elements could be forgiven, if they were presented with some sort of original twist or insight which is sadly lacking here. The production was clearly limited by a modest budget, estimated at $4MM; however, some very good films have been done with comparably limited budgets, such as Lone Star and Dinner Rush. The difference is creativity. Plot elements that are not shamelessly misappropriated seem contrived. Some elements are simply missing, such as the lack of response by the FBI, DHS and BAFT, motivation, character arcs and theme. <br><br>The producers assembled a capable cast and secured a wonderfully rustic cabin in the woods as a location for several key scenes. However, one character is heavily tattooed, which makes no sense relative to a key element in the plot, and it's difficult to imagine how the owner-operators of a rural café with only one employee and not many customers can afford such a home. By contrast, a secret laboratory that would seem to require antiseptic conditions is located in a dingy industrial setting. <br><br>However, a DTV potboiler doesn't need to be cerebral, provided it delivers the genre basics: fight scenes, chases, gunplay, explosions and sex. The gunplay is a bit hit-or-miss with a few good scenes and shots, but a lot of weapons brandished without being fired and not many impacts. CGI explosions are pretty decent. A car chase and crash is done well for a film of this caliber, but a character steals what seems to be a souped-up vehicle but doesn't drive it. The fight choreography is clumsy. The sex and nudity are self-conscious, although integral to the plot. <br><br>Whereas similar efforts hobble along with very little plot and a lot of eye candy, TSE offers a lot of plot, but very little eye candy. However, the plot is largely incoherent and derivative and not sufficiently engaging to bridge the gaps between the visuals.","user":"ginocox-206-336968","rank":[18,22]},{"title":"Bad weekend","rating":2,"date":"14 May 2017","review":"I was shut in all Saturday due to illness and thought I would check out a couple of movies the first was Black Site: Delta, which is truly the worst film that I have sat all the way through in quite some time. As luck would have it the second movie also 'features Cam Giggedy-Giggedy I thought the first few minutes were quite entertaining and was looking forward to a good plot to explain the backstory for this orgy of violence. That never happened and the movie rapidly descends into stupidity. The sniper scene where hordes well trained-mercenaries run out of a building straight into his crosshairs was beyond ridiculous. The closing scenes which endeavour to explain what it's all about are laughable. However it was marginally better than Delta and scores a solid 2!","user":"joe-825","rank":[12,16]}]