[{"title":"Enjoyed!","rating":9,"date":"29 March 2016","review":"Another movie in continuity with the other recent ones playing in the same universe! Keep an open mind and you will feel the time watching it is well spent. <br><br>Let's start with technicalities! The animation quality and design of the movie is good to very good if you keep in mind that it is a direct-to-video production - there have certainly been much worse ones around. The visual style is a continuation of the other movies that were released in the last year or two, so if you've gotten used to that, you'll feel right at home. Frederik Wiedmann did a nice job with the soundtrack, and his choice of instruments stands out immediately once the movie gets to the first mystic scenes - I think it is a good match. <br><br>The pacing is good. There is not really any part that feels too slow or drawn out too much, and enough action takes place throughout the movie to keep up the entertainment. A few scenes could benefit from a deeper exploration, but then again that would break the available time-budget. The story is entertaining, but a bit predictable. Not as predictable as the stories of some of the other DC movies, but there is still room for more complexity. It is targeted at a broader audience, most likely. The movie is somewhat family friendly, teens should feel right at home.<br><br>I'm not really a fan of Damian in a leading role, but in a team the character plays out much better. Sort of like how Batman integrates nicely with the Justice League - both characters can add a bit of spice to the mix once they're able to clearly contrast with other characters. In my opinion this is the first movie in this line that manages to do this, so that is good to see. More of that please. Damian needs to be put on a leash for good! I could not relate a whole lot to the previous versions of the Teen Titans, so I am happy to see a version of them here that feels a bit more mature. Less goofy is good!<br><br>There are some parallels between a few appearances in here and in Young Justice - some designs are related without a doubt, some characters share close or relatively close resemblances, but they are different personalities (and have different voice-actors). Wasn't sure how to take this at first, but they're likable. Would take another movie to get to know some of them a bit better, so here's hope we get that chance eventually.<br><br>Overall it is an enjoyable movie. Anyone who liked the recent DC movies should give this one a watch.","user":"redn_path01","rank":[37,61]},{"title":"Justice League vs. Teen Titans","rating":6,"date":"4 April 2016","review":"I haven't read a Teen Titans comic in more than 20 years, so therefore, I didn't know its modern version under The New 52 continuity. This allowed me to start watching Justice League vs. Teen Titans without particular expectations or particular affection for the characters; unfortunately, I have to say it didn't leave me very satisfied. On the one hand, it properly introduces us to the particular abilities and dynamics of the characters; but on the other hand, I didn't find the story very interesting due to its weak mythology and excessive use of weak mysticism as a replacement of logic and narrative consistency. I think this needs a personal explanation: I generally can't swallow the \"cosmic\" elements in the superheroes comics, and even less, the stories with magic and demons (with the exceptions of Doctor Strange in Marvel and the Vertigo Universe in DC). I almost always find them confusing and with an excessive tendency to \"deus ex-machina\", in which things aren't solved with ingenuity, strength or strategy, but arbitrary spells and forced invocations... something which exactly describes the second half of Justice League vs. Teen Titans. Too much hocus-pocus and very little creative effort. On the positive sides, the voice actors make a solid work in their roles, highlighting Taissa Farmiga, Brandon Soo Hoo and Jake T. Austin; on the other side of the coin, the quality of the animation is quite mediocre. In conclusion, I think Justice League vs. Teen Titans is the DC animated film I have liked the least, but I have to admit it didn't bore me, so I can give it a slight recommendation to DC followers who know where they are getting into. For the rest of the audience, it will be an obtuse and frustrating experience because the screenplay doesn't offer detailed explanations or concrete \"origins\" (well, maybe one). But, well... not all the films belonging to the DC Animated Universe can be as interesting and satisfactory as Justice League: The New Frontier or Batman: Year One.","user":"Argemaluco","rank":[15,22]},{"title":"The New 52 Movies Are Getting Worse.","rating":3,"date":"30 March 2016","review":"This movie is below average and as a dedicated Dc fan, i'm insulted. I'm honestly worried that the one thing that Dc has over Marvel, which is their animated movies, is getting more and more uninteresting as it goes. There are little good things in this movie that makes it worth watching, if you can ignore all the flaws that it has. I just feel like this movie had potential but ultimately failed due its many mistakes. <br><br>The story tries its best to mix the Justice League and Teen Titans together but it just ends up failing in the end. The Teen Titans are there but they're pushed to the side with Raven and Damien being heavily focused on. Trigon is suppose to be the main villain in the story but they don't really make him seem that unique since all he does is attack the city (which every villain has done before in the Justice League movies) and kills an entire race of people, with that being one of the only truly bad thing that he's done. The Justice League feels like they're crammed in there and their appearances seem somewhat forced. It seems that DC doesn't have enough courage in a Teen Titans solo movie, so they need to put in the Justice League in order to feel safe. That wouldn't have been a problem if they had rebooted the Teen Titans franchise properly instead of making the awful Teen Titans Go.<br><br>Just like Teen Titans Go, there's also a lot of scenes in the movie that doesn't make any sense or are just plain dumb. There's a scene where Beast Boy uncontrollably transforms into new forms of animals because...he's in hell? It was so stupid and so unnecessary and just seemed like it was there to make beast boy look cool. Also, why didn't Raven take the Justice League into hell? They could've gotten everything done way more faster than the Titans and fix the problem before Trigon could even reach the city. Speaking of Trigon attacking the city, there was only Superman, Wonderwoman, and the Flash there to help. It makes you think \"hmmm hey, wheres Green Lantern, Shazam, and Aquaman?\". You would think that they would come out and help defend the city but no, they don't make an appearance whatsoever. They don't even give a reasonable explanation why they aren't there, they're just like \"ha slackers\" and that's it. I don't care if it's because of budget cuts, if they aren't there to protect the city then don't write in Trigon attacking the city!<br><br>Now that i got that out of my system, onto the characters themselves. I don't like that Damien is the \"go to\" main protagonist when the movie isn't focusing on the League. This version is very close to the comics so he has to be brat but i just can't see myself rooting for someone like that. He is making more of a change though so i do like that. Raven is used more like a plot device rather than a actual character and she's extremely weak in the movie but they do a good job setting up her back story though so i'll give them that. Starfire is just there so dudes can stare at her body, and Beast Boy and Blue Beetle are just there for fan service, offering nothing but the \"Power of Friendship\" to the story. I also find it extremely insulting that DC has the nerve to feature Nightwing as part of the team when he wasn't even in the movie for more than 1 minute!<br><br>The animation in the movie is the only good thing about it but I saw a few scenes that shows the animators taking the easy way out of making the scenes rather than putting in time and making it feel more organic and dynamic. The voice acting is good here and there but it's overall pretty lacking. I do wish that they could have gotten the original cast to voice their respective characters but i can respect that if was due to budget cuts or just them wanting to distance themselves from that universe. <br><br>The title is also very misleading. I was expecting an epic battle where the possessed Justice League fight the underdog Teen Titans in a last ditch effort to save the world. That would've been cool but you know what we get? We get Wonderwoman, Cyborg, and Flash beating the tar out of the Titans for like 3 minutes. It was so anti- climatic that i was dying with laughter because that was suppose be the one moment that everyone was waiting for and DC just wasted it. Something that they should have done was, take the Justice League out of this movie, make this simply a Teen Titans movie, and make the epic final battle be between the Titans and Trigon. <br><br>I was just looking forward for this movie and after seeing it, i was a bit disappointed. This is an example of DC just making animated movies for a quick cash grab instead of adding quality and depth to their stories. Dc, please get better writers to make your animated movies and give the crew more time to work on things, i'd rather wait for a movie with a good story rather than immediately getting a movie that ends up very disappointing, i'm looking at you Throne of Atlantis. The movie has great animation but it's overshadowed with terrible voice acting, forced characters, cliché lines and acting, and a messy story that could've been great . If you are a casual comic fan who likes animated movies then this is the movie for you. If you're a die-hard DC comics fan who likes a good story then i can't recommend this for you. Overall, very disappointing and really hope that they do better the next time.","user":"impulzived","rank":[40,68]}]