[{"title":"Cool action film","rating":9,"date":"25 February 2017","review":"This is a fun film with great action and characters. Barbie films have a habit of including characters that would be lame in other children's films but turn out to be cool and entertaining. Imagine Barbie as a super-Jedi knight, wearing a stunning outfit as usual.<br><br>Concerning another review, consider something from the film 'They Might Be Giants.' The main character enjoyed watching old Western films in the cinema, where there is a clear simple black and white distinction between good and evil, where justice was served and the heroes were not infected with the same evil they are supposed to be opposing. And as the modern world gets more corrupted they stop showing these kind of films as there is no demand for them any more. That is why I love the ALMOST perfect character of Barbie, and the simplicity of the stories - which of course are just a foundation for people to build their own stories upon, as these films are meant to sell toys for the viewers to continue the story in their own way using their imagination. I don't want these modern flawed heroes, I want the perfect Christ-like woman who always does what is right and inspires others to do the same. \"Nobody is perfect\" is an excuse people use for them to do evil!","user":"aloonwolf","rank":[2,3]},{"title":"Barbie turns secret agent","rating":7,"date":"9 August 2017","review":"It is very easy to meet the 'Barbie' films with a lot of dislike and scorn and they are all very lowly rated here (despite some favourable reviews). It is understandable to take issue with the dialogue (a fair few are ropy in this regard), the predictability of the stories, the odd annoying character, the animation in a few (not all are well animated) and whether there is enough for adults to keep interest.<br><br>Despite not being the main target audience, to me they are mostly better than given credit for, easy to take them for what they are and don't deserve to be dismissed as baby-ish and for little girls only (a very narrow minded generalisation). Are they animation masterpieces? No. Are they among the best films ever made? Again no. Are they worth watching if taken for what they are? Absolutely for most of them. Most of them look good if not having the polish of studios specialising in computer animation (Pixar for one), often great music, good lessons and messages, a good deal of charm, have their heart in the right place and have entertaining characters well voiced (some had actors of considerable calibre like Tim Curry, Anjelica Huston, Martin Short and Kelsey Grammar, all of them terrific in their respective outings Curry especially) and a likable title character that particularly young girls can relate to.<br><br>There are better 'Barbie' films ('Nutcracker', 'Diamond Castle', 'Island Princess', 'Pink Shoes'), but 'Barbie: Spy Squad' to me is one of the better later 'Barbie' films and much better than the likes of 'A Fairy Secret', 'A Fashion Fairytale' and 'Princess and the Popstar'. Like what was said with 'Barbie and her Sisters in the Great Puppy Adventure', given a chance without prejudice, some are very likely to be surprised that due to the sugar, glitter and princess-y nature of a lot of the films in the series being toned down and instead going the spy/secret agent route (a fairly mature subject for a 'Barbie' film) that this film attracts a wider audience than most 'Barbie' films.<br><br>Not a great film strictly speaking. The dialogue is simplistic and at times forced. The story is yet another that sees the viewer a step or two ahead of the film in how things are headed, and there could have been a little more imagination with the spy concept. The characters are still easy to like but character depth beyond neatly black and white is not a strong suit here.<br><br>However, the animation is quite nice with the lack of the original/traditional look that in general appeals much more than the modern one not being a bother whatsoever. There are some beautiful bright colours (never excessive here), handsome and imaginative backgrounds and the character designs and movements have natural freedom rather than being stiff. It's not exactly imaginative and it's not as polished as Pixar, but when you have computer animation that makes you physically ill like the entire output of Video Brinquedo and Spark Plug Entertainment and the sequels to 'The Swan Princess' (the CGI ones) and 'Alpha and Omega' it's very clear which is better than them and this.<br><br>Music is upbeat and fitting, enough to put children and adults alike in a good mood. Nothing generic or too loud or intrusive here.<br><br>Regarding the story, it is predictable but it is full of energy, cuteness and charm with its heart in the right place the entire time (nothing at all mean spirited). It flies by and the action is very much eventful and rarely repetitive, plus it doesn't feel anywhere near as much of a Hodge Podge of tired ideas like a few of the recent 'Barbie' films have been. While not exactly imaginative, the spy concept and the gadgets are fun and cool.<br><br>Characters, even with the lack of depth, are engaging and carry the film well. Barbie is likable and resourceful as ever, serving as a good role model for young girls especially. The chemistry between the characters is great too, as is the positive messaging that was delivered with the right amount of making-its-point and subtlety.<br><br>Voice acting is pretty good and done with a lot of spirit. One may miss Kelly Sheridan, but the new voice actress is a worthy replacement.<br><br>In summation, good fun if unexceptional. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[1,1]},{"title":"Good if you have nothing better to do","rating":3,"date":"5 February 2016","review":"Edit: I found this to be Boring and a very extremely totally predictable storyline. As i watched the screen i realised this is another stereotypical Barbie role, same old goody-two-shoes like in all the rest of her outdated and strange movies. <br><br>Why are her movies strange and weird? Here's a list: <br><br>1. It's always bothered me and i wonder why does it have to be so black and white with this girl, every-single-time, without exception? Why is she so determined to throw herself into danger. People like the modern reluctant hero, the flawed hero. Not this do-gooder, self obsessed, from the 60's, who rushes forward into danger even though she may die in the process. And within 10 minutes of watching a Barbie movie i can easily figure the entire story out. Why is the ending so obvious.<br><br>2. People find do-gooders annoying, or suspect do-gooders of being motivated by some other undesirable reason – like \"everyone look up to me, look at my squeaky clean image, now go and buy all of my merchandise.\" <br><br>3. Every movie is just a rehashed version of the previous one, taking on all of the world's problems, same old I'm so nice, I'm so kind ambitious yet irritating woman, taking center stage. <br><br>4. But just how inspired should we be by fictional women who alienate others. Character flaws in movies are admirable, because as human beings we are flawed and audiences love learning about it, but not Barbie.<br><br>5. I don't understand why they don't modern up, move with the times, look at what other people are doing, like Frozen, Shrek, How To Train Your Dragon, and look at all the success they are having. <br><br>6. I noticed in the papers Barbie sales are plummeting, what is Mattel doing wrong, according to them: nothing, we are perfect! It's not that i myself or the people around me are tired of Barbie being a princesses it's the stories are garbage. Using friendship/ discovering her true self/ Blah-Blah-Blah Whatever, Barbie defeats all before her and wins. <br><br>7. With this movie Barbie Spy Squad there was no inner turmoil or conflict. I could not find a single reason why I should like any of the characters, and I didn't. Flat, one-dimensional, don't people have hobbies,strengths, weaknesses, likes, dislikes, a personality.<br><br>8. Okay, kids like pets. I get it. But every single movie. Really? Isn't it time to move on? So tired of seeing some animal crawl on stage to be greeted with gasps of delight and \" You're so adorable, You're so cute, You're so cool.\"<br><br>9. I could not find anything new or innovative here, with the gadgets, Headquarters, laborotories, British boss, etc,it borrows heavily from old stuff like James Bond Spy Kids Totally Spies etc <br><br>10. I didn't know the girls had superpowers, but all the way through they perform better than any world class gymnast could even dream <br><br>11. And finally we have Patricia who decides to become a team player at the last minute and give up her life of crime – Unbelievable.<br><br>12. Barbie needs to step up and change, also hire a decent writer who can craft a story. <br><br>13. This doesn't feel like a story to me, very artificial,fake, wrong. It's like they took Shoes, Dresses, Make Up, (like they do every single time) and everything else they thought girls could possibly like and built a story around it. It's too much relying on pandering and very little talent. Too clichéd also, trite, all this Cool! Wow! Totally! Excellent! No one really talks like that. <br><br>14. All Barbie movies are the same, just a different career or backdrop, that's why no one is interested in them, why would they when the other studios are producing way better stuff. Our kids would much rather buy a PlayStation game than any Barbie merchandise. <br><br>15. In the last movie Barbie went on a hunt to find treasure &gt; treasure found&gt; story ends. <br><br>17. This movie Barbie wants to catch a diamond thief &gt; thief gets caught&gt;story ends. So bland and predictable.","user":"ninjathesecond","rank":[4,18]}]