[{"title":"Good movie","rating":8,"date":"4 November 2018","review":"Great acting. Great effects. Right amount of action and Gore.","user":"theFIRSTfuckinGAGE","rank":[5,6]},{"title":"Bad","rating":1,"date":"26 August 2016","review":"If you're prior military DO NOT WATCH THIS MOVIE! If they used any military advisors in this film I would be surprised. From the number of snipers, they use teams from all branches of the military, their appearance, haircuts, facial hair (most men should have beards not neat stubble ) &amp; techniques (barely any cover, not sure of targets, too much movement, too much talking via radio) to weapons used UAV's, missiles, &amp; firearms. They fired a missile at enemy troops. Considering the cost of around $70,000 this would be overkill not to mention a Geneva Convention violation. So much wrong I couldn't get through the entire thing. If you can get past the Top Gun scenes and the inflatable boats that don't sink even though the crew in them have been shot numerous times then this movie may be quite entertaining for you.","user":"edmo66","rank":[11,17]},{"title":"A Class Act all the way through","rating":9,"date":"20 August 2016","review":"Sniper Brandon Beckett (Collins) is assigned to protect an oil pipeline, but a Ghost Sniper shoots and kills some of his team. Who is it? Beckett feels someone on his side is giving the enemy sniper coordinates, and, of course, this doesn't go over big with his superiors. Oh, oh.<br><br>This is probably one of the best sniper movies to come along in a long time. The acting, cinematography, photography and the music were all sensational and quite engaging. It was like watching a Bond, James Bond movie without it being so. In other words, this is a class act all the way through. Kudos. <br><br>Nice to see Dennis Haysbert as the Colonel or Arch Angel as we do miss the popular TV show The Unit he starred in. <br><br>A breath of fresh air and some can consider this Comic Relief with Ravil Aisyanov as Andrei when Beckett is assigned to his team for a short while. Andrei conjures up memories of Bruce Willis' character John McClane in Die Hard when he mimics McClane to Beckett's amusement. Great job by Ravil Aisyanov. (9/10)<br><br>Violence: Yes. Sex: No. Nudity: No. Language: Yes.","user":"brutzel","rank":[11,21]}]