[{"title":"Stylish ...","rating":6,"date":"10 May 2018","review":"Malison McCourt is a hypersensitive young woman who, it is fair to say, has a lot on her plate. Living alone in a run-down apartment with her cat, the job she needs involves working for a euthanasia company. Her deeply superstitious landlord disapproves of this and makes her homeless. For all the unpleasant things that happen in this film, I don't mind admitting the moment I 'teared up' is when she abandoned her cat in the wilderness.<br><br>Malison is teamed up with Olivia Bletcha: sexy, confident and every bit as lonely as Malison. Together they travel to a remote castle for the latest 'closure' (the company word for euthanasia). This interesting premise is diluted by the arrival of Edgar (Tim Burd) who is the heavily clichéd creepy host, complete with emaciated gait and growling whisper. Naturally, there is a somewhat eccentric ritual to accompany this latest passing.<br><br>Sadly, moments of interest become more and more isolated as the ominous ruminations of a typical haunted house are further rolled out, including sinister whisperings from a 'ghostly' little girl which are delivered with all the disinterest you would expect from a bored 8 year old drama student. Malison becomes possessed by the evil - we know this because she suddenly starts using profanities. The demonic host looks not unlike a white-haired Kiwi Kingston from 1962's 'Evil of Frankenstein'. Events continue to spiral, becoming very visually impressive, but sadly the drama becomes increasingly disjointed and less and less easy to relate to. It is a shame things become so patchy because so much is well done here - rich direction from Jesse Thomas Cook, excellent locations, good production values and mostly very competent performances.","user":"parry_na","rank":[8,8]},{"title":"What a bore. What was it about anyway?","rating":3,"date":"9 March 2016","review":"Alright, so this movie started out kind of good. Had a creepy moment in the beginning. Unfortunately this early moment was the best (and scariest) thing about the whole movie.<br><br>A shame, because this movie had potential. Sort of. But it's taken in the wrong direction, and just wasted. To be honest, for it to be better the whole plot should have developed in another direction. Meaning, you know, different plot.<br><br>It has decent acting, looks decent, but it's just too boring. Boring, and just doesn't add up. Being boring is the worst thing a movie can be, because movies exist solely to entertain. <br><br>So, to sum up, slow, boring, and almost nothing happens in this \"horror\" movie. Better luck next time.","user":"Finfrosk86","rank":[24,34]},{"title":"Confusing","rating":4,"date":"7 November 2018","review":"This film starts off fairly straightforward. Euthanasia has been legalized and two young, attractive women, who carry out this work, have been assigned a job at a large creepy mansion. It reveals that this place and it's owners are involved in some sort of dark Himalayan (I think) cult and it all gets very weird and hard to follow. Visually it's OK so rather try and understand the plot I just went along that. Strange film, I wouldn't waste my time trying to understand it with a second viewing.","user":"Stevieboy666","rank":[7,8]}]