[{"title":"Fresh and Intelligent Interpretation of the Shakespearean Classic","rating":9,"date":"26 June 2016","review":"Superficially David Kerr's production of A MIDSUMMER NIGHT'S DREAM resembles Shakespeare reinterpreted for DR. WHO aficionados. This is to be expected, given that Russell T. Davies has adapted the text. Special effects abound: the fairies disappear in puffs of smoke, Puck (Hiran Abeysekera) moves around the forest as a flash of light, while the camera pans rapidly over urban and rural landscapes, accompanied by heavenly choirs on the soundtrack (music by Murray Gold). This is the world of science fiction, where quite literally anything can happen.<br><br>Yet beneath the colorful surface there lurks a highly original interpretation of the text. Duke Theseus (John Hannah) is a despot, ruling a fascist state festooned with Nazi-type symbols and policed by guards with faces obscured by military helmets. He keeps Hippolyta (Eleanor Matsuura) prisoner; he has her wheeled into his court tied to a cart, her face encased in a metal helmet preventing her from speaking. Egeus (Colin McFarlane) is equally despotic; if people do not submit to his will, then he will have them suitably dealt with.<br><br>Life in the forest seems equally restrictive, as Oberon (Nonso Anozie) fight with Titania (Maxine Peake), and enlists Puck into his service to ensure that she suffers as much indignity as possible. The two male characters are fond of cackling evilly to each other as they contemplate the future success of their schemes.<br><br>The only characters who appear to act naturally are the Rude Mechanicals. Led by an earnest Quince (Elaine Paige), they gather at the local pub to prepare for performing \"Pyramus and Thisbe.\" Among a crowd of sociable regulars, they distribute the parts, much to Bottom's (Matt Lucas's) delight. As they leave the pub, the Rude Mechanicals embrace the locals, thereby emphasizing that human feeling does survive in Theseus's world, even if it is only evident among the poorest members of society.<br><br>In the production's second movement, taking place in the forest, director Kerr and adapter Davies emphasize the play's transformative potential. The four lovers come to understand their depth of feeling for one another; Oberon reconciles himself to Titania; while Bottom remembers little about his experience of being transformed into an ass, but nonetheless wakes up with a renewed zest for life. The action unfolds in a golden, almost nostalgic orange glow that illuminates the trees and enables the characters to see one another for what they are.<br><br>The action shifts back to Theseus's court, where the Duke's despotic rule continues unchecked. As he watches the performance of \"Pyramus and Thisbe,\" he draws red crosses over the photographs of the Mechanicals on his IPad, suggesting that he will have them disposed of as soon as possible. No one else laughs at the performance; they all look fearfully as Theseus to see his reactions. <br><br>The atmosphere soon changes, however, as Bottom-as-Pyramus enacts his death scene. Theseus bursts out laughing, clutches his heart and totters out of the room; on the IPad we witness his eventual demise. As soon as he leaves, everyone is free to act according to their inclinations; they welcome the performance, and give the Mechanicals a standing ovation. Theseus has quite literally died laughing, proving beyond doubt that despotism cannot suppress our natural inclinations.<br><br>The production ends with a colorful dancing sequence. Hippolyta is released from her chains, and it turns out that she is a fairy. Both she and Titania sprout wings and fly up to the ceiling. On this view it seems that Oberon's decision to visit Theseus's court was prompted by the desire to rescue one of his own kind.<br><br>As the entire company perform, Titania winks at Bottom, and Bottom starts, as if realizing just what happened during the previous night. Likewise Puck glances at the four lovers, reminding them of the control he once exercised over their lives. Through this strategy Kerr makes it clear that the \"midsummer night's dream\" was not just something playful, but taught the characters something about themselves and their deepest desires.<br><br>This MIDSUMMER NIGHT'S DREAM was one of the best interpretations of the play I have seen in recent years. All credit to Davies for shaping such a competent script, which was brilliantly performed and directed by a top-notch group of creative personnel.","user":"l_rawjalaurence","rank":[13,18]},{"title":"How to introduce young people to the wonders of the Bard","rating":8,"date":"2 June 2016","review":"This updating of the play works beautifully I think. <br><br>I love Shakespeare and classic opera and I'm wary of modern updates - so often they are facile or irritating and get in the way of the text/score. But this was a delight: genuinely funny, lovely special effects and a real feel for the soul of the play. It wasn't perfect - occasionally the words got lost in the music or through less than perfect diction. I studied this play at school more than 50 years ago and didn't get much of the humour or the cruelty in the treatment of the characters that this production brought out. <br><br>I will want to see more traditional productions as well but will return to this one too. Well done RTD - overall it was a great 1hour 35minutes. The BBC have done us proud in the Shakespeare anniversary year with this and the wonderful Hollow Crown.","user":"jim-mckillop","rank":[10,16]},{"title":"Really; Please!","rating":1,"date":"30 August 2016","review":"This is nonsense. What are actors of Maxine Peake's calibre doing in a misconstrued, overwrought, inept production like this. I was shocked when I saw this as the BBC usually has a good grasp on Elizabethan theatre but not this time. Avoid it! The Storm troopers are more than an anachronism; the forest scenes and the fairies seem to be at odds with each other; the lovers don't seem to understand the consequences of running from Athens away from \"the sharp Athenian law\"; Bottom's dream isn't one; the mechanicals are just that, mechanical; and Titania and Oberon seem to be discussing a shopping list over a pint for most of their interaction. In the year of the 400th anniversary of his death I would have hoped the the BeeB would have produced something more satisfying than this forgettable Midsummer Night's fiasco.","user":"dcrozier-04696","rank":[10,18]}]