[{"title":"teenage soap","rating":1,"date":"19 June 2017","review":"The confused meanderings of a teenage girl who is a spoilt brat and borderline psychotic. I suppose the film tries to portray rebellion for the sake of rebellion by an adolescent from a privileged world with colluding adults who are materially loaded and equally nihilistic and egocentrically exploitative. So, she challenges everyone's intentions and views whilst on an aimless, self-destructive merry-go-round of chain-smoking, alternatively smouldering and cursing, boozing until vomiting, screwing strangers at a whim, sniffing cocaine, to flopping wherever when she is spent. Quite weirdly, all this estrangement and aberrant behaviour doesn't evoke any empathy or real interest. Without wit or any development, the film fails to engage or provide any notion worth thinking or reflecting upon. It's a meaningless mish-mash dressed up as a road movie with no beginning, no direction, no plan or plot, no substance, no structure and no ending. Thus, the film is as self-indulgently serious as the main character. I found it unbearably boring and meaningless. Actually, apathy is so yesterday! Trying to be cool and postmodern it merely reveals itself as a pretentious, lazy, boring, time-wasting exercise. As the Romans said: CACATUM NON EST PICTUM.","user":"rudi-16796","rank":[24,31]},{"title":"An uninspiring nightlife film made with stylistic authenticity","rating":6,"date":"1 July 2017","review":"A hugely stylised character study of a German teenage girl who, after struggling to cope with family issues, resorts to Berlin nightlife. The film is so in the moment though that when it is all over you ask yourself 'oh wait, what was that about again?' Winner of the Sundance cinematography award, it has a keen visual feeling and the main character Mifti is somehow endearing despite her bad behaviour. It sets the scene nicely through Mifti's confrontations with people too caught in the moment to really have a grasp on life but the story line is so convoluted that it spoils the film's charms.","user":"williammjeffery","rank":[10,13]},{"title":"Klip lite meets Goodbye First Love","rating":5,"date":"4 November 2018","review":"Unlike the protagonist of Klip (Serbia, 2012), teen Mifti does not allow her self-worth to be defined by her lovers. Either misunderstanding or being intentionally misled in her relationship with middle-aged Alice, Mifti naturally reacts with pain and anger, but any bad choices she makes arise from instinctual attempts (without forethought) to find or please herself, not others.<br><br>Axolotl Overkill shows a slice of life of a teen with too little parental guidance and too much urban opportunity for self-destructive behavior. But it's just one slice, from the middle of the loaf. Unlike a true coming-of-age tale, nothing here hints that sex, drugs, or rock-and-roll are new to Mifti; she's been like this for a while, apparently. And unlike Goodbye First Love (France, 2011), Axolotl Overkill shows no maturation of the main character. The salamander called \"axolotl\" is neotenic - its development halts at a juvenile phase, never taking adult form, and we are left expecting Mifti won't grow up any time soon, either. The resulting storyline may thus be less satisfying to many viewers (including me), but it's a realistic portrayal of one possible youth experience, of a nature that may be unfamiliar to many.<br><br>It's very well acted, directed, and filmed. It lacks traditional story-telling closure. Whether it has heart, whether you will feel empathy for the young character, depends on each viewer. It's worth watching once.","user":"TrTm316","rank":[3,3]}]