[{"title":"wrong perspective","rating":4,"date":"30 November 2017","review":"Mackenzie Darling is filming her family as her movie star grandma Eve Wilde (Glenn Close) is getting married again. Her new groom is famed writer Harold Alcott (Patrick Stewart). Her first husband and first love Laurence Darling (John Malkovich) is still in the picture. There are cousins, uncles, and Mackenzie's divorced parents, Priscilla Jones (Minnie Driver) and Ethan Darling (Peter Facinelli).<br><br>Filmmaker Damian Harris is following the wrong characters. There are too many of them with too many relationships. I had trouble following the kids and some of the uncles. With the great cast up top, this should be concentrating more on the veteran love triangle. They should be the stars of the show. The writing is average at best. It's meandering and rambling. It's quirky without actually being funny. There are all kinds of possibilities that don't get enough nurturing. The biggest sin is wasting these great actors' time.","user":"SnoopyStyle","rank":[26,34]},{"title":"All-Star Cast But Movie Rings Hollow","rating":4,"date":"17 October 2017","review":"An all-star ensemble cast gathers at the palatial home of retired movie star Eve Wilde (Glenn Close), as she prepares to marry (her fifth) novelist Harold Alcott (Patrick Stewart). Close and John Malkovich,who portrays her first husband Laurence, are strong on screen, and I liked the performance of Yael Stone, as Clementine, one of Harold's daughters, in a supporting role.<br><br>However, despite the terrific cast, I found the film itself quite disappointing with almost all the characters self-indulgent and shallow. Their continuous attempts at having sexual flings get quite tedious.<br><br>Overall, this movie, written and directed by Damian Harris, just came across to me as hollow and soulless.","user":"larrys3","rank":[15,19]},{"title":"Nope.","rating":5,"date":"18 September 2017","review":"If it weren't for Minnie Driver I would've been bored out of my skull. My take away is that the lives of actors are excruciatingly boring. The actors do their job well and act but it's just sad and tedious. If I could only submit 3 lines my review would be completed but apparently a good review must contain more content than is necessary...sorta like this movie.","user":"yyyechiav","rank":[20,29]}]