[{"title":"One of the most beautiful movies I have ever seen","rating":10,"date":"11 October 2016","review":"This movie threw me for a loop. It got a good review in the newspaper I read, and a friend invited me to go with her friends, so I did. I was not expecting to be overwhelmed by one of the very finest, most beautiful movies I have ever had the good fortune to see.<br><br>To begin with, this movie repeatedly throws you for a loop. You are sure you know where it's going - or at least I was sure - only to discover that you were wrong and the characters have something else in mind. I can't explain any of that without spoiling it for you, which I won't, but suffice it to say that this movie is full of surprises.<br><br>It is also full of great acting. Understated, yes, but very great nonetheless.<br><br>And the photography, often black and white, is wonderful.<br><br>It's hard to write much about this movie without spoiling it for those who have not seen it yet, which I most certainly do not want to do.<br><br>So I will close by saying that I sat entranced through the whole thing - and that is no exaggeration. If you enjoy great acting beautifully photographed and directed, you will love this movie.","user":"richard-1787","rank":[93,107]},{"title":"Between the World Wars survivors struggle with guilt and despair.","rating":10,"date":"10 February 2017","review":"The eponymous character is a cultured, pacifist, loving German young man whose doctor father urged him to fight for the fatherland. He gets the title because his spirit haunts the film — as the heroine Anna's lost love, as the Hofmeisters' lost son and as the kindred spirit his killer, the French solider Adrien, comes to love through his family and their memories. <br><br>Himself another cultured, pacifist, loving young man, Adrien seeks out Frantz's grave and family to seek forgiveness for having killed him, albeit in the trenches. As he is so much like Frantz he wins over Anna and Frantz's parents and in turn becomes properly enamoured with her. Though Frantz and Adrien only met in that fatal trench, the narrative posits them as potentially dear friends, perhaps even lovers. That potential was dashed by the war.<br><br>Adrien's relationship with Anna is based on his lie: that he was Frantz's dear friend, not his killer. When he tells Anna that truth she hides it from Frantz's parents, to spare them further pain and disillusionment. They cling to the illusion he will replace their son by marrying Anna and reviving Frantz' violin. To preserve their illusion Anna stays in Paris and reports living with Adrien. <br><br>In a sane world Frantz and Adrien would have lived the lie to which Adrien retreated: they would have met in Paris and become fast friends. They might've competed for Anna on an equal footing. <br><br>But not in this world. As Frantz's father reminds his war-mongering compatriots, fathers send their sons off to war. Though the nations blame each other, it's the fathers' responsibility when the lads are killed. <br><br>The film's most obvious theme is how war needlessly fractures the brotherhood of man. After the war the Germans still hate the French, the victorious French the Germans. The hatred renews itself. Set in 1919, the entire drama of renewal and loss plays out under our knowledge that WW II lies ahead. The German discontent and French complacency will shortly reignite with even more catastrophic consequences. If Frantz shadows the scene from the past, the next war looms in the future.<br><br>In addition to war, the film is about the equally difficult issues of how to live a full and honourable life. In peace as in war we're challenged to balance truthfulness with the empathetic lie. <br><br>Thus Anna tells Adrien she has revealed his lie and guilt to the Hofmeisters. But she hasn't, preferring to save them the renewed pain and another disillusionment. To the end she sustains their illusion that she is living a full life in Paris with Adrien, not wasting away in grief for their Frantz. Where Adrien's lie served himself, hers serves them.<br><br>The last scene promises a happy ending, her lie coming true, when she meets another version of Adrien, a fragile lookalike, in the Louvre. As young men on either side are interchangeable as cannon fodder in the war, young men can replace each other in civilian life when their mothers send them off to marriage. Tragically, Adrien doesn't resist his mother's assignment of Fanny, as Frantz couldn't resist his father's dispatch to war. <br><br>But with the spirit of life a heart can survive death and loss. A new love can replace a lost. Until the next war, of course, which could well make her a widow, him a casualty.<br><br>But that may be the film's most compelling theme: the importance of carrying on with hope and life. Hofmeister means master of hope. Through their mutual attraction Anna and Adrien snap each other out of their emotional paralysis, whether from guilt or grief. They bring each other to life. But as any war story inevitably requires compromise here they can't have each other. They have to settle for other mates. <br><br>From Frantz letter on to the visits to the Louvre, the film returns to the Manet painting, The Suicide. A pallid thin man flings back across the bed dead, evoking both Frantz and Adrien — and Anna, who tried to drown herself after losing her illusion of Adrien too. In Manet's image off a despairing passionate death Anna finds encouragement to live.<br><br>One of the film's strengths is its detailed realization of the period, not just in setting and costume but in conversation, tone, values and understanding. Especially in the black and white sequences, the film feels like a document of the 1920s, the period between the great, the terrible, wars. <br><br>The periodic suffusions of colour serve two functions: they provide an emotional heightening to those particular scenes and they remind us that the film is as much about today as about its historical setting. Perhaps today the bloody fractures involve different nations, and different cultures at war within any of our present nations. But the dashing of hopes and fidelities continues.","user":"maurice_yacowar","rank":[59,67]},{"title":"Beautiful film with urgent message","rating":8,"date":"21 September 2016","review":"'Frantz' would be the perfect film to be aired by the bilingual Franco-German television station Arte. It's half German and half French. In fact, the film is about how these two countries come to grips with the aftermath of the First World War. There is a German and a French lead character, and both languages are spoken. This is unusual, but doesn't feel strange. The story starts in 1919, with a young widow visiting the grave of her fiancé, who died in France during the war. When she notices a Frenchman visiting his grave, she is taken aback. He presents himself as an old friend from the time the soldier studied in Paris. But little things reveal that this is not the whole story. Soon, the truth emerges and the story takes some surprising and moving twists. Acclaimed French director Francois Ozon has put a lot into this movie. It is an anti-war story, but also a bitter-sweet love story as well as a portrayal of a society suffering from a post war trauma. It is most of all an appeal for mutual understanding and rejection of prejudice. In this sense, the message is now more urgent than ever, in view of the growing support for populist and even racist politics on both sides of the Atlantic. The film is shot in beautiful and stylish black and white, perfectly capturing the elegance of the period. Ozon doesn't need any distracting subplots or flashy gimmicks, apart from the use of colour in a few scenes. I couldn't quite figure out the meaning of this. Some colour scenes are set in a different time frame, others seem to indicate the rare moments of happiness in a time that's full of grief and sorrow. The very last scene captures one of those moments in a wonderful way.","user":"rubenm","rank":[68,85]}]