[{"title":"beautiful","rating":10,"date":"30 September 2017","review":"Don't agree with the 1-star reviewer. It's a beautiful film, with 2 great actors acting their AGE. No doddering, just honest raw emotion. The initial premise seemed odd, but after getting caught up in the storyline-I loved it! It's just a simple beautiful story. Like real life, no \"hollywood\" ending. Just real life.","user":"zazigna99","rank":[88,97]},{"title":"A Very Sweet Little Movie, Which I Enjoyed","rating":8,"date":"29 September 2017","review":"I very much enjoyed this unusual movie depicting the lives of two people in their older, and in this case, more lonesome years.<br><br>Both Fonda and Redford gave nuanced performances which were very relatable, especially if you are over the age of 60. I doubt that very young adults would find much to enjoy about this picture, and that is a shame because in fact it displays well the one thing which people cannot lose if they are to continue enjoying their lives into their last decades, and that is hope.<br><br>So often younger people do not appreciate the wisdom and humanity which both come with age. Nor do they realize that if they are lucky, they, too, will be old one day. <br><br>If you want a sweet look into lives of the older but certainly not dead yet, this would be a good place to do so.","user":"joaniewolf","rank":[48,53]},{"title":"One for the oldies","rating":8,"date":"29 September 2017","review":"Jane Fonda and Robert Redford both aged 80 in a 2017 movie, what a treat! The acting is superb as you would expect. To find love again at this age is the dream of many elderly widows and widowers. Life is still complicated even at this age and both have family to consider. It is not fast paced with a lot of action but it is a good script for these two actors in their twilight years. The atmosphere created by their very presence and experience is beautiful. They are a joy to watch. This movie may be wasted on some young viewers but there will be some who can appreciate perfection when they see it. For older people who know these two from previous movies just sit back and know we are lucky to have this movie from them. It is probably worth more than 8 but the lack of action and intrigue makes it a bit tame for some viewers. The acting is worth 10 though!","user":"KathleenK22","rank":[72,85]}]