[{"title":"It's not KIRA vs L","rating":4,"date":"4 May 2017","review":"The original Death Note was brilliant; this film is a dull glow in comparison. While the overall theme comes across, many viewers will find the individual elements of the plot quite a bit more difficult to follow and less cohesive to the film overall. There seems to be a lot of needless filler. Neither the plot nor characters are as sharp and intelligent as the original KIRA or L. There is nowhere near the unique personalities of the two, nor much viewer compassion for any of the characters. In truth, it struck me that the main stars of this film were the Shinigami, which were far more interesting than the live characters.<br><br>There is a tendency of viewers to compare follow-up films with the original and that is perhaps unfair... but it is also inevitable. Imagine a Sherlock Holmes film in which the intelligence, attention to detail and twist-of-plot is missing; is it really Sherlock Holmes any longer? That considered, is a Death Note movie without extraordinary chess-like moves by the main characters really Death Note? In the end I was disappointed in the film and felt it could have been two hours better spent.","user":"Snootz","rank":[17,22]},{"title":"Death Note Light Up the New World: A welcome addition to the franchise","rating":8,"date":"28 September 2017","review":"Death Note the anime is one of the all time greatest television series, a true masterpiece and a contender for the most intelligent franchise by far.<br><br>I was always fearful to venture into the live action material and that doubled when I watched the embarrassment of Death Note (2017) I finally took a chance and watched Death Note (2006) and was thrilled at how well made it was and loyal to the original material. Sure it had tweaked a couple of parts of the storyline, but it still felt like Death Note.<br><br>The sequel was equally great and the third part was perfectly good as well, when I discovered a 4th movie had been made I questioned whether it had reached the stage they were milking it.<br><br>Following directly on from the 3rd movie, we're now 10yrs on from the original events of Kira with both Light &amp; L deceased. The death gods have rained death notes down on the world and all hell is breaking loose. It's come down to L's successor and the surviving members of the old team to bring justice to those responsible.<br><br>This 4th movie clearly has a larger budget, the shinigami cgi is considerably better and the whole film just looks polished. It follows on perfectly and is a welcome addition to the franchise.<br><br>It has it's flaws don't get me wrong, but regardless is a great Death Note film even if it doesn't have the subtlety of the originals.<br><br>I'm not sure whether this is the end, I feel like it could continue based upon the ending but this is a decent enough send off should it not.<br><br>The Good:<br><br>Decent opening sequence<br><br>CGI has improved<br><br>Shinigami's are great<br><br>The Bad:<br><br>Some bad, dull and unlikable characters<br><br>Story is perhaps too grand for a 2hr film","user":"Platypuschow","rank":[10,14]},{"title":"Improvement from the last one , but is it worth watching?","rating":6,"date":"15 June 2017","review":"The movie is set 10 years after Kira and L's conflict ended, Six notes are released to the world. The movie follows three main characters even if it feels like two. A special task force member who pursues all 6 death notes, Ryuzaki the successor of L who helps special task force and Worshiper of kira who want all 6 death notes.<br><br>The acting is decent and story overall is not that bad either,they surely had some good ideas, but fail to deliver it.<br><br>Third act is full of plot twists and revelations that just complicates the story, it seems they wanted to apply same formula for the characters here like in the original. Even forcing similar relationship L and Kira had.The problem is that characters does not have enough building till that point for what they wanted to achieve.<br><br>Those who are unfamiliar with whole death note franchise may find the story hard to follow especially with all the rules and backstory it have.<br><br>There were few mistakes that bothered me like some scenes where names are written in the Death Note and people are immediately dying instead in 40 seconds. Which means its breaking the rules of Death note.<br><br>The thing that I like the most was new Shinigamis, Cgi was improved and their design are great as well, I find them more interesting than main characters. Also it can be seen how are they trying to recreate the complexity of the original story but the main problem is that the characters are lacking depths.<br><br>it can be exciting at moments, I say give it a try only if you are a fan of the series and movies, if you loved first two movies you may also enjoy this one.","user":"ultroks","rank":[10,14]}]