[{"title":"Hooray, nightmares","rating":8,"date":"19 July 2019","review":"From hit or miss comedy to Get Out, Jordan Peele proves to us that he has certainly matured as a filmmaker.<br><br>Get Out is one of the best and most refreshingly original horror movies in the last decade.\nRather than having in your face predictable jump scares and cheesy music, Get Out dwells on the mind and relies on the fear of the unknown while giving subtle messages on racism and what's it like to be black in America and for an anti-racism movie everything is handled very well due to Peele's great writing.\nAs I've already mentioned the best aspect of Get Out is the writing; the characters are intelligent people and behave like logical human beings instead of cliché horror movie idiots. Everything happens for a reason and there is a meaning behind everything. Also unlike other horror movie clichés Get Out doesn't fake its scares or replaces them with needless humour. Instead, the humour (mainly Lil Rel Howery's character) is perfectly balanced with the story and shows up at adequate times.<br><br>Creepy, unsettling and filled with brilliant performances (primarily from Daniel Kaluuya) and even better writing, Get Out perfectly represents the US society in its current era.<br><br>Final Score: 8+/10","user":"Aaron_Kyle","rank":[345,408]},{"title":"Slow Burner Insanity.","rating":7,"date":"28 February 2020","review":"Interesting movie about an interracial couple who decide to go for the weekend to visit the girl's parents, the boyfriend Chris starts noticing odd behaviors from the African Americans house workers and what started as a fun relaxing weekend slowly turns into a living nightmare for him.<br><br>The idea is original and interesting, the acting was good by all but I felt that Daniel Kaluuya was not emotional enough and his reactions was too cold in many scenes! but generally speaking the movie is well paced from all aspects yet I won't call this a horror in anyway, to me it's no more than a psychological suspense thriller...it gets tense but never scary.<br><br>The movie has its share of racism that can't go unnoticed but it's not too much, mainly stereotypical yet I believe that the concept of the plot can executed on any race, which clearly hinted in Stephen Root's final scene. An open minded audience can go throw it, enjoy it without any care for its racism.","user":"Impartial-Critic","rank":[28,34]},{"title":"Just because you're invited, doesn't mean you're welcome.","rating":8,"date":"17 March 2017","review":"\"Get Out\" takes the initial premise of \"Guess Who's Coming to Dinner\" and then twists it with \"The Stepford Wives\" to create a compelling, thoughtful critique of white power. Peele, of course, isn't arguing that white people are out to hypnotise black people. Instead, Get Out is a stinging criticism of the white liberalism that carries itself as empathetic towards blacks, but that empathy only extends as far as white control. Peele isn't taking aim at Neo- Nazis and other whites who would angrily shout the n-word. They're a lost cause. Instead, he's looking at those who profess their lack of racism, but only do so if they can maintain their dominance over black people in the most insidious manner possible. As Chris pointedly notes to Rose at party full of white people, \"Has anyone here ever met a black person that didn't work for them?\"<br><br>The film is genuinely creepy. Instead of cheesy music and grotesque torture porn, Peele relies on the unknown to draw you in. What is happening here? The plot builds like a slow boil to a terror explosion. Clues to the outcome are evident from the first second, but it takes the entire run-time to pull everything together. It's such a joy to be surprised by a horror outcome. I don't think I've seen a genre film this inventive since Cabin in the Woods. The resolve is truly satisfying.<br><br>My favourite aspect of Get Out is the intelligence of the characters. There's a lot to like, but beyond the deeper themes; the characters aren't morons. I cringe every time I watch a genre film and the characters don't behave logically. Chris and Rose are not fools. Something is amiss, enough to warrant wariness. Anyone in this situation would be unnerved as events play out. Credit again to Peele for writing characters that act rationally.<br><br>\"Get Out\" doesn't replace the scares with humour – Peele is too smart to do that. Instead, he balances the fear with laughs and then laces everything with social comment and that unsettling tone. The fact that Chris is so eminently likable just underlines it. It all adds up to something of a treat – for everybody, not just horror fans.","user":"asifahsankhan","rank":[608,930]}]