[{"title":"Best insight into this paranoid organisation","rating":8,"date":"19 January 2017","review":"I find Scientology and cults in general a fascinating subject and have watched most documentaries on the subject including the most recent one by Alex Gibney, Going Clear. Both this and Going Clear are excellent exposes but in different ways. As one reviewer said Going Clear is more factual whilst this one gives you a better feeling of Scientology is all about - a good description in my opinion.<br><br>I've often got the feeling that Scientology is somewhere between a cult and a religion but this film, more than any other, puts it squarely in the cult category.<br><br>Right from the outset you get a feel for this. Requests for interviews by Theroux are turned down by the church an almost unheard of response for an organisation that large. Most will have P.R departments ready to go to any and all media interests.<br><br>This makes it hard for Theroux of course. His usual film making style is subtle and he spends considerable time those involved, something impossible with this subject.<br><br>So he decides to use actors and actresses to re-enact some of the abuse by the organisation's head, David Miscavige. This is powerful stuff which is different to simply hearing reports of the same abuse.<br><br>But I found the real behaviour of the real Scientologists even more damning, particularly when coupled with commentary by ex-Scientologists. Near the end of the film the organisation sent a letter to Louis Theroux saying because he was making a documentary about them they intended to make a documentary about him. Such a response seemed just so totally infantile, like a young child's tit for tat: if you take mine I'll take yours kind of response. On top of the rest of the film this gave an insight into just how separated this group is from mainstream society - to even think that was an appropriate response.<br><br>All in all one comes away with the a real sense that Scientology is run by a powerful and paranoid sociopath who has somehow managed to get away with what he is doing for years. A great effort by Theroux that worked much better than his older documentary on another cult: the Westboro Baptist Church.","user":"baf-89893","rank":[37,38]},{"title":"If The Church of Scientology is so Benevolent and Caring Why Do They Act So Guilty?","rating":7,"date":"13 October 2017","review":"If there's anything I gleaned from this film, it's that the people in the Church of Scientology seem to be anything but compassionate and open. Vindictiveness appears to be their modus operandi. The film is an improvised documentary in which spontaneous encounters demonstrate the twisted world of the Church of the Scientology. Even those among the Church of Latter Day Saints, i.e. the Mormons, were more magnanimous about the musical \"The Book of Mormon\". PBS did an exposé on the Mormons in which many Mormons and ex-Mormons were interviewed. To their credit they didn't seem to be frightened some skeletons would be unearthed from their closets, although they did draw the line in terms of allowing outsiders access to their ceremonies inside their temples. (They did offer some footage showing the inside of one temple without people.) By contrast, the Church of Scientology doesn't merely decline; they literally put up roadblocks in public areas near some of their facilities! They have continually rejected to participate in any kind of documentary about them. They won't give interviews, they dislike outsiders questioning their practices, and they seem most loath to let anyone research their history. If former members claim any kind of shortcoming or social infraction, large or small, they are labeled as liars and transgressors.<br><br>In one of their most telling responses to allegations of impropriety at the hands of David Miscavige, the Church's absolute ruler, the Church claimed that any such allegations \"were extremely false.\" I didn't know there were gradations of falsifications! I thought something was true or untrue. Saying that such allegations were \"extremely false\" seems to me a red flag that something must be true. Of course they offer no explanation as to why someone who left the Church might make such accusations, except to call them all liars. Interestingly, so many of ex-Scientologists make the same accusations. It must be a conspiracy to threaten the survival of the Church. Of course, such accusations if proved true will threaten the survival of the Church! Is there an irony here? <br><br>The writer, producer and narrator, Louis Theroux solicits the help of Mark \"Marty\" Rathbun, a former inner-circle \"cabinet\" member whose job had been to protect the doctrine, essentially both from within and without. During the documentary, Rathburn claims he not only witnessed but participated in punishments upon members who had transgressed against either the Church itself or its leader David Miscavige. One of their main punishments was to humiliate \"guilty\" members in front of others. A bigger punishment was to send transgressors to \"The Hole\", a kind of Scientology detention center. He says he also engaged in harassment of outsiders whom Miscavige believed might undermine the Church's mission. Rathburn then found himself on the receiving end of such discipline and promptly left the Church. Members who leave the Church and criticize it are labeled PTS (Potential Trouble Sources) and SP (Suppressive Persons). As far as I could tell, Rathburn has been labeled both.<br><br>Aside from Rathburn, the really telling scenes are the confrontations between Theroux with people who refuse to identify themselves but are clearly acting under orders from the Church. During one such conflict, the filmmakers come to the outskirts of a Scientology outpost called \"The Hole\" where Rathburn and other ex-Scientologists claim punishments have been enacted. They don't enter private property but are simply on a public street near a sign which says \"Road Closed\". They are immediately confronted by Scientology \"guards\" who order them to disperse as if they have governmental authority. Theroux counters that they are on a public road, and they have a permit to film. A woman who confronts the filmmakers won't even look at the permit, but simply keeps reiterating they have must leave or face criminal consequences. It should be pointed out that no non-governmental civilian has the authority to arrest someone outright except in the event of a felonious crime, a.k.a. a citizen's arrest. Trespassing is not a felony, probably only a misdemeanor in California. If they were truly egregiously trespassing, they should have called the police, not confront the trespassers and threaten them with arrest.<br><br>During every confrontation, the Scientologists and gatekeepers won't engage in a discussion but either claim they are being trespassed upon or simply remain silent. Another former member explains that their behavior is to impress David Miscavige, an audience essentially of one. The other aspect of the documentary is auditioning actors to play key roles of the prominent members, primarily David Miscavige and Tom Cruise, probably the most famous Scientologist on the planet. In the irony of ironies, every confrontation scene just proved to me over and over again that the Church of Scientology is clearly guilty of the things of which they are being accused. It's like the person harboring illegal weapons in their house who refuse to let their house be searched without a warrant. My first thought is, what are they hiding and being so adamant about their secrecy?","user":"classicalsteve","rank":[10,10]},{"title":"Brilliantly done by Theroux","rating":10,"date":"16 August 2016","review":"A great movie, by the master of documentaries and as always it was both funny and enlightening. I don't want to spoil anything but definitely worth the watch and if you like louis theroux you know what to expect already. <br><br>As Scientology of course denied access to any of its higher up people Louis improvised and created a unique documentary that can finally allow people to see what Scientology is and what the people are really like within it.<br><br>Not sure about the other review, he must of been a Scientology troll. How can anyone not trust Louis :)","user":"karlodonnell-16099","rank":[83,103]}]