[{"title":"Terrible","rating":1,"date":"15 November 2017","review":"I HAVE REVIEWED OVER 400 Christmas MOVIES.<br><br>BEWARE OF BOGUS REVIEWS. SOME REVIEWERS HAVE ONLY ONE REVIEW. WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE NO AGENDA! I AM HONEST! I REVIEW Christmas MOVIES AS A WAY TO KEEP TRACK OF WHAT I HAVE SEEN!<br><br>Horror legend Dee Wallace (The Hills Have Eyes, The Howling, E.T., Cujo, Critters) stars as the stressed-out mother of a squabbling family, gathered together in a remote Outback estate on Christmas Eve. When a mysterious, deformed young man named Cletus appears at their door, things soon change from petty insults to bloody, imaginatively orchestrated violence as Wallace attempts to protect her family from the vengeful intruder. The film deliriously infuses comedy, dark family secrets with outlandish gore and adds the always controversial subject of abortion in its blood-stained mix.<br><br>This film is amateur hour. The camera work is terrible. The director thinks his low angles and weird color schemes add mode but they are a distraction. <br><br>If you want to see a good horror film that has a Christmas setting then watch the original \"Black Christmas\"","user":"Christmas-Reviewer","rank":[54,76]},{"title":"Wow this is bad","rating":2,"date":"25 December 2017","review":"Don't be fooled by some positive reviews. They are clearly written by people that were involved in this movie. The only reason I watched this movie is that it was christmas and that I felt like watching a horror movie instead of the usual boring christmas movies. Now the so called boring christmas movies all look like award winning movies after watching this garbage. It's not even a good slasher for people who like that genre. The acting is below average if not to say sometimes very bad. The story, I didn't expect much of it honestly being it a slasher, is even worse than I thought it would be. The story-line is so boring and badly written it makes you cringe. There is only one advice that I can give you and that is avoid at all cost!","user":"deloudelouvain","rank":[14,23]},{"title":"AS BAD AS THEY GET!","rating":1,"date":"13 December 2017","review":"SPOILER ALERT (kinda) How do movies like this ever get made? Dee Wallace plays the potty mouth matriarch of a dysfunctional family gathered for Christmas. Her brother is a drunken bum who looks like a reject from Duck Dynasty. There is also the pregnant substance-abusing daughter married to the token black man. Her sister, who comes to blows with her (even though she's ready to pop) over whether or not to refrigerate the meringue pie (I'm not making this up), is married to a perverted preacher who enjoys peeping on his sister-in-law making love to her husband. Another sister looks to be Hispanic and is allergic to peanuts (and is offered some by one of her siblings) and ends up with a splitting headache. The youngest son has Down Syndrome (and is played by one of the worst actors ever to star in any movie, handicapped or not.). Add to the mix the villain wrapped in bandages and wearing a black cloak who comes calling on Christmas. He should feel right at home among these loonies; in more ways than one. The movie's premise has to do with promoting right-to-life vs abortion but ends up proving that abortion is a good thing because all of these wackos should never have been born. Now you must excuse me, but I need to read the reviews written by armchair psychologists and wannabe film critics who will find hidden meanings in this sorry film.","user":"clintstevens","rank":[11,19]}]