[{"title":"If you love animals - you must see this beautiful and eye-opening documentary","rating":10,"date":"11 June 2019","review":"What a truly inspiring story of two outstanding individuals who saw dogs in dire need and instead of shying away from such a monumental task, rose to the challenge and dedicated their lives to saving so many of them.\nRon and Danny, you are this world's real heroes!<br><br>It pains me that to this date so many people in the US are not aware that millions of dogs are put to sleep every year. Please consider adopting a dog instead of buying one. If you want to get a dog it means you love animals. And if you love animals - please adopt and save a life, and spread the word to everybody you know: spay, neuter, adopt!","user":"oana919","rank":[14,14]},{"title":"Very inspiring","rating":10,"date":"8 June 2019","review":"I watched this primarily cos of the cute doggos but as the story progressed I saw how dedicated Ron and Danny to these lovely dogs to the point it took over their house and their lives. I would have loved to adopt a few dogs from them but sadly I live in the UK...I would love to donate to them though.","user":"genique-23201","rank":[11,11]},{"title":"An important and incredibly moving docu","rating":10,"date":"12 June 2019","review":"Four million dogs in shelters are euthanized each year.<br><br>Four million.<br><br>If you walk away with nothing else than this statistic, your viewing of this film will have been worthwhile.<br><br>Been a dog lover all my life. Caught this on Netflix and was completely unprepared for the emotional rollercoaster. Plain and simple, I cried buckets. But walked away with nothing but admiration for Danny and Ron and the work they -- and all other heaven-sent angels who sweep dogs out of kill shelters and re-home them -- do. This is a film that will make fans of man's best friend want to drain their bank accounts and send the funds to support Danny and Ron and their counterparts all across the country.","user":"dweck-47762","rank":[9,9]}]