[{"title":"has potential to gather a cult following","rating":4,"date":"7 January 2016","review":"You know those films you watch when your brain needs a rest and you just want something to watch to help pass time and entertain you enough to get through to the end of the film, well add this to that list. a small town finds out that there is sinister activity going on and the town is under threat from wolves, its a decent attempt of a concept film and some scenes are well shot and with a good cast behind it with the likes of Eric Balfour (haven,24,skyline) Patrick Muldoon (starship troopers, stigmata) and Bianca A Santos ( the DUff, Ouija) it should of been much better but unfortunately its not. some action scenes feel like they were shot by someone who is being electrocuted but like i said above if your brain wants a rest then yeah go for this film and with a run time of 88 minutes its just right.","user":"wycherleyp-960-470658","rank":[32,38]},{"title":"Fairly entertaining Werewolf movie","rating":6,"date":"15 December 2016","review":"This plot Oo :-D <br><br>Lady in the woods passes the crown to her granddaughter to become some kind of Zombie-Vampire-Werewolve-Buffy-Chick, so she can protect the small town from a supernatural evil, the Denmother. Why she had to be dead for that, who knows...<br><br>It felt like an over-length Buffy episode, and it showed the same trademarks - TV look, effects that change between super bad and surprisingly good, dialogues from hell, and a cast that is fairly talented. Especially Eric Balfour, this good old veteran, does his job just as good as he always does. Bianca A. Santos, the \"Red Rotting Hood\", did her job well, too. The rest was overacted mostly, but still okay.<br><br>Some of the Special FX were really bad, like the 3 guys changing into wolves - I've seen this done better by small YouTubers. Some other scenes were really cool though - the director knew what he had to do with a small budget and focused on key scenes done well. A fight in a small town, at night, with lots of trained animals, flame throwers, 30 or more extras, CGI - this is not easy ! The main antagonist effects (don't wanna spoil you guys !) were not state of the art (or time), but still looked good - you needa be fair here, this is not a 200 Million dollar Hollywood movie.<br><br>Also, finally a horror B-movie without any night scene problems. Not one single time I had to try hard to recognize anything in dark scenes - so, good job from the lighting and camera department !<br><br>The dialogues are the biggest weakness of the movie - they were bad, and I mean like, super bad. The actors tried their best, but some lines cannot be delivered in a good way, not even if Meryl Streep would say them. <br><br>Overall, the movie is totally okay. It is not art, it is not even a good movie in the pure meaning of the word. But it entertained me fairly, and if you look for a \"brains out, amusement on\" movie, this might be the one for you, especially if you like Werewolves or creature horror in general.<br><br>There is even a pretty awesome female nudity scene - oh my gosh, was that chick hot. Uff.<br><br>So, get it, guys, nothing wrong with \"Little Dead Rotting Hood\", maybe besides the stupid title. In general, I probably would not have taken the Red Riding Hood story as background, it was not needed. But however, again, nothing wrong with it.<br><br>Have fun, and beware of the Denmother. <br><br>Maybe keep your dog out of the room, the tons of animal noises might make him nervous ;)","user":"marcwiechmann","rank":[8,8]},{"title":"Dead and Rotting","rating":5,"date":"15 June 2016","review":"This movie seems much more like a conversation with high/drunk friends that somehow actually got made rather than a realised idea for an actual story. Someone said: \"Man there should be a film led by a cool female lead...and she should be like Blade, but also powerful, like a werewolf...and tragic, like she dies...but then she comes back!...So she should be like a vampire, werewolf, zombie chick, but hot, definitely hot...and she should be based on some kick-ass fairy tale babe, like little red riding hood, killing wolves and all that...oh my god! She could kill werewolves!\" And then someone else was like: \"Done.\"<br><br>Unfortunately rather than writing the whole thing while high/drunk so it becomes some crazy, wacky cult classic, they instead sobered up and tried to give some legitimacy to their idea by giving it a serious plot, which becomes ludicrous in conjuncture with such a concept. The actors all trying to play the entire thing straight makes it way more boring and way more unintentionally stupid than it needs to be.<br><br>Overall this film is simply a 'cool' sounding concept with very little actual entertainment. It comes across as a quick cash grab with an inane plot, although it is filmed well and the actors aren't too bad so it can't be completely condemned. If you just want to turn your brain off then go for it, but even in those regards this film could have exploited its premise to make it a much more enjoyable brainless watch.","user":"scythertitus","rank":[10,12]}]