[{"title":"Insane, beautiful, terrorizing, epic, puzzling, intoxicating, gross, masterful. (Spoilers)","rating":10,"date":"18 September 2017","review":"First, I must laugh at all the reviews of people who had no idea what they were watching. We must all realize that all films are not written for all people who watch. Just as I usually do not go see cartoon films, others should give good thought before seeing such an 'artsy' film as Mother!. Hey, if you didn't like Black Swan, think more than twice on this one.<br><br>Observation: <br><br>There is a fire. Woman's face burning up. When cut to Javier holding a crystal. He places the crystal on a metal stand and we watch the house start healing itself, starting at that crystal. We cut to other parts of the house, as it heals, from fire back to normal. Eventually we cut to a bedroom where we see the bed healing itself and someone under the covers. She arises and it is Mother, played by Jennifer. Odd names for a film, right, but the names are never said in the film. We learn that Him is an accomplished poet, but it seems like he is going through some type of writer's block. Mother's mission is to refinish the house. A lot has been done, but there is always more work to do. <br><br>A man played by Ed Harris knocks at the door and Him greets the man and allows him to enter, almost happy someone else is in the house. The man is a doctor, but he smokes and drinks which causes him getting sick, fairly easily. It doesn't bother Him, but Mother is quite concerned.<br><br>Soon someone else arrives, a woman played by Michelle Pfeiffer. Turns out the woman is the man's wife. She's a feisty one played convincingly by Pfeiffer. Mother seems confused why Him allows these strangers to stay in their house. The woman doesn't hold anything back when she has a conversation with Mother. The woman asks why they don't have a baby? Mother is pretty taken back by how forward the woman is. This does not bother the drunk woman.<br><br>The man &amp; woman seem to find a fascination with the crystal. Mother tells them not to touch it, but eventually they sneak in the room and break it into 100's of pieces. Him becomes enraged! Mother wants the man and woman to leave, but they don't and it's seems Mother is powerless. Mother goes to their room and they are having sex so she leaves. Even though Him is very upset he does not ask them to leave. Are you putting the pieces together? 2 more guests, 2 sons arrive. They fight, one becomes badly hurt &amp; Him, the man &amp; woman take him to the hospital, but Him comes back and tells Mother he died. Soon people start showing up, apparently for the funeral for the son and as more arrive things become chaotic. Every person seems to represent something different. The house becomes a disaster as everyone starts stealing everything! <br><br>After everyone leaves Him &amp; Mother have a fight which turns into sex. After Mother says she is pregnant. Him then becomes inspired to write a new poem. He gives it to Mother to read. She cries and tells Him it is magnificent. <br><br>People start showing up again to praise Him for his poem. It is at this point things start to become totally chaotic. Let's just say lots of people show up and Aronofsky puts things in overdrive! The insanity on the screen is brilliant and here is why I believe this <br><br>Interpretation: <br><br>The film is basically an allegory our entire existence, and then some. Him is G*d. Mother is Mother Nature or as Him calls her, home. Him creates man and woman as Mother Nature creates everything around them. The Poem is the Bible. The house is the world. The man is Adam, the woman Eve. The sons Cain &amp; Abel. We then basically witness an insane, quick review from Christ to present time (about 20 minutes), and then the demise of mankind. The film's use of the crystal represents the 'Apple'.<br><br>Conclusion: <br><br>When we look at this film in its entirety, taking 2 steps back, we see the film summarizes man's existence. The beginning of the film shows he tried before, but failed. Our existence, most of the film, also fails. At the end, we see Him try once again. G*d's dilemma is free will. Him only leads by verse (the Bible), but man's interpretation is what creates conflict, as everyone has their own interpretation, thus anarchy eventually occurs &amp; eventually obliteration. Eden gets a restart, over &amp; over again.<br><br>I find the film to be amazing in scope, like Cloud Atlas or A's The Fountain. Like I said earlier, if you don't appreciate films like these, or even Black Swan don't bother. It's simply not your brand. I feel the film is an amazing encapsulation of our existence performed in very unique fashion. The message here is strong. I prefer the avant-garde probably because I've seen so many films. I need to view films that present something new, and this one certainly does. For me, it is a masterpiece. Aren't artists allowed to target their audience? They all can't have happy endings. My 1000 words worth.","user":"Farshnoshket","rank":[1,1]},{"title":"Thick on analogies and symbolism, to the point of overkill","rating":6,"date":"11 September 2017","review":"I saw this at TIFF and the point this movie was trying to make became clear fairly early on. That's not necessarily a bad thing, but as the story developed, the analogies and symbolism went into overkill, to the point where their excessive nature diminished what was an interesting story.<br><br>The movie is helmed by Jennifer Lawrence and Javier Bardem, two actors I'm particularly fond of. The short summary of this movie is that they are a couple who live in a beautiful, remote home. One night they take in an unwanted house guest (Harris), more at Bardem's choosing than Lawrence's. This leads to countless other house guests and invasions from the outside world, often to the detriment of Bardem &amp; Lawrence's beautiful home, and Lawrence's well-being. <br><br>As the movie goes on, these violations against the home and Lawrence get increasingly bizarre and excessive. They get laid on so thick that, even if you have figured out the analogy by the midway point of the movie and enjoy the way the movie is getting it's point across, the sheer madness that transpires in the second half of the film is likely to sour you on the overkill applied to the message. <br><br>It becomes fairly apparent that the house and Lawrence's character from which the movie is titled represent our planet. Bardem's character represents a creator/God (in credits, his character is simply known as 'Him'). Harris and Pfeiffer, the original, invasive guests, are the original Man &amp; Woman (Adam &amp; Eve), and from there, a lot of the plot initially descends from biblical references and then into His desire to provide for his followers and to be adored by them, ignorant of how detrimental they are to the house and Mother. <br><br>At the very end, the house becomes overpopulated with people who are both zealots and warmongers who descend into utter 'WTF' madness while they destroy the home, murder the couple's child, and force Mother to burn down the home she so painstakingly created, killing everyone inside it. After the fire, He carries her out, and recreates the home with a new Mother. <br><br>As I said, it's a story thick on symbolism and message. I personally liked what they were going for, but think it could have been a much better movie if they had done it far subtly than with the extreme overkill they employed in the second half of this film. Looking at the reviews, I see a lot of people torn by this movie, and I think for these reasons. Some people didn't clue into the message very well and just thought it was a movie that made no sense. Others may not have liked the pro-environment analogies, while some may have loved how excessive the movie hammered it's point home. Another group likely felt how I did - that the plot and point was unique and interesting, but the sheer madness the film careened into during the second half was extremely excessive.<br><br>Overall, I give it a 6/10, with disappointment that a promising concept wasn't executed more sensibly.","user":"bzarras","rank":[519,801]},{"title":"Story of Life from a Religious Perspective","rating":7,"date":"13 September 2017","review":"Him is the God, the creator! Mother is the mother earth. Mother gives form and maintains the structure. God first invites Adam (the old man). Then from Adam's rib God creates Eve. Do you remember the scene in which Man's rib was wounded and he was throwing up?<br><br>Adam and Eve break the forbidden crystal (they ate the forbidden fruit).<br><br>Then we see the story of Abel and Cane. Cane kills Abel. Then mother's house, the earth, is populated with various religions and various ideologies. All of which pray God (or Him). But they become aggressive. They start to betray the earth. <br><br>And then the story of Jesus. Mother becomes Mary. It gives birth to Jesus. But Jesus followers eat him alive. They eat his blood and his flesh (wine and bread). And the story continues. The way the humanity is heading, Mother earth is doomed.<br><br>I liked the symbolism in this movie. But to me, as a semi-Nietzschean thinker, mother is the real God. For God is not separated from mother. God is mother's creation. <br><br>Mother = Earth. <br><br>I finish with this quote from Nietzsche:<br><br>\"Remain faithful to the (mother) earth, my brothers, with the power of your virtue. Let your gift-giving love and your knowledge serve the meaning of the earth. Thus I beg and beseech you. Do not let them fly away from earthly things and beat with their wings against eternal walls. Alas, there has always been so much virtue that has flown away. Lead back to the earth the virtue that flew away, as I do—back to the body, back to life, that it may give the earth a meaning, a human meaning.\"","user":"aminrigi","rank":[338,541]}]