[{"title":"Fun Comedy with Deeper Message","rating":7,"date":"17 May 2018","review":"Interesting premise especially in wake of the #metoo and #timesup movement (though this movie was made before that). This film takes a comedic spin on a Freaky Friday type of scenario, except instead of a body switcheroo, it's a gender sensibility switcheroo in which a sexist guy and a strong woman suddenly think like a woman and think like a man. It's a comedic take on it and it doesn't go too deep, often playing up a big gender clichés and stereotypes - BUT stereotypes are there for a reason in that there is some truth to them. So while this movie makes you like, it also gives you pause and make you think.","user":"rolbyh2002","rank":[5,5]},{"title":"An excellent date night flick.","rating":7,"date":"25 August 2017","review":"\"Second Nature\" is a cute little film about role reversalsa subject which has been tackled quite a few times before but never quite like this one. <br><br>Amanda (Collette Wolfe) is a lady who wants to run for mayor of Louisburg, now that a special election has been announced. However, Bret (Sam Huntington) seems like a shoe-in. After all, politics in Louisburg seems like an old boys' network where women aren't taken very seriously. She knows she could do a great jobif she only got the chance. Around this same time, her grandmother gives her what she claims is a magic mirrorand magic it certainly turns out to be! When Amanda and Bret are later arguing about the unfairness of male and female roles, they inadvertently use the mirror to change things.to make it a world where women are like men and vice-versa.<br><br>As for Amanda, she really likes this new world. While the folks in town look like the same old folks she's known her whole life, they certainly don't act like them. In Ellenburg, women are in charge and men are often just seen as sex objects and bimbos. Because of this, it seems certain that Amanda will win the election and life just seems easier for her thanks to the mirror. At the same time, however, Bret is miserable. Women don't take him seriously and they spend so much of the time objectifying him and the other men! The problem is to return to their old lives, if it's even possible, they both need to find the mirror and unwish the wish.but the mirror has disappeared and Amanda is just too darned happy in this new life!<br><br>The film has a lot of interesting things to say about men and women and couples no doubt will enjoy watching the film and talking about it afterwards (yes, men.talk to your partnerit's a good thing!). The acting is very nice (particularly by Wolfe) and it's a light, enjoyable little comedy that made me smile. My only reservation is that at times the film is a bit too broad in how they portray the difference between the sexes and it is far from subtle.whether in real life or the mirror universe. Overall, despite this minor problem, a clever and fun film that is hard not to like.","user":"MartinHafer","rank":[10,17]},{"title":"Woman-Up","rating":9,"date":"11 November 2016","review":"\"Second Nature\" demonstrates how sexism wears poorly on men and women. In his first feature length film, co-writer/director Michael Cross creates a gender equity fable where women have the power that men have in society today. (This film premiered at the Napa Valley Film Festival only three days after Donald Trump bested Hillary Clinton for President of the United States, despite Trump's comments denigrating women on \"Access Hollywood\" and in speeches, interviews, debates, and tweets.)<br><br>Written before the Trump election, this film is set in small town America and depicts Amanda Maxwell, played by Collette Wolfe (\"Interstellar\"; \"Hot Tub Time Machine\"), running for mayor against Bret Johnson, played by Sam Huntington (\"Superman Returns\"; \"Being Human\"; \"Sully\"). Using the plot device of a magic mirror, Amanda and Bret are transported to a female dominated world where people say things like \"woman-up\" instead of \"man-up,\" and a Hooters-like restaurant is now called \"Peckers\" where beefcake men must wear skimpy uniforms and are hit on constantly.<br><br>Writers J.C. Ford, Edi Zanidache, and Mr. Cross choose to depict daily displays of gender inequity through comedy, as opposed to taking on the subject from a larger perspective with a mix of more drama. This is somewhat effective but made the level of comment on society one note. There are so many male-female power dynamic clichés that could be used that I sometimes wondered how they decided to depict some and not others.<br><br>Mr. Huntington turns in an appealing performance never overacting as a sexist pig at the beginning of the film, only just a regular straight guy who accepts the male dominated society in which he was born. Ms. Wolfe also never portrays her character as a helpless female, but as a straight woman competing against men in a male dominated world.<br><br>While I think this film might have been better as a dramedy, as opposed to straight comedy, \"Second Nature\" works as a light hearted send up of gender roles in a nation where some need to be reminded. <br><br>Due to the timeliness of the subject matter, I highly recommend this film for film festival competition. If I was still writing script coverages for a film studio, I would recommend this film be picked up for distribution in the U.S. for streaming services and a limited release in theaters in urban and suburban centers where Hillary Clinton was the top candidate, because of the timeliness of the subject matter.","user":"dennis_chiu1","rank":[10,17]}]