[{"title":"This dark, mind-bending moving one-hour piece which elevates from being a stand-up piece to being existential monologue makes you wonder.","rating":6,"date":"6 June 2016","review":"It is scary or even frightening to see a ground-breaking, innovating performer like Burnham be this unhappy. Fighting his fans who see in him the role model he doesn't want to be. Terrified of today's commercial based entertainment industry which he ridicules over and over again to convince his audience stop looking for answers in the words of performers. Seeing the irony of his own fans blindly following the young comic this one hour special consist of a constant fight between Burnham and his audience with a goal to make them really listen. Where his previous shows 'What' and 'Words,words words' showed a generally happy kid making fun of everything about performing, 'Make happy' shows an angry, depressed soul begging for answers. This dark, mind-bending moving one-hour piece which elevates from being a stand-up piece to being existential monologue makes you wonder. What does it take to be satisfied?","user":"sebasibas","rank":[56,60]},{"title":"On a scale of 1 to 0, it was a 10.","rating":10,"date":"15 April 2017","review":"I'm a long time fan of Bo Burnham (started seeing his stuff on YouTube back when he was in his bedroom) and every special he's put out has left me feeling different. <br><br>Words Words Words made me see art differently, especially performance art. <br><br>What made me question how I think and perceived my identity.<br><br>But Make Happy made me realize how shitty being a creative can be and how ageist the society at large can be surrounding ideas of love and acceptance.<br><br>This show explores the system surrounding commercialism of the music industry, how the rich shape the minds of the poor, how being down to earth can be an act, and how looking okay is a mask.<br><br>I loved the show. I felt awkward and uncomfortable when facing the realness of depression and working through it because life must go on. I laughed at the impressions, at the face value jokes, at the wordplay, and the interesting lyrics. I teared up at the end because it's hard to put into words how fleeting happiness is...<br><br>And Bo captured it.","user":"jhester9614","rank":[29,34]},{"title":"If this is the end, what a way to go out","rating":10,"date":"5 June 2016","review":"Bo Burnham's \"Make Happy\" is structured, especially at the end, to be an \"ending\" of Bo's career as a stand-up comedian, or at least, that's how I see it.<br><br>And if this is the end, I'll be the first to say that this was a stunning show. I personally don't think it was on the same level as \"what.\", but perhaps that's because \"what.\" was something so unique and different.<br><br>Make Happy is still a stunning piece of media, that works because Bo's humor shines through and made me laugh out loud quite a few times. But the ending works too, because we know Bo's persona and we know who he is to us.<br><br>So, to end this review, let me tell you that if you liked Bo's previous work, you're probably gonna like this.<br><br>And I have just one question to ask: Are you happy?","user":"arussell23","rank":[35,44]}]