[{"title":"Very poor acting","rating":4,"date":"16 March 2019","review":"When I saw the cast line up I thought I was in for a good nights viewing.\nHow wrong I was - very weak and wooden acting. I know it was based on a true story but it was told very boringly","user":"swim-35025","rank":[5,6]},{"title":"Restoring faith","rating":9,"date":"16 April 2017","review":"This film restores one's faith in people. It's about some residents of Jersey during the German occupation in World War II. We see the film through the eyes of a local shopkeeper. She bravely takes in Russian prisoner of war who manages to escape from forced labour in a quarry. Times are tough with rationing. Slowly but surely she forms a relationship with the POW, teaches him how to read English and he becomes like a son to her. The story is sensitively told with excellent acting from the principals. Although I note that the actor playing the part of 'Brian' is not mentioned the cast list. Without giving anything away the tensions mount as time passes with an inevitable conclusion. This film portrays the bravery and selflessness of ordinary people in helping others and opposing occupiers. A deep film and a well worthwhile film to see. When I saw it at the Clevedon Curzon members of the audience clapped at the end of the film.","user":"burgessian1","rank":[14,23]},{"title":"Quietly and surprisingly impressive","rating":8,"date":"11 June 2018","review":"A cheap asking price and the subject matter drew me to this film. Not just a WWII piece but one set on the channel islands during the German occupation. Until recently this subject matter has been thin on the ground, filmically (Although The Guernsey Literary and Potato Peel Pie Society is currently in cinemas). With an interestingly eclectic cast, I thought it was worth a watch. That said, I was also slightly wary of a possible tweeness and the fact that Bill Kenwright Productions are far better known on the theatre scene as opposed to the cinema screen. Those fears were, initially, justified- to start with the scripted dialogue was somewhat stilted and dealt in clichés but crucially, just as my attention started to wane, it slowly but surely began to win me over. This was due in no small part down to the fact this was based on a true story, a story of humanity and heart and one which, I am sure, Christopher Menaul and his cast felt a responsibility for bringing to the screen in as truthful a manner as possible. The central story concerns Jenny Seagrove's character agreeing to take in an escaped Russian P.O.W, because, as a mother of two grown sons away fighting (one of whom was killed in action) she feels a responsibilty to \"Another Mother's Son.\" Seagrove sets the tone of the film in a stoic and quietly impressive performance, matched by Julian Kostov as the young Russian (a star in the making) and their chemistry in a surrogate mother and son relationship works well. They are surrounded by a cast of, mostly, British character players including John Hannah, Amanda Abbington, Nicholas Farrell, Peter Wight, Susan Hampshire, Joanna David, Gwen Taylor and...Ronan Keating! Yes, he of Boyzone fame. And yes, he does sing in this film but it is crucial to a plot point in the film and is a lovely edgy moment where we fear for our heroes. Keating, in fact, acquits himself well throughout, and this could be the start of a fine second career for him. Speaking of edgy moments, there is another wonderfully nerve jangling moment when Seagrove and Kostov are followed by a German officer when leaving a bookshop. In short, then there is action and suspense without overt 'pyrotechnics' and poignancy without overwroughtness. A fascinating true story that is really worth spending an hour and a half of your time on.","user":"loloandpete","rank":[6,9]}]