[{"title":"The R-Rated, Indonesian, Jason Bourne","rating":8,"date":"24 October 2016","review":"\"Headshot\" stars Iko Uwais as Ishmael, a man who's found washed up on a beach and put in a coma for two months due to him being shot in the head. He wakes up and doesn't remember a thing about himself. He discovers from flashbacks, gang members sent to kill him, and an incredible set of skills, that he is a former assassin/hit-man for the crime boss, Lee. When Ailin (the nurse who looked after Ishmael for two months and has liking to) is kidnapped by Lee, Ishmael sets on a mission to save Ailin, and to confront Lee once and for all. \"Headshot\" was the last film I saw at the 52nd Chicago International Film Festival this year and it was a very action packed way to leave the festival till next year.<br><br>\"Headshot\" is directed by Timo Tjahjanto, and Kimo Stamboel who also directed the very successful \"Killers\" (2014). The two directors have an excellent direction when it comes down to choreographing the stunts and fights and always do it with such flare. The cinematography is very well done, not to compare to \"The Raid\" films but the camera is much more shakier in \"Headshot\" and not as smooth and fluid as \"The Raid\" films, but nevertheless I can see what's going on and it overall captures the action very well.<br><br>The acting is overall very well. For an action film of this caliber you don't really need stellar performances but rather great action and stunt work which Iko Uwais is very good at due to him being the star for both \"The Raid\" films. I had a blast with this film, it was just exactly what I expected it to be, amazing action, average plot, and bad-ass characters. The audience that I saw the film with were super into it, there was always an \"oh s***.\" or \"whooo!\" whenever a fight scene was happening or when it ended. It was awesome. <br><br>Other than the film being action packed and violently entertaining there's nothing else to it. This film is 100% pure entertainment, that's what it set out to be and that's what it will always be. I will admit the violence in the film was very overwhelming, every 5 or so minutes you had someone get shot in the ear, have their arm snapped in half, or burning alive. And much like \"The Raid\" films the absurdity and unbelievability of the violence is UNBELIEVABLE, and I love it. I mean where else will you see a guy who has his arm and leg broken with nails embedded in his fist and half beaten to a pulp still able to keep on fighting. I was laughing out loud to this stuff because it's so damn silly but so damn entertaining.<br><br>\"Headshot\" is nothing but a pure energetic and adrenaline filled film full of violence to satisfy any die hard action cinephile out there. Thumbs up!!!","user":"horitaj","rank":[55,75]},{"title":"The fight choreography is phenomenal. It is brutal n intense.","rating":10,"date":"13 March 2017","review":"I really wanted to see this on big screen but saw this on a 50 rs pirated copy. Had seen all of Iko Uwais' films. Had enjoyed The Raid in theatre. The plot line for Headshot may sound familiar, a man found on a shore, wounded and unconscious, wakes up in a rural hospital unable to remember anything. His attending lady physician gives him a new name. Later we come to know that the amnesiac man can do hand to hand combat n other self defense tactics efficiently. Viewers may compare this to Jason bourne, Kill bill or Faster but believe me this movie ain't no another revenge or secret agent run of the mill. This movie is an awesome adrenaline filled, high octane, brutal n bloody action film. Directed by Timo Tjahjanto and Kimo Stamboel (Macabre, Killers). They know how to position their camera best to capture Uwais in full on furious action mode. There is some good camera work n with the attractive locations, the film does engage visually too. The editing is frenetic. The action is non stop. But it is Uwais who is the star of this film. Uwais delivers the bone-breaking, gravity defying flurry of kicks, punches, eye gouges, and throat throttling. His action choreography is the best. This movie also has some of the best movie martial artists and stunt performers in the world — Iko Uwais, Julie Estelle, Very Tri Yulisman, Sunny pang, Zack Lee n David Hendrawan. Anything n everything can be a weapon when controlled by true masters : chopsticks, desks, broken plates, bus seats, pistols, shot guns, machete, rods, etc. but fists, elbows n feet are much deadlier weapons when controlled by them. Jason bourne, Kill bill n Faster looks like kindergarten in front of Headshot.","user":"Fella_shibby","rank":[37,50]},{"title":"One of the Bloodiest Brutal Fighting Movie After The Raid","rating":8,"date":"10 December 2016","review":"As an action movie, this one was quite over the top. The action coreographies were done superbly by Iko Uwais (who had a real pencak silat ability) and his team. I love the fighting scenes and there were so many of them that you would be left breathless watching them. They were all brutal and the length of each fight scenes were mostly just perfect. Except for the fight scene with Tejo and Tano which I personally felt was too long. Ooh I also felt that the opening shooting scenes were too exaggerated and did not make sense. However, the rest of the fight scenes were cool! Even the one involving Julie Estelle (I think her fighting scenes here are much better than the ones in The Raid 2). If I had to single out though, my most favorite one would definitely be the \"first part\" of the final fight of Ishmael with Lee.<br><br>In addition to the cool fighting scenes, the movie was also filled with good sound effect &amp; the music was surprisingly good. I personally love the end credit song which felt very peaceful. The make up effects were also pretty good, with the bruises, scars and everything really seemed believable. Another plus point was also the beautiful scenery as the movie were shot in Riau province instead of the congested Jakarta. <br><br>There were also some interesting smaller supporting roles in the movie, but the one that I believe really stood out was Romli (played by Epy Kusnandar who was famous for playing in the popular comedy TV series Suami Suami Takut Istri) which I really thought brought some needed lightening mood to an otherwise very serious tone of the movie. Please be reminded also that this is an action movie where the main attraction is the great fight choreography by Iko Uwais. Hence we should not expect a great story line or logic in this movie. It is just pure entertainment. One thing that I originally felt was a plot hole, appeared to be resolved in the ending part of the movie. So kudos on the writing part.<br><br>So if you are a fan of this kind of gore, bloody movie filled with various one on one fighting scenes plus some occasional group fight, then this one is definitely for you. However, this is not recommended for the weak heart audience or those who could not stand the sight of those brutal killing scenes.<br><br>for my complete review, pls have a look at michaelnontonmulu.blogspot.co.id","user":"MichaelNontonMulu","rank":[34,48]}]