[{"title":"Still good, just not as good as...","rating":7,"date":"27 October 2018","review":"I feel the low rating currently (5.7) is probably because people are disappointed because it can't live up to its predecessor. And it's true, it can't... but in its own right it's still a good movie. Not excellent, but good. The story is okay, the action is solid, and Lisbeth is still badass.\nIf you have the previous movie sitting in a shrine in your house somewhere and you worship it before you go to bed... skip this movie. If you just want an enjoyable if not terribly memorable action thriller, then go ahead and have fun.","user":"finraziel","rank":[320,405]},{"title":"An insult to the Millennium series","rating":1,"date":"23 November 2018","review":"I don't usually review films but I felt compelled to after watching this.<br><br>I should say that this from the perspective of someone who has read the Millennium books, and perhaps you would feel differently if you hadn't, but I doubt it because this film is a total mess.<br><br>The set pieces are boring, the plot is all over the place, the characters' motivations are unclear and it generally felt hugely pointless and unsatisfying.<br><br>When I read the Girl in the Spider's Web I felt it was okay but not up to Stieg Larsson's standards, that the plotting felt a little clunky, and certain characters felt off. This film makes the book look like the greatest work of literature of the past few hundred years.<br><br>** Spoilers follow **<br><br>Most adaptations excise a lot of side plots to condense a story down to two hours. I wasn't surprised to see everything about August's mother, a lot of Sapo and NSA stuff and much of the Millennium ownership go.<br><br>However, the introduction of a big standard \"nuke the world\" plot, Ed Needham becoming a stupid action hero with Plague as his sidekick, August not being mute...(I could go on) made it feel like the writers might as well have not bothered with the book.<br><br>Add to that, the main twist from the book, about lisbeth's sister is revealed immediately (it was in the trailer!)<br><br>But the very worst thing was that not one of the characters acted in a way that you would expect. Blomkvist was a spare part throughout and he decided not to publish! It would have been better to not have Erika in it at all given what she had to do. Gabriella Grane became a villain who died as soon as you realised she was and Ed the Ned was unrecognisable.<br><br>The idea of Lisbeth as a random vigilante who, throughout the film, even before the Balder saga, is Stockholm's most wanted, is particularly stupid.<br><br>** spoilers end **<br><br>Claire Foy is not bad, but is definitely less convincing as Lisbeth than Noomi Rapace or Rooney Mara. It's ridiculous that Mara says she wasn't even asked about reprising the role when she was the best thing in the last film and really committed to the role. Mara actually got piercings and shaved her head for the role, Foy by comparison looks like she can't wait to get back into her normal gear.<br><br>The other roles are so flimsy that it would be unfair to judge the actors, though I suppose Stephen Merchant did okay with limited material.<br><br>In summary, if you have read any of the books, please do not see this film. The Swedish adaptations of the original trilogy are infinitely better and even David Fincher's US remake of the Girl With the Dragon Tattoo is a masterpiece compared with this. If you have not read any of the books, please still do not see this film. It is a totally mediocre thriller, with no stakes, no drama, confusing motivations and no payoff.","user":"germaineaarnold","rank":[150,191]},{"title":"How did I hate this movie? Let me count the ways.","rating":1,"date":"5 November 2018","review":"1) Fantasy computer program that can only be transferred but not copied. 2) Fantasy computer program that can access and launch any nuclear weapons on Earth, regardless of country. 3) Incomprehensible motive for Swedish security service for commissioning theft of fantasy computer program. 4) Big neon flashing obviousness that the Swedish security police lady is in on it. 5) Secret criminal society in Stockholm that cuts off people's faces, and Lisbeth doesn't know about them. 6) Magical superheroes and supervillains using magical technology with lightning speed. 7) Production choices to put obvious information front and center so that audience of 10-year olds have no problem instantly comprehending. This starts with radio broadcast montage about Lisbeth doing vigilante attacks on men, and continues with obvious explication popping up on computer screens when characters are doing magically instantaneous research. 8) Police cars arriving at crime scenes choreographed to look like dancers entering the stage in Swan Lake. 9) NSA magical computer spy is a famous former hacker. 10) NSA guy gets bumped into in the nightclub, and everyone in the world except for him knows that something was lifted/planted on him. 11) Guy who created insane fantasy program to launch nuclear weapons put the passwords into the possession of his magical supercomputer-like 10-year old son. 12) For some unknown reason, villains know that little boy is key to accessing fantasy program. 13) Are security police goons all wearing the same tie, like it's a uniform? 14) Lisbeth survives gigantic explosion by outrunning flames to jump into bath. 15) When NSA guy goes to scene of exploded Lisbeth apartment, obvious bits and pieces of clues are there on the floor for him to find and audience to see, like a picture of him and Lisbeth's ID, and Swedish investigators just left that stuff behind for what reason who can comprehend, other than to serve up a steaming hot pile of explication for an audience of 10-year olds. 16) Lisbeth lets boy keep his phone, inexplicably, except so that the otherwise magically genius child can answer a call that looks like it's coming from his dead daddy and reveal his location to baddies. 17) Scene where Lisbeth is answering knock on door intercut with NSA guy going to place where he traced her call to, but surprise! they're in two different places. Never seen that trick before (more than 100 times). 18) Lisbeth steals a Ferrari in matte black paint color because she likes to be low-key.<br><br>That's all I can think of at the moment. But you get the idea.","user":"peterwcohen-300-947200","rank":[478,644]}]