[{"title":"Let me save you some time...","rating":3,"date":"12 August 2016","review":"They don't do it. Yes it's called \"Chasing Niagara\", but they don't actually go over Niagara Falls. They chicken out at the end. There, I saved you an hour and 20 minutes. You're welcome. I'm giving it an extra star because it was shot well and the scenery looked beautiful. Rich people traveling the world having a helicopter take hi-def shots while you kayak - rough life! I don't recommend this movie; There's really no point to it. Again, the scenery is beautiful and shot well. It's neat to learn a little about what they do. But I have no sympathy for people with money wasting time getting an adrenaline high while a helicopter films their attempts in 1080P hi-def.","user":"JackMillion","rank":[28,33]},{"title":"Incredible story and journey!","rating":10,"date":"3 July 2016","review":"Simply put, the best kayak film I have seen to date. It isn't a paddle porn flick as there is a really important moral undertone throughout the movie, although you will not be disappointed with the images captured. Rush Sturges and Co. you outdid yourselves as the production quality, the story line, and execution are unmatched. I think a lot of folks will be surprised. Well worth the 10 bucks.<br><br>I have seen some negative reviews as to whether the team runs Niagara Falls or not, let me finish by saying that it is not what is or is not run in this film but instead how they approach their challenges and decision making throughout. This is a great film for those who are pushing the upper limits of what's possible or even for those just getting started.","user":"whitewatertroubleshoot","rank":[9,14]},{"title":"Film should be called NOT Chasing Niagra","rating":2,"date":"12 May 2017","review":"Don't even waste your time watching this. I sat through almost 1hr 20mins just to have some idiot crap his pants in the last 5mins and chicken out of the challenge. I felt embarrassed for the total loser.<br><br>Why even bother to release this film if the main objective isn't even attempted? I have to ask myself did he ever intend on going over the falls, or was it just a good way to mislead the audience and make and market this film so that people would watch it.<br><br>Grow some bigger testicles Rafa Ortiz....","user":"bluebeatspecials","rank":[3,4]}]