[{"title":"Stupidest slasher film I've seen in a while","rating":3,"date":"28 March 2017","review":"So, first I'll describe the good things about this film. Some of the shots were brilliant, and the atmosphere, tension, and the excellent stalk-and-slash eighties feel of this film was very nice. Just a guy in a mask stalking some teens, very nice job.<br><br>Then we get to the ending and I was screaming at the screen. The heroine was a total idiot.<br><br>She burns him with a cigarette lighter for like five seconds, thinks hes dead, doesn't bother to pick up his knife and finish him off, and goes back inside the house into a room with no other escape and starts calling 911. Why didn't she get in one of the four operating vehicles on the premises and leave? There were FOUR cars on that lot, all working, and then when the killer corners her back in the house, she refuses to jump out the huge window beside her, and backs into a corner to meet her fate.<br><br>Honestly, that ruined the entire thing for me. The blond girl is also equally as dumb. She lies there and watches the car roll over her, instead of lying in the middle of the tracks and sliding under it.<br><br>If not for the stupidity of the characters, this would have been a great flick.","user":"landont-61-661045","rank":[15,20]},{"title":"This Movie SUCKS - About As Scary As A Dead Duck","rating":3,"date":"10 February 2019","review":"02/10/2019 Don't waste your time. There is no storyline, no scary parts and about as unrealistic as a crummy movie/script writer can offer up as a pretend I'm-A-Gonna-Kill-Ya but first let me bump yer car movie. SUCKS Bon Appetit","user":"fredgfinklemeyer","rank":[4,4]},{"title":"Too many glaring errors that can't be over-looked","rating":2,"date":"4 June 2016","review":"Another stereotypical slasher flick where, at the climax, the victim kills the slasher, BUT OOOOOOOOOOOOOH, he's not really dead (didn't see that coming did ya...lol).<br><br>Fortunatelly, the director was Politically Correct and made sure to have all the following PC crap on his check-list: 1. Hispanic girl is good 2. Gay friend is good 3. Jock boyfriend is bad 4. White male is an evil killer The only thing missing was a black female hero.<br><br>While all of this can be overlooked, the following glaring errors can NOT. Every driver knows that you exchange driver's licenses. If that had been done, the rest of the movie would never have occurred. The cake was drugged, but, the killer could never have known that the victim was going to have her friends over and eat it. Finally, the killer kills the electric off in the house miraculously while he's standing in front of the three friends.<br><br>If the producer can't work-out these simple errors, he should not be making movies.","user":"mitchellfinesod","rank":[29,50]}]