[{"title":"The Mysterious Stranger","rating":9,"date":"9 September 2019","review":"\"Beach House\" is a crisply written, low-budget film that tells a yarn about a young writer's imagination, as she prepares a novel. Emma is a college student spending time in a remote beach house with her parents who are visited by a mysterious stranger. The man named Paul is an old flame of her mother. The characters' interactions form the basis for shaping Emma's novel.<br><br>One clue to the filmmaker's idea for the film comes from the detail of Emma reading Theodor Fontaine's novel \"Effi Briest.\" The novel has a loose connection with the story of \"Beach House\" with the lurid romance and the bohemian side of Berlin, which Emma plans to visit.<br><br>One problem with the film is the lack of clarity between what is occurring between Emma and Paul in their nocturnal visits and what proportion of the narrative is from Emma's imagination. How much of Paul's visitations is real, and how much is taking place in the mind of Emma the writer?<br><br>The acting was good in the small cast, especially the chemistry between the demure Emma and the wise-cracking, jovial, and lusty photographer Paul. With the strange circumstances of the fate of Paul as depicted in the film, Emma has to be wondering what might be the real-life consequences if she ever publishes her novel.","user":"lavatch","rank":[6,6]},{"title":"Beach House...the end.","rating":2,"date":"1 March 2019","review":"I downloaded this film last night, and just finished watching it. Nice looking beach house, nice looking white people, incredibly nonsensical story....the end.","user":"whitemanfromtowne","rank":[8,12]},{"title":"This is slow...but not boring","rating":8,"date":"10 January 2020","review":"This won't be for everyone. I like quiet deep slow movies as long as they can hold my interest. You def have to be in the mood for these types of films though. If you aren't feeling in that kind of mood you'll most likely not appreciate the movie for what it is. As one reviewer stated \"they were won over in the end\" and I'd have to say that's true for me too. Really it's only in the last part of the movie that it kind of picks up the pace and becomes interesting but when it does it becomes worth the wait.<br><br>First off I loved the setting. I loved the house and the tranquilness of it. The music def set the mood. It matched perfectly with what you'd imagine an intellectual getaway beach house experience would be like-reading, relaxing, privacy, good healthy fresh food and a beautiful house tastefully and artfully furnished. You feel as if you are there with the characters. I love the beach and have always wanted to live on one. I could never quite picture how exactly I'd want my dream house to look like but after seeing this film if I did come into money I'd show the architects and builders this film and tell them to build an exact replica. It was perfect. So serene.<br><br>I am not familiar with any of the actors except for the daughter. I had seen her in another movie and I did not care for her character in that at all but in this one I really did like her character and I can definitely see now that she has a lot of range for an actress. She really caught the essence of a young college student coming into her own who is becoming aware of her sexuality and the power that can have over others. She did a great job portraying the naivety that young women can have when it comes to older men. They think they're intriguing and interesting and desirable when all the man is thinking about is how he can charm his way into taking advantage of them.<br><br>I really liked the step-father. I'm sure some might think he was boring and non-expressive but he really perfectly portrayed the well to do artist personality. He was quiet and introspective but wise, insightful and not as clueless as he first appeared. I'd like to see him in a series as a regular so I hope he keeps getting work. He has a lot of depth.<br><br>We aren't really shown or told beyond a shadow of a doubt that Paul killed Willa. It's strongly suggested and that is what most of us would infer AND if they had done forensic testing of his car I'm guessing they could have found stuff but since they were dating that could be easily explained. Also since he's a photographer with a penchant for violent disturbing photographs intended for shock value the argument could be made that even if her body had been in his trunk...it could've been staged for a photo shoot. Not sure what the daughter suspected would have held up in court. So...while he most likely did kill his girlfriend...there is the slight possibility that he was just playing into the daughter's thoughts and fantasies.<br><br>If you are getting tired of stupid movies with dumb dialogue with nothing but guns and violence or ridiculous situations that would never happen-give this a go. I'm still ruminating over it after it ended.<br><br>Oh and by the way to the reviewers who suggest that anyone giving this higher than a 3 are associated with the movie or haven't done any reviews before...I am not connected to the movie in any way and I think I'm getting close to about 300 reviews so...my review is legit.","user":"apryla-58795","rank":[2,2]}]