[{"title":"very good indie movie","rating":6,"date":"25 December 2019","review":"Sometime parallel universe movies try to do to much leaving the viewer confused and with a lot of questions in the end.<br><br>This movie was not like that. It kept everything fairly simple and the story line, although a little predictable, kept me interested throughout.<br><br>The acting was done well and I very much enjoyed this quirkly little gem<br><br>6.8","user":"natcalgary","rank":[3,3]},{"title":"A quirky, heartfelt comedy","rating":8,"date":"24 December 2019","review":"Motke Dapp brings his film to life with a joy and excitement you can feel; you can tell he's having a blast making this.\nAlthough the plot is fairly straightforward, the extensive use of locations makes the movie feel bigger than the sum of its parts.\nKris Wente brings the downtrodden Diggsy to life with relish, but it's Sara Antonio who steals the film with her multiple takes on Suzette; Antonio fills up each new variation with its own unique quirks.\nOverall, a solid rom-com.","user":"ijstratton","rank":[3,3]},{"title":"A movie with a big heart","rating":10,"date":"18 December 2019","review":"This is such a great movie. I didn't know anything about it, I saw the title, liked the design aspect, font used in the titles; and read a short synopsis then dived in. A completely satisfying journey through parallel worlds with a hopelessly romantic man chasing the alternate version of woman of his dreams. In other hands this would not have worked. It had to have an ensemble cast that worked well to cover the myriad changes of worlds, and it was pitch perfect. Beautiful performances from them all. It helps of course to have a well written script and hip dialogue. I can imagine if this was given a big budget and big studio backing this would have ruined it. It has a soul that is very rare in movies. A terrific soundtrack too, and the music aids the transition between worlds and adds an emotional backdrop. I really can't speak more highly of the film. It's right up there with the best of Billy Wilder but really is incomparable to any other director. It has such pathos and an honesty and love, that is just absent from any Hollywood film of the 21st century I can think of. I've been raving to my friends about it, which I don't think I've ever done. Absolutely fantastic. Heartbreaking also to see that the film was dedicated to the memory of Brittany Belland one of the principal actors in the film. I shed a tear over that. Please let this movie into your life and feel it's life affirming goodness.","user":"paulbattenbough","rank":[3,3]}]