[{"title":"Terrible waste of time","rating":1,"date":"9 August 2016","review":"I feel sorry for anyone who thought this drivel was any good at all. The dialogue sounded like it was written by grade schoolers, the acting is amateurish, and there is absolutely no plot. Typical of crappy movies, most of it was filmed in the dark to hide the glaring deficits of this disaster of a movie. The story is so terrible that most of the dialogue makes no sense at all and I have absolutely no idea what the main character was doing at the end. The entire time I had this on I wanted to turn it off but I kept thinking there's no way a movie can be as bad as I thought it was, so I kept waiting for some redeeming value, but it never came. Just regret. This was a terrible mistake.","user":"madwand6","rank":[8,8]},{"title":"Awful Mess","rating":1,"date":"27 November 2016","review":"A viewer should not spend his time watching a film rated 2.1 in IMDb. Time is irreversible and once lost, cannot be retrieved. However I decided to give a chance and see \"Forsaken\" to check whether it would be so bad. The film has just ended and it is worse than its rating. I have no idea what the senseless story of exorcism is about and what are the motives of Paul, his wife, his daughter, her friends, the doctor and the locals. Therefore I am incapable to write a plot summary since the story is not possible to be understood. In addition, characters come and go, thrown on the screen without any previous development. The lead character, Paul, is a complete mess and it is impossible to know what he is doing in the film. The conclusion (is there a conclusion?) is a joke so terrible it is. My vote is one (awful).<br><br>Title (Brazil): Fortunately it is not available.","user":"claudio_carvalho","rank":[7,7]},{"title":"Ignorance is bliss!","rating":1,"date":"13 February 2016","review":"I thought to myself, wow this film really isn't as bad as everybody has been saying! Then I realised I had just woke up and the damn thing was still playing. Indeed, to escape the awful film I had to create my own entertainment at the back of my eyelids, which was very enjoyable I might add. 8/10. I am a fellow horror fan and thought that the overall premise seemed reasonable and thus I gave it a shot despite the reviews and ratings. The acting in most parts was generic and resembled to me how most people talk the morning after inebriation. I am usually sympathetic and try to be open minded about film and actors as I somewhat generally understand how much work goes into making one however this felt more like an effort for those involved than a labour of love, from directing and cinematography through to acting. Well that is my first review ever completed. I just felt compelled to have a little moan ;P","user":"karlmarsh","rank":[14,17]}]