[{"title":"Ayyyyy","rating":7,"date":"9 June 2017","review":"Rainbow Time begins as a pretty lighthearted comedy with some dramatic elements. The second half relies more on drama with some minor comedic elements. The first half is more successful, but it still works overall. The characters and plot are off-beat and keep the viewer interested enough to want to see how the characters develop throughout.<br><br>The film relies heavily on the acting ability of the three leads. Luckily, all three perform excellently and play their roles almost flawlessly. Rainbow Time does not try to be something it's not - it tells a pretty simple story about some simple people with common problems. If you like any of the lead actors, give it a shot.","user":"xposipx","rank":[4,7]},{"title":"Overlooked, but Hopefully not for Long...","rating":9,"date":"13 April 2018","review":"Seeing the 'Duplass Brothers Productions' flash on the screen before the film stirs up more excitement for me than when I see A24. Film... TV... They have their hands in the weirdest, most obscure productions that leave a massive imprint on the world of Celluloid. Love em or Hate em, they always make me feel something and they always come correct with the originality. Great work here! <br><br>Linas Phillips directs, produces, writes... Turning one of those 'uncomfortable truths' in life, that we admittedly love so much, into something organic and introspective. This film somehow escaped my radar, as I was extremely surprised to see the 2016 Release Date on a film that popped up on ISIA in 2018. This definitely feels like a must see!!! Hopefully 'Rainbow Time' finds it's rightful audience sooner than later!","user":"FightOwensFight","rank":[3,5]},{"title":"Extremely underrated!","rating":8,"date":"27 February 2018","review":"I usually not big fan of \"romantic comedies\" and \"slice of life\" indie films. I'm also critical about films that use mentally challenged characters to gain sympathy from they audience. But this one did not do that, and it was great!<br><br>It's not perfect, but it is really awesome!","user":"kp-9mm","rank":[3,5]}]