[{"title":"Pfeiffer is powerful, the film dark.","rating":12,"date":"12 April 2018","review":"Where is Kyra? the title asks. Ostensibly she lives in Brooklyn, but her real location, for the purposes of this low-lit, depressing mise en scene, is the interior darkness of a middle-aged, jobless, depressed woman (Michelle Pfeiffer). Aided by Oscar-nominated Bradford Young's shadowy cinematography, director Andrew Dosunmu crafts a near perfect outward evocation of the spiritual loneliness of a woman who has recently lost her mother.<br><br>As her life spirals downward spiritually and financially, Kyra finds some solace in the arms of neighbor Doug (Kiefer Sutherland), a part-time job slacker, who tries as much as he can to comfort her even though he is marginalized by the film's lighting and proxemics. Kyra is desperately alone in a city that forgets about the aging, like the recurring motif of the elderly lady with the cane.<br><br>A light larceny is forcing itself on Kyra, and who can blame her? Her credit cards have maxed out, and the job interviews have led nowhere. Although this is not a real thriller, enough of the noirish urban danger bleeds through to confirm the despair so many down and outers must feel in that unforgiving world on NYC and its burbs.<br><br>Pfeiffer should be recognized for her remarkably restrained and deeply-felt role. Unfortunately, writer Darci Picoult has little dialogue for her, and the lighting is the most powerful vehicle for the despair of urban loneliness and poverty, poverty porn if you will. <br><br>Where is Kyra? has a European feel in its languor and an American vibe in its class inequality. It's solid fare for cinephiles and those who need an antidote for their optimism.","user":"jdesando","rank":[31,38]},{"title":"Pheiffer & Sutherland Are Superb Here But the Film is Definitely Not For Everyone","rating":7,"date":"4 July 2018","review":"Michelle Pfeiffer and Kiefer Sutherland are superb here, but this film is definitely not for everyone. The filmmakers make it a most difficult watch with many darkened scenes often shot from afar, very slow pacing, extremely irritating music at times, and a constant depressive tone.<br><br>However, if one can stay with this haunting drama the performances by the two leads are worth the price of admission, as I see it. At least it had an appropriate ending and not a totally convoluted one that are so in vogue these days.","user":"larrys3","rank":[21,28]},{"title":"Beautiful in the Dark","rating":9,"date":"10 July 2018","review":"\"Where is Kyra?\" - not just a film featuring one of the best performance from Michelle Pfeiffer, it's also one of the best movies she ever done in her entire career (At least the best since 2002's White Oleander).<br><br>Michelle Pfeiffer plays Kyra Johnson, a middle-aged, divorced woman who recently lost her mother and struggling to survive. The movie is stylishly directed by Andrew Dosunmu, It's the type of role we always want Michelle Pfeiffer to play-fragile, vulnerable, heartbreaking, yet also a life fighter, it has been ages since Michelle plays someone so real and solid like Kyra. <br><br>Despite the atmosphere of the film is overall depressive and chilling (the director treats it almost like a thriller in the second half of the movie), the love line between Kyra and Doug is extremely romantic.<br><br>\"Where is Kyra?\" is not something fun to watch, but it absolutely worth your time for an 1 hr and 38 mins character study of Kyra Johnson, with top class performance by Michelle Pfeiffer on screen every mins, and every mins of her on screen is a real treasure.","user":"Morrisseybond","rank":[10,14]}]