[{"title":"Not a comedy in any way even though there is a few laughs.","rating":7,"date":"10 March 2020","review":"This movie does have a few funny elements due to some clever writing and subtle acting moments between the leads but it is in no way a comedy. It is mostly a drama with a bit of mystery and romance. It's hard to really review this movie without any spoilers, but it does unfold organically, the acting is well done as is the cinematography. There's some very dark themes here and a heavy dose of what any one of us would do in this given situation. It can also be quite sad at certain moments. There is a little spicy language here and there but no overt violence or nudity.<br><br>Overall a very well executed enclosed film that keeps you guessing what will happen next and overall offers closure without just dropping it in your lap. It kept my attention the entire way through, just keep in mind this is far heavier on the drama and mystery than comedy or romance.","user":"terrencepatrix","rank":[20,26]},{"title":"Uncomfortable and so many questions but still a really good watch.","rating":7,"date":"12 March 2020","review":"I love a film that leaves you with questions at the end and this is full of questions and I'm ok with that.\nI really disliked the main character and his friends and felt sorry for the guy in the basement but that's ok too.\nGreat performances, great story and nicely edited and directed.","user":"future_release","rank":[4,6]},{"title":"Great story combined with great performances from Chris Marquette & Manny Montana - this is a must see!","rating":9,"date":"20 March 2020","review":"Not a long review but I had to leave this. I came across this movie knowing absolutely nothing about it and from the beginning I was glued to the screen. Rarely does a movie catch me like this as I am usually working or playing video games while a I have a movie going. I think it helps with my ADD &amp; Narcolepsy. The slow and quiet pace of this movie combined with a slow but steady build up to some big surprises. I won't tell you any more about but the performances from the 2 lead's were amazing. I've never heard of either of these actors but i will be following them now to see what else they can do! The ending delivers proper closure to the story and will not disappoint. Watch this movie! 9/10","user":"feverish30","rank":[2,3]}]