[{"title":"Beautiful agony","rating":9,"date":"4 May 2017","review":"This is a semi-dramatized documentary focusing on retelling the audio memoirs of a man going blind. If that sounds slightly unusual, it's because it is. The cast lip sync the actual recorded words spoken by John Hull and his wife who detailed his descent into the debilitating world of visual impairment in the 1980s.<br><br>The memoirs capture the pure physical and psychological turmoil experienced by John as he experiences this loss of vision, and as he says he battles to live in reality instead of this nostalgic world that his brain is forcing upon him. The dreams he experiences and the way he describes them are beautiful bittersweet torture - as it is his only way of conjuring new images into his world, yet he wakes every morning crestfallen, as he remembers he cannot see, and they were just dreams. One night he dreams he can see his new child that was born after he lost his sight. The way this scene is directed (by Peter Middleton &amp; James Spinney) is as magical as it is emotive.<br><br>John expresses to us that he believes part of his brain is dying as a portion of it no longer requires power to process images. He says he feels hungry for stimulation that he just cannot obtain. He also forgets what his wife looks like, which must be pure agony. The frustration of being rendered effectively useless as a parent also weighs heavily on his mind, and some points on the audio tapes you can almost feel the depression that John must be battling.<br><br>Dan Renton Skinner does an unbelievable job as the taunted John Hull. His facial expressions transport us into this hell that John must have been in and his performance is one of the most captivating of any portraying an illness / disability that I can remember.<br><br>I couldn't wait to splash down a few words about this film in the hope that just 1 or 2 people watch it as a result. That has to be a sign that of its' quality.<br><br>Beautiful agony","user":"Smallclone100","rank":[7,7]},{"title":"Words will not do justice","rating":10,"date":"18 February 2017","review":"I want to shower praise on the director, actors and everyone involved in this film. But this magnificent meditation exceeds the sum of its parts. If you tackle your life head on. If you question the relationship between your senses and your awareness and, indeed, what that might imply about what you are. If you appreciate the right amount of silence, and delicate, subtle cinematography. If you are moved by music that infuses the narrative with a thoughtful atmosphere. If you respect originality of technique in an industry that is struggling with habit. If all of these and then that ineffable magic of something greater, then please, experience this.","user":"manuelortega-57740","rank":[14,16]},{"title":"Interesting way of blending truth and \"fiction\"","rating":6,"date":"8 October 2016","review":"I love the concept behind these. Using actual tapes, editing them together in a way to present them as a narrative, and then creating the visuals to match it. The fact that it is a story about a man who no longer can see, adds to it. It's an interesting way to mix truth and fiction, because the story and dialogue is all real, and could have been presented as a documentary of sorts. But by editing them, adding the environmental sounds, and getting actors to \"play it out\", it blurs the line in a really interesting way. That, in addition to some of the insights into how it is to become blind, are the clear highlights of the movie. Sadly, it does not have much more to offer that's very interesting.<br><br>In a way, ironically, I think this story would work better as just the audio. The editing done was brilliant, and combine with the atmospheric sounds added, I think it could have been a really good radio story. With an added level that a story about blindness would have no visuals.","user":"peefyn","rank":[12,14]}]