[{"title":"Some films are so bad they are good; this isn't one of them","rating":1,"date":"23 September 2017","review":"Cowboy cliché after cowboy cliché. The lead is a 3 rd rate Clint Eastwood and ever other character, from the saloon whore with a heart of gold to the wicked black hearted mayor, has less life than the stage props. How many farm girls in the West fed chickens in full make and a clean dress?","user":"tom_sykes-52088","rank":[27,31]},{"title":"I watch anything, even this movie","rating":1,"date":"15 October 2017","review":"When they tell me, a movie is bad, i think to myself \"Let's see how bad it really is\"... Well if there is \"A\" class Actors there should be a \"A\" class movies, this is not one of them. With the exception of Stephen Lang, the acting is awful, also it is even harder to believe if the actresses look with so much work done on their faces, and the hair cuts and costumes look new, freshly done, freshly ironed, so clean, so neat, it seems more like a Hollywood costume party than a old western story, you won't believe any of the actors everything looks staged, the photography didn't take advantage of the lighting. If you are like me I know you will watch it, but you've been warned. This movie has the acting, costumes and photography of a Porn.","user":"luisfveloz","rank":[18,22]},{"title":"How bad is bad?","rating":1,"date":"21 October 2017","review":"I kept asking myself, \"Is this a comedy?\" No, a comedy would be more entertaining. I had to conclude this was not an attempt at parody. I am thinking that the people responsible for this unbelievably ridiculous, half-baked insult to the cinematic arts were actually serious. I'm sure they were junior high school students with a lot of money. The characters are thin, stereotypical shadows of archetypal heroes and villains and damsels in distress. The sophomoric story and never developed plot will leave you embarrassed for the poor souls whose names appear in the credits. The scenery was pretty good, though.","user":"pathopperlpc","rank":[12,14]}]