[{"title":"I'm a straight white 40 yr old male, married with 3 kids, and I loved this movie","rating":9,"date":"15 July 2018","review":"I knew nothing about this movie before I watched it. My wife heard it was great, gave me a brief synopsis of what it was about, so I said sure why not. I planned on catching up on some work emails while it was on in the background.<br><br>Holy shit - I loved this flick. I thought it was awesome. I'm a sucker for romcoms anyway, but this movie had me laughing hysterically at points, then tearing up at others. Also, I didn't get any work done - my eyes were glued to the screen.<br><br>The acting was fantasic - the kid that played Simon was so likeable. His parents were so fun to watch, and that speech his Mom gave him made me fight back some tears. The soundtrack was great, the pace was perfect, and it was just a fun damn movie to watch.<br><br>Now, mind you, I'm a middle aged white dude, married with three little girls, who leans Republican, and voted for Trump. Say what you want... this was a great movie.<br><br>Trying to raise my girls in this world, they are young and don't know the social difference between race, sexual orientation, religious beliefs, etc. My point is, I think this movie is important, and when they become old enough, I want them to see Love, Simon, not as a \"gay\" movie\", but just another romantic comedy that happens to have a main character who is gay and is trying to find himself. That simple.<br><br>Love, Simon, in my opinion, will go down in history as a great/memorable teenage flick like \"Say Anything\", \"Reality Bites\", \"Can't Hardly Wait\", etc.<br><br>A fun, well acted movie, with awesome music that made me laugh, cry, and really root for the main character...who just so happens to be gay. And in my mind, and hopefully my kids' minds, is as normal as anything..","user":"shorrockpeter","rank":[171,201]},{"title":"This movie is more important than you think","rating":10,"date":"15 March 2018","review":"I had to see this movie. It reminded me of...me. I had a lot of great friends in high school. I had girlfriends. But I had one huge ass secret. I was gay. I didn't have the strength to come out in high school, but God did I want to. I graduated in 93' so things are much different now, but still very scary to come out I'm sure. I am out now and my life has been different ever since. Better ever since. I did not lose a single friend when I came out. I gained a new family of friends. I encourage anyone younger, or older, that is not out to do so. BUT, only when you are ready. You'll know when the time is right. <br><br>This might just be one of the most important movies of the year. I believe there needs to be more movies like this. Being gay is HARD enough and kids commit suicide far too often dealing with it and other issues. Everyone deserves to love. Everyone deserves to be happy. Please go see this movie! Peace!","user":"pensacolacomputer","rank":[455,572]},{"title":"\"You get to exhale now, Simon\"","rating":10,"date":"1 June 2018","review":"I finally watched this and it was perfect, this is beautiful, and very necessary!\nMy favorite scene was by far Jennifer Garner's speech, that if you watched the movie, you probably know what i'm talking about.\nThere's probably just a few little things I didn't like, especially some of the classic topics and stereotypes that this genre of film usually has, but still, it's amazing.<br><br>We need more films like this. Fun, heartwarming, and just fantastic all around!!<br><br>Also, a reminder if this wasn't enough: Be yourself. Be happy. You deserve it.","user":"Tomas_buffay","rank":[175,226]}]