[{"title":"Big Budget \"C\" grade movie","rating":1,"date":"16 January 2018","review":"Direction - direction with no definite vision....Execution of the film is totally based on delusions of grandeur.<br><br>Screenplay adaptation - it fails to become an explorer's journey with thrill &amp; suspence.\nIt fails to become typical B grade monster movies with chase, plastic gore...like anaconda &amp; Jaws...which were 100 times nore entertaining.\nIt fails to become an action , adventured pack fantasy....into which the audience can actually immerse themselves.<br><br>It succedes to become a complete mockery of itself...as the housefull audience was actually laughing at many scenes...people were laughing at it's pretentiousness &amp; superficial theme park like experience ( from point A to B of the map) ...and at the themepark like obstacles that has been cheaply catered.<br><br>Acting - Dev isn't the only who ruined the film.David James who played Marco Florian &amp; Svetlana Gulakova as Anna Florian also contributed in ruining the film.... David James with his hyperactive, restless, histrionic personality &amp; maniac laughs....Dev with his expressionless monotony....and with their collective ultra fake accents.<br><br>Dialogues - No dialogues to some poorly writen one...as kids when plays with \"dollhouse\" or \"pirates\" converses with more realistic manner...in more accurate ways...with more convictions.\nIt doesn't matter wheather it's multilingual film...stupid &amp; cheesy dialogues writen/translated in/into any language would sound stupid &amp; cheesy.\n\"Ana my darling daughter...(histrionic expression)...haahaa(maniac laughs of David James)...ohh..my dear daughter..haahaa(maniac laughs again)\".<br><br>Cinematography , Vfx - amazing locations, good cinematography...with very back dated CGI ( though I can understand the budget of a bengali film)...but repeatative use of those lame CGI action sequence contributed more or less nothing into the storyline.\nSo the movie became just \"Props with out a Play\".<br><br>Production - To make a big budget film like these you need courageous production company...who can make this crap of a movie with confidence (arrogance)....and then can sell everything with created hype.\nAs It seems the production has recovered the money they've invested...with all these multilingual, star casting , christmass release... They should spend more with movies with content (good story line).... where audience will not be dissapointed as such as this.<br><br>I'd conclude by saying this....that this isn't a movie for Dev fans...this isn't a movie for fans who love watching hollywood action, adventure fantasy....This isn't a movie for cinephile like us who loves watching world movies....This only can be a Home Video for Kamaleshwar Mukherjee.","user":"tuhinind","rank":[20,22]},{"title":"Watch yourself and then decide!!","rating":2,"date":"2 December 2018","review":"I do not understand how some people have rated it 8/10 stars!\nThe last movie from the franchise was a much better effort . I completely agree that the novel although written so long back was so illustrious that it would have been a very tough task to do justice to it!<br><br>But then why try such movies and make a laughing stock of yourself! Every CGI looked childish and all animals in the movie seemed like from a cartoon movie--Bengali films still do not have that kind of budget that they can spend on such gala CGIs. Obviously the result was childish --the scene where a snake was on the hero's body seemed to just pass through him!<br><br>And dont let me start on the pumas and the anaconda!<br><br>ACting was pure trash! Dev has improved a lot recently but here he again threw off hsi towel!\nThe foreign male actor, David, I assume, however should win a prize for over acting!","user":"mukhopadhyay-arka01","rank":[5,5]},{"title":"Bad Movie in every aspects","rating":1,"date":"19 August 2018","review":"Totally wasted my time.... Poor acting and storytelling no destination at all... Stop making these kind of silly adventure movies. It could be better if cast is different specially the lead actor who played the role of a \"Wood\" in the movie","user":"sanchiluvu","rank":[9,11]}]