[{"title":"Who wants to see something gross and utterly senseless?","rating":4,"date":"10 April 2017","review":"In case you are - like me - a lazy person who solely selects movies based on the title and poster images, chances are fairly high that you'll assume \"Tonight She Comes\" is a good old-fashioned throwback 80s slasher. Well, if it's a slasher you seek, than you should certainly not watch this movie! Everything looks promisingly familiar during the first 15-20 minutes, with a remote lakeside cabin setting and the introduction of four lead characters (2 guys and 2 girls) that are dumb, horny and basically just begging to get slaughtered in the most painful ways imaginable. They indulge in mindless sex and alcohol, although they should be looking for their friend Kristy, the girl who owns the cabin but is nowhere to be found. Then, suddenly, \"Tonight She Comes\" turns into a bizarre and disgusting mixture of body-horror and demonic possession flick, but unfortunately it's nothing even remotely resembling the original \"The Evil Dead\". Kristy does return to the cabin, butt-naked and covered in blood, but she apparently has a different type of rancid party in mind. As it turns out, Kristy was the victim of some sort of satanic ritual that a deranged father performed, together with his son and daughter, in an attempt to resurrect their dead mother. To make it things even crazier, the son (Philip) and daughter (Felicity) revolt against their psycho daddy and team up with the dumb kids. Admittedly all this doesn't sound half-bad, and \"Tonight She Comes\" easily could have been a decent horror sleeper, if only it wasn't filled with imbecilic and irritating defaults. Writer/director Matt Stuertz seemingly improvised the script whilst he was filming it, because 98% of the events are sheer random and utterly senseless. The character say or do things that are entirely against human nature, but that appears to be the standard in low- budget horror nowadays, and the film is full of continuity errors. For instance, except if the moon shines particularly bright in these parts of the woods, there are constant goofs with the daytime/nighttime switches. It's dark when they battle Kristy outside, but when they try to keep her locked out of the house five minutes later, bright sunlight shines through the windows of the cabin. Another thing Stuertz should consider in the future, if he intends to continue making movies that is, is perhaps hiring a more professional editor, as his own work is this section is badly amateurish and pitiable. \"Tonight She Comes\" certainly delivers in the blood &amp; gore department, but it is bloodshed of the most gratuitous and repulsive kind. The film is quite gross without ever being able to genuinely shock or frighten. Remarkable though, even if not a slasher, the best death scene of the entire film is a blatant copy/paste of one of the cruelest kills of Jason Voorhees in \"Friday the 13th\". I believe it was in part VI (\"Jason Lives!\") that he pulled the trick with the sleeping bag and the tree before.","user":"Coventry","rank":[37,53]},{"title":"One of the strangest films I can recall seeing","rating":6,"date":"19 July 2017","review":"You know that feeling when you finish a film and you think to yourself, what the hell did I just watch? There may never be a truer case for thinking that than after 'Tonight She Comes'. This movie is utterly bizarre. In a good way, you ask? That's a tough question to answer. It's a film that is very hard to get your head around how much you actually enjoyed it, because again you aren't entirely sure what you just saw.<br><br>What was the object of the film I would ask myself? Was it to be scary? If so, I'd say it was middle of the road. There were some genuinely creepy moments at times, but the overall theme of the movie didn't seem like it was trying to frighten you. There are no jump-scares that I can remember, for example (a good thing). Was it to be gory and gruesome? On that one I think you'd have to issue it a check mark. There are some goings on toward the end of the film that I actually had to turn away from. I'm generally pretty comfortable watching most things you put on screen, but this was tough to sit through. Or finally, was it simply trying to be as bizarre and unique as it possibly could? Again I think you'd have to issue a check mark. This is a film pretty unlike anything else. I can't even think of a film to compare it to.<br><br>So even though I didn't exactly enjoy 'Tonight She Comes' overall that much (it certainly had its moments though) I think whichever way you look at it the film pretty much achieved what it set out to, and for that reason should be applauded. It's a tough film to recommend to people (because I honestly have no idea whether they would love it or hate it), but I can say you likely won't be bored by it.","user":"jtindahouse","rank":[16,21]},{"title":"Truly Brutal","rating":5,"date":"7 June 2018","review":"Have not seen many movies that made me want to retch; but in a good way. So over the top its quite hard to believe they actually drank Jammy Rag juice - nasty but nice!<br><br>Very over the top movie - The gore dial has been turned past the max mark on this one - a good old homage to many of the old classics mixed into a blender of John Carpenter 80's Synth riffs to produce what can only be described as complete insanity but still a helluva lot better than some of the total trash high budget affairs being made by hollywood.<br><br>Watch it at your peril!","user":"omendata","rank":[7,8]}]