[{"title":"Very impressive. Surprised they did not sugarcoat the message more","rating":7,"date":"25 February 2016","review":"It's an animated kids movie, but it has lots of elements everyone in the family can enjoy.<br><br>Really like the character design of the animation. Very unique and artistic, plus in help to create even more individuality in a group of kids that are already individuals. There is a kid that everyone can relate to in this film. <br><br>I was a little surprise how clearly the adult themes about war came in through this movie. I never seen that done before, it was so obvious and added a dark element usually not scene in a kids movie, but it's real cool, cause the film takes into account how smart this generation is and how aware they are of the world around them.<br><br>Would highly recommend for anyone looking for a good children's movie to sit thought with the kids.","user":"subxerogravity","rank":[16,20]},{"title":"Innocence of youth","rating":8,"date":"15 December 2018","review":"Mom and I watched this movie last night. Cute film.<br><br>When I first read the synopsis I was surprised and pleased to note that this was a reboot of La Guerre des Tuques (the Dog Who Stopped the War), which we had been made to watch back in my elementary school days as part of our obligatory French Immersion process by the QC government, and despite that, had still enjoyed.<br><br>This reboot is just as good, if not better, when it comes to ensuring all-ages enjoyment.","user":"eternal_vibrations","rank":[3,4]},{"title":"Best Cartoon of 2015","rating":8,"date":"25 February 2016","review":"7.9 of 10. Not that 2015 had much competition, but this is a well-thought out story based on a book. Both family friendly and something parents will enjoy watching with all their kids.<br><br>The one drawback is the ending tries too hard to make a happy ending out of a tragedy, probably because it's intended for kids for the most part. I wonder if it's even allowed to make tragic films intended for kids, some sort of secret rating rule.<br><br>For the most part, this is one big allegory made into a tightly integrated cartoon involving kids, snow, and building snow forts. There's a little romantic tween interest going on that should keep teens interested. Importantly, it's not forced and a vital part of the story.","user":"in1984","rank":[7,16]}]