[{"title":"Builds suspense through silences","rating":9,"date":"15 October 2017","review":"Like a lonely, mysterious gunslinger from the Old West, a tall, slender rugged-looking man with a thick mustache comes to a small Bulgarian village near the Grecian border as part of a German work crew in Valeska Grisebach's (\"Longing\") Western. The man is Meinhard (Meinhard Neumann), in Bulgaria to work on a hydroelectric power station close to the village. He could be Alan Ladd or John Wayne, transported across miles and years to Eastern Europe to conquer the natives, except here the natives are family-oriented local residents who do not carry tomahawks. Alienated by their unfamiliar surroundings, the workers hang the German flag in their camp and mock the local residents whose language they do not understand.<br><br>One says, \"Everything's messed up here. It's just like traveling through time, going back to the past.\" Grisebach says that, \"It's very interesting when you have the chance to have empathy, but you instead have contempt, or a conflict, instead of identifying yourself with the other one.\" We can sense that a clash of cultures is inevitable, but we do not know in what direction it will go. Remembering the German occupation of their country during the war, the townspeople themselves are not eager to offer any welcome. Grisebach contrasts the uber-masculine posturing of the construction workers at the camp with the warm family gatherings in the town. With no musical score, the film builds suspense through silences and facial expressions that tell us what words cannot.<br><br>Meinhard is treated with disdain by the work crew boss Vincent (Reinhardt Wetrek), who exacerbates tension with the locals by flirting with a young woman out for a swim, an incident that borders on harassment. Though he claims that he is only there for the money, Meinhard is the only worker who makes an effort to bridge the divide with the locals. Finding himself alone on a country road, he hitches a ride with some villagers and begins a friendship with Adrian (Syuleyman Alilov Letifov), one of the locals. In conversation, Meinhard claims to be a member of the Foreign Legion with service in Afghanistan and Africa which they accept without question. While on a drive in the countryside with Adrian, Meinhard tells him that this is \"Paradise,\" to which Adrian replies in Bulgarian, \"We understand each other.\" It is never clear, however, what is really understood and what is not. Despite the growing closeness of the relationship between Meinhard and the locals, the difficulty in communicating adds to the tension which threatens on several occasions to spill over into violence. There is a dispute about water rights which the crew needs to mix the gravel, a confrontation after a poker game in which Meinhard wins too much money, and an incident when he gets in the middle of a dispute with mafia-like authorities. At one point, after being knocked to the ground, Meinhard asserts that \"Violence is not my thing,\" though, when asked about the planet, he offers his opinion that it is only the strong who survive.<br><br>Grisebach keeps our attention by drawing on anecdotal threads that complement the narrative. A white horse, whose custody is a matter of dispute, is injured when Vincent leads him to a mountain he cannot navigate; Wanko (Kevin Bashev), a young boy whose parents are in Greece to find work, is temporarily knocked unconscious when he hits Meinhard falling from a truck. Grisebach expresses her reliance on narrative spinoffs this way, \"It's really to find how you have this little plot point or a little suspenseful moment,\" she says, \"and then you create space, more space for atmosphere.\" There is plenty of atmosphere in Western, but where it is headed and indeed what it is about is a guessing game throughout. The film's well-drawn characters and naturalistic look and feel keep us engaged, however, until it erupts in a dance of humanity and one man's dream of a life filled with the simplicity of friendship and brotherhood.","user":"howard.schumann","rank":[31,38]},{"title":"Vulnerable Hero Venturing Across the Frontier Divide","rating":9,"date":"22 October 2017","review":"On the frontier there is always someone who ventures beyond their companions in understanding and empathy for different cultures. A group of German construction workers in the Bulgarian countryside encounters difficulties with the locals and the foreign terrain. Tensions escalate from miscommunication, misuse of resources, corruption, selfishness, nationalism, arrogance and more. Meinhard, one of the Germans, becomes increasingly amiable with the locals. He attempts to understand their culture and ways, shares his knowledge, teaches a kid to ride a horse, helps with little tasks and drinks rakia (local liquor) late into the night with his new companions. Many among the Germans and Bulgarians do not like this. Even as Meinhard discovers solutions to difficulties and benefits to getting along, there are those in the shadows who want the divisions to remain and who believe that unless you eat, you will be eaten.<br><br>A compelling, wonderful and classical story of a vulnerable dreamer who dares to drift across the divide. The director maintained in the question and answer session after the film, that she places emphasis on what is going on inside the characters rather than any ultimate showdown. It is good that she does this, as it is truer to life. It allows the audience (me) to better identify with the characters. Non-professional actors were used in all the roles and the gamble worked, because the film felt more authentic this way. The director also maintained that she was not a micro-manager. She gave the actors space and the trust provided dividends. It makes me wonder why anyone, filmmaker or not, insists upon complete control. In advance of making the film, Grisebach lived in and learned about the area and its people, which turned out to be another good habit on her part. There were some beautiful shots of the landscape, and I wish there were more. Also, I wish there was a little more depth to the dialogue. Un Certain Regard (uncertain regard?) at Cannes. Seen at the Toronto International Film Festival.","user":"Raven-1969","rank":[21,27]},{"title":"No Cowboys Here, Just Uptight Europeans","rating":7,"date":"2 September 2018","review":"Watch the DVD extra interview with the German director, Grisebach. She says she grew up in W Berlin watching American westerns on TV and that this movie originates from that experience. Sorry, she's hallucinating. There's nothing here that remotely resembles an American \"western\" (her references: Ford and Mann). The title of this film, \"Western,\" is thus jive. <br><br>Like a post-modern, identity politics drone she talks about the \"closed-off masculinity\" of westerns. She talks of interviewing American construction workers and finding some connection between their \"closed-off masculinity\" and that of western heroes; I worked construction after college and can attest hers is elitist identity politics, fear &amp; loathing of healthy male heterosexuality, what her brain-washed ilk spurn as \"toxic masculinity.\" Sad: politically correct fascists like her have lost connection to common sense and the ground. <br><br>Despite this, fortunately, this film grinds out a slow-paced, compelling drama of distinctly European (not \"western\") tensions: Germany vs. everyone (Germany both as past Nazi invader and present economic boss), prosperous west vs. poor east Europe, and obnoxious urban industrial workers vs. pure, rural bumpkins. The unspoken issue is the identity of Europe in the face of immigrant invasion. The protagonist, an outsider who sports a thick \"Western\" mustache, bridges the gap between his peers, pig German construction workers, and humble, timeless Bulgarian villagers (and is attacked by both). The key moment, the \"truth\" of this film, occurs when a Bulgarian asks this wandering stranger what he's looking for.<br><br>Yes, the movie could have been shortened by 10-20 minutes. Yes, it could have benefited from closer integration of its theme, instead of meandering. Still, despite this, characters live and breathe, the details are right, and it held my rapt attention from beginning to end.","user":"ockiemilkwood","rank":[19,28]}]