[{"title":"there are only a few movies that make me feel as if I'm spying on the characters","rating":8,"date":"21 August 2017","review":"\"The Levelling\" is one such movie. Shot in a naturalistic style, it truly feels as though you're learning more about this family than you should. It doesn't star anyone recognizable, giving a sense of realism. The young veterinarian's return to her family farm opens the door to multiple revelations not only about the recent tragedies, but about things that have been going on for a long time.<br><br>Only a few movies have been this much like a knife in the stomach. another was \"The War Zone\", about a family that discovers an ugly secret. I recommend both movies, and I'm eager to see Hope Dickson Leach's next movie.","user":"lee_eisenberg","rank":[8,8]},{"title":"Bleak, if atmospheric","rating":7,"date":"26 October 2016","review":"Immediately before going to see \"The Levelling\" at the 2016 London Film Festival, I had watched on television \"Penelope Keith's Hidden Villages\", in which the actress travels around the UK visiting villages and glorying in their thatched cottages, cream teas and lovable eccentricities (Morris dancers, etc). \"The Levelling\" shows the other side of the rural coin...<br><br>'Clover' would be a good name for a cow, but dairy farmer Aubrey instead lumbered his unfortunate daughter with the name. As a young adult, Clover leaves the farm to study animal medicine, but just before her final examinations she is forced to return to deal with her brother Harry's suicide, Aubrey's simmering resentment, the farm's precarious financial position and the aftermath of devastating floods.<br><br>As Clover, Ellie Kendrick (probably best known for \"Game of Thrones\") delivers a variable performance: Clover's frustration with Aubrey's refusal to take her seriously is well-essayed, but the device of hiccoughing back the first word of a sentence in order to show bewilderment (\"What - what do you mean?\") grows old very quickly and at times Clover comes across as little more than a stroppy teenager instead of a capable, educated woman. As Aubrey, David Troughton does his best with the kind of antagonistic character he often seems to play, and Jack Holden is perfectly competent in the film's only other major role, that of Harry's friend James. The ultimate revelation of why Harry committed suicide is unlikely to surprise any viewer, and it is all very bleak - both the characters' situation, and the grey and damp farm in which they live. But the film is atmospheric, and if it turns up on television I might watch it again.","user":"euroGary","rank":[28,37]},{"title":"Well played yet dour","rating":5,"date":"30 December 2017","review":"A young woman (Kendrick) returns to the family farm after many years, due to tragedy -- her lone brother's apparent suicide -- and grapples with a difficult situation and a combative relationship with her father.<br><br>A very British film to me: fine performances from both Kendrick and Troughton both controlled and realistically playing their parts, moody well-shot rural scenes providing some atmosphere to the bleak world: yet also one exhaustively dour, thin on plot, drama.<br><br>It's clearly sincere in the portrayal of the realities of modern farming and rural life, which may well be it's main drive alongside the similar-yet-different father\\daughter relationship, but this left me cold.","user":"jonathan-harris17","rank":[9,10]}]