[{"title":"Towing the line","rating":4,"date":"6 August 2018","review":"22 Chaser is a low budget slow burn drama set in Toronto. Ben (Brian J Smith) is a honest to goodness tow truck driver. He does not cheat his customers. The tow truck drivers who chase accident spots at night are crooked as hell, taking the damaged cars to garages who offer kickbacks. They are even prepared to be a witness for you and tell the police that the accident was not your fault in return for payment.<br><br>Ben wants to pass values to his son who is being bullied at school that his own father taught him. 'Don't play with pigs because they like getting dirty and you'll only get dirty.'<br><br>When the owner of the tow truck company Ben works for claims he has won a police contract and demands his drivers pay a weekly rental for driving the trucks. Ben takes out a loan from loan shark, when the police contract is delayed, Ben falls behind in his payments and the loan shark's enforcer roughs him up.<br><br>Ben has to decide whether to live by his values or go down and dirty with the pigs if he needs to get ahead in life.<br><br>The film shows a grittier Toronto with a dark underbelly. The enforcer who beats up Ben is a police officer. The audience roots for Ben, he is a nice guy but he also comes across as naive, even stupid. Something his wife realises near the end of the movie which allows Ben to make his next bold move.<br><br>The pace of the movie from first time director Rafal Sokolowski is lethargic. In some ways the film reminded me of Nightcrawler. You have tow truck drivers instead of guerilla reporters scanning police radios and racing to get to a hotspot first. Both films look at the unethical side of life.","user":"Prismark10","rank":[12,21]},{"title":"Good Drama for a Rainy Day","rating":8,"date":"3 January 2019","review":"An unexpectedly decent drama to keep you busy while it's raining outside. Acting is good and the story flows.<br><br>A must watch if you enjoy a decent drama.","user":"grahammwiles","rank":[4,8]},{"title":"Fast And Far Less Furious, Eh","rating":8,"date":"9 January 2020","review":"Leave it to Canada to make a movie about tow truck drivers. But not so fast. In a country that spends have of the year driving through snow and ice, our tow truck drivers are the unsung heroes of the road. Moreover, this is a surprisingly sharp and compelling movie with genuine, thoughtful and gripping performances all around. \"Chasers\" are tow truck drivers who race to an accident scene to secure cars and get kickbacks to the autoshops they send them to. (If that seems unCanadian to you, it is. Actually, the tow truck industry is so regulated this practice is almost non-existent.) None the less, we take our drama where we can get it and it's rare to see a Canadian film that is unself-consciously Canadian. Although the lead actor (Brian Smith) is actually from Texas. It's also refreshing to see Toronto as the setting for this movie. Instead of trying so hard to be New York, the quaint, clean, decidingly less grim city backdrop somehow makes the action more gripping, stark and real. Admittedly, part of its charm is that '22 Chaser' doesn't try to be more then it is. It is, after all, a television movie. The result is a satisfying but tropey ending.","user":"SweetWilliam63","rank":[1,2]}]