[{"title":"the shadows of power","rating":22,"date":"22 April 2018","review":"The movie backstabbing for beginners is not half as bad as some reviews have it. sure it does not invent the diplomacy thriller anew, but its solid handwork, a good production and the sets were good too. i was a bit irritated by ben kingsleys constant swearing, it would not befit a real high diplomat to use such foul language in public all the time. overall is a watchable film about a young idealistic guy getting assigned to a supposed dream job. but sooner than he imagined, he is caught up in the confusion that any multi billion dollar program and high politics bring along. whom can he believe? is it possible for one man to make a difference in a fight against corruption and greed? see for yourself","user":"voigaswolpertinger","rank":[33,35]},{"title":"enough truth?.....","rating":7,"date":"22 June 2018","review":"Everybody knew this was a corrupt operation - I was in Baghdad in 97 and met some UN observers one told me when she went to the warehouses to check and they were empty, her bosses said to her \"shut up and take your money\"....there were some highly moral people hi up in the UN though like Dennis Halliday, Hans von Sponeck and Jutta Burghardt, of WFP who like the other two resigned. A very shameful time for the UN and of course the people of Iraq who still suffer to this day. This story needs to be told and the film should be pushed but it wont be...........","user":"joanc-40854","rank":[39,44]},{"title":"decent movie, heavy story","rating":7,"date":"2 May 2018","review":"As a movie the piece is nothing spectacular and as such might not capture the average movie fan but for us who like a movie based on real events this is pretty good, to me a true story based movie is almost always better than the fictional one. Before you go saying \"you really believe there are 100% true movies\" ill stop you right there, no, i do not, but you dont have to take the movie at face value it can inspire you to do your own research about the matter if you are interested. To be frank i dont think i (or you) ever actually heard a 100% true story, human memory is not 100%, rarely anything is, this was close enough to get the point across.<br><br>This was a very big scandal, there is a reviewer here on IMDB who stated it is a fictional movie and that he/she was actually involved in Food-for-Oil which was nothing but sunshine and rainbows. I have a hard time believing that. Why did the people involved fled, why did all those companies settled and paid enormous fines, just not to go thru a hassle of proving oneself innocent? I am sure there are very fine men and women in the UN who really try to help but any and every organization is susceptible to corruption and UN is no different, where there is power there is abuse of power. <br><br>I wish there were more movies that are doing scandals of the time past so we dont forget and dont let them repeat.","user":"connta","rank":[39,47]}]