[{"title":"Beyond making square pegs fit in round holes. Just nonsense!","rating":1,"date":"10 December 2018","review":"A completely ridiculous premise. Not even close to remote validity!<br><br>The author(s) use circular logic, non sequitur snippets from episodes, and additional irrelevant voiceovers and news videos trying to make their case, which scrambles your brain if you try to follow along to make sense of it! lol<br><br>Even interviews with some of the cast gave no support to the thesis, but was ridiculously and amateurishly presented to make you think so.<br><br>The only enjoyable part of this show was watching the videos of simple, silly fun this show was - seven friends and their adventures.","user":"rsvp321","rank":[20,30]},{"title":"unfunny pseudo-intellectual nonsense","rating":2,"date":"27 June 2019","review":"The thrust of The Gilligan Manifesto is simple. There aren't several layers that need deeper and more complex analysis that would warrant 83 minutes. Ten minutes in and the novelty fades; the silliness of the idea recedes and banality takes over.<br><br>What attempts to pass as a documentary is essentially a 9th grade take home writing assignment with extra spacing and fat margins that struggles to meet a 90 minute goal. There simply isn't anything substantial filling the time. The bulk of the presentation is filled by show footage, bomb test footage, or silly animations.<br><br>Soling excessively dwells on an atomic apocalypse as the beginning of the series, something mentioned by the show's writer in passing as an early idea behind the show's creation. Everyone that's watched the show or listened to the theme song is aware that they were shipwrecked.<br><br>Soling posits that since Gilligan is a member of the working class and the show is a critique of a capitalist world that exploits workers. Not only does this hypothesis fail in its broad observation, it provides no insight. Gilligan is not the focus of the show; he is the comic relief that foils escape attempts. A buffoon neither shows the working class in a positive light, nor would it criticize a system that exploits labor. Gilligan's Island is really a comedic version of Lord of the Flies with adults.<br><br>The argument continues with a critique of Democracy, claiming that its worst aspect is that there is no competency requirement for office. What follows is footage of our proletariat, Gilligan, winning a presidential election. Lampooning some aspects of one society is not the same as rejecting Capitalism and promoting Marxism. Soling's evidence for the secret Communist agenda of a 60's sitcom are often contradictory, just like separate episodes of a 1960's sitcom.<br><br>This pattern of 5 minutes of unrelated historical footage, followed by minutes of show footage with brief, loosely supported statements in voice over continues for the remainder of the 83 minute running time. A last ditch attempt towards intellectual rigor is made with interviews by Harvard professors to explain basic concepts.<br><br>TL:DR You'll be watching unrelated Cold War footage and a Gilligan's Island highlight reel, peppered with one sentence of a 1 page half-baked argument every 10 minutes. Save your time and watch a few show clips without interruption.<br><br>In the off chance this piece was created in jest, it does resemble the format of a documentary, just as a mockumentary would, but lacks any comedy or self-awareness to succeed. We are left with neither something serious nor something clever and funny; thus, we are not entertained.","user":"dostoyevskychum","rank":[5,8]},{"title":"Clever idea, poor execution","rating":6,"date":"15 January 2019","review":"I love the concept and the premises the film puts forward, but it's not very good. The flow of the narrative, the clips, none of it works, the whole film feels like a college PowerPoint presentation. Probably best left for history nuts","user":"rpezl","rank":[5,10]}]