[{"title":"Witty, clever, and just plain old fun!","rating":10,"date":"19 February 2018","review":"Peter Rabbit is a story I grew up with so I had to see this movie. I had no expectations. I don't think I've laughed throughout an entire movie like I did watching this on a very long time. People commenting about the allergy scenes need to lighten up! -- and that's coming from someone with allergies -- that put a damper on my life practically daily. Seriously, it's such a minor part of the movie, laugh, don't laugh, and move on. The movie has many good messages: knowing when to fess up and admit you did wrong (imagine that! Accountability!), making apologies (woah, again with owning up to your actions!), the impotance of friends and family, and more! Also, a great cast and a fabulous soundtrack.","user":"dlfnsrf","rank":[168,212]},{"title":"Adorable, Great Acting, Extraordinary CGI","rating":10,"date":"9 February 2018","review":"Peter Rabbit is one of my favorite kid's movie of the year so far. It's an adorable film that is perfect for the whole family. I love this film because of the acting and CGI. <br><br>Peter Rabbit follows Peter Rabbit, Flopsy, Mopsy, Cotton Tail and Benji as they get into mischief by taking vegetables from the garden next door. They take the vegetables from Mr. McGregor who tries desperately to get them out of their garden by using explosives and even an electric fence. The rabbits hang out with loveable characters like Bea. She helps the rabbits by giving them shelter when it rains and helps them get food.<br><br>Throughout the movie, we see great acting from all the actors and voice actors in the film. I love how Domhnall Gleeson acts like a soulless man with the rabbits who he is trying to kill, but with Bea, he acts like in he's love. I found that Mr. McGregor (Domhnall Gleeson) really does seem to be in love with Bea. I also like how the voice actors portray the rabbits. Each one of them has a personality that is well portrayed in their voices and actions. For example, Cotton Tail is a memorable character because of how wild and reckless she is. The way Daisy Ridley voices her shows how wild she can be. <br><br>The CGI in this film is extraordinary. The animals look so realistic. If you really focus on the rabbits, you can see the individual hairs on them. You can also see it on the pig character that hangs out with the rabbits. During a fight sequence with Peter and Mr. McGregor, they actually look like they are fighting and not like he is fighting a fake bunny. <br><br>I rate this movie 5 out of 5 stars and recommend it to ages 7 to 12. <br><br>Reviewed by Carla P., KIDS FIRST! Film Critic.","user":"rannynm","rank":[142,187]},{"title":"THIS FILM STICKS TO YOUR HEART-GET EXTRA NAPKINS AT THE CONCESSION.","rating":10,"date":"4 March 2018","review":"BRA-VO. This is a BRILLIANT film, very sweet and heartfelt. Not sure why there has been so many bad reviews and a lot of self-righteous comments--but they need to check their politics at the door, and for goodness sake--just have fun, people. Can't we just enjoy it? Why does it have to be so complicated? I can think of a million other things that are much worse--than this Peter Rabbit film, which by the way, there is nothing wrong with Peter Rabbit 3.0. Go see it. You're going to love it, as much as I would've felt the original author would have too, as this is based on her tale for kids, but it is technically a sequel--as you will understand when you see it. First off, they are rabbits, and rabbits are mischievous by nature, when they are bored or there is food at stake. They are also a bit affectionately demanding and territorial as they felt with Bea. Within the context of the film, rabbits don't understand what the implications of allergic reactions could be for humans--they are, yes, rabbits. The humor is just hilarious, and it works well coming from farm animals. This is CGI/A vs. real live humans. It kept me engaged throughout. I saw this one with my daughter and we both laughed so much and so hard -- isn't this what it is all about? a positive experience? One that brings you closer with those you are with? I cried, I laughed, I cried so hard I laughed, and laughed so hard I cried -- and this is how I rate/gauge film I watch -- by how it moves me and the positivity it inspires in me; it felt good to be reminded that I was still human. I just loved, loved, loved this film. I recommend it. This one will definitely make it into my collection once it is released in media format -- and not many make it in. The soundtrack is super amazing too--I can't stress that enough. They hit it on the head with this one. A TRUE STORY OF HUMBLENESS AND REDEMPTION. Your heart will melt into a big puddle--hands down. No one is paying me to write this--I give it 10 Gold stars. I want to see Peter win next year at the Oscars. A TOTAL GEM.","user":"alvaro-a-quesada-558-141800","rank":[119,158]}]