[{"title":"Surely not the best Spanish horror.","rating":4,"date":"7 July 2018","review":"Sadly to say, Noctem didn't do it for me. I very much appreciate the Spanish cinema, but they don't do so good on the horror part as they manage to succeed on great thrillers. Of course one might argue that REC1,2 are masterpieces and I would have to agree, but overall they do far better on productions such as Julia's Eyes, Timecrimes, The Orphange and so on. <br><br>So, why did Noctem failed? Well first of all, it kinda looks like a mess. It tried to cover many layers at once and I do believe overall it just confused the viewer a lot. It had an idea, a plot yet its execution clearly wasn't the best. For a found footage movie it had a lot to live up to, because we expect something better, different after so many other such movies but this was not the case. We are given an mediocre execution and very few aspects that deliver.<br><br>Thus all in all I would not recommend Noctem because it really is one of the weakest Spanish horrors I've seen lately. You can clearly swift in another direction.<br><br>Cheers!","user":"gothic-fiction","rank":[15,15]},{"title":"Screaming, yelling, nothing happens, more screaming, more yelling","rating":3,"date":"30 July 2018","review":"This movie is the worst kind of found-footage film; you can tell that the creative team wanted to save as much money as possible, so they skimped on everything from the special effects, to even the work that was supposed to be done in post. The acting is serviceable, for the most part, but the cast (especially the males) are so annoying, you just want them to disappear. The story has been done before, so their is nothing to write about that, but the execution is so poorly and shoddily done, I am really surprised anyone gave funding to complete this. I would have asked for my money back and shelved the project, never to see the light of day. It just doesn't do anything good enough to warrant even a curious viewing. Avoid it and forget it. It's just bad in every possible way.,","user":"manuelasaez","rank":[6,7]},{"title":"Cellphone terror","rating":3,"date":"23 September 2018","review":"The idea sounded very interesting, not exactly new but enough to make one want to see it. The cover looked quite eerie. Also wanted to see how the use of cellphones would fare. So saw 'Noctem' with genuine interest and wanting to at least sort of like it even with many problems. <br><br>Seeing it, well 'Noctem' certainly did have many problems. The bad news was that there was not an awful lot good, let alone great, about it, so it was difficult for me to sort of like it, the little that's good being far overshadowed by the bad. Having prepared myself to do that, that was disappointing. Not a terrible film or without redeeming qualities, and there is far worse out there of the genre and overall. Liked the concept for 'Noctem', the execution was just wanting.<br><br>'Noctem' at least didn't insult my intelligence. It at least didn't make me angry watching it. Despite giving it a low score and negative review, it even didn't make me regret watching it altogether. <br><br>It started off quite promisingly in an unsettling sort of way and the film didn't look too bad considering the type of film it was, not high art which wasn't expected but not amateurish as was feared. The setting was quite spooky at times as was the lighting.<br><br>Unfortunately, 'Noctem' did lack tension and suspense and the infrequent creepiness was never that eerie and rather obvious. The script is stilted, the direction tends to be static and there is a lot of overacting from particularly the male cast.<br><br>Was let down by the story. Conceptually interesting and wasn't too bad starting, at least too there actually was one, but the dull pace, due to some very uneventful stretches in particularly the middle, and trying to do too much which caused the film to become muddled structurally cheapened things. The characters are flimsily developed and bland even with the overacting. It can feel vague and while nothing is intelligence insulting there is both ridiculousness and trying to take it too seriously.<br><br>Summarising, weak but not a catastrophe. 3/10 Bethany Cox","user":"TheLittleSongbird","rank":[1,1]}]