[{"title":"sub standard plot/acting/casting.","rating":3,"date":"24 December 2016","review":"Unfortunately the grit of the original two movies is well lost in this episode. The main two gangsters/bad men are completely unbelievable characters. One is like a runty cousin of Danny dyer (some Essex warrior who couldn't scare a granny), and the other 'hugs' comes across as a mincing Turkish footballer, who's acting is very wooden. The acting in general (apart from Noel's) is farcical, along with the Americanised story line , which takes things too far from potential reality. Even Curtis, who was pretty demonic in the second film comes across as a theatrical comedy villain. If you are going to attempt to cast in high level gangsters who run large grossing international business's, then please, make the characters believable. Some orange Essex boy in top shop garms just doesn't cut it. The great thing about the first two films was that they were believable to a certain extent, with the plots mirroring how life can be for large swathes of society in urban environments. For some reason Clarke took this one way beyond those parameters, and failed miserably. If parenthood is to happen as the 4th and final part, then please take it back to the original flavour. There is so much good new music and Yoot's (genuine rude boys who hang with well known grime artists) to ensure Clarke could create a realistic and believable film. Unfortunately, this film waters down the first two and comes across as a way to milk the good will built up.","user":"rowanuk","rank":[20,25]},{"title":"A Decent End","rating":5,"date":"29 August 2016","review":"Caught this today with my girlfriend and some friends. As fans of 'Kidulthood', 'Adulthood' and 'Anuvahood' (if counting), and seeing as it was a bank holiday Monday, we thought we'd go see it. A good, pretty much chavless crowd was there too. I was 14 when the first film came out and I remember the phenomenon it caused. I was 16 when the second arrived, and the reaction was even bigger, because of the first film. Now I'm 24 and the end is here. I feel I have grown up with these and they are special films. This is an entertaining, well-made end, if not a great one. Noel Clarke returns, amongst some other familiar faces. The supporting actors all do a good job but this is certainly Clarke's film. There's some pumping music, stylish edits and camera-work and the odd semi/fully naked woman to keep the lads happy. There's also some dark and repulsive scenes, that make this all the more gritty, as well as some good humour and deep messages too. It does feel like it needs Adam Deacon though, I must admit. I think fans of the first two films won't like it as much but it's a fitting finale. Overall, a decent end to a powerful trilogy that the target audience is sure to embrace.","user":"seanc-39407","rank":[15,22]},{"title":"Falsehood","rating":2,"date":"2 May 2017","review":"I am a big fan of Noel Clarke, he is a one man dynamo often writing, starring and directing his own movies. He refuses to bow down to his detractors.<br><br>Unfortunately something went awry in the final part of his trilogy, Brotherhood. Instead of being a gritty urban streetwise thriller like his previous two films, it feels more like a joke.<br><br>Sam Peel (Noel Clarke) has done time for killing. He his now living a quiet life with a mundane job with his girlfriend Kayla (Shanika Warren-Markland) and two children.<br><br>Things take a sinister turn as Sam is dragged back to a life he thought he left behind. His younger brother Royston (Daniel Anthony) is shot while performing in a show. Sam himself has been given a come on by a pretty East European lady.<br><br>Pretty soon Sam and his family are being threatened by flash crook Daley (Jason Maza) and his crew but Sam has never done anything to upset him. It turns out that an old enemy is pulling the strings, Uncle Curtis (Cornell John) whose nephew Sam killed and who wants to destroy Sam's life.<br><br>The story just did not walk, it really was a badly written film. If Uncle Curtis wanted Sam dead, he should had just killed him, not drag Sam's brother and mother into a stupid cat and mouse game.<br><br>Still Clarke pulls a nice trick of attracting his fans from Doctor Who. Included in the cast are actors that have appeared in Doctor Who, The Sarah Jane Adventures and Class.","user":"Prismark10","rank":[5,6]}]