[{"title":"In a world were you get what you pay for?","rating":5,"date":"25 April 2018","review":"I wouldn't recommend spending money to watch this film. Putting aside the lackluster acting, effects, and storytelling. Mohawk is riddled with tiny fragments of potential. I dare say the lack of budget and acting isn't its biggest weakness. Plot and pacing secure Mohawks position in the lackluster section of Indie movies.","user":"chrislowe-27445","rank":[18,25]},{"title":"Great subject but under done","rating":2,"date":"2 July 2018","review":"OOf! Started watching. Looked kind of interesting at first, but wow, severe historical inaccuraccies and anachronisms rear their ugly heads. Understandably, given history and subject matter, refreshing to have a pro-first nation slant. <br><br>Why do non-American (I think it was a Canadian production) love putting actors playing American military character heavies in a southern accent? Most of the early American enlisted regulars were immigrants, poor seamen from port cities idled by the drop in maritime trade due to the Royal Navy, or local apprentices and farm boys running away for adventure. Other than that small number of regulars, there were the militia, that is, locals. Ergo, why the southern accents? WTF? People of little means didn't travel far.<br><br>What is with the guy with the steampunk specs?? All I could think of was 1988's \"The Adventures of Baron Munchausen.\" <br><br>Seriously, it got so bad so quickly that I couldn't watch anymore. Too bad. This slice of First Nation history needs to be told on the screen/TV. <br><br>How about a movie on the Stockton Indians (mix of Nipmuc, Wampanoag, Abnaki, and other New England tribes) and their combat contributions in the Revolution? Or the actual civil war between the Iroquois during the Revolution where Tuscarora and the Oneida sided with the rebels?<br><br>Anyway, so sad to see good bits of history not getting proper treatment. <br><br>FYI, check out reviews by History Buffs and their friends on YouTube for a guide to well-done historical films.","user":"HalBaker_MA","rank":[14,19]},{"title":"A Student Film That Fails","rating":2,"date":"23 May 2018","review":"There is absolutely nothing about this \"film\" that can fairly be called professional. To begin with, the digital capture is so bad as to verge on video tape. It is crisp to the point of lifeless and has no personality or artistry. The dialogue and story are completely hackneyed and seem like an alien's approximation of a thousand other stories, but only clumsily apes anything that seems real. But BY FAR the worst thing about this mess is the acting. The Mohawk older woman/mother may be the worst actress I've seen since Billy Jack's girlfriend. Strike that, because she's even worse. The two \"actors\" playing her son and daughter are also execrable, and not one word out of any of them sounds period. They seem like modern day people plucked out of a mall. It's all so, so bad. I don't have any idea how so many critics on RT gave this garbage a pass. The audience score is much closer to the reality of this waste of time.","user":"EdD5","rank":[21,32]}]