[{"title":"Great acting, poor writing.","rating":7,"date":"5 August 2018","review":"The entire cast performed exceptionally well, but the poor writing and major plot issues made this film miss the mark. The directing was decent but also need better editing. Still an enjoyable film based on true events, but could have been much better. It's a 7/10 from me","user":"TheTopDawgCritic","rank":[50,63]},{"title":"Nothing special but it is enjoyable","rating":5,"date":"17 July 2018","review":"This is based on a real-life case and was made before as a TV movie in the 80s with Judd Nelson starring. This has higher production values and can boast Kevin Spacey in the cast, although boast may be the wrong word these days. Still whatever else may be said of him he's a great actor and I always enjoy seeing him.<br><br>Not a bad little movie, I'd recommend it.","user":"aldiboronti","rank":[82,115]},{"title":"If it sounds to good to be true, it probably is...","rating":3,"date":"17 January 2019","review":"I've read every book written about Joe \"Gamsky\" Hunt, Ron Levin and the Billionaire Boys Club. I cannot believe this movie is portraying the character of Joe Hunt as clueless and sympathetic, when he deserves neither. There wasn't much difference between Joe Hunt and Ron Levin as they were both con men running a Ponzi scheme, only Levin used Joe and the BBC to pull off his scheme against another man who had invested his money in Levin's investment account. It was the same thing he did when he invested $5 million into the BBC that was contingent on using Levin's investment account at Clayton Brokerage Company, where he controlled the money. They make Dean Karney the bad guy in this version, when he was just a pawn in Hunt's scheme.<br><br>The mini-series from 1987 was much better, as the bulk of the story is told in flashback in accordance with testimony of various witnesses at Hunt's murder trial. Most of the testimony comes from Hunt's closet colleague and accomplice, Dean Karney who was offered immunity in exchange for his testimony. As the story of fraud, greed, kidnapping, and murder unravels, it is unusual how lightly those other than Joe (who naturally behaves with such cruelty) reacts knowing all the crimes they've committed. A murder here and there, but they can still have such good times at a birthday party. And what's even more disgusting is how the defense team for Joe Hunt tried to write off everything as immature gimmicks, simply stating that Hunt was innocent despite the large number of witnesses testifying against him and the vast paperwork trails that reinforce his guilt. If that was the actual closing arguments offered by the defense, my only guess was it was a last hope that Hunt could get off. And what is even more laughable is how brazen Hunt was about absolutely everything. He is not a sympathetic character in any light. Neither are too many others in the BBC, except for the three responsible for setting off the case that eventually brought down Joe Hunt. And what is much more sickening than that Joe Hunt wasn't the first and isn't the last in the game of greed and ambition.<br><br>Joe Hunt is a malignant narcissist and sociopath, who used people to get what he wanted and needed.<br><br>This mini-series has held up well over the 30 plus years, particularly in sync when this crime occurred. The director of the mini-series, Marvin J. Chomsky never disappoints, an excellent director of his day and I wish he would teach this new generation how to direct a strong true story in this current era. This true story was poorly miscast from everyone.<br><br>Judd Nelson was excellent as the original Joe Hunt, certainly not this panty waste Ansel Elgort in this true story about greed and murder amongst the rich and privileged of Los Angeles. He has this perpetual look of a deer in the headlights look and showed none of the real Joe Hunts natural persuasiveness, charm and charisma that drew these young men into the lion's den. I saw none of that in Ansel Elgort's performance. I was disappointed in Kevin Spacey's performance of who Ron Levin was this sleazy con man, Ron Silver did a better job at portraying who the real Levin was.<br><br>Joe Hunt came from a poor family and was considered by his former \"privileged\" classmates as being nerdy, unpopular, and a scholarship kid. After college, Joe became reacquainted with some of his rich former classmates through Dean Karney. He convinced this group of guys that he was an expert in commodities trading and he had a \"risk free\" strategy that would produce big returns. The guys were very impressed, so they gave Joe all of their inheritances to invest in the commodities markets. But instead of investing the money, Joe used their money to rent office space and hire employees for his new company, the Billionaire Boys Club.<br><br>Joe scammed money from wealthy businessmen, spent some of the money to maintain his lavish lifestyle and the rest he lost in the commodities market. And to keep his investors from getting suspicious, Joe mailed out fake statements that showed a small profit but eventually the investors started asking for their money back. Joe was desperate to find new investors.<br><br>Joe met Ron Levin, who was a wealthy businessman and con-artist himself. He was hoping to scam Ron Levin out of enough money that he could bail out the BBC. But as it turned out Ron scammed Joe. Joe was furious and decided to kill Ron Levin. Joe's biggest mistake was leaving a hand written 7 page \"to-do list\" at Ron's house, that was left in a garbage can. The police found this list and later used it in court. The prosecutor proclaimed, \"It's a recipe for murder\". The question is whether this is the sincere act of a changed man or just another con job by a master manipulator, which is what prosecutors and law enforcement officials believe.<br><br>In Joe's continual pursuit for more cash, a plot was hatched to kidnap Hedayat Eslaminia, a rich former Iranian official and hold him for ransom. This plot didn't work either and Joe was losing control over the guys. Two of the guys secretly went to the police and this led to the end of the BBC. Hedayat Eslaminia was a political insider to the brutality of the Shah of Iran. When the Shah left Iran, insiders like Hedayat Eslaminia had their assets frozen, so there was no real money for him to invest in. Joe's second trial for the murder of Hedayat Eslaminia, where he represented himself was met with a hung jury and the LA County prosecutor chose not to retry this case.<br><br>If you want the true story and not this flimsy fairytale, please read these books: The Billionaire Boys Club by Sue Horton and The Price of Experience by Randall Sullivan. Or, watch the YouTube documentaries on Levin, Hunt and the BBC.<br><br>I will have to assume these writers and filmmakers are part of the movement to free Joe Hunt from prison based on habeas corpus, no body, no crime. He is certainly seeking to reduce his sentence to time served but, he is a dangerous sociopath. As one club member testified at his trial, Hunt told nine members after Levin vanished: \"Don't worry. This was the perfect crime. They'll never find the body.\"These young men had forgotten that old adage... if it sounds to good to be true, it probably is.<br><br>I'll give this movie a 3 out of 10 and the original mini-series a 10 out of 10.","user":"eileen-guthrie555","rank":[10,11]}]