[{"title":"Great SciFi movie!","rating":9,"date":"4 December 2019","review":"I am a sucker for anything sci-fi + thriller so really enjoyed this movie right from the start. I loved the story, the scenery and loved it was an all women cast! The Shasta Triangle definitely takes indie films to the next level and I love that. Well done!!","user":"thebandyuca","rank":[19,26]},{"title":"Really surprised!!!","rating":10,"date":"4 December 2019","review":"I don't love low budget sci-fi flicks cause they usually just let you down with shoddy FX and failed attempts at cinematic moments but- Not this flick! This film has an incredible emotional center, Some damned solid acting and moments that just draw you in. I can't recommend it enough. Sure it is lower budget but you never even notice when the story takes over. It's films like this that got me excited about cinema when I was young. Little movies that could and this film really CAN! I cannot recommend this film enough.","user":"chrisasaurus-1","rank":[19,26]},{"title":"So this is art when you don't have 10million dollar budget !!!!","rating":9,"date":"11 December 2019","review":"So right off the bat... the story had me. I wanted to know more about what was going on. At no pint could I have walked away and NOT cared about the ending. It had interest , back story, layers, and some amazing cinematography, I can't get the back words moving snail out of my head for some reason ?!?<br><br>Anyways , is this a somewhat indie film, and does it have a lowish budget vibe?? Yes, yes it does. But, it's kind of what made me love it more. You can almost feel the passion from the creators who are just trying to get some idea in their heads into the heads of others.<br><br>The amazing filming and beautiful direction of these charters draw you in. You can't leave this film till the end, you need to know!!<br><br>Thank you to the film makers and daring actors willing to put themselves out there and be vulnerable, it has inspired me to be as brave!<br><br>I'll definitely be watching it again!\nThanks for the entertainment.","user":"mbdkmobile","rank":[15,20]}]