[{"title":"Mediocre Lifetime thriller, not as good or bad as some","rating":6,"date":"6 March 2016","review":"The first Lifetime movie I watched last night was their Saturday night \"world premiere\" of Nightmare Nurse, yet another entry in their series of \"The Nightmare _____\" (as opposed to \"The Perfect _____,\" \"_____ at 17\" and \"The _____ S/he Met Online\"), directed by Craig Moss from a script by Jake Helgren and produced by a company called Cartel Pictures in association with our old friends from previous Lifetime movies, Marvista Entertainment. It opens with a scene in the kitchen of a fancy restaurant (we hear a lot about how great the food is and get to see the divo-ish behavior of the main chef, but we never see the actual dining room, presumably because that would have been one more set the folks at Cartel and Marvista would have had to budget for) in which the big-cheese chef is complimenting Brooke Herron (Sarah Butler) on her latest creation and announcing her promotion to sous-chef, which is supposed to be a big deal in both money and status. Then we see her celebrating with her live-in boyfriend Lance Dawson (Steven Good, who's actually a nice piece of eye candy — a truly hot-looking male is rare in a Lifetime movie unless he's cast as a villain!) — though I'm guessing at the last name and it could be \"Bawson\" or \"Lawson\" — they're both downing way too many shots than are good for them and when they get in their car to drive home, they literally run into a man in the middle of the road and, though Lance (at the wheel) tries to avoid him, he hits him anyway and then runs his own car into a tree. Brooke gets away with a few cracked ribs but Lance's right leg is broken and needs a full cast, while the pedestrian they hit is killed. The police interrogate both Brooke and Lance while in the hospital but decide it was an unfortunate accident. Brooke is able to go back to work for a few days but Lance needs extensive in-home care, the way my long-term disabled home-care client did, is a mystery) — and the agency the hospital works with sends Chloe Spade (Lindsay Hartley). Of course, Chloe's sweetness-and-light act when she first shows up for work and agrees to start one day early whether she gets paid for it or not is an act, and Brooke starts to suspect when she sees that the pasta dish she gave portions of to Chloe (in the styrofoam trays in which restaurants frequently pack to-go orders — did she just happen to have them lying around her house?) was immediately thrown away when Brooke left on her first night. My immediate assumption was that Chloe would turn out to be the girlfriend of the man Lance and Brooke had run over and killed in their car in the early scene, and she was there to make our lovebirds' lives miserable — but then writer Helgren threw us several curveballs.<br><br>\"Nightmare Nurse\" is a pretty mediocre movie, not as bad as some Lifetime productions have been but not as good, either. The situations are pretty preposterous but the full-throated acting saves the day. Steven Good isn't really challenged by playing a milquetoast victim (but then he's nice-looking enough it doesn't really matter whether or not he can act!), and Sarah Butler is competent but no more (but then a more charismatic performer might have made the bond between Brooke and Lance too strong and left us not believing anyone could seduce Lance away from her), but René Ashton is quite good in the limited screen time for the character, Lindsay Hartley is an excellent Lifetime psycho as Chloe, and Traci Lords is also great in a small but showy role. Though the subject of \"Nightmare Nurse\" is psychopathic obsession, still there's a welcome lightness to the treatment, an ample supply of comic relief (notably the scene in which Chloe attempts to walk Lance to the bathroom so he can stand at the toilet and use it, and he's too embarrassed to be able to do so in her presence while he's so helpless he has to rely on her to aim!) that keeps the film from the sinister lugubriousness of last week's Lifetime \"world premiere,\" \"Suicide Note.\"","user":"mgconlan-1","rank":[17,22]},{"title":"Average suburban thriller","rating":5,"date":"15 March 2016","review":"Lifetime movies is usually a simple drama or thriller done for casual night, although there have been some remarkable mentions. \"Nightmare Nurse\" is not incredibly provoking or terrifying by any means. It plays in safe formula of constrained patient and the reliance on stranger. A couple creepy scenes aside, there's nothing terribly shocking on both acting and presentation.<br><br>Lance (Steven Good) is hurt in a bizarre car accident and in need of a nurse. Along comes Chloe (Lindsay Hartley) the odd seemingly too nice of a nurse who has equal dark side. The actors are presentable, all looking like models or beautified young adults. However, there's not much in term of setting the tone for dread, mainly because its runtime is relatively short.<br><br>It's a drama at heart, with a little bit of suspense and strange attraction in between. This won't be effective for those craving a solid scare or even jump scare since it's fairly timid. It will do for a popcorn night with basic drama, but one should maintain a manageable expectation since \"Nightmare Nurse\" won't treat any patient with visceral conviction.","user":"quincytheodore","rank":[4,4]},{"title":"Excellent movie deserving of 8+ rating","rating":9,"date":"11 June 2016","review":"This is one of those films that sets itself apart from most modern flicks of today. I feel whats makes this such an exciting and enjoyable film is not just the good story-line but a movie title to match. The name \"Nightmare nurse\" has a lot to contribute with making this a feel-good yet thrilling movie from start to finish.<br><br>Something a wide selection of viewers would find both riveting and thoroughly worth their time.<br><br>All those in the cast have acted brilliantly. However Top marks to Lindsay Hartley's performance as Chloe . Lindsay lives the part with her excellent character acting that's deserving at the very least of a Oscar nomination if not the very award itself !","user":"carlglenn","rank":[6,8]}]