[{"title":"Teases With An Interesting Idea But Fails To Fill A Convincing Plot Around It","rating":11,"date":"11 April 2017","review":"The idea behind the premise of The Discovery is an interesting one but its implementation isn't as refined as expected and only works in bits n pieces. It's a thoughtful feature that experiments with existential elements and poses some intriguing questions but it neither presents it in a convincing manner nor remains thoroughly gripping.<br><br>Set in the near-future, the story of The Discovery takes place in a world where suicide rate is at an all-time high after a scientist's breakthrough research proved the existence of an afterlife. The plot follows his son who is skeptical of his father's discovery and a mysterious young woman he meets on a ferry who wants to find out more about the afterlife.<br><br>Co-written &amp; directed by Charlie McDowell, the film opens with a prologue that skilfully sets up the future the rest of the plot unfolds in. For a while, it appears as if the director is taking more time to properly establish the characters &amp; explore the metaphysical elements but the longer it continues to ponder over the same stuff, the more tedious it becomes.<br><br>The script is where the problem lies, for the brilliant hypothesis that the writers came up with isn't meticulously explored as if they couldn't figure out what to do with it, plus none of the characters inhabiting its future-setting are compelling enough. The plot wrapped around its theory begins on a promising note but by the time it ends, it finds itself in a familiar territory.<br><br>The cold colour palette, overcast ambiance &amp; muted textures evoke a grim, hopeless future which fits the story requirements. Pacing is an issue as the movie plods through its 102 minutes runtime before concluding with a rushed ending. Rooney Mara, Robert Redford &amp; Jesse Plemons play their part well but Jason Segel is severely miscast, and his chemistry with Mara is absolutely flat.<br><br>On an overall scale, The Discovery is one of those sci-fi flicks that teases with a fascinating idea but is unable to fill a compact &amp; captivating narrative structure around it. Deficient in storytelling department and further marred by its cluelessness &amp; lack of vision, it is a dull &amp; sterile mess that had the opportunity to offer a sensory &amp; stimulating experience but what it ultimately delivers is a cinematic ride that's as frustrating as it is hollow.","user":"CinemaClown","rank":[79,100]},{"title":"Underrated flick that deserves a viewing","rating":7,"date":"19 April 2017","review":"I wasn't sure about seeing this film because of the rating, but the concept was interesting and being a fan of Rooney Mara's work I decided to give it a shot. And I am glad I did.<br><br>The opening scene is very well done because it grabs your attention from the first second. But what comes after is what bothered most of the viewers who felt disappointed - the personal story line between Jason Siegel's and Rooney Mara's characters becoming the center of attention instead of the concept of an afterlife and how it works. <br><br>Personally, while watching the movie, I did feel a little bit deceived, because \"the discovery\" took a back seat, BUT after finishing the movie it all made sense. I think the film was very well structured and managed to get across it's idea and explanation of how afterlife works very well to the audience, without having to talk about it and explain it in every scene as if the viewers are little children. I do not agree with some statements that the concept of \"the discovery\" was not well done, finished or explained well. Last 10 min. do contain a lot of information and the viewer should pay attention.<br><br>The acting was very good, however overall I must agree that it is not the most exciting film. What I mean is that it won't be in your \"most memorable or favorite\"movie list. It's a good watch on lazy night though. Give it a go.","user":"imdbuser33","rank":[47,60]},{"title":"Underrated Existential Weirdness","rating":9,"date":"2 April 2017","review":"Don't know why this is getting some bad reviews. This was actually pretty darn good.<br><br>This movie has an interesting take on consciousness and death that is worth the time to watch. Perhaps people are not liking the existential weirdness and the questions it brings up but I enjoyed myself on this one.<br><br>I think we all need to ponder consciousness and reality a little more.","user":"mikethebeckett","rank":[139,201]}]