[{"title":"Savage, angry, true","rating":8,"date":"3 November 2018","review":"I shouldn't be surprised by the reaction to this film, in a time when indie films have to be brutally realistic, or feature decayed characters, or have scenery gnashing performances to make a mark. There can't just be chaotic, sweet little movies made about someone's ordinary life, someone's annoying, trashed, tender youth - if they don't make a profound statement about life.<br><br>But these little movies always seem to have startlingly true moments, stunningly real feelings. They're not throbbingly stylish or cinematic, so they let their characters come through, sometimes with painful honesty - Izzy manages to be a crashing fail, and at the same time, her experience of the pain of first, and long-lasting love is like a honeycomb crushed in a fist.<br><br>She's dirty, wild, funny, lazy - but look at how she folds down onto the bathroom floor and doesn't cry, but lets out this half scream, half moan as the person she's built so much of herself in has just walked away. Watch how she looks at her embittered sister who she used to be so close to, while they sing a song they put so much of their youth and essence into. There's love, there's fear, shame, longing - but there's still that dazzle of hope in her eyes. She's still young, and she hasn't been crushed into uniformity yet.<br><br>How can you not feel the truth of this? The fine line between hope and fantasy is a tightrope she walks the entire time. Is what she wants beautiful from afar, but up close, when it opens its mouth, is it just ridiculous? What is the fate she's going to make, if she decides to let go of the one she's been hitching her heart to half of her life? I wish I could've stayed with her longer to find out.","user":"TheInbetweener","rank":[11,12]},{"title":"I really liked this film...until the last 20 minutes","rating":4,"date":"4 October 2018","review":"I really wanted to like this film, despite the mixed reviews. I enjoy a lot of the cast and was especially psyched to see the talented Mackenzie Davis given a project to carry. And for the first hour or so, I wasn't disappointed. But the last act (pretty much everything after the point where she confronts her former friend and leaves the party) is downright terrible. Neither what happens to her the next morning nor the very last scene makes any sense considering what comes before. It seems tacked on, like there was an original ending that didn't play well with preview audiences. This could have been so much better.","user":"kennetharthurfrench","rank":[17,20]},{"title":"\"Fate and will have to work together.\"","rating":5,"date":"9 January 2019","review":"Move over Deadpool, you've met your match, at least in terms of vulgar language and unsophisticated taste. I was drawn to this title in the most roundabout of ways I won't bore you with, but it's something I could have passed on. There's two ways you can look at the resolution of this story. In the first instance, Izzy (Mackenzie Davis) finally comes to the realization that her idealized fantasy of getting back together with Roger (Alex Russell) was simply not going to work, knowing her own personality and recalling all the things that went bad between them the first time around. Or, she wound up executing an elaborately orchestrated revenge plan on Roger and her former best friend Whitney (Sarah Goldberg), in which case she credibly succeeded. I tend to go with the latter based on that knowing smile she exhibited as she walked away from the scene of her crime. In any case, this film will appeal to those enrolled in the Amy Schumer school of poor taste and gutter level humor, the only redeeming quality being the acting skill of Ms. Davis, who put her character through a range of emotion that not everyone could have pulled off.<br><br>Oh yeah, that song Izzy sang with sister Virginia - nails on chalkboard.","user":"classicsoncall","rank":[3,3]}]