[{"title":"Probably the most poignantly political film I saw at 2017 Hot Docs","rating":9,"date":"7 May 2017","review":"This film begins with a chemical leak from a chemical plant/storage centre that lies immediately upstream from a West Virginia water treatment plant whose downstream residents immediately notify the world that something is wrong with their water. <br><br>This causes our gallant documentarian to head there and capture on film all the local politicians and regulators shouting into cameras \"the waters safe! the waters safe!\"<br><br>As you might imagine the path toward corrective measures in regards to environmental accidents is a slow and dogged one against powerful, vested interests, that excercise measurable control over all things legislated.<br><br>This film maker persisted and documented all of proceedings to the point that laws were strengthened to stop this from happening again.<br><br>Well done, kind of <br><br>I'm not going to say how it ended, you might, however, have guessed..<br><br>At the premiere I had the opportunity to speak to the film maker and asked him about all of the hurdles he had to jump over and obstacles in his path and all of the giants he had to battle. I said I don't know how you could have persisted through all of thisIt made me want to just cry.<br><br>His response was that yes he was frustrated and that he had thought a few times about self-decapitation (I've never heard that from a film maker before).<br><br>We should greatly admire his persistence and his 'stick-to-it-iveness'.<br><br>This is something all Americans should see to fully understand how much their government actually loves them.","user":"michaeljtrubic","rank":[15,16]},{"title":"A Passive\\Aggressive Subject-As Told By A Fawn","rating":8,"date":"25 May 2018","review":"Make no mistake, What Lies Upstream is an important film that explains in explicit detail the harm American citizens endure due to the water and land that we need for daily survival. The film goes to great lengths to show that the microcosm taking place in West Virginia is but a window of every community within the United States-that the representing Government and all entities associated with it do not work for the people and are self-serving and will disregard the well-being of its citizens for the greater good that is the American dollar.<br><br>Although the powerful message and visuals of What Lies Upstream can be contributed to Cullen Hoback(writer,director, producer, editor, stunt coordinator), what holds this film back from being a great film can be contributed to Cullen Hoback(narrator, interviewer). As previously mentioned, the subject of this film affects every American citizen and there are extremely dire consequences we all fill face, yet the mood and the tone and the delivery of Cullen Hoback is one of meekness-I was really hoping one of the subjects he was questioning would have responded with an angry, loud voice....as I anticipated Cullen Hoback would have shrieked and run from the room; alas, that did not happen. There was no fire coming from Cullen Hoback, no sense of urgency, all delivered in the same monotone voice for 85 minutes of the film. With each shocking revelation, and no matter how loud I screamed at the screen for Cullen Hoback to 'get in their face', the only mood that could be mustered was 'ho-hum'.<br><br>I highly recommend this film to everyone who wishes to solidify their belief that every faction of American government is just pure evil. I also strongly suggest Cullen Hoback take a few courses on how to express passion.","user":"PurpleCrayon2014","rank":[10,13]},{"title":"I was completely disgusted!","rating":26,"date":"26 May 2018","review":"What I saw in this film has shocked me to every bone in my body. \"Chemical Valley?\" Jesus, the water is safe to drink or to use but not safe to the pregnant women\" What kind of American logic is this. The DEP of WV only proved itself as a moronic, useless, purposeless bureaucratic authority. All the governmental officials, corporate owners, all the members of every State and Federal elected members were just a combination of liars and morons. American legal systems were polluted and controlled by the special interest lobbyists. There's no hope at all in the foreseeable future since America is controlled by these people, liars and morons. Politicians only self serving to themselves and those who donate their campaign funds. Drinking water is the 2nd important thing to human beings other than air, but the people who run the government don't give a damn, they simply could not care less. I just can't believe Americans still feel so proud to accuse China to poison their people but fail to realize they are also the victims of their BAD governments, not just WV or Flint, Ohio or Flint, Michigan, it's everywhere. EPA? I could only say it's only better than nothing. More cancers, more revenues and profits to insurance companies and pharmaceutical companies. More health problems? Better more than less, otherwise the lobbyists won't keep swarming to Washington D.C.. We, the common citizens, are no better than the Chinese, poisons are all over the world. <br><br>Remember the precedented environmental book, \"Silent Spring\" published on\nOct 22, 2002 by Rachel Carson and Linda Lear? They've pointed out that America had been polluted so seriously, so when Spring came, the whole environmental nature around those heavily polluted areas were so silent without any lively creatures in the creeks, the streams, in the dirt, on the ground and on the trees? It's a 2002 book that had awakened a lot of people to finally realize the terrible aftermath caused by those chemical factories. Yet in 2017 and 2018, these terrible things fatally affecting the lives of Americans are still there, nothing changed or improved. You don't have to worry about how terrible the nuclear winter would be, before nuclear war, these poisonous chemicals would have either killed you or given you numerous cancers.<br><br>Among all the liars we've seen in this film, the worst one is Dr. Rahul Gupta. Just within two years, he has become a turncoat from a normal person with conscience into a certified liar. Another living proof of how people would change completely and shifted to the opposite side against his people once he was promoted to a new governing job with higher salary. Dr. Rahul Gupta should be ashamed of himself. And how about the POTUS? You tell me, man. You elected him, so you deserve the guy who deregulated almost all of the environmental laws and ensure your life and health better and safe than ever. You should re-elect him for his 2nd term. What kind of voters will have what kind of government; you absolutely deserve it. \"God Bless America\" is not just a slogan or wishful thinking, it's a fact and sure thing.<br><br>These kind of documentary films are just too depressed and too stressful to watch, because once you watched, the Hope for the Future was totally lost.","user":"LogicIsEverything","rank":[6,12]}]