[{"title":"A Fair Amount of Skin but Not Enough Meat","rating":5,"date":"26 March 2017","review":"The real life murder of Cobra Video owner Bryan Kocis has all the ingredients for a promising movie: sex, greed, betrayal, lonely/sad people, users/abusers, and, of course, homicide, all revolving around a central character who is as manipulative as he is physically alluring-- an homme fatale, as it were. Unfortunately, though it comes close a few times to fulfilling that promise, \"King Cobra\" ultimately fails to do so.<br><br>At the heart of the story is Sean Paul Lockhart (Garrett Clayton), who, after telling his mother he's going to a film making workshop, leaves his home in San Diego to go make a solo video for Cobra under the name Brent Corrigan. Cobra's owner (Christian Slater), re-named Stephen in the movie, is obviously smitten but grudgingly respects Brent's wishes to sleep in the sparsely furnished guest room rather than join the pornographer in his big, luxurious bed. The Internet is quickly smitten by Cobra's very young discovery, too. Realizing he's got a potential gold mine, Stephen offers Brent more money to make hardcore videos, and a star is born.<br><br>Among Brent's growing fan base are L.A. rent boy Harlow (Keegan Allen) and his domineering boyfriend/pimp Joe (James Franco). Inspired by Corrigan's success, Joe starts producing videos starring Harlow. The move makes them enough money for Joe to put the down payment on a coveted Dodge Viper (their video company is even called Viper Boyz) for his star, but not the kind of cash they want or, as it's later revealed, need. What would really put them on the map--making them millions!-- is a video featuring Harlow and Brent Corrigan. Fortunately for them, Corrigan is just as greedy, and after an acrimonious split from Cobra Video, gay porn's latest \"It\" boy is soon spinning into Harlow and Joe's orbit. But it's Harlow and Joe who spin out of control.<br><br>\"King Cobra\" has several effective moments, most belonging to Slater and Allen. As the owner of Cobra Video, Slater's Stephen is is more sad than sleazy. He reveals that he turned to making gay porn after living so many years in the closet, and yet he still hasn't come out to his family. (His sister--played by an unnecessarily cast Molly Ringwald--still tries to set him up with women.) When Stephen finally badgers Brent into having sex with him he's in heaven, but is clearly heartbroken when Brent rebuffs his attempts to cuddle afterwards. Allen's eager-to-please Harlow is equally sad, his relationship with Joe--not to mention his involvement in the sex trade--only deepening the psychic wounds caused by child sexual abuse, not healing them.<br><br>And then there's James Franco. <br><br>That Franco is in this movie is not much of a surprise: Franco worked with director Justin Kelly before (\"I Am Michael\"), and \"King Cobra\" caters to Franco's dual fascinations with homosexuality and pornography. (It's only a matter of time before Franco just gives in to temptation and asks the Falcon Studio Group to put him in one of its videos.) Unfortunately for Kelly, he didn't get Oscar Nominated James Franco. Instead, he got Slumming Soap Opera Guest Star James Franco. Whatever potential \"King Cobra\" had at being taken seriously is dashed the moment Franco's on screen, the actor apparently thinking Kelly was making a porn parody. To be fair, it's not always clear whether Kelly was trying to make a gay(er)-themed equivalent of \"Foxcatcher\" or a satire a la \"To Die For,\" but Franco's over-the-top performance is completely wrong in either case.<br><br>After Brent reveals he made a few of his early videos before his 18th birthday, a porn producer for a bigger company tells the performer to lay low for a while, mentioning that Traci Lords was able to bounce back from a similar scandal. The Lords reference is fitting for Brent. Like Lords, Brent Corrigan can be a divisive figure in the porn world, viewed as either a kid who persevered despite unfortunate circumstances or a scheming little b--ch. As played by Clayton (much cuter than the real Corrigan, IMO), he's a little bit of both, but mostly he's a quick learner who's not quite as clever as he thinks he is, just lucky.<br><br>Likewise, \"King Cobra\" is not as clever as it thinks it is, but it's not as lucky. Like a lot of movies set in the world of porn (\"Rated X,\" \"Lovelace\"), it shows some skin but it doesn't have enough meat to satisfy its lurid story. Franco, however, provides plenty of ham.","user":"ascheland","rank":[21,22]},{"title":"Compelling tale of what happens in the porn business","rating":7,"date":"24 February 2017","review":"The strange but true story of Porn legend Brent Corrigan is told in this well made drama from director Justin Kelly ('I am Michael'). Sean Paul Lockhart took on the name of Brent Corrigan as a 'porn name' when he dipped his toe in the world of smut. He was taken under the, very keen, wing of Stephen played by Christian Slater in a well executed performance. He was a talented man who had a liking for young lads and the moment he saw Sean he was smitten. He also had a canny head for business and stood by the rule of not mixing the two together.<br><br>We also have the back stories and the story of a rival firm where the star was not making the kind of money that Stephen was and how the envy turned into, what some would cal 'affirmative action'. Those that know the story will not be surprised, I did not and must say this was compelling and gripping in equal measure.<br><br>The acting is all first rate with some well observed period detail but this is the very 'near past' so not too much effort really needed. The action – if one can call it that - is all simulated and mostly not seen so nothing to put one off ones dinner. The real strength is the story and the performances and they are all more than up to the task. This is a film with gay interest but it is predominantly a thriller and on that scale it scores both highly and readily – hence easy to recommended.","user":"t-dooley-69-386916","rank":[8,8]},{"title":"Good Show, Fun Ending","rating":8,"date":"9 February 2017","review":"I watched because I like crime shows. This one was set in the gay porn industry and a young man (very well played by eye candy Garrett Clayton) made famous by it and his unscrupulous producer. The movie was combination story about the young man's ascent in the porn industry, murder of one of the protagonists, a rival producer and his lover. 2 central plots around each of the 2 producers lives that converge at the murder. <br><br>I thought all the male actors were good in this especially Clayton that is convincing, starting the movie off as a naive youth and in the end maturing into a clever man - nicely done. It was off beat for sure but I liked it.<br><br>I think male nudity would have been gratuitous. Franco held in balance the crime story and male sexuality well in this movie.","user":"bsant54","rank":[16,19]}]