[{"title":"Sad robot is sad.","rating":3,"date":"28 March 2016","review":"Now, be warned. I am an adult, by which I mean I am over 21. In fact, I'm near 60. And this movie is aimed at children. So, when I give it a craptastic rating, it's because I may not have the same humor level as a 5 year old, regardless of what my wife says. The beginning seemed to both of us, the wife and me, to be telling children that in order to be successful and rich, you must be a wealthy man and no woman would be interested in any man who wasn't. It's about a boy, probably around 8 or 7 or some Jimmy Neutron age (ah! That's where I've seen the animation style) who is in love (REALLY?) with a girl around the same age. His inability to say what he wants to ('Sue, I love you, will you marry me?') is what this whole shebang is about. <br><br>Scene change to ... oh, I don't know.. 20 years into the future? The time line wasn't explained till way later. Our hero is living in an apartment with a kung-fu monkey, a pig in a cape, and what looks like a frog with ears whose name is Okra. What the what? <br><br>Oh... Oh... I get it... they're robots. They work at an amusement park, and hero boy is the guy who invented these autonomous, self aware robots who can smell and eat and fart and blow bubbles. Wow! The future looks so cool!<br><br>Okay... that's all I'm gonna say about the plot and pretty much all I'm gonna say about the movie. At this point, I left and watched another episode of House of Cards, just to get the Ick out of my brain.<br><br>The wife wanted to take a nap so I put on something boring and innocuous. This movie, for example. So I lied. Sue me. I'm gonna say one more thing about the movie. <br><br>There are a few cute moments. Like... umm... James Woods sort of cute. Didn't even recognize the voice, so good on him! I did tear up at the end, but then I'm a sucker for happy endings, even really stupid ones.<br><br>Children, especially those who have yet to be fully potty trained, may find this movie partially amusing. Then again, they may just throw their poo at you and ask for something intelligent.","user":"joegoda","rank":[51,58]},{"title":"Generic bits taken here and there from various kids films","rating":5,"date":"30 December 2017","review":"As the title says it feels like a film which has tried to take the most popular elements of kids films (e.g. minions from Despicable Me) and mish-mashed them all together hoping it would be a great film.<br><br>Some of the elements in the film were particularly bizarre, for instance, the villain falling in love with the aunt, he appears to be child aged (10) falling in love with the aunt (maybe 30?). Then 20 years later he's still going for her. By this point the guy is in his 30s chasing a 50 year old lady.<br><br>Rip-off characters, fart jokes (not even really jokes), strange messages including \"max out your credit cards to get rings\".<br><br>It's not the worst film I've seen, and I think kids will enjoy it, but you'll find yourself asking \"why the hell didn't she propose to him instead of being upset at waiting 20 fricken years for him to do it?\"","user":"SaltedHam","rank":[0,0]}]