[{"title":"Takes time to fully understand","rating":9,"date":"10 August 2017","review":"This is a visually striking film with an amazing plot. It took some time for me to fully understand this film but once you understand it, it will stick with you for a long time. Rami Malek's performance is flawless and minimalistic. If you're obsessed with filmmaking and cinematography you will appreciate this to its full potential.","user":"hannahkimberly","rank":[52,60]},{"title":"Gifts are Costly","rating":7,"date":"22 September 2017","review":"Jonah works third shift at a hotel. He cleans the pool, retrieves rackets from the racquetball court, and polishes off the restaurant's dishes. He is a utility man. Jonah toils in the belly of working class employment. He has voluntarily allowed himself to be swallowed by capitalism. His days and nights have become shuffled. A wife and daughter fuel this purgatory. <br><br>Marty, Jonah's wife, was the first soul to accept his junkie heart. At a church food pantry she served him then invited him into the kitchen for a kiss. Jonah's reformation began there. Marty's parents never approved, but their child, Roxy, gave the couple a hefty bargaining chip. <br><br>Jonah becomes rehabilitated and pretends to fear God on Sundays. But he never needed a pew. He needed a cabin, or dreams of a cabin. A home to raise Roxy in, void of the putrid society that delivered him into the clutches of drugs, and imprisoned Marty in the legalistic jaws of religion. He crawls into another state of servitude in hopes of eventual freedom.<br><br>The still, twilight hours perpetuate his daydreams. On one fateful evening, The Last Free Man walks in and preaches of the Inversion. An event that will usher in the collapse of all things restrictive. All digital identities erased. A clean slate. And few will survive, only those privy to the coming seduction. Jonah begins to reluctantly entertain the man, but quickly starts sipping his kool- aid. <br><br>The seemingly endless road to his family's cabin leads Jonah into more impending delusions. Instead of being preached at, he chooses to become a prophet. He becomes Buster, a lock-picking mountain goat. He politely pillages vacation homes that he could only dream to build. He treats the vacant homeowners with respect, but finds ways to subtly rebuke.<br><br>Buster and Jonah are the same man on two different paths. The former, a man who denies tragedy. The later, the man responsible for tragedy. Buster's Mal Heart is a film that makes you think twice about who you let in your life. Or maybe the film wants you to stand on trial for all your personal trespasses. Put your hand on the bible and proclaim, \"I couldn't see the blood until the lights were on.\"","user":"thirtyfivestories","rank":[34,41]},{"title":"I'm confused. But I liked it.","rating":9,"date":"22 December 2018","review":"I only have a vague idea of what I just watched, but whatever it was was extremely well done. Sarah Adina Smith definitely has a brain 4 times the size of mine.","user":"ginnafranklin","rank":[15,17]}]