[{"title":"Actor avenges attack on wife.","rating":10,"date":"17 February 2017","review":"In The Salesman the actors starring in an Iranian stage production of Death of a Salesman live parallel tragedies on and off stage. <br><br>The first shot is of a rumpled marriage bed, the setting for intimacy and sexual drama. Those values adhere even when the situation is a theatre set. The narrative unwinds from a reported sexual scene, where the heroine is somehow violated by a stranger in her shower. <br><br>Using an American classical play sets off an immediate contrast between the Iranian and American cultures. The Arthur Miller play anatomizes the shallowness and materialism of American capitalism. It establishes a struggling low-born salesman — Willy Loman — in the function of the traditionally high-born tragic hero. <br><br>An Iranian production of the American classic would be expected to emphasize the superiority of the Iranian culture. Hence the gaudy summary of the US in the set's neon Casino and Bowling signs. <br><br>But the choice of a Miller play pays respect to the freedom that political theatre enjoys in America. Hero Emad is delayed that fateful night when he has to stay to deal with the state censors who want to make three cuts in the script. As a literature teacher he's again frustrated when the school rejects his three texts as inappropriate for his teenage boys class. <br><br>Despite that puritanism the Iranian society is also riven with sexual temptation. Emad explains that the woman who objected to sitting beside him in the taxi had probably been discomfited, perhaps even molested, by another man on another shared taxi ride. The pictures Emad finds on a pupil's cell phone are probably like the raunchy stuff on American boys' phones. At the other extreme the pathetic old man is tempted to sin by the sight of the showering Rana.<br><br>That schoolboy's not having a father sets a pattern of missing or questioned manhood. The supporting actress has a little son but is separated from her husband. The little boy's obtrusive glasses suggest a preternatural vision, lending weight to his line: \"If my father phones say I'm not in. I like Mommy more.\" The boy lives his mother's life so completely that he not only attends her rehearsals but joins the curtain call onstage. <br><br>The central issue is how Emad and Rana deal with her violation. If Willy Loman's downfall is his seduction by the American myth of popularity, Emad's is for the Iranian myth of male honour. <br><br>Because the man is held dishonoured by his wife's shame Rana is more traumatized by the old man's appearance in her shower than an American wife would be. Not till the end do we realize that she was not raped and only injured herself by falling through the glass shower door. To avoid further shame Rana determines not to go to the police. She remains traumatized by the experience, too ashamed to return to her professional activity of being watched onstage by men. <br><br>With his honour pre-eminently at stake, Emad resolves upon revenge. He tracks down and traps the villain. When Rana sees him, she determines to prevent Emad's plan to shame him before his wife of 35 years, his daughter and her fiancé. \"If you tell them we are finished.\" <br><br>Emad seems to accept her decision. A largely decent man himself, when he sees the old man and his family he relents and seems ready to let him leave. But he has another score to settle. He gives him back the money he left behind, then slaps him. That last action pushes the ill geezer over the edge. With his death, Rana's love for Emad is finished too. His insensitivity to her trauma was bad enough — It's a guy thing — but his insistence upon revenge, a fatal excess, is to her unforgivable. <br><br>Like Rana's shame, Emad's revenge is based on the Iranian principle that a woman serves her man's honour. After her initial trauma Emad seems to feel more violated than his wife. After she labours over a special dinner Emad refuses to eat it because it was bought with the intruder's money. <br><br>At the heart of Emad's characterization is his exchange with a student over a story: \"How does a man turn into a cow?\" \"Very gradually.\" Determined not to be a cow, a wus, Emad plunges bullheaded toward a revenge that costs a man's life and Emad his marriage. Against the current of both Iranian and American culture, this film emphasizes the woman's merit as a civilizing, humanizing force.<br><br>The first Miller scene we see is where his son catches Willy in a hotel room with a local floozy. That costs Willy son Biff's respect forever. Emad's vengeful plan is to similarly expose the old man before his wife and daughter. It's as If Emad took his strategy from the play instead of from his wife's better sense. <br><br>The omission of Death from the film's title points to another key difference. We see Emad as Willy, dead, in his coffin, while wife Linda grieves at the paradox that she has just paid off their mortgage: \"We are free!\" <br><br>But the film ends on Emad staring stolidly, vacantly, as his makeup is peeled off. The character is dead but the actor is alive. But his marriage is dead and so Emad is no longer quite alive. He's an image of death in life, literally alive but emotionally dead. His revenge killed him along with his enemy. In Death of a Salesman we see the themes and events through to Willy's death. In The Salesman the death is omitted because at the most superficial level the hero remains — however emptily — alive.","user":"maurice_yacowar","rank":[101,120]},{"title":"8/10","rating":8,"date":"5 January 2017","review":"After having just moved into their new home Emad (Shahab Hosseini) and Rana (Taraneh Alidoosti), a couple of fellow actors find themselves in a difficult home life situation after a violation of their home. S they go through the performances at the local theater of Arthur Miller's 'Death of a Salesman' their relationship takes a left turn from which it might not ever go back.<br><br>I tried to keep the synopsis as vague as possible so not to spoil the film, since, as in most of Farhadi's films, the inciting incident comes in later in the film and the drama ultimately does not develop until the third act, something that this director likes to do and at which he excels, always giving priority to the space in which characters develop and live their everyday lives.<br><br>And those are exactly the reasons why \"The Salesman\" is a fantastically subtle and morally complex revenge tale masked as a home drama, which has some of the best work by actors I have seen in 2016, even though this might be too slightly of a familiar territory from Farhadi.<br><br>It is no coincidence that Shahab Hosseini won the best actor award at the Cannes Film Festival, if there is one reason why this film succeeds it is him. This performance is raw and authentic in its own unique way, he manages to guide us through every one of the stages of degradation his character goes through and he manages to do so without us noticing. On a surface level the character arch he goes through would be hard to believe, there are some changes that wouldn't appear natural when spelled out. Yet, Hosseini manages to sell us on this person and all of the turbulence he has to go through, he manages to enhance little moments that I can't imagine working on paper. He fits right into the world that Farhadi builds and comes out giving a powerhouse of a performance that guides the audience through the whole narrative.<br><br>Certainly, Farhadi deserves to share some of the credit for the performance too, for many reasons. Firstly, just as in all of his film, the performances across the board are just flawless, he directs actors to perfection and he doesn't even give you a chance to realize this. The way in which he uniquely manages to capture everyday life is profoundly stunning. From the camera-work to every detail of the blocking of actors right down to every word they say, the fabric of ordinariness he succeeds in putting on screen is flawless. I have no idea if this is all meticulously thought out or if it is left to brilliant improvisation and I don't want to know, what is clear to me is that as a director his methods work excellently and the results he manages to produce on screen are remarkable.<br><br>Then, when it comes to building the drama, Farhadi is just as masterful. The evolution of it is natural and doesn't ever feel forced upon the characters, the parallels traced with theater might be a little too on the nose, but they are stunningly relevant and used to an incredible cinematic effect. He manages to build and build the drama and make it culminate in a riveting finale where all of the themes and the moral questions the film asks flow out naturally from it and leave you hanging at just the right moment. He also manages to build a complex web of visual cues and use them effectively to complement the characters and the story, once again here the visual parallels with the theater are a joy to see unfold.<br><br>It has to be said that this is very familiar territory for Farhadi, the contrast of personal justice versus institutionalized justice is very relevant is his past film \"A Separation\" and so is the outlook on revenge, the degrading and the toll it takes on the individual and the destructive results of it. Sometimes it even feels like he is retracing his steps and for someone who has seen his film this might result in a slightly predictable outcome, even though the self contained drama in the film never looses its relevance to the characters, ultimately resulting in a constantly fascinating watch that challenges the viewer and defies traditional cinematic beats and expectations","user":"James_De_Bello","rank":[52,65]},{"title":"An amazing delivery from an already proved genius","rating":9,"date":"4 November 2016","review":"This is a true masterpiece, one of the best films of the year. Even though Farhadi's 'A Separation' is even better, this is a great display of storytelling and psychological understanding of the director. There are three elements that ought to be highlighted. 1) Without gimmicks and hyperboles it shows how a common man, with his natural strengths and flaws, gets his own moral code defied by the violence that exists in all societies but that in this case, touched his family. 2) The visual language. Again, it's subtle and straightforward, but its always at the right distance of the characters. 3) The counterpointing of Miller's play is marvelous! What happens to them in real life always affects the development of the play and the tensions backstage have a richness that takes the audience to a new level. A must-watch!!!","user":"smaza91","rank":[69,90]}]