[{"title":"I'm a little confused","rating":5,"date":"1 June 2018","review":"I enjoyed the movie right up until the 'dramatic' reveal at the end. <br><br>It's a movie that feels like it was written in parts and then everyone took a break and came back to it after a while and no one sat down and read through it again to make sure it all made sense.<br><br>It tries very hard to be an intelligent thriller with as it turns out a reveal at the end that I guess was meant to be the big twist.<br><br>The problem is that the big twist at the end assuming it was a big twist and reveal is that she is in fact not blind and has been pretending all along which creates A LOT of plot holes in the movie you have just watched.<br><br>The other possible explanation is that the traumatic experience that caused her to go blind when she was a kid was reversed by the traumatic experience that she suffers at the end of the movie BUT the BIG problem is the movie does not explain either; in fact in a series of flashbacks it hints at she may have been able to see all along but that creates HUGE plot holes in the movie. For example why she simply didn't stop 'pretending' to be blind for ten seconds and slip the poison into the bad guys drink as she had planned before she dropped the vial. <br><br>Its one of these movies that could have been a great movie but it loses its way somewhere along the telling of the story and then just leaves you feeling confused and asking what was that all about at the end of the movie rather than the intended feeling of satisfaction that she 'won' the movie plot and how clever she was to pull off that deception","user":"benjaminlauriesmith","rank":[128,147]},{"title":"questionable twists","rating":5,"date":"2 June 2018","review":"Sofia (Natalie Dormer) is a blind concert pianist in London. She agrees to play for the father of her upstairs neighbor Veronique (Emily Ratajkowski). Veronique falls to her death under suspicious circumstances. It's connected to her war criminal father from Bonsia. There are people after him and Sofia is hiding a secret herself.<br><br>It's not the first movie with a blind woman who witnessed a crime. This one takes on some convoluted twists. I question the logic of the big twist. The turns don't really surprise but rather exasperates. Natalie Dormer is a great actress but this doesn't really work. The twists need to be better supported. This movie needs some simplifying.","user":"SnoopyStyle","rank":[57,68]},{"title":"Something a little off when Engulfed \"In Darkness\"","rating":5,"date":"30 December 2018","review":"Natalie Dormer (\"Game of Thrones\") is fine as a blind pianist with a tortured past. The script she co-wrote with Director Anthony Byrne is thoughtful and delivers ample twists and turns. And the sound editing amplifying a sightless aural experience is first-rate on behalf of a talented team headed by veteran pro Harald Ansorge.<br><br>This established, I came way from \"In Darkness\" strangely less than satisfied. The pace never felt quite right. At least for me it didn't match the inherent volatility of the story being presented.<br><br>And I'm still in the dark as to why.","user":"jtncsmistad","rank":[8,8]}]