[{"title":"Time out of Mind...","rating":10,"date":"24 June 2017","review":"Many other reviewers have already spoken eloquently and in detail, in praise of this deeply moving, superlative film. I'd just like to offer an observation from a somewhat different angle. What struck me about 'I, Daniel Blake' was an aspect of subaltern powerlessness that pundits often overlook, i.e., that the poor and marginalized are almost never in control of their own time. In the USA dentists, doctors, therapists, lawyers, and all sorts of professionals get to maximize and monetize their time to the nth degree. As for govt. agencies like the DMV or employment or benefits offices--they are often (under-)staffed by bureaucrats who are in no hurry to accommodate John Q. Public. Patients/clients/supplicants wait (and wait and wait) in their spot on the usually stalled conveyor belt to get their allotted modicum of perfunctory attention. After all, they're just cogs in the revenue stream and THEIR time is deemed unimportant. Same thing with phone access to govt. agencies, bureaucracies, insurance companies, you name it. These corporate entities have complex and often confusing \"phone trees,\" long wait times on hold (during which horrendous music plays), and customers reps who are often either obtuse, indifferent, mean-spirited, or confused themselves. For the poor seeking any sort of public assistance these nuisances and indignities are multiplied tenfold because--as 'I, Daniel Blake' dramatizes--the System doesn't really want to serve the so-called \"disadvantaged\"; it wants poor folk in need to get discouraged and go away (and hopefully die and decrease the surplus population).","user":"NORDIC-2","rank":[70,77]},{"title":"From Britain to China, workers' very own solidarity is their social security","rating":9,"date":"8 October 2016","review":"This movie caught me by my heart, like every other piece by Laverty- Loach cooperation. It is not a thriller, there are no twists, no peaks of emotions. It shows the naked reality of our everyday lives with its great pains and humor at the same time. But, the \"banality\" of these great pains is the strength of the movie, it shows how every encounter with the system is the time we face the reality of the system and look for someone who will give a hand us to survive it. Of course, this is mostly valid for the working class. The film softly depicts that it is not a socialist propaganda, because when truly shown the reality itself unveils as a socialist propaganda. <br><br>But the film is not another documentaristic presentation of the everyday life of a worker, as it also shows how to cope with all these we experience. It is the formation of a solidarity with others like us, the woman in the queue, the Chinese in the factory, the black in the warehouse, the clerk at the office... We are already connected, even with those in other continents. Once we see someone shouting with his writing on the wall, we should shout with him with our voice. If one of them writes a letter, another should spread its word.<br><br>A shot in the head of the Britain's social security system, a great call for solidarity.","user":"sakarkral","rank":[132,153]},{"title":"A wake up call for Tory Britain. Brilliantly satirises our hateful benefits system.","rating":9,"date":"22 October 2016","review":"Ken Loach does it again.<br><br>If you know Ken Loach (and importantly his writing partner Paul Laverty) you'll know I, Daniel Blake.<br><br>It's a nightmare. <br><br>A total nightmare. <br><br>Life on poverty line Britain that is. <br><br>And Loach hammers this home with gusto. <br><br>He chooses Newcastle as his latest political landscape, partly because \"it's grim up North\" but also because, in my experience, Geordies are the salt of the earth; kind, lovable folks. And this is the main emotional driver of this nightmare. <br><br>Daniel Blake is caught in a trap. <br><br>A bureaucratic hell populated by \"computer says no\" mini Hitlers occupying mainly minor roles in the Jobseeker hell that is Tory Britain. In a bid to out 'scroungers' the system has eaten itself and is spitting out vulnerable pitiful fodder like Daniel (played deeply sympathetically by comedian Dave Johns. He'll never win an Oscar but this part was made for him) and the lovable but deeply vulnerable Katie (played equally well by Hayley Squires - Call the Midwife).<br><br>He's had a heart attack and his doctors say he can't work but the Benefits Police say he has to go on jobseeker allowance and look for work or lose all entitlement to any money AT ALL.<br><br>It's farcical.<br><br>She's moved from a women's hostel in London because she can't afford a flat in London with her two children (one slightly miscast as a rather posh daughter, Daisy). She's having the same problems, only hers start from a tinpot Hitler chucking her out of the Job Centre for being late for her appointment.<br><br>They bond. He helps her. She helps him. It's grim but deeply affecting. We then follow their shared struggle.<br><br>In many ways this movie is like a Ken Loach Primer. It has all his usual trademarks and the 'working class people are good' message is laid on way too thickly.<br><br>But.<br><br>And it's a big but they are in a profoundly believable real-life drama and I found myself in tears (of collective shame?) three times during it.<br><br>It certainly makes the reality of food banks in Britain very, very meaningful. I won't pass a collection point again if my conscience holds up.<br><br>Everything that is good about Loach is in this film. In parts it's laugh out loud funny (but it's laughs of derision at our State). In parts it's deeply moving, even though some of the plot is verging on the ridiculous.<br><br>But who cares. Ken Loach holds a mirror up to our frankly DISGUSTING society and mocks it.<br><br>But he mocks it with the most vicious of venom. <br><br>It feels real. Really real.<br><br>It's a must see.","user":"markgorman","rank":[163,197]}]