[{"title":"Moving and worthwhile","rating":9,"date":"16 May 2018","review":"Kate and Singe fall in love as teenagers. Their idyllic life is challenged when their older son has cancer. He is in remission when Kate also gets cancer. Knowing her time is limited, she leaves multiple instructions for Singe and the boys for when she is gone.<br><br>Mum's List stars Emilia Fox as Kate and Rafe Spall as Singe (Singe is short for St John, what were his parents thinking?). This film is based on the real-life Singe's best-selling book, and takes a non-linear approach: we dart back and forth between life after Kate, the two of them as lovelorn teens, and their lives as young newlyweds coping with their son's cancer.<br><br>Filmed in Clevedon, using the actual locations of Kate and Singe's life and featuring family friends as extras, a strong sense of reality is generated. The film is thoughtful, emotional, tearful and, ultimately, uplifting and hopeful.<br><br>There have been a number of films in recent years centred around cancer sufferers, and I have some reservations about cancer as the basis for entertainment. Having said that, cancer exists and I see no reason to exclude anything as a subject for a film. And this one is compassionate, realistic and worthwhile: it doesn't pretty things up, but neither does it plumb the deepest depths of despair. It strikes a fair balance.<br><br>And, importantly, it features wonderful performances from both Emilia Fox and Rafe Spall, both of whom have moments which utterly wrecked me: Fox delivers an enormously moving monologue to camera, and Spall has a moment at a bar when he turns to ask Kate what she wants to drink and, of course, she isn't there.<br><br>So, while observing that this might not be everyone's cup of tea, I give it a guarded recommendation.","user":"neil-476","rank":[6,6]},{"title":"Heartbreaking, emotional story, beautifully crafted. Bring Tissues","rating":9,"date":"27 November 2016","review":"There isn't much to go on writer/director Niall Johnson who's apparently been fairly quiet since directing Keeping Mum and writing White Noise back in 2005. But he comes back in full swing directing this film based on the best-selling book written by St. John (Singe) Greene, the husband of Kate and father of their two children. <br><br>It's a truly heart-breaking story of the devastation cancer does, not just to the sick, or the body, but to those left behind as we watch the story unravel itself during the wake of Kate being taken by cancer. There's no surprises here, you know the outcome, but it's not about that, but about a celebration of love that stays and the emotional struggle some have to deal with after. The story does an amazing job of giving us the ideals and history of their relationship, the love and the things that matter most. <br><br>Johnson does a grand job cleverly flipping between with and without Kate, seeing the reminders, the flashbacks of happy memories and then the heart-ache and absence, the painful aftermath of trying to cope. It is, as the title suggests a list of things Mum/Kate wanted Singe to carry out after her passing, but it's not linear and instead has a lovely structure to help tell their story, working their way through the sweet list of things to do. <br><br>Rafe Spall plays Singe and gives, in my opinion, his greatest performance ever, hopefully doing the real Singe and family proud. Emilia Fox plays Kate brilliantly, powerful and joyful yet both give tear-provoking performances, showing what terminal cancer can do to a loving family such as the Greenes, actually being difficult to watch at times. <br><br>Impressive score from actress Amelia Warner with a mixture of touching modern tracks from Lauren Aquilina, Walking On Cars, Una Healy and some eighties classics reminiscent of their childhood romance. Including a good reworking of Simple Minds' \"Don't You (Forget About Me) by James Morrison. <br><br>Unfortunately I think this film is going to get overlooked or missed by many while on the big screen, which is a shame. It's such a touching story and a wonderful tribute to not just the Greene's but to everyone who has suffered or lost out to the dreadful C. It's a heart-rending, emotional story beautifully crafted together. Bring tissues. <br><br>Running Time: 9 The Cast: 9 Performance: 9 Direction: 9 Story: 9 Script: 9 Creativity: 8 Soundtrack: 9 Job Description: 9 The Extra Bonus Points: 10 for Rafe Spall's performance alone. Would I buy the Bluray?: Yes<br><br>90% 9/10","user":"SpoilerAlertReviews","rank":[17,23]},{"title":"Crying..","rating":10,"date":"25 April 2019","review":"After film I've been so emotional\nafter I knew that it's a true story my eyes made falls of tears\ngod bless her lovely soul","user":"nadia_abbas","rank":[4,4]}]