[{"title":"Great!","rating":9,"date":"8 December 2017","review":"This was one of the most entertaining movies I've seen all year. A compelling retelling of a great story, with a refreshing approach to movie-making and an awesome cast, and some very memorable characters. Underlying all of that was a credible presentation of some important real life issues, which didn't come across as being overbearing or politically driven.<br><br>The bottom line for me is that is was a enjoyable, well made movie about a good story.","user":"orangehenryviii","rank":[36,52]},{"title":"\"Dabka\" is inspirational, crazy, funny, and educational all at once, and in the hands of Buckley, exceedingly entertaining.","rating":8,"date":"2 June 2017","review":"\"Dabka\" is a true story about how a wannabe journalist's naivete and willingness to put his neck on the line paid off and made him a New York Times bestselling author.<br><br>The film is based on the story of Jay Bahadur, a young Canadian man who wanted very much to be a journalist but struggled to get a publication to buy his story ideas. Then, because of an interest in Somalia, he decided to scrape some money together and fly there, where he would interview pirates. Since virtually no western journalists were there at the time due to the dangers, Bahadur received help from the locals and got what he went after.<br><br>As fate would have it, the Captain Phillips hijacking took place while Bahadur was in the country, and the interest in Somali pirates skyrocketed across the world. Eventually, Bahadur wrote a book called The Pirates of Somalia: Inside Their Hidden World, which landed on the Times bestseller list. Today, he lives in Kenya, writes for top publications, and is considered one of the foremost western experts on Somalia.<br><br>Obviously, Bahadur put himself in danger and had many brushes with death, but the absurdity of the tale allowed screenwriter/director Bryan Buckley to find a great deal of humour in the story. The film is surprisingly what I would term a comedy, even as much of the subject matter is deadly serious. There is even some use of clever animation within the film.<br><br>Buckley starts the movie with a voice-over, as Bahadur's character is quick to say that he hates voice-overs. We see him in Toronto as played by Evan Peters, working in a job that's so boring, it's hard to believe it's actually a job. He has to visit grocery stores and interview clerks about how well a particular brand of napkins is selling.<br><br>In a bit of cinematic invention that Bahadur says didn't happen in real life, the character meets Al Pacino, who plays one of Bahadur's favourite journalists. Pacino plays it with his usual aplomb, of course, and tells his young protégé to skip journalism school and do something crazy.<br><br>Bahadur then finds a contact in Somalia via email and ends up in touch with the president's son. Eager to have their people accurately portrayed in the media, they arrange a body guard and translator, played by Barkhad Abdi, the real life Somali refugee who played the main pirate in \"Captain Phillips.\" Bahadur is immediately way in over his head and has to learn how to stay alive while flying by the seat of his pants.<br><br>In another bit of cinematic invention, Bahadur notices a beautiful Somali woman who sells the local drug in the market. The drug, which actually consists of leaves called KHAT that you chew to get high, is the price for gaining an interview with a pirate.<br><br>It turns out that the woman is one of the wives of a very dangerous and powerful pirate. In the film, a mild (but dangerous) flirtation with Bahadur ensues. In the Q&amp;A after the screening, however, the real Bahadur appeared on stage and said that while the woman did exist and was quite beautiful, there was no flirtation between them.<br><br>\"Dabka\" was mostly shot in South Africa, where the majority of the extras and Somali cast were real life Somali refugees. Abdi, who is a bit of a celebrity among Somalis after his Oscar nomination for \"Captain Phillips,\" often served as a translator and intermediary for the director and crew. (Abdi told the press that the friendship between his character and Bahadur in the film mirrored the strong friendship that he developed with costar Peters). <br><br>There are just a few seconds of actual footage from Somalia in the film that Bahadur shot from the window of his room. Over the credits, however, we're treated to some of Bahadur's photos, including images of some of the characters in the movie.<br><br>As far as I can tell, \"Dabka\" might just go unnoticed among movie- goers unless I'm mistaking or if it's the awards seasons. But do take my word for it: It is indeed inspirational, crazy, and educational all at once, and in the hands of Buckley, exceedingly entertaining.","user":"asifahsankhan","rank":[30,47]},{"title":"Although slow paced, an entertaining, informative and well put together production","rating":8,"date":"13 December 2017","review":"This type of docufilm is not my cup of tea as I'm more into the action/tension type films, but I still found it entertaining, informative and a well put together production with great casting, directing, writing and cinematography. Although the pace was too slow for me, still a great watch and thus a 8/10 from me.","user":"TheTopDawgCritic","rank":[19,28]}]