[{"title":"Should Have Been Better","rating":6,"date":"18 March 2018","review":"It's pretty safe to say I will never miss a film about New York artists, their lives and loves. So of course I paid to see \"Breakable You.\" I enjoy seeing my city in a film, and I enjoy seeing stories about writers and therapists, as I am both. So on a superficial level, I enjoyed this film. At the same time there was a lot about it, mainly about the characters and their choices, that left me cold. Perhaps that was the writer's/director's intention? I don't know, but I prefer to watch people in films struggling with \"Life Issues\" and resolving them in ways I like and approve of than in ways I find selfish, dishonest and morally bankrupt. What this means about Breakable You is that yes, it held my interest, but in the end, left a bad taste in my mouth.","user":"Moviegoer19","rank":[7,10]},{"title":"Breakable You is unforgettable","rating":8,"date":"3 September 2019","review":"There is more to this movie than meets the eye...as the title suggests the question is what does it take to break you? In this complex world and all of the obligations each of us takes on whether it be a play that doesn't belong to you-the head of the Weller's and taking your best friends hit play- with emotional depth that you could never have written because you're a narcissist--but you pretend that you wrote it only to be caught out by your ex-wife; or the fact that as the daughter of the Wellers, you're in a period of time of continual change, you're just finishing your thesis about morality, you broke up with one man and then take up with a man that's emotionally unattainable, (like your father) but no matter, you delve into that relationship, make him wake up, but then find out that not only he is an actor, (grew up with a father in the show business and the uncertainty that comes with that) but now you're having a girl baby that will be beset with any number of the same problems you lived through, so you're on the point of breaking; or the mother who is so angry with her ex-husband that she has an affair with his brother, the ex husband the narcissist has made a name for himself as play write but was marginally successful, you had to shoulder the financial load, angry that you were never emotionally satisfied in that relationship, but you had your work, your daughter, your own psychiatrist then you had to start all over at 58...\nThe Wellers are complex group especially in today's fast paced world when emotional health is often forgotten or left by the wayside, until it's impossible to continue without it.","user":"Maryjnberry","rank":[1,1]}]