[{"title":"Bad dreams","rating":5,"date":"26 August 2018","review":"If you are like me, you just want to be entertained for a few hours and Slumber fits the bill. Slumber isn't an awful movie, it isn't a great movie but the production is good and the acting is good. Not a bad way to spend a few hours.","user":"Fancytower","rank":[6,6]},{"title":"I wanted to like this...","rating":3,"date":"3 December 2017","review":"1st off it should be said that I wanted to like this movie as it had a good concept. I have actually been through a sleep study before, and so I was intrigued when I first heard about Slumber.<br><br>The movie started out OK but quickly took a turn towards unrealistic nonsense. When I say unrealistic I am not referring to anything supernatural as this is a horror movie and as such the perfect place for all things supernatural. What I am referring to is the writing for one, and the acting for another. The acting can be forgiven as this is a lower budgeted movie with a mostly unknown cast, but that does not excuse the writing.<br><br>I take great issue when people do, or say things in films that are simply out of the realm of possibility. Things that are just outright stupid bother me...<br><br>-----------------SPOILERS AHEAD------------------<br><br>One of these things that just made me scream at my TV after seeing it was when the family spends their 1st night at the sleep centre. It doesn't take long before they begin sleepwalking etc... The 2 technicians Alice &amp; Dr? (who were both away from their monitoring posts)hear screams and quickly go to investigate. They run into the room only to find everyone out of bed except for the son Daniel. They run over to Daniel and look at his chest and see bruises in the shape of a hand print. They then look to the daughter who is standing in a corner quietly humming to herself. When Alice approaches her the father springs out of the shadows and begins choking her. After some struggling the father is subdued by a janitor who just happened to be passing by, and in the next scene we see the father is being handcuffed and led away by the police. Alice tells the Dr. that she believes the father was sleepwalking the whole time, and the Dr. replies that it doesn't matter \"you saw the bruises on that boys chest etc...\"<br><br>So the 2 major things that I take issue with here are 1. The bruise on the boys chest was clearly a hand print, it's also very clear that it was a very tiny hand print, there's noway it was made by the hand of that father. Any police officer, or especially a Dr. would notice this right away.<br><br>And 2. I have taken a sleep study before and they monitor EVERYTHING, that includes video taping you while you sleep. It's even mentioned in the movie that there are cameras filming them the whole time, so Why on earth wouldn't they just review the tapes to see what had actually happened??? In real life that would have been the very 1st thing done.<br><br>You cannot become, or remain immersed in a movie when logic is just thrown out the window, and unfortunately Slumber is just filled with one head scratching moment after another. I think I'm being quite generous by giving this a 3/10.","user":"handsomebwonderfull","rank":[24,31]},{"title":"Great concept, falls short.","rating":4,"date":"7 May 2018","review":"The concept of a doctor studying demons during sleep paralysis could create a very strong plot; although there was very little climax in this film. The main actress was talented, the supporting actors were not bad as well. With that being said, the scenes were repetitious, and not very scary. I also wish they wouldve touched on the scientific side of these studies, instead of a google search: Folklore. \nGiving it a 4 because of a clever premise but in the end, lacked backing it up. Not a bad film if you want to be entertained but not frightened.","user":"amandakociszewski","rank":[5,5]}]