[{"title":"A pool phobics worst nightmare","rating":7,"date":"25 June 2017","review":"1 glass of wine in and I decided to give this one a go. Before I go any further I have to admit that I suffer from a fear of underwater drains. Anything man made underwater actually.. drains, lights, windows.. they all give me the heebie jeebie's. I have been this way as long as I can remember and I can no longer swim in pools. Google it, it isn't just me.<br><br>I'm not sure why this movie is getting so much hate. I totally enjoyed it. For a movie that had to be carried by only 2 actors and had only one setting it was done really well. It was also a very original idea and that is always something that I am looking for. The acting was great and I thought that the characters acted exactly as they should.<br><br>I read all of the reviews before watching and I don't agree with any of them. This isn't the most awesome thing this year and it isn't the worst. If you are looking for a big budget, action packed movie this isn't for you. If you want a slow burn thriller then give it a go.","user":"Shelpa","rank":[83,105]},{"title":"A slow burn thriller with real heart and emotion","rating":8,"date":"26 June 2017","review":"First off this movie is more of a dramatic thriller than a tension filled scare fest so if you have ADHD or need something exciting happening every 5 seconds than move on. I feel like people saw the name TOBIN BELL and are expecting a SAW ripoff. Second, I have a sister myself and the way the relationship unravels and develops between them felt honest and truthful. I won't lie I really cried at the cathartic moment between them in the end. If you're claustrophobic or get anxious in tight spaces I could see it dragging a bit but it felt like I was seriously holding my breath for the moments under water. <br><br>The story just worked for me on so many levels, I love how the Clara character wasn't just some one note evil-villain and you learned a bit about her past. Seems like she lost her own daughter at some point and had her own demons. The performance of the actress really helped me sympathize with her. The two girls were also multi-dimensional, going from bratty to frustrated and then defeated all in one scene. The near suicide had me in tears...<br><br>I'll be watching this again to pick up all the little moments I missed. Definitely worth a 7 or 8 in my book!<br><br>NOTE: And in case you do make it to the end, that was a glucagon pen and not insulin which apparently a ton of people missed.","user":"artlifelover48","rank":[51,69]},{"title":"Simple yet entertaining thriller.","rating":7,"date":"20 June 2017","review":"The story is set and shot entirely at a public pool. Two sisters, Joanna and Bree are swimming in the pool when, as it is closing, one sister has to dive back in to retrieve her lost Engagement ring. As she does this, the pool's manager looks, but does not see the girls as the second sister jumps in after the first to help her look for it. At this time, he closes the fiber glass top trapping them in for a long holiday weekend.<br><br>To make matters worse, there is a sadistic employee who is a parolee and gets caught trying to steal early in the film and gets fired. She is ordered to empty the waste baskets and finish out her day and not come back. The woman does come back hours after closing to discover the trapped girls but won't help. <br><br>There is a lot of underlying issues between the sisters, as well as the woman who not only will not help them escape, but taunts them as she is clearly scorned and injured herself. <br><br>I won't divulge anymore but will say I felt I gave this a generous 7 of 10 but feel it was mostly deserved. There is a lot of tension and frustration throughout and scenes that make you want to jump up and scream at the antagonist. Acting is well done and believable in a Simple setting. <br><br>A definite watch for any fan of light thrillers and time not wasted.","user":"stephenw-30180","rank":[70,101]}]