[{"title":"Interesting twist on an unexpected subject","rating":6,"date":"19 October 2019","review":"Eli is a pretty decent movie for those who are interested in viewing a long practiced art form from a different perspective. Without providing spoilers, it has the ingredients viewers would require for a watchable movie experience.<br><br>The main character considers his life to be horrible, due to being unable to enjoy life like everyone else. He finds himself living his existence like bacteria in a Petri dish. For those who remember, he is much like bubble boy, without the comedic adventure.<br><br>However, after arriving at a \"Clean House\", where a certain doctor is supposed to be able to cure him of his physiological affliction, Eli soon finds himself experiencing a more supernatural level of drama.<br><br>The story continues with Eli discovering more than he was expecting of the Doctor by his interaction with a visitor outside the house. In addition, the therapy he receives appears to be doing little to alleviate his condition. And finally, young Eli learns that his parents were also hiding some things from him.<br><br>The movie was not fast paced, but it wasn't too slow either. I actually enjoyed the twist because it was something I hadn't expected from the information we were provided.","user":"dwainereyes","rank":[92,111]},{"title":"I liked it!","rating":6,"date":"19 October 2019","review":"This was not a bad movie at all and some of the negative reviews on here are way off mark. It's not a scary movie, in my opinion, (unless you scare easily) but it is interetsting and entertaining. I like twists and this one had a decent one. If you like TV Shows like Supernatural or others like it then you will probably enjoy this movie.","user":"mmundoiii","rank":[182,227]},{"title":"Not what I expected","rating":8,"date":"18 October 2019","review":"I watched this not knowing anything about it beforehand. It started a little slow, but got creepier as it progressed. It was becoming a decent supernatural/haunting film when it changed abruptly.<br><br>Actually, abruptly is an understatement. The twist completely changed the tone of the entire movie, even the genre.<br><br>At first I wasn't sure I liked the twist but by the end of the movie I was digging it.<br><br>Overall, there the film doesn't break much new ground, but it is a solid horror film with decent acting and nice cinematography.<br><br>I'm curious to hear what others thought of this. I thought it was a pretty decent movie.","user":"Kenny918","rank":[128,168]}]