[{"title":"Short, Simple, & Average","rating":4,"date":"22 October 2016","review":"To summarize my review in advance; The Thinning is a dystopian science fiction movie that has some superb moments, but lacks the wholeness of a truly great or good movie.<br><br>To begin, The Thinning is about a dystopian society that takes place sometime after a major global warming event that left the Earth's landmass much too small for it's population. In response, the nations of the world came up with different ways to reduce the growth and size of their population. While other countries resorted to ending the lives of those of old age or limiting family size to one child, the U.S. decided to adopt a program that would only allow the smartest children to survive.<br><br>Right after this introduction is where the movie began to fall apart. The backstory for the characters was interesting, however it did not successfully help the viewer \"attach\" to the story of the reader. When tragedy strikes near the beginning of the movie, it's hard to feel the characters emotions. I did not feel connected with the characters, only amused by them.<br><br>There are also many minor details that fail to bring this movie up to par. You have to wonder why many students take a backpack to simply take a test on a notebook. You also wonder why the students (before and after) seem to be either lackadaisical towards the test and it's consequences or extremely anxious. They seem very emotionally inconsistent about the fact that many students will be put to death a mere hour or so after the test.<br><br>Another thing I found annoying about this movie was the poorly written script. It was quite simply... simple. There were no memorable lines and everything was quite frankly something you've heard before. I should note something important here... a movie does not need memorable lines; it needs emotionally relevant and imaginatively excellent lines. At many points, the lines were simply \"decent,\" and at more rare parts of the movie, the lines felt like reading the words \"good\" or \"bad\" in an English essay.<br><br>Now on to some of the things I enjoyed. I enjoyed a few moments where the acting was on par with the importance of the scene. When the students had just taken the test, you can see their anxiety, relief, and unique responses to show their emotions. I also enjoyed the color pallet used in the movie. It was relevant and consistently aided to the intensity of the movie.<br><br>The last two things I enjoyed were the camera shots, which were not exceptional, rather simply nice. The editing and music also aided to the importance of the story.<br><br>I did enjoy parts of this movie, however these parts were the minority of a more-often-than-not simple and dull movie.<br><br>(NOTE: I believe in completely fair reviews. I am against giving 1 or 10 star reviews based on the current rating and my personal belief if it is too high or not. I encourage everyone to have someone check their rating against their thoughts about the movie to see if they align. That is how you should properly rate a movie. Share the word!)","user":"blacktigerleader","rank":[35,47]},{"title":"Utter Crap...","rating":1,"date":"15 September 2017","review":"I don't normally swear but by god after i had watched this abysmal effort i had to so please forgive me IMDb its not my normal modus operandi.<br><br>Terrible acting especially by Napoleon Dynamite clone Logan Paul - apparently he is some sort of vine social media z-list celebrity but he is butt ugly and has zero persona and acting skills and actually made me want to turn it off in the first 5 mins but due to my OCD i had to watch it to the end!<br><br>The movie copies what has already been done to death with Hunger Games and The Purge = It seems the movie scene these days is all about either copying what has already been done or remaking old classics badly! Zero originality - all these producers have to do is pick up a copy of 2000AD comic from the 80's and make a movie like BLACKHAWK, WOLFIE SMITH, ROGUE TROOPER, FIENDS OF THE Russian FRONT, MELTDOWN MAN OR PLANET OF THE DAMNED - There are literally hundreds of good ideas from that era waiting to be made!<br><br>Seriously if you are going to make a Scifi movie like this you really need to spend a little more than 100k and it shows.The whole movie looks like it was filmed in the corridor of my old school for 50p and a bag of monkey nuts!!!<br><br>The main baddies looked like the Vinnie Jones thugs from the Arnold and Stallone movie Escape but a hundred times worse and i never thought i could say that about Vinnie \"the untalented\" Jones but they make him look average.<br><br>And who was the main bad guy doing his bad attempt at a Danny Trejo impression - JEEZ.<br><br>This is seriously ordure and shouldn't have been made its that bad!<br><br>Apart from the overtly politically, leftist, limousine libtard bias we seem to see in every film these days and which really makes me mad but what is even more annoying is they seem to be catering so much for \"THE 100\" yoof viewers low intelligence and bland story lines - its actually a tragedy for the movie industry if this is what going to the cinema is to be replaced with Amazon, Netflix, Youtube rubbish like this - this would probably have fitted into being an episode of Black Mirror...Maybe but it certainly didn't deserve to be made into a movie.<br><br>I gave it 1 only because of the rather excellent end credits music and for the relief that is was finally all over!","user":"omendata","rank":[39,54]},{"title":"**This review contains spoilers**","rating":6,"date":"16 July 2017","review":"I just want to say one thing about this movie. It was an alright movie but it was hyped up too much. This movie is set in the future where the Earth is lacking natural resources to keep the existing population so in the United States or maybe just Texas (I still don't know) students take a test. If they pass they live and if they fail they are \"killed\". At the end of the movie they show Logan Paul wake up on an elevator where he sees Lia Johnson alive and working on some sort of assembly line. This is the part I don't understand. If the Earth were lacking natural resources and we wanted to use less resources then why would you keep the failed students alive? They would be using the same resources as if they were \"alive\". After seeing this at the end are realizing that they aren't actually being killed I was really confused because then the system is pointless.","user":"robfoley-31570","rank":[4,4]}]