[{"title":"Well Presented Doc on a Multi-Talented Genius","rating":9,"date":"7 November 2018","review":"In-depth documentary on the life and career of the immensely talented photographer, costume and set designer, illustrator, author, and painter Cecil Beaton. I thought the film captured well his incredible driving and creative force to illustrate what he regarded as the wondrous beauty in this world, aside from what reality truly was. To note, there were no subtitles on my DVD copy.<br><br>Beaton, who died in 1980 at the age of 76, is depicted giving candid interview excerpts here, and there are many other interview clips from those who knew him or were inspired by his work. But the real power of this movie, is in the incredibly striking photographs he took, as well as the dazzling costumes and lush sets he designed for such films as My Fair Lady and Gigi.<br><br>Overall, the documentary, most ably narrated by Rupert Everett and directed by the talented Lisa Immordino Vreeland, is a well presented look into the world of a multi-talented genius, as I see it.","user":"larrys3","rank":[5,5]},{"title":"Did not feel the love, but it was a decent watch","rating":6,"date":"16 July 2018","review":"\"Love, Cecil\" is a new American English-language movie that premiered back in 2017 and it is the most recent directorial effort by award-winning filmmaker Lisa Immordino Vreeland. The focus here can be read in the title. This is about 3-time Academy Award winning multi talent Cecil Beaton, his life as well as his art. And in both fields, the film elaborates fine I guess. You will learn some new stuff, regardless if you know nothing about Beaton (like myself) or already know a thing here and there. I also don't think that it is really important if you like or dislike Beaton (don't think a neutral approach is possible with him) in order to enjoy the watch here. It all comes down to personal preference. If you have a great interest in fashion, you will like certain parts especially. If you care about old Hollywood, you will like other parts. If you care about history, maybe even in terms of newspapers and politics, there's something for you in here as well. For me it's the thing I mentioned second I guess, or maybe everything except the fashion part really. The interviewees here are not too well known, with the exception of Capote, which shows you there is old footage in here too that does not only include Beaton. But all interviewees have something interesting to say I guess nonetheless, so it is not a problem. There are some old recordings that are really interesting to watch I would say. Enjoyable stuff, but I don't think the film ever really lived up to the quality it could have been in terms of the glamurous figure Beaton was. Or I just see too much in him. This is a film about a homosexual man struggling with his time, but it's never about the issue of gay rights or anything. The focus is on Beaton and not on any larger issues in society back then unless Beaton was responsible like the antisemitic comment that he managed to work his way out of during the years of World War II. All in all, the documentary was a decent watch. Not a must-see, not among the best documentaries, let alone movies, of the year, but definitely worth seeing. The film touches many interesting aspects aside from Beaton and does well in never digging too deep because otherwise it could have left its focus on the protagonist. Pretty much a quality we have here that is exactly the level i thought it would be. Go watch.","user":"Horst_In_Translation","rank":[2,4]},{"title":"Entertaining docu","rating":7,"date":"31 December 2018","review":"A well made documentary on the life of Cecil Beaton. A man with a great imagination despite being a victim of his time.<br><br>Certainly not an easily likeable person: but isn't that true for all artistic exceptional intellectual or creative people?<br><br>Worthy of watching to see his mark on art in the first half of the 20th Century.","user":"cekadah","rank":[0,0]}]