[{"title":"Left for dead by Ed","rating":8,"date":"20 July 2018","review":"This retelling of the death of young Kennedy entourage \"Boiler Room\" secretary Mary Jo Kopechne and the involvement therein (or lack of same, arguably) of rising US senator and last surviving brother of the Kennedy family dynasty, Edward Kennedy, holds back little as it nails its accusatory colours to the mast.<br><br>I re-read as much background as I could on the tragic incident and it's difficult not to come to the same conclusion as the writer and director of this movie, that Kennedy firstly failed to attempt to rescue the stricken girl immediately after he escaped the sinking car, then got two of his slavishly obedient underlings to repeatedly dive into the river to try to save the girl, didn't report the matter immediately to the authorities where we learn that if he had, Mary Jo might even have made it out alive, before most shamefully of all, he played down and indeed lied about his role in the matter to go along with the abhorrent advice of the supporting Kennedy machine, a phalanx of important Democrats, including former Secretary of State Robert MacNamara, to cover up his part and so keep alive his future eligibility for the presidency. <br><br>As usual in dramatisations of real life happenings, some dramatic licence appears to be taken with events. For example was Ted Kennedy really so scared of his elderly, paralysed father, the family patriarch Joseph (played by an unrecognisable Bruce Dern) and so ashamed of himself as the underperforming last son of the family to justify acting in this deplorable spineless way? Then, was there anything sexual between Kennedy and Kopechne on the night - there are cryptic but inconclusive flashbacks shown hinting at something and Kennedy, whose wife hadn't made the trip, was a known womaniser. Did he really contemplate resigning the Senate right up to the last minute before caving into the surrounding peer pressure and instead turn his live TV broadcast into the contemptible self-serving speech it turned out to be, including his horrendous assertion that this was the infamous \"Kennedy Curse\" working on him - this just in Senator Kennedy, you didn't die, Miss Kopechne did - and in so saying, trying to bathe in the reflected glory of his two slain brothers? I also thought it was a major mistake to fail to mention the substantial payment that was made to the dead girl's parents, presumably to hush them up.<br><br>Only one person knows what happened on that fateful night and I concur with the film-makers' assertion here that Kennedy not only acted in a selfish, cowardly way at the scene - he even tried to weasel out of this by faking a medical report that he was concussed in the crash which affected his actions and then compounded the felony by \"wearing\" a neck brace for effect at the funeral.<br><br>This as I said is a brave film, justifiably, I believe, taking a side and having the courage of its convictions to stick to it. Jason Clarke is excellent as Kennedy while the rest of the lesser known cast give him credible support. The direction could have done with less of the voguish drone shots which seemed at odds with the realistic approach adopted elsewhere plus I found the soundtrack dull and again lacking affinity with the era portrayed.<br><br>I doubt this film will gain wide distribution but hope it does. It's an excellent drama, the tragedy of which is how realistically it depicted a tragically avoidable real life accident.","user":"Lejink","rank":[102,109]},{"title":"A Competent Film on a Serious Event","rating":8,"date":"7 April 2018","review":"The movie is well made, moves a little slowly but is compelling due to it's subject. The actors do a superb job. Even Ed Helms and Jim Gaffigan manage to make you forget who they are. <br><br>Kennedy and his handlers do not come off well, of course. It's a not a documentary and I do not trust Hollywood or the media to portray anyone historical character completely accurately.<br><br>For me, there are 2 take aways from the movie:<br><br>1. This was a sincere young lady whose life was cut much too short. It was difficult for me to watch her on screen knowing what was about to happen to her. She deserved better. Sadly, she is a footnote in history. We should refer to it as the Mary Jo Kopechne scandal, not Chappaquidick.<br><br>2. The end of the film featured \"person on the street\" interviews from 1969. It was amazing to listen to the ones who dismissed his short-comings and continued to support him. Seeing those interviews in the Trump era makes for an interesting perspective. Ted Kennedy, Bill Clinton or Donald Trump, the American voter on both sides of the aisle will look past a man's sins if they think that person will advance their political agenda. The opposite is also true: People will mercilessly and unflinchingly condemn a person for his shortcomings if they don't agree politically. This was true during the 2016 election cycle. It was never about Hillary or Trump's demons, it was always politics. Until that is understood, people will never get why Trump has support.<br><br>The biggest unanswered question for me is: how did Kennedy get out of the car. If the doors were jammed shut and the windows unbroken, which kept anyone from getting Mary Jo out of the car, then how did he get out?","user":"dan-2199","rank":[96,112]},{"title":"Very good production. Almost dead on history worth seeing.","rating":8,"date":"7 April 2018","review":"For those that grew up with the Kennedys, and anyone that didn't (ie, everyone) this story needs to be told. I think the movie was done well - acting and production - but that is not the purpose of the movie.<br><br>I knew a lot of what happened from reading over the years. But - this was an amazing portrayal, and accessible to the story for those less interested in politics.<br><br>The bottom line? At least Ted, (and if you know the history - his father) were very compromised people. They would, in the end, do anything for power no matter who got in their way. (And as the movie shows, there were always people that would work for them, or vote for them, and dismiss the truth that they knew about them.) From all things that have come out - John and Bobby had great similarities (especially with women).<br><br>I hope younger people look at this. Ted's faults were his own demons to a great degree - and these were portrayed very well. I would say what we have seen in the last few years is even more damaging to us, and more corrupt. And - if it takes a movie just to say - that people in politics ARE that dirty and DO lie that much - it will be useful for our country.<br><br>Nuff said.","user":"lima-27-181038","rank":[91,110]}]