[{"title":"Solving issues with kindness","rating":7,"date":"31 December 2017","review":"You could also call this \"the problem kids\". It's a documentary about kids that society does not seem to want. And that's why they are shoved to a special school. Good thing for them, they do get help there. But as we all know, the only person that can really help you - is yourself. And that's a point the documentary tries to make and succeeds in.<br><br>If you don't like documentaries at all, then you shouldn't bother obviously. And as it is, this won't be for too many people. Especially those who try to escape from reality. Because this feels as real as it gets. And it doesn't shy away from showing peoples downfalls and their emotions (good and bad of course). So you have to decide based on that, if this is something you want to watch. Can't blame the movie if you know what you let yourself into.","user":"kosmasp","rank":[5,6]},{"title":"There are NO BAD KIDS. There are only Bad Parents.","rating":10,"date":"23 September 2017","review":"I haven't written a review before. But after watching this film, I decided to write something that I felt and I experienced while I was teaching in one of the schools in Korea. The majority of this school I was teaching were kids of refugees or kids from the foreign workers. Some kids had so many problems in their house. their parents beating them, police come to the school because a father of one of the kids raped his own kid. Some of them had serious depression that made them go to the toilet with a small knife during the break time. They would cut themselves in the toilet. And they were only 11, 12, 13 years old. When I was watching this documentary I burst into tears so many moments. Really, they are helpless children. They are just brought to this world and they don't know how to defend themselves while their own father beating them. What made me so devastated is that whatever I do in the class, I can't change lives in their house. whatever I do, when they go back to their houses, they will have same reality unless their parents change. There are NO BAD KIDS. There are only Bad Parents. I feel so sad, truly sad, how many kids should get suffered not knowing any reason? But I know, I myself was a child who didn't want to go to school, and my teacher who I met when I was 14, changed my life totally. If I didn't meet him, I would not be alive now. One person can change something. And teaching only can be given by loving person. that's what I learn from my life.","user":"minj-21292","rank":[6,10]},{"title":"Amazing footage","rating":8,"date":"17 March 2018","review":"Documentary shows the work of teachers to help kids graduate despite what is happening around them that impacts on their chances to succeed. Amazing footage and the kids are wonderful. Standout is Principal Viland. Probably would have liked if producers had interviewed kids or teachers directly, but in a way that would have been easy way out. Working from \"fly-on-the-wall\" approach ensures realism, as far as possible.","user":"JohnnyLee1","rank":[1,2]}]