[{"title":"Great dance movie with love intertwined","rating":9,"date":"15 August 2018","review":"So enjoyed this movie. Loved the plot, dancing and characters. Tried to learn the moves. Watched it about 20 times. Would really love to see a sequel with Krystal and Amitash","user":"mreial","rank":[6,6]},{"title":"When you have nothing to lose....","rating":10,"date":"3 February 2018","review":"This is an interesting love story, a tale of two people from opposite ends of the Earth who meet by happenstance. Kelli, is a girl from Los Angeles, who should be studying law at UCLA, instead she cashes out her tuition and her living expenses to pursue a serious career in dance and hide it from her family who live probably somewhere in the midwest. Her father's friend's son is getting married in a traditional Indian wedding in India. You def get a sense both families are pretty upper middle class. Kelli begrudgingly goes with her parents and younger sister. Once she arrives to India, she is met with the groom's family, whose daughter is her age and who she danced with back in the states and is definitely raised Indian-American. As wedding starts to begin, she meets a handsome Indian man who is there to entertain guests and choreograph dance shows. Later in the movie we find he comes from a small rural village in India. He came to India to pursue his dreams to be a part of the Bollywood dance industry. He has 100% support from his family, living paycheck by paycheck and has nothing to lose, meanwhile Kelli is someone who has a lot to lose: her family (especially their approval) and the possibility of failure. Law school in the back of her mind, is obviously the mature alternative. So what is this girl to do? This is where their romance gets interesting, this strange meeting of two unlikely people and this is why this dance movie isn't really just a dance movie. I was in middle school when \"Save The Last Dance\" came out and that was a fun classic. This movie has a little bit of Linklater's \"Before Sunrise\", \"West Side Story\" and \"Romeo+ Juliet\" ... I really liked the film.. I didn't read up much on the film but thinking back I found it special. It's different and it takes you to the beautiful country of India which I indeed will visit after seeing this film. I encourage anyone with an open mind and heart to watch this one.","user":"nickmar-31499","rank":[6,6]},{"title":"Like the music and visuals.","rating":8,"date":"6 September 2019","review":"I fell hell over heels with this story. It's cute and a lot of culture. India looks beautiful, Amitash is easy on the eyes. I'd love to go to India someday - maybe I'll get invited to an Indian wedding! It was great to understand more of the customs as I didn't know India could relate to western culture - the dancing was nice. Great music too! Maybe more like \"My Big Fat Greek Wedding\" but for a younger audience.","user":"bumble9192","rank":[2,2]}]