[{"title":"Werner at his best","rating":9,"date":"26 January 2016","review":"I was lucky to see this at Sundance with one of the best audiences. <br><br>Somehow, even after Werner's extensive resume, this was his most immersive and informative documentary yet. <br><br>The film doesn't just touch on the basic history and fundamentals of the Internet, but provides such a deep understanding of its past, present, and future. It dives into the wonders of what is possible while carefully reminding us about its dangers, all while Werner gives a very comedic voice-over. <br><br>It's a shame that Roger Ebert isn't around to view this film. I know he would've been proud of his friend for creating such an accomplishment in documentary filmmaking.","user":"JordanSatmary","rank":[56,72]},{"title":"Amazing survey of the best and the worst of the Internet","rating":9,"date":"24 April 2016","review":"I just saw this film at the SF Film Festival. I thought it was excellent. It was far better than I expected. I am not a tech person and assumed I would not really appreciate the subject matter. I only went to see it because I usually enjoy Herzog films and figured I would give it a chance. <br><br>Wow, it kind of blew my mind to see the range of material that was covered. I was quite impressed that he managed to cover such a large canvas and each segment was fascinating. He created 10 segments, each focusing on a different perspective on tech. I really liked the fact that he started from the beginnings of the Internet and interviewed many of the earliest key people involved. This record of their experiences makes the film an invaluable document of history. <br><br>I also really liked the fact that he confronted some of the very serious problems that the Internet has created in our world and didn't just focus on the wonderful aspects. <br><br>Definitely check out this film, whether you love the Internet or hate it, there is great stuff here to ponder....","user":"sfdphd","rank":[40,54]},{"title":"Herzog's worst documentary, just when we need him most","rating":4,"date":"12 October 2016","review":"There are very important, tough questions that need to be asked about where technology is leading us. \"Does the internet dream of itself?\" is not one of them. This effort from Herzog is a major disappointment but not a surprise, partly because it started out as a corporate promotional video. Also because most of his docs are ostensibly on subjects that aren't that interesting or important on the surface, but he makes them riveting. Here, he's tackling a subject about which everything that can be said, has already been said, except for the hard questions. Is the internet even a net positive thing? Why bother going to Mars? It's getting harder and harder \"to make a contribution\" (to science, or to society), so what does that mean for us? Soon enough robots will beat Messi at football -- will anyone want to watch that? These questions don't get asked. And these are easy ones that came up anyway. <br><br>Herzog, who is a known non-tech guy, just seems ignorant and uninterested in technology, both the good and the bad of it. And we need him to pry forcefully into the moral morass that it's dragging us into. But he can't. He's just a baby boomer who is completely immersed in his real- world occupation that doesn't involve surfing the internet. He doesn't know, doesn't care. So unfortunately, he has gathered the most maddeningly thick-headed \"scientific experts\" to make bland, vapid observations about how amazing it all is. This is a huge disappointment. Werner is just not the man for this job -- so he's moved on to something more up his alley; volcanoes...","user":"zelena33","rank":[54,77]}]