[{"title":"No redeeming qualities... by far Lohan's worst film.","rating":1,"date":"5 March 2019","review":"What an absolute turkey and by far the lowest point in Lindsay Lohan's rather disorderly acting career. I'm guessing she needed to eat when she signed on to this steaming pile because \"Among the Shadows\" makes one of her most hated films \"I Know Who Killed Me\" look like a cinematic masterpiece.<br><br>The plot - which is mainly political - is so poorly written that it is hard to follow. The scenes have no flow at all and the whole movie feels like a bunch of random scenes poorly strung together. Because of the terrible script it makes a very tedious and boring viewing, making 90 minutes feel a lot longer than it actually is. As for the vampires and werewolves...well, they are heavily underused and thrown into the mix for no real reason.<br><br>The fight scenes, shocking CGI, editing and directing are awful and reminiscent of a no-budget student film. The scenes with the joggers...were they a joke? The extras were so bad - and they did the same scene twice! There's an abundance of quick cuts, shaky-cam and bad edits prominent throughout this whole mess. The horrific acting from the mostly unknown cast and overuse of narration from the lead actress just make the film even more insufferable than it already is.<br><br>I'll make my last point about Lohan. A truly bad performance from a once promising young actress. And despite being heavily featured in all the promotional material, she isn't even the lead. There's even times where she is replaced with an obvious stand-in (problems on set?) or not even sharing the scene with her co-stars. The very first \"talking heads\" scene with the lead actress and Lohan - clearly neither are in the same room and it's painful to watch.<br><br>This is truly among one of the worst movies I've seen - and I don't give \"1\" ratings lightly. If you want to see werewolves and vampires done right then just watch one of the Underworld movies. And if you want to see a decent Lohan film, well, I think that ship sailed long ago.","user":"Slasher_Guy","rank":[58,66]},{"title":"What could they possibly have spent $12,000,000 on?","rating":1,"date":"6 March 2019","review":"First I should mention that I got to see this with two friends for free - if you search in the right spot and add \"Lifetime movie\" to the title you will find that someone has already pirated this piece of dross onto the internet.<br><br>This will never become a cult classic since it's not \"awful but funny\", it's just plain awful. The plot is impossible to follow, the actors are amateurish and some are downright impossible to understand, the lighting is abominable, werewolves and vampires come and go for no discernible reason, there's no continuity between scenes and . . . well I could go on but why bother.<br><br>And then there's this, what is the need of a smoke machine for an interior scene?<br><br>Since Lindsay Lohan is the only recognizable name in the cast(except maybe Charlotte Beckett), let's talk a bit about her performance:\n<ul><li>She delivers every line in a flat, gravely voice.</li><li>Her eyes dart to the left and right as she reads her lines.</li><li>I'm going to guess she blew off coming in every day after a while. In some scenes, it's obvious that they just put her in front of a green screen and spliced her in with actors who already filmed the scene without her.</li><li>There are actually times when there's a body double who neither looks or sounds like Lohan reading her lines. BTW, this is not a bad thing since the anonymous person is a more convincing actress than Lohan.</li><li>The only good thing is she's not in a whole lot of the film, at least for the 50 minutes or so that I managed to watch this.</li></ul><br><br>Now let's talk about what's good about the film, or at least what didn't repulse me, and that would be the aforementioned Charlotte Beckett.\nShe's pretty, she looks good in black, she's a passable actress who doesn't need to read her lines off of a large piece of markerboard. That's about it.<br><br>To sum it up, this will never be a cult favorite but it could be the final wooden stake in the heart of Lohan's career. On the other hand, that Saudi Arabian production of Lohan starring in an all female film about an American woman who comes to teach a harem about God knows what sounds intriguing (said no one, ever.)","user":"quislingmcconnell","rank":[29,36]},{"title":"How did this get off the cutting room floor!","rating":1,"date":"12 March 2019","review":"Sweet Jesus this film is awful. Not bad, not poor...just bloody awful.<br><br>Don't waste your time.","user":"plangdon-48221","rank":[16,19]}]