[{"title":"An 85 min long cheesy Sci-Fi that was 1 hour too long. Why?","rating":2,"date":"11 February 2019","review":"Wow what a mess. At 1 hour and 25 mins long, this film was 1 hour way too long, and it felt like 3 hours (I had to FFWD many times). Useless scenes with terrible fight choreography, wasted lame dialogue, 1980's SFX (although some VFX where fairly decent), cliched and dragged out plot, and pacing slower than a snail.<br><br>A 5th grader could have written a better screenplay and directed this better than writer?/director? Brandon Slagle. He failed miserably directing his cast, as they seemed like this was their first acting role in a high school drama.<br><br>The dialogue was so amateurish, it was painful. The cheesy humor was the lamest attempt I have ever seen. The costumes looked like someone raided a junkyard.<br><br>I don't mind the odd cheesy sci-fi, but this one was a waste of my time I will never get back. How did this even ever get produced? I hope Baldwin and Fox got paid well.<br><br>Pass on this mess, even if you have nothing better to watch. It's a very generous 2/10 from me.","user":"TheTopDawgCritic","rank":[20,24]},{"title":"This needs negative stars!","rating":1,"date":"6 February 2019","review":"3 mins in... oh dear, worse than the trailer so far!\n7:30 Acting: none yet...\n10:00: I think they are going for the cliché world record!\n16:00 Naked hooker robot. ✔\n20:00 \"Old comrades meet and bond\" ✔\n23:04 \"This is a simple mission\" ✔\n24:00 \"Clean and by the book!\" ✔\n26:00 \"Hesitation can get you killed!\" ✔\n29:00 \"This is not what we signed up for!\" ✔\n35:00 Argh! I can't take it no more! That trailer is the best of this...dreck!\nIf you can believe the inside of a ship's engine room is a space ship, and you can't tell good from bad acting, plus you've never seen a science fiction or action movie, this might be for you.","user":"mike_nightingale","rank":[26,35]},{"title":"This is not what I signed up for.","rating":1,"date":"10 February 2019","review":"Simply embarrassing. Couldn't watch more than 15 min altogether. Too painfully bad. Awful script, amateurish acting, childish artwork...","user":"sleggg","rank":[12,16]}]