[{"title":"Remarkable documentary - have patience as all will be revealed","rating":10,"date":"10 June 2018","review":"At first, I thought this was an okay film.10 minutes later I thought it was very good. 10 minutes after that, I realized it was excellent. The pace is slow, deliberate, and has more than its share of \"Holy cow!\" moments. Be patient as there's a huge story that needs to be told and it has a cast of thousands. Using old movie footage (from films both preserved in Hollywood and \"found\" in Dawson City) and interviews with some of the people \"who were there\", Bill Morrison has crafted a big story of a small town in a very big world with history playing out all around it.<br><br>An extraordinary piece of documentary film-making. Bravo!","user":"barryjaylevine","rank":[12,13]},{"title":"Wonderful Combination of Gold Rush and Cinema History","rating":10,"date":"17 July 2017","review":"This is a must see documentary. It is a fascinating story of both the gold rush and the silent film era. As a film buff I was impressed by the story telling that included photos, film footage of that era and the film that was recovered in Dawson City. The music score blended perfectly with the story telling. This film has \"Best Documentary\" Oscar written all over it.","user":"suzy-63","rank":[20,24]},{"title":"Outstanding documentary","rating":10,"date":"28 July 2017","review":"Bill Morrison, the director and writer of Dawson City Frozen Time, is my new hero. Through an odd set of circumstances he landed at the National Archives in Canada and learned about the stash of silent films discovered as part of a landfill site in the Yukon. Early films were made on highly flammable celluloid, and in a new industry (the first film was in 1895 in France) creating an archive was definitely not considered. So, discovering over 500 \"lost\" silent films from the early 1900's was like discovering gold all over again. (A gold rush was how the city of Dawson initially came into being !!) Mr. Morrison has woven together the story of silent film, the Klondike gold rush and the creation of a city. If you have the opportunity to see this film, please do so. I expect it is going to win a few awards !!","user":"SusanShop","rank":[19,23]}]