[{"title":"Lots of reviews by cult members","rating":10,"date":"7 July 2016","review":"I don't review movies here BUT I read the extremely negative reviews and was curious. All were by new members with this being either their only review or maybe one or two additional ones done soon after to legitimize their reviewing credentials. Obvious plants by the still faithful. Sadly they are still out there. <br><br>Their reviews did not have the result intended. They piqued my curiosity and I sought out this film. If you are fascinated by cults or a fan of documentaries seek this film out. It's a rare thing to have this much inside footage of a cult leader and his followers in action. To outsiders the machinations of this vain Svengali seem transparent and obvious. So vain that he was the one who had all of this footage shot. Meeting the members you gain insight, sympathy and understanding as to how and why seemingly intelligent, aware individuals can be swept up by someone and something like this. <br><br>The film is well constructed, clear, emotional and does have a point of view. That point of view is what gives this film it's fire and passion. It's made by ex cult members and boy are they angry. It doesn't pretend to be a cold, objective view on what went on there and I think it is better for it. Imagine a film about Scientology made by angry ex-members or a film about the Manson family made by a disillusioned, embarrassed, remorseful ex-member. Oh the truths we'd learn! <br><br>My only complaint is that I wanted a cathartic confrontation with the cult leader at the end. There is a confrontation but it seems muted and sad rather than explosive and angry. <br><br>See this well made documentary if you can. It's an eight but I'm giving it a ten to counterbalance those idiotic one star reviews.","user":"spencerthecat","rank":[86,95]},{"title":"Pretty weird stuff....","rating":9,"date":"12 December 2016","review":"\"Holy Hell\" is a documentary about a very small cult led by a man named Michel. The man who made the film happened to be the videographer for the group...and so he had a huge cache of footage that he could use to make this film. It's his personal journey as well as a history of the group during the years when he was a member.<br><br>Using hypnotic techniques and a charming personality, Michel amassed a group of about 200 followers. However, over time, it became obvious that Michel was not quite the man he said he was and ultimately many within the group left...disillusioned and angry. I could say more but don't want to spoil the film.<br><br>While this is a small cult, it is unusual because of all the video footage and that makes for a very compelling and interesting film. It's currently available streaming from Netflix and is well made and worth your time.<br><br>UPDATE: I watched the film again. This time I found I got a bit more out of it and am updating my score to 9, as it's a GREAT general film about cults and would be great for families or friends struggling with losing people to these groups.","user":"MartinHafer","rank":[20,21]},{"title":"Essential Viewing for all Seekers","rating":10,"date":"3 August 2016","review":"Excellent documentary that gives a first hand look into the power of social influence in a group dynamic. This film is a study of a teacher who has abused his power and uses his social influence to manipulate and control the members of the cult. It's equally parts disturbing and inspiring as the cult members seek the truth and expose the teacher to gain their back their own freedom of mind. <br><br>If you are interested in how cults operate from an insider's perspective, this film is invaluable. A must see for all everyone as the lessons here run deep and the journey of the members is both moving and profound.","user":"andrew-90663","rank":[39,47]}]