[{"title":"A couple of powerful scenes but too long, slow-paced, bad written and repetitive","rating":6,"date":"19 October 2016","review":"The summary is a perfect description of this second OVA. The writers are stuck here, they played it well in the first movie using the nostalgia element a lot, but now it turned out to be repetitive. Two of the four episodes could be completely removed, the first one and the third. Actually I'm sure this whole movie could be summarized in a 20 minute episode.<br><br>The first episode is nothing but fanservice. At first I thought the idea was giving more depth to Mei's character, but actually the episode's objective is to show some funny (and not so funny) scenes and some fanservice of our main characters on a sauna. That's it, that's the first episode.<br><br>The second episode is relatively interesting because of Joe's conflict, pretty similar to Taichi's in the first movie (Taichi hasn't overcame it yet, by the way): he doesn't want to fight anymore, he wants to be a man, grow up and let the Digidestined- thing behind. He has the best scenes in the whole movie, mainly the one of him and Mimi under the rain. That was the most emotive scene in the movie, sadly there's no much more of that.<br><br>Mimi has her own problems, none of which is interesting. She has been told she's selfish and that's affecting her, but that only contributes to show some fanservice of her and Mei on episode three. Her conflict doesn't have any closure at all, and that bugs me because I don't want to keep seeing this on the next movie.<br><br>The pace here is terrible. I've read some comments of people complaining about the pacing in the first movie and I didn't agree at all, but in this one is undeniably bad. The episodes are too slow even on their own, and watching the whole movie in just one take is impossible. The plot is focused only on Joe and Mimi and their stories aren't interesting enough. We have only two action scenes in the whole movie. The first one is one-minute long and the second one is the terrible edited and badly synchronized final battle.<br><br>The animation's quality is much worse in this movie too. A lot of static scenes, especially in the last episode, at a point I thought I was reading a manga instead of watching a movie. The animation isn't fluid anymore and some character's movements look totally awful, especially Leomon.<br><br>We get to see a new digivolution (yes, just one, Rosemon doesn't count because we've seen her already on Digimon Savers) in the final battle, in which Rosemon and Vikemon fight against Imperialdramon. The battle isn't fluid at all and it feels completely forced because no other Digimon can access the area they're in.<br><br>Also Ken makes an appearance, the writers tease him during the whole movie but he barely does anything. We don't know why he's back, what he's doing or why... basically we don't know anything, we are at the same point we were in the first movie. The story telling is bad and there's no way this movie could be saved just by two good scenes.<br><br>I hope they improve in the next one because these four episodes were really disappointing.","user":"rahspot","rank":[5,5]},{"title":"SHE MUST GO Pt.1","rating":8,"date":"1 March 2018","review":"Okay, I'll start off by saying what I liked about this part rather than ranting first off. I love the concept of these characters, from one of my favorite television shows as a child, growing up and dealing with being separated. They face issues that anyone else would face, but they each have their digital monsters there to assist them. Seeing them come back in such a spectacular way made me feel goosebumps. Now my complaints are mostly based around one key piece to this twisted adaptation. Meiko Mochizuki, the WORST character introduced into this series. She not only mopes around 24/7, but she just mistreats her digimon. I get that she's sad, but she really is annoying me to the point where I feel regretful of even starting this anime. Also i'm sick of leomon dying, but that's a story for another time. All in all, Meiko is the worst thing that has ever happened to digimon and this god awful mistake must be erased immediately.","user":"emaristevens","rank":[2,2]},{"title":"An unfocused storyline punctuated by several standout scenes and very good ending","rating":7,"date":"13 April 2016","review":"It seems the writers are already feeling the burden of balancing so many characters and subplots within the typical running length of an animated feature. Whereas \"Reunion\" was mostly about reintroducing the old gang, with Tai's concerns receiving the most attention, \"Determination\" is primarily devoted to Mimi and Joe. While giving the spotlight to certain characters for specific chapters seems ideal, the execution fails to lend much traction to the story. <br><br>Given that everything is technically still in the setup phase, the story has some of the same limitations as \"Reunion\", with limited momentum for the actual crisis due to limited information and revelations. \"Determination\", however, doesn't make much effort to overcome these; the main crisis is rarely at the forefront and the numerous subplots never manage to cohere into a streamlined experience. It seems the writers aimed to fill time before the big shocker by giving these guys one last opportunity to simply be kids (an intention voiced through the two government agents), but why make this such a big point and have so few of the teens show concern for the effects these responsibilities are having on their lives?<br><br>Mimi received some of the best treatment in the first chapter, and at least here we become familiar with other aspects of her personality. Her frankness and take charge attitude combine with an egocentric side, leading to some inconsiderate actions. The ingredients are there for vintage \"Digimon\" material, but rather than have her take action in overcoming weaknesses, much of her time is devoted to a growing (and insipid) friendship with Meiko and the hurtles in planning a school festival. What exactly any of this has to do with the main crisis is unclear, and this disconnect prevents Mimi's dramatic arc from being as compelling as it otherwise might have been. Shouldn't she be actively trying to resolve things with, say, Izzy or Sora or Tai? The only substantial interaction she has with any of her original teammates is an encounter with Joe, and, would you know it, it's one of the strongest scenes in the episode. There's even a brief scene that makes Tai's empathy with Joe clear, which is way more interesting than what Mimi goes through. \"Digimon\" is at its best when introspection or interplay between characters is at the forefront, and \"Determination\", despite all the scattered chatter and exposition, is largely misguided with these.<br><br>Joe's matters are more interesting and better handled, in my opinion. While I voiced my disappointment in him being relegated to the same role as in every other \"movie\", it was a pleasant surprise that being a digi-destined is a burden he may not be willing to carry anymore, because it may prevent him from living the adult life he wants. Considering the existence of hundreds of other kids with digimon partners, it's not an unreasonable concern, and hearkens back to his old practicality and cautiousness. It even leads to some nearly heartbreaking interplay with the endearing Gomamon. The resolution to this is rushed, but given the urgency of the situation and the fact that it gives Kari something to do, I'll accept it. <br><br>Everyone else is, at best, part of the backdrop, or, at worst, cheapened. Sora and T.K. have next to nothing to do, while the partner digimon mostly just wait around for something important to happen; the joy in seeing them with their counterparts is absent. Meiko fails to define herself beyond tiresome overt bashfulness, which doesn't help that a significant chunk of the story is devoted to integrating her into a group that we know is too colorful for her. None of this compares to what they do to Izzy. His naïve crush on Mimi, rather than have any substantial follow-up, is reduced to being completely sensual in nature. If the intention was to show that these two are not an ideal match, it could have been done in a less uncomfortable manner. <br><br>Even the fighting sees a discernible downgrade. While the last episode treated us to two extended action sequences, here we just get a brief skirmish and a curiously subdued introduction for two mega-level forms. The gray backdrop is among the least interesting depiction of cyberspace yet, and the awesome Imperialdramon is a mere shadow of his old self (if it's the same one, that is). Are the writers so appeasing towards fan ire against \"Digimon 02\" that they would reduce one of its best creations to a punching bag? While it's cool to finally see Vikemon, Rosemon is kind of underwhelming, though that may have been inevitable due to \"Data Squad\". Overall animation quality is slightly decreased, but there are a few standout moments. Some of the scenes within the hot springs facility are excellent, and the scene of Mimi and Joe contemplating by a river at dusk, with the steady rainfall, is appropriately somber.<br><br>Two rather good things that can be said about this installment concern the music and ending. Appreciable effort has been made in expanding the background themes, and while none are particularly great, they're refreshing. An improved soundtrack can go a long way towards adding entertainment value and emotional heft to an anime. The ending, with Meicoomon assuming a dark form and killing(?) Leomon, is very grim and the most gruesome the franchise has gotten since Jeri's twisted flashback. It really draws you in for the next chapter. <br><br>While still enjoyable enough, this second installment in the much anticipated film series is a definite step down. It's understandable that balancing so many characters and subplots to complement a larger story is a tall order, but these will have to see improvement to make this project worthwhile. The last thing this series needs is another episode spinning its wheels half the time. Even so, this is only \"Part 2\", so there's plenty of opportunity to take things in interesting, fruitful new directions. Perhaps there's more setup here than one would think.","user":"jephtha","rank":[3,4]}]