[{"title":"A production with more money than sense?!","rating":5,"date":"21 October 2016","review":"Although really looking forward to it, I was disappointed with this film. On the plus side there are amazing riders with some brilliant footage for sure, and the cinematography and sound edits were great. However, the 'philosophical' stuff was rather annoying, \"I'm a seeker\", the fourth phase etc, it was just well overworked and badly cheesy, sorry! It is especially ironic that after this whole thing about understanding the weather cycles of Mother Earth, again this production, with more money than sense seemed to have picked the wrong places at the wrong time. This also happened in the Art of Flight. Getting this right is a skill that is lacking in this production, and maybe less would be more. The result was a lot of not very much. Good footage from Wyoming had to be used twice in the film by the look if it! Lastly, snowboarders doing the whole being cool thing...seriously, do we have to have this, are these guys not growing up yet!? The endless summer films achieved it with surfing decades ago, we are still waiting for the epic snowboard movie, this attempt was far off! Despite all the above, I'm sure plenty will enjoy this film. I won't be waiting for the Travis Rice show again myself.","user":"seb_rider","rank":[18,22]},{"title":"No pulp","rating":7,"date":"3 October 2016","review":"We have been sitting and waiting patiently since the notion of this project was announced. There have been countless more hits on That's It That's All on YouTube and digital downloads for The Art of Flight to try to amp ourselves up for another journey into the 'WOW' factor with Travis Rice and Brain Farm.<br><br>There is no doubt in anyone's heads that the camera work, riding caliber and cinematography of this film are of the highest caliber. However the film is not without its downsides. <br><br>It felt as though there was too much of nothing. The few references to the cycle and how it performs its routine were nice, however, the writing of those sequences drew me into a story that I was never going to be told. <br><br>To conclude: The film feels like a helpful giant in a village with too many people to assist. Felt no direction and a lack of flow with the time management of some scenes. That being said, the team still managed to pull of a beautiful film. Cudos.","user":"jamiemcollier","rank":[15,21]},{"title":"Four Years in the Making?","rating":5,"date":"9 December 2017","review":"Art of Flight is arguably one of the greatest snowboarding/ski films ever made. The fact that it took five years for the follow up and this is what we are left with is truly disappointing. I didn't' clock it, but I can't imagine there is more than 20 minutes of actual snowboard footage in this film. And the remaining 60 minutes plus of footage isn't enough to make up for the lack of riding. The editing is choppy, the \"message\" of the film is convoluted (Is it a film about global warming? Is it a film about how amazing Travis Rice is? Is it a film about the water cycle? Is it a film about the pursuit of_____? Is it a snowboarding film?) and the riding is lacking (didn't I mention that already??). Truly disappointed.","user":"sddstomp","rank":[1,1]}]