[{"title":"Yes it's been done before...","rating":7,"date":"24 May 2019","review":"But I've definitely seen worse... While the idea is far from original the acting is good and in truth how many creature feature/monster movie concepts are original these days? I mean when you get right down the the basics? Are vampire movies? Or werewolf? Other alien invasion ideas? Definitely not the zombie stuff that's been done to death repeatedly since The Walking Dead started. There will always be new movies of old concepts with their own influence and ideas. This movie does some things differently. I think its well directed, well acted and overall well put together. Maybe the fact that I haven't seen the Invasion of the Body Snatchers since I was a kid and never have seen the '07 remake (this isnt the type of story I gravitate to usually) make it easier for me to like this one. Nothing fresh in my mind to compare it to so I was able to judge it by its own merit and not compare and dissect it to death.<br><br>It is worth watching and if you can come to it with an open mind and not try and hold it up against other similar movies you will probably like it. Thats like holding all zombie movies ever made in comparison to the original. Seems a bit silly to do when one thinks of it that way with all the different directions they have taken over the years. Zombie movies are never an original idea anymore no matter which way its spun. So why must people be so hard on everything else that isn't an original idea? Its possible that this movie wasn't even trying to be a remake of that exact movie but is just their own concept on the whole alien invasion subgenre, or maybe they did want to do their own version of that particular movie. Either way it was a good movie.","user":"Wikkid_Gamez","rank":[79,108]},{"title":"Blah","rating":4,"date":"15 June 2019","review":"Complete rip off of Body Snatchers, and that was a better film. Only the two main boys were decent actors, the rest of the cast were awful. I actually really did like the very end scene, but mainly it was a snooze fest.","user":"bangel3322","rank":[40,52]},{"title":"Forgettable","rating":4,"date":"13 June 2019","review":"There is absolutely nothing new or memorable about this movie whatsoever. That's not saying that it's horrible or unwatchable, just completely forgettable. The story has obviously been done before and in much better fashion. The overall production of the film is average at best and doesn't necessarily drag the film down, but is not going to win any awards either. Overall it's just lackluster and kinda boring. 4/10","user":"mikedegroot","rank":[32,44]}]