[{"title":"One of the most disturbing, yet beautiful, films I have seen in a long time","rating":8,"date":"28 October 2017","review":"Okay, let's get one thing out of the way; the majority of this film is a character study/family drama. There are long stretches of the movie where the characters just go about their daily lives, and although it does not detract from the overall package, it does offer a better label of the films genre. Yes, there are sci-fi elements, but at its core, it is a movie about a woman's crumbling marriage, and how she deals with it.<br><br>With that said, this movie offers some excellent acting, some truly amazing and breath taking cinematography, and a great (yet subdued) soundtrack. The director also did an amazing job in framing each shot, and the movie just looks gorgeous. Hollywood could certainly learn a thing or two from these types of directors that focus on artistry over budget.<br><br>The star of the show, the Thing in the shed, was one of the freakiest things I have ever seen in any movie. It moved with purpose and grace, and the face had such a deadly intelligence as to suggest that it was smarter that the beings it was indulging. Every time it showed up on screen, I got goose bumps. Like watching the creature from The Thing mate with an Octopus. Weird, fantastical, and completely convincing. How something so genuinely creepy was created on such a small budget, I will never understand.<br><br>Overall, this is an art house drama about a woman's quiet struggles with a deteriorating marriage. Yes, there are some horrific scenes, some violence, some sex and of course, the Sci-Fi elements. But in the end, its a tale of how one woman sought solace from a failed marriage from something that was beyond her control. Highly recommended, but only if you are patient and have an appreciation of film as an art form.","user":"manuelasaez","rank":[36,58]},{"title":"Entrancing, Totally Unique","rating":9,"date":"21 October 2016","review":"Alejandra is ensnared in a marriage without emotion or passion. Her macho husband Angel is in a hidden relationship with her brother Fabian. It takes a mysterious and confident loner, Veronica, to break Alejandra out of her funk. A cabin in the woods, imbued with an alien presence, provides a source of pleasure to both women. It is also a force of destruction. The same source that sets them free from a chauvinistic and homophobic society, may also be their undoing. Nothing will be the same for them. They struggle to find a balance.<br><br>The Untamed combines science fiction with horror and eroticism in a thrilling way. It is entrancing, totally unique and extremely unpredictable. It explores our primal desires as well as our tendency towards self-destruction. The vision of the film is liberating. It not only breaks our notions of film genres and chauvinistic society, it toys with our notions of sound. As with films by Nicolas Winding Refn, the acoustics heighten the tension. There is so much depth and pleasure here. Escalante won the Best Director prize at Cannes for 2013 film Heli. This is a better film. Seen at the 2016 Toronto International Film Festival.","user":"Raven-1969","rank":[40,73]},{"title":"What We Have Here Is a Failure to Communicate","rating":5,"date":"30 March 2019","review":"The Untamed wasn't terrible. It's a science-fantasy or space opera story: an alien falls to Earth and radiates sexual satisfaction, affecting man, woman, and beast. I generally like this type of story, and it was well acted for the most part, with good production values.<br><br>But the plot seemed to drag quite often. I think the reason is, we don't get much communication from the women or the man most directly affected: How is penetration of multiple orifices by this non-verbal, non-human, definitely not cuddly beast superior to or substantially different from penetration (presumably of multiple orifices) by those folks' not-very-verbal, not very communicative, not-sticking-around-to-cuddle human partners? This is not at all clear. Neither is it clear how some people were injured, nor why, knowing the risks, some people continued to rendezvous with the alien.<br><br>Normally we would say, \"Show, don't tell.\" But doing that would have turned the film into pure porn. Okay, why not tell us, using the usual stratagem of one character sharing their experience and their feelings with another character, so we get to overhear it? We see how the situation creates peripheral, real-word problems for the characters, but that just wasn't enough - for me - to build empathy. It left me cold, and the rather cavalier, nonchalant attitude expressed in the final scenes did nothing to build any redeeming affection for the characters.<br><br>It's okay, but the writers and director let us down, because it could have been a lot better.","user":"TrTm316","rank":[7,10]}]