[{"title":"A Disquieting, Disturbing & Demented Horror That Paints An Unsettling Portrait Of Loneliness","rating":18,"date":"18 January 2017","review":"Crafted with restraint, told with startling composure, and all the more uplifted by Kika Magalhaes' downright deranged performance, The Eyes of My Mother is a disquieting, disturbing &amp; demented psychological horror that paints one of the most unsettling portraits of loneliness &amp; perversion but it isn't a film that's meant to appease all.<br><br>The Eyes of My Mother tells the story of Francisca, a young girl living a quiet life with her family in a remote farm. But when a stranger appears in her house &amp; promptly kills her mother before being knocked out &amp; chained by her father in the barn, the trauma of the tragedy unravels Francisca's deepest &amp; darkest desires in unexpected ways.<br><br>Written &amp; directed by Nicolas Pesce in what's his directorial debut, the story follows a three-tier structure, each focusing on Francisca's personal growth and is narrated in a very patient manner as Pesce allows the silence &amp; stillness to ratchet up the anxiety while delivering moments of pure horror that only get more unsettling as the story progresses.<br><br>Employing a minimalist approach, Pesce takes the route of slow-burn storytelling which works out in the film's favour as even moments of nothingness end up adding something to its grisly tale and, in turn, make those violent, perturbing scenes stand out even more. Further assisting its ominous tone is its black-n-white cinematography, methodical editing &amp; muted score.<br><br>Coming to the acting department, The Eyes of My Mother is Kika Magalhaes' show all the way as she carries the entire film on her own and delivers a bone-chilling performance. It's a quiet showcase from the young actress, conveying more from her unblinking gaze &amp; silent expressions than the choice of words, and provides an unnerving insight into her character's psyche.<br><br>On an overall scale, The Eyes of My Mother is a gruesome example of body horror that's definitely not for the easily distressed and packs many moments that are powerful enough to linger on long after the credits have rolled. Managing to get under the skin with startling ease, this little art-house endeavour is a dark, twisted &amp; nightmarish study of a disturbed character who is consumed by her loneliness in devastating ways. Definitely worth a shot.","user":"CinemaClown","rank":[22,26]},{"title":"Great character study in a beautiful psychotic film.","rating":10,"date":"20 October 2018","review":"The Eyes of My Mother is a film that really pay off on many levels. The cinematic art film on one hand. Yet A slasher picture with no attempts at irony. Hauntingly hypnotic. The film is very delicate and precise in it psychotic violence as to be difficult to analyze or describe. I would go so far to say\nThe Eyes of My Mother is an insightful, meaningful, and exquisitely beautiful horror film, and undoubtedly one of the genre's most important offerings .","user":"robfollower","rank":[15,17]},{"title":"A quiet, disturbing horror film.","rating":10,"date":"10 June 2017","review":"I went into this knowing a little about it and came out pleasantly surprised. A fantastic psychological horror film and a great character study. I loved the black-and-white filter. It added to the already unsettling feel. The music and camera work also added to the suspense. Clocking in at just 76 minutes, it may seem short but the run time is actually one of it's many strengths. It never feels bloated and never overstays it's welcome. It's a slow moving film, but I never felt disinterested. In fact, I was sucked in from beginning to end. This is indie horror at it's best. I loved it so much, that right after it ended, I ordered the Blu-Ray off of Amazon. Who said that the horror genre was dead?","user":"Wolf_King_1982","rank":[35,47]}]