[{"title":"Hey... They tried.","rating":4,"date":"5 November 2019","review":"They didn't do a good job conveying the torment of the characters. Started out strong. Over time it seemed to just focus on getting to the end . The dialogue was good/ editing was good/ the director was also good. The story just wasn't on par with the talent.","user":"lamarof9","rank":[0,0]},{"title":"Decent Neo Noir indie film","rating":8,"date":"2 November 2018","review":"I'm a sucker for film noir and hard boiled tales with femme fatales and broken men. This definitely delivered on that end. The acting is top notch (the two leads are fantastic) and the film definitely had the style down. Story left a little to be desired but there's some great thriller moments/sequences and the director I think given the right script/material could do something great in the future.\nIt's definitely indie low/no budget filmmaking but it makes the most of what's there and is very enjoyable","user":"thebetteryoulook","rank":[2,6]},{"title":"Too Violent; Amateur Filmmaking","rating":3,"date":"3 January 2019","review":"A young man is trying to recover from a horrendous experience where his girl friend was killed during a home break-in. He went to the support group where there was an excellent (and believable) group leader. Then, the film fell apart.<br><br>The main problem was that the film was far too violent. The sequences in the support group were the best in the film. But the film hit rock bottom when a graphic set of murders is committed by the film's protagonist, who wantonly kills an entire family, including children. This was in the worst taste imaginable by the creators of this movie.<br><br>The action unfolded in a way that often made no sense. What are we to think about Scott's best friend, Tim? Why is the character named O at his home at the most critical moment in the film? Why does O's tag team partner allow Scott into his apartment? Why is there no occasion for Scott to go to the police to seek \"justice\"?<br><br>This was a poor man's \"Death Wish\" without the star power of a Charles Bronson or a Bruce Willis. The acting was not credible, and the overall look of the film was amateurish.<br><br>As a crime drama or thriller, there was no mystery or suspense, only an \"icky\" feeling of direct-to-video, amateur filmmaking exercise.","user":"lavatch","rank":[1,2]}]