[{"title":"Beautiful movie, not only for children","rating":7,"date":"18 June 2018","review":"'White Fang' has a really beautiful animation and the story is faithful to Jack London's book. The soundtrack is really good. The movie reminded me a bit the \"old\" 'Spirit: The Stallion of the Cimarron'. I think everyone will like 'White Fang', not only the children. It has a nostalgic element that honestly I can't explain, but it almost made me cry.","user":"grilices","rank":[28,33]},{"title":"Enjoyable.","rating":8,"date":"14 July 2018","review":"I watched this with my disabled kid, and I think that I found it more enjoyable than he did. The classic story told in a great way to appeal to younger audiences. <br><br>I particularly liked the way that the more unsavoury subjects were covered, especially the dog fighting. Rather than ignore it for fear of upsetting people, to me. it was covered perfectly. Nothing too graphic.","user":"charles-934-891149","rank":[19,22]},{"title":"This is good!","rating":9,"date":"16 July 2018","review":"I watched this movie the other day, and it was very good!<br><br>I can't compare it, or review it in relation to the book as I haven't read the original white fang book so I dunno how close the movie is to the original; I imagine it does have differences but what are they I don't know. I DO however know that ending of movie is different from the novel, but that's pretty much it.<br><br>Anyway I liked the story the movie had in it anyway as it was well written, and you could understand what was going on. They did however cut out the more upsetting parts, but that is understandable as it could be upsetting for some viewers to see that sort of thing. I liked that they went with the realistic direction, and made white fang not talk instead making him act like a normal animal unlike most movies with animals now a days.<br><br>The animation was beautiful, and well done with a pretty watercolor look to it; in a way it kinda reminded me of a how some video games looked too. I even liked how creepy the main villain looked!<br><br>So all in all I loved this film, and I hope it comes out on video as I want this movie for my film collection!","user":"feralasar","rank":[9,10]}]