[{"title":"Pseudo-intellectualism","rating":5,"date":"21 February 2017","review":"Volker Schlöndorff has made a career out of screen adaptations of major novels. His Death of a Salesman stands out as an excellent work, with Malkovich and Hoffman in some of the best work of their careers. Return to Montauk is his third movie in ten years, based on the story Montauk by Swiss writer Max Frisch, although it deviates substantially from that story and can almost stand on its own, this story about a writer on a book tour in New York catching up with his past.<br><br>It is difficult to point out what went wrong here. His French co-workers cannot be blamed as the editing by Hervé Schneid (Amélie) is excellent, and also the cinematography by Jérôme Alméras doesn't disappoint. From the beginning there is tension in the movie after the inventive screen titles, and the first half of the movie sets up the story quite nice: It makes the impression of a more serious Woody Allen movie and the characters are well established. Stellan Skarsgård is good, Niels Arestrup is an excellent but underrated actor.<br><br>However from the moment the trip to Montauk starts the movie loses its interest. First, the story-line from that point is so predictable that it becomes boring. Second, Schlöndorff's somewhat mechanical style doesn't help here either. And last, Nina Hoss is a real disappointment here and cannot pull off the kind and level of acting required. It is especially in the omnipresent medium shots and close-ups that her facial expressions and her body language aren't good enough to carry the movie, while she essentially is in the centerpiece of it.<br><br>The theme (writing meeting his past) is so worn-out that nothing new is added to the movie universe here. The style and content of the movie feels old-fashioned and out of date. Times have moved on, so this was not well received at the Berlinale, where several festival visitors eagerly awaiting this movie talked about their disappointment afterwards. And the philosophy parts are so pseudo-intellectual it is an insult to the field.","user":"diand_","rank":[31,57]}]