[{"title":"Pretty Good","rating":7,"date":"9 April 2019","review":"This movie storyline is unusual and i like that it's funny in it own ways, i also like the main character ambition but sorry tho i gotta give my heart to Dan he's really sweet, what can i say for this movie is motivational i guess, since i can relate to the main character, the actor is really amazing all of them is really well known not just that but they also fit the characters, everything is so clear nothing confusing, what can i say for people who read this review is that you need to watch this at least once !","user":"victoryseungsik","rank":[1,2]},{"title":"Satirical Overkill.","rating":5,"date":"24 March 2018","review":"TEIICHI: BATTLE OF SUPREME HIGH / TEIICHI'S COUNTRY [Lit.] (TEIICHI NO KUNI). Viewed at CineMatsuri 2018. Subtitles = three (3) stars; music = three (3) stars; cinematography/lighting = barely three (3) stars. Director Akira Nagai delivers a lively live-action absurdity based on a comic (manga) about the proper nurturing of would-be world dictators (or at least major bureaucrats and minor cabinet ministers). The setting is an elite, autocratic, all-male high school (that used to be a war-time military academy and in many ways still is) where the first rung on the world-domination ladder is to be \"elected\" (voting seems limited to self-appointed clicks) freshman class president and ultimately president of the school's student council. Nagai's intent, of course, is to employ a microcosm (of several hundred top-of-the-food-chain students) to mirror what is known (or surmised) to occur in the real-world of politicians and bureaucrats at prefectural and federal levels. This includes sabotage, bribery, backstabbing, all flavors of corruption/\ncollusion, threats, and punch-ups plus parental interference in the form of school donations and blackballing. The Director also includes a fair amount of socioeconomic lecturing and a little bit of romance in the midst of this teen-comedy mayhem. The film is way too long with much repetition (and mugging). Furthermore, the Director overdoses on players in minor speaking parts that makes it challenging for audience members who are trying to keep things straight (instead of just going with the flow!). Lead actors (and one actress) are a bit too old to be high school students. The protagonist's mother played by Sei Matobu is exceptional even in a much-too-tiny role. Cinematography (1: 2.35, DCP, color) and lighting suffer from show boating where many scenes begin with over exposures (being photographically clever may only give the viewer a glaring headache!) and elevated forward panning (usually over student assemblies). Music is okay. Subtitles are good enough except for the lyrics of the closing-credits song that are not translated. A sophomoric comedy that has its moments. WILLIAM FLANIGAN, PhD.","user":"net_orders","rank":[1,3]}]