[{"title":"Money is everything..!","rating":8,"date":"4 July 2018","review":"This movie is one of old classy types where tension is built around dialogues and the predicament characters find themselves in. Christopher plummer is riveting as a greedy billionaire who thinks about evading tax in every walk of his life and want to be in control of everything he sees. Michelle williams is terrific as a caring mother and not the usual dumb potrayals you normally find in these kind of movies. She is smart, witty and sees hope even in darker moments . The scene where she asks \"Do they want me to cry?\" potrays the real emotion people go through in situations like these. Mark wahlberg is more of a cliched character where you can predict pretty much what he will do. There are intense scenes in second half where the kid acted really well and you felt the pain character went through. Even though its a serious film, you might find humor in traces which made sure its an enjoyable watch.","user":"vijaychandrank","rank":[30,35]},{"title":"Greed","rating":7,"date":"30 December 2017","review":"It's nearly impossible to separate what happened off screen with the final product of All the Money in the World. With that said, Ridley Scott pretty much couldn't have done a better job at making a seamless transition from Kevin Spacey to Christopher Plummer in the role of J. Paul Getty. Inevitably that will be the one thing people always remember about this film, but in the end, the film succeeds elsewhere as a thriller based around the kidnapping of Getty's grandson in Rome in 1973.<br><br>Perhaps the most impressive aspect of the film is its non-stop pacing. Whether or not all of the bells and whistles of this story were true, Scott is determined to keep you on the edge of your seat with suspense, even if you ultimately know where the story ends up. And luckily, this story is perfect for a cinematic experience. The true events are unfortunately tragic for many involved, but in the end it's the character of J. Paul Getty that makes for a truly riveting character to watch. Not willing to budge to pay a single dime for his grandson's ransom is beyond frugal, and the fact that the events didn't play out in an even worse manor is a miracle.<br><br>Getty's pushback (or lack thereof) makes for a great back and forth with his daughter in law, Gail Harris (played by Michelle Williams). Williams is brilliant in everything, and she once again kills it as the desperate but under control mother of a kidnapped son. She will likely be overshadowed by Plummer come award shows, but Williams' talent will never go unnoticed from me.<br><br>Ultimately, All the Money in the World is a fascinating tale of greed, frugality, power, and the differences in people's approach in high stress situations. From great performances to an impressive and important feat from Scott's last minute direction, I quite appreciated All the Money in the World.<br><br>7.9/10","user":"ThomasDrufke","rank":[78,101]},{"title":"A drama without drama","rating":5,"date":"7 January 2018","review":"This could have been a human drama of unbearable tension instead it's a movie manufactured with devious intentions. Devious in the real world, in movie making terms is totally accepted to do anything to lure people into the movie theaters. Probably their marketing people thought that a detailed slicing of an ear may do it. It made me so angry. No tension, no passion. The only reason to see the film is Michelle Williams. I didn't realized it was her until well into the movie, in fact until she has a scene with Mark Whalberg. She is real and truthful, when they stay with her everything works. Christopher Plummer plays the old mean billionaire to perfection but I must admit I thought of Kevin Spacey throughout. Everything is shot without real thought behind it. I liked the wind taking over the newspapers but the kidnappers remain a blurry mystery to me, who were they really? They looked like actors to me.","user":"liufilms-yl","rank":[122,169]}]