[{"title":"A must-see for any Oasis fan, with much rare and unseen footage","rating":9,"date":"27 October 2016","review":"\"Oasis: Supersonic\" (2016 release from the UK; 122 min.) is a documentary about the early years of Britain's biggest band of the 90s. As the movie opens, the voice-over mentions that the band went in less than 3 years from signing to a label to headlining Knebworth 1996 in front of 250,000 fans, and the footage shows us the mega-madness that event was. We then go back in time, to the childhood of Noel and Liam (5 years younger) and oldest brother Paul, and how Noel and Liam end up in music. At this point we're 10 min. into the movie.<br><br>Couple of comments: this documentary is directed by Mat Whitecross, a Brit who's directed other music-related documentaries. More tellingly, the movie is executive produced by Asif Kagadu, who last year directed the brilliant and Oscar-winning Amy Winehouse documentary \"Amy\". This documentary made a number of very smart choices, including: (1) it focuses ONLY on the early years (nothing beyond 1996 is covered or mentioned), and the bulk of the film is about 1994-95, when the band reached it critical and commercial peak with the first 2 albums and the many related singles and B-sides from that era; (2) the sibling rivalry between Noel and Liam is not neglected but neither is it overplayed. I loved Noel's observation \"I am like a cat, while Noel's like a dog. I am independent, while he craves attention and begs 'play with me! throw me the ball!\", ha! (3) the documentary contains some amazing footage, including of Oasis' very first gig (8/18/91, when Noel hadn't even joined yet) and the infamous gig in Glasgow (5/31/93) where they were spotted by Creation Records co-owner Alan McGee, who promptly signed them. (And Noel comments about that gig: \"There were 7 people there, and he (McGee) was 2 of them. So yea, we were an overnight sensation, 2 1/2 years in the making.\" The rest, as they say, is history. There are a lot of funny moments sprinkled throughout the film as well, which really keeps the overall mood quite light, and that is a good thing. Bottom line: if you are a fan of Oasis, as I was from the beginning, you absolutely do not want to miss this.<br><br>I saw \"Oasis: Supersonic\" at my local art-house theater here in Cincinnati last night, when the movie was shown in theaters across the country for a one-night-only showing. The theater here was PACKED, somewhat to my surprise. I guess there is a pent-up demand (nostalgia?) for the good ol' days of the 90s Britpop. Much of the crowd roared with delight at the funny bits, and seemed completely into the movie (as was I). \"Oasis: Supersonic\" is HIGHLY RECOMMENDED!","user":"paul-allaer","rank":[23,27]},{"title":"watching history","rating":9,"date":"7 October 2016","review":"Biblical, well I ain't no God fearing person but Whatever, the film captures, for most part, the simplicity we brought to being a modern day Rock n Roll star.There are two sides to it for the fan and the icon. The buzz of being recognized,quoted, followed and rich are fantastic and trying.To wake up and think \"yeah I am really famous\" as a first thought of the day is a buzz, a high better than any drug. But then after a while it grinds you down and you kinda want it to go away at times but it doesn't want too.I think the film shows signs of that and the demise was fame fatigue amongst other things.For the fans this is showing that we are just lucky guys who wrote and performed some great songs that caught the mood around at the time for a certain generation. Don't forget the Blur's and Suede and Elastica's but it's our tunes and our story that mirrors the times. Politics were dirty and confusing. The media were trying to create a Britpop scene and worse thing potato head did was sip champagne with Tory Blair, sorry Tony Blair. Stupidity aside come and rock n roll with me and the boys, I am all the things they say I am and then again I am nothing that has been written. One thing guaranteed. Love me and I will love you back. What makes the world go around? We did for sometime anyway. Love LGx","user":"raymercer","rank":[40,51]},{"title":"Authentic, real. Mesmerising viewing.","rating":9,"date":"2 October 2016","review":"Just returned from watching this at Vue Bolton. Was mesmerising. The live Q&amp;A after the film was light hearted &amp; warm, with Liam trademark expletives. Charts the remarkable meteoric rise from a Manchester council estate to the massive Knebworth brace of gigs pumping out tracks to 250,000 exuberant fans. They were so hot, with 2.5 m requests for tickets, as Liam says, they 'could 'av still been playin now!'. In their own words, 'the biggest band in the world' at that time. This film was heartwarming in it's authenticity, it's portrayal felt very real. I left the theatre with a real sense that I knew Liam and Noel a little better, and understood them a little more. Their journey was extraordinary. The soundtrack powerful. There were many points in the film when the volume ramped up the rockin beats and the audience excitement palpable. A great feeling in the theatre that we had all seen something special. I also laughed many times. I hope there is a 'Part Two' charting what happened after Knebworth. Brilliant film &amp; documentary. 9.5 / 10. Tony P","user":"tony-1662","rank":[17,23]}]