[{"title":"Excellent film, even if you don't speak Polish","rating":9,"date":"26 April 2016","review":"This is a solidly great film. It delivers on everything it promises - beautiful, original creature effects, a real sense of menace, boobs, and a fantastic musical score - and blithely throws in a few extras, like well-developed, interesting characters, a wonderful surreality, beautiful visuals, and a legitimately new twist on a story as old as the hills. <br><br>If there's any small criticism I have of this film, it's that a couple times there are characters that appear suddenly, do something, and then vanish, only to reappear later. There is no explanation of these characters, sometimes not even a name. I don't mind the lack to linear reality, but I did find myself asking questions about how these individuals fit into the greater story, and whether explanatory scenes had been cut. The only other not-positive thing I could say is that the dolphin noises are maybe a little silly. <br><br>That's honestly it. I really really enjoyed this movie, and I'm so glad the Calgary Underground Film Festival showed it. It needs more publicity!<br><br>In fact, I'm currently very frustrated because I can't find this movie or its soundtrack available anywhere. There's a song in the middle of the film that I'd love to listen to again, the 'Bloody Gloomy' song, and neither the clip nor the audio seem to exist online. Actually, I would love to watch the whole movie again; it's a very rich film, visually, with a lot of attention paid to little details like props and blocking and costumes. Especially as I was reading subtitles, I feel like I could gain a lot from a second viewing. I can only hope a North American distributor picks it up, as I would like to legitimately buy it and support Ms. Smoczynska. Good cinema deserves to be supported!<br><br>Which brings me to my last point. <br><br>This is actually my first review on IMDb, and I have to admit I'm leaving it partly out of frustration with the only other review for this film. If you don't like musicals, don't go see musicals! And if you see that a movie is classified as a musical, and you don't like musicals, and you go and see the musical anyway, PLEASE don't leave a negative review on the internet just because the MUSICAL that you CHOSE to see had MUSIC in it. That's like giving a horror movie a low score because it was scary! Come on now. You're discouraging people from going to see a perfectly good film because you don't like its genre, rather than any inherent flaw in the film itself. That's hardly fair. I hope people looking this movie up will give it a chance - it deserves much, much higher than a 3. I promise!","user":"celempke","rank":[80,91]},{"title":"The Lure (2015)","rating":7,"date":"18 July 2017","review":"Not going to lie, I had no idea about this film till I saw the upcoming artwork for the release of this film on Criterion Collection. I was instantly intrigued. Mermaids? Hell yeah! I don't think I've seen anything from Polish cinema; I only really watch foreign films when there is a good amount of buzz for a film and I feel I need to see it. I have to say this film is weird and bizarre but overall I felt it was quite creative despite not always hitting the right notes (not a pun on this being a musical, I swear).<br><br>The film is about two beautiful mermaids who befriend a rock band and then use their condition to become part of the group and entertain fans. Along the way one of the mermaids falls in love with a group member and longs to become a human to win his affection. The other has blood lust and is out to slash the throats and eat the hearts of men. Visually the performance scenes and the presentation of other dark scenes are done wonderfully.<br><br>I thought the film had a nice mix of being a horror film, a fantastical film, and a rock opera. The music was often catchy although I wasn't sure about the lyrics at all times (since they were very literal). The film is fairly erotic and captivating mainly due to the beauties of the two leads. The film does well to bring in mermaid lore and showing them as violent even if they may look beautiful. It basically felt like a horror take of The Little Mermaid at times.<br><br>My only concern is the film felt kind of imbalanced since it seemed fluid and didn't have a strong sense of accomplishing anything. Scenes just occur one into the next and seem like a progression without any real motivation. It's still a highly imaginative venture one that left an imprint, as I am sure was the intention. I'm not sure if I will pick it up on Criterion blu-ray but I am pretty pleased with the sort of outlandish nature of what was presented.<br><br>7.5/10","user":"rockman182","rank":[14,14]},{"title":"A musical with sirens, cabaret, and a plot-should be awful, but its not!","rating":6,"date":"3 December 2016","review":"One would think that a story of predatory mermaids taking a holiday in a seedy cabaret could only be a disaster, but the filmmakers made it work here. This is a bit of a dark movie. I wish I understood Polish, because the subtitled lyrics of the songs were clunky compared with the fine voices of the leads playing the siren sisters.<br><br>Most of the musical numbers and dancing were well-choreographed, but a couple of sequences didn't quite gel. A bit less time is devoted to developing the most critical romance of the movie than it needed, which unfortunately lets a bit of air out of the ending. <br><br>The visuals and effects were surprisingly good. The mermaid tails especially were well done, with details such as broken scales and scars adding chilling realism. Be warned that some parts of the movie are a bit gruesome; the critical difference between traditional mermaids and their darker cousins is made clear on several occasions. Younger children probably shouldn't watch.<br><br>There are quite a few movies written around mermaids, but this is the first I have seen about sirens. Hollywood, take note-\"The Lure\" demonstrates that this area has a lot of dramatic potential.<br><br>All in all, definitely worth a one-time watch.","user":"ElectronWrangler","rank":[23,26]}]