[{"title":"A salute to Real life Hero which will leave you emotional","rating":9,"date":"20 February 2016","review":"As i have discussed before, there has been a change in Indian Audience's movie choices last few years. Indians have started to appreciate Contemporary Cinema and is separating slowly from its cliché filled days of musicals. Bollywood for last few years have been evolving into something bigger and better. The trend it seems is still going strong.<br><br>Another trend which has been set since last 4 or 5 years: We have had many movies with strong female lead, having feminist approach. From English Vinglish(2012) to Queen(2013) and from last year's Dil Dhadakne Do to Masaan. We have had so many movies with positive perspective of females. And that trend is still on with latest Neerja.<br><br>Director Ram Madhvani's debut feature film is a strong well acted biopic with emotions filled to its core. The Movie will leave many viewers teary eyed. I want to thank the whole cast and production team of Neerja for introducing me to the brave and fearless Neerja Bhanot. The Youngest recipient of India's highest Bravery Award for saving hundreds of lives in a plane hijack.<br><br>Sonam Kapoor blends right into the core of Neerja's character, this is clearly her best movie of the career leaving her acting in Raanjhana way behind. She plays the character of a flight purser of a Pan Am flight who is also a struggling model. Neerja has recently been divorced from an arrange marriage and is a huge Rajesh Khanna's fan. Her first flight as a purser gets hijacked by terrorists.<br><br>Another actor who has done a commendable job is Shabana Azmi, she is so compassionate as the mother of Neerja that you can feel the pain and loss through her character.<br><br>In its essence Neerja is not just a biopic, its a drama with thrilling ride of tension. Perfectly paced and well directed, the movie is a must watch. I have not discussed much because i do not want to spoil the ,movie for you. So go and watch it. Neerja- 9/10:Must watch www . filmicsite.wordpress .com","user":"filmicsite","rank":[26,32]},{"title":"Sonam Kapoor's terrific hijacking drama will leave you teary-eyed","rating":10,"date":"19 February 2016","review":"As everyone knows, Neerja is based on the brave airhostess who lost her life saving many others during the unforgettable Pan Am hijacking of 1986. When it comes to hijacking dramas, the first and the best film that comes to my mind is United 93, a terrifying drama set on the only flight that crashed on an empty paddock during the infamous 9/11 attacks. As far as I can remember, Bollywood's last attempt in this genre was the mediocre Shiny Ahuja film, Hijack. So it was with some trepidation that I went to watch Neerja, but in the end, I was simply bowled over!<br><br>The biggest positive I can say about the film, and I would want to say right at the start itself, the film never lets down the spirit of Neerja Bhanot. While Bollywood biopics have the tendency to put masala in stories of real life personalities, Neerja thankfully avoids that! If Neerja was a hero in real life, Ram Madhvani is the real hero of the film. It is to his credit that he has made such a compelling drama that will keep you on the edge of your seats. The entire hijacking situation is so brilliantly shot that you feel that you are a part of the life threatening drama. The tension you feel in the scenes are palpable, especially when the terrorists realise there is no hope for them and they become reckless. The docu style camera work heightens the sense of claustrophobia in you. The background score is tense and brilliantly done. But where Ram Madhvani actually scores is how he shot the final moments of Neerja's sacrifice – intense yet emotionally wrought. If those scenes don't bring tears from your eyes, your heart is definitely made of stone. Another thing that worked for the film is the casting. From the main leads to even the supporting ones, everyone has done Justice to their roles. The makers must be lauded for choosing relative new comers in the other roles, as it works in creating a sense of realism. The actors playing the terrorists totally look their part, especially the one playing Khalil. But the film would not have been what it is, if it was not for the film's main leads. Despite her limitations (her voice is still not so easy to adjust), Sonam is the heart and soul of the film. This is a role that she can show her detractors and ask them to just shut up! She is terrific, especially in the second half, where her eyes speak a lot, of fear, of courage. Shabana Azmi is great, as always and her final speech will definitely make you cry if you haven't started yet. Yogendra Tiku, who plays Sonam's father in the film, is another actor to look out for. In his debut film, composer Shekhar Ravjiani is pretty likable in his small role. Also, if a scene or two would have shown about how the Indian Government reacted to the situation, it would have been great. <br><br>Neerja's last words to her mother in the film is a famous Rajesh Khanna dialogue about Pushpa and her tears! Even though I hate them a lot, you just can't leave the hall with dry eyes! Aamir, you have more company in the crying club.<br><br>Go watch one of the best Hindi films made in recent times ASAP!","user":"sohompramanick","rank":[41,58]},{"title":"Grand Salute to Neerja and her biopic!","rating":10,"date":"20 February 2016","review":"Life has to be bigger not longer! The film, Neerja is a portrayal on the life of the courageous Neerja Bhanot, who sacrificed her life while protecting the lives of 359 passengers in 1986. The flight was hijacked by a terrorist organization in Karachi. How she bravely handled the situation is what the film has been made on.<br><br>Director is the real hero of this movie. Ram Madhvani describes every part, every scene of the film very wonderfully. Along with the writers, he is not giving outside of the track and thus, this film is a gem of 2016! Shabana Azmi has done a fantabulous job in the character of Neerja's mother. Though, she has not much dialogues, but her expressions show her emotions, and they are very real that everyone was crying literally. When she gave a speech on Neerja in the end, I was not able to control my emotions. Tears were flowing continuously. She will be the winner of best supporting actress in the major award ceremony undoubtedly.<br><br>Sonam Kapoor has given career best performance. She could've been portrayed her well. But, whatever she has given is acceptable. Yogendra Tikku as Neerja's father and Shekhar as Neerja's friend are good and suitable. The man who portrayed Khalil, the angriest terrorist, has done a fantastic job. He looks like a pure terrorist. Others are good, too.<br><br>Music is given by Vishal Khurana and lyrics has been penned by Prasoon Joshi. All the songs are listenable again and again. Background score is also suitable and helps to build the terror as well as the excitement.<br><br>Connection with Rajesh Khanna, Neerja's past describing her marriage issue, her father's advises, her handling of the passengers, her smartness of not taking the U.S. citizens' passports, her calmness, her love letter written by her lover, her love towards her duty, her sacrifice - everything is just so perfect. I'm no getting over from it. This is probably one of the best films of this year.<br><br>I salute you from the bottom of my heart to Neerja Bhanot, the actual one. She has been rewarded Ashok Chakra by the government of India. Though, Airlift was a good one, but, this deserves support from the audience. This is definitely better than Airlift. Please, it's my humble request to all that go and watch out the story of the brave girl, Neerja. Her mother told that Neerja was prettier than Sonam. Yes, the photographs in the end credits give the approval to this statement. A girl, aged 23, lost her life while saving the passengers during her job. Watch it and think that where we reached till now! Massive respect!","user":"maulin5","rank":[20,27]}]