[{"title":"A Masterfully Understated Triumph","rating":10,"date":"13 November 2019","review":"The wonderfully understated \"Aquarians\" evokes tragedy to pave its difficult road to redemptive familial reconciliation, and deftly leverages faith as the prevailing connective tissue between its expertly conceived storytelling elements.<br><br>\"Aquarians\" has a resounding Wisconsinness to it; a beautifully icy tonality and a chilly serenity very intentionally put into play to provide the deceptive impression of plainness. Yet this film is anything but plain, as its initial use of atmospherics belies its masterfully intricate nuances in character construction. Daniel (Chandler Massey) is the proverbial good son, returning home as deacon of his long-standing family church. Jacob (Shane Coffey) is Daniel's visceral counterpoint; a self-imposed isolationist buried deep in the rural wilds. Their disparate makeups put them at odds, yet a consuming shared tragedy tears at the foundations of both. Inevitably, its residual impacts draw them nearer to a center point: Danny slowly veers towards Jake's darker influences, indulging behaviors presumably not endorsed in the instruction booklet provided to seminary students. Paradoxically, Jake is forced the other way, retreating within to address his own torments until his outer shell cracks, leading to a deeper reconnection with his brother. In \"Aquarians,\" both men offer a redemptive pathway for the other, and the resulting opportunity to chart forward-looking paths.<br><br>Apparent simplicity begets intensive complexity throughout \"Aquarians,\" as the film demonstrates an ancient patience in coaxing its deep meanings to slowly pour forth. Its two male leads are exemplary, each offering a complexity of truth we're far too sporadically shown in cinema. Despite our ages-old familiarity with stories expounding forgiveness and faith, \"Aquarians\" somehow presents as newly ripe for our times. This is a resoundingly honest film, and with a consuming authenticity felt to the bones.\n-\nWas this review of use to you? If so, let me know by clicking \"Helpful.\" Cheers!","user":"TheAll-SeeingI","rank":[2,3]},{"title":"truly an interesting movie","rating":6,"date":"11 April 2019","review":"Imagine the rascal boy ,coming back to his little and severely religious hometown as a clergyman, meeting up at his drug selling,joyride living brother, the rascal number two, both having psychological issues, to what happened to rascal number three a few years ago. add on the local vicar,the church community, and all the other people of all kinds and sizes, it can be unpredictable.... i shall not summarize more, due to the threat of being stigmatized with a spoiler review.<br><br>its a funny, actually hilarious at times, but also deep and sad at moments, it has a take on different issues connected to the catholic church, but not damaging or done in a harrasing way. there are a lot of innocense in the story, and reminds me very well about my first real working day as the head nurse or matress instead of matrone. the feeling of being a proffesional without knowing anything i was supposed to know, well it was frightening indeed.<br><br>it is on average quality of filming, the soundwork couldve been better, especially on the lake where you should suppose it is dead quite, but get some industrial like noise in the background. its very disturbing for an old man to listen to due to tinnitus, so that could have been better.<br><br>the acting are very good by the 3 main male caracters, and i guess ive seen mr.riehle for the 75TH time including this movie, a small but well acted role.<br><br>though the grumpy old man does not think its a blockbuster, or what ill expect that norwegian tv-channels would buy, its still a watchable film, ok playtime and pace, but could have dove deeper into the matter i guess","user":"ops-52535","rank":[2,3]},{"title":"Predictable and not in a good way.","rating":2,"date":"18 March 2020","review":"Do not be swayed by the positive reviews, I'd bet good money they're written by the filmmakers themselves and their friends and family members. Nothing about this film is original.<br><br>The plot is one which has been used countless times - man, or woman, returns home after years away, reconnects with family members and or/friends which causes problems and threatens the new life he or she has chosen and in due course they are forced to face up to events and or issues they have been avoiding. Using a well used plot wouldn't be a problem if writer/director Michael McGuire had something new or insightful to bring to the table but sadly he does not. Everything, from the middle American frozen small town setting, to protagonist Daniel's journey is broadly signposted and predictable.<br><br>Daniel who is training to become a priest is in town to stand in for the incumbent father who is ill with cancer. Two seconds after his arrival we learn his brother, Jake from whom he is estranged, also lives in town and that there is a third brother who turns out to have died young. Predictably, Jake is a wastrel who sells weed, drinks, swears profusely and doesn't believe in God. Daniel is forced to make contact with Jake by parishioners who can't trust a priest who would turn his back on his family. Of course it's not long before Daniel is smoking weed, being arrested for driving without a license, attending wild parties and lusting after a local girl while being egged on by Jacob who accuses him of hiding behind the priesthood rather than facing up his feelings of guilt about their brother Chris' death. This of course horrifies the parishioners leaving Daniel's future as a priest in question.<br><br>Chandler Massey who plays Daniel and Shane Coffey who plays Jake try their best but are given very little to play with. The dialogue is painfully clunky, particularly Daniel's attempts to explain his faith and vocation and Jake's summations as to why Daniel decided to become a priest and director Michael McGuire fails miserably when it comes to making us care if Daniel and Jake will make up, if Jake gets his life together or if Daniel faces up to his feelings of guilt and is honest with himself about who he is and what he really wants out of life.","user":"robinsonfeatures","rank":[0,0]}]