[{"title":"Marvel Super Hero Adventures Frost Fight!: For the kids and the kids alone","rating":3,"date":"14 December 2017","review":"Being a Marvel fan one thing that always frustrates me is the lack of demographic consistency. The animation can range from 15's down to U's and this one is certainly the latter.<br><br>In this adventure aimed directly at the tiddly winks the Avengers must team up with Rocket &amp; Groot to stop Loki from gaining the power of Santa Claus.<br><br>Yep, that wasn't a typo. Santa is now part of the Marvel Universe I suppose and essentially has his own Christmas realm full of candy canes &amp; gingerbread men.<br><br>As you can imagine the whole thing is very low-key (Pun intended) and childish. The animation is all very colourful, the action scenes are cutesy and the humour is aimed at the young.<br><br>The whole Santa Claus thing made it difficult to take any of it seriously, that and the addition of Reptil who Marvel just can't seem to stick with an ethnicity of. He was originally hispanic but I've seen both caucasian and african american incarnations.<br><br>Great for your kids, not so good for adults.<br><br>The Good: <br><br>Well made<br><br>The Bad:<br><br>Humour is infantile<br><br>Reptil's ethnicity has changed repeatedly<br><br>Santa, really?<br><br>Things I Learnt From This Movie:<br><br>Ironman has a Stargate","user":"Platypuschow","rank":[4,4]},{"title":"It was... okay. Seriously, I watched it just for Carol Danvers/Cap Marvel","rating":6,"date":"31 December 2015","review":"The Avengers find their holidays being compromised by that darned Loki, who has joined forces with the frost giant Ymir to kidnap none other than Santa Claus himself, who has it turns out is a super powerful mythological bad ass. Only the Avengers can save Jolly Old Saint Nick now! Oh and Rocket Raccoon and Groot show up too. <br><br>Once again Marvel Animation seems content to churn out a product that probably would have been more at home in the 1980s where it might have actually seen as off beat but feels out of place today. \"Avengers Assemble\" has (or had - I gave up after a few episodes) the same problem - where its predecessor \"Earth's Mightiest Heroes\" moved like a well oiled machine, \"Assemble\" just feels old, stiff, clunky and about 20 to 30 years out of date (and its attempts to mimic the MCU style banter never quite works). It would have been right at home alongside the GI Joe and Transformers cartoons of the 80s, but it hasn't been the 80s for quite some time. <br><br>For whatever its worth this feature is somewhat more watchable than AA or \"Ultimate Spider-Man\", despite being about 10 minutes too long and featuring a lot of overwritten dialogue in an attempt to mimic the MCU. There are some genuinely funny bits in the film, such as Rocket Raccoon and Groot's encounter with Mrs. Claus. There's also a surprisingly poignant moment where the heroes gather around a fire and share Christmas memories (for Reptil getting dinosaur toys, for Captain Marvel/Carol Danvers getting tickets to an air show where she got to sit in a jet, for Captain America/Steve Rogers getting a baseball &amp; bat despite not having any skill for the sport). <br><br>The feature's greatest asset however is Carol Danvers showing up as Captain Marvel. Grey DeLisle-Griffin reprises the role of Carol from \"Superhero Squad\" and she easily steals the show by managing to be tough but also funny and personable, snagging most of the better one liners along the way. The other voice actors do decent enough work, with Steve Blum and Jane Singer both turning in amusing performances as Santa Claus, Santa's doppelganger and Mrs. Claus. <br><br>Overall not a work of art, but an okay holiday viewing if you've got 70+ minutes to kill.","user":"DarthBill","rank":[4,5]},{"title":"Santa Claus Is A Guest-Star","rating":19,"date":"19 January 2016","review":"This swings far far away from Avengers Assemble to the point of Marvel Super Hero Squad. There's a lot of kid humor and it's too child friendly. 'Frost Fight' offers nothing to an older audience. Teen fans will hate it, adult fans will immediately notice how cheaply this was made, and anyone under the age of 10 will have a lot of fun with it.<br><br>It presents the Carol Danver's version of Captain Marvel which I was hopeful about, but I found myself missing Hawkeye &amp; Black Widow. Her look is kind of dated and is out-of-place with the other artwork. Basically a completely different art-style.<br><br>There's a trainee kid who goes by 'Reptil' that I found incredibly annoying. His power is having pterodactyl wings. It's a throw-away character that you might expect to be killed off (for sake of showing death) without erasing a major character.<br><br>Steve Rodgers/Captain America and Tony Stark/Iron Man have different voice actors. It sounds close, but it's a little weird. I personally have a pet-peeve about Marvel changing voice actors just for the films.<br><br>Santa Claus &amp; Mrs. Claus make their way into the story and it's the Kiss Meets Santa joke from Family Guy. Yeah - Somebody threw out a movie really fast and whoever did it should be fired. Grossly incompetent choices were made about this release.","user":"jegd-847-631407","rank":[3,5]}]