[{"title":"Shocking and Sad","rating":8,"date":"21 June 2016","review":"Tickled certainly deviates from its trailer, but the film itself is a shocking piece of art. Tied together with tasteful cinematography (with necessary hidden cameras here and there), Tickled captures the enigma of David D'Amato's empire of male-tickling videos which results in scare tactics, harassment, and financial bullying of the unsuspecting participants--something that is very relevant to modern issues. I felt sad walking out of the film, which is evidence that this film does its job of riding the line between comedy and tragedy. I do feel that the trailer sets up an expectation of a horror/thriller aspect, but there is not much of this atmosphere in the film. I do, however, think that the film by itself is a brave piece of journalism that endangered the Tickled team financially and psychologically. The fact that the team was able to muster up the courage to finish the film is remarkable, and I hope David and his team are brought to justice.","user":"johnpope583","rank":[58,63]},{"title":"dogged investigative journalism stumbles from something innocuously weird to something bizarrely dangerous.","rating":8,"date":"28 August 2016","review":"Whether it is drama, comedy or documentary, New Zealand filmmakers punch above their weight. The documentary Tickled (2016) is one of the most unusual films you will see for a long time and a guaranteed conversation starter in the right company. While the film's title suggests comedic titillation, what it reveals is something more sinister that has wrecked many lives. It is also a fine example of how dogged investigative journalism can stumble from something that appears innocuously weird into something bizarrely dangerous.<br><br>It is said that movies have plots while documentaries have premises. Pop-culture journalist David Farrier specialises in fringe phenomena and his premise is that if someone spends a fortune to stay anonymous they have something serious to hide. He comes across something described as \"competitive professional tickling\" that involves the filming of young athletic males being tied down and tickled by one or more other young athletic males, all fully clothed. His initial inquiries to understand more about this activity are so aggressively stonewalled that he turns his investigation into a documentary with most of the filming in the United States. Expecting to find a secretive cult of homoerotic activity, he finds participants who have been subjected to extraordinary legal threats, extortion, and public shaming. The scale of intimidation and the lengths to which perpetrators are prepared to go indicate there is big money involved. The documentary feels like a parallel universe where things go from strange to stranger as the inquiries lead to a prominent and wealthy American lawyer who was a teacher and school principal. Farrier and his team-mate Dylan Reeve use old fashioned stakeouts, doorstop confrontations, and forensic web-based research to turn the study of a fringe fetish into a gripping thriller.<br><br>This is a well-produced documentary, especially for a novice filmmaker. Minor criticisms aside, like Ferrier's occasional tendency to tell rather than show and a few scenes that need tighter editing (like the time spent in the car stake-out), the overall pace, direction and content make this a totally engaging film. The hand-held filming technique and the unexpected twists and turns in the investigation impart real-time-discovery effects. A quick Google search will show that both during production and since the film's release Farrier and Reeve have been and still are under serious legal and financial threat. Not only do the filmmakers deserve a bravery award, their work is riveting from the laughter-filled opening scenes to the chilling closing credits.","user":"CineMuseFilms","rank":[42,47]},{"title":"Strange days indeed...","rating":7,"date":"28 August 2016","review":"New Zealand journalist David Farrier came upon the strange phenomena of competitive endurance tickling when searching online for new avenues to write articles on. He duly contacted the group who organised it, Jane O'Brien Media, but was met with a volley of abuse. After some to-ing and fro-ing they sent over representatives to Auckland to meet Farrier and his fellow film-maker, which only led to further threats. This bullying encouraged the two film-makers to go to the United States to try and find out more about what dark forces were behind this seemingly innocuous, if somewhat bizarre, online activity.<br><br>Tickled has been described as the new Catfish (2010) and not entirely without justification. It shares the concept of a documentary following a mystery route where strange secrets are uncovered. In this one an enigmatic empire seems to lie behind the world of tickling, which is really not a competitive endurance based activity at all but an odd sexual fetish. It turns out it is harmless enough to get many young men involved when there is a cash incentive but embarrassing enough to cause them many problems when these tickle videos begin to be posted everywhere online by the media group who own them. The videos are used in this way as a means of ensuring the men comply with the demands of the mysterious leader Jane O'Brien, if the boys refuse to do more work then the videos are posted everywhere with their real names attached to them. The film-makers soon discovered that most of these young men were consequently too afraid to speak out but one or two individuals do talk and detail the levels of blackmail, bullying and exploitation they have had to endure. There group behind it seem to be as much interested in power and control, as they are in their sexual fetish. The investigation begins in the earliest days of the internet and continues to the present day. There is a big reveal late on but it's best not to say too much about it.<br><br>It could probably be argued that, while this one has a very interesting premise, it doesn't necessarily wrap things up as strongly as it might. By the end it feels like there are still more questions than answers. Still, this is an interesting and strange story and despite one or two flaws, it's one that makes for fascinating viewing.","user":"Red-Barracuda","rank":[34,39]}]