[{"title":"Gets it point across...","rating":7,"date":"11 June 2018","review":"Not until the end does it all come together but gripping throughout. keeps your attention. A tiny bit longer than it needs to be but it gets its point across. Wonderfully acted and great cinematography. It's not perfect but in my mind rates a solid 7.","user":"goniff","rank":[8,12]},{"title":"Sadly, this was just mediocre at best","rating":4,"date":"17 February 2018","review":"\"Berlin Falling\" is a pretty new German thriller film from 2017 that is a rare effort as director for prolific actor Ken Duken and he is also part of the writing staff, 3 people actually, and neither of them has written another full feature film before that. It runs for slightly under 1.5 hours and has big players Sky and Warner Bros. attached to it. Duken also acts in here in what is basically a 2-man show from start to finish as we have one character being kidnapped by the other. The co-lead is played by Tom Wlaschiha, who will probably be appreciated especially by Game of Thrones fan here. I am not one of them though and still I feel Wlaschiha was more successful and also more effortless in his approach to the role. But overall, it wasn't a good watch. Given the interesting scenarion, it was surprisingly ineffective with its atmospheric approach. The scenes in the car with the claustrophobia element to them where still among the better components the film had to offer and even these were executed shoddily at times in terms of the script. For a rookie effort, Duken's direction was fine I guess. All the scenes outside the car were fairly disappointing, especially those linked to terrorism or religion. This was one plot point that never really worked for me and honestly I never felt as much for the victim, let alone his daughter as I wanted to. It should have been a far better film in terms of the emotional component. Even better scenes outside the car, like the one early on with the police officers, felt like they could/should have been way better and could have been truly memorable if written with more attention to detail. But it just shouldn't be I guess and the consequence is this film that certainly gets worse the longer it goes, so I am somewhat glad it is not a 110-minute film. Early on, it still has its flaws, but also positive aspects that had me wonder if I should perhaps give it a positive recommendation. But this decision was taken from me by the deterioration here. Then again, I may be a bit biased as I have never been a great Ken Duken film. I just hope that if he keeps making films as the man in charge of the entire project that this film helped him in finding his touch. I cannot agree with the imdb rating here and give this one a thumbs-down. Never as gripping or tense or edge-of-seat material as it should have been. Watch something else instead.","user":"Horst_In_Translation","rank":[8,12]},{"title":"A Movie That Can Change Youur Outlook!","rating":7,"date":"19 August 2018","review":"This movie cannot be regarded as a \"racist movie\", because through this movie we can see the hatred of the westerners towards Islam and closely related to white supremacy.<br><br>A little boring at the beginning of the story, the movie begins to raise the adrenaline of the audience after going through in the middle of the story.<br><br>What we witnessed in this movie could be a portrait where the public could be easily deceived, by doing engineering that was deliberately made by anti-Islamic elements. Where their thinking generalizes Muslims around the world as a cause of damage on this earth.<br><br>Credit is important for the director Ken Duken who dares to raise this \"issue\" as his work. It should be thumbs up, especially this film is also very good to listen till the end. Be wise to respond everything from various points of view!<br><br>#RiviuRiviu","user":"adityapatukomara","rank":[4,8]}]