[{"title":"Profit Motive?","rating":3,"date":"30 May 2018","review":"I shall start by saying that for decades I've supported some aspects of alternative medicine - naturopathic, herbal, etc. Also, I am one of the original members of what is one of the first and is now one of the largest natural, organic, locally grown food cooperatives. \nSo, several problems with this doc's presentation. The doc's premises are largely that Eastern (i.e. Asian from some un-described point in history) coexists with something called energy (which of course is given many forms &amp; sources) all in opposition to Western or science based medicine &amp; thought. Additionally that emotions, stress create densities in our bodies that are bad such as cancer, fibromyalgia, Crohn's, migraines, depression, anxiety, chronic pain, etc. Thoughts &amp; emotions produce illness, disease &amp; consequently death. So by mediation, diet, emotion/thought you can control (i.e. cure) the above. You do so by tapping into an invisible power/intelligence that made us and thus can heal us. \nTo support all this the evidence (and basically only evidence) is a few interviews of people who survived. What we don't get are the statistics of how many of the hundreds of thousands or millions w/similar issues that didn't live. Probability says that some will survive outside Western science for any of a number of reasons including unique genetics or reversals that just happen. The fact is that science based medicine has doubled the life spans of peoples in comparison to those living in idyllic hundreds or thousands of years ago peoples. \nYes, thoughts &amp; emotions do affect health, but what is presented here is exaggerated &amp; grossly irresponsible. \nI also question the objectivity of the over whelming majority of speakers in this presentation because they were authors who happen to make money off of selling an idea.","user":"westsideschl","rank":[81,105]},{"title":"So many \"Answers\" to \"Life's\" \"Questions\"","rating":2,"date":"17 February 2019","review":"Heal seeks to answer a question that most of us ask ourselves daily: now that I've married this billionaire, what shall I do with my time? \"Director\" Kelly Noonan answers this question boldly as she speaks with \"authors,\" many of which she appears to chase while on their lunch break in New York City. One man talks to ghosts and seems disappointed when Noonan doesn't have a terminal illness. The rest of us are disappointed for other reasons.\nAll jokes aside, this is a gold digger's fantasy ride. Please don't be tricked into believing it.","user":"MPAbroad","rank":[39,53]},{"title":"Terrible","rating":1,"date":"17 February 2019","review":"For sure there is a powerful connection between the human psyche and physical health and I would still love to watch a documentary that explores that. This 1 hr and 46 min infomercial is not that. Every person that is interviewed in this documentary makes their livelihood by flogging a book, program or course that supposedly makes you more attuned to this healing energy. There is no exploration of the topic, it's just the same opinion of the topic coming from a range of different people. Yes there are cases where natural therapies have helped some people much more than medicine but there are a lot of people that have had no success with natural therapies and for whom modern medicine has worked best. I expected an intelligent debate about both sides and a weighing up to one side at the end but boy was I disappointed. Lastly, I heard a lot of very questionable stuff coming out of people's mouth but to hear Bruce Lipton say that type 2 diabetes was 100% NOT genetic took the cake. Wow.","user":"vickiphillips-47898","rank":[31,45]}]