[{"title":"Oh dear lord...","rating":2,"date":"25 December 2018","review":"Right, well I had expected this to be a ghostly comedy, given the synopsis and the movie's poster/cover. Boy, was I in for a surprise. A surprise not of the good kind, mind you.<br><br>This movie was terrible, just terrible. It had absolutely nothing that resembled a plausible or interesting storyline. A girl working at a restaurant inherits a family house where a ghost is having sex with her and her friends. Yeah, that was essentially it. Talk about being a complete and utter waste of time.<br><br>\"Dead Sexy\" is essentially nothing more than a pseudo sleazy movie serving as an outlet to show off women's bodies and naked women's torsos. Keep in mind that this being women that have had so much surgery done to them that they now look like cast aside melting plastic human replicas.<br><br>The characters in the movie were every bit as pointless and laughable as what passed to be the storyline. All except for one single character, and that was the Bunny character, played by A.J. Villarreal. But of course, she she was a he, the character was quickly discarded from the ghostly house...<br><br>About 30 minutes into the movie, my attention started drifting to my phone and I ended up watching YouTube videos instead. Once the movie passed 56 minutes, I simply had enough and I turned it off. Never returning to finish this movie, because it was a massive waste of time.<br><br>Don't get fooled by the movie's cover and synopsis, like I did, because you will be in for an hour and a half of pure torment with \"Dead Sexy\". Nothing sexy about this movie, but it was dead alright.","user":"paul_haakonsen","rank":[9,13]},{"title":"When there is no story, just bring in a bunch of girls","rating":2,"date":"9 July 2018","review":"This movie has next to no story - but that's ok.<br><br>Just bring in a bunch of hot looking girls and have them walk around in skimpy outfits to fill up the time.<br><br>Rent a house and drag the plot through with next to nothing to offer - as long as you have chicks in bathing suits and flashing their boobs and taking selfies - it's all OK.<br><br>Wow - what a waste of time and money and efffort when there are so many other better films to be made.<br><br>Ah well, it game some untalented people some work for a while. At least it will keep them off welfare for a few weeks.<br><br>The only spoiler this contains is that there is no story worth sitting through for over an hour.","user":"facebookmegan","rank":[8,12]},{"title":"Best of both worlds","rating":4,"date":"15 February 2019","review":"A nice horor scenario was paired with an aspect of movie genre all men like and watch daily. The softest porn you'll ever watch presents the perfect spice for the meal which was prepared by the director and the actreses. The acting isn't all that great but probably the budget was a problem for financing their good morale and more nudity.","user":"ikaca-725-28047","rank":[5,7]}]