[{"title":"Lego DC Comics Super Heroes Justice League - Cosmic Clash: Harmless enough stuff","rating":5,"date":"17 January 2018","review":"I was astounded at just how bad Gotham City Breakout (2016) was, it was purile unfunny and seven shades of dumb so I went into this highly sceptical from the get go.<br><br>Cosmic Clash sees Brainiac attempting to complete his collection of shrunken planets with Earth and its down to the Justice League to stop him.<br><br>Again it's lightweight stuff as you'd expect being lego, some of the humour is very childish but it succeeds in having moments of entertainment and blowing Gotham City Breakout out of the water.<br><br>This time also featuring Supergirl who manages somehow to be even more annoying than Cyborg it tells a harmless enough yarn but will still appeal to the younger audience as adult jokes (Even subtle ones) are lacking.<br><br>The Good:<br><br>Great voice talent<br><br>The Bad:<br><br>Some childish humour<br><br>Things I Learnt From This Movie:<br><br>Considering how playful and innocent Lego always are I'm surprised they wiped out an entire planet!<br><br>The devil has dandruff","user":"Platypuschow","rank":[6,6]},{"title":"Any aged fan of super heroes will find something entertaining and funny when watching","rating":9,"date":"29 March 2016","review":"Join everyone's favorite characters for the all new original movie, \"LEGO DC Comics Super Heroes: Justice League - Cosmic Clash.\" Director Rick Morales is in familiar territory as the man who helmed \"LEGO DC Super Heroes: Justice League - Attack of the Legion of Doom!,\" \"Beware the Batman,\" \"and Green Lantern: The Animated Series.\" Writer James Krieg is known for his work as a scribe for \"LEGO DC Super Heroes: Justice League - Attack of the Legion of Doom!,\" \"Batman: The Brave and the Bold,\" and \"Teen Titans Go!\" <br><br>Voice actors include Troy Baker (\"Batman: Arkham City\"), Nolan North (\"Lego DC Comics Super Heroes: Justice League vs. Bizarro League\"), Grey Griffin (\"Star Wars Rebels\"), James Arnold Taylor (\"Star Wars: The Clone Wars\"), and Phil LaMarr (\"Justice League).<br><br>Villainous super-computer Brainiac (Phil LaMarr) decides to add Earth to his collection of worlds in \"LEGO DC Comics Super Heroes: Justice League - Cosmic Clash.\" The members of the team of super heroes will stop at nothing to fight back. Scattered through time by Brainiac's devious schemes, they'll have to reunite to save the world. <br><br>My son really enjoyed \"LEGO DC Comics Super Heroes: Justice League - Cosmic Clash.\" He took the time to give it his review. He stated, \"Brainiac, the collector of worlds, has found a planet that comes between DZ and EB. He has taken captive of that world. Superman, Green Lantern, and Wonder Woman have been shot into different times. Wonder Woman is the Queen of the Cave in the time of dinosaurs. Green Lantern is the ship's cleaner in the time of pirates. Thunder Lad, Saturn Girl, and Cosmic Boy fight Brainiac-Superman in the future. <br><br>\"What I like about 'LEGO DC Comics Super Heroes: Justice League - Cosmic Clash' is Brainiac's super ship because it has many guns on it. I don't like Supergirl because of her whining. 'Cosmic Clash' is a movie everyone should see,\" Nine-year-old Ephraim told me.<br><br>\"LEGO DC Comics Super Heroes: Justice League - Cosmic Clash\" is not rated and for a general audience. Of course there's the typical comic book violence. However, there's always a lighthearted tone to everything.<br><br>There's not much when it comes to bonus material for \"LEGO DC Comics Super Heroes: Justice League - Cosmic Clash.\" A gag reel entitled \"The Justice League: Caught on Camera\" is included as a special feature. All our cherished super heroes \"candidly\" cause hilarity for everyone to enjoy.<br><br>Any aged fan of super heroes will find something entertaining and funny when watching \"LEGO DC Comics Super Heroes: Justice League - Cosmic Clash.\" With a good balance of female and male role models to latch onto, it's the perfect film for a quiet night at the house with the whole family. DC and LEGO have once again proved their partnership together is a genuine success.","user":"ersinkdotcom","rank":[5,6]},{"title":"Easily the best Lego DC Comics Super Heroes movie so far!","rating":8,"date":"10 February 2018","review":"As a decades-long DC fan I love these Lego DC movies. As usual with these there are nods to DC lore and history - plus some nice 'Back to the Future' and 'Star Trek' references as well. The voice acting is spot on, the story's great, and the CGI on the backgrounds is possibly the best in the series. That said, the opening scene of Brainiac attacking a distant planet is difficult to sit through - in the way that Jar Jar Binks is difficult to sit though. The final confrontation too between the heroes and Brainiac is pretty poor. But the scenes of Batman and the Flash time-travelling and their adventures in the different eras trying to locate and recover the missing heroes are fantastic. If the beginning and ending of the film were up to the same standard this would be a 10/10. As it is, those scenes are still strong enough to warrant an 8/10","user":"Milk_Tray_Guy","rank":[1,1]}]