[{"title":"Quirky, surrealistic still-life","rating":5,"date":"27 December 2019","review":"The central mystery in this piece is an exercise in slight-of-hand absurdism, humming with the tangy echoes of the edge of psychosis. This underlying body has a seductive weight and depth, yet only ever exists in images projected onto a screen, an interpretation of reality read magnetically from a two dimensional surface, a representation of a representation. Meme intelligently orbits this layered video construct, a swirling maelstrom of versions of a possible past, present or future, ripe with existential crisis, a piece where any attempt to decode meaning will further shred one's own bonds with reality. Through re-interpreting the non-narrative babble of the art piece, turning the tormentor into the muse, our protagonist is able to define her own foundations of self and reality, and move on from troubles past.<br><br>A little lumpy, but still intriguing. A bit of refinement and this could be a very compelling film. Keen to see the creator's next project.","user":"troy-boulton","rank":[0,0]},{"title":"Unlike anything else I've seen","rating":10,"date":"16 January 2019","review":"It's almost hard for me to write about Meme because it's so unlike virtually every other film I've watched. Particularly fresh: the use of the mystery around the origin of the VHS tape as a means for Jennifer to recover her own identity while navigating issues in her relationship.<br><br>The portrayal of the primary relationship in the film was almost *too* realistic. It was hard to watch at times and will ring true for anyone who's been in a long-term relationship.<br><br>Finally, the performances are great -- nuanced and real. Fantastic cast and direction.","user":"koleary1","rank":[2,14]},{"title":"Original, inventive and thoughtful","rating":10,"date":"18 January 2019","review":"Compelling movie from the opening credits onward. Many parts reminded me of Waking Life, but as seen through the Writer/Director's unique lens. Several strong performances as well. Well-crafted, original indie!","user":"michael-3350","rank":[1,12]}]