[{"title":"Wu xia revival flick with many strengths but some obvious flaws","rating":7,"date":"2 July 2017","review":"Sword Master is a typical example for the new wave of wu xia cinema. The costumes are colourful, the landscapes are breathtaking and the fight sequences are quite spectacular on the positive side. On the negative side, the special effects are exaggerated and overused, the story is developed in a confusing way with numerous flashbacks to hide the fact that the scenario is rather ordinary and the movie doesn't have the magic pioneer vibe of the original version called Death Duel in particular and the first wave of wu xia movies in general.<br><br>There are three elements that make Sword Master stand out and put it on a slightly above average level if compared to other contemporary wu xia flicks. The first twenty minutes of the movie are quite entertaining and feature interesting character developments, ferocious fights and stunning settings. The movie then quickly becomes exchangeable, predictable and shallow but its first impression is very positive. As a second element, the acting performances are rather positive even though they aren't outstanding or even moving. The different characters are credible and the actors and actresses rarely overact. Aside of one silly character who only has a minor role, the movie also avoids adding silly slapstick elements that wouldn't fit in. Finally, the movie has a great soundtrack that unites traditional folk instruments, classical music and a few modern sounds in a highly diversified and always appropriate way. The soundtrack manages to add more emotions to the different key scenes of this film.<br><br>Fans of traditional Chinese action cinema will surely be entertained by this movie even though it can't compete with the best genre flicks of the seventies and eighties. Those who aren't familiar with the wu xia genre should not start with this film though and discover the original films first. I was entertained very well and would watch this movie again in a few years.","user":"kluseba","rank":[7,8]},{"title":"As much homage as it is reinvention, Derek Yee's update of his 1977 'Death Duel' is 'wuxia' cinema at its best","rating":8,"date":"12 December 2016","review":"If 'Sword Master' seems an odd entry into Derek Yee's filmography in light of his recent gritty urban dramas like 'One Night in Mongkok', 'Protégé' and 'Shinjuku Incident', it is really a return to his 'wuxia' roots. Together with his producer and co-screenwriter Tsui Hark, Yee plots his modern-day update of the 1977 classic Shaw Brothers film 'Death Duel' first from the perspective of Yen Shih-san (Peter Ho), who gets the first stylised CGI-heavy swordsfight of the movie on a snowy stone bridge duelling with a vengeful but poorly matched opponent Gao looking for revenge for his second brother. Yen eventually kills his opponent, but is told by onlookers that he cannot claim to be the greatest swordsman unless he prevails over someone known as Third Master. And so he sets out on that very quest, which brings him to the Supreme Sword Manor where the Third Master's Hsieh Clan reside. It is there he meets the Manor's Lord and learns that the Third Master has been dead for 37 days, a news he receives with disbelief and uncontrolled rage. Turns out Yen is afflicted with an incurable illness, and his impending death coupled with a loss of purpose leaves him content to live his remaining days in obscurity at a graveyard outside Bitter Sea Town.<br><br>Without any further context at this point, the narrative shifts to a drunk man who stumbles into a brothel claiming to be rich but is only found to be penniless by its Madam after overstaying five days. And so he agrees to pay his dues by working as their errand boy named Ah Chi (Lin Gengxin), despised by most of the arrogant courtesans except one named Li (Jiang Mengjie), whom he takes a blade for after two belligerent customers refuse to pay for her service. Though it may seem that Chi acted out of love for Li, the truth is far more complicated – lost and disillusioned, Chi no longer has regard for his own life, content to live it out whether in humility or humiliation. So before Li or the brothel's owner can reward him, Chi leaves and heads for a nondescript village to join the boorish but good-hearted Mao (Tie Nan) as a sewage collector.<br><br>By this point, it is clear that Ah Chi is really the Third Master Hsieh Hsiao-feng that Yen seeks, who we will learn through subsequent flashbacks has tired of the blade and duty to the clan after realising how his conquests to be number one have only led to vicious cycles of killing and revenge. Certainly, Hsiao-feng's past will catch up with him – not through Yen though but rather by his jilted ex-lover Chiu-ti (Jiang Yiyan), whom he abandoned on the day of their arranged marriage that was supposed to unite the Hsieh and Mu Yung clans. While it may seem that Chiu-ti is driven by hurt, it turns out that she is torn between love and hate. Whereas, it is her pageboy Chu who only harbours the latter for Hsiao-feng, thus setting up an ultimate showdown which pits the Supreme Sword Manor against Chiu-ti's Seven Star Pool and the former's other arch-rival Purple Might. What about Yen? We won't spoil the surprise for you, but let's just say that Yen and Hsiao-feng leave the best for last – and for good reason, mind you.<br><br>Rather than just a modern-day rehash of its predecessor, 'Sword Master' takes a decidedly character-driven approach to its storytelling, emphasising each one's motivations and therefore their conflicts relative to each other. Hsiao-feng wants to escape from his birth legacy as well as his haunted past but realises that moving forward means facing up to the repercussions; Chiu-ti too is trapped by her past but her wounded pride binds her and Hsiao-feng in a vortex of hurt, hate and ultimately harm. Yen, on the other hand, learns to let go of his obsession for prestige, and his unexpected turn as protector, mentor and buddy to Hsiao-feng's Ah Chi is a refreshing break from cliché. Li may seem like the blander female role, but there is a nice touch of irony in her (as a prostitute no less) being the virtuous one next to the vindictive Chiu-ti. Across the board, the performances are competent, if slightly mediocre, so it is a relief the well-written characters nevertheless keeps us hooked.<br><br>Just as, if not more, captivating are the visuals, which are ravishing in their own right. To be sure, Yee isn't intending for realism here; instead, he aims for a self-aware visual artifice of sharp contrasts, switching effortlessly between studio sets and CGI to achieve an aesthetic befitting of mythology and legend. That same sensibility informs the action choreography by Yuen Bun and Dion Lin, staged with elegance and grace in every stroke. Each action sequence of balletic wirework is top-notch, enhanced for depth of field to give a thrillingly kinetic experience for viewers, especially those who have the privilege of catching it in 3D.<br><br>Like we said at the start, even though 'Sword Master' may seem like an odd addition to Yee's directorial oeuvre, it is very much a distinguished one, informed clearly by Yee's own love and flair for the 'wuxia' genre as well as that of his producer Tsui's. Fans of the genre will no doubt recognise Yee's reverence for its tropes, especially narratively, and hopefully come to appreciate his reinvention of the visuals through CGI and impressive wirework. Oh yes, there is both beauty and thrill in the action, and 'Sword Master' is one of the most beautiful martial arts extravaganzas you'll see in recent time.","user":"moviexclusive","rank":[19,28]},{"title":"Shaw remake is heavy on the CGI","rating":5,"date":"3 September 2017","review":"SWORD MASTER is a 2016 remake from mainland China of a 1977 Shaw Brothers swordplay movie called DEATH DUEL. Derek Yee starred in the original movie and he directs this time around, with Tsui Hark on producer duties. When I saw that this movie was from the mainland my heart sank, because, sure enough, it's a CGI-dominated action flick in which every sword fight is accompanied by CGI swirls, heavy wirework, and even CGI horses and backgrounds on occasion. CGI is always best when used sparingly and they go way over the top here, as per usual.<br><br>Story-wise, it's an intriguing enough film, perhaps a little on the long side, but it keeps you watching. The actors aren't that interesting although Shaw star Norman Chu has a nice cameo. It does pick up for the climax with some cool bits involving the skull-masked henchmen, and like most Chinese action movies it was made in 3D. I haven't seen DEATH DUEL yet but I have a feeling it will be the superior film, as most originals are.","user":"Leofwine_draca","rank":[3,3]}]