[{"title":"Not as good and complete as Bad 25 (2012) but still good.","rating":7,"date":"22 April 2016","review":"Off The Wall is my favorite Michael Jackson album, so when I heard that Spike Lee was gonna make a documentury about the making of that album it made me excited as I thought he did really good with 'Bad 25 (2012)' which was about the making of MJ's BAD album and 'shortfilms'.<br><br>Watching it it feels more rushed than 'Bad 25' which dug deep into the whole making of the album where as this 'Journey from Motown to Off the Wall' is a bit more unfocused.<br><br>I mean in a way it makes sense that it would, as it not only covers the making of 'Off the Wall' but the first half of the doc also covers Michael Jackson's career from the very beginning of Jackson 5 to the birth of said album.<br><br>Which isn't a bad thing but it also has some stuff I didn't appreciate much, such as there is a guy (think he's a rapper) who talks about how the first time he heard 'She's Out Of My Life' was when Eddie Murphy was making fun of him in 'Delirious'.<br><br>And then they go into cutting back and forth Michael Jacksons emotional performance to Eddie Murphy's parody and it just didn't sit right with me as I found it a bit disrespectful and also I don't think many people can relate to that random guy's story either.<br><br>And although Justin Bieber was a questionable interview-object in 'Bad 25' I think, Kobe Bryant is even more questionable who get's even more screen-time being interviewed here, like what does he even know about music?<br><br>I know Spike Lee is a big basketball fan but jeez.<br><br>Also feel like Spike Lee himself occasionally forget to just document as he often reacts loudly to what the interview-objects are saying, making various comments. He also takes the time to tell a story of a childhood story, with a very loose connection to MJ.<br><br>And a lot of interviews of substance are archive footage but overall it's still mostly entertaining and interesting.<br><br>I know I wrote a lot of things about some less good parts of the documentary but there is still more than enough good clips to go around to validate a watch and I actually kind of hope that Spike Lee will make a documentary about the making of 'Dangerous' as well.","user":"Seth_Rogue_One","rank":[10,10]},{"title":"Another good but not great music documentary from Mr. Lee","rating":7,"date":"13 February 2016","review":"Spike Lee seem to have settled for a recipe for how to make documentaries about Michael Jackson that are entertaining but not really informative.<br><br>The recipe is this: Talk to a bunch of famous people about how great they think Off the wall is. (He did the same with Bad25). Mix it with archival footage of Michael Jackson. Go through each track and talk a little bit about it, and when we get to the last track, the film ends. Even though he has people who wrote some of the songs, like Stevie Wonder, he refuses to go into detail and lets other irrelevant artists such as Pharell describe them instead. <br><br>He does not really go in depth enough, as he should for this big artist. He does not interview Quincy Jones, the main producer who launched Jacksons solo career, and relies on old archival footage instead. He hints of controversial subjects such as racism destroying the genre of disco, and Jackson rising above that. But its all done in a hurry as we plow through some beats and steps from Jacksons glittery feet on stage. Because thats more important to Lee.<br><br>Its more important to make this a celebration of Jackson, keep the audience amazed and keep the grove going. When in fact, there were serious subjects, conflicts and challenges within this era of Jacksons life. My biggest question is what did Jackson want to do different artistically that he could not do before? This is never answered. We hear how Michael eventually broke away from his family, but no mention of the fact that he was physically abused by his father, and the fact that might have something to do with his desire to work on his own.","user":"mariuswmadsen","rank":[21,24]},{"title":"Wow! Spike Lee Awesome Work!","rating":9,"date":"17 February 2016","review":"This documentary on the impressive, to say the least, Michael Jackson...Is GOLD. Can't help but think of the time and skill at which Spike Lee puts into this needed to be told Documentary on the life of Michael Jackson leading up to his release of OFF THE WALL. The old footage. As clear as it can be. Stunning. The editing is incredible. The interviews from the people who were there, in the studio. To the people who were influenced in and around the time of Michael, and the Jackson 5. I didn't want it to end. And yet, I'm reminded of just how extraordinary of a talent Michael was. And the extraordinary sad events on how we lost him.<br><br>First there was the BAD documentary, then there's the OFF THE WALL documentary. I hope Spike is saving the best for last with THRILLER Documentary. But after watching JOURNEY from Mowtown to Off the Wall. That might be a hard order to fill. Please Spike do it.<br><br>Two talents...Spike Lee making a documentary about Jackson. Unbelievable. Thanks Spike Lee, and Thanks Michael...for everything.","user":"poicop","rank":[10,21]}]