[{"title":"A movie that almost makes sense, but not quite, and this may be the whole point","rating":10,"date":"10 January 2017","review":"Some movies have a coherent plot that is told in a non-straightforward fashion, or that is open to several interpretations, or that leaves out some parts requiring the audience to fill-in (e.g. an open end), and possibly this filling-in can be done in more than one way. These movies require several viewings and considerable thought to make sense.<br><br>After watching The Wailing for the first time, I had the impression that it was this kind of movie. However, after watching it again, pondering it, and then reading and watching attempts by various people to interpret/explain it, I have come to a different conclusion. Namely, this movie does not have a coherent underlying plot. No matter how you shift the pieces of the puzzle in an attempt to recreate a coherent narrative, some pieces will never fit together, and not due to your incompetence, but because the underlying story is - possibly intentionally, possibly not - fundamentally inconsistent. It's like one of those optical illusions or Escher drawings that appear to describe a physical object, but in fact don't make physical sense.<br><br>Accordingly, whether one enjoys this movie or not boils down to whether one can be content with a movie that is technically well-made (cinematography, acting, costumes, etc.), but (a) its plot makes no sense, and (b) it is told in a deceptive way as to lure you into thinking that the plot would make sense if only you gave the matter sufficient thought, thus leaving you with a lingering, irritating feeling of dissatisfaction and confusion.<br><br>And maybe this is precisely the point of the movie: rather than telling a story, its purpose is to instill in the audience a feeling of confusion in the face of a sequence of events that almost, but not quite, makes sense. Much like life at times, no?","user":"oddeveneven","rank":[69,84]},{"title":"Another horror masterpiece from South Korea","rating":9,"date":"15 September 2016","review":"I want to start this review with saying that I am not completely against jump scares. They play integral part of horror movies, but when a movie mostly relies on them and is not supported with great story, I am always left displeased. What makes The Wailing so special is that there are almost no jump scares at all in this film. Instead, we, the viewers, are taken through a story rich with mystery, great characters and their struggles, dark atmosphere with well designed and amazingly crafted horror scenes that make your blood run cold. Also, in addition the movie carries a great subtext left for the viewer to question, find evidence and interpret it. You can feel that the director took some time and did some research to give us as much real horror experience as possible. One might find The Wailing a bit boring because the film is a slow burner and not constructed as most of modern horror films, or might find the film too long (running time 2h 36min) but if you are patient man it will pay off by the end.<br><br>Who says that the horror genre is dead. You just have to look beyond those cash grab mainstream horror films with wide releases and you might find some hidden gems.","user":"SilentEyes_","rank":[118,150]},{"title":"Astonishing \"Ambiguous Ending\" Horror","rating":9,"date":"7 December 2016","review":"SPOILER: Have seen a lot of films, reviewed a lot of films but this extraordinary two and a half hour technically-perfect humanistic horror film from one of the finest writer/directors in the business (auteur of I SAW THE DEVIL) was something of a cipher.<br><br>The closest analog I can suggest in David Lynch's 2001's Mulholland Drive, yet another technically perfect, humanistic, suspense opus which keeps you captivated for its full length, yet has you walking out of the theatre shaking your head and wondering what exactly you just saw? Both film-makers understand the \"big secret\" of story telling which is, if you can present your story in such a way that the viewer feels he or she is sharing the experience with the protagonist, you can tell any story you like and the viewer will just keep going.<br><br>I will not even try to provide an explanation for what THE WAILING means, other than to re-quote the writer/director himself who, in numerous interviews on his film, said enigmatically \"I began to wonder about the nature of God -- what if he was not always good?\" Recommended on many levels. As entertainment, as a puzzle, and as a clinic in how to make a film that engages ... and just won't let go.","user":"A_Different_Drummer","rank":[102,139]}]