[{"title":"The poetry of people and places","rating":10,"date":"5 August 2016","review":"Paterson is a celebration of the small details in life. A poetic and charming love-story about a perfectly ordinary couple, living in a perfectly ordinary town. <br><br>The town in question is Paterson, New Jersey. Home of poet William Carlos Williams, comedian Lou Costello, and one of America's largest waterfalls. The man in question, in true Jarmusch style, is also named Paterson (played with pinpoint subtly by Adam Driver). Paterson is a hard-working bus driver who quietly goes about his duties, all the while allowing the scenery and eavesdropped conversation to inspire his main passion in life; writing poetry. Meanwhile, his girlfriend and the love of his life, played without fault by Iranian actress Golshifteh Farahani, is a stay-at-home creative. She spends her day baking imaginative cupcakes and making new curtains from scratch. The films narrative centres around a seven day week. Each day brings a new variation on the theme, and each moment a reflection on two people who wholeheartedly accept each other for who they are. <br><br>Paterson is a quiet and contemplative film that sits perfectly in Jarmusch's repertoire. It's a film about how people choose to live their life, regardless of the necessities to work and make money. Like poetry, the words and images flow with little dramatic tension or conflict. Jarmusch explained at Cannes that he intended Paterson to be an antidote to the modern action film, and if this is the case, I'll definitely be coming back for another dose.","user":"Albert_Orr","rank":[207,260]},{"title":"It Is Simple","rating":9,"date":"18 April 2018","review":"I decided to watch this film because of two friends who claimed they did not understand what is happening and that they did not know how to watch a movie. I saw the and the answer is simple. In fact, the answer is in the movie itself!<br><br>If you are a fan of William Carlos Williams or a fan of Archibald McLeish (both poets), then the answer is throughout the film. Unlike many of today's films, this one celebrates the essence of a film by just being a film. McLeish offers an answer in his poem, \"Ars Poetica\" where he asserts a poem does not \"mean,\" it simply is.<br><br>Williams also offers an answer in his works: there is an inherent value in the the \"thingness of things\" whether it is the bowl of plums reference in this film or in the red wheelbarrow.<br><br>What Jarmush has given us is an excellent example of what these two poets told us years ago: there is value in the small and simple things of life. That is all this film is about and we are told, point blank, at the end of the movie: the Japanese poet asks Paterson if he, too, is a poet. Paterson says, no; he is only a bus driver. The Japanese poet says, \"This could be a poem by William Carlos Williams.\"<br><br>And, indeed, that is what we have just seen.","user":"markkbranson","rank":[19,21]},{"title":"Poetry can make life easier","rating":9,"date":"3 July 2017","review":"Life is made of routines. Everyday we wake up towards the same places, meeting the same people. If you want drama and action, then this movies isn't fit for you. This is a movie about routines, but more than that: a movie about how we can find beauty in the routines. Paterson, a bus driver, does the same everyday in a village that never leaves a sleepy, foggy state. But he faces each day with joy, together with his ally: the love for poetry. Watch the movie if you like to see normal people, doing normal things but still, finding beauty in the small things.","user":"brunonovodecastro-54-198253","rank":[38,46]}]