[{"title":"Interesting Concept, Plenty of Talent, Horrendous Execution","rating":2,"date":"2 December 2018","review":"Truly had to suffer through this film. Picked it up at a redbox hoping for a good new holiday film with a horror twist. Instead we got an eighty minute waste of time. The actors of the subplot had less than zero chemistry. The majority of the anthology style short stories were tired, forced and hard to watch, gaining an easy eye-roll with every turn. Constance Wu's performance in the final short story was arguably the only shining light. She and the general idea for this movie are the only reasons this is getting more than one star. From the writing to the directing, the cinematography to the majority of the acting, this is a downright dreadful movie. Please save yourself the time.","user":"Bateman-ka","rank":[16,25]},{"title":"Eh could be worse...","rating":6,"date":"5 December 2018","review":"Every holiday season, I like to offset my cookie cutter Hallmark/Lifetime movies with a couple Holiday Horror B movies. Balances it out or something. I've seen some real clunkers and some real gems but Christmas horror movies are especially difficult to get right. This movie however was decent for what it was. Being an anthology film, some segments were of course better than others and the film's limited budget shows but if you enjoy bad movies you'll have a decent enough time here. I found myself wishing that they went a step further to make it pure camp but I wasn't disappointed overall. Anyway grab a beer and have a watch. It definitely isn't the worst of the holiday horrors that's for sure. *No real gore and no nudity.","user":"katsumibear","rank":[9,15]},{"title":"Bad.","rating":2,"date":"8 December 2018","review":"Soo, I was looking forward to seeing this but after buying the dvd on its release date I sadly was let down... It's cool that it was created by what I think is a husband/wife team, but that's kind of where the \"coolness\" ends. Many of my favorite indie horror actors are in this film, including Graham Skipper, Chase Williamson, Jocelin Donahue, Amanda Fuller, Matt Mercer, etc...but the thing is, this movie really sucks and im kind of taken back that they would even take part in such a b film. They probably had no idea how poorly it was going to turn out. It is rare that I have so much negative to say about my beloved horror films, but seriously, what were the directors thinking? Clearly they made a movie just to say they did and did not plan well at all. I bet they spent all their money getting the known actors on board and then had like nothing left to work with for effects and sets. I would not recommend it. The directors should be embarrassed","user":"TuesdayThe17th","rank":[8,16]}]