[{"title":"Goofy fun first half, but fails in the second half.","rating":4,"date":"29 April 2018","review":"This movie starts out so silly it almost feels like parody but it's not. It just is that stupid. \nIt's a group of amusing simpleton kids that go looking for a \"lagoon\" and end up on the property of a deranged farmer that likes turning people into scarecrows. I actually kind of enjoyed the first half of this movie. It's dumb funny, has lots of eye candy, and if you like stupid, low budget horror movies, you can probably imagine the kind of dumb fun I'm describing. \nThe problem is the second half. When the movie starts trying to take itself seriously and be scary, it isn't. It's boring. The humor and gratuitous skin are gone and they're not replaced with anything. The gore is minimal and the scares are non existent. They should've just kept to laughs the whole time because they don't know horror.\nI was really, really struggling to stay awake through this thing.","user":"Kolobos51","rank":[13,17]},{"title":"Ok watch","rating":4,"date":"29 April 2018","review":"The movie is by no means great, but it has some reasonable acting a few laughs.\n But the story is still all the same old same old.\nThere was something i just liked about the movie.\nI thought it was reasonably made, with descent acting.\nNot your high class horror, but this was a fun watch on a sunday afternoon.","user":"dawny_dawn-51634","rank":[9,12]},{"title":"More of the Same...","rating":2,"date":"27 April 2018","review":"Seriously, how hard is it to make a good Scarecrow based horror movie? Here we spend the first 30 minutes or so getting some \"character\" development from some of the worst actors ever. The characters are unlikable and you don't care when they're all drug off one by one to become scarecrows in this God awful flick. The final minutes? Are they suppose to be suspenseful or frustrating? It's neither of those, it's just another cop out with an ending you see coming a mile away. I see some 10 star ratings here, I'd bet you anything that those came from the cast, or crew of this flick. Don't waste any money on this one, it's not worth it at all.","user":"Demon_Best_Friend","rank":[17,26]}]