[{"title":"Predictable plot with a wasted premise that is compensated for by amazing atmosphere for a low budget sci fi","rating":7,"date":"7 March 2019","review":"A Serbian Film (no not THAT one) about a man on an isolated spaceship, his only companion a female Android. Right off the bat, I have to admit there are specifically two points this SF feature got right: lighting and sound design. These two things genuinely enhanced the atmosphere of the movie and made you engaged in the universe it created. So many big budget SF movies Hollywood pukes out these days just fail to realize the importance of these two attributes in the genre.\nThe premise, coming from a Socialist country, seems a bit .. of a stretch. Apparently , Capitalism is a plague in the future that has even infected whole galaxies and it is up to the ever righteous Ederlezi Corporation to send social engineers to these space colonies to restore normalcy the socialist way. That being said, I really wouldn't have had a problem of they actually fleshed out this premise even more. Instead, the film chooses to mainly concentrate on the chemistry between the cosmonaut and his robot sex partner. Which I guess wasn't bad on its own.<br><br>The robot is played by an actual pornographic actress, the beautiful and enchanting Stoya, so there is absolutely no body double or vfx used during the sex scenes. Also, she is naked most of the time even when the script didn't call for a sex scene. However, I admire that her particular athletic,not voluptuous, figure and the incredible lighting actually transcends any sleaziness and gives her a more sublime aura. It helps amplify the other worldliness instead of just being gratuitous nudity.<br><br>All in all, considering the low budget, I am very impressed. We genuinely need more atmospheric sci fi instead of another season of Star Trek Discovery.","user":"sagniknath","rank":[147,183]},{"title":"old school scifi","rating":7,"date":"20 March 2019","review":"I can see why people review this movie poorly. There is little action, No galactic battle.No grand cgi.<br><br>This is scifi from when I was a kid reading stories by Heinlein, Herbert and Asimov; watching Night Gallery and Twilight Zone. Where science and the future is used to ask questions about the human experience.<br><br>This a story about free will and consent. A man is alone on a spaceship with a female android he can use and control. Is that satisfying? What happens if the android gains free will?<br><br>If you like the old psychological sci fi and you're not a prude , you might enjoy this one. If sex and nudity offend you or you crave alot action, this isn't the movie for you..","user":"calvinw","rank":[89,110]},{"title":"Lots of robot sex but little else","rating":1,"date":"7 March 2019","review":"OK, so if you think robot sex makes a good film you will like this movie. Otherwise, if you think a story makes a good film, you will hate this movie. Especially the final act. Without spoiling it, it makes absolutely no sense. Everything the male lead does is just plain dumb. Anyone with half a brain can see that what he is trying to do could be done easily and with little damage but he is so stupid that there is lots of damage. And that means that what he \"accomplishes\" becomes meaningless. So does the robot sex make it worth watching? In my opinion no.","user":"rjwiebe-34870","rank":[73,95]}]