[{"title":"A trip to nowhere","rating":4,"date":"3 April 2018","review":"The cast is good and the film is technically well made, but it lacks any kind of - well - interest.<br><br>It just meandres on with a few things happening - then it is the end of the film - that is it.<br><br>The story had a great deal of potential that it fails to fulfill.","user":"mjsreg","rank":[13,18]},{"title":"Failed female Midnight Run","rating":2,"date":"19 March 2018","review":"Tessa Thompson and Melissa Leo are great but this film is not. Trying to be a female Midnight Run for these times but pretty much nothing working except the performances of the lead actresses. The script is bland and a lot annoying at places and the comedy that is supposed to be working is outdated and boring. Then there is the ending where suddenly Thompson's character change a lot in her life without having any big realizations in the journey or consequences of applying it which is simply baffling that this could have been part of a student script that never got made because it shouldn't be.","user":"Jithindurden","rank":[17,26]},{"title":"Humour Falls Flat and Plot is Full of Contrivances","rating":3,"date":"14 January 2019","review":"A young, struggling part-time correctional officer gets the chance to become full-time by escorting a prisoner to her mother's deathbed. She is obviously supposed to learn something from the experience of trying to chaperone an unruly but older prisoner. Instead of a script that might let them learn or bond, instead it's a series of scenes with them simply sitting together as they travel.<br><br>Unfortunately, it feels as if the plot gets elements added to it to make it difficult. Most of what occurs in the trip seems to happen for no good reason, except to create situations where the inmate can escape, at least temporarily? Why, for example, would they be forced to take a bus and then a train to the mother (but then quickly return via rental car)? Why does the phone of the officer constantly ring or receive texts? Why do romantic interests appear and disappear as if put on the screen like chess pieces?<br><br>In short, I wanted to like this movie but it seems a mess, and I kept wondering how much Whoopie Goldberg and Anna Paquin were paid for what must have been 2 days of shooting each (if that). The humour really doesn't work - painfully so. The script is dull at best, and the tone is sometimes too mournful for it's own good. If you are a fan of Orange is the New Black, any episode you've seen is better than this.","user":"ddrucker-424-403482","rank":[7,9]}]