[{"title":"Father relentlessly pursues his enslaved daughter in the gritty Old West","rating":6,"date":"26 April 2018","review":"RELEASED IN 2016 and directed by Timothy Woodward Jr., \"Traded\" stars Michael Paré as a father ruthlessly pursuing his runaway daughter (Brittany Elizabeth Williams) who has fallen prey to slavers in the prostitution trade. Trace Adkins plays an intimidating saloon owner while Kris Kristofferson is on hand as a bartender seeking redemption from the filth he's forced to live amidst. Tom Sizemore plays a nasty buyer in the slave-whore business. <br><br>This is a low-budget Western that has some technical weaknesses, like dubious continuity/editing, but a compelling story, gritty tone, brutal violence and fine locations, costuming &amp; score. If you don't appreciate dark, violent modern Grade B Westerns like \"Hickok\" (2017) and \"6 Guns\" (2010) don't bother. The plot is obviously a melding of \"Hardcore\" (1979) and \"Taken\" (2008) in the Old West, but without the blockbuster resources. There are a lot of UN-pleasant elements as we see what those saloon babes REALLY had to go through in the Old West. <br><br>There are some unexpected highlights, like Marie Oldenbourg as \"Girl\" in a meaty subplot, but the way it concludes (the subplot) is a missed opportunity. As dark and brutal as the movie is, there are thankfully brief rays of light, hope, reverence and (hopefully) happiness. <br><br>THE MOVIE RUNS 1 hour 38 minutes and was shot at Paramount Ranch, Agoura, California and areas nearby. WRITER: Mark Esslinger.<br><br>GRADE: B-","user":"Wuchakk","rank":[10,11]},{"title":"Maybe too realistic for some viewers","rating":6,"date":"9 December 2018","review":"I suppose this film moved a bit slow for some viewers. If one is used to high paced video games this movie might even seem boring.<br><br>The lead character is not a polished cool as a cucumber dude with lots of clever lines. He is a father in pursuit of a daughter who was kidnapped.<br><br>It gives a realistic view of the 1880's west. It was dirty, gritty, and dangerous. Oft times people were shot and there was no law to inquire as to what happened. So the ruthless often killed with out fear. Tempers flared easily and cheating at poker could get you shot at the drop of a hat.<br><br>Those were harsh times and people were abused. Especially women who worked in saloons. Too often they were made to believe they would be hunted down and beaten if they tried to escape. I fear some were murdered, just as this movie portrays.<br><br>There were times when I began to think the father was not very smart in his approach and that was a very negative aspect for me. He could have been a lot more strategic while searching for his daughter. Several times his demeanor gave him away as someone looking for trouble. A few times I heard myself thinking, that was not smart, I would not have done it that way. Too often he charged in like a raging bull rather than being clever and resourceful.<br><br>It was good enough to hold my attention but certainly not going to win any academy awards. I gave it a six out of respect for the realism of the era.","user":"headhunter46","rank":[5,5]},{"title":"Truly dreadful","rating":1,"date":"17 June 2016","review":"It's so sad when people write in saying that this is the best western they have seen or even the best movie ever. Since the start of the twentieth century many thousands of westerns have been made with hundreds considered classics and works of art. Will Traded still be watched in fifty or sixty years time? No, probably not even next month. It's great to be loyal if you're a friend or relation of someone in the cast or crew, but don't send movie goers off thinking they'll be seeing a Peckenpah, Ford, Stevens or Eastwood. There is nothing better than a good western, but nothing worse than a bad one and this is bad on so many levels. The direction, (if I slow it right down it will appear more arty) script, (must hold the world record for how many times the phrase 'son of a bitch' is used. Acting often very amateurish (apart from the actress playing Girl), and costumes and props straight from the hire shop. So many shiny new guns. Will the director be kind enough not to make any more. For me and countless others, westerns a too important and you're giving them a bad name.","user":"charliewaites","rank":[31,45]}]