[{"title":"the 7 i's of traumazie","rating":6,"date":"12 December 2018","review":"A familiar list of actors lure you into this drama, and they deliver as far as they can do.\nmost of all its a drama about tragedy,loss,depression and survival. there are abgsolutely no comedy in this ameriacn flick,obviously never meant to be either.\nbut it strikes you how voulnarable life is,how we live a life on a knives edge,how damned lucky we are to be able to live a common normal life,compared to the hell this little family goes through.\nits a good production overall, though the narrative story could have been better told,espescially where,when and for how long,are never told. i feel better when you have some basic frames to hold on to. though i liked the 7 chapters of grief, and will therefore recommend this film","user":"ops-52535","rank":[12,20]},{"title":"One step at a time","rating":1,"date":"17 June 2019","review":"Dad is killed in a saloon parking lot. Mom and son have trouble coping. Freud was wrong. Bored to tears.<br><br>Guide: F-word. Near sex. No nudity.","user":"nogodnomasters","rank":[5,7]},{"title":"Basic story but some nice aspects","rating":6,"date":"26 May 2019","review":"It isn't really a spoiler to say the film revolves around two members of a family dealing with a family death. To be honest the main premise and meat of the story doesn't really have much drama, but the acting, including the supporting actors, is good, and there is some subtle scenes which may be touching for some but really wasn't for me (and yup, I've had a family death, but nothing really reverberated here for me). All the same, I don't think there was anything particularly bad about the film. I guess it was just trying to be more of a mood piece. The way it was broken into 'scenes' probably took more away from the film than it added. It was well done and really, I think many people will enjoy it, but it will never be a classic nor is it original enough to stay in the memory. My advice is, watch it if you're not spending too much money to do so, and it will give you some entertainment value. Of course, it's a specific genre (mother angst) so not for those into action, comedy or romance. Even the backstory of this strong love seemed a bit superficial and the way it was cut into the film was sometimes jarring.<br><br>NB. Be wary of any 10 star reviews on imdb.. they seem to be fake. Definitely this film is not 10 stars, though some may like it more than me.","user":"uberdonkey6","rank":[3,4]}]