[{"title":"What kind of a person excuses terror?","rating":1,"date":"27 September 2017","review":"This so called \"movie\" is so awful. Don't waste your time and money. Seems like it's producers had been buying tickets themselves and paid for the reviews to ensure interest and ratings.<br><br>Terrorists are shown as good guys. What? They say that this so called movie is based on reality. It's a big fat lie. You won't see the real facts: how these animals tortured women and children, how they did all of this just because they craved for popularity and money, how they laughed while killing people, how enormous their cruelty was. And how almost all of the terrorists were \"Golden Children\", whose rich parents tried to buy them out with their millions afterwards. And how those parents sponsored the book this so called movie is based on. Maybe they sponsored this too? Imagine if some crazy liar makes a movie with the idea that 9/11 terrorists were nice people that rebelled the regime and we all are just too stupid to understand them?! I was told that the director Rezo is a Russian Gigolo, who has no real job. Well, \"Hostages\" is a proof that if you are good on a couch, you'd better stay on a couch and don't annoy people with your face-palm creativity.","user":"realmarvelous","rank":[49,70]},{"title":"Poor kittens fighting for freedom","rating":1,"date":"23 December 2018","review":"It's based on true events, but it shows a completely different characters. The movie depicts those people as victims, who just wanted freedom.\nIn reality, they were spoiled brats of quite rich powerful people, with all the money and means to immigrate (as they wished so much) peacefully. Instead they chose to hijack the plane and become anti-soviet heroes in the western world, asking for a political asylum. (Because there is a difference between an unknown immigrant and a high profile political victim, sponsored and promoted by the other government PR agents)\nAccording to the real documents and witnesses they didn't act as scared good guys on the plane, they didn't help wounded - they inflicted those wounds! They acted as all classic terrorist act - killed people who showed any threat, tried to keep the crowd scared and under control by abuse and humiliation (e.g. didn't allow them visit the toilet, keep beating flight attendants when they felt like it).<br><br>Same story about the special forces, authorities, the trial and the person who inspired the group - it was all shown a little bit opposite of what it was.\nAuthorities were shown as eager-to-assault people, aborting the negotiations. In real life \"hostages\" refused to talk to their parents themselves. Nobody mentioned that they threatened to bomb the plane with all the passengers on board (because they had grenades). Nobody showed how special forces managed to bloodlessly secure the plane in 8 minutes (I would be keen to watch this part instead).\nCourt speeches included more \"political\" parts from the real trial than the parts about murders and violence.\nThe initial mastermind of the whole attack (the priest) was shown as a completely uninvolved innocent person, guilty of only gifting someone Beatles records (although Beatles were not banned in USSR in 80s, they were quite popular and were sold legally at the music stores).\nOf course as a result the final verdict seemed like a cruel over-reaction in the movie.<br><br>I think that if you wanted to film something about the dark sides of USSR regime, you should have picked something else. Anything but the bloody terrorist attack, organised by wealthy attention seekers, where real innocent hostages have died or became disabled for the rest of their lives.","user":"nyutkamarko","rank":[5,6]},{"title":"not fun to watch","rating":3,"date":"17 March 2018","review":"It may be a true story and may be technical it is good, but my opinion is that there is so much filling in the movie at the beginning and then the main event is very short and i didn't really enjoy watching this movie.","user":"i-fathy","rank":[5,8]}]