[{"title":"Weak writing and a confusing ending.","rating":2,"date":"9 December 2019","review":"I thought the light/comedic soundtrack was an ok touch although there is no real comedy in the film to kind of reinforce it. Visually the film is ok, nothing noticeably good.<br><br>I get that all these people, especially the lead guy Brad are unlikeable, but they really push the boat out. They are whiny, arrogant and as I said really unlikeable but one of the problems is we don't get to see their downfall. They get away with murder, it's like a big screw you at the end of the film. I was actually hoping the main guy would go to jail. It's not like they even earned it to get away with the crime in an interesting or clever way.<br><br>The acting for the most part isn't bad, but what drags it down for me was the actress playing Mindy, she wasn't great and she was noticeably bad when she tried to be emotional at the end.<br><br>There are a few things that make little sense:<br><br>1. Brad's father seems concerned about his son getting into a good college but when the assistant principle rings him and puts forth an issue in his personal love life that could effect him graduating he just waves it off, from the fathers perspective he doesn't know the details, it could jepardise his son's ability to go the college he wants.<br><br>2. Why didn't Brad report the assistant principal when he threatened him with a gun? He clearly doesn't want him around, or bothering him any more. He could tell the cops he has a gun in his car and there's the fact the family have a history of crime. He may not get arrested but at least he could get his gun confiscated or that he would be on police watch or something, anything. But it doesn't happen because then there wouldn't be the shooting near the end. That's just lazy, you need to come up with an event so that it wouldn't be possible to report it to the cops, instead it just doesn't happen for no reason, no one mentions it.<br><br>3. How in the hell did they get away with the murder in the police station? Shane (the only sensible and grown up person for his age in the film) sets their story straight when they go to the cops, Brad shot the assistant principal in self defence as he was assaulting Johnny, but when they're interrogated separately in the police station\nBrad sticks to the actual story, the real one, that Tommy knocked the gun out of Johnny's hands, he (Brad) grabs the gun and shoots him after that when Johnny's not being assaulted, Brad says to\nthe cop \"I didn't have a choice\".... but it was established that the assisstant principal earlier that when a gun drawn on him, he did what Johnny wanted with a gun drawn on him, why didn't Brad point the gun at him and tell him what to do? This could jeopardise their freedom ! wheres Brads loyalty that he values? Their stories have to match. \"don't tell the cops and if they ask you anything tell them it was self defence\"a quote by Brad to Mindy, NOT sort of Murder as he says to Shane when he walks in on them, Brad is an idiot and a hypocrite, why and how am I supposed to be invested in this story?<br><br>Brad says he's worried that they'll get in trouble if they go to the cops as they lured Tommy to their house and that's suspect, it's not. The only potential witness to this is Tommy's father and there was no luring at Tommy's house in Brads actions or dialogue, it would seem sincere. This makes no sense, just say Tommy was jealous and attacked Brad and Johnny shot him. This Brad guy is so unbelievably dumb, I was preying he'd go to jail/die. So we're supposed to hate Brad? right? but then at the end there is this forced plot point where his mother left him. We're supposed to to care about Brad now? you can't throw in a line at the end without any setup of his mother abandoning him and expect the audience to care.<br><br>that's not how you deliver that kind of context so as to be meaningful. what is the tone here? what am I supposed to be feeling? What's the moral?\nwhy didn't Brad just point the gun at the VP and say, \"leave me and Mindy the hell alone. If you don't THEN I'll kill You (as a threat) if you mention this moment to the police I'll say you threatened me with a gun\" then you could say \"well the film would be over\" then come up with an event to dive the plot, this type of issue is something writers face all the time and they overcome them with organic events that motivate the plot to go in a particular direction. There were 15 drafts to this script and the writer didn't bother to fix this? Lazy writing, sadly.","user":"richardadesmond","rank":[2,4]}]