[{"title":"Not bad","rating":7,"date":"20 July 2018","review":"First of all this movie is not bad.Fun and traceable.But not a brilliant movie.Because it has a bad ending and does not have a so good story.But i like \"Rosy\".10/7","user":"ErdemDincer02","rank":[13,23]},{"title":"Stole the plot and didn't give credit.","rating":2,"date":"5 January 2019","review":"I hate to be one of those \"the book was better\" people. But I started watching this on Hulu not knowing what it was. But two minutes into in I pulled the book \"the collector\" by John Fowles off my book shelf and told my partner of 15 years this movie is that book. I couldn't get over that they slightly altered the plot (girls story line) and the ending.. in the book she doesn't get the doctor when she needs it. But every other little things Is the same. Which wouldn't bother me if the movie was called \"the collector\" or if they gave John towels credit in the titles. But they don't. And it's disturbing to close for them not to give credit. Especially when the book was better.","user":"hideehow","rank":[5,7]},{"title":"Left something to be desired","rating":4,"date":"2 September 2018","review":"This story has all the right elements to be a new age cult classic, but some of the execution was so poor that it can't break past it. All in all the movie felt unfocused and the ending left something to be desired. Ideally the film would've needed another 30min added to its run time to give the movie enough time to fulfill the storyline and give the audience a better resolution. Although I understand the direction the movie was going for, it really didn't work with this movie in the slightest. Nat Wolff fit the \"slightly off putting\" character to a T, but as for his co star not so much. It's really unclear for most of the movie whether this is a case of Stockholm syndrome or if she is faking it. The line is very blurred and perhaps that was the goal, but it resulted in a very disorienting film.","user":"shelbyswanson-67936","rank":[8,13]}]