[{"title":"\"Russian female sniper\" enough said....except...","rating":1,"date":"9 October 2019","review":"I refuse to believe that there was even one military technical advisor for this monstrosity. 3 minutes in, you'll realize how bad the dialogue is. 10 minutes in, you'll realize how cliche things will be. 20 minutes in, you'll realize that the Russian girl couldn't possibly know anything about marksmanship or cover and concealment ie: barrel of weapon system hanging out of a window. Then if you get beyond all of that, there's a 10 minute rant of what looks like not even close to a Muslim radical, about how the west will never take \"these lands.\" Not kidding, 10 minutes. Calling a 4 star general \"commander\"=never happen, a Lieutenant Colonel with an EIB, a beard, and about 28 years old=never happen, not having the helo stay on station while in a TIC=never happen. It looks like the Russian girl's helmet was Andre the Giant's old helmet. Every time the helos are inbound, someone says \"10 minutes out.\" As if that is going to add some sort of military type jargon to the scene. I won't even get into the tactics. Spoiler alert: when the baddie is holding the detonator, and the \"sniper\" doesn't shoot him, but shoots at him after he detonates the bomb and not hitting him. Why not just shoot him in the first place? I could write probably 10,000 words about what this movie gets wrong. I can write a few words about what it got right....it ended....kind of... even that, they f'd up.","user":"jcmlb","rank":[39,42]},{"title":"Boring, by the numbers, doesn't add anything to the genre","rating":4,"date":"6 October 2019","review":"Rogue Warrior is a low budget, low-effort action movie about an elite group of special forces operatives from different countries, who have to work together to stop a terrorist organisation. At first they don't get along, but in time they learn to trust each other and co-operate, yada-yada-yada.\nIt has all the typical ingredients of a B-movie; terrible looking sets, clunky dialogue, a bad guy costume that looks like a mix between Kylo Ren and a Muslim woman's hijab... I could go on.\nI would've been glad to overlook those things if the action scenes were decent (that's the only standard I really hold this type of movie to), but unfortunately that's where I found the movie to be most disappointing. Apparently, in his \"day job\", director Mike Gunther is quite an accomplished Hollywood stunt coordinator, but that really doesn't show through in this movie. The action scenes look cheap and amateurish, and there's really not a lot of stunts, apart from the arbitrary \"terrorist gets shot and falls down\".\nIt all adds up to a bland, mediocre package which had me struggling to keep my eyes open, especially during one of its long expository dialogue scenes (of which there are too many).\nUsually I'd recommend this type of movie for a lazy Sunday afternoon, but there's just nothing interesting here and there are too many better movies, even in the low-budget genre. Give it a pass.","user":"jsmiemans-15452","rank":[15,17]},{"title":"WORST MOVIE EVER SEEN","rating":1,"date":"2 November 2019","review":"Wasted $ paying for this on PPV...i never write reviews, but this movie is so bad on every element of moviemaking. Spoiler...the \"team\" diffused a dirty bomb. Then, even though the bad guy leader was not killed or captured, they just leave it in the village...omg, absolutely hilarious it is so bad...then, when they walk off from bomb, and though their pseudo-team leader is still a hostage, movie ends with \"The Team Will Return.\" Omg, a sequel to the worst movie ever made, but no, it's a TRILOGY! LOL, you have to be joking...I could go on and on...the diabolical mad man bad guy, who by some amazing moviemaking speaks English with his own people through 80% of the film during VERY LONG speeches, but for some reason switches to whatever language, could have been killed 3 or 4 times...there were so many bad cliches and horrible military tactics, I just can't, it was absolutely horrible from start to finish.","user":"rzrbckred","rank":[7,7]}]