[{"title":"Great concept, TERRIBLE execution.","rating":2,"date":"29 November 2018","review":"I really tried to like this film. I really did. It had a few positives that were shining points, But in the end there were so many blatant missteps that couldn't save it. First, the good: Visuals (encompassing VFX, cinematography, etc); The film was beautiful. That's probably the most positive thing it had going for it. The visual effects were great for what the budget was, the camera work was good, although I feel like shots were thrown in just to look cool rather than visually tell a story, the aesthetic of the world was great. The film was a pleasure to look at.<br><br>Sound: the sound design was another high point. The different sounds that powers made was enthralling and reeled you in, The music was beautiful and made sense where it did. Something constantly overlooked in indie film but this one did it right.<br><br>Concept: The concept is something I could really be interested in if it was done right. A film that's basically set in the X-men universe with a Mortal Kombat meets hunger games competition? Sign me up!<br><br>Now for the bad: Script (dialogue/pacing): By far the most glaring issue right away. This was OBVIOUSLY \"adapted\" from a comic book, and I use the word \"adapted\" loosely because it feels like the exposition laced dialogue was just ripped from A comic book and not changed to make it more natural or realistic in spoken word. You can tell the actors were struggling to do what they could. As for pacing the film felt, somehow, dragging and rushed all at once. Way too much time spent on things that weren't necessary, way too little time to focus on actual interesting happenings.<br><br>Fight scenes: By far some of the worst fight scenes I've ever seen put to film that wasn't done in a pre teen backyard fighting choreography YouTube video. Every single fight with the exception of the fight between the only human characters was sloppy, painfully executed AND choreographed, stiff as drywall, and consistently interrupted LITERALLY mid-fight (as in in the middle of an attack) to exposit just a little more.<br><br>Performances: a few of the lead characters did fine with what they were given but some of the people that I've noticed are constantly used in this directors films just shouldn't be. There is an extreme lack of talent among people that seem to have the most lines which is kind of mind blowing. The fact that easily the best performance of the film is given by a character that has less than 4 lines should give you all you need.<br><br>Conclusion: I REALLY hope that the production of this film was just a case of no one having the stones to tell the director that some of this stuff just doesn't work out of fear of getting canned rather than everyone involved just being terrible, but the film has very little high points. It's a slog to get through that makes its relatively short length surprising and I hope to whatever higher power there is that the next film addressed the issues of this one, namely getting someone on board to refine the script and take it out of the comic book panel dialogue it's locked into. If not, at least let it have some entertaining fights that don't look like 5 year olds are the ones designing them.","user":"Altered_Bourbon","rank":[21,22]},{"title":"92 Minutes Of My Life I Will Never Get Back","rating":1,"date":"6 February 2019","review":"This looked like a decent holiday afternoon movie on Amazon Prime. Was seriously disappointed. Just underwhelming, boring fight scenes that lacked cohesion. No real story or compelling character development to keep up the interest. Acting was terrible. Couldn't really see what was going on. It was so monotonous that me and my partner nodded off part the way through. Worst of all, no pay-off for the time invested. After persevering through all the lesser fights, the movie ended abruptly on a ridiculous cliff-hanger.","user":"te55erae","rank":[11,12]},{"title":"Drags on and on.","rating":2,"date":"14 July 2018","review":"There's little to recommend in this dull and boring movie. It's the future and people with powers are being rounded up and made to fight to the death. Seen that story a few times, huh. But those films were no where near as dreary, and mind numbing, as this version. It was a struggle to sit through it. I saw it in a group and there was complaining, about the script, the acting, the melodrama, just about everything on the screen in fact. It's tiring to have to remember how dull it was. It was putting people to sleep. You'd be better off watching The Running Man. That's a more entertaining movie.","user":"gedanielson","rank":[29,37]}]