[{"title":"Hard working students failed by filmmakers","rating":4,"date":"9 March 2017","review":"David Byrne's idea of mixing high school color guards (which do a lot more than wave flags these days) and contemporary musicians for a large concert has the potential to be a unique entertaining experience. But you don't get anywhere the full experience the way this film is shot and edited. One would expect that the performances would be the focus of the film, generally shown from a wide angle so the choreography of the entire team is featured. But these filmmakers don't seem very interested in that, they much prefer close-ups, and often of the singers, ignoring the performance team. During the performances they also cut in many backstage and preparation shots, with the music of the performance playing, as if to highlight the fact that you aren't seeing the what seemed to be the central point of the film. And plenty of shots of the audience, even some of the filming crew. For some of the groups less than a quarter of the performance is on-screen. There is more of the same between the groups and that is fine to add a feel for the event. Some of it is live interviews shown at the arena while the following group set up. Even during the finale when all 10 groups come on stage and do a short coordinated routine, the main shot is a close- up of David Byrne jumping up and down. Never do we see the panorama of all 10 groups in synchronization. This film can give you some feel of what the event was like. But if you want to see the actual performances as the audience did, particularly if you have some connection to one of the teams, this film won't do it. Maybe the DVD will have bonus sections of the actual performances.","user":"lenab-30920","rank":[7,11]},{"title":"just your standard concert movie with a whole lot of color.","rating":7,"date":"17 March 2017","review":"I somehow stumbled upon this movie and it looked very well whats the word: interesting. Contemporary Color just looked like another concert movie wannabe but they just add color guards and singers that no one have ever heard of (minus Nelly Furtado) and you have a movie that tried to be a documentary but in the end, turned out to be just one colorful mess. i mean, don't get me wrong. there were some postives to this film. 1) the color guards were very good. 2) the singers had good songs. 3) the fact it took place in NY was good too. what i also didn't get was that they event took place in 2015 so maybe 2016 would have been a good release year besides 2017. but ethier way, i was very happy with the whole vibe of the movie and i would see this movie again for sure.","user":"itsactuallyamanda","rank":[1,5]}]