[{"title":"Decent B Movie but far from the original Hard Target","rating":26,"date":"26 August 2016","review":"HARD TARGET was a Van Damme vehicle directed by the legendary John Woo. <br><br>This one is no related with the original but keep most of its structure; two bad guys a group of cruel hunters (the baddest of all very well played by Rhona Mitra) and a prey that does not like to be hunted. There are some variations on the beginning, the end, and the locations (here Myammar and Thailand jungle); but the core is humans hunting humans like in the Most Dangerous Game.<br><br>There are also a few moments with doves and a very recognizable gun; so I am assuming Roel Reiné is paying tribute to the original movie. <br><br>The problem is he is not Woo and you can easily notice. Some scenes are not well choreographed and the script could have benefited from better dialog, less clichés.<br><br>Production values are low but effective and the acting is mostly good; specially Robert Knepper <br><br>Scott Adkins is not as charismatic as Van Damme but his fighting skills are very good and keep the movie interesting.<br><br>The end could have been far better; but it was basically what you expected.<br><br>In brief; a good way to spend a couple of hours, if you prefer real live actions than digital unrealistic.","user":"abisio","rank":[17,22]},{"title":"pretty generic...but","rating":29,"date":"29 August 2016","review":"i didn't expect much from this one. and to be fair all i wanted to see at that moment, was a decent action flick. and surprisingly enough - i got it!<br><br>plot is predictable. i mean really. they did put some effort into developing main protagonist and it works, a bit. the acting is fairly average. but since this is an action film, let's get to action.<br><br>fight choreography is good, and one particular kill will catch you off guard(believe me i've seen it). since Adkins isn't playing Boyka, his technique is different, more simplified, but efficient enough.<br><br>there is a nice nod to the original HT and you will easily recognize it.<br><br>as for the supporting cast Rhona is playing a really stereotypical character, which was my main problem throughout the film. i mean she really can do better than that. Robert Kneppers main villain was decent enough to listen to his dialogue.<br><br>and for the last when you'll watch it make sure to know that some sequences take place simultaneously at different spots, so you won't feel lost in the pacing<br><br>overall i would give it 6.5/10 if you have enough time, watch it...","user":"baqari-com","rank":[19,26]},{"title":"Recycled story that still entertains","rating":31,"date":"31 August 2016","review":"My quick rating - 5,3/10. The same basic formula as \"Hard Target\" and the superior \"Surviving the Game\" of take a person (Scott Adkins) and hunt him down for sport. This movie tends to lead into ridiculous category a few times but still delivers some quality action scenes which mostly are martial arts related. If you like those types of movies, you will like this. Scott Adkins plays a pro fighter who accidentally kills his best friend in the ring and ends up down and out due to depression. He takes on one last fight for money, but it ends up being him fighting for his life against a bunch of rich people who hunt him for sport. Very cliché from start to finish so you can fill in all the plot points in your head now. Entertaining it is. I would say Adkins is slowly solidifying his role is the times new action hero. I, for one, prefer that as opposed to all the really bad Seagal movies going straight to video these days.","user":"jackmeat","rank":[13,17]}]