[{"title":"The Men Behind the Monsters","rating":8,"date":"16 July 2016","review":"In Isaac Asimov's robot novels, Frankenstein complex is a term that he coined for the fear of mechanical men. In \"Creature Designers: The Frankenstein Complex\", we are put face to face with the very men (and one woman) who are responsible for creating these monsters that cause us both fear and awe.<br><br>This is actually the second time out exploring these themes. Co-director Gilles Penso also directed \"Ray Harryhausen: Special Effects Titan\", one of the all-time greatest documentaries on the behind-the-scenes of film. And co-director Alexandre Poncet had served as producer and composer on that project. That particular documentary was floating around Netflix for a while and is now available from Arrow Video on blu-ray. To say it is worth seeing would be an understatement.<br><br>In \"Creature Designers\", we find a very appropriate sequel. All the effects people interviewed for this documentary are picking up where Harryhausen left off. Not one of them would dare say that Harryhausen wasn't an influence on their own lives and career paths. Of course, the name is invoked a few times – it would be simply unavoidable to leave him out of the story.<br><br>To say \"Creature Designers\" has a plot might be a stretch, but it does tend to focus on a few themes and generally moves from earlier films to more contemporary examples. We watch the evolution of makeup from the days of Jack Pierce and the original Universal monsters up through the work of Rick Baker, possibly the most celebrated makeup man in the business. We see the rise of animatronics, with such innovators as Chris Walas (GREMLINS), who were literally inventing new techniques each day they went to work.<br><br>The real heart of the film comes in the second half (or maybe final third), when the inevitable happens: CGI enters the world of fantastic film, and the practical effects masters are left to question their existence. As the film puts it, they are no longer seen as the \"rock stars\" they were in the 1980s and early 1990s. This shift is especially hard on Phil Tippett (STAR WARS), who enters a depression when he finds that the demand for stop-motion is drying up.<br><br>In \"Creature Designers\", the practical effects masters are the heroes (as they should be), and we see the world of practical effects push back on the digital boom. Which raises the big question: what is the right amount of each method? Some effects look better practical, some can only work digital. Part of the job is knowing which tool to use as we have seen, there are many films that default to CGI when it is obvious they have neither the time nor the budget to make it work. More surprising for viewers might be learning how many effects they assumed were CGI are actually practical: much of the T-1000 in \"Terminator 2\" was makeup and sculpture, and Guillermo del Toro continues to use practical effects in \"Pacific Rim\" and \"Crimson Peak\", even if we think it is \"obviously\" computer animation (it's not).<br><br>If the film had any major shortcoming, it was the lack of Rob Bottin, who is arguably the greatest effects artist of his generation. Bottin's name came up time and again, and his work was showcased (as noted, no one to this day has surpassed \"The Thing\" for special effects). But the man himself was nowhere to be found. On the bright side, this allowed more screen time for Steve Johnson as his stand in, who was by far the most entertaining of the interviewees. If outtakes end up on the DVD, hopefully there is more of Johnson's manic ravings.<br><br>\"Creature Designers: The Frankenstein Complex\" premiered at Fantasia on July 15. If you have the chance to catch it at an encore screening or when it hits home video, it comes highly recommended. With any luck, the director will go for a trilogy and attempt to track down Rob Bottin, telling of his rise, fall and decision go become a recluse.","user":"gavin6942","rank":[4,4]}]