[{"title":"It's a comedy sci-fi horror spoof staged in the 80's","rating":7,"date":"4 April 2016","review":"The official summary does not list this movie as a comedy sci-fi horror spoof, but that's what it is. At first i did not like the movie because it was not listed as a comedy, but if you keep watching it was always meant to be a comedy spoof. Once you realize that, it is pretty cool.<br><br>This would have made a great drive in movie back in the old days. Today it is on par with the \"Saturday Night Live\" shows of the 80's. Think of the old Julia Childs'cooking spoofs that SNL did.<br><br>The tongue in cheek humor and special effects will appeal to the 8 year old boy in all of us who have ever made a home movie. In fact the effects are a big part of what makes this movie endearing.","user":"sergeivolkov","rank":[14,23]},{"title":"Nobody touch the Congressman","rating":1,"date":"5 August 2017","review":"If you miss bad cheesy sci-fi horror, fear not, it has returned. Scientist are working on a mold defoliating agent that will wipe out an ecosystem. About half way through we discover it is alien... as if we couldn't read and understand the title. The characters were weak stereo-types and much of the film was like the cover with rubber body parts oozing with green, red, or white substances. The special effects are as cheesy as the cover. Not worth watching unless you are really into so bad it is bad film. The entire film takes place inside the facility.<br><br>Guide: F-words. No sex or nudity. Ardis Campbell bra and panties.","user":"nogodnomasters","rank":[5,8]},{"title":"This is splatter!","rating":4,"date":"6 January 2020","review":"Well, what to say about this?<br><br>To give this a review I first have to set the frame for the review. You can't compare this to \"ordinary\" movies. This is a splatter-comedy spoof-sorta-thing which gives plenty of nods to others before it and it's very low budget of course.\nI do appreciate what they did with their budget though, especially the SFX-team.<br><br>If you like Braindead, Street Trash, Bad Taste, Death Warmed Up, Troma films and.... well you see where I'm going with this, you probably should check this out.<br><br>The main keeping of this film is the effects themselves. It contains everything you could wish for. Mildew turning people to zombies (kind of), exploding body parts, colourful ooze, melting skin, gushing blood and whatnot. There is really no consistency in what the aforementioned mildew can do.<br><br>The dialog is just all over the place with the colonel delivering some relly cliché lines from start to finish. Acting is so so and the actions of the characters, considering what happens in the lab, are just completely out the window.<br><br>You really have to take this film for what it is. It's a splatter roller coaster comedy.<br><br>I give it a 4 because at least it was entertaining in it's own hilarious way.","user":"teslaman","rank":[1,1]}]