[{"title":"Absolutely Fabulous","rating":10,"date":"27 December 2015","review":"This production went out live on a giant stage in London. It was not simply great, it was magnificent. Incredible production values and a wonderful cast. It follows the original stage show (almost) which means that the two deleted numbers from the film version are restored but \"something good\" written for the film is added. The original sequence of songs and orchestrations are there as well.<br><br>I will not single out any of the cast as this would be unfair, they all perform to perfection and never once do you yearn for Julie Andrews or Christopher Plummer. There are no silly English accents with a German/Austrian twang.<br><br>The kids are good too, again I single out no one.<br><br>I think that an audience might have helped but this would not be possible, technically given the size of the sets. And if you want to see how it was done, there is a documentary \"The making of ....\".<br><br>I presume that this will be available on DVD if you didn't record it live. Go out and buy it - and play it over and over again. Well done ITV.","user":"david_kravitz","rank":[17,24]},{"title":"A worthy try.","rating":7,"date":"13 November 2018","review":"This was a good try, and I enjoyed it. However, in the long run, it only served to illustrate how brilliant the movie was. My main gripe with this production was how it cut out all of my favorite scenes. Sitting on the Pinecone? Children in the trees? Edelweiss with the Captain and the Children? The Puppet show? The confrontation between the Baroness and Maria? I understand that some things had to be cut due to time, but still it's a shame. Of course they could not do the Do Re Mi travelogue. I don't fault them for that. I appreciate how they included the witty and catchy \"How Can Love Survive\", but was sad to lose \"I Have Confidence.\" The mother Superior's rendition of \"Climb every Mountain\" was weak. Peggy Wood's was so incredibly moving. Yes, I know it was dubbed by someone else. I kept listening and looking for the lines, the expressions, the little touches that I remember with such fondness. All gone. I thought the casting was fine. Both leads had great voices, and the acting was good, although it was missing a lot of the humor that made the movie so charming. Two changes I did like, was that Rolf did not blow his whistle and let the Von Trapps escape when he saw Liesl. Another change was that Max was arrested at the end. The supreme irony considering his go along to get along attitude throughout.","user":"rebekahrox","rank":[6,7]},{"title":"Excellent Live Recording of a Classic Musical","rating":8,"date":"18 January 2016","review":"THE SOUND OF MUSIC - LIVE! is a comparative rarity on television these days - a revival recorded in an East London studio but broadcast as live, as if performed in a theater. It recalled those halcyon days in the Seventies and Eighties when both ITV and the BBC videotaped productions originally designed for the West End, Stratford-on-Avon and the Chichester Festival Theatre.<br><br>Coky Giedroyc and Richard Valentine's production was a straightforward one, emphasizing the choreography but using the camera to tell the story, as if it were an actor on the stage. Hence this was not a \"flat\" filming, with the camera confined by the proscenium, but a three-dimensional filming, making use of plenty of close-ups and panning shots. It used televisual techniques to emphasize the emotion of the piece on several occasions.<br><br>Although well-known to most viewers, both in its stage and film versions, THE SOUND OF MUSIC still has the capacity to stir the emotions. This is chiefly due to a strong book by Howard Lindsay and Russel Crouse, which does not shy away from the sinister political overtones of the story. The songs might be saccharine in places, but the plot certainly isn't. <br><br>Giedroyc and Valentine's production brought out the gradual change of character wrought in Captain Georg von Trapp (Julian Ovenden), as he discovered the effect that Maria had on his children. His pliability contrasted with Maria (Kara Tointon), a strong-willed personality who knew that what she was doing was right, even if Von Trapp disagreed with it. Set against this couple was the oleaginous Max (Alexander Armstrong) a slimy character if ever there was one, who willingly accepted the dictates of Nazism without understanding their basically evil purposes.<br><br>The singing was, on the whole, extremely good, while the orchestrations (by Michael England) were both lush yet melodic. Critics described THE SOUND OF MUSIC - LIVE! as an example of \"event\" television, designed to lure jaded viewers away from online service providers and back to terrestrial channels. If this was the purpose, then I can only say that it was admirably fulfilled. I sincerely hope that ITV repeats the experiment.","user":"l_rawjalaurence","rank":[9,13]}]