[{"title":"Great addition to the series","rating":10,"date":"29 July 2019","review":"The series ended with the girls ensuring that Ooarai Girls' Academy would go on, after winning the championship. Turns out the principal's promise was only verbal and not exactly binding. Therefore the girls face the possibility of the school being closed down again and this time they will be challenged by a college-level team. Will yesterday's opponents become today's allies?<br><br>It's a delightful movie, much like the series. Great animation, a fun dynamic script and the characters we love. Anyone who has not watched Girls und Panzer will have a slight problem understanding the individual plots, at first, but it doesn't take away from the overall enjoyment. On the contrary: people will surely look for the episodes, after the movie. Enjoy!","user":"bernardoarquivo","rank":[7,8]},{"title":"Excellent follow-up to the series","rating":8,"date":"31 January 2020","review":"Reference the series for good reviews of the movie; they're pretty much identical. The movie is not chunks of the series patched together, but rather a brand new plot... if the same plot can be considered new. It's still high school girls in heavy-competition tank battles, played to the gills for humor. Better than might be expected at first glance. Once one gets the idea that this is intentionally ridiculous it's a fun ride.<br><br>It's good to see the 12-episode series first, but it isn't essential to enjoying the movie. The series will fill in the concept of \"Tankery\" and why it exists. The movie hits the ground running and takes it for granted the audience will follow along. That's not hard to do in this romp.<br><br>I understand there are different tastes, but anyone giving this a low review just. doesn't. get. it. This film is a lot of absurd fun.","user":"Snootz","rank":[0,0]},{"title":"the worse animation movie","rating":1,"date":"22 July 2019","review":"This one is really, very BAD. The story is for the birds and it actually hurts to watch.","user":"ferdmalenfant","rank":[0,11]}]