[{"title":"Not a bad effort","rating":7,"date":"12 October 2018","review":"As far as low budget British films go, this is a good one. It's very bloody and full of sex so if that's your kind of thing you will enjoy it. Had some decent actors in it, young and old as well as a few recognisable faces from the British soaps. It's not too long and keeps you interested long enough to enjoy it.","user":"elliotjeory","rank":[7,7]},{"title":"Should have been good","rating":4,"date":"16 November 2018","review":"Very strange and disturbing film.Basically it is about a young man who is slightly off the rails.He meets a girl at the job centre and she ends up staying with him.She introduces him to her uncle who runs a massage club , where sex is available.\nHe stumbles across disturbing evidence of murder .Then he is invited to see what this is all about, and join \"their family\" .And basically this is the whole lot of them killing punters and eating them RAW ,covering themselves in blood and having orgies. Not alot else to add.","user":"jennifercfisher-36024","rank":[3,3]},{"title":"Exploring a bad habit.... well it should have done","rating":6,"date":"18 May 2018","review":"Its a game of three thirds well a film of three Thirds anyway. <br><br>I watched this as I from Manchester and the film is set in Manchester so it peaked my interest. Firstly it has a Film Noir kind of vibe about it but to be fair that is kind of what Manchester is like, its a bit rainy and dark and grey and full of old buildings and at night the neon shines brightly against low lit streets. <br><br>The film captures this really well so credit to the makers for that. I can't really fault anything in terms of its production etc. The acting was sound nothing outstanding, pretty solid but at times hammy. <br><br>The lighting and cinematography was again well done but nothing spectacular, Sound was again good. So overall a solid production. <br><br>The film is kind of spread over 3 thirds and I don't want to give away spoilers so will keep things as spoiler free as possible. <br><br>The first third ( we will call it the start ) serves as an introduction to the 2 main leads a young man and a girl. I found problems with this as the friendship progresses way to quickly. For me it needed more time to develop before moving to the next stage. Also the first third needed a catalyst or a mysterious element to keep you wondering where it was heading. Nothing major just something to peak the interest a little. Also one scene where a drunken fat lad shout aright darling and grabs a girl and instantly pulls her rather than get a stiletto to the head was really dumb and stupid ( I know Manchester i've seen Stilettoes to the head for much less \" The good thing about the first third was that it set the tone and had some great outdoor shots of the streets of Manchester and just about ( only just ) keeps you interested for the second third ( lets call it the middle ) <br><br>The second Third is when things really start to kick in, while the start was a bit slow and off pace the middle shows us where the film is heading. Now this is where they could have really gone balls to the wall and ramped it up a notch, which they did try to do but I mean come on. Get that music ramped up, add more cuts mess with the lighting etc. Get people out of their comfort zone and push it all a bit harder. The semi erotic scenes they tried to enact didn't really work as intended and I think a lot of that was just simply down to editing and lack of ambition. Still it wasn't bad just too understated. <br><br>On to the final third ( which I am going to call the Ending ) This is where there should have been the most tension and/or emotion etc. Unfortunately once again the pacing and editing were all wrong and it all just meandered along and lacked either emotion or tension. There could have however been something beautiful in there, a message, a revelation or just someone anyone giving us something to really think about. Instead it just passes by and easily forgotten. <br><br>This could have been an 8 or 9 out of 10 small budget British film with a bit more daring and ambition. <br><br>Instead we have decent start but which misses out the key elements to a start, a middle which was good but could have been brilliant and an ending that is average and misses out the key elements of an ending. <br><br>One scene really stood out that I liked and where we finally got a bit of a performance from the lead about an hour in down an ally. What we needed was more of that but in relation to the Habit !!<br><br>This was another problem, the film is called habit and uses a plot element to depict a habit yet this was poorly explored and hardly touched upon when it should have been the entire focus. The opportunity for a metaphoric meaning within this was sorely missed. <br><br>I give it a 6/10 as a lot of it is faultless apart from the way it all game together in the end. A wasted opportunity in my eyes but still worth a watch as it has many very good elements to it.","user":"eve_dolluk","rank":[12,18]}]