[{"title":"Trash","rating":1,"date":"15 December 2019","review":"This movie is terrible, unbelievable, poorly written, racist, garbage. The leed actor is out of breath in the opening scene from merely lifting a security gate. I thought he was going to drop dead. To old and washed up to be a believable tough guy.","user":"ramesesbrathwaite","rank":[2,2]},{"title":"Great movie. Terrible reallity about radicalism.","rating":10,"date":"31 August 2019","review":"Phenomenal performance of Tom Sizemore, the neurotic and experienced agent of the CIA. A movie that shows the harsh reality that new-left beauty people pretend not to see. Good immigrants having to deal with those terrorists, police violence, racism, myopia of liberals, radical islamism. Anyway, the film gives a complete angle of the whole thing.","user":"artedeagrado","rank":[2,2]},{"title":"A Very Powerful and Gripping Story!","rating":10,"date":"22 June 2019","review":"Great film about how young Muslims in the NYC area can be influenced by religious clerics to become Martyrs in the name of Islam. A very realistic plot and an even more believable performance by the actors. One of the many reasons I give it 10 stars.<br><br>In the beginning the film has a warm, comfortable look with some really good writing, interesting characters and a riveting storyline that picks you up and brings you into action. As the emotion changes, so does the look of the film.<br><br>We are introduced to Zahid Khoury (Alexander Mercier) an aspiring young graphics artist living in Queens. His father, Baba Khoury (played by Uziman), wishes his son shared his passion for family traditions and culture, such as running a family business, doing things in an old school fashion or putting the laptop away. Some of the best writing in the film are in the stories that his father tells to his son and to the audience. I believe much of this is based on the director's own life's experiences.<br><br>But Zahid soon challenges his own beliefs and becomes more religious, pushing his closest friends way, casting himself out into isolation.<br><br>The film is very intimate and is never pretentious in any way shape or form. The acting is sincere and very powerful. Great performances from Tom Seizure, Cory DuVal (Abbaz), Shiek Mahmud-Bey (Saif-Uddin Mohammed), Ari Barken (friend, 'Jason'), Michael Maugeri (Hasib) among many others.<br><br>After the events of September 11, 2001, much of the atmosphere or environment between the Muslim population and the rest of the country changed dramatically. This film unravels the tensions that still persist today between the two cultures that are a very big part of what makes of not only New York and it's 5 boroughs but the rest of the USA. One of the most memorable lines in the film to Zahid , \"Go west! Go to the other parts of the USA. You'll see how they hate you.\"<br><br>This is a very important film for today's younger generation to see. It is a very poignant reminder of what created those who attacked us on 911.","user":"shazzer-47880","rank":[13,29]}]