[{"title":"Unusually good for Lifetime","rating":7,"date":"4 September 2016","review":"The Lifetime \"world premiere\" movie last night was \"Backstabbed,\" which proved to be surprisingly good. It begins on a hilltop overlooking a gorgeous and pristine valley, where a woman is standing and talking on a cell phone to the owner of the land. She's a real estate agent who's promising the old woman that she'll only consider offers for the land that will essentially preserve its rural character. Then another person — whom we don't see except as an arm holding a baseball bat — comes up behind her and cracks her over the head with it as if swinging for the home-run fences. After that the movie cuts abruptly to a real estate seminar being attended by Shelby Wilson (Brittany Underwood), at which they're featuring guest lecturer Paulette Bolton (Josie Davis, top-billed), who comes across as a better-looking Donald Trump in drag and decides that, unlike the other students in the class, Shelby has the \"right stuff\" and offers her an internship with her one-woman real estate firm.<br><br>Of course, this being a Lifetime movie — frequent Christine Conradt collaborator Doug Campbell directed and, while la Conradt didn't write the script for this one, the people who did, Bryan Dick (who's worked on the Whittendale University universe movies for producer Ken Sanders, who's listed as a producer here as well) and Raul Inglis, followed her formula so well they might have called it \"The Perfect Realtor\" — Paulette Bolton isn't the shining real-estate star she's made herself out to be. Shelby Along the film's running time Shelby has to contend with gangsters after Paulette for money, unethical tricks Paulette wants her to pull to bid up the prices of properties, letches who want Paulette to pimp Shelby out to them before they'll invest in Paulette's deals, and a concerted attempt by Paulette to break up Shelby's marriage to her milquetoast husband Grant (Micah Alberti), figuring that with him out of the way that will make Shelby willing to whore herself to make deals. Oh, and is it really that much of a surprise that it turns out Paulette herself committed the murder we saw in the opening scene? \"Backstabbed\" is luridly melodramatic and some of the plot is awfully far-fetched, but within the limits of the overall Lifetime approach it's also a quite good thriller, with two well-etched and genuinely complex female leads. Though she sometimes comes a bit too close to \"The Devil Wears Prada,\" Josie Davis is excellent as the psycho realtor, managing to thread the needle so she seems crazy but not so crazy that anyone seeing her would immediately summon the boys in the white coats, and the writers and director Campbell ably portray her psychopathology as just the American desire for \"success\" taken to evil and utterly unscrupulous extremes. And though she doesn't get as much support from the writers as Davis does, Brittany Underwood does a superb job limning Shelby's ethical conflicts and showing the financial temptation that leads her to follow Paulette — until being pimped out to a not unattractive but still middle-aged guy becomes her final straw. \"Backstabbed\" isn't great cinema by any means, but it's the sort of reliable entertainment we come to Lifetime for, and done considerably better than the norm for this channel.","user":"mgconlan-1","rank":[10,11]},{"title":"Predictable, but Surprisingly Good Performances","rating":7,"date":"18 April 2017","review":"Backstabbed is your typical Lifetime movie fare lifted above the standards of the genre by an excellent performance from Josie Davis (who I didn't recognize right away as the middle sister from \"Charles in Charge\").<br><br>Don't get me wrong. Nothing in this movie is remotely realistic. This is a soapy drama set in the same universe as a mid-90s Rebecca de Mornay thriller. Davis, clearly in on the joke, plays her insane real estate agent character like a manic drag queen. The film is aware this situation is ridiculous and plays with that by making it as over the top as possible.<br><br>As a film, I'd give it a 5, mainly for the entertainment factor.<br><br>For a Lifetime movie, it deserves around an 7 or 8.<br><br>Final score: 6.","user":"los-chupacabras","rank":[1,1]},{"title":"The Steal of the Century","rating":5,"date":"19 November 2016","review":"***SPOILERS**** Rotten to the core and murderous as well real estate agent Paulette Bolton, Josie Davis, uses her both charms and talents to manipulate naive Shelby Wilson, Brittany Underwood,to get her hands on some property in Southern California that will end up making her millions in the real estate market. With all these millions flying around, in Paulette's head, she's too cheap or in the hole to pay mob-connected Walter, Brad Lee Wind, the 17 big ones-Grand-that he lent her in a failed real estate deal that went bust! It's Walter who's now facing the mob collector or leg and arm breakers if he doesn't come up with the cash! <br><br>It's Shelby's husband Grant, Micah Alberti, who smells a rat in all this and tries to keep her out of this deal but is compromised by the sneaky Paulette. It's when she gets this bimbo Amanda, Janna VanHeertum, to strike up a conversation with Grant at a local bar and get real friendly with him. It's there that Amanda spiked Grant's drink and after kidnapping the poor and confused guy has him photographed in the all together-or with only his shorts on- dead asleep and in bed with him nibbling on her body. There's also the over sexed and hot in the pants Max Rhymer, Kevin Spirtas,who's just dying to get into Shelby's panties. It's the millionaire Max who's also working with Paulette in her latest real estate scam-that will make the two over 50 million dollars-who ends up getting iced by her who had just about all, in his making a total jackass of himself, she could take from him.<br><br>****SPOILERS**** It seems that Paulette had developed a lesbian crush on Shelby and when she decided to walk out on her as well as the big money real estate deal Paulette just lost it. Having already murdered three people in the movie Paulette had no difficulty in trying to murder Shelby as well. This time around her plan fell flat on it's face by trying to get-with a gun pointed to her head-Shelby to overdose on a bottle of sleeping pills to make her murder look like a suicide. It was Shelby who by not swallowing all the pills that Paulette handed her and getting on her cell phone calling 911 that ended up not only saving her life but getting the local police to come to her rescue and put the cuffs on the by now out of her freakin! skull Paulette.","user":"kapelusznik18","rank":[1,1]}]