[{"title":"Indecent Proposal revisited.","rating":6,"date":"2 June 2018","review":"It's an average movie that deals with an important issue of today's relationships. Unfortunately, names like Gershon, Sudeikis and Hall are not enough to make it a great movie and it's more like a drama than a comedy. There are many awkward scenes and dialogues but overall it's watchable. It reminded me of the much better \"Indecent Proposal\" from the nineties and the struggle between true love and just an affair with a random stranger. \"Don't lose a diamond while chasing glitter\" is now more actual than ever and I wonder why would someone break something that works so well only for satisfying a curiosity for an one night stand. Indeed, the two main characters lie each other with \"I love you\" while each of them has an affair and feels guilty inside. That's not how true love works and eventually they break up at the end.","user":"empire331","rank":[16,19]},{"title":"Permission","rating":2,"date":"11 February 2019","review":"A film that is driven by a controversial premise, but the execution feels childish and amateur. It goes about the motion but does not provide a good enough plot to really examine the concept of monogamy. The emotions displayed by every single character feels off and superficial which creates a disconnect with the audience. The film provides an one dimensional, pessimistic look at relationships, but is not controversial enough to capture and enlighten viewers.","user":"jackson_ro","rank":[5,5]},{"title":"Asking For Permission? No! Asking For Trouble.","rating":5,"date":"13 April 2018","review":"Well, of course this film was released in time for Valentines Day, but, if you're going to be ripping peoples hearts out for fun, maybe it should've been pushed to October.<br><br>Dane, is the only character in this movie who got COMPLETELY screwed over, more than anyone else, and yet, the person who set the wheels in motion towards his agony, anguish and destruction, gets to be the one who gets her happy ending, while it doesn't even ever get addressed of how, evil her actions were.<br><br>And also, I never really got the memo on the fact that, growing up is about fetching trouble, and allowing it to cause the inevitable harm it was always going to.<br><br>I have very little, to almost zero sympathy for Will, however, Anna is an unmistakable manipulator and villain. There is nothing right about her actions. She always projected her feeling, anxieties and desires on Will, which made it seem like all they did, was either his idea, or theirs, when it was always hers. She uses Dane, then condemns him to a state of emotional uncertainty and purgatory hell because of her malicious actions and failings. She then has intercourse with a complete stranger, who is also married, and once again, projects her TOTAL BS on him, when the problem is her. And then to top it off, after breaking Dane, she goes and shatters Will, in true Anna fashion.<br><br>I really like Rebecca Hall, however this role was a terrible choice, and her producing this film made it even worse. The subject matter of this film is nonsense, which is sad because the fact is, it is a true reflection of love today, however, the film felt rushed towards the end, and the execution wasn't necessarily the best. Permission tried to create scenarios where nobody was at fault; Anna, Will, Hale and Reece, but failed, miserably.<br><br>The after taste of Permission makes it feel like it deserves less than a 5/10, it really, really does, especially because it arrogantly perpetuates a life style contained in this vicious cycle most can't seem to escape, however, while watching it, I never really felt it deserved less, so, 5/10 it is.","user":"FallenEye","rank":[26,36]}]