[{"title":"Looking for good Horror? Then skip this puppy.","rating":1,"date":"8 August 2016","review":"First, despite the title this film has nothing to do with anything remotely Amityville. The effects were so poor. Come on folks, CG software is cheap and there are plenty of out of work effects people that could have done better with freeware. Of course there is always the story line. Except in this movie. Did these people make this up on the fly? So with no effects, no story line and no script how could you expect anything more? THere is always a place for mindless sex and violence on the screen, but here you won't find mindless, just useless. I must admit I am something of an Amityville Horror snob. I owned my first home in Nassau SHores only 1 mile from the actual Amityville Horror house. Yup, there really is a house that the first movie was based on. It was on a side street and the traffic got so bad the town of Amityville had to post no parking signs for a couple of blocks and post cops to keep the traffic moving. Well, the house in this movie was probably owed by the producer and he got a write off to use it for the film. I think that's the best thing that could have ever come form this piece of trash. To sum it all up.... don't waste your time on this treasure.","user":"johnzappulla","rank":[19,28]},{"title":"Don't bother!","rating":2,"date":"14 August 2016","review":"I checked spoiler, just to be on the safe side, but not sure if this will contain one or not, but I have to definitely agree with John Zappulla's review!!! OMG!! WTH???? This movie had nothing at all to do with Amitty!!! At least all the other ones they made had the original story line SOMEWHERE in the movie, be it someone mentioning the houses history, etc...but this movie has a new story line, no mention at all about the original, they even had the gull to make a new original and wow.....very very disappointing, not to mention, changing the entire original, making it up, that was bad on its own, but the actors/actresses were ........well, they seemed like they were making up lines or reading them from far away!!! It was awful, it was an insult to the original and all the sequels. Do yourself a favor and skip this movie all together, please!!!!! It wasn't even scary....me being the optimist I am, I tried to finish it thru all the way to the end, but....wow!! I am a huge movie buff and love my horror movies, but even kids would laugh at this one!!! LOL...If u do watch this, just for giggles....because that's what you will get, make sure to remember, you have been warned!! LOL","user":"sweetness-83091","rank":[9,12]},{"title":"Couldn't be any worst!","rating":1,"date":"9 August 2016","review":"I am a big fan of the previous Amityville movies, and I suppose this lame (straight to) DVD (?) production was targeting fans like me. This movie has some of the worst sfx I have ever seen. It is the kind of sfx quality a 16 year old produces on a PC for a you tube videos. Scenario ? Basic stuff, written by someone who obviously has no idea how teens talk nowadays, and had no intention of actually trying to write something even remotely interesting. I have seen many movies trying to cash in on popular franchises over the years, and this is one such movie. Do not even try watching it on DVD ...huge waste of time and money!","user":"d-koskinas-359-596062","rank":[12,19]}]