[{"title":"I am agnostic and this nearly made me have a come to Jesus moment","rating":10,"date":"3 July 2018","review":"I do not believe in the bible or organized religion. I watched this movie because I love period movies and Joaquin Phoenix. It was so subtle. It did not beat you over the head with blood and pain like Passion of the Christ did. It showed Jesus conflicted, sad, angry, and scared. He somberly walked to his final days. He accepted a woman despite protests. Though the dialogue was sparse, I felt it more profoundly than any church sermon I have ever sat through. I was moved to sobs several times, especially in today's political climate. The acting was perfect, the scenery breath taking and it was beautifully quiet movie, definitely worth the watch.","user":"aerystablue","rank":[209,264]},{"title":"Change yourself, and the world changes","rating":10,"date":"30 April 2018","review":"Every scene in the movie, is seen through the perspective of Mary Magdalene. The ones who missed that, probably saw another film. Great casting and Ronney Mara´s best acting yet. Superb music, that made two hours seem like one. Amazing direction, which even surpasses that of \"Lion\" (2016). For the first time ever (for me at least), the audience did not leave the cinema until the end of the credits. I cried for nearly 120 minutes. There were different reasons for that: joy, sadness, inspiration, understanding and so forth. \"Mary Magdalene\" (2018) is truly a masterpiece and I can not recall, when something touched me in such a profound way.","user":"ThreeMoons","rank":[93,123]},{"title":"It is Our Responsibility to Save the World","rating":8,"date":"29 July 2018","review":"Great acting, great perspective, great story.<br><br>It is strange that this idea could put a bad taste into someones mouth- that it is OUR responsibility to save the world - pretty much the opposite message of \"sola fide\" - the doctrine introduced by the Lutheran church that it is only through faith in the divinity of Jesus alone and not through works we achieve \"salvation\". Centuries of self-identified \"Christians\" with no real love of peace, truth or compassion at the helm of the West and look where it has gotten us... millions of Christians await Christ's return yet make no serious effort to live by Christ's teachings. That is the sore thumb and the tragedy of many of the efforts of modern evangelists<br><br>Ironically, a movie that is supposed to be about Mary Magdalene is the best cinematic telling of the Jesus story that I have seen - it takes care to communicate understandably how Jesus's real teachings could become skewed by disciples who had their own ideas about the way they thought things should be, or would prefer them to be. They helped create in their folly a system of belief which removes personal responsibility and promotes complacent self righteousness in apathy which seems so common today. <br><br>The message of personal responsibility is so crucial in these times when it feels like the world is speeding ever so quickly towards irreversible change - where that change is directed is up to us and if we are all sitting on our thumbs we may neglect our own responsibility and contributions in the matter. That someone could be made angry or put off by this idea seems incomprehensible to me","user":"joythirstpop","rank":[77,103]}]