[{"title":"Inoperable is unwatchable","rating":3,"date":"17 April 2018","review":"This is like a very very bad version of Groundhog Day.<br><br>Like a very very bad acid trip.<br><br>Like a bad bad bad hangover and like a very bad dream which you can't awake from.<br><br>First we have a 30 something year old made to look like an early 20's teen.<br><br>Then there is a beat-up hospital with almost no staff around - but when trying to escape, they just seem to be at every turn.<br><br>Then there's a hurricane thing which begins to complicate things even more...and then it just gets boring and stupid - or stupid and boring...whichever comes first.<br><br>Ahh, well - it was a free watch, so I didn't worry about the cost - and I had a day off...but I know there could have been better time spent doing nothing.","user":"casablancavic","rank":[27,35]},{"title":"You need to get back in your room.","rating":5,"date":"9 February 2018","review":"Amy Barret (Danielle Harris) wakes up, living a \"Ground Hog's Day\" episode in the hospital from hell. She allies with two people who find themselves fighting for their life against the staff. They conjecture that Cat 5 Hurricane Sybil which hit Fort Miller caused a disruption in the time line. It was interesting at first then went on to become boring and then the ending ruined everything turning this into a been there, done that type of film. <br><br>Had potential. Needed some light moments. <br><br>Guide: No swearing, sex, or nudity. Some blood and gore.","user":"nogodnomasters","rank":[15,19]},{"title":"Eh, it's not the best nor worst","rating":4,"date":"28 February 2019","review":"On the plus side, the concept behind the story is interesting, it's beautifully shot, the location works well. I found the actors to be competent, if a little green.\nTo it's detriment, the story needs some work, nothing in this really wowed me.\nIt's an ok watch once time killer. For an indie thriller, you could certainly do worse.","user":"jen_yoder","rank":[2,2]}]