[{"title":"The end of the story does not disappoint","rating":8,"date":"5 February 2017","review":"To me the fifth and final chapter of Mythica was the best. It didn't need the comic relief bits, the sideline stories were kept to a minimum and the actors and probably the whole production team have reached their maturity and made a decent film throughout. Considering this is a five movie Kickstarter series, it is nothing less than amazing.<br><br>This doesn't mean Godslayer is a perfect film, but it was the perfect ending for the series. All the characters came together in an epic finale that left everything explained and brought closure to every hero's journey. <br><br>To me, the worst part of the series was the villain, who had everything: power, a good actor to portray him, armies of undead, but lacked the one thing that would have made him interesting: a story. I feel Mythica would have been a lot better with a villain one can empathise with. This became clear near the end of the final film when there was a sort of seductive quality in his attempts to corrupt Marek. With a fully grown character, this could have worked wonders, not only at the end, but throughout the series.<br><br>Bottom line: it is a fantasy story very reminiscent of Lord of the Rings. There is a hero that has to choose the fate of the world and resist temptation from a magical yet evil artifact, while her friends must lend their support and strength to keep said hero on the right path. While not the very best of film making, it was entertaining and refreshing and I am glad to have seen it all. I can't wait for more stuff to come from Arrowstorm Entertainment.","user":"siderite","rank":[21,23]},{"title":"A satisfying swords-and-sorcery fantasy flick for a rainy night","rating":7,"date":"28 April 2018","review":"It's not high art, but in my opinion this pentology is a worthy effort and well worth watching. It starts off slow with part 1 (A Quest for Heroes) featuring a slave girl (Melanie Stone) gradually coming into her power as a necromancer, or sorceress wielding dark magic. <br><br>Although the first movie has a satisfying ending, you may still thirst for more adventures in the Mythica universe. Fortunately, there are four more, queued up and ready to roll!<br><br>The movies gather steam, and darkness, culminating in The Godslayer, the high-stakes finale of the series. There is enough magic, and swords, and evil sorcerers, and good sorceresses, and even a couple of gods, to satisfy everyone.<br><br>Some people call it some kind of B-grade kickstarter movie, but in my opinion it's a captivating and charming series, B or C or whatever. The actors are sincere and skillful, the writing moves the story along, and the special effects (where they even exist) are minimalist but effective.<br><br>Now I wonder if there will ever be a sequel, but really, five movies is plenty, and in 2-3 years I will definitely be watching this one again!","user":"blisterpeanuts","rank":[8,8]},{"title":"Mythica The Godslayer: The best saved till last","rating":7,"date":"11 October 2017","review":"I like the Mythica series, even though they arguably aren't anything really special and are ultimately flawed they still deliver a wondrous charm and much needed dose of fantasy cinema.<br><br>This fifth and final movie culminates the long running story with every major cast member there for the final battle to save the world from the power hungry necromancer.<br><br>I believe here they saved the best till last, the finale is beautifully fitting and ends the franchise on a high note.<br><br>I very much hope the cast and creators go on to do bigger things as they have proved here they have the ability to deliver.<br><br>In an industry with such a drought within the fantasy genre Mythica movies are a breath of fresh air and to see a franchise deliver five movies, complete with the same cast and able to play out a story to the end is a true accomplishment and I tip my hat.<br><br>Mythica you shall be missed, hopefully your legacy will open doors.<br><br>The Good:<br><br>The cast are amazing as always<br><br>Fantastic Mythica charm<br><br>The movies have built up to a brilliant fitting finale<br><br>The Bad:<br><br>Still flawed in places<br><br>Hodor, Hodor, Hodor<br><br>Kevin Sorbo, I'm sorry but this guy just sucks on so many levels","user":"Platypuschow","rank":[8,9]}]