[{"title":"For what you expect, interesting film","rating":5,"date":"11 April 2017","review":"I came into watching this movie with no expectations and this made it a better film. It has a unique plot and although the acting may be sub par, it is filled with a lot of funny one liners. Overall, i would recommend as long as you're watching it for entertainment and not in a critical way.","user":"nboyle11","rank":[7,8]},{"title":"Thanks to Asylum ,the drive-in movie is still alive","rating":3,"date":"12 March 2016","review":"Folks that are fans of Asylum movies will not be let down by this zombie/action movie,as it is fairly standard Asylum type movie.I myself do like the stuff coming out of the company,and have for years.Plenty of c.g.i. monkeys ,blood ,and other effects,and some decent effects,and make-up.The gorilla ,Kifa ,i think, was an actor ,and was cool enuf,and not c.g.i. .the actors,some regulars for Asylum ,did a good job,and there were some hot chicks in there.I wish these films had more eye candy,like some bare breasts,but this is not for everyone,and most of these films are for t.v. ,so ,it is what it is.For the most part,this was a cool way to kill some spare time on my week-end ,and knock off a six pack.Great for a one time watch.Back in the 80,s ,there was a movie from Italy that had some rampaging ,pcp influenced animals that wiped out a bunch of people ,and this shoddy gem reminded me of that movie.glad that Asylum is still pumping these out.","user":"dadatuuexx","rank":[22,32]},{"title":"Fast Wasps","rating":4,"date":"26 April 2016","review":"There is a temptation to compare this to Sharknado in the whole 'so lame that it is cool' category of terrible movies. The problem is that while Sharknado utilises a stupid concept to make a movie that is pure trash but also pure awesome, Zoombies is mostly the trash part with very little awesome.<br><br>There are clear comparisons to Jurassic World, but where that movie's shaky plot is made up for by big budget effects, cool set pieces and Chris Pratt, this movie has none of these, so it is just mostly rubbish.<br><br>Sure there are some laughs at seeing actors pretend they are sitting on elephants and hanging from a rope (seriously how hard is it to actually shoot actors hanging from a rope - just put them on a rope a couple of feet above the ground), but overall it is far more cringe than amusement. Possibly good for a laugh if you are tired of all the other 'so lame it's cool' movies out there, but really this one is the pits.","user":"scythertitus","rank":[11,15]}]