[{"title":"OK-ish","rating":7,"date":"23 February 2018","review":"This is perhaps not a 1982 Blade Runner or Brazil, but it is not too bad either. Lately the American movies are getting stupider by the day, especially the SF ones which are just buckets of PC, and the Chinese market tries and succeeds in dethroning Hollywood from the pedestal. What goes up will go down. I suspect that in few years we'll see really good SF Far East movies. We'll just have to adapt to a different language. The movie keeps up your attention and for that, it's great.","user":"mrpatras","rank":[15,18]},{"title":"Profound Chinese science-fiction movie filled with action and emotions","rating":8,"date":"29 March 2018","review":"Reset is an emotional, entertaining and stylish Chinese science-fiction thriller that is much better than its reputation. The movie tells the story of single mother and scientist Xia Tian who is working on wormhole technology to allow people to travel back in time. One day, her son gets kidnapped and Xia Tian is forced to steal the scientific results from her facility within one hour to save his life. The challenge ends in a disaster with her colleagues getting killed, her facility getting exploded and her son getting killed. As last resort, Xia Tian decides to become the first human being to travel back in time to get a second chance to save her child. However, she soon realizes that her personal fate is part of a much more complex conspiracy and that she has to face much more opponents than expected to repair the past.<br><br>Reset is a movie that convinces on many levels. First of all, the depiction of the near future seems surprisingly grounded and realistic but also includes vehicles, technologies and buildings that are stunning to discover. Secondly, the plot is compact and has fluid pace which makes for an entertaining viewing experience from start to finish. Thirdly, the special effects are rarely over the top and find the right balance between brutality and elegance. Fourthly, the acting performances are quite good as one cares about the sympathetic main character but also about her trustworthy colleagues and even about the villains who are much more complex than one might initially think.<br><br>There are only minor flaws in this film. First of all, the plot is somehwat predictable and could have been a little bit more complex. Secondly, the movie's twist wasn't much convincing and could have been more detailed.<br><br>In the end, Reset is a very strong science-fiction movie that is filled with action and emotions from start to finish. The film's camera, light and special effects look greater than many contemporary Hollywood films. Therefore, the movie deserves more acclaim and attention than it gets. Give it a try and you will get excellent entertainment if you like science-fiction films with depth.","user":"kluseba","rank":[5,5]},{"title":"And again ... and again ...","rating":5,"date":"12 February 2018","review":"When you reset something, you try to make it better. But if you do it too often, you may end up with a mess that you can not improve any longer. Keep that in mind. The motivation of the main character here is relatable, but you may find yourself shaking your head more than once, looking at the direction the movie takes.<br><br>Time travel movies have problems and they are not easy to write. Also if you are too impatient, you may have expectations that the movie cannot fulfill. Having said that, this movie is entertaining enough and has enough suspense for you not to care about certain things. While it also delivers impossible stunts from a woman that is a scientist first ... but maybe was a warrior in her previous life. Again try not to overthink it ... and those are the obvious things you can pick out. Just watch it and enjoy it for the romp that it is ...","user":"kosmasp","rank":[12,17]}]