[{"title":"Beautiful, funny, and sharp about family and refugees.","rating":8,"date":"8 February 2018","review":"\"All happy families are alike; each unhappy family is unhappy in its own way.\" Tolstoy, Anna Karenina<br><br>If you'd like to feel good about your family, then see Happy End, written and directed by an Austrian, Michael Haneke, with a dollop of Euro horror that seems to combine elements of Roman Polanski and Mike Nichols. This family flirts with self-destruction across the generations.<br><br>Patriarch Georges Laurent (Jean-Louis Trintignant) is celebrating his 85th birthday with enough of his wit left to remember he dispatched his ailing wife to the next life out of concern for her pain. Similarly his granddaughter, 13 year old Eve (Fantine Harduin), attempted to poison a classmate and recently to commit suicide. Across the generations, this is not a happy family. However, a happy end they may have if even-keeled, task-oriented Georges' daughter, Anne (Isabelle Huppert), prevails. Not likely.<br><br>For all their wealth, each member, even comely and charming daughter Anne, is unhappy, she with a grown son, Pierre (Franz Rogowski), who is not socially or mentally well balanced. He can't even sing Karaoke without endangering his life. That Karaoke scene is a keeper in modern cinema.<br><br>Yet the family does ritual dining and socializing, right down to inviting friends and relatives to an intimate concert that is not euphonious to say the least. Just another off-balance moment. All the pretty dining and servants can't mask the undercurrent of familial larceny.<br><br>Haneke's use of modern technology from the live-streaming video during the opening bathroom scene to the exposure of a love affair through instant messaging casts an unflattering, harsh light on whatever the family may want to hide but can't. Even a work accident is seen through a security camera. As in Haneke's Cache, surveillance is revealing but never a solution. <br><br>Anne's engagement party could have been the democratizing of this family, but rather becomes a debacle when Pierre brings unannounced African immigrants with the beginnings of a diatribe against immigration policies. The result is mutilation, not reconciliation.<br><br>Happy End will not have a happy end for audiences unwilling to do some heavy thinking about the various puzzle pieces from each episode that eventually create a mosaic of modern bourgeois dysfunction. As such, the film may be difficult and tedious for general audiences. <br><br>Privilege has inured the principals to the plight of the servants in their household (the dog-bite sequence is particularly unnerving) and the unwanted immigrants at their wedding. This scurrilous neglect, passed down to generations, reflects not just a French problem (they are in Calais, after all, the port for refugee chaos) when the audience may consider the growing class disparities around the world and callous care about the poor and homeless. <br><br>Happy End, in the end, is about cankerous abandon in privilege, whose end may be no less than murder and suicide. Whatever, it's not pretty but a rewarding artistic experience.","user":"jdesando","rank":[34,48]},{"title":"another perspective of the end","rating":9,"date":"7 February 2018","review":"If anybody thought after seeing 'Amour' and especially its ending that Michael Haneke turned to be a little bit softer towards its characters and show them some mercy, than his or her expectations will be definitely be contradicted by his most recent film 'Happy End', which to many extends deals with the same theme - the end of the road that expects us all, death and how to cope with it.<br><br>The high bourgeoisie class had already had its prime time in cinema. Luis Buñuel is the first great director who comes to my mind, with his sharp and cynical visions in movies like 'The Exterminating Angel' and 'The Discreet Charm of the Bourgeoisie' . Their universe receives a deep and detailed description in this film, we are in the 21st century but the change seems to be more in technology rather than in morals, inner relations, or the way the upper classes relate to the world around - servants in the house, partners and employees in business, or the immigrants of different colors of skin who also populate the Europe of our times. The name of the film, 'Happy End' may as well refer to the sunset of this social class or to the mercy killings of the old and suffering.<br><br>We know from his previous films that Michael Haneke is not concerned about breaking taboos. This film attacks several as well. Innocence of child is one of them, the young age being seen not that much as an ideal age, but rather as the period when seeds of evil are being sown. We have seen something similar in 'The White Ribbon'. Respectability of the old age is another, and the character and interpretation of Jean-Louis Trintignant is the proof. There is decency in his attitude, but it derives from a very different place than the usual convention. At some point it seems that the old Monsieur Laurent tells a story that happened to the character also played by Trintignant in 'Amour'. Themes are recurring, but what the attitude of the script writer and director is as non-conventional as ever. One new perspective in this film is the exposure to the Internet and to social networking. These play an important role in the story, part of the characters share their feelings and send their hidden messages in the apparent darkness of the digital networking. The sharp critic of the director towards the surrogates of human communication is evident, but he also borrows brilliantly the format of the smartphones screens and uses them to open and close his film. 'Happy End' is (almost) another masterpiece by Michael Haneke.","user":"dromasca","rank":[24,34]},{"title":"Young orphan feels remote from her troubled family.","rating":10,"date":"25 January 2018","review":"Hands down, Happy End wins the Most Ironic Title of the year award. (Runner-up: \"President Trump.\")\n From Amour Haneke continues Trintignant's role as the octogenarian who lovingly cared for his ailing wife and helped her out - with Huppert as their callous businesswoman daughter. \n But it's from Cache that Haneke mainly draws, extending his anatomy of the privileged white business class cut off from emotional engagement, experiencing the world and relating primarily through media, and their insensitivity to the burgeoning immigrant underclass. \n The Callais setting is key. It's the bridge between France and England, both in starting the Chunnel and remarking England's last foothold in France. It's also the entry point for African immigrants hoping to continue on to England. \n Or to the French bourgeoisie? The dysfunctional Laurents represent the privileged society which the desperate immigrants aspire to join. The family's concerns pale beside what we see of the their Moroccan servants (\"our slave\" Pierre publically calls cook Jamila), the street lads Georges assumes he can hire to kill him, the older immigrants Pierre exploits to embarrass his mother at her posh engagement dinner, the construction worker killed in an accident, his whose family the Laurents further affront. \n In addition to the immigrants, the family is viewed from the perspective of Eve, Thomas's 12-year-old daughter who comes to live with the Laurents after her mother's mysterious poisoning and death. For this Eve there is no Eden, only a family of anger and mutual abuse.\n The film's central theme is the family's detachment from each other. The film opens and closes with Eve's cellphone films. This characterizes her as distanced, relating to her family indirectly, through media. The pre-title sequence records her mother's nightly ablution rite before she turns the lights off, an augur of her suicide. Then a young boy cavorts in silly cheek, showing Eve as cool and detached from her friends as she is from her mother. The last shot is of her Aunt Anne and father Thomas rushing to save George from contentedly drowning in the sea. \n The thin column of cellphone film is a mediated experience. So, too, are the computer screen messages between Thomas and his mistress Claire. Several key scenes are kept in long shot, Pierre's provoking of the accident victim's son. That device keeps us in the characters' detachment from the experience. Bent upon suicide, the grandfather wheels down the city street in the road, between the roaring traffic and the parked cars. \n In one scene the foreground is dominated by a violently barking dog. In the background we barely see the key content of the scene: Georges brought home from the hospital, in his new wheelchair. The composition leaves us uncertain. Is the dog attacking the \"stranger\" or straining to greet his master? And whose dog is it? We never see a family member with the dog, and Annes ordering servant Rachid to control the dog could suggest the dog is their pet, not hers. But then he bites their little daughter at play. The dog may well be the Laurents' pet, as neglected and antagonistic as the family members themselves. \n We're not told which. Just as the narrative omits significant details, like the cause of Eve's mother's death, the details of the Laurents' financial predicament, how the new father Thomas fell into another affair, etc. \n Perhaps the film's most touching scene is the grandfather's with Eve. To coax her into explaining her suicide attempt he confesses that he put his beloved wife out of her suffering. But, as her cellphone filing suggests, the girl is too dissociated from her own emotions and too remote from others to be as open and intimate as he is. \n Whether in lethargy, resignation or obedience, she wheels him toward the water and eaves him there. Even his possible death does not shake her detachment.\n Earlier Georges told her how disturbing he found the spectacle of a predatory bird tearing apart a smaller one, both then wiped away by a car. His point is how reality is even more jolting than its mediated images are. But when she watches his suicide she again resists the direct emotional encounter - and films it.\n The forgetful old man eager to die is the film's emotional and moral center. His family is relentlessly abrasvive. His son Thomas left his first wife and seems poised to leave his second for Claire, his unseen email mistress. He struggles to be a father for Eve. Grandson Pierre is an incompetent misfit who blames his mother for his own failure. \n Nor is there much passion and fulfilment in Anne's life. Her fiancé is the unappealing English lawyer who has been negotiating a large loan to rescue her company. This seems the traditional expedience rather than passion. \n Confirming this rotting and wasteful society, the dialogue abounds with references to urinating. Eve records her mother's pissing and flush. The email love letters relish the memory of golden showers, the mutual debasement may confirm Eve's sense that her father doesn't love this Claire, didn't love either wife and probably cannot love her either.\n Perhaps the film's central metaphor is the accident on their construction site. A worker is killed when he goes into a stored portable toilet to urinate and the ground crumbles under him. When a construction site provides such a bathetic destruction the company, the family, the society, seem of very unstable grounding,.\n Perhaps \"Happy End\" isn't so ironic after all. If Georges does manage to drown before his son and daughter save him, in this family he could ask for nothing better. In any case, Eve remains the continuing victim of a broken adult world she can neither understand nor enter with confidence or commitment.","user":"maurice_yacowar","rank":[23,33]}]