[{"title":"Very Well Done - Better than expected","rating":8,"date":"27 May 2017","review":"Based on the comments I read here, I wasn't going to watch this movie. One even said this was basically the same as the movie I.T. which is silly. They are two entirely different stories.<br><br>Yes. They both involve psycho's but I.T.'s psycho is truly going psycho for the most flimsy of reasons. I couldn't even finish watching that movie.<br><br>This movie however really delves into a legitimate reason why someone would do what the antagonist did in this movie.<br><br>It avoided a paper thin presentation of the Muslim's rage against the guy who killed his family by drone strike. And it had a totally different take on the possibilities where this movie could end up. I'm saying it like that so I don't ruin the movie.<br><br>The acting while not stunning was quite good. The writing was actually understated which I liked. The response of the government to this situation seemed more plausible than some movies that are so over the top.<br><br>This should be rated higher, at least a solid 6.5 to 7.0. In my mind, this movie is worth an 8.","user":"jacob2i","rank":[51,68]},{"title":"Disappointing","rating":3,"date":"3 June 2017","review":"What was the accent that Bean was supposed to be using? it changed as the film progressed. <br><br>As for the storyline, well, the premise was good but the acting was second rate to say the best. The over emotional kid.... and the ending I've seen more exciting in made for TV movies . Plenty of time for it to have been controlled better and the twist, I'd guessed that was going to happen from the earlier dialogue. <br><br>Can't see why it was called drone, apart from that being his day job, better to have been called a little light drama of dinner.<br><br>I stuck it out to the end but, wouldn't recommend it to anyone.","user":"startingfromscratchlv","rank":[24,38]},{"title":"A Movie with a Message.","rating":10,"date":"7 August 2017","review":"Some reviews is based on how well acting and all the bull people like to critique about. This is my first review. I never post reviews, but this movie hit me hard. This movie has a message that is told well and anybody with a soul that watch this film will feel sadness about the world we live in. I'm a proud American, but wrong is wrong. How can a country that is considered so great, send drones to countries that's live in poverty. I don't think you can tell me a reason for this way of killing, that will change my mind. This movie will be swept under a rug, because it tells a shameful truth about America in a very disturbing way. So this movie will never get the proper recognition it deserves.","user":"tsmith-40140","rank":[25,42]}]