[{"title":"Finally and well worth the wait","rating":8,"date":"6 August 2018","review":"If you're a fan of the 80's and of toys in general this is a must watch documentary. Just over 90 minutes long this documentary goes through the history of He-Man and the Masters of the Universe franchise, from the conception of a new and popular toy line for MATTEL to worldwide phenomenon, spanning the 80's and to modern times. Fans of He-Man and Masters of the Universe will enjoy the tidbits and behind the scenes stories behind the toy line and franchise. I would say that in terms of how the franchise came to be this documentary could also be a learning experience for business students.<br><br>A very interesting documentary with only a few shortcomings in my opinion. I felt the documentary spent too much time on the 1987 movie although I will say the interviews with both Dolph Lundgren and Frank Langella were absolute gems. Touched upon briefly there wasn't enough material, unfortunately, on why the franchise collapsed the way it did. Although a lot of that was already covered in the Netflix Toys That Made Us docu-series, it would have been nice to get a different perspective in this movie as well. Finally, I feel there was not enough focus on the 2000 reboot, no mention of any new developments within the franchise itself or where it could go in the future. I would have expected that personally. <br><br>All in all, this documentary was absolutely worth the wait. Hats off to the team for finally coming through with a great nostalgic and learning experience.","user":"thesuf","rank":[9,9]},{"title":"Solid.","rating":7,"date":"2 September 2018","review":"It's a well made and all-encompassing movie that sadly should have come out before The Toys that Made Us. You won't really learn anything here that wasn't already explored there, but it was nice to see Frank Langella and Dolph Lundgren talk about the awful live action movie.","user":"jellopuke","rank":[4,4]},{"title":"I have the power...","rating":6,"date":"25 August 2018","review":"I just finished watching \"Power of Grayskull: The Definitive History of He-Man and the Masters of the Universe\" on Netflix, and I must say that I was adequately entertained.<br><br>Sure, as a life-long fan of MotU then there weren't all that many surprises to be experiences here. But still, there was information and bits and pieces that I was not familiar with, and it was nice to have this extended information added to the knowledge of the MotU series and toys.<br><br>The documentary offers a good insight into what made He-Man, how it was at its pinnacle, how it evolved, what happened to its after its glory days, its early 2K return and the state of affairs today. So there is a little bit of something for everyone here.<br><br>There are good insights into Filmation's creation of the animated series, the crew and people behind the figures from Mattel, and also interviews with prominent people from those places, as well as with Frank Langella and Dolph Lundgren whom both starred in the live-action movie.<br><br>Regardless if you are a newcomer to the MotU franchise or a life-long fan, then \"Power of Grayskull: The Definitive History of He-Man and the Masters of the Universe\" definitely was entertaining. Sure, it was not something that you would watch more than once, but still worth the time and effort to do so.","user":"paul_haakonsen","rank":[4,4]}]