[{"title":"Marshall","rating":8,"date":"19 February 2018","review":"Marshall is a great movie that delivers on an old-fashioned courtroom drama. Great story with really good acting from the leads. Great cast overall. So far I have loved every role I have seen Chadwick Boseman play, he is a great actor and has this sort of swagger when acting. Sterling K Brown is great and one of the greatest actors in recent years. It was different but enjoyable seeing Josh Gad in a drama. I wish they would make more of these movies that follow Thurgood Marshall's journey. The only negative thing is that it felt a bit long.","user":"Bryan_Rathbun5","rank":[19,21]},{"title":"Thurgood 101","rating":6,"date":"12 October 2017","review":"Greetings again from the darkness. The question must be asked: is the movie worthy of the man? The man was the first attorney for the NAACP. He won 29 of the 32 cases he argued in front of the U.S. Supreme Court, including the ground-breaking 1954 Brown v. Board of Education (separate but equal public education). This man was a trailblazer for Civil Rights, and in 1967 became the first African- American Supreme Court Justice. This man was, of course, Thurgood Marshall  a man who unquestionably deserves not just a movie, but a really good and important one.<br><br>Chadwick Boseman has taken on film versions of such icons as Jackie Robinson in 42 and James Brown in GET ON UP, so he likely jumped at the chance to play the revered figure, Thurgood Marshall. Mr. Boseman has true movie star screen presence, and supplies the young Mr. Marshall with a self-assured swagger that accompanies a brilliant legal mind – a mind that refused to be ignored during a time it was desperately needed. Lest he be labeled a superhero, the film does portray Marshall smoking and drinking, while also hinting at his carousing. The common flaws of a great man.<br><br>It's 1941 and the young (33 years old) Marshall is the lone NAACP attorney, so he spends his time ping-ponging around the country fighting for fair trials for those African-Americans accused simply because they aren't white. He works only for \"innocent\" people and his efforts during this time were crucial to the Civil Rights movement gaining attention and legitimacy. Most of the film centers on a case in Connecticut (no, not the Jim Crow south) where a black man, Joseph Spell (Sterling K Brown), is accused of sexual assault of a \"respectable\" married white woman, Eleanor Strubing (Kate Hudson). If you are reminded of the great book and film TO KILL A MOCKINGBIRD, you must know that those literary and cinematic standards are such that few can ever hope to reach. <br><br>What follows is not one of the more dramatic or tension-filled cinematic courtroom dramas. There is simply too much levity for the film to be classified as a historical heavyweight. That said, the man and his story are fascinating, and though director Reginald Hudlin chooses a deft touch rather than a sledge hammer, it's likely the wise choice if the goal is to entertain, while also educating the masses to Marshall's early career. Josh Gad co-stars as Marshall's co-counsel Sam Friedman, a specialist in legal technicalities within the insurance industry. Boseman and Gad have nice chemistry (at times it feels like a buddy movie), and as a Jew in those times, Friedman is himself stuck in limbo between staunch racism and acceptance by the white community. <br><br>James Cromwell plays Judge Foster, yet another man caught between the old world he has lived in his entire life and the fast-changing society and legal system that permits him to silence Marshall, while also forcing (somewhat) fair treatment of the accused Spell. Dan Stevens (BEAUTY AND THE BEAST) is Loren Willis, the disgusted and disgusting prosecutor. This character is so cartoonish that the only thing missing is a neon necklace that flashes \"racist\" as he speaks. Sophia Bush has a brief, yet important scene and Sterling K Brown (as Mr. Spell) has the film's most heart-breaking moment as he sits on the stand and explains why he lied. <br><br>Director Reginald Hudlin seems like an odd choice for the project. He has been working mostly in TV since back-to-back-to-back bombs BOOMERANG (Eddie Murphy), THE LADIES MAN (Tim Meadow) and SERVING SARA (Matthew Perry). Mr. Hudlin has experienced more success as a Producer, having been Oscar nominated for DJANGO UNCHAINED. Here he works with the father and son screenwriters Jacob Koskoff and Michael Koskoff. The elder Michael is a well respected criminal attorney and legal historian, and certainly understands the expectations that come with offering a public look at a near- mythical figure  especially one as revered as Thurgood Marshall.<br><br>This isn't so much a movie about the icon as it is about a young man on the path to greatness and importance (he served on the Supreme Court from 1967-1991). The soundtrack is filled with jazz which complements the light-hearted approach, and further distances from any semblance of \"heavy\" or \"historical\". Director Hudlin adds a contemporary touch by having Trayvon Martin's parents (Sybrina Fulton, Tracy Martin) appear in a scene near the end. On the downside, multiple upshot camera angles are designed to make his lead character look larger than life. The truth is, Thurgood Marshall required no help in looming large. Hopefully this mainstream approach pays off and many are introduced to the legacy of a man who is more than worthy of this movie  and another.","user":"ferguson-6","rank":[36,46]},{"title":"An Old Recipe Prepared Well","rating":7,"date":"4 October 2017","review":"I got to attend an early screening of Marshall tonight. I'm interested to see how critics react. I have a feeling many of them will object to the \"paint-by-numbers\" approach to the film. While we have not seen Thurgood Marshall represented much in film, it does feel like we've seen this movie more than once before. But that isn't really the point. I've eaten spaghetti and meatballs hundreds of times before. I still enjoy it each time, the same dish, so long as it is made well. And Marshall, while not reinventing any wheels, is made well. Chadwick Boseman leads a terrific cast that includes Josh Gad, Dan Stevens, James Cromwell, Kate Hudson and Sterling K. Brown. Everyone is there to give this very important true story some depth and weight. At the same time, the screenplay never gets too caught up in its own self-importance. While some very dark themes and tragic events are present, there is a sense of humor pervading much of the film. This makes the people and events portrayed in Marshall relatable, instead of feeling like we're watching a group of untouchable, stoic historical figures. Marshall isn't designed to inspire anger or guilt, instead it encourages us to examine examples of unity that have been used to overcome struggle. It has more in common with films like The Help or Hidden Figures, than more aggressive films like Detroit (though that film is very intense and impressive). I would say Marshall will play out just as well at home as it does in a theater, but there is something about seeing it with a crowd that in this case adds to the experience. The gasps of the audience when an atrocity is displayed, the clapping when a bigot loses his/her battle-it is a good film to enjoy with an audience. From a technical standpoint, the film does not go out of its way to impress. The cinematography, costume and production design, music, editing-all seems serviceable if not particularly memorable. In this case its the story and the figures it portrays that you'll remember. 7/10.","user":"KingKongKyle","rank":[36,46]}]