[{"title":"I blame Jar Jar Abrams.","rating":8,"date":"1 January 2018","review":"Not all science fiction movies are able to include massive sets, unlimited special effect budgets, and high paid actors.<br><br>I had the feeling that this movie was somebody's passion project. It is a compelling story that someone wanted to make into a great movie. I commend the idea and the effort. Having said that, sure, most of the sets just scream low budget and the acting is hit and miss. Still, I thought it was a very good movie that kept me interested throughout. <br><br>I recommend this movie if you are into real science fiction - the writers/director were obviously fans of Arthur Clarke and Carl Sagan. If you are more interested in bright flashy scenes with massive sets and space battles with exotic aliens that rely on blaring soundtracks rather than intelligent dialogue, check out Disney's recently acquired space drama instead.","user":"AB-Crawford","rank":[40,52]},{"title":"Proper SciFi Movie","rating":8,"date":"18 June 2017","review":"I write very few reviews for IMDb but this film deserves a positive one. Firstly it was broadcast on SciFi channel so was expecting the usual \"Space Lobster v Mega Puffin\" script, direction and acting. How wrong I was.<br><br>This is a proper SciFi film with an intriguing plot, great script, excellent acting, great direction, above average (for the low budget) and intelligently realised special effects and a proper well written score. I would love to have seen what the director would have done with an additional $250,000 costume and set building budget.<br><br>As one reviewer has already stated, let's hope there is a sequel but this time with a bigger budget so that the director Rob York has less to hold him back.","user":"simon_atterbury","rank":[44,60]},{"title":"A squandered opportunity","rating":3,"date":"30 October 2017","review":"I really wanted to like this movie, but I just couldn't. Forget the bargain-barrel sets and special effects; the story-line and plot devices just didn't hang together, and were derivative of half a dozen other -- much better -- science fiction movies (Contact, 2001, etc.). Neither NASA, nor any other nation's space agency, would send a lone astronaut on a multi-year deep space mission; there would be a crew of several people. The protocols he follows for taking samples are on par with a junior high school field trip to the beach. And that the lead character would so easily leave his wife behind while he was away on a 10-year mission is just not believable.<br><br>This movie could have been so much better than it was. But it wasn't.","user":"tadam-51245","rank":[35,47]}]