[{"title":"They've nailed the depiction of Stubby's story!","rating":9,"date":"23 April 2018","review":"I've never seen this movie advertised anywhere and as a true WWI history buff, this was fantastic! Seeing Stubby come to life on screen was the best thing I've ever watched. The animations were really impressive and making this as a family friendly from a war that was shell-shocking was a big step up for Fun Academy Motion Pictures and I think this was the first animated film to ever be based on true events about a soldier who becomes a man's best friend to a stray Boston Terrier mix. I highly recommend this movie for history buffs, schools or to all families who want to see true events come to life in theatres!","user":"evangiang","rank":[37,40]},{"title":"Give the Dog a Bone","rating":8,"date":"27 September 2018","review":"I usually watch violent crime dramas and so this is a radical departure from my usual taste in films. I loved Sgt. Stubby,. The animation is incredible and the story a great tale (or tail) of doggy heroism during WWI. Stubby was a mutt from New Haven, Connecticut who was adopted by a military unit in 1918. America sent troops to France to fight the Germans and the doggy was hidden on a ship. Stubby had an uncanny ability to sense danger and warn his human masters. He also found wounded soldiers and alerted his caretakers as to their location. I have added this movie to my ten best list of 2018.","user":"billcr12","rank":[21,22]},{"title":"Works! A true and distintive Dog and War movie","rating":8,"date":"18 April 2018","review":"You don't very often see kids movie which are based on true stories or war. But that's what Stg. Stubby is about. Surprisingly, it works. <br><br>The strengths: The music, the story and the fact that the movie doesn't have one of the likely endings one might predict. I suspect the ending is largely due to Stubby being based on a true story. I'm unaware how accurate this portrayal is to the real story, but it seemed to me like a respectable adaptation. The way they managed to show the awful reality of The Great War, while keeping it G rated is really a difficult triumph of the film. It's important for people to have exposure the errors in war, as opposed to just the victories and heroism. This film highlights both. <br><br>The weaknesses: The voice acting doesn't stand out as great. The dialogue isn't a strength. But they get a longer leash (no pun intended) because it's a kids movie. The animation is great in the 2D segments, and much of the 3D animation is fine. However there are clips where I can tell they didn't have the funds to make the animation as good as they'd like it to be. The clips of the soldiers marching seem noticeably too synchronized and took me out of the story.<br><br>Overall, I recommend this film to anyone. It's not a film expect to win Oscars or nominations. But, it's a distinctive likable real-story dog movie. And the film is especially good if you want a mostly uplifting real story for kids about a subject they likely know little about: World War 1. <br><br>I'm probably in the minority, but I find the history of World War 1 to be just interesting and important as World War 2. It seems the average person knows 10 times more about World War 2 than World War 1 and there are about 10 World War 2 movies for each World War 1 movie. World War 1 highlights how futile and unnecessarily evil war can be even for the victors. World War 2 on the other-hand often enables the attitude of supporting war, because a lot of the losses to World War 2 seem worth it or necessary because of what was gained and what was at stake. A lot of wars are more like WW1 than WW2, and this is something everyone should understand.","user":"brianjohnson-20043","rank":[25,27]}]