[{"title":"Based on a real person, Jacquie Davis. Does NOT deserve 5.5 for sure.","rating":8,"date":"19 January 2019","review":"The character is based on a real person Jacquie Davis, the most skillful female bodyguard who has actually saved children, has been shot, stabbed and more (look her up). Finally a good action movie, with no stupid unrealistic car chasing's and unrelatable cold and empty heroes. Noomi Rapace gave an outstanding performance (as always) that definitely lifts the movie a lot. We have seen this type of story before (young rich girl being rescued from kidnappers by her bodyguard etc) but that wasn't a problem for me. I liked the fact that the protagonist isn't the stereotypical hollywood bad-ass woman with no feelings and the strength of a gorilla, she is not necessary stronger than the bad guys, but quicker, more skillful and smarter. Easy watching film, that has smart action that doesn't let you get bored, but not too much action to get tired of it.","user":"anastasiaozg","rank":[231,304]},{"title":"A non glossy look at a PPO","rating":7,"date":"26 January 2019","review":"As an ex PPO (Trained, still licensed, but not active) I have to remark that one of the many positives from this movie was it wasn't all 'glossy'. The BG wasn't portrayed as a superwoman who had amazing insights and powers. It came across as she was slightly OCD about surveillance and escape routes (ain't we all?) and a little neurotic and distrustful (again, not a bad thing). The fight scenes were realistic insomuch she took a kicking as she was physically smaller, but possessed the will to drive on and fight out.<br><br>All in all, it may not be an Oscar winner as it lacked entertainment value, but being a PPO isn't about providing entertainment. Personally, I think this is up there with 13 hrs in its portrayal of what the Private Security industry is about - poles apart, but professional","user":"welldai634","rank":[73,95]},{"title":"Rapace is Fierce","rating":6,"date":"19 January 2019","review":"I like Noomi Rapace and have seen and enjoyed most of her movies, at least the ones after the \"Girl With...\" series. I find her compelling. Although not traditionally beautiful, she has presence with a kind of rough grace that presents as extremely attractive and she is also one of the few women who can pull off high-action movies. If I see she is in something, I watch it, and have yet to be disappointed. Without her in the lead, I probably wouldn't have watched this,<br><br>When I saw Sophie Nélisse I couldn't figure out where I had seen her before until I realized she was Liesal and Gilly Hopkins.<br><br>The acting was okay; Nelisse an Rapace were effective in their roles. The setting and scenery were fine. The action was well done with only a few weapon mistakes. Overall, I enjoyed the film - it won't win awards but it's better than most action/buddy movies.<br><br>Very watchable, if only for Noomi, who is always good.","user":"gensbill","rank":[99,134]}]