[{"title":"I didn't see that one coming...","rating":6,"date":"14 November 2016","review":"I sat down to watch \"Patient Seven\" for two reasons; the first was because this is a horror movie, and the second was because Michael Ironside was in it. And I had no idea what the movie was actually about prior to sitting down to watch it, so I had no expectations.<br><br>And as the movie came to an end, I must admit that I was genuinely entertained by what directors Danny Draven, Paul Davis, Ómar Örn Hauksson, Dean Hewison, Joel Morgan, Johannes Persson, Nicholas Peterson, Erlingur Thoroddsen and Rasmus Wassberg managed to piece together.<br><br>Each of the eight segments (\"The Body\", \"Undying Love\", \"The Sleeping Plot\", \"Death Scenes\", \"Evaded\", \"The Visitant\", \"Banishing\" and \"Evaded\") were actually equally entertaining in each their own distinct way. And that was quite some accomplishment in my opinion. And they were spun together nicely enough by a good narrative.<br><br>The acting in the segments was good, and people were really doing good jobs with their individual roles, both during the segments and also in the narrative lead up to the segments. It was nice to see an ensemble of cast putting so much effort and energy into their roles.<br><br>The special effects in the segments were good. And having good and believable special effects and CGI effects is crucial to a horror movie, as it is usually a make or break outcome. So thumbs up to the effects team for their effort on \"Patient Seven\".<br><br>\"Patient Seven\" does have some nice enough surprises and plot twists along the way. I will not reveal any of them here, because I honestly think that you should take the time to sit down and watch the movie, because it is well worth the effort.<br><br>All in all, \"Patient Seven\" lands a solid six out of ten stars rating from me. This is a movie that I can warmly recommend that you watch, especially if you enjoy a good horror movie that is driven by proper story lines.","user":"paul_haakonsen","rank":[14,16]},{"title":"I liked it!","rating":5,"date":"13 October 2016","review":"And why wouldn't I? Sure, it wasn't the most original out there, and it went the multiple story type, but hey, it was well executed, decent effect and quite lovely actors.<br><br>Ironside is one of the oldies actors I really appreciate and apparently the man still has it, can perform just right, make you believe, if you give him a decent enough script he will play his part just right. The plot itself is good, I loved the way the stories were told, I think some of the monsters looked quite nicely and some tension made its appearance here and there. <br><br>Patient Seven will most likely remain an unknown horror, but those of you which will find it, go for it, it's far better than most productions nowadays, and it surely made the best of its budget. I for one will recommend it!<br><br>Cheers!","user":"gothic-fiction","rank":[28,36]},{"title":"A well made film, but pointless.","rating":5,"date":"12 October 2016","review":"Patient Seven has great actors, a good score and interesting dialogue. It delivers seven horror short stories that are never boring.<br><br>Unfortunately the film makers never went through the trouble of connecting those stories, offering closure to each of the patients, or even giving us a proper ending.<br><br>Instead of reusing horror elements throughout the various plots, (same monsters, same crimes) they could have used the content to paint a bigger picture.<br><br>In all, an opportunity wasted.<br><br>I am giving \"Patient Seven\" 5 out of 10 stars.<br><br>Thanks. (10 lines yay, sometimes there just isn't more to say)","user":"thejoudblitz","rank":[23,32]}]