[{"title":"Hell Girl: Starts strong, spirals out of control","rating":3,"date":"4 May 2019","review":"I'll be honest when I put Hell Girl on I expected another hyper low budget ghost themed embarrassment alike so very many others I've seen recently. It's not, not exactly anyway.<br><br>From the get go I was fairly impressed, the opening was stylish, the character development was fantastic, the script was strong and the cinematography was above par. For these reasons my expectations spiked, foolishly.<br><br>It tells the story of a group of ghost hunters on a \"Job\" who fall foul of a malevolent spirit. You know, the usual stuff.<br><br>Out of the gates I was enjoying it, but as soon as the movie really gets going it spirals into everything I feared that it was going to be. Don't get me wrong everything I said earlier still stands, everything is well above par and I have to tip my hat to everyone both in front of and behind the camera.<br><br>So why the low rating? Well the plot is just awful nonsensical tosh. No amount of quality everywhere else could save it from that, and Tom Sizemore! I don't know if his career has just nose dived to this level or if he's doing a Robert Englund and paying back to the industry that made him but he's starting to be a blemish on a movie rather than a bolster.<br><br>Better than what I expected it to be and very well made, but after about half way it turns real sour real fast.<br><br>The Good:<br><br>Michael Peter Harrison<br><br>Well made<br><br>The Bad:<br><br>Some elements are beyond stupid<br><br>Plot is just terrible<br><br>Tom Sizemore","user":"Platypuschow","rank":[17,19]},{"title":"No way! Both thumbs down!","rating":2,"date":"6 May 2019","review":"I have never seen such a bad movie ever before in my life! Awful actors, silly story etc. Totally wasted time! I'd have rather peeled potatoes instead of seeing this!","user":"ivanhirt","rank":[12,14]},{"title":"I like Tom Sizemore but...","rating":2,"date":"26 May 2019","review":"Now I just feel sorry for him - 220 credits yet not been in a decent film since Dreamcatcher in 2003 - he is a good actor but circumstances have dictated that he just does films like this to pay the bills and it's evident he really can't be bothered to put in a performance anymore - really sad - his talent deserves better.<br><br>As for the film - cliched ghost hunter team premise that has been done to death (pun intended) with a load of kids who will end up doing Canadian TV bit parts at best - truly awful unlikable characters especially the English bloke who obviously can't get work in Britain and is so needy he writes his own IMDB bio.<br><br>2/10 ... and I'm being nice","user":"davejessop-1","rank":[7,8]}]