[{"title":"Bollywood, refugees, and European trip movie","rating":5,"date":"8 December 2018","review":"The intentions are good, the combination of styles is interesting, but the result is disappointing. Bringing to screen a novel by French author Romain Puértolas ,'The Extraordinary Journey of the Fakir', directed by Ken Scott tells the story of an Indian conman whose dream to travel to Europe comes true, only to be mistaken for one of the millions of refugees trying to find a place under the European skies. Bollywood meets French literature meets European road movies meets refugees drama meets Hollywood. It's a mix that works only to some point.<br><br>What I liked. The mix of innocence and bravura of the hero is well served by the acting of Dhanush. Cultural differences are treated with a light comical touch and some of them succeed beyond the stereotypes. The funniest scene that takes place in the immigration office at the English airport and it's gorgeous, combining music and dance in a way that reminds Bollywood but also the Hollywood musicals. The way the European prejudices towards people whom they suspect are refugees because they look different makes its point without being too obvious or insistent. And 'a real fake passport' is a bright line.<br><br>What I liked less. The use of off-screen voice is excessive and pretentious. True, the film brings to screen a novel, but there are better ways to do it than have the character read text. The way the refugees and their dramas are presented is schematic. The romantic story is not credible - not in the way it starts and especially not in the way it ends.<br><br>'The Extraordinary Journey of the Fakir' tries to make its audiences feel well while dealing with serious topics. For me, at some moments it succeeded, at other it was boring. With less caution and more sharpness in the comical approach it could have been a better film. As it stands it belongs to the category 'only if you have nothing else better to do'.","user":"dromasca","rank":[11,14]},{"title":"Extraordinary! Hooked from beginning to end!","rating":10,"date":"23 June 2019","review":"I walked into this movie without great expectations, but that perception was quickly changed right from the beginning. The movie moves fast from one action to another and you just get hooked into the story. It's a mix of comedy, drama, action, romance all in one movie, all told in a somewhat poetic and magic fashion. The movie is just beautiful, touching and well acted. Very up-to-date for the moment we live with immigration crises, multi cultural challenges, etc. I'm surprised this movie is falling through the cracks with so few people paying attention to it. Also, totally clean for young audiences. I will take my wife and 10 yo to watch. Go watch it! You will not regret.... Totally 10!","user":"ds1111321111","rank":[5,6]},{"title":"The writer was mugged, the film bares very little resemblance to the original","rating":5,"date":"10 June 2018","review":"SPOILER: I was so looking forward to this film, I read the original story in French and laughed and cried all the way through it. Very very little of the original story is here. Marie wasn't a young American, she was an older French lady. In the book, the Gitan taxi community chased him mercilessly and resulted in the biggest comedy moments of the story, and the refugee story was more delicately and heart breakingly dealt with by Romain Puertolas. None of this was in the film. It was shamelessly hollywood-ised....Such a massive disappointment for what is a left of center fantasy based story. The phrase \"Loosely based on the book\" applies here...read only a nod to the original story.","user":"housebhome","rank":[24,47]}]