[{"title":"This is what I call a perfect movie.!!","rating":10,"date":"9 January 2016","review":"This is what I call a perfect movie. Natsamrat&nbsp;is a must watch movie.&nbsp;Nana Patekar proves yet again that not only is he an actor par excellence, but also he has a power to totally grip you till the end of his films. His performance is so brutally honest, that it will tear your heart into pieces as you sit transfixed, watching him with rapt attention.&nbsp; Just as Nana's Ganpatrao says in the movie, a true skill of any actor is not to let his viewer get distracted by a packet of snacks while watching him on stage. Nana does the exact same thing to you. It is not like this actor has not impressed us with his stage or screen presence before. But this film is different. Simply, because it is just so him. Nana does it with panache and adds value complete with some wonderful layers to the character in his own trademark style. Here is why you must start your New Year with his wonderful, wonderful movie. For those who don't know, Natsamrat is a cinematic adaptation from V V Shirwadkar (Kusumagraj's) iconic play by the same name.&nbsp;Natsamrat&nbsp;essayed by Nana is a celebrated veteran Shakespearean theatre artiste who is struggling to negotiate with the harsh realities of life once his fame begins to fade away. This character is based on Shakespeare's King Lear. Vikram Gokhale is Nana's companion, confidante and also a competitor. Together, they rule the theatre world before they age and decide to retire gracefully. The film deals with an actor's confusion of the whole 'To Be or Not To Be' question which life poses before him after his glory fades. It is essentially about the performer lurking in every retired actor who just can't enough of the stage and his audience. It is also about the better half and family of such an actor who in Medha Manjrekar's (who plays Nana's on screen wife in the movie) words, \"Don't leave theatre, but get it to their homes and lives.\" The film is also mainly about the ruthless society we reside in. Natsamrat on its own is a powerfully written play. Nana's rendition of Kusumagraj's heart wrenching soliloquies will make you cry but will your heart will feel light and deliriously content, I guarantee. This film is intense and extremely honest but it has its light moments. Moments which will make you laugh hysterically but will sometimes leave a sombre aftertaste. Interactions between Nana and Vikram Gokhale are beyond fabulous. They are wry, sarcastic and funny as hell. Though the focus is on Nana, all the supporting actors play their part very well. An actor can put act into his performance superbly well only he completely forgets himself in front of the camera and becomes one with the character he plays. Nana does exactly that. We forget Nana Patekar while watching him playing the Natsamrat. And, that's the success of any actor. Story, screenplay, background score, cinematography, acting and direction everything is superb. One should not miss this unforgettable movie experience.","user":"akashbedke1","rank":[29,31]},{"title":"Phenomenal acting and poetry","rating":10,"date":"7 January 2016","review":"I cant figure out any flaw with any part of this movie. This movie actually urged me to open an IMDb account and rate it as 10 stars as I really want the world to see what a masterpiece has been created by a small community of enthusiasts. Though the story has been adapted from an old Marathi play the movie does justice to every aspect of film making. The poems are mesmerizing. The acting is outstanding. The movie makes you question the harsh reality of relationships and standing up for what you believe in. A post retirement story of a down to earth actor parallels with the different acts he has played in his lifetime. Every aspect of human emotion including love, hate, betrayal, empathy, forgiveness, trust has been elegantly painted in the entire movie.","user":"ashus-25184","rank":[28,32]},{"title":"Movie Review: My reverence to \"Natsamrat\" Nana Patekar","rating":10,"date":"1 May 2016","review":"Some movies go beyond the visuals, the dialogues, the script &amp; even the actors to make an ineffaceable mark on your memory lane. Natsamrat is one such astonishing piece of cinema!<br><br>A screen adaptation of Kusumagraj's iconic Marathi play \"Natsamrat\", this movie takes us through the life of a veteran theater actor named Ganpat \"Appa\" Belwalkar (Nana Patekar), the fame &amp; stardom during his heydays &amp; the tragic upturn of his life after his retirement. The agony of the lead character is heartbreaking and the story telling is path-breaking. This movie leaves you with moist eyes &amp; a scratched soul.<br><br>Nana Patekar is outstanding as Ganpat Belwalkar. He owns this movie with unmatched conviction. \"Natsamrat\" in literal sense means the \"The King of Actors\" &amp; this man makes you realize that he indeed is amongst the best in Indian cinema. You laugh when he cracks the jokes &amp; you cry when he suffers. He has portrayed this character with such a proficiency that you leave the cinema hall with a reverence to the phenomenon called Nana Patekar!<br><br>As Amitabh Bachchan is the \"Shenshah\"&amp; so is Shahrukh the \"King Khan\". Nana Patekar, should, with due authority, be rechristened as \"Natasamrat Nana Patekar\" after this performance.<br><br>Vikaram Gokhale as Rambhau is superlative. The veteran actor plays the role with such a conviction that in few scenes he given even Nana Patekar a run for his money. The sequence on his deathbed when Gokhale recites lines from the Mahabharat gave me goosebumps. This movie will be a milestone for this \"Best Man in the Marathi theater\". The scenes of Nana &amp; Vikram Gokhale are the life of this movie. What a camaraderie! It's like watching Sachin &amp; Ganguly bat together. Sheer brilliance!<br><br>Medha Manjrekar as Kaveri Ganpat Belwalkar is serene. The romance between Anna &amp; Kaveri is ethereal. Mrunmayee Deshpande, Neha Pendse, Sunil Barve play their parts well.<br><br>The director, Mahesh Manjrekar needs a serious applause for steering the ship such beautifully. The film is an ode to the theater greats from V V Shirwadkar to Shakespeare. The story telling is refined, to-the-point &amp; touches you to the core. Even though the plot is melodramatic &amp; you would have seen similar plots of aging Parents suffering in the hands of their children in movies like Baghbaan, Avatar and many more, Mahesh Manjarekar's Natsamrat hits you the hardest. The director makes you feel the weight of Nana's pain &amp; suffering.<br><br>Such a kind of cinema needs to be celebrated &amp; it's high time that Marathi Cinema gets its due acclaim &amp; admiration. This movie will make Bollywood realize what they have missed by not using an actor of Nana Patekar's class to his truest potential.<br><br>My take: A must watch! Go &amp; experience the acting prowess of Nana Patekar.","user":"saurabh_bapat","rank":[7,7]}]