[{"title":"If you are a responsible parent, you will not let your child grow up with films like this","rating":2,"date":"16 February 2020","review":"\"Ostwind 3: Aufbruch nach Ora\" is a German movie that had its theatrical release back in 2017, so not a new film anymore, but also not too old. It is mostly directed at rather young female audiences (who love horses) and at 110 minutes (including credits), it is certainly a fairly long film. As you can see from the title, this is the third installment from the Ostwind franchise. So far, there have been 4 films and a fifth is planned already, so it seems these movies are still successful enough from a businss perspective. They cerrainly aren't from a creative perspective, but I will get to that later. First things first: The director is Katja von Garnier and this one here was her final Ostwind effort, which gives me hope for films 4 and 5. We grown-ups can be lucky that she stepped away from meking horrible female-centered films like \"Bandits\", but our kid certainly do not deserve what is coming their way with the Ostwind franchise. The first film was tolerable (not good), films 2 and 3 are just a mess. This also has a lot to do with writer Lea Schmidbauer obviously. Unfortunately, she did not stop putting her (lack of) talent on display after this third movie here, but returned for films 4 and 5. Okay I think could already read between the lines (haha) that I thought this was a really bad film. But there are positive aspects too. Good thing is that Froboess does not have a lot of screen time because most of the action here is set abroad. She is only in it briefly early on and at the end again, but that is enough for her to leave a negative mark on thi movie too. I am referring to her speech about how the female protagonist Mika should leave to go and look for Ostwind's roots. Tilo Prückner was a lot in the previous 2 Ostwind films, but in this one here, he is almost missing completely and judging from other stuff I have seen from him, this is something I am willing to applaud.<br><br>Luckily, this consequence is that the film still sucks, just for other reasons than the previous. Or partially for the same reasons. With that, I am mostly talking about lead actress Hanna Binke, who honestly has been horribly bad since the beginning of the franchise. And it feels as if she gets worse with every ne movie, which is hard to believe because of how bad she is already in the first and second film. But she managed the impossible, from a negative perspective obviously. She seems so lackluster all the time, she has zero range and just manages to make the wildest horse riding sequences seem dull and boring. I still have no idea why they cast her. And at the same time, what is even worse, the script is trying to convince us she is passionate and fiery, while everything about her performance screams the opposite. Unreal. With that, I am for example referring to the scene, in which Krebitz' character here tells her that people like them have a hard time, people who feel stronger than everybody else and this results in a tear-filled breakdown for Mika and I wanted to cry too because of how bad the script and acting there was. They must think we are complete fools. So yeah, Krebitz' is in this film and I normally like her a bit, but the idea of her basically being a grown-up Mika is not fulfilling at all either and it is just annother forgettable character they thought would be much more significant than she turned out eventually. Okay, I will continue with my revie now by mentioning specific scenes and moments, in which this film hit rock-bottom, although, like I said earlier, the fact that Binke is in it from beginning to end in almost every scene is reason enough to say that the entire film hits rock-bottom all the time. But now the scenes and moments: Of course her boyfriend (Niewöhner) is in it too once again and while he has not many moments, he still sucks in those he has, for example when they say goodbye for a while \"you belong where you are\". Wow now that was a brillant statement. Thank God, they told us that and even better they emphasized on the importance of this statement when we hear a pseudo-important deep song at the same time. this is by the way constantly the case. They really used many songs in their desperate attempts to make this film and Mika''s mission seem really deep. Cringeworthy stuff. As for Binke, there is a scene when her character is really tired and almost sleeping and then pretends to be fully away. So an actors' actor moment. I don't need to tell you how Binke fared there I am sure. Okay, now for the script again: The chaos already begins very early on in one of the rare \"comedic\" scenes when we have a woman who is not getting along well with her horse and know-it-all Mika sees it immediately. The cringe. Then there is the scene when Ostwind finds the injired horse. Of course, Mika won't miss out on the chance to rub it into our faces how Ostwind was the hero and savior here, not her. Or when another character says something like how Ostwind was lucky that Mika found him and Mika answers (obviously) he found her. Oh my.<br><br>By the way, great decision to just let a girl head off to Spain on a horse without anybody taking care of her. But hey she must find out about Ostwind's roots. That justifies everything. And how she ends up out of nowhere in Ora, the place she has been looking for boom randomly she asks where is this and she is there. By the way, after Binke's initially cringeworthy attempts to act as if her character cannot speak Spanish and utters three words to a local, they just decided from no on all the people in Spain she comes across speak German. How convenient. Of course, there is also some kind of business project going on in Ora that puts the horses at risk and of course Mika solves said issue easily while she is already there because the horse race at the end becomes some sort of cultural event all of a sudden. Oookay. Oh and while you are chilling in the sun at the water, always be prepared that in Spain, a woman can come out of nowhere and point a gun at you because her horse and the child of her horse are missing. Now that was already so bad that I had to laugh. I won't deny it. Epic stuff how they included new directions to the plot here. Oh and what's the way to ask somebody to get in the water and swim with you? \"Don't be a frog. Be a frog\" That's right. Amazing line delivery here from Binke again as well. But let's not ignore the glorious dialogue writing. The girl who gets invited for a swim here is Lea von Acken by the way and I cannot say anything bad about her. In contrast to Binke, she is a really talented actress, probably among the very best from her age group here in Germany, so thanks to her portrayal her character is just forgettable (because of how she was written), but not horrible like most of the others. Okay what else? Oh yeah how the kids sit all of a sudden in Spanish outfits at this event where they need to reach a specific number of visitors. Or how they are all of a sudden starting to paint patterns on their horses. Oh my. Needless to say that the film (like the previous) completely messed up when it comes to writing shades and realistic (antagonist) characters. Who wins the race? You know the answer. Rider not required! When the man says the soil they are standing on is now protected, it is supposed to be a positively emotional momemt, but it just feels shoddy and for the sake of it, despite how hard it tries to be memorable. There is so much wrong with this film and I could go on and on really. The franchise should have stopped after, or actually long before, this film, but it is still going. The good news is that judging from trailer for film number 4, Binke is not in it a lot because of another most likely pseudo-dramatic turn of events and a younger character takes over, but i have a feeling it will still be not good. As for this one here, a definite contender for worst film of 2017, not just from Germany, but really from everywhere. Yes it is that bad! Oh yeah the Spanish music does not feel generic at all... And at the end, Ostwind stays back with his folks where he is from (after Mika saved the place obviously), so Mika has to go home on her own, but don't worry. The irreplaceable Ostwind is replaced quickly by a young wild pony, the next challenge for our wonderful heroine apparently. Okay I just wanna forget this movie and how terrible it was, so I shall stop now. Stay far far away from this one. For your own sake. And like I said in the title of my review, make sure your kids don't get anywhere near either. I kinda expected this would be bad, but not that it would be this bad honestly. Haha yes the scene when the smartphone falls into the water. This film in a nutshell really. Entirely unrealistic. Shame the filmmakers' camera did not fall into the water, then it would never have been made and this would have been really amazing.","user":"Horst_In_Translation","rank":[0,0]}]