[{"title":"Cheesy Quirky yet Charming Quagmire","rating":4,"date":"2 November 2019","review":"Cheesy, awkward, clunky, oddly-paced and sometimes disjointed... Yet somehow endearing. Every time I reached for the remote to put it out of its misery, I was somehow compelled to give it just a few more minutes. They may not be the best actors on the block, but the on-screen team managed to keep me entangled.","user":"troy-boulton","rank":[8,8]},{"title":"Not as bad as It looks","rating":5,"date":"25 November 2019","review":"I read the reviews here before viewing so was expecting a B Grade Cheese fest.\nThe plot was pretty thin the synopsis barely palatable, the cinematography was just about random, but having said that it also does have an endearing quality of originality and character that leaves it's own indelible mark.<br><br>Won't win any awards, however not as bad as it may first appear. Pretty good effort by the film makers and actors alike.","user":"dubwize","rank":[5,5]},{"title":"Boy, where to start.","rating":4,"date":"30 October 2019","review":"First of all, you can't see this as your regular movie. No. This is the kind of thing that \"that friend\" would make. You know... ever heard \"I have a friend who made a movie\"? This is the movie he/she made.<br><br>The writing, the dialogue... Sweet baby Jesus... The characters don't grow at all and yet their personalities can shift in the blink of an eye. You won't understand their motivations most of the time and you won't relate to them because they're completely irrational.\nFrom missed queues to missed opportunities, sometimes it hurts how painfully slow the scenes progress. You'll find yourself asking \"why?\" some many times, it'll break any immersion.\nWeirdly, this made me care more about the actors and makers of the movie than the characters themselves.<br><br>Besides that, if you have an issue with the exploration of the female (ok, let's be fair, male too) body to promote a movie, don't watch it. It's unnecessary and cheap most of the time.<br><br>Prepare to have science thrown in your face. In that regard, I believe this was made for a very particular niche. I couldn't make out when the science talk was real and when it wasn't, so as far as science bable goes, this is 10/10. However, if all the physics do checkout, then this was a waste of perfectly good science, simply because it's too advanced for the average viewer. To conclude in that aspect of the movie, I'm not sure if the target audience are science nerds or stoners.\nNow, I have to give points for one of the most brilliant ideas I've seen in a Sci-Fi movie. At some point there's this scene where the science is being explained (again) and you get graphics and pictures (of course), but... they throw in a bikini model. Why? No reason. Does it make it more credible? No. But it makes you not care, so...<br><br>Most of the simplest animations and effects look great, although they should improve their green screen skills (scenes inside cars, for example). Just, don't mind the more demanding scenes.<br><br>So, somehow, this reminds me of the projects I make with my friends. I can see an idea and heart behind it, even if the execution fails in some points. It makes me wanna be a part of it.\nOverall, I want to believe this was for them and I hope it was fun.<br><br>With a better script and just a bit better direction on the actors, they could make something with much better quality.","user":"shagrog","rank":[8,10]}]