[{"title":"Inspiring","rating":8,"date":"29 December 2019","review":"\"Theres no easy way out\" - this is the motto of the movie. One of my personal favorites. This one will leave you with tears and happiness, a great one to buy or rent. I like the director's previous film 'Suing the Devil' - very talented filmmaker.","user":"jalan94","rank":[49,49]},{"title":"Very Powerful and Uplifting Move","rating":10,"date":"27 December 2019","review":"Left me in tears. It's all about GOD and some people despise that.<br><br>I almost never would give a 10 on a film since I believe that every film could do better, but in this case it is just a really good family film with some great take-a-ways. The acting keeps getting better in their films and the professionalism of the script level is very comparable to any family film produced by Hollywood. The messages and impact was felt deeply by myself. The next day I am still singing the songs in my head and trying to make some differences in my daily life to take advantage of the advise offered in the movie. I can't understand why many people would vote a '1' and then not even do a review, unless they never even saw the film and are just against anything with references to Jesus in a film. I guess that part hasn't changed in over 2000 years!? Go see the film and take someone with you...","user":"fields_dan","rank":[57,58]},{"title":"I saw director's new movie, 'The Islands' and had to see this film","rating":10,"date":"28 December 2019","review":"I saw director's new movie, 'The Islands' and had to see this film 'Slamma Jamma'<br><br>When a movie has a good story, or some superb character, or even a great soundtrack, it is a good movie. But when everything comes together, is about a piece of art what we're talking about. I think this is the case. From the first glance, this film is breathtaking with incredible basketball scenes and the amazing part was the actors could actually DUNK!!!!<br><br>10 out of 10 all the way.","user":"debbies-86415","rank":[54,55]}]