[{"title":"Filmed in Utah not Colorado.","rating":9,"date":"9 October 2017","review":"Several reviews that I have read comment on how beautiful T. C. Christensen's camera work makes Colorado look without realizing that THE STRAY was filmed in Utah. That's okay though as Utah has stood in for many spots in the world and even outer space. THE STRAY is a fine family film based on the actual experience of the director. I thoroughly enjoyed it while my wife found it to be a little slow. The acting is fine and the dog delightful. I would think that dog lovers will enjoy the film and will agree that the right dog can be life changing.\nThe above was written after seeing the film in the theater. Just finished watching the Blu-ray and was even more impressed with the stunning cinematography. Michael Cassidy and Sarah Lancaster are especially good as a husband and wife who are trying to find the right balance for their life together and their children. Knowing that this is a true story of the film's director (Mitch Davis) adds a special dimension to the film. I can certainly identify with the effect that a dog can have on a family as one recently came into my families life and has been a wonderful influence to us.","user":"blue-7","rank":[40,48]},{"title":"Great Family Film","rating":9,"date":"6 October 2017","review":"I really enjoyed this film as did my children. It was great to go to a movie that we could all enjoy together. It even got me to tear up a little. The Colorado vistas were stunning. The cinematography was beautiful as was the music. I am not super religious so I was worried about the faith elements of the film, but it wasn't too much. Nothing that I wouldn't do in a similar situation.","user":"kylestapleyfilmbuff","rank":[33,40]},{"title":"More than just a movie - A precious gift to cherish","rating":10,"date":"20 October 2017","review":"This is a beautiful, heartwarming, inspirational true story of an incredible stray dog who comes to save a family in more ways than one. An absolute must-see. I am thankful to have accidentally come across this precious little gem in my local theater, as it is only a limited release in very few areas. I cried both times, tears of hopeful joy, abounding love. I took my sister-in-law the second time, and out came the tissues. If you miss the big screen, make sure to purchase the DVD when it comes out, as this is a heartfelt treasure you will want to enjoy over and over and over again.","user":"Shilohbloo","rank":[36,46]}]