[{"title":"SMALL MOVIE, BIG STORY","rating":9,"date":"4 April 2019","review":"With the abundance of mega-budgeted, star studded films being released each year there are a ton of smaller films that gain little notice but that possess more storytelling than those same effects laden flicks we flock to at the nearby theater. Fortunately we have access to those movies, movies that deserve more attention than they receive, once they hit DVD. One such movie is THE STANDOFF AT SPARROW CREEK.<br><br>Alone and listening automatic fire and explosions ex-officer and now militia member Gannon (James Badge Dale) turns on his police scanner and hears that a militia group has gunned down a number of officers at the funeral of one of their own. Taking off he heads for the headquarters of his militia group where the founding members have gathered to find out what is going on.<br><br>The group is limited in number, about 6 in total, and no one claims to have led this attack. But one gun is missing as well as several explosives. Ford (Chris Mulkey), the leader of the group, finds himself able to trust Gannon and asks him to put his police talents to work, questioning the others to find out who launched the attack.<br><br>One by one each is interrogated and each has their own story to tell. We learn the most likely suspect lost his family and the response from the police was less than helpful. Another had to move after having killed someone in his home state. Each man has the potential to be the culprit but they also have possible alibis.<br><br>As the night wears on more problems arise. Militia groups around the country inspired by these events have begun their own attacks on local police forces. They see it as an uprising against the system. Deciphering the clues is what Gannon is left with as he attempts to find out who the guilty party was, save the group from being destroyed by a vengeful police force and stopping the madness across the country.<br><br>The movie works on various levels and plays out it an amazing way. Taking place almost completely in a few rooms at a lumber mill the leader owns there is little action on display here and plenty of dialogue that examines each man and his motives for being there. In addition to that we learn early on that one of the members is a plant sent in by the police months ago. But even he has the potential of being the one to start it all. As Gannon goes through the list of suspects deciding who the guilty party was doesn't become as easy as one would expect. The ending is even more surprising.<br><br>Led by Dale and Mulkey every single performance here is outstanding. Every actor on board brings their character to life and has you moving back and forth from anger to sympathy and then confusion. You find them all believable and at times can understand what would have driven them to this madness and membership. But would it be enough to make someone start a potential civil war? The only way to find out is to watch this film, a movie worth your time and attention.","user":"kirbylee70-599-526179","rank":[16,25]},{"title":"So close to amazing.","rating":5,"date":"19 January 2019","review":"There is an amazing film here that the writer/director didn't actually get on film.\nThe cast is solid and the direction is fine. The writing falters here and there. There are story lines that needed to be fleshed out a bit. Some of it seems a little implausible but only because there isn't enough attention given to details.\nI'm not bashing the writer/director. He did a fine job; better than most would. I actually look forward to what he has in store.\nI just can't help but feel this could have been a mind-blowing film in more, I dunno, seasoned hands.","user":"Colemanation","rank":[28,50]},{"title":"Not as expected ...","rating":4,"date":"30 January 2019","review":"The movie has no introduction, no character build up, it commences right from the beginning of the first scenes. In a who-dunnit esk style premise, the story is not as \"gripping\" as others have rated it. The story is hard to follow in some parts, and the ending is open to your own interpretation with no explanation. There are a few intense parts within the movie to keep you awake from the much boring dialogue throughout. I wanted to like this movie, and in parts the movie did have intriguing scenes, however in total it was a complete let down in my opinion.<br><br>The movie is based and filmed 97% within one warehouse. With a group of men demanding answers from one another in continuous dialogue with very little action scenes. The scenes within the warehouse is very dark and in some parts of the movie the lighting is so bad, at first I thought my screen was bad and attempted to put the brightness up.<br><br>I will not jump on the \"best movie of the year\" bandwagon as others have however, as this movie wasn't as good as I had hoped, perhaps the four stars I gave is generous. It has a disappointing ending which leaves you scratching your head. If your in the mood for a quiet night in and the choice is this movie or a good mystery novel, then chose to read.","user":"npjy83","rank":[27,54]}]