[{"title":"Considine again proves he is the most talented name in British cinema","rating":8,"date":"29 March 2018","review":"This is a beautiful film - peppered with moments of humour and breathtaking moments of shock. The use of music is inspiring (Nick Cave amongst the most wrenching) and Considine is a thoughtful and innovative director. I was fortunate enough to be at the screening where he attended for a Q&amp;A and he spoke about the set being the actors' house and how they all feel comfortable and safe. And it shows. Jodie Whittaker is striking in her performance and all the supporting cast shine rather than simply be there. It is a shame that Paddy doesn't get the recognition he deserves. He spoke about turning up for films where he was disappointed in his part and the people he was working with - he is \"in films for five pages\" whilst we get the Hiddlestons and Redmaynes shoved at us. We should focus on the Paddy Considines and Stephen Grahams a lot more. A lovely, thoughtful and ultimately very moving story beautifully played out by craftsmen.","user":"Drumcheeny","rank":[31,36]},{"title":"Sincere, heartbreaking, and hopeful, Journeyman is a feat of acting and direction.","rating":10,"date":"28 March 2018","review":"Journeyman is a near perfect film, in my opinion. It's simple, but elegant, allowing the characters to breathe and develop. It's *beautifully* acted by Paddy Considine and Jodie Whittaker, who frankly should have had awards thrown at them for the scene that you probably came to the review page to read about, and it's directed to perfection by BAFTA-winning writer and director Paddy Considine, who allows every actor to give the best performance possible and who has a great eye for framing. <br><br>Considine's career-defining performance is what will draw most people into watching Journeyman- he's nothing short of amazing- but it's Jodie Whittaker who steals the show. She's just heartbreaking, conveying the subtleties of Emma's situation masterfully. It's a remarkable, understated performance that looks effortless, and the fact that she only received an Evening Standard Award nomination for her performance in this film is just criminal. Doctor Who fans should consider themselves lucky to have her as the 13th Doctor. <br><br>Laurie Rose is the director of photography for this film, and while most of it stays focused on the characters, Journeyman is quite beautifully shot. The editing by Pia Di Ciaula is sharp, and the score and sound design are pretty good too. <br><br>Journeyman is a remarkable film: it's devastating, yet hopeful; it's beautifully acted, directed, and filmed; and it's a showcase for two of Britain's finest acting talents. Once again, Paddy Considine proves himself to be an actor, writer, and director to watch. <br><br>9.5 out of 10","user":"asdlkfjq","rank":[23,30]},{"title":"A remarkable sophomore effort from Considine. Packs well more than a punch","rating":9,"date":"30 March 2018","review":"It started about 20 minutes into the film. It then reoccurred every 10 minutes or so for the remainder of the duration. I've not cried like that at a film for I don't know how long. Like an emotional dementor Paddy Considine's second picture as a director takes so much, and give it back in equal measure.<br><br>I could say it was a like a punch to the face. A knockout of a film. It took me the full 12 rounds. It had me up against the ropes and... I could say these things. But they'd be naff -especially when describing this bruiser of a film.<br><br>It follows Matty Burton, an ageing boxer who knows his times spent and is ready to take his last steps into the ring before hanging up the gloves. But fate has another idea. Sounds familiar right? That's what I thought. Benefitting from having not seen the trailer, which I'd strongly advise avoiding if possible, I was of course shocked at the tale that followed. <br><br>Matty revives an injury which alters the course of his life. The film is really about how it affects not just him but those around him, namely his two friends and most of all his devoted wife, portrayed by Doctor Who's Jodie Whitaker, in a career best role. It's a boxing film but more than that it's a film about those we love and who care for us. It's about identity in some ways, fight in others, but love in every way. <br><br>Set mainly in the family home of Matty, his wife and their baby daughter Mia, the film is, for the most part, a domestic tale about a man recovering from a traumatic injury and a family recovering from the fallout of it. <br><br>When I say domestic I mean in the sense that the action is all contained within the confines of the house; not the ring. As a director Considine creates tension from the most ordinary of sights and sounds, a crying baby, the call of a name. He also crafts more than a couple of shocking moments, also within the house. These really shock. They're sudden, viscous and yet they create no feelings of anger, only anguish and desperation for our two leads. <br><br>Considine proved himself as a more than competent director with Tyrannosaur, and also a capable writer with Shane Meadows' Dead Mans Shoes. Here he goes beyond that. The original score is used when necessary and removed entirely at just the right moments, a certain phone call scene is one of the films standouts. It never tips into the melodramatic or pandering which I was very worried it would. <br><br>However above all this directorial talent which produces and almost insist on such incredible emotional response, it's the acting of Considine and Whitaker which truly blew me away. Considine is utterly convincing, scarily so at times. Whitaker more than matches him too in what is a very different but no less enthralling portrayal. Being a small British film (small only in the sense of it not getting a wide release) I don't expect any awards to come raining down. But I also don't think I'll see another pair on screen this year who put as dynamic and heartfelt a performance as these two. Absolutely stellar.<br><br>Yes it is a knockout. It did hit me with an emotional guy punch. And yet it's so much more than the cliches thrown its way would have you believe. See it.","user":"georgetdavies","rank":[19,26]}]