[{"title":"Save Yourself the Pain","rating":2,"date":"25 July 2018","review":"Unfortunately, I found very little to like in this horror flick. With terribly flat dialogue and acting, plus a storyline that seems to have been cobbled together from so many other horror films, it's even below B-movie quality, in my opinion.<br><br>Sam Valentine portrays the beautiful Lucy a flighty but intrepid young American woman who has traveled to France for the funeral of her great-uncle the Count Rose du Sang, at the creepy Castle Borley. Will she succumb to the devil-worshipping clan that resides there or will she break free of her family tradition that may have destined her to join them?<br><br>Since the ending was so convoluted, to me at least, I have no idea what actually happened. Maybe, you'll be able to figure it out.<br><br>I would say save yourself the pain and pass on this mess of a movie.","user":"larrys3","rank":[24,29]},{"title":"Dark sins","rating":1,"date":"6 October 2018","review":"'The Incantation' really intrigued me, with a creepy poster/cover, a quite interesting if not exactly new premise and as someone with a general appreciation for the genre it fits under. That it was low-budget, which from frequent personal experience is rarely a good sign due to that there are so many poor ones out there (though there are decent to good ones as well), and having seen my fair share of lacklustre and less ones recently, made me though apprehensive. <br><br>It is sadly however yet another film seen recently, hence some reiteration because the exact same strengths and flaws present in those films are here, that to me was incredibly disappointing considering its potential which it doesn't do anywhere near enough with. 'The Incantation' is really quite awful, with so many huge flaws and doesn't do anything with any potential it had. There is nothing good here in 'The Incantation', amateur hour all round. <br><br>Going on to the negatives, the story does feel over-stretched and some of it comes over as vague and under-explained in the last third where the film especially became duller, more predictable, more senseless and less unsettled and never gaining momentum. All the characters are too sketchy and with cardboard thin and colourless personalities and with nowhere near enough to make one want to endear to them. Their annoying and illogical decision making and behaviours frustrates. The chemistry is bland and unfocused.<br><br>The sound quality is obvious and utilised cheaply (being too loud in the build ups and people's reactions), the effects are shoddy and nearly all of the acting is lacking severely on the whole, that's actually an understatement as the worst of it is horrendous and the film manages to bring the worst out of Dean Cain who tends to be watchable. There is no sense of horror or engagement with the awful predicament they're in, and no connecting with the character, it just reeks of indifference and complete blankness which makes the viewer not care less too. <br><br>Dialogue can be stilted and rambling while the pace and film drags on forever, apparent from the very start, never recovering that interest is lost fast. The final third is stupid beyond belief and the ending is far too convoluted to make sense of. Found too many of the supposedly shocking moments not surprising or scary and the atmosphere dreary, due to the excessive obviousness, a lot of dumb and vague moments and explanations and the lack of tension and suspense. Thrills are none, thanks to stodginess and excessive over-familiarity, and found myself never invested in the drama, which tended to be indifferently acted, interminably paced and statically directed.<br><br>A lot of 'The Incantation' has really dull and going nowhere plot elements and often nonsensical and confusing character motivations, while too many of the things to make you shocked are far from creative or unsettling. It all feels rather tame while the threat completely lacks menace and looks terrible.<br><br>Nothing freaky or interesting, no development and too derivative, while everything is unimaginative and are more odd than scary, completely failing to show any sense of dread. There is nothing interesting or illuminating with what the film was trying to do and the drama is overwrought with no momentum and a lot of weirdness. The direction is barely there and disorganised and the music is ill-fitting. 'The Incantation' is poorly made visually, too drearily lit and the camera work is one of the film's biggest flaws in fact, the worst of it an eyesore.<br><br>Overall, terrible. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[4,4]},{"title":"Man of stool plumbs the depths of crappiness","rating":2,"date":"20 September 2018","review":"My how the mighty have fallen. Dean Cain, AKA Superman dreamboat of the 90s, must have been huffing kryptonite for the good part of a decade to have landed in this sub-mediocre pit of sloppy refuse. The acting is so limp and robotic that I'm convinced they spent 99% of the film's budget on SFX to edit out the scripts that must have been in the hands of the spaced-out junkie vagrants they filmed doing a first screen test read-through. The problem is they then had no budget to hire actual actors or production team after this exercise, and had to get an elementary school media class to salvage and cut together the film from the screen test footage. That would also explain the crappy sets, drab lighting and colour work, irritatingly slovenly timing and rhythm, and hollow emptiness that this film fills the space around it with. I gave it 100 minutes of my life, and it managed to drain a week I will never get back.","user":"troy-boulton","rank":[4,4]}]