[{"title":"No Redaction Will Be Allowed","rating":10,"date":"22 December 2017","review":"The facts, not alternative facts but the facts. Once you have that then the artist comes and tells us, dramatizes, enlightens without distorting the facts. I was sweating when Detroit ended but I needed to go back and check the historical records of the events. The movie is a faithful depiction of the facts with the artistic eye of the amazing Kathryn Bigelow to illustrate them. The film will make you mad, it will desolate you and anger you and force you as an American to ask yourself, how can this possibly be?\nDetroit as an artistic venture is a marvel with a cast of fantastic actors. Bravo!","user":"totalwonder","rank":[160,198]},{"title":"Detroiter Here","rating":7,"date":"27 March 2018","review":"I was hoping for more. The movie was long, but I felt like the emphasis was on the wrong things. Motive was glossed over. Torture scenes were drawn out. Why were the cops so evil and the detectives \"enlightened\"? Having lived through those times and knowing public servants from that era, I think they way things were portrayed was not true to form. The acting was strong and the content was emotional, but here in Detroit this case is still hotly debated and I am not sure the filmmaker captured how it is seen here.","user":"doctortv-23515","rank":[20,26]},{"title":"What Happened...Not Why It Happened","rating":7,"date":"2 August 2017","review":"The poster of Annapurna's newest film, Detroit hangs at my local theater like a provocation. A thin blue line of police officers struggles to hold back angry black protesters as big bold letters are scrawled along the side. The tagline reads: \"It's time we knew.\" Those words, along with the required \"from the creators of...\" accolades are the only things on the poster that aren't sideways.<br><br>They might as well be though, considering the 1967 Detroit riot is about the only thing about Detroit most Americans know. And I'm sad to report that while the film does a good job of filling the screen with a few powerful moments, it never provides much insight into the \"untold\" story of the Motor City or how its story fits into the larger context of modern racial relations.<br><br>After an awkward Jacob Lawrence inspired history of the Great Migration, the film captures the precipitating actions of police that turned the city's long sitting racial resentments into a lit tinderbox. In a hybrid of dramatization and archival footage, Detroit then glosses over the actions taken by the state to subdue tensions before setting its sights on a host of singular stories. It becomes high noon at the Algiers Motel where unarmed black teens face off against white police and National Guardsmen. Then comes the trial.<br><br>All of these events could have been their own movies and delved into deeper depths as to the cause, devastation, aftermath and public perception of what was later dubbed the black days of July. Yet because Mark Boal's screenplay is so laser-focused on documented events and momentary minutia, everything is squished into an off-kilter collage of well-meaning but superficial docudrama. One whose central story, the Algiers Motel incident, is treated more like a genre horror film than either a granular traumatic event or police brutality in microcosm.<br><br>Detroit basically pulls a Dunkirk (2017), building unbelievable tension while giving us the bear minimum in character. It's all about the situation and the situation only. The recreation of which is beyond reproach. However, Detroit's grand design creates a narrative dissonance. One in which the individual experiences of real people just don't translate all that well.<br><br>The problem is compounded further by Barry Ackroyd's unvarnished cinematography which cuts between extreme closeups of wounded faces, voyeuristic overheads and wide shots of crowds angrily gathering in the streets. The lack of establishing shots, aerials, use of recognizable landmarks etc. hammers home the idea that something like this can happen anywhere. But the question, why can it happen anywhere, remains illusive up until we here the words \"police criminality should be treated the same as criminality.\" By then it's too little too late.<br><br>Luckily director Kathryn Bigelow is very adept at inserting humanity within the margins saving Detroit from being just another Patriot's Day (2016). She finds a particularly redemptive subject in Algee Smith as up-and-coming Motown singer Larry Reed. The young actor displays an emotional intelligence well beyond his years, formulating a character that starts out with youthful swagger, ends with a shaken core, putting you in his head-space at all points in-between. Additionally, while most of the films attempts to color opposing forces with shades of grey fall flat, Reed's arc feels tragic but sadly understandable given the circumstance.<br><br>Unfortunately for both Bigelow and the city of Detroit, Detroit's script casts too wide a net to be especially impacting. It's procedural approach stifles the emotional stakes and its over-arching theme is turned in with much less humanity and passion than is deserved. Even with a towering performance by Algee, and the inclusion of Will Poulter who plays menacing/in-over-his-head real well, Detroit just can't transcends its trappings. To add insult to injury, the film itself was shot primarily in Boston...so there's that...","user":"bkrauser-81-311064","rank":[84,134]}]