[{"title":"Charley mirrors our own longing to connect","rating":10,"date":"30 April 2018","review":"When I first heard about British director Andrew Haigh's (\"45 Years\") Lean on Pete, it sounded like a warm, cuddly drama about horses, perhaps an updated version of \"The Black Stallion.\" The film, however, as I quickly discovered, is not about horse racing or even about horses. It is an odyssey of a 16-year-old boy (Charlie Plummer, \"All the Money in the World\") who becomes attached to a doomed horse and undertakes a desperate quest for support in a world that has suddenly left him alone, attempting to make sense of an America that has lost its moorings. Charley is, in poet John Banville's words, \"all inwardness, gazing out in ever intensifying perplexity upon a world in which nothing is exactly plausible, nothing is exactly what it is,\" a boy without a past or a foreseeable future.<br><br>Based on a novel by Willy Vlautin and set in the Pacific Northwest, Charley lives with his single and much traveled dad (Travis Fimmel, \"Maggie's Plan\") who has come to Portland to work as a forklift driver. Unlike the quiet, polite Charley, Ray is blustery and macho, but there is no doubt about his love for his son, although he often leaves him alone. Abandoned by his mother as an infant, Charley's only other family is Aunt Margy (Alison Elliott, \"20th Century Women\") with whom he lost contact many years ago after she had a conflict with Ray over Charlie's upbringing.<br><br>Out jogging to acquaint himself with the neighborhood, the boy discovers a seedy looking racetrack and strikes up a friendship with a cynical, small-time horse owner who is not averse to cutting ethical corners to make a living. Earning a few dollars by assisting Del (Steve Buscemi, \"The Death of Stalin\"), and jockey Bonnie (Chloë Sevigny, \"Beatriz at Dinner\") doing odd jobs around the track, Charley forms a bond with one of Del's disposable horses, a five-year-old quarter horse named Lean on Pete whose normal position in a horse race is dead last.<br><br>The worldly-wise Bonnie tells him, however, not to get attached to any horse saying that they are not pets, a truth that Charley realizes when he observes horses at the end of their racing days being shipped to Mexico to discover what a slaughterhouse looks like. Charley's world turns dark when his dad is severely beaten by the husband of one of his girlfriends and he is forced to earn enough money to keep up the household. As Ray's condition worsens, and Lean on Pete is slated to be sent to Mexico, Charley steals the horse in Del's truck in the middle of the night and takes to the road, seeking to find his way to Wyoming to look for Aunt Margy, without knowing anything about her whereabouts.<br><br>After Del's ancient truck breaks down, cinematographer Magnus Nordenhof Jønck (\"A War\") keeps us close to the sagebrush and flatlands of Eastern Oregon as the boy and his horse (to whom he confides his innermost thoughts) travel together on foot, coming into contact with both the hard working underclass of American society and the dregs who prey on the innocent and trusting.<br><br>As Charley moves from town to town, half-starving and disheveled, a child grasping onto any means to stay alive, he is forced into taking revenge on Silver (Steve Zahn, \"Captain Fantastic\"), a homeless man who steals his money in a drunken rage, but it is only one in a series of incidents that test his mettle and define who he is. A feeling of sadness pervades Lean on Pete, yet, like life, it is always filled with the possibility of renewal.<br><br>Charley's struggle to fit in a world that no longer welcomes him mirrors our own longing to connect, to find someone to care about and care for, to discover, as poet Carl Sandburg put it, \"a voice to speak to us in the day end, a hand to touch us in the dark room, breaking the long loneliness.\" It is Charlie Plummer's beautiful and subtle performance that carries the film and grants us access to our own innermost experience of what it means to feel isolated in a world that we can no longer call our home.","user":"howard.schumann","rank":[52,70]},{"title":"Very heavy story","rating":8,"date":"25 February 2018","review":"Athough the title of the movie gives us something soft and nice, be ready to deal with the cruelty of the real life. It is really a nice story, but for someone more than heavy for his/her expectations. Director Andrew Haigh showed us mainly how looks life of American underclass, what isn't what we can see in some profitable and big budget movies. The young actor, Charlie Plummer, gives us the picture of a good acting and what to say more than that he is the best of all other members in that cast. A natural gift to be a good actor.","user":"Irena_Spa","rank":[43,60]},{"title":"A life of some stability","rating":8,"date":"3 May 2018","review":"If anyone sees an advertisement for Lean On Pete and thinks they're going to \nsee some boy and a horse story like TV's Fury or National Velvet put that out\nof your mind. This is a touching story about a kid growing up in the Pacific\nNorthwest with a single father who gets a summer job working for a horse\ntrainer and it's filled with pathos and tragedy.<br><br>Charlie Plummer gives a beautiful performance as the sensitive 15 year old who\ngets a job with Steve Buscemi a horse trainer who has seen better days. Buscemi\nis working the quarter horse county fair circuit and he has a couple of horses who also have seen better days.<br><br>Buscemi makes it clear from the gitgo that this is a business for him and jockey\nChloe Sevigny tries to give him good advice that this is a business and not to get attached to the horses and think of them as pets. But Buscemi's horse\nnamed Lean On Pete gets attached to young Plummer and vice versa. He\nsteals the horse to prevent him from a final trip to the glue factory. It's\nquite the odyssey the boy and horse have.<br><br>The vistas of the Pacific Northwest are beautifully captured and the casting is\nexquisitely perfect in the role. But in a carefully controlled and beautiful\nperformance Charlie Plummer conveys so much emotion. All he wants is a life\nof some stability and something or someone to love. Simple things a lot of\nus take for granted and some of us are cursed never to have.<br><br>Lean On Pete is a real sleeper of a movie and should have gotten more recognition than it did. I defy anyone to watch this and have a dry eye when\nfinished. Simple and hauntingly beautiful.","user":"bkoganbing","rank":[21,33]}]