[{"title":"Review the Reviewers","rating":8,"date":"9 May 2018","review":"I think some people were looking in the wrong place for a movie this one isnt. It's a sci-fi movie, not of the action, space rocket variety. People are talking subdued because that sets the desired mood. Clive looking bored is Clive playing the role as a depressed man who doesn't have to be Al Pacino. Slow pacing? How about creating tension, instead to racing around chasing people. I call it a movie that takes its time and lets you digest it. If you want an action movie go somewhere else.","user":"spiderleggreen","rank":[264,331]},{"title":"Example of pure sci-fi","rating":8,"date":"6 May 2018","review":"Sometimes I can't understand reviewers here. I mean, if a sci-fi movie is reviewed, then writer should criticize it (good or bad) from sci-fi view angle. And even then, one shouldn't compare one sci-fi genre with another.<br><br>Anon is raw sci-fi, without amazing effects and stunning fights. It's story is more actual than ever.. or at least it should be. In a society, where we \"feel the need\" to be \"connected\" all the time.. without second thoughts about possible consequences in very near future.<br><br>In short: good actors and good idea well presented. Makes you thinking after movie ends -which is the main point of good sci-fi.\nI give it 8 stars.","user":"BogdanH","rank":[187,239]},{"title":"It seems I'm trying to like it","rating":5,"date":"5 May 2018","review":"I'd say it's one of the better movies at looking and acting like a quality film, while being devoid of life. It seems as though I went and bought the most beautiful dog, brought it home excitedly, and was so happy with it for a week. Then notified it doesn't bark, he doesn't especially like affection, surely doesn't show any affection back, and is seemingly obsessed with standing on three legs. Entertaining at first but quickly loses its luster. At some point you feel guilty not liking such a beautiful dog, but trust me it's not your fault, we would all feel the same way....welcome to anon. Cool tech, hollow lifeless body.","user":"nicktatta","rank":[161,207]}]