[{"title":"Completely Overrated - Fake reviews","rating":1,"date":"1 December 2017","review":"Firstly I would like to say that IMDb should really review these ratings in order to keep its reputation in order, because I will tell you what... <br><br>I have had the work to get the movie, buy stuff to nibble and drink whilst watching a 6.8 rating movie. I swear that by the first quarter of the movie I thought I was watching the wrong movie. I am sure that even my classmates from University could do a better movie than this one. No plot, no story, no emotion, nothing... and the main character acted as badly as my son pretending he is sick when he doesn't want to go to school. Literally, a total mess. If you are to watch this movie, I advise you to go onto Youtube and find a documentary about cab driver serial killers and I bet you will enjoy way more than this worthless piece of amateur filming. <br><br>I hope I saved your time.","user":"SmartUp","rank":[39,44]},{"title":"Beware of fake reviews !!","rating":1,"date":"13 October 2017","review":"Let me save you 84 agonising minutes of bad acting, ridiculous scenarios and one of the worst film endings ever. I watched it based on the score it had and the user reviews however, having just wasted those precious minutes of my life I will urge you not to do the same! There really needs to be a minus scoring system on IMDb as somehow there aren't always the words to describe how dire some films are. This would be a prime candidate for the best minus score picture of the year.","user":"nanagladys","rank":[120,152]},{"title":"They spent more money for faking up the IMDb rank, than for the movie production","rating":1,"date":"3 December 2017","review":"Wow I thought I can trust IMDb ranks for picking the good movie to watch, clearly I was wrong. This is absolutely worthless movie like those old movies on Netflix - totally banal unoriginal story, no thinking involved, cheap acting. The real rank should be 3 out of 10. If IMDb allows it everyone who wasted their time on watching this should report on this case of obvious rank faking.","user":"philippmunin","rank":[18,20]}]