[{"title":"After fake reviews are accounted for, this film is a 1, it would not pass as sophmore film class","rating":25,"date":"25 October 2019","review":"Firstly the five \"ten\" and \"nine\" star reviews before mine, all done today, are by accounts CREATED TODAY - ie FAKE accounts. and from the diction and phrasing are certainly the same person.\nFrankly the laughable fake \"10\" star reviews have more creative input than this film!<br><br>This film is horribly paced, the dialogue is turgid and flat, the plot hollow and narcissistic.<br><br>This film is NOT channeling the candidness and realness of Cassavetes as implied, but is much more like a incoherent stringing of Shia LaBouff's, or pick your recent enfante terrible's, worst tantrums. What exactly is the lead raging against? Their own privilege? And nearly two hours of this nonsense?","user":"random-70778","rank":[27,50]},{"title":"Brilliant and Entertaining","rating":10,"date":"27 October 2019","review":"This movie was absolutely amazing. I enjoyed the story so much, it made me both happy&amp;sad, made me laugh&amp; cry and also feel so many different emotions/connections with each character. Alex WROTE AND DIRECTED this movie and he did a damn good job. He's a convincing and captivating storyteller. Definitely a fun movie to watch and most definitely worth every penny. You won't be disappointed, in fact you'll want to see it again and again.","user":"abbyworm","rank":[9,15]},{"title":"Beautiful film!","rating":10,"date":"17 February 2020","review":"Absolutely blown away by this film! It has been a long time since I've been moved by a film to this extent. It is so raw and real, I felt like I was living right in the middle of Nick's turmoil from start to finish. His rage and sorrow were so palpable, but I also found the banter among him and his friends entertaining. It brought me right back to that period in my life in high school when I was walking a line between trying to find myself and also being carefree. Even now in my 20s it still hits close to home!<br><br>To anyone who has experienced loss, been through a difficult season of change, or just to those who can relate to the trials and tribulations of youth, you will find a kindred spirit in Nick.<br><br>With moving performances, beautiful jazz compositions, and NYC as the backdrop - this movie really was beautifully and artistically done. You can tell that Mr. Wolff put his heart and soul into creating it, and I hope we get more films from him in the future!","user":"midnightkarma","rank":[2,2]}]