[{"title":"Very disappointing!","rating":4,"date":"17 June 2017","review":"I was really looking forward to this. I've read quite a bit about what really took place on this Hatton Garden job, the people involved, how it was planned and went down, etc. I've also watched news stories, a British television documentary, etc. So I was justifiably baffled when a Hungarian woman (who doesn't exist in real life) appeared as the mastermind of the whole thing. What? So the men who spent 3 years meticulously planning this heist were now just hired goons? How does this co-exist with advertising claiming \"true story\"? The Hatton Garden Job is very flimsily BASED on a true story but is very definitely a work of fiction, and a poorly done one at that. I guess the budget was super low, else they might have cast Terence Stamp, Michael Caine, Ray Winstone, etc., in the leads. The TV actors used were adequate but definitely lacking charisma/star quality/acting chops that could have loaned some magic to this limp film.<br><br>***SPOILER***One of the reasons the gang got caught (and a point well made in news articles, etc.) is that one of the men drove around the scene of the crime, both before and during, (all caught on CCTV) in his distinctive Mercedes that was white with a black top. The filmmakers couldn't even be bothered to replicate this car for the film, instead using an all-white Mercedes, making it far less noticeable than the real car, which was already known to police.<br><br>Other reviews have mentioned the loud, obtrusive music, and I had the same problem. the dialogue is whispered most of the time, with sudden intrusions of blaring music. I had to watch with earphones on, remote at the ready, so I could switch volume up and down repeatedly while watching. Sound editor should be banned from ever making another film! Stick to video games, dear, which is probably all you've ever worked on prior to this.<br><br>Slow moving, no suspense or intrigue, added characters that are little more than cartoon characters and veer the story into the world of fiction, ludicrous dialogue at times, and generally just a big, boring disappointment.","user":"backofthevan","rank":[20,22]},{"title":"Not so exciting","rating":7,"date":"7 May 2017","review":"This film tells the story of a group of older criminals and a young man, who team up to rob a safety deposit box company in London. It turns out that they have successfully pulled off the biggest heist in the history of Britain.<br><br>\"The Hatton Garden Job\" could have been a thrilling heist film, but I think it is pretty flat. Most of the film shows them in an enclosed space drilling holes with Hilti equipment. It is not that interesting, to be honest. Even though there are several occasions where they are close to getting caught, or something big happens, none of these instances offer any thrill or highs. The film comes across as too descriptive and plain to be exciting.","user":"Gordon-11","rank":[25,29]},{"title":"Disappointing for me. I expected much better.","rating":3,"date":"16 June 2017","review":"First off was the sound quality. I watched this film late at night and had to lower it up and down so as to not wake the neighbours with the dreadful music. Secondly, most of it was fiction and silly fiction at that.Thirdly, it looked very amateurish to me and finally it was a bit boring too. Let's hope the new version in production, holds a bit more excitement.","user":"erica-taylor-1","rank":[19,23]}]