[{"title":"awful","rating":1,"date":"14 July 2017","review":"Dear movie goer, after seeing one half of this movie and shutting it down in disgust, I am wondering what happened to the Tyler Perry who brought us Madea's Family Reunion which was hysterical, but thought provoking with a stellar cast. This was unfortunately a foul mouthed piece of garbage.","user":"mygirlucy","rank":[14,18]},{"title":"Predictable Drivel","rating":2,"date":"1 February 2017","review":"Somebody needs to tell Tyler Perry his one-trick pony (a/k/a Madea) has been beaten to death. <br><br>Boo! A Madea Halloween is a perfect example. The same recycled, hackneyed, one-note, shallow, and unfunny situations are present again--complete with the same people. At least this one wasn't about some beaten down black woman/girl who needed to find her place in the world, stand up to her man, and ZZZZZZZzzzzzzzzzzz. It is mind boggling how he can pop out these POS and always manage to attract an audience. Madea's answer to everything is violence. If that is not bad enough, Perry is now blatantly stealing comedic material from DEAD people, i.e. the line \"beat her till the white meat shows\" is a line straight out of the late Bernie Mac's \"Kings of Comedy\" routine. Shameful. And if he thinks for a minute that I believe anybody could go to a frat party and NOT find drugs, liquor, or copulation, well, he is a fool.<br><br>Rated PG-13. I would rather watch a cow scratch its ass on a fence than another installment of this crap.","user":"dcarsonhagy","rank":[14,18]},{"title":"Typical Ma'Dea","rating":10,"date":"7 November 2016","review":"This is a typical Tyler Perry movie. Either you like it or you don't. His main focus is to entertain. To make you laugh and if he can slide in a life lesson or some \"Ma'Dea\" wisdom on the way, then so be it.<br><br>Tyler Perry doesn't let you down with his many roles as Ma'Dea, Joe and Brian. Brian is in over his head with raising Tiffany as a single parent and when he tries to forbid her from going to a college fraternity's Halloween party, all hell breaks loose.<br><br>Trying to win the approval of her friends, 17-year-old Tiffany sneaks out of the house to go to a Halloween bash at a fraternity anyway. The fun soon ends when police and the cranky, fast-talking Ma'Dea (Tyler Perry) arrive to crash the party. Unhappy with this sudden turn of events, the vengeful collegians decide to scare Ma'Dea and her cronies with a series of pranks. She soon finds herself under attack and on the run from an assortment of ghosts, ghouls and zombies on the scariest night of the year.<br><br>If you want a good laugh this is your movie, but don't read too much into it as far as meaning, its pure entertainment.","user":"ntennell","rank":[19,27]}]