[{"title":"Those last 20 minutes!","rating":5,"date":"13 February 2018","review":"Seen every movie in this franchise, my fun ended with the third part for obvious reasons. With every following sequal i had my hopes up, just to be dissapointed again and again.<br><br>When i saw this trailer my hope started to flicker again. The trailer was what i was hoping for. So i started watching this one while being curious and eager.<br><br>The bottomline is that this is not the entry we hope it is. But it isnt as bad as some of the entries either. Basiclly its those last 20 minutes you want and for that youll have to go through 60 minutes of scenes full with nonsense, boring set pieces and a lot of typing. If you find yourself at the end of that boring, long road youll get to experience just a little of the old vibe. And although not the strongest bits in the series, satisfying nonetheless.<br><br>The end creates chances for another weak entry or even a reboot. All in all i would hope they would for once invested a big budget in this franchise. All those little snacks here and there doesnt make for the meal we are so hungry for.","user":"ppdevries","rank":[52,64]},{"title":"Yes Please!","rating":8,"date":"16 February 2018","review":"I am a HUGE fan of the Hellraiser mythos.\nThe aesthetics, the lore, the characters.\nAfter watching the original as a teenager the lead character 'Pinhead' needled his way into my consciousness as the primary 'horror character' of my dreams/nightmares.\nHe left such an impression that it wasn't long before i chased down his original appearance in Clive Barker's (master of the macabre) novella 'The Hellbound Heart' and became absolutely smitten for life.<br><br>Armed with such impressive enthusiasm i devoured every Hellraiser movie as soon as it became available.\nMy infatuation notwithstanding i couldn't help but notice the gradual decline in quality as each subsequent effort was released.\nApart from 'Hellraiser 4 - Bloodline' there was a clear degradation in the caliber of film being presented.\nIt was getting beyond embarrassing. <br><br>Understandably my expectations for the 10th film were about as high as my expectations of answering the door to a scantily clad Drew Barrymore offering me a cigar made from rolled up $100 notes, as she ushered me onto her private jet for a life of pool-side tickle-fighting.<br><br>My impression from having JUST finished watching the movie is,... relief.\nThe people who made this film DIDN'T just churn out the product and slap the 'Hellraiser' name on it like the last 5 movies.\nThere was some actual THOUGHT put into the script and i was grateful to not be able to predict the plot at every turn.<br><br>This is in no way the BEST film in the world, or even the best film in the series, but easily in MY top 3 of the series.\nIf you're in to Hellraiser like I am, then im sure you'll enjoy it.\nIf you're NOT into Hellraiser,.. then i hereby forbid you to watch it. lol<br><br>Thanks to whoever made this movie, i really enjoyed the ending and i'd love it if you made more.","user":"beefcakebuffstuddington","rank":[54,76]},{"title":"A Regurgitated Mess Of A Film...","rating":3,"date":"17 March 2018","review":"Oh, My God! They just keep getting worse... and worse...<br><br>Can we please have a decent story writer and director give the fans a decent story, one that will do Barker's vision credit(?) <br><br>This story has so many flaws it verges on the ridiculous. Evidently, the humans have grown out of wooden puzzle boxes so the L'Merchant Configuration is no longer a viable gateway to hell. But as The Auditor (Tunnicliffe) says to Pinhead (Taylor), \"At least, we still have the house...\" Hey! Who would have thunk it(?) The Cenobites own property and real estate... No matter how preposterous that sounds it actually gets worse... How do they lure their intended victims through the door(?) They drop them a line via good ol' pen and paper. I wonder if it's the chatterer that runs down the stationers... I hear he loves to meet people and is a terrible gossip; gift of the gab he's got... Why, couldn't they think of a new and imaginative way to contact their victims? At the very least, Tunnicliffe (the writer) could have the message sent on a piece of human skin and tattooed in blood.<br><br>Then when the victim gets inside, the audience is treated to a bit of unnecessary vileness. After The Auditor takes down the quarry's life story, via a typewriter which uses the captives blood as print (finally a bit of imagination) we are introduced to The Assessor (Gulager). He eats the transcripts then regurgitates the remains down a tube, which sprays over three naked women, The Jury. This then leads to the subject being handed to The Surgeon, no matter what the verdict, who proceeds to do a hack and slash job. Then once again, the naked women get splattered... this time with blood. This gives a new perspective on hell's judging process; however there's no rhyme or reason to it, so it just feels like fill in. Even though it's quite nasty to view, it's also quite boring. Tunnicliffe (The Director) doesn't have the skill to create an atmosphere of horror or tension, which helps to make the scene even more tedious.<br><br>One decent thing about this film and story is the Thriller story woven throughout. Two detectives, literally brothers in arms, Sean (Carney) and David Carter (Wayne), along with Detective Christine Egerton (Harris), are chasing a gruesome serial killer terrorising the city. However, the inevitable twist is so obvious it weakens this \"stronger\" section of the film.<br><br>The best part of this whole mess is the acting. Even Tunnicliffe isn't too bad. I think it was a little too much to create a new Cenobite (loosely termed, as he's not really a Cenobite) who has more screen time than Pinhead himself and then give the part to yourself. As for Pinhead, Taylor still doesn't have the presence of Bradley, but he is much better than the last instalment. I will give this to Taylor though... he has sitting down-pat. That's right, we get to see Pinhead relaxing... twice... How Scary!<br><br>There's even an appearance by Heather Langenkamp as The Landlady. Though, if you blink you'll miss her for she's on screen for about the same amount of time it takes you to read this paragraph.<br><br>Do yourself a favour and miss this mess of a film. There are a lot better horror flicks out there... A Lot! If you need your Pinhead fix then, as usual, I recommend cracking open the original flicks.","user":"stephenabell","rank":[25,35]}]