[{"title":"Should be named The Victim","rating":7,"date":"20 March 2018","review":"I found The Clapper to be a very absorbing film, but odd in a number of parts.<br><br>It was a very good study with elements of Educating Rita, when compared to the evaluation of certain long-held ideas: that becoming \"famous\" is desirable, that it is OK to use people for financial gain, and that just because you want something you should have it, regardless of the morals and responsibilities that go with the territory.<br><br>America's obsession with becoming famous, and becoming rich (&amp; famous) for basically doing nothing but being famous, is lightly viewed here, and I can't fathom why the script called for such low intelligence depicted by the characters Eddie &amp; Chris.<br><br>We are all subject to the seduction of money and \"elevating our status\", and certainly the hegemony of America's wealthy is shown to some degree and put to the test. However I felt it wasn't necessary to have Eddie &amp; Chris shown as less to lower average intelligence, and therefore grossly gullible. The greed of getting something for nothing as depicted by the network executives is interesting, as was the price of eventual \"fame\", but I would have been more interested in seeing how persons of average intelligence find it so difficult to earn a living in a country that allegedly worships the dollar and is fixated on making a buck at the expense of \"the other guy\" - more egalitarian countries don't have the socio-economic problems that such predatory behaviour brings. Being used &amp; discarded is distasteful to anyone, and the likes of Hilton &amp; Kardashian cashing in on vapidity is hopefully a trend that will ultimately end, when networks stop trying to sell advertising by elevating such lack of ability to do anything &amp; its hollowness is finally recognised.<br><br>Two marks above pass from me, and I hope to see more of the same in the future - its getting very difficult to find a film that is thoughtful, reflective and interesting to anyone over 25 these days, we don't all need explosions and gun play, and yes we still go to the cinema and pay for tickets - please stop ignoring your most loyal audience !","user":"adrossan","rank":[27,32]},{"title":"Clapper is good!","rating":7,"date":"7 August 2018","review":"The Clapper is an easy watch, and in most reviews it states , this movie doesnt know what it wants to be. It tries to be a satire, it tries to be a romcom etc. Why does a movie have to be one thing? \nThis movie bravely attempts to navigate a love story with crazy media culture as a backdrop. Its a story about 3 honest people Eddie, Judy and Chris in a very dishonest world. I liked the performance of Ed Helms, Tracy Morgan and Amanda Seyfried. The only thing I had a problem was with the end dialogues between Eddie and Judy. \nBut this is a very small, sweet movie which does paints an honest picture of everything wrong with popular culture.\nI think time will be kind to this movie.","user":"sanidasifali","rank":[12,13]},{"title":"The Clapper in a nutshell","rating":6,"date":"14 February 2018","review":"Just finished watching this movie. Even though I was aware of the somehow low rating, I decided to still give it a try, based on the fact that I enjoy watching Ed Helms or Amanda Seyfried - but with both of them playing, it felt like a must. I did not have any expectations, so no dissapointments. Unless you are a die hard fan, trust me that you won't miss any terrible laughs, unexpected plot twists or complex on screen chemistry. See it for what it is if nothing better comes up.","user":"emm_nul","rank":[20,25]}]