[{"title":"Horrible Message for Young Girls","rating":1,"date":"2 June 2018","review":"I put this movie on so that I could clean dishes with my daughter out of my hair. I poked my head in the room to see how the movie was going and if she was watching it. I overheard one of the characters say \" A moment on the lips a lifetime on the hips \" while carrying her ice cream cone. I was appalled. I then sat and watched another few minutes to see if it was just a fluke and nothing more would be said reguarding we lost our body image. A few minutes after that comment the characters manager pulled her aside and said something along the lines of we need you to get exercising because you have to burn off those calories. now this movie is clearly marketed to young girls this is an inappropriate message to be sending to any girl of any age. Absolutely disgusting movie. Stupid plot. I turned it off immediately after that. Do not allow your children to watch this.","user":"laurenschuster","rank":[5,5]},{"title":"It's predictable, cliché and cheesy, but at least has it's heart in the right place","rating":3,"date":"29 November 2017","review":"Lego friends: Girlz 4 life, has loads of issues, especially in the plot. However, it's not really that awful; it just has a lot of problems. First the positives: The animation is very on-point, and is surprisingly kind of fluid. It's not the best CGI I've seen, but it does show quality. <br><br>However, beyond the technical aspects of the movie, like the color palette and the backgrounds, the story is EXTREMELY predictable. We've all heard the 'friends over fame' story before, and Lego Friends: Girlz 4 life does NOTHING new, or interesting with it's story, or characters. The characters are paper-thin, bland, and I could barley tell them apart.<br><br>Another thing I don't like, especially in some kids movies, is that the filmmakers always think that their target audience is stupid, and only like pretty colors, bland characters, unfunny jokes, and predictable stories. Every time the filmmakers do this, they always simplify and dumb-down everything. So they don't put any effort into challenging their audience, or writing original, cliché breaking, interesting, realistic and complex issues, stories, villains and characters, that always encourage kids to think. Sure kids movies don't ALWAYS have to be complex, but they at least have to have quality control and originality.<br><br>That's just my thoughts on the movie. I don't really want to go any further, but I will say I liked the soundtrack, especially the 'Girlz' song, and I will admit despite the lackluster story, I do like how the message is indeed executed very nicely. However, this movie is just a big cliché that does ABSOLUTELY nothing new, or original.","user":"sporeviews","rank":[3,4]},{"title":"Awful","rating":1,"date":"13 April 2020","review":"This burns my eyes, I mean this movie is for kids but this is so bad. Even my sister that is 6 years old hated it.\nThe details are ok but the graphics are seriously terrible. In my opinion it NEEDS only 1 star.\nWhat bothers me most, is how their lips are moving and the words just does not work together. No, this movie sucks.","user":"CrystalDiamondWolf","rank":[0,0]}]