[{"title":"Visuals in Support of Nothing","rating":4,"date":"22 June 2018","review":"Sadly, another well made film by Mickey Keating that is ultimately disappointing (following Darling and Carnage Park and POD - but that was a super low budget first film so the positives outweighed the negatives in that case). Keating has an excellent visual eye, and this film is nothing if not a testament to the skills of it's editing, but it is all in the service of absolutely nothing. And even though I personally prefer films that are intelligent, offer new insights and observations within their genre, and approach their subjects with depth, I can still sit back and enjoy movies that seek only to entertain. And during the first half hour of this film I was willing to cut it a lot of slack, even though it announced its conspicuous lack of depth with the line \"There ain't no why to evil\" and a faceless narrator whose ramblings skirt perilously close to \"crap happens\". But regardless of the \"hook\" the film hangs it's narrative on there is no story to speak of and no characters of any depth or real interest even though many of them are given monologues that frequently serve no purpose except adding to the run-time. Keating is too influenced by other directors so there are extended sequences of figures dancing against black or performing old songs in the white light of a stage spotlight (thank you Mr. Lynch) or too-sleazy characters (a totally unbelievable police officer) who gets to have a lengthy, profanity laced monologue saying nothing worth listening to and punctuated by beating another character (an attempt at Tarantino?). \nPlot? Narrative? Follow-through? Anything??? He doesn't even develop the idea he started with as his hook. You watch the film without engagement, succumbing to frustration that you wasted your time and the director wasted an opportunity to make a good film. And at the end everything dribbles away and we're supposed to see that as clever because the unseen and omnipotent narrator apologizes if it was all \"too ambiguous\". Keating obviously needs to spend more time re-writing and polishing his screenplays (or find himself a co-writer who will push him toward creative AND coherent), but there is still no reason for the slew of improbabilities and impossibilities that litter the film even if the director's excuse would be \"it's supposed to be stylized\", such as a character doused in gasoline who wrestles with another man holding a lit cigarette, before taking out a lighter and using it to ignite even more gas - all without attracting a spark. And tossing the fingerprint-laden metal lighter into the fire. Those fingerprints would remain. Or the fact that the same record album contains stylistically divergent music by completely different artists, or an officer is going door to door at 4:30 in the morning and greets a woman with \"I hope I didn't wake you\". And that same officer's hair (especially if it's a period film as all the accouterments suggest), and the way characters react around a very public crime scene etc etc etc. This film is almost enough to make me give up on Mr. Keating eventually producing a successful film. But I have nothing, if not hope; which is why I turned this on in the first place.","user":"seriouscritic-42569","rank":[10,12]},{"title":"Bad all around (the world)","rating":6,"date":"15 January 2018","review":"So the movie does not concentrate just on one person or one story. It actually feels like short movies put together with the theme of people acting in a bad manner (or being Psychopaths as the title suggests). The movie therefor has some flow and pacing issues, but that comes with the territory. If you have multiple strings and strands that have to make sense themselves but also in the overall picture, that is what happens.<br><br>The acting is good, the editing is good. And if you don't mind there is a lot of violence in it too. There are some surprising elements and if you like darker themed movies, you will like this movie. While you may argue, this movie paints a picture of society and there might be evidence that this sort of evil does exist in the real world, this still is a movie","user":"kosmasp","rank":[10,16]},{"title":"one of the most underrated horror movies of 2017","rating":10,"date":"25 March 2018","review":"I'm fan of mickey keating (i really like POD, loved DARLING and enjoy CARNAGE PARK) so in his new movie PSYCHOPATHS have a bad score and critics but in my opinion, this movie is great. not boring or trash as all.<br><br>this movie is so much of tribute the Giallo horror style (some Dario Argento films) to has many visually stunning and colorful cinematography mix in the 80's slasher movies with many difference characters to kill the victims.<br><br>in my opinion. this movie is visually stunning, insane editing, beautiful cinematography, all of the great performance from many actor and actress (ashley bell is so insane performance! ), the great score and soundtrack.<br><br>10/10","user":"Mr-Player_Noob","rank":[7,16]}]