[{"title":"Rushed with No Effort","rating":4,"date":"3 March 2019","review":"Saint Judy needs a miracle to get a good review. Monaghan plays a plucky activist public defender who switches jobs and moves to Los Angeles for some unknown reason. She has ten years as an outstanding criminal defense attorney in New Mexico and on a whim goes to represent detained immigrants in California. Her boss (Alfred Molina) recruits her for her top notch trial skills and likes her aggressive representation fo clients. Her impressive skills she used against prosecutors resulted in a 36% conviction rate. We don't even know why she wants to switch practices and represent immigrants, but hey, she does it. Because Judy is such a great fighter against the soulless government, Molina assigns her loser cases and instructs her to get clients to surrender and voluntarily return home. This is so she can \"make friends\" at a migrant detention center.<br><br>In other nonsense, we learn Judy wanted to come to LA so her son can be closer to his father, whom we assume she divorced because he was a workhorse who did not spend much time as a dad. Throughout the film, Judy tries to prove her ex-husband that she can raise the child all by herself. She independently raises her son while constantly asking her ex-husband for help and blaming him for souring his personality.<br><br>Does the premise so far confuse you? Good, because the contradictions twist further in the main plot. Judy resists her boss's insistence on leaving an Afghani client to voluntarily depart and forget her case. She is horrified to discover she is catatonic from drugs and has a shot at asylum. Without any knowledge of immigration law, she fumbles a few times and makes mistakes while trying to help her client out.<br><br>Molina finds out about Judy's amateur lawyering at the detention center and does not like her rebellious work. He starts to ponder his mistake of hiring someone known for fiercely opposing the government. Judy is fired, but she trucks along with her own firm. She then takes on 267 asylum seekers and hires a multilingual unemployed rich boy to help her out.<br><br>After a stupid montage of Judy abusing her clients to do free labor for her, Judy releases the Afghani client and applies for asylum. A fight with her family, then we get to the big day: the asylum hearing. Judy obviously sucks at her work and makes several errors during the hearing. The judge and Common the DHS Lawyer ridicule her for being such a newbie. Nonetheless, they congratulate her hard work and after a long, emotional speech, the judge denies asylum.<br><br>Judy files an appeal and suddenly gains the support and upmost respect from her boss and her ex-husband. They skip the BIA entirely and go straight to the 9th Circuit (note, I am an immigration lawyer, this movie got too many things wrong to list). On appeal oral argument day, Judy is accompanied by her boss, her ex-husband, her son, and a 100 of her clients' cheers. Judy shows the Circuit Judges who's wrong and the film cuts to an abrupt halt in the middle of her argument. \"Judy Wood is a hero, yada yada whatever\" text rolls. Post-credits has a montage of pro immigration stuff without even proving the people behind this mess understand immigration law at all.<br><br>As you can see, this movie is a walking contradiction and feels like a blind Chinese man trying to find directions through French Sign Language. Save your money and donate to the ACLU so we can get this embarrassment banned by law.","user":"haddyrikabi","rank":[22,40]},{"title":"Virtually all these 8-10 star reviews are by accounts created solely to upvote this","rating":1,"date":"1 June 2019","review":"Firs of all let establish some facts: The US has LONG, for decades and decades, accepted more legitimate refugees (as defined by international law, human rights treaties and the UN) per capita than the EU average.\nUsing examples of people who, the full facts show are NOT refugees by those standards is bogus. The US does deny refugee status to a lot of people because in the US (and Europe) 95% of refugee claims are simple economic migrants that are NOT actually political refugees. By some estimates less than 3% of people attempting to claim \"refugee\" status fit the legal UN definition of refugees.\nThe 97% fake claims are generated by money grubbing lawyers, like \"Saint Judy, \" who do everything they can to subvert legitimate immigration laws and controls.<br><br>As far as women refugees, the data show that over 90% of political prisoners worldwide, 90% of victims of state torture, and over 90% of persons killed by authoritarian regimes are MEN. Saint Judy's assertion that women are at more risk is a bald faced lie, and one on deep contrast to stats from the UN, Amnesty international and all the major human rights groups<br><br>Lastly it is pitiful -- and telling -- that virtually all the reviews are single use accounts. That is a sure sign of SHILLING, which tells you about how bad this film is, and about the lack of ethics and and mendacity around this subject.","user":"random-70778","rank":[33,69]},{"title":"She isn't a saint, but she acts like one","rating":9,"date":"14 November 2018","review":"Saint Judy (2018) was directed by Sean Hanish. It's a narrative film, based on the life of Attorney Judy Wood, played by Michelle Monaghan.<br><br>Wood is an immigration attorney who truly believes that the U.S. should welcome, not reject, people seeking asylum. She fights for these people--particularly women--and often saves them from deportation and death.<br><br>The problem is that this kind of commitment requires her to neglect other aspects of her life. Personal and financial matters keep pulling her in one direction, while the work she does pulls her the other way.<br><br>The plot of the film consists of Attorney Wood moving toward the moment of truth in a deportation hearing in the Federal District Court.<br><br>The acting in the movie is excellent, and the message is profound. I think this film is good enough to recommend it to everyone. If you're an attorney or a human rights activist, it's a must see. It will work well on the small screen.<br><br>We saw Saint Judy at Rochester's excellent Little Theatre. It was shown as part of the Rochester High Falls Women's Film Festival, where it won the audience award for Best Narrative Film.","user":"Red-125","rank":[20,42]}]