[{"title":"SHE MUST GO!!!! PT4","rating":8,"date":"29 March 2018","review":"Digimon was basically my childhood, Digimon Tri brought me a lot of joy, from nostalgia and the fact that I actually enjoyed all of the parts of Digimon Tri. That being said, I really did enjoy a whole lot of Tri 5 Co-Existence's story, but I did really dislike a certain thing. I'll start with what I enjoyed about this. I enjoyed the struggle between the Digivolved Meicoomon, Raguelmon , DigiDestined and their partner Digimon, Alphamon and Jesmon. Later on this fight, most of the DigiDestined's partners turn back into their weaker forms because of an attack from Alphamon, leaving only Omnimon with Tai riding on him. The next thing I enjoyed but felt really bad for was Himekawa's struggle to find her former partner, Tapirmon. Himekawa was wandering the digital world in search for Tapirmon but she ends up within the Dark Ocean, which has played a role in corrupting and empowering most who visit, and appears to drown within the Ocean. The last thing that I really loved was the ending. The battle resulted in a fissure opening and Tai and Nishijima fell into it. Then Kari's despair for the loss of her brother caused her partner to Digivolve into a more malevolent form of Ophanimon, Ophanimon Falldown Mode. Next Raguelmon merges with Ophanimon Falldown Mode to become Ordinemon. The digital world then begins to fuse with the real world. Everything ends with Matt picking up and putting on a fallen Tai's goggles and convincing the other DigiDestined to keep on fighting. <br><br>Now the specific thing I disliked. As stated with the other parts of SHE MUST GO, Meiko. Throughout most of Digimon Adventure Tri, Meiko wouldn't stop whining and complaining. This continues in Tri.5. Back in the real world, Meiko would only wallow in her own sadness and even while her friends, the DigiDestined, tried to console her, she would only still wallow in her sadness. Throughout most of the Tri series, she wanted Meicoomon to die, because it was defective. In Tri 5. it was revealed that Meicoomon was born with a fraction of Apocalymon's data, which is the reason Meicoomon acts the way it does. Meicoomon was also sent to Meiko in hopes that her love and support would suppress Apocalymon's data. But she didn't after seeing her partner act defective, the love and support started to disappear and was replaced with Meiko wanting to kill her partner, because she was defective. In the battle with Raguelmon, she managed to convince Tai and Omnimon to kill her partner, which basically ended with her partner becoming even stronger and more angry. So as stated previously, SHE MUST GO!!!!!","user":"ashah702","rank":[0,0]},{"title":"Merely Adequate Set-Up With a Fantastic Cliffhanger","rating":6,"date":"23 November 2017","review":"After watching the penultimate chapter of \"Digimon Adventure Tri\", any enthusiasm that remains for the series can best be described as reserved. Thankfully, it's a marked improvement over \"Loss\", but not much else. With the exception of a thrilling climax and shocking denouement, \"Co-Existence\" is a merely adequate installment that continues to exhibit the biggest blemishes of this series. <br><br>The first half of \"Co-Existence\" has the expected task of setting the stage for the final conflict. The sense of crisis is uneven. Too many promising story elements, such as persecution from other people, are given short shrift and even the intended \"calm before the storm\" feel is never truly achieved. There are some great moments, such as the surprisingly attentive sequence of the kids calling their families, and the partner digimon have an uplifting presence throughout. Yet, this situation is perfect for evoking introspection and a strengthened sense of comradery, and very little of that is realized due to preoccupation with one unwelcome matter.<br><br>By now it has become abundantly clear that the people behind these movies are stubbornly insistent on the significance of newcomer Meiko, and for seasoned fans, which this production is clearly targeted at, tolerance of this has reached its limit. Back when she was introduced in \"Reunion\", I was already skeptical. That movie already showed difficulty with balancing a large group of characters, and adding another face to the mix is a bafflingly bone-headed decision. How is it that the writers didn't realize that the primary anticipation for this series was catching up with beloved characters, and instead took a route that would naturally conflict with this obvious objective? So, with Meiko and her concerns sucking all the oxygen out of the room, very little room is made to allow the other members of the group to contribute anything substantial. This makes two movies in a row that have essentially been hijacked by her. Meiko is, quite simply, the single biggest misstep the film series has made thus far. It's no coincidence that \"Reunion\" and \"Confession\", the two best entries so far, are also the ones where she was least intrusive.<br><br>Additionally, \"Co-Existence\" continues the series' trend of putting a more unsettling spin on familiar genre traits. The notion of a digidestined serving as a stabilizing influence for a digimon partner is an interesting one, but the calling into question of the integrity and motives of the \"forces\" that chose them in the first place is less than stellar. \"Tri\" has had much more success in exploring the question of what happens to child heroes when they grow up, so seeing it devote more time to the overplayed deconstruction thesis of \"nothing is trustworthy!\" is disheartening. However, this does call into question who the real villain is in this story, which hopefully will see real payoff in the finale. <br><br>Daigo and Maki consistently arrest the attention, but \"Co-Existence\" makes criminal underuse of the revelations from the previous episode. Imagine how much more powerful the movie could have been had it focused on the group contemplating advice and warnings from Daigo based on his obviously pertinent experiences, rather than continuously pressing the audience into feeling bad for Meiko.<br><br>Yet, for all this frustration, \"Co-Existence\" manages to sprint to the finish with a 4-way battle royale, where there are no real allies and everyone clashes with everyone. Omnimon gets thrown into the fray (and it's really about dang time!), though it's disappointing to see the other mega-level digimon get so casually knocked out of commission. Then again, the animators probably weren't up to the task of handling that many combatants. There's great tension throughout this battle, and I found myself consistently concerned about the outcome. Everything concludes with two big shockers, although I only found the second one truly effective. It kicks off the grand-scale crisis that the rest of the movie perfunctorily establishes and gets the audience primed for the climax. Other positive points include some creepy moments from Dark Genai, solid humor from Joe, and a pleasant, contemplative closing theme that perfectly captures the feel that the previous installment failed to. <br><br>Full judgment of \"Co-Existence\" is probably best reserved for after the final chapter, though by now it's all but confirmed that \"Tri\" will never achieve its full potential. It would be a minor miracle for everyone to get proper closure to whatever character points they've been allowed along the way, and it's clear that some longstanding questions, such as Kari's connection to the World of Darkness, were never going to be resolved. From a franchise infamous for dangling plot threads and untapped possibilities, this is saddening. All that can be hoped for now is an appropriately climactic finish with a moderate amount of emotional appeal, but to achieve even that the writing staff will have to swallow their pride, relegate Meiko to a peripheral presence, and focus on at least two members of the original team. Frankly, I'm not holding my breath.","user":"jephtha","rank":[0,0]}]