[{"title":"Belaya Vorona","rating":8,"date":"18 March 2019","review":"The film's title derives from the Russian phrase \"belaya vorona\", or \"white crow\", meaning an outsider or nonconformist, a person who stands out from his or her contemporaries in the way that a white crow would stand out from its black fellows. The \"white crow\" of this film is the Russian ballet dancer Rudolf Nureyev, a man who had difficulty conforming to the official Soviet system, either in his artistic life or in his personal life. (He was gay at a time when this was neither lawful nor acceptable in Soviet society).<br><br>Nureyev shocked the world of ballet when he defected to the West at Le Bourget airport, Paris, in 1961, and the film is built around this incident. His decision to defect was, apparently, a spontaneous one, taken when the Communist authorities, irritated by the fact that he had spent much of his time in Paris in the company of Western intellectuals and concerned by rumours that he had been seen in a gay bar, decided to send him back to Russia rather than allowing him to travel with the Kirov ballet to London, the next leg of their tour. Scenes of Nureyev's stay in Paris are intercut with flashbacks to his poverty-stricken wartime childhood in the provincial city of Ufa and to his time as a ballet student in Leningrad, as St Petersburg was then known.<br><br>The film was directed by the well-known British actor Ralph Fiennes, clearly a ballet enthusiast. Fiennes also takes an acting role as Alexander Pushkin- not, of course, the classic Russian author but Nureyev's tutor at the Kirov Ballet. This was, I felt, one of two outstanding performances in the film. Pushkin emerges not only as a visionary who spotted Nureyev's talent when many did not but also as a sympathetic father-figure who provided the young dancer with a kindness and understanding that was otherwise lacking in the rigid, inflexible Soviet system. The other great performance, of course, comes from the young Oleg Ivenko as the conflicted Nureyev himself. On the one hand he is held by a love of his Russian homeland, the land which contains all he knows and all that he has held dear- his family, his friends and his mentor Pushkin. On the other hand, he is drawn towards the West, not only because of the greater intellectual freedom which it offers but also because of a feeling that it is only there that he can fully realise himself as a dancer.<br><br>I must admit that I am not a great balletomane myself; I have been to the ballet on only a handful of occasions in my life, and never saw Nureyev dance except on television. Yet there are some films which have been good enough able to hold my attention even though they are centred upon activities in which I would normally take little interest. Like most Britons, I know little about baseball, yet I was enthralled by \"Eight Men Out\" and \"Field of Dreams\". I probably know even less about wrestling, but that did not prevent me from admiring the more recent \"Foxcatcher\". \"White Crow\" comes into the same category. Those who love ballet will doubtless be enthralled by it. Even those of us who do not will be able to see enough in this movie to understand the enthusiasm of those who do. And both groups will join together in their appreciation of the human drama which lies at the heart of Rudolf Nureyev's story. 8/10","user":"JamesHitchcock","rank":[69,94]},{"title":"The most famous political defection of all time","rating":8,"date":"2 September 2019","review":"A 'white crow' in the Russian idiom is someone who stands out from others because of their appearance or behaviour. Rudolph Nureyev was, and for many still is, the white crow in the world of male ballet dancers. With extraordinary athleticism and sharply chiselled features, he defied gravity and glamorised male dancing. He also managed to make the KGB look flatfooted when he famously defected to the West.<br><br>We first see the young Rudolph as a six-year old child prodigy plucked from a poor background. The film flashes-back to these early scenes several times to remind viewers that despite his majestic aura on stage, he came from humble origins. The adult Rudolph (Oleg Ivenko) was a volatile personality both on and off stage. KGB spies watched elite dancers closely because ballet was a major cultural propaganda tool at the height of the Cold War. Rudolph was known to praise creative freedoms in the West and his secret sexuality was seen as a potential source of political embarrassment.<br><br>Most of the film builds the context in which Rudolph would commit what Russians believed was the ultimate act of treason. Barely enough camera time is devoted to his ballet lessons and performances, but what is shown will please devotees of the artform. A major sub-narrative is the live-in mentoring by his teacher Pushkin (Ralph Fiennes) and his relationships with Pushkin's wife Xenia (Chulpan Khamatova) and socialite Clara Saint (Adele Exarchopoulos). Rather than meaningful affairs, these relationships show Rudolph's willingness to exploit anyone who could advance his dancing career.<br><br>The film's modest tension curve spikes a few times during Rudolph's fiery temper tantrums, but it jumps steeply during the climactic defection scenes. The camera almost neurotically switches from close-ups on the faces of Russian spies, American observers, Rudolph and Clara, all while in the transit area of a French airport. When Rudolph is stopped from boarding a flight to his next performance, the KGB falsely tell him he has been summoned to a gala performance for the Kremlin. He is thrust into a vortex of disbelief, terror, and the realisation that if he seeks political asylum he will never set foot again in his homeland nor see his family.<br><br>Despite its uneven pace and meandering narrative arc, this powerful non-fiction storytelling is backed up with excellent acting performances and cinematography. The Cold War tensions are palpable and the political battle lines drawn clearly. You do not need to be a ballet fan to appreciate this film.<br><br>Director: Ralph Fiennes\nStars: Oleg Ivenko, Ralph Fiennes, Adele Exarchopoulos, Chulpan Khamatova","user":"CineMuseFilms","rank":[6,6]},{"title":"What a legend!","rating":6,"date":"21 June 2019","review":"A biopic about Rudolf Nureyev: gifted with an exemplary technique, he is considered as the greatest classical dancer and as one of the greatest choreographers.<br><br>The actors <a href=\"/name/nm8757483/\">Oleg Ivenko</a> and <a href=\"/name/nm0451122/\">Chulpan Khamatova</a> are excellent whereas <a href=\"/name/nm0000146/\">Ralph Fiennes</a> is magnificent with a masterful interpretation of Alexander Pushkin, with restraint and sensitivity. He literally impressed me! Nevertheless, as a director, <a href=\"/name/nm0000146/\">Ralph Fiennes</a> is less convincing. He excessively insists on the haughty and unpleasant character of Rudolf Nureyev, to such a point that we almost want to slap him. In addition, the manifold alternations between the trip to Paris in 1961 (the present time) and the flashbacks (his childhood in a poor family and his debut as a dancer) are almost disturbing. I would have appreciated that <a href=\"/name/nm0000146/\">Ralph Fiennes</a> develops these different points: 1) An evocation of the trip to Vienna in 1959, formerly Western Europe, followed by a formal ban on all abroad travel formulated by the Russian Minister of Culture, which could have explained, without justifying, the oppressive and stifling behavior of the KGB members, in Paris in 1961. 2) A less dark presentation of the Soviet Union reduced to KGB members as obtuse as omnipotent. Indeed, at the beginning of the 60s, the Soviet aura was supreme: culture, science, geopolitical influence, ... For instance, the dramatic Nureyev's defection at the Paris Le Bourget Airport happened just two months after the Bay of Pigs invasion which was a significant failure for Kennedy's US foreign policy and a strong reinforcement of the relations between Cuba and the Soviet Union.<br><br>As a synthesis, the movie is excellently interpreted but the realization is slightly muddleheaded. 6/7 of 10.","user":"FrenchEddieFelson","rank":[23,35]}]