[{"title":"Why all the bad reviews??","rating":8,"date":"3 November 2016","review":"I can't believe the low score for this movie and the bad reviews complaining about the effects. Yes, there's a lot of CGI in this movie but no more than you see in the Avengers or Star Trek. And yes the storyline is a bit weird at times, but it's an Asian fantasy movie based on a centuries old fable so things are gonna be a little different. I thought some of the action scenes were amazing and there was some funny moments and some great acting. Grab some popcorn, turn your brain off for 100 minutes and sit back and enjoy the show without overanalysing things and you'll have a good time. Can't wait for the sequel...","user":"VanillaHammer","rank":[50,66]},{"title":"I think I broke my brain!","rating":5,"date":"21 December 2016","review":"I'm at a bit of a loss as to how to review this movie. It kind of defies a normal review that talks about acting and effects and so on. Instead, as you a re watching it, any such notion of critical analysis pretty much goes out the window.<br><br>See, League of Gods (LoG) is an Asian fantasy and, to our western eyes, used to the likes of Lord of the Rings and even the more recent Warcraft, it doesn't make any sense whatsoever. There is little in the way of story or character development. You are plunged straight into it and given little to establish either the setting or the players.<br><br>Once you accept that, and simply let the movie wash over you like a mad tide, you'll get more enjoyment out of it.<br><br>But when I say tide, I really mean tsunami in this instance. The movie is relentless in its madness, throwing ever more craziness at the audience and not caring if you like it or not. It's an onslaught of visual excess that rarely lets up and can be a little exhausting to watch.<br><br>That said, I did find it a refreshing change from the usual stodge that Hollywood churns out these days.<br><br>So...will you like it? Well, it depends on your personal level of acceptance of crazy. It's exactly the kind of insanity that Jack Burton, from Big Trouble in Little China, would wax lyrical about...<br><br>\"Giant dancing crabs, farting babies, some guy flying around with burning wheels on his feet and people roaming the skies in stone Tetris ships. I have no idea what's going on here Jiang, but its clear you people have a problem on your hands and old Jack is here to help you sort it out by crossing the eyes and punching some teeth. So why don't you pick up your talking pot plant and we'll go deal with the snake lady and her minions and set matters to rights!\"<br><br>Honestly, that imagined speech should tell you all you need to know about the movie to make a judgment as to whether you''l find it enjoyable.<br><br>I rated it a five primarily for the craziness and the gorgeous visuals. The CGI is extremely weak overall, but somehow that just adds to its charm. It isn't higher because the story is poorly presented and the characters have little more than token personalities. Acting is acceptable, in so much as there isn't much need for decent acting because it is primarily action.<br><br>All in all, however, I feel this was an opportunity missed. It clearly wanted to be a Chinese Lord of the Rings, but without the world building and steady build-up it turned out more of a fantasy Transformers.<br><br>One nice part was the music, by John Debney, which elevates the movie considerably. However, even his efforts can't make it more than a passable effort.<br><br>My best recommendation is to view this film with your mates, a large crate of beer, and to just treat it as a crazy comedy. You'll get more out of it that way.<br><br>SUMMARY: Crazy Chinese fantasy epic that espouses style and visuals over substance. Fun to watch for the craziness, but let it wash over you rather than trying to understand what is going on. Otherwise, it is middling at best.","user":"Rob_Taylor","rank":[11,13]},{"title":"What a fun movie !","rating":9,"date":"28 February 2017","review":"I'm surprised to read so many low ratings on this movie, this is my favorite movie to date in this genre, I love Martial Arts movies , especially fantasy ones and this has everything you could possibly want. The characters are creative, great costumes/make up, lots of fun CGI, cloud cities, immortal warlord bad guys, evil demons, out of this world kung fu, and action action action. Wuxia movies are a ton of fun, not to be taken too seriously, after all they're literally out of this world stories about demons and heros. If you liked The Serpent &amp; the White Snake, or Monkey King, True Legend, The Four series, or the Tai Chi Hero / Zero, then you'll love this.","user":"Bullibuoy","rank":[21,30]}]