[{"title":"what the hell did i watch","rating":1,"date":"8 April 2019","review":"I love bad movies, and I don't say this a lot, but this really was one of the worst movies I ever saw (and I've seen many Steven Seagal movies or Z-movies).<br><br>If he hadn't written it himself and some decent write would have written a story based on the same premise, than it might have been decent. But he wrote it himself, and he makes his character to be something like a best enlightened person in the world..\nThe cinematrography of the movie is pretty good, but the acting is really crap. The story really makes no sense and a lot of times the scenes don't actually really have anything to do with the story itself, just primairily to show Seagal off.<br><br>There is so much wrong with the writing of this movie, it's just ridiculous. As I said, if only they hired a real writer it might have been something.\nThere is only one pretty good martial arts scene in the movie, and that's the one without Steven Seagal, only the two asian guys fighting each other..\nThe end fight isn't even remotely interesting, with a real movie there would at least be some setback for the main character, but nope, Seagal just flaps his hands a bit and the end boss is dead.. And then it ends in one boring useless monologe..<br><br>Only thing I can think of why people would give this movie anything above a 4 is because they worked on it themselves..\nHe talks about humility, but this movie clearly shows he doesn't have any himself, it's all ego, nothing but seagal ego.. and that get's very annoying..","user":"andrew_jakobs","rank":[10,12]},{"title":"Damn Steve!","rating":1,"date":"17 February 2019","review":"Holy smokes. Could this movie be any worse? That was rhetorical, not needing an answer. I'm a long time Stephen Seagal fan from way back. I keep watching everything he does because of it. I guess so I can always say in a Stephen Seagal conversion, \"yup, seen that one too\". As time has gone on, I keep getting more and more amazed just how bad this dude has become. It's comical actually but he keeps turning out these atrocious flicks, keeps raking in the bucks from people who will continue to watch no matter how bad it gets. Hell, he even got a couple of 10s on this movie in here! That's just like, \"woah\". The more movies he makes, the more disjointed they become. He probably does one of these flicks like in a day, then walks off with a boat load of cash, flipping everyone off as he walks into the sunset. His fans will always love this dude. Hell, I still love this dude, but I sure don't know why.","user":"fbmike","rank":[16,21]},{"title":"The start of a return to form for Mr. Seagal ?","rating":6,"date":"11 March 2019","review":"The late '80's and '90's saw the rise - and fall - of 2 credible action heroes: Jean-Claude van Damme and Steven Seagal. They also both made mostly crappy films after that. Seagal had his last highlight with 2001's \"Exit Wounds\" but that same year we also saw the terrible \"Ticker\". In 2004 Anthony Hickox (Warlock: The Armageddon, Hellraiser III: Hell on Earth) directed him in \"Submerged\" which was rumored to be an unofficial \"Under Siege\" sequel. It turned out to be another terrible and cheap production with Seagal sleepwalking through the script that made no sense at all.<br><br>Since then Steamroller Productions released dozens of cheap and uninspired action films with Seagal having limited screen time, often dubbed, stunt men that looked totally different, boring shoot outs with cheap CGI blood, and so on.. In 2016 he even managed to have 7 (!!) films released, one even worse than the other.<br><br>\"Attrition\" is totally different. The production values and cast are good and the story is beautifully shot in Southeast Asia. And Seagal does act for a change. There are a couple of decent martial arts scenes where the stuntman is very limited. The story isn't heavy on action but has a message (human trafficking) and it includes elements of \"Taken\" and \"The Expendables\" in the last 20 minutes.<br><br>The downside is the use of obvious CGI blood and effects. It's a breath of fresh air to see the aikido master try again for a change, something that wasn't the case is his latest 20 films or so.<br><br>\"Attrition\" is just an average film but worth a look, especially for fans of his earlier work. He will never make another big budget action classic like \"Under Siege\" but this is a step in the right direction.","user":"homecoming8","rank":[7,8]}]