[{"title":"SHE MUST GO P.3","rating":8,"date":"27 March 2018","review":"As stated in parts 1 and 2 of the \"SHE MUST GO\" installations, Meiko is the worst character in this anime. I went in expecting a lot of nostalgia and i got that, but with a grain of frustration. It's not incredibly hard to watch, but she makes it less fun and more like a chore. Every time that I hear her threaten Meicoomon, I feel resentment. I can't stand the thought of someone trying to kill their best friend just for being defective. Although this was a great addition to the story, Meiko somehow manages to take away from the development. Every time we move forward in the plot, she just has to draw us back down with her guilt. Killing your digimon is only causing more rage in said digimon. They never truly die. They are always reborn. She's spent years with Meicoomon and still doesn't understand her. This is why I am saying once again, MEIKO MUST GO!","user":"emaristevens","rank":[0,0]},{"title":"Unfocused and Shallow, this is an unwelcome downgrade so late in the series","rating":6,"date":"8 May 2017","review":"It may have been unreasonable to expect \"Loss\" to equal the excellence of \"Confession\", but I wasn't prepared for such a sloppy product. The fourth chapter in the surprisingly edgy Digimon film series fulfills some personal, long-held fears and saps a good deal of confidence for future installments. \"Determination\" may have been moderately disappointing, but this installment falls short of it in every way. <br><br>Far and away, the most severe letdown of the film is Sora. Marketed as the focus of the episode and receiving a solid foundation from her role in the previous chapter, Sora seemed primed to evolve as a character. Considering her sparse involvement, this was exceedingly welcome, and a something I personally anticipated greatly. Unfortunately, shallowness, contrivance, and obviousness all pervade her story, with nearly every development and action occurring out of necessity rather than thoughtfulness. The mending of her relationship with Biyomon is consistently artificial, and the trigger to the latter's new evolution utterly perfunctory. Sora had the makings of a caring, compassionate individual that often neglects her own needs, and this may have allowed the character's true concerns and desires to show through were it not for the scattershot narrative. Furthermore, despite hints of a proper exploration, the dynamic between her, Tai and Matt is shortchanged, which, at least for now, is a colossal slap in the face to everyone who wanted proper closure on the matter after watching \"Digimon 02\".<br><br>Beyond that, there's a lot going on. I wrote concerning the second film that \"the numerous subplots never manage to cohere into a streamlined narrative\". Such an issue resurges here, full force. The early sequences of the kids reconnecting with the in-training digimon contain some expectedly cute moments, such as Tanemon's initial reaction to being picked up, but lose steam very quickly. Subsequently, everything devolves into a string of haphazard events and broken conversations. Interesting moments do sporadically come about. For example, Kari's comments on accepting the new condition of the digimon partners, while a little inconsiderate, creates the possibility in the audience's minds that this loss of memory may not be reversed. <br><br>It would be an understatement to say that the film is largely saved by revelations on the larger scheme. Not only are the purposes of recent events clarified and Hackmon given his first speaking role, but light is shed on Namikawa's history and motivations. The opening flashback, though done in an odd silent newsreel style, is intriguing, and the scene of Namikawa reuniting with an amnesia afflicted Tapirmon is arguably the best one in the film. Here is an individual so consumed by obsession that she cannot accept the reality in front of her; it's poignant as well as it is frightening. <br><br>With the advertised inclusion of Machinedramon, MetalSeadramon, WarGreymon and MetalGarurumon, as well as the introduction of Phoenixmon, one might at least expect the action to thrill. Sadly, such a gathering of heavyweights only makes the resultant dud of a climax truly perplexing. MetalSeadramon gets dispatched without much resistance (his final fight in the show is better), and Seraphimon is greeted with a whimper. Phoenixmon suffers most perceptibly, with a \"puffy\" looking rendition that is notably inferior to the detailed depictions from the promotional poster and card game artwork. The only combatant that manages to impress on some level is Machinedramon. Though reduced in size, the animation quality for this version is impressive, and he even shows off a nifty new \"laser tail\" ability. <br><br>Two-thirds of the way through the series is an unacceptable point for such a misstep to occur. \"Loss\" provided the opportunity for progress on character points introduced in the first two entries, and looking back at the series' irritating habit of hastily dismissing these only exacerbates the frustration. When will we see actual coverage for Tai and Matt's concerns, or Izzy's crush on Mimi? Four episodes in and the writing staff, for all its affection for the franchise, still hasn't figured out how to balance such a large roster of characters within the given format, and with only two chapters left the margin for error has all but disappeared. In the end, the title \"Loss\" only refers to the squandered opportunities to truly give this much anticipated project momentum.","user":"jephtha","rank":[1,2]}]