[{"title":"Not as bad as people make it out to be.","rating":7,"date":"1 June 2017","review":"The internet is a funny place... it seems to be filled with people who have graduated with 5 Ph.Ds. and clearly seem to be smarter than everybody else (thousands of astronauts and astrophysicists on IMDb apparently). One star rating? Come on... Clearly, you haven't watched enough films to know decent from terrible.<br><br>I watched this film without having heard of it (no trailers, spoilers or anything). I'm a sci-fi fan and thought this was a good watch.<br><br>I found the characters to lack depth and their actions were questionable at times but the plot was believable and the acting decent. Special effects were good and made the movie believable in my opinion. The movie was well shot and I thought the scenes with the creature were pretty cool.<br><br>I don't get how people even compare this movie to \"Aliens\"; it's nothing alike. Overall, I thought it was pretty good.","user":"emailbox911","rank":[196,261]},{"title":"Good looking movie with unbelievable plot and mediocre characters","rating":4,"date":"23 March 2017","review":"The Good:<br><br>Believable, big budget special effects. Some decent jump scares and squirm-in-your-seat horror.<br><br>The Bad:<br><br>The characters were generic and boring. The acting was often spotty and not consistent with the situation (more poor direction than bad acting I think). The Martian creature came from the soil on Mars where it had to hibernate to survive, yet it could survive freezing cold, burning heat, no oxygen, space vacuum and everything else the crew could throw at it. And it pretty much ate everything (including cooling fluid). Lazy science to aid lazy plot sequences.<br><br>The Ugly:<br><br>Unrealistic behavior from professional astronauts and scientists. Every scene seemed to be a result of a poor decision putting the crew at risk. Everything seemed predictable and there was little-to-no tension.<br><br>Unlike the brilliant Alien - where you felt the protagonist (Ripley) and crew did everything right, yet fell victim to a horrifyingly believable alien (except for Ripley and the cat of course) - the crew in Life pretty much seemed to randomly do things, forget things, then remember things, and generally make the worst of the situation, while terrorized by the \"super-alien-jellyfish\" thing. I spent most of the movie thinking \"wait... what? why?\". Mediocre film from a mediocre Director.","user":"djgoutsmart","rank":[489,724]},{"title":"People didn't like it because the creature didn't seem realistic","rating":9,"date":"14 August 2017","review":"I've been reading reviews of this movie and it seemed many people didn't like it because they thought this carbon/water based creature was unrealistic. Nothing can survive the vacuum of space, extreme cold and extreme heat, no water and food for years, etc... but there IS an organism that can do that. It's called a \"tardigrade\" - this little creature can survive lethal amounts of radiation, 1 degree above absolute zero temperature, it can turn its body into glass to survive extreme dehydration, it can survive the vacuum of space and the pressure of many hundreds of meters underwater and survive above boiling temperature.<br><br>Coincidentally, shortly after learning about this fascinating creature I came across the movie \"Life\", and that's probably why I love it so much. What would happen if a hostile alien with the durability of a tardigrade and a lethality of a xenomorph decided to hunt us down? I was thrilled at the prospect! Although some will fault some of the poor choices of the characters, I found them on par with the choices of \"Alien:Covenant\" characters, but I wasn't going to fault the movie because the premise intrigued me so much. I for one, found it an exciting and thrilling movie!!","user":"tony-clifton","rank":[168,244]}]