[{"title":"Hotel Mumbai","rating":10,"date":"10 February 2020","review":"Movies like Hotel Mumbai always fascinate me because I always wonder how I would react if I was in the center of an attack. Would I keep my calm and help, or would I freak out and endanger everyone? This movie Directed by Anthony Maras, in his directorial debut, has a number of characters that grapple with that idea. Hotel Mumbai is a story about one of the locations that was attacked during the 2008 Mumbai Terrorist attacks. We learn the story of the heroic efforts of the staff of the Taj Hotel attempting to save almost 100 lives during the attack. The set up is simple, you have the calm before the storm, the attack, and the response by unassuming heroes. The execution of the direction of this movie is extremely high. The acting, the camera work, and the score were all top level and it really made this an extremely intense, but fulfilling movie. Stock Watch Stock Up - Dev Patel always is great in anything he is in: see Slumdog, or the Newsroom, or Lion. So it was no surprise to see him as the heart of this movie and carry a lot of the emotional weight of the story. He straddles the balance of helping all the victims, while simultaneously trying to make it home alive to his family. I hope he starts getting more mainstream roles because I think he is a star. He keeps his composure the entire time and keeps the audience calm in a way as well. It is really a fantastic role. Stock Neutral - Armie Hammer was as solid as he always is in his acting roles. However, he just did not have an insane amount to do in this one. Every scene he was in though was great and was brought more to life because of his presence. *A couple other tidbits - Why is Nazanin Boniadi not in more movies? She is always great in anything she is in so I hope to see her more often. - This movie is rated R for a reason, it is very intense and very graphic. Hard to watch at some points. - The villain in this was extremely creepy and has stuck with me for sure. This is a movie that is very hard to watch, but it is worth watching. These attacks were extremely disgusting acts, the acts of heroism however show the best in humanity. I am happy this movie exists and I just hope people can watch this and learn something about themselves from it","user":"MR_Heraclius","rank":[49,71]},{"title":"no any tribute to our brave soldiers like sandeep unikrishnan","rating":1,"date":"1 April 2020","review":"This movie is truly seems like movies but it titled as based on true events....","user":"manuranjansingham","rank":[7,9]},{"title":"Meant just to promote Taj Hotel","rating":1,"date":"2 December 2019","review":"The unrealistic movie merely serves to promote Taj Hotel &amp; prove that Taj Hotel staff can sacrifice their lives for the sake of their customers which is not in sync with the real incidents. Ridiculous distortion of reality.","user":"alwaysrit","rank":[55,102]}]