[{"title":"Official Secrets","rating":10,"date":"11 February 2020","review":"If you want to become freshly enraged about the massive war crime we call the Iraq war, go see this film. Perhaps the most emotionally distressing aspect is the underlying knowledge that absolutely nothing has changed on any level of power, in any way, since this extraordinary deception.<br><br>Bush and Blair continue to be celebrated in high society.<br><br>Intelligence agencies continue to illicitly gather compromising material to use as blackmail and extortion on people who might stand in the way of this war-for-profit gravy train.<br><br>We continue to be deliberately and criminally deceived about these so-called humanitarian wars by a media that continues their fawning sycophantic support of the war-loving establishment.<br><br>The butchery-for-Raytheon profits continue with no end in sight.<br><br>It's a great yarn well told, Knightly is perfect as Katharine Gun, and it has a lot of very interesting old footage from the time which will have you shouting at the screen in frustration. But the effect on most will be excruciating cognitive dissonance between the world we think we live in and the actual power structures that manipulate us into handing our tax money over to kill poor people overseas for geostrategic reasons that benefit no one except the very rich and powerful.","user":"MR_Heraclius","rank":[54,60]},{"title":"Good for her","rating":7,"date":"7 September 2019","review":"This film is based on a true story of a woman working for the British government who leaked a document to the press so that the Iraqui war might not happen. In case you've forgotten, that war was started under the false premise that Iraq had \"weapons of mass destruction\" and they were planning to use them with anti-western forces top launch attacks. Both allegations were blatant lies, trumped up by the Bush administration, but at the time, many people believed them and in fact, the US and the Brits went to war with hundreds of thousands of casualties.<br><br>The film is slow paced but the acting is excellent, especially from Ralph Fiennes who seems to utterly disappear into his roles. It's a case study of someone being willing to stand up for what she believes regardless of the consequences. There are precious few people like this, so every film that chronicles their struggle deserves to be seen.","user":"drjgardner","rank":[118,142]},{"title":"Brilliant screenplay, superb acting!","rating":10,"date":"25 June 2019","review":"The screenwriting magic of the incredibly talented husband and wife team of Bernstein and Bernstein bring this true story filled with spies, treason, love and war to the big screen. Though a true story and the ending is known, this film has the viewer balanced on the edge of their seat with suspense. Kiera Knightly's best performance to date and Ralph Fiennes is brilliant as her lawyer. Every performance is excellent in this must see film when it premieres in August 2019. (Viewed at the Nantucket Film Festival June 2019)","user":"jhwaldo","rank":[86,118]}]