[{"title":"Mixed Bag Here for Me","rating":6,"date":"25 July 2018","review":"As many reviewers have noted , this movie jumps from one time sequence to another and leaves it up to the viewer to basically figure it out. I'm not a big fan of this style of first time director Russell Harbaugh, and with the film's many flawed and unlikable characters, I'm surprised I'm not giving this a 1 or a 2 rating as well.<br><br>However, I did find some strong acting here led by the seemingly ageless Andie MacDowell, and some dramatic tension among this dysfunctional family which I found interesting enough to stay with the movie, although part of me wanted to indeed bail. <br><br>Overall, a mixed bag for me here, but I can see how many will be turned off by some of the unlikable characters and their crappy actions.","user":"larrys3","rank":[9,9]},{"title":"The Absolutly Most Horrid Film I've Seen in Years","rating":1,"date":"10 May 2018","review":"\"Love After Love\" is horrid wretched film, which, unbelivably, has received universally positve press reviews, which is utter and irksome madenss. A family's response to the death of their husband and father is to crudely \"act out\" in an uncontrolled manner. The \"raw family drama\" is about a unremittingly boring family, with no depth of character, no sense of transcendance while mechanically flailing, instead of seeking professional \"grief\" counseling as they seek relief in abudnant (gotta have nude scenes, don't we) wanton sex. The film does not establish where it takes place, a New York State car plate being the only clue. Their well-appoined house is on a lovely lake so they've got money. Where? They work at jobs, but what do they do? There are scenes in a city. What city? They are grieiving for a humdrum man who appaently smoked himself to death. Some role model, huh? The film jumps from scene to scene with no sense of the time line. The jazz soundtrack, merits the reviewers praise but is always at very high volume which if it was played at something lower than earspliting gain, would have been nice to listen to. Acting wise something akin to improvisation is happening, apprently to mirror John Cassavetes, but absent any of the verge or energy of JC, in a film like \"Faces\". Andie Macdowell's performance comes off as that of an actor self-consciously mocking-up an Academy award winning performance, and looking as reviews kept repeating: radiant. (She must have been constantly asking herself \"Am I acting sufficiently significant?\") Chris O'Dowd's character is unforgivingly repellent as he vulgarly sexes his way toward peace of mind with his mourning. What utterly boring characters, in a film of 91 minutes that seem to go on pointlessly for hours. The film abruptly wraps up with a happy family scene in a hot tub, all sweetness and light with one another, which after all the \"raw\" interaction was a cinematic non-sequitur. This film will fade from public memoy, probably faster than my own, since after opening on April 1, 2018, as of May 6, its box office was a mere $107,630, which was enough to just about cover catering and cast transportation. Sorry Andie, even though you got to do your mandatory first nude scene at 60, your Academy awards chances appear slim.","user":"yacovdaavid2","rank":[31,47]},{"title":"Disappointing and over-hyped","rating":2,"date":"25 July 2018","review":"Watched this yesterday and came away with questions, the biggest of which was why did I ever watch it in the first place. Filmed like a reality show, meandering here and there and could have only been worse if a hand-held camera had been used. Definitely did not like the director's technique or style. Never found out what the father/husband's malady was, found it hard to determine who Nicholas' latest sex partner was, found the segue from wake to Nicholas' wedding engagement announcement dinner was confusing. The only good thing I can say about this film is Chris O'Dowd's well acted performance as the stupid-beyond-words and for me, loathsome Nicholas. He did such a good job that I doubt I could ever like him in any future character portrayals.","user":"cageyk-46578","rank":[12,17]}]