[{"title":"Good initial idea and CGI, very bad script","rating":4,"date":"20 May 2017","review":"I rate the initial idea behind this movie as good. However, first of all the way they tried to make energy does not sound very logical! Also, they just mentioned jargon such as Mtheory and Parallel universes possibly without knowing which one is related to what! And parallel universes here are basically parallel earths! This list can go on and on; therefore, the science part of this movie have some problems. But I'll give it a pass.<br><br>Then we get to the story telling part of this movie which is absolutely poor! Things just happen without proper causes! People pass on using cars or bicycles and prefer to just walk and run far distances! Bullets avoid hitting heroes and explosions avoid harming them at all costs for most parts of the movie! Also, there are big plot mistakes regarding things that happen on parallel universes.<br><br>All in all, I would have gave it a 3, but since it has good CGI, I gave it 4. <br><br>Would I recommend you to watch it? Only if you are bored to death and you are out of good SciFi movies.","user":"aref-cs","rank":[86,106]},{"title":"Not bad","rating":6,"date":"21 May 2018","review":"This is an okay sci-fi movie, although it does have some imperfections. It's certainly not dull, and the story is original. The acting wasn't bad either. <br><br>It should be taken into consideration that it didn't have a high budget, I think they did not too badly with what resources they had.","user":"Freedom060286","rank":[17,19]},{"title":"Kill Switch: Enjoyable sci-fi effort","rating":7,"date":"2 April 2019","review":"This Danish made independent sci-fi is quite the surprise!<br><br>It tells the story of a revolutionary new power source, but as usual nothing goes to plan and it puts the entire world in jeopardy.<br><br>Filmed from two perspectives, real time in entirely first person and flashbacks through a more traditional format. Though quite disorientating it actually works.<br><br>With a mostly unknown but competent cast, gripping story and SFX that are considerably better than you'd ever expect from a movie of this type I was certainly left impressed.<br><br>Sure it's not flawless, certain elements don't work as well as others but as a whole this is a very well made movie and certainly puts many similar Hollywood efforts to shame by comparison.<br><br>I'd call this essential viewing for lovers of sci-fi, a lot of fun.<br><br>The Good:<br><br>Very stylish<br><br>Some great visuals<br><br>Bérénice Marlohe<br><br>The Bad:<br><br>Something felt missing<br><br>Transitioning between first person and third person can get frustrating","user":"Platypuschow","rank":[11,12]}]