[{"title":"montage after montage","rating":4,"date":"28 January 2019","review":"When the movie started, I was truly captivated by the mysterious monologue that broke the fourth wall and I immediately knew I was in for a ride. Unfortunately, that ride felt less like a thrilling rollercoaster and more like I was a grown man riding a merry go round. From the outside it looks very bright and colorful, but once you're in, you realize you are on a slow and dull ride. Now don't get me wrong. Theres a lot that I really enjoy about this movie. Aside from a couple random shots, the cinematography was top notch. They really knew how to make boring scenery visually captivating. On top of that, the acting was just as incredible. The film truly shows how much undiscovered talent exists within the film industry. Every single role, lead or support, gave it there all in the making of this indie film. Lastly, the concept of the movie was incredible. They've created a wall full of assassins from all over the world and I wanted to learn more about every single one of them. Unfortunately, where the movie lacks is dialogue. Not that the dialogue is bad, although it was awkward at points, but that there was a lack of it. So much of the movie had no dialogue at all which is not always a bad thing, but it made an action movie feel extremely slow. Many of the shots stuck around a lot longer than my interest did, especially the incredibly uncomfortable desert dance scene. Also, I was really distracted by how unrealistic the foley was. Not only were sound effects repeated, but they seemed a little tacky. This was something that was most distracting when brass knuckles were used. Overall, I think with more work put into writing and cutting down longer shots this could have been a truly impressive independent movie. With that being said I see a lot of potential from everyone who was involved and am excited to see what they all work on in the future.","user":"detectivedevito","rank":[18,22]},{"title":"You're not hiding. You're surviving.","rating":2,"date":"3 March 2019","review":"Set (Dorée Seay) has a split lip that bleeds when she smiles which isn't often. It is an occupational hazard when you are a freelance assassin. Set made a mistake on her last assignment and now professional assassins want her dead. They are nice enough to give her a head start. They tell her to go to Arizona where she would be hard to find. So she goes to Arizona and is really easy to find. Why? Because they knew she was in Arizona. She kills the assassins that come after her. She meets Samuel (Chris Labadie) who wants to help her and he doesn't die soon enough for me.<br><br>Samuel was an irritating character. Set gets punched in the face and head by a guy with arms as big as my thighs and she still has all her teeth and doesn't get knocked out. And her puny arm is stronger than his thigh-sized arm being able to hold back a knife. Much of the fighting wasn't choreographed like the early garage scene, it was done off camera. What was that whole white mask dance? The story was not well put together. Camera framing was lousy.<br><br>Guide: F-word. No sex or nudity. Set used as a punching bag.","user":"nogodnomasters","rank":[3,6]},{"title":"Are you ready...","rating":8,"date":"22 January 2019","review":"The cinematography and the acting we're both top notch! Some of the fight scenes might strain credulity a little bit yet exciting and entertaining nonetheless. I absolutely loved the ending.\nA quality film, kudos to Christopher and the entire fast and crew!","user":"danm-53724","rank":[6,18]}]