[{"title":"The Best Comedy of the Summer","rating":10,"date":"18 July 2017","review":"One of my favorite things to do is go into a movie completely blind. Not watch a trailer, look at a poster, or even the cast list. It's incredibly difficult to do in today's age, especially because of how much I enjoy watching trailers, but when the chance comes along to see a movie with no prior knowledge, I take it. <br><br>The Big Sick is one of those rare movies that presents itself as 3 genres, in this case Drama, Comedy, and Romance, and it services each of those genres equally. So well that you have to mention all 3 if you're talking about the movie. It's not just a Rom-Com or a Rom- Dram, it's most certainly a Rom-Com-Dram. I haven't seen a film so effortlessly balance the 3 genres. This is all while seemingly reinvent the formula for a romantic comedy to beautifully fresh results. The Big Sick uses witty humor, charming leads, and socially important topics to give us the best film of the summer thus far.<br><br>A romance is only as good as its leads and their chemistry. Luckily, Kumail Nanjiani and Zoe Kazan grace the screen with a refreshingly awkward and charming presence. Being that I haven't really seen either of them in anything else, their relationship felt miraculously original. The Big Sick is based on Nanjiani's actual life, but this felt like a comedy unrestricted by real-life accounts while also honoring a serious subject matter that has its place. However, the two's chemistry isn't all this film has, its entire ensemble is something to behold. Ray Romano, Holly Hunter, Anupam Kher, Adeel Akhtar, Zenobia Shroff, and the various comedians do a wonderful job of rounding out the fantastic cast.<br><br>It doesn't fall back into genre clichés or tropes, doesn't fall back into an overly physical comedy (like most comedies do now), and it most certainly doesn't go the direction you think it's going to go. The Big Sick benefits from having a diverse cast and story and an impeccably funny but also poignant script. Heck, it also doesn't hurt that it takes place and was filmed in my hometown of Chicago. But the important thing is, this film restores my faith (once again) in original romantic comedies. Go see it.<br><br>+Diverse<br><br>+Original<br><br>+Funny &amp; heartwarming<br><br>+Balances its 3 genres impressively<br><br>10/10","user":"ThomasDrufke","rank":[173,258]},{"title":"So much more than a \"romantic comedy\"","rating":10,"date":"2 July 2017","review":"Romance, cultural conflict, betrayal, compassion, and redemption. All neatly wrapped within the context of a comedic memoir. Michael Sholwater did a superb job directing and the writing collaboration between Emily V. Gordon and Kumail Nanjiani gave the audience a wonderfully intimate sense of how the warmth, power, and growth of a couple relationship can expand and strengthen the bonds of family.<br><br>No story or movie becomes great without a superb cast. Again Kumail Nanjiani proved his versatility with an amazingly strong performance (in my opinion award winning). And this movie was not a one man show, Zoe Kazan gave just the right energy to her role, Holly Hunter should get an Academy Award for best supporting actress for hers, Ray Romano was excellent as were Zenobia Shroff and Anupam Kher. This was the best movie I've seen in a very long time and just may be the best romantic comedy I've ever seen.","user":"bliss_s","rank":[115,174]},{"title":"The Big Sick is a cute story about the sacrifices between family traditions and significant others","rating":10,"date":"18 July 2017","review":"What's more important? Your significant other or your family? That can be a challenging question when it comes to your development as a human being. While it doesn't say much about you and how you react to people, it certainly says something about their personality. Should they side with their lover, then they are willing to dodge bullets and rarely care about the opinions of other people. If they chose family, then they have a lot of beliefs in classic values don't want to lose a possible safety net from their parents. <br><br>As a white guy from a middle class family, I already have to process my thoughts if I'm going to go against my parents. I can't imagine how much harder that has to be for those from backgrounds with thicker backgrounds. A good friend of mine is marrying into a Mexican-catholic family despite being nonreligious. He's told me that it's taken him a while to win over his brides family and to be accepted into their traditions. Another friend of mine married an African-American, despite some resistance from his family. Today, I know them as one of the most loving families around. The Big Sick examines love and conflicting with traditions.<br><br>Uber driver Kumail (played by Kumail Nanjiani) is an aspiring stand up comedian who is on the verge of acquiring his big break by possibly getting a spot in a popular Canadian comedy festival. He also does a one person play about his experience of growing up in Pakistan and the U.S.A. and how he's adopted the American way of living, despite his family staying safe within their Pakistan values. This includes weekly dinners where his parents keep trying to set him up with potential women from Pakistan to lead into an arraigned marriage. This changes during one of his shows when a heckler stops his show.<br><br>Aspiring therapist Emily (played by Zoe Kazan) talks to Kumail about his act and the two end up going home. Though they keep claiming they won't do it again, it leads them to date (without Kumail's parents knowing of course). After a fight and her walking out, Kumail gets a phone call about her in the hospital. He agrees with the doctor to put her in a medical induced coma and uses her phone to contact her parents. Her father Terry (played by Ray Romano) and mother Beth (played by Holly Hunter) arrive as the two and Kumail try to help them deal with their daughter. The Big Sick happens to not only be very cute, but this is a nice examination at these kinds of relationships. You usually don't see many interracial kinships (with the exception of this years Get Out), but this one examines a lot of the complications that arise from both families opinions to between the lovers. It even manages to subvert a lot of tropes you typically find in these romance comedies, like how the couple has their \"blowout\" much earlier, which only makes the situation even more complicated if she recovers.<br><br>The main star and scriptwriter, Kumail Nanjuani, clearly has based this off of his experiences (just wait for the end credits). He knows how to juggle the balance of what probably happened and which moments were exaggerated. He also understands just how much he can hurt his family and how high the consequences were. Though his performance as himself was good, the bigger surprise comes from both Ray Romano and Holly Hunter, both actors I haven't seen in a while. If you think Romano is just repeating his character from Everybody Loves Raymond, then you'll be in for a surprise by how sincere his character is. While I can't spoil the best parts, I can be sure he may have earned himself an Oscar nomination.<br><br>The Big Sick also dwells into stand up comedy, which is rarely done on film, into new territory I haven't seen. While most deal with trying to be funny, this one seems to care about how much storytelling is involved. As someone whose done some stand up, I can say that the film is accurate and honest about how hard it is to get noticed. While we're not all trying to get on Saturday Night Live, we at least have different perspectives that are worth addressing.<br><br>I'll give this ten stuffed giraffes out of ten. I was taken aback with how much I liked this and hope that a lot of people realize that all kinds of love are worth talking about. The biggest sacrifice you can make depends on what you value, and I hope that this movie can help. I can definitely recommend The Big Sick.","user":"RforFilm","rank":[83,135]}]