[{"title":"Even a child who is pure may become a wolf","rating":9,"date":"5 May 2019","review":"The werewolf myth is about the innocent who is damned.<br><br>The myth's fascination stems precisely from the fact that the condition of becoming a furious monster can strike a person who has done nothing wrong.<br><br>What if this inherent innocence of the myth were taken to its ultimate consequences, and the curse affected a child?<br><br>That's the wonderful premise of one of the best werewolf films of all time \"The Good Manners\" (a Brazil-France coproduction, shot in São Paulo).<br><br>Attention: it is not your conventional jump scare movie (although it has a few chills here and there). The film mixes with wisdom and creativity different genres. It is a dark fairy tale in which horror, comedy, drama and even musical numbers blends altogether. Makes sense, since one of the main references are the Disney old animated feature films.<br><br>It's two stories in one. The first half has a Hitchcockian tradition: the filmmakers do not hide from the audience the true nature of what is happening, but the protagonists still do not know. So we are apprehensive, hoping for them to find out. The second half is totally unpredictable and the stakes are higher.<br><br>An absolute highlight is the musical score form brothers Guilherme and Gustavo Garbato, with chilling and beautiful lullabies.","user":"bertramprodutora","rank":[33,40]},{"title":"Fantastic - in every sense of the word","rating":8,"date":"31 July 2018","review":"Given how weird this film is, I'm a bit surprised that there's no review about \"Good Manners\" yet. Horror titles usually get a good deal of attention but perhaps this is an indicator of just how unique this one is.<br><br>The story seems straightforward enough at first: Impoverished Lesbian black nurse Clara gets hired by affluent yet unemployed white pregnant Ana - this in spite of giving her landlady as her only reference, who promptly tells her she's being owed rent. However, Clara's touch calms down the kicking baby, so Ana instinctively hires her - and soon their relationship gets very close. However, Ana's behavior becomes increasingly erratic as her pregnancy advances, culminating in... well, among other things, singing. Yup, it's a musical, too.<br><br>I've seen a lot of genre movies and it's the rarest of the rare when one of the formulas is injected with something new. Horror often serves as social parables for the exclusion of the different, but here, you will find yourselves drowned in references and allusions, from queer bashing over solitary motherhood to race issues. There's so much to handle that it might be best to not try and process it all, and just abandon oneself to the beautiful weirdness of this film. <br><br>Of course, a limited budget limits the scare of the CGI, you got to be open-minded about that. The emotional turmoil makes more than up for this as Isabél Zuaa's performance carries the film from the first shot. The script should have been tighter as it takes enormous leaps and then slows down. I'd recommend watching this late at night, with close friends who are into weird stuff, and after a few joints or drinks.","user":"Radu_A","rank":[40,50]},{"title":"Excelent!","rating":9,"date":"8 May 2019","review":"Great acting by Isabél Zuaa and Marjorie Estiano, good practical effects, a lot of creativity in the narrative, nice design. One of the best in the recent \"wave\" of Brazilian horror flicks.","user":"xenomorphicf","rank":[18,25]}]