[{"title":"A Real Borefest","rating":1,"date":"5 June 2019","review":"The movie has nice cinematography and good acting, but it's an all-girl cast. It's about a few heroin addict girls trying to get clean in a rehab center and they fight each other like prisoners would in prison. That's all the movie is all about. There are no scares, no thrills, nothing. Just because people die in a movie, it doesn't get to be called a horror movie. I think a new sub-genre should be created for movies like this so horror movie fans will know they should avoid them, something like: crime, murder. This is no Scream. It's lame and boring with a generic plot. Actually, I can barely call it a plot, because it's too basic. Close your eyes and imagine this: two girls are fighting a normal fight with fists in a well-lit corridor, one of them picks up a shard of glass and stabs the other, and the other girl just falls to the ground and dies. There's no gore either.\nNow, slowly open your eyes. Did that scare you? Did you find that thrilling or interesting in any way? That's what you're going to get by watching this movie. If you found the picture I described interesting, scary or thrilling even a bit, please go ahead and watch this movie. Otherwise, save yourself an hour and thirty minutes of your life and watch something better. The gore you see in the trailer is what one of the girl's sees in her head a few times during the movie. It's got nothing to do with the main story-line, and it's merely there as an excuse to make an interesting trailer in order to deceive the audience.<br><br>And no, please don't thank me. It is my duty to warn you. If I can save even one person's time, I will have served a purpose in this world.","user":"politehere","rank":[20,33]},{"title":"Commits the worst sin for a horror movie, it's boring.","rating":2,"date":"12 June 2019","review":"There's not a lot to like here, the set-up of an all female mandated heroin recovery unit feels like it might have some legs, but it's sqaundered and has to lean on the tired contrivance that there's an impassable blizzard to build any kind of tension at all. The actors do their best, but it would take the finest actors in the world to deliver the maudlin heavy-handed dialog the script demands, and these aren't them. The characters become caricatures and by virtue of that there are no stakes, you don't care what happens to any of them and just hope they are all killed in some significant manner.<br><br>As you sit through real time therapy sessions you begin to wonder if there is ever going to be a turn where it becomes a genre flick, and then when that finally happens at the 1 hour mark you're so bitterly disappointed you'll want to turn it off at what is a laughably silly payoff, but stick around for that final showdown featuring the least gripping combat since the knife fight in Seizure.","user":"efullerton","rank":[8,11]},{"title":"not good","rating":3,"date":"5 June 2019","review":"A terible story about ptsd'd druged woman that needs recovery. easy made easy paid, and no more than that thinks the grumpy old man.there are some woman flipping out and some cross connections that kills, but its all basic and quite freudianic. terrible music that everybody with a battery driven babys keyboard could make.not recommendecd.","user":"ops-52535","rank":[15,26]}]