[{"title":"Boring and Dull","rating":2,"date":"20 November 2017","review":"\"The Toymaker\" is a boring and dull B-movie absolutely overrated in IMDb User Rating. The storyline is silly and the screenplay is excessively talkative. There is no tension and the one-dimension characters are awfully developed. The art of the poster is the only thing worthwhile in this flick. There is no credit song in the end; therefore it is not informed the song that the Toymaker is listening to in the radio (Bessie Smith maybe?). My vote is two.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[20,23]},{"title":"Horrifying that this movie actually exist.","rating":1,"date":"8 September 2017","review":"Only a small spoiler in the middle of the review. I could make a long list on why this movie was without doubt one of the worst movies i have seen in ages but i will keep it short. <br><br>I do love B-movies i really do but this was not even good enough to be called a \"B movie\" i have seen school projects from 15 year old's that where better, I don't mind acting being a bit bad or in some cases a disaster. but if every actor in the movie reminds me of a 3 year old trying to lie to his parent for breaking some rule then it is to far gone. <br><br>The entire beginning was basically \"i saw inglorious bastards i wanna copy that first scene but change it a little bit\".<br><br>I literally made a IMDb account to post this review. that is how bad the movie was. Coming from someone that and watches both movies and series every single day not to mention i collect VHS, DVD and Blu rays, i thought i had seen some bad movies.. but then this crossed my path and i realised that i think i just saw one of the worst movies i have ever seen. And the worst part is i actually payed for it. if i had bought the disc (i rented digitally) it would have been the first movie i ever would have destroyed and thrown out.<br><br>Since English is not my native tongue i apologize for misspellings and other grammatical errors.","user":"narsaarf","rank":[13,18]},{"title":"A Family Is Born!","rating":5,"date":"4 March 2020","review":"An Indie film with a story worth being told. The Toymaker, an old man who has acquired a mystical book which he uses to call upon entities to possess the family he created for himself...his dolls.<br><br>A nice origin story to the haunted doll, Robert. The performance was fine, the effects and dolls movements are generally OK since I noticed that the dolls should have more joints to hold objects! I also believe that The Toymaker aging makeup is not that good, It'd have been a way better choice if they cast an old man for the roll but the ending was sweet and unexpected.","user":"Impartial-Critic","rank":[6,7]}]