[{"title":"At last they got it right!","rating":7,"date":"23 September 2016","review":"I'm writing this review having in mind that you've already seen the previous two Tri movies so I'm gonna summarize this one only. Also, I'm using the Japanese names because the dubbed version isn't out yet.<br><br>The word 'maturity' is the key here. Both for the creators and the characters.<br><br>The first part of the movie dealt with Meiko's grief over Meicoomon's sudden dark turn. It really doesn't help with the plot's progress and it showcases the reason why the previous two films didn't really work out for me... too much forced 'feelings' either sad or happy ones without any structure. And we simply don't care about a new character, that's also a fact.<br><br>And then comes Patamon's infection. That really hit hard, it was perfectly orchestrated by the director and it was really the most PERFECT Digimon scene I've ever watched. Digimon Tri from the beginning opted for a more mature atmosphere but we had to wait for the 3rd movie to finally make it work. Now, that was real drama, not cliché melodrama, and the way both Takeru and Patamon face this is both realistic and powerful. This part made the movie an instant success.<br><br>Before analyzing the next part... poor Hikari, the sweetest and most quiet girl, why DO YOU ALWAYS GET POSSESSED??? And next ladies and gentlemen... after two and a half movies... WE HAVE A PLOT! That's right, we have a plot that involves both worlds (and don't say we did in the series as well, those were just...)and a solution to the problem that isn't just \"We gotta beat the big bad guy with a new evolution never made before\". The whole digital world concept is described more realistically than ever, setting the foundation that all the series never actually did.<br><br>The second character that gets more focus this time is Koshiro. He knows that he is the one that can actually do something and so he works himself to the limit. Whether he achieves anything or not... I won't spoil everything.<br><br>Then the battles... see them for yourself. I'll only comment on the distorted physics of the Digimon especially Angemon and Angewomon. Really bad. The 'despair' music they used for the first time is good though.<br><br>*Spoiler Alert* I feel they wasted the whole 'infected' concept in the end. It would have been better if only Patamon/Angemon was infected A few random points. When will the creators understand that Agumon is NOT funny??? The whole Taichi-Yamato rivalry or whatever the hell it is (for some reason they're blushing when talking to each other) is also not interesting anymore. Sora is great. And since they're throwing hints left and right,they should make a few romances happen. It sounds cheesy, but believe me it's a lot better than just throwing a few lines or blushes here and there and leaving it at that.<br><br>Is this the end? No, it's only the beginning.<br><br>To conclude, it was a milestone for the Digimon franchise. More sentimental, no humor, less action, but let's be honest, Digimon was always at its best when it used drama and the relationships between the digi-destined and their partners to spark the action. If all the movies and series had the same tone and maturity, then Digimon would have earned its place among the best anime.","user":"marinospolitis","rank":[3,3]},{"title":"SHE MUST GO!!!! PT2","rating":7,"date":"1 March 2018","review":"Digimon was basically my childhood, so when I saw that Digimon Adventure Tri was announced, I was so happy to see characters from my childhood grow up and struggle through their, not so normal lives. Tri 3. Confession continues where Tri 2 Decision. There are some things I'm happy with, but at the same time some things I'm disappointed with. Tri. 3 begins to explain some of the things the other 2 movies don't. Like why is all of this happening. The next thing I want to talk about is Patamon. The show did a really good job to bring a lot of focus onto Patamon. It really hurt me to see that Patamon was infected, but the thing that really made my heart sink 1 million meters into the ground was the scene where Patamon just outright says \"I'm infected\". It hurt so much to see Takeru and Patamon suffer and struggle throughout all of this. <br><br>Shifting gears from sadness to disappointment, the one thing that really disappointed me was Meiko. My main problem with her is the fact that she basically will not stop complaining just because her partner ,Meicoomon, has done some horrible things. Instead of saying \"lets save her\" she basically says to just kill Meicoomon to solve all their problems. Yes she's probably sad about having to kill her friend, but the fact is, she isn't really fighting to save her. Another thing about her. SHE WONT STOP COMPLAINING!!!!! Its ok to be sad. But not to the point where every other sentence is her complaining about something!<br><br>Another thing is Leomon. Why? Why does this keep happening to you? Who's idea is it to keep on hurting you?","user":"ashah702","rank":[0,0]}]