[{"title":"A Horror Film For Our Times","rating":5,"date":"14 July 2017","review":"\"Tilt\" is billed as the first horror film of the Trump Era, although it was filmed before the actual 2016 election took place. Joe is a documentary filmmaker living in LA with his pregnant wife, nurse Jo. He has been working on a new doc that aims to expose the \"myth of the Golden Age\" in American history, specifically the post-war period roughly from 1947 to the advent of the Beatles. Trouble is, Joe keeps expanding his vision, but Jo needs him to buckle down to work in a \"real\" job, one that brings in money, and oh, by the way, to become an adult already. But Joe's sense of reality is unravelling, one scene after another. I could see what filmmaker Kasra Farahari was going for here, but despite the excellent acting by Joseph Cross and Alexia Rasmussen, the film ends up being just too disjointed to work. Like Joe's documentary, \"Tilt\" really needs a sharper focus on a smaller theme.","user":"alisonc-1","rank":[13,17]},{"title":"I understood this movie. This movie didn't understand itself.","rating":1,"date":"18 March 2018","review":"This film is a good example of what people that fail exams at film schools have to show as their thesis film. This hour and a half time wasting machine is full of cheap tricks that are surface level filmmaking. Calling this pile of garbage a film is a disgrace to film industry and filmmaking in general.<br><br>You may think that this is a psychological game, that it's much deeper and not for everyone, but it is not. This movie is not mysterious or challenging, it is very easily understandable, bad version of simple and not that hard to take in. The problems arrive when you watch a scene, know what it will end with and what will it lead to, then watch it do exactly that with no enthusiasm and emotional and visual attraction.<br><br>This thing is a pile of film-school-garbage made by someone who needs to repeat their program.","user":"belomestnykh","rank":[18,28]},{"title":"Borefest","rating":4,"date":"17 March 2019","review":"It would probably be a 5 or 6, if it wasn't so pretentious. Tilt looks like it was made so that Joseph Cross could wander the city at night in a black hoodie, smoking a cigarette and trying to be emo. Some shots are dark and confusing, others hold onto meaningless objects for no real reason. But one thing you can tell right away - nothing much is going to happen in this movie, and you can relax and turn your brain off. It would actually be painful if you paid attention to the bland dialogue, Joe's forced enthusiasm about his documentary, and the complete and utter pointlessness of everything that happens in this movie.<br><br>Joe, who must be the loneliest firm-maker ever, has a boring wife, rude house guests, and nobody to call a friend so he goes around the city staring at people, scaring them by looking like he's about to kill them, and losing his temper after two bad line-readings because he's so on edge about his passion project which besides a few lines of dialogue, there is no evidence of it ever being his 'passion'. His true passion seems to be to smoke, stay up late at night, dress like a rebellious teen and hate his wife-mom.<br><br>It has some sort of political agenda probably. I don't know why else there's so much of that stuff in here. But other than that, its not really offensive or frustrating. It's a calm, do-other-things-while-this-is-on kinda movie.","user":"cjs6547","rank":[3,3]}]