[{"title":"For lovers of Chinese poetry, disaster for most of the western audience.","rating":5,"date":"17 February 2016","review":"I had the luck, pleasure - or burden - to see this film premiering at the Berlinale 2016. It was a quite interesting premiere with the actors leaving the room when the lights were turned off, although they later stated on stage that they watched it through. If you decide to watch \"crosscurrent\" be warned that this is a very poetic film. In the sense of being driven by Chinese poetry with a lot of symbolism. It is hard to digest if you don't know much about Chinese arts and language. Speaking of language, the movie was shown with German and English subtitles and they differed enormously in their meaning in some scenes. Unfortunately I only speak a few words of mandarin, so I can't really judge the linguistic quality. I don't want to spoiler anything here, which is really difficult because the plot is quite simple and it's more about the poetry than about the actors of the movie and the main actress even stressed that there is room to improve on her acting and it was mostly below average, but this is also due to the script which doesn't really emphasize on the persons interacting. The movie starts very serene with a man embarking on a journey up river (nothing new here), which is driven by Chinese poetry. The first half is quite slow and tedious, which made me almost fell asleep several times, but later on it get's a bit more interesting (but not really engaging. Still some of the imagery is quite pleasing and there are a lot of scenic shots (although mostly in 'moody' conditions). The director, or better to call him an artist, said it's one of the last movies in China shot on celluloid. And so, although it was produced over the course of several years (shooting alone over the course of four years) you can see some technical glitches like dirt spots or missed focus in some scenes. But despite all it's shortcomings the end has some surprises and there's especially one scene which made me laugh, although it's actually quite demoralizing if you realize what just happened. <br><br>Long story short: A serene film for lovers of Chinese poetry and landscape paintings, but probably a disastrous experience for most of the western audience.","user":"mashthemedia","rank":[11,21]},{"title":"Mist-ified","rating":7,"date":"1 October 2018","review":"All things considered, this is basically a ghost story that unfolds on the Changjiang (Yangtze) in contemporary China. Which is to say it is not a docu-allegory inviting comparison with the meditations on what economic development and related change are doing to the communities and people along the river in Jia Zhangke's \"Still Life.\" Gao Chun (Qin Hao), the skipper of a scow carrying a load of suspicious cargo far up the river from its mouth at Shanghai, finds a book containing a map of it with poetry in the engine compartment, falls in love with An Lu (Xin Zhilei), a mysterious woman whom he inexplicably keeps encountering at assorted stops along the way, and eventually meets his doom at the town of Yibin, the upstream gateway to the river in Sichuan province, although his soul ultimately journeys all the way to the Qumar River, one of the sources of the Changjiang, where ends the story.<br><br>I was eager to see this movie ever since learning about it from a tabloid on an Air China flight in 2016, because I was intrigued by its unusual incorporation of Chinese poetry. I wanted to see how the director treated poems by some of the great classical Chinese poets as a key component - perhaps THE key component - of the movie.<br><br>My expectations were off the mark. In a September 2016 interview with the Chinese media mag Juzi Entertainment, director Yang Chao said he wrote nine of the ten poems himself, and used two lines from prose on the Internet written by one Le Xiaodao, whom he describes as a \"free-thinker,\" for the other, which is the first to appear in the movie. Yang apparently wasn't counting the poem stamped out on a sandbar by An, which is a stanza from \"Asking Heaven\" by Qu Yuan, who was active in the early part of the third century BCE and is regarded as China's first great poet. (Coincidentally, Qu died by drowning himself in a river, albeit not the Changjiang.) And at least one Chinese reviewer asserts that another poem is by Hu Shih, a 20th century man of letters who pushed for a switch from scholarly classical language to the vernacular in literary works. I do not know if this is true, but Le's and all of Yang's poems are certainly in the keeping with Hu's prescriptions. They are straightforward, flat, written in plain language, unrhymed, and probably unconcerned about the pattern of accentuation. (Classical Chinese poetry is, in contrast, anything but straightforward, and bound by strict rules governing accentuation and rhyming.) Starting with Le's two verses, they are completely consistent in tone, which is world-weary and resigned, yet lofty and unbowed.<br><br>So much for the poetry. The cinematography by Lee Ping-Bing is lovely enough. The sound design by Fang Tao and Hao Zhiyu is outstanding, and sufficient reason to see this movie in a theater, if seen at all. The actors are competent. The real problem with \"Crosscurrent\" is the narrative. In a different interview, Yang (who also did the screenplay) reveals that Gao and An have mutually opposite flows of time; she goes further back in time as he goes further up the Changjiang (hence the English title, as one reviewer pointed out), but this could hardly be divined by merely watching the picture. Materials hint at a connection between An and Gao's late father, but I couldn't see any. Needlessly involved and abstruse, the plot is as misty as the Changjiang in rain, and unfortunately positioned at the very center of the work. This is a crucial point of difference from Hou Hsiao-Hsien's \"The Assassin\" and \"Flowers of Shanghai,\" for which Lee also handled the cinematography, and which have a similarly languid pace. Hou places the plot resolutely to the side; it is only one of the ingredients in the potion he brews to conjure up the \"qi\" spirit of the times, which is the real focus of the movie. Despite also having story lines that are blurry and barely able to be followed, both of these works stay charged with the tension of this \"qi\" from start to finish. \"Crosscurrent,\" on the other hand, seems to lose vitality as it proceeds, and its narrative, to become only murkier as it unwinds. Given the story's central position, this is fatal. What remains is not enough to keep the film afloat, and the audience is left waiting for a dawn that never comes, grasping at straws as it slowly sinks. Take, for example, the reference toward the end of the film to Dakini, the cannibalistic she-devil of esoteric Buddhism who would sense the death of a man six months in advance, protect him from other demons during that time, and then devour his heart herself immediately after his death. Come to think of it, the deckhand Wu Sheng (Wu Lipeng) jokes with Gao about not caring if a heart is beautiful - the important thing is \"whether the meat tastes good.\" And don't we see one of An's putative clients face down and bleeding from the torso the next morning?<br><br>All such straw-grabbing and bafflement aside, Yang nevertheless deserves applause for this effort. It was ten years in the making, and the bold use of poetry works beautifully in many cases (especially in the first 30 minutes or so). The combination with Lee's masterful landscape shots on the same screen echoes the scroll paintings of dynastic China accompanied by poetic calligraphy. And the footage of Gao trudging up the dry river bed of the Qumar deep in the western part of Qinghai province is breathtaking.<br><br>Since he's apparently into poetry, I'd like to see Yang, or some other director who takes a cue from him, make a film about China's \"menglong\" (misty) poets, so called because of the enigmatic nature of their verses. Yang has stated that the poems in the movie are like those written in the 80s and 90s, when they were active. Moreover, there would be no need to concoct elaborate narratives; their lives and works are absorbing stories, just as they are.\n<ul><li>J. Koetting</li></ul>","user":"najania","rank":[2,3]}]