[{"title":"Waste of time and money","rating":3,"date":"2 May 2019","review":"Not very good. False Flag feels like an extended student short padded to feature length. You can tell this is \"director\" Aaron Garrett's first (and last?) cinematic effort. A for effort and D- for execution.<br><br>As for the reviews, the first was harsh but honest. The second review reads as if it were written by Garrett himself (or possibly his girlfriend or mom). It critiques the spelling error (obviously a typo) of the word \"wrestler\" (apparently now corrected) and then goes on to exhibit it's own - as well as incorrect grammar and complete misuse if words (you mean \"captivating\" not \"capturing\"). Oh well, this one probably has at least one typo, too!","user":"ryan_oblivion","rank":[11,12]},{"title":"False flag...","rating":4,"date":"5 May 2019","review":"Two estranged brothers find their attempt to rebuild their lives torn apart when martial law is instituted for no reason in their small town. You could say this movie seems unrealistic, but a black helicopter training exercise in Pittsburgh's Strip District in the late 1990's was greeted by drunken people emerging from after hour clubs.<br><br>\nThis means that the brothers must put aside their differences and join forces to evade the police and government, all while learning whether or not the forces that have been deployed are even US troops.<br><br>I really liked the way this film depicted the way the troops casually tore through people's lives, unleashing sonic weapons and explosions, turning the ordinary family disagreements at the start into a small skirmish compared to the world decimating battle outside.<br><br>While this film has a small budget, the filmmakers do a ton with what they have. It really kept me watching and waiting to see what happened next. It's not perfect by any means, but it's really well done and I liked the framing sequences. Hey - they made $60,000 look awesome!<br><br>Plus, the website in the film, The Fringe Facts, actually points to info about the movie. Well done marketing!","user":"BandSAboutMovies","rank":[7,7]},{"title":"False Flag, Real Crap","rating":1,"date":"17 March 2019","review":"Avoid this at all costs unless you like poorly-made, direct-to-Walmart-discount-bins dross. The \"director,\" Aaron Garrett, has/had aspirations in becoming a professional wrestler, but made this pile of offal instead, merely because he thought making a movie would be a fun way to make money - and it shows. There is no artistry here. The most impressive thing about the production is how Mr. Garrett managed to con the City of London, Ohio and it's population of rubes into getting behind and participating in its making. Cheap and unwatchable.","user":"filthyslimypervert","rank":[10,17]}]