[{"title":"A solid dark comedy","rating":8,"date":"1 March 2019","review":"This film is a brilliant watch. The story is interesting and you never quite know which way it is going.<br><br>All of the actors did a brilliant job of portraying their characters, and it was nice to see such an interesting mix of international skills.<br><br>There is nothing I can say to the detriment of this film. Every aspect was spot-on and professional.<br><br>Well worth a watch.","user":"mjsreg","rank":[5,7]},{"title":"Highly recommended!","rating":9,"date":"22 February 2019","review":"Let me first start off by saying to all of you ass clowns voting down on the other reviewers comments that say this film is good is absurd, bizarre and all out fraudulent. This film was by far one of the best made films that I have watched so far in 2019. I haven't giving a 9 rating to no other film I've downloaded this year, because my 9's are exclusive for the the best of film making, and Toy Gun is definitely worthy of it. I so enjoyed this movie from the beginning, the middle and end. I highly recommend this film. It was refreshing and enjoyable. Julian Sands and Anthony Lapligia were superb. Disregard the down votes on the good reviews. They're jealous trolls on assignment trying to stop you from watching something very decent. I bet that haven't even watched the film.","user":"whitemanfromtowne","rank":[9,17]},{"title":"A Sheep in Wolf's Clothing","rating":10,"date":"10 April 2018","review":"\"Toy Gun\" is a fun and quirky little film with a set of characters that are a bunch of lovable losers!<br><br>The film's focus is on a young, despondent man whose wife has left him. In an act of desperation, he decides to rob a bank with a toy gun and miraculously gets away with the perfect crime. Everything comes together in the way that the surveillance cameras were turned off and another set of characters divert attention from him as the primary suspect.<br><br>The most interesting character in the film is a gangster named Gaetano Lolli, played with great gusto by Anthony LaPaglia. Gaetano becomes friends with the young bank robber, whose name is Ruggero Levati. He is played by an actor with a American accent, yet the settings of the film and the characters have Italian names. But who cares about such details with such a fun film!<br><br>Gaetano is a gourmet chef who wants to start a restaurant in Brazil. After robbing the bank, Ruggero becomes Gaetano's good luck charm, making withdrawals from a number of safe deposit boxes where Gaetano stashed stolen cash before going to prison.<br><br>The film also includes an incompetent police detective, who actually starts to figure out the bank robbery story when he is stymied by his police commander. Everyone in this film is incompetent!<br><br>There is also love story involving Ruggero and his wife Giulia. But the wise old con Gaetano tells Ruggero a memorable slogan: \"Act as a sheep, and the wolf will eat you.\" The young, passive man really appears to need this advice, and he takes it to heart.<br><br>Some of the best scenes in the film are the brief conversations between Ruggero and Gaetano. The latter is forever cooking up scrumptious meals. The food looked so good that it surprising that Ruggero did not put on weight in the course of the ninety-minute film! <br><br>There was much silliness in the unraveling of the crime story, which included multiple strands. But Gaetano is always ready with a witty expression for the moment. And the best one to describe the essence of this film is: \"Full bellies and full wallets!","user":"lavatch","rank":[8,15]}]