[{"title":"So Disappointing","rating":1,"date":"5 September 2018","review":"I watched this with my child who was so bored she wandered off within the first 20 mins. This could have been fantastic but was ruined by the very slow pace, poor script, poor (read diabolical) acting, lack of good cgi and wishy washy ending.\nI didn't read any reviews before watching it so wasn't swayed by other's opinions. I had seen the shorts previously and was looking forward to seeing it with the understanding that it was nothing like the Disney version &amp; it was only loosely based on the original Hans Christian Anderson story.\nHow on earth anyone could rate it higher than 3/10 is beyond me, I mean c'mon how awful was the actor playing Locke? My dog could play a better Wizard than this guy and for pete's sake the henchman with the feather, Argh!!, Oh and don't even start on dog boy!!\nThere was nothing breathtaking about the story or the visuals, every aspect was as dull as dishwater.\nI did however enjoy the song that Poppy Drayton sang, I just don't understand why there was a song at all though, just the one. That makes no sense, surely if the lead sings in the movie then you have a few songs scattered through at least? Or no songs, perhaps the producer just couldn't decide what to do.<br><br>VERY ho hum twiddle my thumbs, daytime tv movie stuff.","user":"lilyloo-79807","rank":[152,184]},{"title":"I would rather stare at the ceiling for 1.5 hours than watch this","rating":1,"date":"20 August 2018","review":"So so boring and pointless. Horrible acting, script and plot. One of the worst movies I've watched in my life.","user":"ccrisss","rank":[137,181]},{"title":"You should read this review.","rating":7,"date":"8 December 2018","review":"So there are a ton of reviews trashing this movie because they're coming from adults who (like me) grew up with Disney's Little Mermaid and have been waiting for the \"real people\" version of that movie to come out. But this movie is not meant to be a remake of Disney's Little Mermaid, it's meant to be a twist on that story. (I also think it's kind of hysterical the people saying the fight scenes were boring and didn't look real; it's the effin Little Mermaid, if you were looking for decent action scenes, you're an idiot.)\nDon't have expectations when you watch this movie; I'm not saying that in the sense you'll be disappointed, I'm saying that because this isn't Disney, and it's not \"the\" remake we've been waiting for; that'll come out eventually. This a children's movie based loosely off of the original, and I actually think it's good. It's not necessarily a movie I would watch again, but not because it sucked, just because it's a little too calm for me. And I think that's exactly what's good about it. This is exactly the type of movie I would put on while babysitting. It's sweet, it's clean, the love between Cam and Elle is inspiring, and the fighting scenes aren't intense at all.<br><br>@EVERYONE INVOLVED IN THE MOVIE: Well done, truly. You somehow got the green light to produce a movie in the 21st Century without violence, without sex, without hidden innuendos (as EVERY kid's movie has nowadays). Try not to let the haters bother you. Darkness will always try to choke out the light.","user":"tgarrett96","rank":[191,256]}]