[{"title":"The Heat","rating":8,"date":"24 March 2016","review":"Greetings again from the darkness. Cheese. Gas. Heat. The crowd perks  up when a power pitcher lights up the radar gun and starts ringing up  hitters. As narrator Kevin Costner points out, at the core of the game  of baseball is the epic battle between a man with a stick and one with  a rock  the bat and ball  the batter and pitcher. Director Jonathan  Hock digs into our fascination with those few who can throw a fastball  at speeds that cause even the elite hitters to struggle. A 100 mph  fastball gives the batter 396 milliseconds to react  quicker than the  blink of an eye.  Mr. Hock structures the film for maximum enjoyment and ease of keeping  up. I counted 13 chapters which such titles as \"The Big Train\", \"The  Heater from Van Meter\", \"Hoot\", \"The Fastest that Never Was\", \"Nolan  Ryan\", and \"The Fastest Pitch\" . Within each chapter we are treated to  a blend of archival footage, interviews with baseball legends, and  input from scientists and experts. The segments contrast the athletic  side with the scientific side  especially interesting given how over  the past 15 years, baseball has transitioned into such a risk strategy  of performance tendency metrics.  Listening to a physics expert discuss the \"Magnus Effect\", while  legendary hitters like Hank Aaron and George Brett describe a \"rising  fastball\", is quite an experience for those of us who so love the great  game. There is a history lesson, complete with photos and film, on how  measuring the speed of pitches goes back to Walter Johnson being  tracked through some contraption at the Remington Armory; Bob Feller's  pitch racing against a motorcycle; and a young Nolan Ryan going up  against a crude radar detector.  Different generations are discussed with insight from such legendary  fastball pitchers as Bob Gibson, Goose Gossage, Nolan Ryan, Justin  Verlander, Craig Kimbrel, David Price and Aroldis Chapman.  Unfortunately 80 year old Sandy Koufax is not interviewed, but we do  see some rare video footage from his 1965 Perfect Game. There is  discussion on earlier eras and pitchers such as Walter Johnson, Bob  Feller and the enigmatic Steve Dalkowski (who does make a brief  appearance). Gibson describing his infamous glare from the mound is  itself worth the price of admission. However, it's the great Nolan Ryan  who has the most camera time, which is understandable given his  unprecedented quarter century run as a power pitcher.  Just as interesting as listening the pitchers, is having the hitters  discuss the challenge in hitting the fastball. The difference between a  92 mph fastball and a 100 mph fastball is broken down scientifically by  the experts and real world by hitters such as Tony Gwynn, Al Kaline,  George Brett and Hank Aaron. The chalkboard and video clips work  together to make it clear just how difficult it is to hit the fastball.  As for the \"fastest pitch ever\", the mystery may never be solved.","user":"ferguson-6","rank":[19,20]},{"title":"A Verbal & Scientific Analysis Of The Heater","rating":9,"date":"27 February 2017","review":"For baseball fans, the question that this documentary delves into is an age-old one: Which hurler threw the fastest pitch in the history of the game? Was it Walter Johnson nearly 100 years ago? Maybe Bob Feller? Nolan Ryan? Or how about contemporaries like Craig Kimbrel or Aroldis Chapman? \"Fastball\" interviews both baseball greats and scientists in order to find out the \"answer\".<br><br>What this film does so well is that it knows the ultimate answer to its thesis query will be \"we are not sure...but here are some fun guesses\". There is no way to definitively prove anything. So, a large part of this documentary is spent talking with players who actually competed against the legends being debated. Guys like Joe Moran, George Brett, Tony Gwynn, Johnny Bench, Bob Gibson, Goose Gossage, and Nolan Ryan are given prominent interview footage in order to hear there opinion on the matter. This is much-needed for \"Fastball\", as the main question needs to be as much narratively-driven as scientific proved.<br><br>That isn't to say, however, that \"Fastball\" is all fluff...far from it! It does its best to include as much scientific analysis as possible, such as showing the methodology of the crude devices that once test the speed of pitches from Johnson, Feller, and Gibson, as well as the much more refined radar guns of today. A good solid half of \"Fastball\" concentrates on the scientific aspect of things, trying to quantitatively discover the fastball ball ever thrown.<br><br>Overall, baseball fans will really enjoy \"Fastball\" for a number of reasons (and I haven't even yet mentioned the great narration from Kevin Costner!). It tries its best to answer the question scientifically, but is also smart enough to realize that people's opinions have just as much weight in the discussion as due the numbers. This leads to a great melding of stats and stories that make \"Fastball\" multi-faceted enough to appeal to all crowds. Highly recommend as the start of another baseball campaign commences!","user":"zkonedog","rank":[6,6]},{"title":"baseball lover porn...:)","rating":10,"date":"11 June 2016","review":"I was spellbound watching all my hero's from a half century of loving baseball. I saw many of these guys play in real life ( live in Philly, my home) We boo'd Morgan and Ryan and even Shmitty but, as I enter my autumn years I have a better appreciation for their talents.<br><br>This movie is titled aptly. It is a history of the fastball and it is done like no other movie about the fast pitch I have ever seen. Seeing guys like Jeter, Brett and others showing that, while they are hitting gods; the pitcher is the real demon to slay...I have a new fondness for Nolan Ryan and Goose Gossage that I didn't have before...Goose is quite the character...I wish some Philly pitchers were in there like Shilling or Carlton but I guess they wanted the most awesome pitchers of all...<br><br>Great movie for older and young...","user":"brooksrob1","rank":[6,6]}]