[{"title":"Save your brain cells","rating":1,"date":"12 August 2017","review":"If you want to watch something worth your time, you might as well re-watch Strangers. Where do I start? The acting, the cinematography, the musical score, the pacing, the movie? All of it is terrible. <br><br>I was actually infuriated by the terrible accents, and god forsaken acting. The only reason I kept watching was to actually see if the movie could get worse, and SPOILER ALERT, it does. The gore is terrible, and you can't wait for the mother to be killed right from the beginning. Every character has an annoying trait that won't stop, and you constantly wish they are killed next. Save your time, your money, and your IQ for something with a little more substance.","user":"Acidpickle","rank":[19,21]},{"title":"Awful Garbage","rating":1,"date":"25 February 2019","review":"\"Cabin 28\" is one of those movies that make the viewer regret to have spent time watching it. The story and the screenplay are lame; the acting is terrible; the cinematography and special effects are poor; in summary, this film is an awful garbage. The only thing that works is the wonderful art of the Brazilian DVD cover that lures the viewer. Advice when most needed is least heeded. Anyway, the advice is to stay away from this crap. My vote is one (awful).<br><br>Title (Brazil): \"Cabana 28: Madrugada do Horror\" (\"Cabin 28: Dawn of the Horror\")","user":"claudio_carvalho","rank":[9,10]},{"title":"boring rubbish","rating":1,"date":"28 September 2017","review":"i would describe this film as no atmosphere,bleak,dull ,and so predictable it borders on cheese.its one of those films where you are constantly waiting for something to happen.i was maybe waiting for a family member to disclose some horrible reason why they moved to cabin 28,but it never happens.little black and white clips of the kids with depressing music playing.i am a big horror fan but i had to fast forward the torture scenes which they seemed to overplay just to get a reaction,where as i just found them sick .there is no ending it just drolls of into the distance with some more depressing music.so there you go ,i would definitely not recommend this film to anyone,i fast forwarded the last 20 mins out of sheer boredom.","user":"climbingtiger957","rank":[11,13]}]