[{"title":"A beautiful portrait of a complex, talented woman","rating":10,"date":"7 October 2018","review":"With \"Love, Gilda,\" Lisa D'Apolito creates an intimate portrait that doesn't sensationalize or romanticize her subject. I love how the film interweaves Gilda's letters, diary entries, archival footage of her childhood and career, and filmed interviews. It's really a love letter to Gilda!","user":"paulabernstein","rank":[13,15]},{"title":"LOVE indeed; a wonderful valentine to the beloved comedienne; one of the year's best films","rating":10,"date":"22 September 2018","review":"LOVE ,GILDA (2018) **** Wonderful documentary on the iconic late, great comedienne Gilda Radner, in her own words (literally her audio tapes and diaries as narrative) depicting her biography from her Detroit bred beginnings to improv group Second City and ultimately to overnight superstardom on Saturday Night Live. While basking in the limelight Radner's insecurities reflect upon her own setbacks including an eating disorder, self-esteem issues and looking for love with all the wrong people until redemption in her marriage to actor Gene Wilder and her valiant, inspiringly courageous bouts with cancer which she ultimately succumbed to. A beautiful valentine to a spirit that is sorely missed. One of the year's best films. (Guest stars - ANNE BEATS, CHEVY CHASE, BILL HADER, MELISSA McCARTHY, LORNE MICHAELS, LARAINE NEWMAN, AMY POEHLER, MAYA RUDOLPH, PAUL SHAFFER, MARTIN SHORT, ROSIE SHUSTER, CECILY STRONG &amp; ALAN ZWEIBEL) (Dir: Lisa Dapolito)","user":"george.schmidt","rank":[14,19]},{"title":"GET THEE TO A SCREEN TO SEE THIS DOCUMENTARY FORTHWITH!","rating":10,"date":"16 October 2018","review":"A heartfelt, honest look into a human who inspired countless women in comedy, and more than a few men as well, to shine their truth on life's foibles. You cheer for Gilda during this documentary, you relate to Gilda in this story of her life, and in the end, you're thankful for Gilda leaving this planet a better place than it was thanks to her having lived in it ... what a legacy. Cheers to you Ms. Radner, you comedic whirlwind of truth. Please do yourself a favor everyone and see this documentary!","user":"chrls-wtrs","rank":[8,10]}]