[{"title":"From a Native American point of view","rating":10,"date":"18 July 2018","review":"I absolutely loved Michael Greyeyes portrayal of one of the most iconic Native people in history. It was refreshing to see a Native person being seen as a 3 dimensional person with a sense of humor, intelligence, humility, etc. I am a native woman and was delighted to see our people seen as people. The story wasn't word for word accurate but the heart of the story was captured with grace &amp; dignity. Thank you for making this film and respecting the person &amp; people it represents.","user":"leamccormickmusic","rank":[144,153]},{"title":"A Poetic Approach to A Dark Material","rating":8,"date":"1 July 2018","review":"Can Jessica Chastain do any wrong?\nEvery project she chooses has beauty and sophistication.<br><br>I'm saddened by the ignorant and imprudent reviews which I read this week. Especially someone calling it \"listless\". The ongoing hype on action movies and the many dialogues in movies have seemingly numbed the senses of the average moviegoers as they cannot anymore feel without touch, hear without words and see without movement..\nThe movie contains so many touching moments, relatable characters, an emotional bond between the leads, a sensitive approach to a dark material and a stunning cinematography which will make me watch the movie again on the big screen.<br><br>Since the topic on Native American rights, Standing Rock and pipelines is as relevant as ever, this movie is of great importance and should not be treated as a forgettable indie film - Shame on the so-called critics.<br><br>The Native Americans are treated and depicted respectfully by giving them character traits, letting them speak in their own language and showing their bond with nature and their understanding of life. In all movies about Native Americans which I watched, there has always been strong violence, humiliation and vulgarism. Noteworthily is the final shot of a white horse dancing upon hearing a gun shot accompanied by Jessica Chastain's painting-like suffering on the ground - with her loose and long hair which emphasises her long-awaited freedom !\nSo happy to finally watch a female Western about Native Americans, which is as beautiful as a Romantic painting and as touching as an elegy.","user":"Polar-Night","rank":[104,114]},{"title":"Absolute Beautiful Movie","rating":10,"date":"30 August 2018","review":"Thank you for bringing this wonderful historical movie to the big screen. Jessica was outstanding, as were all the Native American actors. I had not seen any of them before in a film, they were superb! Sam Rockwell always plays such a GREAT BADASS. He should get a award nomination as well for his work in this movie! My hope also is that Native Americans continually regain their power and their beautiful culture and spirituality stays intact for eternity.","user":"krnmrcl","rank":[46,52]}]