[{"title":"Warm and real","rating":8,"date":"8 February 2019","review":"Saw this at the Reel Canadian Film Festival in Fernie, BC in January 2019. (The screenplay is by Canadian director, Michael McGowan). The audience loved it.<br><br>The cinematography and set direction are superb, the acting is lovely and the pacing is great. The character development is complex and layered; the relationships really develop over time.<br><br>Suspend your disbelief a little of the why anyone from Scotland would travel to the US for medical treatment without a referral or a real diagnosis. The book that the story is based on is set in Italy, and has the protagonist move from rural Italy to Milan, which makes a lot more sense. To have had Rory move from Lewis to Glasgow or even London, or from rural USA to San Francisco, would have been an easier sell, but then there wouldn't have been the transatlatic appeal or all the wonderful notes from the Highlands of Scotland.<br><br>There's a few other plot holes you'll need to get over too, but this isn't meant to be a a serious study. It's a lovely warm romantic comedy-drama gem that will make you leave the theatre smiling and wanting to spend more time with the people you love.","user":"albamerlot","rank":[10,12]},{"title":"One of the best!","rating":10,"date":"11 May 2018","review":"I watched this film yesterday evening and am still slightly in awe. The combination of humor and more emotional scenes was honestly breathtaking. The story teaches a very important lesson about family and values.","user":"sarahmorgenroth","rank":[25,39]},{"title":"A wonderfully touching film!","rating":8,"date":"7 October 2018","review":"***Spoilers!***<br><br>\nAlthough it makes no sense for a Scotsman living on a remote island to travel to the US for (very expensive) health care when he could hop on a boat to Glasgow or, if necessary, London, I tried to overlook that and enjoy the story.<br><br>And enjoy it I did, although the appallingly misguided parenting choices of Thora Birch's character so annoyed me I almost packed it in after the first 15 minutes or so. Anyone who willingly leaves a baby to cry endlessly doesn't deserve to have kids and I don't want to watch a film about such people.<br><br>With that out of the way, I have to say, also, I've never liked Brian Cox much, but he is wonderful here as a grumpy, tell-it-like-I-see-it Scotsman, very much a fish out of water (in more ways than one), in sophisticated San Francisco.<br><br>Another thing that kept bugging me is why would this old guy fresh from his wee cottage in Scotland have dyed hair? Brian Cox may have dyed hair, but it's impossible to believe that his curmudgeonly character, Rory, would. Plus, it kept changing colour throughout the film. Weird.<br><br>Rory's growing relationship with his baby grandson was a precious thing to see, and I hope all those dimwitted parents who think it's a good idea to ignore a crying baby get the message that it is only okay if your intention is to teach your baby what it's like to feel unloved and abandoned. <br><br>If you love someone, tell them. Support your children to live THEIR dreams, not yours. Nobody is on this Earth to live up to YOUR expectations (except maybe YOU). If you love someone, tell them.<br><br>There are lessons to be learned in this film, along with the charm and the smiles and the teary eyes. Very much worth watching, I say.","user":"backofthevan","rank":[14,21]}]