[{"title":"Great","rating":8,"date":"23 February 2020","review":"Christian Bale is absolutely tremendous, delivering a quietly intense performance in this brutal revisionist Western that carefully (yet incisively) examines the consequences of a merciless cycle of hatred that only dehumanizes people and turns them into beasts and monsters.","user":"MR_Heraclius","rank":[43,44]},{"title":"An all-around outstanding film with heart and substance","rating":9,"date":"5 December 2018","review":"I'm disappointed at the low score and wannabe critics tearing this film apart politically, morally and historically.<br><br>This is not your typical Hollywood production, but instead, a very touching and beautiful film.<br><br>This is Scott Cooper's 4th film he both directed and wrote, and he nailed it. I hope to see much more from him in this caliber, and he is the one to watch as his resume grows.<br><br>This film was near perfect in every category. If the pace was a little faster and/or perhaps the 134 min length a little shorter, it would have been a perfect 10/10 from me.<br><br>It's been a while since I've seen a film so perfectly cast - all cast, ever single one of them, and they all performed just as great, especially Christian Bale and Rosamund Pike, who both were exceptional in their roles.<br><br>If you're expecting a wild west action Western, this isn't it. But if you want to see a near perfect film the way they used to be made, this is a gem. Ignore the negative reviews and just watch it. Would I see it again? Yes. Would I recommend it? Absolutely.<br><br>A well deserved 9/10 from me and mad props to Scott Cooper for this beautiful gem of a film.","user":"TheTopDawgCritic","rank":[126,146]},{"title":"A Poetic Film With A Knockout Christian Bale Performance!","rating":9,"date":"15 July 2018","review":"Scott Cooper's 'Hostiles' is a poetic film, that explores life &amp; death with gut-wrenching violence &amp; a hard-hitting narrative. This isn't an easy watch &amp; nor does it want to be. Its a film about hate, divide &amp; circumstances, &amp; Cooper along-with leading-man Christian Bale, deliver a deeply affecting &amp; meditative experience.<br><br>'Hostiles' follows a U.S. Cavalry officer (Bale) who must escort a Cheyenne war chief (A Fantastic Wes Studi) and his family back to their home in Montana in 1892.<br><br>'Hostiles' is about people haunted by their past &amp; their actions towards one-another. Every character here, be it the protagonist, or the characters around him, are unsettled &amp; victims of hate &amp; hatred. This is a story about people who want to question their hate for one-another, but are unable to, due to their given circumstances. This is a human story &amp; the sheer brutality here depicts a side of humanity we all are aware off. Its told with honesty, albeit, with gut-wrenching aggression.<br><br>Scott Cooper is in top-form this time around. 'Hostiles' is a slow-moving, poetic piece, that sees the filmmaker in strong command. Cooper captures the bleakness &amp; conflict, with remarkable understanding. Cooper's Vision is astonishingly captured by Cinematographer Masanobu Takayanagi, who paints 'Hostiles' into a visual marvel. Takayanagi's Camerawork is meditative &amp; skillful to the point of perfection. Editing by Tom Cross adapts perfectly to the film's pace &amp; offers sharpness overall. Art &amp; Costume Design are pitch-perfect. Max Richter's Score is beautiful.<br><br>Performance-Wise: Christian Bale delivers a knockout performance. As the conflicted &amp; haunted Cavalry officer, Bale portrays the part with rare conviction. Its no new fact that Bale is among our greats, but 'Hostiles' shows us a side of his that may have just put him up there, right next to the all-time screen giants. What a wonderfully nuanced performance by Bale. Of the rest of the cast, Wes Studi portrays his complex part fantastically. Rosamund Pike is restrained. She's controlled &amp; believable all through. Jesse Plemons is solid, as always. Ben Foster plays a yet another unlikable character, with the perfect blend of menace &amp; insanity. Rory Cochrane is first-rate. Timothée Chalamet makes a very brief appearance, yet he does his bit nicely. Stephen Lang, again in a cameo, is outstanding! Others lend good support.<br><br>On the whole, 'Hostiles' demands a viewing on the strength of its sheer merits. Don't Miss This One!","user":"namashi_1","rank":[129,156]}]