[{"title":"Step by step transformation of a man","rating":10,"date":"9 June 2018","review":"As someone who lives in Luxembourg for several years I went to see this movie this evening. Just came back. Be warned this is not the mainstream kind of movie with car chases and pouring with gun shots (although there are some in it ;) ). But if you like beautiful scenery, great cinematography, flawless acting (and some sexual scenes) and a great story - this is it! It is in the style of The Wicker Man or Bergman movies. The story is catching from the very beginning. While it develops slowly, step by step, it is almost like a teasing - I never felt bored. The end is with a twist and the story is actually a metaphore trying to capture the soul of this country. It lives you with an emotional aftertaste which only great movies can deliver. I look forward to buy it on DVD to watch it again later.","user":"zarathustra-14","rank":[20,30]},{"title":"The De-Evolution of a Simple Being into a Cultured Brute","rating":8,"date":"15 January 2019","review":"Frederick Lau plays the neanderthal-like drifter and Vicky Krieps is the wild-feminine in Govinda Van Maele's movie that metaphorically explores the moment at which a pure being becomes simultaneously spoiled-to-his-soul, yet capable of succeeding in \"society.\" Much in Europe lately has been made of neanderthals being a common genetic precursor in Europeans, and that they are considered to have been kinder, simpler, and more egalitarian than the human beings that overtook them. Lau's drifter has a built up brow and heavy features of a being not at ease with the modern world, and as he becomes domesticated, his wide nose, heavy brow, and thick hair diminish. Even though he seems to feel the scenery viscerally, and has an innate sense of decency (as when he stops the farmers from brutally punishing the children), he's also possessive of his lover, and incapable of clear communication. As he (who ends up being a robber--someone unable to succeed with integrity at urban life) becomes more affected by and accepted by the villagers around him, he simultaneously becomes less himself: less perceptive, more brutal, less sensitive to his surroundings, which is expressed in a sexually violent scene with Krieps. The treasure of this movie is that it is a metaphor for all that human beings trade in terms of authenticity for becoming part of society, especially one that has a brutal history. To become included, Lau's character not only gives up all that made him an instinctive, holosapient being, but ultimately, completely loses himself.","user":"jillscheintal","rank":[7,9]},{"title":"a German thief who flees to a small Luxembourg village only to discover that the locals have secrets of their own.","rating":10,"date":"7 October 2017","review":"After a successful heist, casino robber Jens crosses the German/Luxembourg border with a bag full of cash and arrives at the rural town of Gutland. At first the locals are not welcoming, but when Lucy, the governor's daughter spends the night with Jens, everyone's demeanor changes and he's immediately offered a job as a farmer and a place to live in. If this sounds like things are going too good to be true, you're right. Gutland is a film full of ominous dread, there's a sense of suspicion at what may lay beneath the surface of the sleepy folkloric town. <br><br>GUTLAND directed by Govinda Van Maele is a slow burn thriller in the vein of THE WICKER MAN (the original, not the blasphemous remake) where a stranger arrives at a seemingly idyllic town only to discover that there's something ominous going on and despite his better judgment and warning signs he's still compelled to stay. There are two type of thrillers at play: the mundane heist and its aftermath which anchors the film in the real world and the more bizarre almost supernatural (but maybe not) mystery surrounding the village and its denizens. This is a balancing act that in other filmmaker's hands would be a jarring collision of tones and genres, but in Van Maele's hands becomes a seamless junction that introduces us into the village of Gutland the same way that Jens does, we come from a world of robberies and petty crime and we enter uncharted territory, and we stay until its inevitable final moments.<br><br>Van Maele's eye captures the beauty of the Luxembourg country side as a means to distract us from what is really going on, a way to get us to see things from the point of view of Jens. It combines film Noir elements with rural horror that verges into European folklore. An atmospheric mystery which further grabs hold of us and doesn't let go, much like the town does to Jens. <br><br>GUTLAND is equal parts beautiful and creepy, it gets under the skin and dies there long after the credits roll.<br><br>Review by Enrrico Wood Lagonigro - Senior Curator Oaxaca FilmFest.","user":"contact-742-500835","rank":[13,24]}]