[{"title":"I enjoyed this movie","rating":8,"date":"23 February 2020","review":"Deadpool is a great movie filed with a lot of jokes, however, it is above age 18 in since it contains a lot of bad words. The first movie of Deadpool I did not like a lot, however, the second one was a great movie. The first one was because it did not have a lot of meaning hidden, it was just a Marvel movie, however, the second one was the opposite its main idea was love, and this is the reason that I liked the second one more.","user":"MR_Heraclius","rank":[39,44]},{"title":"Honest review of all 3 versions","rating":7,"date":"23 January 2019","review":"It's true that you can have too much of a good thing...please no more different editions!<br><br>THEATRICAL CUT - was the best version of any of the \"cuts\" it was the most cleanly edited and it had the best soundtrack out of the three. It is clear after seeing all the versions of the film that they tested all of the jokes and the ones included were cherry picked, and the best were picked to be included in this one.<br><br>SUPER DUPER CUT/EXTENDED - this was supposed to be an extended version of the film but it was actually a different cut...what I mean by that is that they changed the soundtrack and they cut out what I considered to be some of the funniest jokes from the theatrical cut and replaced them. They ALSO added some additional footage to the film after making those changes. This version of the film feels darker and less funny to me personally so I prefer the theatrical cut over it.<br><br>ONCE UPON A DEADPOOL/PG13 - This is the edition that nobody asked for and is the most unnecessary. From an editing standpoint this version of film is very sloppy, and seems like one giant montage. They don't even start this version of the film out at the beginning it jumps right into the \"safe room scene\". A lot of the footage included in this edition was already available on the home releases and online (apart from the short amount filmed with Fred Savage). The movie would end up edited on TV regardless of this edition existing or not. So in reality there was no need for this edition to exist apart from making more money.","user":"DeadMansTrousers","rank":[21,25]},{"title":"Deadpool 2: Worthy sequel","rating":9,"date":"22 August 2018","review":"I loved Deadpool (2016) I was blown away by it and Reynolds commitment to the character, it was fantastic.<br><br>I was however heartbroken when I saw the first trailer for this sequel, it looked pants. Not just pants, I mean granny pants. 15yr old, torn, badly stained (4 different shades) granny pants.<br><br>I've never been so happy about being wrong. Deadpool 2 delivers and is easily comparable in quality to the first movie and I sure as hell did not expect that.<br><br>With fantastic new additions, all the returning cast and excellent cameos this is the Deadpool sequel I desired but didn't expect (Or possibly deserve).<br><br>With it's brand of over the top violence, quick fire humour, endless pop culture references and Reynolds in the role he was born to play Deadpool 2 is a worthy sequel in a franchise that I don't ever want to end if it continues like this.<br><br>So damn funny, I can't wait to see what they do with the third movie. The concept however of bringing Deadpool into the existing Marvel Universe though fills me with dread. How could Deadpools brand of R rated goodness possibly fit into the Disney universe? Don't........do it!<br><br>The Good:<br><br>Cast are fantastic again<br><br>So damn funny<br><br>Action packed<br><br>Soundtrack as random as it may be<br><br>The incredible during credits scenes<br><br>The Bad:<br><br>That kid, he's just beyond annoying in everything he's in<br><br>Some questionable casting choices for the new characters<br><br>Things I Learnt From This Movie:<br><br>Everyday should be international womans day<br><br>Vinnie Jones is all grown up","user":"Platypuschow","rank":[58,88]}]