[{"title":"Fool me once ....","rating":1,"date":"14 July 2016","review":"Why even bother to have a review section for any films made by The Asylum?<br><br>They specialize in really bad knockoffs as a ploy to catch some of the money that will be spent on the real film - Suicide Squad - an upcoming film that is expected to pay off big. It obviously works for them - because they have been doing this for years now ... <br><br>I have yet to see anything original and/or even marginally decent come from their studios yet. The movies have no real humor and the plot only loosely, and I mean loosely, follows that of the film they are parodying. They know that once you have paid for the film that it is too late. They don't survive on word of mouth or return customers - unless you let them get one over on you again. ;-)<br><br>Next time you see a film with a familiar sounding name - check out who the studio behind it is first. Don't let The Asylum get your hard earned money .....<br><br>*If the other reviewer had known this - they would've got the 0 he originally wanted to hand down. It only looks original because they always beat the blockbuster in releasing - they have to or their ploy doesn't work ...","user":"j-e-mcfarland-iii","rank":[65,75]},{"title":"No. Simply just no...","rating":1,"date":"11 November 2016","review":"Every now and then The Asylum do manage to hit the nail right on the head. Unfortunately, more than often they swing wide and miss even wider. And such was the case with the 2016 mockbuster \"Sinister Squad\".<br><br>I must admit that I entered this movie with little or no expectations at all, especially since it was going to be a rip off of \"Suicide Squad\" and also because I didn't recognize anyone in the movie. But mostly because this is after all another The Asylum release.<br><br>I managed to suffer a full 22 minutes and 12 seconds into the movie before I was ready to claw my eyes out and just simply downright gave up. I threw the towel in the ring and went to watch something else. I usually don't easily give up on a movie, but there was absolutely nothing compelling about \"Sinister Squad\". Nothing to make me want to sit there and hope for it to get better.<br><br>From what I managed to gather from what I saw was that the story was about fairytale and mythical beings being recruited for something. And that was about as much as I comprehended from the movie.<br><br>The acting was abysmal, as it usually turns out to be in these types of movies. So don't get your hopes up here, not even the least.<br><br>The effects and creature designs were poor, to say the least. If they at least had proper effects and CGI, or even just proper make-up and wardrobes for the acting talents, then perhaps I would have stayed for more than just a little over 22 minutes.<br><br>I lost every will to watch more of \"Sinister Squad\", and I am not even going to bother to return to finish the rest of the movie.<br><br>This is not the brightest of moments in the history of The Asylum. Now, mind you they do put out something good and entertaining every now and then, but \"Sinister Squad\" is a movie to avoid like a bad case of flu.","user":"paul_haakonsen","rank":[4,4]},{"title":"What is seen can not be unseen","rating":1,"date":"24 November 2016","review":"If they picked up a dozen of random teenagers from the street and gave them 24 hours to make the movie using just cellphone and home computer, the result would be much better for sure. Story... I saw porn movies with a much better story than this one. Acting... may I even call it acting...Fantasy/Sci-Fi without CGI and with traces of costumes and makeup that look like they were created by 5 years old. It is completely unbelievable to me that someone made this crap, even more confusing why would anyone agree to act in it, and the most unbelievable of all is that any theater or TV station was ready to show it. This is probably the worst piece of crap I ever sa... tried to watch. I gave up after about 20 minutes and I never do that. I am ashamed that I watched even that much, and how makers and actors of this live with themselves after doing it... I really do not understand.<br><br>0/10","user":"Bored_Dragon","rank":[5,6]}]