[{"title":"Snow is not our friend","rating":7,"date":"5 October 2017","review":"Greetings again from the darkness. Man vs Nature movies tend to remind us of both our tenacity when things go badly, and our lack of control or overall insignificance in the big picture of life. This tends to be true in the mountains, on the water, under the ocean, in caves and in space. Twin brothers Alex Smith and Andrew J Smith have adapted and co-directed this film from a short story by David Quammen. The filmmakers were raised in Montana, and have an inherent feel for the stunning and often treacherous landscape.<br><br>Matt Bomer, in a sharp left-turn from his usual pretty-boy roles, plays Cal, a live-off-the-land mountain man with seemingly few needs outside of food, water and a desire to connect with his teenage son through a hunting trip. Josh Wiggins (who exploded on the scene in 2014's HELLION) plays David, a suburban Texas boy who is out of his element without his cell phone. The opening panoramic view of snow- covered mountains is contrasted with David's engrossed concentration on his hand-held video game as the plane approaches the landing zone. \"How was your year?\" is David's greeting from Cal, instantly elucidating their relationship.<br><br>Cal excitedly reports to David that he has been tracking a bull moose for 11 weeks, and wants this to be David's first big game kill. We are constantly reminded that this isn't trophy hunting, and that this single moose will provide Cal enough meat for a year. David has no real interest in killing a moose, but longs to connect with his father  and \"longs\" is interpreted through the teenager's shrugs, glances and body language. Wiggins plays David with the subtle authenticity of the teenagers most of us have known, raised, and at one time, been.<br><br>As Cal explains the history of the mountains, he also works in stories of his youth when his father (David's grandfather) was teaching him the ethics of nature. Numerous flashbacks feature Bill Pullman and Alex Newstaedter (as young Cal). The flashbacks are a bit artsy, and sometimes intrusive, but in the end, form a parallel story structure that works.<br><br>A couple of poor decisions lead to an accident that could be straight out of the Dick Cheney's field guide to hunting. Cal and David are both injured – Cal severely so. It's at this point where David must grow up quickly. The skills he has learned, or at least absorbed, are now necessary if he expects to save his father's life. What was a story of two polar opposite blood relatives trying to connect, transitions instantaneously into one of survival, maturity, persistence, and love. <br><br>Movies such as THE REVENANT and THE EDGE come to mind, but this one is short on thrills, and is instead a trudging struggle to survive – taking a quiet approach, rather than a showy one. Lily Gladstone, fresh off her terrific work in CERTAIN WOMEN, has a brief sequence near the film's end. The beautiful landscape and terrain is captured by cinematographer Todd McMullen, while Ernst Reijseger's score effectively complements the odd mixture of slow pacing and non-stop danger. Whether you are trying to live a reclusive life off the land, or simply one of the many parents attempting to connect with their kids, keep in mind that regardless of the beauty of the mountains, \"snow is not our friend\".","user":"ferguson-6","rank":[40,55]},{"title":"Great Film. Worth the watch.","rating":8,"date":"29 August 2018","review":"It always amazes me, the film snobs on here that rate films so low. This was a drama that unfolded at exactly the right pace. If you are impatient or just dumb you may not get the film. So all the low ratings are just silly. A lot happens here, between a boy and his father. Be patient, the results are well worth the wait. Great acting, cinematography and directing.","user":"michellepugh-964-461455","rank":[17,23]},{"title":"Real vs. VFX","rating":8,"date":"2 April 2017","review":"Although this film is being compared to \"Revenant\" it can stand on its own merits. Call me old fashioned but, I love the fact they used a real grizzly. This not only added to the realism of the film but created film viewer anxiety. The aerial cinematography is outstanding and is not overdone. As with many movies where the editing around footprints in the snow falls short, this did not. The director took special care to work in the fresh snow. Several times I thought of the real danger the actors could be walking into. <br><br>Bottom line, the film had one shortcoming, the score. Even though the music blends into the scenes beautifully, it doesn't fit the wilds of Montana.","user":"denisekleiner","rank":[42,64]}]