[{"title":"\"The hand that holds the pen writes history\".","rating":6,"date":"4 January 2019","review":"Colette is yet another tale of female empowerment: a woman with real talent trying to break out of the gilded cage she finds herself trapped in.<br><br>This is a true story, set in Paris in the late 19th Century. Colette (Keira Knightley), a beautiful country girl living in Burgundy is seduced by and then married to the much older Parisian 'literary entrepreneur' Willy (Dominic West). Willy is a \"brand\" in Paris: a well-known critic turned author. The only problem being that he does virtually no writing of his own but ghosts work out to his team. Colette exhibits a gift for writing slightly lascivious tales of her life (under the pseudonym Claudine) at her girl's school, where clearly nighttime swimming lessons taught more than back stroke! As a result, Willy fills a financial hole by publishing Colette's work in his name. The books fly off the shelves faster than the publishers can print them. But Willy has expensive habits and Colette gets locked into writing an ever-popular series but without a voice of her own.<br><br>If the \"swinging 60's\" started anywhere, it was probably in Paris during this time period! While Victorian England was staid and conservative, Paris - home of the Moulin Rouge - was a hot-bed of liberation. As a result, Colette and Willy's marital affairs are - erm - sexually 'fluid'. While Colette has to learn to live with her philandering 'Free Willy', he positively encourages the bi-sexual Colette to explore the other camp, as it were.<br><br>Keira Knightley turns in a truly cracking performance in the titular lead. No-one does 'brooding' better than Knightley, and she gets ample chance here to exercise that look, most notably in a train scene near the end of the film: if looks could kill.<br><br>Dominic West delivers as reliably a solid performance as you would expect from him, but he is such a despicable and loathsome character that it is difficult to warm to him.<br><br>Driving me mad (not sexually you understand.... although...) was the girl playing the American double-dip love interest Georgie: I knew her so well but just couldn't place her. It was the American accent that threw me: she is of course Eleanor Tomlinson, Demelza from TV's \"Poldark\", here showing a lot more flesh than she can get away with on a Sunday night on BBC1!<br><br>The film is obviously in English about one of France's literary greats (although curiously Colette writes in French). My guess is that the film will go down like a lead balloon in France as a result. A part of me would have liked this to be French language with subtitles, but maybe that's just me.<br><br>When you look at it objectively, Colette's story is quite remarkable: what a clever and determined woman.<br><br>Aside from Knightley, the other star turn in the film comes from cinematographer Giles Nuttgens (who also did \"Hell or High Water\"). The scenes, particularly the bucolic ones set in the French countryside, are simply gorgeously photographed. The framing of the shots is also exquisite with an impressive shot of the slog up a spiral staircase to the couple's flat being repeatedly used.<br><br>It remains curious to me how prudish both the UK and the US are still about sex on screen. In the UK the film is a 15 certificate; in the US the film is R-rated! Yes, there are some breasts on show, and a few mixed- and same-sex couplings (particularly during a frenetic 5 minute period in the middle of the film!), but they are artfully done and you don't get to see much more than the breasts. In comparison, the violence that would get meted out during a 15/R action thriller would typically makes my eyes water.<br><br>This is one of those films that is worthy, beautifully done, well acted but for some reason it felt to me like a bit of a slog. At 111 minutes it certainly felt a lot longer than it was. The middle reel of the film in particular is rather pedestrian (and yes, I recognise the irony of the fact that I just said there was the frenetic 5 minutes of sex during that part!). Maybe on the night I was just not in the mood for this type of film.<br><br>The director is Englishman Wash Westmoreland, whose last film back in 2014 was the impressive \"Still Alice\".<br><br>I'm glad I've seen it, and it is a lot better than many films I saw last year. But in terms of my \"re-watchability\" quotient, its not going to rate that highly.<br><br>(For the full graphical review, please check out One Mann's Movies on the web or Facebook. Thanks).","user":"bob-the-movie-man","rank":[57,62]},{"title":"Watch it for the stellar performance by Keira Knightley","rating":6,"date":"16 October 2018","review":"\"Colette\" is a biopic about noted French writer Gabrielle Colette. As the movie opens, we are in \"Saint Sauveur 1892\" where Colette is in a passionate relationship with an older guy nicknamed \"Willy\" (whose real name we don't know), an entrepreneur/writer/publisher/womanizer. Next we are in \"Paris 1893\", and the two are now married, and feeling at home as socialites. As always, they need more money to support their life style, and one day, at the encouragement of Willy, Colette writes a book loosely based on her own childhood and youth, \"Claudine At School\". Published under the nom-de-plume Willy, the book is an unexpected critical and commercial success... At this point we are 15 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how t all plays out.<br><br>Couple of comments: this is the latest movie from UK director (and co-writer) Wash Westmoreland, whose previous film was the Oscar-winning \"Still Alice\". Here he brings the improbable story of Gabrielle Colette to the big screen. Given the many twists and turns that she encountered in her life, some (but certainly not all) of which are reflected in the movie, I don't want to say a whole lot more about that, so as not to spoil your viewing experience. Do allow me to alert you to the fact that Colette was nominated for the Nobel Prize of Literature in 1948, a fact that is never even mentioned in the movie, not even in the closing moments as to what became of her in later years (the movie covers roughly the years 1892-1905). \"Colette\" is, as a movie, neither a masterpiece nor a disaster. That is not a strong recommendation obviously, but it's still worth checking out for the stellar performance of Keira Knightley in the title role. It seems as is Knightley threw herself into this role without holding anything back. Dominic West, as Willy, does quite well too but of course plays an inherent unlikable character. I also have to say that I found it a bit off-putting to see all of these characters, living in France, reading French language newspapers, writing French language letters and diaries, etc. all speak... English.<br><br>\"Colette\" premiered to good acclaim at this year's Sundance film festival. It finally opened recently at my local art-house theater here in Cincinnati. The early evening screening where I saw this at was attended nicely (and mostly by seniors for some reason). If you are interested in finding out more about one of the best French female authors of the 20th century, even if the film is far from perfect, I'd recommend you check this out, be it at the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion.","user":"paul-allaer","rank":[59,81]},{"title":"Wrong Language Wrong Cast-","rating":6,"date":"20 December 2018","review":"My main criticism of this film is that in my view iconic non English characters rarely work if portrayed by actors of another nationality.\nI suspect I may have enjoyed this interesting story based on the real life experiences of .possibly the most famous female French .author Colette more as a French film with French actors.\nI just think it may have lost some of the subtlety of language and atmosphere\nThe actors Keira Knightley as Colette and Dominic West as her husband Wily are good in their roles but imagine for example Beatrice Potter portrayed by Audrey Tattou or Agatha Christie starring Marion Cotillard it would be odd to my mind also and fail to successfully capture their Englishness .\nIn this movie the dialogue is totally English but when Colette is writing, she writes in French, perhaps I'm too picky , it just seemed a little strange.\nThe story of a husband taking the fame and literary credit for his wife's brilliant writing talent and the wife's compliance to hold a marriage together was told earlier this year far far more effectively in \"The Wife\" starring Glenn Close.\nThis film is about Colette but at times seems dominated and more about Wily the husband they seem to me at times both totally unstable and incompatible especially sexually and emotionally.\nWilly, fourteen years older than his wife and one of the most notorious libertines in Paris, introduced Colette into avant-garde intellectual and artistic circles while engaging in sexual affairs and encouraging her own lesbian\nIt's worth seeing , not great or an award contender as far as I'm concerned but a very interesting story about a fascinating character who wrote the famous Claudine novels and of course her famous 1944 novel Gigi, which inspired the much loved Lerner and Loewe musical of the same name.","user":"tm-sheehan","rank":[41,57]}]