[{"title":"Fantastic casting","rating":8,"date":"17 February 2019","review":"Each and every cast member seems to be perfectly picked to play their part with the exception of Hilary swank. Wowza. She was like a robot. IM FBI AGENT. ME SPEAK MONOTONE. MEANS I AM IMPORTANT AND BY THE BOOK.... Other than that, this is a great movie that is different than the average crap shoved down your throat regularly. Adam driver and the two brothers made me laugh. Daniel Craig with a southern accent and that feeling like he was always a second away from murdering somebody...The father daughter relationship with Channing and the super cute little girl was something that almost could have felt forced but it certainly didn't. Very well written (by whomever) screenplay and even better casting.... I could go on. Skip the blockbuster crap and watch more movies like this so hopefully more movies like this get made..","user":"gjkrulick","rank":[18,20]},{"title":"A welcome surprise at the end of summer","rating":7,"date":"31 August 2017","review":"After a summer of remakes and so called blockbusters i popped along to watch this with no hopes or misgivings...I hold an unlimited card so went knowing the cost was immaterial.<br><br>What I found was typical of the kind of movie you decide to just take in because I have a card and 2 hours to spare..<br><br>A little cracker of a gem to finish off the summer.<br><br>Some people are complaining about it not being what the trailers says it is...but if you know about movies then you should know that they never are.<br><br>A very well made \" Just watch it\" movie which never takes itself too seriously and makes you smile and chuckle from start to finish.<br><br>Everybody is in on what this movie should be..in my opinion somewhere in between \"Stir Crazy\" and \" The Italian Job\" ...with a pinch of \"Twin Peaks\" added to the recipe.<br><br>Surprisingly cheerful and just what the doctor ordered for the onslaught of the usual rehash and part 2's and 3's. <br><br>The only way to make up your mind is to suspend your senses and dabble with this for a while.","user":"Alanjackd","rank":[80,105]},{"title":"Not The Film You'd Think","rating":8,"date":"29 August 2017","review":"I saw this film at a drive-in, and it was the second film in the double feature I had gone to see. For the culturally deprived, drive-ins still show two features. Anyway, this film was a revelation. At first I had expected that the working-class characters would fall into their designated stereotypes and we'd chug along to an easily-expected finish.<br><br>Not so much.<br><br>Actually, the characters were nicely filled out, there were stereotypes but not the ones I expected, and the movie had some rather nice convolutions to it and contrary to some other reviewers I found the late-arriving Hillary Swank to be a really interesting addition to the cast - and a possible bell-weather to a sequel. Just sayin'. There was comedy, drama, some real-world concerns and a lot more. Go see it. The cast and script alone will make it worth your while.","user":"spiritof67","rank":[79,109]}]