[{"title":"Roller-coaster of emotions","rating":8,"date":"22 August 2017","review":"Well I was expecting seeing a comedy with a bit of drama but instead it was a drama with a lot of mixed emotions. From laughter to tears, it's an emotional roller-coaster during the entire movie. The first part of the movie I kept thinking that it was well done but nothing more. But then I grew into the movie. The more the movie advanced the more I really liked Patients. I will gladly watch this movie again in the future. About everything is good in this movie, the soundtrack, the story, the cast, the photography, everything. Not only you get to watch from close by how hard it is to keep the moral high when you become a quadriplegic or another handicap. Some patients do everything they can to get better, other have just no hope or courage. It's not easy for anybody, from patient to caregiver. The movie made me think a lot, how fast our lives we're used to could turn. It made me realize even more that you should be thankful for every second you're in good health and to try to keep it that way. Enjoy life at the fullest while it's still possible. The cast was sublime to watch, every single character was well thought of and brought something special to the movie. A must watch if you ask me.","user":"deloudelouvain","rank":[11,13]},{"title":"What a movie","rating":10,"date":"15 July 2018","review":"When you go to the cinema and you enter to see a french movie, you know that there's a 99.9% of probability for it to be one hell of a movie. And 'Patients' is.<br><br>It is full of funny and sad moments that will make you smile, laugh out loud and probably a tear (or some tears) will start coming out of your eyes. The acting and the dialogues are just powerful and moving, and everything in it made me feel comforted and motivated to move on.<br><br>10/10 A great movie that has to be seen not only by film lovers, but by everyone especially for the ones who are passing through a crisis and don't know how to deal with their personal issues that don't let them move on. This film is written for them. And for all of us.<br><br>Thanks for reading!","user":"maurodc","rank":[5,5]},{"title":"A piece of art","rating":10,"date":"16 March 2017","review":"\"Patients\" is one of these movies that will change your life and transport you far far away. It would be a mistake to not give a chance to an experience like that. The story is touching and beautiful, the tone is rough but funny as well. Acting is simply amazing and incredibly natural. The photography is sublime (some parts are speechless between the intense music and the pictures)...well the list of qualities could be very long. <br><br>This movie is full of intelligent humanity marked with respect and positive building. To say that I loved that movie is a weak word, it has been a real crush. Go for it, definitely.","user":"spaceman42114","rank":[16,21]}]