[{"title":"Such a hilariously disturbing movie","rating":8,"date":"7 November 2017","review":"I don't usually dig \"horror/comedies\"; they usually veer more towards comedy, while the scary elements are often half baked or underrepresented. This movie, however, is the new metric by which I rate how successful the movies in the genre are. Two Pigeons starts off like any urban comedy, but casually veers into such nasty and disturbing territory, it was almost like watching two or three movies, mashed into one.<br><br>The actors are talented and believable, and I found myself really growing attached to their stories. With such a small cast, it was imperative that they all had obvious chemistry, and worked well as an ensemble. I did not find a single weak link. Everyone put their absolute all into this movie, and it was literally like watching the daily lives of people you somehow know and like. It was entirely believable, and this only made the movie that much more entertaining.<br><br>Everything else about this movie was top notch, from the cinematography to the soundtrack, but the true star of the movie was the Spanish actor who played the \"guest\". He was so weird, shockingly skinny, and delightfully disturbing. You couldn't help but watch in disgust at some of the stuff he was getting away with. It was horrible, but hilarious. I gagged a few times.<br><br>Overall, this movie has a great premise, yet the film does not overstay its welcome. It's less than an hour and thirty minutes, and things get right into the action fairly quickly. It's a quick, yet entertaining watch, that will not be easily forgotten. A gem of a film that should be seen by anyone that appreciates concise and well executed stories.","user":"manuelasaez","rank":[15,17]},{"title":"Freehold","rating":7,"date":"17 October 2017","review":"That was the title the movie had when I watched it at Frightfest. Not sure why they changed the title, but I think both work fine. This movie reminded me a bit of Bin-Jip (3-iron) by Kim Ki Duk. But while the Korean movie was more philosophical I guess, this is more \"real\" and down and dirty, not to mention has a different backstory and motive for the involving characters.<br><br>This has a couple of flaws and arguably a lead character who does not seem to sympathetic for most. But therein lies the challenge. How do you keep the viewers interested or a suspense, with characters you may not sympathize or agree with? There are also quite a few despicable things that are happening. Really awful stuff, disgusting to a degree some may feel sick watching. And no one would blame anyone feeling appalled. Still has something to tell ... actually so much to tell, that even a monologue was written at the end, that I'm not sure was necessary ...","user":"kosmasp","rank":[15,21]},{"title":"Very (darkly) funny film. Javier Botet is a Masterpiece!!","rating":7,"date":"1 November 2017","review":"Oh, I liked this film. I was unaware before watching that Javier Botet is involved in some of my favourite films(REC, The Conjuring 2, Crimson Peak to name three) You have to see him to believe it-this man is grotesque(sorry) and fascinating and makes the film what it is<br><br>Basic story-broken man seeks revenge on the estate agent by moving into his flat and insidiously destroying his life<br><br>It's a gross, funny and well made film","user":"OohLaLlama","rank":[9,13]}]