[{"title":"go watch the preview, you'll see these are fake reviews","rating":1,"date":"4 January 2019","review":"Since they're paying (or asking) people to give it 10 out of 10, i'm here to tell you what I can tell from the trailer. Bad acting, terrible lighting, horrible editing/color and the special effects literally superimpose 'shot glass' over top of the video footage for the back of a vehicle that was supposedly shot.<br><br>Just in case you're like meet and scour the film industry for something to watch and come across this like I did (luckily I searched on youtube for the trailer, which is actually on the directors channel), I got to see exactly what this was before catching it.<br><br>MAYBE the story is decent, but at the way it was shot in the trailer, I'd rather just have the guy tell me about the story and skip the abusive visuals. Trailers are supposed to intrigue and show you the potential... I can only imagine how bad this gets (and I can't even stand the asylum films, which look far better than what this seems to be)","user":"artvasc","rank":[7,7]},{"title":"The $treetz Review with Markos Papadatos Award winning Journalist","rating":10,"date":"11 October 2017","review":"Eddie Rocky Rivera discusses new film 'The Streetz' Special Listen | Print By Markos Papadatos Sep 2, 2017 in Entertainment Sayville - Award-winning director and screenwriter Eddie Rocky Rivera chatted with Digital Journal about the premiere of his new film \"The Streetz.\" \"The Streetz premiere went great,\" said Rivera. \"We had it in Sayville Cinemas on Monday, August 28. We sold out the theater. We had Angel Salazar, who played Chi Chi in Scarface, in attendance. This was a red carpet event that everyone enjoyed. This film had Danny Enjetic Rivera main actor who is from the anti-bullying organization Asking Myself Association AMA. Also, Danielle Harper from Killjoys Syfy on Hulu Netflix NBC. She plays Danny Enjetic's girlfriend in the movie. Anthony Bisciello from the AMC series Making The Mob and Frank Modica from Gothem.\" Eddie Rocky Rivera discusses new film 'The Streetz' Special Listen | Print By Markos Papadatos Sep 2, 2017 in Entertainment Sayville - Award-winning director and screenwriter Eddie Rocky Rivera chatted with Digital Journal about the premiere of his new film \"The Streetz.\" \"The Streetz premiere went great,\" said Rivera. \"We had it in Sayville Cinemas on Monday, August 28. We sold out the theater. We had Angel Salazar, who played Chi Chi in Scarface, in attendance. This was a red carpet event that everyone enjoyed. This film had Danny Enjetic Rivera main actor who is from the anti-bullying organization Asking Myself Association AMA. Also, Danielle Harper from Killjoys Syfy on Hulu Netflix NBC. She plays Danny Enjetic's girlfriend in the movie. Anthony Bisciello from the AMC series Making The Mob and Frank Modica from Gothem.\" Rivera continued, \"We will be having another premiere called the director's cut in October in the Seaford Cinemas. We are looking to get a few film directors together that night to support the tragedy in Texas so we are going to try to involve the Red Cross. We will be doing a question and answer session after the film, and we are showing the trailer to The Streetz 2 as well as Matters Of The Heart, which was directed and written by Nancy Vazquez. The film will be in film festivals and distributed by all platforms, including Netflix.\" Rivera directed the film with John Paul Ceramello, and the script was co-written by Rivera and Natalie Peri. In addition, Ceramello and Richard Kern as the producers. The film also features the following actors: Domenico Del Giacco (Detective DJ), David Paul (Johnny), Natalie Peri (Pink), Michele Frantzeskos (Mrs. Russo), Margarita Vargas as the undercover detective, Nancy Vazquez (Detective Brook), Kevin Zigon (Detective Zenick), Dekom Martin (Congressman Lee Russo), and radio host Danny Romano as Italian mobster Tony, among others.For the fans of the film, Rivera extended his appreciation towards them. \"The film is a great story to begin with. It's true life right now that we are living. This movie has many recovering addicts who did a great job in acting, and are on their way to brighter careers in acting. So, all I can say is you work hard and you accomplish your dreams.\"","user":"eddierockyrivera-81458","rank":[1,9]},{"title":"Amazing Drama","rating":10,"date":"12 October 2018","review":"Love it a great story about a young man .Will he get out The $treetz or Will the $treats claim victory..","user":"eddierockyrivera-81458","rank":[1,12]}]