[{"title":"like a smooth ride on an empty street","rating":8,"date":"5 October 2018","review":"Both the leads have such an endearing quality to them, their relationship seems so natural that you forget they are acting, the movie feels so real and makes the viewer become a part of the couple's life. Great acting, great writing on a couple's journey to become parents while holding on to their relationship. Simply endearing.","user":"meme-36137","rank":[77,98]},{"title":"If you don't understand the ending or why it feels like a long film...","rating":10,"date":"2 November 2018","review":"... then you are clearly lucky enough to not have experienced infertility issues. The reason it's so long is because infertility is long. The reason the ending never reached a climax is because for some people, the journey to becoming parents never ends. If you consider these points then you'll see your complaints in a whole new light.<br><br>I thought the acting was superb, I loved the candid, realistic portrayal of such a horrific and sensitive subject. Definitely recommend this film.","user":"amanda-15127-18211","rank":[52,66]},{"title":"This film was really good, can't believe I watched it on Netflix!","rating":7,"date":"9 October 2018","review":"Great actors and very appropriate casting of Giamatti and Hahn. I've loved this hysterical Katherine Hahn character ever since the series I Love Dick. Such a treat to see them together, and so natural! There really wasn't one moment where I felt like I was outside of the film looking in. It really captured (how I imagine!) this scenario to be, particularly the unsexiness of trying to get pregnant over and over. I also enjoyed the rebellious commentary from their niece on their art driven lifestyle, reminded me of crap I would've said in my first years at uni, haha. The focus on fertility, pregnancy, IVF cycles et al. can be a lil heavy and will probably deter the male audience (meh) but it is a film that I'd rather watch alone or with friends - not a date movie! Probably unrelated but something something like this actually happens in the film too...","user":"hunter_m","rank":[40,53]}]