[{"title":"Interesting at times","rating":8,"date":"8 November 2019","review":"I am not good at reviewing.<br><br>The Good Liar was actually a decent surprise and a really good thriller even if it feels a little too heavily explained towards the end.<br><br>I thoroughly enjoyed this film from start to finish and I honestly really didn't expect that kid of twist even though I expected a twist and I'm glad I didn't see that coming.\nIan Mckellen and Hellen Mirren are both great here, delivering two really great performances. I think the plot is fairly simple at it's core but the writing makes it very different to a very satisfying ending.\nOverall whilst it's an interesting film with two great performances and unexpected twists, I just expect more style and excitement in it.","user":"iamkeysersoze-13228","rank":[89,109]},{"title":"A stellar cast holds a sub par plot","rating":7,"date":"8 November 2019","review":"It's not an overly bad film by any sense of the word, I actually enjoyed it a fair bit hence the 7 but I will echo that it was a fairly predictable job but the outstanding cast definitely carried it, I'd recommend it if your on the unlimited cinema deal or when it arrives to one of the multiple streaming services, good twist at the end","user":"jodo151-654-152490","rank":[55,70]},{"title":"Somehow, its twists are both obvious and out of the blue.","rating":6,"date":"11 November 2019","review":"'The Good Liar (2019)' is, in essence, nonsense, comprised of twists either far too obvious or completely out of the blue. Even though its marketing all but spoils its most major revelation, the flick still plays as a relatively unassuming drama until a final exposition dump aims to re-contextualise its plot, turning the affair into a pseudo thriller. Perhaps this is an effort to provoke a second viewing, but the movie doesn't have an ounce of ambiguity or, indeed, foreshadowing. It makes for a completely blindsiding ending that has little to no consequence because it feels so utterly disconnected from everything we've seen prior. The protagonist is suddenly transformed into something they never were before and we're just expected to accept it, to change allegiances at the last minute. This is a big ask and it makes for an unsatisfying end. Conceptually, it's fine, it's just that its execution doesn't capitalise on its potential. The picture isn't bad, though. It's forgettable and retroactively strained but it's engaging enough. The two leads are as good as you'd expect, playing ever-so-slightly against type and feeling comfortable while doing so. The actual writing is decent, if a little cheesy, and the direction is competent. There are a couple of OAP scuffles that work surprisingly well, too. Generally, it's relatively enjoyable throughout, despite some eye-rolling moments. It does feel a bit 'BBC 2' but it's not a bad effort, even though it's already fading from my memory. 6/10","user":"Pjtaylor-96-138044","rank":[66,87]}]