[{"title":"Mainstream films for German audiences hardly ever get better than this.","rating":10,"date":"10 January 2019","review":"Based on Hape Kerkeling's autobiographical novel, \"Der Junge muss an die frische Luft\" is one of the most extraordinary German mainstream-fitted films to be released in recent years. People who have never lived in Germany probably won't be particularly familiar with Hape Kerkeling's comedy, but as someone who has continuously watched his presence in German television while growing up, I was probably the perfect target for the film's intention to hit all the nostalgia nerves. It paints a beautiful picture of small-town Germany during the early 1970s, not to mention a stellar performance by young Julius Weckauf, who may just have given one of the best child performances I have seen in a long time. He took over Hape Kerkeling's person and completely vanished into the character, allowing for a very compelling viewing experience.<br><br>The movie capably handles tragedy and humor, keeping both of these aspects in perfect balance and allowing the audience some room to laugh one minute and cry the next (I won't lie, I did both of those things). Caroline Link's film probably can't be called critic-proof; someone who wants to find flaws probably will, but as for me, I absolutely loved the experience of just letting this portrait of a boy's upbringing in Germany during the early 70s sink in. Ursula Werner's performance as Oma Bertha is especially note-worthy; she's a scene-stealer whenever Julius Weckauf isn't (which is a rare incident). I fear people outside of Germany probably won't ever get to see this film unless they embark on an extended search for it, though I also think people outside of Germany probably won't care, as long as they aren't familiar with Hape Kerkeling himself. But honestly, even if you don't know anything about him, this is just a fantastic film which is a more than worthy way to spend 100 minutes of your time with.","user":"Councillor3004","rank":[18,21]},{"title":"A must see for Germans","rating":9,"date":"5 January 2019","review":"We laughed a lot, cried a little and were all amazed by how good the film portrays the emotions of being in a big, a bit weird family in Germany. This film connects with you through strong performances and is just beautifully done.<br><br>Now it wont be for everyone and probably will not translate (both in terms of language and culture) but for Germans it is a must see.","user":"leocoolio","rank":[21,26]},{"title":"If you want to laught and cry at the same time ,watch this movie","rating":13,"date":"13 January 2019","review":"It's more then a well known German comedian biography. It's a movie who reminds us how beautiful it is to be surrounded by family.The support and emotions to eachother in laughter and in difficult times like when you lose someone in your family. A movie which reminds us what it means to grow up with a family who is there for you and doesn't treat you like a child but like a person who can raise his voice and show his feelings without having fear . Please watch this movie. I hope that it will be able to watch all non-german speakers aswell.","user":"sebnemlevent","rank":[13,15]}]