[{"title":"Excellent, intense & gripping courtroom drama!!","rating":9,"date":"16 September 2016","review":"More than half of the seats empty in the theater at an afternoon show of \"Pink\" gives us the message whats exactly wrong with Bollywood. Replacing the movie with Dabangg or other such worthless crap, shows would be house-full. Pink is a masterpiece and lives up to it's expectations. Powerful and world-class performances given by Amitabh Bachchan sir (once again) and Piyush Mishra makes this movie a gem. This is one of the career best performance by Big B. He runs the whole show. Tapsee's acting could have been so much better; but still, it was a job well done. <br><br>The movie deals with what we read daily in our newspapers. MOLESTATION. This movie depicts the corrupt system and shows it in a brutally honest way (personal experience). <br><br>I'd say go for this movie, you'll surely love it. Fans of Amitabh will get =a bombastic surprise! ;)","user":"vinzesiddharth","rank":[70,85]},{"title":"Dyeing our conscience","rating":10,"date":"16 September 2016","review":"When a girl says NO, (she could be anyone, your girl friend, your date, your wife or even a sex worker). it means a NO. This is exactly the point which PINK drives to the audience, all the while shaking up our conscience and questioning ourselves. <br><br>Minal Arora (Taapsee Pannu) Falak Ali (Kriti Kulhari) and Andrea (Andrea Tariang) are three friends and room mates who choose to go to a rock concert and run into Rajveer Singh (Angad Bedi) and his friends. The girls are invited for dinner which they choose to accept and it is implied that Rajveer and his friends tried to act fresh with the girls and Minal in an act of self defense hits <br><br>Rajveer with a bottle, making him almost lose an eye. Both the parties choose not to go to the law enforcement authorities and few days later, the girls are threatened by phone calls and their house owner is given threats to have the girls thrown out. Minal goes to the police and reports the incident which happened that night and an FIR is filed. But to her shock, she is arrested on the charges of prostitution and murder attempt.<br><br>Steps in Deepak Sehgal (Amitabh Bachan) a once famous elderly lawyer who has quit practice mainly due to his bipolar disorder. Sehgal offers to defend the girls in a case which almost appears to be a lost cause as the girls are subjected to humiliation and are portrayed as criminals.<br><br>Amitabh Bachan as Sehgal gives once again a magnificent performance, his gas mask, his blank stares in the courtroom all add up to his fantastic portrayal of the character. <br><br>Taapsee Pannu gives the best performance of her career, her body language, her mumbling, frightened looks and especially the scene where Sehgal calls her to the stand, make it the most outstanding performance of the year. <br><br>Kriti Kulhari need s a special mention, especially in the breakdown scene on the stand.<br><br>Angad Bedi is good as well and actually makes us loath the character, especially in the final cross-examination scene which brings out the double standards the society is into.<br><br>Screenplay by Ritesh Shah deserves applause and especially the dialogues when Sehgal lists out the safety standards for women/girls.<br><br>Direction by Aniruddha Roy Chowdhary is classy and does not deviate from the plot with inane sub plots. Right from the word go, he ensures every scenes grips our conscience and tugs us into self- examination.<br><br>I would not recommend it to anyone who wants to watch flashy item songs, or duets set in Switzerland or out of the world costumes. This movie is for patrons who are into serious cinema and can appreciate good performances.","user":"snaidu422","rank":[58,70]},{"title":"Outstanding","rating":10,"date":"17 September 2016","review":"It correctly deals with the present mentality of our generation.<br><br>Three young working women, Minal (Tapasee Pannu), Falak (Kirti Kulhari) and Andrea (Andrea Tairang) are flatmates in Delhi and good friends. An untoward incident one night at a resort in Surajkund, involving some boys, among whom is Rajveer (Angad Bedi), who comes from a politically well-connected family, proves to be life changing for the trio.<br><br>What follows is an intriguing courtroom drama where ace lawyer Deepak Sehgall represents them in a bid to get them justice.<br><br>Replete with contemporary instances and issues, centering around women and their safety, the film, through its potent dialogues, takes a dig at society and its stereotypical norms and prejudices towards women, as in \"The Rule Book of the Girls' Safety Manual\", enumerated by lawyer Deepak Sehgall.<br><br>Director Aniruddha Roy Chowdhury extracts natural performances from all his actors, and makes a meaningful film devoid of any unnecessary commercial trappings, never once deviating from the core theme.<br><br>Amitabh Bachchan as Deepak Sehgall, the aged defense lawyer, shines as always, in a restrained, but powerful performance. His histrionics come primarily in the form of his well-modulated baritone, conveying his emotions and of course, from the well-written lines.<br><br>RIGHTLY SAID BY AMIT JI..WE Should SAVE OUR BOYS NOT OUR GIRLS","user":"dksett","rank":[21,24]}]