[{"title":"LMAO!","rating":1,"date":"15 May 2019","review":"Seriously what the hell was this? The acting was so terrible that I was in stiches with laughter. Reminded me of Steve Martin's movie within a movie \"Chubby Rain\"! I don't think the actors got paid for this movie. They themselves paid just to be in front of the camera! LOL","user":"haroot_azarian","rank":[15,20]},{"title":"Unwatchable!","rating":1,"date":"29 May 2019","review":"Pure junk. Nothing redeeming. Terrible acting, terrible plot, terrible sound mixing, terrible effects. Would give it negative stars if that was possible. Skip it!","user":"jeromekoebel-483-686036","rank":[12,17]},{"title":"What did I just watch?","rating":3,"date":"26 February 2019","review":"The overall scheme of the movie ( That I perceived ) was that apparently there were some jug heads with a vendetta who sought vengeance against the thieving pastor who basically took all and gave nothing back. The overall morality of the movie was acceptable, but it seemed forced, overwhelming, and misplaced. In the movie, the church had prison-like features ( For almost no reason ), a \"high security\" (which consisted of two people ), and an irregular plot. It wasn't long before I noticed the very poor directing and acting, let alone, some of the worst editing I've seen in a movie that considers itself&lt; at the least, a \"B\" movie.<br><br>As far as editing, there are many scenes where the blood doesn't match up with the previous scene. These cuts are one of the most important things to viewers.<br><br>The plot was shaky. I half way understood where it was going, but in the end, the director just gave up and wanted to finish quickly.<br><br>The conclusion was a ( for the most part ) a happy ending, excluding personal deaths within the movie, but, very inconclusive and had not left an opening for a sequel, or at the very least an answer on how things happened. Also, five minutes, is five minutes. If you're going to place a specific time in a movie ( ex. 5 min ), and be so elaborate as of how much that time means, then execute that time in a timely fashion.<br><br>Overall, I rate this movie a 3/10. Spend your time watching something better.","user":"eats-66519","rank":[13,23]}]