[{"title":"Utterly baffled why this movie is only rated a 6.4","rating":8,"date":"3 December 2018","review":"I don't know if the dubbed version just sucks or what. While not any kind of \"purist\" I watched this movie subbed. I'm sure some of the folklore bits sailed over my American head, but this movie is absolutely amazing. The acting, superb. For what isn't a blockbuster movie, the special effects are quite good. The whole feel of the world has a fantastic dark fairytale reality. If you're looking for a slasher movie, this isn't it. But it's a charming fascinating and beautiful retelling of an old folktale sprinkled with some comedic bits. Seeing it on Netflix I actually thought it was going to be a piece of schlocky European horror. Boy was I wrong.","user":"bachemar","rank":[73,78]},{"title":"Great Piece of Story-telling","rating":9,"date":"14 October 2018","review":"What a great find I stumbled on. So refreshing to watch a film, which does not have to rely on big budgets and flashy special effects. Simply a great piece of story-telling, like watching a live theatre show.","user":"wdexkin","rank":[112,128]},{"title":"Errementari: My first Basque movie","rating":7,"date":"13 December 2018","review":"Saying this is my first Basque movie probably lacks impact since there are so few of them, but if this is what to expect from them then sign me up for more.<br><br>Yet another Netflix original it tells the story of a reclusive blacksmith who imprisons the demon he deems responsible for much of his misery.<br><br>It is arguably a dark fairytale, it looks the part, it sounds the part and the cast are fantastic. I had no idea what to expect going in but am certainly happy that I ended up giving it a chance.<br><br>It's very hard to categorize Errementari as it has fantasy roots but plays out much like a horror. It's grim, it's dark, its pretty unforgiving yet it has its heart in the right place and doesn't lose atmosphere in favor of needless impact. It has themes with religion, sacrifice and loss, which makes it even more fascinating and relatable.<br><br>It had me gripped early, partially because there simply isn't enough of this type of movie out there. It's deep, it's rich and I really enjoyed it. Sure it's not without its flaws, but nothing can take away from it's originality and overwhelming charm.<br><br>Good job!<br><br>The Good:<br><br>Looks great<br><br>Truly stands out from everything else on Netflix<br><br>The Bad:<br><br>Certain things are ridiculous and unexplained<br><br>Should have been a tad longer<br><br>Things I Learnt From This Movie:<br><br>Thin twigs don't make for the most intimidating weapons<br><br>Dolls are immortal and cannot be killed by mere decapitation<br><br>We need more movies like this!","user":"Platypuschow","rank":[33,36]}]