[{"title":"An honest review of Hoax","rating":4,"date":"21 August 2019","review":"The couple rave reviews are obviously fake, but the movie is not complete garbage or unwatchable by any means.<br><br>The acting is about average but adequate. The cinematography and sound design, while not great, are serviceable and do nothing to add or detract from the experience. The gory practical effects are actually decent, but the bigfoot itself (which is rarely seen) is pretty shotty.<br><br>The characters are blatantly stereotypical with the corporate shill, self centered journalist, ex-marine badass, the smoking hippie, and the good-natured scientist who's only there for the much needed money.<br><br>The story itself starts out very cliche, kind of like 'Anaconda' but with a bigfoot. The first three quarters of the film feels very much like this, but the story takes a strange turn at that point and it becomes something different entirely. I give them props for trying something a little different here, but doesn't quite feel like it's part of the same movie and very out of place.<br><br>Overall, it is watchable but kind of loses itself at the end. It's not going to win any awards and is fairly forgettable, but if you want to turn your mind off for a little bit, you could definitely do much worse. 4.5/10","user":"mikedegroot","rank":[31,44]},{"title":"Seriously??","rating":1,"date":"21 August 2019","review":"Do not waste your time with this garbage, It's hard even to watch a trailer let alone watch the whole movie.","user":"iffitheking","rank":[28,44]},{"title":"A Hoax To Say The Least","rating":1,"date":"25 August 2019","review":"Seriously, the only \"Hoax\" involved with this production is calling it a film, THAT is a \"Hoax\". I really can't believe I sat through this crap lol I kept thinking to myself, \"It CAN'T get any worse can it\"....then at the end with the cannibal family I was proven wrong lol. It's not even a good bigfoot tribute, it's pure garbage. DO NOT waste your time with this.","user":"workoutsmurf","rank":[7,9]}]