[{"title":"Cracked at the top","rating":6,"date":"2 September 2017","review":"Nick Broomfield tends to make controversial documentaries. He usually turns up with a camera and a boom mike and ensures chaos unfolds.<br><br>Whitney: Can I Be Me is a departure from Broomfield's usual documentary style. Using archive footage as well as interviewing some people who worked or were close to Whitney we see a person who came up from gospel singing and crossed over to pop and made it big in the USA and around the world.<br><br>In 1992 when she got an acting role in The Bodyguard, her profile went to the stratosphere. The film was a commercial hit, the songs became best sellers. Whitney's cover of I Will Always Love You has become an enduring hit.<br><br>Yet in 1992 she also married singer Bobby Brown despite some years of rumours about her sexuality. Brown was riding high as a pop star at the time, the general consensus was this was a union that would not last.<br><br>The trouble was it led to Houston going on a destructive path. Keen to hide her sexuality, wanting a child, her conflict with her and her family's deep religious convictions. Houston increasingly found solace in drugs as Brown and Houston engaged in wild living, he was also having affairs and she also had her own special friend in Robyn Crawford.<br><br>Undoubtedly this is a sad documentary. A life wasted and cut short. We see footage of another documentary that was shot in 1999 which followed Whitney in her last major world tour. After that her recording output declined, so did her voice but her erratic behaviour increased.<br><br>I think Broomfield himself liked her, hence a rather respectful approach. As her long term bodyguard commented, Whitney could had been saved but those around her were not interested in keeping her off drugs.","user":"Prismark10","rank":[24,28]},{"title":"Eye Opening","rating":8,"date":"4 September 2017","review":"At one point in my life, Whitney was the woman with the voice that made me long to be a singer. I absolutely idolized her. Her struggles with drug addiction was so disappointing to me, as was her death as a result of that struggle.<br><br>For me, this was an extremely honest, eye opening documentary that made me both sad and angry. We were always lead to believe Bobby was who got her into drugs. Finding out that she'd been doing drugs since she was a child - in my opinion - is a game changer. And the fact that her family took massive advantage of, and controlled, her, all the while enabling her addiction is just absolutely sickening. As for her relationship with Robyn, it's a damn shame the relationship couldn't have been what it should've been able to be.<br><br>For those who gave low scores on this documentary... Sometimes the truth isn't pretty. It can be ugly. It can be hard to hear. Sometimes it's just downright sad. It doesn't make it wrong to tell the story. In fact, sometimes it makes it more important for the story to be told.","user":"eyez76","rank":[22,31]},{"title":"CHEER! - (7 stars out of 10)","rating":7,"date":"10 January 2019","review":"The stage curtains open ...<br><br>I just finished watching and reviewing the other documentary on Whitney Houston simply titled \"Whitney\" (2018) - and felt compelled to watch this one as well. I think the aforementioned documentary was better made and more detailed. But what I really appreciated about this one was the concert footage, and the behind-the-scenes / backstage footage as well.<br><br>When Whitney came off stage and went to the make-up/hair booth to catch a breather, and I saw the tears in her eyes and the drain and toll it was all taking on her, my heart broke for her. She really did pour everything she had into her singing, emotionally, physically and spiritually. And then she managed, somehow, to get it together in time to go back out on stage and finish the show.<br><br>There is just so much that went wrong in Whitney's life. Some blame Bobby Brown, others her Mom, others her Dad, others Robyn, and still yet others the time she was living in and what was socially acceptable and not acceptable. I guess I'm one who believes it was a combination and culmination of all of the above. I am also one who believes that we are all better for having had her in our lives, in whatever respect that may be.<br><br>I enjoyed this documentary. It was honest, fair and presented in an unbiased way. It is worth watching, if only to remember the heart of gold that Whitney always had - even during her inner conflict and pain. She always had that.","user":"Front-Row-Reviews","rank":[4,4]}]