[{"title":"Definitely a lot of bang for a little bit of buck$","rating":7,"date":"19 May 2018","review":"This movie by all accounts was a good film. I tend to steer clear of indie horror films albeit this film wasn't very scary but it would fall into the horror genre, Usually these films are written horribly and the acting is so below par I can't get through the first 15 minutes but watching \"Island Zero\" from the beginning was not the case by any means.. The acting and pace of this film was well performed and intelligent. Not rocket science but just enough so that it seemed very believable and witty. The budget clearly was independent level hence the special effects but it was all done in a respectable manner not frivolous. Theres no big names in this film which even gives it a more authentic feel like they really used some locals off the island.. <br><br>My one gripe is this film could have been 15-20 mins. Shorter but in all honesty I would prefer they took time like they did explaining whats happening instead of some films having no clue and just leaving it up to our imagination to fill in the blanks.. All in All I would say this was a pretty good film to watch and definitely high remarks being on a shoe string budget.. Congrats.","user":"tkaine3","rank":[19,24]},{"title":"Low-budget, but worth watching","rating":7,"date":"19 May 2018","review":"The movie is obviously low-budget, but that doesn't mean it is a bad or badly made movie. You just cannot expect it to be at the same level as some big blockbuster movie. There were some interesting ideas and although the movie needs a new ending, it was interesting enough and I actually enjoyed watching it.","user":"ametysa","rank":[18,23]},{"title":"Solid if slightly problematic low-budget","rating":7,"date":"17 May 2018","review":"Following several strange incidents, the residents of a small island off the coast of Maine find themselves cut off from the rest of civilization and being hunted down by a ravenous sea creature intended to be used in a military experiment and must get away from the creatures alive.<br><br>This one ended up being a solid low-budget indie creature feature. That is built mainly on the wholly intriguing main premise of the film that makes for a lot of potential fun to be had. This one really works itself into a nice groove at the beginning where it slowly features the eventual buildup of their lives on the island, from the residents who make a living on the sea to the different potential romances brewing and how that gets interrupted by the serious implications on the outside of the storyline. This creates an effective atmosphere throughout here where the creatures closing in on the community by being responsible for their situation and creates both intrigue and suspense about what's going to happen due to this fine early build-up. Once this goes into the creature attacks, it has some rather enjoyable attacks. Starting with the first discovery of the body parts strewn across the island, this offers up some nice concepts involving the creatures attacking here which features the later attack on the shipping vessel heard through the radio or the discovery of dead bodies in bloodsoaked houses which finally clues them in that something is out there. With a stellar sequence of the unseen creatures attacking and taking out one of the locals inside the house, a later ambush where they realize the creatures' intent in the area and a fine finale where the creatures are put into even more action-centric encounters that are rather thrilling, it's exciting scenes are placed at the right spot to give this a lot to like. Along with the creature design and backstory that has plenty to like here, it ends this on a high note and is what make this one hold up over its flaws. While this one makes out well enough due to its low-budget imitations, there are a few out there that would find fault with this aspect of the film. The fact that it stays within this close-knit community, never really venturing out to other aspects of the area and looking like it's all done with local limitations makes this one a lot more restrained than it really should be. That includes the slow-burn pace which doesn't ramp up the action as much as it should, featuring plenty of low-key moments of the group going about their lives or trying to push the storyline about the creatures being there which just takes so long to move to that part of the story which is what holds it back. Likewise, some might also be on this one for the fact that it's a lot longer than it really needs to be which is certainly aided along by the overly slowed-down pacing. This one really could've been trimmed down some by either taking a little less time on the setup or injecting a bit of urgency into the proceedings once it had been obvious what was going on, which would've kept this one going a little faster. Otherwise, this one wasn't too bad.<br><br>Rated Unrated/R: Graphic Language and Graphic Violence.","user":"kannibalcorpsegrinder","rank":[14,18]}]