[{"title":"Once You See It, Follow Your Path","rating":9,"date":"29 December 2018","review":"Don't be fooled by the baseball-centric title and marketing imagery: You don't have to know the difference between balls and strikes to find one of life's most compelling themes at work at the core of \"Take Me Out.\"<br><br>That's because Joe Shanks retells the age-old story of purpose; of finding one's path naturally, borne of one's own conclusions and desires, and free from the claustrophobic expectations of others (clumsily well-intentioned or otherwise). On Shanks' side in his tale-telling is a series of astute casting choices: Darwin Smith, Sonya Barnes, and Idrees Degas deliver the core acting, and they do it in a way that allows us to get out of the weeds of technical evaluation of the film so its themes can better play on our heads and our sense of self: Am I doing what I want to be doing, and did I make my own choices in getting here?<br><br>Inevitably, this is the question that plagues us now and may be the last we ask of ourselves on our respective death beds. Between now and then, filmic storytelling in exploration of this huge existential question will continue; some efforts will make the grade and others will slip, same as it ever was. Take Me Out meets the standard, and is the kind of brain food that inspires.","user":"TheAll-SeeingI","rank":[4,5]},{"title":"This was well crafted saw it on Amazon","rating":10,"date":"23 February 2020","review":"I didn't know what to expect but I was so so pleasantly surprised to find this well made, well acted (the director Joe Shanks played a role) and very heartfelt movie. I dislike throwing \"urban drama\" I am a white guy this is a human drama at its core about love, family the main character, Nicholas, struggles with his mother and father and with finding his purpose and place are universal struggles. Joe Shanks impresses with a command of direction and shot selection and very assured cinematography. The backdrop of baseball is a great familiar starting point for this story about expectations in life and disappointments. This is why indie films need a place to be seen here. It was personal, it got to me and it was quality. I dont know him but I hope he reads this and knows I am truly appreciative that he made the movie and shared it.","user":"tkonkle","rank":[2,3]},{"title":"An inspiring tale about finding your path","rating":9,"date":"17 September 2019","review":"Take me out is a moving tale about the journey of a young man to find his place. We all can rely to our struggles to free ourselves from expectations to do what we want, and in that regard this film made me ask myself - a question everyone should ask themselves I believe once in a while - how about me? How about now? Do I chose my own path or am I following society, or family expectations? The film captured me from start to finish.<br><br>The cast, cinematography and score are great, a well directed and produced indie film.","user":"jblockbuster","rank":[2,3]}]