[{"title":"Being generous!","rating":2,"date":"30 June 2019","review":"This is rubbish! I can't believe anyone would rate that any higher even if they were blind and deaf!","user":"Australian1","rank":[12,15]},{"title":"Bold Indie Satire","rating":9,"date":"1 April 2020","review":"A Lesson In Cruelty is a bold indie satire. It's one of those comedies that really goes for it where performances are intentionally big and over-the-top, and that's where the laughs come from. The plot involves a jerk of a boss -- something I'm sure we all can relate to -- who has a party thrown for him, but the intention is to actually teach him a lesson. I thought it was a great story and I was immediately hooked. It's an indie film, so it might not have the perfection of a big Hollywood studio film with a gigantic budget, but I was actually really impressed with the film's production value. The lead actor, Justin LeBrun I believe is his name, also gave a very convincing performance. If you're looking for a big and bold film that doesn't hold back, then check out A Lesson in Cruelty.","user":"JGReviews","rank":[3,3]},{"title":"Seriously?","rating":1,"date":"30 June 2019","review":"I am all for satirical, dark humour and a character being ironically funny because they are just genuinely an awful human being. Michael Scott (Steve Carell) in The Office (US) is a perfect example of being arrogant but done in such an endearing way that it is hilarious.<br><br>It's not that Julian (Justin Leburn) was purposely written to be so awful that your hatred for him drives you to want to know what happens to him like a revenge horror/comedy style movie where you're rooting for his demise. This movie just isn't funny or enjoyable in the slightest which leaves you not caring at all.<br><br>Julian (Justin Leburn) is just so badly portrayed that within fifteen minutes of the movie I just wanted to give up. It's like when you go to a high school play and a badly acted villain is so smug and overly unpleasant that it saps the humour out of the whole performance and makes the audience cringe.<br><br>Often when this happens there might be a character or two who save the perfomance by being atleast half decent at acting, but none of them were. This movie doesn't provide any comic relief. I felt like I was watching Horrible Bosses meets Julius Caesar but with Asylum Films (Sharknado) level acting and random Cujo references. But not done in a \"so bad, it's funny\" kind of way, it was just plain frustrating.<br><br>My advice - keep away.","user":"skye-richards","rank":[8,11]}]