[{"title":"Noredin Mostafa against everyone else!","rating":9,"date":"21 November 2017","review":"This is my highlight of the year! <br><br>Who would have thought, that a random Egyptian movie would be one of my diamonds of 2017. Filmed in Casablanca, as it was not possible to film in Egypt, forbidden to even screen in Egypt... This movie will take you into the deepest corruption of Cairo. Fares Fares, who plays the lead Noredin Mostafa, is a pleasure to watch and you actually feel, like you are in this mess yourself, as the camera work is so brilliant, that you feel like Cairo is all around you. <br><br>After seeing the movie, I can understand why Egypt wont let it screen it in their country, as there is way to much dirty stuff that this movie digs up. It is not a story I could personally relate to in any kind of way. I'm not a police man, not in Egypt, but still...this movie grabs you right in and makes you feel restless and worried, because everyone around you tries to play tricks on you, so who can you trust, if no one is trustworthy anymore?<br><br>Go into that movie with an open mind, no expectations, just like I did and thank me later.","user":"FilmFlowCritics","rank":[39,47]},{"title":"A decent noir film. Good to c Fares in a leading role aft da Department Q trilogy.","rating":8,"date":"5 June 2018","review":"The synopis, the title n the lead actor Fares were enuff for me to check this film. It is good to see Fares in a leading role after the the Department Q trilogy. In this film Fares is a clean shaven cop, who's obsessed with his side part hair cut, he doesnt hesitate to steal money from a dead person's purse but at the same time he takes care of his old n sick dad. While investigating a murder of a famous singer, he has to face some powerful people n police corruption.\nThis film has all the ingredients of a noir film.\nThe film is set during the Egyptian revolution, starting with the protest against increasing police brutality n corruption.","user":"Fella_shibby","rank":[30,37]},{"title":"Excellent cop movie","rating":9,"date":"16 October 2017","review":"Movie about a corrupt cop who tries to solve a murder to a songstress in Cairo (Egypt) and gets deeper and deeper into the crooked administration of the government.<br><br>This is one of the best cop films of recent times.<br><br>It's really great to have a seldom seen location for crime. I think many are fed up with New York, L. A., San Francisco, Chicago ... .<br><br>The acting of the disillusioned cop is very good.<br><br>The film score is unobtrusive and doesn't push to the fore.<br><br>Cinematography is awesome. There are cool drives through nightly Cairo.<br><br>The movie is at the same level like other great films about corruption e.g. Chinatown or Bad Lieutenant (Abel Ferrara).","user":"kohle-69615","rank":[27,37]}]