[{"title":"It took four people to come up with this story.","rating":5,"date":"20 September 2017","review":"The Everglades Killings sees a group of thrill-seeking spring breakers take an air boat trip through the Florida swamps. When the boat's captain dies during the excursion, the kids make their way to a deserted cabin where they are killed one-by-one by machete wielding maniacs. Believe it or not, it took four people to come up with this story.<br><br>Writer/director Ben Wilder kicks off his film with the young party-goers on the beach, the girls in skimpy bikinis, some of them topless. The guys and girls then go to a bar where there is a hot ass/wet tee-shirt competition; some of the girls get their tits out. The woman behind the bar (played by Linnea Quigley, who doesn't get her tits out: those days are long gone) suggests that the friends take a trip to the everglades, which they all agree is a good idea; on the way there, some of the girls get their tits out.<br><br>During the air-boat ride, the girls manage to keep their tits covered, but once the group are in the abandoned building, drinking moonshine and smoking drugs, the breasts are back, one girl stripping off completely for a shower and another having sex with her boyfriend. No-one notices the killers, who take it in turns to bump off the spring breakers, a cut throat here, a smashed head there. One guy escapes the killers: he's dragged into the swamp by a python!<br><br>The final girl, who is pregnant, is tied buck naked to an inverted cross by her captors (now wearing hooded cloaks) before having her belly sliced open, her fetus removed and cast into the flames of a fire. The End. I honestly can't believe that it took four people to come up with this story.<br><br>5/10. The Everglades Killings is far from great film-making, the messy dialogue making me believe that there wasn't much of a script to work from, but with all of that nudity and that grisly finale, I can't say I was bored.","user":"BA_Harrison","rank":[10,11]},{"title":"All we have to do is last the night","rating":4,"date":"2 August 2017","review":"A group of generic college kids take vacation advice from Linnea Quigley....cabin in the swamps....FF nudity...slasher....male rape....shower scene not in that order, but close.<br><br>Too many college kids in group, unable to build any character. Reason for killings was odd. Outtakes not any better.","user":"nogodnomasters","rank":[10,13]},{"title":"Just plain horrible","rating":1,"date":"30 January 2020","review":"Truth be told, I could only make it 30 minutes into this film before I had to turn it off. There is no use critiquing the plot or the acting or anything else in this disaster. I enjoy horror movies, I'll give pretty much all horror movies a shot, but seriously, 30 minutes in and I was done. Don't even give it that much.","user":"scampas-01012","rank":[3,3]}]