[{"title":"Please read","rating":1,"date":"3 June 2017","review":"The reason why i rated it 1 is because Surfs up 1(the good movie) was one of my favorite animated films. Surfs up 2 is a disgrace, pretty much no surfing in the movie about 5 waves ridden. It has nothing to do with the old movie, Big Z isn't there, and Cody is not the same voice as in the first film, a whole different voice actor. And when did surfing move into wrestling??? Surfs up 1 was made by surfers. Surfs up 2 was made by kooks. If you are a surfer i beg you to not watch this film if you enjoyed Surfs up 1. The first movie was about the soul of surfing, making his own board, not caring about some contest, just free surfing and hanging with friends. I was so excited to watch the second movie but not stoked after. Disgrace.","user":"kobyg-04290","rank":[18,20]},{"title":"Terrible Moral","rating":4,"date":"30 January 2017","review":"The first time I heard this movie existed I thought to myself somebody had to have sat around a company boardroom and went, 'Know what needs a sequel? That surfing penguin movie that came out 10 years ago.' And then for some reason everyone at that table agreed. Then they felt that not only should they do it, but they should also get high profile wrestlers to be in it. Why? Once again I don't know, but you know that there had to have been several meetings to discuss it. I myself am a big fan of animated sequels. I'm not one of those people that believe that they shouldn't exist. Some of my favorite movies are 'All Dogs Go to Heaven 2' and 'Fievel 3'. However, I have to say, this movie has no business existing. <br><br>First off, if you're expecting Big Z, you know, that guy who was kind of important to the previous movie, he's not there. Like, at all. And they don't even really mention him ever. So that whole part of the main penguin's backstory about Big Z being his inspiration? Yeah. They kind of just...ignore that and replace it with this group called The Hang 5. Who are all voiced by famous wrestlers. Because....some reason.<br><br>Since the previous movie we learned that since the main guy gave up winning to help his buddy, instead of being showered with praise and gotten the good ending regardless like they did in Cars, instead, Chicken Joe has all the fame and the main character gets jack and squat. So, first note this movie is trying to tell you. If you do the right thing, you will feel better inside, but you will lose your dream. Nice. Good job movie. So basically we're five minutes in and its telling us that if you do the right thing you're going to miss out on being famous and loved for what you're good at. Nice.<br><br>Then this movie turns into one of those 'It's okay to shoot for your dreams but when your dream is in front of you, don't take it because your dream is really to not fulfill your dream' morals. I hate this moral. I really, really do. Some movies tell you to go after your dream. This movie tells you that even if you're really good and passionate about what you do, ignore all that and don't follow your dream.<br><br>I could see the resolution of this movie coming a mile away and it wasn't even entertaining. There was a joke here and there that was mildly amusing but it wasn't worth the 90 minutes you were watching it knowing what was going to happen. If they were going to bother giving this a sequel they probably should have ended it with Cody actually GETTING his dream of being a famous surfer since he apparently gave it up after the first movie to help a friend who then stole his dream because he was a nice guy. I just..I got really mad at this movie. The voice acting and animation was fine for DVD fare and everything. It was just the moral that irritated me. If they had changed the ending I would have been a lot happier. All in all, not worth it, but if you're forced to watch it, there ARE worse things. This is just below average.","user":"happybrand","rank":[13,15]},{"title":"This movie removes the original story from the 1st movie.","rating":5,"date":"11 June 2017","review":"Okay so, the original was awesome, watched it when I was 6. I always thought the movie would have great potential for a sequel and it would be also just as good to be a standalone movie. I completely forgot about Surf's Up for a long time. It was only a few weeks ago that I just found out that a sequel came out months ago. I was really excited, and I didn't know what to expect! Watched online... It didn't turn out as good as I thought it would be. The story completely removes the first movies original story. Having Cody say that he was always looking up to the Hang 5, which is a group of surfers voiced by WWE stars. In the first movie, Cody always looked up to Big Z. Basically, the movie was still watchable, but it's not the sequel anyone had wanted. The story does not really coexist with the original story. I am really bummed out due to the fact that this movie was not the sequel I wanted.","user":"ericdojillo","rank":[6,8]}]