[{"title":"Tucson Atrocities","rating":7,"date":"22 February 2020","review":"This police-procedural thriller, featuring mis-matched partners, grisly killings and the like, departs from enough formulas in a beat-to-death genre to make an impression. Yet director-star Brendan Murphy still has to compete with a low budget, which comes with its own production handicaps. Poor sound drenches some scenes in reverb, locations are without extras and appear under-dressed, etc. Still, nothing is hindered when it comes to the script or most of the performances. Murphy also supplies scenes of suspenseful, creative shock and sticky gore, with the movie's excellent horror tableaus being downright artistic. Though lengthy in some scenes of exposition about the movie's vampire cult, the blood-mutation story element is unique enough to excuse most of them-even a single lab-assistant who seems to run his forensics lab out of a precinct locker room. Murphy plays a memorable and hilarious antagonist-beast who dwarfs the movie's bloodsuckers, coming across as a berserk Roy Batty one minute, an 80s slasher icon the next. Luckily, his wisecracks are funny. James Craven and Dallas Thomas also perform their roles with comparable sincerity, so much so that once the inevitable partner dies, the scene plays out in real time and is a strong one. Also commendable are a few moments of alcoholic delirium which succeed due to Craven's acting and hideous \"Jacob's Ladder\" stutter cuts. Everything is backgrounded by a throbby \"Sexy Beast\" soundtrack, which injects despair throughout its many synth stingers. If the high production value camerawork and sound weren't so unbalanced by moments of the opposite onscreen, the performances would definitely transmit better-and be more impactful. Murphy's decent pace rescues a lot, and it works. Additionally, the Tucson, Arizona settings and Mexican influences are colourful. The movie's gothy flashdance hall called Club Carnage (and its owner) deserve a \"Near Dark\" massacre which I hope appears in the sequel.","user":"HughBennie-777","rank":[1,1]},{"title":"Promising Vampire Scenario Suffers from Micro-Budget Treatment","rating":3,"date":"7 March 2020","review":"Shot in and around barren locations, in stairwells and alleyways in Tucson, Arizona, BLOOD WIDOW offers an intriguing plot and a decent script that deserved a bigger, better production. We follow a serial killer-turned-vampire who encounters a small group of bloodsuckers intent upon resurrecting their kind in a modern setting. Two hardened police detectives chase down the clues, to a tragic end. Director-co-writer-costar Brendan Murphy has constructed a few effective scenes -- the ballerina's death sequence is a stand-out -- but for every decent scene there are around ten that don't come off, including a ridiculous nightclub scene and a lot of slow-moving procedural dramatics. A quick shooting schedule is evident. The actions scenes are far too ambitious for the movie to pull off given the limitations of the micro-budget. Additionally, most of the actors are either under-rehearsed or plain incompetent. However, James Craven is notably quite good as the elder detective who enlivens all the scenes he is in; and Melissa Aguirre Fernandez is a strong presence as the lead vampire.","user":"jfrentzen-942-204211","rank":[1,2]}]