[{"title":"Interesting. That is all I can say.","rating":25,"date":"25 May 2018","review":"I found the BluRay of this movie at my public library, it certainly has a catchy title. <br><br>It is animation with some top-shelf voice actors, not that it really makes any difference. It is a straightforward story, several sophomore students are writers for the school paper. One of them discovers some plans for the newly build school building situated on a cliff overlooking the ocean. The evaluation says the cliff and nearby fault line will not safely support the weight of the building, four stories, one for each grade.<br><br>A minor earthquake does in fact send the building into the ocean with all the students inside, it floats but is sinking rapidly. The students, faculty, and staff have to try to survive.<br><br>It is a comedy of sorts, but with gruesome scenes, like students decapitated, people floating dead underwater. Is it worth a watch? Depends on what one is looking for. The animation style is very interesting and that is probably the best reason to take the time to watch the whole thing. Frankly I got a bit bored as it went on and there is no hard-hitting resolution. A high quality amateur work.","user":"TxMike","rank":[3,4]},{"title":"Very creative and ambitious","rating":13,"date":"13 February 2018","review":"It's true that not everyone will like the animation of this film, but I thought it was perfect for the story it was telling. The animation also lends itself to a lot of creative quirks that can be displayed visually, which also lends itself well to the creative and quirky story it's telling. The biggest strength of this is that it's entirely unpredictable and there's a clever, fresh charm it has that many other animated films do not. If anything, I think this is vastly underrated and deserves way more attention than it got.","user":"Red_Identity","rank":[4,6]},{"title":"Kind of feels like a much darker, twisted and more violent Charlie Brown episode, but that's giving it way too much credit.","rating":4,"date":"4 May 2017","review":"'MY ENTIRE HIGH SCHOOL SINKING INTO THE SEA': Two and a Half Stars (Out of Five)<br><br>An animated teen comedy about a group of high school kids trying to survive a disaster in which their entire high school sinks into the sea. The film stars the voice talents of Jason Schwartzman, Reggie Watts, Maya Rudolph, Lena Dunham and Susan Sarandon. It was written, co-produced and directed by Dash Shaw. The movie runs just 75 minutes long, and it was released in indie theaters by GKIDS. It's somewhat creative, and funny, but it's also mostly a mess.<br><br>Dash (Schwartzman, who's character is obviously named after the director) and Assaf (Watts) are two sophomore outcasts at Tides High School. They're also a writing team for the school paper. When their friend Verti (Rudolph), who's also their editor, assigns Assaf a solo writing assignment, Dash becomes extremely jealous and mad. Dash then gets into trouble, for writing a smear article about Assaf, and while he's trying to steal a negative record on himself, he learns that the school might sink into the sea if an earthquake were to happen. The other students don't believe him though, due to the fact that he's so unpopular, but when an earthquake does strike, Dash finally has the chance to prove himself.<br><br>The movie is bizarrely creative and quirky. It also has some pretty decent social commentary on high school life, and it's funny at times. The animation definitely leaves something to be desired though (even though it's somewhat creative and strange); and even at just a 75 minute running length, the movie feels way too long. Not only is the film mostly not funny, but it's also boring a lot of the time. It kind of feels like a much darker, twisted and more violent Charlie Brown episode (stretched into an entire movie), but that's giving it way too much credit. It's too much of a mess to praise it for any of it's qualities actually.<br><br>Watch our movie review show 'MOVIE TALK' at: https://vimeo.com/217879519","user":"Hellmant","rank":[4,8]}]