[{"title":"Why?","rating":3,"date":"15 October 2018","review":"I caught this film at TADFF. Thankfully I didn't technically lose any money on it, because if I'd spent a penny to see this I think I'd feel mildly violated.<br><br>Make no mistake, this isn't the worst film I've ever seen. In fact, it's so brutally cliche and average that I would almost prefer it had been terrible. Instead it was just a horribly drawn out experience in the finer aspects of boredom. With no reason to like the main characters save a very shallow girl/girl romantic arc with a student outside the murder club, one has no reason to enjoy their psychopathic behaviour. These aren't characters you love and they sure aren't fleshed out enough to be characters you love to hate. They're just generic high school brats arbitrarily turned into serial killers.<br><br>The film earns it's two stars for the aforementioned \"romance\" (which, like every other plot point in the film, serves no actual discernable purpose) - at least an attempt was made to give one of the characters a story. It just wasn't actually a story at all, because it had no beginning or end. It was just there, and ultimately added nothing to the film. <br><br>The second star comes from some decent cinematography, and the third from some fun (but again, largely unsatisfying and empty) kills and a few chuckle worthy lines of dialogue. <br><br>The director is heralded because of his young age, and I can't speak to how well this lines up with his other works. I can say, however, that this movie has put me off any desire to see anything by him. He has created something utterly forgettable and filled with tropes masquerading perhaps as tributes - with empty characters and ultimately uninspired locations and scenes, and a plot with so many holes and inconsistencies that if it had been filmed on cheese, it would be swiss.<br><br>It won't kill you to watch this movie, which manages to get your hopes up just enough every few scenes before abandoning whatever potential they had, but it will make you wish you'd watch videos of toddlers sucking on lemons instead - they offer the same amount of intellectual stimulation, and honestly, they probably tell a better story.<br><br>I hope that your benefit of his age (and by the size of his entourage and pocketbooks at the premiere) Ray learns that there's more to movies than setting barns on fire and moderately aesthetically pleasing special effects. If he doesn't figure that out, well, the next best thing would be that he find another career.","user":"themoriartymethod","rank":[27,35]},{"title":"Waste of time and money","rating":1,"date":"21 October 2019","review":"....and a blueprint for impressionable youth who have a penchant for the macabre. No likable characters, just following a group of sociopaths planning murder. The resolution, ending, is totally unsatisfactory, leaving the viewer sorry they wasted the time to watch.","user":"WVfilmfem","rank":[15,20]},{"title":"Why?","rating":1,"date":"23 October 2019","review":"I have to ask along with another reviewer.\nWas no point at all for this movie, I've never seen a movie where at the end you have absolutely no idea why or explanation for any of the actions that took place. I have to assume it's about 4 teens who kill for fun, and one who wants out so she kills the other 3?\nWhatever don't waste your time, not worth it!","user":"copeland_2","rank":[9,11]}]