[{"title":"Neo-Noir fans can find much to admire, and much to be angry with here.","rating":7,"date":"26 August 2018","review":"At the time of writing, Wetlands has only two amateur reviews on site, something which on first glance paints a damning picture. Yet purveyors of film noir and its kindred spirits should at the least take a look at this grim portrayal of lost souls functioning in Atlantic City all while a devilish storm heads towards them. <br><br>Plot is by the numbers from the noir 101 playbook. Police officer (Adewale Akinnuoye-Agbaje) is a recovering addict who battles his past demons whilst trying to save his loved ones from unlawful scumbags. And that's pretty much it, the impending storm is a sort of metaphor for the turmoil going on in the lives of everyone involved in the story. The script is hardly high quality either, and anyone looking for an emotional investment in the characters will eventually start throwing objects at the screen. Yet rewards are here for fans of the noir form.<br><br>Characterisations are pungent with a bleakness that holds court. Corruption, sexual kinks, addictions, infidelity, dark deeds, bohemian excess, sexual blackmail, and on it goes. That these black thunders jostle with our chief protagonist's honourable intentions makes for compelling viewing for those in the frame of mind for genre bulldozing. <br><br>Then there's Barry Markowitz' cinematography. The film is big on atmosphere as opposed to physical action, and Markowitz' photography is a key player. If it's not turning down the filters for grim texture, it's offering up pronounced primaries for a magnetic beauty that offers up hope in what seems to be a forlorn venture, very haunting in its beauty. Great work in a strong decade for neo-noir photography.<br><br>However, it's not a very good film by any stretch of the imagination, the performances are very uneven, and as the script and plotting screams for better thought, the resolution also comes off as rushed and unfulfilling. But it's no dead loss, and enough here for noir heads to savour. 6.5/10","user":"hitchcockthelegend","rank":[7,10]},{"title":"Solid slow burn","rating":7,"date":"7 January 2019","review":"Definitely not as bad as indicated by the other reviewers / critics..... Kept me interested all the way through, actually... Nice little twist at the end tying it all together. Also, on a side-note, I will say I'm getting a bit tired of Hollywood's insistence on an LGBT angle in just about every R rated movie\n/ TV show these days!","user":"feev","rank":[5,7]},{"title":"Wet Paper Bag","rating":1,"date":"8 May 2018","review":"I made it 28 minutes and said 'No More.' The script is horrible. The production value is equal to community access television. The performances are all delivered in a lackadaisical manner. Heather Graham continues to portray her true life character in yet another film. I was really hoping that Adewale Akinnuoye-Agbaje would give an outstanding performance, but I was sorely disappointed. Anthony Mackie needs to take an eraser and remove this dud from his resume. Emanuele Della Valle needs to stay away from film and go back to his day job.","user":"PurpleCrayon2014","rank":[15,30]}]