[{"title":"Total Waste of time","rating":3,"date":"21 September 2016","review":"Horrible just Horrible <br><br>It has some OK hack and slash scenes but that's about all you get plus after 20 min of it you get the feeling that someone decided to make a movie on a Sunday and then shot the movie on Monday and finished it by Tuesday <br><br>I don't see any Viking culture in this movie just some man with beards and swords a shame because the story could have resulted in a great movie <br><br>maybe 5 years ago people could get away with this but now are days with the hit Series,s Vikings playing ..people should make a better effort to at least make a movie that comes close to real Viking culture","user":"coolbreezera","rank":[28,31]},{"title":"One of the worst movies through history","rating":1,"date":"14 October 2016","review":"I think it is enough said I have registered to document it. Maybe its production costs 23 $ or something. Really awful movie with around 10 actors .. can you imagine wars and battles done between 6 or 7 poor men. I do not know whose idea was this to have a big achievement in such failure. Maybe some actors was not too bad but still sharing in this miserable production. If you've got some extra boredom time but welling to spend some more boring time .. it is your choice then .&gt;&gt; if you have this decision make sure you are not suffering from heart diseases. I am suffering more now while spending time trying to help potential watchers figuring it out. from my heart I wish James Cooke, Hollie Burrows and Abbie Hirst .. please try to choose what you are doing .. you have a good seed .. do not kill it","user":"drahsami","rank":[15,16]},{"title":"What was this","rating":1,"date":"29 November 2016","review":"This movie starts out with some absolutely terrible acting between the main actress and someone with a terrible accent who somehow survives a fire with nothing but a burn on his face only to have his head cut off seconds later. The awful acting continues through out the film, an they try to make you forget about it by adding gore to the short and poor fight scenes. There is no chemistry between the two main actors and the film consists of them walking through trees asking each of the questions that seem to lead to nowhere. There is nothing that I can honestly say stands out in this movie other then the fact that the acting is dreadful.","user":"tommyshaw-95611","rank":[9,9]}]