[{"title":"Seriously?","rating":5,"date":"23 November 2018","review":"I don't really mind rubbish films, it passes the time. But what I don't get is how the wife is all like \"I just want to hide and go home to mommy\" for most of the movie, then she listens to some rock record, has a drink, shoots couple of rounds at a dummy and suddenly she's frigging Lara Croft shooting everyone and asking her husband to \"cover me\"! Her acting is just terrible and I seriously hate her character. Other than that movie was ok.","user":"dfibuchuk-32795","rank":[31,37]},{"title":"Decent flick","rating":8,"date":"31 July 2018","review":"I have no idea what the low rating people were expecting. It obviously is not an Oscar movie and doesn't want to be. It also did not want to have some grand plot. It's just a nicely done action and gore move in a post-apocalyptic setting. <br><br>Also, for the review complaining about lack of chemistry between the leads and the wife's unrealistic transformation: the wife clearly said they were getting through a divorce when \"it\" happened, and that she had been heart broken. Her character at the beginning of the movie is clearly depressed and not facing the realities of their world, she looks half \"asleep\" and afraid all the time. \nI found her change in personality to be quite natural for someone who was awakened by the brutalities they experienced, who realized she wanted to live and that she still loved her husband a lot and was prepared to act to defend that, and her awakening was completed when the last pretense was shattered at the end, the hope that her parents might still be alive.","user":"roxalien","rank":[59,75]},{"title":"More believable and realistic than most post apocalyptic films.","rating":7,"date":"1 July 2018","review":"Overall this was a very solid story that held some nice emotional depth between the main couple surviving the insanity with some fantastic action packed thrills , and truly awesome post apocalyptic atmosphere that was shot brilliantly. I definitely recommend this and predict it will become a realistic foretelling post apocalyptic cult classic. I loved that it was set in northern Minnesota and Wisconsin.","user":"tresm87","rank":[84,119]}]