[{"title":"\"Being the chosen one really sucks\".","rating":6,"date":"24 May 2018","review":"Is there originality in its all too familiar bubblegum premise, no, well actually, kinda? This Australian minor-budgeted feature does walk the walk of throwing gimmicky ideas out there and seeing what sticks. The canvas is abstract, and wall-to-wall impulsive. So prepare to be tripped out and boozed up, drowned in squirting blood, rocking out some tunes and bombarded by dopey possessed (friends turned) ghouls in what feels like a whiplash of genre homages. A cabin-in-the-sticks trope screaming \"Evil Dead\" - well, hidden away in the corner of the shack is a poster for the film - engulfs this raunchy, crazy-stupid demonic branded horror of cartoonish thrills, pulsating stoner humour and self-knowing performances set up against an eliminating backdrop of pop-up aesthetics, stagey sets, a fog machine and green/pink fluorescent lighting.<br><br>This is the type of film you'll either be turned off by its in-your-face obnoxiousness, and amateurish-looking theatre quality or shut off your brain and simply go along with this dirty, wild weekend from hell. I went with the latter, although there are spots where the fun turns to mockery, which can test your patience. Anyway what do you expect when you get a mechanical demonic unicorn head puppet(?!), sometimes becoming a human/unicorn hybrid with feathered wings which can fly(?!), centipede crawling out of a... ah, best you see it yourself(?!), a mutant spider bug from hell(?!), a lot releasing of bodily fluids, a zombie kangaroo with boxing gloves(?!), a bleeding painting that can foretell the future, a blood-soaked fur rug that transforms into a gateway for evil minions and a climatic rap-off against the forces of evil. I'm sure something there, will be tempting enough. Nice to see these moments are done using practical effects and Daisy Masterman was a lot fun as the brash heroine.<br><br>\"Tarnation\" doesn't pretend to be anything else than what it's all about; crass laughs and outrageous shocks on-the-cheap. I might have to check out the director's other films, \"Sheborg Massacre\" and \"Murderdrome\" to see if they're as just bonkers.","user":"lost-in-limbo","rank":[7,12]},{"title":"'No' is a word that pretty much sums up the entire movie here...","rating":1,"date":"29 June 2018","review":"I didn't even know what this movie was about prior to sitting down to watch it, only that it was supposedly a horror movie.<br><br>Well, this was a low budget movie in every aspect of that term; from the cheesy special effects, to the acting and to the production level. Now, you might wonder if it was bad enough to actually be entertaining and watchable. Nope. Let me just clear that right up; it wasn't!<br><br>I managed to endure about 15 minutes of this movie before I gave up. It was just unfathomably boring and lacked production value to be appealing to me.<br><br>The acting in the movie was every bit as expected for a movie such as this. The plus side here was that it was all unfamiliar faces on the screen.<br><br>I am not going to be returning to watch more of \"Tarnation\", as the movie had absolutely no appeal to me in any way.","user":"paul_haakonsen","rank":[10,23]},{"title":"The worst film I have seen all year - nope - decade","rating":2,"date":"3 September 2018","review":"This really is the most atrocious film I have seen for years.<br><br>Pick anything about cinema or film making and this is a perfect example of how not to do it.<br><br>There is acting - just very bad acting. There is a picture - which was probably produced by someone who has never seen one before - certainly not a moving one. There is noise of sorts - most likely produced by recording on to a tin of baked beans - which were subsequently eaten and regurgitated for sound effects. The lighting is terrible, the 'special effects' are the worst I have ever seen, the scenery came straight from a supermarket and they left the packaging on. The lsit goes on and on.<br><br>This is either a zero because it really is that bad, or it is a 10 for managing to get released in any form - a master-stroke of double bluff.<br><br>You will be disappointed if you watch this film. But once you start you really do have to watch it to the end just to make sure you haven't gone mad.<br><br>I only gave it two starts because Danae Swinburne is mega cute and gets her kit off.","user":"mjsreg","rank":[2,3]}]