[{"title":"Only a glimpse of John Delorean","rating":7,"date":"3 November 2018","review":"We saw this movie at it's premiere in Venice. Although a great story and depiction of the final demise of John Delorean, the film only barely touched on Delorean's meteoric rise through GM and barely touched on those accomplishments. Jason Sudeikis steals every scene he is in as Jim Hoffman, but Lee Pace's portrayal of John Delorean is spot-on of the methodical genius. Presented as a \"based on true events\" biopic, I feel a lot of dramatic licenses were taken in bringing the final story to film.","user":"kssttravel","rank":[35,49]},{"title":"Flawed Man Gets Flawed Movie...Still Worth A Watch Though","rating":6,"date":"18 August 2019","review":"If you're looking for a serious biopic I imagine you'll need to keep on looking. This movie makes the serious matter of destroying a jet setter and iconic car designer into light comedy. It does entertain, but it feels like someone read a book about John DeLorean and not much else. In spite of a notable performance by Lee Pace as John DeLorean you only get a one-dimensional rendering of this complex man. It does succeed in making DeLorean a tragic likable figure spite of the suspicion he was a narcissist consumed with equal measures of hubris and delusions of grandeur. With the right combination of desperation and ridiculous entrapment the unthinkable happened. DeLorean, even as a non-guilty verdict was delivered, was essentially destroyed. Knowing there was such a tragic downfall makes the comedy often seem clumsy. Actually more of this movie is devoted to the FBI informant who baited DeLorean named Jim Hoffman as played by Jason Sudeikis. It's hard to believe as Sudeikis, who plays his usual comedy schtick, depicts this character realistically. This forces the viewer to see a sordid tale as something hardly as gripping as anything of this gravity should be. You must accept this is a comedic rendition of a utterly ridiculous government sting. One which only ending up tearing apart a flawed man, a company, a dream, and a family. It glosses completely over the human tragedy and huge financial loses. I guess the movie actually could be said to mirror the DeLorean car in that it had so much potential only to fail on many levels.","user":"AudioFileZ","rank":[17,23]},{"title":"Not a Great Movie But Engaging Enough For a Watch","rating":7,"date":"2 October 2019","review":"If nothing else, the colorful clothes, cars, music, and hairstyles of the '70's and '80's are a hoot here. The film can get muddled and disjointed with its flashbacks, but I felt there was enough here to keep me engaged and it does end strongly. Inspired by true events, I remember seeing the FBI tapes involving John DeLorean on the national news as this story did have a national impact.<br><br>All in all, not a great movie as I see it, but engaging enough for a watch.","user":"larrys3","rank":[6,7]}]