[{"title":"Surprisingly decent","rating":7,"date":"7 July 2019","review":"Okay, this is not as good as Harry Potter like another review said but it also wasn't total garbage like some others stated. It was like watching a movie based on a teen fantasy/romance novel - reminded me of Mortal Instruments series by Casandra Clare. I thought the actors did a good job and I liked the storyline. There were parts that were a bit odd but I'd watch it again. I would've liked it even more if I was a teen.","user":"wallisar-1","rank":[22,34]},{"title":"If you've ever felt that pain in your stomach because of loneliness or love, you'll like it","rating":8,"date":"21 September 2019","review":"I really liked it, and I'm not a teenager, I've seen thousands of movie, am a member of Mensa, and have nothing to do with the movie industry whatsoever.\nI've seen actually bad movies, and this one is not that. The acting was excellent, very believable, the filming was of satisfactory quality.<br><br>So yeah, I liked the movie a lot, maybe because I could relate to the main characters: like them, I've felt different most my life, I've felt extremely deep love, and kindness.<br><br>I usually dislike action movies, and the fact that I liked this film probably means that it's not an action movie as you would imagine it.<br><br>Maybe the people who didn't like it were expecting more action, or more \"funny\" lines (you know, the usual stuff you find in Marvel movies, with a supposed-to-be-funny line every 10 seconds)...<br><br>If you like stories, and excellently displayed feeling and transcending oneself, give it a shot.","user":"NiouiNinon","rank":[7,9]},{"title":"Emotionally thoughtful","rating":8,"date":"19 July 2019","review":"This movie isnt going to win any awards, but it is wirth the watch. In a world filled with fear and pain like today, this film spreads a little hope and love. Maybe not the best acting or special effects, not flashy or showy like some recent blockbusters, but an emotional masterpiece. A wonderful story that will touch your heart if you let it.","user":"figleafsoaps","rank":[16,25]}]