[{"title":"You'll Need Patience For This Slow Burn Western","rating":6,"date":"12 April 2018","review":"You'll need patience to get rewards out of this very slow burn Western, as it won't appeal to everyone. Lance Henriksen and Tom Berenger lead the way here. Henriksen portraying the former bank robber Taylon, now aged and dying but looking to pull off one final heist so he can give the money to his daughter (Meg Steedle). Berenger plays the former Texas Ranger Will McMullen, who is now the eccentric sheriff of the town of Durango, where Taylon's bank target is.<br><br>In my opinion, too much emphasis on Taylon's deteriorating health and some unexplained plot elements mar the movie somewhat. But if you're the type of viewer that doesn't mind a slowly developing story, there are rewards here in the believable performances and even some dry humor adding well to the mix.","user":"larrys3","rank":[27,31]},{"title":"Gritty movie about getting old and making things right","rating":8,"date":"2 April 2018","review":"Movie moves kind of slow, focuses on what its like getting old and knowing its almost over<br><br>Has some underlying messages on how some younger guys figure old guys are 'out' of it<br><br>Redemption the hard way, going out like a man etc<br><br>Lots of cigarette smoking<br><br>Very good to above average acting, good direction, good camera work, excellent costume work. Characters are believable, ages are correct for roles. Set pieces look real for the times they are in<br><br>Trio should NEVER have gotten first billing, he is barely in this movie. <br><br>Good symbolism done in the movie for 'crossing over'<br><br>--Enjoy","user":"the_doofy","rank":[32,47]},{"title":"The days are back","rating":8,"date":"31 March 2018","review":"Really glad someone decided to make a good western. Mr. Henriksen has not lost his touch in selling a character. Really top notch performance. Mr. Berenger and Mr. Trejo also hit the mark with true style. The young supporting actors also give a fine performance.Many thanks to all the crew for putting together a fine example of what the western genre could, should and ought to be.","user":"eqdennie","rank":[19,28]}]