[{"title":"I'm Batman","rating":8,"date":"14 April 2019","review":"This is a politically incorrect comedy similar in many ways to Police Academy. After shooting his partner Garret (Christopher Titus) is in charge of training 4 handicapped people to be police officers. In addition to the overt funny lines, there are hidden lines such as when they say Sophie (Debbie Lee Carrington) the vertically challenged person, is always \"grumpy.\" Or when they scream \"Alvin\" like Dave Seville. I found myself laughing.<br><br>Guide: F-word. No sex or nudity.","user":"nogodnomasters","rank":[3,3]},{"title":"The Comedy Is Really Funny, BUT","rating":5,"date":"29 March 2019","review":"I Liked the jokes very much, but it felt off.<br><br>The Pros:<br><br>Like I said the comedy is funny, all the interactions between characters\nis comedy orientated and you can see that in every single scene.\nThe actors were somewhat acting over the top which, to me, fitted the mood and story of the movie.<br><br>Overall, all human interactions and dialogs were comedy orientated and you could really see there were a lot of funny ideas, it is pretty cool to see a very funny man show us what he does best.<br><br>The Cons:<br><br>Like I said the comedy is really funny, BUT\nIt did not feel like a movie, there were a couple of things that felt off.\nAnd in my opinion there were 2 major things causing this;<br><br>Environment sound:<br><br>The change from having only environment sound or only music or no background sound at all felt clunky.\nAnd at some moments the environment sound did not fit with the scene.<br><br>Music:<br><br>The timing of the music felt off. It feels awkward when you are laughing after a punchline and 2 sec later music starts, I stopped laughing each time because I expected something to happen and this would happen a lot.\nIn some scenes the music would suddenly stop or begin to emphasise the spoken or physical comedy at weird timings, It felt clunky.<br><br>Maybe it would have helped if the music was thought of as the introduction, applause and laughter within a standup routine, put the music where you would 'expect' those 3 things to occur in the movie and you would probably be on par with the audience laughing and each scene with music would not feel off and clunky.<br><br>The jokes are very funny, fantastic ideas, but to me the environment sound and the timing of the music stagnated the flow and feel of the jokes and the movie.<br><br>Therefore a rating of 5.","user":"acutisnasus","rank":[3,3]},{"title":"Wasn't expecting this.","rating":9,"date":"30 October 2017","review":"I've been a huge fan of Christopher Titus for years and I listen to his podcast occasionally. Lately he's been promoting this movie and honestly his repeated promotions got old. It got to the point where I'd just skip them or even shut off his podcasts when he'd start. Eventually when this movie came out I saw promotions for it and I just turned away. I didn't expect it to be a bad movie but I wasn't expecting it to be good either. In order to prevent having a bad or meh experience I just decided to ignore it. Well, tonight I decided to just go on a whim and just watch it. I mean the way Titus has been raving about how hard he and his team have been working on this thing I figured I should at least be a decent fan and checkout his work and try to support him in some way. I went into the movie with low expectations and well, I was absolutely pleased with this thing! Like, The jokes in this thing were right after another at a few times I had to pause the darn thing just to catch my breath from laughing too hard. It was nice to see a few cameo appearances from some of Titus' old co-stars from his old sitcom like Zack Ward (He did a few stunts in the beginning) and Cynthia Watros (She played the mayor). As for the characters, I found Alvin's character to be the best dude stole the show and his scenes had me laughing hysterically. I have to say, if you've been on the fence about seeing this movie you should definitely give it a shot. Great job Combustion Films team! I can't wait to see your next project! Keep up the good work.","user":"shadesofgrey-77135","rank":[12,19]}]