[{"title":"Not even scary.","rating":1,"date":"20 February 2018","review":"The movie fails on every aspect. Its not scary, its not funny, almost zero suspense. But the plot, oh my God. They introduce an algorithm startup in 2016 like its something knew. Then the whole company employees AND THE BOSS go traveling after a prank video \"mystery\" (really?), like its the ONLY thing that could make them great. A common, regular, 10 second video that a monkey could make at the basement. And then, after no escalating, a mask fellow screams at the camera, with zero background, zero emotion, zero reasons to be there or to be creepy. And thats it. You don't even get to know if people are killed or what. The whole boring movie just lead you to about 4 miserable screams. The end.","user":"mat123-1","rank":[22,29]},{"title":"Why was this made?","rating":19,"date":"19 April 2018","review":"OK so I'll open by saying that on paper this movie sounded alright - I saw the trailer and thought \"ok another found footage movie about some people trying to debunk a scary video, I've seen a bunch of those so I might as well give this a shot\". Unfortunately, in practice nothing about this movie works. #Screamers is a strong contender for worst found footage horror movie ever. \nThis film is predominately focused around the company Gigaler, and it stumbles immediately from the get go. The first HOUR or so of the movie is literally just a guy filming people in the office doing day-to-day stuff and giving background on the company. The weak writing is instantly apparent; despite spending an absolutely inordinate amount of time on the inner workings of company, the writers seem to have no idea what this company does or how one even works. It's like they just threw together some buzz terms they read in an article about google: uh yeah this company does uh...social media...and videos...and, uh, steals people's privacy...somehow. Oh and they have a foosball table because modern tech startup! Nothing about the company makes much sense and nobody seems to do all that much there. Also, why is there a guy filming everything people do? Another issue is the character writing. For example, they hype the main boss guys up like bigtime entrepreneurs who have been at this for a long time and have created a(nother) seemingly solid business, yet at the same time the guys act pretty clueless and like they're still grasping in the dark hoping to find their big break. That big break apparently lies within a couple of short videos that show a girl and then a head pops up with a loud scream jump scare, ending abruptly. Um, weren't these jump scare videos being done like 10 years ago? Five Nights At Freddy's has way better jump scares and it only took one dude to make vs. this crap from an entire film crew/studio. Anyway, back to the dialogue: case in point, when the boss calls the lady who makes the videos it should have been unsettling and introduced some tension / creepiness to showcase the forthcoming scariness that will be associated with tracking down the videos. However, the conversation is super awkward and unintentionally comedic. The boss doesn't seem to know what he is even doing, and the lady sounds bored. That is representative of all the movie's dialogue - awkward and confusing. This is a huge problem being that this movie is 95% awkward, pointless dialogue and a mere 5% stuff happening. Even with all the bad dialogue, they could have made up a bit with the scary parts, right? Wrong. The whole video thing is highly unbelievable. The videos themselves are like 10 second clips with 0 budget that aren't creepy in any way. There is not a single thing about these videos that would get people curious as to who is behind them, especially not enough to physically go after them. In my opinion, they should have dumped all the budget into making genuinely bizarre, creepy videos that would intrigue viewers. Later, there is something about the whole thing being a hoax and the company trying to get publicity by exposing it, which is a decent idea, but I was so bored and off-put that I had lost all interest by then. Also something about Jack The Ripper? Who cares. Nothing scary happens. There are no deaths, no on-screen tension, no spooky stuff, etc. Ultimately the movie is terrible and beyond boring and I would encourage you to avoid at all costs.","user":"wormsoftheerth","rank":[16,21]},{"title":"Probably the worst movie I've ever watched. Sharknado had more plot than this trash","rating":1,"date":"19 April 2018","review":"First hour of this movie is literally just a guy filming what goes on day to day at their office. So boring, I had to skip ahead. Then they get the \"scary footage\" whatever. More boring office chatter and boring dialogue. Then they all decide to go solve the mystery, and in the LAST FIVE MINUTES is where it gets \"scary.\" And I'm using scary VERY VERY generously. For the rest of the movie, you literally just see this random dude in a mask who keeps screaming into the camera as the camera crew disappears. You don't even find out what happens to them. Did they die? I don't know! Who is this man in the mask? Why does he and this random Tara chick live in this house? What happened to Tara for her to have gotten there? No backstory, no explanation of why any of this is happening, no resolution, literally no plot at all. I can't believe I finished it. I was really trying to give it a chance. PLEASE DON'T WASTE YOUR MONEY. I literally think all the people who wrote these reviews were paid to give 5 stars. If i hear that scream one more time, I will smash my computer. There wasn't even a difference in any of the screams. It was literally a pre recorded scream that they just kept playing over and over again as the masked guy appeared. SO FAKE SO BORING SO STUPID PLEASE DON'T WASTE YOUR TIME","user":"danielleosborn","rank":[16,21]}]