[{"title":"A life-affirming meditation on friendship, art, and mortality","rating":9,"date":"6 October 2017","review":"89-year-old filmmaker Agnès Varda (\"The Beaches of Agnès\") said, \"I have a nice relationship with time, because the past is here, you know? I've spent time, if I have something of my past, I'll just make it, nowadays, I make it now and here.\" Varda makes both past and present come alive in Faces Places (Visages Villages), 89-year-old filmmaker Agnès Varda (\"The Beaches of Agnès\") said, \"I have a nice relationship with time, because the past is here, you know? I've spent time, if I have something of my past, I'll just make it, nowadays, I make it now and here.\" Varda makes both past and present come alive in Faces Places (Visages Villages), a life-affirming meditation on friendship, art, and mortality. Co-directed by JR (\"Women are Heroes\"), a 33-year-old hip French graffiti artist and photographer whom the director met in 2015, Varda and her companion make an unlikely couple. She stands out with her two-toned hair and diminutive stature and JR does a convincing Jean-Luc Godard (\"Goodbye to Language\") impersonation with his black fedora hat and dark sunglasses which Varda teases him about the entire film.<br><br>Both live life on the edges and do not live by the rules. \"Chance has always been my best assistant,\" she says. Driving without any particular destination, they crisscross the French countryside in JR's van decorated to resemble a camera with a large lens on one of its sides. The travelers meet and take pictures of villagers, workers, and townspeople whom they immortalize with gigantic black and white portraits plastered on the sides of walls, old houses, container cargo, trains, and other objects. Playfully, Varda describes it like this, \"We ended up with huge images of them after I made them express themselves. So it's a real documentary because we are careful about what they are, what they want to say. But also, we play our game, as being artists, making strange images or enjoying that people we meet becomes actors of our dreams.\" <br><br>The people they meet are former miners, waitresses, plant safety workers, truck drivers, and dockworkers and their wives in Le Havre. By himself on his 2,000 acre farm, a man laments the passing of the social aspects of farming, recalling how it was when three or four workers were always there for companionship. In other vignettes, a man and his son are responsible for ringing the church bell in a small village and farmers enjoy hand-milking horned goats, regretting that others cut off the goats' horns and do their milking with machines.Varda and JR also travel to an abandoned village which is suddenly filled with arriving well-wishers. They go to the Brittany seaside where she remembers the photographs she took of a young friend and fellow photographer during the mid-1950s, pasting an image of him reclining against a beach hut on a German bunker and telling JR how peaceful he looks resting there.<br><br>The slow pace of travel allows Agnès to confront other memories from her past, including a visit to a small cemetery where photographers Henri Cartier-Bresson and Martine Franck are buried. After visiting JRs 100-year-old grandmother, JR asks her if she is afraid of dying. Varda answers in the negative. \"That'll be that,\" she says.\" Reflecting on her relationship with the great director Jean-Luc-Godard, she recalls the time she spent with him, his then wife Anna Karina, and Varda's late husband, director Jacques Demy (\"The Umbrellas of Cherbourg\"). Agnès and her friend then travel to Switzerland to meet with Godard, bringing the director a gift of his favorite pastry but he is not home. Unfortunately, their only communication is an enigmatic message left on his window pane. In her only sense of irritation in the film, Varda uncharacteristically expresses deep feelings of hurt.<br><br>Faces Places is a quiet celebration of what is most important in life, simple pleasures of companionship and collaboration, of art made real and accessible, and of the divine in the commonplace. Varda said it best, \"I know that the seaside represents the whole world\", she remarked, \"the sky, the ocean, and the earth, the sand. And it's like expressing where is the world. It's about a calm sea, a calm ocean, just a very, very discreet wave ending on the sand. And that's a landscape that touches me a lot. But I know that also people feel that, too.\" It is hard not to be touched by her presence.","user":"howard.schumann","rank":[17,21]},{"title":"Playful road trip with themes of image-making, storytelling and aging","rating":8,"date":"7 October 2017","review":"Cinema's greatest gleaner goes rambling with JR, one of France's most prominent street artists. Together they traverse the countryside in a mobile photo van capable of turning out large-scale photographs of the people they meet on their travels. It's a low-key and playful road trip for these sharp creatives as one 88 years-old and one 33 explore image-making, storytelling and aging. The effect is magical as farmers find their images on their barns, an old woman's face is inscribed on the wall of her condemned house, and giant women's images are assembled on shipping containers. This is art that connects directly and delightfully with ordinary people and their local environments. The gigantic portraits in living landscapes are ideally suited to the big screen. This is a highlight of the ADL FF","user":"andrewbunney","rank":[11,14]},{"title":"Charming","rating":13,"date":"13 March 2018","review":"I can't say that I completely agree with the level of acclaim this film has gotten, but for the most part, it remains the type of documentary film I love- very observational, very experimental, and free-flowing in its expression of art, love, and other positive emotions. The film is edited very well, and although I didn't really connect with every single piece of story told on screen, I got to enjoy the film as a whole and everything it amounted to. For an acquired taste, but definitely recommended.","user":"Red_Identity","rank":[7,11]}]