[{"title":"Just a below-average action-thriller. This time it isn't Cage's fault.","rating":4,"date":"22 January 2017","review":"\"Oh, you think we're even you and I? I know of way we can both earn what we deserve.\"<br><br>Nicolas Cage is known for his wayward choice in terms of films recent years. His career had some ups and downs. As a result, the opinions on his acting talent in the world of film lovers are rather divided. His performance as Eddie King, a manic, coke-snorting, aggressive underworld figure, who's also not afraid to handle opponents in a rough and cruel way, is an exceptional case. At first sight it isn't a thunderous acting performance that he delivers and it tends to be rather ridiculous. A kind of cartoonish character whose tantrums and neurotic behavior comes across as exaggerated. At first glance he looks like a parody of Tony Clifton (an Andy Kaufman impersonation) with a weird wig, a walrus-like mustache and glued on fake nose. Let him wear some over-sized sunglasses on his fake nose and you'd swear it's Roy Orbinson. But at the same time I thought he was incomparable. In other words, it's hard to define Cage's acting as being woefully bad or masterfully brilliant.<br><br>Unfortunately this isn't sufficient enough to assess \"Arsenal\" as an excellent film. The story on its own isn't really brilliant or innovative. To be honest it's mostly boring and meaningless. The main characters who actually carry the entire film, with Cage in the background acting as an accessory to flare up the tension with bloody and highly aggressive scenes in slow motion, are JP (Adrian Grenier) and Mikey (Johnathon Schaech). The beginning shows how the two experienced their childhood. A not so rosy picture of two future-less teenagers who spend their time hanging around in an arcade, because it isn't so pleasant to be at home. One day Mikey comes home and makes a shocking discovery. That's a crucial moment. From there on their path go into opposite directions. As you can witness when they are adults. JP is the person who walked the honest path. He's the owner of a successful construction company. Mikey on the other hand, has chosen the side of Eddie King and ends up as a small-time gangster. After being robbed and losing a package of valuable drugs and not being able to pay of the money he owns Eddie, the latter has this masterful plan to arrange the matter. Now the truly honest brother must pull out all the stops to save Mikey. And that's what this movie is all about.<br><br>The whole movie revolves around the loyalty between the two brothers. Even if Mikey is a loser whose life is a concatenation of making wrong decisions and crime, yet JP remains faithful to him and he does his utmost to free him. And this with the help of Sal, a sort of undercover agent played by John Cusack who's wearing a bandanna and holding an e-cigarette. The only purpose he has is to provide JP the necessary clues so he can track down those who are responsible. Trust me, it sounds more fascinating than it looks. The initiative to fill the film with bloody, raw violent scenes with lot of blood flowing freely out of inflicted injuries from the victims, won't ensure that \"Arsenal\" rises to an acceptable level. And may I also inform the sports fans for a moment? There's a lot of kicking around, but the film has nothing to do with the famous soccer team.<br><br>Ultimately, \"Arsenal\" didn't become the thriller it intended to be. The story was too simplistic, the violence too excessive and the characters too one-sided and uninspired. Strange but true, the only bright spot in this film is the exorbitant and crazy role played by Cage. Normally, the failure of a film is mostly due to the failure of Cage's contribution. \"Arsenal\" is in my opinion a low-budget movie with kinda sounding names participating in it. Yet another proof that this isn't a guarantee to get an excellent end result. Finally, the most striking fact I saw in this film. Despite 23 years passed and the two brothers grew into adult men with graying hair and beard, Eddie King still had the same appearance. Apparently sniffing hallucinogenic drugs has a preservative effect.<br><br>More reviews here : http://bit.ly/1KIdQMT","user":"peterp-450-298716","rank":[19,21]},{"title":"Dump and uninteresting.","rating":4,"date":"23 January 2017","review":"Poor Adrian Grenier. This movie was not the best laid plans for a future as a leading man.<br><br>The 1st clue was Nicolas Cage himself. I like Cage and all but he tends to suck the very essence out of a film with his over the top bad acting.<br><br>Grenier plays the good little brother trying to make sure his bad big brother gets on the right path after being on the wrong one for so long. Semi ironic as it's big bro who 1st introduce baby bro to the right path. It's a story I literally herd a thousand times, in fact I think I've seen at lest one movie a week with this subject. The stories of the two brothers is weak, and not implemented very well by the filmmakers or the actors playing them.<br><br>And there was absolutely no point for John Cussack to be in this film. They could have saved some cash and gotten someone else. Spend it on some better action scenes.<br><br>So Grenier's leading role status is up in the air. I hope he has an awesome real life entourage he can lean on.<br><br>It's a skipper.<br><br>http://cinemagardens.com","user":"subxerogravity","rank":[19,24]},{"title":"By the numbers DTV effort with a terrible lead and good supporting actors.","rating":5,"date":"7 January 2017","review":"Not sure who thought Adrian Grenier was a good lead in an actioner but he kinda seemed out of place in his role. Not to say he is a bad actor but he didn't fit the role here. The best role and acting in the movie belongs to Johnathon Schaech. He might have played a supporting role but his character had the character development and emotional layers to it. They could have just focused the story on his and Nicolas Cage's character. And coming to Nicolas Cage, say what u want about the man but he still really do a great job in whatever role he takes up. This movie may not be up to his standards as an actor but he played the role the second time in the best way possible. Of course,when he did this role the 1st time,he had more screen time and more craziness to his character. Here,it's toned down a little. I would say that's a mistake on the director and screen writer's part because Nicolas Cage is easily the selling factor of the movie and why would you limit his screen time and the amount of crazy acting he could deliver? Still,Nicolas Cage did a great job and the movie is easily worth watching for him but i do wish he takes less roles like this and returns to serious,award worthy roles and movies. He has the talent and would be such a waste to be a regular in movies like this. The movie itself wasn't a terrible one and at the same time,isn't anything to rush out and watch. Too average and doesn't have any factor that puts it different from other DTV movies except for the presence of Nicolas Cage. It's nice to watch once but that's it.","user":"nathan_kugan","rank":[20,27]}]