[{"title":"Creepy, very British Horror film.","rating":8,"date":"30 March 2018","review":"This portmanteau film is made up of 3 scary ghost stories, all investigated by a man of science who is convinced the paranormal can be explained away with mundane explanations. A mysterious package leads him to investigate these 3 spooky tales. Great acting, well shot and directed, with a very British sense of humour sprinkled throughout. Do not read too much about this movie, just go and experience it, I think you will find it scary, interesting and most of all worth your time.","user":"jonrosser81","rank":[140,186]},{"title":"Very well made - but ultimately disappointing","rating":6,"date":"6 April 2018","review":"It's difficult to review Ghost Stories without giving spoilers away, so I'll be very careful in what I say.\n \nIf you're after some good jump scares and some nervous laughs, then it executes those beautifully. Also, Alex Lawther should be praised for a performance that knocks it out of the park. It's a good cast, but he outshines them all.\n \nHowever, I do have issues with the story itself. \nInitially the plotting teases a new post-modern take on portmanteau horror, with the individual cases not resolving in the usual way, but building to something more climatic.\n \nBut the story constructs its final act by falling back on a trope that we have all seen before and this left me disappointed when the credits rolled.\n \nFrom Jeremy Dyson and Andy Nyman you might expect something else. Something different.\nSomething new.\nIt's very well-made, but it's not different or new.","user":"Simon1970","rank":[123,165]},{"title":"Mind games.","rating":7,"date":"7 June 2018","review":"Purely English cinema, atmospheric, in the best traditions of horror stories, beautiful, local landscapes are fascinating, in places flavored with humor and though not innovative, but damn interesting. It is impossible not to mention the actors, not to carp, Martin Freeman liked the most.<br><br>The plot gravitates toward anthologies, but stories are not torn from the context of the narrative and are weaved into it, the final all unites.<br><br>Cinemas do not often bring high-quality mysticism, so this film is an excuse to go to the movies for fans of the genre, do not wait for revelations, but time is definitely not wasted.","user":"BiiivAL","rank":[125,170]}]