[{"title":"Unforgettable Experience","rating":8,"date":"7 August 2016","review":"There has been much anticipation and controversy preceding the theatrical release in Egypt with several rumors that it will get censored on not released at all and a reporter on National TV called the director a \"traitor\" and an \"anarchist who only focuses on the bad aspects of Egyptian society to capitalize on them.\" But although it's the most political film to be released in Egypt after the revolution ,in a market dominated mostly by comedies and Hollywood blockbusters, it comes off as mostly apolitical.<br><br>Clash is the second feature film for writer/director Mohamed Diab taking place in early July 2013 after president Mohamed Morsi was overthrown by the army and many people took off to the streets either to celebrate or protest. Starting in an empty police car of about eight meters square which soon gets filled with different people arrested in the protests ranging from an American/Egyptian reporter to revolutionaries and Muslim Brotherhood supporters to a group of young men who had nothing to do with it all except that they happened to be walking by.<br><br>Tensions arise and we start to see the sheep mentality of both the Muslim Brotherhood members who only talk to each other and refuse to stand next to the others and that of the policemen who refuse to giver the arrested water as they were not \"ordered\" to.<br><br>But the movie doesn't focus on their political affiliations and portrays them as only humans. We see the revolutionary nurse helping a wounded M.B member. They sing, they share their memories during the Arab Spring revolution. The short running time may not allow to dig deeper into the characters but I believe it focuses on living the experience by confining our POV inside the car during the whole movie making us feel as hopeless and suffocated as those trapped who aren't even allowed to pee and instead are shown how to do it in a bottle.<br><br>The dialogue sometimes seems a little childish and some things felt like they were thrown in just to increase the running time as the argument between Mans and his friend who found out that Mans is sending romantic messages to the his sister.<br><br>The clash scenes between the police and the protesters were masterful and showing them only through the car windows makes them seem even more colossal giving a real feeling of the chaos. The ending was cinematically beautiful with the green lasers all over the place. Although the ending may seem a little unsatisfying to some (including me at first), I think it's the perfect reflection of the current thinking in Egypt.<br><br>After The Revolution in 2011 during the Arab Spring, everyone, especially the youth, started thinking of his own utopia and were looking forward to a \"New Egypt\" only to see their dreams evaporate as they saw the same mistakes being repeated again, their political leaders betraying them, giving them only false promises and sweet talk. As I am writing this now, the economy is at its lowest with the rich/poor gap widening gradually, the budget for health and education dwindling, the political arena is filled with the same faces or new faces with the same mindset of the old regime. Censorship touches everything and there have even been talks to censor the Social media. so you can't really blame them for losing hope and abandoning their dreams and not seeing the light at the end of the tunnel. For them there is only darkness-nothing else.","user":"martinzedo","rank":[16,20]},{"title":"A fresh restart to Egyptian cinema.","rating":9,"date":"28 July 2016","review":"For all of you who don't know, back in the 40's and 50's .. Egypt had one the best movie industries in the world, it was an equal to Hollywood back then .. but as our fellow writer lemony Snicket says due to a series of an unfortunate events, Egyptian cinema went downhill starting from the middle 60's .. there were some exceptions and some great works done by independent filmmakers such as chahine and atef eltayb and mohamed khan .. and yet there was still hope in Egyptian cinema .. but it was all gone starting from the middle 90's .. Very few movies i can recall that was OK in this period till late 2000's ..and then starting from 2010's we saw some real potential in a new generation of filmmakers that can actually restore Egyptian cinema legacy such as Amr salama and Mohamed diab .. and here we have on of the best Egyptian movies in the past two decades and the most thought provoking one.<br><br>Clash takes place in only one setting a 8m police truck .. from the beginning .. You would have this Claustropohbia even if you don't have it, Diab wanted to tell us than the true claustrophohia is in our thinking, in the narrow thinking that could end all of us, this movie isn't pointed toward a single audience .. it's a movie about humanity, about how to accept each other even if sometimes we can't stand each other but in order to move forward we have to, and it's done in a beautiful symbolic way .. It also have a political background and it may seem at first that's it's the movie's story but actually no, the political purpose is there i won't deny but it's crafted in a light way that Foreign audience can still watch and enjoy and have the same impact as Egyptian one's .. <br><br>The casting was superb, everyone did their job in a stellar, outstanding way .. I won't talk too much about it but it's truly one of the movie's positive sides.<br><br>The direction and the cinematography are the ones that truly deserves to raise the hat for, an exceptional work done, and take in recognition the budget of this movie that won't actually exceed two million dollars and maybe even less .. considering the budget of this movie, it's a splendid effort done by the whole crew .. <br><br>It's a movie experience in which you'd feel a mixture of emotions, You'd feel for an hour and 36 minutes like you're being trapped with the characters, and ironically it's Egypt's political situation now.","user":"kill_m_e_plz","rank":[19,26]},{"title":"A film that deserves a wide audience","rating":9,"date":"19 November 2016","review":"When, in 2013, President Mohamed Morsi of Egypt was overthrown in a military coup, members of his Muslim Brotherhood took to the streets in protest. So did those supporting the military's actions. 'Clash' examines what happens when representatives of those two opposing factions are thrown together in the close confines of a police van while the protests rage around them.<br><br>The film opens with two journalists (one a dual Egyptian/American) being arrested. Their bickering about journalistic responsibility is interrupted when a group of anti-Morsi protesters, including a father and young son, are also thrown in the van (joined minutes later by the boy's mother, who refuses to leave him). Things are just settling down when a group of Brotherhood supporters (including an aged father and his teenaged daughter) are also arrested. For a time a police officer is also locked in the van. As these diametrically-opposed groups mingle, they exercise their rivalries, but also find common ground - however, this is no feel-good film: the common ground is repeatedly trampled on by political differences, even as small, individual acts of human kindness occur (such as a Brotherhood member showing an anti-Morsi diabetic how to urinate in a bottle - the only toilet the incarcerated group have).<br><br>In a film with dozens of male characters and only two female, it is inevitable that the women's performances stand out. But I think even in a film with a more equal gender balance Nelly Karim, gifted with a role as the firebrand mother who at times almost assumes control of the group, would be noticeable as she swings from exasperation (her husband getting their son arrested), to rage (the police not releasing the boy), to compassion (attempting to treat the head wound of a Brotherhood member even though he refuses to let her touch him).<br><br>Writers Khaled &amp; Mohamed Diab (the latter also directed) have been careful to show all sides at fault, and all sides as having redeeming qualities: even individual police officers are shown as compassionate and heroic. This is important, as otherwise it would be too easy for the viewer to feel he is being drip-fed propaganda. As it is - and despite a jarring ending when what has been a rather shouty film suddenly loses all dialogue as music covers the final scene - we have a dramatic film with interesting characters and a real sense of danger. I very much hope this gets a wider release beyond the festival circuit (I saw it at the 2016 London Film Festival).","user":"euroGary","rank":[9,11]}]