[{"title":"Refreshingly non American...","rating":7,"date":"5 September 2019","review":"Not a mile away from being your Typical cops &amp; robbers fare, but refreshingly different from the usual formulaic crime movies out of the States... its Well acted &amp; watchable but clearly madev on a budget.. it's a movie I'll probably watch again though, so I give it a 6/10...","user":"Killemall420r","rank":[9,11]},{"title":"One of the best low budget B-grade films I've seen 9/10","rating":8,"date":"29 March 2019","review":"One of the best low budget (2m) internationally produced B-grade films I've seen, and better than some of the recent Hollywood blockbusters with A-list actors. I wasn't expecting much going into this film but was pleasantly surprised. This film had no Hollywood flair in it at all; simple yet effective scenes, excellent choreographed action sequences with realistic fight/bullet wounds, and no over-hyped unconvincing scenarios.<br><br>This film is based on true events and was filmed primarily in Albania and Bulgaria, and thus the international setting was a refreshing change. The score was sheer perfection and maintained constant tension throughout the entire film.<br><br>Novice director William Kaufman was fairly impressive with this film, although I could have done without the shaky-cam moments. Otherwise his camera work and directing his cast was amazing. The cinematography and color choices where perfect for this films setting and story.<br><br>The first-ever writing/screenplay debut by Marco Balsamo was outstanding, who was also cast and produced this film. The pacing was perfect and the 103 min length flew by with the constant suspense of the story.<br><br>Louis Mandylor shined in his role and was convincing throughout. It was great to see Armand Assante, and he did fit his characters role, but I did have trouble understanding some of his dialogue. The rest of the cast also performed quite well, especially since I've never seen or heard of them.<br><br>An all around excellent suspenseful film I found very realistic and produced excellently. A well deserved 8/10 from me, and if anyone is questioning this review as being fake, click on my user name and you will see my 1000+ ratings and 600+ reviews.","user":"TheTopDawgCritic","rank":[24,38]},{"title":"Amateur acting","rating":4,"date":"17 January 2020","review":"Its an OK movie. Should've used more Albanian actors and or languages. I","user":"leoni-63902","rank":[6,10]}]