[{"title":"It's an enjoyable movie.","rating":7,"date":"2 November 2018","review":"I really enjoyed this film. A lot of the negative reviews seem to be awfully nitpicky for a family Disney movie. It's no masterpiece but I can't understand all the hate.<br><br>As we can all agree, it's visually stunning. The costumes are magnificent as well as hair and makeup. The sets are stunning and surprisingly, according to some of the interviews I've watched, most of it is not CGI. They created a beautifully detailed world and it pays off.<br><br>The story is not the same as the ballet, nor does it claim to be. I personally wouldn't want it to be the same. We get to experience the beloved elements of The Nutcracker in a new way. Though there's a lot of room for improvement, specifically in the script, I really enjoyed the new story. The dynamic between Clara and her late mother is great and is the real emotional draw of the film. Because it's a Disney film aimed at kids, the script is awfully cheesy at times, but not enough to be distracting.<br><br>Clara herself should be a strong selling point of the film. She's highly intelligent, specifically in engineering and physics. They make it a point to differentiate Clara from her sister, Louise, a proper (for that time period) young English woman. Not that there's anything wrong with being all prim and proper, in fact, Clara admittedly does spend a lot of the film in beautiful dresses and makeup. And yet, she's still the hero and she still kicks ass. This is important because it associates these feminine traits with power.<br><br>Hear me out on this. I feel like so many of the strong heroines we know and love are, in some ways, stripped of their femininity. They're typically made to be a strict \"tomboy\" who's \"not like other girls.\" This by itself isn't the problem. The problem is that instead of embracing feminine traits, they diminish them. I know gender roles are bull, believe me, but I don't think women should be shamed for being what society deems feminine. You can be a bad b**** AND enjoy princess dresses. Women should not have to adopt \"masculine\" traits in order to succeed. Because of this, I think Clara is a fantastic role model for young girls who will almost undoubtedly take something from her.<br><br>So, although it's far from perfect, it's fun, beautiful, and full of heart. It's not claiming to be the next Shawshank Redemption so I don't see why it's being drilled so hard. It's a delightful little Disney movie, don't think so much about the specifics and just enjoy.","user":"lauraehrhardt97","rank":[362,490]},{"title":"A Parody of Disney, but from Actual Disney","rating":4,"date":"2 November 2018","review":"Mackenzie Foy tries her hardest here, and I enjoyed the one scene with Misty Copeland on stage. However, dialogue and story is beyond muddled. Internal logic makes no sense. Another fairy tale is now an edgy political commentary and an \"epic war\". World feels confined and claustrophobic. A bunch of tired Disney cliches surface here, like moping about dead mothers and Chosen One Princess. They even have a twist villain, because that's so beloved.<br><br>It's cynical and unpleasant. Too dull and scary for kids, too dumb for adults. If you're looking for the Nutcracker you won't find it here. Just go to the actual ballet, or watch the first Narnia movie","user":"davidgouldthorpe","rank":[141,217]},{"title":"Nutcracker without the nutcracker!","rating":1,"date":"8 November 2018","review":"So basically, in the Nutcracker movie the \"Nutcracker\" did nothing! It was all about the girl. They changed the plot so much it was basically Alice in Wonderland with no action. peek of the film was soo underwhelming it upset me. Also used all the cliché things from Narnia, Harry Potter, Alice in Wonderland and some other movies. It was basically quick money grab for Disney. i gave one star for the costume design.","user":"naraagold","rank":[142,220]}]