[{"title":"Filthy, grim, cynical and definitely worth a watch","rating":7,"date":"29 July 2017","review":"I've no idea why this movie has such a low score (about 5/10 at the time of writing.) It's basically a pretty entertaining (if somewhat dark) joke at the expense of modern celebrity culture. It certainly isn't overly profound or thought-provoking, we all know that there are a bunch of vacuous, TV-obsessed 20-somethings out there who constantly have their heads buried in their phones. But it doesn't deserve to be panned either.<br><br>The plot follows a couple of best friends as they trudge around L.A in a misguided attempt to achieve fame and infamy. The art style reminds me of Mission Hill, another seriously under-appreciated animation, which is also extremely bright and colourful. However, unlike Mission Hill, Nerdland opts for a much less innocent tone. Without dropping spoilers, it has a very Beavis &amp; Butthead vibe to its comedic stylings, with lots of violence, filth and a generally grim subject matter.<br><br>If you have a dark sense of humour and enjoy something that oozes pop-culture references, give this movie a shot. You can certainly do much worse.","user":"bungeeman17","rank":[13,14]},{"title":"Decent if you don't get your hopes up","rating":6,"date":"14 July 2017","review":"I watched this on Netflix, not noticing it was movie-length. I thought it was just the first episode of a TV series. In that context, it was quite enjoyable and I looked forward to seeing the next episode. I put it in a similar space as Beavis &amp; Butthead, Archer, Aqua Teen Hunger Force; stuff like this. People might be annoyed if they have framed it as \"a movie\" before watching it. That's the impression I get from the unfavourable reviews at Rotten Tomatoes.","user":"Ynot-Irucrem","rank":[7,9]},{"title":"Wasn't really feeling it with this one","rating":4,"date":"13 September 2019","review":"It was pretty funny l but the animation of thisvmoive was not that good.","user":"najiman","rank":[0,1]}]