[{"title":"Cheesy","rating":3,"date":"10 September 2017","review":"I have never seen any of the people in this movie before - and that's OK. I liked the actresses OK. But none of this movie was even the slightest bit believable. It opens with an over the top bad date to set the stage - kind of funny but really? Nothing in the movie is original - everything has been done before. Sad girl about turning 30, girl they hate from high school, cool guy from high school is old and fat now, and the boy she now likes is misunderstood when he leaves the party with the girl from high school they all hate - but really he is a good guy because he was just driving a drunk girl home and he had no interest in her. I didn't laugh that much and found it rather boring.<br><br>And Kate - the main girl - while I could see me liking her in other things I don't think she is a strong enough actress to carry a movie as the lead. <br><br>If you are in the mood for a \"stupid\" funny movie - then this is for you.","user":"phojar","rank":[5,6]},{"title":"for their fans","rating":4,"date":"6 August 2017","review":"Kate Fields (Mamrie Hart) is turning 30 and life kinda sucks. Her long-time friends Evie (Grace Helbig) and Charlie (Hannah Hart) have their own difficulties. They find a letter from Kate's 16 year old self. She allows them to throw her a small and tasteful birthday party but...<br><br>This is a film featuring a bunch of YouTube personalities. I'm sure that it's great for their fans. For everybody else, this is like every other single gal comedy by a second tier comedy troupe. They are functional comedic actors. There is nothing here that's going to blow anybody's mind. It has a few harmless jokes and a general knowledge of every single gal tropes. The party needs to go more crazy, faster and harder. It runs out of steam by the midway point. Instead of taking off into a wild night, it gets dull.","user":"SnoopyStyle","rank":[5,6]},{"title":"One For The Fans","rating":10,"date":"24 September 2016","review":"Straight off the bat, Dirty 30 is an above average film that will at the very least keep you slightly entertained for an hour and a half. It's pure, harmless fun with solid performances from the very likable Mamrie Hart, Hannah Hart and Grace Helbig (the YouTube Holy Trinity), who play three best friends. I would have liked to see more character development for Hannah Hart's character (Charlie) as I thought she was the most interesting of the 3. Does this film bring anything new to the table? No, not really. Think of this as the mild-mannered lovechild of Project X and Bridesmaids. It's a predictable film that played it really safe but is still a charming little film nonetheless.The weakest aspect of this film is a forced high-school romance between two incredibly forgettable characters that the film could have completely done without. Each time these two characters were on screen, the energy and pace of the film was slowed down and all I wanted to do was get back to the fun bits. <br><br>Overall, I think big YouTube fans will enjoy this one the most as there are a bunch of awesome cameos to look forward to.","user":"originalbandit","rank":[22,39]}]