[{"title":"Relevant movie","rating":8,"date":"2 January 2018","review":"Why relevant? Until I saw this movie, in my point of view Tonya Harding was a cheat and a lowlife and this was entirely based on the media coverage of the events in 1994. Having seen the movie I feel ashamed about how easily I judged her and I realised I have to be way more careful in forming my opinion about people.","user":"inikim","rank":[295,342]},{"title":"More than about tabloid trash, this movie should be watched","rating":10,"date":"28 December 2017","review":"Anyone who was old enough to be sucked in by the media circus that this scandal turned into should make it a point to take a look at this film, in my opinion.<br><br>The media seemed much more about the sensationalism of it all than it was about maintaining the kind of objective balance that'd presume Tonya's innocence until evidence proved otherwise. \nBut being honest, even if evidence came along that absolved Harding of any wrongdoing in the Kerrigan attack, how happy would the media have been to report it? Or would we have been to hear it? Because we've got to admit that, although it might not seem very nice, there was quite a bit of fun to be had during the couple months we spent focusing on this Hillbilly girl and her bumbling husband, right? Well with that in mind, what would the thought of her innocence have brought, other than damage to the narrative we were having such fun with? Regardless of where you stand in regards to her innocence, its only fair to acknowledge that her role had been laid out for her pretty much from the get-go. Kerrigan was its hero the moment she became the victim, could we have honestly entertained the notion that maybe Harding wasn't as much the villain as seemed to befit the story? How fun would that have been? Really?<br><br>In the last couple months, the articles about this upcoming movie had comment sections riddled with people mostly bemoaning the current state of Hollywood. Not the scandals, but that it'd even stoop so low as to peddle this kind of white trash story. \"White trash\" came up repeatedly of course, and while comment sections generally aren't the place to find the best sampling of voices, I personally wasn't able to find a single comment that was anything other than damningly derivative of Hollywood and/or Tonya...certainly not one suggesting the possibility that maybe there was more to this story than what we already knew. But that was always a possibility, wasn't it? The telling of a side that we hadn't heard?<br><br>After seeing the flick last night, I passed along my recommendation of it to a friend, commenting that Tonya Harding's guilt might have to be re-thought. In response, I got a chuckling, \"Oh I have a hard time believing that!\" Which, sure that has to be the prevailing opinion, I'd imagine. \nBut why? Do we really and truly think that we have the kind of information on the subject that'd allow for the most objective, fact-based decision on it? Have many of us ever stopped long enough to have wondered whether or not we did? The line of questioning isn't likely to be met with much more than scoffs by those who've yet to view the movie, but they're questions that end up being well begged and something that the same people may find themselves unwittingly exploring afterward. I sure have been.<br><br>In the meantime, this isn't just a great movie, but a great sports movie, detailing an ice skating prodigy who love for skating drove her life, and whose life ultimately served as a testament to just how influential a class system can be that many of us are barely cognizant of even existing. \nBased off interviews and testimony from the key players in the Kerrigan scandal, watching it brings a much needed sense of balance to the story and will likely leave you amazed at how easily the truth can be blurred when viewed through the lens of sensationalized media coverage. <br><br>10/10, great movie that grabs you from its opening scene and will have you entranced throughout.","user":"jehosaphet-58803","rank":[195,226]},{"title":"I, Tonya (2017)","rating":8,"date":"7 December 2017","review":"I think this film may have had the best trailer of 2017. I saw it and knew instantly how badly I wanted to see it. I've never been a fan of Margot Robbie and her previous acting efforts but this looked like her awakening and where she would be proving me wrong. I believe it, she's quite sensational in this film. Her dedication to her role shows but really everyone involved has done very well. Craig Gillespie has his first real winner with I, Tonya.<br><br>I, Tonya is a biographical picture about famed and disgraced figure skater, Tonya Harding. Tonya was pushed onto the rink by her abusive mother at a very young age and despite the abuse becomes a very talented ice skater. The cycle of abuse continues with her abusive husband but she tries to bear through and succeed. Everyone seems to be against her but her talent is hard to deny. The film also goes into the famed attack on fellow ice skater Nancy Kerrigan and the aftermath of the incident.<br><br>The film is sort of told from a mockumentary perspective as if key characters are being interviewed. The film also utilizes breaking the fourth wall where characters in a scene would talk to the audience. I thought this was interesting and separates itself from being a standard biopic and gives this film a real comedic depth. The soundtrack is catchy and literally every performance in this film makes for a very engaging time. I didn't even recognize the chameleon Bobby Cannavale until the credits rolled.<br><br>Some wonder why the film was made but it kind of helps you identify with Tonya. She suffered physical and psychological abuse from both her foul mouthed mother and her rage filled husband. Her hands may not be completely clean in what happens to Nancy Kerrigan, but she is also just a victim of circumstances. Vastly talented, but just short of reaching her pinnacle due to outside factors and her image and attitude. The film isn't perfect but its vastly entertaining and could be giving Margot Robbie and Allison Janney Oscar nominations. I'm going to let this sink in and I'm sure its going to be something I go back to.<br><br>7.5/10","user":"rockman182","rank":[124,144]}]