[{"title":"Survival drama takes Blue Square route","rating":5,"date":"24 October 2017","review":"A former pro-hockey player must fend for himself after becoming stranded on a mountain<br><br>Josh Hartnett may be the George Raft of this generation, known by the roles turned down. More than ten years since he passed up opportunities to play Spiderman, Batman, and Superman, Hartnett is Eric LeMarque.<br><br>A former pro hockey player, LeMarque has struggled with retirement and is facing a drugs charge when he goes up the mountain with his snowboard. A reckless decision to take an unsupervised course during a storm leaves LeMarque stranded and exposed to the elements.<br><br>A lasting problem of 6 Below is how rote the plot is; there is not a single moment in the film that comes as a real surprise. The film's subtitle Miracle on the Mountain belies the fact that this is not to be a tragedy, and that we the audience are going through the motions of Josh Hartnett feeling cold for ninety minutes.<br><br>Director Scott Waugh makes heavy use of GoPros and drones for filming snowboarding shots, yet however he captures the shots there is rarely an inventiveness on screen. The persistent whiteness of the mountain over-saturates the eyes, and the constant choral drowns the ears.<br><br>This is a shame as Waugh uses his experience with stuntwork and directing&nbsp;Need For Speed to assemble a number of the set pieces with aplomb. Most notably&nbsp;this includes helicopter search and rescue sequences in which Sarah (Sarah Dumont) at base camp comes tantalisingly close to finding LeMarque.<br><br>There are a few points of immersion in the story, notably a moment that ignited my own greatest fears when&nbsp;LeMarque falls through ice. Yet as a character&nbsp;LeMarque doesn't confront his situation with any particular imagination. He's never forced into the horrifying self-sacrifice of Aron Ralston (James Franco) in 127 Hours, and nor does the film have the terrifying resourcefulness and consuming morbidity of Touching the Void.&nbsp;LeMarque suffers because he has to, in a manner often no more engaging than a rat on a sinking ship.<br><br>If the bulk of the mountainside action is taking a blue square route, this is an improvement on the flashbacks dotted throughout the film. As with the mountainside, its all filmed flatly, both visually and thematically.<br><br>The domineering father and long-suffering mother are familiar tropes, and how this relationship might evolve as LeMarque grows up isn't explored.&nbsp;In the drive to tell an all- American tale of redemption 6 Below&nbsp;also leaves out interesting tidbits, such as the real life LeMarque using his dual citizenship to represent France in the '94 Olympics.&nbsp;<br><br>A point of connection as&nbsp;LeMarque wastes away on the mountain should be mother&nbsp;Susan (Mira Sorvino) who clearly loves him very much, but she has come&nbsp;across as so soppy and one-dimensional it's hard to avoid a vague irritation with her. I was more interested by&nbsp;Sarah and the mountain operation, and would hope to see Dumont in expanded roles in the future.<br><br>If you're a lover of inspirational memes or fancy the idea of Josh Hartnett nibbling bits of himself, this film is for you. Otherwise&nbsp;6 Below will provide you with very little sustenance.<br><br>christophermarchant.wordpress.com @BrianInvincible","user":"TwistedMango","rank":[25,32]},{"title":"Snowed under","rating":3,"date":"3 April 2018","review":"6 Below is based on a true story of Eric LeMarque (Josh Harnett) an ex ice hockey player, crystal meth addict who goes snowboarding and is ill prepared. He gets lost in the mountains when a blizzard approaches and has to fight for survival. <br><br>There are flashbacks to his boyhood travails and disputes with his ice hockey team. His mother figures that something is wrong and tries to get a search and rescue operation in motion.<br><br>The director has toned down the faith based elements of LeMarque's story but he has also toned down any excitement. It is flatly directed and it has little tension or energy. It certainly is no 127 Hours.","user":"Prismark10","rank":[10,13]},{"title":"Great movie!","rating":8,"date":"26 October 2017","review":"This is an amazing survival movie, about love, family and perseverance.<br><br>When I saw an IMDb score of 5,7, I was a bit hesitant about watching it, but this is one of those few movies where the score is completely wrong.<br><br>It's inspiring, with some great life lessons. It's about overcoming all obstacles. It's about family and love. It's about being imperfect and human. It's about life. Go see it.","user":"ognjenmilosevic","rank":[17,31]}]