[{"title":"Family dysfunction is rarely this entertaining, poignant or effortless to watch.","rating":9,"date":"13 October 2017","review":"Ah yes, family dysfunctional. Everyone has it, and frankly its an over mined sub genre in film. With entries often pushing melodrama and character arcs to neat, organised catharsis, it has become as predictable as bad romantic comedies. Which is why i'm so happy to report that 'The Meyerowitz Stories' is one of the best dramedies I've seen all year!&nbsp;<br><br>Told through various character perspectives in no real cinematic structure, there's a naturalism to the style. A humbleness that revels in subtleties rather than climatic overtures. And by god is it refreshing. There isn't a drop of pretension to be found in the film, no barriers between you and the characters, who are all lovingly played by an assured, veteran cast.&nbsp;<br><br>Adam Sandler is a standout in what is already an outstanding ensemble. This is a performance quite different from what you might expect. It isn't a retread of Punch Drunk Love, or a dramatic overhaul of his past characters either. He instead lends a striking amount of humanity to Danny, which can be said of the entire cast. But Ben Stiller in particular deserves a shout out. I've never quite seen him pull off drama this straight faced and earnest before, and like most of the film, the sporadic dramatic beats are interspersed throughout his performance.&nbsp;<br><br>Yeah i cant quite say enough nice things about 'The Meyerowitz Stories'. This was a joy to watch.So i'll just say this, if you love Wes Anderson films, in particular 'The Royal Tenenbaums' this is an easy recommend. And while it lacks the formalism and ridiculously cinematic glory of Anderson's style, there is far more humanity is Noah&nbsp;Baumbach straight faced approach.&nbsp;Meyerowitz Stories may not provide anything radically new, but it provides a great entry in the tired list of dysfunctional comedies, along with some of the year's best performances.","user":"leonthesleepy","rank":[102,149]},{"title":"The Dramedy Of The Year","rating":10,"date":"13 October 2017","review":"I have been a fan of director Noah Baumbach ever since his work on films like Greenberg and Frances Ha. Continuing his talented ways, I found myself really enjoying his work when I came across the film While We're Young back in 2014, but I must admit that his newest mark on the industry may just be my favourite film that I've seen of his. The Meyerowitz Stories (New and Selected) isn't wide enough of a release to score any big awards this year, but if that wasn't such a factor, I feel as though this movie deserves a few nods. Now streaming on Netflix, here is why I'll be giving this film a glowing recommendation. <br><br>There's just something special about a movie that mirrors reality, in that it takes itself very seriously, while still giving many laughs to its audience in order to provide levity. Following a family that reunites due to an illness of a relative, this really is a tale about sibling rivalry and the fact that it really shouldn't be a thing. I found myself entranced throughout this entire film, feeling as though I was watching someone provide insight into real events, and for all I know Noah Baumbach could've written this about his own experiences, but I just have to give him props for his terrific screenplay here. <br><br>It's not very often that a fantastic film stars Adam Sandler, but I'll admit it when I see it. He knew how to choose a good project here and he clearly cares about the material at hand, because he is 100% devoted to this character. He and Ben Stiller both deliver wonderful performance as step brothers and throughout certain portions of this movie, I felt as though they were growing a bond in real life. Movies like this don't come around very often, and I feel are unappreciated when they finally do. A story about family is very hard to accomplish, especially when you're trying to make it feel as real as possible, but I feel The Meyerowitz Stories (New and Selected) nails it. <br><br>Not to compare the two in any way, but I love Aaron Sorkin's screen writing and when it comes to his dialogue, I honestly don't think it can be topped in today's day in age, but Noah Baumbach definitely gives him a run for his money here. Never once did I find myself bored, and when a movie is just a series of sequences with people talking, that can be hard to keep audiences engaged, but I feel this movie accomplishes that nearly impossible feat. From the way a character reacts, to a memory that's being explained from their past, to a revelation they have, opening up to a crowd standing in front of them, this screenplay really goes for it. <br><br>In the end, with a screenplay as terrific as this one, having a cast as talented as it does, with addition of applause-worthy direction, and a satisfying conclusion, I really can't complain about this movie all that much. Aside from a few awkward moments in editing that will definitely take certain viewers out, I found them to be oddly fascinating, so I have nothing but praise for The Meyerowitz Stories (New and Selected) from my end. This movie is now on Netflix for the world to see and I can't recommend it enough.","user":"kjproulx","rank":[74,128]},{"title":"Exhausting","rating":2,"date":"21 November 2017","review":"I heard a great New Yorker Radio Hour podcast about the film, so I dove in with high hopes. But it was a slog. I'm a big fan of Dustin Hoffman, but he must have been directed to wear out the audience, which he does quite effectively. I kept looking for some spark -- humor, emotion, love, or just about anything other than the sensation of standing next to a jackhammer for almost two hours. But that's what this film- watching experience was.","user":"tdintersmith-12222","rank":[72,139]}]