[{"title":"A realistic story","rating":8,"date":"9 April 2018","review":"Amateur is a simple story that shows the struggles of a talented young basketball player to fit on his new team.This movie reports the corruption on basketball and the way that it has changed.The actors were great,the plot was emotional and really enjoyable.One thing I didn't like about this movie was that the pace of it because it was quite slow.But in general this movie is great and I recommend it.","user":"eldrimezini","rank":[14,17]},{"title":"incomplete movie, but good","rating":9,"date":"4 April 2019","review":"The movie is very attractive and interesting, but it also has some things to correct.<br><br>\nThe film is about a very talented young basketballer, he has difficulties in terms of understanding numbers, which leads him to find new and different ways to communicate with his team and to understand everything from the plays to the scoreboards. The father of this boy is sick because he played many years in an american football team that of course left marks on him, at first it is difficult because his teammates make life impossible, but all this changes when he begins to play. Time later he learns that all his school grades are modified for his good, almost does not have to work to pass the subjects and this will not only be at his school but also at the university. All this is about to change the moment he finds out that his basketball coach bought him with the help of his father, the indignant boy records a conversation between the coach and his father where the truth is discovered, which leads to the total expulsion of the coach and the boy, that is, he will never be able to play basketball again, if not for a clever desicion of the boy who decides to become professional, in this way he would continue his career and he would get ahead along with his family thanks to his earnings.<br><br>\nThe key moment in the movie was the part where the boy finds out the truth about how he has been sold and decides to do something about it.<br><br>I think script was interesting but it needed to have more information or be longer<br><br>The movie flowed really well, it had good effects, but also it was so short so it finished abruptly.<br><br>\nThe costume was so good for the movie, you realaized what a real basketball team looks like.<br><br><br><br>The movie was filmed in a really realistic location, because first you saw an amateur basketball court and then you get surprised looking at the real and professional basketball court.<br><br>\nI think the soundtrack could be better because you didn´t feel involved in the movie at all because the sound was not right.<br><br><br><br>In conclution the movie is so good, you can have fun watching it, but also its missing something important that it should have, or they spend too much time explaining something thats easy to understand.","user":"santiagoduquec","rank":[4,4]},{"title":"Anticlimactic","rating":5,"date":"13 January 2019","review":"A somewhat befuddled storyline; somewhat good acting by Michael Ranney Jr..","user":"fmwongmd","rank":[4,4]}]