[{"title":"\"Kingsglaive\" creates a gateway for fans and audience into its visually fantastic world, yet the muddled plot can be exhausting despite the effort to make it accessible.","rating":7,"date":"19 August 2016","review":"There's no denying the graphical barrage \"Kingsglaive\" constantly throws for nearly two hours is brazenly stunning. The vistas are absolutely marvelous, its characters look eerily lively and the fights are utterly unworldly. With all of these mighty productions, it's still vexed by occasional choppy pace and sporadic hop in screenplay.<br><br>The story is delivered in a sci-fi fantasy realm. It's a very politically focused tale and it does try to deliver many subplots and characters, no doubt a foundation for the game's world and its splendor. The problem lies as it often skips from one scene abruptly without giving the audience much sense for the flow of time or the clarity of vital motivation. It's all dramatic in presentation, yet it can feel a bit muddled, more so since it's quite the lengthy showing.<br><br>Characters are relatively well done, especially the ones with famous names. Usually the dubbing in English for such production looks jarring, but here Lena Headley's or Aaron Paul's voice is implemented properly. The lip sync is fine and there's a boon on having fantasy oriented voice for the cast. A minor flaw would be the dialogues or sound effect don't convey the sense of urgency at times, but it's mostly understandable.<br><br>The visual ramps up as the battles progress. These are very hectic occurrences, the fast cut can leave audience wandering on what transpires on the screen since there are many effects and motions cramped into brief composition of scenes. However, when it retains the focus or follows the action, it is arguably one of the most eye-popping spectacles from animated movie.<br><br>The sheer graphical prowess produces an entirely captivating world, even though it stumbles on overly complex narrative or overly fast editing.","user":"quincytheodore","rank":[52,70]},{"title":"Highly underrated","rating":10,"date":"28 December 2018","review":"I have seen several movies regarding or based on video game, yet none not even close of Kingslaive. I also saw the other two Final Fantasy movies and neither of them is even half good as this one. This isn't a masterpiece overall, has its own flawes, but nonetheless it's a great and solid movie, worth watching and rewatching.\nThe CGI is spectaculos, so realistic and well-made, carrying you truly into a story, a fantasy. We see new power additions to the word, the eye-catching warp magic forged by the blink dagger of the glaive which is a pretty cool thing to watch.\nBut above all are the character, many of them very interesting -I really wanted to know even more about each of them- and the story itself. Some said the plot is not coherent enough. I think those people did not paid enough atention, especially at the prologue. Kingsglaive is not just a story about battles and special effects, it's a story about duty, about courage, about sacrificies and responsabilities. You care for those characters and their fates. It tells a good and engaging story, something that movies nowadays completly lacking. It has soul and sentiment. It has a message.\nDon't mind the critics and the low-rated reviews. Give it a try, you may be pleasantly surprised.","user":"beckyanca","rank":[10,11]},{"title":"A Masterpiece In Pixels","rating":10,"date":"5 September 2016","review":"Video Game-based movies do not often turn out as good as they promise to be, and this always made me think that CGI is always the best way to bring video game stories to the big screen.<br><br>Kingsglaive: Final Fantasy XV is great example of how CGI does a brilliant job in capturing the world of Final Fantasy XV in the best way possible. The cast is what's most remarkable to me. Most Final Fantasy games present a cast that is very much inspired by Japanese culture and Anime. For the first time, we see a diverse cast that feels rather universal than from one specific culture.<br><br>To me, the cast surpassed the ones presented in the video game by miles and miles. I wasn't really into the cast of Final Fantasy XV from the beginning, except for Gladio. But here, the cast was wonderful by every mean.<br><br>The world is absolutely amazing, the CGI is top-notch, the story is very interesting and sets the foundation of what could be a brilliant trilogy, or more.<br><br>My only complaint would be that I was hoping to see more of the world, instead of being restricted to few places, but I believe the game will handle that.<br><br>All in all, the movie is a brilliant work of art that critiques couldn't be more wrong about giving it such low scores. Try it for yourself and judge.","user":"RinoTheBouncer","rank":[36,53]}]