[{"title":"Many people misunderstood this movie! There is a twist in the story!","rating":10,"date":"17 March 2018","review":"I was very skeptical about this movie from the very beginning, because I thought that this would probably be a dumb monster movie with a similar theme like \"Beauty and the Beast\". However, I was very surprised when I saw the movie and think that it was brilliant!<br><br>After reading the reviews on this site, it is my understanding that many people that saw this move completely misunderstood it, both the people that loved it and the ones who hated it. <br><br>The theme of the movie is not something similar to Beauty and the Beast for those who might think that! <br><br>There are several themes in this movie, but the overall theme is about minorities and how privileged people view those who are different. However to make this message more clear the movie is set in the 1960's, where minorities were generally marginalized. <br><br>The lead character Elisa Esposito is a mute woman, who was an orphaned child that was found in a river with wounds on her neck and communicates through sign language. She works in a government laboratory as a cleaning lady. Her friends are her co-worker Zelda, a black woman who serves as an interpreter for Elisa, and her next-door neighbor Giles, a closeted gay man. Elisa discovers a mysterious creature in the facility and begins to bond with it. The creature is a mute humanoid amphibian that was captured in a river in South America by Strickland, who is in charge of the project to study it.<br><br>Elisa is the main protagonist in this story, and together with Zelda and Giles, they represent a social minority. Women, handicapped people, black people and gay people are all amongst those that were outcast by society at the time. On the other hand, there is Strickland who is the main antagonist in the story and he represents the privileged people at the time. He is a white man in a privileged position, married with children, religious, and is hostile to those who are not like him. He treats the creature hostilely, beats and abuses it, and calls it a monster.<br><br>When Elisa learns that Strickland plans to vivisect the creature, she hatches a plan with the help of her friends to free the creature and keeping it in a bathtub at her apartment and planning to set it free in the ocean. Elisa and the creature bond romantically and it is revealed that the creature has healing powers.<br><br>When the day arrives to set the creature free, Strickland arrives and shoots Elisa and the creature. The creature heals itself and kills Strickland. The creature takes Elisa and jumps into the ocean where it heals her. When the creature applies his healing touch to the scars on her neck, she starts to breathe through gills.<br><br>Here is the TWIST: This scene reveals that Elisa was of the same kind as the creature all along. She just had a more human like form than the creature. There are different clues throughout the film. She was found as child next to a river like the creature. She was found with the \"scars\" on her neck and they turned out to be dormant gills as the creature healed her. She was mute like the creature. She loved being in water as shown in her morning habits. She was initially attracted to the creature whereas most people would fear it. She comes from a Spanish speaking country, as her last name is Spanish whereas the creature was found in a river in South America.<br><br>The creature itself and Elisa represent a minority, as they are alike. The fact that the creature is different yet human like, symbolizes how privileged people viewed minorities at the time. The point of the monster is simply to symbolize how we sometimes view other people that are different from us.<br><br>The message of the story is this: You view other people that are different from yourself as \"monsters\" if you don't try to understand them. However, if you try to understand people who are different from yourself, then you will see that we are basically all alike even though we look different.<br><br>I think this movie was brilliant and very clever. Guillermo Del Toro did a great job. It is definitely a movie worth watching.<br><br>This is my point of view and I hope that you found this helpful.","user":"TheKing87","rank":[1,1]},{"title":"Guillermo Del Toro does \"Amelie\" meets \"Creature from the Black Lagoon\"","rating":2,"date":"1 January 2018","review":"Diabetics beware, you're in for a saccharine flavoured heap of mush.<br><br>The Shape of Water was directed/created by Guillermo Del Toro best known for creepy and violent films such as Pan's Labyrinth and more mainstream writings such as Hellboy and The Hobbit. For some reason he has had a dose of the lovestrucks and written a film that is basically Amelie meets Creature from the Black Lagoon. There are a couple of questionable violent scenes (torturing a dying man by dragging him around via a bullet wound to the cheek had a touch of the old GDT that we know and love) but the plot literally has no surprises whatsoever. I picked the minor twist about 10 minutes in, and spent the second half of the film waiting for it to be over. <br><br>I am sorry to say the only interesting part was the reveal (not literally) of the sea creature's penis via the main character's description which is frankly hilarious. <br><br>Octavia Spencer does a fantastic job of playing herself (Was this woman born middle aged?) but let's face it we love her anyway. I would love her to be my best friend, she's a hoot.<br><br>Michael Shannon (whom I remember from Take Shelter and Boardwalk Empire) plays a creepy bad guy in a way that makes me never want to have him around for Christmas lunch. Why does he always play someone sexually awkward? I pray we'll never find out. <br><br>I was most disappointed that unlike Pan's Labyrinth and some of the other films GDT has made it's not set in a fantastical different world. It's basically the 1950s cold war era in USA with no real pretense of being anything but. I was hoping for a magical realism, but other than the creature, there's no otherworldliness to it. <br><br>I am a solid romantic, but I found the plot so saccharine that it made me feel nauseous. There is also a sudden musical number that almost had me running for the aisle, and my sister desperate to see my husband's face (He's allergic to musicals generally). Apart from this light relief, I couldn't wait to get out of there.<br><br>I am pretty alone in this opinion, our party was split between 3 people who loved it, and my husband and I who hated it. Maybe if I hadn't seen other GDT films I would have liked it more. My husband also thought the trailer completely misrepresented what he expected from the film. So maybe we were in the wrong movie. But I think romance lovers won't like the art house element, and art house/GDT fans won't like this film. So I think commercially it will be hard to place.","user":"malcolja","rank":[891,1]},{"title":"So disappointing.","rating":1,"date":"2 January 2018","review":"I was taught before criticism that you should first bring up the good points. Good points: Cinematography, good actors, great old movie clips and music, great sets, good costumes, and an extremely promising storyline. Unfortunately, this movie missed, when it really could have, and SHOULD have, hit. \nI think from now on I'll choose my movies based upon how they're doing at the box office, and not based on reviews. It seems to be a better indicator of what the public REALLY thinks about a film. \nWe're at week 3 and (for such a seemingly magnificent film), The Shape of Water hasn't even broken even. A telling clue. Budget:$19,400,000 (estimated)\nOpening Weekend USA: $166,564, 3 December 2017, Limited Release\nGross USA: $12,140,155, 28 December 2017<br><br>Personally, I found it contrived, unbelievable, and just plain stupid. Where to start? \nA cookie cutter \"Beauty and the Beast\" love story with too many holes. I never caught on to the burgeoning romance. Somehow it just fell flat for me. It was already a mediocre movie when they did that ridiculous black &amp; white dance sequence, which was so far out of place, I lost all interest. The music and old film clips were great, but what were they thinking? Were they trying to cash in on some La La Land success? Or was it supposed be some allusion to Cinderella's ball? It would have made more sense as a dream sequence either where Hawkins had dozed off during a flick, or in the bathtub. \nEw. Were the masturbation scenes really necessary? I can't see where they drove the plot. \nAre we supposed to believe a creature like that could or would run into a theatre, leaving a blood trail no less, without being seen by ANYONE? Then he just stands watching a film. (All the while knowing he was in danger from humans and he needed to get to water)? All this, and the projectionist doesn't notice? Where are the film patrons? How'd he get IN without being noticed by anyone? An unlocked door? What would be the purpose of having a box office if you're going to leave an access door unlocked? \nAre we supposed to believe that the creature, being so sick and weak that he must be released immediately, suddenly has superhuman strength after some strange (and inexplicable) resurrection event following his \"death\"? \nAnd are we supposed to believe that you could pull a full grown man via a bullet hole in his cheek? (You'd rip right through.)\nAre we supposed to believe that the best friend wouldn't have freaked out about the coitus? In her eyes, wasn't it more an animal. At the very least, one would expect her to broach the subject of pregnancy. \nHow did those two remain standing in the bathroom? The force of the water would have carried them out. If it was pressing that much on the door, the window should have blown. \nWhy didn't Richard Jenkins appear to grieve at all regarding his cat?\nAnd why? Oh WHY? Couldn't they just release him directly into the ocean immediately, rather than wait for the locks to fill. I mean the water was RIGHT THERE. They could have made a bath in the back of the van, and just got him to the coast. \nOn and on I could go, but I'm done with my rant. <br><br>Save your money. If you want dumbed down fantasy get the Hallmark channel. At least you know you're getting purely pleasant drivel, instead of wasting your money and being grossly disappointed.","user":"bigsmiles-28464","rank":[1,1]}]