[{"title":"Wonderful film","rating":10,"date":"26 January 2018","review":"David Wain tells a true story in a creative way, creating the kind of the film his subject would have written, although a little sadder. Every actor does a superb job, Will Forte hits the perfect melancholic note. Dom Gleeson as usual is excellent. This is a wonderful tribute to Doug.","user":"haring-hudson","rank":[44,58]},{"title":"Netflix's' Best In a Looong While","rating":10,"date":"28 January 2018","review":"Rarely do movies make me laugh out loud anymore. This movie not only made me do it repeatedly, but had me laughing hours later remembering some of the bits. Extremely clever, well told story of a brilliantly hilarious guy who I, and I would guess most of my generation (I'm 31), am not familiar with. This was truly a 10/10 and I hope Netflix makes more like it down the road.","user":"bigbadbassface","rank":[30,44]},{"title":"Shirley doesn't live here anymore","rating":8,"date":"28 January 2018","review":"A driven joker pushes his way through Harvard and on to comedy stardom, but the fun begins to get manic ...<br><br>Clever story telling that takes a while to get the right mood, but once it hits the American Hustle-style montage pace with the '70s period look it just rolls along. Plenty of decent laughs, but with good introspection by the lead actor. I didn't know much about this guy, and his stuff was just before my time, but I found the story really engaging, and of course there's the satisfaction of spotting a host of comedy stars at the start of their screen careers. Biggest laugh was Chevy Chase trying to pour a drink at the parents' new mansion.<br><br>The meta narrative is amusing, with a pointed reference to the source of the movie's title, but it also pulls a clever trick in setting up a shock ending for anyone who doesn't know this man's life. Only complaint is that there's no killer line. Maybe: \"All you had to say was don't call me Shirley\".<br><br>The performances are good all round, and the direction, editing and cheerful music keep it bubbling all the way through.<br><br>Overall: Nice surprise, big recommend.","user":"begob","rank":[17,25]}]