[{"title":"It Stinks.............","rating":2,"date":"13 March 2019","review":"I was excited to see this, gorgeous settings, spectacular costumes, fantastic classical music, what could go wrong ? While it is pretty to look at, they forgot an interesting script and anything resembling competent direction. The acting was awful, as another review mentioned everyone came across as a modern actor. There was nothing authentic to it, I felt like I was watching a badly done TV movie. Imagine going to some tourist attraction with dinner theater actors dressed in period costumes, you never actual believe any of it and even that would be more entertaining then this. This was so poorly done, so fake in the way it was presented that I lasted 25 minutes and gave up.","user":"hampersnow-28905","rank":[8,10]},{"title":"Well acted, beautifully sung, fanciful drama based on composition of Mozart's Don Giovanni","rating":9,"date":"30 September 2017","review":"I'm not usually a fan of films which place real historical figures into imaginary situations, but I'll make an exception for this inventive fable about how Mozart's Don Giovanni might have been inspired/influenced by people he meets while on a trip to Prague. The film's central characters are the man himself (Aneurin Barnard), beautiful and gifted young soprano Zuzanna Lubtak (Morfydd Clark), and Baron Saluka (James Purefoy), who from the very first scene does his best to live up to the inevitable adjectives that apply to all barons worthy of the title: cruel &amp; wicked. If I tell you that Zuzanna's parents also feature prominently (played by Dervla Kirwin and Adrian Edmonson, channelling his earlier role as Count Rostov) I've told you almost everything you need to know to work out most of the plot without even seeing the film. Other notable characters are Josefa Duchek (Samantha Barks) and Barbarina (Ruby Bentall), a half feisty, half put-upon servant girl and Mozart admirer, who is unsurprisingly more than a little reminiscent of Poldark's Verity at times.<br><br>Great operas manage to be great in spite of melodramatic characters and implausible but predictable plots, and this film manages the same trick comfortably thanks to the energy of the main performers. But we're nowhere near \"Amadeus\" - Mozart here is a strangely sympathetic character despite some all too obvious moral lapses. But predictable and preposterous or not, I was gripped almost throughout, only becoming impatient at two points where I was confused as to whether what I was seeing was supposed to be real or Mozart's imagination.<br><br>Prague is such a perfect setting for a period drama of this type, that it perhaps made it a bit too easy not to ask questions about the makeup and costumes. Once again, the operatic theme possibly helped here. At this point I should perhaps warn potential viewers that this film thoroughly deserves its 15 certificate - this isn't cosy family-friendly period drama. <br><br>It would be remiss to end this review without mentioning the music, which is of course wonderful. Samantha Barks does a great job with her songs, but a special mention should go out to singer Christina Johnston, who takes over from Morfydd Clark when the going gets opera, and does so brilliantly. I must say I felt this was handled very well technically, because I wasn't ever disturbed by the transition between voices or particularly conscious that I was watching something dubbed. <br><br>Overall mark 9/10 - just those couple of scenes that left me wanting more clarity lost a mark for me - I was totally willing to forgive everything else some may see as shortcomings, because it just felt so right for this film's theme.","user":"alun-williams","rank":[18,27]},{"title":"If you loved Amadeus you'll love this","rating":10,"date":"14 December 2017","review":"Our family watched this film at the weekend and really enjoyed the unusual plot. Great costumes, acting and music too. You'll not be able to get the Mozart music out of your head for weeks it is so beautiful.","user":"katythompson-34726","rank":[6,10]}]