[{"title":"The most realistic narrated movie about Iran!","rating":8,"date":"21 May 2018","review":"It's the most realistic narrated movie about Iran and our crap regime...<br><br>Of course its visual and some things about it can be more realistic and much more beautiful but there are lots of things in it that history must to know about!<br><br>By the way it's an adult oriented movie and not a family movie, be careful there are lots of inappropriate stuff in it for children like sex, abortion, porn, drugs, adultery, suicide, prostitution, strong language... I'm saying that because it's an animation and can 'cos misunderstanding sometimes.<br><br>It's a really suffocating experience to live in Iran. it's good to know that people from other countries know about it and care about it, they can see it in these kinda movies and try to avoid it in their countries, I mean don't let Islam or any other religion ruin your country like ours...!","user":"MehdiTaba","rank":[30,40]},{"title":"A Thought-Provoking Portrait Of Life In Contemporary Iran","rating":14,"date":"14 August 2018","review":"Exploring the sexual &amp; gender double standards in contemporary Iran, all resulting from their strict religious codes, Tehran Taboo paints a thoroughly fascinating portrait of everyday life lived in the bustling modern metropolis where breaking societal taboos has now become the only way for its people to achieve freedom &amp; happiness.","user":"CinemaClown","rank":[16,20]},{"title":"a manifesto","rating":29,"date":"29 December 2018","review":"...one of the most powerful and provocative and useful. Its subject - the freedom. Not only in Iran but as escape from hypocrisy, fear, pressures and fear. Lives . And decisions controlling aspects defining them. Great animation, solid stories, special manner to explore the near reality. And tools for defining it. At first sigh, a film against oppression of religion. In essence, a pledge for accept the rights of the other. Well crafted, it remains a time in memory for the atmosphere. And for the clear, honest message.","user":"Kirpianuscus","rank":[7,9]}]