[{"title":"Is it possible to rate 0 stars?","rating":20,"date":"20 August 2018","review":"This movie is terrible; Like actually the worst!\nImagine if an eleven year old tried to rewrite The Fault in our stars?\nThe acting: terrible, Writing; Pitiful- Definitely would not recommend.<br><br>The movie may have worked if the audience could have sympathised with the protagonist- Hope (Yes, This joke was used consistently throughout the movie). However the poor acting overall led to me low-key wishing our dear friend Hope was run over with a truck. Multiple times.<br><br>The only time I smiled was when the Australian boyfriend was introduced because his accent was so utterly terrible, My natural instinct was to run away and live a new life as a llama farmer in nepal or smile in blissful unawareness- I chose the latter.","user":"contactkittyyt","rank":[10,14]},{"title":"If you tell me this was actually on the big screen ,,i just won't believe it at all.","rating":4,"date":"15 August 2018","review":"The story is good ... good for a Liftime or MTV movie ,, i mean i get it cancer and all ,, but the whole scenario was a bit lame.<br><br>The plot is so average,, the writing was a problem ,, and the directing looked so weak ,, the scenes just kept on coming and it actually felt like a TV movie where 14 years old girls would like to watch with there moms.<br><br>The cast just added to the awfulness ... don't know about, Mia Rose Frampton, i feel like i saw her somewhere before in a movie ,, and i hated her back then, and it all scratched back into life today.<br><br>finale thought,, you could watch it if you have \"literally\" nothing to watch..","user":"Aktham_Tashtush","rank":[7,9]},{"title":"I created an account to share how spot on this film was!!","rating":10,"date":"16 September 2019","review":"My husband and I just finished watching this and don't understand the shallowness of the negative reviews! My mom just passed away at 64 from Leukemia in May 2019, and my husband's mom passed away 16 years ago from cancer at only age 44 and we felt this movie got the perspective right completely!! As much as our pain is with us constantly for losing our parents, they were adults and handled their cancer as adults.... I can't imagine being a kid-teenager faced with terminal illness being told you would never live past your teen years then to be told your pain and suffering led to remission. Hope didn't know how to feel her feelings, and popularity felt good, but she had to learn her \"Aha!\" moment on her own in her own way. One thing my husband and I learned from being so close to the struggle of cancer, is that each person truly deals with it in their own way, and there is no right or wrong. Remission is sometimes scarier than the terminal illness, because it doesn't mean \"cure\" and you are waiting for the other shoe to drop. As a child faced with a terminal illness you learn to live to die before you live, then with remission you don't know how to live without a too-soon expiration date.This movie proves exactly that and I think it was incredibly done and had such a warm heartfelt meaning. Plus the ending and credits were perfect!!!<br><br>If this movie offends you then you need to get out more and open up your mind and heart to how you would deal with a struggle like this... a terminal diagnosis as a teen from a teen prospective!! Take a moment to think how difficult a walk in their shoes would be, figuratively and literally...","user":"sarahhendricks-62793","rank":[3,3]}]