[{"title":"Girl (jeune femme) gets dumped by boyfriend. All alone in Paris. Without money. Desperate. What next?","rating":7,"date":"30 December 2018","review":"Funny, sad, chaotic, true to life. Character study of a young woman (30) who has to learn to take care for herself for the first time in her life, now that she is without a boyfriend, without a job, without an appartment and without family. Sounds depressing enough, but this quirky French portrait of this young woman's struggle is fascinating and vivacious.<br><br>Typical French character comedy,the way the French are good at it. Great acting. Lovely soundtrack. Endearing coming of age story.","user":"imseeg","rank":[4,4]},{"title":"a heartening find-your-toehold underdog story","rating":7,"date":"9 November 2017","review":"Feature debut from French female director Léonor Serraille, MONTPARNASSE BIENVENUE won Golden Camera awards in Cannes from formidable rivals. Essentially a heartening find-your-footing underdog story, Serraille smartly irons out its formulaic déjà vu with a blithe tonal inflection that cunningly belies the story's harsh undertone but never alienates audience's empathy.<br><br>Our heroine is Paula Simonian (Dosch), a 31-year-older whose decade-long relationship with her photographer boyfriend Joachim (Monsaingeon) is unceremoniously severed by the latter, and right out of the box, Serraille introduces Paula in her lowest point when she totally loses it in a hysterical rambling which could falsely give the impression that she might be a head case and Laetitia Dosch gives a superbly looney tunes shtick which shows that it is her inning to hold court. <br><br>But Paula is not a fruitcake, although admitted by herself, she is not a very bright gal, who reacts badly from the bolt out of blue and is left with Joachim's cat with nowhere to go. For the first time, she must earn a living off her own bat, and her personal past and family ties also emerge in piecemeal instead of spoon-feeding. The script handles with care of a dejected situation when a young woman (which is actually its French title), throws herself on the mercy of others' kindness, how close she will subject herself ass a victim of a predatory society. But there is also light during Paula's rite of self-Independence when by sheer luck, sorority spirit comes to her rescue, she is mistakenly recognized as a schoolmate by Yuki (Simaga), who helps her land a baby-sitting job, meanwhile she also finds a sideline career in a shopping mall's underwear boutique, although one of which doesn't last long, because in Paris, caste-hopping is not something can be stomached by the callous folks. Serraille makes sure there is enough droll and mordant moments to temper with her astringent critique of the pandemic apathy encroaching the contemporary society, through her close-range but steady and unobtrusive lens, interlaced with occasional aural and optical abandon. <br><br>Ultimately it is an invigorating, slightly belated Bildungsroman of adapting oneself into adulthood, to contact, to communicate with others, those like-minded ones (Paula meets cute with the security guard Ousmane played by an equable, earnest Ndiaye) and lives a life as honest as possible, and of course we are blasé about a second chance with Joachim routinely materializes itself because her answer is already set in the stone, but courtesy of Dosch's pyrotechnic performance, her Paula is the whole package of a real woman in full flesh and blood, funny, compassionate, obfuscated, discomfited, defensive and resolute in turns, in the end of the day, you will love her for her strength, perseverance and goofiness, hats off to a tremendous achievement.","user":"lasttimeisaw","rank":[16,25]},{"title":"Loneliness in Paris","rating":1,"date":"1 November 2018","review":"There has already been tons of features, small budget and of course forgotten films describing the daily life of more or less young people in Paris. In each of those movies, it's pretty difficult to build a real story or suspense, just a descriptio, the struggle for those people to work, make friends, or simply dating. Features which many people can recognize themselves in. This one makes no exception, it is sometimes a little funny, but never really a comedy. A sort of mix up between drama and comedy. A French speciality. A woman in her early thirties in search of herself...With no real ending at all. The life goes on. Topics already done billions times before, but I like. Only from time to time.","user":"searchanddestroy-1","rank":[5,7]}]