[{"title":"Legit review","rating":4,"date":"16 June 2017","review":"Time for a review from someone who has been a member of IMDb for longer than a week and has reviewed more than one movie, unlike all of the reviewers so far that have given this movie great reviews on here....<br><br>You know, a skeptic might think that some of those reviews could be bogus.....<br><br>Anyway, this movie isn't overly terrible and it isn't great, but after watching it I couldn't recommend it to anyone else to watch. It's just forgettable and bland with nothing to make it stand out from every other similar movie in the genre. It's one of those movies that you watch today, it's forgotten by tomorrow and you never think about it ever again.<br><br>There IS NO TWIST like some of the reviewers claim there is, and for the ones screaming \"Wesley Snipes is back!\" yes he is, for a grand total of around 15 minutes in this 90 minute movie. The cgi effects are adequate but don't expect movie quality, they're more in line with something you'd find on a lower tier TV show.<br><br>I was disappointed, I watched this for Wesley because I wanted to see Snipes kicking some alien butt, instead all he did for most of his quarter of an hour screen time was either stare creepily at the kids in the cabin or sit down and deliver exposition to them. <br><br>Apart from the lack of Snipes 2 things really ruined this movie for me, firstly, the acting was pretty bad by the 5 college aged kids that were the main focus of the film, in fact it was terrible in places, especially from the blonde guy who was the lead. Secondly, none of the kids characters were developed, at all. To put that into context, the female lead character, if you asked me what kind of person she was all I could answer would be that she's normal and has asthma, apart from that she has no personality, and the sad thing is that I know more about her character than I do 3 out of the other 4 because at least I know she has asthma. Just zero character development, I don't know if they're good, bad, brave, shy, dumb, smart, catty, bullies or what, they're just all blank slates who aren't very good at acting, which made it really hard to care about whether they lived or died.<br><br>Even though it's not totally terrible I still wouldn't recommend this, even if it's on free TV there are better ways to spend your time, like cleaning the oven or doing your taxes or digging a hole just so you can fill it in again. 4/10","user":"freqeteq","rank":[105,125]},{"title":"Awful movie, terrible cast. Do not watch this if you like Wesley Snipes.","rating":1,"date":"16 June 2017","review":"Where can I start?<br><br>Firstly let's start off by pointing out the number of fake reviews praising this movie, most likely from the d-grade actors involved in this movie or their publicists. You should be ashamed...not because of the number of fake reviews you so vainly posted, but by how embarrassingly obvious they are as fakes (check RottenTomatoes, you will see more fake reviews there).<br><br>So...the movie itself is very c-grade. Usual generic story of teens going into the woods, everything is laughably predictable, normally i'd say this isn't such a bad thing if you enjoy that type of movie but unfortunately the acting and writing is beyond rubbish.<br><br>The emotions are all wrong and swing from one to the next without any care or thought as to the scene itself. Amateur actors at best. I was really excited to see Wesley Snipes on the big screen again but dude, you made a huge mistake doing this movie.<br><br>You will recognise the annoying kid from Breaking Bad is in this movie, I don't really wish bad things for him IRL but I could have punched that stupid character he played in this movie over and over in the face.<br><br>Make no mistake, this movie blows, anyone telling you otherwise is a shill being paid by cronies related to this movie. Frankly the only pleasure you will derive from this movie, is telling your friends how bad it was.<br><br>Do not watch.","user":"avengerthedead","rank":[166,212]},{"title":"Crap","rating":3,"date":"16 June 2017","review":"Don't bother watching. so many errors in continuity and editing. Not to mention terrible acting. Sad to see Wesley in such a C grade film. Will never get that time back...<br><br>many fake reviewers pushing up the score here. It is no more than a 3 at best. DO NOT WATCH THIS FILM IF YOU VALUE YOUR TIME!","user":"poppsy69","rank":[110,139]}]