[{"title":"Just sleep in the car","rating":6,"date":"8 September 2018","review":"Acting was good across the board.\nStory was fine, but moved pretty slow - not much happens in the first hour.\nCould have used more comedy, tone was all over the place.\nIf Gremlins only had a single gremlin and it didn't show up until the last act of the movie, it would be this. \nI liked the ending.\nCan't say it was scary at all, but it was a serviceable Creature Feature that is worth a watch.","user":"almaric777","rank":[14,17]},{"title":"Scant on horror, but a satisfying creature movie","rating":6,"date":"22 March 2018","review":"I'm a sucker for creature movies, and I enjoyed the creature in this movie. The special effects were sometimes quite adequate and other times a little silly (usually while stationary). The film itself never fully commits to being a horror movie, but I still found it enjoyable enough. The story was solid, more so than most of these kinds of movies.The acting was solid. The characters were solid. The logic defying stupidity that plagues characters in horror movies was fairly light. The creature was a cross between the pixies from Harry Potter and the Chamber of Secrets and the creatures from Don't Be Afraid of the Dark, and I loved it. Should you see it? I have a wall of horror films, and if I were to buy this on DVD and add it to my collection the overall quality of my collection would increase slightly. If you like creature movies, then I'd say give it a try.","user":"chadroman82","rank":[24,33]},{"title":"Cute little thing","rating":8,"date":"8 April 2018","review":"When I sat down to watch this film, I clearly knew I'm doing it out of boredom and having nothing better to watch. So I was expecting to see something very silly just for the fun of it. But I was very nicely surprised that this film turned out to be decent! True, it is quite cliché but the story is coherent and develops nicely, it doesn't get too slow or boring even if at a point it reaches the verge of it. But then we get this (to me at least) cute little creature and everything and it balances very nicely.<br><br>For those that may be looking for a heavy mystery OR slasher-kind of traditional gore.. well, it won't be your thing. But for those looking to kill some time while having their curiousity maintained, entertained and are open-minded to some humor, as well as not being judgemental or expecting wow-s, it's a pretty good movie. Compared to the majority of the stereotype of \"stupid teenagers running around while being chased by a monster or villain\" Apartment 212 is a real jewel, it has none of that. In fact, you'll find some quality presentation and interesting elements. The characters are relatable and likeable, it's pretty simple really, and has an unexpectedly catchy atmosphere. <br><br>After I watched it, I really want to see something similar but I'm actually having difficulties finding something with equal quality - which to me means it managed to more or less impress me somehow and is better than most of the rest of cliché choices. I'd say it's a good and enjoyable watch! If you have time you don't know what to do with, give it a chance.","user":"sataniela","rank":[17,23]}]