[{"title":"Pleasantly surprised","rating":8,"date":"9 October 2016","review":"The average viewer probably would have expected full-on comedy with a meaningless lesson at the end. <br><br>It ended up being about coping with the death of a parent and dealing with divorce.. What? <br><br>A lot of times I forgot they had switched bodies because I was so emotionally invested in the characters' stories. <br><br>I loved the fact that the leads were not love interests. Too many DCOMs ignore that platonic relationships exist (Teen Beach Movie, Cloud 9, just to name a few). <br><br>Cons: one too many music montages, having them learn a new sport overnight, some funky dialogue between the teens--no one talks like that.","user":"FanOfDC","rank":[17,21]},{"title":"There is no machine (yet) that measures movie \"energy\"","rating":7,"date":"9 October 2016","review":"Which is precisely why it is up to the IMDb reviewers to offer these commentaries.<br><br>The Disney \"machine\" is unstoppable. It will outlive anyone reading this review right this moment, no matter how old or young you may be. I guarantee there will be another Disney flick about \"body-switching\" in the early 2020s and yet another in the decade just after. And so on. And so on.<br><br>When your grandkids see their version of this tale, they too will think it is very cool<br><br>Which brings us back to the starting point. The \"gold standard\" for these stories is now, and may (possibly) always be, Freaky Friday (2003). Not only did FF have a killer script but Curtis and Lohan were arguably at, or near, the peaks of their A-list careers.<br><br>Again, let's look at energy. Before writing this review, I borrowed a DVD of Freaky Friday and watched it.<br><br>In the Curtis-Lohan version, the energy level in the dual performances literally explodes onto the screen within the first 9 minutes, and amazingly maintains that hi level almost right to the end. That is impressive.<br><br>In The Swap, the energy starts very slow and builds. It never quite hits any of the highs of FF, but it never lags in holding interest either.<br><br>List and Bertrand do a yeoman job with the material they have to work with. The script by Charlie Shahnaian and Shari Simpson is bit of letdown however.<br><br>In FF, the two characters set out their respective missions off the top of the story and things escalate. In The Swap, nothing in the story seems to escalate at all, stuff just sort of happens almost randomly.<br><br>So, at the end of the day, we are left with two movies that compete based on story but on little else. One is a firecracker and one is slow burner.<br><br>My advice? If you have not seen Freaky Friday, see it AFTER you see The Swap. It will be more fun that way.","user":"A_Different_Drummer","rank":[21,29]},{"title":"This had all been done before...","rating":5,"date":"14 November 2016","review":"What did \"The Swap\" bring to the table that other movies in the same category didn't already bring before it? Nothing much. Well, aside from it being a newer movie and appealing to the young audience of today. But aside from that, then \"The Swap\" really didn't offer that much.<br><br>Storywise, well it can be summarized very easily: Ellie and Jack make a wish to switch lives, and fate happens to cash in on that wish.<br><br>There, easily done. Yeah, there is little more to the story actually. Well, except for scenes where the guy has to perform gymnastics and pretend to be a girl, and vice versa with the girl having to play ice hockey and pretend to be a boy. But wait, didn't we already seen scenes like this in, say, \"Freaky Friday\"? To name a single classic of the role swapping genre.<br><br>\"The Swap\" is definitely a movie aimed at a younger audience, and I did feel quite out of the target audience. I just had a hard time fully committing to the movie and get into it. Perhaps because I already knew exactly what would happen and how the movie would end? Yeah, it was that predictable. And if you have seen one movie in this particular role swapping genre, then you have already seen \"The Swap\".<br><br>It should be said that the cast in the movie were doing good jobs with their given roles and characters. And the two lead talents, Peyton List and Jacob Bertrand, did carry the movie quite nicely. However, in my opinion, then it was James Godfrey (playing Porter Gibbs) who was the most memorable in the movie, given his odd and quirky character.<br><br>I am sure that this movie will be quite funny and appealing to a younger audience of this day and age. But for us mature people, this was sort of a swing and a miss. As such, I am rating this a five out of ten stars. Yeah, I found it to be a mediocre movie, because it had all been seen before.","user":"paul_haakonsen","rank":[7,9]}]