[{"title":"This heralds the arrival of a major player in world cinema.","rating":9,"date":"2 October 2017","review":"It is said by some that \"Mimosas\" is a 'contemporary Moroccan western' and why not. Over the decades we have come to learn that the Western is as much a state of mind as it is a genre and that it is not rooted in any particular time or place. The Western tropes apparent in \"Mimosas\" are a journey on horseback through mountainous terrain, in this case by three men tasked with taking the body of a dead sheik to his place of burial, (Tommy Lee Jones covered similar territory in the much more traditional \"The Three Burials of Melquiades Estrada\"), together with a few gun attacks and a couple of killings. Indeed, were it not for an early sequence in a city or town involving a fleet of taxis we might be back two centuries and, if not in the American West, at least in recognizable 'Western' terrain and in one scene near the end of the film we could even be back 2,000 years.<br><br>In some respects you could say not a great deal happens, at least not conventionally, in Oliver Laxe's film, (it's only his second), and yet this is so much more than a beautifully photographed travelogue, (Laxe shot the film on location mostly in the Atlas mountains). There is an almost profound sense of both joy and sadness in the relationship that develops between the three men and their strange cargo as well as genuine sense of mystery, (many events are left unexplained). Laxe also gets wonderful performances from Ahmed Hammoud as the man who agrees to take the body in the first place and from Shakib Ben Omar as the little runt who proves to have a lot more going for him than meets the eye, (neither men are professional actors though Shakib did appear in Laxe's first film). There are also scenes here of such pure physicality that they almost rival those in \"Aguirre, Wrath of God\". I have yet to see Laxe's earlier \"You are all Captains\" but \"Mimosas\" certainly heralds the arrival of a major player in world cinema.","user":"MOscarbradley","rank":[6,10]},{"title":"I don't get it","rating":3,"date":"17 March 2018","review":"My heading says it all. Although the scenery is beautiful, I must admit that I don't understand the messages throughout this film and if there is any message the film is supposed to leave me with. Yes, the scenery is beautiful and beautifully filmed, the actors and some scenes made impressions on me, but overall I don't understand the relationships between varying scenes and the overall point of the film.","user":"debrahotmer","rank":[4,7]},{"title":"Awful","rating":1,"date":"6 May 2017","review":"I want my time back. There is maybe 10 minutes of story. This movie could have five minutes and it would tell everything that happens. I don't get this idea of insanely long takes of people walking in a desert, other people sitting in silence inside traveling vehicles or dialogues that takes 30 seconds between every line. OK, I get the idea of different landscapes and cultures, blablabla but I have better things to do.","user":"mat123-1","rank":[11,28]}]