[{"title":"Art-house sex masquerading as revelation or poor excuse for amateur fetishfest with no plot?","rating":5,"date":"8 March 2017","review":"As the intro says there is no real plot here but it is essentially about Martin who is in his forties and lonely. In order to fill the chasm in his heart he seeks random hook ups with anyone willing to have sex or he is willing to pay. He essentially seems to crave affection but substitutes it for carnal delights and a cocktail of drugs.<br><br>This is a long film at 135 minutes and a lot of screen time features the rutting, sucking, blowing and general hedonism that surrounds one owns pleasure seeking. For me though it also showed up the mundanity of the the whole business of 'getting it on'.<br><br>There are scenes where not a lot happens, someone makes pasta, another messes with their pizza and there is a lot f slapping on of make up. There is also tons of nudity, ropey night clubs and a few lady boys all thrown into the mix. The overall feeling of the film though is one of loneliness and sadness and a desperation for happiness in often the most base of circumstances.<br><br>I am still torn between whether this was Art-house genius or an excuse for am dram porn – I will say I found it hard to watch as some of the sex scenes just went on and on and I sort of got the picture as to what was happening so no need to ram the point home – no pun intended. This is one that you will either love or hate – but for me the jury is still out.","user":"t-dooley-69-386916","rank":[14,17]},{"title":"It can't be worse","rating":1,"date":"12 January 2018","review":"The story doesn't make any sense, the pace of the whole film is absolutely slow, the actors are terrible, the scenes are incredibly boring, everything is wrong in this movie. Do yourselves a favour and don't waste your time watching this abomination.","user":"matiasnav","rank":[12,16]},{"title":"Sleazy Queer Argentine Cinéma-Vérité","rating":10,"date":"10 August 2018","review":"This film presents a slice of sleazy Buenos Aires as experienced by a\nmiddle aged homosexual man - delivered in the style of cine vérité. A fly on the wall camera peeks into the most intimate encounters between this man, Martin, and a motley crew of people that he hooks up with, for sex, drug use, and for ephemeric companionship. The sex and drugs are the medium through which to establish that particular companionship he looks for - stripped off all layers of pretense - right down to the core base of people's innermost desires and kinks, that he wants to match to his own. Getting wasted on drugs is a manner in which to retain interest in the (sex) partner or vive versa; it's part of the ritual bonding, and the antidote to fend off \"normal\" daily life.<br><br>To set the mood, there are scenes that show him snorting coke at random with strangers in seedy restrooms of clubs frequented by people of the night: aging transvestites, strippers who are past their prime, the rough and the rich, and socially introverted people (like Martin). These people of the night are sometimes wonderfully juxtaposed with ordinary people who go by their business in broad daylight<br><br>The background music and lyrics to the songs underscored in each scene are perfectly poignant and enhance the mood that is aimed for. Whilst looking to connect, people equally make sure there is distraction from the other person, filling the space with background noise: the tap running, the noisy chitter chatter of Argentine television, music being played to drown out people's voices or any awkward silences.<br><br>The camera likes to linger on the imperfections of the bodies of people: pot bellies, love handles, coarse facial features. Since it is Buenos Aires there are also lots of \"love hotels\" involved. Martin likes to keep the intimacy out of his own personal home, although he does go back there to puke up his guts after his nocturnal adventures. Usually by then he is strung out, after a failed encounter, to then start the whole process all over again. He pushes himself to the limit with drugs and alcohol and sex with the most awkward of strangers with the most minimal levels of communication. Most of all he is looking for heterosexual males to which he submits heedlessly; he uses transvestite friends and loose women, and drugs, and money, to gain physical proximity to them.<br><br>One must note that this is cinéma-vérité on the next level. The protagonist of the film, Martin, is also the director of this film, and he shows great courage in showing himself in this light. He probably draws from his own experiences as he captures the strange, bizarre, desperate, tender, and frustrating ever so well, which will be recognizable to anyone who has strayed through this sleazy world of urban night. The film is sexually explicit enough to be unapologetically realistic, but not so much that it is basic porno. The scenes are raw and meta-realistic; some characters were truly picked up, off the street and are gay for pay and under the influence of drugs, which injects a dosis of raw authenticity into this piece of fiction.<br><br>I consider this film another outstanding gay themed Argentine film of this decade, together with Muerte en Buenos Aires, Plan B, Vil Romance and El Tercero. Argentina delivers every time, and this film excells.","user":"sugarfreepeppermint","rank":[5,9]}]