[{"title":"From Russia without love","rating":8,"date":"21 August 2017","review":"After having watched the trials and tribulations of the lead character in this film for more than two hours, I realized I didn't even know her name. Did I miss it somehow? No, I didn't. Her name is not mentioned even once, and in the credits she is referred to as 'the gentle creature'.<br><br>This is symbolic for the dehumanization of the Russian society, which is the main subject of this film. Citizens are not seen as human creatures that need help, assistance or simply a kind smile, but as inconveniences, causes for trouble and objects for complaints. The whole society seems to consist of bitter, demoralized and cynical people.<br><br>The film shows how the nameless woman travels to a huge prison in an isolated town in Siberia, to visit her husband. The package she sent him was returned to sender, so she wants to find out what happened. During her long search she has to confront rude prison officials, corrupt police officers, greedy pimps, drunk lodgers, nostalgic nationalists and a disheartened human rights activist. The woman endures everything with admirable patience. Her facial expression remains completely even, whatever happens to her, and she only speaks when strictly necessary.<br><br>The movie is filmed in slow, almost contemplative scenes. The audience has to be patient, just as the woman. But the film is far from boring. The viewer completely identifies with the woman. After every deception, you're asking yourself: what next? What can be worse? An important aspect is the very clever cinematography. In several scenes, the director starts by showing a conversation or an event that is seemingly unattached to the story, only to show the connection after several minutes. A good example is the scene in the train taking the woman from her village to the prison town. We see four train passengers discussing the fate of the Russian state, until the camera turns, showing the woman sitting in a corner of the compartment, silently observing the goings-on.<br><br>The situations sometimes get so absurd that the viewer hesitates between laughing or crying. When asking for directions, the woman is told: 'Just look out for a burned house. A friend of mine died there.' It's something this film has in common with the films of Finnish director Aki Kaurismäki, who also shows ordinary men and women struggling in their daily existence. At times, even David Lynch comes to mind. That is particularly the case in the last part of the film. This dream sequence takes a quite different turn, and it is open to question if it makes the film better or worse. There's something to say for both, but in any case it adds an extra dimension that is worth thinking about. In this dream sequence, the Ukrainian director seems to hammer home his point: Russia is a deplorable country.<br><br>Keep in mind, Ukraine is still at war with Russian-supported militia over the control of its Eastern parts. As an insult to Vladimir Putin, this film doesn't miss its target.","user":"rubenm","rank":[44,58]},{"title":"Very good directing, unique concept, but a little two long","rating":7,"date":"23 May 2018","review":"I've read other users' review and noticed that the director could make some of the audience convinced of the seriousness of this film and make them think of \"real\" situation of contemporary Russian society. \nThat may be one of main intentions of the director. But I think I's better to look back the whole story and to remember many ambiguous points intentionally left by the author. This film is not so simple as it seems to be. I tell you why.<br><br>First, the title of the film: everyone who studied Russian literature knows that \"Krotkaya\" is the same title of F.Dostoevsky's famous novella, and every true lover of author's cinema knows that novella was already made into a film by Robert Bresson. So I,not being too informed of this film, expected that its is Loznitsa's new adaptation of Dostoevsky's story. We can soon realize that it is not. There's nothing in common with that. This is probably the entrance for audience to go into a play with the author.<br><br>Second, this film seems full of stereotyped \"uncivilized\" and \"anti-human\" images of Russia. Those who are only funs of art-house cinema, not too interested in Russian literature and without deep knowledge of Russian language and habits, probably will take them as \"realistic\" details.\nSo they will also think that there's really such \"Siberian\" prison camp near the station named \"Otradnoe\"(which means \"joyful\").By the way, there isn't such a prison town in Siberia, as far as I searched on Russian \"Wikipedia\". \nThen we enter the second stage of the game. The place is not \"real\" in any way. \nWhen heroine asks an old man the way to the office where she is allegedly be able to address her complaint to the authorities, he tells her a complicated way with streets' names with Lenin, Marx and Dzerzhinsky(Felix Dserzhinsky was the first leader of Soviet secret police). On the wall of that office we can see a portrait of Stalin. It will be impossible in contemporary Russia for such office for defending citizen''s human rights.Well, anti-humanistic nature of contemporary Russia is \"symbolized\" in such a way?<br><br>\"Stalinist\" theme was orchestrated even before heroine's arrival to the prison town, when she was in the train. Two war veterans sing \"The song of 3 tank drivers\" form Stalinist film \"Traktoristy\"(1939) . It's not the single case of reference to old Soviet and Russian cinema. The town which gradually began to look unrealistic and the neighbouring forest with a kitsch house where costume party is held, provide clear reference to one of Kafka-like films of \"perestroika\" period \"Zero city\"(1988). And the following violent rape scene within prison car is a reference to \"Khrustalyov, mashinu!\"(1998) by Alexei German.\nSo the third and the last layer of the game with audience is that of pure association, of cultural memory of Soviet period. This layer also includes the music for celebration, formulas of patriotic speech, etc.<br><br>As a whole, \"Krotkaya\" betrays expectations of those who got into the first and second layers of the film and want to find in it any reference to \"concrete\" situation within or outside Russia. No one of its characters talks about other countries or areas, except Russian Federation,, as the film turns out to be that of cultural memory and association of Soviet and of Russia.\nI think It's a very unique film with an unique concept, but a little too long for that kind of a game.","user":"shusei","rank":[13,22]},{"title":"Worth watching - masterful, efficient and rich storyteling","rating":5,"date":"5 January 2018","review":"'A gentle creature' defies categorisation, it is rich with both metaphor and realism. A Russian woman, depicted as 'gentle', searches for an explanation about the seeming disappearance of her husband who should still be in a Siberian prison. Her emotion during this journey is blunted and she gradually weakens further from lack of sleep and tiredness, until she is entirely and completely vulnerable. A courageous woman, she experiences the most extreme bureaucracy and corruption, the type that is the stuff of nightmares. This is masterfully depicted throughout, in scenes that no Hollywood movie is able to match. The viewer feels entrapped like the woman, and her emotional bluntness is understood completely.<br><br>Described by other reviewers as bleak, I found the dark mood of this story somewhat balanced by the humanity shown by others, strangers to the woman, who also suffer similar if not worse dilemmas than the woman. Her journey is her own, solitary and with great risk, but she is never invisible to others. Life in this Siberian town may be cold and harsh, but is life in any modern city any less warm?","user":"Humphreywashere","rank":[12,21]}]