[{"title":"Can someone actually change?","rating":10,"date":"11 January 2018","review":"Can someone actually change their life? That is the question Director/Writer Vladimir de Fontenay (primarily a Short's director) poses in this gritty yet heart-wrenching look at wayward mother (Imogen Poots \"That Awarkard Moment\" 2014), her abusive and demanding boyfriend Evan (Callum Turner \"The Only Boy Living in New York\" 2017) - a role originally slated for Anton Yelchin before his death, her young impressionable son ( new comer Frank Oulton) and mobile home builder/seller Robert (Callum Keith Rennie \"Californication \"). What de Fontenay and cinematographer Benoit Soler do right here is place the audience directly in the seat of the actors, enable us to live their chaotic lifestyle and experience their cold Canada environment. Along with de Fontenay's terrific realistic direction, across the board the actors make the audience despise who they are and what they are doing, yet equally make the viewer wish them better life choices. Young Outlon and Keith Rennie stand out here because they are so contradictory to what the stories premise. Thus, they keep the audience glued to the screen and their characters. \"Mobile Homes\" is an indie film that probably won't make it to the big screen. However, you should find it in other formats. This film was screened at the Palm Springs International Film Festival #PSIFF2018","user":"ccorral419","rank":[26,39]},{"title":"A Great Indy Style Film","rating":8,"date":"24 December 2019","review":"Imogen Poots plays a young , poor, submissive mother who gets influenced by her selfish and abusive boyfriend. He uses her and her son to make a buck regardless of morals. If you don't get this low dialog film it may be that you have not lived or seen people living on the lower edge of society. It's gritty &amp; the relationships are edgey &amp; raw. A good watch.","user":"johnnydicksonjr","rank":[3,3]},{"title":"Glad I stumbled on this one.","rating":7,"date":"30 March 2019","review":"Never heard about this movie before and I don't remember how I stumbled on this one but I'm glad I did. For a drama Mobile Homes is certainly more entertaining than the average drama. Maybe because the story is about following \"thrash\" people, and by that I just mean not very smart and unfortunate since birth, with on top of that making wrong decisions after wrong decisions. It's always more entertaining to watch misery than happiness, that kind of voyeurism that makes us feel superior or just better. Imogen Poots did a really great job with her character, as well as the young Frank Oulton. The rest of the cast was also good. A movie with a gripping dark and hopeless story.","user":"deloudelouvain","rank":[5,6]}]