[{"title":"Very underrated, but... 7/10","rating":7,"date":"9 September 2018","review":"...but the marketing is TOTALLY misleading. The DVD box basically is for a different film! It's like the producers chickened out at the last minute and did desperate packaging to boost sales.<br><br>What it is, is like a 90 minute X-Files episode, but in England, and Scully is the main character, and Mulder is a sexist bully a-hole, and all the cops are sexist bully a-holes, and the perp is a sexist bully a-hole satanist. And Scully has to deal with all the gaslighting and like save the day.<br><br>Good acting, especially Scully who is GREAT. Good cinematography, good special effects, no silly jump scares, surprisingly funny at times, overall very underrated. <br><br>I hated the ending. The last minute was like the producers chickened out again and left something for the gore kiddies. Would have been 9/10 with a different ending.","user":"alicepetit","rank":[23,25]},{"title":"Great movie. Just not horror.","rating":8,"date":"11 September 2018","review":"Even though there is probably no genre I watch more of, I do not expect too much from my low budget horror. Horror is almost a comfort blanket for me. Lots of time it's background ambiance. That might sound a bit sick and twisted but it's rare I sit up and pay attention to a low budget horror that hasn't been heavily publicized beforehand. There is just so much of it that in some ways I have become desensitized. Generally speaking I tune in and zoom out. So did Charismata make me sit up? Almost. <br><br>Charismata suffers from many of the usual pitfalls of the genre. This includes cheap and cheesy CGI and uneven acting. Crucially it is always engaging and excels in two important places. <br><br>First Sarah Beck Mather. Playing a British detective losing her mind as she investigates a murder, she is nothing short of sensational. I don't know how well known she is in the UK but I hope to see more of her in the US in the future. The other performances are not bad on the whole. Just more in keeping with what you expect from the genre. The lead though is fantastic and it's not hyperbole to say it is one of the best performances I have seen all year. A star is born. Or at least deserves to be.<br><br>Second. Apart from a strange misstep this is one of the best written horror films I have seen in some time. The dialogue sings and while there is nothing entirely original here I was still left guessing until the end. <br><br>The most important question when assessing a horror film is it scary?<br><br>Sadly, not really. There is an interesting lurid tone, a couple of average jump scares but noting made my skin crawl or my heart race. I would hesitate to even call it a horror. It's much closer to a murder mystery or a quirky Cohen brothers drama set in England. It reminded me more of A Barton Fink or Fargo than it did a Conjuring or Hereditary. This is not a bad thing. In fact it can be taken as a compliment. Just don't pretend it's something that it isn't.<br><br>6/10 if you are going in wanting a low budget horror fix.<br><br>8/10 if you just want an usual and entertaining movie.","user":"samilpatel","rank":[24,27]},{"title":"Great UK Horror","rating":8,"date":"13 September 2018","review":"Sometimes you have the most fun through accidental circumstances. I admit I watched this because I was forced by a friend who usually has very bad taste! I hope he is reading this. Maybe he has found me one of my favorites of the year. <br><br>English detectives chase a killer that may or may not be a demon. Can you guess the twist? <br><br>Sometimes obvious but also very good fun. Lots of black humor and a heavy creepy atmosphere throughout with strong surrealism. Strong Argento and Bava influences in presentation. If you are a fan you will love this. <br><br>The London location is cool. The villain is very entertaining and old school diabolical! I have lived and worked in London and I tell you both are accurate! Haha.<br><br>I watched this in America but can't find anywhere in Germany. What gives? I think this would play very well here and England is a lot closer than New York. Also, I want to watch it again when I am not drunk to make sure I enjoyed it as much as I did. It's one of those !","user":"bobbygarlandson","rank":[17,19]}]