[{"title":"It's still not easy being gay, but it's easier if you have friends","rating":9,"date":"24 October 2017","review":"Saturday Church (2017) was written and directed by Damon Cardasis. It stars Luka Kain as Ulysses, a young gay African-American man who would like to be a cross dresser. He's tormented and bullied in school, and verbally abused at home by his aunt, who takes care of him.<br><br>Ulysses finds Saturday Church, a place where gay men can express their identity, and where most of the members can, and do, cross dress safely. Saturday Church introduces Ulysses to the voguing scene, and the film gives us plenty of music to hear and voguing to watch.<br><br>It's discouraging that we still need places like Saturday Church, but at least they are there. (There really is a Saturday Church in NYC.)<br><br>I enjoyed this film because of the great performance by Luka Kain. (Performance in the sense of acting, as well as performance in the sense of voguing.) To a certain extent, it opened a window to the world of drag queens. It also reminded me that, even in 2017, in the United States, it still isn't easy being openly gay. I think that all of us need that reminder.<br><br>We saw this movie at Rochester's great Little Theatre, as part of the wonderful ImageOut, the LGBT Film Festival. It won't work as well on the small screen, but it's still worth finding it and watching it.","user":"Red-125","rank":[18,22]},{"title":"My new favorite film","rating":10,"date":"12 April 2018","review":"This movie was beautiful. It's a story about feeling right in your own skin, taking risks in your quest for happiness, and finding your people. The moving story of Ulysses coming to terms with his identity in New York City is imaginatively intertwined with song and dance. The music serves as a vehicle to give voice to the hidden world inside the characters. It is enchanting, visually enticing, heartbreaking, and empowering. The cast is also wonderfully talented and deeply connected to this personal story. We rarely get such realistic and rounded stories of queer experience in cinema, but Saturday Church breaks the standard and reveals at its core a story that many unheard voices can relate to.","user":"estellajean","rank":[9,10]},{"title":"Amazing Film","rating":10,"date":"20 June 2018","review":"A bit more subtle on the story line that most mainstream movies out there but the cinematography and the emotion behind every scene was done perfectly. Love the lighting and Ulysses' daydreaming details. Seeing him come into his own confidence was amazing, heartbreaking scenes almost pissed me off but honestly this is something that happens to a lot of lgbt youth and its wonderful to see this kind of representation. This film and other films like it are important. The music was good, not full on songs which I was sad about because the quality was so good.","user":"pacheco_thalia","rank":[8,9]}]