[{"title":"Great fun - with some nice 'nods' to DC history.","rating":7,"date":"28 July 2017","review":"Possbily my favourite Lego DC Batman/Justice League DtV so far. Standout locations are Gotham, Arkham Asylum, and Joker's Fun House, whilst Madam Mantis's island Dojo looks good. Lost my attention a bit when the action moved to the 'underground kingdom', but the rest easily made up for it.<br><br>Introduced Nightwing and Batgirl, along with Beast Boy and Starfire flying the flag for the Titans.<br><br>There's a nice nod to the first foot chase with Red Hood in Batman: Under the Red Hood in the way that a certain character makes his first appearance here and how Batman deduces who he is. Some great reproductions of the covers of Action Comics #1 and Detective Comics #27 too - in Lego of course.<br><br>7.5/10","user":"Milk_Tray_Guy","rank":[3,3]},{"title":"Lego DC Comics Superheroes Justice League - Gotham City Breakout: Really?","rating":3,"date":"14 January 2018","review":"I like DC (I'm a nerd it's in my DNA) I also like LEGO media as it's always had a certain charm about it so it was written in the stars that DC Lego movies would be great for me. Right?<br><br>This is the first feature length Lego movie I've seen and I have to say, it's an utter mess.<br><br>I'm blown away by just how bad it was, and many voice acting greats including Troy Baker were involved which makes it that much worse.<br><br>It's like a Saturday morning cartoon, without the occasional funny joke or nod to the parents. It was decidedly unfunny, the plot was mediocre and...and....I honestly don't even know what to say.<br><br>It's about Batman taking a holiday, in his absence Superman takes over and finds himself overwhelmed and outsmarted. Yeah, exactly what you're thinking!<br><br>There are several of these and I'm concerned, are they all like this?<br><br>The Good:<br><br>Includes the proper Harley Quinn actress<br><br>The Bad:<br><br>Jokers voice is terrible, sounds like he's on helium<br><br>Practically every joke falls flat<br><br>Things I Learnt From This Movie:<br><br>Nobody bothered to tell the writers that Ivy's pheremones don't work on girls<br><br>A book with no pages is never late from the library<br><br>Pheremones give you the munchies","user":"Platypuschow","rank":[2,3]},{"title":"It ok, It could've been better","rating":6,"date":"11 February 2020","review":"A very lite, laid back movie. It has funny moments, a nice array of Batman Franchise characters &amp; is pretty average. It's a one time watch, nothing too special but definitely ok.\nIt deserves a solid 6 stars.","user":"AtomicKonstant27","rank":[1,1]}]