[{"title":"Not bad","rating":5,"date":"13 February 2019","review":"For all the nay sayers, why watch a film to the end if it's so terrible? It's not a bad flick, I love the female lead and hope the actress finds huge success in that industry","user":"heydiddlediddle007","rank":[15,19]},{"title":"Not A Pile of crap","rating":5,"date":"24 September 2019","review":"This film is what it is, low budget, the scenery is lovely, but it was boring, and it has a environmentally friendly angle to it, the problem is true Vikings were not environmentally friendly, the reason they invaded other lands is because they could not find more land to farm in in their own countries, so they invaded others, with the bonus of being able to plunder as they went, so I assume they included it in this film to attract the environmentally friendly audience. If they wanted it to look like a real viking world, they probably succeeded as true life is a lot more boring than a movie, even in Viking days.<br><br>The acting was not great but not awful, there are some good actors in this film, Terence Stamp stands out a mile as one of the best, it was just sort of placid. The big problem was the direction and editing, and the mystic angle (like someone else pointed out), with a better director and good editor I think this could have had the makings of a great film, I don't know if either are well rated but if they were they both had an off-day with this one. Also the music was not great, sort of a meandering dreary tone to it, if it had a more upbeat soundtrack similar to an earlier Viking film with Kirk Douglas in it, it would have improved it by about 50%. If someone better took the same story and actors, using the same locations I'm sure they could have made a cracking film.<br><br>I give it a 5 for the scenery and realism.","user":"michaelarmer","rank":[5,5]},{"title":"Such a pile of turd","rating":1,"date":"4 August 2018","review":"Awful but I will give it to them they were consistently awful throughout the whole film.","user":"nwilliams-74731","rank":[41,64]}]