[{"title":"Fun and quirky tale. Playful with a serious message.","rating":8,"date":"23 July 2018","review":"This movie personifies the debate of whether cloning is humane through a make believe story of a college professor who loses his wife and repeatedly trys to clone her. The film is very light hearted and tactful maintaining its family friendly theme but when things start to go haywire a beautiful message develops. Great pacing and enough comic wit to keep everything upbeat and in good spirits. I give this a Good movie rating when seeking something clean and fun.","user":"tkaine3","rank":[142,184]},{"title":"Live for today","rating":8,"date":"22 July 2018","review":"A man gets seemingly unlimited opportunities at a second chance, but in the end, all he really gets is one more. How many times have we wished that we could do things over... and over? How many tiimes HAVE we had a secomd chance, just to mess it up again? It seems that somes things are meant to be, and some are not. That some things have a time limit. They are good until they run their course, then nothing can make them right again. That sometimes, we have to admit that things have changed, and find a new direction. Jennifer Finnigan looks likke no one else in the world, has a unique personality, and is a pleasure to watch. She steals every scene she is in. This film has everything. Sadness, and loss, comedy, \" Quit beating yourself up!\"..discovery and happiness. And it tells us not to force things. To let life come to us. You can't make someone love you. and you can't live in the past. A great supporting cast, and a REALLY original story.","user":"notanaxkiller-107-287911","rank":[54,74]},{"title":"One of the worst movies I've ever watched half of","rating":1,"date":"24 August 2018","review":"Hubby sold me on watching this, he said it was a Sci-fi Romantic Comedy. How could we go wrong? Well, it went very, very wrong. The whole feel of the movie is off. Nothing about this movie makes any sense. Strange and creepy and not at all funny.\nAt least we got a good laugh reading the real reviews!\nDon't be fooled by the 10/10 reviews.","user":"tuiadam-99919","rank":[16,20]}]