[{"title":"More Baker brilliance","rating":8,"date":"18 October 2017","review":"Greetings again from the darkness. \"The Happiest Place on Earth\" has long been a Disney catchphrase. The irony for those living on the road to Disney World is the focus of the latest from ground-breaking filmmaker Sean Baker. Mr. Baker was the creative force behind the remarkable TANGERINE (shot entirely with iphones) a couple of years ago, and his most recent film solidifies his brilliance at bringing us the fringes of society – those we don't typically see on screen. Beyond that, these are the folks many of us pay little attention to in real life.<br><br>The Magic Castle Motel is a lavender monstrosity that belies the daily struggles of those who live behind its purple doors. It's actually a seedy extended-stay that caters to ultra-budget guests. Included among those are 6 year old Moonee (Brooklyn Kimberly Prince) and her friend Scooty (Christopher Rivera). As we watch them spit on a car below their perch on the motel balcony, we quickly judge these as kids with a bit too much free time and a shortage of parental guidance. <br><br>As the summer days roll on, we tag along as Moonee leads Scooty and their new friend Jancey (Valeria Cotto) in some boundary-pushing adventures. Their fun ranges from typical kid mischief to accidents with more serious ramifications. The brilliance here is that through the child's eye, we see joy and excitement and fun. We hear the purity of giggles and giddy screeches as the kids bound between tourist traps, ice cream parlors, and rooms forbidden as off-limits. All of this miscreant activity occurs amidst the adults who trudge on simply trying to survive another day. <br><br>While we might be tempted to recall Cat Stevens' lyrics, \"while the sinners sin, the children play\", it's director Baker that refuses to pass judgment. Moonee's mother Halley (Bria Vinaite) was recently fired from her \"dancing\" job, and is now constantly on the prowl to make enough money to cover the weekly motel bill. She clearly loves her daughter, but is too proud and angry, and just has no idea of how to pull out of this vicious cycle of poverty. The artificial dreams that are prevalent in so many films have no place at the Magic Castle Motel. It's about the next meal and keeping a roof above. <br><br>Don't go searching for plot here. Instead, at times it feels like a documentary on Moonee or the spirited need for fun and laughter that is in the DNA of kids. We are just following a real kid around, and that's a tribute to the marvel that is Brooklyn Kimberly Prince. She steals every scene and most of the movie  and that's in spite of the terrific performances from Ms. Vinaite and screen vet Willem Dafoe. It's a rare \"normal\" role for Mr. Dafoe, and he makes the most of it as Bobby, the motel's manager. He is also a father figure, mediator of disputes, bill collector, and protector of damaged souls. With no hint of saccharine or Hollywood mush, Bobby is unable to detach emotionally from those who live at the hotel, not because he is soft, but rather because he is human. We see his demeanor change drastically when the owner of the hotel arrives for inspection. Bobby understands the fragility of his own situation due to what he witnesses each day.<br><br>Director Baker is a master of color use and the blending of abrupt framed images with the handhelds in close proximity within motel rooms and personal interactions. His story (co-written with his TANGERINE and STARLET collaborator Chris Bergoch) never feels condescending, preachy or romanticized. There is no blatant political statement being made. These are folks living their lives as best they are able within the confines of their situation. The police and Child Protective Services are always hovering as a reminder that the next mistake could significantly alter lives. Somehow, the film is both hilarious and heart-breaking. The obvious comparison is to last year's MOONLIGHT, and it could even be viewed as a prequel to American HONEY. Mostly it's a slice of rarely seen life and further proof that Sean Baker is already an important filmmaker, and one that likely has more to say. As for the debate around the final scene, does it really matter? There is no better place for a child to escape reality  even if it might only be in their mind. Sometimes that's the only escape we get.","user":"ferguson-6","rank":[213,283]},{"title":"The dream comes true in many different ways","rating":10,"date":"12 February 2018","review":"This movie is awesome and I will explain why I thought that. <br><br>In 2013, I, my wife and my stepdaughter went to Orlando in vacation, was a \"dream comes true\" trip, we all are born in a poor family in Brazil, and can do that was really a dream come true. Everything in USA was amazing and we come back Brazil thinking \"there is no poverty in USA, everything works, the things are cheap!\".<br><br>The poor people in Brazil live in not well done houses, in favela, near polluted rivers or very crowded neighborhoods. This movie show us where the poor people live in Orlando, conventily in cheap hotels (conventily to the ones that earn money from tourism). Just to you know the difference between the countries, in Brazil is impossible a poor family live in a cheap hotel, no way, this is very expensive.<br><br>Many user reviews here, especially the lower ratings, takes the point of view of the mother, saying that \"she not a good mother\", \"why she dont work?\" and many other things. They say the movie protect this kind of people and becouse of this they are very disappointed.<br><br>I say that all these people don't understand the movie, let´s take only the point of view of Moonee, she have a super mom for her. She can play all day with her friends, walk way in many places, eat icecream for free, and do stupid things, and if anyone go to your mother to complain about her, her super mom will make they go away. Moonee really love this.<br><br>You can say that this is wrong, I don't agree to that kind of comportament, but the movie is showing to us one point of view, you don´t need to agree with it, but you need to see it.<br><br>Just think about Moonee life, she love it, everything is good, everything is a party. There are so many middle class families, with kids that just hate their lives, they have school, toys, video games, computers, cellphones, but just don´t have good times with their parents.","user":"charlesartbr","rank":[65,86]},{"title":"The Florida Project (2017)","rating":8,"date":"7 October 2017","review":"Boy, did I hear some great things about this from film festivals and from critics I follow on social media. Trailer didn't blow me away but I knew there had to be something special about this film. I haven't seen Sean Baker's previous effort, Tangerine, so I didn't really have a barometer for what to expect. I can safely say the film works so well. It's incredibly well acted, and utilizes a charming and emotional script to convey an experience you won't soon forget.<br><br>The film follows a young girl named Moonee (played by a really good young Brooklynn Kimberly Prince) and her mom who live in an extended stay motel managed by Bobby (Willem Dafoe). Halley, Moone's mother, has trouble making ends meet and does whatever she can to raise her daughter but her brash personality and lifestyle makes life difficult during their stay at the motel. Bobby tries his best to watch over them but realizes how tough it is keeping them as guests.<br><br>Its hard to say much more without giving away key plot points. I have to say this film is a joyous good time. The kid performers are mostly yelling loudly and running around on adventures. you know, being typical hyper kids. Its done so well though. I think Baker may have legitimately had the child actors improvise their lines because everything felt extremely natural. Newcomer Bria Vinaite, wow. She is livewire. Love or hate her character, she is loudly unapologetic and rebellious and just wonderfully portrayed. Defoe is also typically great. Bobby is such an identifiable character.<br><br>Baker uses his lenses to study a part of under-represented America. We don't get a lot of films about struggling families who find it hard to get by, definitely not the typical \"Hollywood\" character story. The film is definitely going to hit a lot of viewers hard at the end. Its a rather beautiful ending that reflects the innocence of the mischievous but ultimately innocent children. This could really be an Oscar contender.<br><br>8/10","user":"rockman182","rank":[138,202]}]