[{"title":"Throat slitting knife action like no other I've ever seen","rating":6,"date":"31 March 2018","review":"Fast paced martial arts film with enough originality to be worthy of a recommendation. This is worth watching for the superbly executed fight scenes. The one in the phone booth sums up the style of the movie and is the most memorable for me. As the movie progressed I wondered how the pace could be held to the end, my mind can only take so much, but it just got more and more tense. I found myself almost holding my breath in the final scenes. \nOK so there is a background story to justify the high octane killing but the strength of the movie is mainly the action. Toshiro nicknamed the legendary Ghost was a former special ops soldier and unstoppable killer. He's now given that up and living as a shopkeeper but is still haunted by his past. His former commanding officer is seeking revenge so Toshiro has to return to killing and deal with what seems like an unlimited number of 'fight to the last' assassins. <br><br>My rating 6/10\nHighly recommended if you're into exciting martial art knife combat with lots of blood. If not then this may seem like 115 minutes of ridiculous gratuitous killing.","user":"Frame-By-Frame","rank":[10,15]},{"title":"Yuji Shimomura's Re: Born is an evolution of modern action film","rating":10,"date":"13 March 2018","review":"Re: Born is a new Japanese martial arts action thriller film by Yuji Shimomura, probably one of the greatest action coordinators, stuntmen and directors in the small, but entertaining action scene of Japan, re-uniting with Tak Sakaguchi of \"Versus\" fame and Shimomura's previous and only other feature \"Death Trance\", the legendary martial artist and the underrated filmmaker have made not only their second and best film to date, but also one of the best action films of the year, whichever year you saw it in, because of its screenings in numerous film festivals starting from 2016.<br><br>The story centers on Toshiro Kuroda(played by Tak) who runs a small convenience store in a quiet town in Japan and looking after his adopted daughter, Sachi, but when his blood-soaked, military past catches up to him however, it brings back an old comrade (played by Akio Otsuka, the voice of Solid Snake from MGS series)seeking revenge, with an army of brainwashed soldiers behind him, including a former buddy of Toshiro, known only by his codename, Abyss Walker(played by film's fight choreographer Yoshitaka Inagawa), Toshiro, the reborn ghost, springs back into action with violent vigor. The plot would seem cliche, rope and stereotypically dull to a naked eye, but imagine my surprise when it introduced elements, characters and a tone rarely seen in action movies of this caliber or premise. There's a sense of mystery surrounding Toshiro throughout the film, with the mystery behind him viewed as the stuff of legends, told only as fairy tales, but alas Toshiro comes back to show that those were mere understatements. Some of the best characters in the film are the guys Toshiro knows from his life on the battlefield, the battle scarred and disabled Kenji is one, his backstory is quite tragic and at the same time fairly original in the way his relationship works with Toshiro after his reception of the immobilizing wounds and life in the care home. Akio Otsuka's Phantom was also quite brilliant, the man is just a great actor, capable of portraying menace through subtlety, control through conversation and anger through action. The aforementioned Abyss Walker played by Inagawa, is more of a physical antagonist, delivering a more than worthy adversary to Toshiro, and the buildup to their inevitable showdown, is interesting and exciting. Also impressive was Tak Sakaguchi's daughter, Makoto Sakaguchi, who plays probably the quirkiest character in the film, whose innocence is starkly contrasted and countered by her skills in combat. Overall the familiar premise is saved by characters with enough depth and originality that is missing from a lot of the films in this genre.<br><br>What is not missing and would be quite hard to miss is all the glorious throat-slitting, artery-dicing, bladed weapon-oriented action of which there is so much, that at times you wonder whether or not the fight crew is able to keep things fresh and entertaining, and again surprisingly, they do. It's all down to 3 reasons: The brutal, slick, incredibly efficient action choreography by real-life combat instructor and adviser Yoshitaka Inagawa, Sakaguchi's skill in martial arts and will to learn something new and master it and finally Yuji Shimomura's lean, mean and compelling direction, assisted by cinematographer Tetsuya Kudo's fantastic camerawork, that has so much kinetic energy and flair, that the moves, as deadly as they were already, start seeming even more powerful. The action is dynamic as well, with a lot of creativity, where you can tell that the filmmakers wanted to use their newly invented combat system \"Zero Range Combat\" in every possible environment and scenario, as such we get fights in convenience stores, large city courtyards with crowds of civilians, gigantic rural rain-forests(my personal favorite, the damn thing goes on for nearly 43 breathtaking minutes, yes it was so awesome I counted) as well as a very interesting and claustrophobic fight in a minuscule phone booth. The abundance of weaponry is also impressive, featuring karambits and other knives of so many different shapes and sizes it easily makes Re: Born, the most knife-oriented action film of possibly all time. In addition to Dual Kamas, chopsticks and screwdrivers, a very cute shovel that right after its introduction turns not so cute and an assortment of firearms, and you've got yourself an action film that is locked, loaded and ready for the fight. The soundtrack by Kenji Kawai(composer of Ghost in the Shell, Resident Evil: Vendetta), while not being the best among his work, is adequately tense and operatic.<br><br>Re: Born is masterful, the plot is simple in execution, detailed in characterization and in terms of action design, coordination and performance, the film is an example piece of hardcore, beautifully shot, edited and directed action filmmaking. Shimomura has finally become an action director to look out for and even aspire to, while Tak Sakaguchi proves that not only can you teach an old dog new tricks, but in turn he can teach you something back.","user":"andrewmakatsaria","rank":[12,23]},{"title":"Not The Raid or John Wick.","rating":5,"date":"17 August 2019","review":"Don't be fooled by the high rated reviews. This is a mediocre action movie that's part John Wick, part Taken and part Metal Gear Solid.<br><br>The \"hero\" is a cardboard cutout with the ability to dodge bullets and put a knife in a neck from nowhere and the villains are comical in the extreme.... one tries to hypnotise the hero to death.<br><br>Poor fight scenes where no one seems to see the hero despite him wearing a hoodie that stands out a mile and creaks everytime he moves, and most of it filmed in the woods or in a disused factory, this is a firm pass.","user":"neilcjenkins","rank":[4,6]}]