[{"title":"Wherever you find it...","rating":6,"date":"27 September 2017","review":"Lost and out-of-control youth is not uncommon in Japanese cinema, with the rigid formality of Japanese schools countered by the over- the- top rebellion of kids who see no place for themselves within the education system. The second collaboration between British-born, now Japanese-living Third Window Films and director Eiji Uchida after \"Lowlife Love\", \"Love and other Cults\" is a film that follows similar lines of others in terms of theme, though the final destination isn't as per the usual. <br><br>Ai (Sairi Ito) is a girl who comes in many guises: the daughter of a serial religious and cult follower, she finds little place for herself at home; her mother often distracted by the new fad in her life. Eventually sent by her mother to a cult commune under Mount Fuji at a tender age, she soon finds happiness, before the cult's exposure and mass arrests leave her again without a place to find herself. Growing out of hand, she dyes her hair and shacks up with her boyfriend and his drug addict family of friends by her mid- teens. <br><br>Bumping into brief former classmate Ryota (Kenta Suga), she hangs out with him and his gangster mates after being ditched by her boyfriend, but lovingly welcomed by a class president Yuka's (Kana Matsumoto) family. Here, she switches between domestic bliss with her adopted family and her double life working in a hostess bar. Eventually found out, she moves back in with her mother - her apathy no longer a cause for concern - and works as a call girl. <br><br>Meanwhile, Ryota, our narrator, holds a torch for Ai, even when they drift apart at various moments. A bit-part player in Kenta (Antony) and Yuji's (Kaito Yoshimura) gang, he quietly keeps his head down, trying to gather together enough money to escape small town blues. Yuji himself has designs on becoming a yakuza, while natural gang leader Kenta gradually begins to reject the life upon meeting, Reika (Hanae Kan), an underwater photographer who shows an interest in him. <br><br>What runs throughout the film is the sense that none of the characters are happy. Whether a member of a religion, a cult, a gang, a school group, none feel they have found the place that's right for them. In doing this, despite the central focus on Ryota and Ai, Uchida switches the storyline to Kenta and Yuji and how their lives play out, as all four look to make a life-changing move to find their place, however unusual they may be.<br><br>Ryota and Kenta both reject the criminal life: Ryota going to university in Tokyo; Kenta leading a quiet life with Reika, deep- water diving. Being that this is partly based on the true story of a porn star whom Uchida noted for her cult followings, Ai works with Lavi (Matthew Chozick), the former leader of the cult where she was once happy, as a porn star, finding minor fame. <br><br>There are warnings that trying to escape a doomed fate are not always easy: Reika abused for Kenta's decision to quit the gang; Ryota losing his savings along the way. But, where other films about lost youth may build to exaggerated and frantic endings, or leave things open without established consequences, the characters of \"Love and other Cults\" are able to find a place where they are comfortable. The one unable to find this peace, Yuji, is left alone by his yakuza lifestyle. Wherever it may be, and with whoever it is with, the closing theme is one of changing for the better.<br><br>Much like the characters' lives, \"Love and other Cults\" is perhaps a little bumpy along the way. While probably a step-up in terms of production quality from \"Lowlife Love\", it is not as well crafted and witty. There are many twists of fate along the way that require leaps of faith in the audience, leaving the story flow a little unnatural in parts.<br><br>But the sense of peace reached in the film's ending is refreshing from how films of this nature can pan-out. Where the likes of \"The World of Kanako\" can build into messy, over-zealous finales, the stepping- down a tone by the film's end is welcome, despite the rather choice appearance of a school girl panties porn film script. But then, there is love...and other cults (sic). <br><br>politic1983.blogspot.co.uk","user":"politic1983","rank":[5,5]},{"title":"not easy for a non-Japanese to get all the nuances","rating":8,"date":"6 May 2019","review":"Another extraordinary film from director Eiji Uchida. Full of power, energy, a kaeledoscope of colours and showing great confidence with well composed scenes with complicated action this is just as, maybe more so, crazy than the earlier Greatful Dead. Easier to enjoy if not fully understand, this seems to once again be about the real struggle in Japan for youngsters to find a transition from school to employment and society in general. In my visits to the county I have seen nothing to suggest rebellion on the scale shown here but the reality gap between the young now and the old, seemingly unchanged, for many, many years is palpable in certain spots where youth culture is challenging the existing order. Sairi Ito is impressive as the irrepressible youngster trying all sorts of ways to conform as best she can and Kenta Suga her well played counterpart. Stylish, violent, sexy and pertinent but not easy for a non-Japanese to get all the nuances that I am sure are present amidst the seeming mayhem of this uncompromising picture.","user":"christopher-underwood","rank":[1,1]},{"title":"trapped in the under","rating":5,"date":"16 November 2019","review":"To have a place in this every day even more huge and complicated society, is a not an easy task. You need luck and in my opinion, there are people with luck and those without it.\nNo doubt that to take the right decision in the wrong environment could save you but normally that do not occur and the flow would get you in the end.","user":"Hombredelfuturo","rank":[0,1]}]