[{"title":"Authentic coming out rom-com with broad appeal","rating":8,"date":"11 June 2018","review":"This is an accurate depiction of coming out. Other reviewers seem offended by the focus on his relationship with a girl, but I don't understand that. It's very realistic and an aspect of the coming-out experience. I think this movie did a very good job of highlighting the roles of those people and other friends in the lives of lgbt.<br><br>I also really appreciated the later-in-life realization of his sexuality. Yes, some people 'always know,' but some people don't, and others are in huge denial and that can really suck. These people need representation, too, and this is a great movie to do it with.<br><br>Even the poor reviews give the acting good marks. I think I can speak from experience that the story is very authentic. No aspect of it rings untrue, and it manages to be genuinely hilarious at just the right times. 8/10","user":"JetFlower","rank":[45,58]},{"title":"Great film that actually helped me realize I'm gay","rating":9,"date":"15 November 2018","review":"Yes this film is cheesy, yes it is very American and no it's probably not the best LGBT coming of age film. However this is a heartfelt, funny and (somewhat) realistic depiction of what it's like trying to figure out your sexuality what you have lurning disabilities. Oh and this is definitely better then love Simon so before you look at the other reviews just think this film has been made with a specific audience in mind. So if you have any lurning disabilities and are questioning your sexuality, please I urge you to watch this film it helped me, it might help you too","user":"sumosausage","rank":[27,34]},{"title":"thought it was gonna suck, ended up crying","rating":10,"date":"9 June 2018","review":"I just wanted to watch another stupid movie to keep myself distracted. I had no idea that this movie would touch me so deeply. \nIt was funny and sad. \nThe name of the movie is stupid which lead to me thinking it would be another useless Netflix movie. But my assumption turned out to be wrong. I'm definitely gonna watch it again.\nIn my opinion it was better than Love, Simon.","user":"jella-16842","rank":[38,51]}]