[{"title":"Cut Shoot Kill (2017)","rating":7,"date":"19 February 2018","review":"Aside from some really stupid moments, like the awkward interview with the director in the beginning (which somehow makes the actress say that he is SMART and she's very confident about him/the project) or the ending itself (it wouldn't look as stupid if it wasn't presented in such a clumsy way), it's a decent meta-horror movie about a movie crew, who are really just a bunch of maniacs, killing the actors they choose to film. Some of the parts though are so wooden and too convinient, you wait it would be shown as a movie footage, but then they show that these are the \"real\" events (like the episode with the officer, very convenient arrival of the policeman and killer appearing out of nowhere). The character motivations are also pretty weak, too many killers and it's too obvious that such isolation from the world is definitely not about \"concetrating on the work\". <br><br>The special effects are well, effective. They sure did a lot of work on that, otherwise fake looking special effects would ruin the movie since it's about what's fake and what's not.<br><br>Overall a good rental watch if you don't think too much about it (swiss cheese it is, at least there aren't many holes).","user":"SashaDarko","rank":[3,5]},{"title":"The Meta-Slasher","rating":6,"date":"8 August 2017","review":"Serena Brooks (Alexandra Socha), an ambitious young actress, signs on as the star of a horror film with a crew of backwoods filmmakers that have worked together for years. When the cast starts disappearing, Serena has to become her character if she wants to survive.<br><br>Michael Walker could be considered an auteur, though not as well known as many directors who have been given that title. Working outside of the studio system, he has succeeded in both writing and directing his own pictures. And despite this independence, he has managed to attract some name actors – Jeff Daniels in \"Chasing Sleep\" (2000) and Parker Posey in \"Price Check\" (2012), which also had a pre-oversaturated Amy Schumer.<br><br>Although no big names are attached to \"Cut Shoot Kill\" (unless you count the name drop of Shailene Woodley), almost everyone in the cast has plenty of credits under their belt, and elevates what would otherwise be dismissed as a low budget film to a higher caliber. Alexandra Socha is incredible, an ideal \"final girl\". Walker has said \"she came to it where she really knew how to get a performance out of herself.\" This is evident on screen, and one suspects she will soon be bombarded with scripts.<br><br>This is not the first horror film to blur the lines between reality and fiction (\"Effects\" and \"Behind the Mask\" come to mind), but the material is superbly crafted and executed. While nothing is completely original, there are quite a bit of new ideas brought to the horror genre here. Reviewer Jennie Kermode says \"the film doesn't really have enough ideas to justify its 98 minute running time\", but I respectfully disagree. Though a film does have to earn the right to run over 90 minutes, \"Cut Shoot Kill\" successfully does that. Much more than a slasher film, we have two (or maybe three?) layers that each could be their own film.<br><br>Beyond the great writing and lead actress, the rocking, fast-tempo score from Brooklyn-based composer Christopher North keeps the film moving when necessary, and becomes dark and moody at other times. Hiring North was a wise move. Perhaps even wiser was having Doug Sakmann and Backseat Conceptions on board in the production department. With Sakmann, you not only get a producer, but an actor (playing two roles) and a special effects artist who has been working on the fly for twenty years. God bless you, Doug Sakmann, and your dedication to independent cinema.<br><br>The film opens nationwide on VOD on August 8th, released courtesy of Freestyle Digital Media. Viewers should be able to find a copy on Amazon, their Xbox, or however the kids are watching their movies these days.","user":"gavin6942","rank":[13,37]}]