[{"title":"Noel Wells, manic pixie dream girl","rating":4,"date":"2 June 2018","review":"She plays the same character quirky messy girl rom com girl in everything i've seen her in. Yawn. Is she like this in real life? Its abit like being hit over the head repeatedly with a strawberry shortcake. I thought this trope had died with Zooey Deschanel and Natalie Portman in Garden State (the latter is actually pretty great, hence all the copycats). We luv her for her 'uniqueness' but the thing is... being a skinny white indie girl isn't very new is it? At least in this story we don't have to put up with any bourgeois crap. She lives in a trailer, but still somehow manages to make it cute and upbeat!\nMy final note (spoiler) is that... I think the main male character in this film was abit of a philandering A-hole (in a 'nice guy' poly disguise) and a pretty crap parent and why wasn't he reprimanded instead of getting the girl? No doubt some would argue with this judgement, but every rom com has a falling out and a getting back together. To me, it felt shallow and rushed.\nIn any case, a different leading lady could've changed the entire tone of the film. Maybe the new generation of viewers haven't met the manic pixie dream before? It's grating af to see it's return.","user":"hunter_m","rank":[7,8]},{"title":"VIEWS ON FILM review of Social Animals","rating":5,"date":"5 June 2018","review":"Social Animals is a depressing, sort of pseudo comedy that features a borderline, unlikable lead in Zoe (played by San Antonio, Texas native, Noel Wells). As far as new releases go in 2018, \"Animals\" is like Reality Bites, Richard Linklater's Slacker, and 1998's Your Friends &amp; Neighbors being melded in a cinematic blender. <br><br>Note to the rebelling filmmakers of Social Animals: Jeanne Garofalo called and wants her undisguised promiscuity back. Also, Jason Patric phoned and wants his sobering masculinity brought back into fruition too. Finally, don't include a fellatio scene with a cucumber just for kicks. It utterly feels like witless filler.<br><br>Anyway, the flick dons effective use of Austin, Texas locales and a whiff of the city's legendary music scene. However, \"Animals\" makes you want to avoid certain parts of that freewheeling borough in the long run. In veracity, words like uneven, honest, tiredly manipulative, and doleful are what I'd use to describe Social Animals.<br><br>Director Theresa Bennett (this is her feature film debut) crams several, daft relationship stories into ninety minutes but her main focus is on sad sack Zoe (mentioned earlier). Zoe is a woman who is late on her rent, lives in an RV, and owns an unsuccessful waxing outlet. She's single, almost broke, and smokes pot whenever an average occasion arises. Zoe out of boredom or sheer desperation, befriends a friendly, loser married guy and has an affair with him. <br><br>\"Animals\" despite its decent performances and its effectively rundown, suburban inhabiting, never fully finds a coherent tone. With its Gen X careening, its woe is me dialogue, and its need to include animated illustrations of sexual innuendo, Social Animals might have been germane say, fifteen years ago. Oh and one more thing, what does the title of this movie mean anyway? My rating: 2 stars.","user":"burlesonjesse5","rank":[7,9]},{"title":"Awful","rating":3,"date":"27 February 2019","review":"Don't think there was one worthwhile moment until this film. Not funny, not dramatic I question just why it was made.","user":"muamba_eats_toast","rank":[4,5]}]