[{"title":"unique take on sci fi.","rating":8,"date":"7 April 2017","review":"great to see the clips form social media come to fruition in the film. awesome camera-work, acting and story. did a great job of tackling a big idea and keeping it intimate within a small group of characters rather than the story being a global, world ending, city destroying cliché that is much too saturated. this lends itself to keeping the info conspiratorial and privy. I believe this angle is why the characters are relatable. IN addition, a good use of the power punch. you see too often a super strong character punching an opponent across the room and it just looks like they are on wires. Agent accomplished this technique while making it not overdone and much more believable. cheers to the cast and crew, cant wait for the follow up!!","user":"ninosboombox-59596","rank":[69,83]},{"title":"not bad!","rating":7,"date":"6 April 2017","review":"OK, I saw the trailer. It was good, but I was hesitant because it might have all the best stuff, and nothing in the movie. But I bit anyways.<br><br>I wasn't expecting much honestly, but I liked the characters enough, they felt real. I'm a consultant, so the Seth character was spot on...haha. Loved the frequent flyer joke.<br><br>The film starts out as a bunch of friends, and then takes a serious turn with a lot of guns, fighting, action, and...mythology.<br><br>I saw the movie with my wife one evening over wine, and it was refreshing and fun.<br><br>Did some research on the filmmakers, and I'm a fan! Enjoy!","user":"patricenicolas","rank":[65,79]},{"title":"Really good sci-fi indie","rating":8,"date":"6 April 2017","review":"I enjoyed watching this film. It took its time in setting up the characters, but once it got going, the action and intensity erupts. I love guns, so I was already hooked after watching the trailer and found that the action was above par.<br><br>I'm interested to see more of the conspiracy! Yum!","user":"noelgermain","rank":[60,73]}]