[{"title":"What other guys?","rating":4,"date":"13 October 2018","review":"A psychologist (Mike Stanley) who helps PTSD patients is kidnapped by a vet (Todd Bruno) and his female friend (Aniela McGuinness). He is tied up in a basement and tortured into a rape confession. The psychologist is very credible and the woman making the accusations clearly has a faulty memory about everything. The viewer is kept in suspense until the end. <br><br>This was an interesting psychological thriller, but one guy saying, \"No I didn't\" while another saying \"Yes, you did\" for much of the film doesn't make for entertainment unless it involves senators. <br><br>Guide: F-word. Brief rape. partial nudity?","user":"nogodnomasters","rank":[3,3]},{"title":"Its bad","rating":2,"date":"2 October 2018","review":"No need to waste your time on this. Acting is bad. Story is bad. Rest is OK. Hence the 2.","user":"jeroendevrieslwd","rank":[7,10]},{"title":"Hellish confession","rating":2,"date":"4 December 2018","review":"Although the concept was far from an original one and had the danger of being very schlocky if executed wrongly, it was pretty intriguing at the same time and did have potential to be unsettling if handled correctly. Have an appreciation for films that balance horror, mystery and thriller. The cover looked creepy and grabs the attention. There was not an awful lot going for '3' otherwise but the potential was there.<br><br>'3' is a long way from unsettling and leans more towards the schlocky side of things. Will say right now that to me there are far worse films out there, both of my recent viewings and ever, and there are films that wasted their potential far more and to a worse degree (most of them though had potential that was bigger than that in '3'). This is not being said with any malice or prejudice, nor with any intent of disliking '3', part of me was really wanting to like it and hope that '3' would exceed my mixed expectations.<br><br>There is in '3' a spooky setting and moments of slick photography. Unfortunately that is pretty much it for the positives.<br><br>Going on the many negatives, the characters have no dimension or development to make them remotely interesting. Nor do they have any traits in making them rootable, the motivations are only bare bones and at times random and nothing more and the way they behave irritates and lacks logic. This does affect the acting which never rises above mediocre and is at worst atrocious. The victim fares least badly because there was some effort but too many parts are either overplayed or anaemic, never believed or cared for his plight.<br><br>Furthermore, '3' is directed with little enthusiasm and no tension and the script, especially the heavy emphasis on the back and forth, is needlessly repetitive, not interesting at all and very silly and stilted. Worst of all is the story, on top of dragging in pace and being contrived there is nothing remotely scary for the horror element to convince (not to mention the randomness of some of it, the gratuity of some of the content and there is a complete lack of creativity), it is sorely lacking in tension and suspense to be thrilling (the dragging pace killing it) and the mystery is really not much of one.<br><br>Overall, very bad. 2/10 Bethany Cox","user":"TheLittleSongbird","rank":[4,5]}]