[{"title":"May the Fear be With You","rating":5,"date":"7 March 2018","review":"Today people tend to claim a movie is a masterpiece and cinematic triumph or it is a total disaster, the worst movie I ever watched etc. The Midnight Man imho does not belong in either category, it is a small horror movie with a story-line based on a game that evokes a dark, evil entity and the price of the game is one's life and if one loses the game you get a fine cruel death. (Well, some dark souls could rightfully argue that a cruel death is still a kind of good reward, because, you know, who wants to die a common, total boring death!?) <br><br>So, in short, for sure there is nothing new in the western front, but what we get are decent actors (Lin Shaye, Robert Englund, also the young actors do not disappoint) and a good production value with some nice value of gore and splatter and a good, dark atmosphere and a very bad guy. <br><br>Yes, this movie is no Oscar material or made to be someday called cvlt, but The Midnight Man is a pro made movie and imo for the aficionado of horror a good snack in-between. My rate 5, maybe a 6.","user":"Tweetienator","rank":[17,21]},{"title":"Do not waste your time","rating":3,"date":"7 July 2018","review":"I had no expectations going into this movie and was still disappointed. Biggest caveat is there were zero reasoning or purpose for the characters to even start the process. You would think that after a movie like 'Cabin In The Woods' that horror directors would step up their game to ensure that they are not just an unintended parody of themselves. But alas, must not have gotten memo.<br><br>Main actress unable to act...check\nDumb boyfriend/husband that goes along without questioning...check\nLeft alone in dark room....check\nHaving non-nonsensical conversation while someone is trying to kill you...check\nDo not run away when trouble arrives...check<br><br>By the time this movie ends you no longer cares who will make it or not.","user":"elliotte2","rank":[14,17]},{"title":"It does what it is supposed to do.........","rating":7,"date":"3 February 2018","review":"What is the mark of a good horror movie (hell, a good movie PERIOD)? Does it pull you out of your shitty reality for a while and entertain the crap out of you. That's the formula. In that regard, I have no complaints about \"The Midnight Man\".<br><br>You have Robert Englund and Lin Shaye together again. He is mesmerizing as always and she is creepier than the titular Midnight Man himself. You can't go wrong there. <br><br>Are there plot holes and times when the suspension of disbelief wavers a bit? Sure. However, they did such a good job with the atmosphere and effects, generally speaking, that you really don't get too put out by this. At least, I didn't.<br><br>I have no reservations about recommending this one. It's worth an hour and a half of your life.","user":"BigDaddyStuMonroe","rank":[28,39]}]