[{"title":"Great practical effects, not so great acting","rating":6,"date":"1 June 2018","review":"Many gruesome &amp; graphic deaths. The creature was brutal, and the practical effects for it and its killings were very impressive. It could have sacrificed some gore in place of some suspense though.<br><br>The main characters were a bland couple, and the acting wasn't great there. At least the hunters were funny at times, and the sheriff was quite likable.<br><br>The plot was fairly basic, but that was fine by me. They established the couple's back story efficiently and had them in the midst of things before I knew it, which I appreciated. However, although it picked up fast, it didn't really pay off. The third act seemed a bit dragged out.<br><br>Still, it was enjoyable enough.","user":"CorpusTristis","rank":[17,18]},{"title":"The kill scenes r the highlight, the film starts well, goes full rampage in the middle with solid kills but lags during the end. Enjoyable film for horror fans.","rating":7,"date":"6 May 2018","review":"Saw this on a pirated dvd. The director is the man behind the special effects of Spiderman, Jurassic park, Death sentence, Alien vs Predator.\nSo obviously there gonna be some good kills n yes the kill scenes are the dominating factor. The Sasquatch face when it opens up its jaw is more like predator.\nThe character development is good, the cinematography is striking. The wide shots of the forest, the road n the river is striking. Thankfully none of the kill scenes r shot in the dark.\nComing to the bad things, initially when the couple is standing out of the car to see the injured man, the lead actor is hit by some stones n he falls into the river. After being rescued by his wife, our guy forgets everything about the pelting stones. Mayb temporary amnesia. Lol.\nDuring the kill scenes, the big foot spares or misses killing the lead guy n he is being rescued n healed by some witch doctor who looks more scarier.\nNo background story about the witch.\nThe sheriff n the guy goes to the forest to rescue our heroine n it takes helluva lot of time for the big foot to fight our guy. \nThe final confrontation is laughable, our guy fighting the big foot. Lol.\nThe ending was predictable for me.","user":"Fella_shibby","rank":[39,50]},{"title":"Surprisingly well made","rating":5,"date":"2 May 2018","review":"I have to disagree with the two reviewers who think this is rubbish , its actually quite a well made film and the special effects / makeup is pretty damn good for a low budget movie - easily Stan Winston level of 80's makeup and monster effects.<br><br> Patrick Magee is a name to watch out for as he wrote, produced, directed and did the special effects - usually I would cringe at that as no one ever can do all these things well and it usually means the film is going to be utter pants but i was wrong on this occasion - You can clearly see that the guy is actually interested in making horror and seems to like the werewolf genre - well done sir!<br><br>Hollywood should give this guy a blockbuster to direct and I bet he would make a better movie than any of the big names are doing now having just watched the awful Jurassic World and the rest of the duff movies coming out of Hollywood this year!<br><br>The problem the film has though is the poor acting and it is just not very scary.<br><br>I did like the addition of the old mediaeval hag/witch - very unusual and seemingly out of place as was the Indian hunter lol but it gave us a few laughs which is not a bad thing these days.<br><br>If you are into your horror in a big way then this will pass an evening but its just not very scary even though the gore quotient is quite high and well done - loved the chin ripping move; only seen that once or twice before and quite gory but as I said its just not scary and that's what kills the film and leaves it in the 5/10 average shelf! Its such a shame as Patrick Magee seems to have a high level of talent judging by his first movie!","user":"omendata","rank":[32,41]}]