[{"title":"Just a couple of pointers to IMDb","rating":7,"date":"8 June 2018","review":"Just pointing out IMDb's classification genre as adventure, drama. There is no adventure at all but a heck of a lot of well-acted drama. Secondly, plot synopsis \"Sisters in conflict travelling through Europe toward a mystery destination.\". Well, there is a tiny bit of travelling (car trip), but not through Europe and the mystery destination is arrived at about 15 minutes into the movie.<br><br>Not giving anything away here but I thought it was a well-acted drama on a contemporary and, for some, controversial subject. I \"enjoyed\" it but it might not be everyone's cup of tea.","user":"ronwalboom-08814","rank":[56,67]},{"title":"Deep Meditation on Life and Mortality, Amazing Actors","rating":8,"date":"21 October 2017","review":"\"To be one with the night,\" said the poet Gunnar Ekelöf \"one with the crowds of flowers leaning out of darkness to listen to something I had on my tongue to say but never got said.\" Two sisters aim to get this chance, this moment together. Emilie is an extrovert, a New York photographer, and Ines is her polar opposite. They drifted apart in their adult years and Emilie is trying to pull them back together again with a mystery, luxury trip she is paying for deep in Eastern Europe. Ines agrees to go, yet comes to regret her decision when Emilie insists upon confronting their shared past and altering their future. <br><br>This deep meditation on life and mortality explores the nature of honesty and trust. It encourages us to live authentic lives, keep an open perspective and release internalized feelings. Actors Eva Green and Alicia Vikander are amazing, as is the supporting cast. I immensely enjoyed the classic introvert and extrovert clash. Even though it is a Swedish film, the actors speak English throughout. The soundtrack could have been better. Seen at the Toronto International Film Festival.","user":"Raven-1969","rank":[39,64]},{"title":"Family reunion","rating":10,"date":"11 September 2017","review":"Just out of the TIFF's world premiere of Euphoria, starring Alicia Vikander and Eva Green as main protagonists, two sisters vacationing for an unusual family reunion. This is a challenging movie to describe without spoiling it, but spoiling it is destroying its appeal, so I will just say that the actresses will take you on a roller-coaster of emotions, the cinematography is majestic, the supporting cast is full of surprises and that its subject is treated with an unusual mastery. The feminine touch of the director transpires everywhere in the movie, which gives it an unusual tone and daring sensuality. A fantastic movie to see absolutely!","user":"laurent-milot","rank":[44,75]}]