[{"title":"What a waste of acting and creative talent...","rating":2,"date":"21 May 2018","review":"\"Ismael's Ghosts\" (2017 release from France; 135 min.; original title \"Les Fantômes d'Ismaël\" ) brings the story of Ismael. As the movie opens, we follow the conversation among several bureaucrats at the Ministry of Foreign Affairs about the mysterious disappearance of a certain Ivan Dedalus, who had just started his career there. As it turns out this story is being developed in the mind of Ismael, a film maker. We get to know Ismael, as he carries on with his girlfriend Sylvie. We learn that Ismael's wife Carlotta, who mysteriously disappeared 20 years ago, and Ismael had her officially listed as \"missing\". Then one day at the beach, Sylvie runs into a woman she thinks is Carlotta... IS it the real Carlotta? how will this affect Ismael? and what about the movie-within-the-movie? At this point we are less than 15 minutes into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is the latest movie from director (and co-writer) Arnaud Desplechin, whose previous movie was the likable \"Golden Days\" (original title \"Trois Souvenirs de ma Jeunesse\"). Here, Desplechin rides several parallel story lines: the complicated life and relationships of Ismael, whether or not the real Carlotta has come back, and the movie-within-the-movie. It should make for an appealing mix, but alas, you might be wrong. First of all, I just don't \"get\" the point\" of the movie-within-the-movie, which simply doesn't seem to have any connection with the real movie--and if it does, I completely missed it. Second, the relationships that play out between the three main characters never came across as genuine or believable. And that is a darn shame for Charlotte Gainsbourg (whom I otherwise absolutely adore) in the role of Sylvie, Marion Cotillard as Carlotta, and Mathieu Amalric as Ismael. I mean, those are top notch names, but even they cannot save this movie. Bottom line: \"Ismael's Ghosts\" is a giant waste of acting and creative talent.<br><br>\"Ismeal's Ghosts\" premiered at last year's Cannes film festival, to ho-hum acclaim. Almost to the day a year later, the movie opened at my local art-house theater here in Cincinnati. Truthfully, if it weren't for the fact that this stars Charlotte Gainsbourg, I doubt I would've gone to see it. As it was, the Monday early evening screening where I saw this at was attended poorly (3 people, including myself), and I cannot see this playing longer than one week in the theater (at least here in Cincinnati). I encourage you to check it out, be it in the theater (not very likely at this point), on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion.","user":"paul-allaer","rank":[11,13]},{"title":"Top actresses lost in messy screenplay","rating":4,"date":"30 May 2017","review":"The basis for a good film is always a good screenplay. Because the screenplay of 'Les fantômes d'Ismaël' is a mess, the film is a failure. What is undoubtedly meant as an intelligent multi-layered story highlighting the many aspects in the life of a film maker, is in reality an incomprehensible hodgepodge of subplots going nowhere.<br><br>Right from the very beginning, the viewer is confused. The first few scenes are not scenes from the film we're watching, but from a film within the film, which is being shot by lead character Ismaël. The main plot item, however, is the return of his wife, who has been missing for 20 years and was presumed dead. This in itself can be fine material for a well-acted drama, exploring the way the husband, his girlfriend and his long lost wife cope with this new situation. With multiple award winning actresses like Charlotte Gainsbourg and Marion Cotillard on hand, this would seem to be the most logical option.<br><br>Instead, the viewer is offered a myriad of increasingly complicated side-stories, flash backs and dream-like sequences, culminating in a laughable scene of the tormented film maker shooting his own executive producer by accident. I have no doubt this film tries to make a point, but I'm afraid only the director knows which one. Unless you're a fan of French pseudo-intellectual art-house dramas, this film is to be avoided.","user":"rubenm","rank":[28,40]},{"title":"I have never seen so many people leave the cinema","rating":4,"date":"17 March 2018","review":"As many have said, the premise of this film is very good, but it is lost in a mess of structure that would shame must university film society. It is a number of stories within a story, which lose momentum as the film continues. The main plot is the sudden reappearance of a film maker's wife after an absence of 21 years, but this is submerged by unnecessary interludes.<br><br>I watched the film at the French Film Festival in Sydney, and throughout the film people trickled out, not returning. What kept me was the excellent acting as ever from Cotillard and Gainsbourg, but you honestly wonder why and how they signed up for such a messy screenplay.<br><br>If this film was a blind date, it would talk erratically at you for nearly two hours, then leave abruptly for no reason. Avoid.","user":"jdrennan13","rank":[12,17]}]