[{"title":"Skip the movie and read the book.","rating":5,"date":"24 April 2017","review":"If I hadn't read the well-written book, I would know less about the Lacks family, Henrietta in particular. In this movie, Henrietta the woman doesn't seem to be the central character.The movie introduces the family and concerns itself mostly with their intense anger at Johns Hopkins for being kept completely in the dark about the research. Thank goodness for HeLa cells, even though no permission was granted because, at the time, it wasn't the norm to ask.The movie's resolution was unsatisfactory for me, but Oprah gives an intensely personal performance as Henrietta's daughter Deborah and will probably be nominated for an Emmy. I had never seen Rose Byrne in a movie or TV show, but I thought she did well as Rebecca Skloot.","user":"carolerj","rank":[21,23]},{"title":"Movie was good, but book was better (as always)","rating":7,"date":"25 April 2017","review":"I watched the movie over the weekend, and while I LOVE the sheer fact that they even made a movie about Henrietta and her family's life, I have to say the movie didn't have as much of an emotional impact as the book did. To me the movie is more of a big long commercial for the book. A way to reach a broader audience and get more people interested in who this women was and her role in modern science. Also, to know how her family had to deal with the hoopla about her cells and being taken advantage of every step of the way.<br><br>First, the movie was not bad. I liked Oprah as Deborah (love it even more knowing that Deborah was a huge Oprah fan, and would've been ecstatic to meet Oprah, let alone have her portray her in a movie). The actors portraying the family did very well with what they had, and the movie covers a lot of the key points from the book. I also loved the flashbacks of Henrietta before she was sick, and seeing her with young Deborah was very touching.<br><br>However, the biggest problem I had with the movie is that it felt it was very rushed, almost incoherent. Now I understand that could have been deliberate, with especially with the jazz infused intro and Deborah's chaotic personality at times, but I don't think it helped give the audience much time to really feel empathy for the characters. Thank God I read the book and know how all of this effected them in detail, because in the movie, you feel almost nothing for them because nothing's explained very well, and you barely had time to process who each were, and what their mother meant to them. Each scene rushed you to one point of the story to the next. We spent the most time with Deborah, who obviously was the main family member who wanted to know the most about her mother. It was her and Rebecca who did all of the foot work in terms of researching what happened to her mother and her older sister, Elsie. But, in the movie they barely touch on why she was so paranoid. For most of the movie, you're just wondering what the hell is wrong with this woman? There's hardly any empathy for her. Then there's the climatic scene at her cousin's house. This was such an intense emotional scene in the book, especially finding out that after that moment, Deborah was on the verge of a stroke. Knowing this further explained her erratic behavior and the emotional roller coaster she'd been on with her mother's cells. But in the movie, they just rushed through it without giving any context as to why this particular moment was so crucial to her story. Plus, the scene was lackluster at best, zero emotional payoff, did it no justice, and my biggest disappointment from the movie.<br><br>Overall, I HIGHLY suggest reading the book. I also, suggest listening to the RadioLab podcast episode about the book as well. Not only does it go into more detail about the impact of HELA cells, there's audio footage of Deborah, Rebecca, and that night at her cousin's, which gives that scene even more emotional weight listening to actual footage. The book goes into so much detail on not only Henrietta's life, but the trials and tribulations of her children and what they went through all those years dealing with all the excitement about her cells. Furthermore, it gives more detail as to WHY John Hopkins and other scientific entities never gave compensation to the Lacks family. The \"why\" part is just as complicated and important as the story itself. Whether you agree with it or not, it's still very fascinating story.<br><br>Regardless of how good or bad the movie is, I'm happy Henrietta, Deborah, and the Lacks' family story is being told and they are getting the recognition they deserve. I think it's important to at least know who this woman is and to honor her. As the movie and book pointed out, there's not one person on this planet that hasn't benefited from HELA cells in some way. I know I have, so I say thank you Mrs. Henrietta Lacks.","user":"AndromedaCeline","rank":[20,23]},{"title":"Not very Good","rating":1,"date":"24 April 2017","review":"After having read the book and suggested this book to a lot of my friends. I was happy to see it become an HBO film. I just finished watching it and I all I can say is read the book. The story line does not even break the surface of what her cells did to help create cures for. It seemed to be more focused on Oprah's character then Henrietta's story. Not surprising since Oprah was behind the making of this film. I was really hoping this was going to be a good show but sadly it turned out to be really bad","user":"gobux15","rank":[31,38]}]