[{"title":"Not bad","rating":7,"date":"16 April 2018","review":"This was an amusing little story about family, complacency, dealing with loss (or not), moving on and redemption, couched in jokes and likable characters. It wasn't a must see film, but it wasn't bad either. I didn't feel like I wasted my time like with some movies, but I think the cast is what made it worth seeing. <br><br>Jermaine clement is great as always, and it was interesting to see him with an American accent. Elliot Gould did a fine job as the dad who's constantly telling corny jokes, and it was also nice to see Annie Potts in the first thing I've seen her in since Ghostbusters.\nAll in all, it was a decent film, with humour and some heart.","user":"spmact","rank":[10,10]},{"title":"Little gem","rating":8,"date":"1 July 2018","review":"The first thing I would say about this film is .. that I liked it!..which is quite a rare thing these days. It is a slow burner that turns into a little gem. It is actually laugh out loud funny at times which is very rare for a modern comedy film ranging from gentle humour to fairly blunt and direct stand up Jewish jokes.There are some intelligent and caring points made about generational differences, family, success and failure and life in general ... nothing completely new and which has not been covered in other films but put together in a very original and charming way by the very talented writer/ director Sam Hoffman. Jermaine Clement excels as the very dry down at heel playwright and is ably supported by a great supporting cast including veterans Gould and Neuwirth. Recommended.","user":"andyge","rank":[7,8]},{"title":"Cute rainy day movie","rating":6,"date":"23 June 2018","review":"This movie is a lovely tale about a man who finds new meaning at a low point in his life when he's forced to move in with his widowed father, who now lives in a retirement community. The casting is fantastic, it's full of \"dad\" jokes which people will either love or hate, and it has a lot of heart.","user":"the_daria","rank":[5,6]}]