[{"title":"In fond memory of Sridevi, a powerhouse actress in her screen farewell","rating":7,"date":"3 March 2018","review":"Words could not express the shock and disbelief that I felt upon hearing the sad news of Sridevi's sudden and untimely demise. It's still hard to believe that this beautiful woman, who was only 54, looked so much younger, and whose graceful presence and impeccable talent have been an integral part in the lives of so many lovers of Indian cinema, is no more. That's what made me watch this movie right away. We had planned to see the film before; little did we imagine that it would inevitably become her last film which would be watched after her passing.<br><br>Mom is a very nice thriller, very well thought of, written and directed. It's a little too dramatic at some points, but everything is within context and is not overblown. There's no need to give away any sort of details about the story and the proceedings, but one thing, as expected, remains its central force, and it is of course Sridevi herself, and her astounding performance. Sridevi had a vast career graph, with films in many languages, among which sadly not many were great masterworks. Her extraordinary, intense acting talent had always transcended the quality of any film she was in, however, and Mom, while a very good film in and of itself, is no exception in this regard. Her Devki is an amazing portrait of quiet determination and exhilarating strength. Just see the scene when Devki is notified of her daughter having been raped. This act brings back, just for one moment, the uninhibited, trademark Sridevi style that people love to see and probably not expected in an otherwise restrained portrayal. Her full-outburst reaction shows, for the umpteenth time in the career of this gifted actress, her ability to perform the most difficult scenes with ease, full authenticity, and the most alarmingly intense levels of expression. The great thing about this performance, however, is that it is not just a performance of great moments - her overall character development is the great moment itself, and her presence alone speaks volumes. She is real, genuine, and plays the most basic and casual bits with amazing depth and conviction, which never take away from her cinematic appeal. She was a true master of her craft in terms of commanding the attention of her audience at any point.<br><br>Twenty years ago, Sridevi, who had by then long been arguably one of the most hard-working and prolific actresses in India, retired from films to devote herself to her family and to being a mom. It's so ironic that her last, full-fledged film appearance ended up being this film, simply titled Mom. It's a little comforting that her screen farewell is such a nice film. This, along with her previous venture, English Vinglish, are the two ultimate, memorable goodbye presents Sridevi gifted her fans with before leaving, just to seal the illustrious list of films in her impressive career. Long live Sridevi, may her remarkable legacy in cinematic history live on forever in the hearts of anyone who loves films and appreciates true acting talent.","user":"Peter_Young","rank":[18,20]},{"title":"mom is not a word its an emotion best of 2017","rating":10,"date":"14 July 2017","review":"Mom is not just a word it's an emotion and this movie was successful in portraying the extent to which a mom can go to save her child....Movie is bit intellectual,dark but emotional and u can't blink throughout....Sridevi is outstanding and her performance is soul touching....Nawaz and Akshay Khanna r adequate and lend a good support...Hope people will watch such movies instead of trashes coming out every week....Overall this movie is a must watch and eye opener for everyone....It's a no nonsense movie unlike those movies in which one hero fights with ton of villain....Final word awesometacular👍👍👍10/10","user":"rkap121121","rank":[15,20]},{"title":"A Good Movie","rating":8,"date":"9 April 2018","review":"Very nice effort by director Ravi Udyawar. It is one of the most sensitive and realistic Hindi movies that I have seen in a long time. Almost all the actors have done justice to there roles. Sridevi as we all know was an amazing actress and she did an excellent job once again. Nawazuddin appeared in a cameo all did very well, but the most impressive of the lot was Sajal Ali, she was exceptional with her expressions sometime she did not even speak but her eyes tells the pain and anger that she was going through. Adnan Siddiqui also was impressive.","user":"kashifsaleem-21036","rank":[6,7]}]