[{"title":"Solid script, good acting by the lead male actor.","rating":10,"date":"15 September 2017","review":"Kishen Mohan Girhotra (Farhan Akhtar) is a young man who belongs to Moradabad, a city in Uttar Pradesh. One fateful day, Kishen gets accused of murder which lands him in Lucknow Central Jail where he's awaiting his High Court trial for a death penalty. Gayatri Kashyap (Diana Penty), a diligent NGO worker, is compelled to form a \"Band of Prisoners\" for the band competition which is to be held in the dreaded jail of 'Lucknow Central' that year and this is how Kishen's and her paths cross. Kishen befriends four other inmates........","user":"Takethispunch","rank":[11,16]},{"title":"Watch it for the climax","rating":6,"date":"17 September 2017","review":"Lucknow central is a very well directed film though the storyline is very thin, the movie very quickly escalates and takes you right into it but then that is that. Next 2 hrs the movie remains with the same pace until the climax sequence again which will have you at the edge of the seat. <br><br>Pros : Direction, Farhans acting ( one man show ), music ( Meer-e Kharwaan especially), Climax.<br><br>Cons : Thin story line, needed more nail biting scenes since its about a JailBreak, too many talented artists did not get the room to do much ( Daina penty was amazing in whatever little she had, Deepak dobriyal, Rajesh sharma ) except Ronit Roy who was fab but his portrayal reminds you of all the films that he acted in till now.","user":"soumithpotturi","rank":[6,8]},{"title":"A rare find in the recent bollywood releases! Must watch!","rating":9,"date":"22 October 2017","review":"I am not a professional film critic and hence will not launch into often used adjectives utilised to showcase technical knowledge of film making etc. I am from the core movie watching audience,so will use the language common to that category. <br><br>A gripping feel good movie that you can watch with the family. Powerful performances by all. I wonder why it has not done that well in the commercial segment in mumbai at least...according to me..its one of the best movies in the recent past. And stands tall in the crowd of recent big banner flops. I loved the sets, and the songs..Rangdhari..and the competition song with a twist. The casting so spot on! <br><br>Trust me, go watch this movie...your time will be well invested. Its rare fresh story for a bollywood hit movie. I hope they come out with more such surprise movies. This should have been a runway hit and a crowd puller!","user":"hrhkalways","rank":[4,5]}]