[{"title":"A great movie, a great director, and great performances.","rating":8,"date":"6 April 2017","review":"It's hard to even talk about LGBT matters in a country like Chile, so is exactly right there the significance of Sebastian Lelio's work. The characterizations are so well performed by the actors and actresses, that you can feel the anger and frustration of Marina, the love that Orlando feels for her, the everyday struggle of Marina in a society that rejects her sexuality, the hate from Orlando's family, etc.<br><br>Is necessary a movie like this, is necessary a more open-mind society, is necessary to stop discrimination, is necessary to stop the hate.<br><br>A fantastic woman, is ready to show the audience that there is no differences between a transgender person and a heterosexual one, the strong main character of Marina, will make you feel her never-ending fight to gain some respect, and how bad we, as society, make her feel.<br><br>Thanks to Sebastian Lelio for bring this taboo to the light. Excellent work.","user":"claropa-295-807524","rank":[76,110]},{"title":"Moving, Confronting, but not without its flaws","rating":7,"date":"25 March 2018","review":"A Fantastic Woman is a very simple film, far more simple than it initially appears. Essentially the story boils down to this: A transgender woman has to deal with the family of her lover after his sudden and unexpected death. The film deals with themes of transphobia and grief, and it explores those particular themes very well, in some very confronting and uncomfortable ways, but from a story and character perspective, this film often leaves a lot to be desired.<br><br>Marina, the titular 'Fantastic Woman', is defined purely by the fact that she's transgender. This isn't a big flaw per se, as the film is explicitly about how the culture of Chile and the world at large responds to that fact, but she doesn't really have much character besides that. She's a singer, she boxes, and she's very driven to get what she wants, despite the high amounts of adversity she faces throughout the film. The driving force of her character is her desire to pay her respects to her dead boyfriend one last time, while his family refuses to give her that, seeing her as a shameful part of his final moments, best forgotten. She isn't given that much development besides that, and it leaves us with a very one, maybe two-dimensional character with no real flaws that have consequences within the story.<br><br>However the main issue I have with the film is that it basically abandons several plot threads as it goes along. Early in the film, there is some suspicion of foul play surrounding the boyfriend's death and she, being the last person to be with him, is the prime suspect. However this is mostly abandoned after one particularly uncomfortable scene where she is forced to have a physical examination by the detective and a doctor, which after its conclusion is basically hand waved away without much further thought. It is not brought up again (to my recollection) as to whether she is still seen as somehow complicit in her boyfriend's death, or whether the police decided to abandon the case altogether.<br><br>Another plot thread that seemed to be abandoned is the entire opening scene, where it establishes the couple's relationship before the man dies, where he mentions buying tickets to see a famous waterfall in 10 days time, but has misplaced the tickets. To my memory, she never finds the tickets or goes to the waterfall to do anything after the conclusion of the movie. It just seems like another missed opportunity for further development.<br><br>I do want to make clear though, that I do think this film is still worth watching. Transgender characters are still relatively rare in film and television, and even when they do pop up every now and then, they are often portrayed by non-transgender actors in heavy makeup. However Daniela Vega is herself transgender, and she plays the role, limited as it is, incredibly well. The cinematography is also quite beautiful, and there are several visual setpieces that looked great (while not really serving much purpose to the plot) It's definitely something worth watching on the big screen, but I probably won't put it on for a second time.","user":"seige-hound","rank":[24,33]},{"title":"Not so fantastic after all","rating":6,"date":"29 July 2018","review":"The story is not bad at all though somewhat odd. A middle aged man and a transgender woman much younger than him fall in love with each other and even plan to live together. However during a night when they were in bed together he falls suddebly ill and ends up by dying in hospital. This pulls her down heavily and besides that she has to face the aggressive hostility of his family that tries to force her to keep away from everything related to him and even not to attend his funeral. This atmosphere creates a series of ugly incidentes some of them shown in a bit confused scenes some real some imaginary. A movie that can be seen although not too enthusiastically.","user":"valadas","rank":[9,11]}]