[{"title":"the best slow paced film seen for a long time","rating":10,"date":"4 March 2019","review":"Actually and perpetually, its a film that i think will suit us that has passed the roariong 40's and are well into the 50's and 60's years of age.<br><br>its a family drama, quite a hilarious one, but without the laughing fun, just the true spark of giglish humour that sinks in well after watching this drama. so if your in for practical jokes ,then just forget it.<br><br>do take the role as the fly on the wall, like i feel i did, and watch the story of turmoil and wash-up of an architects family, his children, all of his wifes, which have given him a C to C scalespangled sons and daughters who are halfsiblings en masse'.watch the hate and discontent between them and towards their father, their jealousy that has been there for ages, just to assemble in their fathers house to make or break a fortune, by pretending to be the sole heir of the lear fortune.<br><br>i cant tell more than this, just adding that there are many more twists up the sleve and that you will either way feel recognition towards the subject.\nas it is the final check of the familys check account, the greed of hope and wealth mfor rich and for poor, are the same wherever your are on this stoned organic planet of ours.<br><br>acting.....GOOD.....to see anthony michael hall again was a joy, i would never have rekcogned him if i hadnt chekced the cast, and he has become the spittin' image of me actually, aw may gowd, you might say, so when i say that bruce dern has become the spittin' image of my for many years deceased dad, youll say STOP!!!!! but it is so , in fact its true, and the destiny of this film is that its made the way that everybody can reflect yourself in the characters of the movie. watch the movie and think for yourself....''thats like my brother''-''sister'',-''father'',-''stepmum'',-''inlaws''. so dont say im the fool cause ive announced the reflections of mine....<br><br>as a film product the filmatography are very strong, editing are top shelf,choice of music perfect but the sound work glitches inbetween f.i dialouges in the car. the panoramic views og the malibu mountainside and the seashores of L.A.-area are tremendous.<br><br>its a slowpaced but lovely drama, that kept the grumpy old man stay in till the end, very recommendable.","user":"ops-52535","rank":[2,4]},{"title":"Very Long, Very Slow, Very Boring","rating":1,"date":"3 April 2019","review":"Very long, very slow, very boring. Not much of a point to the whole movie. Nothing deep nor moving.<br><br>Not much else to say.<br><br>I really like Bruce Dern. Even he could not save this one. Although some of his acting parts have been small they have been outstanding but it seems as time goes on he has been in one stinker after another. What's happening Mr. Dern?","user":"kq999","rank":[2,7]}]