[{"title":"Beast, as the name suggests, is a ferocious psychological indie thriller.","rating":8,"date":"1 May 2018","review":"Also named 'Jersey Affair' in certain markets (God knows why, sounds like an American sitcom), is another indie film that not enough people are watching. I went in knowing absolutely nothing. No trailer, no reviews, no ratings...completely blind. A damn good choice if I do say so myself, should do it more often. An odd pair of lovers embark on a vigorous journey of self-discovery where a serial killer hunting young girls is looming on the island they reside in. A rather tantalising and powerful drama that encapsulates the empowering inner rage that takes control of our innocence. Further illustrating the beastly presence within us as this small community are in the midst of a horrific crime. Paranoia, self-control, authority, a psycho-semantic thriller that really left me gasping for air. The heightened nature and attitudes of all the characters is intricately portrayed. At first you may succumb to the initial innocence but then their true animosity comes through. Extremely well crafted and beautifully directed by Pearce who utilises the scenery to add emphasis on the engrossing performances. Buckley was electrifying as a 27 year old woman who is still under rule from her mother who's authoritative command enables her to break away from the family. It's somewhat uncomfortable, which really took me by surprise. The focus on the relationship rather than the crime was paramount in building essential character development. Whilst this did shift during the third act, it was maintained constructively throughout. Some scenes were riddled with ambiguity, such as the funeral, which left me intrigued rather than perplexed. I bought into the psychology of the main character. The ending was slightly underwhelming, I wish they cut the final ten minutes and left them walking into the distance. Also some scenes had horrific natural lighting which was just too dark. However, this was a captivating thriller that both mentally stimulated my mind and made me emotionally involved. Definitely check this out!","user":"TheMovieDiorama","rank":[65,86]},{"title":"Nature or nurture?","rating":8,"date":"18 April 2019","review":"'Beast (2018)' is about toxic relationships, in all their forms: with your lover, your mother, your father, your siblings, your ex, your town, your past, your nature, yourself. Moll, brilliantly and subtly portrayed by Buckley, is caught in a tangled web of manipulation, mistreated by pretty much everyone in her life. The film, essentially, chronicles her growth from timid and trampled-on to uncaged and triumphant (in a counter-intuitive sort of way). She's certainly put through the wringer, pushed to her very limits and then pushed passed even those. Someone almost unrecognisable emerges from the other side. Even though the contrast is stark, it's gradual enough that it makes perfect sense. Her transformation is incredibly satisfying, constantly moving forward and often taking unexpected turns. Of course, it's sparked by the arrival of Pascal, portrayed a little (though, somewhat appropriately) flatly by Flynn. He's an enigmatic entity that undergoes a number of shifts himself, which usually relate to how we perceive him. Since we're constantly in Moll's perspective, our opinion of the guy shifts whenever her's does but, even when she trusts him the most, you're not quite sure what to make of him. This keeps you on your toes and is helped immensely by the fact that the feature isn't predictable at all. The relatively unconventional narrative shifts around in unforeseen ways and makes a number of bold moves, especially towards its end. Its surprise third act is actually a delight, even if the end of the second act initially seems like it should be the plot's culmination. The movie often leans into its more horrific aspects by presenting itself as a horror, using music and atmosphere to create some really creepy sequences. It balances this well with its more conventionally romantic moments, which are actually just as creepy in retrospection, that do a good job of conveying the connection between its two focal characters. The whole thing is exceedingly thematically-rich and layered. Not only does it make you think, it actually gets under your skin. It gets in your head and stays there; it's a rewarding experience, for sure. It's a unique, mysterious piece that's engaging throughout. 8/10","user":"Pjtaylor-96-138044","rank":[14,16]},{"title":"Another Gem.","rating":9,"date":"8 September 2018","review":"You can always rely on the British to make great movies. There is just something about the landscapes , soundtrack and depth of it all, that makes you realize that you are watching quality. <br><br>I really enjoyed this movie. It was real and the acting was great. A dark tale of love , mistakes , judgements and the \" beast \" in all of us. I always gauge a movie on how long I think about it after it's over. This one had my attention. I think too many people go into the story too much and explain an opinion. I think if you lean a bit to the dark side of entertainment , take this one for a spin .","user":"saschultz-56208","rank":[32,45]}]