[{"title":"A quiet and intelligent film","rating":8,"date":"12 October 2018","review":"If you feel that your body holds two distinct personalities, perhaps one public and the other private, you are not alone. Many people display different sides of their personality at different times. For most people, however, the condition, what might be described as the \"Dr. Jekyll and Mr. Hyde\" syndrome, can be classified as being \"psychological\" in nature. In first-time director Bill Oliver's gripping fantasy Jonathan, however, the problem is definitely physical. As superbly performed by Ansel Elgort (\"Baby Driver\") who plays both roles, two brothers, John and Jonathan, each have distinct personalities but share the same body. Stabilized by a brain stimulation device that monitors their time, the two men maintain a rigidly controlled schedule that includes strict rules of behavior in order to survive. <br><br>Abandoned by their mother at birth, they are supervised by Dr. Mina Nariman (Patricia Clarkson, \"Maze Runner: The Death Cure\") who has studied the brothers since their childhood and is the author of an article in a scientific journal that describes their condition in detail. Alternating the hours when they sleep and are awake, Jonathan gets up every morning at 7 a.m., goes to work as a part-time draftsman in an architectural firm, then goes to bed at 3 p.m., getting four hours of sleep. At 7 p.m. John takes over his body and remains conscious for twelve hours, his entire life unfolding at night, barely seeing the sun during most of the year. Though physical look-alikes, John and Jonathan have different personalities. John is more casual and laid-back, more open with his emotions, and has a more vigorous social life. <br><br>Jonathan, on the other hand, is a more up-tight, straight-laced type whose hair is slicked back to give him the nondescript look of a business executive. To let Jonathan know what happened to him in the previous twelve hours, John leaves a video each night describing what he did during the time he is conscious. His talk normally consists of mundane activities such as shopping, paying bills, doing the laundry, and so forth, nothing very exciting to report in their circumscribed universe. Because we never see John outside of the video, however, we become more attached to Jonathan, though in truth, they are as dependent on each other as two people can ever be. For example, if John drinks too much or stays out all night, Jonathan feels exhausted and even hung over the next morning.<br><br>The brothers maintain the status quo until John breaks the rule that says that having a girlfriend is a non-starter. When Jonathan reports that he's been feeling a little tired of late, he hires an investigator (Matt Bomer, \"The Nice Guys\") to track John's night time activities and finds out that John has been secretly dating Elena (Suki Waterhouse, \"The Bad Batch\"), a young woman who works at a bar. Jonathan, furious over an action that he sees violates the terms and conditions that Dr. Nariman had set, presses John to end the relationship. Admitting his indiscretion, John is forced to explain his condition to Elena, sadly telling her that their relationship has to end. Though the air has been cleared, John becomes depressed, retreats into a shell and fails to respond to Jonathan's video messages. <br><br>To complicate matters even more, Jonathan establishes a relationship with Elena, straining his ties with John even more. It is only when a crisis point is reached that the only logical solution asserts itself. Jonathan is a compelling film but one that is hard to categorize. Though it has elements of science fiction, fantasy, and maybe even horror, ultimately Jonathan is more of a character study than anything else. Its focus is on the human element of the story and Oliver refuses to indulge in sensationalism or melodramatic plot twists that might appeal to a wider audience. It is a quiet and intelligent film that is basically about trust and the compromises required in sharing your life with someone you care deeply about. It is about loving people as if your life depends on it. In Jonathan's case, it does.","user":"howard.schumann","rank":[71,85]},{"title":"admirable work","rating":9,"date":"8 December 2018","review":"One of films who I love . Maybe, because, as schizoid person, I am not real far by the world of Jonathan. Or maybe because it is fascinating the manner to use the basic idea. A profound delicate subject and a seductive exploration of a dark and not comfortable universe. A film proposing only questions and no answers. Impecable acting and great story. A film about loneliness , with a precise target, in clothes of Sci . F., trip across a life who is not so different and who, in fact, represents, with the few nuances, the rule more than the exception. \"Jonathan\" is a great film not for the artistic and technical aspects but for the state after its end.","user":"Kirpianuscus","rank":[36,42]},{"title":"Original, questioning and strange","rating":7,"date":"18 November 2018","review":"It's not that often that I don't really know what to think about a movie.\nThe technical part is really enjoyable.\nThe synopsis strange and mysterious. We enter little by little, day to day, in the reality of Jonathan and we understand very slowly what this reality means.\nIt's dark. But not really sad.\nIt's complex. The movie doesn't try to simplify or over explain it, which is great. But also left me with too much questioning to be at ease. I don't know if the ending is great and really smart, or a bit dull.\nI don't know. And it's fine.<br><br>And perhaps this movie is great because of this: it leaves you with more questions than answers.","user":"funambuline","rank":[34,40]}]