[{"title":"It changes as it's twisted","rating":6,"date":"3 December 2017","review":"Greetings again from the darkness. Why is it that estranged mothers always seem to show up when we are frantically trying to clean up all evidence of a murder that took place in our apartment? OK, maybe that's not really a common occurrence, but it's certainly at the heart of this Hitchcockian psychological mind-bender from writer/director Rupert Jones. His brother, the very talented and always interesting Toby Jones, stars as the quiet ex-con attempting to get his life on track.<br><br>A pre-credit opening scene has Carl (Toby Jones) borrowing an uncharacteristically flashy (and quite hideous) shirt from a helpful neighbor for his date which was arranged online. After passing out on the sofa, Carl discovers his date Abby (Sinead Matthews) dead in the bathroom and flashes back to a brief moment of violence. Both Carl and we viewers are disoriented – a sensation that sticks with us until the end credits roll.<br><br>An ominous voicemail leads to a visit from Carl's mother, played by Anne Reid. What follows are Mommy issues galore (on par with PSYCHO in this department). Mother and son have irreconcilable differences over something in the past, but she clearly understands his 'tendencies' better than he does – especially those related to women, alcohol and violence. <br><br>Director Jones has a very interesting visual style, as well as a unique approach to story-telling. He expects commitment and attention from viewers, and rewards those who play along. Despite the claustrophobic feel of Carl's apartment, there are some creative camera angles to go with the imposing nighttime shots of the building's exterior. <br><br>The three main actors are all excellent. Ms. Reid is a screen veteran who has spent most of her career on British projects, and she excels as the slightly creepy, dominant figure in Carl's life. Mr. Jones and Ms. Matthews, as Carl and Abby, have one exchange that really stands out. Abby: \"You're a sneaky snake\" Carl: \"What do you think that makes you?\" Abby: \"Nasty\" It's such a raw moment, and a turning point (along with the voicemail) in their evening. Much of our effort goes into slowly assembling the pieces and clues that are doled out along the way, and it takes a sharp eye to catch some of them  while we are challenged by others to determine if they are dreams, or actual memories. A kaleidoscope changes color, shape and perception as it's twisted – just like this movie. It's a fun ride if you enjoy the twists and turns of determining which parts of a nightmare are reality and which parts are something else.","user":"ferguson-6","rank":[30,39]},{"title":"235. Kaleidoscope.","rating":8,"date":"10 May 2018","review":"Like Norman Bates and Buster Bluth before him the main character in this movie, Carl, has severe mommy issues. It all begins when Carl gets a date with a girl over the internet, and when they make it back to his pad, its when everything freaking weird starts, starting with a phone call from Mommy herself, we don't know the backstory, well, Carl does not want to see Mommy... we also find out that Carl does not drink because 'It sends him somewhere' and after his date promises to go looking for him and sneaks some booze into his drink, he promptly 'goes somewhere' and its morning, house is in shambles and oh yea, his date is dead in the upstairs bathroom, then... Mommy shows up. And we quickly see Carl is not exactly...hmmmm... sane. I of course really loved it because simply of the 'what the hell am I watching?' factor. Toby Jones is awesome as Carl, he's always good tho... And its written and directed by his bro Rupert Jones, and its all about Mommy issues, wtf happened in that household??? It reminded me of the movie Spider with Ralph Fiennes in a way...and that movie is spectacular by the way!! So this Mother's Day chill with Mom, and watch this one!! Filmbufftim on FB.","user":"tfminfl","rank":[13,16]},{"title":"Very good, under-rated","rating":8,"date":"1 July 2018","review":"Surprised by the number of negative reviews. It's a very good film with fantastic acting.","user":"fccs23521","rank":[7,11]}]