[{"title":"Should've amounted to more","rating":6,"date":"4 August 2019","review":"With such a fantastic cast and an interesting premise, I really expected this to be better that it was. Hypersexual nuns at a convent is a fun gag, but it runs out of steam fairly early on. Given all of the comedic talent involved, I should have laughed a lot more than I did. There are some amusing moments, but they pop up far less often than necessary.","user":"cardsrock","rank":[14,14]},{"title":"Silly nonsense, yet not really funny. It is a failed attempt at a parody of medieval period pictures.","rating":4,"date":"24 August 2019","review":"Silly parody of medieval period pictures, which fails to become really funny. A comedy, however silly it might be, needs some truthfulness in acting and story to be enjoyable for me. This story about nuns, swearing, fighting and raping slaves is way over the top and the many vulgar \"jokes\" are just made for cheap \"comedy\" effect. Vulgar can be funny. And it is to an extent, but vulgar jokes is all there is and one has to like that. Perhaps best suited for a teenager audience?<br><br>The story for those still interested: nuns in a monastery go wild. They swear, they fight, they rape. And they swear, fight and rape some more.","user":"imseeg","rank":[7,7]},{"title":"Not Everyone's Cup of Tea- But Great If It Is!","rating":10,"date":"4 June 2017","review":"I was able to see the Little Hours at Sundance and loved it. I will be going to see it again when it has its official release. This film is very loosely based on the Decameron by Baccaccio, a collection of 100 short stories written in the mid 1300's. With an amazing cast of comedy talent, great chemistry between all the cast members, spectacular cinematography of the Italian countryside, and a great score, it is something unique to behold. <br><br>The story centers around three bored, foul-mouthed nuns Alessandra (Brie), Fernanda (Plaza), and Genevra (Micucci) and their crazy antics. Early on in the film, Massetto (Franco) finds refuge in the convent as a deaf-mute and sparks some some hilarious and sexy interactions with the nuns. <br><br>After the first screening I noticed there were others that loved it, and many who were like \"What the hell did I just watch? This is one of those movies that is not for everyone, and the cast and director made sure people knew this. Everyone seemed to have had a hell of a lot of fun making it- and it (really) shows in the interactions in the film. <br><br>If you're not easily offended, love quirky, raunchy humor, and love to have a good time, then this film may be for you.","user":"gomeza-57174","rank":[100,146]}]