[{"title":"Can't expect much more from an anime adaptation","rating":7,"date":"23 February 2018","review":"Extensive anime series like FMA have the luxury of time to develop their world &amp; characters into something complex and relatable. Condensing 20+ hours of material into a 2-hour movie will inevitably mean changing, simplifying or removing elements, which will disappoint fans of the source material. But this film shows that it is possible to make a fun, coherent standalone adaptation out of the core components of an anime series. Coherent but not brilliant - which is still a step forward for live-action adaptations. This movie is a decent taste of the FMA world for non-fans. It could entice viewers to check out the anime, where most adaptations are so horrible they would just scare people off.\nTime constraints aside, the movie does a good job of telling FMA's story of family, loss and maintaining one's morality. The casting, costumes and effects are spot-on; almost too perfect for live-action, as if they tried too hard to be EXACTLY like the anime. The acting also suffers with this; Winry in particular is portrayed as an annoyingly over-the-top anime character which just doesn't play in \"real life\". But other characters (particularly Hughes) are played almost perfectly, and most of the cast lies somewhere in between - not great, but not intolerable.\nOf course, the story's most important components - Ed, Al and their relationship - aren't anywhere near as deep &amp; authentic as they become over the course of the anime series. The motivations behind the Homunculi and other supporting characters aren't really explored. The Ishvalan Civil War (a key element of the FMA's emotional landscape) is barely mentioned, and Scar (a great character closely associated with the War) is omitted entirely.\nThis is all obviously unfortunate, but there's no use complaining that Netflix couldn't cram the entirety FMA into one three-act movie. If you want the whole wonderful story, watch the anime. If you're ok with a faithful attempt at the story's gist, there's really not much wrong with this movie - which can almost never be said for anime adaptations.","user":"bennyantlang","rank":[77,88]},{"title":"Somepeople just want to watch the world burn.","rating":9,"date":"24 August 2018","review":"If you watched the anime as a kid, you won't be disapponted. <br><br>For added effect watch in Japanese with subtitles. Much better then the horrible dubbing..","user":"robertashman","rank":[49,56]},{"title":"Not What You Think","rating":7,"date":"25 February 2018","review":"Let me start off with a fair warning: this movie is not an \"accurate\" adaptation, and to be quite honest, it doesn't look like it was intended to be. This looks to be a new spin on the FMA story we all know and love. Much like how many people love the 2003 anime--and many prefer it over Brotherhood--it's different, but that doesn't necessarily mean bad. That being said, there are some issues I have with this movie, hence why I have only given it 7 out of 10.<br><br>Let's start with my issues with the film, and the main issue I had was the leaving out of key characters.<br><br>Bear in mind, it does appear that the movie was only meant to encompass events that took place during the first two seasons (with the exception of the inclusion of the mannequin soldiers). However, there are two glaring holes missing from this film in the form of Major Armstrong and Scar.<br><br>Admittedly, though an enjoyable character, Armstrong did not appear to be needed for the direction this story was taken, so this is more of a personal preference. However, throughout the entire movie, I believe there were only one or two mentions of Ishval, and Scar himself never appeared or was even referenced by any of the other characters. The film did end on a note that left it open for a sequel, so if one does happen, Scar would most likely show up in that film. But to not even have a mention of him in this movie seemed like a serious oversight to me.<br><br>And then of course there is the lack of the Mustang Unit. Of course, Colonel Mustang and Lieutenant Hawkeye were here--I'd like to see you try and make a Fullmetal Alchemist film without them. However, the other four members of Colonel Mustang's team--Havoc, Breda, Falman, and Fuery--were noticeably absent. And, like Scar, they were not even mentioned in passing.<br><br>The only other issues I had with this film were that two Homunculi were killed off in this film, one of them MUCH earlier than he should have been; and it seemed like Edward and Alphonse did not get as much shared screen time as they should have.<br><br>Now that the negatives are out of the way, let's talk about the positives. First up, the characters. By this, I mean that the characters that WERE included in this film were very much spot-on, both in terms of writing and performance. Special mention should be given to Yamada for his portrayal of Edward, since this was probably the hardest character to nail down in terms of emotional range, body language, and just the overall physicality of the character.<br><br>Most, if not all, of these characters both looked and acted like they had been plucked out of the anime and dropped into a live-action film. All the characters were easily recognizable, both by their signature looks and by their words and actions.<br><br>Speaking of looks, by God, the costume department deserves every award. Every last detail was perfectly replicated, from the Amestrian military uniforms to Edward's signature coat all the way down to Mustang's gloves. Everyone looked the part, and it was another layer that helped to ground you in the world of Fullmetal Alchemist as seen through a different medium.<br><br>One thing that many people often complain about with live-action anime adaptations--besides story--are the effects. See Attack on Titan for more details. It's difficult. Things that work in manga and anime don't always look right when transferred over to live-action, whether by use of practical effects or CGI. However, this movie clearly spared no expense on their effects budget. Every single alchemical reaction was clearly put together with time, effort, and dedication. The only effects shot that looked, shall we say, \"plastic\" were the shots of the mannequin soldiers and one instance with Gluttony's stomach.<br><br>Overall, this movie may not be what many people were expecting, but that doesn't make it bad. It just means you have to approach it with an open mind. It's worth a watch, and if you love Fullmetal Alchemist in any form, I highly recommend it.","user":"ledowdy","rank":[78,92]}]