[{"title":"Those who end up liking it will REALLY like it.","rating":9,"date":"17 January 2019","review":"Finally released in my neck of the woods, A24's Under the Silver Lake starts off 2019 with a bang; an effortful and transporting treat for all human senses. Its colors exquisite, its music delightfully old-school, and its story wonderfully bizarre and original, I've a feeling I already have one of my entries on my 2019 list set.<br><br>It starts with the young and aimless L.A. resident Sam (Andrew Garfield), who sees a mysterious woman played by Riley Keough at the apartment complex swimming pool. Although he finds a friend and maybe a lover in the woman, he later finds that she's disappeared without trace alongside her flatmates. Wanting to get to the bottom of this sudden departure, Sam finds out more than he expected, including the woman's connection with the death of a local millionaire, a recent series of dog killings, a peculiar indie band called Jesus &amp; The Brides of Dracula, a \"Homeless King\", and other things that seem to eerily correspond with the plot of a zine he's been reading.<br><br>The side characters are many but they all leave an impression. We meet the adorable but strange Balloon Girl (Grace van Patten, niece of Dick), an actress known as The Actress (Riki Lindhome), Sam's conspiracy nut friend (Patrick Fischler), another friend (Jimmi Simpson) with his head oft in the clouds, a hipster friend known simply as Man at Bar (Topher Grace), and many more. Some are given cameos before they become important to Sam's quest but they remain entertaining throughout.<br><br>The director is David Robert Mitchell of It Follows and the composer is Disasterpiece, who provided the Carpenter-inspired synths for that very same film (I recall not being too hot on his music in that film but I've changed my mind). Like It Follows, this movie has an old-fashioned feel, albeit in its own ways.<br><br>Characters in the film prefer to hear their music on vinyl, play their games on a Nintendo Entertainment System, and get their porn from Playboy. Someone categorized this film as \"hipster noir\" and I can sort of see why.<br><br>This is an especially great film if you're into mysteries, urban legends, and conspiracy theories. It touches on everything from creatures said to lurk around Los Angeles at night, to secret shelters, to messages hidden within our music, to the idea that all of said music - whether it is rebellious or conformist, regardless of generation - was all masterminded by one person to shape our culture. On top of that is the directing and camera work; the clever, often Wes Anderson-like compositions as well as the long takes that involve many actors, extras and locations at once.<br><br>Under the Silver Lake is mystifying, to be sure, and some may be disappointed at its lack of answers. However, it is an original (yet classical) and at times mind-blowing film, even to those who aren't exactly conspiracy theorists. Those who end up liking it, as per my estimation, will end up REALLY liking it.","user":"TheVictoriousV","rank":[131,166]},{"title":"Like a riddle without the punchline","rating":4,"date":"15 April 2019","review":"While this was rather an enjoyable little 'trip', this adventure mystery romp, the ending ruined it by not giving proper closure to the story.\nLike being told a joke or asked a riddle and then not being given the punchline, it leaves an unsatisfied taste in the mouth.\nThis seems to be happening more and more these days in films, is it a lack of talent in storytelling , a pretentious trend or just plain laziness masquerading as 'art'.\nEither way it's bloody annoying.","user":"YogaPantsNeverLie","rank":[110,155]},{"title":"If Mulholland Drive were written by a 9th grader","rating":5,"date":"5 December 2018","review":"Let me preface this by saying I was very excited for this movie. I'm into mysteries, I'm into noir, I'm into giallo, I'm into people making things that are ambitious and unpredictable, I'm a sucker for Riley Keough, and I was a pretty big fan of IT FOLLOWS. But, I never could have imagined this...<br><br>With this film, David Robert Mitchell has basically solidified his position as the world's new Richard Kelly. IT FOLLOWS was his DONNIE DARKO, and THIS is his SOUTHLAND TALES. Southland Tales is the ONLY movie that I find this truly comparable to.<br><br>First, it's strengths: it is astronomically ambitious, unpredictable, and it will go WAY out of it's way to try to be weird. You have to give anyone who is willing to go THAT FAR out on a limb a little bit of credit. But, aside from that, the casting of a few extremely good looking people, and the desire you'll probably feel to continue observing this 2 hour and 20 minute freakshow just to see if the train wreck can get any uglier, the positives end there.<br><br>Now, let's just talk about the most painful parts: Garfield's character is impossible to take seriously the majority of the time. His portrayal of a smelly (people bring up how horrible he smells literally every 5 minutes throughout the film) timid weirdo is awkward in the wrong way - reminds me of Bradley Cooper in Silver Linings Playbook - you're trying to be a weirdo but it's not working - I see acting, I see trying. Then, he transforms into the Terminator in some really out-of-place sequences that would be really cool if they didn't make such little sense in their placement. Second, this is a movie about Los Angeles that feels like it was made by someone who only knows as much as tourists know about Los Angeles. The locations are all the most cliche L.A. staples, which serve their purpose, but the majority of the characters feel like ignorant caricatures of what outsiders think L.A. people are like: yoga hippies, music producers, prostitutes, but all depthless interpretations with no inspiration - there is one specific \"L.A. party\" sequence on a downtown rooftop full of bland L.A. actors trying to portray eccentric L.A. people and it's so off base it feels like a rejected Target commercial.<br><br>It's clear that this movie wants to be Mulholland Drive, but it lacks the conceptual focus, the effective dreamlike surrealism, and the palpable creativity that make that film so masterful. The \"homeless king\" clearly wishes he was \"the mysterious cowboy\", but he's not - his crown looks way too cheap. Under The Silver Lake is full of \"totally random\" characters, scenarios, and cryptic \"clues\" that eventually tie into EACH OTHER, but still leave you feeling like they all served no plausible purpose in the end, like connecting a bunch of effects pedals with coupler cables but then having no batteries or AC adapter to power them up with.","user":"Stay_away_from_the_Metropol","rank":[218,332]}]