[{"title":"A travesty, but OK if you're looking for \"Shakespeare goes 'Twilight'\"","rating":5,"date":"23 June 2019","review":"Never mind all the fake early ten-star reviews here--if you can't tell they're fake from the writing, click on the person's handle and you'll see that inevitably they have never posted about another movie before.<br><br>This movie gets five stars for being well-produced, good-looking, professionally acted and crafted. I can't argue that it would probably entertain less discriminating (and younger) audiences, esp. if they have no prior experience with \"Hamlet.\" (God help the high school student who one day is going to figure they can skip reading the play and do a book report just from seeing this film.) But if you ARE at all familiar with \"Hamlet,\" this is is pretty ludicrous. It's not that it departs from the play in many ways; \"Hamlet\" is such a ubiquitous classic that it can certainly withstand and even welcome some imaginative, revisionist takes.<br><br>(partial spoilers ahead] The probolem is that this particular take is that of a stereotypical current teenage romance-novel-slash-fantasy a la \"Twilight\" and \"Wicked.\" Poor Ophelia must of course be a spunky little rebel who only PRETENDS to go mad, won't let men tell her what to do, and other things that seem more than a bit preposterous for a young lady in a medieval Danish court. Of course Hamlet is ALL about her, in a brooding, lovesick, tormented Robert Pattinson-in-\"Twilight\" way. Things are manipulated so crazily to make O. the center of this whole story that she even sees the Ghost of Hamlet's father before he does! Because she is just that special.<br><br>Gertrude is made to be bitchy and insecure, reducing Naomi Watts' performance; Clive Owen is solid as Claudius, and other performances are OK. But it's distracting that another concession to young audiences is making the court multi-ethnic, as if there were many black people around in 11th-century Denmark or whenever this is supposed to be. It's not that this is quasi-modernized, which needn't be a bad thing; it's that it's done in such a stereotypical, shallow, trendy fashion that the effect is ultimately kinda laughable.<br><br>You can't say this is really a \"feminist\" take, because it's too juvenile in its approach--Ophelia may be somewhat \"empowered,\" but she's also the girl whom the Prince himself offers to \"walk away from it all\" for! She's supposed to be \"tough,\" in a sort of Katniss-in-\"Hunger Games\" way, but she also gets to be Cinderella, too. If you're getting the feeling from my description that this movie piles up way too many cliches in order to hit the target audience bull's-eye, you'd be exactly right. But jiudging from the film's reception so far, obviously you can OVERESTIMATE what your audience presumably wants, and give them so much of it that they feel condescended to. This expensive-looking movie is pretty much going straight to VOD, and that is because it is more 21st-century \"Gidget\" than \"Hamlet.\" Doing the story from Ophelia's point of view was a good idea--and someday, someone may do it right.","user":"ofumalow","rank":[101,128]},{"title":"Anti-Shakespeare","rating":2,"date":"22 January 2020","review":"Really really stupid. The studio up-vote spam-bot squad is in effect with 10/10 marks for this!!! I thought by the second act that they could up the pace of the film to make it more exciting and also stop the gags. Is the joke on us or on Shakespeare??","user":"donald-haschel","rank":[18,21]},{"title":"Disappointed with acting","rating":5,"date":"2 July 2019","review":"Characters act like it's happening in 21st century: winking, rolling eyes at each other, etc. Ruins the authenticity of the period of time its based in.","user":"anczykowska","rank":[76,102]}]