[{"title":"Not everybody's cuppa","rating":8,"date":"2 September 2018","review":"Wow, there are a lot of people who don't like this movie, and moreover, seem to mad that others like it. Some samples:<br><br>\"I think people who are giving it high praise believe that's just what their supposed to do but the fact is it's just a dumpster fire of a movie.\"<br><br>\" I RARELY write movie reviews but had to inform people of the facts on this one.\"<br><br>\"The positive reviews are from movie snobs who think they are smarter than everyone else and recognize brilliance in pure garbage.\"<br><br>You get the point. It's almost like we're all supposed to like all the same things now. (In fairness, there were plenty of other reviewers who didn't like it, but said they're glad others enjoyed it.<br><br>I'm not a movie snob. I'm not a film executive and I have nothing to do with the film except I paid 6 bucks to see it last Tuesday. This is a very surreal satire. It won't be to everyone's liking, but it seems to me that we are getting more and more confused about the difference between fact and opinion. It's not a fact that this movie sucks, any more than it's a fact that this movie is great. These are classically opinions. <br><br>Me, I like movies that start sort of pseudo-normal and go into bizarre. This is right up my alley. It's a Repo Man for our generation. Genetic engineering, dead end call center jobs, megalomaniacal Bay Area billionaires trying to save the world, race relations and post-postmodern art commentary. It's all painted in a crazy, bigger-than-life science fiction brush. Yeah, it's weird as hell, and maybe ends a little weakly (Monty Python and the Holy Grail, anyone?) but has a method in its madness.<br><br>If you don't like absurdist humor, or if you don't like movies that are at least semi-overt political statements (especially if the political statement is opposed to yours. Anti-union, pro-business capitalists with short fuses be warned! You should give it a miss and just read the National Review's Ross Douthat's review. He saved you a lot of time worrying your beautiful mind about it.), and if you don't like a dollop of science fiction every now and then, yeah, you're going to probably hate it.<br><br>But your opinion is still not fact. I liked it. That's my OPINION. Get over it.","user":"rk6314","rank":[381,480]},{"title":"Hmm","rating":7,"date":"21 October 2018","review":"I always try to base my judgement of a film, on how much it can bring forth my emotions. The more a film can invoke my feelings the; whether that be love, fear or joy. That is what makes a movie great. I have stuck to that rule my whole life, and whether I am feeling in awe at another Nolan epic, or pure bitter frustration at sharknado 13, I have never stumbled across a single film to which I can make an exception.<br><br>That was in fact until I embarked on the journey known as \"sorry to bother you\".<br><br>This film is strange. I mean, reallyyy strange. A dystopian reality is constructed, using cheerful and colourful, mise-en-scene, picture and sound; as a poorly crafted mask to cover the dark undertones which hide in plain sight. The acting? Seamless. The humour? Hilarious. The plot? A positive unorthodox. And yet what emotion of mine does this film invoke? Misery.<br><br>The alternative reality conjured is so surreal, yet so real. The psychopathic nature of every single aspect of this creation bears all too many similarities to the world we too live in. So hyperbolized, so ridiculous, but still so true. Immediately after whatching this film I had to call my best friend, just to hear a sane voice, as even the one in my own head was failing to provide me that comfort.<br><br>This film does exactly what it sets out to do, it does so in stupendous fashion. And yet, I hated it. I recommended that none of my friends watch it. Though smiling throughout, my overall emotion was of such discomfort, that I really did not want anybody to go through the same. This is the best worst film I have ever seen. My rating has fluctuated from 4-10 throughout the writing of this review. But here you have it. 7/10. My final answer, a mediocre score, for a far from mediocre film.","user":"djbattick","rank":[19,22]},{"title":"The WTF Movie of the Year","rating":8,"date":"18 July 2018","review":"Sorry to Bother You is a strange, surreal, hilarious satire guided by the intentionally unsteady hand of rapper-activist turned debut director, Boots Riley. <br><br>It dabbles in commentary on media, society, race and working-class issues-so many poignant messages, some more successfully delivered than others. The fearless absurdism will likely distract some viewers from a couple of these messages, but I'm okay with that. I take this wonderful creation much more for its entertainment value than anything else. <br><br>The messages that do resonate should come through clearly. Riley's story doesn't shroud itself in murky metaphors. It tells us exactly how to interpret the bizarre world he has created. <br><br>Rising star LaKeith Stanfield plays Cassius 'Cash' Green, a deep-thinker who lives in his uncle's garage with his artistic girlfriend named Detroit (the invaluable Tessa Thompson). It comes as no surprise that a man who goes by Boots would opt to give his characters unusual names. These two are just the beginning. <br><br>To collect enough scratch to keep up with his rent and put gas in the rusty bucket he drives, he takes a job as a telemarketer. When a wise elder advises him to use \"white voice\" to improve his sales, Cash starts to rake in the green. <br><br>After he rises the ranks of the telemarketing world, ascending to the divine status of power caller, he attracts the attention of an eccentric, drug-fueled CEO, Steve Lift (Armie Hammer). His company, WorryFree (a place where employees feel anything but) hides a dark new idea. But when the secret leaks to the public, his stock unexpectedly skyrockets, and Lift is declared a pioneering genius. <br><br>The rational-minded public undoubtedly opposed Lift's plan, but big business carried on. As union organizer Squeeze (Steve Yuen) explains to Cassius, \"if you show people a problem, but they don't know what to do about it, they just learn to get used to it.\" <br><br>If you think you have any of this plot figured out, think again. It makes a radical left turn in the third act that will tempt some viewers to jump ship. My advice: stay on board. Even if you don't want to totally buy in, just hang around to see where this new direction leads. <br><br>The film flies along with such easy energy early, then hits turbulence when trying to figure out how to end this thing. Riley introduces so much psychedelic madness that by the end it's nearly impossible to wrap up the story. But at some point, one must come down from every trip. <br><br>Even with as jarringly fantastical as it is, in many ways this movie also feels incredibly real. As Riley puts it, he strives to \"break down reality to help us better understand it.\" Mission accomplished.","user":"Jared_Andrews","rank":[173,253]}]