[{"title":"The first decent Puppet Master movie in decades, but still not great.","rating":5,"date":"25 August 2018","review":"I've seen at least a little of every movie in Charles Band's incredibly long running franchise. The fact of the matter is that really only the first two movies were any good and everything after that ranged from barely watchable to downright awful. <br><br>The Puppet Master brand is basically all that has kept series creator Band's company Full Moon alive since the 80's and he has mercilessly milked it, sometimes openly cheating fans in the process. There were PG-13 sequels (rolls eyes), movies that were clearly shot back-to-back to save money (groan), and even a freaking clip movie (screams in anger)! So, when I heard that the brilliant, uncompromising genre author and filmmaker S. Craig Zahler (Bone Tomahawk, Brawl in Cell Block 99) was writing the next film in the franchise I thought one of two things: either Zahler was a longtime fan that wanted to write the first truly great Puppet Master movie OR Zahler had a car payment due and knocked out a script in a weekend. Unfortunately, the latter seems to be what happened. Puppet Master Littlest Reich is not a great movie but it's still better than any other sequel since the second movie. <br><br>This film is a reboot which reimagines the puppet master, anti-hero Andre Tulon, into an outright villain portrayed by horror legend Udo Kier (Blade, Flesh for Frankenstein, Suspiria, Fear Dot Com). Kier is fantastic, playing a hideously scarred, wantonly sadistic Nazi sympathizer that wants to continue the Third Reich's mission of a pure white race and intends to do so, even after his death, with the help of black magic and an army of puppets he mass produced and sold prior to an unfortunate run in with the cops. <br><br>Flash forward to find a divorced, broke comic book writer (Thomas Lennon of Reno 911) in possession of one of Tulon's puppets, Blade, which he finds among his dead brother's things. There is a convention being held at Tulon's old house where collectors intend to auction off all the old dolls belonging to the notorious psychopath. <br><br>Everyone loads into a hotel, the puppets all come to life, and much, MUCH bloody mayhem ensues. Along the way we are joined by fantastic scream queen Barbara Crampton (Re-Animator, From Beyond, and the original Puppet Master) as the retired cop that took Tulon down and professional b-movie tough guy Michael Pare (The Lincoln Lawyer and basically every Uwe Boll movie) as the cop currently on the case. <br><br>Let me just say that the script for this movie was either hacked to pieces or sorely underwritten. Concepts and ideas are introduced and dropped at a moment's notice. Crampton's character has no pay off, supporting characters fall in and out of the story, plot points are introduced only to be dismissed immediately after, the tone is all over the place constantly swapping from dumb fun gore to weirdly preachy anti-nazi talk, and the ending makes no sense and just kind of drops off with a lame bit of sequel baiting. <br><br>On top of that, the director makes some serious technical errors. Some scenes are underlit, the editing is at times hard to follow, and dialogue is recorded too low sometimes. <br><br>As far as its places in the franchise, the sloppy plotting is nothing new and this movie is a great deal faster paced than most of the other films which, after part 2, started leaning towards cheap time killing devices over actual action. The direction is unusually bad, though. Most of these movies had a generically competent, TV sort of vibe to them but this movie really kind of felt like one of those ultra-violent, straight-to-video horror films of the late 90s. <br><br>I'm fine with the revamp on Tulon, especially because Kier is so great in the role but I do really wish he had been in it more. I hate the redesign on the puppets. They look cheap and action figure like, lacking the artistry that made the original puppets so distinct. I also dislike that the puppets no longer have any personality. They're all just mean little killing machines. There's no real sense they are actually ALIVE and instead all feel like instruments used by a primary antagonist that's a little too off screen to really resonate. <br><br>Thomas Lennon and most of the rest of the cast are strong (with the exception his annoying, motor mouth boss) and I did have fun watching the movie. However, thinking about it afterward, I couldn't help but feel that this movie was a little too flawed to really say I liked. It was alright and gore hounds and puppet fanatics will probably have at least a little fun, but it could and should have been a lot better.","user":"Kolobos51","rank":[27,38]},{"title":"Fun slasher throwback","rating":5,"date":"24 September 2018","review":"Simple review:\nThose who are fans of old school slashers and the Puppet Master franchise will enjoy this movie, because you already know what you're going to get.\nIt's gory, it's stupid, it's fun... \nIf you do not like old school gory slasher movies, then why would you even consider watching this?","user":"patrickbivona","rank":[10,13]},{"title":"No Holds Barred Good Old Fashioned Horror Film Making","rating":8,"date":"16 October 2018","review":"I went into this having not watched any Puppet Master film for at least 5 years and having only seen a handful of the other movies in the massive franchise. I've been thinking about this film for a few days now and I've decided it has heavy influence from the 80s horror era. It's not an 80s throwback or even an homage. It's 80s in the sense that it's writer and directors didn't give a damn about what people were going to think of the film and did it the way they wanted, with it's no nonsense don't give a damn attitude about people being offended, sick hilarity, gore and silliness. <br><br>It's a film about Evil Nazi puppets, what were these other reviewers on here expecting? It doesn't take itself seriously at all, but rather pokes fun at itself in a satirical fashion. It's ridiculously funny, even though a lot of people are going to find this movie offensive, you know the type, right?<br><br>It's bad taste jokes and gore should leave the seasoned horror fan satisfied. You know the type, those of us that grew up during the 80s that don't get offended by anything and everything. Millennials will probably hate this film.<br><br>It's not a thinking man's film, it was never going to be. It doesn't need substance, it doesn't need style, because it's simply good old fashioned fun and gore that will keep you entertained throughout and make you forget about all the crap that goes on in the real world for a couple of hours.","user":"MadMike77","rank":[11,15]}]