[{"title":"I wish they hadn't \"twilighted\" this beautiful story.","rating":4,"date":"9 November 2018","review":"As someone who read the book over 20 years ago, I knew coming in I wasn't the target audience for this film. But I re-read the book recently, and despite it being a YA novel, I found it just as compelling now as it was when I was 13.<br><br>Casting-wise, I found some of the choices quite brilliant. Timothy Spall as Carmody (does he even have a name in the film?) was everything I pictured when reading the book and more, down to the smile that felt like the face shrunk around it. Brilliantly terrifying. I would comment on the other characters too, such as Myriam and Winter Carlisle, but truth is, their presence in this film is so minor and marginal, I can barely remember if they were there at all. The little boy playing Jacko was an adorable little boy, just like the character he was playing, so no issues there.<br><br>This leaves the main character, her love interest and her mother. In the book, Laura is a compelling character you immediately sympathize and root for. She feels things, even more strongly than others, and reacts to things. She speaks her mind, sometimes faster than it is wise. She is feisty and brave. Why the writers in the film decided to write her as the exact opposite in this adaptation, I will never know. Perhaps they saw the success of the Twilight franchise and decided to try and make their protagonist remind people more of the heroine of those books/films. What a shame, trading in all the liveliest qualities of Laura for this lifeless adaptation. The actress they cast did match with the physical description, but what came out of her mouth were dull, cliched lines that didn't even seem like they were meant to be part of a dialogue, just written for some dramatic effect. And not satisfied, the writers decided to turn Sorry into some sort of Edward-like character, broodingly stalking our protagonist and too busy pouting to bother having a personality. In the book, Sorry has so many layers, you cannot wait to see more of him. Here, the character was stripped off of any quality but his physical appearance, making all of his screen-time feel longer and more boring than it probably was. But the one who got the worse treatment was Kate, Laura's mother. I guess the production decided that the viewers had no interest in the struggles of a single mother of two, so they stripped her role to the bare minimum, removed any of her motivations and only left what comes across as an incompetent mother who is completely oblivious at first and aggressively unfair later on. Apparently all we need to know about the protagonist's mother is that she doesn't understand her daughter and she nags, because isn't that what mothers do?<br><br>When I started watching, I really wanted to like the film. I loved that it was an actual NZ production, that the cast pretty much looked their part (well, not Kate, to be fair) and I was willing to accept the differences: Laura's dad dying instead of the divorce, the more modern approach on how kids her age spend their time together and such, but the more the film went on, the more it felt that too much time (and money) had been spent on making these minor, in both importance and effect, than in creating a solid story that could keep the viewer interested throughout the film's run-time. And the final showdown happened so quickly and when I had already lost any interest in the plot development that it took me a while to notice \"Ah, this is it, she won.\"<br><br>Finally, either someone in the editing room messed up, or the script writers didn't feel the necessity to maintain any coherence in their dialogues. Sorry telling Laura that he knew she could make it, apart from being what any viewer would expect him to say, has absolutely no foundation as nowhere in the film did he ever express such certainty and the only time in which the changeover is verbally addressed, we only see him object to it. Now, in the book he does the same, but then again, Margaret Mahy doesn't forget that, and how he acts before and after the changeover is in perfect accordance to his personality.<br><br>To anyone who has watched this or would like to see it, I recommend you read the book it's based upon and hope someone else, some day, will have another crack at it. Perhaps Timothy Spall can be persuaded to reprise the role, because he's just perfect for it.","user":"alinda-thelostgirl","rank":[18,19]},{"title":"Had Potential BUT...","rating":3,"date":"27 July 2018","review":"I really went in to watching this film with high hopes. Teenager discovers she has hidden powers and tries to rescue her younger brother. Story starts off well and had my interest for about 30 minutes in and THEN it fell flat. The actors are actually perfect but the movie tried to form chemistry between the main actor and actress in a way that did not fit with the movie. There was a lack of build up for the audience, I kept waiting to be amazed while the main actress discovers herself but truth is she remained boring until the very end. This movie could have been great, may be lack of funding but something was wrong so therefore i could only give it a 3/10.","user":"ariestarzga","rank":[13,16]},{"title":"Well made film about family and defeating one's demons and controlling your destiny","rating":7,"date":"22 December 2018","review":"McKenzie and Harcourt do an admirable job bringing the novel to a present day setting, with excellent award-winning cinematography. Built on themes of the dangers of 'inviting' trouble upon yourself and/or others, accepting yourself for who you are and the 'magic' within you, and sibling bonds, \"The Changeover\" is a fine addition to New Zealand's growing film history. Excellent performances are provided by Spall and especially Erana James. James is one to keep and eye on for years to come. It's not among the best of 2017, but it's certainly a well-made film worthy of your time if it sounds like something that might interest you.","user":"flamini-14847","rank":[8,12]}]