[{"title":"The problem with IMDb are the extreme reviews","rating":7,"date":"20 September 2016","review":"To get this out of the way, the movie is neither a 10 nor a 1 and the end is a bit unsatisfying.<br><br>This being said, this movie is enjoyable if you can stand the \"Groundhogs Day\" mechanics. I would definitely recommend the movie for friends of mine who like Science Fiction movies. Maybe I would even buy the BluRay.<br><br>It is full of twists, surprises, I can understand the emotions of the characters and I really like how the characters developed. Yes, there are plot holes (like with every movie that involves time travel), yes, not each performance is Oscar worthy, but if you don't expect \"The Godfather\" in the Star Wars universe, you might like it.<br><br>I rated it 7 out of 10, because I really like SF flicks, for \"normal\" people it might be a 6.<br><br>Enjoy","user":"skGoliat","rank":[126,152]},{"title":"Disregard the negative reviews and see for yourself.","rating":8,"date":"17 September 2016","review":"Considering the others reviews of this movie i almost lost the opportunity to see it for myself.<br><br>I think the movie was really well done and every piece was satisfactory, not every movie needs to have some plain ending. This movie had good actors, good writing, nice edit and a good ending. I may be wrong but i think people are criticizing this movie that hard because they couldn't understand it. Not a masterpiece, but considering the budget and the way the movie was made it was really good. It gave the viewers the information in small doses, small twists and good writing.<br><br>Thanks Netflix for the opportunity to watch another good movie. See it for yourself.","user":"Sauloborges","rank":[179,233]},{"title":"Gripping, interesting, refreshing - had me hooked till the last minute.","rating":8,"date":"17 September 2016","review":"I'm starting to really like Netflix. Everything I've watched from them turns out to be very good, which is amazing because I was beginning to believe that the era of movies is over. It seems that nobody wants to make good movies anymore, CGI is king, and viewers are expected to like whatever is released by the greedy studios. Then Netflix happens and suddenly you can watch movies like ARQ. <br><br>To the point, though: I've just finished watching ARQ, literally one minute ago, and I didn't even wait for the credits to run, I was already on IMDb signing in to write a review. I've never done it before, but this time I had to. This movie deserves a lot of praise. Of course, it is a 'Groundhog day' type of movie that has been done before, but I've never seen it done so well. That's why I usually hate this type of movie: because they don't get the science right, they don't have a suspenseful story and they do a lot of illogical stuff just so they could wrap things up nicely. This isn't a mess of a movie like that. That's the main thing I liked about it, that they keep me waiting to see how the next loop is going to change. The story is really gripping, and I liked the actors a lot, they really make it look realistic and believable. And I love that someone finally came up with a story like that, in which you can see what might happen if you were stuck in a loop. Remember the movie 'Looper'? In the end, if you analyzed it, it didn't make sense. ARQ does, and it keeps you guessing, it's unpredictable. It was such a pleasure to watch, particularly because it's full of twists and turns and I challenge you to guess how it ends. Each loop is a surprise, I can't even say how refreshing it is to have watched something like that. I hope more people come to review ARQ and that they recognize what a little gem this movie is. It's not a great movie, I'm not saying it is, but it is a solid 8 out of 10 as someone already noticed. It really is. I like clever movies, and this was certainly clever. I liked 'Edge of tomorrow' with Tom Cruise for the same reason - because finally the scriptwriter got time travel right, or at least they make it look like that's the way it would work. It's an achievement. A big thumb up to Netflix.","user":"gornasa","rank":[120,156]}]