[{"title":"Don't waste your time!!","rating":1,"date":"16 August 2018","review":"This movie was horrible . Longest hr &amp; half of my life. It kept dragging and relied on not so scary jump scares. I was impressed with how much the trailer made the movie look scary and good but of course it was the wonders of cutting room floor editing. Plus most scenes in the trailer aren't in the movie!!!!","user":"nashwahnassar","rank":[61,71]},{"title":"Slender Man: Another missed opportunity","rating":4,"date":"24 November 2018","review":"This latest version of the Slender Man mythology seems to be universally reviled though I don't entirely understand why. It's not great but it's simply not THAT bad.<br><br>Alike Lovecraft Slender Man seems to be one of those commonly used subject matters that always seeems to miss the mark. Filmmakers just don't seem to be able to make the most out of the fantastic material presented before them.<br><br>So yet again we see a tale of a group of young folks on the run from the Slender Man and spooky things happen. Yadayadayada.<br><br>With a decent young cast including Joey King and Annalise Basso we're presented with the glossiest and most high budget Slender Man movie yet. Sadly along with the budget comes all the usual Hollywood horror flaws, demonstrating once again how badly Hollywood have lost their way when it comes to the entire genre.<br><br>Sure it looks great, but the plot tail spins out of control by about the halfway mark and that's such a shame as up until then it was showing real potential. Hollywood need to go back to the drawing board, hire indie filmmakers to adapt material otherwise we'll just keep getting this Insidious/Conjuring tripe.<br><br>Slender Man has it's moments and the concept is pure gold, this however is more squandered potential.<br><br>The Good:<br><br>It's Slender Man!<br><br>Atmospheric<br><br>Great cast<br><br>The Bad:<br><br>Plot falls apart badly<br><br>Potential isn't met<br><br>Too many common tropes and cliches<br><br>Things I Learnt From This Movie:<br><br>Slender Man mythology is fantastic but really inconsistent, no wonder they get it so wrong with adaptations<br><br>Joey King and Annalise Basso are going to be big stars<br><br>Slender Man is like Aliens (Xenomorphs), he needs keeping in the shadows or he looks a bit silly<br><br>This should have been called The Ring: Slender Man","user":"Platypuschow","rank":[40,50]},{"title":"Slender Man","rating":3,"date":"11 April 2019","review":"A movie that clearly wanted to be rated R slapped with a PG-13, not that a different rating would fix the gaping plot holes, stupid and lifeless characters and performances, flat direction, and the knowledge that this movie is about nothing other than a trend long since popular.\n3/10","user":"TheRadiobox","rank":[13,15]}]