[{"title":"Who says there is no such thing as time travel....?","rating":9,"date":"13 October 2017","review":"Because writer/director Zahler has taken his audience back to an era when films were simpler, direct, and,above all, unrelenting in their pursuit of a single theme or idea.<br><br>He has manufactured a true guilty pleasure -- a film about a man making bad choices that is driven by brilliant characterizations, raw Adrenalin, and a compelling narrative that makes you watch no matter how much you know you should look away.<br><br>In the grand tradition of Charles Bronson and Clint Eastwood, Vaughn, an actor once relegated to romantic comedies, does \"the\" physical role of his career and it is a barn burner.<br><br>There is no pretense at class. This is 1960s grindhouse from start to finish and if you have any doubts just listen to the closing music at the 2:05 mark --- a brisk orchestral piece that sounds more fitting to a vaudeville act than a melodrama. Zahler ends the show by signalling that he was messing with your head, overloading your senses, all along -- and moreover he was doing it deliberately and knowingly.<br><br>Don Johnson, an actor who continues to win SEXIEST MAN ALIVE awards for merely showing up at the ceremony, wanted to try something different and succeeded - his cigar-smoking, sadistic warden is a masterpiece. Unforgettable.<br><br>A hard film to review, a difficult film to classify, and an impossible film to ignore. The closest analog in this era would be the highly stylized, and highly violent, films from South Korea that glorify the individual over the system.<br><br>Highly recommended.","user":"A_Different_Drummer","rank":[380,465]},{"title":"BRAWL = WTF! Give me MORE!!!!!!!!!!!!!!!","rating":10,"date":"17 October 2017","review":"Let me allay any fears this movie is lame, as stated by a couple reviewers here. Their opinions here are extremely inaccurate. With that being said....<br><br>Vince Vaughn is a shining star in this brutally violent, perfectly paced story, with a descent into a hell only his character can navigate. The movie is rare in that it's not slow, boring or overdone. Each piece is compartmentalized on purpose, to guide the audience to the climax. There isn't a big list of elite A list actors, huge musical score, tons of CGI, no. What you have here is director's genius, visualizing the journey from A-Z in a way that will captivate you. You will not want the movie to end. <br><br>I do think this is a turning point for Vaughn, as I only usually see him in romantic movies or comedies. He's truly found his spirit here and I hope it leads him to similar roles. He plays it in a way you've never seen him. Try to imagine Tom Hanks playing a man without a care. It's that hard to wrap your head around. <br><br>Don Johnson shines as a degenerate warden and the small cast of characters scattered throughout the movie play key roles in the makeup of the plot; all done to perfection.<br><br>Trust me y'all, you DON'T want to miss this one, it will have you begging more for more, guaranteed! So much face smashing destruction is actually a delight. I will not spoil a single thing, go see it!!!!!!!!!!!!!!!","user":"favrefan-49700","rank":[228,303]},{"title":"Good Lord, This Is A Rough Movie To Watch","rating":7,"date":"25 October 2017","review":"First of all, if you are squeamish (even a little) DO NOT watch this movie. But if you've got the stomach for an extremely violent (and sometimes depressing) movie this might be worth your time.<br><br>Vince Vaughn does an excellent job. In fact, the acting in the whole movie is surprisingly good for a grindhouse-style flick. This is about a man in a bad, bad position, who bad things happen to, and who in turn does some very bad things. But if you can handle this type of movie you will be entertained.<br><br>The action is gritty to the point of being potentially sickening. I was disturbed, and yet I wish more movies took this approach to action. The fight scenes are not comic bookish like so many movies, rather they are brutal and somehow realistic. Honestly they were the best thing about this movie.<br><br>Don't expect a brawl in the sense that a whole cell block starts fighting riot style. This is more of a Bronson-esque \"one man out for revenge\" style of movie.<br><br>The only negative I noticed is that there were a few unbelievable parts regarding the prison system, but they were needed to drive the plot along in the direction it went. Viewers should really just suppress their disbelief (and gag reflexes) and just strap themselves in for the ride.<br><br>Recommended for anyone that can handle the darkness and appreciate the brutally gritty craziness that is this movie.","user":"Sawyer-4815162342","rank":[86,118]}]