[{"title":"One sided cliche","rating":5,"date":"27 February 2018","review":"I really wanted to like this movie! Chloe Sevigny, Jason Schwartzman, shot on film, what's not to like!?<br><br>Unfortunately the story and dialogue are really lacking.<br><br>When it comes down to it, it's about a few men who are into a younger woman and jeopardizing their own relationships because of this. Meanwhile, the women in the movie complain about the men in their lives being faithful or not and contemplate if their lives are meaningful.. Doing so in one sided, pretentious dialogues.\nSo the men are happy exploring their interest in a young beautiful woman while three women are shown feeling miserable all the time. I'm not sure what the message would be of this movie..<br><br>If you wouldn't be bothered by the man-woman relationships, then the predictable story line could turn you off.<br><br>Some of the shots were nicely done and I appreciated the simpleness of the story and filming and of course the acting, I just think he missed the mark.","user":"maaike-7-167274","rank":[12,14]},{"title":"Grammar? We don't need no stinkin' grammar!","rating":3,"date":"9 January 2019","review":"Pretentious, over-written diarrhea. Yet another Woody Allen wannabe, peudo-sophisticated, verbose snooze fest.","user":"drafteeh","rank":[14,17]},{"title":"A slow, ponderous descent into angst, unhappiness and bitterness","rating":2,"date":"2 August 2018","review":"The worst aspect of this movie for me, was the character of Gwen, played very well by the great Mary Louise Parker. Perhaps she played this character too well. She is a woman filled with bitterness, regret, a self imposed isolation, and a determination to judge anyone and everyone around her. Her wrath seems to focus mostly on the characters of Alyssa and Nick. While Nick appears to be a fairly decent, and harmless guy, his wife Alyssa embodies some of the same angst and bitterness of her sister Gwen. Both are miserable beyond description. Both are women who absolutely refuse and seem utterly incapable of embodying even a nanogram of femininity, kindness and love, and then wonder why those around them find it so hard to embrace them. Alyssa has to wonder why Nick is not fulfilled? In my most dark moments, I cannot imagine living with someone as tepid, shrill, angry, and forlorn as this woman. And to have to deal with her ridiculous sister in law on top of that? Please. Just shoot me now. <br><br>If the film has value, it is as a means of establishing how not to live, or how not to merely exist as a couple. Their marriage is a horrendous nightmare, that I would not wish upon anyone. Being alone is a far better alternative than being in a relationship so devoid of passion, interest, kindness or tenderness. <br><br>Meanwhile, Naomi's sights are firmly set on Buddy (Jason Schwartzman), a record producer who married his own young assistant, Jess (Analeigh Tipton). Buddy tries to resist Naomi's charms, but finds himself making more and more excuses when he comes home late. Jess's miserably single sister Sam (Lily Rabe) is simultaneously suspicious of Buddy and jealous that Jess gets to be married at all.<br><br>As the men either harass or flirt with Naomi, hoping to recapture the freedom of their former selves - or at least the image they'd like to have of their former selves - the women feel suffocated in a different way. They use her presence as an impetus to analyze their own astonishing degree of unhappiness, caught as they are in the sludge of both their mid-life crises. However, their misery does appear to be of their own making. <br><br>Watch this film if you feel like a nice refreshing dip into the sewer of humanity. A visit to the local morgue is more uplifting. Not that I need films to uplift me. But, it is always more fulfilling to watch a movie with some content. Frankly, I am not sure what this movie was about.","user":"latinfineart","rank":[11,15]}]