[{"title":"Flimsy characters in a weak story, further weakened by padding and cliches","rating":1,"date":"30 July 2018","review":"Rachael Blake plays a novelist who's extremely pleased with herself and makes a point of being either sour or enigmatic or both simultaneously. She and her publisher (Vince Colossimo) visit her country mansion so she can write her second novel without distractions. He seems extremely dim - for a publisher. But that's handy because all she seems to want from him is sex, or to be able to humiliate him. Nothing much happens for the first half hour. Except we meet the standard menacing local bloke in a flannelette shirt, and there are flashes of past somethings - very brief, too brief to stimulate much anticipation. Then the novelist's fun-loving besty (Susie Porter) turns up, and larger hints are made about the dark secret of their past, but not much happens that you don't expect will happen. A triangle develops, the dark secret is gradually revealed, but are the \"shocking\" scenes we see part of the novel being written, or are they really happening? I didn't care. This is one of those 20 minute stories that are chopped up into 90 minute jigsaw puzzles in the hope that you won't notice that not much is going on. As far as interesting characters or story are concerned, \"The Second\" woefully neglects its audience.","user":"adam-703-808689","rank":[12,16]},{"title":"Screen Australia Screen Queensland","rating":1,"date":"6 January 2019","review":"Do you actually read scripts? A filmmaker finds an amazing house in outback Queensland, and writes a script to fit the house? Even with no available water, the pool is empty, but hey, best add a pool scene?\nAnd who left the various wine glasses on the tables in the hall? The crew? The Second is an example why the funding bodies have few hits and lots of misses. A weak, no a pathetic script which four reasonable Australian actors did their best. Maybe ad lib might have been better. Go for it you guys.","user":"tonyforrest","rank":[4,5]},{"title":"What a waste of an evening!","rating":1,"date":"16 November 2018","review":"Not much positive to say, except that the landscapes were often stunning.","user":"ken-06850","rank":[5,7]}]