[{"title":"Effortless and cheap structural mess","rating":2,"date":"3 December 2018","review":"There's only one reason why I picked this up - the recent Dolph Lundgren horror comedy \"Don't kill it\", which was a decent no-brainer. \"Dead trigger\" falls way below decent.<br><br>There are so many flaws that I don't know where to start. First of all, Dolph Lundgren should never wear a scarf. You'll see why. I hope you don't though, 'cause it's not worth watching this 10yr olds vision of a good zombie flick. The story - what was it exactly? There are a lot of seriously underdeveloped charachters dying all the time &amp; in the end you have no idea what, who and when held any importance. Towards the end of the movie, you're just not entirely sure what is and was going on - random characters just pop out of nowhere. It's a real structural mess, like, who funded this damn script? I can't even put together the plot in one sentence - IMDb plot synopsis for this movie doesn't sound much like the actual content of this failure of a horror. And the 'plot twist' at the end? Didn't get me, not one bit. The next most cringy thing about \"Dead Trigger\" were the performances - it seems like they learned their lines right before shooting and went ahead with all the first takes. Even poor Dolph was not acting much, just talking and 'screaming' in the same constant low voice &amp; making the same mildly concerned face. Most of dialogue was real bad, as you'd expect, a lot of it - also pointless and unessential. But wait, even more cringier were the special effects - all digital and real dirt cheap lookin'. Cuts, bullets wounds or any other origins for those splashes of blood were never to be seen as well - it's a real annoying \"on the nose\" thing. While it looked like they had gotten some decent enough locations, the props and costumes looked like they were rented in the nearest paintball store.<br><br>Basically, \"Dead Trigger\" shoots blanks and reeks of crappy filmmaking. If you're expecting a fun time, hilarious moments and whatnot - don't, it's gonna be funny maybe for the 1st half an hour, that is, if you don't watch it alone. A passable snoozefest with a generous cringe topping. My rating: a well deserved 2\\10.","user":"TwistedContent","rank":[12,14]},{"title":"Brainless budget Zombie Trash","rating":3,"date":"4 December 2018","review":"Oh dear where do you start with this? The terrible zombie effects, the characters so poorly written you don't care even a little bit about them, the terrible action and fight scenes. Guns with endless ammo, bargain bin script. Only Dolph Lundgren it seems is aware of what kind of movie he is in and plays it corny. Some fun if you want to crack open some beers with friends and have a giggle, otherwise avoid this one.","user":"arranwilson","rank":[8,9]},{"title":"Terrible","rating":1,"date":"4 December 2018","review":"Cheap and amateurish, looks like it was shot on someone's phone.So bad I couldn't finish watching it. This movie is worse than any of the ones shown on MST3K","user":"dalxray","rank":[7,8]}]