[{"title":"Absolutely horrendous","rating":1,"date":"12 March 2018","review":"This movie is as close to insufferable as it gets. I thrive off of tacky teen movies, but this is next level. \nThe characters are incredibly unrealistic and lack any depth whilst the script is cringey and so far out of touch it leaves me questioning if the writers have ever actually held a conversation with a youth in their lives (ttyl? g2g? Are we back in the era of flip phones?). \nDon't even get me started on the costumes, a young teacher wearing clothes fit for an elderly woman does not lead us as the audience to believe she is,in fact, an elderly woman... \nAll of this displayed not even 15 minutes into what may just be the most horrific representation of the high school experience I have ever had the displeasure of bearing witnesses too. \nI would only recommend you watch this movie if you enjoy cringing and snickering at the notion that some 12 year old, somewhere is lapping this movie up believing that this movie is an accurate representation of teenage and high school experience.","user":"gabrielledesmond","rank":[40,49]},{"title":"0/10 stars if possible","rating":1,"date":"7 March 2018","review":"Cliche teen-flick-trying-to-top-mean-girls film with cliche, expected scenario's and hot actors to hide the terrible story. Very cheesy and no where near a funny movie. Very superficial and sending out a message that \"being popular\" is the only way to survive. Don't watch the film and save yourself some time, I have no idea what the writer of this film was thinking.","user":"karinacejas","rank":[29,36]},{"title":"This had so much potential, yet failed miserably","rating":2,"date":"27 March 2018","review":"I absolutely adore teen movies, but this was probably one of the worst ones I have ever seen. It had such a good story line, that could've been a brilliant movie but for some reason I was so BORED and felt so cringe during most of this movie because of the cheesy lines. And all the characters in this that I wanted to get together never even ended up getting together. I (personally) think that maybe the fine bros should stick to youtube","user":"niamhmcmanusisherehi","rank":[27,34]}]