[{"title":"Nothing outstanding here...","rating":4,"date":"20 September 2019","review":"Well, initially I didn't have much of any particular expectations for \"5th of July\", given the assembly of cast that were in the movie. But still, I sat down to watch it.<br><br>I will say that the movie was actually off to a good start, but it lost its momentum about halfway through and settled into a generic and monotonous pacing, where it seemed like director Camilo Vila had already used all ammunition in the first half of the movie. It was a shame, because the movie suffered terribly from this fact.<br><br>Now, the movie starred Jaleel White, which actually did well enough for himself, given the fact that the script and storyline here were pretty weak. And he does fit best into comedies, at least in my opinion. Brent Briscoe was actually quite fun in the movie, especially given the character he was playing.<br><br>For a comedy, then \"5th of July\" wasn't particularly outstanding. There were some laughs here and there, but overall this was a less than mediocre comedy experience. There are far better comedies out there, and this is hardly the type of movie that you will watch more than once - provided you get through it the first time.<br><br>This movie lands a four out of ten stars rating from me.","user":"paul_haakonsen","rank":[7,8]},{"title":"AMAZINGLY FUNNY MOVIE","rating":10,"date":"2 March 2020","review":"First I'll write what the movie is about fallowed by my review: Anything that could go wrong, will go wrong, that's basically the premise of the \"5th OF JULY\" story. I saw this amazing movie at the beginning of the year at the LA LIVE CINEMAS and the audience, including ME, couldn't stop laughing, it was contagious. The movie NEVER has a dull moment. The story and the editing keep it moving the whole time. All the actors find a perfect pitch for their characters. They are ALL great. Camilo Vila's masterful directing made it all happen. If you want to have a laugh and be entertained for 90 plus minutes, I highly recommend this good nature family movie. You may even want to have popcorn while you enjoy the movie! Trust me, YOU WILL LOVE IT.","user":"matacena","rank":[0,0]},{"title":"Good Movie","rating":7,"date":"31 December 2019","review":"This was much better than it's rating, It was entertaining from beginning to end.\nReally silly, but that's Comedy.","user":"Ericbaeker11","rank":[0,0]}]