[{"title":"Non-Stop Action with Magnificent Choreography","rating":6,"date":"15 May 2018","review":"In Cambodia, the police arrests the gangster Playboy (Savin Phillip) since they believe he is the leader of the Butterfly gang. However Playboy is only responsible for laundering the money and other crimes and accepts a plea bargain to disclose the identity of the true kingpin. The local police officers Dara (Dara Our), Tharoth (Tharoth Sam) and Sucheat (Dara Phang) and the French officer Jean-Paul (Jean-Paul Ly), who is visiting the Cambodia, are assigned to escort Playboy to the maximum security prison. Meanwhile, the mobster Madame Butterfly (Celine Tran), who is the true boss, puts a bounty on Playboy. The officers deliver Playboy and when they are leaving the prison, there is a riot and the inmates escape from their cells. Now the officers and the security guard that is guiding them have to fight to survive. <br><br>\"Jailbreak\" is a highly entertaining Cambodian film with non-stop action and magnificent choreography of the fights. The plot is very simple but the fights are excellent, and not only for fans of martial arts. In addition to the choreography that recalls a videogame, the film is attractive since it is witty and funny. My vote is six.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[12,15]},{"title":"Top notch martial arts movie from Cambodia!","rating":9,"date":"21 July 2017","review":"Just saw this at a film festival! With the brutality and technicality of the fights in the \"The Raid\" movies with some inventive camera work and AMAZING choreographies, this movie hits hard! Is this the awakening of the Cambodian movie industry? I sure hope so because this movie nailed it! It's not a perfect movie by any means, there are some weak elements to it but I have to give it a 9 here, a 8 just doesn't do it justice! Seek it out, check it out when it gets a wider release!","user":"evildog2000","rank":[14,21]},{"title":"I like it, but mostly dislike it. Watchable.","rating":7,"date":"1 September 2018","review":"Minor spoilers below.<br><br>While this movie has good fight scenes that you can follow easily it falls short still. Like they go up against a whole room of dangerous prisoners that don't care if they die or not but the main leads still decide to do ground takedowns in the midst of a riot. It makes no sense to me why they'd do that. I've seen this movie compared to the Raid in quality but it's far from it. Or in all honesty, it's a dumbed down version in my opinion. Here's my main issues with it:<br><br>The main cast looks way too young. This might just be a preference for me but they look like they came straight out of high school.<br><br>The main lead apparently has a super power that makes him op whenever it's going bad for him. Commonly seen in other movies but here it's just out of the blue and without explanation. And I still have no idea why he sometimes can't understand his colleagues but later on he has no problem whatsoever with understanding anyone. Towards the end it's clarified that he came from France to participate in the mission. Quite sure it was briefly mentioned earlier at the start but still.<br><br>There is also a woman on the team but she sadly ends up filling some common tropes. At first I figured she'd be on equal terms with the men(not sure if I should've believed that at all now, thinking due to cultural differences and stuff) but to the point, don't go in thinking this gal will get a fair treatment. She starts out by being able to kick ass, but later on she needs to be rescued/protected. She's also about to be raped(supposedly) but is rescued by the male lead. <br><br>A bit later into the film the main lead who got just got stabbed in the arm suddenly decides to shut her out of a fight with a \"boss\" just so he can almost get his ass kicked while she can't do anything to help because she is closed behind a locked gate that the main lead himself closed. I can't understand why he didn't let her join instead, 2 vs 1 would've been better since they aren't exactly safe in a prison full of dangerous criminals. And the boss prisoner is well, a boss, he had the skill to take the two of them on I believe. Not your average grunt prisoner.<br><br>And this woman that is on the team suddenly gets to fight the big bad villain in a sword fight. And kicks her ass. That brings me into my final point, they keep leaving each other in the midst of a fight or when a fight is about to begin. Someone just darts off and leaves the others hanging. Not a lot of trust in this group so to speak. And nobody even mentions that afterwards either.<br><br>That was probably most of it. I'd say it's worth watching if you are looking for a movie with good fight scenes but it is plagued by some poor choreography decisions. According to me, I'm not a choreographer myself but common sense tells me that you don't go to the ground when surrounded by people and more. \nBut on a whole I did enjoy the fight scenes.<br><br>I don't want to be too harsh against the people who made the film but I feel that I need to be honest with how I feel about the movie.","user":"niborino-52548","rank":[4,5]}]