[{"title":"Exactly what you are expecting","rating":10,"date":"10 February 2018","review":"Do you know what is like when you don't want a movie to end? That's exactly what you get by watching that movie. A twist of love, laughter, a good story, that's all you need. I enjoyed it more than expected to be honest and it's being a while since I had that feeling from a film that kind. Perfect cast and good storyline.","user":"yellowblack3","rank":[94,115]},{"title":"Wholesome FeelGood RomCom","rating":8,"date":"10 February 2018","review":"Honestly, I went into this movie with low expectations, and I came out pleasantly surprised and amused. I like Adam Devine, especially his work in Workaholics, and find him quite funny. Alexandra Daddario, in my most humble opinion, is such a total BABE; so fine omg. Anyway, I digress; this movie was just super wholesome and left you with a good warm feeling when you finished it. Sure it was cliche at moments and you could basically predict the plot if you're an avid movie watcher, but I don't think that takes away from the movie in general. If you came into this movie expecting an oscar-winning crazy complex contemporary movie that made you really think about it's major themes and underlying messages then I'm sorry but you're going to be sorely disappointed. However, if you go into this movie with an open mind, a fun mood, and some popcorn, I believe you will come to enjoy this movie for what it is: a Wholesome Feelgood Romcom.","user":"dhaha-18101","rank":[69,85]},{"title":"Awesome movie!","rating":10,"date":"17 February 2018","review":"Just have to say I loved this movie and found it to be sweet, touching, funny, and refreshingly good.:) It had good acting plus didn't lower itself to idiotic dumb gags or the usual low level chick flick. It even surprised me a bit in the end and I only hope that Netflix makes more movies like this. This is probably one of the few Netflix self made things that I actually really liked. It's perfect for a date night or to watch single or with friends. My hubby liked it too which means if he liked it (who usually doesn't watch this type of stuff) then that's saying something...;)","user":"rhoda_s_girl","rank":[50,64]}]