[{"title":"I'm just a medic","rating":5,"date":"17 July 2017","review":"Jake Carter (Mike Mizanin ) is back as an EMT. If you have missed the first four films we get a summary from his partner (Anna Van Hooft) : Two tours Afghanistan, Bronze Star, private security company. Now you are caught up. A couple of guys do a \"hit\" on the leader of the Lost Legion biker gang. We know these guys are tough because they wear black leather jackets with a skull on the back. They get bullet sprayed and pull into a parking garage of an off-season amusement park and call for help from a location where we find out later that cell phones don't work. Just saying. The biker gang follows, and we end up with a\" P-2\" hide-n-seek game for about an hour before they play cat and mouse outside.<br><br>It was less than what I expected. I expected a quick parking garage scene, Miz, left for dead, then have him arm up with swagger music and go \"Death Wish\" all over the gang, solving the US heroin problem. Apparently they paid too much for the use of the park and had to film the entire movie there, one long fight scene. They had scenes that looked like they belonged in the ring, including the unreasonably long pauses between some moves. The production included an ax and blood splatter. Miz essentially has to kill other WWE guys dressed up as bikers. I was very disappointed in the script.<br><br>Guide: No sex or nudity. No swearing as I recall, although rated \"R\" for language.","user":"nogodnomasters","rank":[4,4]},{"title":"problems problems","rating":4,"date":"23 April 2018","review":"For being a Marine that knows how to use guns Jake Carter apparently suffers from the \"A-Team TV Series\" syndrome. Bullets fly everywhere and, and, and, what for it.....meh! I guess Jake got tossed for not being able to hit the broad side of Pikes Peak.","user":"steveo-77100","rank":[6,7]},{"title":"Full of action that tries to have an important and meaningful story but ends up being a little cheesy","rating":5,"date":"1 May 2017","review":"\"I'm sorry I called you down here. I'm sorry any of this happened. I was just trying to protect my daughter.\" Jake Carter (Mizanin) is adjusting to life outside the Marines and is working as an EMT. When him and his partner go to check out a call they find something much more than just a man in health trouble. This is a movie that gives you what you want, and doesn't try to be more than it is. This is a very good 15 minute story idea that is drug out into a full length movie. The moral and character issues the movie deals with are kind of glossed over, but that isn't that surprising in a movie like this. The movie is full of action that tries to have an important and meaningful story but ends up being a little cheesy and makes you wonder why they are helping this person. All that being said, no one watches those movies for the story and plot so if you are looking for an exciting action movie this is one for you. Overall, exactly what you are expecting. Nothing more, nothing less. I give this a B-.","user":"cosmo_tiger","rank":[6,8]}]