[{"title":"blech","rating":4,"date":"12 March 2019","review":"This isn't really a movie. It's a religious/philosophical treatise disguised as a movie. The plot is that a religious journalist has an interview with a person claiming to be god. The standard pattern of these things is that the interviewer, who is the stand-in for the audience, at first thinks he's talking to a crazy person but gradually comes to believe he is actually talking to god. The movie hopes the audience will come along for the ride and give the ideas presented the weight thereof.<br><br>The fundamental problem with anything like this is that it is so effing arrogant. I mean, could you be more self-indulgent and arrogant than to say you can define the personage and motives of the creator of the universe? Beyond that there is the secondary problem in that the movie is taking a stand of sorts on which religions are correct. If the movies espoused beliefs happen to align with your own you may not see a problem with that, but I don't care for that approach because it reduces god to a kind of supernatural parent confessing to the audience that he has a favorite child. It might feel great to hear \"god\" say you are his (her/its) favorite, but I have a problem with any idea that sounds like the central thesis of a religious war.<br><br>Anyway, I don't want to go into any more detail because this is a really touchy subject for so many people, but I'll just say instead that I don't think this is a very good film; it's preachy, judgmental, and not interactive. You have to sit there and listen to them regurgitate their belief system all over you, something better suited for a sermon at your house of worship then as entertainment.","user":"ivko","rank":[49,71]},{"title":"Don't Miss The Point Of This Movie As Many Others Have.","rating":8,"date":"10 March 2019","review":"Interview With God is not the average Spiritual/Christian movie as it does not have many religious fundamental overtones, nor is it Holier-Than-Thou- preachy.\nThe movie establishes that it wants everyone, regardless of believers and/or non-believers, to watch this movie by having the interviewer ask God about Atheist's being moral. God replies that yes, atheist's are moral (good people); never mind the tongue-in-cheek joke God says afterwards as it has no meaning in this movie.\nThe movie deals with waning Faith, loss of Hope, Love is going away, and that Life is not a proving ground for Salvation.\nFrom the onset of the movie we overhear the protagonist speaking with a war-buddy (although he was a reporter in a war zone) and it is said the buddy was crying and called seeking leads to professional help for possible PTSD.\nThe protagonist is also depressed to the point his mind is mostly dwelling on his marital problems which leads him to be careless while riding his bicycle in a large metropolitan area; near misses with cars ensue but he does not notice. The wife is also depressed as she has had an affair and does not see how she could ever be forgiven for her transgression to her husband.\nProtagonists boss at work admits when his own marriage failed he got real low and sought professional help.\nWhat comes from the conversations with God is that this movie is about loss of Hope and suicide. God intervenes in his life because he cried out for help. His Faith was shot, Love was going, and Hope was waiting to take the midnight bus out of there too. Oh, and protagonist was suicidal but didn't realize it.\nWhat the movie tries to instill, by story line and conversation with God is that there is always Hope, Forgiveness, Friendship, Love, and that it is never too late.<br><br>The movie is actually quite brilliant in its delivery. The conversations with God are humorous and poignant. But, if you are looking for a deep theological movie and the answer to life, the universe, and everything...that pretentiousness is not here.","user":"zhadowlordever","rank":[47,70]},{"title":"Not quite. Missed opportunity.","rating":6,"date":"2 September 2018","review":"I love spiritual themes. This movie missed the mark, in my opinion. It's got so much potential, but it's squandered. I loved The Shack which wasn't perfect either but it came much closer than this movie. <br><br>\"Interview\" asks great questions but doesn't deliver any satisfying answers. I know it's good to leave things unsaid and it's not good to spell everything out for the audience, but they leave way too much unsaid - so much that this ends up being a nothingburger. <br><br>Oh, God! Was 10x better. \nEvan Almighty! Was great. \nBruce Almighty! Was great. \nAnd many others do a much better job. This just raises questions. It baffles me how screenwriters can get away with such a big miss. There is so much good info available on how to write a great screenplay! <br><br>Every movie can be boiled down to the \"author's message.\" The message here is that \"god is good and mysterious.\" Gee, thanks.<br><br>It's not clear if the author has an opinion and is simply unwilling to share it or if they only have faith and questions.","user":"danielendy","rank":[34,52]}]