[{"title":"Good Acting By Shay Mitchell As Custody Of The Corpse","rating":8,"date":"5 December 2018","review":"Rating 8.8/10\nIt's a good horror flick. Good acting performance by Shay Mitchell !! This was scarier movie than the other horror movie this year in Malaysia !! Go see it you wont regret it.","user":"ymyuseda","rank":[153,204]},{"title":"A flawed but Good Horror that didnt need certain scenes.","rating":8,"date":"1 December 2018","review":"The Possession of Hannah Grace is good but flawed in certain areas, not that this was a complete disaster of a film the running time was great for this type of film, the minimal cast works for the film because it gives the feel of isolation and close spaces.<br><br>Mitchell role in this film is great in giving the audience a scene of someone that went through a shocking experience which broke her, in order to coupe she applies for a job as a graveyard shift of a hospital Morgue, which turn into a complete nightmare.<br><br>She pulls this performance off really well, give us a believable character, as well as the other cast member with their respective roles really set the tone for the film.<br><br>Special Effects/Make-up that gone into this film from Grace's body which is crushing to the soul, an amalgam of twisted limbs, horrifying scars, and look that penetrates through your being making you unsettled, unwilling to give you any relief as her eyes follow you across the screen really works to make the audience unsettled.<br><br>As it like if though its a film, it like she actually looking at you seating in you're seated, which make it even more unsettling. Special later on which the way they have her move is just the creepiest thing ever make you squirm in you're seat.<br><br>The backdrop of the morgue with concrete walls, corners that have a light sensor that you have to walk down for the light to come on really making this film tone unsettling as the only exits is a Lift and a door that leads to the main building. It gives a sense of feeling of being in an isolated area of the hospital with a creepy tone.<br><br>The story wise the film is predictable but it's easy to follow and understand on what's happening although there were scenes that I would have taken out and change just to make this film hell of a lot more frightening than it was.<br><br>Which is why im saying the film is great but flawed because there are certain areas of the film that kind of make the film less scare and kind of loss the audience toward the end. This is similar in a way to a film called the autopsy of jane doe giving the audience creepy moments, giving that psychological tone which gets under your skin moments, but where this film differs from that film is it kind of losses the audience toward the end although the film has great entertainment.<br><br>Dislikes: What this film does wrong is the First scene, this wasn't needed in the film, why? Because the scene after with the body turning up with no explanation, then all of a sudden things started to psychologically happen, this would have given the film its edge and got rid of the predictability of the film.<br><br>It should have kept these small supernatural moments all the way through to the third act of the film, see in the third act of the film you would reveal who the body is and what happens, that's when thing would start getting more dangerous this is kind of how this film should have gone, not that it wasn't a good film to watch.","user":"gerry_barnaby","rank":[56,84]},{"title":"Decent creepy film. Think The Lazarus Effect meets The Autopsy Of Jane Doe","rating":6,"date":"7 December 2018","review":"I wasn't expecting much going into this film. I saw the dreadful critic reviews so I went into the movie expecting the worst. Surprisingly .. it wasnt bad . The whole \"possession\" concept is nothing new of course. It's been done millions of times. But I like the way they went about this film . It was a good storyline , creepy imagery , decent acting , etc. One thing I'd like to point out is the great cinemotography , especially after finding out the entire film was shot on a Sony a7SII, which isnt a \"Hollywood film camera\" by any means.<br><br>Now the negative and the reason why I gave it a 6/10. This added nothing new to the horror genre and will surely be forgotten . In a way I felt like the film maker didnt know where he wanted to fully go with the film so he kinda bounced around with elements. The movie is really short, not even an hour and a half long, yet it feels like certain parts of the film dragged and other parts were incredibly rushed .I wish they would've taken more time on the backstory of the main character for us to connect with her more. Also the ending was confusingly rushed . Could've been a solid 8 if the pacing of the film was handled more correctly . Would I reccomend paying your money to see this ? Meh , if you have NOTHING to do then yes. Otherwise catch it on redbox","user":"tonyjcole94","rank":[38,55]}]