[{"title":"not Oscar-winning, but finally something new.","rating":6,"date":"13 October 2017","review":"Well I thought it was a clone of Saw and I like Saw so I gave it a shot. <br><br>Turns out it's not a clone at all, it's an original movie. Can you believe it ? A horror film with an original scenario ? Not your typical house-in-the-woods horror film, for sure. Thumbs up for that. <br><br>This movie is not exceptional. But it was so happy to finally find a horror movie which actually offers something new. <br><br>Acting is average, but a special effort has been made to the sound effects. The snitch sounds like he is 200 pounds, and that makes him really scary. I've seen a lot of horror movies, and I'm not scared easily, but this one has definitely a nice tension. <br><br>TLDR ; not Oscar-winning, but finally something new. I recommend.","user":"achmoye","rank":[18,25]},{"title":"Not worth watching","rating":1,"date":"22 September 2017","review":"This really was a big waste of time. There is no character development, no eerie, no suspense, and the plot seems to linger and linger. One star is for the antique shop lady, rest of the movie, especially the beginning, deserves zero. The Arabic beginning didn't make any sense honestly. The worst horror movie I've seen in years.","user":"ylmaz-pelin","rank":[23,34]},{"title":"Interesting idea, doesn't really go anywhere","rating":5,"date":"18 September 2017","review":"For a movie that really takes place in only 1 room, it's not too bad. There are a few decent performance and the girls are great to look at but it never really delivers anything new.<br><br>I'm tickled pink to see Skeet Ulrich and Sean Young back in action and the main 4 actors were pretty good but the story just kind of lays there and never really grabs you.<br><br>Pros: The 2 girls are really pretty. The 2 guys do a competent job. Not bad for a movie that probably cost pennies to make. The actors made the best with what they were given.<br><br>Cons Inconsistent story and no real surprises. More padding than a training bra. It's an hour long movie stretched into 86 minutes through use of extreme slow motion. Plus, the main characters could have done a lot more to fight the 'monster'. They had a whole room full of potential weapons, lighters, plates, 1 chair, furniture etc. Screaming and swearing at demonically possessed killers never seems to slow them down.","user":"jbar19","rank":[23,36]}]