[{"title":"Welcome the ending... or not","rating":6,"date":"19 August 2018","review":"The ratings for this movie range in number according to the level of perception and capability for analysis of their viewers. It's not a memorable movie, but it isn't that forgettable, either. I will admit that I only watched half the movie only for the mansion. Had the scenes been placed in an ordinary apartment, I would have given up and turned it off out of boredom and the stiffness both characters seem to enjoy sticking to. The main character, Alice, could have had more potential and would have been more credible in the end if, the entire first half, the actress hadn't been walking around like a robot with her eyes wide open, with a stiff head which seemed to be attached to her body in such a way that she had to move the whole body to turn her head around. The brother could have been better featured too. Given their apparent background, it is expected that they were more obscure and shared a vision of things different from that of ordinary people towards random events. The way both siblings communicate to each other makes them strangers, not in a metaphorical way but rather in a bad-plot way. For the second part of the movie, I don't have many objections. I think, unlike many other reviewers here, that it is when the strange girlfriend turns up that the tension spices the story a little and lets it improve. From this point on, we are presented with a series of what seems to be mind games and the product of insanity. The end reveals that it wasn't really insanity but a stranger feeling more than welcome.\n---------------------------Spoilers--------------------------------------------------------------------------------\nIt seems that many people did not understand the plot. In my view, it goes more or less like this: Girl who looks seriously messed up carrying a heavy burden on her shoulders (which we never entirely know what is about, probably the fact of just being herself) reunites with her introspective brother in a mansion somewhere near L.A. according to what we are told at some point. She meets him while she is swimming naked in his pool, which is a natural thing to do when you visit your long stranged brother, instead of, for instance, ringing the bell. The brother is working on a comic book and has no free time to wander around with his sister because he is on a deadline. Yet, the arrival of his sister distracts him with idiot games like looking all over the house for his favourite silver pen, which we can assume he himself hid in the first place: at the end of the movie we see him writing with it as if it had never been misplaced. We learn that Alice, the sister, has left her cheating boyfriend and, by the choice of words she uses, we also notice she is the possessive kind. (\"He was mine\").\nStrange lights appear in the sky, and Alice meets a strange mute naked girl indoors who leads her outside to some place in the garden. The lights become something similar to the lights from a spaceship and seem to abduct them both. Next, we see Alice rolling off the bed victim of a nightmare. Alice is feeling different. She doesn't feel like smoking or eating her nicotine chewing gums anymore because they feel tasteless. Meanwhile, the brother doesn't work in his comic, making geometrical doodles instead. Those doodles are also represented with lights in the sky in two occasions.\nEnters stranger, the girlfriend with no background or history, whom the brother has never mentioned before, which we later wonder if this is because she didn't exist before or if the incestual tension he shares with his sister made him forget about it or maybe put it in a second place, or perhaps even avoid mentioning it so as not to make the possessive sister jealous. The tension between the to women to gain power over the brother is a given. Both play with the man's mind to earn his trust and leave the other one. But only one of them is telling the truth.\nA glowing insect that looks like a timid hornet on the kitchen floor is captured in a bowl by the scared brother. The insect looks like an outer space spy or a symbol of incest (instantly reminding us of the word game in the movie Angels and insects (1995).\nRandom events afterwards, the three joins for dinner and we learn the sister is pregnant, which triggers an argument between the siblings about not being entirely honest to each other. During sexual intercourse the man strangles his girlfriend while her face repeatedly oscillates from hers to the sister's. Although we presume this is a product of the man's imagination, we can not conclude whom he was really trying to kill, or better yet, whose death was he really getting off with. With the girlfriend lying dead in bed, the sister breaks into the room bleeding in what we understand is a miscarriage. We can assume that the pregnancy was alien-induced and that the moment the alien girlfriend died, everything non-terrestrial died with her. This theory is strengthened by the insect vanishing into thin air. The brother, unsure about the latest events, tells his sister to join the girlfriend in that \"better place\" she insists about, so the woman goes to the pit where she was theoretically abducted the first time and where they have put the girlfriend's corpse expecting that \"they\" will take her away, and waits to be taken. The brother stays indoors making his geometrical doodles in parallel to the lights, copying the scheme in the sky. When the doodled shape closes its dots in a complex of squares, a sudden light in the sky expands and falls on the sister telling us that she is, in fact, being taken. Some time after, we are not shown how long, the brother finally finishes his book (without distractions) which seems to be a sum of the latest events. Suddenly, he hears a splash outside in the pool. Here is when the story could have been so much interesting. For a second I thought the splash had been made by the sister, leading us to the first time they meet, which would have made the story circular and unpredictable. But we actually see the girlfriend, who is back and alive.\nThis somehow disappointing ending leaves us wondering if the sister ever existed, in which case, was she even ever there and also if all this was the dreaming of a man immersed in his artistic work or if he is in fact partially insane. But it also leaves us wondering if the events were real and the sister has been abducted and the alien girlfriend returned instead, and in this line, like a sequence of Chinese dolls or matryoshkas, whether in that reality the girlfriend is the one that returned because she was whom the man chose to have around, what would make the girlfriend the winner.\nAll in all, the movie could have been way better with better actors, more believable characters and dialogues and a better ambiance. Although the main idea is really good, it could have been developed quite more superiorly, which would have led to a supreme product.","user":"lorenavadelg","rank":[8,8]},{"title":"Phenominal acting and Stupendous writing over shadowed by a horrible plot conclusion.","rating":3,"date":"21 March 2018","review":"This film is a very interesting feature that psychologically ascends reaching many levels. A mystery thriller with very mild hints of disturbing scenarios preparing to unfold. The storyline moves at a slow pace but always remains intriguing and entertaining through out. It also pushes the boundaries a bit but not quite enough to really set this film apart to stand out from others and become memorable. <br><br>Now the obstacle with storylines that try to be unique and edgy with a psychological twist boils down to one factor, If they do not know where they are going or if they have no idea how to explain the events that unfolded on film most movies like this one will just quit and run the credits as if it's the viewers fault for not hypothesizing a good ending or leaving it to ones own interpretation to figure it out. Ultimately at the end you'll feel as though you've wasted your time and now your more angry than the chrachters you just watched on screen. Was this scene a dream she had or did this really happen, Was he hallucinating etc.etc. We watch intriguing movies to experience someones story not imagine our own explanation. <br><br>This film was a very interesting ride until you realize at the end it's just a hampster wheel going nowhere. \nI advise you to skip this film it isn't worth the time but if you have a couple hours to waste you should enjoy it.","user":"tkaine3","rank":[27,34]},{"title":"Oh dear its another one of those!","rating":3,"date":"5 April 2018","review":"Apparently this is another of those incredibly arty and sophisticated films that none of us poor proles can understand. Welcoming the stranger beinng taken from the bible and presumably refers to the aliens in the film - really?<br><br>The film was a complete borefest from beginning to end.\nThe acting , what there was of it - not much just lots of long stares and supposedly meaningful incestuous looks - lots of things thrown at us from alien abduction to matricide.<br><br>I oft hear the reviewers who are so up their own bum they wear their ass for a hat say that the film leaves you to decide what it was all about - No I dont buy that horse manure , I am afraid that is what ass-hat brigade roll out when even they cannot actually explain what the whole thing was all about - It was not artful , it was not particularly well acted and it was nothing more than an exercise in self indulgent pseudo-intellectual celluloid self aggrandisement!<br><br>Take from it what you will - No thanks I should have just watched some paint dry!","user":"omendata","rank":[19,30]}]