[{"title":"From A to B","rating":8,"date":"4 October 2019","review":"I cannot believe the negative reviews. The way the cocaine travels from a to b was amazing. I like the way the price kept going up as it reaches its destination. Tons of unexpected moments....I recommend Highly.","user":"antique-modern","rank":[42,60]},{"title":"A documentary of the \"do's and don'ts\" of running your own cocaine empire","rating":8,"date":"23 September 2019","review":"Just kidding.<br><br>Newbie (only his second film) writer and director Jason Cabell is a former Navy Seal and inspired the story from true events. He did a decent job behind the camera and in directing his cast, but his writing certainly needed some tweaking. Some scenes were too long and others needed more information (e.g the dinner plate and it's people), so there were obvious plot and technical issues with his screenplay.<br><br>\"Running with the Devil\" is fascinating when dealing only with procedure, with Cabell capturing the machine of trafficking and its problematic participants, with a few unable to refuse an opportunity to sample the goods, either to satisfy themselves or impress others. Cabell doesn't craft a nail-biter, but there's underworld awareness here that gives the feature something different to do.<br><br>Double-crosses and hasty decisions return in the final act of \"Running with the Devil,\" which becomes more formulaic as Cabell tries to figure out a way to tie up multiple subplots, with special concentration on The Man, who can't dig his way out of trouble, and The Agent in Charge, who understands the futility of enforcement, but can't quite give up the hunt. Cabell delivers some tepid turns of plot, though he does have a cast capable of making thin screenwriting come alive (Fishburne is having his fun here, and Bibb does well in dogged pursuit mode, and Cage is very fitting and convincing in his character), helping the viewing experience to a certain degree. No one will mistake \"Running with the Devil\" for a documentary of the \"do's and don'ts\" of running your own cocaine business, or on the global crisis, but Cabell doesn't completely commit to dramatic exaggeration, keeping observation alive for good stretch of the movie.<br><br>The pacing was quite good with a constant story non-stop, that the 100 min run-time breezed by quickly. The cinematography was on point, and the score decent.<br><br>It's a well deserved 8/10 from me.","user":"TheTopDawgCritic","rank":[54,79]},{"title":"Fast paced and brutal drug supply chain story","rating":8,"date":"22 September 2019","review":"Great actors, great story, apparently inspired by true events. These \"events\", often brutal, are probably every day occurrences in the bizarro world of the drug business supply chain from the jungle to the end user, hapless addict.","user":"michaeltodaro-99700","rank":[37,56]}]