[{"title":"Moving Asian drama","rating":8,"date":"15 November 2017","review":"Extremely well made production from the BBC about a young Indian man wrestling with his conscious. Deeply in love with a white English girl, yet unable to bring himself to tell his his family who want him to marry a nice Indian girl. As he tries to bring himself to tell his family this leads him on to a voyage of discovery about his family which he was previously unaware of. Beautifully written by Mick Ford and Sathnen Saghera and terrific performances throughout. Highly recommend 8/10","user":"peterrichboy","rank":[7,8]},{"title":"A gem","rating":8,"date":"24 November 2017","review":"An out of the world performance by Deepti Naval and Anupam Kher. An outstanding tele-film by BBC highlighting the issues that the Indian community can face in UK. The mental health issue which we all try to ignore, try to hide while we tend to mix only within our own community, only within our fellow Indians makes our life harder. The film handles the issue within the Sikh community. For a Muslim, there is another layer of complexity. It is hard hard life out here. I cannot thank enough to BBC for creating this gem of a film.","user":"monishsengupta10","rank":[6,7]},{"title":"Growing up","rating":6,"date":"6 December 2017","review":"The Boy with the Topknot is adapted from journalist Sathnam Sanghera's memoirs. A Wolverhampton tale of a second generation immigrant who arrogantly thinks he has made his way in life and love on his own terms<br><br>Sathnam (Sacha Dhawan) is a Cambridge University graduate, a journalist and in love with a young white girl. She wants to him to tell about her to his parents. He is reluctant and ends up losing the girl and eventually his job.<br><br>Sathnam's mother (Deepti Naval) wants him to marry a nice Punjabi girl. Sathnam never realised what exactly was wrong with his father (Anupam Kher) and why he did not work. His father developed schizophrenia. As he delves further into his family history he discovers that his mum had little choice as to who he married and that her husband had a mental illness which would sporadically result in violent outbursts.<br><br>Maybe because this drama is condensed into a 90 minute film it never really got underneath the surface. A drama of a journalist who never uncovered his family's secrets. He could not even speak Punjabi. When he finally communicates in a heartfelt manner to his mum, it falls on deaf ears, she can never understand his desperate pleas.","user":"Prismark10","rank":[5,6]}]