[{"title":"Boring, exaggerated and stupid ending","rating":1,"date":"9 September 2017","review":"Don't waste your time with this one, it starts as a drama about a mother dealing with an autistic child and then it turns into some sort of satanic or cultist rituals from a Filipino old lady to steal a baby, planned for months apparently.<br><br>The story development was so unbelievable and annoying that by the end they just rushed the story ending and in less than a minute they \"explain\" everything and end up with an abstract scene about the old lady escaping with the baby.<br><br>If the real mother really wanted to be heard and that the other believed her story, she should have used her expensive iPhone to record video instead of only translating audio from Filipino to Spanish, audio that was not saved.<br><br>Waste of time and money making this awful movie.","user":"exs","rank":[24,30]},{"title":"Good movie but bad ending","rating":6,"date":"13 October 2017","review":"The movie was good but the end was TOO MUCH. I still don't understand the reason they did that and WHERE did they go at the end? Sorry but it wasn't a clear nor a pleasant ending. But I think it was a good movie but the ending didn't make much sense. They should had done a better job for the ending.","user":"the_crazy-09035","rank":[12,14]},{"title":"Babysitter","rating":6,"date":"20 March 2018","review":"I guess with movies like this, it's one or the other. But most likely the one thing you expect. So while you may not feel many surprises in the story/thriller, you may like how the tension is being build and the acting in general. It's not an easy watch, especially when and if you care for one of the main characters. Problem being you might not care that much.<br><br>So watching the wife and her husband, the question is, if you are supposed to have positive feelings towards the Babysitter? Now the ending on the other hand will either leave you satisfied because of the way everything is \"wrapped\" up or you may hate it for how it handled the whole thing. Not sure if it is a make or break thing though - I think you will know much earlier ...","user":"kosmasp","rank":[5,5]}]