[{"title":"Resident Evil Vendetta: Weakest of the animated movies","rating":5,"date":"17 July 2017","review":"I'm a huge Resident Evil fan, from the games to the movies and including the previous animated attempts. They didn't exactly set the world on fire but they were perfectly watchable efforts.<br><br>I was very excited to hear about this being released so perhaps my expectations were a tad high, and I can confirm they were not met.<br><br>The story very generic, the animation sub-par and the fight scenes were let's just say interesting. For some reason the creators thought they'd blend Resident Evil with The Matrix as the characters seem to be able to move neo-style to such extents I found myself cringing. These are average joes not ninja *Slaps creators wrists\" bad creators, bad! Seriously why is Leon Kennedy doing bullet time triple back-flips with a dragon screw rotation while shooting zombies in the head and throwing knives and writing an essay and having a length conversation with his girlfriend before even landing? I mean okay that's a tad exaggerated but not as much as you'd imagine.<br><br>Vendetta isn't bad, it's just silly and anti-climatic compared to the previous films.","user":"Platypuschow","rank":[22,32]},{"title":"it's really not that great","rating":5,"date":"21 June 2017","review":"chances are, if you are like me (a fan of R.E. who hates the live-action atrocities but embrace the animated films), no review will change whether or not you see this movie. i'm writing this so people aren't let down the way i was. <br><br>visually, the movie is stunning. they did an incredible job on things like facial micro-expressions and other great little touches. i consider it nothing short of a triumph of animation. unfortunately though, the pros end there. our heroes have apparently utilized a Doom-like invincibility cheat; i have no problem suspending disbelief for zombies and monsters, but i draw the line at things like a plane's wing blowing up, except, it's our heroes' plane, so, it's just arbitrarily alright. it's interesting how often you can use the word \"arbitrary\" to describe what goes on in this movie. a lot of the action makes you wonder why our heroes aren't wearing tights and capes; they regularly take hits that don't maim or kill only them, and every now and then do things that make you wonder whether or not they are from the Matrix. there is a core character who is so oddly under-utilized you wonder why she's even in the movie (until you consider the need for filler, of course). apparently the zombies can move like cheetahs if they wish, but most of the time choose not to do so. there are red herrings which ultimately only serve to anger the viewer, such as the zombies being able to target specific people, a plot device used quite shamelessly for just one situation in the whole movie. <br><br>overall this is a movie you should watch on mute, because you won't be missing anything; it looks good, but the filmmakers are obviously quite aware that anyone into R.E. is going to see it, and consequentially there is a lazy, almost cash-grab feeling to the story. for a movie whose plot is a Raccoon City fiasco in NYC, honestly it's quite boring, and almost all of the action scenes are pretty much just lifted from other, better movies. if you're an R.E. fan, i'm sure you'll see this no matter what; just don't say you weren't warned!","user":"bmdizzy","rank":[32,49]},{"title":"An impressive visual presentation of a shallow and pointless story...","rating":5,"date":"21 June 2017","review":"First of all, I must say that I had such high hopes and expectations for \"Resident Evil: Vendetta\", especially since I really enjoyed the previous animated movies.<br><br>However, they opted to pull the same approach as they did in the actual movies, making it more about mutations and grotesquely huge aberrations, more than it was about zombies and terror. And of course, it has the obligatory rogue agent gone bad.<br><br>The storyline in \"Resident Evil: Vendetta\" was simplistic to the point where it was trivial and mundane. You saw everything coming a mile away, and there were no surprises or plot twists along the way. So it felt like you were strapped in for a ride that just went straight ahead with no ups and downs.<br><br>Now, I must admit that I am more than impressed with the quality of the CGI and the sheer level of details they manage to put into the CGI here. I mean, the textures and the minute details to everything was just spectacular. Just as it has been since the very first animated \"Resident Evil\" movie.<br><br>The characters in \"Resident Evil: Vendetta\" seemed a bit generic. Sure it was nice to have Leon and Chris in this particular animated movie, but they weren't subject to any real character development or growth, so it felt a bit tame, to say the least. And it was a bit too over the top with the way that both Leon and Chris could take on a large group of zombies and not even get scratched or come close to being in danger, and the motorcycle scene was just too far out there.<br><br>As for the zombies, well they were there, but unfortunately it wasn't the primary cause of attention in the movie. And I really don't get the thing with the hulking brutes that they like in the series - be it game or movie franchise. They are so out of place that it is an eyesore and an embarrassment to witness. And the hulking brute with the iron mask in \"Resident Evil: Vendetta\" was not particularly impressive, and when he evolved into something even bigger, I must admit that I was on the brink of just getting up and leaving.<br><br>\"Resident Evil: Vendetta\" is not an impressive animated movie in terms of story, characters or in comparison to its predecessors. Sure, it was a visual tour de force and a spectacle to behold. But I was left with a very shallow feeling once the movie ended, and actually said \"was that really it?\" This is definitely a movie for the hardcore fans of the \"Resident Evil\" game line.","user":"paul_haakonsen","rank":[29,48]}]