[{"title":"Creepy Little Flick","rating":8,"date":"26 October 2018","review":"Yes, it resembles the first season of Stranger Things. Yes, it echoes Disturbia. I suppose it even tangentially recalls the remake of It if you've never watched real 70s/ 80s horror. Still, this film has its own take on the eighties and kid-centered horror. I liked it more than Disturbia (which was too slick) and more than the remake of It (which was too CGI action-oriented to be scary). Even though the story of Summer of 84 is not at all supernatural, the film recalls Phantasm (1979) in the way that its mood blends easy going playfulness with eerie suspense and horror. The cast is good, the writing is strong, the cinematography is spot on, the editing is tight, and the score is lush in its own synthesized way. Summerof 84 may be more creepy than horrific, but in that vein, it succeeds!","user":"pseawrig","rank":[93,115]},{"title":"The ending ruined everything","rating":5,"date":"11 September 2018","review":"It was a good combination of mystery/thriller/teenage movie. But the last 15 minutes were pretty bad. Not just because what happened to Woody. I kept asking myself how easily he could have dragged those two boys without somebody noticing. What about parents? How can anybody sleep when they know their son is the next target of a serial killer?","user":"sinemfentyy","rank":[176,245]},{"title":"One of the best coming of age mysteries I ahve seen in along time...that ENDING!!!!","rating":9,"date":"27 August 2018","review":"So, a lot of people are comparing this movie to Stranger Things, but they are wrong in almost every regard. While Stranger Thing is a sci-fi adventure rooted in fantasy and unrealistic fiction, this film is as realistic as any news story. It seems like the comparisons come from the 80's soundtrack and the fact that it was 4 young boys on an adventure, but that's where the similarities end. This movie is more along the lines of films like The Goonies or Stand by Me; movies about young men who are taught harsh things about life at an early and fragile age. While Stranger Things was for children, this movie is clearly aimed at a much more mature and discerning audience.<br><br>The first two act of this film are pretty straight forward and standard; 4 young and immature boys suspect their neighbor of being a serial killer. They break into his house, dig up his garden, ect. in order to find proof of his horrifying acts. But nothing really comes of it, at least nothing concrete. The movie is funny, suspenseful and entertaining, and it reminds you of the kids mysteries that were all the rage in the late 80's.<br><br>Then, in the final act, the film suddenly makes an 180 and it becomes a serious film with real horror, real stakes and real consequences. Just like real life, the story doesn't end just because you hope it does. Good people are often the victims of their good intentions, and this movie proves it.<br><br>While the first half of the movie is just an enjoyable coming of age film, the second half is what really sets this movie apart. It's endings like these that make a movie really shine, and separates the audience that always wants a happy ending versus the ones that want a better, more realistic one.<br><br>Stop judging this movie based on a trailer. It's wrong and idiotic. A movie should be judged on its entire running time, and this movie deserves nothing but the highest praise. Everyone involved should be proud of their work. Amazing.","user":"manuelasaez","rank":[96,136]}]