[{"title":"100% What You See is What You Get!","rating":7,"date":"14 August 2018","review":"Well, I was not expecting a Cannes Film Festival breakout, or Academy Award contender. To all those reviews that say the movie is cliched, predictable, just another Die Hard knock off... WTF were you expecting!?\nThis movie delivered on the action, and the skyscraper was very, very cool!\nYes the acting was not deep, but it was not bad either...The Rock looks great whatever he does, I mean come on people, Arnold and Stallone were not Shakespearean actors either!! I have seen literally hundreds of \" Mediocre\" action flicks, and this one ranks a point or two higher IMO. If you want to kick back and watch a mostly mindless, ridiculous, silly, and fun action movie, then you will enjoy this one.","user":"parduet77","rank":[150,182]},{"title":"The Rock is Awesome, but this Movie is Mediocre","rating":4,"date":"17 July 2018","review":"Since no human adversary is any match for The Rock, as he has shown us in past movies, he must now take on non-human adversaries. This time, he's taking on a building. But not just any building. He's taking on a skyscraper-the most formidable and the most phallic of all buildings. <br><br>If it sounds ridiculous, that's because it is. The story is largely ridiculous, and although The Rock never actually fights the building (because it's a building), the danger that the building poses is a much greater threat than any posed by the actual villains of this film.<br><br>The villains are lame, cardboard cutout characters. They're evil because they're evil-no explanation given, no effort. So, I consider the skyscraper the main adversary in this film since its sheer height and the raging fire it contains threatens The Rock's family. I won't mention The Rock's character's name because I never once thought of him as anyone other than The Rock. The only thing here distinguishing him from the characters he plays in other movies, is his love for duct tape. This is a very pro-duct tape movie.<br><br>In this movie, The Rock is awesome because The Rock is always awesome. Speaking of awesome, I have to give it up for Neve Campbell. I should have known from the many times I watched the 'Scream' movies, but Neve Campbell is one tough cookie. She takes down her share of bad guys along the way, fearlessly and intelligently defending her kids. Well done.<br><br>Rooting for The Rock (and any of his friends or family) is one of my favorite things to do at the movies. It's amazing that The Rock has been so built up in the minds of viewers as an indestructible force that writers now have to manufacture weaknesses for him in movies, such as an artificial leg. It's as if the audience would believe all the challenges of this movie would be too easy for him if he had both his natural legs. <br><br>While there are a million and one plot holes, that's definitely not something you're supposed to look for in this movie. Certain movies are not meant to be dissected, and one involving a man jumping from one tall structure across the sky into a much taller structure that's on fire, is certainly one of them. <br><br>In addition to the film's inherent silliness, it also attempted several awkward jokes within the first few minutes, all of which whiffed. Characters followed up with \"I'm kidding.\" That's usually a reliable indicator that the joke bombed terribly. <br><br>Despite all the flaws, I still had a good time watching this. The Rock is charismatic enough to carry any action movie to a reasonable level of watchability. Thanks to him, this one is reasonably watchable.","user":"Jared_Andrews","rank":[326,417]},{"title":"Stay home and watch Die Hard!","rating":5,"date":"13 July 2018","review":"It's not actually awful or even bad per se, but it's worse.. yes it's mediocrity defined! It's predictable, rather boring and all the best parts have been shown in the trailers. Dwayne Johnson is good, but can't save this. Sorry!","user":"Darth_Osmosis","rank":[214,297]}]