[{"title":"It's a porn documentary, it's going to get fleshy and raw","rating":8,"date":"7 April 2018","review":"It's about a porn actor. It's about the porn industry, so from the start it is a divisive subject. But I think what most people fail to realise is that women are paid a lot more than men in the porn industry and it is a career they have chosen. Is it for everyone? No. <br><br>I have to call out the kink shaming in these comments... yeah bdsm isn't everyone's cup of tea but for some people it's a lifestyle choice, and as a category of porn, it is obviously popular, the female actors also talk a lot about how much they enjoy it- they have chosen that type of porn because it's something they enjoy. I think Rocco Siffredi has a very sado-masochistic personality, which has been complicated by his catholic upbringing and the guilt he feels; he likes pain, but he also likes giving it, but if it's consensual, which in the documentary it is, then I don't see an issue with it. Yes the story he recounts about his mother's friend was disturbing. I don't agree with his actions, but he clearly has some issues with sex addiction and has had these issues for most of his life from the stories he recounts from his childhood. <br><br>I can see that the film is a bit of a vanity project, but I don't think it is nearly as terrible as people are saying. I think they are confusing being confronted by the subject matter and the quality of the documentary. The documentary itself is not badly made, there are actually some interesting conversations within the film. <br><br>I found the comment that we don't see anything about his real life a bit ridiculous... you see him at home, you see him with his family, you see him missing his wife as he talks to her on the phone, you hear him talk about the loss of his brother and his mother, he talks about his father, he argues with his cousin... there is actually a lot about his life in there.<br><br>So yes, as a documentary it is a bit self congratulatory (keeping in mind that every documentary contains bias) but I still found it interesting and a worthwhile watch but if you can't stomach the porn scenes it's not the documentary for you.","user":"rabidraccoongirl","rank":[16,20]},{"title":"Rocco Tries to Bare His Soul, But Just Shows His D--- Instead","rating":6,"date":"9 March 2018","review":"The documentary \"Rocco\" opens with a close up of Rocco Siffredi's penis. It's an obvious place to start, but it also serves as a summation the entire documentary. No matter how many opportunities directors Thierry Demaizière and Alban Teurlai give the aging porn star to bare his soul, he usually ends up just showing his d--- instead, metaphorically if not always literally.<br><br>But Rocco's penis has served him well. His IMDb page lists over 500 \"acting credits,\" dating back to 1986, including a few legit gigs, such as Catherine Breillat's \"Anatomy of Hell\" and the Italian comedy \"Matrimonia a Parigi\" (\"Rocco\" the documentary makes no mention of these forays into \"real\" movies). It's afforded him fame and fortune, far more than most performers in the adult industry can claim, and for far longer, too. Only Ron Jeremy's career is (ahem) longer, dating back to the late '70s. Yet Rocco, in much better shape in his 50s than Jeremy was in his 30s, thinks it's time to retire from performing. He cites concerns for his teen-age sons, who know what their father does for a living but are, as presented in the documentary, shielded from seeing their father in action. (Their mother, Rosa Caracciolo, was also once a porn star, another detail this documentary makes no mention of.) Mostly, though, he's just tired. To hear him tell it, having a generous endowment and hyperactive sex drive is as much a curse as a blessing. In fact, Rocco pretty much portrays himself as a sex addict, barely able to interact with women outside of sex. Even when grieving the death of his beloved mother Rocco is unable to keep his desires in check: he tells of an encounter with a friend of his mother after his mother's funeral, when he takes out his moneymaker and coerces the woman--a senior citizen, mind you--to fellate him. The story is simultaneously outrageous (it sounds like a scene out of an '70s-era French sex comedy) and unsettling. He's telling the story to illustrate how he's a helpless slave to sex, blithely ignoring that, as he's told it, he forced an old woman to give him a BJ.<br><br>There are more graphic examples of Rocco's uneasy relations with women in the industry. At his Budapest-based porn production company, he's charming and even fatherly when chatting with his female performers before putting them in an uncomfortably rough group-sex scene, the kind that leaves women with rug burns on their backsides. (The only sex shown in this movie is of the rough variety.) He's equally charming in Los Angeles when meeting scene partner Abella Danger, then takes her up on an offer to demonstrate her ability to swallow his entire hand. Danger may not be doing anything against her will, but that doesn't make it any easier to watch her, gagging and with tears streaming down her face, as Rocco pushes his entire hand into her mouth.<br><br>The co-star Rocco chooses for his final scene is English porn star Kelly Stafford, much to the dismay of his hot-headed cousin and business partner, director Gabriel \"Gabby\" Galetta, who makes his dislike of the outspoken Stafford plain. One gets the idea that the fact that Stafford speaks at all is an issue in Galetta's eyes. Stafford is a handful, but I liked her for being a confident woman who won't do anything with which she'd be uncomfortable. In other words, she's not the type to let a man shove his hand down her throat just to prove she's compliant.<br><br>Though \"Rocco\" has its moments of levity, like a shot of naked male performers standing outside for a smoke break between takes, or the perplexed faces of crew members at Kink.com's studios, where Rocco's supposed final scene is being shot, as they listen to Galetta's confusing directions, they are overshadowed by the more depressing aspects of porn the documentary inadvertently exposes. Turns out enacting people's sexual fantasies is as dehumanizing and grueling as working on a factory assembly line. As for Rocco himself, he's personable if a little self-absorbed, not nearly as introspective or sensitive as he'd like us to believe, and his treatment of women is just a tad bit rape-y. Mostly, though, he's a guy who has a big penis.","user":"ascheland","rank":[18,25]},{"title":"Disturbing and horrific","rating":1,"date":"12 September 2017","review":"This has got to be one of the most disturbing documentaries I've ever watched. There was no insight into Rocco and his personal life or thoughts, there was no life history or interviews with him, it was just him treating his co-stars like trash. Although his young co-stars had consented to working with him and being slapped and choked, he was openly and clearly taking advantage of their vulnerability. Basically this documentary consists of various behind the scenes porn shoots of him abusing women repeatedly to the point they are crying and screaming for him to stop. He chokes them, hits them, makes them cry, and continues to do so despite the fact they are clearly not having a good time. At one point one of his co-stars is in tears watching him destroy a fellow co-star, presumably petrified at what she's about to go through herself. And if that's not bad enough, he seems to think it's all a big joke and is proud they let him do whatever he wants to them. It's pretty obvious to the viewer they don't feel like they're in a position to say no by the time they realise how hard he's going to hit them or that they're going to be choked to the point they're vomiting. It's everything that is horrible about the porn industry and I sincerely hope this style of porn is on it's way out. The worst thing of all is that he seems to think that after the scene is finished, giving them a hug and a kiss makes his despicable treatment of them okay. Absolutely horrific to watch.","user":"Stephanie4040","rank":[48,78]}]