[{"title":"Day of ultimate boredom...","rating":2,"date":"24 April 2017","review":"I am a sucker for the horror genre, and I am the first to admit that I was lured in by the promise of the movie cover/poster. Especially because it did seem rather interesting, sort of a mixture between something demonic and zombiesque.<br><br>First of all, it was an uphill struggle to actually sit through the entire movie, because it was a massively generic storyline, which offered very little in terms of entertainment value, and even less so in originality. Furthermore, the storyline was horribly predictable, to the point of where you just shake your head well ahead of things actually happening.<br><br>But for a horror movie, then \"Day of Reckoning\" was scarily devoid of anything even remotely scary. And it would have served the movie well if they had opted to go for a proper storyline that could have bolstered the fact that this was intended to be a horror movie.<br><br>Furthermore, as a horror movie it is essential to have proper practical effects and/or CGI. Alas, it can be said in all honesty that this is something that \"Day of Reckoning\" didn't have. And it was showing blatantly on the screen, because the CGI was laughable at best, and it was super poorly animated to the point of being an eyesore.<br><br>I can't recall any of the acting performances in the movie, so it is safe to say the cast weren't particularly memorable. I am sure that they did the best they could given the severe restrictions they had anchoring them down.<br><br>Surpringly enough I managed to suffer through the entire ordeal that is \"Day of Reckoning\", but it was a very hard struggle. And I can honestly say that this is not a movie that you will return to watch a second time, providing you get through it the first time.","user":"paul_haakonsen","rank":[15,15]},{"title":"Lame and Senseless","rating":3,"date":"19 March 2017","review":"When the world was invaded by underground creatures that wanted to wipe out mankind from Earth, the post-apocalyptic survivors called The Day of Reckoning. Fifteen years later, people have the same signs indicating that a new attack is coming and they seek out shelter for protection. What will happen to mankind this time?<br><br>\"Day of Reckoning\" is another SyfY Channel garbage with a lame and senseless story and awful computer-generated imagery. The plot begins with no explanation or character development. Then the viewer sees a teenager (Tyler) jeopardizing his family and friends with a stupid unexplained attitude. There is a fight to survive from his family and friends and nobody misses the death of his mother's girlfriend. Then his uncle and aunt die and nobody grieves. In the end they laugh as if they were on the beach of in a picnic, forgetting those who died. But the worst is that the appalling creatures that destroy the world are easily killed by salt and saltwater. My vote is three.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[13,15]},{"title":"CGI, weak story, contrived action","rating":3,"date":"8 October 2016","review":"I've given up on the SyFy Channel. This is typical of all their productions. Terrifying and spectacular scenes involving CGI monsters/aliens/whatever separated by deserts of arid narrative with little or no purpose other than taking the characters to the next scene involving CGI. It's just crap. Some visual engagement but zero intellectual value otherwise. The suits at SyFy either are idiots or venal purveyors of weird trash -- or both. Don't waste your time. There's so little artistic value, other than the yeoman efforts of the put-upon casts, that I honestly believe SyFy is soliciting scripts from middle-schoolers. With a title like \"Day of Reckoning\" and the very rare religious references made in dialog, one might suspect that some attempt at rationalizing the cause of a disaster threatening the existence of the human race might be made. One would be mistaken in that assumption. There's nothing here. Watching while drunk might improve the experience.","user":"mrcrashhappy-1","rank":[33,44]}]