[{"title":"A Painfully Disappointing Film","rating":4,"date":"18 August 2018","review":"I was really looking forward to watching this film. I love Irish folk music. I enjoy indie and art house films. I really wanted to enjoy this film. <br><br>Sadly, I have to say that I found it to be a poorly made film. It didn't quite know whether it was a biopic or a documentary as it was primarily reenactments, but randomly tossed in documentary footage. <br><br>There is absolutely no information given to help the viewer understand when or where the film was taking place, or who the characters were. If you didn't have a passing knowledge of Heaney's life, you would be absolutely lost. I found myself guessing everything. <br><br>It was just a disjointed series of long boring shots with a musical performance tossed in now and then. No story. No proper dialogue. It really came off as a pretentious college film project. Purposely arty, but without any compelling content.<br><br>And while the cinematography was very striking at times, it was just not enough to carry a feature length project. I generally hate when a reviewer calls a film \"boring\", but I can honestly say that this about the most boring film I've ever watched. I never thought it was possible to make Irish folk boring :-)<br><br>Very disappointed.","user":"mikyb21","rank":[5,10]},{"title":"Loved it","rating":9,"date":"23 March 2020","review":"You can hear the waves and almost feel the turf fire burning when you get a glimpse into Joe Heaney's childhood memories and get a feel for the culture and place where his songs came from. Sure it's not a narrative documentary. It'll give you a feel for joe heaney's world though if you wanted a glimpse into the probable life of a old style Irish singer","user":"sureshsampath-77010","rank":[1,1]},{"title":"Boring...","rating":1,"date":"7 August 2018","review":"I read quite a few of the reviews and they all praised the movie but it was not for m e. I thought it was long and drawn out. I didn't like the music and I could not wait till the movie was over.","user":"puklaw-621-430070","rank":[3,12]}]