[{"title":"Step problems","rating":8,"date":"15 April 2018","review":"I caught this film at the Japanese Film Festival in Ireland - I had no big expectations of the film, but I left pleasantly surprised. Its a modest film, but quite touching and engrossing, despite its slightly excessive length.<br><br>The film focuses on Makato, a middle aged man devoted to his wife, two step children, and his daughter from a previous marriage. His career is suffering from his refusal to do the extra hours and weekend work needed to climb the corporate ladder, he sees no sense in sacrificing time with his children. Unfortunately, his modest happiness is threatened by his wives pregnancy - he first worries at the impact on his daughter, but overlooks that his older step-daughter feels even more threatened by it. Only his wife seems happy about the pregnancy. As his step daughter rebels and he is demoted to a demeaning job at work, designed to force him out, his modest life threatens to fall apart.<br><br>The film is very nicely directed by Yukiko Mishima, although the editing is too loose - a number of flashbacks are superfluous and the film could have been tightened up and shortened. The cast, including the children, is uniformly very good. The film wisely avoids too much melodrama in favour of a slice of life realism, although there are plenty of fairly heavy handed visual metaphors added in. And its particularly nice to see a film which explores the difficulties in taking on step children. Even the no-good father of Makato's step kids is treated sympathetically by the film. This is a film with no bad guys or good guys, just people struggling with the petty tragedies of life.","user":"GyatsoLa","rank":[4,5]},{"title":"Hard to understand Japanese Culture from an outside's view","rating":2,"date":"1 April 2018","review":"Stumbled on this film on a lazy sunday afternoon. Opened my eyes to the Japanese Culture of family belief and norm. This is hands down one of the worst movie that I have watched.<br><br>As with all Japanese and Korean movie, they are slow paced and actors and actresses seldom display too much emotion on their face (compare to Hollywood movies). No problem there, as I do expect that.<br><br>However what I do not expect is the culture, if this movie is to be believe, does it mean when a couple divorced, the father has no responsibility or no rights to his children? The children just simply pass to the step father to raise and that's it? <br><br>I truly dont understand Nanae's surprise when she sees her husband's child from his first marriage, so a japanese wife is expected that her husband will cut all ties to his previous life once he is married to her? And the daughter just introduced herself as her father's friend to the father's step daughter as if the step daughter has more right to him than the biological child. And the father didnt even bother to correct it!! and the current wife reiterated that the biological child is his friend!!! How crazy is that!!! It is as though he needs to sneak to meet with his child like it is a crime! And the biological child acted like she is the mistress getting caught, is loaded with guilt to have the father drove her to the hospital!! this is truly amazing (means as a sarcasm)<br><br>So, basically, the Japanese society is you let other man raise your child and you raise another man's children, just like that??? And the craziness of all is this guy paid the biological father to meet with his step daughter who despised him and all the mother can do is shout No No, No , you cant let them meet!! dear lord.....give me a break<br><br>Now I understand why Japan has the most aged population in the world. With a family sturcture like that, who in his right mind would want to get marry and raise the next generation (who probably aren't his children).","user":"Abbye-Sei","rank":[3,11]},{"title":"What lies beneath...","rating":7,"date":"9 February 2019","review":"Often when a film explores the underlying rage of an middle-class, middle-aged, middle-management type, it will explode in a terrible act from which there is no turning back. Yukiko Mishima's \"Dear Etranger\", however, chooses not to go for the sensational, and is an exploration in how it's easier to simply lose it rather than stick to the straight and narrow.<br><br>Makoto (Tadanobu Asano) is a man struggling between two families. Divorced and re-married, he struggles to balance keeping contact with his daughter from his first marriage, Saori (Raiju Kamata), and treating his two stepdaughters, Kaoru (Sara Minami) and Eriko (Miu Arai) as if they're his own.<br><br>Playing the good husband and father, he doesn't stay after work to drink with colleagues, takes all of his annual leave and tries as much as possible to include his two new daughters in his life. However, his good intentions at home see him first for the chop when his company restructures, leaving him relegated to working in a warehouse.<br><br>At home, while Eriko plays along with the scenario, the elder Kaoru is less happy to play along at happy families, wanting to see her real father, the way he meets with Saori. Adding a further difficulty to his situation, his new wife, Nanae (Rena Tanaka) announces she is pregnant, leaving Makoto wanting to cut his losses and move on.<br><br>However, when looking at two other fathers: Kaoru and Eriko's real father, Sawada (Kankuro Kudo); and Saori's stepfather see him stick to being a father to all four of his children, the tension released and returning to normal.<br><br>Throughout the first half, Mishima keeps a kick drum soundtrack playing, signifying the tension building under the surface for Makoto. Despite all the negative points coming to his life, he keeps going with a stoic attitude. But the repetition and constant grief he receives from Kaoru, along with the news of the pregnancy, cause this tension to rise to the surface. Kaoru's words both push him over the edge and bring him back from the brink when she compares him to her real father.<br><br>Makoto's anger comes out in realistic and unspectacular bursts. Rather than simply lashing out, his nature is more passive aggressive, carrying out Kaoru's request in anger. Asano's performance and Mishima's direction create a believable response to the situation and feels a truthful reflection of family tensions. Though the spiteful nature of Kaoru might seem a little strong for some, but she is a girl struggling to accept the situation.<br><br>No one character is portrayed as a hero, however, or indeed a monster. Sawada may be shown to have been a terrible father in flashbacks, but on meeting him today, he is very aware of how he is when it comes to children and his thoughts on parenthood; a life he simply doesn't wish to have. Makoto also is guilty of unconscious bad habits, pointed out to him ex-wife Yuka (Shinobu Terajima). Her words clearly sit with him in his better understanding of Kaoru, becoming a guiding father to her, rather than simply forcing her to call him \"Dad.\" All can learn something from one another.<br><br>Mishima paces the film well, switching between the present day and flashbacks of key moments in the previous marriages. In a career that hadn't quite hit the heights until now, \"Dear Etranger\" is a mature film, and shows that there is potential for Mishima to develop into a consistently strong director. Asano's performance also shows his versatility; an older man now, giving an equally mature performance as a man trying to keep his tensions under control, and not always succeeding. Both create a realistic character and show that it's more difficult to keep your cool and keep going than to let it all out in a violent outburst.","user":"politic1983","rank":[1,2]}]