[{"title":"Semi Revenge ******** 8 of 10","rating":25,"date":"25 January 2018","review":"Here's another unheard of foreign film which, in all likliehood, will stay unheard of, at least in the U.S. It played in 2 theaters in NYC and today is the last day. It contains one of the best performances by an actress I have seen in quite a while - and I saw Frances McDormand in \"3 Billboards\". Diane Kruger plays a woman whose husband and son are killed in a terrorist bombing. After a period of mourning she is bent on revenge, and she was so good and so convincing in her grief you could almost feel her pain. The other noteworthy performance in the picture - and there are several that are noteworthy - was that of the Defense Attorney, played to perfection by Johannes Kirsch, who summons up all the hatred you can spare. <br><br>I guess you'll have to wait until it comes out on DVD, but you won't be disappointed. Foreign films and Indies are the wave of the future, since Hollywood has forfeited its place in the motion picture field. Screenplay and acting win the day - substance over form is the ticket in 2018.","user":"GManfred","rank":[70,99]},{"title":"Almost too real...","rating":9,"date":"2 January 2018","review":"Only after I saw \"Aus dem Nichts\" I realized the distance felt watching foreign movies, that keeps me safe from too much emotional contact. As a German this movie felt so real, depicting real events (apart from the ending) and knowing these evil bastards are still among us, planing their next move.<br><br>The ending could have been more satisfying, but this was probably the only realistic conclusion for a mother and wife, that lost everything.<br><br>Diane Kruger was amazing, tears were shed and after the credits rolled, I needed another 10 minutes to get up.<br><br>Very powerful movie, but you should be in the right mood.","user":"Rincewind799","rank":[64,101]},{"title":"Intense film","rating":8,"date":"17 June 2017","review":"I've been a Faith Akin fan since Giegen Die Wand (Head-On)and I love his rock 'n' roll style. I knew this film was going to be depressing but it also is like a thriller towards the end, which left my heart pumping so loudly. Diane Kruger is a phenomenal actress in this, she is so believable and extreme. There are some clichés/stereotypes in the story which pull it down. I think the effect post-film, was very strong and I couldn't escape fast enough, it was so tense and terrifying.","user":"funnysmeagol","rank":[60,95]}]