[{"title":"Refreshingly original","rating":8,"date":"7 June 2019","review":"This was one of the standout films at the Torino: Lovers Film Festival.\nIt's a very engaging and fun coming of age story which shows us the complexities of human relationships. With great performances from Mark and cast, this is an impressive feature debut making Mark one to watch in the future.","user":"rashyb","rank":[4,7]},{"title":"Time to grow up","rating":7,"date":"27 May 2019","review":"After college, artistic Mark escapes from his Indiana hometown to a fake job in New York City, where he rents a room in the apartment of his college roommate. Taking a job as an after-school babysitter to a 6-year old, the 2 bond together very well. Meanwhile, he meets Leather Man, who may be a figment of his imagination, from a porn magazine he found at home years ago. In certain BDSM scenes, Leather Man tells him to seek his safe space, which to Mark is his childhood \"cubby\".<br><br>But Mark is not all together, especially financially, and prefers street drugs to his prescription pills. So reality intrudes, and he has to eventually adapt.<br><br>Mark was played by the writer / director, and I found the character absorbingly irritating. I was charmed by the line drawing illustrations that permeated the film - something Mark could likely have done. The net result is, to me, a mixed review.","user":"chong_an","rank":[4,7]},{"title":"Breakout performance by Mark Blane!","rating":10,"date":"17 July 2019","review":"You know when you have that feeling someone is meant for stardom? Someone whose talent is so immense on screen you know you'll be seeing them again and again? I felt that way seeing Amy Adams in Junebug, I felt that about Laura Dern in Smooth Talk. I feel the same way about Mark Blane's performance in Cubby, which I saw at the Frameline Festival. I can't stop thinking about Blane's portrayal of an awkward and innocent, Klonopin popping, horny manchild who daydreams about spending time with a studly leatherman. When I discovered Blane wrote and co-directed Cubby, I became certain he is a talent to be reckoned with.\nThis is a beautiful and special first film.\nSomehow I'm reminded of Harold and Maude's tenderness and wisdom, but sexier, queer, and on acid. Cubby's direction, like Blane's performance, is nuanced and thoughtful. There's an unusual and distinctive magical realism quality to Cubby, complete with animation. Many times the audience doesn't know what is real, psychosis, party drug induced hallucinations or leatherman fantasy. Blane and co-director Ben Mankoff deftly handle the ambiguity.\nCubby lets us know at the beginning this is a \"story based on a lie.\" However I'm certain we'll be seeing more from Blane and Mankoff. Don't miss this film!","user":"matthewdecoster","rank":[5,11]}]