[{"title":"Did a 5th grader write and direct this immature nonsense?","rating":3,"date":"20 February 2018","review":"I could not believe the shockingly low score for this film with such an all star cast. Once I saw it, I realized it was in fact deserving of the 3.8 IMDb rating, and only so high, from the sympathetic votes for these A-listers when they realized what they had signed up for.<br><br>So here's what I think happened. Ron Shelton's 5th grade grandson wrote and directed this nonsense but was too young to be named in the credits, so grandpa steps in and enters his name. <br><br>Next, Waze (the phone GPS app that was product-mentioned) funded this 5th graders film, and paid these A-list actors their wages so people will go see this mess, then leave the theater and download their app. <br><br>What else can it be? These huge actors did their worst... they hardly made an effort. The entire set was probably the after-party set up for when filming wrapped, just for the A-listers to have incentive to do some type of performance.<br><br>The directing and editing was, well, that of a 5th grader.<br><br>What a waste of talent on such a garbage screenplay.<br><br>A sympathetic 3/10 from me, only for the all star cast that got duped into making this nonsense.","user":"TheTopDawgCritic","rank":[24,27]},{"title":"I only give a rating for charm and fun - against dark and grim movies today.","rating":3,"date":"14 December 2017","review":"I started with a 2, but I give it a 3 for charm and moderate innocent fun - against so much of the garbage dark and grim superhero and political garbage movies filling the theaters today, but seriously, how did this movie make it to the theaters? The Director/Writer along with the Editor should have their salaries docked for such lousy work. I mean absolute garbage efforts --- in all three - writing - directing (which allowed poor acting from taking the worst cuts - and editing -- the absolute worst. They managed to take three main-stream super star actors and nearly ruin their careers (likely not) with this VERY poorly written, VERY poorly directed and oh my gosh.. I can't say it enough.. the editing is the worst. Talk about rush rush and no substance to the story development. \nThe only thing I truly liked about this movie was the colorful and sun-filled backdrop of the location it was filmed made it fun to sit through, and seeing the faces of Jones, Russo and Freeman -- three actors I who's work I have enjoyed so much over the decades, along with many supporting roles of some big names -- made it watchable. But that's it. \nGlad this was gifted to me, and I didn't pay to go see this movie on my own dime.","user":"FilmWriter569","rank":[24,27]},{"title":"A Waste of Time","rating":2,"date":"14 December 2017","review":"At first glance, it seems as if \"Just Getting Started\" is going to resemble one of the old Bob Hope and Bing Crosby collaborations from decades ago-two footloose con men ambling along in search of a life of ease, avoiding responsibility and matrimonial entanglements by relying largely on their wits and their engaging personalities.<br><br>\nBut before you start getting excited by a sense of nostalgia, you might want to remember that the Hope and Crosby comedies coasted along on the most threadbare of plots, leaning instead on the rapport between the two stars and their often unscripted and improvised dialogue, which mostly consisted of in-jokes and references to each other's entertainment personas.<br><br>\nAnd that's one of the many problems of \"Just Getting Started\"-unlike Hope and Crosby, stars Morgan Freeman and Tommy Lee Jones have absolutely no chemistry in their scenes together. While the dialogue in the picture might seem spontaneous and unscripted, it's not-it just isn't funny. And as anyone knows who's seen either Jones or Freeman appearing on a television talk show, without a script in his hands neither actor has a great deal of personality to contribute to the party. <br><br>\n\"Just Getting Started\" has no discernible plot-there's barely even a pulse. As a result, the picture after a while begins to resemble one long and pointless comedy sketch rejected by some obscure television variety show from the 1970s. Worse, Freeman and Jones often mutter and mumble their lines inaudibly, under their breath, as if they're embarrassed.<br><br>\nThey have reason to be-writer and director Ron Shelton has created for the two aging stars a script which meanders all over the screen. The story seems to travel in one direction for a few minutes, then wanders off in another direction, and then repeats the pattern again and again until we don't really know what the picture's about. Is it a mob comedy? A satire?<br><br>\nRene Russo, cast in the role Dorothy Lamour would've played in a Hope and Crosby comedy, at least gives the movie her best effort-in marked contrast to Jones and Freeman, Russo seems to be pointedly enunciating her lines, but in the process she also unfortunately removes every dramatic nuance or hint of intentional humor. And Jane Seymour in a guest-star role literally phones in her performance-she has no scenes with any of the other actors, appearing almost unrecognized in elaborate wigs and slinky metallic outfits, shrieking with a Noo Yawk accent into a gold telephone.<br><br>\nDumped into 2146 theaters nationwide, \"Just Getting Started\" has earned a 9% approval rating from the critics on the Rotten Tomatoes website, and a score of 25 out of 100 on Metacritic, signaling generally unfavorable reviews. The more charitable audiences polled by CinemaScore assign the picture a C grade.<br><br>\n\"Just Getting Started\" is a mess. Skip this one entirely, and save your money to buy extra Christmas gifts.","user":"cschultz-2","rank":[22,25]}]