[{"title":"An original animated with strong characters","rating":7,"date":"15 May 2019","review":"That's an unusual animated movie which clearly seems to be for kids as is full with funny animals, supernaive cat, entertaining story. However, the almost rude language and some Despicable Me style irony makes it perfect adult movie as well.\nIt's nice because the characters are very strong, with their own particularities and viewpoint. Sometimes you may annoy because of the strange eye-closing way of the cat but in overall, a good entertainment for kids and adults.","user":"eliinite","rank":[11,11]},{"title":"low budget but charming","rating":7,"date":"29 May 2019","review":"I saw the movie the first time at the International Animation Film Festival in Annecy 2018. This fun trip had me and the audience laughing and giggling throughout (apart from some sad moments in the middle). Last week I took my sons to see it with them together. They also enjoyed it and we give this one a thumbs-up. It's not the acme of computer animation (it's a german low-budget-film) but immensly charming and entertaining and the texture looks amazing in the close ups. Definitely worth watching for everybody who likes \"Paddington\" or \"Wallace&amp;Gromit\".","user":"piamantey","rank":[6,6]},{"title":"cute and funny","rating":8,"date":"22 May 2019","review":"This european animated movie has fun humor and an overall great heartfelt message. I loved the character design of the four animals and their humorous presentation. Each of them has its own original personality Their funny relationship made the film. Marnie, the house cat is really cute and cuddly. She knows life only through television and she has to lead the group of different characters on an adventure that will test all of them.\nThe dialogue sometimes sound a little like it's been translated from a foreign language - which probably has, considering this is a german-belgian co-production. All in all it is a nicely told, funny and family friendly film. For adults it might be sometimes a bit silly, but kids will love especially these parts and there are some adult jokes too, that really work.","user":"tonimanganelli","rank":[9,10]}]