[{"title":"Seemingly a bio pic of a pioneer for the disabled.","rating":12,"date":"12 April 2018","review":"My wife and I watched this at home on DVD from our public library.<br><br>Andrew Garfield is really excellent in the part of Robin Cavendish who in 1958, at the age of 28, contracted polio while in Kenya on business. I remember polio well, I was a boy in the 1950s and I remember taking the Salk vaccine. It is a devastating illness, it usually causes paralysis which is not reversible. Typically polio victims were given a few months to live and were kept hospitalized, on a ventilator, unable to breathe on their own. <br><br>After about a year Robin began to ask why he couldn't be moved to his home and kept on a ventilator there. Eventually he was and with the help of a friend had devices built, with battery operated ventilators, that would allow him initially to go outdoors then to even take trips. And devices which operated by slight movements of his head.<br><br>The meat of this movie is what he accomplished after he left the hospital, particularly how he helped open up development of batter ways to care for those with similar afflictions.<br><br>He eventually died in 1994, about 35 years after contracting polio. It is implied though not stated in the movie that he chose his time of death by having a doctor administer a medicine so that his ventilator could be unplugged and he could died peacefully and painlessly.","user":"TxMike","rank":[18,19]},{"title":"Wish they made more spouses like that more often","rating":8,"date":"20 January 2018","review":"This is a beautifully filmed movie. It's inspiring to watch the devotion of the wife in supporting her husband struck down with polio at age 28. His subsequent efforts to live outside the hospital and advances in a wheelchair with a ventilator attached are quite illuminating. Especially with what happened to Christopher Reeve it is still relevant today. This movie doesn't focus too much on the awful side which is good or it would be too depressing.<br><br>The leads are watchable. Claire Foy QE2 of the Crown speaks and acts a lot like she does as Queen Elizabeth. Andrew Garfield isn't one to shy away from difficult roles. Here he speaks with his British accent. <br><br>It's a good thing to be reminded about Polio amidst the recent debate whether or no to vaccinate.","user":"phd_travel","rank":[28,31]},{"title":"Love can conquer all","rating":10,"date":"15 November 2017","review":"Saw this film last night without reading any previously written reviews, and I thought it absolutely outstanding. The devotion that Robin and Diana had for each other, encountering such a life altering event only one year into a marriage would likely destroy most marriages. Addressing the ignorance and lack of empathy from the medical community must have been a real slog, and it is to their credit that such amazing inroads were made to better the lives of polio victims and other disabled persons. While the world has become a better place for those \"outside the norm\", there is still so much yet to be done. The cast and Jonathan Cavendish should win all the BAFTAs and Oscars possible. This film gave me hope that we can all be better than we are.","user":"SusanShop","rank":[48,56]}]