[{"title":"Elegantly Crafted Masterpiece","rating":10,"date":"27 December 2017","review":"Intimate, delicate, and a beautifully crafted masterpiece. Paul Thomas Anderson manages to expresses an artist's creative journey through threads of fashion and romance with such subtlety that it could only be conveyed through the medium of film. An atmosphere reminiscent of Kubrick's achievements, this romantic odyssey illustrates a unique perspective of love; a perspective in which love is shaped and manipulated by the fragile strings of each character's hearts.\n <br><br> To begin with, I will praise an awfully disregarded aspect of \"Phantom Thread\": the cinematography and direction. The style and manner in which Paul Thomas Anderson uses silence and long takes is ingenious, and as stated above, was most likely inspired from Kubrick's works. Similar to the quote, \"The less you say, the more your words will matter,\" the more silence, the more each line will signify. The more long takes, the more each short take will signify. Therefore, this method permits a greater control over the variety of dramatic effects; and in turn, the audience's emotions. Anderson also utilized this technique in many of his other films, including \"The Master\", \"Magnolia\", and his masterpiece, \"There Will Be Blood\".\n <br><br> Of course, this strategy doesn't always serve well. The more the audience regards the dialogue, the more engaging the screenplay has to be. The more engaging the screenplay is, the more compelling the performances have to be.\n <br><br> Yet \"Phantom Thread\" has all of this. Magnificent lead performances by Daniel Day-Lewis and Vicky Krieps, a strong and often overlooked supporting performance by Lesley Manville, and a sharp, dense original screenplay written by Paul Thomas Anderson himself. A few sprinkles of comedy are also blended in the script, which is always valuable for a romance. Not to forget the costume design either, which was essential to establish a post-war 1950s London environment. \n <br><br> And finally, the score. Arguably the strongest part of the film, the score possesses Paul Thomas Anderson's signature strange aura that is found in several of his other films. It's not a coincidence that one of his most frequent collaborators is Jonny Greenwood, who composed the score for this film, \"There Will Be Blood\", and many others. While most movies nowadays would use music to heighten drama, Paul Thomas Anderson rejects the common norm; valuing music to form an atmosphere. This atmosphere is crucial in almost all of his works, creating an eerie tone for a mystery that drives the story forward.\n <br><br> A transcendental and sublime work of art so remarkably subtle- delicately transfixing the audience ever so slightly, exploring the convoluted depths of an artist's obsession, and expanding cinema's horizons for miles of wonder- all woven beneath the intertwined threads of the phantom.\n <br><br> Farewell, Daniel Day-Lewis. We will miss you.","user":"Wesley-Wang","rank":[357,499]},{"title":"The Art Of Being","rating":10,"date":"22 December 2017","review":"Daniel Day Lewis adds a new extraordinary character to his gallery of extraordinary characters. All men and each one of them a total original variety of male. From the gay punck rocker of \"My Beautiful Launderette' to Abraham Lincoln in \"Lincoln\" Now Reynolds Woodcock, an artist in the world of fashion a man who lives his work as his only form of expression. The frustration by any form of interruption by anything or anyone out of place guarantees his private isolation and yet he craves the warmth of human intimacy. The complexity of Ryan Woodcock becomes totally accessible in Daniel Day Lewis's eyes, with every move, with every silence. It is a monumental, beautiful creation. His Alma - the Alma that he chooses - is played with Bergmanesque intensity by Vicky Krieps and she's a perfect framer/embracer/provocateur in a remarkable performance. Lesley Manville is chillingly perfect as a sort of Mrs Danvers. A sister/gate keeper with an eye on everything. Was she the one that protected him from his homosexuality or it's just my imagination? I love Phantom Thread. I will see it again soon. P T Anderson gives us another scrumptious gourmet dish. Tank you for that.","user":"damian-fuller","rank":[260,453]},{"title":"When a film looses its thread","rating":7,"date":"16 January 2018","review":"Let us get this out of the way- Phantom Thread is a beautiful film with a great premise and promise. A couture dress designer (Daniel Day Lewis) is demanding in the extreme and finds a muse (Vicky Krieps). He enjoys using her as a dress model and a companion, but she wants more. Along the way, the director, Paul Thomas Anderson, throws hints of intrigue starting with the title of the film. There are empty pretensions of dress-making as high art, secret messages sown into dresses and haunting memories. All of this leads to- exactly nowhere. Everything Lewis and Krieps do is recorded lovingly and meticulously on film with great mood music in the background. But there is no great reveal, no deep insight into human psyche, no higher truth. In the end it comes down to what a woman wants and what the man can live with. Lewis and Krieps are excellent, especially Krieps, but Lesley Manville as Lewis's sister has the thankless job of looking stern in every scene. Nothing in the film sticks with you when you leave the theater except the dresses, photography and the music; because Anderson has not come up with anything really interesting in the story. Unlike his \"There Will Blood\", which was a great film, Phantom Thread is a phantom film. It is a beautiful ghost of what should have been a really good film. See it if you wish to say goodbye to Daniel Day Lewis, but keep your expectations low.","user":"axb","rank":[276,483]}]