[{"title":"*spoilers* Could have easily been so much better","rating":2,"date":"23 August 2018","review":"*contains spoilers*<br><br>It was not a total waste of time, however there were so many stupid plotholes in there.<br><br>State of the art artificial intelligence and it runs on regular gasoline?\nWhy not a fuel cell, solar panels, or a fusion reactor or something.\nProgrammed for combat, has armor plating that can stop a bullet, jet manages to impale itself on an iron rod, while playing chase.\nSame armor plating and all you need is some gasoline and pretty much a glorified lighter to pretty much completely destroy it?\nCan be rebuild in a few hours by 3D printing (y'all know that 3D printers are mostly using plastic right?) come to think of it... that would explain why you can just light the puppy up.\nAfter they rebuild it, it requires 48 hours to? To do what? Rebuild? Reboot? Load software? The same software it uploaded to the cloud in a few minutes?<br><br>Just lazy lazy writing","user":"jeroenloonstra-11643","rank":[84,106]},{"title":"A billion dollar 'super' dog that's as effective as a loud barking Chihuahua","rating":1,"date":"29 August 2018","review":"Okay I did enjoy A-X-L romping around the desert with miles on his dirt bike, flying through the air as they bonded. A kid and his billion dollar super dog.<br><br>With that out of the way, at about 40 minutes into the movie I realized two things. This militarized billion dollar dog weapon, soooo scary looking with super growling 'teeth' was as dangerous as a kitten. Second was the scene where super dog faces off with the evil 18 year old. Does it matter what weapon the 18 year old has? After all he's facing a billion dollar 'weapon of war', right? Suffice to say A-X-L is no match for a teenager. Later, when he targets an evil teen he is unable to stop the teen from running away and diving under a car. At no time does this screenplay have A-X-L take down even a single evil peson whether evil teen or evil military contractor who created him. Sure, he can run and bark like heck... but no where do we see a billion dollar weapon in action.<br><br>Also, one could ask why A-X-L escapes from his creators in the first place?\nNot a clue. After all, he was created to save the lives of our soldiers at war. Kind of a noble invention, yet as the movie begins he's gon AWOL. Why would he not wish to return to his creator and his mission to save our soldiers lives. That is in fact his prime directive, to bond with a single solder at war. It's not like he's a nuclear bomb we could debate. Again, screwy screenplay where evil creator is not really evil. One could say that A-X-L going AWOL was super dog being very, very bad dog!<br><br>The notion one could build or rebuild an A-X-L in a garage with a soldering iron also left me scratching my head.<br><br>Fun idea with an awful, nonsensical screenplay.","user":"stevepat99","rank":[58,77]},{"title":"some useful actors get work but the movie is a dog","rating":4,"date":"26 August 2018","review":"They were not able to make the dog very appealing and (spoiler alert) it never does bite the bad guy in half. <br><br>Thomas Jane and Eric Etebari got paychecks while waiting for a better offer, and Ted McGinley is in it. The guy playing Eric Etebari's IT henchman has a really good haircut. His friends should insist that he never change it. I was not able to identify him from the stingy credit list.\n \nThis is one of those times when the message boards would have come in handy. Who is the actor who played the computer-savvy henchman, I could have asked. Somebody would know.","user":"chwalker-christopher","rank":[40,52]}]