[{"title":"Tear-Jerker","rating":7,"date":"5 November 2017","review":"Tragedy strikes a family when the teen daughter disobeys her parents. The movie is based around this tragedy. Everyone in the family gets stuck in the cycle of blame - blaming either themselves or another family member. This ultimately leads to threats of divorce. Friends and neighbors step in to support them sharing their own, similar fates and how they moved forward. It's a story of loss and redemption. I needed tissues a few times and could hear loud sobs from others in the theater.<br><br>The script was written by a group of teens taking a summer camp film class. I didn't know this until I came here to review. It was so well written that I want to see it again. However, it makes sense in many ways. It's a story of a teenager and a family falling apart. Many teens know what an unraveling family feels and looks like. There were a few moments though were the script failed. There is a young girl sharing her faith who used very technical terms which didn't have an authentic feel. However the rest of the writing more than overshadowed those moments.<br><br>The actors were well cast and felt real, not like Hollywood types. The setting was small town America and looked authentic.<br><br>The only aspect that was not so good was the camera. Shots were often shaky and had a low quality sound and look at times. It seemed like perhaps another camera was used later that was steadier and clearer.","user":"thogg-94412","rank":[10,15]},{"title":"Keep tissues handy!","rating":13,"date":"13 October 2017","review":"Truly a touching and heartfelt production. I was brought to tears more than once. No matter the trials or tribulations we may face on earth, our Father is by our side and there is always hope as long as we believe and trust in Him. Must admit, seeing Matt, who is steadfast and strong in his faith, playing the role of Michael. I adored the movie!","user":"wildkat-12437","rank":[9,14]},{"title":"I tried but I just couldn't.","rating":1,"date":"4 June 2018","review":"This was tedious to watch, so unrealistic these days and basically God Squad bible bashing propaganda. If you liked Little House on the Prarie then go for it. It smacks of all the moral values that we pretended to have back in the 60's. Bad dialouge, acting and storyline.","user":"neil-swift-23453","rank":[5,12]}]