[{"title":"Really enjoyed","rating":9,"date":"26 February 2017","review":"No matter what the genre line says, this is a black comedy and a good one at that.The acting is spot on and sometimes especially in the later parts of the film a little over the top but it does add to where the story is going at the time and fits very well. <br><br>I think I can count on one hand the amount of movies lately that have made me laugh out loud, thankfully this one had me on more than one occasion.<br><br>Obviously the director is a Coen bros fan, it has touches of Fargoish mundane reality mixed with comedic gore filled violence.<br><br>The soundtrack was effortless and complimented the mood of each particular part of the movie.<br><br>Overall a good watch and not overly long or drawn out so 9/10.","user":"kevinbarry89","rank":[103,122]},{"title":"Heartfelt absurd black comedy with gore","rating":8,"date":"24 February 2017","review":"Loved this film! Melanie Lynskey does a great job as depressed nurse with a penchant for justice who unwillingly becomes a vigilante. Elijah Wood is hilarious as her sidekick. The story is absurd and fast-paced. Cinematography is spot-on, with camera-work and colors that create a moody, slightly surreal atmosphere. And all throughout the movie breathes with life and love for its wonderful characters.<br><br>You gotta be able to withstand some violence though—there definitely is some in here. To me, the violence felt natural and was still humorous enough not to be overly shocking, reminiscent of movies such as Super and Kick Ass. So, go and watch this cute little gem!","user":"stroggos","rank":[89,110]},{"title":"Worth Watching.","rating":7,"date":"24 February 2017","review":"Started a bit slow, and it seemed like it was trying too hard with the so-called cringe humor. I still enjoyed the photography, editing and music even though I wasn't impressed with the plot. Then things changed dramatically for the better. One thing I noticed towards the ending was the similarities with \"The Shining\" (1980) both in set and music. Might have been wishful thinking but my I'm pretty sure there's a bit of a reference there.<br><br>Fantastic acting, I didn't realise the main character was played by the \"Heavenly Creatures\" (1994) actress. Never really seen her \"black, beautiful little eyes\" since then, but her average mid-thirties woman looks were very refreshing for a leading character in a motion picture. Elijah Wood always delivers of course, he was hilarious as a very specific loser type.<br><br>Overall a very, very good dark comedy with existential overtones, nice plot turns and a great atmosphere. Loved it.","user":"25WR","rank":[88,114]}]