[{"title":"Starts Off Fresh, But Progressively Declines In Quality","rating":6,"date":"9 April 2018","review":"The first act of Gemini was magnificent due to its inserts of top-notch acting and compelling themes. Unfortunately, the rest of the movie transforms into your typical, predictable, murder mystery which definitively never rightly goes anywhere. (Verdict: C+)","user":"Gresh854","rank":[36,44]},{"title":"Leaves you unsatisfied","rating":5,"date":"18 June 2018","review":"Begins hopeful, with the prospects of being a fresh movie, fresh idea and script. But as stated by other reviews the quality and the 'pace' of the story quickly decline. \nIt feels like they tried to give off some kind of Mullholland Drive vibe, but halfway decided to open the 'box of lame'. <br><br>Felt promising, but turned out to be not as good initially anticipated. Worth the watch though (if you have a spare hour and a half).","user":"dhrlevibos","rank":[26,31]},{"title":"I hate getting sucked into a mystery suspense film only to have the lamest of resolutions.","rating":4,"date":"24 October 2017","review":"The set-up and acting in \"Gemini\" is excellent...and the film really sucked me into the story. So, when in the end NOTHING satisfying occurred, it left me angry...and angry that the title itself betrays much of the ending.<br><br>The story is about some obnoxious actress (Zoë Kravitz). She is freaked about...but exactly WHAT you don't know. But she doesn't want to be alone and stays with her assistant, Jill (Lola Kirke). She also asks if she can borrow Jill's gun. Soon after this, Jill has to run an errand and returns to find what she assumes is the actress...dead on the floor in the mansion...riddled with bullets from Jill's gun. So what does she do when the police investigate? Yup...she runs and tries to solve the crime herself.<br><br>The biggest problem with this film is that while I COULD accept the cliché of Jill trying to solve the crime (common in older film noir pics), I could not tolerate the finale...where, essentially, you learned that no real crime occurred!! What???!!!! So, apparently the entire film you just saw is a waste of time AND the title betrays the ending....wow...what a wonderful setup all amounting to nothing.","user":"MartinHafer","rank":[56,72]}]