[{"title":"Good but...","rating":6,"date":"29 July 2017","review":"First off, this is worth a watch, and it's far better than the 2-3 stars some reviewers are awarding.<br><br>Woman takes an unplanned \"walking holiday\" in the Nevada desert and picks up an unwanted follower in the form of a slow but relentless Zombie, is a great premise. <br><br>Brittany Allen as Molly does a perfectly acceptable job in the lead playing a character who has to deal with increasingly grim situations with nothing but steely determination 5 grams of cocaine to see her through.<br><br>In the last act the film lost it's clarity but still just about kept it together. <br><br>6 out of ten, could have been a 7 with a tighter ending.","user":"alec-macarthur","rank":[44,56]},{"title":"Pretty decent entry in the genre.","rating":6,"date":"28 July 2017","review":"Started watching this having already decided (based on the trailer) that it was gonna be another trash zombie flick, but i was surprised and glad to have been wrong. The film was well made and dare i say well directed and the casting choice for the lead was excellent in my opinion. The pace was good and the general mood of the film also. Script-wise it was lacking a bit but the main character's development and back story were great, the dynamic between Molly and the zombie really made me empathize with both of them, especially since after a point there's a bond formed between the two. The end was actually pretty satisfying and left me rooting for Molly. The actress gave a good performance considering she's the only character with lines for almost the entirety of the film. I tried to be as objective as i could with this review since i love zombie flicks but the review below trashing the film is really misleading, if it wasn't for that review i wouldn't have actually bothered writing mine, since i have an account for the past 5 years and this is my first one. This film maybe be no Night of the living dead but it has a lot of heart and i trust it will find it's place in the genre's audience.","user":"demontrees","rank":[32,42]},{"title":"The Best Independent Drama/Thriller/Zombie Film I've Seen","rating":8,"date":"30 July 2017","review":"To try and quench my zombie appetite I have watched MANY MANY...and I mean MAAANY zombie movies, and many of them are pretty dang bad. <br><br>This is not one of them.<br><br>Although not academy award level in any aspect, I would consider this deserving of awards in the independent and lower budget arenas! <br><br>If reviewers and viewers pay attention you will notice that this movie is labeled a Drama, Horror, Thriller. I believe that's accurate. For hard core zombie fans who like strict zombie action, I can see why some would be disappointed. I was not. And in fact I was quite pleasantly captivated. This was a breath of fresh air for this tired, same ole same ole, genera. I finally found a zombie movie that had some MEANING to it. Where the main character was believable and multi dimensional. I loved the humor inter mixed thru out!<br><br>The camera work was EXCELLENT. The acting and direction was very very good. And the story was full and different with the pace set at a nice steady burn. After about 45 minutes the pace does pick up with some new characters introduced and some nice surprises!<br><br>After reading my review, you can tell whether or not this film may interest you. If you are on the fence...let me push you off. I thought it was an excellent film.","user":"tdwillis-26273","rank":[47,65]}]