[{"title":"An amazing but heartbreaking movie","rating":10,"date":"6 January 2019","review":"I've been waiting to see in harm's way also known as the Chinese widow in China For a long time and finally it gets a U.S. Blu Ray release and it was definitely worth the wait in harm's way is a beautiful movie the two leads were amazing Even though Jack and ying could not understand each other they both formed a deep connection and Really loved each other Nunu was a great character too and the actress that played her was great many americans hate china now but they saved many American Pilots during WW2 and were our allies I wish more Americans could remember that before Judging people who were once our friends and are not the enemy we claim they are today<br><br>The ending was sad and bittersweet but their was still some happiness in it<br><br>Chinese cinema is getting better and better and is definitely outperforming Hollywood at this point<br><br>Highly recommended","user":"mchgothmog","rank":[12,15]},{"title":"A well acted war drama","rating":8,"date":"24 November 2017","review":"While the box office is overrun by superhero films, it's refreshing to see a film that grounds itself more directly in humanity. \"The Chinese Widow\" is a beautifully shot, often endearing film that features particularly strong performances by Yifei Liu and Fangcong Li. It is a moving story that deals with incredible sacrifice and one that may bring the viewer to question their definition of heroism. If you want to see something more profound than a run-of-the-mill blockbuster, \"The Chinese Widow\" is definitely worth a watch.","user":"charliesporns","rank":[27,40]},{"title":"Heartwarming & Heartbreaking","rating":10,"date":"11 December 2018","review":"Monday is movie night at our house. My wife comes home with a new one from Red Box after work every Monday without fail and we have run the genre Gambit. Everything from meaningless junk to Best picture winners. We've laughed, we've cryed, we've cursed, we've applauded, we've been left wondering why and/or how we sat through many of them. I've often wanted to turn some off and forget I ever allowed myself to suffer through some of these flicks.\nThen \"In harm's way\" found it's way to our DVD player ... This movie will probably never be heralded with the greatest films ever made. But I can honestly say: I absolutely loved it.\nI never want to know what I'm about to watch. I don't want to know the genre, or any plot points. I want to be completely open minded and never have any premonition of the story. I hate the idea of \"movie trailers\" I think they are the absolute worst thing that can be done as far as movies go. I mean why watch a ballgame if you know who's going to win???...\nI will not ruin this experience for anyone else with spoilers. All I will say is: If a heart beats inside of you...watch this movie. Have a wonderful life too. God bless all and thanks for reading my review.","user":"nealkattman","rank":[19,27]}]