[{"title":"An insult to all B-movies, more like a Z-movie","rating":1,"date":"8 June 2019","review":"I can force myself to sit through the most boring movies as long as they look professional. In this case, however, I felt like I was going to be sick, so I fast-forwarded through much of the movie. This is the first movie I've ever had to fast-forward. I'm no movie-maker, so I don't know how to explain what was wrong with this movie. You know how professional movies look different than movies that have been shot on ordinary video cameras or cell-phones? I'm not sure, but either it's because of the type of cameras used in professional movie-making or it's due to digital post-processing work done on computer after filming (perhaps both). Well, this movie looked as if it was in a raw state, shot on a family video camera or on a cell-phone with 4K quality. That means, it looked ridiculous, because the performances were theatrical, over-the-top and tried to imitate professional movies, while the video looked extremely amateurish, a bizarre combination that would make any movie utterly unwatchable.\nIt had worse special effects than movies made in 1970s. The make-up was a joke. The female character had a kind of breathy voice quality that made me feel as if someone was scratching their fingernails on a chalkboard. Believe me when I say this is the worst movie I have ever laid my innocent eyes on, and I'm not the kind of person who would say that about just any movie. I've seen quite a few B-movies, but this was no B-movie. It was of Z grade quality. I suspect this was made as part of a student film project. Please, save yourself by pretending this movie never existed.<br><br>Final score: 0/10","user":"politehere","rank":[14,14]},{"title":"Bad, just bad!","rating":1,"date":"8 June 2019","review":"If you fast forward through it, it makes it a little better.","user":"Max_Lucas","rank":[11,11]},{"title":"No No No No No","rating":1,"date":"10 June 2019","review":"This is TERRIBLE... What a waste of time. I agree this isn't even a B movie. Not worth your time.","user":"janhmyburgh89","rank":[4,4]}]