[{"title":"Good Netflix original movie","rating":8,"date":"12 November 2017","review":"With the title called Wheelman if you expect anything more than a movie about a man behind the wheel you clearly watching the wrong movie.Almost shot entirely in a car Wheelman starring Frank Grillo as a getaway driver being set up for a future gang war.The movie is not overblow with sick car chase scene like Baby Driver recently or as deep as Drive in term of plot but i enjoy it very much.With the short runtime about 77 minutes don't skip this movie because the genetic poster give it a chance","user":"phanthinga","rank":[30,34]},{"title":"What Driver Should Have Been","rating":10,"date":"23 October 2017","review":"This spare, stark, simple double-cross story is hung on the bones of some of the best road-action camera work I've seen since the 1980s. The chase- scene shot sequencing hearkens back to the early giants of the genre: Bullit, The Driver, The Blues Brothers. The makers spend plenty of attention on watching the Wheelman manipulate the controls of his car and presenting realistic, easy-to-follow driving choreography. Nothing in this thing breaks your suspension of disbelief... unlike other multi-million dollar, CGI-choked car-chase franchises I can think of. Yes, as some reviewers have complained, most of the conflict is advanced through cell phone conversations, but that merely serves to throw the many actions sequences into even sharper relief. The director never pulls you out of the car to set you safely on the sidelines as the action goes whizzing by; you're in the seat with the bullets flicking past your head. Sit down, listen to the dialogue, and you'll like this inexpensive little jewel.","user":"bradley-trent","rank":[53,68]},{"title":"Jeremy Rush's debut as a writer-director creates a B-grade production with A-grade results!","rating":9,"date":"20 October 2017","review":"I've never heard of Jeremy Rush and noticed this is his first full length major film as either a writer and/or director. He accomplished both with great success. He created a B-grade production with A- grade results.<br><br>Don't go into this expecting (or comparing it to) another \"Transporter\" as it doesn't have the huge Hollywood budget, A-list cast or professional production team and backing. Nor is it meant to be a full out action thriller. Instead, it's a neo-noir mix of fast paced action and psychological thriller.<br><br>The writing had a few flaws but made up for it with excellent directing and outstanding cinematography (i.e. camera angles/shots)<br><br>Frank Grillo nailed his character and I think this was one of his most convincing roles.<br><br>I highly recommend this film, especially as a Sunday night pajama and popcorn flick.<br><br>A well deserved 9/10 from me.","user":"TheTopDawgCritic","rank":[67,89]}]