[{"title":"Godard still believes in the elemental power of cinema","rating":10,"date":"3 February 2019","review":"When I screened A MAN ESCAPED in an Intro to Film class a few years ago, one particularly bright student seemed riveted by Bresson's radical and extensive use of first-person voice-over narration, close-ups of hands at work, and the unusual way these elements interacted with each other. In a post-screening discussion, he made the salient point that \"It was as if Lieutenant Fontaine's hands were doing the thinking and the talking.\" I was reminded of this remark at the beginning of Jean-Luc Godard's THE IMAGE BOOK when a close-up depicts a man's hands splicing together two shots of 35mm film at an editing table. On the soundtrack, Godard's 87-year-old voice, now a sepulchral whisper, informs us that \"man's true condition\" is to \"think with hands.\" This is shortly followed by what appears to be a documentary image of a concentration-camp victim's emaciated fingers. Hand imagery from a variety of sources - from a shot of Bunuel wielding a straight razor in the opening of UN CHIEN ANDALOU to the detail of an index finger pointing upwards in Da Vinci's painting John the Baptist - proliferates in the early stages of THE IMAGE BOOK. This serves to introduce the film's structure (\"five chapters like the five fingers of a hand\") and overall aesthetic strategy (mixing excerpts of narrative films with documentaries, high art, cell-phone videos, etc.); but, more importantly, it reminds us of Godard's belief that a filmmaker is ideally someone who works with his or her hands, operating \"small instruments\" like the analog equipment on which Godard begins the process of slicing and dicing the contents of his vast image data bank before he passes that footage on to his cinematographer/co-editor Fabrice Aragno for a digital upgrade.<br><br>After this brief prologue, THE IMAGE BOOK proper begins: The first four \"chapters\" feature Godard's associative montage at its most rigorous - he traces various images, ideas and motifs throughout film history (water, trains, war, the concept of \"the law,\" etc.) in a manner not unlike that of his mammoth video essay HISTOIRE(S) DU CINEMA. But, even when it feels most familiar, these passages in THE IMAGE BOOK still show Godard to be a restless experimenter: The famous scene in Nicholas Ray's JOHNNY GUITAR where Sterling Hayden implores Joan Crawford to \"lie\" by professing her love for him (a scene Godard has already quoted in several other films) gets a new look by the introduction of a black screen during what should be a shot of Hayden, so that viewers only see the corresponding reverse-angle shot of Crawford in their charged dialogue exchange. Another new trick up the director's sleeve is the way he presents shots in a deliberately incorrect aspect ratio (i.e., the images appear horizontally stretched) before having them \"pop\" into the proper ratio, an amusing and oddly satisfying poetic effect. The film's darker and more disturbing elements, on the other hand, have caused some critics to categorize it as a \"horror movie.\" In one instance, Godard provocatively juxtaposes an execution scene from Rossellini's PAISAN, in which Italian partisans are drowned by their Nazi captors, with eerily similar, recent non-fiction footage of ISIS executions. Elsewhere, he juxtaposes images of exploited performers - intercutting shots of a grinning \"pinhead\" from Tod Browning's FREAKS with someone performing anilingus in a pornographic film of unknown origin (the latter is identified only as \"PORNO\" in the lengthy bibliography that makes up most of the closing credits).<br><br>It's the fifth and final chapter, however, taking up almost the entire second half of the film, that sees Godard boldly striking out into truly new territory: This section examines how Western artists frequently misrepresent the Arab world by depicting it in simplistic and reductive terms (i.e., as either \"joyful\" or \"barbaric\"). Godard quotes extensively from authors I haven't read (e.g., Edward Saïd and Albert Cossery) but the overall meaning is clear in an extended scene that focuses on a fictional Arabic country named Dofa whose \"underground has no oil\" but whose Prime Minister nonetheless dreams of submitting all Gulf countries to his rule. What's incredible about this sequence is the startling way Godard conveys the \"story\" solely through his narration while the image track is comprised of a cornucopia of found footage from movies by both Western and Arabic filmmakers (not to mention some hyper-saturated shots apparently captured by Godard and Aragno on location in Tunisia that are the most visually ravishing in the film). That it's often difficult to determine where these shots came from is, of course, part of the point. In an otherwise war-and-death-obsessed work that feels even more despairing than usual for this gnomic artist, Godard does, however, express hope for the possibility of a new poetics of cinema, one in which Middle-Eastern and African filmmakers might discover new ways of seeing and hearing themselves. The wild sound design, always a highlight in late Godard, reaches new levels of expressiveness here as voices, sounds and snippets of music aggressively ping-pong back and forth between multiple stereo channels - essentially doing for the ears what the groundbreaking 3D of GOODBYE TO LANGUAGE did for the eyes. In a lengthy post-credits sequence, Godard's voice-over eventually devolves into a coughing fit while a rhapsodic dance sequence from Max Ophuls' LE PLAISIR gets the final word on the image track. In spite of what some of his detractors think, Godard still believes in the elemental power of cinema, which is why the mesmerizing IMAGE BOOK is a more accessible work than even many of its champions would have you believe. Spotting references and decoding meanings is ultimately less important than the sensorial experience of simply vibing with the uniquely romantic/pessimistic tone engendered by this giant of the medium's total mastery of \"image et parole.\"","user":"mikeygsmith","rank":[22,29]},{"title":"The best film I have ever seen","rating":10,"date":"21 December 2018","review":"This film is not for everybody, so if you dislike it, it's okay.\nBut for me, this is really the best film I have ever seen. And I've seen Felini, Tarkovsky, Antonioni, Bertolucci, Haneke and many other great filmmakers. But GODARD IS THE GOD OF MONTAGE.\nSometimes I even forget that he's 88 years old. I just can't imagine how the hell he does these kind of things at his age.\nThis is my first review in Imdb. I just got registered, so I can write a review on this film, because everybody was complaining about how bad it was. I just realized I don't even have words to review. Sorry. This is it. At least I can tell you that you need to watch this before you die.","user":"astghik_ghazaryan","rank":[31,51]},{"title":"Godard's Minimalism and Reflections","rating":7,"date":"24 December 2018","review":"For years Jean-Luc Godard has been reducing his cinema to increasingly symbolic and minimalist layers. If in the 70s and 80s, his work already called attention to an \"absence of script\", which in fact was a text with broad lines that played for the improvisation on the scene in the following decades until the work of the actors began to be kept to a minimum.<br><br>His films today are like collages of history and reflections on the subjects to which he have more interest: history and cinema. And the parallelism that one has with the other.<br><br>The prolific director's newest work, \"The Image Book\" is the apex of his cinema of symbolism and collage. There are no actors. At most Godard's cavernous voice, today with 88, narrating the film is making reflections on the twentieth century, the new century, humanity, society, and, of course, the cinema.<br><br>For Godard, cinema is the book of images of the twentieth century. Just as the Bible, the Koran and other religious texts are the basis for life in society and tell the story within their respective religions, cinema is the documentation of the history of modernity and contemporaneity.<br><br>Through \"The Image Book\" Godard invites us to reflect on history. And it builds a journey through the twentieth century in an incessant collage of images and sounds that permeate the history of art in its most different forms. All divided into five acts, as five are the fingers of the hands, as five are the senses. Five is a number that runs through the entire film, as well as the metaphor around the hands and their symbolic meanings in each attitude.<br><br>It is through this metaphor of the hands that Godard draws attention to a history constructed by the signs of body language. They are the hands used for love, but they also bring disappointment in the first act, the hands used for the violence of the second act or the hands that legitimize the use of force by the spirit of the laws of the fourth act.<br><br>The first part of the film is a set of reflections of what Godard had already somehow talked about in other works like \"Film Socialism\" (2010) or \"Forever Mozart\" (1996).<br><br>The last part is that it brings a Godard with a look at the Middle East rarely, or perhaps never before, shown so deeply. From a play on words stating that \"Sheherazade would have told a different story in 1001 days,\" and not nights like the traditional story, Godard displays the bankruptcy of the west's gaze over the east.<br><br>For him, we see the Orient as a unique cultural mass, and not as if each country had its own culture and worldview. In the same way that we look to the east as the mirror of what we are not. And this is reflected in the way the cinema portrays the Orient. It is when the hands arise in delicate movements, painted with symbols that we do not understand or hold tightly the Koran in his prayer.<br><br>In a more controversial moment, Godard supports the bomb. Appeals to the positive side of the bomb. The bomb, he sees, is the revolution as it once was in Europe. It is the reaction of the oppressed. It is difficult to support this in times when Europe suffers so much from terrorist attacks. But it is possible to understand Godard's side by trying to show this as reaction rather than action. Hence the parallel with revolutionary movements.<br><br>Godard is a genius. Often misunderstood, often seen as annoying and difficult to understand. But his film remains alive, thought-provoking and pleasurable for those who accept the challenge of trying to decipher it with each job.","user":"alvesmarceloalves-73751","rank":[16,24]}]