[{"title":"A metaphor for the actors themselves.","rating":4,"date":"14 September 2018","review":"This film very much feels like a metaphor for the actors themselves, one last go at making some money and it all going wrong. <br><br>The film didn't know what it wanted to be, a gritty crime drama or last of the summer wine. <br><br>No back story on the gang at all apart from 10 seconds of old footage. We're rushed into the heist scene and before you know it it's all done and dusted. That leaves time for endless squabbling of characters you don't really know anything about. <br><br>A strange casting with Michael Gambon, arguably the best actor there - cast as a bumbling idiot. Jim Broadbent playing the nasty hard man, which just doesn't suit him given the film's we're all used to seeing him in. <br><br>Ray Winston was good and played well throughout the film, but again a very tenuous relationship to the gang and zero back story makes it hard to get involved with the characters. <br><br>The production quality for me was also let down, had the feel of a low budget tv drama, though I suspect this is because they clearly blew the budget on the cast.<br><br>I'd save this one for a long haul flight or when it's free on Amazon.","user":"nrmurray","rank":[76,107]},{"title":"Mundane and unimpressive","rating":5,"date":"3 April 2019","review":"The film is inspired from the true story of the Hatton Garden heist (thus, the script is already half-written) and the main actors are usually excellent. Despite this excellent a priori, the global result is bland, dull and devoid of passion. So boring that I was almost sleepy. As a synthesis: frustrating!","user":"FrenchEddieFelson","rank":[25,32]},{"title":"What did you expect?","rating":8,"date":"15 January 2019","review":"For those who say this movie is slow and low budget: what did you expect? This is not Transformers, there is no Mark Wahlberg or Bruce Willis from the 90's, no CGI, no John Woo feat. Michael Bay. This is just a well delivered true story, brought to you by many of the best actors of our time. And it does not want to be more, so why do you?","user":"gy-att","rank":[71,102]}]