[{"title":"Really does glow","rating":10,"date":"10 December 2017","review":"As said many times, David Attenborough is a national treasure. He may apparently dislike the term, but it is hard to not say that about such a great presenter who has contributed significantly to some of the best programmes (of the documentary genre and overall) the BBC has ever aired/produced.<br><br>It is really hard picking favourites, let alone a definite favourite, among what Attenborough has done because he has done so many gems, it is the equivalent of trying to choose your favourite ice cream flavour or your favourite operatic role (for examples) and finding you can't pick. 'Attenborough's Life that Glows' may not be at his very finest, but for a documentary centred around bio-luminescence and natural light, their causes and the consequences it is the perfect place to start and lives up to its glowing name.<br><br>Visually, 'Attenborough's Life that Glows' as always with Attenborough's work looks great. It is beautifully filmed, done in a completely fluid and natural, sometimes intimate, way and never looking static. The specially designed cameras and how they reveal these lights are used very cleverly. The editing is always succinct and smooth and the scenery is spectacular. Very nice music too as always.<br><br>Regarding the content, 'Attenborough's Life that Glows' does a great job entertaining and educating, it provokes a lot of thought and fascinates. Found myself finding that there was less information to usual that was familiar to me, which was a good thing.<br><br>The presenting by Attenborough helps significantly. He clearly knows his stuff and knows what to say and how to say it. He delivers it with his usual richness, soft-spoken enthusiasm and sincerity, never talking down to the viewer and keeping them riveted and wanting to know more. Nothing is episodic, and if there is an ever so minor complaint it is that it did feel to me a little too short.<br><br>Overall, a treasure that really does glow. 10/10 Bethany Cox","user":"TheLittleSongbird","rank":[5,7]},{"title":"Another great documentary by Sir David Attenborough","rating":8,"date":"29 December 2018","review":"Who doesn't like a documentary about the mysteries of nature? If it's well done anyone could get captivated by those kind of images. And in this case it's again extremely well done, especially with a subject like bio-luminescence that is very difficult to capture on film. The images are beautiful and stunning and the explanations of Sir David Attenborough are very clear and easy to understand. I don't think there's anybody better at this job than Sir David Attenborough. He has the perfect calming narrating voice to keep you interested in any wildlife subject. Sir David Attenborough is somebody everyone's recognizing, by his voice or style of story telling. One day he will be remembered as the guy that educated alot of people about the mysteries of our planet. Life That Glows, the title speaks for itself, is a delight to watch if you're interested in nature, in how and why everything works in certain ways.","user":"deloudelouvain","rank":[0,0]}]