[{"title":"Poorly made and poorly researched","rating":2,"date":"4 December 2018","review":"I'm an engineer and I read a lot about automation and robotics. Makers of this movie clearly don't.<br><br>Movie shows few aspects of robots confusing automation and artificial intelligence. Sections of the movie try to show cases where robotics went wrong or bizarre - deep into man bites dog territory.<br><br>The movie is made in style of 1970s and 1980s educational programmes forced on us in schools. All is narrated by Text to Speak engine from 2005, which makes it unpleasant to listen.<br><br>Total waste of time.","user":"marcin-mgorecki","rank":[17,22]},{"title":"Fearmongering and sensationalist","rating":3,"date":"25 November 2018","review":"Automatisation of society is an important topic that will affect a lot of us, and unfortunately this documentary doesn't treat the issue with the soberness it deserves.<br><br>The title says it all. The documentary focuses on tragic work and traffic accidents involving robots and self-driving cars. It focuses on how Asimov's first law is broken and that robots will replace workers in low-entry jobs. This is concerning, but how do we avoid the robot dystopia and use automatisation to our advantage? The documentary doesn't care. It just want to nurture our existing fear of being replaced and cherrypicks the bad stuff.<br><br>I'm not a naive techno-optimist, but expect something more serious than this from a documentary. If I want to feed my technophobia, I'd rather watch an episode of Black Mirror.","user":"VHSdynamite","rank":[23,34]},{"title":"Title promises more than this half-baked Doc can deliver","rating":2,"date":"2 December 2018","review":"From it's sensationalist title, to the ominous music and the gimmick of an android 'narrating' it, THE TRUTH ABOUT KILLER ROBOTS promises more than it can deliver.\nUnquestionably, our future will involve robots and A.I. (although pure examples of artificial intelligence aren't discussed with any depth here), but, Maxim Pozdorovkin's doc barely delivers a coherent argument. It's broken down into three chapters, but that seems to be the only organizational principle at work here. It flits about from location to location and from topic to topic but never builds into anything constructive.\nThere are a few facts and some interesting tech projects unveiled, but this is a missed opportunity. It's not a surprise that HBO has dumped this on their service without much fanfare.","user":"gortx","rank":[8,11]}]