[{"title":"Not that bad.","rating":7,"date":"14 June 2018","review":"I'm surprised at all the one star reviews - it is definitely not nearly that bad. <br><br>I thought this was a good thriller, and I loved the 'twist'. I really enjoyed the conclusion. It was a little hard to follow at times, and I could have done without the short start, re-do, and ending format. However, I don't feel like that ruined the movie. <br><br>I would recommend giving it a try - it's not perfect, but it's also not the worst movie ever as many reviews would have you believe.","user":"megamelfina-995-947675","rank":[14,14]},{"title":"It's not rocket science","rating":5,"date":"25 November 2016","review":"This is middle of the road for me. I did not think it was an exceptional thriller by any means but the story made sense in the end. ***SPOILERS****<br><br>Basically, the sons are from 2 different dads. The current dad is a hard butted shady dad, the previous dad was a wife beating jerk. 4 sons, 2 sons per whack job dad from the current timeline/past abusiveness hubby.<br><br>The mother is suffering so the church spokesman/doctor comes to drop off a mysterious kit to \"aid\", \"painlessly kill\", the mother? We do not know..yet.<br><br>Meanwhile, the brothers argue and all of a sudden, a home invasion. After about 1/4 of the movie finishes, the events are all recounted with a sloppy explanation as to what \"really\" went down.<br><br>What went down was...the mother's old church group exacted vengeance in the form of baiting the brothers to give the mother the \"kit\"..what is the kit? Still don't know...yet. This is where the writing becomes super sloppy. Why all the hoo ha? Why not just take a bro hostage if instead of killing an entire family? Or, do the kit on the mother yourselves...or...wait for the family to leave, or...this is a big one, make your move BEFORE the family gets together. Frustrating story.<br><br>We see a quick scene of conspiring via a cell phone with the church doctor. \"Meet me at sundown\". Hmm...that's a little hammy.<br><br>Let me finish this up.<br><br>The church completely guts the household just so one last remaining brother gives the mother the \"kit\" remedy?<br><br>Yes, it is a remedy. It seems this entire time, the reluctance to give the mother the kit offered by the church DR. was because the family wanted her to die to get the inheritance.<br><br>OK, so it wasn't pain meds, the mother wasn't some sort of Christian Scientist that was against the use of drugs, that wasn't the reason they might have honored her wishes. The mystery is solved...she would have LOVED to get some pain meds or, as we find out in the last moments, an experimental cure.<br><br>But the family wasn't having it. It was payday. Everyone was dirty including the father who, very early on in the film, resented the offering of the kit by the church doctor.<br><br>The church gets revenge against the mother's abusive husband years earlier by staging an accidental death and then years later, wipes out the whole fam in hopes someone will feed her the drug to make her all better..and..to rid the mom of vulture like family, just waiting for her money.<br><br>OK. Fine. Whatever. I got it. I think?<br><br>Who cares? The more I think about this story by actually writing it out, the lower my rating goes and now, at the end of this final paragraph, this film goes from the middle of the road to the bottom of the stack for me. Whoops! I shouldn't have tried so hard to think about it!","user":"joelbooska","rank":[45,52]},{"title":"Starts off well, but quickly turns into silliness.","rating":5,"date":"28 September 2018","review":"Mercy wasn't necessarily a bad film, indeed the opening twenty minutes or so were rather intriguing, a nice build up, good motives for family feud, but once it started unravelling it transformed into nonsense. At times I was reminded of You're Next, but at no stage did it reach those levels of gripping excitement.<br><br>It wasn't difficult to follow, but the realisation of who was behind the home invasion was dealt with in a way that you can only describe as heavy handed, the reveal three quarters of the way through was very silly, I couldn't take it seriously. Too many unanswered questions at the end, were all brothers aware of what was going on? Never fully answered.<br><br>Quite well acted, with decent production values, the masks were very effective, but with those, as with the rest of the film, there's nothing new here. A little flat, 5/10","user":"Sleepin_Dragon","rank":[8,8]}]