[{"title":"Paramedics: Neat little surprise","rating":7,"date":"24 October 2018","review":"Paramedics otherwise known as bodies was such a hugely pleasant surprise and it simply wasn't even remotely what I expected.<br><br>With the gory opening credits I expected a thorough gorefest and perhaps a degree of \"Torture porn\" but I was mistaken, this is something altogether different.<br><br>The film tells the story of two brothers, one a sociopath, the other autistic. They run a business together which involves pretending to be paramedics, drugging people and harvesting their organs for the black market.<br><br>Things get complicated for them when they take a girl who they both grow a fondness for and a game of wits begins as she races to escape before her uses expire.<br><br>The cast are great, 3 unknowns who really take their characters and make them their own. The mentally handicapped, the unhinged sociopath and the stalwart determined heroine.<br><br>The film isn't as gory as I expected but certainly isn't for the faint of heart. Paramedics deals with some pretty hardcore themes including rape, necrophilia genital mutilation and incest and considerably more graphic than you'd imagine.<br><br>If you can stomach the unpleasantness you have a very well constructed thriller that had me gripped.<br><br>The Good:<br><br>Fascinating little thriller<br><br>Excellent performances<br><br>The Bad:<br><br>Some shoddy editing<br><br>Does make for some uncomfortable viewing in places<br><br>Things I Learnt From This Movie:<br><br>Thats two movies lately about killer paramedics, next time I get hurt I'm walking!<br><br>Expecting a tied up person to help is a bit of a needless guilt trip<br><br>Bread &amp; butter pudding is better with raisins","user":"Platypuschow","rank":[22,27]},{"title":"Great Gore, decent acting, great story...","rating":8,"date":"7 February 2018","review":"A lot of folks are rating this movie poorly, which confuses me. I thought the story was good, the acting was great and the gory effects were very believable. Sure there is some twisted sex scenes that might make you uncomfortable, but that was the directors idea, to get you out of your comfort zone. I really liked this movie.","user":"r-veach","rank":[8,10]},{"title":"Paramedic (2017)","rating":2,"date":"25 May 2017","review":"Bought this in Morrison's a few days ago &amp; to be honest it looked alright, not great, but alright!<br><br>But, wow, this film was bad! I mean, I could've been better but no it was bad!<br><br>88 minutes of nothing but awkward chatter &amp; moments! Not to mention how dumb the premise was &amp; how the film ended also! The film is about 2 brothers who pose as paramedics &amp; kidnap people. They then cut these said victims up &amp; sell their organs to the black market for a £££ price! But one victim they can't cut open &amp; kill &amp; this leads to a good hour of indescribable crap! She gets the better of them &amp; then the tables turn! Shame they didn't do this in Knock Knock! It would've been better!<br><br>The gore in it is alright but could be better! But the story &amp; film overall was just stupid &amp; didn't capture my interest! It was just stupid!<br><br>It's a bad film! 2/10","user":"vengeance20","rank":[8,11]}]