[{"title":"At least grammar check your script","rating":3,"date":"20 August 2018","review":"Lots of potential wasted here. There are neat cgi and cyber-human tech but the writing is ploddingly dull and inept. I was constantly being snapped out of suspension-of-disbelief by words used incorrectly, either miswritten or not picked up by the director editor. <br><br>Mysteries are perplexing, not complexing. \nThings that live forever are immortal, not mortal. \nYou rose through the rank, you didn't 'rised'. <br><br>And everyone is so faux detached and pseudoscientific. Little or no emotional connection to or from anybody. <br><br>Dull as a congressional hearing.","user":"robinssa-98507","rank":[151,199]},{"title":"A+ for visual effects. And F for everything else.","rating":2,"date":"11 January 2018","review":"Question: What sort of movie do you get when you have a visual effects supervisor write, direct and edit his own movie?<br><br>Answer: Why, THE BEYOND.<br><br>Hasraf Dulull, the writer, director and editor of THE BEYOND has a well established career as a visual effects supervisor and in many other roles generally revolving around visual effects. And, truth be told, the visual effects in THE BEYOND are superior in almost every respect. As one professional reviewer noted, Dulull is quite expert in executing visual effects \"in ways that make the movies feel bigger than their budgets\". Dulull has very much succeeded in making THE BEYOND \"LOOK\" like a science-fiction summer blockbuster. Unfortunately, THE BEYOND fails in every other aspect of professional moviemaking.<br><br>Not to put too fine a point on it, Dulull can't write, can't direct, and pretty much can't do anything else effectively when it comes to moviemaking OTHER than create superior visual effects. The storyline is appalling, any grasp of basic physics is missing entirely (sort of a failing in a science-fiction movie...), the majority of the acting is stiff and wooden at best, and so on. Glacially slow, THE BEYOND is literally painful to watch. Adding insult to injury, the movie concludes on an incessantly preachy note that is all but unstomachable.<br><br>I know that brutally negative reviews are not well received on IMDb and that this review will be condemned as \"unhelpful\". But this movie is what it is and one would have to lie to say anything else.<br><br>So A+ for visual effects and straight F's across the board for literally everything else for THE BEYOND.","user":"S_Soma","rank":[285,393]},{"title":"NOT a film for those who need intense action","rating":7,"date":"12 January 2018","review":"I found the film to be very interesting despite having flaws and a pretty slow pace. If you are someone who needs constant action and drama, then this film is probably not for you. I'm not the type of person who typically cares as much for the more artistic visual side of a film (as it's usually more about the plot for me)...but I will say that it seems the visuals were done by some pretty talented people. I'm assuming it's pretty low budget so a great job was done in that department. The acting was also pretty decent too...not amazing but definitely decent with the dialogue they had to work with. Overall the film isn't going to blow anyone's mind, but if you don't have A.D.D. and can handle a slower pace you might just be intrigued by the mystery presented in this film.","user":"dj_pike","rank":[109,146]}]