[{"title":"Compelling.....","rating":8,"date":"19 December 2017","review":"Maze is an adaptation of the true story of the escape of IRA political prisoners from British captivity in Maze prison, Northern Ireland. <br><br>There's a thread of quiet tension about this film that's drawn ever tighter as the prisoners plans to escape intricately come together. At the same time there's a human tale on offer about the connection between people who on initial inspection appear to be on different sides of the bars. <br><br>The reality of course is everyone in Northern Ireland is in one way or another held prisoner by the larger conflict. This includes the warden and his family who has a friendship of sorts with the prison break mastermind Larry who is, in turn, obligated by his bonds with his fallen IRA comrades. <br><br>The acting in this film is understated but frankly quite excellent. Not for one moment was this film dull or boring and believe me, it could have been given the film takes place in the confines of the Maze prison.<br><br>One to watch. 8/10.","user":"s3276169","rank":[42,54]},{"title":"Irish prison escape","rating":7,"date":"8 March 2018","review":"Maze is a movie based on the biggest prison escape in Europe. A prison escape of 38 IRA members, a movie on how they planned and executed it. Even though the entire movie is in prison you really never have a dull moment. I doubt that there was not more tension between the Loyalists and the IRA members, like they portray it in this movie, but all in all it was not really about the hate towards eachother but more about the planning of the escape out of this maximum security prison. The cast was good, all the actors did what they were supposed to do. Maze is an entertaining movie that could have used a bit more violence and suspense to make it a better movie, but it's certainly worth watching.","user":"deloudelouvain","rank":[14,16]},{"title":"Best I have seen in a while","rating":9,"date":"28 April 2019","review":"No explosions or cartoonish special effects so I won't be surprised if it doesn't play well in the US. Factual learning experience, only wish they would have spent more time explaining the situation at that point in history for the younger crowd.","user":"scottk-77763","rank":[3,3]}]