[{"title":"Actually, undead again","rating":1,"date":"1 December 2017","review":"Colonel Boomer (Jake Busey) suspects that Guerrero (Danny Trejo) knows where a book about black magic rituals is hidden. He threatens to kill his family, consisting of daughter Alicia (Elysia Rotaru) and grandma (Michelle Rios, much too young for the role and therefore covered with ridiculous make-up) if Guerrero doesn't tell him the hiding place. Now Guerrero is undead since his pact with the devil in part 1 and comes back several times from the dead. How can Boomer deal with a man he cannot kill, how can Guerrero save his family, and what does the magic book really do?<br><br>The first movie was a horror movie in the disguise of a western, but the sequel - apart from the MacGuffin, the magic book - is a much more traditional western about protecting your family against gunfighters (even if some of them are zombies). The technical qualities are good. For example the scene when Boomer blows up a stagecoach and at the same time, Guerrero is caught in an explosive trap in the town, the two explosions are cut parallel to each other, really elegant editing you hardly ever see in cheap movies. If I voted one notch below for the sequel (6 of 10 after 7 of 10 for the first movie) it's because 'Dead Again' lacks a villain of Mickey Rourke's caliber. Otherwise it is a satisfactory variation of the 'Undead Gunman' theme.","user":"unbrokenmetal","rank":[3,3]},{"title":"Rough Western, but Entertaining","rating":7,"date":"13 September 2017","review":"Col Jackson Boomer (Jake Busey) badgers Guerrero (Danny Trejo) to give up the Bone Box (that contains The Devil's Bible, which will insure he has immense power over the entire world). Guerrero has come back from the Dead as Lucifer has him under control, but he claims he has no idea where the box is or what it is. <br><br>This is a somewhat supernatural western story and we will see a lot of shooting, blood squirting here and there and numerous explosions..and oh, yes, a coming back from the dead too. Supernatural, remember?<br><br>In time, the Devil's Bible is given to Col Jackson Boomer, but something is wrong. It is not enough and Jackson figures this out. Something is missing. What could it be?<br><br>We see Jackson Boomer hanging out in the brothel run by Madame Du Vere (Elizabeth Lavender) and we also see naked girls making out with customers and with each other, too. Guerrero tries to re- establish himself with his estranged daughter Alicia (Elysia Rotaru) and his mother Zerelda De La Cruz (Michelle Rios) who tells Guerrero he must protect the bone box. Later,we see that his mother is quite handy with a gun too. <br><br>The acting is good all around, the music is good, the gun fights are well choreographed, but the cinematography is awesome and almost a work of art on their own. Kudos. <br><br>Notable: Dean McDermott as Dr Goldsworthy who we suspect is something more than human and he tries to have Guerrero reject Lucifer's hold on him. Supernatural, remember?<br><br>This is no holds barred western and is quite rough, but very entertaining. (7/10)<br><br>Violence: Yes. Sex: No.. Nudity: Yes. Language: Yes.","user":"rutzelb","rank":[6,8]},{"title":"If You Enjoy Spagetti Westerns and Danny Trejo, Choose This","rating":8,"date":"1 November 2017","review":"If you enjoy spaghetti westerns (but not made in Italy or Spain), you'll enjoy \"Dead Again in Tombstone.\" If you enjoy spaghetti westerns with supernatural overtones you'll enjoy \"Dead Again in Tombstone.\" If you're a Danny Trejo fan you'll REALLY enjoy \"Dead Again in Tombstone.\" Like Italian westerns, the film serves up plenty of action, and there are no heroes. Some reviewers assert that Trejo can't act. They don't realize that Trejo, may he be a good or bad actor, is more than that. He is a force of nature. Every scene he's in, your eyes are on him. Jake Busey as the baddest of the bad guys is excellent as a \"Southern Gentleman\" and ex-confederate soldier.","user":"LouAbbott","rank":[4,5]}]