[{"title":"The Institute: Yawn","rating":3,"date":"22 December 2018","review":"The Institute is a thriller starring James Franco and Eric Roberts and had me bored, frustrated and simply not interested throughout.<br><br>Based very very very very loosely on a true story it follows a girl who commits herself into an asylum after a tragedy only to find out that nefarious dealings go on within its walls.<br><br>Franco not only stars but directs here and many don't realize he's been directing for over a decade now! I just personally don't think he's very good at it, and quite frankly I don't like seeing him in front of the camera either.<br><br>I get what the movie is doing and the concept is passable enough, sadly the execution is lacking and meanders through its 90 minute runtime at a grindy boring pace.<br><br>It has its moments and that finale was quite inspired but entertaining? Hardly.<br><br>I'm sure had we known the truth about what truth happened in the real Rosewood center that would have been for a more interesting tale.<br><br>The Good:<br><br>Decent finale<br><br>The Bad:<br><br>Simply unlikable<br><br>James Franco<br><br>Things I Learnt From This Movie:<br><br>I'll never understand why people adapt true stories and turn them into fiction anyway<br><br>I don't like James Franco's face","user":"Platypuschow","rank":[26,30]},{"title":"A Complete Mess","rating":2,"date":"6 March 2017","review":"The Institute is sadly a mess of a movie and might leave the viewer seeking professional help to deal with the trauma of watching it. OK, so its not that bad but it could and should have been much better. It deals with the story of a young girl called Isabel checking herself into the Rosewood institute to deal with the grief of loosing both of her parents. The institute at first appears like a high end spa for very wealthy women but it soon becomes apparent that there are sinister characters and forces abusing some of the women who are patients at the hospital. <br><br>There are some quite well known names in the film like James Franco,Tim Blake Nelson, Eric Roberts, Lori Singer, Josh Duhamel and Pamela Anderson but for the most part these are cameos and the rest of the cast is relatively unknown. The dialogue is at times flat and at other times it is cringe-worthy (mentioning the healing process over and over) and the story loses momentum very quickly. The story also seems mashed up as if different movies have been mixed up. Is it a psychological thriller or a gory horror. There is pseudo philosophical discussion and there is nudity, whipping and secret orders which control everything. As if the film makers wanted to include as much as possible and yet ended up watering everything down.<br><br>Some of the other issues are for example that the main character exhibits no real grief even though she admitted herself to the hospital for this and other \"latent maladies\" such as curiosity and flights of fancy. The doctor treating her says there is nothing wrong with her and then proceeds to treat her and feed her tonics and medication together with therapy and brain washing. There are a few twists as is to be expected but in the end the movie still appears nonsensical. The fact that this film is supposedly based on real events makes it even worse as the film makers didn't even respect what the real people went through. Overall a complete mess.","user":"nebk","rank":[47,61]},{"title":"A joke... don't believe the rating!","rating":1,"date":"13 January 2019","review":"This is my first review on IMDb, I created an account solely to vent about this movie. That's your first clue... As an avid fan of all things Horror, Thriller, Dark and Creepy, I was really looking forward to this film... however I was quickly disappointed. The concept of this movie is truthfully a good one, and it could have been great. It was however, poorly executed, the script was lifeless, boring and lacked any kind of depth. I was left laughing at certain points where they quite clearly should have been 'shocking' or 'creepy' but the whole thing felt a lot like I was watching a High School drama performance. The acting was mediocre at best and even with the big star cameos, it left a lot to be desired. The film was full of continuity errors, and generally easily fixed issues which would have added something to the non-existent atmosphere the film created. For example the film is set in the 19th Century, yet in a scene where the female lead is shown topless, you can quite clearly see her bikini tan lines. I'm not just talking a little, I'm talking she's just come back from a 3 week vacation. The 'climactic' scene left me laughing. All in all, don't waste your time - unless your looking for a film to fall asleep to or have a good laugh at then it'll be perfect!!","user":"Hannah7128","rank":[10,11]}]