[{"title":"Watchable, but lacking","rating":5,"date":"24 March 2018","review":"Being an 80s baby, I was so excited to watch this movie. Once I saw that Pharrel Williams, Forrest Whitaker, and Nia Long were involved I got even more excited. Once I actually started watching--whole different story. The movie felt so disjointed. We never even really get to see WHY she was the best. In the opening scenes, we see Chante as a little girl going to battle a grown man, but then...nothing! It cuts to another, unrelated scene. I enjoyed seeing her home life and the relationship with her mom and sisters, but that should've been the backstory. As a pioneer for females in hip hop, I think she deserved better. The movie should've been written in such a way that a millenial could watch it and get a feel for the 80s hip hop scene and what truly made Roxanne Chante significant. This feels like just another hood movie. <br><br>On a positive note, the acting was great. Nia Long and Mahershala Ali were phenomenal like always. Chante Adams was good, but the story didn't let her shine like she could have.","user":"Pinkpanda11","rank":[11,12]},{"title":"Great Performances ...... Bad Film","rating":5,"date":"31 March 2018","review":"The only thing that redeems this messy film is the superb acting specially from the lead actress Chanté Adams; she made me care about her character and root for her character, although neither the character's background or the struggles that the character went through have been represented well. Also, Mahershala Ali gave an awesome and powerful performance, he steals every scene he's in in this film.<br><br>Don't get me wrong it's a bad film but the great acting is what kept me riveted while watching it.<br><br>At the first act, the film tries to show me Roxanne Shanté's backstory which should be important but what I got instead are details about minor characters that don't have anything to do with the story but even that it was hard to figure out who's who. Also, there are a lot of in-your-face messages about racism.<br><br>The character of Roxanne Shanté's mother is annoyingly stereotyped and the film gave her dramatic scenes which are so corny.\nThe dialogue is so faked and stilted that it ruined some great acted scenes.<br><br>There are many important turning points in the plot that are so rushed.<br><br>(5/10)","user":"AhmedSpielberg99","rank":[10,13]},{"title":"Quality Movie","rating":8,"date":"24 March 2018","review":"I gave this movie a 8/10. I thought the acting was great and the actual quality of the movie (sound, picture, etc) was phenomenal. I don't know what the budget was but I wish more movies looked as good as this. Chanté Adams did an incredible job. She was a natural and very believable. <br><br>I think it was a little hard to follow if you're not from that era because I don't know all of the players. I'm an 80s baby and I still don't know everyone who was being portrayed in the movie. I think they should've paused the film with a little caption under each main character so the audience can get a better understanding of who is who. <br><br>Also, I would've liked the film to illustrate how Roxanne Shanté affected the billboards and media etc. This was an inside looking out movie but the outside looking in perspective would've been nice to add, just a tad. Other than that, solid film!","user":"fcthemusic","rank":[10,13]}]