[{"title":"An orphaned baby elephant survive with the help of caring men","rating":7,"date":"28 August 2017","review":"8/23/17. A documentary that has a mild message about trophy hunters and ivory hunters. Basically, despicable humans, and I agree. This is a wonderful story about a Naledi, who was orphaned at 6 weeks old when her mother died suddenly. Even as social as elephants are, it is still hard for a baby elephant to survive without her mother. While an older elephant nursed her, it wasn't enough. Thanks to the men who care for the elephants on the preserve that Naledi was born in, they were able to save her life. Worth catching.","user":"bettycjung","rank":[9,11]},{"title":"Respect for those who do their best to preserve our wildlife.","rating":8,"date":"29 July 2018","review":"As a big animal lover I'm always interested in watching a documentary about animals and nature. In this case they follow Naledi, a baby elephant, from the day she's born until she becomes an orphan, from her being adopted by the herd. They show how they took care of her while being sick and other stuff. It's all very interesting to watch. But it's not all positive images, it's also about the harsh reality of ivory trade, poachers and trophy hunters. I couldn't help myself shedding some tears at some point. But that happens to me all the time when I watch animals suffering or dying, I just can't help myself. Humans, if you can call them that, hunting those majestic animals, out of greed or just for trophies should be severely punished for what they did and should be set as an example to others to prevent such barbarism happening again. The documentary is full of wonderful footage of the gracious animal the elephant is. It's a documentary of hope but also of despair, but it's certainly worth watching if you care a little bit about the preservation of species and our wildlife.","user":"deloudelouvain","rank":[4,4]},{"title":"Everybody should watch this!","rating":10,"date":"3 December 2019","review":"Beautiful and shocking Story. Everybody should watch this.","user":"jelskewinkelaar","rank":[0,0]}]