[{"title":"This isn't the badass JCVD flick I was hoping for, but there is a lot of action...","rating":5,"date":"9 June 2017","review":"I can't deny that I'm still a Van Damme fan after all these decades. I've accepted that he will never make another film like Bloodsport, Kickboxer or Time Cop as his age simply won't allow. However, he's proved in the past ten years with kickass films (like Expendables 2 and the two most recent Universal Soldiers) that he can still execute impressive fight scenes. And with his solid acting (shown most notably in the 2008 film JCVD) I think Van Damme still has some kicks, punches and performances left in him. For this reason I couldn't resist checking out Jean Claudes newest flick (that just released yesterday here in the U.S.), Kill Em' All.<br><br>The films director, Peter Malota, may be a first time director, but he's been working with Van Damme since 1990. I looked him up to discover that they met that year on the set of Double Impact. Malota was the martial arts action choreographer and an actor in the film. He and Van Damme then teamed up, and Malota continued to handle all martial arts fight coordinating on films such as Universal Soldier (the original and The Return), Nowhere to Run, The Quest, etc. All of the above gave me much confidence in this being a fun action packed B-movie with some (hopefully!) exciting fight scenes. Does Kill Em' All deliver is the question..?<br><br>Unfortunately, this isn't the \"low-budget but super badass\" Van Damme flick that I was hoping for, but it's worth rental if you still enjoy watching an older Van Damme kick dudes in the face. It's not particularly bad (for what it is), it's just not particularly good. This film doesn't really do anything we haven't seen before- it's fight scenes are pretty average and what you'd expect. Van Dammes stunt double is obviously younger (and has a slightly different haircut/fade) and pretty easy to notice. Van Damme still gets into the fight, but most of the high kicks are shot from behind and obviously a double (though not nearly as obvious as Steven Seagals have been for the past decade!). On top of all of this, the film doesn't have the budget to ever feel convincing- after the intro scene you never see a single doctor, nurse or patient in the 5 floors of hospital they are running and hiding through (not one!)?! Combined with a weak story and script, Kill Em' All doesn't have too much to praise.<br><br>On the upside, the action is consistent from start to finish, even if it's nothing spectacular. It was cool to see Van Damme fight his own son (Kris Van Damme) in this flick (though I was hoping for a more brutal or impressive fight scene between father and son) as well as 90's B-movie martial artist Daniel Bernhardt (star of Bloodsport 2-4). Peter Stormare (The Last Stand) and Maria Conceit Alonso (The Running Man) co-star as the two detectives trying to figure out where Van Dammes character has disappeared to and what exactly happened at the hospital. <br><br>Kill Em' All isn't particularly exciting or original, but it is a worthwhile rental if you (like me) enjoy low-budget action movies and still want to see Van Damme beat up the baddies. If you are a JCVD fan and haven't watched the Amazon pilot for Jean Claude Van Johnson (2016) then check that out immediately. If you're caught up with Van Dammes resume (or like low-budget 90's actioners) then it might be worth a rental (or watch on late-night cable TV) but otherwise you should probably look elsewhere.","user":"bcbell79","rank":[17,24]},{"title":"Gives Bad Movies a Bad Name!","rating":2,"date":"7 June 2017","review":"Kill 'em All is bad even for a low budget action flick. It has mostly mediocre acting, a convoluted and nonsensical story and even the action sequences are poor and bland. It is a relatively typical action movie story-line: a mysterious stranger dressed in black is outnumbered, wounded and being pursued by a gang of killers. Unfortunately the movie is not very entertaining, exciting or dramatic.<br><br>In this case the hero called Phillip (played by Jean Claude Van Damme) ends up wounded in hospital and is soon pursued by a gang of Eastern European villains trying to kill him and everyone else. There is a nurse helping him and she ends up being interrogated by the police and is helping them piece together what happened. It turns out that Phillip had dealings with the villainous gang during the Bosnian War in 1999. It's a pity that who ever wrote the story couldn't do some fact checking and see that the war ended in 1995. The fact that there are massive gunfights in a hospital and no police involvement also makes the story even less believable. There are of course twists in the story, and these are reminiscent of the movie Usual Suspects but these are only poor attempts at an imitation.<br><br>There are a few well known names in the cast such as Peter Stormare but he and the other supporting players can't do much with a bad story and non-existing material. The fight sequences between JCVD and the bad guys (including his son Kris Van Damme) are not that great and the direction seems sluggish. Overall this movie is best avoided, the story is bad and unbelievable, the action mediocre and the ending is just plain bad. There are worse action movies out there but not by much.","user":"nebk","rank":[11,17]},{"title":"JCVD is the only reason i watch this movie","rating":6,"date":"10 June 2017","review":"I may not a hardcore fan of JCVD that follow him from the early day of Bloodsport but i still acknowledge him as a great martial art artist and a fine action hero in his own right.Nowadays with the booming of CGI action movie people tend to forgot how awesome trashy over the top action movie staring him look like and with this movie Kill'em All i dare to say yes that man can still kick ass.The plot of this movie is very Die Hard like but it have a very good twist but sadly been dumb down by a horrible script.JCVD charm is still there and despite his age his spinning kick is as strong as ever but for the rest of the cast......not so much.The only one tried to put out a solid action scene beside JCVD is not his son Kris but a actress i never heard before named Autumn Reeser which surprise me a lot.Please don't go to this movie with a mindset of a critic but a young 90s teen you will have a good time","user":"phanthinga","rank":[15,27]}]