[{"title":"if your a big fan of Elvis, avoid this movie at all costs.","rating":1,"date":"19 August 2017","review":"So i stumbled on this movie from a commercial on AXSTv and it looked pretty cool from the commercial. The story seemed very cool, the characters had a somewhat unique personality and the music was good. But, come the movie premiere, it was nothing like the commercial. the story was like a real stupid and cheesy version of Law and Order mixed with The X Files. the characters were also really stupid i mean the Elvis in the movie looked NOTHING like the original Elvis, HE Didn't EVEN CHANGE HIS OUTFIT! even the marriage proposal in the movie was trash. who proposes in bed before you go to sleep? that is just awkward and a sign that the so called \"Elvis\" was drunk. But seriously, if you are a fan of Elvis like me and my family is, i advise you to avoid this movie at all costs. it is just trashy and just a movie about the theory that Elvis is still alive. just don't watch it.","user":"itsactuallyamanda","rank":[4,8]},{"title":"Elvis, Pelvis, Pudding and Pie!","rating":8,"date":"28 July 2019","review":"I liked it. It's bright, fun and interesting. It may be the cocktail of prescription drugs talking here, but I had a lot of fun watching.<br><br>The problem with making movies about Elvis is that nobody looks like Elvis. Nobody. Maybe if Johnny Depp would've considered it a decade ago. Anyway...<br><br>It's a fun what-if scenario. I'd recommend it to fans of Elvis who didn't care much for the rhinestone jumpsuit, bloated, gospel, drugged era and would like to see an interesting fantasy about what could have been in the last few years of his life.<br><br>It's a light movie in a way, but it doesn't avoid the darker subjects. The low rating people must have expected an honest biopic. Impossible.<br><br>Take care of business then watch this movie.","user":"dauthier","rank":[2,3]},{"title":"What the...? Why would they...?","rating":2,"date":"10 August 2019","review":"Why does it say \"Biography, Drama\" for genres here?? Seems more like a comedy. And it's definitely not a biography. It's more of a fantasy (at least the last part). And the acting is atrocious. Enough said.","user":"marks662","rank":[0,0]}]