[{"title":"Whitney chronicles the early success and eventual downfall of one of the greatest singers of all time.","rating":7,"date":"10 July 2018","review":"Whitney Houston. Everyone and their dog has heard of a song by this enigmatic lass. The only artist to garner seven consecutive US number one singles and release the best selling single for a female artist of all time. She has broken more records than a lunatic swinging a bat at a jukebox. Yet, with such early fame, her later life was marred with scandals, tainted by drug accessibility and succumbed to an inevitable tragedy. Macdonald's documentary depicts the chaotic world that stardom introduces whilst also retaining a sense of family. Interviews with family members, close friends and colleagues allows a personable quality to shine through this deeply tragic documentary. Tackling broad subject matters of racial segregation and activism during the 80s, the impact of recreational drug usage and never before seen allegations of sexual abuse at a young age. Suffice to say, Houston suffered personal struggles and this film primarily hones in on her downfall. Still retaining her angelic persona, the documentary insinuates that it was her external environment that corrupted her. Similarly to Kapadia's documentary 'Amy', it portrays fame as a disease where young stars are more susceptible to its negativity. The relentless second half drains you on an emotional level as you empathically watch this beautiful talent degrade, especially the phone recording of her 'Nothing But Love' comeback tour. It's not all doom and gloom, the first third does feel hearty and establishes a blossoming strong family bond as we nostalgically glance back at various high points in her short life. 'The Bodyguard', her interpretation of \"The Star Spangled Banner\" and her numerous number one singles. Alas, you can't help but feel that this overstuffed documentary focuses too much on her ruination. Contaminating a beautiful soul. It's an eye-opening perspective for fans and fledglings (I was the latter) that both informs and occasionally succumbs to emotional exploitation. Powerfully charged nonetheless.","user":"TheMovieDiorama","rank":[21,21]},{"title":"Heartbreaking","rating":8,"date":"11 July 2018","review":"Whitney is a documentary about the beautiful and immensely talented Whitney Houston. I don't think I've seen a documentary yet that I thought was bad. The goal of a documentary is to bring forth information about a person, place, time, or otherwise that you may not have known. That was definitely achieved in this documentary however speculative some of the things may have been.<br><br>I knew the inevitable ending of this documentary yet I still wasn't prepared. In fact, her death was made even more gut-wrenching after watching an hour of her tremendous ascendancy and another 50 minutes of her downward spiral. And this documentary was especially impactful to me because Whitney Houston was a staple in my house as a kid; it was her, Prince and Michael Jackson, then a little later it was George Michael... now all four are gone.<br><br>Watching this documentary you will be swelled with emotions as you listen to her amazing pipes as she was tearing up the charts in the 80's. Her voice brings chills and goosebumps it's so incomparable. And from that emotional high you really get dragged down to a supreme low as she is reduced to attempting a comeback tour in the 2000's and her voice is not even a fragment of what it once was; and there would be no comeback, only a passing away. We couldn't even witness a one last hurrah from this singing legend and that was probably the saddest thing of all. <br><br>I don't even know if I could recommend this documentary because it weighs so heavily upon the heart. You absolutely have to emotionally prepare yourself for this. If you think you can brave this documentary then by all means watch it. I only wish that her life ended differently.","user":"view_and_review","rank":[49,52]},{"title":"More emotional than I expected","rating":7,"date":"12 July 2018","review":"I wasn't a huge fan of <a href=\"/name/nm0112374/\">Nick Broomfield</a> and <a href=\"/name/nm0230964/\">Rudi Dolezal</a>'s <a href=\"/title/tt5563330/\">Whitney: Can I Be Me (2017)</a>. The film was built on the foundation of never-before-seen backstage footage from Houston's World Tour 1999, but I felt the narrative was poorly constructed, jumping from her divorce from <a href=\"/name/nm0113140/\">Bobby Brown</a> in 2007 to her death in 2012 with very little detail on what happened in those five years. This had the effect of making the last part of the documentary feel rushed and incomplete. I went into it not knowing a huge amount about <a href=\"/name/nm0001365/\">Whitney Houston</a> (apart from the obvious bits and pieces that everyone knows), and I came out still not knowing a huge amount about her.<br><br>Written and directed by <a href=\"/name/nm0531817/\">Kevin Macdonald</a>, Whitney covers almost identical terrain as Broomfield and Dolezal, with many of the same interviewees appearing in both films, and much of the same factual information presenting itself (Houston tried drugs long before becoming a celebrity; she was criticised as \"acting white\" and selling out her culture by many black people, and was booed at the 1989 Soul Train Music Awards (where her single \"Where Do Broken Hearts Go\" was nominated for Best R&amp;B/Urban Contemporary Single - Female\"); she was hounded with questions regarding her sexuality for much of her life, etc). One hugely important absence from both films, of course, is <a href=\"/name/nm0186947/\">Robyn Crawford</a>, Whitney's one time best friend, road manager, and probable lover, who was pretty much the only person in Houston's life who seemed to tell her what was really what, as opposed to what she wanted to hear, and have Houston's best interests at heart. Apart from a beautiful obituary for Esquire (on whose editorial staff Crawford's wife works), Crawford has maintained a dignified silence since Houston died, and neither Broomfield and Dolezal nor Macdonald were able to persuade her to speak on camera. This leaves a sizeable lacuna in the narratives of both films, as it is fairly unlikely anyone will really get to the core of who Houston was until (or indeed if) Crawford decides to tell her own story. As a side note, one interesting figure who didn't appear in Can I Be Me, but who does unexpectedly pop up in Whitney is <a href=\"/name/nm0004860/\">Clive Davis</a>, president of Arista Records, and the man who signed Houston to her first record deal.<br><br>For all their similarities, however, I found Macdonald's film superior to Can I Be Me. Whitney has two major, and interconnected, advantages over the earlier film. Can I Be Me is more concerned with facts, and probably covers more \"Did you know\" moments, such as the idea to open \"I Will Always Love You\" capella style was actually <a href=\"/name/nm0000126/\">Kevin Costner</a>'s. However, having said that, Macdonald does manage to squeeze in a couple of not especially well known moments of his own; for example, Houston's haunting rendition of \"The Star Spangled Banner\" at the 1991 Super Bowl (where she had her bandleader and arranger <a href=\"/name/nm1245304/\">Rickey Minor</a> take the radical step of altering the time signature from a 3/4 to a 4/4) was completely unrehearsed, and the revelations regarding <a href=\"/name/nm0913233/\">Dee Dee Warwick</a> are shocking to say the least. However, what Macdonald does much better than Broomfield and Dolezal is that, on several occasions, he takes time out from the narrative to simply let the audience hear her sing. Probably because of this, his film is considerably more emotive. I was very moved by it on a couple of occasions; I don't remember being moved by Can I Be Me at all. One scene in particular I found very upsetting recalls that horrific scene in <a href=\"/title/tt2870648/\">Amy (2015)</a> where <a href=\"/name/nm1561881/\">Amy Winehouse</a> is performing in Serbia a month before she died. In Whitney, it's footage from her Nothing But Love World Tour 2010, as she tries and completely fails to sing \"I Will Always Love You\" in Newcastle. The crowd is respectful enough, but given that so much of the documentary is simply about her voice, seeing her like this is very sad, as with her hoarse voice, she can barely stay in tune, let alone hit the high notes, sounding more like someone doing a bad karaoke rendition than one of the greatest singers of all time.<br><br>Another very well handled part of the documentary's narrative is its coverage of what could be termed \"mainstream media complicity\" in her suffering. Look, Whitney Houston was a drug addict and a terrible mother, who was indirectly responsible for <a href=\"/name/nm2002663/\">Bobbi Kristina Brown</a>'s death, insofar as she gave her child no stability, and introduced her to a world of substance abuse. Nobody is arguing anything different. But she was also a person, suffering deeply, in public, and very few people did, or even tried to do, anything to help her. The film presents a 2002 sketch from <a href=\"/title/tt0072562/\">Saturday Night Live (1975)</a> with <a href=\"/name/nm0748973/\">Maya Rudolph</a> as Whitney, in which she addresses the infamous Diane Sawyer \"crack is whack\" interview, and a scene from a 2005 episode of <a href=\"/title/tt0397306/\">American Dad! (2005)</a>, in which an emaciated Whitney \"sings for crack\" in the Smith living-room. These clips were probably funny at the time, but aren't especially funny now, and they serve to highlight one of the most bizarre paradoxes of our celebrity obsessed society; we love to build people up and up and up, but, at some arbitrary point in time, we decide they've become too popular, too successful, too talented, so we do anything to pull them down, and when something goes wrong in their lives, really catastrophically wrong, our response as a society is not empathy, kindness, or understanding, but scorn, derision, and sarcasm. What a strange world we've made.","user":"Bertaut","rank":[56,60]}]