[{"title":"It's not that bad","rating":6,"date":"15 April 2019","review":"I got curious after reading all the negative comments online about this movie. And after watching it I have to say, it's not that bad.\nOk, I understand that the story and the plot are vague and it leaves many questions. But to give it such bad ratings and reviews is a bit out. There are movies that are way worse than this and yes, also better.\nIt's not a masterpiece and won't be a favorite. But it still has some descent acting, descent fx, nice cinematography and atmosphere.","user":"r_manmdy","rank":[12,13]},{"title":"It was definitely not as bad as these other reviews make it sound","rating":8,"date":"9 October 2019","review":"Yes there were alot of things that could have been done better, but the story was solid, but there was definitely somethings lost in translation. The actors were great and the plot was good. The director was obviously new to this. The other reviews you read that trash the film should give it a try and see how they're reviewed. Every person giving a nasty review thinks their Francis Ford Coppela or something","user":"ichoosethelight","rank":[6,6]},{"title":"Like witches... But not...","rating":4,"date":"5 January 2019","review":"So this was a story about a family with a terminal dad and a friend going to a 'special' cabin in the 'woods'. And an evil grandmother (dad's mom, who later gives an oh so sweet interview about everything on a crime show) who was a part of an otherworldly/demon type cult. None of the killing made sense - chaos - TVs in the woods running on special 'power' that shows the future. These old demon/geezers stay alive by facilitating death and making women governors - how else could a woman win Oregon right? Was it all an illusion? Is Mom crazy? The bodies are held for account by locals as they show us baby pictures of the victims - for what - THIS is the horror and EVERYBODY gets bloody and UGLY! This Mom kicks her demon possessed daughter in her head then cuts it off, then her husband's, then the son's and sets them on fire - cause everybody got possessed by a nasty looking little alien/demon/parasite thing that the gubernatorial candidate slams in their brain stem or makes them ingest and granny says this will 'set them free'. Is Mom crazy! And nobody can find the pretty, blonde friend that came with the family. Oh, she's in the snowy woods transforming to an UGLY something! Wtf!? Everybody got possessed and the original lady they found in the woods, dead, can disappear. So Mom's crazy right? The music was beautiful... How about that? #AxeMom","user":"TBnTN","rank":[9,10]}]