[{"title":"Disappointing","rating":6,"date":"8 October 2017","review":"Let me get this out of the way: I LOVED Obvious Child, the first film by director Gillian Robespierre that also starred Jenny Slate. Despite the lack of a similar hook for Landline (most of the discussion over what it was about just seemed to be \"it takes place in the 90s) I was still very excited to see it. Unfortunately it failed to live up to my expectations and to the early promise that the Robespierre/Slate collaboration showed. <br><br>Landline is indeed set in the mid 90s but it is focused on the romantic relationships of the Jacobs which is comprised of a father who is a copy-writer and failed playwright, a mother whose job I never quite caught, an academic daughter, and a youngest daughter still in school. The eldest daughter Dana (Jenny Slate, both annoying and adorable) is engaged and in a long term relationship. After she runs into an ex-boyfriend she ends up sleeping with him and the two start an affair. At nearly the same time younger sister Ali discovers erotic poems her father has written to his mistress. Bound together by this hideous secret the two of them begin to try to discover their father's mistress while trying to protect their mother from the awful revelation. <br><br>There is a lot to enjoy about Landline including all the 90s references which aren't over the top but are nicely woven in. At the same time, the script is a bit of a mess and though the film is trying to meditate on long-term relationships and sexual fidelity the last third is so rushed (a very important relationship is rebuilt over a ridiculously short one minute montage) that it undercuts any poignancy the film might have. <br><br>Slate once again proves herself best in show. Robespierre allows her to be over the top and ridiculous (this is a character who openly snorts when she laughs) and she really runs with it. I'll still look forward to any collaborations director and muse have in the future, but with more tempered expectations.","user":"ReganRebecca","rank":[10,15]},{"title":"The Vidiot Reviews...","rating":5,"date":"11 October 2017","review":"Landline  Cheating on your spouse in the 1990s was more acceptable because the  President was doing it.  However, according to this comedy it didn't make it any less upsetting  on the children.  While twenty-something-year-old Dana (Jenny Slate) is cheating on her  fiancé (Jay Duplass) with her ex (Finn Wittrock), she learns from her  teenage sister Ali (Abby Quinn) that their father (John Turturro) has  been having an affair on their mother (Edie Falco).  This bombshell not only helps to reconnect the estranged siblings, but  also forces Dana to confront her own infidelity and for Ali to face her  growing drug addiction.  While it's enjoyable to relive the nineties, there is little else to  enjoy about this run-of-the-mill period piece. With a derivative  narrative about a New York affair, flat punch lines and unlikeable  leads, Landline is best left disconnected.  Besides, who needed to cheat in the 1990s when landlines offered 3-way?   Red Light","user":"capone666","rank":[14,23]},{"title":"Another authentic comedy from Robespierre that dives head first into discomfort","rating":7,"date":"31 January 2018","review":"1995 was a far simpler time for interpersonal communication, right? Well, at the very least, Gillian Robespierre's \"Landline\" would have played out much differently set in the smartphone era. The \"Obvious Child\" filmmaker re-teams with co-writer Elisabeth Holm and star Jenny Slate to tell the story of a Manhattan family that appears to be falling apart when the teenage daughter discovers evidence that her father's having an affair.<br><br>As with \"Obvious Child,\" no topic is off limits for Robespierre, especially not sex, drugs and other poor choices. Teenager Ali (Abby Quinn) is a rebel child who sneaks off to clubs and dabbles in hard drugs; working professional Dana (Slate) becomes disenchanted with her fiancé (Jay Duplass) and starts falling for a high school ex and there's no shortage of outspoken marital discord between the father (John Turturro) and mother (Edie Falco).<br><br>Robespierre handles each of the film's serious issues in earnest, but there's a comedic whimsy that floats through every scene, especially when Slate is involved. Robespierre and Holm's voice as a writing duo is unfiltered - both mature and immature at the same time. Slate does her best work in that gray area and continues to be an underutilized talent. Turturro and Falco are no slouches (in a year with some great movie parents) and they also recognize the dual tones of the film, even if they don't get to hold the narrative for much of the runtime.<br><br>Moments of human connection are the touchstones of this story, especially under humorous pretenses. Not all that much about these moments is profound, but they're honest and relatable - nothing is fake or manipulated for comedy to an extent that feels aimed at laughter more than truth. And even though the '90s setting feels mostly about fun throwback references, it works to the film's advantage in creating a greater contrast between scenes of in-person connection and moments when characters distance themselves from each other. In today's world, there is no separation.<br><br>\"Landline\" would have made more of a splash if in the end it wasn't simply a film about owning up to and accepting flaws. It arrives there on its own thoughtful path - an agreeable path that's true to its characters - but the themes are just a little obvious. For the right viewer at the right time, however, they will strike home in a deep way.<br><br>A good example of the really positive direction independent coming-of-age films have taken in the 2010s, \"Landline\" shows that Robespierre has a deep understanding of what kind of storytelling is resonating with young adults. Namely, she understands formula and situation and anything remotely glossy doesn't cut it. Her film exudes the authenticity, specifically the desire to dig into the questioning and unflattering sides of ourselves, that more mainstream films sorely lack.<br><br>~Steven C<br><br>Thanks for reading! Visit Movie Muse Reviews for more","user":"Movie_Muse_Reviews","rank":[2,2]}]