[{"title":"much more than a psychological thriller","rating":8,"date":"4 November 2017","review":"Saying that the \"The Killing of a Sacred Deer\" is just a great psychological thriller is at least undermining... <br><br>This film is full of brilliant metaphors, but you have to know Greek mythology and history to understand some of them. When Agamemnonas wanted to go to Troy to fight with his ships, there was no wind and he could't get there. So he asked the Gods to throw some strong winds, but the Gods replied that he had to sacrifice something in order to get the winds he desired, so they told him he had to kill his daughter. Agamemnonas thought about it and he decided to kill his daughter, but when he was just about to kill her, the gods transformed her into a deer, so he killed a sacred deer.<br><br>That's where the title of the movie comes from and you can easily guess the reason..<br><br>So this film is about choices, sacrifices and revenge.But revenge from the Gods. When Martin can bring sickness and death to Steven's whole family, in fact martin is in the place of a God from Greek mythology. And his duty is to bring the justice and punish those who overestimated their powers and tried to play gods( Steven went to do a surgery drunk)<br><br>In addition to that, this great film of lanthimos, gives a harsh critic to the modern way of living in the western societies. Alienation, fake goals, fake relations and money that that bring comfort but not happiness.<br><br>In conclusion it's a great film that gives you much homework to think about when you get home after you watched it and surely much more than just a great psychological thriller that many people believe it to be..","user":"methodman-70252","rank":[499,712]},{"title":"Diiiiiiiiistuuuuuurbbbbbiiiing","rating":8,"date":"16 October 2018","review":"They have you terrified at what was going to come out of someones mouth in just about every scene. I dont know if I liked it or hated it. I appreciated they made Me squirm for a couple hours. But now I think I need to wash it down with like, i dont know, a disney movie lol or something. The people, every last one of them are seriously messed up in the head. Brace yourself to be pushed in the incredibly uncomfortable zone. Should have a warning, \"written by some one with psycological issues\"","user":"SeanDTheFilmMaker","rank":[93,127]},{"title":"The Killing of a Sacred Deer Review","rating":10,"date":"8 November 2017","review":"It takes a Greek director — Yorgos Lanthimos — to revive the elemental power of Greek tragedy in a modern setting. <br><br>Because this is such a primal story it could be the most powerful and disturbing film of the year. The characters speak in a kind of dead tone, usually on banal matters (like how waterproof a watch is). The music alternates eerie silences with harsh nerve-wracking strings and drums. Shots of surgery and blood churn the stomach. The widescreen settings have an amphitheatrical stretch. Alone among recent films, it sends you out in catharsis — \"calm of mind, all passion spent.\" This film releases you, drained. <br><br>A man's misdeed brings down a curse upon his entire house that only his own immense sacrifice can expiate. That's the Greek tragedy, beside which our mundane stories of simple guilt, rationalization, mercy, forgiveness, and even human justice — the business of cops and courts — dwindle into insignificance. <br><br>This primitive drama involves a heart surgeon Steven Murphy and his ophthalmologist wife Anna. That is, the elemental force erupts in the seat of modern science, rationalism, humanity. The professional curers are profoundly afflicted. Their reason is helpless, irrelevant, once the old pagan gods have been stirred to ire. <br><br>Dr Murphy was at least tipsy when his bungled surgery cost a man's life. Murphy has not openly accepted responsibility or expressed his guilt. But he did attend the man's funeral and stop drinking altogether. He also befriended the man's orphaned son Martin, whom he buys gifts and offers friendship as a sop to confronting his own guilt on any deeper level. <br><br>Now Martin swells from orphaned son into preternatural agent of vengeance. For his father's death has proved a curse on his house too. He and his mother — in different ways — crave Dr Murphy to replace the dead man in their lives: \"My mom's attracted to you. She's got a great body.\" <br><br>This thuggish kid has an other-worldly understanding. He has become the seer, the oracle who alone fathoms the root cause of the Murphy curse and its resolution. If Murphy doesn't kill one of his children, his entire family will die. First they are paralyzed, deprived of appetite and will, then their eyes erupt in Oedipusian bleed, then they die. <br><br>Of course these modern sophisticates deny this savage myth. Murphy in particular blames Martin for the curse he has only reported. Daughter Kim understands, because she wrote a paper on Iphygenia, Agamemnon's daughter whom he has to sacrifice to atone for having killed a sacred deer. <br><br>Kim is attracted to Martin and offers herself to him. In him she senses a worldliness apart from the others. Having initially assumed kid brother Bob would go (\"Can I have your MP3 when you die?) she then volunteers to be Dr Murphy's sacrifice. She knows the story.<br><br>The Murphys' life is characterized by a kind of torpor. No-one has any zest for anything. The conversations are banal and wary. Dr Murphy and then Kim report her first period as if it were a head cold. All sense of the primeval has been lost. Anna feigns total anesthesia for her sex with her husband. His friend and anesthesiologist charges Anna a hand job for info. <br><br>Facing the curse Steven tries coaxing, coercion, threats, even physical violence and the threat of murder, to shake the seer off his vision. Steven turns to a school counsellor for advice on which child to pick. Anna twigs to their predicament: \"Our children are dying, but yes. I can make you mashed potatoes.\" She marshals the will to free Martin from her husband's futile abuse. <br><br>Indeed both the doctor and the anesthesiologist each blame the other for failures in the operating room. This is the modern world with advanced science and culture but with stupefied emotions and a shallow sense of responsibility. Dr Murphy forbids smoking in the house, but his wife and daughter smoke outside. Martin accepts his recent addiction with the same resignation he seems to have accepted as his role of messenger from the gods, to bring Murphy to their harsh justice. <br><br>This elemental tragedy is the prophet director's harsh judgment on a world that evades its guilt and responsibility by suspending all conscience, all sense of a higher purpose than the mundane and worldly. The modern news cycle allows no time for the eternal.","user":"maurice_yacowar","rank":[328,496]}]