[{"title":"Could have been much better","rating":5,"date":"17 January 2018","review":"Movie is watchable, and thats all. No compelling story, no atmopshere, music didnt fit. Students acting was hard to watch, and the ending ruined it all for me. First one wich i consider one of the best movies ever made i could watch all day and night but this one i will erase from my memory. 5 is generous","user":"sunrise30","rank":[110,114]},{"title":"A Good example of why some movies should better be left untouched","rating":21,"date":"21 January 2018","review":"The Man from Earth is one of the most amazing movies ever, I mean there is no other movie of that kind, at least to my best knowledge, and more importantly the movie ended exactly how it should have, it was Perfect in every sense. <br><br>The Sequel was a good attempt to say the least but the acting and story itself was rather disappointing. The whole theme of the movie got somewhat disrupted, the original Man from earth was a complete scientific exploration on its own, there was a touch of mystery, facts, a classic debate over human existence and the Gods, where as the sequel was more centred towards John's character, his personal life, and a bunch of school kids investigating his identity, no mystery, no debates, nothing new..viewers already know who and what John is. <br><br>So to conclude, its almost impossible to extend a movie like The Man from Earth, my expectations weren't high to begin with but I watched it anyway hoping I will be proved wrong but of course that never happened. So, while I definitely appreciate the effort, I strongly believe that they should have left it where it ended.","user":"Vishnu_nair","rank":[125,131]},{"title":"Disappointment","rating":3,"date":"16 January 2018","review":"After a very interesting first movie that continously gave something to think about while watching the sequel is an uninteresting investigation story with boring student characters. This spoiled the shining of the first one. I was watching with great excitement expecting something to be formed but nothing did. And the endcredit scene was a very lame one. Such an uninteresting story. The first one is the one to watch. This one just skip.","user":"tszula","rank":[104,113]}]