[{"title":"A bleak story but an excellent film with excellent performances","rating":8,"date":"26 June 2018","review":"It's a sad story of family trauma and an attempt to go home many years later. The photography is superb. The acting is powerful. It works very well as a film overall. I don't want to say any more at the risk of spoiling it for you if you haven't yet seen it but it is well worth watching.<br><br>As for the negative reviews, I suggest you ignore them. This was never intended to be a super-hero action movie. It's a drama and it does what it sets out to do very well.","user":"djbaxter-980-742507","rank":[47,53]},{"title":"Yorkshire sheep farmers confront family shame","rating":8,"date":"7 February 2018","review":"A Yorkshire farm family lives out a curse as harsh and ineluctable as a Greek tragedy.\n The life here is elemental. There are threats of fire and purges in rain. The living quarters are primitive, dark, basic. The men are rough-hewn and violent. The sex is brief, impersonal and urgent. The only modern device is the buzzing shearer. When the guard dog breaks its tether it straightaway mauls a sheep, what it was supposed to protect. \n This is no Wonderland that this Alice ploughs through, stolid and capable. We see her shear and dip sheep efficiently as a man. For dinner she skins and guts a rabbit, but is drawn from its domestic cooking by her brother Joe's drunken aberrancy. She has to fight off his attempt to burn her Range Rover. As Alice, Ruth Wilson is most expressive in her harrowing silences. \n The primeval sin is the father's habitual violation of the young Alice. He is all the more sinister for his gentle, tender mien. He didn't need Joe's violence. \n In shame and anger, Alice spent 15 years working sheep farms wherever she could find them, before her father's death enabled her return. As Joe notes, she is still frightened anew every time she enters a room. Her father haunts her still.\n And yet.... She has to return to the land. She draws on her father's promise to leave it to her, however poisoned it is by her experience. She applies for its tenancy. She fights Joe in an attempt to bring her new savvy to the operation. Ultimately she loses when he wins the tenancy on the promise to sell out to a developer. \n The Joe we see is a drunken incompetent lout with his father's male authority. He is violent but has no sand. For he is as scarred by his father's sin as Alice is. He doesn't realize that until she spells it out: \"Why didn't you stop him?\" His rage and self-destruction are based in that guilt. \n Joe gets his redemption at the end. He assumes the guilt for the murder Alice accidentally committed. Finally he protects her. \n Both are strengthened by this cleansing, the confrontation of their curse. So the film closes on an idyllic shot of the two siblings, as teenagers, walking out of the shadowed barn down into their realm of shining fields. It's probably not a memory but a metaphor for the relationship they have now snatched away from their father's shadow.\n The title has no literal representation in the film. It's antithetic to the waterfall in which Alice twice goes to cleanse herself. Another generation of teens repair there too, possibly without her curse to ablute. The dark river is the family's secret guilt that has rushed through their lives ever since.","user":"maurice_yacowar","rank":[46,54]},{"title":"Grim but powerful","rating":8,"date":"5 February 2019","review":"It's a tough watch, and it's challenging because of the subject matter, but i thought it was handled sensitively and subtly. You will be able to establish very early on that the main character was sexually abused by her dad, and stayed away from the family farm for 15 years, but returned to reclaim the farm when her dad dies. I think that this is one of the best films I've ever seen for such incredible cinematography and the authentic way it handles the complex relationship between an abuser, their victim and the toxic dynamics between such families. I've worked extensively with children who have been sexually abused (a significant number were in isolated rural settings as well) and both Ruth Wilson, and the actress who played her younger self, were incredibly accurate in their depictions. So much so i found it difficult to watch. The pacing of the film was slow initially, but it picked up enough to keep me interested. It was nice to hear a different Yorkshire accent than sean beans as well. Even though I enjoyed it, it would be great to see a Yorkshire film that's more upbeat rather than the \"It's grim up north\" subject matter. Yes, we had Rita, Sue and Bob Too, but that was bloody ages ago! There's so much more to us than kestrels, poverty, sheep and rural incest.","user":"lizshotter-19401","rank":[10,10]}]