[{"title":"life isnt a garden of eden on this planet","rating":15,"date":"15 January 2020","review":"I like independent movies because they are more realistic then what is usually playing at the box office. i enjoy watching how other people live their lives, good or bad, happy or sad. i dont need movies that have all the problems solved at the end with a happy ending. theres a hallmark channel for that.sure this is a sad movie but life isnt happy for everyone and we all make choices that can affect us for the rest of our lives. this is that type of story. i thought it was beautifully acted and you wanted it to end well for the both of them,but due to the circumstances that happened, and were happening in their lives, you couldnt see how it could.-SPOILER - i could understand why he did what he did at the end because of his love for her, and knowing what had happened to the baby, if he didnt get the death sentence, hed be in prison, probably for the rest of his life. and no way could ruby survive without him in her life or in prison, being the innocent, damaged soul that she was. and he wouldnt be able to handle it either, not being able to protect her anymore, like he has done her whole life. this is a movie that stayed with me for days after. for me it was a 10.","user":"bikerhiker92","rank":[4,4]},{"title":"Great acting, unnecessary story","rating":4,"date":"9 November 2019","review":"This feels like an Indie film from get go, and it sort of ropes you right in from the beginning; you are curious about these odd and rather sad characters and stick around to see where this is going to go. The acting is top notch, really quite incredible performances from people you don't see often (I've never seen either of the two leads). HOWEVER. If this was based on a true story, it should never be retold. If it's just fiction, the writer should seek other topics. This thing is just drenchingly sad. The story winds down and down, you know midway through that there can be NO possible good outcome. Towards the end, we can see what is happening in that hotel room and then just hope and wish that it doesn't turn out to be what you think it will; it does. From there on out to the bizarre ending, it is just purely unnecessary sadness. Why tell a story like this? Who could possibly enjoy watching such tragedy? I don't get it. Everything about acting and music and cinematography top notch, but damned if I know why anyone would dream up such depressing dreck to film for others to see. John Doe turned in a top notch performance too, albeit quite brief. Can't wait to see X again, they never let you down, unlike this movie...","user":"GonzoDanMan","rank":[12,20]},{"title":"All Wounded Creatures: Childhood Trauma and Poverty","rating":7,"date":"21 May 2019","review":"David Dastmalchian, crafted an enigmatic story about two adults dealing with brutal childhood traumas while living in poverty. At first, viewers who can the film's low production value maybe like ok where's the story? but the joint performance by David Dastmalchian and Karen Gillan, gives the film incredible value.<br><br>The film evokes off a strong human feeling to story's end plot twists. Dastmalchian 's acting carries the story through, as Gillan's performance as a disillusioned person. The film also functions as a road trip film; it follows their tragic story.","user":"babyjaguar","rank":[12,20]}]