[{"title":"Almost turned it off in the first 60 seconds. Really glad I didn't.","rating":9,"date":"29 January 2018","review":"Haven't made a movie review on here in years, but had to log in to post this. I didn't think this would be my kind of movie, but I loved it. Favourite movie in months. The slow pace picks up so slowly that before you know it you're watching an action movie. My impression at the end was that it was like watching a modern western - set in suburban life instead of a dusty saloon town.","user":"notfoundmachine","rank":[63,76]},{"title":"ONe of the Best Original Action-Drama movies","rating":8,"date":"25 January 2018","review":"This is ARNULD again, here to to lift-up your spirits :) <br><br>I watched it because I thought it was a Budget-Action movie. Well, it was not. This movie was original, had mature acting, original shooting scenes, original dialogues &amp; quite engaging . You become a part of the story. They do not make these kinds of movies anymore . It was serious but not dark, it had funny moments but those were not so funny that they will kill the drama or seriousness of the theme. I consider it one of my favorites. If you are happy then go watch it to become happier. If you are serious then go watch it to admire the theme. Just do not miss it if you like action movies with emotional drama mixed into them.","user":"arnuld-mizong","rank":[55,67]},{"title":"Great noir with a bit of dark humor","rating":9,"date":"18 March 2018","review":"John Hawkes is not often found in principal roles; but this movie shows he is perfectly capable of carrying a movie even when he looks like a common person.\nHawkes is Mike Kendall; a fired (alcoholic ex cop) trying to get back to the force or looking for a job (both things he is not likely to succeed).\nHe finds a moribund woman on the road; take her to the hospital but she dies. He decided to investigate the crime as a way to do something or perhaps clean himself.\nThings get complicated; because nothing is really as simple as it looks and many people has skeletons in the closet. Add to the equation a couple of ruthless killers trying to clean up the mess and two pissed of characters ( a grandfather and a pimp; each one for different reasons) and Kendall's own stupidly.<br><br>While the movie takes a few minutes time to get going; once it is the steam is never lost. The ironic end; is perfectly acceptable.<br><br>In brief: a very good independent thriller that deserves a public.","user":"abisio","rank":[33,39]}]