[{"title":"Pleasant surprise... wow...","rating":9,"date":"27 December 2019","review":"That was INTENSE. Decided to watch this after seeing this film pop up on so many \"2019 Top 10 movies\" lists and I couldn't be happier that I did. Adam Sandler absolutely killed it in this, I kept feeling confused at the choices he made but at the same time felt sorry for him.<br><br>That ending game though... my palms were sweaty and I was on the edge of my seat waiting to see if it was going to end badly like most gambling movies do. I was extremely surprised to see him win his bet thinking \"wow this movie actually is going to have a happy ending\" but oh boy was I SHOCKED when Sandler unlocked that door... my jaw was on the ground.<br><br>Only thing keeping it from a 10 is the ending felt incomplete. What's his family going to think and what's his side piece gonna do once she came back to his dead corpse. Either way this movie was amazing.<br><br>Edit: wow did not expect so much hate on this film after reading other reviews... not to mention it looks like users here are fishing out positive reviews and marking them all as \"non helpful\". I don't know about those bad reviewers but any movie that has me at a lost for words and a pounding heart rate for that long deserves a spot high up on my list...","user":"davidgiorgione","rank":[1,1]},{"title":"Spot on reviews here lol","rating":8,"date":"31 January 2020","review":"All reviews here are correct. The good ones and the bad ones. This movie is a mess and you can like it or hate. My wife hated it, I liked it very much.","user":"marcus-191-212062","rank":[451,556]},{"title":"An Intense Roller-Coaster","rating":10,"date":"15 September 2019","review":"It has been a fascinating ride watching the numerous ups and downs of Adam Sandler's career. From classic comedies like Happy Gilmore to great dramatic performances like Reign Over Me, he has proven time and time again that he is a very talented guy. The problem is that he has let himself fall out of the spotlight over the last ten years, simply due to the fact that he has been choosing some of the worst films of each year, on multiple occasions. In what might be the greatest performance he has ever given, Uncut Gems is his latest role that will be released this fall. After viewing this at the Toronto International Film Festival and giving it a little time to sink in, I can confidently say that this will end up being one of my favourite films of 2019 by year's end.<br><br>Following a jewelry store owner in Howard Ratner (Adam Sandler) as he gets his hands on a precious gemstone from Ethiopia, he decides to lend it to an NBA star in good faith. What sadly becomes apparent is the fact that he has many issues under the surface. Being a really shady figure and having a serious gambling addiction ends up giving this movie an insane amount of tension. This is a roller coaster ride of claustrophobia and I couldn't get enough of it.<br><br>Directors Benny and Josh Safdie have been quietly building a solid little career for themselves. Having worked on very small indie projects like Heaven Knows What and then one of 2017s very best movies in Good Time, they're truly a duo that this industry needs. Their creativity always leaps off the screen in a way that feels very different from other filmmakers working today. This is a movie that heavily relies on pacing, editing, and performances. With a screenplay that requires nearly every performer to constantly be in motion or talking over one another, this movie barely gives you a second to catch a breath.<br><br>By the time the third act begins, you'll probably wonder why you have been so invested in Sandler's portrayal of Howard because he's really not the best person. With that said, it's the fact that he is a terrible person deep down and is so greedy that is what made it so engaging and unnerving at times. With the use of periodic psychedelic imagery, a pulse-poundingly superb score, and a slew of uberly talented performers, Uncut Gems is a movie that states from the very beginning that it's a contender for the upcoming awards season.<br><br>Overall, some viewers will absolutely wonder what the point of the movie was, due to the nature of how the final few minutes play out, but it was precisely these final moments that took me off guard and had me loving it even more. Personally, I feel that audiences have become impatient with films these days and anything over an hour and a half may seem like a chore to them if they're not completely on board, so that's why I would recommend this movie. It's not short, but the way this movie is put together makes it fly by. I believe this movie can be appreciated by many viewers. Uncut Gems is easily one of the years best films.","user":"kjproulx","rank":[470,700]}]