[{"title":"The evil that men do","rating":9,"date":"3 November 2018","review":"Had not really heard much about the brutality of the Guatemala massacres in the '90s, but the story is well written, entertwined with moments of love, courage and charity, and lastly hope for the future, that I think it's best to focus not on the atrocities of genocide, but on finding justice and truth. I hope to God no one has had to go through the turmoil of seeing a family raped and murdered, but the reality is that it happens, and on a daily basis throughout the world.","user":"jeanmichelwu","rank":[1,1]},{"title":"Horror of the Dos Erres massacre, but don't blame it on Reagan","rating":7,"date":"24 June 2018","review":"Interesting and well done documentary about the \"Dos Erres massacre\".\nApparently one of several massacres and atrocities committed in Guatemala in the late 70's to the early 80's.\nStory of yet another genocide in modern times. In this case the Mayan people were deemed subhuman by some of the Guatemalan government and military.<br><br>One thing not touched upon much in the movie that I found out from other sources was the sheer barbarity of the incident, comparable to the Asian and Jewish Holocausts.<br><br>One thing though that put me off about the documentary was blaming the USA. \nIn particular blaming President Reagan. \nAfter all he was instrumental in bring down the Berlin wall and helping what was once the USSR become a democracy.\nWe can't get his side of the story now, and it appears there was no effort to interview anyone from his administration or otherwise get a reasonable view of his policy and dealings with Guatemala.\nMaybe he was fooled as everyone else was. \nFurthermore how much can the USA (and the president) fix with all the many problems going on at the time?\nAnd for that matter what is blindly overlooked here in the equation is why is it and how was it the job of the USA to fix the world to begin with?<br><br>Pretty leftist slants. I doubt if there was a left/democrat administration at the time the president would have never been mentioned in it.<br><br>Anyhow despite the blame thing, it was a decent educational documentary.","user":"jimlacy2003","rank":[8,25]},{"title":"Interesting documentary with the usual Leftist colour.","rating":7,"date":"4 October 2018","review":"Completely agree with review given by jimlacy2003. Also find it typical to blame Reagan while it was all started during Kennedy, but hey he is a democrat and can only be the good guy (the Vietnam war was also started during his era).","user":"BBogus","rank":[0,4]}]