[{"title":"Bgrader with a big B","rating":2,"date":"8 March 2018","review":"Its actually pretty amazing, that this crew made a movie with this kind of cinematic quality, when they didnt give two sharts about the story or character development. \nIts a clusterfuck of medium-filmmaking, and poor writing - trying to corrolate the few good ideas they have. It could have been made in a day, and then edited into something else.<br><br>99% dark mushy out-of-focus scenes, \"stolen\" shots from other horror movie and classic, and the most unrealistic farfetched, stupid plot for a horror movie in a genre, that HAS to be realistic, to be scary.<br><br>English is not my first language, i dont care about grammar much.\nThe only thing that mattered was counterattacking the stupid review from the crew. 9/10, my ass.\nNOTHING in this movie is remotely interesting and none of the character are believable in any way. Every situation leads to a slap in your own face, and you wonder if you should give up, or what the last 50 minutes.<br><br>DONT WAIT FOR THE GOOD ENDING, that saves most shitty horrors/thrillers.\nIt is not there.","user":"Gud-er-gud","rank":[22,37]},{"title":"This low budget B-grade film delivers!","rating":9,"date":"3 March 2018","review":"Known for as a film editor, Julius Ramsay makes his directorial debut in this, his first full length film, following his only four TV series - two of which were Walking Dead episodes. And what an outstanding job he did in directing his cameras, and his cast. <br><br>He teams up with (his brother) Alston Ramsay's first ever role as writer, and together they create a wonderfully tense, low-budget film noir that benefits greatly from its perfect length, pace, tautness and lack of pretension.<br><br>By focusing more on suspense and tension with a perfect touch of gore, the Ramsay brothers have crafted an economical and effective alternative to the many disappointing big-budget entries into this genre.<br><br>The primarily novice C-list, and a few B-list actors were surprisingly impressive. The score was perfect. The cinematography on point. <br><br>Yes there were a few light plot issues, but still much better writing than some seasoned professional high-paid Hollywood writers.<br><br>Aside from that, this film was pretty much flawless - considering its a low budget and B-grade entry level film. Would I see it again and recommend it? Absolutely! A well deserved 8.5 rounded up up a 9/10","user":"TheTopDawgCritic","rank":[30,64]},{"title":"Huh.","rating":5,"date":"21 November 2019","review":"There was way too much going on in this movie. I liked the initial tension but then it added too many tangents to keep it up. The majority of the characters were thoroughly dismal with regards to acting chops. The lead female has been in a few other creepy as f*$k movies so I knew her part would be what carried the movie if things lagged. Which they did, and she did. I kept watching, hoping for more violence and less dialogue (golly, who wrote this script?!?!), and I got 1/2 my wish. Plenty of blood here, though hardly giallo-level or gratuitous. Not entirely unexpected ending, the younger sister was a dead giveaway as a piece , not unlike the rest of the cast, save our leading female.\nNot awful, but even at 94 minutes it felt overlong.","user":"GescomAe0524","rank":[2,2]}]