[{"title":"Insidious","rating":7,"date":"22 February 2020","review":"Insidious: The Last Key is a very nice horror film. We are given a better insight of Lin Shaye's character as well as some really good moments in the film overall. Lyn Shaye is the best element, not only in this installment but in this whole franchise and her performance in The Last Key is fantastic. The jumpscares worked for me and the story seemed fine. I love how everything ties up to the original Insidious story at the end. All in all ths is a horror film which I really really enjoyed, being a fan of the series.Its a good horror film, it has its faults but Lin Shaye is the star of this movie.","user":"MR_Heraclius","rank":[40,41]},{"title":"Unnecessary Addition to the franchise part 2.","rating":4,"date":"10 January 2018","review":"(Some spoiler free views about the movie)<br><br>Insidious : Chapter 3 wasn't enough of an unnecessary addition to the Insidious franchise, so we got this one. This one does have some good elements in it, and definitely more of the bad ones. All in all, the film felt like a below average \"horror\" film. This film really felt underwhelming to me, and I already had very less expectations. If the franchise is to proceed further (no pun intended), they need to change the direction or reboot it. But the best thing would be to stop it right here. On my own scale, I would give it a \"4.1/10\" score. And on the usual A+ to F scale, it would get a \"D+\".<br><br>(Discussion about how I personally felt about the movie)<br><br>Good : What this film does good is it adds some more depth to the character of Elise. They give the back story and all, along with some \"origins\" of Elise. Her character moments are quite good. Some jump-scares, particularly one or two, were good ones. And ... that's it. <br><br>Mixed : None of the parts were \"mixed\", just good or bad. <br><br>Bad : The remaining of the film, just like the third one, felt more like a typical \"haunted house\" story, rather than an \"Insidious\" film. The concept of astral projection they brought in the first film has been turned into a mere plot device ever since the third one, this fourth installment clearly isn't an exception. Honestly, I feel that is the thing that made the first two films what they were. And the way \"The Further\" works has been quite a bit ludicrous ever since the second one, the ludicrousness increased in the third one and now in this one, everything convenient to the plot can be done in \"The Further\". Just like astral projection, this is just a plot device now. And nothing is explained about how the things work to stop that demon. It was just \"you're watching a horror film, so anything that we do for our convenience, you should accept it, no matter we build it or not\" sort of bullshit. The jokes that the two \"sidekicks\" of Elise crack were CRINGE-WORTHY. Just some perverted moments time and again, some unnecessary bullshit, most of the comedic parts feel out of place and did not match the tone of the film. And even though the jokes and all that stupid stuff felt out of place, this film felt like a comedy more than horror. Speaking of horror, it just had jump-scares, none of which made a real sense. Remove them, nothing is \"horror\". Also, some predictable and obvious \"Insidious\" twists at some places, which no longer feel appealing. Also, \"The Last Key\" ..... I am still wondering what was so special about the key, except for Elise giving the demon the last key. It was just a demon who manipulated Elise's father and had fingers made up of keys which served some vague purpose not explained in the movie. The demon when appears in some jump-scares, it scares (at least). But when it really shows up, nothing is speacial about it. So, where's the horror? Scaring and terrifying are different things, and for a good horror film, most of us prefer the terrifying stuffs. The presence of demon serves no purpose? And he's the only demon?!! And how is that blowing a whistle calls Elise's mother to rescue her and a single kick kills the demon? (If only it had some purpose and some story added to the part of the demon like in the first two, it might have worked.) Also, what's with her Elise's dad's spirit dying in \"The Further\"? There are many such questions unanswered by the film and this is not obviously an \"Inception-themed\" or \"Memento-themed\" movie, this was just an incomprehensible mess of a movie. Then, there's a scene of Elise opening the boxes to realize the killings her father committed, where we were teased of jump-scares, and we didn't get a jump-scare at the first time, and after a couple of stupid teasings we get a jump-scare. And if the makers thought we won't be able to predict what they were doing in this scene, they're fools. See? A scene committed to an unnecessary jump-scare, but nothing done to give some actual horror. Doesn't that prove that horror film makers don't know what horror is? And where's that man dressed as bride in a black dress trying to kill Elise, which was supposed to follow her every time she went into \"The Further\"? The film ties up with the events of the first one, which clearly creates some plot holes as the entire film was about astral projection but the way this film ties it up shows as if it was something similar to this film, making this more of a nonsense. In fact, the best part of this film is that it had some scenes from the first Insidious film, which reminded me how good the first two were. Rest of all, unnecessary crap.","user":"NpMoviez","rank":[62,89]},{"title":"Soulless","rating":2,"date":"20 January 2018","review":"The Last Key is filled with recycled ideas and imagery from the previous Insidious films. Characters will make decisions in one scene, only to inexplicably decide the exact opposite in the following scene. Most of the suspenseful scenes feel ripped straight from the previous entries in the franchise (or from other similar series like the Conjuring or Ouija). Worst of all, The Last Key seems to feel the need to remind of you of the other Insidious films and previous scenes with needless flashbacks and reincorporation. The humor is often misplaced, pacing is disjointed, but at least the score will be sure to remind you of when you're supposed to be scared.<br><br>Despite some cool looking sets, there is little to enjoy in this film. The Last Key is a bland entry in a tired series.","user":"jordan-pillar","rank":[75,128]}]