[{"title":"Grief. And monsters. And grief. Did I mention grief?","rating":4,"date":"31 May 2019","review":"STARFISH: a girl named Aubrey returns to a town where her very good friend has died. She leaves the wake early and retreats to the home of her dead friend and rolls around in grief for a while. Monsters show up and the end of the world happens. Aubrey runs around town and tries to collect several cassette tapes that purportedly can save the world. A difficult-to-understand and undoubtedly very symbolic ending happens.<br><br>I don't make movies. I watch 'em. This being the case, my perspective on movies tends to revolve around the idea that they are vehicles for my entertainment (and others like me). Biased by this perspective, I sometimes forget that it often occurs that some movies are not made for the entertainment of people like me but rather as a means of self-expression for the movie MAKERS.<br><br>Remembering that movies are a form of art, those that employ them as a means of self-expression are limited only by their own imagination and whatever aspects of their own lives that are pushing them for expression. Whatever they feel strongly about can be expressed in a movie, and depicted anywhere along the spectrum from literal reproduction to the vaguest abstraction. However, a desperately important but vague abstraction residing in a director's brain just might not translate well into a movie.<br><br>Directly quoting from an interview of A.T. White, who both wrote and directed STARFISH, and referring to STARFISH, \"I was lucky enough to get to make my first film for me, and not have to worry about other people too much.\" Consequently, STARFISH is pregnant with visuals and themes that hold VERY DEEP meaning.<br><br>To A.T. White. Some other people, like me, may need Cliff Notes.<br><br>Professional reviewers obviously LOVE STARFISH; at the time of this writing there are more than 100 professional reviews available online for it, which, given the short shrift that most horror-oriented movies receive at the hands of professional reviewers, is impressive. And the opinion amongst them that STARFISH is a stunning work of genius art is nearly universal.<br><br>Amongst your average schmo reviewers, a group of which I'm a member, perhaps not so much. Right now, about half of the user reviews pronounce STARFISH, essentially, a crock of... fertilizer, and it stinketh. And I am also part of the stinketh group.<br><br>Not being inside A.T. White's head, STARFISH simply strikes me as schizophrenic, illustrating it's schizophrenia by presenting 2 nearly unrelated plot foundations. At the time A.T. White was writing the script for the movie he was in deep grief over the collapse of his marriage and the recent death of his \"best friend\". Apparently as a result, STARFISH is primarily about expressions of grief. And then there's this sidecar storyline about the end of the world and monsters coming across from another dimension by virtue of certain sound frequencies.<br><br>Yep.<br><br>Perhaps this will read as insensitive, but my sense of what happened in this movie is that A.T. White had the emotional need to express a bunch of grieving pain and used this movie as the vehicle. He wanted to express all this pain and that's no fun if nobody looks at all this expression and besides, investors may not be able to perceive it's commercial viability. So he slapped on the thinnest possible veneer of science-fiction-y alternate dimensions and monsters to give the movie JUST enough excitement for the average schmo to give it the time of day. I could practically see the marks where this monster plot was stapled to the movie.<br><br>Truthfully, one of the sadder elements of the human experience is that there's a GIANT rift between people and the experience of grief. For the person grieving, it's all-consuming and mindnumbing, a semi-feverish hunt for relief and cosmic meaning that literally saturates every aspect of your life and your sensibilities at the time. For everyone else, the grieving person is viewed almost like a rabid animal. Everybody feels bad and says so, but there isn't anything they can do to help and anything they might try doesn't help the grieving person get through the hell they're in any faster. Watching a movie made by such an emotionally rabid person, for a lot of people, is just a variation on an already known-to-be-unpleasant experience. \"Oh, great. Now he doesn't just cry about it all the time, he's gone and made a movie about it.\"<br><br>For what it's worth, the parts of STARFISH that are about a grieving person are well-made, at least insofar as it's an accurate, genuine and sincere depiction of a grieving situation. Aubrey explores the home of her dead friend, a place that literally LOOKS like it has been purpose-furnished and accessorized to accommodate a grieving person. Our heroin slathers herself in sadness and rolls around in the carefully arranged life-detritus of her dead friend like a dog rolling in horse apples, no cognitive activity but all sensory experience and emotional reaction.<br><br>I imagine if you were a person who just happened to be going through the throes of grief agony and saw STARFISH you might get a deep connection with it. But aside from film art buffs and the grief-stricken, it would be more interesting to watch paint dry. I got a little thrill when, well into the picture, the end-of-the-world-with-monsters stuff began happening and I thought, \"Finally! Here we go!\".<br><br>But no. The monsters were apparently incorporated to be symbolic or allegorical or abstract or some such blah blah blah. Practically everybody in the world has been wiped out but the heroin walks around in her grief all over the town to find cassette tapes hidden in places that were meaningful to her and her dead friend in their lives together. Of course, if you're grief stricken and looking for meaning, hiding important, potentially-world-saving cassette tapes all over town thereby forcing your best friend to expose herself to monsters for hours at a time makes grief-sense. Outside of that fever-dream context, it's just insane. Picture a cassette tape hidden somewhere in a grocery store; how long would it take you to find it in the real world? Balderdash.<br><br>This is a love it or hate it sort of movie. It's very slow-moving, arty and dripping with symbolism. Well, anyhow, it's definitely dripping with something. I can only hope that my indeterminate ramblings here have miraculously helped you decide whether or not you want to watch it. Best of luck.","user":"S_Soma","rank":[66,76]},{"title":"I sat through this drudgery - so you don't have to","rating":2,"date":"29 May 2019","review":"I'm a huge horror and sci fi fan and had such high hopes for this movie. I was giddy and sooo let down. Most of the movie is basically just her at her best friends apartment lying in bed, lying on the couch, lying on the floor or sitting somewhere lost in her sadness. Sadness which I could never understand or feel. The director never gave the audience anything to know about these characters on a deeper level to make us care about them. This is not a horror or sci fi movie (well slightly sci fi but a let down). It's a drama movie with 4 different monsters and no answers. I guess I'm not the right audience for this movie. Nothing was tied up at the end. Or even slightly tied up. After reading more about the movie AFTER wasting 1 hour and 40 minutes. I guess the film wants us to become Audrey and feel her grief rather than understand it. At 1 hour 15 minutes there was a scene between the girls where her best friend appeared to her. Her friend Grace just kept telling her to be happy and Audrey just kept saying that she couldn't be happy because she cheated and she'll never forgive herself. At that moment I thought maybe there is a deeper relationship between these two, maybe we'll get some back story. I was like FINALLY we're gonna learn something about these two friends that makes us give a root about their misery. Mind you this was 20 minutes before the end of the movie. That one scene tugged at my heart strings a little but then nothing came after it that could help me relate or understand what was going on .<br><br>I kept sitting through this long slow painful movie with barely any talking and her just laying around various parts of the house. I read this movie is all about symbolism and I think I see what they're trying to do but it was a major fail. She encountered a couple monsters along the way but I think the monsters are more symbolic of the monster inside her than anything else. At one point she plays a selection of songs in order Broadcasting the signal that brought the monsters to her in the first place. I think the movie is trying to say something about how the things we love most can destroy us. And also how our actions have consequences even if they're done with good intentions. Also about how we sometimes jump to the conclusion, thinking we know what's right, even though we haven't taken the time to understand.<br><br>Overall I understand what the film was trying to accomplish and I just kept expecting the movie to have an aha moment where it all comes together beautifully, and I kept waiting for that moment and I waited 10 minutes after the movie ended and now this morning i'm still waiting .... still waiting.","user":"laceydelrae","rank":[45,56]},{"title":"Next time, can you make the pace a little SLOWER?!?","rating":3,"date":"3 June 2019","review":"The good: the lead is breathtakingly beautiful. Good actress too. The cinematographiy is very clever and eyecatching.\nThe bad: a \"thriller\" this ain't. It could be bottled and sold as a sleep aid. I literally fell asleep halfway through.","user":"ourmanintokyo","rank":[29,40]}]