[{"title":"The Nun","rating":3,"date":"12 September 2018","review":"Was there a plot? Nun\nWere there any scares? Nun\nAny good acting? Nun\nAny reason to go see this movie? Nun","user":"gareth-robinson407","rank":[725,945]},{"title":"Very VERY VERY cliche. Lots of jump scares. Dragging plot.","rating":3,"date":"7 September 2018","review":"This film is OBVIOUSLY missing the James Wan touch that we loved in the conjuring universe films. Even when Wan used jump scares , it worked bc the atmosphere was tense and creepy . In \"The Nun\" they're overly planted everywhere in the movie to make up for the fact that the director couldn't keep the audience captivated any other way.<br><br>The plot is basic to say the least, it's almost like they just threw it together in 5 minutes to make up a back story for The Nun. The film had so much potential to give the audience a interesting creepy back story to one of the conjuring's iconic villains. Instead we're saturated with filler for the 1st and 2nd act , and FINALLY get something going on the final act . Up until then it's nothing but jump scare city . So if that's up your alley for horror movies then you'll love this . I personally think the brief amount of time The Nun was in the Conjuring 2 was 100000x better than this full length film.<br><br>They also tried to go with this new trend of adding some comedy into a horror film and it's just badly placed and awkward . The acting is okay . Taissa Farmiga &amp; Demien Bichir are the main characters and give pretty good performances. <br><br>Anyway, Overall this movie could've gone straight to DVD or Netflix . Don't think it deserved to hit the big screen if it wasn't going to be directed by Wan . There's some creepy/scary enjoyable moments but overall it's very cliche and downright boring at times. Watch when you're at home on a rainy day with nothing do. Don't waste ur money like i did","user":"tonyjcole94","rank":[648,891]},{"title":"This movie sucked.","rating":4,"date":"13 January 2019","review":"I wanted to like The Nun but damn this movie was garbage. Sure it was shot nicely and the acting was fine, but good grief the story was dull as dish water. Full of cheap scares and a dumb, dragging plot. The nun character was far scarier in The Conjuring movies.","user":"lewismusgrove88","rank":[83,111]}]