[{"title":"Solid and stylish debut","rating":4,"date":"4 January 2019","review":"Well well, a lot of the people on here complaining that they \"couldn't understand half the dialogue\". Um...It's a movie called Yardie, about Jamaicans. In fact the dialogue is perfectly intelligible, so ignore these Daily Mail fools. Try watching Rockers if you want to hear real patios. (Though I suspect you may not, it'd probably send you into an apoplectic gammon rage).<br><br>Also some of these reviews are trashing the movie out of hand. I can't imagine what their problem can be with Ghanaian-descended actor and director Idris Elba. Seriously guys if you just plain don't like black people there's a name for that and you probably shouldn't watch movies about Jamaicans. Some people also complaining that the director isn't Jamaican. Presumably they're also furious that Spielberg isn't an alien, or a dinosaur.<br><br>With that out of the way, this is a visually and sonically sumptuous movie. It looks gorgeous and while the plot is fairly standard gangster fare (I haven't read the book so I judge the film purely on its own merits) it's an enjoyable and well made film, and definitely worth your time.<br><br>Ignore the obvious hater comments and make your own mind up.","user":"BongoJustice","rank":[21,25]},{"title":"Long overdue","rating":10,"date":"25 August 2018","review":"As a Londoner i realised that a movie like this had never been made. We don't have any movies or historical reference material which provides insight into the journey Jamaican expats made and what it was like to settle iinto the Uk during the 70s and 80s. Its scandalous that this movie hasn't been made before.\nAlthough the book makes us despise the lead character D, in the movie he came across as captivating. Human, flawed and often funny. In fact there is this trail of humour which filters through the dialogue which is also my experience of being with my Jamaican friends. Sometimes humour in unlikely places in the movie especially with the audience's attitude to Rico. A nasty yet colorful character played by a white man who sounds Jamaican and it turns out Steven Graham does actually have Jamaican heritage and grew up in a Caribbean neighbourhood in Manchester as a child. He is excellent in this movie.\nThe lead actress who plays D's wife has never been in a movie before and her performance electrified the screen. Part of the generation of Jamaicans who came over to work in the NHS, she represents all that is good and solid in the community. \nI found it fascinating and felt it was important for all Londoners and Jamaicans to see this movie. A slice of our history","user":"beachym","rank":[43,58]},{"title":"Finally","rating":10,"date":"21 June 2019","review":"The movie was great but finally a movie with real caribbean people. I hope more studios continue to make movies like this. Thumbs up for Idris Elba.","user":"smorrison-01106","rank":[9,10]}]