[{"title":"what is true to believe","rating":5,"date":"9 November 2019","review":"Its a film about organ donation, about cell/body memory, severe ptsd, murder and lots of other stuff mixed in a bucket and a lot of flashing dream themes and shown to us as a thriller drama.<br><br>its a dark sinister and painfilled story of a life that should be hallelujahed up in the sky, as the lifesaver a transplant can be.<br><br>what i come to realise after seeing this movie are a very mixed quality acting, a pretty plotholed story, a nervewrecking score and a not so well told ending to this story. so help me if you can, the grumpy old man says to understand what i really missed out on in this film.","user":"ops-52535","rank":[8,10]},{"title":"Terribly amateurish, or maybe a ruined good idea","rating":1,"date":"15 November 2019","review":"Bad acting, terribly uninspired and distracting background music, and questionable stylistic choices in direction make for a very boring first 20 minutes. I felt like there was a good idea hidden there, somewhere but I'm not wasting any more of my precious time with this.","user":"carlos-pires","rank":[6,7]},{"title":"My Review Of \"What Death Leaves Behind\"","rating":6,"date":"15 September 2019","review":"Hamilton's story, told in a non-linear style - mostly just standard flashbacks, has a lot of emotion and melodrama written into what is otherwise a stereotypical \"paranormal transplant thriller\". Not that it isn't a cool horror trope, and WDLB has some good moments in it, it is just a concept that never seems fully exploited to the movie's benefit.<br><br>The story moves to slow and there is way too much use of psuedo exlressionist visual techniques that - together- cause quality sceens to expand beyond necessary, creating loss of momentum. It exposes flaws in acting and dialog that with proper post attention could have spared \"What Death Leaves Behind\" a loss in suspense. The pace, focus on emotionality and over-tapped scenes keep this one from being as thrilling as it needed to be.<br><br>That being said, the film has some quality moments. For most of the film everything rides on newcomer Khalil McMillan's performance, and he does a good job. Actually the cast on a whole give stellar perfances during a lot of the film. Unfortunately though there is a lack of consistency and a few times the dialog is a mess. But again, there is some quality talent at work in front of and behind the scenes in WDLB.<br><br>As far as horror goes, this film never really reaches that level necessary to create the chilling nature of the story. It tries hard but suspense gets bogged down by emotional theatrics to often, and the surrealism is just too much at times. More attention should have been spent on action and stronger, edgy psychological elements. Film like \"The Eye\" and \"Body Parts\" did this premise better. Overall \"What Death Leaves Behind\" is one worth checking out, just go in without expectations.","user":"ASouthernHorrorFan","rank":[8,13]}]