[{"title":"Collective complicity","rating":10,"date":"17 July 2017","review":"1945 (2017) is a Hungarian movie co-written and directed by Ferenc Török. It takes place in a remote rural village in Hungary, just after the German surrender.<br><br>Two orthodox Jewish men arrive by train in the village. Iván Angelus plays the father, and Marcell Nagy portrays his son. The men bring two large mysterious trunks with them. They have hired a cart to bring the trunks into town. They slowly walk behind the cart, without saying a word.<br><br>The Town Clerk, Szentes István, played by Péter Rudolf, appears to function as the Mayor. He is particularly ill at ease when the Jewish men arrive. However, every single person in town is worried. Why are the Jews here? Do they represent Jewish people given up to the Nazis, who have managed to survive the Holocaust? Will they want their confiscated property back?<br><br>Little by little, the town's terrible secrets emerge, and the story is not a pretty one. Everyone is guilty of complicity. Some are guilty of actively helping the Nazis find and deport Jews. The others did nothing to protect Jews. There's not a single hero among them. What happens next represents the plot of the movie, and it is powerful.<br><br>Another reviewer suggested that the movie resembles \"3:10 to Yuma,\" or \"Shane.\" I don't see it in either case. To me, the film is closest to \"Bad Day in Black Rock.\" It may seem impossible that a film shot in rural Hungary shares a parallel story with a film shot in the Arizona desert. However, both films portray the days just after World War II, when hidden guilty secrets are revealed by the presence of a stranger (or strangers). Eventually, these secrets will fade away, but during those days they could still be brought to the surface. This is an incredibly powerful Holocaust film, although the Holocaust had ended when the movie began. <br><br>Of the 12 excellent movies we saw at the Rochester International Jewish Film Festival, I thought this one was the best. This movie has an excellent IMDb rating of 7.7, but I think it's even better than that. If there's one movie of the 12 about which I would say, \"Absolutely don't miss it,\" this would be the one. <br><br>We saw 1945 at the excellent Little Theatre. As I stated above, it was part of the extraordinary Rochester International Jewish Film Festival. The RIJFF is over for 2017. However, some movies will be shown again in the next 12 months. If you live in Upstate New York, and you love movies, the RIJFF is where you should be in mid-July. Watch for it in 2018.","user":"Red-125","rank":[41,50]},{"title":"The most important Hungarian film of the decade","rating":10,"date":"15 May 2017","review":"This is a film about collective guilt over ill-gotten gains. The film was directed by Hungarian ace, Ferenc Török, and is based on a recently published short story by Gabor T. Szanto entitled \"Homecoming\". It all takes place on a single day in mid&nbsp;August 1945 -- just days after the atomic bombing of Nagasaki, which we hear about on the radio shortly after the beginning of the picture --- thus placing it squarely in the context of major crimes against humanity. &nbsp;But this is only the beginning of a tense summer day in a dusty backwater&nbsp; Hungarian town that will take on overtones of High Noon and the Three-Ten to Yuma before the day is over ..<br><br>As the film opens an old fashioned train comes chugging into the station under a black cloud of smoke and two passengers, obviously orthodox Jews clad in black, emerge, one an elderly man with a white beard, the other his son. A crate belonging to the Jews is unloaded. The old man signs a form stating that the contents are perfumes. Fine and dandy. But what is really in them we will only find out later. Next ensues a slow somber parade to and through the entire town with the two Jews on foot trailing the horse and cart on which their mysterious cargo has been loaded ...<br><br>Next ensues a slow somber parade to and through the entire town with the two Jews on foot trailing the horse and cart on which their mysterious cargo has been loaded. As various townspeople watch from their windows alarm begins to spread that this may be merely the tip of the iceberg and when more Hungarian Holocaust survivors follow they will have to return their ill gotten goods and houses. <br><br>The chief alarmer is István Szentes, the town clerk who, we will find out, denounced his best friend a Jew by the name of Pollak, and took over his highly profitable drug store with forged papers to justify his ownership. (Actor Peter Rudolf, 77, incredibly compelling and outrageously cynical in the role --well worthy of a Hungarian Oscar!). One by one others, including the town priest are swept up in the general guilt ridden anxiety. Some are appalled by the dirty history of the town and have varying pangs of conscience. For, above all, this is a film about collective guilty conscience. Istvan's son Árpád who now runs the underhandedly acquired Pollak drugstore and is scheduled to be married that very afternoon, is so appalled by his father's callousness that he runs out on both the unwanted marriage and the unwanted business, and heads to the train station to catch the 3:10 back to Budapest -- hoping to start a new life away from all this internal rot and corruption. <br><br>\"Bandy\" Kustár, the town drunk, blabs in the local pub about the sins everybody knows about but would rather not know. Himself guilt ridden over his the fact that he allowed himself to be tricked into signing a document denouncing Pollák and turning the drugstore over to the town clerk he goes to the church in the middle if the day and asks the priest to grant him confession. But the priest has Jewish skeletons in his own closet and sends poor András off with ten Hail Mary's chiding him for daring to come to the house of God in drunken condition. Mrs. Kustár, a total conscienceless shrew (veteran actress Ági Szirtes, terrific!) scurries to hide expensive Carpets in her cellar, just in case these Jewish men in black start to make claims for restitution of their property. The central figure of all this panic is Town Clerk and drugstore owner Szertes István as portrayed with extreme negative verve by Peter Rudolf. The drugstore alone is the most profitable business in the town and he has the most to lose. Worst of all, his morphine addicted wife will have none of this hypocrisy and accuses him openly of betraying his best friend Pollak who was then sent to Auschwitz. András, the alcoholic husband of unscrupulous Madame Kustár hangs himself in the barn, dying a martyr's death for the sins of all. A climax is reached when the abandoned bride who would have become the daughter in law of Szertes vengefully sets the prized drugstore on fire. When Szertes runs to the church where a mass is being held for hanged András he is seen as the cause of all their problems and nobody is willing to help him put out the fire. The drugstore burns down. <br><br>Finally we arrive at the destination of the Jewish men in black whose mere presence has thrown everybody into panic mode. The Jewish cemetery at the far end of the town. At last, to the great relief of all, we find that their purpose here is not to make any restitution claims but rather to give the contents of their \"Perfumery\" cask a proper Jewish burial -- the cask contains rolled up Torahs and many baby shoes -- symbolic of the Jewish towns people who were taken away and murdered in Auschwitz. In a heart wrenching denouement Szertes, who is kind of an acting mayor, cynically assures the two Jews who have finished their mission that the town will forever preserve the memory of their lost Jews. And now we're back at the train station waiting for the 3:10 back to the capital. Son Árpád Szertes who fled the drugstore and ran out on his arranged marriage is there waiting to depart along with the men in black and we know he will never come back to his mentally diseased home town. PS: In the original story the baby shoes were Bars of German Soap!","user":"alexdeleonfilm","rank":[24,30]},{"title":"The Evasion of Conscience","rating":10,"date":"20 June 2018","review":"An unflinching portrait of the power of conscience and the human effect of its avoidance. The post-modern narrative of identity politics and Nietzschean and victim culture here vaporizes into the dustbin of history. Human choices matter. Memory matters. Morality matters. Selfishness and structural, political complicity therewith lead to social disintegration. As C.S. Lewis wrote, revenge is the predictable arc of human affairs. There is only one thing that breaks the cycle of material human history and that is forgiveness. \nGo. See. This. Film.","user":"twray-89019","rank":[17,21]}]