[{"title":"wrong sountrack","rating":29,"date":"29 August 2019","review":"I have never in my life heard such a wrong music for a particular film. while the costumes, scenography and everything else is aiming to be realistic, historical, MUSIC is completely unrelated to any of that...it doesn't communicate in any way with the rest of the film. it makes it very hard to watch, creates distraction.","user":"Mace_composer","rank":[34,40]},{"title":"An intellectual vision of a Sapphic affair","rating":5,"date":"11 July 2019","review":"The photography, the costumes, the sets, the hairstyles, ... it's truly a masterpiece! Otherwise, the film is excessively cold and intellectual, with an almost-platonic relationship between two female writers, <a href=\"/name/nm0755334/\">Vita Sackville-West</a> and <a href=\"/name/nm0941173/\">Virginia Woolf</a>, in the late 20's, in an exuberant aristocratic environment. From the beginning to the end, I was honestly outside the film, without ever being able to absorb the atmosphere, because of an almost-permanent boredom. Even the gorgeous <a href=\"/name/nm2605345/\">Gemma Arterton</a> has managed to make myself asleep. Literally incredible!","user":"FrenchEddieFelson","rank":[32,44]},{"title":"Exudes Seductive Eloquence","rating":8,"date":"26 August 2019","review":"With all the scathing reviews, Vita &amp; Virginia still had me from beginning to end.<br><br>Its prose exudes seductive eloquence; call me a hopeless romantic but the picture as a whole is like a beautiful ballad or poetry. The synth-pop-esque score feels refreshing against the 1920s backdrop, it doesn't feel out of place; and the cinematography is sleek (I immediately developed a particular fondness towards Virginia's 'hallucinations'). When it comes to the love scenes: less is more, n'est-ce pas?<br><br>(Vita and Virginia) is carefully, delicately weaved and it's beautiful in every sense of the word. Rarely do I show this much affection towards a film I've only seen once; but this had me, it just did.<br><br>Don't let other reviews deter you from giving it a chance...all it really needs is the right audience.","user":"Gabbie_Mara","rank":[18,26]}]