[{"title":"There's no Miami","rating":7,"date":"30 January 2018","review":"This one offers excellent directing, good acting and a so-so script.<br><br>For much of the running time the less than original storyline doesn't matter, because the real story is in the characters. Still, the ending is somewhat disappointing.<br><br>Two sisters come together after years and years. They share an unhappy childhood, and dream of Shangri-La, which in their minds resembles Miami. That's where they're heading, but there are obstacles, of course, like the mounting debt to some local gangsters. The sisters try to get the money via dance shows in more or less seedy night clubs, and also by scamming idiot men.<br><br>Zaida Bergroth is a hugely talented film maker, who shines at cinematic storytelling and at getting to the core of the characters. In this, her best film to date, especially grabbing is her use of music, which contributes greatly to the atmosphere. One of the best compilation soundtracks of 2017.<br><br>Miami is a a director's movie. Maybe next time the script rises to the same level.","user":"EnoVarma","rank":[10,12]},{"title":"crime indie from Finland","rating":6,"date":"9 February 2019","review":"Angela is part of the sexy dance troup Amazing Angels. Anna is in the small town Finland audience. Angela fights with a man in the back alley. Anna comes to her aid she goes home with her. Anna reveals that she's a previously unknown half-sister. Angela convinces Anna to join her on the road and then on stage filing her with images of a fantastical Miami nightclub. Angela's glamor wears thin after revealing her heavy debt. Anna suggests doing a bit of small time blackmailing.<br><br>This is a Finish indie crime drama about two half-sisters. The older sister has some good scenes. Despite some jagged storytelling, I was invested with the girls. I expected more dire situations which is suggested by the opening foreshadowing scene. In that way, the tension isn't quite there when the shocking descent is already revealed at the beginning. The movie does need a scary antagonist to be the crime lord. This is functional without being exceptional.","user":"SnoopyStyle","rank":[5,6]},{"title":"Based on 15 minutes","rating":8,"date":"14 July 2018","review":"Guess this is an indie film. I watched about fifteen minutes of it before calling it quits. In other words, I didn't give the film an honest shot and because of that, I'll give it a score of plus one in addition to its current ranking.","user":"TheOneThatYouWanted","rank":[0,29]}]