[{"title":"Surf, sand, sun, and shallowness","rating":3,"date":"17 April 2019","review":"Judging by the high ratings (Two 10's? Really?) it looks like the filmmakers have been busy casting their votes here on IMDb. The cinematography is indeed quite good but everything else is fair at best, and quite often grossly deficient.<br><br>Starting with the tired old plotline of a kid from the Upper Midwest who's suddenly plopped into the So Cal cool zone (Side Out, Beverly Hills 90210, Tribes of Palos Verdes, et cetera, et cetera...), it begins by rehashing familiar stereotypes and then essentially goes nowhere. The paper-thinness of the characters is perfectly exemplified by the male lead, who nicknames himself \"Minnesota\" apparently to underscore his newbie-ness to one and all (we never do learn his real name). From there, we're treated to endlessly cringeworthy moments as our hapless, prepubescent-looking and implausibly naive hero tries desperately to be accepted by the \"cool kids\" while mooning over his unattainable heartthrob Brooke, who is not only \"out of his league\" as he puts it, but clearly out of his maturity level and seemingly out of his entire species.<br><br>The film is set in 1986, for no apparent reason - there isn't much to establish a mid-80s atmosphere, and there are a number of obvious, careless anachronisms (board shorts were not yet in vogue back then, tatted up guys were confined to trailer parks, and nobody had ever heard of a \"fist bump\"). All in all this has the feel of a vanity project by a writer/director who was most likely a hapless, androgynous Minnesota tweener among surf gods in 1986 Hermosa Beach himself.<br><br>But the real victim of this waste of good scenery - aside from the audience - is the LA County Junior Lifeguards, a truly worthwhile summer program that has taught vital beach and ocean skills to generations of kids. Here, it's depicted as a cliquish and exclusory group run by an abusive bully. If this movie were all I had to go on, I wouldn't let my kids anywhere near it.","user":"denny321","rank":[11,16]},{"title":"Not a very good movie.","rating":5,"date":"13 February 2019","review":"The soundtrack and cinematography were really good. The story was cliched and and the narrative was poor.","user":"tegglest","rank":[8,14]},{"title":"Nostalgic, funny and beautiful","rating":10,"date":"15 September 2018","review":"This will remind everyone of their favorite summer. The movie is beautifully shot in a California beach town and in the ocean in a way that makes you feel you just spent your summer there. The story is universal. Funny and real and surprisingly emotional. The kid actors are excellent. Percy Hynes White is perfect as the kid trying to fit in. Jake Ryan is funny as a nerd. Charlotte Sabina gets her confident but complicated surfer girl character just right. I highly recommend.","user":"michaelbugdanowitz","rank":[10,20]}]