[{"title":"One of the Lesser Scooby Movies","rating":21,"date":"21 August 2016","review":"Scooby-Doo! And WWE: Curse of the Speed Demon (2016) <br><br>** (out of 4) <br><br>WWE mastermind Vince McMahon is hosting the biggest stars in a race but soon a mysterious phantom driver shows up causing major injuries to legend Dusty Rhodes. Soon Scooby and the gang must join forces with The Undertaker to try and bring down this phantom.<br><br>As a life long Scooby-Doo fan I must admit that over the past few years I've been renting any new movie instead of buying it. I don't know but it just seems like these films are being made to make money more than making an actual good film. The latest trend is to team up with various WWE stars and it just doesn't work here and I doubt fans of either group are going to be happy with this release.<br><br>There's actually very little \"story\" on display here and I'm positive most 2-year-olds watching will be able to guess who the \"bad guy\" is without any trouble. Another problem is that the Scooby gang are pretty much thrown into the background and really don't factor into these very much. The WWE guys get a lot of attention but the entire story with the race cars is just boring.<br><br>What makes this even worse is that it's doubtful fans of either series are going to be happy. Scooby and the group are downright boring as they're pushed to the background. The fans of WWE aren't going to enjoy the lack of wrestling matches. You mix the two together and there's just nothing here that's entertaining.","user":"Michael_Elliott","rank":[5,9]},{"title":"A lot of WWE, but not enough Mystery Incorporated","rating":6,"date":"21 March 2018","review":"Being a huge 'Scooby Doo' fan for goodness knows how long, any new show, special or film would be watched with great anticipation. While 'Scooby Doo Where Are You' is still the jewel of the crown of the franchise, a vast majority of the 'Scooby Doo' films have a huge amount to like and are worth watching at least once.<br><br>The second Scooby Doo and WWE cross-over (after 2014's 'WrestleMania Mystery'), 'Curse of the Speed Demon' is not one of the best 'Scooby Doo' films. Not like 'Zombie Island', 'Witch's Ghost', 'Big Top', 'Goblin King' (am aware that this is not going to be a popular opinion) and 'Mask of the Blue Falcon', though find a lot to like about almost all the animated 'Scooby Doo' films (one of few exceptions being 'Monster of Mexico'). Actually too preferred 'WrestleMania Mystery' which felt more balanced in its components. For me, 'Curse of the Speed Demon' is one of the weaker outings.<br><br>Not because it's bad, far from it. It just felt a little unbalanced. For WWE fans, it is more successful, as they are much more prominent. The WWE sequences are exciting, fun to watch and well animated and choreographed, though there could have been more of them in action while a couple of their scenes are a little too prolonged. The characters entertain and are voiced well.<br><br>For Scooby Doo fans, like me (more so than WWE and more of the reason for viewing), 'Curse of the Speed Demon' doesn't fare so well. What there is of them is fine, the gang are true to personality and what they're given is charming and engaging. The chemistry between them is great, especially between Scooby and Shaggy (one of the franchise's biggest selling points in the first place), and the writing is endearingly goofy and amusing with a good deal of heart. The problem is that they are underused and feel too much like support characters when actually they should be the stars.<br><br>Likewise there could have been more mystery. It is slight, doesn't feature enough (playing second fiddle to the WWE) and the identity of the culprit and the motive are too prematurely foreseeable, knew who it was without trouble well before the reveal myself. It is also though fun, creepy and engaging with a good, well designed and pretty freaky villain. <br><br>On a visual level, 'Curse of the Speed Demon' is great. Everything is beautifully drawn and meticulously detailed, with rich, atmospheric colours and a lot of care and time clearly went into how the characters were drawn and move. The music is both dynamic and groovy, with a lot of energy and a haunting undercurrent.<br><br>Voice acting is also spot on from all, especially from Matthew Lillard, for a while he has filled big shoes in a more than worthy way and does Casey Kasem proud. It is amazing too at how it's been nearly 50 years since 'Scooby Doo' first started and Frank Welker is still voicing Fred and with no signs with being long in the tooth. His Scooby voice has taken a lot of getting used to, having grown up with Don Messick, but it has grown on me. <br><br>Overall, sort of a mixed-marginally positive experience for me. Liked enough aspects to stop me from rating it badly, but its disjointed and unbalanced nature stopped me from enjoying it more. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[1,1]},{"title":"I think many Undertaker fans and Scooby fans will enjoy this film.","rating":9,"date":"11 April 2020","review":"This is one of the best Scooby doo movies ever. I thought it was an interesting movie with an interesting story.","user":"marm-31231","rank":[0,0]}]