[{"title":"Creepy and original teen movie","rating":8,"date":"25 January 2020","review":"Look Away at least doesn't keep one in suspense for more than a few minutes, the alter-Maria appearing very early in the piece. For me, it started really well, and for most of the movie was very creepy indeed. There seemed to be a plan, a good one. But at a certain point past the half-way mark that plan seemed to devolve, rather pathetically, into an ordinary girl's very awkward, and rather obsessive, self-pity. This was odd to me, as that's where the trouble began way back in the beginning. Perhaps this was intentional on the part of the writers. It was certainly interesting, and I understand that a story has to have some kind of direction and attempt to be confident. What I really found unappealing was that at first there was a sort of evil cleverness happening that was fun to watch. And then it wasn't clever, just super emotional. Look Away is the sort of movie where you have to judge these things for yourself. Alas, you actually have to get to the end of the movie to find out. If you don't enjoy the direction this movie takes, then you can at least be reassured that this is an original idea, and certainly there are sequences just after the evil twin is let loose that are super classic. I remember a movie once where Merlin told a friend that looking in the future is like eating a biscuit. If you eat it then it's too late, but if you don't you'll never know (I may not remember the exact words!). That's how I feel about Look Away. The mirror scenes could have been spookier perhaps. I am reminded of a movie called The Broken (2008) which featured doppelgängers, and another called Cruel Intentions (1999), which featured, well, teen cruelty. More specifically, you might compare Look Away to a movie such as Carrie (1976, or remake 2013). If you really enjoyed that movie then you'll probably like this.","user":"robertemerald","rank":[5,5]},{"title":"Nice Surprise!","rating":7,"date":"2 November 2019","review":"I caught this on Showtime with time to kill and my expectations were low, but wow, nice surprise. Love the atmospheric feel, and wow India did a great job! For some reason, i thought it may be some kind of Lifetime movie type deal, i was soooo wrong. It kept my attention the whole movie, and with India that's not hard to do. It's worth a watch.","user":"zeelu-89550","rank":[5,5]},{"title":"Almost ...","rating":6,"date":"24 September 2019","review":"The first part is excellent; touching, creepy, interesting and really very chilling at times. A mix of believable characters and relationships, very well acted. The stage is set perfectly, but unfortunately in the second half the violence somehow undoes the tension already established. It's as if they couldn't resist the temptation to overdo it. Less would have been much more. Rather than build on the psychological and atmospheric creepiness, they throw it away with a rather unimaginative, predictable story arc, where the very dramatic actions feel over the top, and lack impact. A shame, as this really could have been excellent. Nonetheless, worth a watch.","user":"jon-c-ison","rank":[5,5]}]