[{"title":"Fun take on the generic slasher","rating":9,"date":"15 November 2018","review":"This movie is for fans of the slasher genre. If you aren't one of those to begin with, then you might not care for it. But if you are a fan of the genre, then LASSO delivers the goods in terms of suspense and plentiful well-executed gore scenes. It also messes with some of the formulas in a fun way. Rather than hapless oversexed teens being dispatched by the bloodthirsty cowboys, we have a tour bus full of old folks. There's something extra fun about seeing old people fight back. There were a couple of scenes where I found myself clapping in my chair. This isn't CITIZEN KANE, but as far as modern slasher films go, it gets very high marks from this fan. A solid 9 out of 10.","user":"anakrid","rank":[16,23]},{"title":"No Plot, Awesome Gore","rating":6,"date":"2 February 2019","review":"This is kind of a cool blood and gore movie, about a tour bus of people coming to watch a rodeo at a small town. The rodeo is over, and all at once, a sadistic band of killers show up to torture and kill everybody. That's not just the tour bus people, but pretty much everybody in this small town. That is THE story, which more or less, you have zero idea why they are doing this, so the whole movie is extreme violence and some pretty damn good gore effects. This is not a movie that viewers need a clean cut plot as to why the killers are killing, and the victims are trying to survive. I am one of those that have no problems with that, as long as the death effects are done well, and they are. I had fun with this gorefest, and gorehounds should get a kick out of it. Good Friday night extremely violent gorefest, and I enjoyed it. 3.5/5","user":"Indyrod","rank":[5,9]},{"title":"A mediocre horror movie that hates cowboys but understands nothing about them","rating":4,"date":"13 November 2018","review":"On the surface, there could be a decent horror movie in this. Killer cowboys hunting down people? It's a silly enough that it could merit some entertainment.<br><br>Unfortunately, it's just not a great or even decent horror film. The characters are thinly written and sometimes completely pointless (did we really even need a senior tour group involved?), the acting is mediocre, the dialogue is awful, the pacing is erratic, the movie is not very scary and a lot of things happen at random with no rhyme or reason. Worst of all, too much of it feels like an excuse to showcase long, over-the-top torture scenes. Admittedly, some of the gore is effectively nasty and it's not badly directed in terms of cinematic presentation, but after a while you start to grow numb to the violence. One person's death means no more than the other's when we have no investment in their safety and there's nothing else happening in the plot to justify its existence.<br><br>Even more obnoxiously, it's clear that this was made by people who hate cowboys and rural culture, but have never been to a rodeo, talked to a real cowboy/ranch-hand or understand anything about them outside of cartoons. I know I'm asking too much from a mindless action movie that wants to have it both ways by being an over-the-top parody and a serious horror movie, but it comes off as amateurish and at times like ignorant animal rights propaganda (which is crow-barred into the story for no particular reason because it never plays into the story after its original discussion). All we know from this film is that cowboys are murderous human and animal abusers that need to be slaughtered just...because.<br><br>So yeah, this is a big ole pass, pardner.","user":"zgamer-1","rank":[13,31]}]