[{"title":"A fun little thriller.","rating":7,"date":"9 February 2019","review":"Drawing influences from Saw (2004), Final Destination (2000), and Cube (1997), Escape Room follows six individuals, all of whom receive a puzzle box prescribing a cryptic note inviting them to the Minos Escape Room Facility. Lured to the facility under the promise of receiving a cash prize of ten thousand dollars, these six strangers must endure several intricately designed puzzle rooms in a thrilling game of life or death. While the premise doesn't exactly scream originality, Escape Room is a perfectly enjoyable little thriller. For those expecting buckets of gore and sickening death scenes, look elsewhere, as Schut and Melnik's screenplay is much more attuned to focusing on the elaborate puzzles themselves, resulting in a film that intrigues rather than disturbs. Pace wise, the film doesn't slow down and is engaging throughout, some of the puzzle rooms are quite visually arresting, and thankfully the characters aren't just one dimensional zeroes either. While the ending does border on nonsensical, Escape Room is a still a fun film that is definitely worth checking out.","user":"rustonreviews","rank":[153,191]},{"title":"To my surprise, I enjoyed this movie!","rating":9,"date":"6 January 2019","review":"Went in without watching trailers or reading any background info on it. My friends really wanted to see so I tagged along. With horror movies, I never get my hopes up as it's hard to find a good one these days. I surprisingly really enjoyed the concept of this movie and would consider it more of a thriller. It never bored me and it wasn't gory like the saw films (which I never enjoyed). I liked the characters and their backgrounds.. it was nice to see how they all tied in together. It was a pretty good movie and I'd recommend.","user":"valtierraitza","rank":[240,335]},{"title":"Solid Watch .. until the ending","rating":7,"date":"9 April 2019","review":"Enjoyed very much until the last 10 minutes. I wish the internet were to broke off at that point. Such a waste of a very cool flick.","user":"deniz_yazici","rank":[87,129]}]