[{"title":"Messy","rating":4,"date":"20 November 2017","review":"This man's story is definitely tragic and I feel for him and his family. In saying that, I'm reviewing this as a film and it's not great. The problem with making a true story film about a person who had a fairly ordinary life until one event happens is that there is not enough material for a full length movie. I had the same issue with 127 Hours. The writers have to find filler and, in this case, it was John's early relationship with his wife and, as someone previously said, a weird Benjamin Button remake with his unborn son. I feel as though if the makers of this had just kept it in the period he went caving and was stuck with perhaps more focus on how he, his family and rescuers were dealing with it, it would have been a more powerful telling of his story. Instead, I spent the first part wondering who the strangely dressed man was that kept popping up. The acting was okay but the underground scenes were confusing and you couldn't really get a sense of what was going on when he got stuck and afterwards. Although it was good that John's story was told, I feel it could have been done better.","user":"sforrester-3","rank":[11,12]},{"title":"Well made but some people should avoid it","rating":8,"date":"8 February 2019","review":"As you'd expect, this is not for anyone who has above average claustrophobia and it's tough enough anyhow. They soften the technical details of how he's stuck but the point is clear.<br><br>Knowing it's a true story and knowing the ending doesn't make it easier. I don't get the negative reviews, or how it might have been done better, except as a gritty technical exercise (a different type of movie).<br><br>The flashback and premonition scenes are well done, also. This was a difficult story to tell under any circumstances.","user":"A.N.","rank":[8,9]},{"title":"Confusing, poorly-made adaptation of touching true-life story","rating":1,"date":"29 September 2016","review":"Hmm. Well, they tried. The true story of John Jones' entrapment in the cave is certainly interesting and tragic, don't get me wrong. However, the film suffers from a number of problems. For one, it gets bogged down with uninteresting filler and drags on. Another problem is that so much is unexplained and confusing. It is unclear exactly how John is stuck, as the only explanatory image we are given of his body position is on screen for about 2 seconds, viewed with a shaky camera. As a result, I was somewhat unclear on what they were trying to do to get him out. Likewise, the climax of the film was VERY confusing. All the anchors break (even though it was only a single one in real life), dust and rocks fly, and then blackness. Aaron (not a real person) is taken out, and John is heard asking if Aaron is alright. And then . . . John is suddenly dead talking to his unborn son, and the movie ends. There is no explanation of whether rescuers continued their efforts, and if so, what they tried. They mention earlier that in order to get John out, they would have to break his legs. It is never mentioned again. Did they try it? Dismiss it? No explanation of how John died or when, what his last words were, who was with him, nothing. It is obvious (at least in the movie version) that he was still alive after the collapse of the anchor system, so what happened next?! It was very poorly executed. It makes the rescuers look extremely incompetent, which of course they weren't in real life. And that brings me to the last problem, albeit the smallest: the changes from the real story. Artistic license is sometimes necessary when adapting true stories, but it can go overboard and hurt the story rather than help it, as in this case. John and his brother seem like fools because they are exploring passages in a cave they have never seen before, and they split up and explore alone! Disaster is just waiting to happen to such careless people. In real life, there was an entire group of people exploring with them. Another invention is the character of Aaron (and possibly others). I realize that he was a \"composite\" character, meant to represent various rescuers who helped John. However, the audience is meant to form an emotional attachment to Aaron, his struggles and problems, which all turn out to be hollow as he doesn't really exist. Then there is the invention of the creepy \"Benjamin Button\" version of John's future son, dressed in turn-of-the-century clothing(?). Very strange. He appears in visions(hallucinations?) to John first as an old man, then progressively younger until, after John's death, John holds him as a baby, telling him he needs to take care of his mother and sister, since he will be the man of the house, essentially. This is very touching. However, his son doesn't really need to be the man of the family and take care of anyone for a while, since John's widow marries again about 3 years after the incident in real life. This is of course just fine; I am not trying to be insensitive to the real people involved; I have the greatest sympathy for what they went through. I am merely pointing out the changes and flat out inventions made to the real story that look ridiculous when the true facts are known. In short, I can see that the filmmakers were going for an inspirational message with this movie, and at a couple of rare times, they succeed. The problems arise when they need to use boring filler and padding to make the movie feature-length, have unclear and confusing story elements, and overdo in changing real-life elements of the story. I do think that John and his family's story should be told, but I believe it would be better told through a documentary, where the true facts can be presented clearly, and this touching story can be shared more comprehensively and accurately.","user":"davidw-61363","rank":[22,34]}]