[{"title":"Testosterone, bad directing and writing failed this film","rating":3,"date":"27 August 2018","review":"Sure we've seen these films before. Yes there was every cliche in this film. But I never get bored watching vengeance films - unless they are produced like a 5th grader.<br><br>Right from the start (and throughout), the annoying Tetris music set the stage for failure. The screenplay just as infantile and bad. The director couldn't even instruct his actors on where to properly look during certain scenes, and where to aim the cameras properly. The heroin addict girl was overly annoying, loud and obnoxious. Stu Bennett overplayed and under-performed this tough guy act. He made Steven Seagal look more convincing in his recent flop action films. The fight scenes where 1980's. The entire film was predictable.<br><br>Unless you're really really bored, I'd pass on this one. Even the fake reviewers felt guilty giving this a 10/10 so they gave it an 8. It's a very generous 3/10 from me.","user":"TheTopDawgCritic","rank":[25,30]},{"title":"Not that bad--decent action","rating":9,"date":"25 January 2019","review":"It's a decent Netflix action movie. Not that bad. The star is ugly, the characters simplistic, the plot as basic as it gets, but there's plenty of good old fashioned violent revenge. Throw in a few cute women and you have the makings of a regular Grade B movie. What's not to like?","user":"matvox-43243","rank":[5,6]},{"title":"It's bad but not suicidal bad","rating":5,"date":"31 December 2018","review":"Yes it is bad. Yes the acting is bad. Yes it's everything stupid and then some, yes you know it is predictable... but it's saving grace is that it wasn't meant to be a serious movie or even in the park of been good. In the sense of been a brain dead stitch the mind off and just vegitate it does it well.<br><br>I've watched a lot worse with a much better cast but those tried to be serious and hardcore, this is 80's/90's action with all the expected stupidity and dull laughs.","user":"priestofpsi","rank":[8,11]}]