[{"title":"Five bags of popcorn","rating":10,"date":"17 October 2017","review":"In terms of humanity, Lucky is the simplest story I've ever connected to. Seeing it in theaters was one of the most emotional experiences I've ever had watching a movie. <br><br>Lucky walks the thin line between being an exploration of death and a celebration of life, because it manages to be both. Lucky is a character that at first couldn't care less about his mortality. He didn't think about it because he didn't have to. But when the effects of old age start to set in, Lucky can't help but see his own death everywhere. With the onset of this fear, he learns to embrace death - \"realism\", as said in the movie. However, this process was not so easy, as he first had to let go of his anger to understand the beauty and sadness in the experience of his whole life up until his old age, and everything he has yet to be a part of. <br><br>Many try to claim that movies \"used to be simpler\" and \"had better stories\" due to less technology, but I'll be damned if they aren't easier to connect to now than ever. Lucky follows suit of movies, loosely like \"Manchester by the Sea\", and greatly like \"Paterson\" which both came out within the past year. These movies pay homage to real life by stripping the substance down to normal human experiences that most end up having to face, and everyone can at least recognize. In particular, Lucky is that of accepting how everything in life will go away in time, so all that can be done is to experience it. This ephemeral experience of life is both beautiful and sad, as this movie is both about life and death. <br><br>The reason that a movie like Lucky hit me so hard was because it threw nothing in my face. I was so immersed in what felt like real life to me that it was as sudden as extreme as life can be when all the sudden it got so emotional, like in the bar. Lucky's stance in the bar, letting go and explaining his stance as a human being was one of the most emotionally moved I've ever been by a single scene. Again, this is because everything develops so naturally, and because I personally connect with what Stanton's character has to find his way back to after 90 some years of age - being able to smile. While all aspects of the filmmaking delivered this effect, I especially recognize the script and Stanton's performance for their organic emotional accomplishment within the story.<br><br>To me, Lucky owns up to the internal and external unknown. It represents the ongoing process of learning how to smile in a life that will continue to break you down.","user":"Rosebud815","rank":[102,112]},{"title":"Goodbye Harry.","rating":9,"date":"15 October 2017","review":"If ever there was a deserving send off for a grand actor, then this be it.<br><br>As \"Lucky\", the cantankerous but lovable old sole, shuffling his way out of this mortal coil, Harry Dean Stanton is, as always, remarkable. <br><br>Striding with purpose, very slowly, through a very regimented daily routine - diner coffee, crossword, game shows, cactus watering, smokes, drinks at the local watering hole - Lucky is revealed as a complex, always thinking, opinionated, ready to drop the gloves, 91 year old.<br><br>There are several great performances, highlighted by David Lynch bemoaning the escape of his pet tortoise, but the film really belongs to Harry. Swiping some great real life histories (Stanton's stint with the Navy) blurs the line between fact and fiction just enough to act both as a fitting tribute and engrossing movie on it's own merit. This is a talkie, where action moves at a tortoise pace, but it matters not, for Lucky has that rare power to draw the audience right on in.<br><br>Among the many low key but brilliant highlights, is a stirring scene to which Johnny Cash sings Bonnie Prince Billie's \"I See a Darkness\".<br><br>Harry Dean Stanton was indeed Lucky.","user":"js-66130","rank":[74,82]},{"title":"A wonderful swan song to the amazing career of Harry Dean Stanton","rating":8,"date":"13 October 2017","review":"In terms of actors, there were very few like Harry Dean Stanton. He could bring emotion and eccentricity to a role like few others. Whether it being a \"space trucker\" in Alien, Molly Ringwald's father in Pretty in Pink or any one of his collaborations with David Lynch, Stanton was a icon of cinema. His presence though always felt like seeing an old friend, a sense of comfort seeing his withered, story driven face. Other than Paris Texas, Stanton was only litigated to supporting and minor roles in films. Appropriately, for one of his final performances, Stanton was given the chance in the spotlight again. <br><br>Lucky isn't a film about much. Directed by John Carroll Lynch (another great character actor) in his directorial debut, it simply follows the everyday routine of Lucky (played by Stanton) and the interactions he has with many of the local townsfolk. Lucky seemed like the role that Harry Dean was always born to play. It could almost be considered a companion piece to the 2013 documentary on Stanton, Partly Fiction. It incorporates much of Stanton's real-life philosophy, dry wit and even his musical ability into the final product as well. It feels like Lucky is just an extension of Stanton's personality which is absolutely wonderful. He was born to play this role and it would be a crime to see anyone else play Lucky. There's wonderful cameos from many different great actors including Ron Livingston, Tom Skerritt, Ed Begley Jr and of course his long-time collaborator David Lynch. All of them bring a wonderful warmth to their performance, despite their brief screen time (Lynch in particular, has a wonderful monologue about his lost tortoise 'President Roosevelt'). <br><br>This is very much a character piece over a narrative piece which may put some viewers off. However, to anyone that enjoys these types of movies with philosophical contemplation with wonderful characters and dialogue, this is certainly a movie for you. It serves as a great ending to Hollywood's best character actor.","user":"ollie1939-97-957994","rank":[62,69]}]