[{"title":"The Divine Order is a divine movie","rating":10,"date":"28 April 2017","review":"I just came from seeing this movie at the Tribeca Film Festival. What a treat. I wanted to see it because it seemed incredible that the Swiss did not grant women the right to vote until the 1970's. How could such a country be so backward on women/human rights. Women were not allowed to vote, open their own bank accounts, or take a job without the permission of their husbands. Amazing! The acting was so natural and the cause so relevant today when women's rights are still under attack. One of the best movies with a message that I have seen in a long time. Brought back many memories I had of the women's movement in the U.S. in the 70's. Wonderful talk back after the movie with the director and some of the actresses.","user":"jcab-18143","rank":[30,41]},{"title":"Medieval Switzerland in 1971","rating":9,"date":"6 November 2017","review":"The Swiss film Die göttliche Ordnung was shown in the U.S. with the translated title, The Divine Order (2017). The movie was written and directed by Petra Biondina Volpe. The film stars Marie Leuenberger as Nora, a wife and mother living in a small Swiss rural city. <br><br>Nora would like to work outside the home, but for this she needs her husband's permission. Starting with this revelation, we quickly learn that the society is incredibly patriarchal. The key point is that women can't vote. So, they can't change the rules that keep them down because they don't have the political authority to bring about change.<br><br>This change only came about because of women's work outside the system, using every tactic they could think of to get the system changed. (It did change, as we know. What I didn't know is that the last voting restriction against women didn't fall until 1991!)<br><br>In a movie like this, the quality rises or falls based on the work of the protagonist. Leuenberger is a experienced professional actor. She was superb in this role, and that isn't only my opinion. She won the best actress award in an international feature at the Tribeca Film Festival in NYC for her work in The Divine Order.<br><br>This isn't a perfect film. There are some obviously contrived situations, and some very predictable scenes. <br><br>It sounds strange, but the movie was sometimes difficult to watch. Switzerland in 1971 was so bizarrely out of synch with the rest of the developed world that the setting felt like a medieval kingdom rather than a rich, modern, industrialized nation. I kept waiting for William Tell to walk down the street with his crossbow.<br><br>I had to keep reminding myself, \"This really happened. Swiss women truly couldn't vote. Many men--and some women--wanted to keep it that way.\"<br><br>We saw this interesting movie at Rochester's excellent Little Theatre. It was shown as part of the 2017 High Falls Film Festival--Celebrating Women in Film. It will work well on a small screen.","user":"Red-125","rank":[10,13]},{"title":"A great Swiss film on Switzerland and their culture","rating":10,"date":"17 December 2017","review":"I saw yesterday (Friday, 15 Dec 2017) in a cinema in Rio de Janeiro (Brazil) the Swiss Film \"Die Goettliche Ordnung\" here named \"Mulheres Divinas\" (somewhat like \"Holly Women\", an awkward title for a great film). The film is spoken in Swiss German with subtitles in Portuguese. Once I did live very happily in Switzerland from 1986 to 1992 (a period quite close to the facts presented in the film) and since I even did learn and I actually do speak Swiss German due to my great integration into the Swiss way-of-life, the film touched deeply - really very deeply - my inner feelings (and I am a married man). Perhaps foreigners might not grasp all the subtle details on Switzerland, but the film conveys a lot of information on the country and their culture. \"Schampar Guet\", as I would say in Swiss German! Highly recommended.","user":"marcelohdb","rank":[10,14]}]