[{"title":"Good... but....","rating":7,"date":"2 May 2017","review":"This movie is kind of awkward... It seemed like a very good, martial arts, flick to watch, but there's something weird in it.<br><br>Well, first thing's first, the casting is awesome. Scott Adkins in the lead role, Marko Zaror as the \"strongest villain\", and Cung Le as the guards' official. I expected fantastic choreography, from high flying strikes, as well as fast paced combats... but that's the main problem with the movie itself...<br><br>This movie has an \"In Hell\" feeling to it... if you recall, \"In Hell\", starred by Van Damme, was one of the few where Van Damme didn't showcase his skills, as usual... it had a more \"real fight\" feeling, into it...<br><br>\"Savage Dog\" has this feeling... Adkins, here, is not a martial artist, but a bare knuckle fighter... and so, his skills are limited to some punching work, and a few loose kicks, here and there.<br><br>So anyone, like me, that were expecting the second round of \"Undisputed III - Redemption\", between Adkins and Zaror, will be a bit disappointed, since both actor limited their skills to knuckle fighting and few kicks, when we would expect high kicks, and flying strikes.<br><br>The fight between Cung Le and Adkins was very very strange... first, Le beat the hell out of Adkins... only to throw him to an arms reach of a machine gun, and then, Adkins ended the fight.<br><br>OK, it's plausible, that in a real fight, the one being beaten to a pulp, if managing to get a hold on a weapon, would use it, and end the fight... but in a movie, we don't expect this... we expect fighting with honor, man-on-man, hand-on-hand... but that, never happened...<br><br>After my first disappointment, I had to re-watch the movie, once more... it felt weird, but no THAT bad... so I re-watched once more... So, the bad part is the limitations regarding the fighting choreography... but the movie itself, is entertaining... it has lots of action, bloody action, to be correct, and a nice story into it.<br><br>So, if you are planning to watch it, do it, without expecting spectacular flights, or over-the-top strikes... expect a very nice action movie...<br><br>Only that... and you'll be good.","user":"dctr666","rank":[8,8]},{"title":"Not that fantastic but Good for Adkin fans","rating":5,"date":"28 April 2017","review":"Lets get the obvious out of the way, is it something that will keep you on the edge of the seat? No. The story was quite OK. The script was barely good. The acting was just decent however as usual when the action and choreography is concerned with Scott Adkins, he is great. This movie is no where close to The Ninja series or the Undisputed Series however if you are Adkins fan , I would suggest you see it. It starts off slow but the action sequences at the end becomes really nice and has couple of strange twists as well which keep your head scratching. All in all good action movie but that's about it.","user":"captainandy14-389-939291","rank":[12,14]},{"title":"Keep Calm Dog","rating":5,"date":"2 May 2017","review":"I reckon if Scott Adkins was around in the 80s he'd be a very big star. As it is, he even struggles having a fan base in his \"home\" in the UK. But that doesn't stop him having decent success in quite a few movies in recent years. Also while I'm not sure if he's big in Japan (tonight), I do know he's big in Germany.<br><br>But even over here this particular movie will have some issues. Or rather limited success to be more specific. While the movie does try to give the whole thing a slightly different taste with its story it doesn't work that well overall. Also the action scenes are not the best he's done, stunt wise that is. If you're a fan of his work, this may be worth a look, but everyone else should probably spend their time otherwise","user":"kosmasp","rank":[14,17]}]