[{"title":"Pure fun","rating":6,"date":"22 February 2017","review":"Shot in black and white and clocking in at just over an hour, it is one of the more original movies coming out of the Berlinale. Several elements stand out, like the production design by Carlos Conti (37°2 le matin) with its odd, detached feeling bringing to the movie, but also the daring cinematography by Aleksei Rodionov (Idi I smotri, Orlando!) combined with good editing makes the movie work.<br><br>So nice work in all sectors, but basically it is the actors who have to carry through in this dark comedy, somewhat difficult to define: Third screwball, third Woody Allen, and a third Britcom but definitely with a style of its own.<br><br>Potter herself gave the best synopsis by calling it a movie about ideals and convictions getting tested in a crisis situation. The really good script lines are dispersed among the excellent cast, although I do have a weakness for the role of Timothy Spall, such a great and modest actor, gripping the movie from the start onwards.<br><br>Why not rate this higher? I think it lacks a really great ambition, it is a nice ensemble piece, but despite the good things feels somewhat empty, more entertainment than art. The sum of the parts just doesn't add up enough for me, which often means the difference between OK and excellent.","user":"diand_","rank":[73,107]},{"title":"If you have a moment...","rating":9,"date":"3 December 2017","review":"Stellar performances, 9/10 script (there is a little bit lacking in the ending), and an overall likability to all the characters. For the first time in a long time I felt like I needed to post a review, because it felt like my view wasn't represented. If you liked Carnage, this is for you: This is a tightly wound, small play, made for screen. The bonus of having close-ups and a definitive, select final cut, made this a real treat.","user":"viqous","rank":[60,90]},{"title":"A theatrical standard brought to the big screen","rating":8,"date":"14 October 2017","review":"The middle-class dinner party in which the thin veneer of polite society is ripped away to expose the dog-eat-dog savagery underneath has provided ample fodder for playwrights since probably the birth of theatre, but films in which such a gathering is the sole focus are rarer. So step forward British auteur Sally&nbsp;Potter.<br><br>Having been appointed Shadow Minister for Health, Janet (Kristen Scott Thomas) and her husband Bill (Timothy Spall) throw a celebratory dinner party for their friends: the acerbic April (Patricia&nbsp;Clarkson) and (played by Bruno&nbsp;Ganz) her new age partner Gottfried (\"prick an aromatherapist and you'll find a fascist\" says April); lesbian professor Martha and her 'Masterchef' runner-up partner Jinny (Emily&nbsp;Mortimer), who is carrying their purchased foetuses (\"babies are born every day, in large numbers - large enough to put our planet at risk\" is April's unsentimental but accurate comment). Banker Tom (Cillian&nbsp;Murphy) arrives with his wife's apologies: she will be along later. Thus the stage is set, but when a champagne cork shatters a window it is an omen that this will be a dinner party none of the attendees will soon forget.<br><br>Trendy lefties who spend too much time thinking are an open goal when it comes to comedy, with their talk of 'post-post-feminism' and their professorships in Utopian Americanism, and Potter does not miss the target in her - I suspect affectionate - mickey-taking. There is nothing original in this - not even the 'twist' at the end - but the film is so entertaining that does not matter (with one exception: when banker Tom heads to the bathroom to snort cocaine I rolled my eyes - just once I would like to see a fictional young banker who *does not* have a coke habit: don't any of them simply put the kettle on?)<br><br>There is good acting all around: Clarkson gets all the best lines - albeit at the expense of depth of character - but that merely makes the others work harder with the lines they have been given. Thomas, whose character is the most fully-formed, is noteworthy.<br><br>At just over seventy minutes this is rather a short film. Quite why Potter decided to make it in black-and-white I do not know - extra filmsnob points I suppose. But it is hugely entertaining and I look forward to seeing it again. (After all, any film which lists in the credits 'production dog' *must* be good!)","user":"euroGary","rank":[46,71]}]