[{"title":"NOT Horror, VERY low budget Drama w/ Horror Elements.","rating":20,"date":"20 September 2017","review":"'The Atoning' is extremely low-budget, and it does show, and it is not a horror film in the modern blood and guts sense of the term, but rather a drama with common Horror elements. it is supernatural in some ways, but there is no gore to be had, and not really even any jump scares, that's not the kind of movie it is. It is not a movie for anyone who is used to large budgets, and doesn't enjoy micro budget films. It is a much better film than people are giving it credit for, and it is clear most of those watching it have not watched many very low-budget films, and may have not even realized this film is so low-budget. whereas, I watch them frequently, and I generally enjoy them; sometimes more than their big budget counterparts.<br><br>It is also not for those who like fast- paced films, or are expecting gore. You will not find any of that here. If you have seen and ldidn't hate movies such as: 'Lo', 'Bethany', or 'Beyond the Gates', you will likely like this film. It isn't the same thematically to any of those per say, but they are all similar in their confinement to one main location, have spotty, but overall good acting, and are extremely low budget.<br><br>What you will find here is a quiet, micro budget thriller, with an above average script, great cinematography(the director was a cinematographer), a good score that isn't obnoxious, and some good acting from 2 of the leads(from most of the cast{there is some wooden acting by some), and not good just because it's a low budget film, it is a decent film all around, despite it's flaws.<br><br>I've watched a number of films such as this thematically, and although different 'The Forgotten', 'Soul Survivors', 'Premonition'(the one with Sandra Bullock' and 'Passengers'(the one with Anne Hathaway), come to mind, but this film's script has a strength in it's simplicity, whereas those films were often muddled by their convoluted and overly complex plots. The Atoning, while being cryptic by necessity isn't convoluted in the way those films were. The editing is also far better here than those films. Yes, there are a couple choppy sequences here and a couple confusing cuts, but they are brief and easily ignored, and don't hurt the overall film. For the most part, things run smoothly, and the film doesn't suffer from a convoluted script or terrible writing like the films mentioned above.<br><br>I very much enjoyed one of the twist, there are a few, and one is very obvious, and even though it was ruined for me in one of these reviews, it didn't ruin my enjoyment since it is an obvious twist.<br><br>Yes, the film does a little more foreshadowing than it reasonably should, but again, it did not take away from my enjoyment. There were still enough unanswered questions that kept me guessing and wondering until right at the end when the final things were revealed. Unlike most mystery-type movies, I felt the final reveals to be quite satisfying. I didn't leave feeling dissatisfied, and that is extensively rare for me with movies of this type.<br><br>I found the makeup effects towards the end, while primitive, to be well done. I am a lover of practical effects, so I did appreciate that they used very little CG, there are definitely a few aftermarket computer effects, coloring, blue hues, heightened eye color on the creatures, some black swirls, but they were minimal and enhanced the overall effect. I enjoyed the creatures, and I thought the those paying them did very well at being sinister and creepy, you could tell they were having fun.<br><br>As for the psychic others mentioned, I'm glad I thought she would be a total scenery chewer, and she kind of is, it made thugs seem less over-the-top, and she wasn't extremely over-the-top as a medium, you want that, go watch 'Witch Board'. I did notice something about her acting was different. I looked on her IMDb profile, and she is primarily a stage actress, things make sense now. This actually explains her somewhat exaggerated expressions(she naturally has a very wide smile and a naturally expressive face), on stage everything has to be bigger to be seen by those in the back, but even with that over exaggeration, she was fine on the whole, and, I thought, effective in her role. The father's acting was not phenomenal, but it was appropriate, once you get to the end, his lack of emotion, which just comes across as bad acting, and maybe it is, makes total sense. While a better actor could have done more with the role overall, he was appropriate to the role and still decent.<br><br>The mom and kid were miles away the best acting-wise, and thankfully the worst and most wooden acting was reserved for those with the smallest parts, you'll know once you watch it, it was none of those I already mentioned, saying who may ruin part of the plot.<br><br>The direction was serviceable, not spectacular, but good enough. The cinematography was great, some may not appreciate the lingering shots, but I found them effective and enjoyable, not distracting. For a movie with this low of budget, the cinematography is heads and tails above where it should be, and it gives the film a very classy feel. The cinematography is really the best part about this film.<br><br>This is a movie that fans of well-made low budget films, slower-paced films, and fans of well-made low-key thrillers will enjoy. Anyone else should steer clear, you will absolutely hate it, which is truly a shame. I hope Mike Williams makes more films and learns from his mistakes the next go round, if he does, he will go on to make some truly great films.<br><br>I hope this film finds a larger audience over time, it deserves it.<br><br>God Bless ~Amy","user":"lyrafowlpotter","rank":[12,17]},{"title":"The Ungrateful Dead","rating":5,"date":"11 September 2017","review":"Ray (Michael LaCour), Vera (Virginia Newcomb) and their son Sam (Cannon Bosarge) stay in their home. There is a mystery as to what is going on. Seasoned horror film viewers should have an inkling in the first two minutes, feel certain by 20 minutes and not, it is revealed half way through the feature. Vera does not sleep in the same bed as her husband. Ray is reading a book on the atonement of the dead and people are yelling at them to get out. Vera keeps taking a picture down which goes back up. Pictures of another family show up. Every possible clue short of Nicole Kidman.<br><br>There are clues as to what happened dropped early. Not too hard to figure out. Characters were boring and I found the demons too stereotypical to be frightening....dark figures from the closet.","user":"nogodnomasters","rank":[7,10]},{"title":"Microbudget film that does a few things right, and even more things wrong","rating":5,"date":"5 September 2017","review":"For everything this movie does right, it also fails miserably at almost double the rate. For example, the cast was largely comprised of competent and often exemplary actors, including the lead actress and the child. Really superb performances. Then we have the father who is dull and monotone,two dimensional, and can't express emotion to save his life. The worst of the acting comes from the person who played the Psychic. She was such a damn ham, she literally ruined the second half of the film for me. This person obviously rarely acts, and believes that by being the worst stereotype of a psychic she could possibly muster, she might steal the show. News flash; you ruined every scene you were in with your limited and inane \"performance\".<br><br>The movie takes FOREVER to get going, and when it does, you see it coming from a mile away. Everything in this film has been done before, and more competently, but some of the creepier elements were handled with great consideration. The \"antagonists\" were just people dressed in black cat suits, and the cheapness of the production really brought down its value. There are no real SFX to be found, everything is practical, but the worst kind of practical. Think \"community theater\" levels of amateur. It really ruined what was supposed to be the single best part of the film.<br><br>Lastly, while the script was serviceable, the story was so limited and sophomoric, it was like watching a Lifetime film (wait, IS THIS A LIFETIME FILM?). The \"twist\" is cliché, the verbal exchanges made me hate the characters and the final act whimpered like an animal you need to put out of its misery. This movie is the type of production you make with the absolute lowest budget possible, and while it may work for more talented individuals, the people responsible for this film just don't have those skills at there disposal.<br><br>Overall, this film got a few things right, especially in regards to the casting. But everything else just falls short of even the most bare bones horror film. I advise the people who made thing movie to secure additional funding for their next project, and to inject a less \"school project\" aesthetic to the SFX and the cinematography. It really elevates the level of the production when you are considerate about the visuals of said film. Avoid this movie, but keep your eye on anything else these people might make.","user":"manuelasaez","rank":[12,20]}]