[{"title":"Terrible Script!","rating":1,"date":"20 July 2019","review":"Another low-b film that goes nowhere and ends nowhere. The script has the same horrible dialogue that so many low-b films have. I wanted to like this film coming out the gates but as the minutes rolled by, I realized that I was wasting my time.<br><br>A discovery. Something cosmic about said discovery. Disagreement on how to handle the discovery. Government (or in this case a University) wants to hide and control the discovery. Sadly, the entire film is about the arguing of the discovery rather than exploring the discovery. Seriously!<br><br>This film is a lot of the same that we've seen in so many other small films yet nothing new or interesting. Watch at your own risk, the risk of wasting your time. the good news is that after watching this film, I quickly began to forget what I had just watched, so almost as if it had never happened.","user":"AMZCali","rank":[19,27]},{"title":"Not that bad as everyone suggests","rating":6,"date":"15 September 2019","review":"Yes the acting is not extraordinary, yes the filming quality is not that good, the storyline is OK.\nWatched it and did not regret \"wasting\" my time, would I recommended because it was that good, probably not. But if you like movies that have bit of science or tech in it, it's probably worth to watch.","user":"pjosse","rank":[4,4]},{"title":"Something went wrong","rating":3,"date":"24 July 2019","review":"It's hard to know where to start with this, it has some really interesting ideas but it seemed to get partway into exploring them and then ditching them for another idea completely.<br><br>it's starts out with an aging scientist trying to prove a theory regarding dark radiation which after some setbacks (setbacks are a cool band by the way) he is given a lab at a university on the condition that he teams up with some early 20s guy who is abrasive etc.<br><br>they accidentally discover an alien signal, download it and give it to someone to help translate it, at which point that storyline seems to end in favour of a storyline where they use the machine that picked up the alien signal to upload data directly to to the younger guys head; it's not clear whether it's the alien data or just random data but the upshot is that he can now smell the ingredients in the older guys cup of tea and other heightened senses, this storyline seems to go nowhere as the next storyline of arguments over who owns the rights to the invention comes into play.<br><br>the young guy randomly sleeps with a female friend he's known forever, cheating on his pregnant girlfriend, they split up for a bit and then he turns up to the ultrasound, says sorry and she forgives him - the female friend isn't mentioned again.\nthe young guy also shaves off his hair, walks around the street naked, the older guy somehow walks into him, takes him back to the lab and extracts the data the younger guy uploaded and then sets fire to the machine he's worked on his entire life that can pick up alien signals, discover dark radiation and instantly teach people anything because...I don't know - whatever. he avoids being legally punished for this because some people committed suicide or something (I assume the company that took his machine tried it on them and he knew about it)<br><br>I gave it 3 stars because the acting was decent and the ideas were good but everyone involved in this movie must have some kind of severe case of ADHD or something.","user":"fixedfrequencies","rank":[7,9]}]