[{"title":"disappointing watches in recent memory","rating":4,"date":"1 July 2019","review":"This is a movie where not many people have seen it but it's one of those ideas that ideally should work out. This is the first movie that I'm aware of with a non-binary lead character. I stumbled on this little fact a while ago and thought that it's worth taking a look at on that alone. So I found a copy and watched it and if you're expecting anything amazing then I have disappointing news, I then looked on here and didn't think the other haters had the right perspective so I finally decided to write a review on it.<br><br>The set-up is that J is a teen who identifies as non-binary. They've been on puberty blockers for years and unsure of which puberty is right for them. Unfortunately their doctor says that now is the time to get J off and has the whole weekend or so to decide whether to grow up as more male or female, while feeling disconnected from their older sister and her boyfriend.<br><br>In terms of what I didn't like, then the directing is awful. The other haters criticised the acting (my thoughts on that later) but faces being cut off in shots so you only see half of someones face for no artistic reason, stuff in the foreground obscuring actors faces, showing a conversation either through a single character is all we see for most of a three person conversation or have the oly thing we see being what they browse on their computer (TWICE!) and a shot where you only see a finger tapping on a car door to convey that J was in there. I'm sure there's other stuff in here but it's distracting how much it either feels like there's no effort into the shots or they tried too hard to be avant-garde and make their mark, but failed.<br><br>There's also another thing, it's about how they handle the topic of the movie. For a movie about being non-binary you'd expect some persecution, some idiot being wrong about it in a way that denies their existence. Gone (or I should say off-screen in a visual medium, we only hear second hand from J themselves)! J coming out is gone! What the choice the whole movie hinges around as is gone. The last thing is that for 20 minutes in this 80 minute movie we focus entirely on Iranian-American people and the struggles they go through. Look, this is fascinating stuff and in another movie I wouldn't have minded but the problem is that for the entire time I was thinking \"Hey, doesn't J have to contemplate their decision?\" It feels like an entirely different film.<br><br>I really wanted to like this so I'll go through what I actually liked about this movie. I did say some harsh things about the directing earlier (I backed it up but my point is you can make your own judgement on what I had to say to back it up) but one thing that is captured is the disconnection between J and the stuff around them that doesn't involve this decision. We know that they like poetry and there's one they keep repeating that's meant to convey their loss of youth and the scariness going forward and whether what they decide is a mistake. All of that is done well and Rhys Fehrenbacher does pull the performance off. Him being a trans boy mid-transition playing this role also makes it a lot more believable.<br><br>In short, the amount of potential I saw in this movie was enormous. I understand how representation matters in fiction (namely if they aren't represented then long story short, stuff like being non-binary is an alien concept to some and may not lead to as widespread acceptance) and to see it end up like this is really disheartening. I really wanted to like this. Trust me in saying that, and I did find stuff in it to like. It's inescapably not very good. I'm really, really sorry. Check it out if you're curious but if not - I wouldn't bother to be honest.","user":"alexbryson","rank":[2,2]},{"title":"Boring","rating":2,"date":"27 July 2018","review":"A boring movie about someone who just can't decide if they want to spend their life as their true gender, or pretend to be the other. <br><br>It seems it is more about trying to enforce the notion that thought somehow changes biological gender and definitely targets the an audience that already supports that narrative. If you happen to believe that gender is physical state rather than a meta-spiritual state-of-mind, you will likely find the film frustrating to watch.<br><br>Production-wise, the film is not terrible, though a bit slow-paced for my taste. The acting, directing, casting, etc. is all on-par for what you would expect from an indie film. The film just seems fundamentally flawed in its content, which sinks it.","user":"efreed09","rank":[15,39]},{"title":"See also \"The Room (2003)\"","rating":3,"date":"19 August 2018","review":"Terrible acting, too much focus on irrelevant matters, no specific story going on.\nVideography was good though and The \"J\" actress was beautiful.","user":"abbaskillerman","rank":[4,9]}]