[{"title":"The Capture: Smart little thriller with weak payoff","rating":4,"date":"15 October 2018","review":"The Capture gripped me early, but the further into the movie it got the more the grip was loosened and by the end it had thoroughly lost me.<br><br>It tells the story of a group of scientists who use risky, questionably immoral and dangerous methods to break space and time to find out what truly happens when you die. Is there an afterlife? Are all the reports of angelic entities at places of mass death true?<br><br>Based almost entirely in one location with a 3 person cast it plays it's low budget well and delivers a fairly original concept. Sadly what it doesn't do is provide you with a competent payoff, the finale is really quite weak.<br><br>Considering the movie tries so hard with it's pseudo-science to come across smart the ending demonstrates a lack of intellect and common sense.<br><br>It is very frustrating when an interesting movie fails to wrap things up well and ultimately it kills the entire film.<br><br>Nice ideas, failed execution.<br><br>The Good:<br><br>Solid concept<br><br>Convincing premise<br><br>Fittingly moody tense atmosphere<br><br>The Bad:<br><br>Too short<br><br>Finale is an utter failure<br><br>Things I Learnt From This Movie:<br><br>Short tattoo sleeves on girls can look fantastic","user":"Platypuschow","rank":[20,22]},{"title":"It started out pretty good","rating":3,"date":"23 August 2018","review":"It started out strong. It was interesting for the most part, but man toward the end, it just literally drops off and is ruined by that ending. The characters were all interesting and seemed appropriate in their roles, even though the girl is easy to hate. <br><br>Really, it felt like they were making a movie, ran out of money and just called it good before finishing it. It's too bad, it had potential with an interesting idea.","user":"iceman88869","rank":[17,21]},{"title":"Terrible waste","rating":2,"date":"30 August 2018","review":"The acting was good, the story was interesting (up to a point) but the \"special\" effects were non existent and the movie set was awful. Its a sad indictment of a film when the total special effects consisted of a single blue light being cast onto the soul guide that was wearing what appeared to be a toga. Unfortunately, the movie becomes boring real fast and does not hold the viewers interest. When the special effects in an Asylum film look absolutely awesome in comparison to this film, you know that this film is one to avoid.","user":"coivaln007","rank":[6,7]}]