[{"title":"Failing marriage never sounded so sweet","rating":8,"date":"27 August 2017","review":"Band Aid is a quirky indie picture written and directed by Zoe Lister-Jones that depicts the lives of Anna and Ben, a young married couple struggling not just with the dishes, but unemployment, un-fulfilment, miscarriage and of course the frailties of a monotonous marriage.<br><br>Together, both Lister-Jones and Adam Pally are brilliant in depicting a realistic and grounded relationship that balances comedy and drama, as the two uniquely deal with their marital problems by turning each and every fight into a song performed alongside drummer and neighbouring creep Dave, played by Fred Armisen.<br><br>The whimsical and clever lyrics of each song aside, the film is genuinely fantastic, both in direction and writing, with Lister-Jones churning out a brilliant performance that has me, and many others wishing she would write and direct more","user":"smanteufel","rank":[17,25]},{"title":"Nice Drama which tries to avoide all the clichés","rating":8,"date":"2 September 2017","review":"It is a nice drama. I did not know the actress was the director herself, and her acting was so good and real, I would follow her acting in other films too. The chemistry between two central characters was so genuine and realistic, it was really refreshing. The setup is about a struggling couple who are facing economic and emotional problems, and then they try to vent their fight into songs by making a band. But if you expect something like \"August Rush\" or \"Once\" or \"Music and lyrics\", you might be disappointed. It is actually a family drama, with may be no memorable songs.<br><br>I believe all those divorces everywhere in the society, such movie sends a very good message. We need to deal with our problems with a try to understand each other more. I had few laughs during the movie, and some dialogues were pretentious, but still, it is a refreshing one. Zoe Lister-Jones should try to write more. And I wish more people watch this drama. Giving rating as 8, as this kind movie cannot get ratings like 10 out of 10, but hope IMDb would retain a 7+ rating for this movie, which it deserves without any doubt.","user":"ahmadshah2370","rank":[12,17]},{"title":"Surprisingly good movie","rating":8,"date":"11 September 2018","review":"Nothing on so saw this and figured why not, so glad I did was a good movie didn't pull out my iPad once during it. Had a good story, well acted and I liked the songs too good rhythms. Worth a watch","user":"MichaelS390","rank":[9,12]}]