[{"title":"A quiet storm","rating":2,"date":"2 July 2017","review":"This is the story of a little girl from Barcelona who is adopted by her aunt's family in the countryside, after her mother passes away. Largely autobiographical, \"Summer 1993\" is filmed in a very naturalistic style and almost feels like a documentary. The director, Carla Simón, pays special attention to the kind of small details that can make a big difference to a young kid. Although not very much seems to be going on in the surface, one can see that a very important drama, charged with intense emotions, is going on deep in the lives of this little person and the family that has welcomed her. The acting is all very effective and particularly Laia Artigas, who plays the main character, is surprisingly strong and charismatic for someone her age.<br><br>\"Summer 1993\" is one of many Spanish films that observe the world through the eyes of a child. Other examples include the classics \"Cría Cuervos\", \"The Spirit of the Beehive\" and \"El Sur\". The contemplative gaze and relatively slow pace remind me of \"En Construcción\", a documentary by another Catalan filmmaker, José Luis Guerín.","user":"birthdaynoodle","rank":[42,49]},{"title":"A sweet film to be savoured on many different levels","rating":9,"date":"12 August 2018","review":"Many movies stand or fall on their final scenes because our memory retro-frames the film through its climax. Limp endings always disappoint but the last 20 seconds of the Spanish film Summer 1993 (2017) elevates what would have been just a sweetly lyrical tale of childhood loss into a powerhouse essay on the nature of grief.<br><br>In simple linear fashion it's an uncomplicated story of six-year old Frida (Laia Artigas) who is abruptly moved into her aunt's home when both parents die from AIDS-related illness. We are never actually told about the illness, rather we see the shame and hear the silence surrounding why they died, and there is unmistakable discomfort around blood as a recurring motif. While her adoptive parents were not exactly delighted to have Frida, they are dutiful, kind and loving; family always comes first in Catalonian tradition. On the surface, all appears to be settling down well, especially for their three-year old daughter Anna (Paula Robles) who is thrilled to suddenly have a sister and a constant playmate.<br><br>What makes this simple tale unique is how it is told entirely through Frida's point of view. The world of a six-year old moves slowly as the developing mind processes what is happening. The camera lingers on Frida's eyes and captures the shifting cycles of abandonment, painful loss, confusion, desire to belong, followed by laughter and child's play. Most scenes are languid in pace, framed at children's height looking up at an adult-controlled world. Scenes of backyard, bathtub and bedtime play show Frida initially on the fringe of belonging and gradually inching towards being part of her new home. It's normal family life and nothing untoward happens; even when Frida leaves Anna in the woods, you sense it is to gain attention rather than show malice towards the three-year old. <br><br>If you prefer stories with strong forward narrative you may find this one too slow, even though it's impossible not to enjoy the exquisite naturalness of Frida and Anna. Children of this age do not act; they just are who they are, and the director's artistry lies in channelling their performance into a gently nostalgic autobiographical film. The full impact of the tale erupts during a final scene of joyful family bedtime play. Just when Frida is feeling safe and loved, she bursts into uncontrollable and inconsolable tears. It is a sight we have not seen before. <br><br>This is a film to be savoured on many levels. The cinematography and settings are an obvious source of visual and emotional pleasure, but it is at a deeper level that this film delivers its greater impact. We will read it according to our life experience, but it says much about the importance of family and the way young children experience profound loss. At all levels, this is a film that leaves a deep imprint.","user":"CineMuseFilms","rank":[20,26]},{"title":"Truly excellent","rating":10,"date":"16 July 2018","review":"One of the most beautiful films I've seen in recent memory. The gorgeous cinematography provides a backdrop for a look at loss through the eyes of a child, in this case played by Laia Artigas who gives a truly arresting performance <br><br>The film has been compared to other Spanish classics that feature child protagonists like Cría Cuervos and The Spirit of the Beehive. While I thoroughly enjoyed what appears to be a pretty clear nod to Cría Cuervos in the scene where the little girls are \"playing adults,\" this film certainly stands on its own. <br><br>Also, although I've seen relatively few films in Catalan, this has undoubtedly been my favorite, so I'd say this also qualifies as a triumph for Catalan cinema!<br><br>Highly recommended.","user":"wmmoose","rank":[15,21]}]