[{"title":"Too many wannabe critics.","rating":6,"date":"14 November 2019","review":"It's one of those movies you'll go and check on IMDb to see the ratings, see 1 star, OMG! Cringe. Keep scrolling and find allot of negitive reviews, but you'll see the odd one or two that say it's a good or average movie, I go with the latter, I thought the acting was above board and the idea and setting were good, as is the background of the ship in question, it touches on the Bermuda triangle and such, it's not an amazing film, and it won't win any awards, but its one that'll Keep your attention, just go into it with an open mind and you'll enjoy it!!","user":"andrewelizalilly","rank":[27,37]},{"title":"Apparently the story was lost at sea.","rating":2,"date":"14 October 2019","review":"Anyone who's read a few of my previous reviews will undoubtedly be sick of hearing it again, but it's a matter of granite truth: story is everything, even for a movie. If you have a great story, many of the other elements of a movie can be rubbish, and as long as they aren't completely unforgivable, the movie will still be okay. But if you have a crap story, then it's going to be a crap movie and that's the inevitable outcome.<br><br>MARY, since it has a crap story (or NO story depending on your perspective), is a crap movie. And that as nice a spin as you can give it.<br><br>Almost all of the other elements of MARY are good or excellent. Good production values, some \"namebrand\" actors, story concept that springs from the incredibly rich tradition of the supernatural so associated with the sea and ships, and so on. It even has a somewhat original/inventive script idea as its basis: a group of people having to deal with a hostile ghost in the isolated and claustrophobic conditions on a small boat.<br><br>LOTS of sea-based and boat-based ghost stories abound in horror literature. The Flying Dutchman, an endless stream of ghost and horror stories birthed by the true story of the Mary Celeste (of which I've always been convinced that \"Fire in the Galley Stove\" by William Outerson was such an example), \"The Derelict\" by Hodgson, and so on.<br><br>You might be tempted to think that there just isn't enough context to write a great story around the sea, a small boat and a handful of people. But we know that's not true; Hemingway did it in \"The Old Man and the Sea\" and won a Pulitzer Prize doing it. So we know that it CAN be done.<br><br>While there are exceptions, I usually include a little preview of the story as part of my reviews, but MARY is one of those exceptions. The story is so shabby and its elements so overused you can summarize the entire thing in two sentences:<br><br>There's this female ghost of sketchy origins that haunts a boat christened \"Mary\". A family buys the boat, refits it, and on its freshly renovated maiden voyage, the family and a couple of friends start trying to kill each other by virtue of the ghost's evil influence and, as you might expect, things end badly. The end.<br><br>When you think about it, this really isn't an actual story as such. At best it's THE SHINING with saltwater and with everybody taking turns playing Jack Nicholson. And everybody acting crazy and trying to kill each other for no reason other than ghostly \"influence\" doesn't really constitute a story in any legitimate sense. It's just people behaving badly at random. With jazz hands.<br><br>Personally, I am so thoroughly SICK of the \"the devil made me do it\" concept I could just throw up when a movie drifts in that direction. The everybody-woke-up-and-it-was-all-a-dream writer's ultimate childish copout would be Pulitzer material in comparison at this point.<br><br>It really is a shame. MARY had great bones, as it were, for what could have been an excellent movie. I don't know how, but somebody just forgot to add a story to it.","user":"S_Soma","rank":[18,24]},{"title":"Not very scary Mary","rating":3,"date":"25 August 2019","review":"Trapped on the open sea in a haunted boat is an oft-seen horror movie scenario, but rarely has it been used with as little imagination as in Mary. In telling his nautical tale of terror, director Michael Goi employs so many hackneyed techniques that even the talents of Gary Oldman and Emily Mortimer cannot prevent the film from being a colossal waste of time.<br><br>Introducing his film at Frightfest, Goi claimed to have over 18,000 films in his collection, so one wonders why he directs like he's only ever seen a handful, and bad ones at that. One might think that with such a wealth of inspiration, he could have come up with something a little more creative... something that didn't rely so heavily on obvious supernatural jump scares accompanied by obligatory loud noises. The scenes intended to have me throwing my popcorn in the air in fright actually had me holding my head in dismay: this is about as basic as horror movies get.<br><br>3/10. I imagine that It'll be a case of abandon ship for many who dare to sail these treacherous waters.","user":"BA_Harrison","rank":[42,64]}]