[{"title":"It's more of a drama between two estranged brothers with superb cinematography n good acting.","rating":6,"date":"6 October 2018","review":"I was reluctant to see this after reading some not so glowing reviews. Also the ratings r pretty low.\nSaw lil bit on tv channel n got enticed into seeing this on a dvd.\nThe cinematography and the acting were the factors that convinced me to sit thru the entire film otherwise it's a very slow film n the horror element is almost nada. The monster is not given enuff screen presence, the kills r almost zero but the mountain trekking part transports us with the brothers.\nThe poster of the demon with the horns is also missing in the film but the lair of the creature n the mountain plateau is creepy.","user":"Fella_shibby","rank":[26,28]},{"title":"I found it quite good and different - oh that ending!","rating":7,"date":"15 March 2017","review":"I found some people saying this is is a boring movie but I found it quite the opposite. It's a different kind of horror and thriller - much more of a thriller than horror.<br><br>This movie focus a lot on the relationship of the two brothers because they are opposites, complete opposites to each other! <br><br>Nobody ever talks about the sound mixing but it is quite good - plus, the musics chosen are really good in my humble opinion.<br><br>The end, well, that's the part that gave me more chills and made angry at the same time, to be honest!","user":"xpuelie","rank":[24,33]},{"title":"The mysterious creature is!!!","rating":5,"date":"30 April 2017","review":"It's a Wendigo, a native superstitious creature, they sense what makes of a person, good &amp; bad, if your a good spirited person but decide to shoot it to kill you'll most likely die, if your like the older brother well he would have died anyway,<br><br>If the younger brother had not shot at what he thought was a buck (deer) he more than likely would have not been captured by the Wendigo, But because he decided to prove to his older brother he was a mans man, He probably would have been left alone but still haunted by the creature till he left the area. <br><br>I feel there was much more to be told in the story but the director ran out of time &amp; had to finish leaving us with a bland ending, There is a much better telling of this kind of movie actually titled Wendigo (2001) <br><br>Hope this helps.","user":"greggyde","rank":[17,25]}]