[{"title":"makes a statement","rating":5,"date":"29 March 2019","review":"Greetings again from the darkness. Kira is startled from slumber by a horrendous nightmare - a flashback to a years ago night when she was sexually abused. Her partner in bed knows nothing of Kira's vision, only that she's been violently pushed from bed, which is not her preferred morning method of waking up. As the story from filmmaker Tony Germinario unfolds, we learn more about Kira and the background that has her deservedly bitter.<br><br>Lynn Mancinelli (she also starred in Germinario's film BAD FRANK) plays Kira and does a pretty nice job of allowing us to understand the reasons for her dramatic mood swings. Even her sessions with her therapist are twisted ... a recurring theme in Kira's life. When she returns home for the funeral of her father, it's obvious her relationship with her mom (Kristin Carey) is distant at best, though she does seem to connect with her gay-artist-recovering addict younger brother Lucas (Emrhys Cooper). As with most other relationships in her life, this brotherly love may not be as solid as we are initially led to believe.<br><br>The small town where she grew up, and where mom and brother still live, is controlled by Richard Davenport (played by Richard Thomas) and his son Alden (Jon McCormick). While Richard presents himself as a charitable friend of the family, Kira's history with the Davenports generates something much deeper than mere bad feelings. Her hatred of the Davenports drives a further wedge in the broken relationship with her own mother - a mother oblivious to family secrets. Those secrets were kept in order to \"protect\" the mother, though it has created a kind of house of cards.<br><br>Kira is a raging alcoholic and her actions have caused pain and disruption to many others, but once we learn the whole story, her actions seem acceptable while the actions (or lack thereof) of others seem inexcusable. The pieces of this film that are worth watching are the performance of Ms. Mancinelli and the way Richard (John-Boy Walton) hides his true personality from others. It's a low budget film with atrocious make-up, uneven editing, and camera work that doesn't complement some of the scenes. As a statement for how sexual abuse can wreak havoc on the victim and their relationships, it makes an admirable point. As cinematic viewing, it's tough to recommend.","user":"ferguson-6","rank":[13,16]},{"title":"Lynn nailed it!","rating":7,"date":"5 August 2019","review":"Most of the cast did a good job. But, Lynn Mancinelli really depicted how shattered a victim could be. She radiated pain and rage. Jon McCormick and Emrhys Cooper were great too. The scenario was able to keep my tuned throughout the whole movie.","user":"M-o-n-a-3","rank":[2,2]},{"title":"oh so bad","rating":1,"date":"12 January 2020","review":"I was expecting so much more from this film, i evenwatched it for 50 minutes...nothing! Very bad acting from the people playing the 2 lead roles as the brother and sister. she acted like a spoiled child that someone had stolen her dummy it from. Just bloody awful. Perhaps this film was really made to showcase her assets? Really? No no no no no dont bother with this.","user":"watcher2019","rank":[1,1]}]