[{"title":"Eventful but Bland, Effortful but Cliche","rating":4,"date":"14 February 2020","review":"It was long ago when I stumbled upon \"Camp Cold Brook\" , thought the poster's cool and it's produced by Joe Dante, so it has been sitting on my watchlist for a year or two. Now that it has finally come out, I can officially say that I'm disappointed.<br><br>\"Camp Cold Brook\" is an undeniably eventful and effortful piece of horror - we follow Jack (Chad Michael Murray) and his paranormal team of the show \"Haunt Squad\" as they find themselves making their hopefully game-changing new episode on the grounds of an abandoned summer camp where a mass murder has taken place years ago. It might seem that the found-footage shtick might be in use, but it's not, just minimalistically. It's still a classic, (at this point) conventional story &amp; to spice it up, the filmmakers mixed it up with... one or two other conventional story lines. The twists are largely predictable, the characters are one-dimensional and the action - bland. \"Camp Cold Brook\" has very little flair, even less originality, but a lot of effort for the cliché's and cheese, which I personally can't give much props for. The acting performances are fine, albeit clothed up in uninspiring characters, genre fans will likely appreciate seeing Danielle Harris. The cinematographer has really tried to make \"Camp Cold Brook\" aesthetically enjoyable, dynamic, but on the background of other flaws, it eventually wore itself out or, in other words, ceased to impress.<br><br>\"Camp Cold Brook\" is a horror movie for those less experienced in the genre, for it utilizes old tropes, cheap technical solutions and bland story arcs. It has little to none gore or sexuality, so I'd assume teenagers can a get a kick or two out of this. My rating: 4/10.","user":"TwistedContent","rank":[8,12]},{"title":"Scary and entertaining","rating":7,"date":"20 February 2020","review":"A good horror movie shot with the paranormal style of storytelling. Good jump scares and surely worth the watch","user":"mansion-95137","rank":[6,9]},{"title":"Chad is the best thing about this film.. otherwise it's boring","rating":2,"date":"17 March 2020","review":"The only reason I gave this film a watch is because of Chad Michael Murray. The trailer looked average, but I was hoping Chad would save the film, sadly not.<br><br>A group of ghost hunting TV stars head to Camp Cold brook to film a new episode. While things start off really slow, the group start to discover the history of the camp and the ghost that come along with it.<br><br>This was not an exciting film to watch. The acting was not good from most of the cast, and the run down camp still looked pretty clean with a bunch of cobwebs to make it look \"old and dirty\". It's pretty boring, and I feel sorry for Chad who was such a big star many years ago and now has to work in these low budget films to make some coin :(","user":"olivewahh","rank":[2,2]}]