[{"title":"7.5 Stars - Ignore the angry right wing trolls who didn't even watch the movie","rating":7,"date":"4 June 2019","review":"Excellent acting from first-time and veteran Hungarian and Syrian actors. The cinematography and effects were top notch. The script is where the weaknesses start to take over, but miraculously it never strains believability too much.<br><br>MILD Spoilers ahead:<br><br>As far as the alleged political messages - there ARE NONE. There is no \"demonization\" of the countries that take in or refuse refugees. There is simply a realistic depiction of how refugees are dealt with in Hungary. If showing reality for what it is (minus a flying kid) is \"left wing agitprop\" then you can safely discount what any reviewer - professional or hobbyist - has to say. Seriously, this is not a \"political\" movie at all. A young Syrian refugee and his family encounter some harsher than usual border enforcers and he then attempts to gain entry to the EU through whatever means he is presented with.<br><br>Again, there are gaps in the plot/story but nothing too bad. The city of Budapest is featured prominently and other than the supernatural elements at work, the movie is MOSTLY believable. Give it a try and bring an open mind. You will not be preached to, contrary to some reviews by people who have obviously not watched it, and to whom being an IMDB activist is more important than reviewing titles.","user":"TheUserIDYouEnteredHasAlready","rank":[9,12]},{"title":"100% puge propaganda.","rating":1,"date":"6 March 2019","review":"This movie is just 100% propaganda.\nIt's shot in a decent way and such but still, it'll make the stomachs turn of everyone even remotely read up on things happening in the world.<br><br>They demonize the people who take in -millions- of refugees. And if you trace the funding you'll notice it's from left wing extremist political stations.<br><br>A little note at the end with just how bad the countries that have taken these people in have gotten in terms of serious crime... might have rectified the solid propaganda a bit and shed some illumination on how the reality of things actually is.<br><br>Absolutely disgusting.","user":"The_Techpriest","rank":[28,58]},{"title":"All you need to know","rating":1,"date":"29 November 2018","review":"The moment i read the story about \"syrien refugee gets superpowers\" i looked for something. I knew for 100% it will be there somewhere at the end of the movie. And i found it of course.<br><br>The fundings:\nMitteldeutsche Medienförderung (german government subsidies),\nMedienboard (german government subsidies),\nFilm und Medienstiftung NRW (german government subsidies)<br><br>An hungarian movie was financed by three different german government sources.<br><br>And that is all you need to know if you had any doubt that this is not pure propaganda.","user":"Nummer9","rank":[32,68]}]