[{"title":"A mediocre foray into the \"Raiders\" franchise...","rating":5,"date":"15 January 2019","review":"I was somewhat surprised to find a third movie in the \"Raiders\" series, especially because I hadn't even heard about it. I found it, picked it up and had to watch it regardless. I didn't even read the synopsis for the movie. The fact that it was a Hong Kong movie and in the \"Raiders\" series was more than enough.<br><br>However, this 2018 addition to the franchise wasn't quite as interesting as the previous movies. That being said, I have to say that the movie is still enjoyable and watchable, it just wasn't as solid a movie entertainmentwise and storywise as the previous movies were.<br><br>One of the better things in the movie was the amount of action that there was in the movie, and it was nicely executed on the screen. But of course the driving force here was Tony Chiu-Wai Leung in the lead role. I was thrilled to see JeeJa Yanin's name on the opening credits, but her role was so small it was almost non-existing. And that was a disappointment.<br><br>The storyline in \"Europe Raiders\" (aka \"Ou Zhou Gong Lue\") was a little bit too random. It felt like director and writer Jingle Ma was just making things up as the shooting of the movie progressed. There wasn't a continual red thread throughout the movie, and at times it just felt like I was watching random scenes put in the movie just because it was possible to do so.<br><br>The movie did have a fairly good cast with some familiar names and faces on the cast list, especially for a seasoned Asian cinema fanatic such as myself. So if you like Asian cinema, you might actually want to check out the cast list for this movie.<br><br>All in all, \"Europe Raiders\" is a movie that you watch once and never again, because it just failed to have the same charm, appeal and contents as the previous two movies in the franchise. An average, albeit mediocre, movie that just failed to be outstanding.","user":"paul_haakonsen","rank":[2,2]},{"title":"Horrible!!!","rating":1,"date":"1 September 2018","review":"Do not waste your monry &amp; time for this stupid movie. I thought with Tony Leung it should be a decent one but I was totally wrong :))","user":"ntt21884","rank":[7,15]},{"title":"A laughably bad movie","rating":22,"date":"22 August 2018","review":"Unless you're a pre-pubescent Chinese boy, you shouldn't bother watching Europe Raiders. Production values are pretty bad in spots and it's an awfully tacky film over all. This one is a serious pass, my friends. Not recommended.","user":"maclock","rank":[6,13]}]