[{"title":"In Every Way That Matters...","rating":9,"date":"31 January 2017","review":"There are so many ways to feel and experience and comment on this film.<br><br>AS A WRITER: For lovers of language, phrasing, and meaning, hearing James Baldwin's writings and seeing him speak is enough to spark the highest praise alone. His capacity for observational conclusion and his use of language to transmit these conclusions is extraordinary. In this, he is one of the finest chroniclers of the American condition, not just one of the finest African American chroniclers. If you don't believe that going into this movie, you will when you come out of it. Spending close to two hours listening to the man's work is an utterly intoxicating experience. In this regard the film is extraordinary.<br><br>AS A FILM LOVER: We know that James Baldwin was a cinephile and one of the great film critics in American history. He wrote extensively about cinema and a large part of this film consists of clips from Hollywood's rough history of reducing or falsifying the black American experience, often with Baldwin's own criticisms laid on top of them, weighing the clips down, eviscerating them. There are hard juxtapositions here as well, such as the innocence of Doris Day pressed up against the reality of lynched black men and women swaying in trees. By contextualizing these images in new and fresh ways the film is able to paint an impressionistic portrait of American denial. And despite a small handful of shots that don't entirely synergistically ring with the Baldwin text (I'm thinking of a few clips – by no means all - that the filmmaker himself shot), there are enough times when the words being spoken and the images being shown are so surprising and spot on as to be true, high, art. In this regard, the film is extraordinary.<br><br>AS A HUMAN BEING: The greatest moral failing of this nation is not its imperialism, not its militarism, not its materialism or escapism or consumerism, – though the film makes a strong case that all these things are tangled together – America's greatest moral failing is its racism. And the scalpel procession with which this movie uses Baldwin's words and character to autopsy this vast cultural sin is inspiring. Baldwin himself was never a racist, though God knows, I wouldn't blame him if he had been. Baldwin was never a classist or a nationalist or a demagogue of any sort. Baldwin was a man. He demanded that he be perceived as a man and that black America be perceived as people, with all the dignity and rights that affords. He looked America in the eye and asked a simple question, why do you NEED to dehumanize me? And he followed the question up with a statement, as long as you dehumanize me, America can never succeed. It was not a threat. It was another of his observational truths, the idea that our racism undoes us, keeps us from being great. In the way \"I'm Not Your Negro\" illuminates Baldwin's call for a higher humanist agenda, the film is extraordinary.<br><br>AS AN ACTIVIST: The film implies that the most horrifying thing you can do to a movement is to kill its leaders. Not just because you deny dignity and rights to the people who look to those leaders for hope, but you also impact the movement for generations. The natural order of generational transition, that a great leader will grow old, evolve, change, and teach the next generation how to lead, is violently interrupted. What we are left with is the idea that there is nothing Malcolm X or Martin Luther King could have done to keep from being killed except to be silent – not an option for either, nor for Baldwin. X was killed even as he was becoming less militant, less radical, reversing against the idea of \"the white devil\". This \"evolution\" did not save him. King was killed even as he was becoming more radicalized, more desperate, slowly walking back the rule of love for the rule of forced respect. This \"evolution\" did not save him. There was nothing the White America that killed them wanted from them but silence in the face of dehumanization. And in its subtle, artistic, nuanced way, this film is about all of that. But it also ties itself to the moment. Images of Ferguson, photographs of unarmed black children left dead in the streets by police, video of Rodney King being brutalized beyond any justification, all of it means that Baldwin's words ring timeless, his call to action not remotely diffused by our distance from him and his time. In this regard, the film is extraordinary.<br><br>AS A LOVER OF PEOPLE: Baldwin is by no means a traditionally handsome man, but he is a striking one. His charisma is nuclear and his face is always animated. When he speaks, the depth and warmth of the content play across his features. His eyebrows lift all the way to the middle of his forehead when he pauses to gather his considerable intellect for attack. His eyes turn down and to the right when he knows he's eviscerating an illegitimate institution. He punctuates an observation with a smile so genuine and wide that it emits its own light. To watch him command a talk show or a lecture is cinema enough. In that it gives us the gift of watching Baldwin speak – among so many other things - the film is extraordinary.<br><br>I guess I have some small aesthetic qualms with the way the film is put together, but to what end? These are my own little opinions about the tiniest minutia of filmmaking. Personal hang- ups on a certain cut here or there, useless criticisms on a work that succeeds so profoundly in all the most valuable and important ways.<br><br>The film is extraordinary, important, and genuine in any and every way that matters, and that's all there is to it.","user":"JoshuaDysart","rank":[152,205]},{"title":"An Eloquent and Angry Examination of the Racial Divide","rating":9,"date":"29 June 2017","review":"James Baldwin began a book called \"Remember This House\" but died before completing it. It intended to weave together the stories of Martin Luther King Jr., Malcolm X, and Medgar Evers into a tapestry of the black American experience. In \"I Am Not Your Negro,\" Samuel L. Jackson reads the finished portion of the manuscript, and filmmaker Raoul Peck sets the words to images from the Civil Rights Movement and the current Black Lives Matter movement. The result is a bracing and deservedly angry film that captures better than anything I've read or seen yet the reasons behind the frustration and outrage of American blacks.<br><br>There's a marvelous moment in the film when a philosophy professor challenges Baldwin on the Dick Cavett Show for his attitudes, and basically holds Baldwin (and by extension black people) responsible for the continuing racial divide. His message seems to be \"you're the one making an issue out of this, not me.\" Baldwin's take down of him in eloquent words that I won't even begin to try to replicate captures the essence of the entire film and the black struggle for equality. <br><br>And Baldwin's criticism doesn't stop at racial issues. He also denounces American popular and material culture in general, accusing Americans of letting consumerism anesthetize them into a false sense of happiness and contentment that allows them to ignore all that is wrong with the American way of life.<br><br>This is a movie that made me furious at America for continuing to stick its head up its ass when it comes to the subject of race. Watching Baldwin's heartfelt distress over the Civil Rights Movement juxtaposed to recent images from the news made it crystal clear that America has not progressed as much as it would like to think it has. <br><br>Grade: A","user":"evanston_dad","rank":[22,30]},{"title":"An amazing use of cinematography and historical footage","rating":10,"date":"4 February 2017","review":"Note that the reason this is 5/10 stars right now is that there is a large bloc of people who have given it 1 star (presumably the white supremacist crowd). There is no way that anyone who believes in the need to tell black history would give this anything less than an 8/10.<br><br>This cinematography was absolutely incredible, the use of historical footage to stitch together a narrative of the Civil Rights movement combined with recent footage makes this movie incredibly timely. James Baldwin proves a brilliant orator, and the story takes you through both his life and his relationships with Martin Luther King Jr., Malcolm X, and Medgar Evers. This movie tells more black history than I learned in my entire public school education, and should be seen by everyone.","user":"astrophysicistb-11237","rank":[78,128]}]