[{"title":"\"And the Oscar goes to... Dame Judi Dench\"","rating":10,"date":"17 September 2017","review":"As we crawl out of the (largely disappointing) summer movie season, the first of the serious award-contenders hoves into view. Victoria and Abdul tells the untold story of a hushed-up relationship between an aged Queen Victoria (Judi Dench, \"Philomina\", \"Spectre\") and her Indian servant, Abdul Kareem (Ali Fazal). <br><br>Kareem is shipped to England from Agra to deliver a ceremonial coin to the Queen on the occasion of her Diamond Jubilee, together with a grumbling 'stand-in tall guy' Mohammed (Adeel Akhtar, \"The Big Sick\", \"Four Lions\"). Kareem finds the Queen as sour, depressed and acidic as her post-Albert reputation would have you imagine. But something clicks between the two, and pretty soon the perked-up queen is learning Urdu and all about the Koran, much to the horror of her successor Teddy, the Prince of Wales (a splendid Eddie Izzard, \"Oceans 13\") and the rest of the royal household, who try desperate measures to derail the relationship. <br><br>This film is a complete delight. I went along without great expectations.... a worthy film I thought I should go and see to write a worthy review about. But I was entranced from beginning to end. It's probably best described as a comedy drama... always a difficult trick for a movie-maker to pull off. But here in the competent hands of director Stephen Frears (\"Florence Foster Jenkins\") the comedy is both very, VERY funny, with the drama also being extremely moving. And crucially the transition between the two never feels forced. <br><br>I've seen a few critical comments that the film's underlying topic - the subjugation of the Indian state and the queen's role in that, is a \"serious topic\" and not a suitable subject for a comedy like this. And of course, \"the Empire\" is a terrible legacy that the British people have around their necks in the same manner as Germans have their Nazi past and the American South have their history of slavery. But the film never really gets into these issues in any depth: Abdul's background, whilst sketchily drawn and feeling rather sanitised for the late 1800's, is one of a middle-class Indian with a decent colonial job: someone shown respect by his British managers. While the \"uprising\" of Muslims is mentioned - indeed it's a key part of the story - Victoria's lack of knowledge of such things, or indeed of all things to do with the country she is 'Empress' of, is made clear. The focus of the film is quite rightly on the understandable scandal (for the day) of the queen of England (and hence head of the Church of England) having a spiritual teacher (or \"Munshi\") who is neither white nor Christian. If there is a criticism to be made of the splendid script by Lee Hall (\"War Horse\") it is that the racial references - and there are a few - feel rather over-sanitised given the tensions that erupt as the story unfolds. <br><br>Above all, this is an acting tour de force for Dame Judi, reprising her role as the elderly queen from \"Mrs Brown\" which (shockingly!) is now 20 years old. I know its early in the season to be placing bets, before having seen any of the other major contenders, but Dench's \"insanity\" speech screams \"Oscar reel\" to me. Her performance is masterly from beginning to end. <br><br>Rather overshadowed by Dench is the relative newcomer to western cinema Ali Fazal (he had a role in the \"Furious 7\" film). But his performance is almost as impressive, bringing the warmth and compassion to the supporting role that is so sorely needed if the overall balance of the film is to be maintained. <br><br>The supporting cast is equally stellar with Olivia Williams (\"An Education\", \"The Sixth Sense\") acidic as Baroness Churchill; Simon Callow (\"Four Weddings and a Funeral\") as Puccini; Michael Gambon (\"Harry Potter\") as Lord Salisbury and Tim Pigott-Smith as Henry Ponsonby, head of the royal household. This was Pigott-Smith's final live-action performance before his untimely death at the age of only 70 in April of this year: and it's sad to say that he really doesn't look well in this film. Also of note is Fenella Woolgar as lady's maid Miss Phipps, comical as a the quivering wreck holding the shortest straw in having to face up to her ferocious mistress.<br><br>Another star of the show is the Scottish countryside, ravishingly photographed by Danny Cohen (\"Florence Foster Jenkins\", \"Room\") with this film probably doing more for the Scottish Tourist Board than any paid for advertising could ever do!<br><br>As the film comments it's \"Based on a True Story... Mostly\", and this tease of a caption both infuriates and intrigues in equal measure. &nbsp;I may feel obliged to delve into the original source material by Shrabani Basu to learn more. &nbsp;<br><br>Overall this is a true delight of a film, perfectly balanced, brilliantly acted: I would say this is a \"must see\" for any older viewers over the age of 50 in need of a cinema outing that doesn't disappoint. This is everything that (for me) \"Viceroy's House\" should have been but wasn't. Highly recommended. <br><br>(For the graphical version of this review, please visit www.bob-the- movie-man.com. Thanks.)","user":"bob-the-movie-man","rank":[116,158]},{"title":"Surprisingly endearing","rating":8,"date":"14 September 2017","review":"My wife and I attended a preview screening last night with no preconceived ideas about the movie, not having even seen a trailer.<br><br>We were immediately drawn in and pleasantly surprised by the story, even though we thought it may have been a little far fetched. Until we found that it is a biography and mostly fact. That made the story even sweeter.<br><br>Dame Judy Dench's acting was peerless as usual, but by far the biggest revelation was Ali Fazal, who put in a wonderful performance from comedic through emotionally intense.<br><br>There was so much I didn't know about Queen Victoria's twilight years that this movie put into perspective, in a way that was consistently entertaining. We laughed and cried. Highly recommended.","user":"RedRider14","rank":[85,115]},{"title":"Such a beautiful movie.","rating":10,"date":"17 March 2018","review":"The first thing anyone will say after watching this movie is how utterly amazing Judi Dench is, and rightly so, she ones again dons the robes of Queen Victoria and gives a commanding performance as one of the most famous monarchs. A performance worthy of an Oscar, she is an actress with unrivalled talent. This film is so much more then Dench's performance, spellbinding though it was.<br><br>Ali Fazal, also worthy of accolades and awards, for his superb performance as Indian servant Abdul Karim. His performance is actually rather captivating, The Queen was taken under his spell and as a viewer so was I. Such an intriguing, fascinating character, probably unlike any other man she'd ever encountered.<br><br>Superb production values throughout, the film was visually dazzling, sumptuous settings, jaw dropping costumes, this was a treat for the senses.<br><br>A film is meant to move, and allow for escapism, when it can educate as well, it's worth of the elevated sore of 10/10.<br><br>Absolutely loved it.","user":"Sleepin_Dragon","rank":[28,36]}]