[{"title":"Can't Stress this enough....DO NOT WATCH THIS","rating":8,"date":"8 June 2018","review":"I don't write reviews generally but, this time, I think it needs to be said. <br><br>This film is poor, so so poor, and in the interests of giving a reason why, I shall point out all the issues here in:<br><br>1. Continuity- Scene 2 ( 2 soldiers walking in 6-8 inches of snow which cracks so loudly that it makes dialog difficult to hear) the problem is not the audio but the fact that 2-3 minutes later there is no snow on the ground. this left me feeling like I was watching a poor 2nd rate B movie. The fact the a two hundred and twenty second rate SFX program was used to add snow to a scene bereft of snow is utterly laughable. <br><br>2. The mix and match composition of the German units is an offense to Military advisors everywhere. There were Panzer Grenadier troops mixed in with leibstandarden troops (never happen), the half track commander was wearing Cavalry/Armored piping but the 1/2 track was traditionally crewed by infanteers, he also looked like a geography teacher and not a harden member of the SS Panzergroupen.<br><br>3. The American MP at the first check point was armed with a German MP40, this was frowned up on by regular units and they did use the enemy weapons when it was called for but you would never find a sentient of military law carrying one, laughable and poorly researched. I thought this was a double cross and expected him to open fire on the yanks as soon as their backs were turned. shame this didn't happen as i wouldn't of wasted 1:30 hours watching this rubbish.<br><br>4. Same scene as the MP; Lt Cappa approaches the check point and is given a steer by the dodgy MP toward his own company positions. Cappa approaches the position from the front which means: \na, the MP is in front of the forward friendly positions (not a good place to be)\nb, Cappa has the tactical awareness of a cabbage (more than possible)\nor c, the military advisor was sick on the day of shooting.<br><br>5. They are at the cutting edge of the Battle of The Bulge, they were heavily shelled for days and were subject to intense Sniper fire yet: The trees are all standing and undamaged and the cast amble around the scenes like Snipers hadn't been invented yet!<br><br>6.Capt Daniels sites his Command Post on the front line, NO NO NO. its further back and contained in the overlapping arcs of fire provided by the company fox holes. Jerry would of captured that in 1/2 hour using just his boy scouts and a asthmatic, over weight, child minder <br><br>7. CGI Tanks, all incorrectly referred to as Tigers ( most were panthers, and other variants but were referred to as Tigers) they floated in to view, fired without noise and advanced without out infantry support. Panzerfaust cannot stop a Tiger VI but it did in this film! ( more on Panzerfaust later)<br><br>8. No development of relationship between protagonists. Sgt Rock attempts humor in every line and it misses the mark so much. He was working with a script designed for a School drama group and fails to draw a single laugh from me, in fact, he comes across as bitter and satirical. He wasn't trying to do either of these things.<br><br>9. No back story for any character leaving me not caring whether they lived or died, not cheering them on and not caring. I wish they had died so I didn't have to sit though this tripe. <br><br>10. 7.62 MM rounds from a BAR could penetrate a half track but a Panzerfaust could not! really! I just watch it knock out a Tiger VI but it cant penetrate a lightly armored 1/2 track. poorly advised yet again.<br><br>11. Berenger, Sad to see a icon of 80/90's movies stoop so low as to demand a pay check for being associated with this drivel. Things must be bad if the anti hero of Platoon is doing War films of this ilk, I will gladly pay him never to do this again. <br><br>12. Setting: I could be anywhere, it didn't feel like war torn Belgium, it didn't feel like sentries were freezing to death standing up and it didn't feel exciting. <br><br>13. Acting: Wooden, Dialog was poor, script was poor, screen presence was poor, CGI poor<br><br>14. Cappa steals a vehicle from the GERMANS to get back to his own lines, ITS A FRIGGING AMERICAN JEEP!<br><br>15. the final advance was a frigging joke, you have a MG with hitting power at 3/4 of a mile and yet you wait until the blood thirsties are 6\" away before opening fire. you deserve being overrun Luke and sent to Colditz <br><br>In short the director and main \"actor\" Luke Schuetzle has not produced a fitting memorial to the brave men who gave all in the forests around Bastogne. He has missed the point, wasted a chance to create a hell of a story and failed to deliver the hybrid of 'Band of Brothers' and 'Saving Private Ryan' which he tried to. Instead he gave us a project that he should never of been lead actor for, which he has forced to its poor conclusion and which he has spoilt with his over zealous efforts. It's a shame because Warpigs was quite good really. This , however, is terrible.<br><br>Stay behind the camera luke, direct by all means but don't write scripts, don't do the casting, DO spend money on SFX, learn your subject and most of all think about who your doing this for. its not me, its not you, its not your studio, its not your financial backers....its for the heros of The Bulge.<br><br>The honors at the end were in poor taste considering that you had just made a very poor representation of their final hours. Although it was the most interesting part of the whole film. <br><br>The whole thing should be taken out into the snow and shot in the back, buried in a unmarked grave and found 100 years later, put on display in a museum as 'artistic failing circa 2017' then relegated to the walls of the disabled toilets in a gastro pub. <br><br>the.end","user":"richardcooper-96467","rank":[41,42]},{"title":"Ouch! This movie insults your intellect.","rating":1,"date":"8 June 2018","review":"If you were expecting a modern day remake of the 60's \"Battle of the Bulge\" movie, sadly you will be left mightily disappointed.<br><br>The movie lacked atmosphere, nor did the director manage to covey the dangers, desperation, and fear from this battle. Considering this battle was supposed to be the largest and bloodiest battle the US fought in Europe in WWII, the movie made it look very tame, and almost calm by comparison.<br><br>It also portrayed the Germans to be stupid and disorganised, if going by how the movie's unrealistic battle scenes showed the Germans fight.<br><br>I think this movie is just an insult to the soldiers who fought there.<br><br>Save your time and watch something else.","user":"Hammer-Rocks","rank":[11,11]},{"title":"Oh my....","rating":1,"date":"19 February 2018","review":"This is my first review ever..<br><br>Came into this movie not expecting much and attracted that Tom was in it. But boy should I have lower my expectations even further. Yes uniforms/wardrobe props look good. But not to blame the acting too much, they did what they could but with director and writer not making it easier for them.. the conversations the clichés of platoon life is laughable, the combat strategies and the nonexistent will to live given the positioning of germans and response to an ambush...\nWell next time maybe the director should do something that does not contain any kind of group dynamic as he struggles to make it seem real, seen lots of movies with bad acting but still the content made it better, in Wunderland its the opposite.","user":"gustavvp","rank":[60,72]}]