[{"title":"Grim, gritty crime drama","rating":8,"date":"24 December 2019","review":"A sprawling, surprisingly epic blue collar crime drama that rarely belies its low budget. Big themes handled with a mix of nuance and didacticism, but the different story threads weave together in surprising, fresh ways that manage to not feel contrived. A few standout performances and bold directorial choices lift this above its weight class. Worth a rental.","user":"austin-andrews","rank":[7,8]},{"title":"Cinematically Beautiful. Real and Raw Stories","rating":9,"date":"24 December 2019","review":"This film is unbiased look into three completely different stories and people's lives in the U.S.<br><br>The topics that are highlighted in this film couldn't be any more relevant. It leaves you asking questions and wanting more.<br><br>Cinematically stunning, the music and scoring draws you in even further.","user":"JesseDeanNorsworthy","rank":[9,12]},{"title":"emotionally moving, worth seeing, worth discussing","rating":10,"date":"20 December 2019","review":"Suspenseful, emotionally moving plot with brilliant direction and cast this independent film is an amazing provoking movie, rich in plot and direction. It gave me chills on how my day to day effects those around me, we need to be more aware of who we pass and move by, a simple exchange could change the outcome and effect of someone else's life - laws of degrees of separation are so close. No wonder we have been told to keep an eye on this cast - from the up and coming Marc Senior to best emerging performer Steven Roberts let alone NBC Melissa Roxburgh among others that contributed to this evolving thought provoking conversation worthy film. Including the music of Bilal and even Ziggy Marley. I look forward to more from this group of talented writers, directors and actors. Thank you for letting yourselves experience the layers of emotion - how this must have affected your outlook on your own lives portraying such complexity! left me shocked and breathless in an awesome way.","user":"tarnia_c","rank":[8,11]}]