[{"title":"My Review Of \"The Pinch\"","rating":6,"date":"20 January 2019","review":"\"The Pinch\" is a relatively straightforward crime thriller, last-man-out story. Filmed in true indie style the premise transitions from a Tarantino-esque mob mentality into a sort of pulp styled \"Lucky Number Slevin\". The characters are lacking full development to really set life to Meyers vision, but there is enough there to connect with them on a basic level. I found the protagonist loveable but tragic but I never fully understood why he was this way.<br><br>The cast all give pretty decent performances, a few felt slightly contrived but overall the acting really brought the story to life. I didn't, however, feelike that the tongue-in-cheek satire written in as comic relief, was necessary. It stepped a bit to far in spoof territory, pulling from the darker overture of the actual plot. It didn't quite hit the pulp film mark. But those moments aside the movie is very watchable, and easily likeable. If crime noir is a favorite genre, give \"The Pinch\" a go.","user":"ASouthernHorrorFan","rank":[1,1]},{"title":"Very funny Movie!!!","rating":10,"date":"12 January 2019","review":"I like Pinch. Its movie is very interesting for me.","user":"Ritaferber90","rank":[1,1]},{"title":"A day in the life of crime","rating":4,"date":"7 January 2019","review":"After being denied the bonus and getaway that he was promised, a low-level mobster is nearly killed by the boss that he's trusted for his entire life. Now, he's coming back to get what's rightfully his by force in writer/producer/director Ashley Scott Meyers' latest movie.<br><br><br><br>Known for the film Ninja Apocalypse and writing Snake Outta Compton, Meyers is also behind the site Sell Your Screenplay. Here, he tells the story of Rob (Gunner Wright), who is trying to get what's his from Kain (James Aston Lake, who did stunts in Deadpool).<br><br>Rob had been a courier for Kain and was caught by the police, but agreed to stay quiet and just go away. However, Kain sends killers after him instead. The cops are also on their way to try and get everyone put away while Rob's girl Gina (Candice Bolek) is caught in the middle.<br><br>This movie aspires to be a Tarantino-esque film despite its low budget. James Ashton Lake is pretty funny in his role, but it feels like there could have been a bit more twists and turns in the tale. I'm also not a fan of CGI gunshots and wounds over practical effects, but understand the budgetary concerns.","user":"BandSAboutMovies","rank":[1,1]}]