[{"title":"Dementia 13: Underwhelming supernatural thriller","rating":4,"date":"24 January 2018","review":"I probably should have watched the original first but this became available to me so what was a guy meant to do?<br><br>This supernatural tale tells the story of a family within their castle, a ghost, armed thugs up to no good and lots and lots of secrets.<br><br>I'll say one thing for Dementia 13, it's unpredictable. At no point did I correctly identify what was going to happen or the direction of the movie and that was refreshing.<br><br>The trouble is it's a bit of a mess, I can see what they were going for but it simply doesn't work. The plot is jumbled, the execution is all over the place and I'm left feeling that an additional 30 minutes could have saved the film.<br><br>Again I haven't seen the original (Yet) so this could be an utter hatchet job but in it's current form this is an underwhelming effort.<br><br>The Good:<br><br>Looks great<br><br>Unpredictable<br><br>The Bad:<br><br>Messy<br><br>Things I Learnt From This Movie:<br><br>It's 2017 and people still haven't grasped the concept of finishing the bad guy off","user":"Platypuschow","rank":[19,19]},{"title":"Supernatural vengeance and secrets","rating":4,"date":"6 June 2018","review":"Saw 'Dementia 13', being fond of horror/thriller regardless of budget (even if not my favourite genre) and being intrigued somewhat by the idea. Being behind on my film watching and reviewing, with a long to watch and review list that keeps getting longer, it took me a while to get round to watching and reviewing it.<br><br>Giving 'Dementia 13' a fair chance with being interest and apprehension, it turned out to be far better than expected. Won't say that 'Dementia 13' is a great film because it isn't and the potential, while not wasted, is not fully lived up to. Considering the large number of films seen recently being mediocre and less and wasting potential, was expecting worse and was relieved that while wanting in a fair few areas it was actually one of my better recent low-budget viewings.<br><br>'Dementia 13' started off quite well, the first twenty minutes or so starting the film off on a promising, unsettling and atmospheric note that really does intrigue. <br><br>Production values did have some eeriness and nowhere near as cheap as expected, and the music, which not the most memorable in the world, didn't detract from the atmosphere. <br><br>The setting is effectively spooky. There are spooky and suspenseful moments and it isn't dull. The direction doesn't feel phoned in and the storytelling in some of the first half does intrigue.<br><br>However, the story was severely wanting in the second half after starting off promisingly. It is very disjointed and after the promising start the final third especially loses atmosphere, one loses interest and things start to not make sense and gets increasingly jumbled. Too much of the film is vague and doesn't explore some elements and story strands enough, some dropped soon after being introduced, go nowhere or serve much point.<br><br>Ending is unsatisfying, on top of feeling hasty there are too many loose ends hanging in the air. Got the sense that the writers didn't know how to end the film. Would have liked much more tension and suspense, scares could have been more consistent and some weren't surprising enough. <br><br>Found too the script to lack natural flow and with a bit of cheese going on, and the characters bland with some adopting some annoying and not always logical decision making. The support acting especially (the leads had their moments) is even more problematic than the second half's storytelling, at best it was poor and too often terrible.<br><br>Overall, lacklustre but not a waste. 4/10 Bethany Cox","user":"TheLittleSongbird","rank":[7,7]},{"title":"May Not Appeal to Hard Core Horror Fans But There Was Enough Here to Keep My Interest Throughout","rating":6,"date":"5 December 2017","review":"I can't compare this remake of Francis Ford Coppola's 1963 horror film because I haven't seen the original. In this movie, a family gathers at the isolated Castle Haloran to attend a ceremony commemorating the death of 6-year-old Kathleen, the youngest family member from a drowning many years before. It isn't long before the murders, mayhem, and madness will begin and I was intrigued enough to wonder what the heck was going on here and why.<br><br>Although the dialogue and acting can be of B-movie quality and the film can certainly be weird and bizarre at times, there was enough here to keep up my interest throughout and I certainly have seen worse.","user":"larrys3","rank":[12,15]}]