[{"title":"Ang Babaeng Humayo (The Woman who Left) is a triumph.","rating":9,"date":"30 September 2016","review":"Ang Babaeng Humayo is, without any cuts, nearly four hours long. This three hour and fifty minute black and white film is essentially a revenge tale of a woman to her former lover. But it's not a typical revenge story focused on delivering the hate towards the opposed; it's actually revenge dipped with a cascade of humanity and among other things, transcendence.<br><br>This film talks about the metaphysical being of a human, what it means and how it means to be one. Revenge in The Woman who Left doesn't present characters who have completely expressed a dark attitude filled with teeming hate. It doesn't present a condition in which characters have to be wholly good or rather ideal; this film talks about the reality of human nature and how the physical surface is merely just a dot in the scheme of life. <br><br>Being a Lav Diaz film, one would expect long cuts or scenes of characters talking or the frame just focusing on the background, and that's right. I'll admit, this film is incredibly slow. But that doesn't mean that I wasn't captivated the whole way through. That doesn't mean that I had to check my watch an irrelevant amount of times throughout the duration of the entire movie. In fact, it drew me in. The performances of Charon Santos and John Lloyd Cruz are just fantastic. Santos, who portrayed a character that dealt with thirty years of wronged imprisonment exhibited perfect elegance and a vicious rawness to her acting. Cruz, who portrayed a misunderstood transvestite, had very careful acting which came off as positively natural. Just these two on screen are enough to engross me into this world and as I have mentioned earlier, this metaphysical state. That doesn't mean to say that everyone else was mediocre. The man who sold balot had a great aura and just every other side character did their part in delivering this terrific film.<br><br>With that being said, Ang Babaeng Humayo is glorious. It feels revolutionary at just a small scale, little words and actions changing one's life. Although I didn't feel this film to be completely perfect, with a lack of plot and resolution, that barely derailed me from experiencing this momentous movie. Lav Diaz is best at delivering his art through his script, lyrical words flowing together to formulate beautiful sentence structures that means more than it may seem. This film left a message that not only touched me as a viewer, but also as a human being.","user":"robbieclaravall","rank":[18,21]},{"title":"Beautifully shot but...","rating":5,"date":"27 September 2018","review":"I used the (very helpful) advice of another reviewer and watched the movie slowly, in increments. It is beautifully shot and lighted in black and white, and the characters are subtle and well constructed. The use of \"balut\" in the film I thought was powerful (I had to look it up, its bird- usually duck.- embryos cooked inside the shell, before hatching) There is a mix of kindness and quiet rage at work that I found fascinating, although I would have liked that the political context of life in the Philippines be laid out in another manner, with less obvious exposition, perhaps. There was enough time for this...\nBut the pace is excruciatingly slow, the situations repeat themselves (yes, I know, such as in life itself), I found the main plot point very predictable, and, in my opinion, there really is no reason for the length. \nI would have preferred to have refrained from the use of the word \"boring\", and rate the movie higher, but its not possible, to be honest.","user":"jramalho","rank":[5,5]},{"title":"Truth Cleanses the Soul, and Carelessness Condemns it","rating":8,"date":"4 February 2018","review":"Revealing the truth cleanses the soul, yet carelessness in doing so will condemn it. The knife cuts both ways. After 30 years in a prison work camp for a crime she did not commit, Horacia makes revealing the truth a priority in her life. With righteous fire she begins a quest to expose the true culprit. Her mark is Rodrigo; an arrogant and privileged former lover. Unlike Rodrigo, Horacia has a heart and this sensitivity and sympathy for others makes her vulnerable to distraction, to being found out before she has a chance to strike, or to losing her resolve in some way. Yet her good heart is also her strength. As Horacia closes in on Rodrigo, unexpected circumstances intervene.<br><br>This beautiful black and white film provides a intriguing portrait of small town Philippine society. Ambient sounds of wind in tree branches, tires on pavement and bird songs, lend authenticity to the images. At nearly four hours, the fans of \"slow film\" will certainly be in for an enjoyable, albeit snail-paced ride. I really enjoyed exploring the theme of how holding onto the truth, to hopes in your heart and helping others, invites both vulnerability and vindication. Winner of the golden lion and top prize at the 2016 Venice film festival.","user":"Raven-1969","rank":[7,9]}]