[{"title":"Fun-filled if not pup-tastic","rating":6,"date":"11 August 2017","review":"It is very easy to meet the 'Barbie' films with a lot of dislike and scorn and they are all very lowly rated here (despite some favourable reviews). It is understandable to take issue with the dialogue (a fair few are ropy in this regard), the predictability of the stories, the odd annoying character, the animation in a few (not all are well animated) and whether there is enough for adults to keep interest.<br><br>Despite not being the main target audience, to me they are mostly better than given credit for, easy to take them for what they are and don't deserve to be dismissed as baby-ish and for little girls only (a very narrow minded generalisation). Are they animation masterpieces? No. Are they among the best films ever made? Again no. Are they worth watching if taken for what they are? Absolutely for most of them. Most of them look good if not having the polish of studios specialising in computer animation (Pixar for one), often great music, good lessons and messages, a good deal of charm, have their heart in the right place and have entertaining characters well voiced (some had actors of considerable calibre like Tim Curry, Anjelica Huston, Martin Short and Kelsey Grammar, all of them terrific in their respective outings Curry especially) and a likable title character that particularly young girls can relate to.<br><br>There are better 'Barbie' films ('Nutcracker', 'Diamond Castle', 'Island Princess', 'Pink Shoes'), but 'Barbie: Star Light Adventure' to me is one of the better later 'Barbie' films and much better than the likes of 'A Fairy Secret', 'A Fashion Fairytale' and 'Princess and the Popstar'. The previous three 'Barbie' films ('Great Puppy Adventure', 'Spy Squad' and 'Star Light Adventure'), after toning things down and choosing more universal themes, did a better job at attracting a wider audience than 'Barbie and her Sisters in a Puppy Chase', which was basically formula 'Barbie' but in a tropical location.<br><br>'Barbie and her Sisters in a Puppy Chase' is fun-filled, colourful and well-meaning, but does fall short of being great let alone pup-tastic. The dialogue is simplistic and at times forced, even for somebody who doesn't expect a script in a 'Barbie' film to be good. The story is yet another that sees the viewer a step or two ahead of the film in how things are headed with even the messaging at times being a bit repetitive this time round.<br><br>The characters do lack depth beyond neatly black and white and the ending does lack lustre and doesn't feel particularly well rounded off. This is also the first 'Barbie' film since 'Princess Power' where things at times did feel a bit over-simplistic, sugary sweet and saccharine as well as at times tired.<br><br>However, the animation is quite nice with the lack of the original/traditional look that in general appeals much more than the modern one not being a bother whatsoever. There are some beautiful bright colours (never excessive here), handsome and imaginative backgrounds and the character designs and movements have natural freedom rather than being stiff. It's not exactly imaginative and it's not as polished as Pixar, but when you have computer animation that makes you physically ill like the entire output of Video Brinquedo and Spark Plug Entertainment and the sequels to 'The Swan Princess' (the CGI ones) and 'Alpha and Omega' it's very clear which is better than them and this.<br><br>Music is upbeat and fitting, enough to put children and adults alike in a good mood. Nothing generic or too loud or intrusive here.<br><br>Regarding the story, it is predictable and far from flawlessly executed but it is full of energy, cuteness and charm with its heart in the right place the entire time (nothing at all mean spirited). It's fun-loving and well-intended, if more repetitive and Hodge Podge-y than the previous three 'Barbie' adventures.<br><br>Characters, even with the lack of depth, are engaging and carry the film well. Barbie is likable and resourceful as ever, as well as smart, serving as a good role model for young girls especially. The puppies are adorable while not being too excessively cute. The chemistry between the characters is great too, as is, beyond the repetition and samey nature of the messages themselves (important messages but have been covered many times previously in the series) the positive messaging that was delivered with the right amount of making-its-point and subtlety.<br><br>Voice acting is pretty good and done with a lot of spirit. One may miss Kelly Sheridan, but the new voice actress is a worthy replacement.<br><br>In summation, not pup-tastic but has a lot of fun, colour and heart that it is difficult to be too hard on it while still acknowledging that it isn't necessarily great. 6/10 Bethany Cox","user":"TheLittleSongbird","rank":[1,1]},{"title":"Trump's America","rating":1,"date":"7 October 2019","review":"Lindsay, a woman of colour, who has trained hard, is an excellent dancer, turns up on time and in costume, has her first prize snatched from her by a white girl (Barbie's younger sister Stacey) who can't dance, was late to the competition and broke the rules. When Barbie says that you can achieve anything with a \"positive attitude\", what she really means is White Privilege.","user":"allertonjames","rank":[0,0]}]