[{"title":"Hipster/indie/Low Budget Fail","rating":1,"date":"16 January 2019","review":"If you liked the indie movie \"That's Not Us,\" you would probably like this movie. I couldn't stand that \"gem\" of a film and neither could I stand this one.\nFirst of all, movies that hinge entirely on dialogue better have a good script and characters we care about. This movie attempts to be \"real\" and show dialogue of twenty/thirty something aged folks together for a weekend bachelorette party (some people don't know each other well so it goes out of its way to capture awkwardness), but I seriously question the quality and realism of the script.<br><br>Combine that with some bad acting and directing, including things like sudden melodramatic gestures/sudden tears from most of the cast at odd moments, random bursts of song from the singer character, and one of the main characters not knowing how to jog without flailing her arms (even non-runners know how to jog a little without looking ridiculous-which was reallllly overdoing it), a nerdy male \"Harry Potter\" looking guy being lined after by multiple attractive women in the film and you have a bad/unrealistic movie.<br><br>I didn't even touch the plot issues. I won't spoil it, but let's just say that if the main lesbian couple just talked more openly, this movie wouldn't have a reason to exist.<br><br>In addition, the director made the odd choice to also rely on faux interviews with the characters talking to an interviewer behind the camera to learn more about each person and his/her sexual development. Why was this necessary? It seemed odd and out of place in this dialogue-heavy movie.<br><br>Character development was poor. Actors start crying in the film or bickering before you have time to understand them or care.<br><br>Ultimately, this movie is a complete waste of time. It was like watching footage of a bunch of random people I don't know and don't care about try to work things out/avoid things over the course of a weekend. Yawn!","user":"earthboli","rank":[7,9]},{"title":"Decent, slice-of-life movie","rating":8,"date":"12 September 2018","review":"I came across this movie on Netflix and while I greatly disliked the actress who played Lu - her acting style was very distracting - I did enjoy Constance Wu's Andi and the supporting characters, especially the very funny Regular Helen.","user":"dreamlife613","rank":[7,9]},{"title":"Awful","rating":3,"date":"26 August 2018","review":"As a lesbian, I am well accustomed to watching awful films just for a lesbian storyline but this was definitely one of the worst. I didn't connect with any of the characters and nothing really happened throughout the whole movie. There are also some really cringey parts where one of the characters sings.","user":"fameartpop","rank":[17,27]}]