[{"title":"Great watch for non-technical commoners","rating":9,"date":"24 August 2018","review":"Here's the irony -- I ended up watching this fascinating documentary on algorithms *because* of Netflix's (extremely accurate) recommendation algorithm.<br><br>As someone who works with algorithms in the field, I found this documentary to be a super enjoyable watch. This documentary, in my opinion, will especially be a good watch for those curious about the BIG world of algorithms, especially given the fact that the documentary neatly explains many of the most widely used algorithms in real life and shows how it's entrenched in nearly every part of our modern lives. This should also be a good watch for young children to get them curious about algorithms and computer science in general.","user":"Abhiminator","rank":[2,2]},{"title":"Really a thought provoking documentary that tells the story of hidden math all around us","rating":10,"date":"9 May 2018","review":"This was a great documentary that raises questions like, what is the best way to looks through millions of bit of information and how math can get you out of any maze. Definitely worth a watch for those who want to see through the lines of life's normal experience.","user":"nathanstorm","rank":[2,2]},{"title":"Interesting and edifying","rating":8,"date":"1 February 2019","review":"A documentary on algorithms and their practical uses in our lives, presented by Oxford mathematics Professor Marcus du Sautoy.<br><br>Interesting and edifying. Professor du Sautoy, who also brought us the documentary series The Story of Maths, takes a very complex subject and makes it understandable and relatable. By taking everyday examples, e.g. the ordering of planes taking off at Heathrow, du Sautoy demonstrates the uses, importance and abundance of algorithms.<br><br>The downside to making it more widely accessible and understandable is that the documentary is quite light on the maths. As a mathematical person I would have preferred a bit more of the technical side of such algorithms. Can't have it both ways, I suppose.<br><br>The other negative of the program is that, by his own admission, Professor du Sautoy doesn't like This Is Spinal Tap...","user":"grantss","rank":[2,3]}]