[{"title":"just too much of everything","rating":3,"date":"13 October 2018","review":"I did like the cinematography, overall fitting choice of music, acting was ok, but for my tastes the whole movie uses too much of everything. The story would alone be enough to keep you entertained, but then there is a lot of action, and there are a lot of classic horror type of elements included, like occultists, flashbacks, sudden scares. \nOne problem is that these genres require different type of treatments. If you want to focus on the drama, you shouldn't saturate the movie with classic horror type of scares. For a drama, all the characters are too simple and too \"sketched\". If you want to take the characters and their development seriously, you can't include a classic horror type of character like the reception lady.\nIf you make the viewer mentally active with following the little bits of information from the past, you have to provide an explanation, on how Katie managed to stay unnoticed with the occultists for all those years. How were they able to paint those signs everywhere, how were they able to follow Sam unnoticed, etc. Of course, that way the ending would loose it's edge, but this way it leaves you with a lot of questions and dissatisfaction. We would need to know more about Katie. \nAlso it seems that the only person who has emotions is Sam, she is being painted the only human being in this very desolate world, yet in the end you realize that the whole movie is about her punishment. Really? Does she really deserve that? Do we really deserve that? To see our heroine getting completely destroyed? We only get about 3 seconds of flashback in the very end that should be explaining her guilt - but then we are also told previously, that she had thought Katie did it intentionally . \nSo in the end, i think you have to make a choice if you are focusing on the emotional, or the mental side. You can't mix the two like this movie. I did like the way the movie was able to paint how Sam was feeling with the music and the unusual pictures, but i think you need to give something to the viewer in the end. <br><br>Because now it kinda sounds like: \"Don't kick the girl you think has intentionally cheated with your boyfriend, so that she gets an abortion, because you will loose your child and eventually suffer for many years just to get back to your town, get almost killed a couple of times to get finally killed much more epicly. \"","user":"gabor-csordas","rank":[16,18]},{"title":"Great build up. . .","rating":5,"date":"16 December 2018","review":"Great build up. Some interesting storylines and then suddenly, it's as though the viewer says \"Oh, the villian must be blah!\"\nWriter \"OK, you got me! Guess we're done here. The end.\"<br><br>A couple of the major plots seem completely disparate and then, suddenly.. the end credits roll?","user":"flyonwall","rank":[7,10]},{"title":"Interesting!","rating":6,"date":"12 September 2019","review":"Writer-directors Justin Hewitt-Drakulic and Alex Lee Williams created this film about the sleepy village of Hellmington, a place that Detective Samantha Woodhouse (Nicola Correia-Damude, The Strain) thought she left behind ten years ago. That said - as much as you can never go home again, you probably shouldn't.<br><br>All those years back, troubled high school senior Katie Owens mysteriously vanished. That ties into why Samantha is back, beyond the fact that she's dealing with the death of her estranged daughter. She's also dealing with the death of her daughter, an event that has destroyed her marriage and career.<br><br>Soon, she learns that her father's death is one of many that ties into Katie Owens. There's also the matter of her insomnia, hallucinations, self-doubt and a centuries-old cult that runs the town.<br><br>This film was the winner of the 2015 Cinecoup Film Accelerator Challenge, which granted them a million dollars in financing. The original version of the film was a documentary that only focused on the Katie Owens disappearance, but the final film ended up becoming a narrative story.<br><br>The filmmakers spent their money the right way, getting great actors like Correia-Damude, who they've said was the reason the film was able to finish on time (she supposedly nailed 9-12 pages of script a day, an amazing feat) and Michael Ironside (Starship Troopers), who was the selling point to get me to watch this.<br><br>Between the arty shots and the soundtrack by Cults, this film aspires more to the arthouse than grindhouse. If you're a fan of True Detective, you'll see its influence all over the film. That said, for young filmmakers making a film that's pretty much going direct to streaming, it's head and shoulders above the competition.","user":"BandSAboutMovies","rank":[3,4]}]