[{"title":"One of the most beautiful family films","rating":9,"date":"3 July 2018","review":"One of the most beautiful family films to show you how to unite family time of hardship this life bitter and sweet and full of emotions with a blending of comedy wonderful and admirable","user":"chtaeh","rank":[13,13]},{"title":"An intelligent and profound survival movie","rating":8,"date":"16 August 2017","review":"The Survival Family is a very intelligent movie that mixes dramatic and humorous elements in a balanced way. The film tells the story of a slightly estranged family consisting of a busy father, a lonely wife, an overtly sensitive daughter and an isolated son who has a crush on a popular girl at school. The first half hour of the movie shows us the everyday life routines of the four characters before a worldwide blackout drastically changes their lives. In the beginning, they believe that the power cut will be fixed within a few days but due to mysterious circumstances, this won't be the case. The four characters have to change their routines as their schools and workplaces get shut down. They ultimately decide to travel south in hope to find a place that isn't affected by the blackout and to join other members of their family who are living by the coast.<br><br>There are several elements that make this movie one of the very best of the year. First of all, the initial idea of the movie is inspiring and mysterious. The audience will constantly ask itself what it would do if it were in a similar situation. The film also remains unpredictable until the very end which adds some tension to the potpourri of dramatic and humorous elements.<br><br>Secondly, the acting of the four main characters is excellent and each character has its very own flaws and strengths. You will see each character change due to the unusual circumstances and you will witness an estranged family get closer to face challenges of all kinds. The movie gets a profoundly philosophical touch and discusses the values of family, nature, resilience, wealth and life in general in an inspiring way. You will end up rooting for the survival of each member of this refreshingly normal family.<br><br>Thirdly, the family meets numerous interesting characters on its journey through Japan. The most interesting characters are the ecological cyclists and the tough pig farmer. These encounters introduce the audience to diversified characters with very different philosophies which leads to some situation comedy.<br><br>A fourth strong point was the movie's final third that accelerated the pace and adds a lot of action and tension. The family has to deal with challenging, heart-breaking and miraculous incidents that will change the lives of everyone involved.<br><br>A fifth and last strong point was the movie's conclusion. I felt it ended in a profound way that does the rest of the movie justice instead of trying to conclude with a misplaced bang or twist.<br><br>If the scenario of a world without technology intrigues you as much as it does me, you have to give The Survival Family a chance. This movie is a very interesting alternative to the usual type of survival movies involving brutality, conspiracy and the supernatural. Despite its unusual settings, the film remains as human and realistic as it gets and despite having a message, the film doesn't try to preach anything. Fans of intelligent dramas might have found their highlight of the year already with this movie.","user":"kluseba","rank":[13,14]},{"title":"A crazy comedy that's actually a lot more intelligent than you'd expect","rating":8,"date":"12 February 2017","review":"I fully expected this film to be a moronic, preposterous and irritating comedy. So, you can imagine my surprise when it turns out that this is actually a properly good film. Yes, it's a silly, light- hearted comedy, but it's massively funny from start to finish, and nowhere near as annoying as I anticipated. However, beyond that, its concept makes for a genuinely interesting watch that provides so much more brains and drama than I could have ever imagined from this film.<br><br>But before I go too mad with high praise for this film, let's start off with the humour. When it comes to the comedy here, it's by no means ingenious. The majority of the humour is either a series of silly running gags or various ridiculous mishaps that the family get into on their long voyage across Japan. And yet, as silly as it all is, it's all actually very funny.<br><br>Particularly in the first two acts, when everything is going wrong for a family thrust out of their technological world, the comedy works really well in tandem with the crazy nature of the story. Everything feels fantastically odd wherever you look, but that means that the crazier comedy is all the more appropriate, and as such all the more entertaining, leaving me with a big smile on my face and laughing again and again throughout.<br><br>Of course, another reason that the film is so funny is because of the performances. Whilst they're all very comical and exaggerated, the lead four actors work brilliantly together. The family dynamic is perfectly believable between each of them, and their various personas clashing throughout makes for some great laughs.<br><br>So, it's pretty clear that Survival Family is a great choice for a simple, light-hearted and funny watch. However, what really surprised me about the film is that it's actually got something more to give.<br><br>I didn't think much of Waterboys and Swing Girls, the two films I have seen from Shinobu Yaguchi before. Whilst one is a decent comedy and the other is just annoying, neither of them had a particularly interesting, let alone intelligent story.<br><br>That's why I was delighted to see that this film has actually got some brains. Behind all the comic madness, the story about the world in the immediate aftermath of an eternal power outage was actually really interesting to see. It's not a doom-and-gloom post-apocalyptic drama, nor is it overly preachy about our over-reliance on technology, but instead a film that takes an interesting concept and runs with it brilliantly throughout.<br><br>Touching on almost everything that would happen to the average person in such a situation, from the return of trading for food and water over the use of money to the desperate need to adapt to living without mechanical assistance, I was genuinely intrigued watching this scenario play out for two hours. The story of the family's relationship and bond growing is also a heartwarming and pleasant centre for the plot, but it's the way that the film realistically depicts how people would go about this sort of situation that really grabbed me.<br><br>Overall, I had an absolutely great time with Survival Family. I'm not going to forget that it is first and foremost a fun and light-hearted comedy, and so it proves with excellent laughs from start to finish and a fantastic lead quartet. However, what really makes it even better is how surprisingly interesting its story is, and the way in which it depicts a fascinating scenario.","user":"themadmovieman","rank":[20,23]}]