[{"title":"Poor movie","rating":2,"date":"13 September 2018","review":"Poor storyline, poor acting from the lead star and poor effects. Gives one the feeling that a whole bunch of amateurs tried to make a movie.","user":"tayseer-ms","rank":[18,18]},{"title":"Worst. Screenplay. Ever.","rating":4,"date":"4 September 2018","review":"Even if your budget is only a few dollars, beg borrow or steal money instead of letting amateur writer Sean Mick write his first ever screenplay for a full length feature film. Start with short films, go to film school, let a pro proofread the garbage you wrote, something... but don't ruin a film with the worst cliches, actors scenes and dialogue a 5th grader could have better written. <br><br>From the annoying whispering tone of Johnny Messner to the full time toothpick in Tito Ortiz's mouth, these cliches are 1980's writing. Many scenes where too long and convoluted. <br><br>The directing was ok considering the script Timothy Woodward Jr. had to work with. The acting was typical for this type of film, but would have been better if the director directed his cast better and had a better script to work with. The story in itself has been played over many times, but I could live with that... I just couldn't handle the cheese that made up most of the screenplay. The fight scenes where poorly edited and choreographed. Even Danny Trejo's shotgun blasts at the end where so obviously pathetic 1970's gunpowder effects. The score was also annoying for most part of the film. The cinematography was adequate. <br><br>It's too bad this flop could have been avoided had the proper resources been part of the production, as I'm a fan of all the UFC and lead actors. This one missed the mark in a huge way. A very generous 4/10 from me.","user":"TheTopDawgCritic","rank":[30,34]},{"title":"OOOOH so bad.","rating":1,"date":"11 September 2018","review":"Spent and predicable story.\nHorrible acting.\nNo sence of reality what so ever. Blood in all the wrong places all the time.","user":"klauber-63356","rank":[13,14]}]