[{"title":"Shallow movie","rating":2,"date":"5 February 2017","review":"Starting with a violent murder case and a Dr. in criminal psychology to review the case gave me an impression that I would have a good movie but I was totally disappointed. <br><br>The story line is totally broken and it's like sketches that does not add to each other. Many murder cases but it seems like a random events that don't build something or contribute to the characters development. many useless events are added or at least not used to affect the story or the characters. The romance is so cheap and the main character fall in love in just 5 minutes and wanted to propose in a week later. <br><br>The characters are so shallow. They failed in showing deep psychological side for the characters despite introducing a Dr. in criminal psychology as a main character. There are no logic in introducing the characters. the back stories of side characters are totally neglected. The main character is always act like a superman with super skills so he is a thief, a sniper, a hacker and many more. <br><br>In the end of the a movies out of the blue they try to shove a message in our mind that the execution is bad act . without any proper justifications the characters just change their minds. just a sudden 180 degree flip of the character opinions. Making the message is totally alien to the movie story line.<br><br>In Nutshell It's a very shallow movie and you will not be satisfied if you are looking for good drama, violent crimes or deep psychology.","user":"viva-amego","rank":[31,40]},{"title":"mercy","rating":3,"date":"3 February 2017","review":"Greetings again from the darkness. Making a political statement is nothing new for movies; however, if a filmmaker takes a stance on a controversial issue, the final product needs to be insightful and compelling in order to make a difference. Seemingly intent on making a mockery of the Death Penalty, director Timothy Woodward Jr delivers little more than a B-movie with a hyper-serious tone, but a script that is at times laughably off the mark.<br><br>Even before the opening credits roll, we get our first brutal murder  just moments after persnickety Bruce Dern belittles his wife over the sandwich she made for him. Next up, Dr. Amanda Tyler (Denise Richards) is being asked by the Assistant District Attorney to consult on the case of a death row inmate, to determine if a stay of execution should be granted. See, Dr. Tyler is a criminal psychologist. Yes, she's played by Denise Richards. If this causes you frightening flashbacks to Ms. Richards' role as a physicist in The World is Not Enough, then you begin to have some idea what this movie is like.<br><br>The inmate is Jackson Shea (a formidable Kaiwi Lyman-Mersereau) and as he tells his life story, we are provided scenes that explain how he got to this point. It's a pretty interesting backstory starting with sleazy Uncle Mike, an alcoholic mother, and a seemingly endless array of circumstance that might have formed the basis of a better movie. You will note many familiar faces along the way: Michael Pare as Shea's partner, Patrick Kilpatrick as a criminal kingpin, Johnny Messner as a fellow criminal, and Emma Rigby as Shea's love interest. For you football fans, you'll likely reminisce about Brian Boswell when you witness Rob Gronkowski as a gun-toting bodyguard.<br><br>All of this could have been good criminal fun if we weren't being incessantly slapped upside the head with the anti-Death Penalty message  how trading death for death isn't appropriate, and for tilting the scales to show how criminals are basically good guys who accidentally end up in a bad spot thanks to a broken system and culture of violence. It's all a bit too heavy-handed and self-righteous, taking away some of the joy in chuckling at Ms. Richards playing it straight as an intellectual idealist.","user":"ferguson-6","rank":[38,53]},{"title":"Just awful","rating":1,"date":"16 August 2018","review":"I can't honestly say I was expecting a movie with Denise Richards headlining to be of any real quality, but my god, has there ever been a poorer cast of actors?!<br><br>Every character comes across forced; every line sounds like they were reading from the script in their hand; as if the director was just a film student who cast his family members for a class assignment. <br><br>Do yourself a favour - just don't bother.","user":"kessiebear-24936","rank":[8,9]}]