[{"title":"SPIDERS FROM MARS","rating":5,"date":"14 April 2018","review":"Let's get right to it. The story is very simple - photojournalist couple receives visit from oddly-behaving man and woman, who turn out to be creatures the photojournalists have accidentally \"caught\" on film. The photojournalists are \"caught\" at home, \"caught\" unawares because they have no clue what's on the film until they take a closer look. It's all very claustrophobic, helped immensely by the acting skills of the four main characters, and the suspenseful score. Unfortuately, it's very slow, and seems repetitive, trying to pad what is essentially a short. The audience is therefore also \"caught\" in this ponderous web.<br><br>I say web because I believe the creatures are spiders. It's never revealed outright but there ARE clues. (1) A brief scene where a spider (brown recluse?) crawls up an arm. Why is that in the film? Yes, it's creepy but the film doesn't otherwise use symbolism to create atmosphere. (2) Though the audience never sees the photo in Andrew's hand, there IS a photo hanging in the darkroom which looks to me like a giant spider creature. (3) While some may think it's a cat-and-mouse game the creatures are playing, I see it as spider-and-fly. (4) Once their human features are punctured, the creatures revealed seem more invertebrate than vertebrate. (5) The creatures ooze saliva on these human victims quite often, as if trying to paralyze them rather than merely menace them.<br><br>It's not a bad film by any means but it DOES seem as if writer and producer Alex Francise intentionally wanted viewer frustration, as if they too should be \"caught\" in a trap from which there is no resolution. True to form, the film ends on a dim note, neither apocalyptic nor hopeful. <br><br>One last note: Baby Emily might be part creature offspring. The creatures' interest in whether Andrew and Julie were \"copulating\" at the moors indicates they have not only come for the photos but also for the infant. Interesting anyway.","user":"gengar843","rank":[12,13]},{"title":"Don't get \"Caught\" Wasting your Time","rating":5,"date":"31 March 2018","review":"When I saw the trailer for the new British space creature feature \"Caught\" I thought, \"Man, this looks stupid.\" Alas, I wound up watching it anyway. Lesson learned. Sometimes you gotta go with your first impression.<br><br>It's not that the premise, nor the acting, are bad here. They really are not. But the pace is utterly atrocious. And there is absolutely NO payoff in the end.<br><br>Hey. Filmmakers. What in the hell was so horrifying about that which was caught?? Would have been nice to know here.<br><br>It just mighta saved your flick.","user":"jtncsmistad","rank":[22,29]},{"title":"Tea With The Blairs!","rating":6,"date":"30 March 2018","review":"Set in 1972 Andrew &amp; Julie are a couple of would be investigative journalists who are starting to work on an expose of a new army base on the nearby moor.\n'Must be nukes' they tell their editor.<br><br>Then a couple of strange Jehovah's Witnesses with a problem with postmen hove into view. They claim they are from the Moor and have some questions so the pair invite them in for tea thinking they are officials of some kind.<br><br>The strange couple introduce themselves as Mr &amp; Mrs Blair. Everybody sits down. The Blair's rather oddly and tea is served. Mrs Blair complains it is hot. Andrew points out Mrs Blair's shoelace is undone. Mr Blair says she will get around to it shortly.<br><br>Then the questions begin and are strange at first and get stranger as they progress. When Andrew gets annoyed Mrs Blair suddenly screams maniacally and attacks him. Mr Blair explains 'she has killed and you would not be the first today'.\nThe interview goes downhill from there.<br><br>Mr Blair seems to want something they have but they don't know what it is. <br><br>April Pearson &amp; Cian Barry, who I am not familiar with, play the Blair's really well and give a new insight into creepy. Especially April who steals the show.\nIt's as if we are in Strangers territory but its even weirder than that.<br><br>It's a pretty well done mostly indoor mystery drama with some good acting from the 4 leads. <br><br>What's it about? Check it out as it is worth an hour and a half of your time.\nIt's not a horror as such but is well acted and a decent story.\nI gave it 5 but added a 1+ as it was an attempt to do something new with a tired genre. \nI guess with a bigger budget it could have been something a bit special.<br><br>On the downside there is one glaring omission that will have you spitting feathers. But decent effort all the same.","user":"doorsscorpywag","rank":[19,27]}]