[{"title":"Chick Flick on dating and relationships...","rating":6,"date":"2 February 2017","review":"I think this movie was made to be a theater release and for some reason ended up on Lifetime. You can tell because of the bleeped out curse words and sexual content. Although I wish they toned it down a bit, it worked as a Lifetime TV movie. I think this movie was fun and relatable in some areas, but at times went a bit over the top/silly and unrealistic. The struggles with dating and trying to find a meaningful relationship were mostly genuine. I loved the relationship, support, and \"keeping it real\" between the girlfriends too. It also was good at showing women and men in different stages of their own relationships (dating, married, celibate, etc) and choices, sacrifices each made for love and their own integrity or values. The movie was predictable but the acting was good. There were some fun laugh out loud moments (laughing with you and laughing at you) and some \"oooh, girl I've been there\" moments, as well as a few cringe-worthy, \"would someone really do that?\", and \"they could have left that out\" moments. All in all, this is a cute chick flick you can cozy up to with a glass of wine or tub of ice cream on a night you find yourself dateless and home alone...In My Humble Opinion 6/10 stars. 2/2017","user":"LiveLoveLead","rank":[4,4]},{"title":"Awful","rating":1,"date":"9 March 2017","review":"Just now seeing this movie and I created an account just so I could leave a review. It is one of the worst movies I've ever seen. It was cheesy, corny and cringe worthy. I can't believe they're still making movies like this in 2017. The way it ended, I hope there's not a sequel to it. The open marriage plot was dumb. And the coworker getting with a gay guy was absurd. Don't waste your time.","user":"drip-14196","rank":[9,12]},{"title":"Just BAD!!!","rating":1,"date":"31 January 2017","review":"I usually like movies with Meagan Good, but this movie was totally stupid. She plays a character who's extremely desperate to find a man to the point where it totally consumes her. This is the reason so many women end up in horrible relationships. This movie relays one message loud and clear: if you're a woman without a man, you better start trying HARD to find one under any circumstances. Another example of why I gave this movie 1 star: This main character's coworker ends up dating and then marrying a man they met in a club. Just one problem! He's VERY gay! Now, I have absolutely no problem with men or women who are homosexuals, but why on earth would it be written into the script to have this woman marry a man who's so obviously gay??? This movie sends many very bad and condescending messages to women, and it's very unfortunate considering the times we're currently living in. I certainly wouldn't recommend this movie to anyone unless they're just bored and have lots of time to kill.","user":"tisa-01078","rank":[8,12]}]