[{"title":"Andy Lau stars in a great action flick!","rating":7,"date":"11 May 2017","review":"Andy Lau plays the head of the bomb dismantling division of the police who goes undercover to infiltrate a group of robbers who use bombs. This gang's careless actions when life is concern made this cop take drastic measures to bring them down. Because of this, the bad guy seeks revenge from this cop by taking his hostage negotiation to get his brother back very personal.<br><br>And the bad guy for this movie was really bad ass. Just that right touch of evil that only makes the good guy that is Andy Lau look better.<br><br>A very instance thriller that's very action packed, but there was also a sub story about Andy Lau's character finding love with a school teacher. It's rare that I've seen people kissing in Chinese Cinema. Maybe I'm watching the wrong movies, but I've seen Chinese action movies in which the lead star has girlfriends or wives, but they never touch each other, and even though I grew up in America were our action heroes go beyond touching the leading ladies, it was odd to watch Lau give so very long and romantic kisses to his leading lady.<br><br>But as interesting as that was, first and foremost,this was a great action movie from beginning to end. Worth seeing.<br><br>http://cinemagardens.com","user":"subxerogravity","rank":[15,21]},{"title":"Incredible action scenes.","rating":7,"date":"28 June 2018","review":"The film features some incredible action sequences and also a few very tense moments. A great premise convincingly executed thanks to believable acting and an experienced director. The humor was kept to a minimum, making the film an effective nail-biter.","user":"paulclaassen","rank":[4,5]},{"title":"Best Andy Lau movie in a long time","rating":7,"date":"3 July 2017","review":"Andy Lau is one of my favorite actor from Hong Kong cinema in every movie no matter he staring in lead role or supporting role he always give 100% and with this movie Shock Wave he proving one again he still on top of the game.Directed by Herman Yau also one of my favorite director Shock Wave is a action crime movie about a brave bomb disposal officer try to stop a group of terrorist that take over a underground tunnel.All the performance in this movie is good mostly about Andy Lau character and the movie direction.I have so much fun thought out this movie,it never have a dull moment,the tension always high and the action scene is very clear and awesome.Some minus point is the romance is very rush and the main villain is pretty disappointing.","user":"phanthinga","rank":[10,17]}]