[{"title":"Status Anxiety","rating":28,"date":"28 January 2018","review":"\"Brad's Status\" begins like a coming-of-age film about a young man interviewing colleges as he embarks upon adulthood. But the coming-of-age experience is more applicable to the boy's father, who is experiencing a peculiar mid-life crisis about \"status.\"<br><br>In the bonus track of the DVD of \"Brad's Status,\" the writer-director described the film as a personal drama about \"status anxiety.\" Brad is overly concerned with competition and what others think about him. In a scene where he reunites with an old college chum, the friend never even recalled their relationship as competitive.<br><br>For poor Brad, the glass always seems half empty. One of his realizations in the film is that \"sometimes in life, you can lose the plot.\" Indeed, Brad has lost his narrative, and it takes his perceptive son get him back on track.<br><br>The film stretched credibility by making Brad's son far too wise beyond his years. The same was true of a young musician friend of the son, who takes the father to school with life lessons, telling him simply, \"Trust me; you have enough.\"<br><br>It may be difficult for most of us struggling to earn a living to relate to Brad's status anxiety. But despite its shortcomings, the film has some thoughtful dialogue, and Ben Stiller is excellent in the role of Brad. There are many heartfelt moments where the poor schlub begins to realize how full and complete his life really is.","user":"lavatch","rank":[20,21]},{"title":"Great story but a bit slow","rating":7,"date":"4 November 2017","review":"I hadn't seen a Ben Stiller movie in a while and this one kind of came out of nowhere. Very little marketing and promotion meant that when I saw it was released I was surprised, but it is reflected in its low budget. The movie follows Brad (Ben Stiller) who is disappointed with his life, since all of his friends became very rich and successful in life. The plot revolves around him going to Harvard with his son, who is trying to get into the university. <br><br>The rest of the plot if filled in with learning more about Brad and his successful friends, whilst his son is really only there to move the main plot forward. It all felt a bit slow, which was not helped by the sweeping camera shots with no speaking and Brad's narration that is a bit too frequent. <br><br>However, when things eventually happen in the plot it is good. It made me feel sad for Brad at times, yet happy when he realised what was truly important in life. The key message, of course, is that money does not equate to success and this movie certainly delivers that well. What I also enjoyed was that although this message has been littered in numerous movies, Brad's Status delivers it in a refreshing format.<br><br>Although Brad's Status will not wow you, it is certainly a good movie. The plot is nothing new and it may feel slow at times, but it will bring a smile to your face in the end. Regardless of whether you like Ben Stiller's previous performances or not, this will be a worthy addition to your watchlist, especially at this time of year when it can be chilly!","user":"smetin","rank":[39,48]},{"title":"Mind's Status","rating":8,"date":"7 November 2017","review":"Brad is the type of guy who doesn't belong in any kind of social circle really. For some he is too low for their class, for others he is too high. While his problems are laughable compared to problems that are solved by the funds he raises, that doesn't make his problem mom existent. People generally tries to classify this type of films as futile attempts by privileged people. But human mind is always in a fight with itself to achieve more in life and whatever the world around is going about ultimately it's your mind that decides if you have failed yourself or not. Even though the film deals with familiar themes the script is powerful enough to keep you uncomfortable throughout the film. Ben Stiller again proves his best characters are dramatic roles with a light touch of comedy.","user":"Jithindurden","rank":[52,67]}]