[{"title":"I LOVED THIS","rating":10,"date":"20 March 2020","review":"I played the division quite a bit this was pretty cool. I love how they got together and made a movie. We need to promote more positivity in this World. Way to go guys.","user":"joshuacranereview","rank":[12,13]},{"title":"Maybe i can produce my own movie then","rating":1,"date":"19 March 2019","review":"I got more then 1600$ saved up, i can go to a junkyard, put a toy on my back and pretend its a post apocalyptic movie...<br><br>This is how insane 2019 has become, anyone can put a movie out there no matter how bad it is.<br><br>And this one a part the cover art that seems good, is a real piece of junk.","user":"kaefab","rank":[57,84]},{"title":"I Made An Account Just To Review This Movie","rating":1,"date":"20 March 2019","review":"Wow, where to start.....<br><br>This is undoubtedly the worst movie I've ever seen. Having said that, I kept laughing throughout the entire film.<br><br>First off, the scenery depicted in the still for this movie is 100% misleading to how intrigued you believe the setting for this movie will be. There are two major locations for this film. The first being a scant trailer park in which the main character piddles around for half the movie. Then our \"hero\" journeys to an abondoned shack with some tents thrown up around it because a half of a poorly made robot convinced him to. Superbly lackluster.<br><br>The second thing I would like to bring up is the camera work. It may have you laughing at some of the director's choices. Albeit the overly long shots of the main character eating or sleeping, which can go on so long you feel like your awkwardly watching a live voyeur feed, or the shaky \"a camera stand wasn't in the budget\" shots. At one point it almost seems like the cameraman tripped while filming. Pretty good stuff.<br><br>Lastly I want to bring up the acting, or rather the lack thereof. They could not have picked a better person who intentionally seems like they've never even heard the word acting. $20 says it was the directors best friend. Every other character in the movie had exponentially better acting chops than this guy. Every time he ate something he had to nod in acceptance while he chewed, as if to say, \"mmm, this is pretty good,\" and he ate a lot. My personal favorite scene is the minute plus he spent stumbling around pretending to be sick.<br><br>I will definitely be watching the sequel.","user":"edoyle-09926","rank":[45,69]}]