[{"title":"The hate is unfair","rating":8,"date":"15 April 2017","review":"For what it is, the movie is pretty good. <br><br>It's a comedy inspired by real events, a talent manager working in Los Angeles in the 1990s. So see it as semi-documentary type of movie with some laughs here and there.<br><br>I don't know anything about the manager but it seems that he is that weird as Adam Sandler portrays him to be, and the audience for some reason mix those two together thinking Adam Sandler is to blame for some parts of the manager's character? Like the voice for example, the manager seems to have that kind of voice..<br><br>Also, some people watching this probably expected more comedy and fiction, and finish it disappointed. I started watching this without any expectations, just that it's some kind of a movie based on real events, and I had a positive experience watching it.","user":"tixepower","rank":[66,98]},{"title":"It's not the best film ever but I loved it.","rating":9,"date":"17 April 2017","review":"I loved it. Didn't think I was going to but it grew on me. It's corny, absurd and entertaining and kept me watching till the very end.<br><br>I wasn't sure that the film had any basis in fact but it turns out the character that Adam is playing represents his manager Sandy Wernick. What a blast it must have been for Wernick to be lampooned with love by Adam and so many amazing people.<br><br>Check the credits to see who plays Cindy Marvelle's husband Peter.<br><br>Fun!","user":"carlgeers","rank":[32,46]},{"title":"Sandy Wexler was a long, but enjoyable movie. I'd recommend!","rating":7,"date":"17 April 2017","review":"Sandy Wexler stars Adam Sandler as a talent manager working in Los Angeles in the 1990s. He is representing a group of eccentric clients on the fringes of show business. His devotion is put to the test when he falls in love with his newest client, Courtney Clarke, a tremendously talented singer who he discovers at an amusement park. Over the course of a decade, the two of them play out a star- crossed love story.<br><br>I honestly think Sandy Wexler had potential. Adam Sandler was...actually pretty good. The all around acting was actually pretty great! One of the things that originally turned me off of this movie originally was Sandler's voice. I mean, it worked in one movie, dude! The voice wasn't too annoying..you can actually get used it after a while. Though, being a movie critic, I did notice this movie was edited terribly. There's this one scene where Sandy is talking to Courtney. He picks up his drink, and in the next shot it disappears. It is also blatantly obvious Sandler did some voice overs on his already completed scenes. There's parts where you can see his lips moving, but words are coming out faster.<br><br>There are actually a few funny parts! It's not painful in the way Jack and Jill was. Wow! I'm shivering just thinking of it!<br><br>Like many of Sandler's movies, there are way too many celebrity appearances. Some of these include Quincy Jones, Paul Blart..I mean...Kevin James, David Spade, Conan, Jimmy Kimmel, Chris Rock, Quincy Jones, Vanilla Ice, Terry Crews, Rikishi, Weird Al, and Garth himself, Dana Carvey. The movie is full of cameos like these. Though, they all come together in the end. At times, Kevin James' character feels way too forced. Compared to Wexler's other clients, he wins the most on-air time. Sure, the first few scenes with him were funny, but by 2 scenes of James', you think 'How many times are they going to pull the same dumb joke?'<br><br>The movie did benefit from being on Netflix, and not an actual movie. Sandler's past few movies bombed, and this would've, too.<br><br>The movie is set in the 90's, but it didn't need to be. The 90's aspect is so forgettable, when there could've been so much more to it! Though, there is a scene where Courtney falls in love with a coffee chain owner (Starbucks), and Sandy says it will never work. With the inclusion of Weird Al and QUincy Jones, this movie would be better set in the 80's, not 90's. It did have nice use of older footage. For example, Courtney goes to the 1995 Grammy Awards. We see shots from other artists from the original show.<br><br>Sandy Wexler accomplished its job: a forgettable comedy. Sure, it's enjoyable, but at over 2 hours long, you almost want it to end halfway through. The movie really does pick up by the end.<br><br>Is Sandler back to being funny? Well, this was a great start. If Sandler does another Sandy he'll be back. This was an enjoyable movie, which I'd recommend.","user":"jdtoyshow","rank":[34,54]}]