[{"title":"Below mediocre but inoffensive.","rating":3,"date":"5 January 2019","review":"The kid (5 year old, hasn't seen more than five feature length movies in her life), liked it well enough, so that's good enough I guess? Everything is great if you experience it for the first time or something? Mission accomplished movie.<br><br>1 star for that, one for the world itself even if there could have been done more with it, and another because while rehashed, the messages are at least timeless and good.<br><br>---<br><br>As for the movie being frightening. While my kid wasn't, so what? Kids need to be frightened sometimes. It's a good learning experience and if anything a plus. Nightmares or no nightmares. If your kid is frightened by this, talk about it. It'll be fine soon enough.<br><br>---<br><br>Now. I like kids movies. if there's anything good in them. Be it jokes for the adults, charm, great animation, creativity, or even just plain goofy fun.<br><br>There's nothing, NOTHING, suprising, funny or original in this movie. Clichee characters, story, jokes, everything. To the last detail, everything this movie has, you have seen somewhere else, just better. It's almost funny to remember the movies this one plucked its stereotypical beats from.<br><br>I'm not expecting Pixar quality in the animation department from a mediocre budget German production, but I *do* expect a certain amount of script quality or some fresh ideas, wether it's a movie for small kids or not. Wether it's an adaptation or not. Give me SOMETHING movie! It didn't. Nothing. This movie is completely devoid of any and all creativity. Which is sad to see. The property itself is a great thing for kids, sad they didn't do much with it.<br><br>Maybe I'm jaded and seen to many movies.<br><br>As a final sidenote, this movie is based on a weird rockmusical thing for kids, so there are a few \"rock\"... ish songs in it. Fine. But did those absolutely need to be twice as loud as the rest of the movie, even the action scenes? Really obnoxious, bad mixing there.","user":"eferoth","rank":[10,13]},{"title":"Ruined my childhood","rating":1,"date":"6 February 2020","review":"Tabaluga was one of my favourite childhood tv shows, this atrocity ruined it. Just one look at the horrid animation, bad plot and abominations of characters is enough to give not only kids, but even adults nightmares. Do yourself a HUGE favor and don't watch.","user":"judgeclaudefrollo-57191","rank":[1,1]},{"title":"Depressing and soul-crushing","rating":6,"date":"13 June 2019","review":"Hey everyone! Die-hard Tabaluga fan here, who has been a fan of the 90-s series (it's first season only) for nearly 17 years now. I wanna start off by saying this is by no means a bad movie some people say it is. It's really well directed, animated and decently written. This review will consist of 2 parts - with and without spoilers. Here is the spoiler-free part of my review. I will mark the spoiler part before it starts.<br><br>Obviously lots of work was done on the characters and their development, especially Tabaluga. So let me describe the characters a little bit more here.<br><br>Since the movie is based on the original musicals and has no connection to the 90-s series, most of the characters from the TV show (like Happy or Shouhu) are absent and do not appear here. Instead we have Bully, the ladybug, and Kolk the raven as the new ones. Kolk is a typical parental figure who is left to care for Tabaluga after Tabalugas parents are gone. He is quite well developed and we see that while he worries for Tabaluga, he trusts him and believes in him. The ladybug however, is a typical comic-relief character, who's main goal is to keep the younger viewers entertained. He does give a little lighter tone to an overall dark movie, although sometimes it goes too far and nearly ruins the scene.<br><br>Limbo is a big, silly polar bear who plays a similar role to Bully.<br><br>Arktos is much darker than he was shown in the 90-s series, and it looks like a good thing here. He is tricky and smart enough to pose a real threat.<br><br>Lilli is surprisingly well-developed, not simplistic she was shown to be in the 90-s series(although the tv-show creators did not have time for her development at all), here she has a clear, believable and well-defined character.<br><br>Nessaya also makes a brief appearance, though I can't say much about her. She was a typical wise character that seems crazy at first but actually gives a great advice.<br><br>Tabaluga is developed the best of all. He is courageous, kind, but still is quite young and makes mistakes. There was something I didn't like about him. When he falls in love with Lilli he is consumed by this so much that he follows her like a puppy with love on his face every time he looks at her even though he just met her. That's not the calculating and smart Tabaluga I know from the 90-s show. Sure, he lost his head in the 90-s episode \"Tabaluga and Lilli\" as well, but in there at least he was younger. Here he almost looks like a teen. Overall I wish there was a little more depth about him and more time was devoted to him.<br><br>The Greenlanders are among my complants though. Just like in seasons 2 and 3(which I absolutely loathe) of the original tv-series there were only mammals and birds among them, which is racist given the fact that it should have all kinds of animals, including reptiles. \"well, we have a dragon, that should be enough\". Well, it wasn't. Especially given the fact that you aren't considering dragons as Greenlanders in this movie.<br><br>Music: the music was, for the most part, outstanding. My favorite songs were the first one where Tabaluga was growing up(I haven't felt so excited about watching anything for many, many years) and the song in the ending credits, which brought me to tears. Both were absolutely amazing. Arktos-es song was also good, the original music from the albums was used in there I presume, as it was the same theme used in the 90-s series, same goes for Lilli's theme. Most of other songs were just ok. The soundtrack was great and fits perfectly into the scenes where it plays.<br><br>Story and pacing: The pacing is really good, it never seemed rushed or going too slow, the creators pretty much found a perfect balance here. The story is well-done, though some parts - let's just say I wish they were done a lot differently.<br><br>And now my spoiler-free part of the review comes to an end. The movie is excellent overall and it's obvious not just a lot of work, but a lot of soul was put into it. I just wish the things I will describe below didn't ruin it for me, otherwise to me personally, it would have been near perfection.<br><br>SPOILERS BELOW<br><br><br><br>First of all, let me just say that the scenes with the Tabaluga's parents dying and a pile of dead dragon bodies shown to Tabaluga was way too dark. Even I, a 28 year old person was emotionally devastated by it, it's no surprise many of the children who watched the movie were really scared too. It's been almost 2 days since I watched the movie and it still haunts me. If \"the last one of his kind\" thing was sad, but still gave us hope in the 90-s series, then here it's absolutely depressing and just makes me wanna kill myself. It's that sad.<br><br>Another thing I disliked in the movie(as I already mentioned above) is the love at first sight of Tabaluga to Lilly. There is nothing inherently wrong with it, it's just they form long-lasting relationship with this without getting to know each other better. I know that's how it happened in the original albums but I personally find such rushed relationship which turns out to be a developed long lasting one so quickly unacceptable. They could have showed that Tabaluga and Lilli spent some years together or at least months, but they become a couple after a few weeks or even days!<br><br>And what was with Tabaluga being able to talk to Nessaya only once? They didn't explain that part at all, and we see her among other Greenlanders later.\nI also really disliked that it's love that needs to activate Tabaluga's fire. Not his faith in himself, not his duty to save Green Land and all of his friends, but his personal, selfish love for Lilli. Why is it selfish? Because Green Land and Ice land are at war and all he things about is Lilli and how much he loves her. He saw a pile of dead dragon bodies a few hours ago? Who cares if he has Lilli and spends time with her, promising to be with her forever, with someone he just met? Love activating fire doesn't make sense from biological point of view as well. Imagine if snakes got their venom, which they use to get food and defend themselves only after they met their mate? That's how ridiculous it is. In the 90-s show, he already had his fire in the third episode, simply because he was growing up. Here he needed attraction for someone to find it.<br><br>Another thing I disliked is the Deus ex Machina scenes, like when Limbo saves them in the last moment. Some humor was also completely out of place, in one scene they repeat EXACTLY the same joke that was overused in seasons 2-3 where James comes up with an idea, tells Arktos about it, he dismisses it, makes it look like he came up with the idea himself.<br><br>Verdict - it's an excellent movie with some parts that I wish were not included in here, without them it would have been absolutely amazing, and to me personally would be a nearly a masterpiece. I would give it 7 stars out of 10, but the \"only mammals and birds among Greenlanders\" makes me take away one more star. A solid movie which I can't recommend to little kids and people who are very sensitive like me.","user":"TabalugaDragon","rank":[3,7]}]