[{"title":"Wouldn't it be great if.....","rating":2,"date":"26 October 2017","review":".....at the end of one of these \"same old, same old\" movies, the husband were to be seen packing his clothes and telling his cheating wife that he could no longer be married to her, as he had no trust in her and no respect for her. At least that would be a non-predictable ending.","user":"golfer_08807","rank":[17,21]},{"title":"WARNING: For Vegetarians only ----- REASON: Because this is sooooo corny","rating":2,"date":"20 February 2018","review":"Having watched the entire film to see how it ends I can only say the film started off lousy and only progressed downward from an already lousy beginning. I don't care if the actors/actresses agreed to work for free, and the director picked up this script from the \"Buy 1 and get 3 scripts free\" bin this is just so boring that I cannot pick out even one scene where the dialogue was worthy to be edited in.<br><br>Who would even accept responsibility for putting their career ending name to this piece of junk? The film genre is listed as a Thriller much like the (1987) Fatal Attraction was which includes a love triangle that goes terribly wrong where the innocent and unsuspecting spouse is threatened by the unscrupulous scorned third party lover. Sound familiar? Well \"Infidelity In Suburbia\" is the end result of one person watching the original (1987) Fatal Attraction, and passing the film content by word of mouth from a first person 1 through person 1,000 and what you have left of a half decent film is this diluted piece of junk.<br><br>The ending if I told you what happened, would not be considered a spoiler, because the entire film is spoiled from beginning to end. After investing 90 minutes just to watch a terrible ending that I would rather have washed the dinner dishes and thrown out the garbage instead of wasting my time watching this garbage.<br><br>I give it two thumbs down because I only have two thumbs.","user":"Ed-Shullivan","rank":[11,13]},{"title":"...a Waste of time and good mood !!","rating":16,"date":"16 December 2017","review":"...first at all..my girlfriend choose this film to watch...she liked soap-style movies with a bit of thrill....my pain barrier is high....but after aprox. 20 minutes i had to stand up and go to the back porch,because the movie is so trashy (in the very bad way..not like trashy but GOOD..acting,script,etc)...even my girlfriend came in a few minutes later...what a sick-making movie..waste of time and lost of good mood !!\nCONCLUSION : Don´t watch this movie,...its completely rubbish and disgustig\nin every sense,trust me ( i can´t remember watch a movie wich is even more worse)","user":"bennbumm","rank":[10,12]}]