[{"title":"Lighten up folks....not terrible","rating":6,"date":"14 March 2019","review":"Wow, three are some harsh critics out there. It wasn't one I would watch again, but it was enjoyable enough.","user":"michellepugh-964-461455","rank":[21,28]},{"title":"Mediocre thriller that misses the mark","rating":6,"date":"22 July 2017","review":"Without giving too much away about the story line and plot, I will say it appears after many years of the \"Super Hero\" Bruce Willis we know, it seems he is portraying more and more \"Bad guy\" roles.<br><br>This is not to say I don't like Bruce in the Bad guy role. It just seems he's done a 180° on his previous typecast Good guy persona's. That said, this film had the potential to be very good. It lost that opportunity (for me), about 30 mins in. <br><br>This is a story of a man taking his wife and son to the country to bond with his son and teach him some lessons in being a man. The way he goes about it is ridiculous, but I will leave that to others to decide. The plot unfolds in a somewhat unique way then follows the typical Hollywood theme of an innocent stumbling on a corrupt situation and inadvertently getting involved and in way over his head.<br><br>The tea of the movie plays out like a predictable and so so novel. I have the film a 6/10 for a few good scenes and acting was above par. The film is palatable but nothing to write home about. If your in the mood for a light thriller and are a Bruce Wilis fan, then it's worth a watch. Otherwise, don't go into it with high expectations.","user":"stephenw-30180","rank":[40,59]},{"title":"Just BAD. Very bad.","rating":3,"date":"27 July 2017","review":"As someone who enjoys watching movies (and relies on IMDb fraternity) I am writing this as my 'paying my dues' to my fellow sufferers. I watched this movie, not motivated by anything except the premise looked OK. I was not in the least bit influenced either way by seeing Bruce Willis in the cast (he had his best part in Pulp Fiction and everything has been downhill since) and did not even recognize who the lead actor was (Hayden who?). Boy, was I in for some serious disappointment.<br><br>The story is not original, but OK. There are tons of corrupt cops in this world although to be fair it is not immediately apparent that the entire PD (or Sheriff's Dept or whatever) was in cahoot with some bad guy doing bad stuff. The acting is uniformly bad, so bad that you actually root for the evident bad guy who is taking hostage and stuff. His portrayal of the semi-bad guy is semi convincing, the rest just awful, amateurish. And that is insulting amateurs everywhere. The kid does a decent job and there is a decent message on bullying. What the woman (mother of the child) was doing in the movie will remain a mystery (my theory is she is the Director's fiancé or the producer's mistress). <br><br>Back to the movie- the cinematography is bland, uninspiring. The chase on the quad- bikes through the forest as convincing as the Obama's 'you can keep your doctor'. The plot is made more threadbare by the repeated back and forth trying to protect the plot. And it does not succeed at any level. The leading man is slightly less charismatic than a wet cardboard show-box or three-day old stale pizza slice with anchovies on it. If he qualifies as an actor (and gets paid for it), we all have hopes.<br><br>Bruce Willis is abysmal at best. He needs to either pack it in or try acting. I assume that is what he was paid to do (unless it was his 'Star' name that would 'bring bums on seats'). The music score- someone else said- it is absent at key moments, and atrocious when present. I could not say it better.<br><br>Having wasted about 90 minutes watching it- why am I wasting another 15 writing about this? Because, I care. About my movie going brethren. It was a choice, a bad choice, like many others I have made in life. No one forced me to. I did not have full information and my choice, although turned out to be unwise, was not coerced. You, my friends, now have no excuse. <br><br>Final word: Sucks!","user":"spsarkar","rank":[49,78]}]