[{"title":"A stand-up and be counted old-fashioned wuxia flick","rating":6,"date":"18 August 2016","review":"The story is too straight without any guile. Set in 1914 following the collapse of the Qing dynasty, the film tells the story of a group of villagers standing up to a cruel young warlord. It stands knee deep in hero-talk, melodrama and posturing. The story is not memorable but it hearkens me back to the Shaw classic no-nonsense wuxia films of the yester-years. Those are great years. <br><br>Sean Lau, the ever dependable actor, makes all the skull-numbing hero-speeches feel like nuggets of wisdom. Eddie Peng actually has a slight breakthrough with his wandering hobo character, adding delightful charm and comic relief. Wu Jing, who proved in SPL 2 that he can carry a movie on his own, puts in an unstated performance. His and Peng's back story is one of the highlights of the movie. Louis Koo, probably HK's busiest actor, lays on the ham with extra cheese and froth. His portrayal of the warlord nearly crosses into parody. But please take my words with a pinch of salt because I probably don't know anything. When Koo finally gets his comeuppance, the people around me were actually cheering. <br><br>The one thing I hate the most in kungfu movies is the CGI-created landscape and all the impossible kungfu moves made possible by CGI. Special effects is the shite in martial arts films. Call of Heroes doesn't do that and it is good old action stunt work and wire-fu. Sammo Hung's action choreography here is excellent. There are two particular set-pieces, a fight on a bamboo-cage bridge and one on a mountain of clay urns, that are stand-outs. <br><br>The studios don't make movies like this anymore - a stand-up and be counted old- fashioned wuxia flick.","user":"ctowyi","rank":[7,9]},{"title":"I thoroughly enjoyed this film! It featured some excellent tough guy posturing moments!","rating":9,"date":"9 December 2016","review":"Call of Heroes has been on my radar for a long time. Lau Ching Wan is one of my favorite Hong Kong actors, probably only behind the legendary Chow Yun Fat. Then I started reading some reviews that made some comparisons to Rio Bravo and Kurosawa. I got even more excited! But could it now live up to my ever-heightened expectations?!? I am proud to report that I thoroughly enjoyed the film, somehow meeting my expectations and in some ways surpassing them.<br><br>Don't get me wrong, I'm not saying that Call of Heroes is a perfect film. I am saying that when it was over, I told my wife that I had enjoyed the film immensely and she wholeheartedly agreed. This is what I call a crowd pleasing entertainment! It was funny at times, quite unexpectedly shocking at other times; it had some really good action scenes, and I always like some good tough guy posturing, and it had that in spades. For the positives, I would start with Eddie Peng's somewhat scruffy and amusing performance as the Monkey King hero. The performance is broad to be sure, but very likable, and I now count myself a fan of Eddie. I've already professed my biased fanboy status for Lau Ching Wan, but he brings the necessary gravitas and strength to his role as the sheriff / guardian of the city. He could probably play this role in his sleep, but I do think he brought some good stuff to the table. The primary negative to me was Louis Koo's over the top performance. I like Louis but his performance seemed a little overboard, even in a movie like this. That being said, his initial arrival in town is one of the more surprising scenes in my recent cinematic universe. I won't say anymore about that! <br><br>A fun movie filled with broad performances, some unexpectedly surprising events, and over the top action sequences, Call of Heroes is one of the more entertaining movies I've seen this year!","user":"bcrain-223-578051","rank":[6,8]},{"title":"Strong character drama and compelling performances make this refreshingly old-school martial-arts blockbuster of heroism amidst oppression gripping, poignant and resonant","rating":11,"date":"11 August 2016","review":"With China's film industry in the throes of a CGI craze (think the most recent 'League of Gods'), it is almost refreshing to see a traditional martial arts blockbuster like 'Call of Heroes' that doesn't substitute the authenticity of real sets or props for computer-generated ones. That means the whip you see Lau Ching Wan crack on screen as the commander of a small group of guardians for the besieged city of Pucheng is every inch real, for which Lau went through a month of rigorous training to prepare for. It also means the city Pucheng where most of the action is set is also filmed against an actual set, which took its director Benny Chan almost five months to build. Even more comforting is the fact that Chan (who takes top screen writing credit here among four other co- writers) understands the importance of a good story and strong characters, and uses both to craft a compelling Western about justice and its enforcement.<br><br>Oh yes, lest it doesn't seem apparent from the grave expressions of its lead cast on the poster or its action-packed trailers, Chan has modelled his film firmly on the genre tropes of the classic Western. The opening scene establishes Eddie Peng's Ma Feng as the mysterious wanderer with a tongue-in-cheek sense of humour, awoken from his post-lunch stupor at a secluded diner by a stuttering bandit in the midst of robbing its owners as well as the other patrons. True enough, after the requisite character introduction to Lau's Sheriff Yang Kenan, Ma Feng rides into the town of Pucheng claiming to have no purpose other than follow wherever his horse (which he names 'Taiping' or 'world peace' in Chinese) takes him. <br><br>Though sequestered in a deep valley, Pucheng is under threat of invasion by a ruthless warlord Cao Ying, whose equally cold-blooded son General Cao Shaolun (Louis Koo) had mercilessly slaughtered the villagers where Miss Bai and her students had fled from and is preparing to repeat the deed. The army protecting their village has been called into battle with General Cao's men at the frontlines, leaving the security of Pucheng to Sheriff Yang and his band of guardians. <br><br>It is all but clear to Sheriff Yang that Shaolun – who rides into town alone at the crack of dawn and proceeds to kill three people in cold blood – intends to be caught, and is only playing on the minds of Pucheng's ordinary citizens as well as its law enforcement to see how far they would go to save their own skins. His general Zhang Yi (Wu Jing) interrupts his trial in open court to demand as much, with the ultimatum that he will lead their junior commandant Shaolun's army to invade the village and rescue him if he is not released by daybreak the very next morning. <br><br>To Sheriff Yang, the choice is clear – there can be no justice if it is not enforced – so threat or no threat, Shaolun will hang for his crimes. Yet after an attempted prison break led by two of General Zhang Yi's subordinates leaves two of Sheriff Yang's guardians dead, the villagers are left even more cowed by the threat of complete annihilation, turning up en masse to petition Sheriff Yang to release the prisoner in the hope of avoiding war. Therein lies Sheriff Yang's moral and professional dilemma as well as the movie's central theme – justice at what costs and to what extents – which is fleshed out poignantly thanks to Chan's compelling storytelling and his actor Lau's commanding multi-layered performance.<br><br>In the same vein, Ma Feng's choice will also be ethical – stay and defend Pucheng alongside Sheriff Yang or simply leave and let them fend by their own defences? Bearing in mind the titular call, it isn't hard to guess which Ma Feng eventually chooses, especially after we learn of his past with General Zhang Yi. That history also adds texture and depth to their one-on-one showdown at the end – more than just a battle of Eddie's twin swords and Wu Jing's spear, it is their 'brotherhood' which is also put to the test. That the clash between the two martial-arts trained actors bristles with ferocity and nail-biting tension is testament to Sammo Hung's action direction, which complements the robust character drama with four thrilling set- pieces. <br><br>As its title suggests, 'Call of Heroes' is a team effort where the whole is much bigger and better than the sum of its individual parts. Neither its story or the central theme is new, but Chan has fashioned a gripping period drama that reinforces the virtue of staying true to one's morals. As with his previous 'The White Storm', Chan's ensemble cast also deserves credit for the strength of their acting – and even Koo turns out a surprisingly inspired choice sneering and smarming as the heartless villain at the heart of the story. Like we said at the start, this is a refreshingly solid old-fashioned action-packed blockbuster that is also likely to be one of the best Chinese movies you'll see this year.","user":"moviexclusive","rank":[10,16]}]