[{"title":"Passable remake of a classic with an outdated, old-fashioned plot","rating":5,"date":"11 August 2017","review":"This is a remake of the 1991 classic Once a Thief, a John Woo gig featuring absolute A- Listers such as megastar Chow Yun-Fat, heartthrob Leslie Cheung and HK's own 'Marilyn Monroe' Cherie Chung. Due to skyrocketing talent fees the Chinese film industry experienced in recent years, it's now increasingly more difficult for a would-be blockbuster to assemble a large cast of A or B-Listers, so the cast of The Adventurers, starring Andy Lau, Hsu Chi (with her newly-wed husband Stephen Fung at the helm), Jean Reno among others, is already one of the most high profile releases of the summer in China, but even this cast pales in comparison with that of the original, which is a shame. Imagine if Pitt, Damon, Roberts were all replaced with notable but much less bankable stars in Ocean's Eleven. Like Clooney in Ocean's Eleven, Andy Lau's character also begins the film as a parolee after serving several years in prison. This is where the comparison stops, however, as Ocean's is without a doubt a much superior film.<br><br>The Adventurers maintains the original's 2 male 1 female 'gang of three' setup, complimented by Zhang Jingchu, who plays Andy Lau's ex-girlfriend, and Jean Reno, whose French cop chases after Andy Lau across Europe. Most of the film's humor is provided by actor Sha Yi, who perfectly portrays the superficiality of his 'tu hao' aka 'Nouvelle Riche' character who easily falls prey to Hsu Chi's stunning beauty. However, much of his lighlights were linguistic, and being a native Chinese myself, I doubt if these would cross over to the English speaking audience. Other than Sha Yi, one could make the point that the film lacks in terms of 'entertainment'. There are only a few funny moments I can recall, and most of the (limited) banter between members of the gang fell flat at my viewing.<br><br>The film benefits from fluid camera-work, so at least it's a fairly good looking film, but it's mostly held back by a plot that is way too predictable. There are several twists in the final act, none of them surprising. The action set pieces are solid but uninventive, as one questions whether it's wise to stick so closely to the original film's formula of car chases and gun fights, especially since the action/heist genre has advanced so much in the past two decades. Also, by focusing primarily on the action, the film somewhat sacrifices character development opportunities. Ocean's Eleven explains practically everything to its audiences, such as the group's funding, line of thinking, risks, etc. In The Adventurers, as I watched the group travel from one place to another and REACT to situations, I wondered how everything 'behind the scenes' worked, because these were never explained. In other words, there aren't many details for the keen eyed spectator to pick out. In this sense, this film's much closer to Ocean's Twelve in being a somewhat messy story that just kind of 'happens' without much external logic supporting it.<br><br>Overall, this is an OK adventure/heist film with beautiful visuals and a predictable, formulaic script that's not likely to make you awe in wonder. 6/10","user":"samzzz-69448","rank":[18,22]},{"title":"Cliché heist movie","rating":5,"date":"19 November 2017","review":"Watching The Adventurers is like watching every heist movie blend together so don't get your hope high when it starring Andy Lau and Jean Reno.The characters is poor written,the plot is so predictable that you can see every twist and turn from miles away but it not obnoxious to the point that it unwatchable.Watch Once a Thief if you want to see a better version of this movie","user":"phanthinga","rank":[9,10]},{"title":"Waste of talent without any adventure","rating":3,"date":"2 December 2017","review":"This could be a ripoff of any action thriller film released in the last 25 years. Andy Lau and Jean Reno are wasted here and give their worst performance from what I have seen. Not even a single thing is there that hasn't been shown in another film in a much better way. A lot of the dialogues and situations were laughable or else simply predictable. It's Shu Qi that made the film a little bearable even though the character isn't well written. There were some decent chase sequences too but overall very lacklustre and there is no adventure here.","user":"Jithindurden","rank":[10,14]}]