[{"title":"Secrets and demons","rating":2,"date":"9 August 2018","review":"'House of Demons' drew me into seeing it, with a cool poster/cover, an oddly interesting but very potentially silly premise and as someone with a general appreciation for horror. That it was low-budget, which from frequent personal experience is rarely a good sign due to that there are so many poor ones out there, made me though apprehensive as well as the low rating and poor reviews. <br><br>It is sadly however yet another film seen recently, hence some reiteration because the exact same strengths and flaws those films have are present here, that to me was incredibly disappointing considering its potential which it doesn't do anywhere near enough with. 'House of Demons' is an utter mess, with so many enormous problems. Hardly anything is good here and pretty much everything is wrong in a bad to appalling way.<br><br>Lets start with the couple of positives. The lighting is sometimes atmospheric and spooky. Likewise with the setting.<br><br>Whitney Moore also tries and the only one of the cast members to not be unwatchable.<br><br>Unfortunately, they are not done justice by the rather direct to video schlocky way it's shot and edited and the drab colour palette, so much so it was hard to appreciate it, it was very clear that the film was made in a rush with no care or enthusiasm. This is especially true for the chaotic and often incoherent editing, 'House of Demons' has to be down there as one of the worst edited films ever.<br><br>Going on further to the negatives, the story does feel paper thin, disjointed and over-stretched and some of it feels vague, under-explained in the last third where the film especially became duller, more predictable, more senseless and less scary. Too many characters are too sketchy, very shallow and with nowhere near enough to make one want to endear to them. Their annoying and illogical decision making and behaviours frustrates.<br><br>Making the film feel bland and forgettable with not enough heart put into The sound quality is obvious and utilised cheaply (being too loud in the build ups and people's reactions and dreadfully recorded), the music is needlessly melodramatic and it's best not mentioning the lumbering and histrionic acting that shows a huge indifference to the situation and what is going on as well veering into overwrought melodrama.<br><br>Dialogue can be stilted and rambling, with lots of clichés, and no depth whatsoever, while the pace goes to a standstill very quickly and drags on forever with very little going on worth caring about and useless padding, never recovering. This wouldn't have mattered quite as much if the character development was present or engaging, instead nowhere near enough is learnt about the characters, and the few attempts to do so are neither interesting or illuminating, actually dragging things down. Found too many of the supposedly shocking moments not surprising or unsettling and the supposedly sense of dread dreary. Due to the excessive obviousness, a lot of dumb and vague moments and explanations when attempted, the excessive melodrama and the lack of tension and suspense. Would not have minded the lack of originality (the film is extremely derivative and in a dumbed and watered down way), if the story and atmosphere were at least alright in execution, in reality they were both very poorly done.<br><br>A lot of 'House of Demons' has a lot of undercooked moments lacking in any development or depyj and often nonsensical and confusing character motivations, while too many of the things to make you shocked are far from creative or nail-biting and are pretty tame and easily foreseeable straight off the bat. The ending didn't satisfy and instead came over as dumb and the whole thing felt like an over-stretched-to-beyond-breaking-point short film.<br><br>There is not enough threat, and what there is of it tends to be used poorly and so laughably done it doesn't frighten at all. The film is completely unimaginative and more odd than creepy, with ridiculousness and implausibility being taken to the maximum extremes. Everything here is neither creative, suspenseful or nail-biting. Some badly sagging momentum too. The direction is leaden and like their heart was not in it or ill at ease, with the chemistry between the characters and actors coming over as constantly random and shallow. Suspense and creativity are zero, just non-stop predictability, monotony and dullness.<br><br>Overall, really poor. 2/10 Bethany Cox","user":"TheLittleSongbird","rank":[8,9]},{"title":"Truly Awful","rating":1,"date":"14 February 2018","review":"This film is an intelligible mess. Flash backs and cut aways in abundance with a Demon was just not gruesome or anything really and it was Demon and not Demons as the title suggested. The editing, Wow! it was like the rushes had been dropped on the floor and in a panic had been hurriedly put together whilst wearing oven gloves. I am sure someone smarter than me will point out what I have missed.","user":"bluedog-06340","rank":[13,17]},{"title":"Trip House","rating":1,"date":"8 February 2018","review":"The film swaps back and forth between the present and 1969 through the channeling of energy by Katrina (Whitney Moore ) and some LSD. Things blend and merge and is mainly concerned with a car accident where Santa Claus is not killed and a man becomes a mental vegetable. We also disjointed flashbacks to everyone's past and oh yeah, there is a demon and I am not sure what role the demon played in this confused mess. <br><br>Guide: F-word. No sex or nudity...just a spanking.","user":"nogodnomasters","rank":[10,13]}]