[{"title":"Greatly underrated film.","rating":8,"date":"3 March 2018","review":"Don't get me wrong, this film is far from perfect, but with an open mind and a pure enthusiasm for art, Marrowbone will definitely surprise you as a imperfect masterpiece.<br><br>To keep this review spoiler free, I cannot delve too deep into the plot or development of the characters, which sadly makes it hard to describe this film, as it truly is one of those unique films that completely surprises you, just when you think you have a grip on what's going on. To give you an idea, after watching this movie, the film [\"Split\"2017] came to mind. If you found that movie intriguing or in any way exciting to watch, this film will definitely have you asking for more.<br><br>If you're not into horrors and the trailer gave you the idea that this is some sort of \"scary\" movie with spirits and demons cursed upon a family, it really isn't. In fact, there is no ghosts or mythical beings in this film, it's just a pure chair-gripping horror/adventure movie with great storytelling and immensely superb acting.<br><br>That brings me to my final summary of why you should watch this film. If you're purely into acting, the fine art of performing well behind camera, you will definitely admire this film as a pure masterpiece. All the actors were extremely impressive at their role, each portraying emotion and understanding of their character at such depth. That being said, George MacKay, playing the role of \"Jack\", were definitely on a level of his own and in my opinion, deserved a best actor nomination. He truly brought his character alive with his complete understanding of the raw emotions that had be precisely portrayed.<br><br>It is sad to see how such a great film with admirable storytelling and top class acting can be so greatly underrated. In my opinion, this film deserves no less than a 8/10.","user":"johnoconnor-26740","rank":[87,107]},{"title":"Family is everything.","rating":8,"date":"22 February 2018","review":"Opening Scenes Preview:<br><br>MARROWBONE opens with a narrating voice, who we soon discover is the character Jack, describing the arrival of his family at their new home. We are told that they have come a very long way, across an ocean, and that they have endured many difficulties to arrive at what they hope will be a safe haven for them. There are 5 in the family; Jack, the eldest, Billy, Jane, Sam, the youngest who seems to be about five years old, and Rose, their mother. The choice of this home was not an accident; we are told that it was Rose's childhood home and has been standing empty for 30 years.<br><br>Apparently the family's life to this point has been horrific because Rose draws a line in the dust on the floor and proclaims that once they cross it, their lives will begin anew in all ways and that they will forget their former life altogether. They even change their surname to MARROWBONE.<br><br>But we are given to know that the past may not allow itself to be forgotten. There are references to a \"he\" and a \"him\" that casts a shadow over the family and their new life, and there is the possibility that \"he\" could become more than a terrifying possibility.<br><br>But the family settles in to their new home and life soon seems idyllic. Wherever this house is, the shore of the sea is close at hand. Even though they have no close neighbor, they do make a new friend, a young girl named Allie, a very friendly kindred spirit, who immediately seems to become \"one of the family\". The carefree, sunny summer days slide by.<br><br>Sadly, there is more than one shadow upon the family. Rose has an unnamed disease, and the trip from England has taken her last bit of strength to fight against it. As she lies upon her death bed, and in private, she gives Jack her last instructions and important points on how to care for the family in her absence. Rose is to be buried in the garden at a place she has already specified. Jack must do his best to keep the family secret and hidden until he turns 21 or they will be split apart. Have a safe place in case \"he\" finds them. Lastly, there is a tin container holding a large sum of money that Rose took from the shadowy \"he\". Jack is shocked at this last item because Rose apparently lied in court to keep it. But before he can object he sees that Rose, his mother, is gone. The last of her instructions Jack reads aloud to the family from a note left with the tin of money.<br><br>The four children proclaim an oath of unbreakable family bonds literally over the body of their mother, swearing that \"nothing and no one\" will ever be permitted to tear the family apart.<br><br>But as luck would have it, not long after Rose's death, the terrifying \"he\" becomes far more substantial. He announces his presence by firing a shot through a window next to Jane from all the way across a meadow. In stark terror, Jane shrieks for Jack.<br><br>But in the very next scene, which we are told is 6 months later, everything seems to be fine, surprisingly. Aside from an annoying legal representative whose pointy-headed inquisitiveness perpetually threatens to \"out\" the hiding family, things seem to be going surprisingly well.<br><br>Although...<br><br>There is now talk of a ghost in the house. The mirrors are all covered. There is something that menaces from above the ceiling...<br><br>Review:<br><br>Very surprising to me is the fact that this is a Spanish-made movie through and through. It's filming locations were Terrassa, Barcelona, Catalonia, Spain, and all of the credits and any subtitles are entirely in Spanish. For example, \"six months later\" appears on the screen as \"seis meses más tarde\". And yet the entire context of the movie is mid to late sixties America, all the dialogue is entirely in English, and absolutely no dubbing has taken place. As far as I can tell, the depicted Americana is pretty much flawless. First time I've ever seen something like this.<br><br>While others have complained of the lack of originality in MARROWBONE, as I have mentioned in other reviews, this is never a problem for me. Considering how many thousands of supernatural/horror pictures have been made by now, it's my position that it's utterly unreasonable to expect true novelty/originality of a horror picture at this point. There are very few completely novel roller coasters or firework shows in my experience, and yet I still like to ride them/see them. A well-done horror picture is a thing of beauty even if it can't be completely new. And to those who incessantly prattle about \"originality\", if you insist upon limiting your sense of pleasure to only new experiences, do make a point of never getting married. You will be sharply disappointed.<br><br>So, no, you will see nothing entirely original in MARROWBONE, but the execution of these tropes was so well done that I didn't catch on until late in the game. Additionally, there are many plot points that specifically support some of the more difficult-to-believe story elements, in contrast to the many horror pictures whose plot lines collide with their tropes, leaving large holes. When you find yourself disbelieving the lengths to which Jack will go to keep the family \"together\", one way or another, think back to the admonitions of Rose on her deathbed and the solemn swearing ceremony over her dead body. Jack truly was obsessed with keeping the family together. In whatever way he could...<br><br>Early on in the picture I remember thinking that the character Allie, while not exactly beautiful, most certainly has a face and personality that would be virtually impossible not to love. The fact that the very, very ending of the movie is incredibly sweet and utterly unrealistic is entirely in keeping with that thought. Exceptionally charming, I also thought sadly, \"Well, THAT would never happen.\"<br><br>If utter originality is NOT your reason for living and you are able to enjoy a delicious dish more than once, you should give MORROWBONE a watch. It's exceptionally well done and has a heart wrenching, bittersweet ending.","user":"S_Soma","rank":[66,83]},{"title":"A horror movie that can get to you heart","rating":10,"date":"25 February 2018","review":"I have watched this movie with zero expectations, If i'm honest I was just looking for an ok movie to watch on a Saturday night, but this movie was a lot more of that.\nTo begin with the plot kept me in the edge of my seat during the whole movie, also it has an amazing set of characters that were brightly played by all the actors/actresses despite, in some cases, the young age.\nThis is an unforgettable movie that will make your eyes go wet. I will totally recommend this movie.","user":"MathiasPera20","rank":[68,87]}]