[{"title":"A stupid, highly annoying, and unoriginal film.","rating":2,"date":"20 November 2018","review":"For some reason, some animation studios think that garden gnomes make interesting movie characters. I don't know why they do, but they keep making movies on these things and have put them as the main focus. The truth is with garden gnomes is that they don't make interesting movie characters since they are essentially decorations you put on you lawn. There's really not much to go off of with these things. Most people may know about animated gnomes in \"Gnomeo and Juliet\" and its sequel \"Sherlock Gnomes\", but there's another animated movie focusing on garden gnomes and it's far worse than those two movies put together. It's called \"Gnome Alone\" and it's made by the studio that made \"Happily N'ever After\" and the director of \"The Nut Job\". If that sounds like a disaster waiting to happen, you'd be right. Like \"Duck Duck Goose\", this was initially intended for theaters, but went straight to Netflix instead and I'm really glad I didn't see it in theaters. It may not be as horrendous as \"Duck Duck Goose\" was, but it still was really hard to get through.<br><br>A young girl named Chloe (Becky G) and her mom (Tara Strong) have moved into an old creepy house in a town called Tenderville (yes, really). When they arrive, Chloe finds weird garden gnomes positioned randomly around the house and she also finds a weird green crystal inside a secret door which she uses to make into a necklace. After she gives the necklace to a popular girl in the school named Brittany (Olivia Holt) in order to become her friend, Chloe soon discovers that the crystal called the Keystone was actually important to the house since the latter unleashes a portal to a world where round purple creatures which are always hungry called Troggs come through. It is also revealed that those weird garden gnomes are actually alive where one named Zook (George Lopez) tells her that the gnomes have been protecting the world by keeping the Troggs in their own dimension and they need the Keystone in order to set things right. Also entangled up in this battle is a nerd next door named Liam (Josh Peck) who has been trying to become friends with Chloe. It's now up to them to take down these creatures and save the world which would be interesting if I cared about this movie, and I don't.<br><br>This film really was annoying. I really struggled to sit through it in one sitting because I kept getting annoyed by it. The story was completely unoriginal as it's another movie where two kids save the world from danger with the help of unlikely companions. We've been there and done that so many times that I'm pretty annoyed by it. It's also wildly uncreative. There's barely a single thing original in it. The house they move in to looks creepy like usual, Chloe and Liam don't immediately become friends at first but then warm up, even the trait where Chloe wants to be liked by the popular girls is so old. This movie also has lots of film references as well. This movie loved to quote films like \"Lord of the Rings\" and \"Aliens\" for no reason except that they're popular movie quotes. It quickly got under my skin fast. The animation was also pretty bad. The computer animation looked like plastic and barely had any charm to it. The character designs looked pretty unoriginal and the garden gnomes came off as more ugly than they did cute. Speaking of characters, none of them were likable. Chloe was always too obsessed with her phone and came off as annoying for a protagonist and the garden gnomes were all terrible. Not one of them was likable as they were all stupid, mean, and unfunny and the less said about Brittany and her friends the better. Liam was probably the closest character that came off as likable. Then again, I do tend to like Josh Peck at times and him playing a nerd was kind of funny but that's really not saying a lot if anything at all. Also, if you're wondering why it's called \"Gnome Alone\", it's because Chloe is left alone at the house all day because her mom is out of town with work stuff though it might be because Tara Strong wanted very little to do with this movie. I really don't blame her.<br><br>\"Gnome Alone\" is just an annoying and stupid movie. The story was stupid and annoying as ever, the animation was bad and looked ugly, and most of the characters came off as bland and basic. There's really not much I can say for this movie except that you should avoid it. It doesn't do anything new or noteworthy and there is much better stuff to watch on Netflix than this. It's not worth eighty minutes of your life.","user":"Animated_Antic","rank":[12,16]},{"title":"Give it a chance, kids loved it, very cute.","rating":9,"date":"20 October 2018","review":"I'm not sure why so many people are voting this so negatively. And honestly a lot of the reviews seem like the users didn't actually watch the movie. Let's go through the list of complaints from users... No spoilers.<br><br><ul><li>animation/cgi = I thought it was perfect, cute and great and can even compete with some other big movies with this art style. Great colors, lines, borders, reflections, particles, hair... There's literally nothing to complain about the cgi/animation.</li></ul><br><br><ul><li>characters/back story/development = This is a relatively short movie. So cramming in the entire back story, characters and over all feel/direction of the movie can be tough. But I think it nailed it. Again, it's cute. The characters are all likeable and enjoyable. They all grow and develop. And for the person claiming them oozing the troggs is killing them? Did you even watch the movie? And there's some great jokes and the over all comedic feel and timing is pretty spot on!</li></ul><br><br><ul><li>music = great choices. My kids literally got up and danced with every song. They're 6 and 3.</li></ul><br><br>Take this movie for what it is. A cute, funny, wholesome kids movie.","user":"tootall-91079","rank":[15,22]},{"title":"Generally unexciting","rating":2,"date":"20 October 2018","review":"In terms of visuals, I liked this movie. It was an overall smooth animation style, and, hey, by comparison to what else is around it's pretty good. That being said it's about the only redeeming factor.<br><br>In terms of writing the characters are very one-dimensional. None are likable, and honestly I'm a little surprised at some of the choices made. Chloe is very cliche for a character who has \"moved around all her life with no time anywhere to make new friends and yet finds a true friend at her latest home\". (Granted every character is pretty cliche.) She's also pretty narcissistic and that doesn't entirely change. Also Liam is a conundrum. For a day and age when we are trying to teach everyone that \"no means no\" the writers chose to create the most annoying and pushy male character I've ever seen that we're supposed to root for. And despite his pushy behavior and inability to take \"no\" for an answer, he ends up getting what he wants, that being the girl. It's really weird.<br><br>Not very memorable in the end. Can't say I'd recommend it or watch it again.","user":"lunalovitt","rank":[14,21]}]