[{"title":"Quite funny and very well animated","rating":9,"date":"23 June 2018","review":"An excellent set of 3 tales which the entire audience, adults as well as children, seemed to enjoy very much, both times I went to see it. Beautifully animated and drawn, very expressive, enjoyable, good narrative twists and comic situations, a nice change from 3D often look-alike animation &amp; humor, very good voice acting and sweet and funny stories.","user":"esteryn","rank":[12,13]},{"title":"Harmless, really funny, and quite endearing","rating":9,"date":"21 October 2018","review":"I noticed that the Gene Siskel Film Center was playing a subtitled version of this movie, which I had on my watchlist. Because I just couldn't turn down the opportunity, I managed to bring my father along for the trip. We were able to get to the GSFC just in time, and had ourselves quite the blast; here's why.<br><br>The story is an anthology trio, with the second one concerning the titular Big Bad Fox. The first concerns the delivery of a baby named Pauline by a trio of the farm's animals after a stork feigns wing injury, while the third concerns the same trio searching for (and later saving) Father Christmas. While the stories aren't really connected besides a play that functions as intermission between the segments, they actually each stand out individually with funny writing, fascinating twists, and rather strange ideas that turn out warming. I was actually smiling for most of the movie because when its humor wasn't jabbing at my funny bones, its pacing and action were delightful. When it comes to the characters, we have the old gruff Dog who is incompetent at protecting the hens, the trio of a duck, rabbit, and pig who deliver Pauline and save Father Christmas despite their conflicting behaviors resulting in shenanigans, and the titular Fox who idolizes and is mentored by Wolf. We have protective mothers in the Hens, and oblivion in their chicks, resulting in the main strange idea of this movie: children can have biological AND step-mothers simultaneously, live happily with both, and see both of them frequently. It gives segment 2 an unexpected ending considering its synopsis and setup. Simply put, while the characters are slightly more on the simpler side in terms of design, the way they are cast and written make them stand out very well. The animation seems somewhat limited in terms of its movements, but the slapstick and comedic timing are really enhanced by its stretchier style on the animals. For a film produced on a budget of less than $10 million, it could have looked significantly worse, but its ability to convey the humor, action, and overall tone of this film helps it be a prime example of French animation.<br><br>This is a movie that I can recommend to any family; it has nothing objectionable and its violence is mere slapstick (it actually comes off funnier than many big name studios' attempts to pull it off in their films). In the GSFC I could hear adults and children alike laughing at its humor, which I find is a signal of a film worthy as a comedy for families. I also recommend it for anyone who likes animation, French movies, or obscurity. I want to use this review to thank GKIDS for subtitling yet another amazing movie, and distributing it here for families. It's not just our companies who can produce great children's movies, and GKIDS has rightfully carried this out once again.","user":"datautisticgamer-74853","rank":[7,7]},{"title":"Awesome","rating":10,"date":"21 July 2019","review":"One of the best comedy animation movie i have ever watched","user":"sithumperera","rank":[5,5]}]