[{"title":"I liked it but I wanted to love it","rating":7,"date":"10 May 2019","review":"I've loved Pokémon my whole life and this was the most excited about Pokemon developments since Pokemon go. Whilst there is nothing to hate about the film I couldn't describe it as more than reasonably good and mildly enjoyable where as I was hoping to be blown away throughout. Having said that I'm excited to see where the franchise goes movie wise in the future as it certainly has potential.","user":"muamba_eats_toast","rank":[324,400]},{"title":"Fun movie, awkward story","rating":6,"date":"14 May 2019","review":"This movie is fun for audiences. Seeing Pokémon come to life is a must see for this movie. The only downfall is the storyline. The plot is very predictable and the ending is horrible. Ryan Reynolds being the dad all along was very weak. It ruined Detective Pikachu's charm.","user":"wintercript","rank":[112,163]},{"title":"Really fun, great movie!","rating":10,"date":"4 May 2019","review":"We saw this movie at one of the AMC early preview shows on May 2nd, and I'm so glad we did.\nWhy? Because \"video game movies\" are something that historically were a \"wait til it's on TV\" type of thing - no real reason to see them on the big screen; they weren't much different than the games they came from.\nDetective Pikachu, on the other hand, is an actual movie. Yes, it's set in a world where Pokémon actually exist, and this one can talk to both humans and Pokémon (Doctor Doolittle, anyone?), but unlike a \"video game movie\", the plot isn't just a vehicle for the setting. It's an actual mystery/adventure, with characters you come to care about, both human and not. Twists and surprises and feels. All the parts of a great flick.\nOne thing that surprised me was how I was amazed by the emotions expressed by the Pikachu character - not only did he feel \"real\" in the movie, his face, ears, body language conveyed emotion clearly and strongly. It's hard to explain, it was kind of like a cross between looking at a child and a puppy... I don't know how they did it, but when Pikachu was saddened, you *felt* it; when happy, you knew it...\nFinally, I also do have to say that all of us were concerned about the \"Deadpool factor\" - which turned out to be a non-issue. Ryan Reynolds is a great actor, and like any great actor, you only see and hear the character he's playing - not his past ones.\nExcellent movie for all ages, even if you're not a Pokémon fan, you'll enjoy it.","user":"frodo-53","rank":[255,400]}]