[{"title":"Seriously?","rating":1,"date":"4 November 2017","review":"Let me start by saying that I am a Christian and I love a good movie that promotes the Christian faith and what Christians are all about. It's so hard to judge these movies by reviews, because so many Christian haters will leave bad reviews just to keep the movie from being a success. That being said, I went and saw the movie for myself.<br><br>I had reservations, because I saw the train-wreck of a Christian movie last made with Kevin Sorbo (God is Not Dead). I hoped that this movie would be different. It wasn't. Let's get something straight. There's are great Christian based movies and there are horrible ones. Some of the great ones that don't sanctimoniously preach, but let Christianity speak for itself, are \"God is for Real,\" \"Jesus of Nazareth, \"The Passion,\" and \"Risen.\" Even low budget movies like \"The Encounter\" hit the right chord. Among the bad ones are the two from Sorbo \"God is Not Dead,\" and \"Let There be Light.\" What makes this movie bad? I think littleangelik's review pretty much sums it up with \"results are often hokey and creates an us against them mentality.\" That and the fact that someone decided that the script must have the word \"Isis\" in it at least 200 times.<br><br>To start with, the movie tries too hard. Yeah, we get it: Isis is bad. We don't need to movie to constantly tell us that. Yeah, we get it: Sorbo's character is a drunk. We don't need to see him drinking five drinks at a time to know that. This movie insults the intelligence of all its viewers by thinking they are stupid and can't understand a subtle concept and that the people watching must have the point drilled into their heads until their brains spill out. They also try too hard to prove that Christianity is great. Well, guess what? Christianity is great. So it can speak for itself. Pushing so hard in such a sanctimonious manner is not going to bring people closer to Christ. Instead it will push them away. The attitude of non-Christians will be that \"The lady doth protests too much. Me thinks.\" Even open minded people will think, \"Yeah, everything I heard about Christians is right. They are elitist, sanctimonious, hypocrites.\" Then there is the aspect of realism. There isn't any. A drunk who cannot stay away from the bottle for any waking moment can somehow sit in front of a computer and concentrate on writing a best seller(?) I think not. An atheist goes from not believing to being a religious zealot with the flip of a switch(?) I think not. Sorbo is clinically dead for four minutes and has a serious life threatening blood clot, but the hospital doesn't even keep him overnight. Absolutely not. Then there is the character of the ex-wife. She is all over the place. She goes from being totally hostile to Sorbo (won't hold Sorbo's jacket when he is in a wheelchair and gets upset with being compared to the shrew when Sorbo playfully quotes a line from \"The Taming of the Shrew\") to holding him so he can sleep and accepting his proposal to re-marry her merely days after he becomes a believer.<br><br>I took a chance and really wanted to support a good Christian movie, because I heard Sean Hannity say this was such a movie. Unfortunately, it was not. The movie was merely a shameless exploitation of God and Jesus for the sake of making some money. Hannity was never my favorite talk show host anyway. In fact, I only listen to him because nobody else that's any good is on in New York during his time slot. Now I don't think I'll waste my time with this guy at all. He obviously doesn't believe in what he says and promoted this movie for the sole purpose of making a buck. How I long for the days when Rush Limbaugh was followed by the late, great, Bob Grant.","user":"nysalesman","rank":[95,163]},{"title":"Hilariously Awful","rating":1,"date":"7 November 2017","review":"Chock full of the favorite myths of Christians about non-Christians, this groaner just serves to preach to the already bloated egos of its choir. The plot is boring and predictable, the main character a laughable caricature, and the writing falls right in with the current political climate in encouraging people to give in to hate and fear of the \"other\". That the acting is so poor is almost forgivable considering the script. Among the ridiculous straw men: atheist who is really just a misotheist who \"hates god\" after a personal tragedy, atheist who converts on deathbed, atheist who cares only about drinking and partying and mocking people, atheist who somehow magically discards all reason for mythical thinking with no impetus whatsoever. I'd find it absurd if so many Christians didn't actually believe this rubbish.","user":"sjgeer","rank":[121,213]},{"title":"Brainwashing Rubbish","rating":1,"date":"5 November 2017","review":"Why do American christians have to portray atheists as unhappy and lost? What absolute rubbish! We're happy, fulfilled, we live our lives to the fullest because we're only here once, we do good things and we help others regardless of their beliefs. We're also great parents, raising wonderful children to be amazing adults, but oh no...an American Christian movie always portrays an atheist parent as a bad parent. This movie makes an atheist look miserable. Garbage brainwashing or a pitiful attempt to validate their own religion, but it's pathetic to what lengths christians will go to in order to feel better about themselves. This movie and it's message is pumped up arrogance. Religion doesn't teach people to be decent. Everyone I know is kind, decent and caring for family and strangers, yet by the comments I see apparently christians believe we're not. Meanwhile, evangelists have one sex scandal after another. No wonder people find American christians annoying, such arrogance and ignorance about others.","user":"hilary_mae-912-80561","rank":[154,276]}]