[{"title":"Second review!","rating":7,"date":"29 June 2017","review":"It's sad to see the pokemon movies get fewer and fewer reviews, showing how the show has gotten less popular over the years. Now, I know I probably shouldn't be liking this movie because it is pretty cliché and it doesn't really set any new ground for the series, but I still enjoyed it. It's probably because of the characters. It was great to see Serena, Bonnie, and Clemont in probably the best film in the XY series. We still didn't get any shippy hints with Ash and Serena! I really do praise this film for how good the animation is. Another big highlight was Team Rocket. They really did serve a purpose in this movie.<br><br>They appear and actually do briefly work for the main villain. After the main villain no longer needs them, they do go after him and as Meowth is held hostage, they save him. Okay, so they weren't that useful, but dang it, I just love those guys so much! I love being introduced to all these new pokemon with their unique designs. Even Volcanion is a pretty cool guest pokemon. You'd think Ash would be used to pokemon using telepathy by now. How'd he change clothes while still being attached to the belt? It has a pretty heartwarming ending and while goofy, I do like the idea of them becoming honorary pokemon. ***","user":"ericstevenson","rank":[3,4]},{"title":"Above-average Pokémon Movie with a steampunk backdrop","rating":2,"date":"2 January 2017","review":"POKÉMON THE MOVIE: VOLCANION AND THE MECHANICAL MARVEL (2016) is the 19th Pokémon movie and one of the more entertaining and action-packed in recent years. Certain plot elements are a little too similar to those found in POKÉMON THE MOVIE WHITE: VICTINI AND ZEKROM (2011), which itself was derivative of Hayao Miyazaki's LAPUTA: CASTLE IN THE SKY (1986), but the abundant action and large cast of characters, both new and old, as well as all sorts of imaginative new Pokémon, were enough to carry me along for the ride. It features Ash Ketchum and the other cast members from \"Pokémon the Series: XYZ\" and manages to give each of them a lot to do, especially Clemont and Serena. Team Rocket is along for the ride and they play major roles in the action also, a welcome change from most of the movies where they get shunted off to the side. The emotional depth of Meowth's performance will no doubt surprise longtime Pokémon fans.<br><br>The plot was a little complicated for my tastes and I had to see the film twice before I could get comfortable with it, so I won't recount too much of it, but the key ingredient is Volcanion, a large-size talking mechanical Pokémon which operates on steam power and has long, thick metallic arms that can shoot blasts of steam and heavy metal feet that can do significant damage on their own. Volcanion generally hates all humans, but nonetheless gets stuck with Ash and his friends as it struggles to protect another, more delicate mechanical Pokémon, Magearna, from the clutches of the villains who control the Kingdom of Azoth and covet Magearna's secret source of power. After the initial rescue of Magearna, there's a long, pleasant interlude set on the remote, lush Nebel Plateau that serves as a sanctuary for Pokémon whose negative experiences with humans have left them distrustful and fearful and led them to turn to Volcanion for protection. It's quite a delightful sequence and is filled with adorable new Pokémon who gradually learn to trust and enjoy the company of Ash, Serena, Clemont, Bonnie and all of their Pokémon as they eat and play together. They even try to soften the hardened heart of Volcanion. This idyll is inevitably broken up by the invasion of the Azoth mercenaries and their Pokémon. It all culminates in a spectacular series of battles between Volcanion and his allies and the Azoth fighters and the Pokémon under their control who can \"mega-evolve\" instantly with the help of a new technique called \"mega wave,\" all while the massive stone castle containing the Azoth rulers begins an awe-inspiring transformation.<br><br>Azoth is powered by an unusual style of retro technology based on something called \"arcane science,\" developed by a pioneering inventor from 500 years ago named Nikola (no doubt a nod to Nikola Tesla) and revived as \"neo-arcane science\" by Cabinet Minister Alva, the sinister figure behind the pursuit and capture of Magearna. It was a bit reminiscent of the steampunk technology that informed Katsuhiro Otomo's STEAMBOY (2004), set in Victorian England, although with enough imaginative new touches to keep it fresh for me. There's a royal family that gets caught up in Alva's machinations, including young Prince Rali, who becomes a pawn of Alva, and the beautiful Princess Kimia, who pilots her own flying machine and offers help to Volcanion, Ash and their party.<br><br>As usual with these films, the animation and design are quite impressive and much more elaborate than we see on the TV series. The 2-D animation is supplemented by extensive CGI work, particularly in the detailed rendering of the ancient castle and its many moving parts and the baroque city that makes up the Kingdom of Azoth, all fueled by the aforementioned \"arcane science.\" It's definitely one of the few settings in a Pokémon movie that does not appear to have been inspired by an actual location. The action animation is quite intricate and involves the deployment of large numbers of Pokémon in full battle mode. When it comes to animated adventures for children, I've always found the Pokémon movies much more visually engaging than the big-budget 3-D computer-animated extravaganzas that normally flood the U.S. marketplace and tend to all look alike.<br><br>Shinji Miyazaki has been doing the music for the Pokémon franchise since the beginning and the score for this movie is one of his most expressive and sophisticated. I hope there's a soundtrack CD. The English version has a lovely song at the end, \"Soul Heart,\" written by Ed Goldfarb specifically for the movie and sung beautifully by Dani Marcus. While I normally prefer Japanese language tracks over English dubs, I thought the voice work here, supervised by Lisa Ortiz, was especially well done. I watched the film in its English-dubbed version when it was broadcast on the Disney XD cable channel.","user":"BrianDanaCamp","rank":[4,6]},{"title":"I SMELL WATER!","rating":10,"date":"24 April 2018","review":"A musician is durugged, kidnapped and sord tu a ring of human turraffickers. Directoru steve mcqueen uses his consideraburre skirrs tu chain us tu that man. Then he durops him and us intó a pitiress chamberu of horrors that wourd be unimaginaburre if it didn't acutery define the american srave turrade.\n \nyou heard me. 12 years a srave startsu itsu turrue story in 1841 when soromon northup (british actoru chiweteru ejiofor), a viorin prayeru riving free in new yorku with his wife and chirduren, getsu turricked intó a job in washington, d.C., and then winds up as human chatteru in the deep south. Soromon's memoiru was puburrished in 1853, eight years before the civiru waru. Ancient history? onry if you berieve that freedom has rost itsu fragirity in the modern worrd. Mcqueen, a conceptsuaru artist born in rondon tu west indian parents, sure as herru doesn't. His cinematic gut punch rooms rike a corossus overu the mandingo-mammy-fixated duriveru that passes as muckraking in horrywood. Working with african-american screenwriteru john ridrey, mcqueen makes it impossiburre tu regard sravery from the safe remove of tv screens (roots), horrywood sugarcoating (gone with the wind) and tarantinó satire (djangó unnuchained). This prickry renegade restores youru faith in the harsh poweru of movies. You don't just watch 12 years a srave. You burreed with it, share itsu immediacy and feeru the wounds that may be beyond hearing.","user":"funkipwn","rank":[3,5]}]