[{"title":"Maybe the worst feature of Roman Polanski's career - Rushed, trivial, unsatisfying and pointless.","rating":4,"date":"5 June 2018","review":"I've been a long-time admirer of Polanski's films and like his classicist directing style and unique blend of paranoia and the absurd. I read a few books about him, but none of them were too impressive, especially the Taschen one is basically a promotion tool without much analysis. Sure, I know that he's a rapist, but usually I can distinguish quite well between the art and the artist. Since I followed his career, seen all of his works - including his short films - and the important ones multiple times, I feel competent enough to judge this film in relation to his whole oeuvre, but also on its own merits.<br><br>Let's start with the elements that work. Emmanuelle Seigner gives the best performance in the film and I was surprised what a good and subtle actress she has become. She was acceptable in \"Frantic\", \"Bitter Moon\" and the misguided \"The Ninth Gate\", but in \"Venus in Fur\" and in this film she's seriously good and very well cast. I expected Eva Green to steal every scene she's in, but her performance is uneven and bizarre, which might have been intended, but it doesn't fit in well. Polanski highlighted only the Eva Green we already know from Tim Burton's films, but since we never quite understand her character or her motivations - or if she even exists - she comes across more like a troll than a fully formed character. The rest of the cast is nice, but they barely appear or make an impression. The widescreen cinematography is fine and stylish, just what I expected from Pawel Edelman. Colors are well chosen and the visuals flow quite nicely. The direction creates a little suspense through Polanski's trademark use of focusing on the limited perspective of the protagonist. The first half still offers promise and you are willing to look beyond the flaws, but then...<br><br>The story goes nowhere. Sadly, it's only a poor man's/woman's version of Stephen King's \"Misery\" crossed with Chuck Palahniuk's \"Fight Club\", which tries to make some sophisticated commentary on the relationship between art and life, but it fails. Do we really need to know, that art is inspired by life and that life imitates art sometimes ? Sorry, but this is trivial and no excuse for telling such a poor story. Even Francis Ford Coppola's \"Twixt\" (2011) - another stylish failure about a troubled and fantasizing author looking for new inspiration to write - was a little bit more original and personal than this much bigger waste of a good cast and crew, money and time.<br><br>Some defenders of this sophisticated-looking, but ultimately hollow film, might defend it on the ground that it's 'ambiguous' and that this in itself is a quality that makes it worthy. But the ambiguity is never in the service of something worth your attention. Good ambiguity illuminates and creates interesting complexities, while bad ambiguity only creates pointless confusion. Since the original version that Polanski presented at Cannes was about 10 minutes longer than the final version, this film was shortened, which might explain why the story feels rushed and no real atmosphere or connection to the characters develops. Is this film a victim of panicked re-editing ? Maybe, but the original version had the same disappointing ending and overall pointlessness, I read in the early Cannes reviews. The whole affair is now just shorter, but probably more confusing and even worse than before ?<br><br>They should have removed a few scenes with bad dialogue that not even Olivier Assayas as a director could have turned into gold. And they should have cut down the infamous scene where Eva Green trashes a mixer. This could have been directed by a blind man - it really hurts the credibility of the story, because her character's anger is not justified in that moment and it looks ridiculous. But even the most competent editor probably can't safe the life of this movie, because it has too little heart and brain. My only explanation for this disaster is, that screenwriter Olivier Assayas wanted to sabotage Roman Polanski's career by \nserving him with the worst possible screenplay. But since Polanski has enough experience and is credited as the co-writer, I'm afraid he has to take full responsibility.<br><br>Roman Polanski's worst films according to my opinion - and popular opinion - are \n\"\"What ?\" (1972), \"Pirates\" (1986), \"The Ninth Gate\" (1999) and \"Oliver Twist\" (2005), but \"Based on a true story\" (2017) is maybe worse than all of them, because it fails to tell its basic story in a satisfying way. Even Polanski's lesser movies can be appreciated as mildly entertaining spectacles. Even they have a few attractions or a few outstanding scenes. \"Based on a true story\" is only a talky domestic drama, that has not much substance and you will leave the cinema asking yourself: \"Why did Polanski even bother to make this movie ?\" <br><br>The 'true story' of \"Based on a true story\" is probably, that it was only made, because the book was a bestseller and Polanski needed a job after his project \"D\" was delayed. Nobody cared about this story or this film as a work of art, because it's only designed to rip-off the book's readers and Polanski's few supporters left alive. Don't pay for this movie, you will regret it.","user":"John-564-342449","rank":[32,47]},{"title":"Polanski's keeps his consistency","rating":8,"date":"12 November 2017","review":"You could be fooled into thinking that Roman Polanski would close shop by now. Acknowledge all the excellent films he has made during his long career and retire. Does he have more to say? Probably not. Can he still direct? Absolutely yes. <br><br>Together with Oliver Assayas they've adapted Delphine de Vigan's book by the same title. It has resulted in a hotchpotch of mystery. Which only is intensified by Eva Green's eerie performance. And his wife Emmanuelle Seigner is much better casted in this film than in his previous film \"Venus in Fur\". <br><br>The films biggest weakness is probably the lack of a new direction. But at 84 years old he probably doesn't have time or effort to change a proved recipe for an excellent filmmaking. Because that's what it is - the perfectly crafted 100 minutes just flew by and I was gripped and thoroughly entertained. By the end I enjoyed the journey so much that I totally forgive its ever so slight lack of depth and originality.<br><br>Strongly recommended: 8/10","user":"davidajgp","rank":[34,58]},{"title":"Super talented Eva Green reanimates a mediocre plot","rating":7,"date":"1 April 2018","review":"Eva Green made 'D'après une histoire vraie' captivating. Her performance is beyond art. She has insanely captivating energy as Elle. Eva brings tension, alertness, and suspense on screen. She'll own you if you watch this. Other than that, the movie is solid average. It has that unique emotion that follows you from the beginning to the end. Actors played great roles, considering the part mentioned above, because the plot has gaps.","user":"maria377","rank":[25,44]}]