[{"title":"I like the talent involved, but better luck next time","rating":5,"date":"17 November 2017","review":"An unfortunate letdown. It pains me to say this because this had the potential to be very good. \"Kings\" is a story centered around the LA riots which occurred in the early 90's. It's told through the perspective of a family who find themselves in the middle of the intense event. There was set-up for great drama, but the end result is an uneven mess with little to no pay-off. This movie had the most abrupt and out of nowhere endings that I've seen all year. Early on we seem to be promised an emotional and riveting finale. And we never get that finale. It just sort of ends before the third act is taking shape. The first half of the film suffers a lot. I didn't form much of an attachment with the characters. The editing switches too quickly between people with little moments to breath and for you to get to know them. Besides, almost every scene during the first half consists of people yelling and talking over each other constantly. The pace is unfocused. You can only take so much loud shouting before your only wish is for people to calm down and be quiet for just a second. The silent or calmer scenes are precious because there are so few of them. Halle Berry gives a good performance and so does Daniel Craig. They are both like-able as their bonding slowly progresses throughout the story. If they only picked a better project to be apart of though. It was a waste of their talents. Lamar Johnson who plays Berry's son gets a lot screen-time, and he was really good playing a grounded and sympathetic character. There's much heavy lifting for him to do as he wants to make sense out of the situation and find some peaceful solution to many problems. I was on-board with his story-line until he, of course, disappears towards the end. The development of the character pretty much stopped just as it was about to get the most interesting. Tonally it's all pretty realistic with documentary like montage sequences. Well, except for one abstract dream scene involving Berry and Craig that confused half the audience. It was supposed to be \"romantic\", but it's like nothing else in the entire movie. The scene comes off as more comedic than anything because of how cheesy the presentation is. It was kind of embarrassing as well, which made me feel bad for the actors.<br><br>The actual riot scenes weren't bad. It's the journey up to that point that's difficult to tolerate. If only they didn't let every dialogue scene be people yelling, shouting or screaming. The pulse can't be that high all the time. There needs to be some breathing. I like the actors and the director is respected, but they can't save the movie. We get some sprinkled decent moments, but there's just not enough of them. Oh, I'll give it a point for being shot on film. No complaints on cinematography. Don't rush out to see this one once it comes out. Catch it on VOD or something and be sure to not have the volume too high. Trust me, it's gonna get loud. My other summary of the film is: I like you guys, but better luck next time.","user":"paulijcalderon","rank":[44,54]},{"title":"Waste of Talent & Time","rating":3,"date":"8 May 2018","review":"In the credits this movie was dedicated to a young man, I would guess someone that lost their life in the riots and this was NOT a good memorial. This movie was all over the place. It appeared that Halle Berry was channeling the character from Monsters Ball??? I mean dazed and confused should not be the only emotion one can emote. If this was based on a real person, I wonder how they felt portrayed in such a manner? It was completely unbelievable that children would be in the care of such a person. The story line was all over the place. I think the film was to be a coming of age and experiencing first love in the midst of the chaos of the race riots? Just way too much going on simultaneously while not pausing to fully develop any of the ideas. I went into this film excited to see the experience of the riots (and the buildup) from a regular family's point of view, this was highly disappointing and I wouldn't recommend it to anyone.","user":"bandblawrw","rank":[23,34]},{"title":"A huge disappointment","rating":19,"date":"19 August 2018","review":"This film tells the story of a foster mother with many foster children, around the time of riots in 1991.<br><br>With two A List stars, one would expect this film to be good. As it turned out, I am left hugely disappointed. The film features constant screaming children, screaming adults and screaming everyone. There is not a time when characters aren't screaming. That alone turns me off the film completely. The story is not really going anywhere either.","user":"Gordon-11","rank":[12,16]}]