[{"title":"Serious crime thriller","rating":7,"date":"24 September 2019","review":"In 1970s Hell's Kitchen, 3 protection racketeers are sent to prison. The guy who replaces them doesn't collect efficiently, doesn't provide protection, and doesn't provide for the 3 wives. So the wives decide to run the racket themselves, on their own terms. This puts certain noses out of joint, and things get nasty.<br><br>This crime thriller is based on a comic, and one which I happen to have read recently. I found the film rather better than the comic: the characters were more roundly realised and it was easier to tell between them (the comic came across with the characters being fairly indistinguishable). Having read the comic first, I was a little surprised to see Melissa McCarthy heading the cast. However, this is not in any way a comedy, and the principal women (McCarthy, Tiffany Haddish, Elisabeth Moss as the wives, and Margo Martindale as the local matriarch) are all first rate. The men aren't bad.<br><br>The story doesn't hold any huge surprises, but it is well told, and varies here and there from its source material. There is some graphic violence, and some very ripe language. Generally, I enjoyed it.","user":"neil-476","rank":[35,49]},{"title":"I left my dog alone for this","rating":11,"date":"11 August 2019","review":"I was pleased to see that I was able to give this movie 0 stars. The only stars I wanted to see while watching this movie were the ones spinning around my head after I hit my self over the head with a pan. It would be less painful then seeing that movie. I can't believe I left my dog home alone for this.","user":"brooksemma-84304","rank":[181,300]},{"title":"Tries too hard to be serious","rating":2,"date":"14 January 2020","review":"This was one of the dumbest crime movies I had ever watched. The storyline adds so many elements to make it look like a badass crime film but it just makes the whole movie incomprehensible. Everything that happens in this makes no sense and wouldn't even happen in reality. All the characters are vacuously written and they act very hard-core (but for no reason at all). I'm only giving this a soft 2/10 because Elizabeth Moss was the only person in this that actually had vulnerability and made the movie slightly better.","user":"chrisw-17947","rank":[21,29]}]