[{"title":"More a revenge drama than living history","rating":6,"date":"6 December 2017","review":"Not a bad movie, \"Der Mann aus dem Eis\" gets weighed down by its \"plot\" which concentrates on Ötzi's violent death and the days before, creating a murder and revenge story with lots of violence but no levity at all.<br><br>The movie gets plus points for trying to get its history right; I liked how it highlights the fact that even then, in the late stone- / early bronze age, humankind was already far removed from the nature it still depended upon. A good idea in this respect were some rituals, plus of course the story's MacGuffin, an obsidian shard used for rituals which is kept in a pretty wooden box.<br><br>On the minus side, the amount of violence was maybe historically accurate but if you already go the length of portraying a stone age society halfway correctly (including made-up speech), you might as well include the nicer aspects of human life. A few tender looks and embraces during the first five minutes is all we get.<br><br>From the technical POV, the production is OK, out of their limited budget they got everything which could be expected and then some - the sets were fine, the costumes great, casting and acting good (nice lengthy cameo by Franco Nero) and of course the spectacular outdoor locations are an asset. Yet in many instances the camera-work stays rather pedestrian, so while the story shares some genes with \"The Revenant\", the photography is of lower quality (no big deal, Lubezki is a genius and no mistake). There's only two scenes where the pictures really take flight - one chase along a ridge filmed with a drone or cable-camera against spectacular backdrops, really vertigo-inducing that one - and one lengthy sequence where the hero is trapped in a crevasse below the glacier. Both scenes only emphasize that there was a better movie somewhere but it got buried under a too-simple and violent plot.<br><br>Recommended all the same, especially for the realistic portrayal of those early societies.","user":"IndustriousAngel","rank":[26,32]},{"title":"stunning environment","rating":7,"date":"14 March 2019","review":"Greetings again from the darkness. Some writers struggle with how to end their story. In this case, writer-director Felix Randau had his ending served up in newspaper headlines almost 30 years ago, and his challenge was to come up with an interesting beginning and middle (as well as meaning for the ending). In 1991, at almost 10,000 feet above sea level, a body was discovered. Originally thought to be a missing hiker, it was determined instead to be a 5300 year old Neolithic man. Thanks to the ice, he was well-preserved along with his clothes, tools, and supplies.<br><br>Nicknamed Otzi the Iceman since he was found in the Otztal Alps (Italy), some basic information could be derived about his existence and death. Filmmaker Randau then created a fictional account of his final days, speculating on and imagining the life he led. German actor Jurge Vogel stars as Kelab (Otzi the Iceman), and we get our first glimpse of native Neolithic life in the community of his clan. The mother of his child dies giving birth, and we see Kelab display a magical box used as a shrine of worship to pay respect. The contents of the box are not revealed until near the end of the film.<br><br>While Kelab is out hunting for food, the village is violently attacked. The invasion kills most of the inhabitants and destroys their homes and supplies. Kelab takes the surviving infant child with him as he sets off to seek revenge. As he tracks those who attacked, we see him balance his incredibly strong survival instincts with his emotional need for revenge. Another community led by the legendary Franco Nero offers Kelab a place to rest and a safe haven for the infant child that couldn't possibly make the trek that lies ahead for his father. The scenery is breathtaking and environment treacherous.<br><br>Very little dialogue is spoken, and what there is must be interpreted by the situation. The filmmakers and researchers decided on an early form of Rhaetian for the film, so unless you are a world renowned linguist, you'll likely have to join the bulk of viewers in interpreting meaning. Mr. Vogel is quite believable in his performance ... at times we forget he's an actor rather than the Neolithic man he's portraying.<br><br>The costumes and makeup are excellent and realistic, while the setting, scenery and environment (nature) are the true co-star. We feel the cold and grasp the harsh conditions. This was a violent life ... typically out of necessity, yet sometimes out of emotion. QUEST FOR FIRE (not CAVEMAN) and the brutal elements of THE REVENANT (without the bear) are recalled; however, Mr. Randau's dramatized account of Kelab's last days in pursuit of vengeance are a perfect fit for this coldest of all cold cases. Otzi the Iceman's preserved mummy can be viewed at the South Tyrol Museum of Archaeology in Bolzano, Italy.","user":"ferguson-6","rank":[8,9]},{"title":"Otzi's Story","rating":7,"date":"15 February 2019","review":"I loved that someone took the initiative to create this story for Otzi. We can never truly know what Otzi's life was like or what lead to his demise but we can speculate. That's what this film does. It's a fictionalized story about the Otzi's days.<br><br>The plot summary is simple. Otzi is a highly regarded member of a small tribe. He sets out to do some hunting and while he's gone a trio of men rape his woman, burn their homes, kill all but one member of the tribe and steals an important relic. This sets Otzi on a path revenge in the final days of his life.<br><br>So, let's start with the fact that there is no need to understand the ancient dialog that is used. It was easy to interpret what was going on. The actors did well with their roles and really had a way of drawing me into the film. The costumes were what you'd expect to see for this time period and I liked that they incorporated some of the artifacts found with Otzi's body into the storyline. One that stood out was how he wraps a large ember in what appeared to be leaves so that he could transport fire from the village to his campsite while hunting. I thought the settings were great. It was rough terrain and it was filmed in a way that really helped convey his loneliness, how small he was in a big world and how hard it was to survive.<br><br>I really don't have a lot to complain about. I wish there had been more focus placed on his relationships within his tribe and while I liked the film as it is, I would've liked to have seen an actual dialog and made this a bit more dramatic.<br><br>I liked it and I would think that those who have been intrigued with Otzi would find it enjoyable as well. I'm not sure as to how historically accurate things may actually be but I thought that this was aimed towards being as accurate as is possible. I would recommend this as a decent movie.","user":"Foutainoflife","rank":[6,7]}]