[{"title":"What's surprises me 😍","rating":9,"date":"14 January 2019","review":"Platform: watched through Netflix!\nDate Wathed: 13/01/19<br><br>Intro:\ni must say this movie was so underratedand was not appreciated by many. that is why i'm posting this review. i'll be honest, i did not expect too much from it. let's just say that it's because number 1) it's been a long time since i last watched or they last an action movie, 2) i am judgmental and i belittled Anne Curtis' ability to do an action film. but boy, when insaid i did not expect too much, i never imagined that being surprised was one of the things i didn't expect from it. so here goes the review:<br><br>Screenplay/Videography:\nthe screenplay was great and were all artsy. i love how they all captured every beautiful angle of the fight scene smoothly. the scene at the end where the camera is facing downwards capturing the entire slam area filled with dead bodies was onenof my favorite scene. the setting i must say was very well thought of and was organized to a point that i realized manila can look so hollywood-ish in a way.<br><br>Overall effects:\nlet's be pinoy here and be honest, when it comes to visual effects we're number 1. number 1 at settling for the worst. but this time, i love how they level themselves with the hollywood movies. the blood, wounds, the sounds. it doesn't sound or look cheap anymore.<br><br>Actors/Performance:\ncome on guys, admit it, Anne did a great job on this!! i mean she's not a natural action star but all i know is that she has the courage to do it and that's what built her character here. it does need a little polish but hey, i can see she really did her very best to portray her role. the rest of the cast were all perfect. each and everyone did a great job giving justice to the character most especially Teban, Alvarez and Dela Cruz!!<br><br>Story:\nthe story i must say was cliche. i mean, duh? hundreds of years in the film industry, what else hasn't been offered in the theatres? it'll all fall down to the twist and i love how the writters of the movie twisted everything. i love how everything seem to have a significance to what is currently happening in the country. the plottwist at the end where Anne says: \"Nanlaban yung sospek\" (which i predicted she would say and i was laughing so much) was what completed it. it was so intense, genuine and exquisite!!!!! sobrang in love ako sa movie na to and i regret not watjcing this in cinemas.<br><br>i would also like the fact that there were no dull moments and this is the first time i've seen a filipino movie filled with so much action. KUDOS TO BUYBUST!! if you haven't seen it yet, check it out on every platform you can think of!!","user":"saraginajp","rank":[6,6]},{"title":"Erik Matti's not so best but good.","rating":7,"date":"17 February 2019","review":"A totally credible action flick that's got a lot going on under the hood. Must-see.","user":"joanacatbagan","rank":[5,5]},{"title":"Go Philippines action movie go !","rating":9,"date":"12 May 2019","review":"BuyBust is my first exposure to the cinema industry of the Philippines and I gotta say your guys just earn another follower thank to this brutal \"Die Hard in a Slum\" movie. I see many people often compared BuyBust to The Raid a fantastic action movie from Indonesia in a distasteful manner and I wholeheartedly agree with them about how cliche and boring the plot is but not the action. If The Raid shock people with how well choreographed the brutal fight in Pencak Silat style then for about 1h 50 min of the pure chaotic and merciless street fight of BuyBust will do the same. I absolutely love Anne Curtis and Brandon Vera so I hope this is not the last time I see them together","user":"phanthinga","rank":[4,4]}]