[{"title":"Beautiful journey with heart-warming moments and superb background score is a must watch","rating":8,"date":"21 October 2017","review":"Indians believe in complete Moksh or Salvation after death to free the soul from the cycle of life and death. <br><br>Mukti Bhavan tells a weird journey of a 77-year old man who believes that time has come to attain Salvation and must reach Varanasi accompanied by his son. <br><br>Mukti Bhavan had already won accolades at the National Film Awards bagging the Best Film and Best Actor awards. The trailer was interesting and so is the film. The journey taken by father and son (Lalit Behl and Adil Hussain) is beautifully depicted as the bond grows strong as they spent more time together. The movie is one such attempt to show the state of people who stay at the Mukti Bhavan, a small hotel with 12 rooms in Varanasi. Though the subject of death is serious, the film boast off some satirical moments to keep up the light moments. There is a scene when father is terminally ill and you feel that he is about to die showing the last moments between father and son. Surprisingly, he survives the illness proving that you cannot control Death but it will ultimately control you. The film also succeeds in giving message to take care of old-age parents the same way they take care of you when you are growing up. <br><br>The second half tends to drag a little bit and could have been made better. However, the beautiful background score along with spectacular capture of ghats of Varanasi will keep you engaged. Shubhashish Bhutiani, as a new director and writer, has the potential to make it big while the performances by the star cast is simply superb.<br><br>Overall, a beautiful journey with heart-warming moments and superb background score is a must watch. Excellent 4/5","user":"ketgup83","rank":[6,6]},{"title":"Class Act of story telling","rating":9,"date":"9 April 2017","review":"Yesterday i got a chance to see this outstanding work of cinema Mukti Bhawan(Hotel salvation) and still I am in that zone where I was while watching this movie I am big fan of realistic drama movies but you hardly get a chance to see this kind of movies in Bollywood, for me this is an excellent film making,what Shubhashish Bhutiani produced here is a class act of direction and story telling,how he portrayed the relationship between father and son is very engaging while watching this movie there was a constant smile on my face and you can only wonder that how can simple things and regular conversation can be a good entertainment, movie is going to teach you a lesson between life and death ,Hollywood movies like menchester by the sea,moonlight,fences and lion are movies which got highly praised by every one this year for there realistic and real life drama and got recognition in Oscars and here Mukti Bhawan is as good as those movies or may be better,last but not least you can not praise cast of this movie enough for there efforts every actor did there very best to make this movie, specially adil hussian and Lalit behl and even other supporting actors did justice to there character gonna watch this movie again in future.","user":"Manish1989","rank":[9,10]},{"title":"Mukti Bhawan- The Original Five-Starrer (10 on IMDb :P)","rating":10,"date":"24 May 2017","review":"There are very few movie screenings where you don't feel like you are watching a movie. It's like you are sitting with the characters and observing them, watching them do things and listening to them doing their regular work. It's so relatable that it doesn't feel like they are acting at all. Movies like this are the best kind of movies. Mukti Bhawan is one such movie. You can't see acting in the movie because they are not doing it at all. Each one of them is living the character to their cinematic best.<br><br>The very first scene of the movie shows Daya, the character of Lalit Behl, finds himself chasing his younger self in an abandoned village while his mother is calling out to him. He takes this as a sign and declares to his unprepared family that his time to go has finally arrived.<br><br>Mukti Bhawan is a movie about that final journey. A father's wish to die in the holy city of Varanasi and his son's struggle to meet his father's demand while he himself is struggling with his highly demanding work. I won't say it is a story of death, I would rather say it is the story of life, the story of a middle-class family, a story of the father-son relationship.<br><br>He is a son, whose father has reached an age where he has become stubborn about his wishes. His demands, just one though, considering the situation of the family seems unreasonable. He is a father too, whose daughter is about to get married but she has ambitions, she wants to do a job and doesn't want to get married just yet. He is a husband, whose wife constantly asks him that how much time will it take him to come back, to which he has no answer. He is also an employee, who is not able to manage his work-life balance. What should he do? He has to take a decision. And he reluctantly takes the decision to accompany his father, more out of duty than love, and checks into Mukti Bhawan, the salvation hotel.<br><br>Just 25-years-old Shubhashish Bhutiani, yet another debutant director, knows what he is doing. His style of movie making doesn't seem conventional in the movie. It doesn't run in as a continuous plot, it rather runs in episodic sequences. Each one powerful than the other one. Well-acted, directed and shot. No matter in which order you watch it, it will tell the same story and each part collectively leads us to the climax of the movie, which is a celebration. A celebration of a life well lived, happily and without any regrets. A life lived on your own terms, a life where you did what you wanted to do.<br><br>Adil Hussain is a gem of an actor and he has put his heart and soul into his character of Rajiv. It's sad that for the larger part of the audience, he is still unknown. The one particular scene, where after getting the call about his daughter's decision of not getting married, he storms in an internet café to do a skype call home, is epic, to say the least. He is furious about what he was hearing, to add to his anger network was bad on both sides but at the same time, he has to maintain the decorum of a public place. His control over the scene is just mind blowing. Another scene where he waits for his turn to get the cake is wordlessly loquacious.<br><br>Lalit Behl as Daya is spot on. We have seen him in Titli in the role of father. There he had no control over his sons, here he takes the authority. His timing is perfect. His approach is more open-minded than his son's. Geetanjali Kulkarni as Lata is practical, she is straightforward and to the point. If she could impress with just 'reading from the paper' in Court, here she has full-length dialogues with her. Palomi Ghosh as Sunita is the life of an otherwise dull house and whenever she gets the chance she spreads the happiness around. She acted brilliantly in her not so long role. Two another not-so-major but important characters are of Navnindra Behl as Vimla and Anil Rastogi as Mishra Ji, both of them played their part with utmost perfection.<br><br>One can't set a movie like this without a backdrop of Varanasi, where, according to Hindu beliefs, people go to die, to get the Mukti, the freedom from the cycle of birth, death, and rebirth. It has been shot brilliantly. Ganga Aarti, burning pyres, boat ride, pranayama in front of rising sun or a scene as simple as the fading paint of wall graffiti has been captured beautifully. Music of Junaid Tajdar is the cherry on the cake.<br><br>Death is a process, it will come when it has to come, and you have no control over it. But you have control over your life, you can either make it or break it, then why not just make it, make it large? So that when your time to depart finally arrives, you can go without regrets. You can and you should do what makes you happy. Do what your heart tells you to do, it gives you signals, and you have to interpret them. And if you do that, it's not just your life but your death too will be a celebration.<br><br>Mukti Bhawan is a real powerful cinema. It may be slow but it is a class act. If a movie with such serious subject manages to make you laugh and put a smile on your face, I guess, the movie is working. It is an actual five-star stuff.","user":"adidpr","rank":[9,11]}]