[{"title":"The first movie that was worth a review","rating":10,"date":"4 December 2016","review":"It's the first review I'm writing. Actually, I've never felt the need of writing a review- thought that the score I give is already a good contribution. But Blue Jay is something else. It's the most genuine feeling I've ever felt while watching a movie, in the sense the once I finished it, I didn't feel than it was far from my own reality at all. The way nostalgia was pictured is fascinating. The words that were used were so close to the words that I would have used myself in such a situation that sometimes, I've found myself saying out loud, at the same time, what one of them were saying.<br><br>Magical, genuine, sweet, emotional, simple, true. Brilliant.","user":"aidellero","rank":[86,96]},{"title":"4 settings, 3 actors, 2 colors, 1 day...","rating":10,"date":"18 January 2017","review":"4 settings, 3 actors, 2 colors, 1 day and 80 minutes that will warm your heart.<br><br>An emotional story that develops between old school friends who meet again after 20 something years after their ways part. Mark Duplass and Sarah Paulson have an amazing chemistry together and deliver high class performance. With well-written dialogues, relatable story line, and good music, it is the one of the best Indie movies of 2016.<br><br>Expect to be amused, sad, melancholic, and nostalgic throughout the movie. <br><br>I gave it 10 and would recommend it to everyone who appreciates good movies.","user":"annie_geo","rank":[49,56]},{"title":"The movie everyone strives to make","rating":10,"date":"13 September 2016","review":"I love this film. It's perfect. I would not change a thing. <br><br>It's the gem I always hope to discover when I go to TIFF, and it's ironic that the large costly studio films seen earlier in the week fell flat and here's this little two-character indie film shot in just 7 days and it blows the heavyweights out of the water. <br><br>Sarah Paulson is at the top of her game. She should be nominated and win many awards for her portrayal of Amanda. Yes, she is that good. <br><br>The direction, acting, cinematography, editing, script, music... all coalesce to create this perfect little gem. It is bliss to watch and experience. <br><br>MOVIE SYNOPSIS:<br><br>Jim is back in his childhood home sorting through family belongings after this mother's death.<br><br>Amanda is back in town to visit with her sister who's expecting a baby. <br><br>Jim and Amanda run into each other at the local grocery store and have a difficult and awkward time acknowledging each other's presence. What is making them so uncomfortable? Grab your popcorn and watch their story unfold. <br><br>That's it. That's all I'm saying about the film's story line. The less you know, the sweeter the experience of finding out about these two. But I fell in love with both of them.","user":"wxgirl55","rank":[77,93]}]