[{"title":"Yikes - starts really well - a narcisstic mess by the end","rating":2,"date":"12 December 2018","review":"This film suffers from the same kind of poor choices which would cause someone to, say, make a 9/11 disco musical. It wields an enormous subject and chooses to focus on the most irrelevant aspects of any reaction to that subject.<br><br>It doesn't really matter what you want to say - the bizarre, unresolved context for the setup feels faintly obscene and eventually bankrupt. If the point of the film is to illustrate the shallowness of reactions to terror and violence, then it failed to say that. Instead, it looks more like a statement about the parallels between self-expression, terrorism, self-obsession, or losing your identity to celebrity, or something... By the end of the film I was deeply annoyed.<br><br>Hats-off the all of the professionals who clearly know how to make an impressive film here. But this story however, is a mess of intensity looking for a point. I believe that it fails eventually because of the indigestible premise.","user":"peedur","rank":[213,261]},{"title":"8 stars for the first 80 minutes. 2 stars for last 40 minutes.","rating":4,"date":"23 February 2019","review":"Was remarking to myself how innovative and compelling the cinematography was early in the movie. The long shot of the teacher before the violence was striking and extremely memorable. Middle of the movie was very engaging story about the rise of a pop star.\nThen jump to 2017. If I squint my eyes, maybe I can pretend that making a bad movie for the last hour is some kind of representation of the decline of man or maybe abandoning your own story is a social commentary? Maybe destroying your own film is akin to terrorism?\nAnd then you show a 20 minute pop concert, at the end of which, your narrator implies a pact with the devil?\nI just started laughing when I realized this was how the movie was going to end.","user":"MovieFan-91319","rank":[57,69]},{"title":"A Wasted Opportunity","rating":4,"date":"20 December 2018","review":"The subject matter and overall meaning behind this story is great; a girl who is involved in a terrible, topical tragedy and finds unexpected fame as a result. It's a wonderful story to examine and discuss fame, pop culture, etc, but unfortunately the overall presentation of this idea falls flat.<br><br>The performances were strong, especially and expectedly from Natalie Portman (although I don't agree with casting the same actor for multiple parts). That's kind of where the positives stop. The inconsistent pacing and 'throw everything at the wall and see what sticks' mentality made engaging in the movie difficult. One could argue that the hectic nature of the film is representative of Celeste's thought process, but the execution seemed unintentional and rather unnecessary at times.<br><br>I wanted to love this film, and I give kudos to Brady Corbet for exploring this story, but I feel it had a lot to say and ended up not saying much.","user":"usernamewithheld","rank":[101,127]}]