[{"title":"????","rating":4,"date":"14 December 2018","review":"What does ???? mean? It means I'm not sure what to make of this movie. Part of the problem was a lack of clarity of a plot theme which was, I guess, intentional so that we would discover why a Korean female employee would be fired after 5 yrs of service w/out a reason other than her Korean boss (also female which plays into why later on) has a \"feeling\" of distrust in her employee. So, all takes place in Cannes for a film showing, and along comes a French music teacher who likes to take Polaroid style instantly printable photos &amp; give them to the photographed person and tell them that process changes their lives (????). As far as Cannes it was just a couple of boring tacky streets; a restaurant table w/a dog that did nothing; an enclosed sidewalk that did nothing. The reason for the firing becomes obvious when a male film producer shows up, and that unveiling was as exciting as an afternoon nap.","user":"westsideschl","rank":[11,18]},{"title":"Fascinating Korean-French film set in Cannes","rating":9,"date":"17 June 2018","review":"La caméra de Claire (2017) was shown in the U.S. with the translated title Claire's Camera. It was written and directed by by the Korean filmmaker\nSang-soo Hong. \n \nThe great French Actor Isabelle Huppert plays Claire, who is on vacation in Cannes. Kim Manhee portrays Min-hee Kim, a young sales assistant for a Korean film distributor. Kim Manhee is director Sang-soo Hong's muse. <br><br>The film begins with Min-hee being fired for no apparent reason. Her boss tells her, \"I no longer consider you honest.\" However, she won't tell Min-Hee why she is being fired.<br><br>Min-hee, with no job, is at liberty in beautiful Cannes, but, naturally, she is confused and depressed. She meets Claire, who is sunny and optimistic. Claire has a small Polaroid-style camera, with which she takes pictures of people she meets. People are typically happy to have been asked. (If Isabelle Huppert wanted to take your picture, wouldn't you be happy?)<br><br>The basic plot of the film is the friendship between the two women as they set about trying to discover why Min-Hee was fired without apparent cause.\nIt's an interesting concept, and it works well in this film.<br><br>We saw this movie in its Rochester Premiere at the wonderful Dryden Theatre at the George Eastman Museum. It has an anemic IMDb rating of 6.6. It's not a must-see film, but it's much better than that. It will work well on the small scree.","user":"Red-125","rank":[10,17]},{"title":"Awkward Yet Intriguing at Times","rating":5,"date":"27 September 2019","review":"After viewing prolific and acclaimed South Korean director Sang-soo Hong's \"The Day After\", I went into my local library's film catalog and chose to see this one. As I've read one of the director's characteristics is to have awkward dialogue, and this movie filled that bill.<br><br>For me, the awkwardness can be annoying at times, but it also can be quite intriguing. Set at the Cannes Film Festival, the plot elements slowly unfold and come together as the film progresses. But I never really felt I completely understood it all.<br><br>The acting is most solid, and throwing the great actress Isabelle Huppert into the mix can never hurt. Always fascinating to watch her on screen.<br><br>All in all, I wish I could say I enjoyed it all but I felt the film did have its intriguing and engaging moments","user":"larrys3","rank":[2,2]}]