[{"title":"2017? more like 1990","rating":3,"date":"17 March 2017","review":"Words can not describe how terrible the acting is in this movie, seeing the title i expected something good....full of action. What i got was a 90s low budget wanna be movie. The 'special effects' well there is nothing special about them, the story is dragged out. Not much really happens for the first hour or so. Its all very predictable, and very 'meh' i have no better word than 'meh'. very typical, son betrays father, mothers some kind of witch, sacrificing the young to stay alive, secret good brother who gets the sword yada yada yada. Thats 1 hour and 40 mins of my life i will never get back. I really wanted to like this movie, i really did, but we don't always get what we want. I wont be adding this to my collection.","user":"deadly-black-rose","rank":[36,41]},{"title":"Truly awful - avoid !","rating":1,"date":"24 March 2017","review":"Truly awful. I was hoping with a 2017 production that this would be a gripping tale with good acting and great special effects. What a waste of time. It felt like a very poor episode from a third rate TV series rather than a movie in its own right. The concept of the story was quite good, but completely let down by poor production, awful camera work, bad acting and truly awful special effects. AVOID AVOID AVOID !","user":"davidrcraig","rank":[26,29]},{"title":"Don't bother!","rating":1,"date":"28 March 2017","review":"I watched this movie hoping for an imaginative re-working of a legend which enthralled me as a kid . . . but I was appalled at how badly this one was put together. Although the story-line was encouraging, the acting, editing and direction was absolutely abysmal. My wife and I were laughing during the supposedly climactic moments, watching third-rate actors stumble through lines that were truly forgettable, scenes that were embarrassing in their stupidity, and ultimately left us wondering why - Why would anyone allow this movie to be released?","user":"philiplangdon","rank":[25,28]}]