[{"title":"A good start for Paul Dano's directorial debut","rating":7,"date":"11 September 2018","review":"This movie is being described as \"A boy witnesses his parents' marriage falling apart after his mother finds another man.\" And while I think thats true, I think its a bit more complex than that. It also is a bit of a coming of age story where Joe has to grow up and be the adult in this family, but also it seems that mom is having a mid-life crisis (although shes not quite mid-life) and trying to discover who she is outside of being the \"perfect 50s housewife\" that perhaps she feels trapped in. There's a lot of symbolism in this movie. The backdrop of this movie is that there is a wildfire that has been raging and the townspeople have been desperately trying to put out. And that correlates with Joe and his own family. Hes trying to put out the fire in his own family. Also, Joe works at photography studio and Paul Dano (the director and co-writer) even said that this is supposed to be a PORTRAIT of a family life. <br><br>Speaking of Paul Dano, I think he did well with his directorial debut. I think visually there are some gorgeous shots in this movie. Like for instance where Joe is watching the wildfires (and hes perfectly centered - probably again to mimic the portrait vibe). Also where Joe is about to give up but it starts to snow and hope has regained. I liked the film for the most part. They do frame the film by following Joe's perspective. And I think its mostly effective in making you feel for this kid, my only problem is there are a couple of parts where I feel like there are gaps in the story. Without giving too much away there is a scene where Jerry (Jake Gyllenhaal) has decided to seek revenge and it ends up backfiring. And yet, the next time we see him everything seems to be fine. And it never really gets explained what happened. Theres a brief line that they decided it was a \"misunderstanding\" but you never really see what happened and he also gets hurt during this, and that never gets brought up again either. I know Paul and Zoe (the other writer) were adapting this from a book and perhaps thats the way it is in there too. But I personally found that a little frustrating. I needed a little more. <br><br>Carey Mulligan is fantastic in this. She would be deserving to have her name thrown in the hat for awards season. I also thought Ed Oxenbould was a standout too. Which is good to hear since he's onscreen for pretty much most of the movie. I definitely will be looking forward to more of his things. I also thought Jake Gyllenhaal was good but hes absent for a good chunk of the film and so he just didnt stand out as much as Carey or Ed did.<br><br>Overall I liked the film. It wasn't perfect, but I would totally check out another film that Paul Dano directs.","user":"mr_bickle_the_pickle","rank":[86,109]},{"title":"Restrained yet heartfelt.","rating":9,"date":"5 November 2018","review":"I have so much respect for restrained filmmaking for which this movie is an example. Its steady pace and tasteful design gives it authenticity, allowing you to feel like you are living the life of the main character Joe. The acting is superb and the characters are living, breathing individuals filled with hopes dreams and independence. Though Jeanette falters at times, she is doing what is she sees is necessary for her and her son's survival. The emotion on her face, flickering like a shorted lightbulb, portrays her fragility with great depth. The score of the film is great. The story, though maybe too subdued for some, stays with you long after this earnest movie reaches its resolution.","user":"collin-sandoe","rank":[73,94]},{"title":"Slice of Life","rating":9,"date":"12 January 2019","review":"I very much enjoyed watching Wildlife. Whether it was a Directorial Debut or a director's tenth film, I found it to be superb, which I suppose speaks of the talent of Paul Dano. (Did anyone else feel there is some resemblance between the actor who played Joe and Paul? Just an aside...) The film, as other reviewers have mentioned, has a restraint to it which works well and stops it from descending into overdone pathos. In its strong quiet way it brought up emotions in me which made it a compelling film to watch. I was very involved with the experience of each character. They each were realistic with very realistic concerns. I would say that perhaps the overriding emotion I felt was anger at the parents because they each gave in to their selfish needs and wants, while leaving their 14 year old son to be the mature one. What does \"mature\" mean here? It means doing what's right, as in the Buddhist \"right action.\" Jeanette, the mother, did things that made her feel good; she gave in to her own egotistic wounds and tried to fix them, at her son's expense. Likewise, Jerry, the father, did too. He drank, he gave up a job out of pride, and he ultimately pursued an adventure, also rather than do what would have been more responsible, and also, more dull. Joe, the son, was the one who was focused on the three of them as a family, as captured in the final shot of the film, symbolic as it was. One could say the theme of Wildlife was Family vs. the Individual, i.e., how much can adults sacrifice of their own desires and ambitions in the name of the family unit and/or the children? By extension, it can also be asked how is it possible, assuming it is, to satisfy both. Ironically, the teenage Joe enabled his parents to respectively pursue their own desires while he maintained the family unit. I'd wholeheartedly recommend this multi-faceted film to anyone who prefers depth to flash.","user":"Moviegoer19","rank":[30,40]}]