[{"title":"Truly dreadful, the worst, a bad version of a bad movie","rating":1,"date":"5 October 2017","review":"I love a bad movie, this is a bad movie, but not the sort to be enjoyed. It has taken elements that are currently popular and shoe horned them in to a movie very poorly. Even a porno version of Game of Thrones or Walking Dead (Series that this is trying to be) would have more story to follow than this.<br><br>I was initially hooked in by how awful the first scene was, it's truly awful but is funny. Slo mo was used on everything, someone had brought a camera that can do 120fps and they were making sure they were going to use it. There is a clip of the guy slipping on a rock in super slow mo only for it to turn out to be nothing slipping on a rock. totally pointless. This is how I felt about most of the content of this movie thereafter, it shows us something only for it to be pointless. There was loads of stock footage of bears and wolves in completely different environments adding nothing to the story (if you can call it that), just put in there for the trailer perhaps.<br><br>It feels like every part of this film was done on the cheap, like it was some sort of 'Challenge Anika' attempt, where they have 24 hours to make a film from start to finish with just the contents from an old garage to use as props and GCSE students to help out. <br><br>I did feel very sad at one point upon seeing the old Blue Peter presenter Tim Vincent had lowered himself to acting in the film. Part of me feels he was only brought in to exploit Blue Peter skills to make some of the paper mache props.<br><br>The biggest moment and shock in the film was that it's the first in a trilogy or at least it thinks it is. If they get the funding for another one of these, then everyone should buy themselves a camera with slow-mo functionality and have a go at making a truly terrible movie of their own.<br><br>In summary, it's bad, really really bad seriously, just terrible.","user":"tonypates","rank":[23,25]},{"title":"Well...","rating":4,"date":"27 September 2017","review":"Here's the thing. The main/lead actors were god awful. No effort put in and sounded/looked as though they were reading the script for the first time there and then! Maybe they were? Clearly this was a money grab which is a shame because maybe this film could have been something had they put the effort, time but most importantly passion in. A fellow reviewer mentions the \"bar scene\". Yes, it was pretty awful but I thought the supporting artists (or extras) did a better job than the main cast. In fact, in all the scenes the extras did better. That's saying something. The main actors should be embarrassed of their panto- style acting. Why they were cast, who knows?! The camera work was shoddy and this whole film is offensive to indie film and passionate film makers. I'm only giving it a 4 because I know some (not all) of the extras actually put the work in and cared about the film.","user":"jesummers","rank":[16,18]},{"title":"Really?","rating":1,"date":"27 September 2017","review":"This film was bloody awful. There's really no other way to describe it. Just bloody awful and that's putting it mildly. I mean how does something this amateurish and sad even get funded or distributed? It makes absolutely no sense. None of the actors, if you can call them that, had the talent of your local thespian playhouse. I truly believe someone went to their local bar after work and said \"My brother just got this cool new digital camera. Ya'll wanna make a movie?\". They must have spent the twenty they had for a budget on a twelve pack instead of expenses. Save your money, time or bandwidth and watch Conan the Barbarian for the fiftieth time instead. Trust me, you'll be much more entertained and satisfied.","user":"michaelchandler45","rank":[18,21]}]