[{"title":"A mediocre historical drama","rating":21,"date":"21 July 2018","review":"What we saw in this film is a guy, Sakichi, who put righteousness, justice, morality and fairness before everything else. A dreamer, a very unpractical person tried so hard to be politically correct in the chaotic Japanese feudal period. A guy with conscience and loyalty to his master, with a bigger heart and love of Japan, an idealist. But he was also so stubborn and arrogant, could never hide his despise to those who were ambitious and not loyal to their master. Such person was doomed to be a loser. His old friend reminded him: \"There's no justice or righteousness once you are dead.\" <br><br>To the film itself which was adapted from the famous Japanese author, it was not well crafted, so sometimes it just looked vague and awkward. The cinematography was good though, the mountains, the field and the lake....all of them looked just so beautiful.","user":"LogicIsEverything","rank":[6,9]},{"title":"Expected more but too lengthy and too slow burning","rating":6,"date":"15 August 2018","review":"I expected a lot from this movie. but i was disappointed with so many aspects. you have to really pay close attention to the narrative because there were so many characters crammed in that i found it difficult to keep track of who was who.<br><br>the build-up to the climax was very slow and you would need a lot of patience for a movie which is 2 hrs 30 mins. when it came, the climax was anti-climactic as far as i am concerned.<br><br>the best thing about the movie is the cinematography. lush green bamboo forests, the scenery are visual delights and deserve extra stars.","user":"nijwmzen","rank":[3,4]},{"title":"not enough in here","rating":6,"date":"11 February 2020","review":"I want to see much more from this title and finally i was a little bit dissapointed. We view the movie by Mitsunari view and see almost nothing about the character and thinking of Ieyasu. I also want to see more of Kobayakawa personallity and how he was thinking. The battle was nicely filmed but it started after two hours from the beginning of the film!","user":"theofilossalonica","rank":[1,1]}]