[{"title":"I wanna know what the director was smoking while in Europe filming this shitshow.","rating":4,"date":"4 August 2017","review":"This movie fails on so many levels.Looks like all bollywood can make these days is how to break marriages and make people cheat on their partners.I would suggest you to grab a beer with that money or spend some good time with your family or dog.They would certainly love your company instead of wasting time on this heartless,soulless movie.","user":"krishh1193","rank":[68,94]},{"title":"Brilliantly Directed Crap","rating":1,"date":"5 August 2017","review":"I watched the movie with my wife yesterday and it started randomly with Shahrukh trying to over act tourist guide life. Suddenly he meets one more dumbo \"Sejal\" who leaves her fiancé to find some ring and travels all around Europe with reluctant Shahrukh. Finally they fall in love. Seriously thats the gist and including this it has over acting of shahrukh , Dumbness of Anushka, Silly Jokes.<br><br>What were you thinking about it Mr Imtiaz Ali.. This movie should be banned from theatres as it is having lots of negative Effect of human Values and thoughts.. In fact this has actually caused me overnight headache . Probably this movie should come with a complimentary DISPRIN and psychologist appointments.<br><br>If this movie is Love Story in your definition, then probably go back to 90's and start over. <br><br>Shahrukh Khan - Please STOP here. I have loved your movies in 90's , but now its not selling. I bet even you would not watch this for 2:30 mins..","user":"samiem41","rank":[63,87]},{"title":"Waste of Time and Energy.","rating":4,"date":"7 August 2017","review":"Imitaiz Ali is a director who has given some fresh breath of air to his love stories and some are excellent like Jab We Met, Love Aajkal and Rockstar. But lately he is also in a syndrome of serving the same old trash with an altered packaging. Jab Hary Met Sejal is a complete disaster coming after Tamasha. Tamasha still was better in the content.<br><br>Jab Hary Met Sejal biggest drawback is that it does not have any story but just bits and pieces of certain instants fused together. Scenes of Jab We Met, Tamsaha and Love Aajkal amalgamated together as moments. The plot is wafer thin that it will leave you speculating. This is the story , Hary is a tourist guide and is verge on completion and departing one of his tour. At this instance one of the tour member Sejal a Gujrati girl insist Hary to help her find her lost engagement ring that she misplaced during the tour. Almost 90% of the movie revolve around Hary and Sejal looking for the ring around the picturesque location of Europe encountering with some misdemeanors.<br><br>This movie is so boring that even 20 minutes in the movie you feel its ages. Shahrukh Khan and Anushka are the only two who carry the entire burden on their shoulders. Shahrukh Khan looks jaded as he has played such characters for so long. I have lost count of roles when his charming personality is wooing a girl who could be single, engaged or married but ultimately falls for him. Awkwardly Shahrukh's charm does not work in this movie and he is exasperating at times. <br><br>Shahrukh needs to do something different as he is no more conclusive playing roles which he was doing 20 years ago. Anushka looks pretty and her acting is passable. She also gets on your nerves after a while with her unimpressive Gujrati accent.<br><br>Direction and screenplay do not have much to do as there is no story in the movie. Superfluous songs also add to anguish. I feel this one of the most wretched movies by Imtiaz Ali. Please skip this movie and let the producers and directors know you cannot just serve us crap. Highly avoidable.","user":"kinshuk-gaur","rank":[32,42]}]