[{"title":"Just Fair","rating":5,"date":"1 May 2019","review":"Gina Rodriguez and Ismael Cruz Cordova do well in their lead roles here and for the most part portray believable characters. However, many of the plot elements just came across to me as quite non-believable and the whole movie itself was not engaging enough to rise above a fair rating, as I see it. It does bring to the front though the issues of the debasement and trafficking of women.","user":"larrys3","rank":[22,28]},{"title":"Once again... DON'T LISTEN TO THE NAYSAYERS","rating":8,"date":"1 February 2019","review":"I feel like I have written this review a million times. I'm sick and tired of people giving movies a 1 or 2 because it had weaknesses, 'wasn't as good as the iriginal' or they just didn't care for it. Try to at least be somewhat objective. This movie was entertaining, suspenseful, tense at times and had you torn as to which way you wanted the movie to end. And as a bonus, little or no gratuitous sex, violence and language!!","user":"anuity","rank":[110,182]},{"title":"Miss Antibalas","rating":5,"date":"1 February 2019","review":"Greetings again from the darkness. One of the reasons I so enjoy movies is that I can usually find some positive to latch onto, even if most of the project fails to connect or generate much interest. Such is the case with this latest from director Catherine Hardwick (the excellent THIRTEEN, 2003). Actress Gina Rodriguez (\"Jane the Virgin\", ANNIHILATION) is a joy to behold as she navigates her way through one perilous situation after another.<br><br>Ms. Rodriguez plays Gloria, a southern California resident whose particular set up of skills are utilized in her work as a makeup artist. Gloria drives across the border to Tijuana in support of her friend Suzu (Cristina Rodlo) who is competing in the Miss Baja pageant. Their fun evening at the nightclub goes horribly wrong as evil-doers storm the club attempting to assassinate the director of the pageant. During the mayhem, Suzu gets kidnapped and Gloria proves for the first time (of many to come) that the film should have more accurately been titled \"Miss Antibalas\". No matter the size of the shootout - and there are many - there are no bullets for Miss Bullet (Bala being Spanish for bullet).<br><br>Of course that's not a spoiler because even in the trailer, it's quite obvious that this remake of director Geraldo Naranjo's 2011 Mexican movie sets out to become yet another action franchise. As a PG-13 film, it softens the edges from the original and seems to target younger viewers, possibly an attempt to empower teenage girls. It's a worthy mission despite the disappointing execution of the first feature film screenplay from Gareth Dunnet-Alcocer.<br><br>Gloria's attempts to rescue Suzu find her caught in a tug-of-war between Mexican crime lord Lino (Ismael Cruz Cordova, \"Ray Donovan\") and the DEA task force led by Matt Lauria playing an incompetent agent. Given today's political climate, bad guy Lino is presented as half-American and half-Mexican to quell any cries of racial stereotyping. Also appearing are Aislinn Derbez (daughter of Mexican movie star Eugenio Derbez) as Isabel, another woman caught up in Lino's web; and Anthony Mackie in an all-too brief two scenes that seem to play into the previously mentioned franchise hopes.<br><br>Corruption, drug smuggling and human trafficking are rampant throughout. I have no personal knowledge of whether Tijuana is the lawless frontier presented here, but the focus is really on one woman's ability to find her backbone - her inner strength - in a never-ending stream of dangerous situations. Despite the material, Ms. Rodriguez manages to hold her own and flash star quality. She is likeable and tough. On the other hand, Ms. Hardwicke's choices beg for second-guessing - from the cheesy shootouts to the lame and too-obvious musical choices (especially at the film's conclusion). She has certainly proven herself capable of better as a filmmaker, and will undoubtedly do so again.","user":"ferguson-6","rank":[47,80]}]