[{"title":"Tiger Zinda hoga par logic marr gaya hai","rating":1,"date":"24 December 2017","review":"These are a few scenes which killed my neurons:\n1) Salman's entry scene with wolves is funny and his kid is irritating.\n2) As the number of terrorist soldiers increased, Salman switched to bigger guns. At one point, there were 200 soldiers and our hero picked the biggest gun he can find, stood at one place and kept shooting. FYI these 200 soldiers were also shooting back but surprisingly they all missed.\n3) They portrayed a big villain in the movie, which of course required a big plot for him to go down. Throughout the movie he was seen with hundreds of soldiers at his disposal but as the movie came to an end and it was high time the villain was killed, they showed him roaming around Salman with just a knife.\n4) To kill salman (who was tied to a chair), the villian didn't shoot him. He put him in a room full of toxic gas, asked his men to wear gas mask and then go inside and shoot him.\n5) Salman and Katrina escaped a whole city under airstrike, within 3 SECONDS. \n6) Dialogues were written by a kid. Villain: Tu mujhe rokk ke dikha. Salman: Dum hai toh tu mujhe rokk ke dikha.\n7) Salman's colleague tells him that it was impossible to diffuse the bomb (tells him twice). Salman tells him, its a matter of country's pride and his colleague diffuses it within seconds.\n8) Action scenes had several explosions, most of them happened in empty cars with no enemy around. Didn't understand the director's obsession with exploding empty cars. \n9) Whole movie was formula based: Take what work's best for Indian audience (fuck logic/acting/talent).<br><br>This list can go on. In simple words, whole movie was bleh. To many of the body builders, single guys/one sided lovers, Muslim youths and others.... please stop being a blind fan.","user":"anshul-47775","rank":[52,72]},{"title":"Blockbuster","rating":9,"date":"7 June 2019","review":"Movie Superb...\nAction fantastic 😍\nSalman always best 😍😘😘\nKat Supb 😍\nAwesome movie 😍","user":"sibaprasadsamantaray","rank":[5,5]},{"title":"Long Review: Tiger Zinda Hai","rating":5,"date":"26 December 2017","review":"Today, one is so much familiar with the type of films that Salman Khan stars in and sometimes produces that there is nothing original anymore. Tiger Zinda Hai is no different as the actor returns to do what he often does in these action-packed potboilers that are popular for a complete lack of logic.<br><br>After having fled India with his Pakistani girlfriend in Ek Tha Tiger (2012), Tiger (Khan) now leaves in peace somewhere in Austria. Although he is away from his covert operations and is no more attached to India's Research &amp; Analysis Wing (RAW), he keeps track of his former immediate senior like a freelancer. So, when a hostage situation concerning few Indian nurses arises in Syria, the government tracks down their best man for an operation considered suicide. It is obvious from the title itself that this is going to be a variation of convenient storytelling where everything happens with an advantage to the protagonists. And that's exactly what happens in Ali Abbas Zafar's latest feature, right from the very point Tiger makes his entry. However, considering that that is the default template of the film, there is enough entertainment value for one to consume and rejoice.<br><br>The plot tries to educate its audience which is both a good thing and a bad thing. Bad thing because it makes the narrative look amateur, which the film suffers with at the beginning. The action sequences are very good, albeit without logic, as Tiger tries to balance his life and work in a war-torn Syria. There are cheesy dialogs to bring in the fun factor, supported by Paresh Rawal and Kumud Mishra, who both put up a refreshing show. There's definitely style in the film as you watch Tiger riding a horse and doing some other daredevil stuff to fight off the bad guys. Surprisingly, for a Salman Khan film, there are intelligent tidbits that elevate the film's intellectual factor. For instance, a young suicide bomber is shown carving his name incorrectly on a wooden table. It, among other brief sequences, shows what terrorism and war can do to people. Lack of education, reverse development, inhibition, and societal oppression are a few stark themes that the film touches upon, and which makes it a lot different than the prequel. So, it's not just about how Tiger can save his country from embarrassing itself. The connection between India and Pakistan that is not associated with terrorism or political tension is another welcome arc that Tiger Zinda Hai succeeds in portraying.<br><br>The biggest problem, however, is the lack of vindictiveness and weight in the antagonist. Played rather brilliantly by Sajjad Delafrooz, this head of a terrorist organization similar to the real ISIL is a meek personality who gives enough leeway to his enemies. You don't expect the head of an unforgiving terror outfit to give people a second chance. But it happens all the time in Tiger Zinda Hai, making the viewing experience a tad uncomfortable for the learned audience. Moreover, I personally was not impressed by the \"Indian nurses as hostages\" as there cannot be a better portrayal of this plot element than in Mahesh Narayan's incredible Malayalam war film, Tale Off, that released earlier this year.<br><br>Khan shines throughout the film, as the score pushes his performance to a level unmatched by any other Bollywood action actor. He graces each sequence with equal panache and delivers a powerful performance as the man who fears nothing. Katrina Kaif is surprisingly not a puppet here and slits few throats as her on-screen husband strategizes the operation. Supporting cast is largely good with decent performances by Angad Bedi and others, but I still had issues with a few actors who were not developed well. The blame is both on Zafar and the writers for not giving enough attention to these characters. The romantic song at the start is the only one that gels well with the film, as others look out of place when there is a war brewing in the world.<br><br>Tiger Zinda Hai is a film that has its flaws but is still a well-made action thriller that can give you goosebumps without pushing you into boredom. The patriotism factor should keep eager Indians occupied, as Khan fans dance their way out of the halls. TN.","user":"nairtejas","rank":[26,36]}]