[{"title":"A story about a choice between two untenable options","rating":7,"date":"14 May 2019","review":"Written by <a href=\"/name/nm1625151/\">Wolfgang Fischer</a> and <a href=\"/name/nm9640853/\">Ika Künzel</a>, and directed by Fischer, Styx has nothing to do with Greek mythology (despite its title), but is instead about a simple question - a group of people will die unless you intervene; what do you do? And if the answer sounds obvious, what if the question is contextualised by explaining the people are African refugees trying to reach Europe illegally. Does this change anything? Should it change anything? These are the tough questions asked by Styx, a remarkably apolitical microcosm of white European indecision in regards to the current refugee crisis. This isn't a white saviour narrative, it's not about a racist who realises that blacks are people too, or about a refugee proving valuable even in the face of hatred. It's a parable about a binary choice distilled to its very essence. It will probably frustrate those looking for something more dramatic or didactic, but for everyone else, this is an exceptionally well-mounted and brilliantly acted story about what can happen when the visor of indifference no longer shields our eyes from the truth.<br><br>Rike (an extraordinary <a href=\"/name/nm1632961/\">Susanne Wolff</a>) is an emergency doctor from Cologne sailing solo from Gibraltar to Ascension Island, longing to see the jungle designed by Charles Darwin and Joseph Dalton Hooker. The morning after a storm, Rike finds herself a few hundred feet away from a damaged fishing trawler loaded with refugees, desperately calling for her assistance. As maritime law dictates, she alerts the coastguard, who promises to send help, but who warns her not to approach the trawler. Hours later, with no sign of rescue, she moves closer in an effort to get some of her water to its dehydrated passengers, but several of the refugees jump into the water and attempt to swim to her. All but one drowns; a young boy (<a href=\"/name/nm9648158/\">Gedion Oduor Wekesa</a>) whom she hauls on-board. Named Kingsley, he uses what little English he has to explain that people on the trawler are dying, including his elder sister. With the coastguard still promising help that doesn't seem to be coming, Rike must now make a stark choice; defy the coastguard's orders and intervene, or do nothing.<br><br>The film opens with a shot of Barbary macaques apparently in the wild, before a cut reveals they are living side by side with humans on Gibraltar's urbanised coastline. It's a nicely presented visual metaphor, setting the allegorical tone for what's to come; presenting a thriving jungle right beside a city built by people, just as Rike plans to travel to a jungle built by people. The film then cuts to a car crash in Cologne. Within moments, a fleet of emergency vehicles are on the scene, one of whom is Rike. However, the scene does far more than introduce her character; here we have an almost immediate outpouring of aid for those in need, in stark contrast to what will happen on the ocean, where responsibility is shirked and rescue is never guaranteed. Again, it's a very simple scene, with the metaphorical connotations not in any way laboured or foregrounded.<br><br>Thematically, Styx covers a lot of ground, without being too explicit about anything. For example, as an emergency physician, Rike knows the first rule of such circumstances: always ensure your own safety first. This is never spelt out, but it becomes important when she realises she can't sail over to the trawler and offload the refugees, as they would overwhelm her yacht. Of course, the circumstances seem tailor-made for a white saviour narrative - a privileged white European comes to the aid of a group of imperilled African refugees, deifying bureaucratic inaction, and in the process teaching us all about the importance of compassion. Fischer, however, is not interested in such a story, and Rike is no more a hero than the average person on the street. Indeed, she doesn't have much in the way of a character arc; once she spots the refugees, she does relatively little except watch in horror, with her most salient characteristic being indecision. Quite opposite to the clichéd white saviour narrative this could have become, the longer Rike does nothing, the more she comes to embody European indecision and irresponsibility; however well-intentioned it may be, the \"someone else will do something\" attitude that allows us to be outraged without having to act.<br><br>A crucial couple of scenes in this respect come either side of the storm. In the first, Rike is contacted by a nearby freighter who warns about the impending storm and tells her to give them a shout if she needs anything the following day. Bearing in mind that the freighter would have room for ten times as many people as are in the trawler, Rike contacts them, but the radio operator tells her, \"our employer has a strict policy of non-intervention in such cases. I can't risk my job\", to which Rike asserts \"you are obliged to.\" But of course, he isn't obliged to, no more than she is. This exchange introduces a further element into the narrative - economic considerations. As the second scene of the film makes clear, in European cities, thousands of Euros and hundreds of people are immediately deployed to help car crash victims. Here in the ocean, however, when the lives of over one hundred are in danger, people bicker about economic bottom-lines and responsibility is passed from one group to the next. In relation to this, the film is named after the Styx, the river in Greek mythology that separated the human world and the Underworld. However, one can only cross Styx if one can pay Charon, the ferryman, for passage. If one cannot pay, one's soul must wander the shores for a hundred years. So, only those privileged enough to afford it can (legally) travel to the next life.<br><br>Perhaps the most extraordinary thing about the film, however, is how quiet it is on the refugee crisis itself. Fischer is not concerned with finger-wagging pieties or didactic moralising, he's interested only in lifting the veil, letting us come to our own conclusions regarding the morality of it all. The crisis as a global situation is never even mentioned, nor do we ever learn where the trawler has come from or where it was going; such details are incidental to the individuals in the film. And this is a key point; individuals are not responsible for making the crisis, but we are responsible for how that crisis is playing out. Kingsley himself is certainly a metonym for refugees in general, but he is also a terrified young boy to whom politics are irrelevant in the face of possibly having to watch his sister die.<br><br>In terms of problems, there are a couple, but they are relatively minor. For example, to a certain extent, the disembodied voice of the coastguard is something of a token villain. The simple binary choice faced by Rike is also perhaps a little too binary; clear-cut in a philosophy textbook kind of way. And the relationship between Rike (privileged white European) and Kingsley (suffering African refugee) is a touch over-schematised. The biggest problem, however, and for some this won't be a problem at all, is the decided lack of thrills. I've seen a couple of people talk about how the film would have worked better if the last act had more of a rescue thriller vibe to it. I agree with that. Just like I think the last act of <a href=\"/title/tt0120689/\">The Green Mile (1999)</a> would have been much better had the guards sprung John Coffey out of prison in an armed raid. Okay, I'm being facetious, but the point is, had this turned into some kind of maritime action movie, it would have completely undermined everything it was trying to accomplish. Yes, the complete lack of anything resembling excitement will probably bother some, as will the inaction of the main character, but such lack of kinetics is much more akin to the reality Fischer is trying to depict.<br><br>Styx is a film that asks difficult moral questions, without providing much in the way of answers, avoiding didacticism, and for the most part, remaining apolitical. As Rike's journey to her own idea of paradise intersects the journey of migrants travelling to what they hope will prove to be their paradise, the film presents not a story about a white saviour, but a story about white indecision. With the yacht serving as a microcosm for white Europe's reaction to incoming refugees, and the attendant social, economic and political dilemmas, Fischer acknowledges that this crisis throws up exceptionally difficult questions. The answers to which are up to us as individuals and as a society.","user":"Bertaut","rank":[25,38]},{"title":"What does a lean approach to directing mean","rating":8,"date":"29 July 2018","review":"One small point before touching the question in the title, that is the title of the movie. For those who didn't put too much effort into their Greek mythology studies. Styx is the name of the river leading from the land of the living into the land of the dead in the Greek mythology. Even more important is the fact that passangers on that river must have money with them or they won't be allowed into the land of the dead and will remain on the river for a century, in a greek version of Limbo.<br><br> Now that the movie's title makes sense, I'll discuss my own title. When a director chooses a lean approach to movie making, it means not using camera tricks not using any CGI, but rather making his own presence and the cinematographer's almost unnoticeable. And that's exactly what Wolfgang Fischer does, that is apart from two early scenes in the movie involving monkies. And in my humble opinion the movie would've been better without these scenes.<br><br> One last point: when one chooses a lean approach to directing it usually calls for a lot more from the actors. We get only two in this film, and the two of them are superb. Susanne Wolff and Gedion Odour Weseka, don't act their roles, they are the characters they portrey.","user":"ayoreinf","rank":[46,82]},{"title":"A moral tale too easy to suss","rating":22,"date":"22 March 2019","review":"The principal actress of this movie has obviously done a course in \"how to act in arthouse movies\": show a face of stone for two hours straight. There is nothing to laugh about in this horrible world full of sexists and bad people.\nThere is not much happening in this movie. Long tedious shots of her loading the boat (man, why show this for 10 minutes? she loads groceries, okay we get it !) and getting ready for sailing. Then the sailing. The the storm. Then the refugee boat. Of course, a refugee boat. What else. If you wanna gain entry to some prestiguous filme festivals and win prizes nowadays, you need a refugee boat. And a strong woman of course, who never smiles.\nThe follows the moral drama, should I take refugues on board or not? Rescue some lives or not? We all now the answer.<br><br>This is also as boring as it is calculated. Directors who jump on the themes of the present day and pack it into a moral tale.<br><br>Appropriated indignation, I would call it. Works every time. The way to go for medium talented directors. Even if you make a mediocre film , the subject (in this case: refugee crisis!) is gonna carry you to the high art house festivals and secure some prizes. Milk it, baby !<br><br>I always say: why not make a documentary of the real thing? Of what is actually happening in the middle sea? Better than this exploitation crap. This film won't change one persons mind or opinion about refugees. A documentary could.<br><br>Nobody, absolutely nobody wanted to see this movie in german theaters. I think it sold something like 6.000 tickets. Still, it it was nominated for a striking 6 Lolas, the german Academy Awards, half a year after it's release. That says it all.<br><br>I give 4 stars for good camerawork and great sound.","user":"flix_warrior","rank":[53,108]}]