[{"title":"Humorous, thought provoking, and spiritual look at a marriage decision","rating":8,"date":"22 October 2016","review":"The movie centers around the decision of one Haredi (commonly called ultra-orthodox ) Israeli Jewish thirty-something woman's decision of if/when/whom to marry. She has been having trouble finding just the right person for herself, partly because of the men she has been meeting but partly because she is an unconventional woman in a number of ways. When her engagement is broken off , she has an unusual reaction which is the linchpin for the rest of the movie including an ending which may be surprising to some.<br><br>The movie was billed as a romantic comedy; there are indeed plenty of humorous moments, but I think it's real attraction is the issues it raises about the process of deciding to get married, what one is looking for and how it can be related to issues of faith. And although it involves the Haredi Jewish world, I think the insights and themes apply to other cultures as well , while at the same time the movie provides an entertaining window into the Haredi world.<br><br>The movie is very well directed and acted and went by quickly. Contraryto another review posted here, the audience I saw it clapped heartily at the end and lingered afterwards. Recommended.","user":"latka-2","rank":[19,26]},{"title":"disappointing","rating":5,"date":"4 June 2017","review":"I had loved the director's previous film, Fill The Void, and was eager to see this follow-up, which also featured an Orthodox protagonist facing an unusual marriage situation. The film was neither very dramatic, nor comedic, and, unlike Fill The Void, totally lacked a believable premise or plot. No problem with the acting, but I felt the screenplay was seriously lacking. So much overwrought angst! The male suitors were either pretty faces or obviously tainted; none had any character development. Some serious editing problems and mistakes seemed to leave me, and other members of the audience I talked with, baffled over certain actions and plot machinations.<br><br>By the end, I felt let down by this film. The movie plan was as thin as the wedding plan.","user":"mikesil","rank":[11,17]},{"title":"Good movie. Outstanding performance by Noa Kooler.","rating":8,"date":"3 January 2017","review":"An orthodox Jewish girl, aged 32, is looking for a man to marry and spend the rest of her life with. Unfortunately, she has had no luck in finding a husband, despite countless first dates that don't work out for her. Either the suitors she chooses to date are either not her cup of tea, or else marry someone else.<br><br>The plot of the movie is very clever and compelling. Noa Kooler's performance is outstanding. Without a doubt she deserves the awards she has won.<br><br>Yes, there is a Hollywood style happy ending, but the path the movie takes to get there, especially the twist at the end, were most enjoyable.<br><br>A chick flick for the whole family.","user":"miclahav-44624","rank":[11,18]}]