[{"title":"An Interesting premise. Yet, falls short.","rating":5,"date":"28 September 2018","review":"Part autobiography, part morality tale, this coming of age \"life as a pre - teen prostitute\" story has all the familiar elements audiences have come to expect from similar films. <br><br>For example...<br><br>A down on his luck loner takes an at risk youth under his wing on a quest to seek redemption in a from their penury existence in a world filled with hatred, murder and revenge.<br><br>As they embark on their journey, the question ultimately arises as to \"who is saving who?\"<br><br>That is where the comparisons end.<br><br>There are many story components to the film that have promise, unfortunately the lack of verisimilitude in the world created, coupled with underwhelming cinematic craftsmanship undermines a competant cast who labor under the burden of one dimensional characters unjustly enslaved by stagnant and well worn expositional dialogue.<br><br>The film's saving grace is the interaction between actors Alexis Rossinsky and Aaron Hendry who manages to forge a believable performances out of some challenging material dealing with difficult subject matters.","user":"snamendolare","rank":[4,4]},{"title":"Wow, sorry to say it but they all are bad actors, even the kids","rating":2,"date":"26 September 2018","review":"I dislike hating on kids but some can act and some can't, and they picked the ones who can't for this movie. The adults are just as bad. I watched about 30 minutes and called it quits. It's so painful, and not because of the subject matter.","user":"elizrug","rank":[7,10]},{"title":"A little gem you shouldn't miss.","rating":9,"date":"13 September 2018","review":"After watching Lost Fare on Amazon, I checked out its website and several of the interviews with the cast and director. I was pleasantly surprised to learn the film was inspired by the abusive childhood of the original writer and details both the dark and light sides of her life, especially they way she learned the value of time and how to make the most out of every moment of every day. In spite of the film's micro budget, it looks amazing. Great ensemble cast, especially from the story's lead, Alexis Rosinsky -- who's already won several awards for her performance. She plays an abused 11 year old that's been forced into prostitution by her mother's pimp. To me, this little gem is what indy filmmaking is all about, original stories told with a unique vision.","user":"stevenfinly","rank":[12,20]}]