[{"title":"Intriguing and Atmospheric though Not Fully Realized Modern Noir","rating":6,"date":"28 February 2020","review":"The third (but first recognized) directional feature by Albert Shin, \"Disappearance at Clifton Hill\", provides a subtle but effective slow-burning small town mystery / psychological drama / modern noir thriller, albeit one that's potential is only half realized. With great attention for detail (and a little less for the bigger picture), competent performances, intriguing setting &amp; atmospheric cinematography and sound design \"Disappearance at Clifton Hill\" should please the fans of oddball indie thrillers.<br><br>This is, in its structure and essence, more or less, a standard mystery, but a good one, with bonus style points. The small town - faded town backdrop adds another point, and so does the pleasantly complicated and conflicted lead character of Abby, portrayed by Tuppence Middleton. The story is intriguing and compelling enough, but starts to fizzle out a bit towards the end with the screenwriters pulling a minor clutch with the very last scene. Throughout the movie, Abby sometimes connects the dots too easily and some moments in the rather serious and morbid story should have felt a little heavier than they did. You could say \"Disappearance at Clifton Hill\" pulls a few punches. Nevertheless, director Albert Shin knows how to orchestrate this symphony and every scene feels careful, peculiar, atmosphere-rich. Despite the never dissatisfactory eccentric detail and all the tasty, subtle flavor, the movie frequently tends to get lost in itself, resulting in \"the bigger picture\" being overly convoluted on surface while actually being relatively flat below. Technical side doesn't disappoint though, the original score by Alex Sowinski and Leland Whitty works wonders and is a major player in achieving the movie's peculiar atmosphere. The cinematography earns a compliment or two as well, \"Disappearance at Clifton Hill\" manages to excel at visually portraying a historically glowing, but faded and decaying community with a sparkle of unfamiliar nostalgia here and there. The audiovisual and aesthetical work on this movie rests on the level which I simply call top tier indie stuff.<br><br>In the end \"Disappearance at Clifton Hill\" stays above average and just more to impress with than to underwhelm with. Definitely recommended to the fans of indie mysteries, oddball thrillers and small town hurts. My rating:","user":"TwistedContent","rank":[8,13]},{"title":"Unexpected Gem","rating":9,"date":"3 March 2020","review":"In Scandinavia, this movie will pass unnoticed, which is really sad, as I think this is a truly well-crafted thriller that should be seen by everyone who wants to get lost in a mystery for an hour and a half on a rainy evening.<br><br>Moody and beautiful.","user":"fiende-38477","rank":[2,2]},{"title":"fun at niagara falls","rating":7,"date":"4 March 2020","review":"Nifty little thriller from canada. a woman is haunted by a kidnapping she witnessed as a child. much better than the 5 rating it's getting. see for yourself.","user":"cdcrb","rank":[3,4]}]