[{"title":"Good movie, poor details, inaccurate events","rating":6,"date":"29 December 2018","review":"I have always been fascinated about the 1973 war. Here in Egypt it's considered one of the greatest war and a huge victory. I read a lot about this period in Egyptian history, especially the books wrote by President Sadat himself and the army generals at that time. Also my dad was an army officer so I was able to ask and know a very specific and detailed info.<br><br>But this is the first time to watch and see the story being told by the other side. Considering that the director and the majority of the cast are from Israel, I expected nothing less than what I saw.<br><br>The movie as a movie despite the true events is good. From acting, to story line, to script to makeup, they're fairly good. The locations and decorations however were absolutely stupid, and I mean those in Egypt and in Libya. Those decorations were done over 300 years ago and a small research on the internet could reveal how they actually look like.<br><br>As for the events, which is the big question here, are they really true or not? It's yes and no. The main flow of the events was accurate, I mean yes Nasser blocked naval trade in front of Israel in 67, Israel responded and we. Egypt, lost our air force in 6 hours and lost the whole war on all sides after 6 days. Yes Sadat wanted diplomatic approaches. Yes we went to war in 1973.<br><br>But what's not accurate, for example, the way the movie portrayed president Sadat. Also that scene when 3 of his officials resigned and called them traitors that was absolutely nonsense. They, among another ministers, were arrested and imprisoned for a whole different reason. The idea of applying the Shepard guy story was totally not Ashraf Marwan's idea. If there's anything true about Sadat in this movie it was the line when he said \"He's completely unpredictable\".<br><br>The last speech by Sadat is originally in Arabic, presenting it in English was complete foolishness. The speech lasted about 15 minutes and worth to be watched alone.<br><br>One last thing, I understand why the director used a cast mainly from Israel, but the accent they spoke was very stupid. Also Libya's flag was wrong, don't know how they missed it along side the Egyptian flag.","user":"hesham-abboud","rank":[47,53]},{"title":"Confusing history, confusing movie!","rating":5,"date":"30 September 2018","review":"Passable spy thriller ... but the conclusions drawn by the film are highly questionable, as any reading of the real-life events indicate. Who the protagonist was actually spying for, &amp; what his motives were ... who knows? It's a bit annoying when a film purporting to be based on real life makes a huge leap into unsubstantiated speculation like this.","user":"peter-376-761113","rank":[26,30]},{"title":"So many plot holes","rating":5,"date":"26 September 2018","review":"Subject: 10/10; Film execution: 3/10<br><br>Ashraf Marwan is so-called the greatest asset for Israel as a spy in the 20th century. The film, however, failed to address the two central questions and thereby did not get viewers engaged emotionally.<br><br>The questions are (1) who Ashraf Marwan was (i.e. what brought him up to such a high ranking position even after his father-in-law President Nasser passed away); and (2) what his motivation as a spy was (i.e. why his patriot drive forces were not fulfilled within the Egyptian Presidential Office.) The biggest problem for me is the true reason why Marwan leaked critical information about war prep from his country to the enemy. The film seemingly described him like a peacemaker, but the leak served for only Israel's interests and caused damages on Egypt's side, from my viewpoint. <br><br>In order to fully illustrate the true story of Marwan, the film should've more deeply told about prolonged political tensions and dynamics between the Arab League and Israel, and more importantly described how Marwan made moves under the situation. Without explaining political efforts made by both sides, Marwan in this film looks merely like a betrayal idiot desperately in need of money. <br><br>Rather, the producers allocated more time to focus on soap opera-ish family matters and personal relationship between Marwan and his handler from the Israel Mossad. Such unstructured screenwriting and directing are everywhere in this film and derailed me from the main theme. So while watching I was frequently forced to google the Yom Kippur War in the 1970s as well as key players. And then I learned that the film ruined the original novel written by a political science professor. Although I only skimmed the novel, it is very informative yet intriguing and easy to understand in a politically neutral way.<br><br>This film could've been better if directed by someone else and made as a TV mini series, not a 2-hour film. Poor acting - which some other reviewers have already pointed out - is not mainly due to lack of acting skills or low budget, but inevitable due to shallow cheesy screenwriting with multiple plot holes.\nStill it may be worthwhile for those who are interested in but not so familiar with the history of the Middle East. At least for me it became a good start to further research for myself.","user":"Claudia-Jean","rank":[53,67]}]