[{"title":"Charming but often cliche","rating":7,"date":"13 September 2019","review":"It follows a tested and tried formula has an extremely likeable lead and was thoroughly enjoyably throughout despite its predictability and using the template of many successful sports films. The only thing that was slightly annoying was the subtitles were horrific often nothing like what they actually said and I'm not sure why they were needed anyway given it was in English to begin with. Doubt many would be disappointed with this and most will enjoy without it blowing anyone's minds or achieving any true level of greatness.","user":"muamba_eats_toast","rank":[5,6]},{"title":"Inspirational","rating":8,"date":"8 December 2019","review":"I see a common thread in outside reviews that the film is riddled with cliches and that may be so, but at the very heart of it is an empowering and inspirational story that echoes the very essence of what it means to be a Jamaican. That fight within us to endure and overcome even when life throws us to the ground. Despite the many struggles that the Jamaican people face whether it be because of socio economic status or family ties, there is this unrelenting resilience in Jamaican citizens that propel us to overcome no matter what. I felt the film really captured that, especially by showcasing this in the standpoint of Akeem a youth who is struggling to keep focused despite all the chaos around him. Being a Jamaican youth myself I have also come upon this feat and even have witnessed close friends, that go through the same struggle. So to see Akeem going through what he went through but then making it out is very uplifting and inspirational for many young Jamaicans out there. Also I really appreciate the positive male relationships that is portrayed in the film. In our Jamaican society it is hard to find positive male influence and although Germaine and Akeem and the father had their strifes in the beginning am glad that it turned around for the better.<br><br>I am very proud of this movie. It captures quite well the authenticity of the Jamaican people and experience in a wholesome way, something that is rarely ever seen on screen. I really hope that more films such as these will be made and that where the improvements are needed they will be made. Jamaica's popularity in the film industry is relatively young and so where there are shortcomings in the film there is always room to grow.<br><br>But for the most part. Big up Jamaica!\n:)","user":"sanayalucion","rank":[1,1]},{"title":"Solid 8 for a Low Budget gem of a movie!","rating":8,"date":"28 October 2019","review":"You know the word keep it simple but real?!!!! Now that word applies nicely to this low budget Jem and I'm in no way or form am marketing that movie for any purpose other than pure movie entertainment as I see soooo many fake reviews made on here Imdb that are either doing it to promote a movie through its makers or actually incompetent enough to review movies which not everyone thinking himself good at it is actually that good or even good in the 1st place!","user":"mmjnr10","rank":[1,1]}]