[{"title":"Moved along nicely and then disappointed","rating":5,"date":"16 September 2016","review":"This movie started out great, continued to intrigue with a decent story, the suspense kept building up nicely, and then it completely fell apart towards the end.<br><br>The only explanation I can think of is that they burned up the budget shooting the first 3/4 of the movie and only had about $100 left to shoot the last quarter. That, or perhaps some competent people working on it were fired with just a quarter of the movie left and then it was finished by a group of third graders?<br><br>The acting overall wasn't too bad and the scenery and cinematography was above average, which is why it's a shame it finished out so poorly, but it did.","user":"randymcbeast","rank":[60,66]},{"title":"Starts good..then goes downhill","rating":5,"date":"19 September 2016","review":"The movie starts out very good; you go into it expecting a good \"who done it?\" type of thriller, but then it goes downhill with the suspect killing people for no good reason (that is revealed in the movie anyway), it quickly became Michael Myers in Halloween movie .<br><br>The suspect offers the scientist a choice, then after killing 99% of the people participating in the study he still goes ahead and kills the scientist anyway. Why bother kill all those people then, then leave alive the person with the highest drug dose in her system? The movie ends with too many questions, even the killers motive is uncertain at the end of the movie.","user":"blackmirror-02450","rank":[25,28]},{"title":"Promising and Intriguing Beginning, Awful Conclusion","rating":3,"date":"11 October 2016","review":"The unemployed waitress Anna (Virginia Gardner) joins a group of college student in the isolated facility of the Hallorann Laboratory to participate in the research of Dr. Jerrems (William Mapother) to improve the memory and raise some money. Dr. Jerrems explains that only half of them will be injected with the drug – the other half will be injected with harmless placebo. Anna befriends Den (Nathan Kress), Kristen (Kirby Bliss Blanton) and Marcus (Mark Furze) and soon Marcus and Kristen are affected by an unexpected side effect and have the ability to see the future. Anna is also affected and discovers that she can see the other youngsters dying and Dr. Jerrems locks her in a room. Meanwhile a stranger breaks in the facility and there is bloodshed in the place. Den, Marcus, Kristen and Scratch (Ryan Higa) try to flee but Den wants to save Anna. Who might be the killer and what is his motive?<br><br>\"Tell me How I Die\" is a low-budget horror movie with a promising and intriguing beginning but also with an awful conclusion. The idea of a drug that gives the ability to see the future should be better explored instead of using the stupid clichés of the genre. My vote is three.<br><br>Title (Brazil): Not Available.","user":"claudio_carvalho","rank":[22,27]}]