[{"title":"Above average.","rating":6,"date":"21 September 2018","review":"I disagree with the descenters as being a stupid film, the writing purpose was to focus on relationships, so if your looking for adventure/action this is not your film.","user":"jakes2","rank":[18,23]},{"title":"A solid British drama which peaks when it's not trying to imitate the style of an American thriller.","rating":6,"date":"20 September 2018","review":"The likes of TV shows and movies such as Midsomer Murders, Miss Marple and more recently Broadchurch and Beast have proven that being a resident of an aesthetically perfect British town is severely detrimental to your health.<br><br>The same applies to Dom Lenoir's Winter Ridge, in which a serial killer who is targeting the elderly is on the loose in a picturesque seaside village. Detective Ryan Barnes and his newcomer partner Tom Harris are tasked with solving the case, but Ryan is struggling to come to terms with a personal trauma happening at the same time. His wife is in a coma after a car crash and it's looking unlikely that she will ever fully recover.<br><br>As the investigation comes to a head, Barnes is forced to accept that there are parallels between his own wife and the victims, causing him to question his moral beliefs. As he desperately searches for the culprit, Barnes' doubts increase; do the suggested motives of the crimes fit the killer he is chasing?<br><br>Matt Hookings leads the cast as Detective Ryan Barnes, a man whose proverbial plate is fuller than customers at an all-you-can-eat buffet. His performance is passable, but I felt he's been asked to vary his emotions far too much and instead settles for a middle ground of blank neutrality. There's the occasional outburst or scene of sorrow, but they're not quite convincing enough to impress. Still, it's a promising turn from Hookings in his first headlining production.<br><br>The standout performances here though are undoubtedly those of Ian Pirie and Hannah Waddingham. Pirie is ferocious as the troubled town drunk Mike Evans and continues his outstanding run of performances after starring in the menacing Netflix thriller Calibre. Waddingham is on the other end of the emotional scale as caring grief councillor Joanne Hill, and plays a large part in the success of the deeper themes that run through Winter Ridge. <br><br>On the surface, the film appears to be a straightforward serial killer thriller, but by the end there are some pressing questions asked and points raised about mental health, loneliness and isolation. These mainly come from Barnes' interactions with veteran performer Alan Ford (Snatch, Cockneys vs. Zombies and the definitely innocent gangster on Alan Partridge's Knowing Me, Knowing You) as ailing Dale Jacobs. It doesn't do much to answer them, and disappointingly the importance of them are largely diluted by its exaggerated conclusion, but it's respectable of screenwriter Ross Owen Williams to shed light on these topics.<br><br>Winter Ridge shines more in the moments of heartfelt drama between Barnes and his wife or the elderly residents than it does when trying to be thrilling. I found the chase scenes to be unnecessary and didn't fit with the rest of the film's tone. This is especially distracting in one scene where the two detectives pursue a suspect, alone, all guns blazing. I know it's fictional, but something about seeing British detectives holding pistols and flashlights as if they were in an episode of CSI didn't sit right with me.<br><br>I would've liked to see an attempt at more of an actual investigation in its place. Save for the standard drawing pin board of newspaper articles and a few coroner reports, the detectives jump from one lead to another, usually finding exactly what they're after. It doesn't help that the village seems to only have about four people living there, including the police officers and one of the most lenient Captains in the country who pretty much lets the duo do what they like as long as they aren't bothering him. If they do, it's a stern ticking off with no lasting repercussions. Understandable though; if the pair are fired, or at the very least suspended, there's absolutely no one in the village to replace them.<br><br>Nevertheless, a few strong performances and thought-provoking themes make Winter Ridge worth a visit, even if it's just a passing one.","user":"RA_Seaneth","rank":[15,19]},{"title":"A very well made, but simple psychological thriller","rating":8,"date":"24 September 2018","review":"I actually decided to watch this film due to the widely varying critique on it. The mere fact that it has seemly drawn in on a 'love it or hate it' response from its viewers really intreiged me. Be under no illusion, that this was most likely intended, and the part of a very intelligent plan to create a talking point, thus providing this film with this platform - this in its own right is a tremendous achievement. <br><br>Always know what it is that you are seeking before you made the agreement with yourself to watch a film - especially if you aren't a fan of surprises - this is what I would say to those who have shared a negative view. <br><br>I would say however that this film doesn't sell itself to be something that it is not. It is very good at serving the very purpose it is clear meant to. It's simple, it's thought provoking, and it is easy to watch on a Sunday afternoon, when your board of watching explosions or the perfect Hollywood romance blossom within 90 minutes of running time. <br><br>Yes this film will make you use your brain.. so if your after epic special effects and huge battle scenes this one isn't for you. However, if you enjoy reading, and using your mind to connect the dots and fill in the gaps, this is absolutely worthy of a watch. <br><br>It clearly attempts to mimic high budget US crime thrillers, which at times can be frustrating when this film clearly didn't have the same budget, but on the whole, I did enjoy it. <br><br>The acting on the whole was very good, but being lessor known actors, I think you have a job to make viewers fall for you. This is especially important when portraying a 'hero'. Perhaps it is fair to say, we needed just a little more from the lead in order to achieve this. This however I think was more a job for the writers and the director. <br><br>Other than this, I thought it was a very intelligibly executed effort to do something on a clearly low budget that many have failed to do with a much greater budget. <br><br>It's an 8/10 for me for effort, but I'd be very enthused to see what they are capable of with more resources. <br><br>I note that this film has won over 10 internationally recognised rewards from those who know far more about film making than I do - for a reason. Perhaps this film needs to appreciate from the perspective of quality film making rather than to be classically 'entertaining' which it is not, the whole way through. It is however a cinematic achievement. I would be very interested to learn what budget they actually had. I suspect in the thousands rather than the millions.<br><br>Some of the negative reviews are too harsh, and I suspect these viewers were expecting Iron man 4, rather than the reality of watching a film that is almost like watching your thoughts play out in front of you when reading a good book. <br><br>Beautiful scenery, although I found the backdrop a little mundane at times. It could have maybe benefited from some cityscape in the beginning before taking us to the secluded location where the events unfold.","user":"henrywhite-58043","rank":[16,25]}]