[{"title":"Heroine of the Wild East","rating":7,"date":"29 September 2017","review":"Frontier home, arid landscape, livestock and a recently widowed woman, Marlina, left alone to face a group of bandits at her door. It is not the Wild West of the past, but the Wild East of the present. The bandits tell Marlina that they are doing her a favor by taking advantage of her. \"You are lucky,\" they tell her \"if men still find a use for you.\" Therein begins the robbery, journey, confession and birth. If Marlina can stay calm and keep her wits about her, there is life at the end of the tunnel.<br><br>The cultural tapestry of eastern Indonesia, resiliency and determination of local women, ugliness of traditional male privilege and mystery of life, are revealed in this humorous, witty, bold and unique film. While some of the supporting cast are a little shaky with their acting, a few scenes are far-fetched and disjointed, and the dialogue could use added depth, the film is a compelling cocktail of intriguing and unusual characters, pretty scenery and uncommon circumstances. There are occasional scenes of violence and intense action, yet generally the film is easy going and delightfully slow-moving. Seen at the Toronto International Film Festival.","user":"Raven-1969","rank":[20,21]},{"title":"Very well-made satay western","rating":7,"date":"16 June 2018","review":"\"Marlina\" is a wester-slash-road-movie about an independent woman fighting back against male aggressors and seeks redemption or justice for herself. Throughout her journey through the desertlike rural area of Indonesia and its small villages (if you can call them that -- they mostly consist of single houses surrounded by desert and a solitary, dusty road), Marlina encounters a number of women who, if not as violently as Marlina, have in some other ways experienced injustice from men who were not condoned for it. <br><br>Not being an Indonesian woman myself, I cannot account for \"Marlina\"'s accurateness in depicting gender discrimination in the country, but it is probably safe to assume that director Mouly Surya is not particularly interested in providing deep insight the mechanics of sexism. \"Marlina\" is a feminist film in the same way that Tarantino's \"Kill Bill\" movies or \"Mad Max: Fury Road\" are feminist films: They portray strong female characters taking revenge on or otherwise trying to dismantle a chauvinist society that has wronged them. The specifics of the villains' ideology don't matter much -- in one scene near the beginning, one of Marlina's robbers compares her cooking to his sister's and his mother's, inviting the question, how does he treat these women that he apparently has some respect for, if he compares their cooking to that of his potential rape victim? The movie never attempts to answer or expand upon that question or similar ones, as all of the men in the film lack more-dimensional characterisations. <br><br>That is not meant to be a criticism of the film, though, as Mouly Surya wisely makes it stylized enough to make it work as a simple genre movie, a revenge tale set in an uncaring and rough world of rapists, thieves, and cowards. When Marlina rides on horseback on the sandy road, with the cut-off head of her rapist under her arms, the film enters almost surreal territory. This is helped by a great Morricone-esque score that, in several of the largely slow-paced scenes, builds tension. <br><br>Thankfully, in contrast to the men, most of the women in the film are given much deeper and more well-rounded characters to play. Even the comic relief character, an elderly woman who enters the drama as she is on her way to bring her nephew's wife his dowry, deepens the universe of the film's story (and gets a couple laughs, as well). Novi, a pregnant friend of Marlina's, is probably the most developed of the side characters here, and her arc is a very powerful subplot in the film. And of course, Marlina herself is played very well, too. It's admirable that, even if the movie overall is, by default, black-and-white in its characterisations, Mouly Surya allows her protagonists to show weakness, too, when they are confronted with potential danger and trauma. <br><br>The landscapes are beautifully shot, and although I would assume the film is a rather low-budget production, it never looks as cheap as it probably is. That's because the cinematographer has a very good eye for composing their images, and the lack of production value never shows. Another element that greatly deepened the film's impact is the soundtrack. The film is very slow-paced, so framing the shots in a way that invites you to look at them for a couple of seconds longer and laying good music over them that suits the mood of the story was very vital to the film's success, and in my opinion they pulled that off very well, for the most part. <br><br>The biggest downside of the film is that the slow pacing doesn't always work out perfectly. Because the story is so simple (and, quite frankly, if you've seen other rape-and-revenge films before, you know how these movies work), there are long stretches of film in which you know exactly where it is going, but it takes the story too long to get there. It's not always equally entertaining. Also, the lack of dimensionality in its storytelling can be a bit boring after a while. However, the high points are so high that I can easily forgive the film for some of its flaws and recommend it almost universally.","user":"richardgeuter","rank":[9,12]},{"title":"Enjoying an adventure","rating":8,"date":"28 February 2018","review":"This movie will serve you an \"adventure\" of a local widow in her struggle of survival and her attempt to have justice for her. The settings of the story is in Sumba which is shown as vast land of withered meadow where people are strongly bound to unique/unusual norms and cultures.<br><br>As an Indonesian myself I am surprised by the environment in the movie. They are really unusual and look really harsh yet they are still relatable in the daily life. I feel that I may had met people who have same characters and witnessed various situations like in the movie.","user":"yushendrayana","rank":[8,12]}]