[{"title":"Just about okay.","rating":6,"date":"8 February 2019","review":"Beyond The Night isn't a masterpiece but it's worth a watch as there are tons of worse movies than this one. As for the mystery level I figured it out when the movie wasn't even halfway through, and that's a bit too soon in this genre. The evolution of the story isn't bad but it's not perfect at all. There are some scenes that could have been much better if they would have put a little more effort into it. The story isn't new so you could have a sensation of déjà-vu. The acting was okay, no Oscar winners here, with nobody standing out of the lot, but also nobody acting mediocrely. All in all it's good enough for me to entertain me for awhile.","user":"deloudelouvain","rank":[4,4]},{"title":"Everybody knows Shelly","rating":5,"date":"23 February 2019","review":"Maise kisses an F-150 and they wait to pull the plug until her husband Raymond (Zane Holtz) returns from Iraq. He relocates to his small home town in upstate Pennsylvania with his son Lawrence (Azhy Robertson). In addition, to being cursed with the name Lawrence, he has a rather large strawberry on his face. Lawrence knows the town, even though he has never been there. He knows a lot about July Rain Coleman, a girl who has gone missing.<br><br>We already know the climax happens when the kid finally gets around to fingering the guy. It just takes so long to get there as we listen to a kid as talkative as the kid from \"Witness.\" It also shows a community that has too many yahoos with guns.<br><br>Guide: F-word. No sex or nudity","user":"nogodnomasters","rank":[3,3]},{"title":"Very Engaging","rating":10,"date":"31 October 2018","review":"I was totally engaged in this whole movie as I watched it from beginning to end. The characters were believable and the little boy was awesome. This story evolves from a missing teenage girl who disappeared several years earlier and the only one that can solve this mystery is the little boy. The boy didn't realize this until he and his father visited the town his father grew up in which the boy had never seen.","user":"mystichealer2","rank":[9,17]}]