[{"title":"Sex in Japan (or How Not to Make a Porno)","rating":9,"date":"17 October 2016","review":"Anti-Porno is another mind-bender by prolific Japanese cult cinema director Sion Sono. The North American premiere had a sold out seating of intrigued moviegoers. Some liked it including myself and my Japanese-Canadian friend who speaks fluent Japanese and other utterly disliked this bizarre piece of cinema. Understandably, this is not for everybody and is definitely in the sexually charged vein of Strange Circus (2005) and Guilty Romance (2011) realm rather than palatable post-apocalyptic dramas like Himizu (2011) or Land of Hope (2012).<br><br>Sono is an artist and has one the most disparate notions of time for his movies with his two best, Cold Fish (2010) and Noriko's Dinner Table (2005), clocking around 150-160 mins, but Love Exposure (2008) rambling on at 240 mins, while Tag (2015) ticked by in 85 mins. The Whispering Star (2015) is only 100 mins but feels like years with sparse dialogue and landscapes, long slow takes and black &amp; white interplanetary postal robot mood. Anti- Porno is his shortest here at 78 mins but packs a lot of tricks in a tight vision of lust and lost.<br><br>The movie starts with cute clichés and colourful art direction concerning sex and seduction in an S&amp;M and bisexual tension kind of way. Add a toilet, a toy, other girls as audience / participants, a taunt and a twist! <br><br>Ami Tomite who also started in Sono's Tag (2015) and The Virgin Psychics (2015) plays the lead and seductress self-proclaimed whore. She is a superstar and has her assistant prepare her packed daily schedule, including a photo-shoot, but verbal abuse, nudity, submission, sex, slicing of wrists and depravity ensue. Take a photo-shoot and video of all this<br><br>Then comes the role reversal and question of identity. Who is shooting who and playing who? Who is directing? Who is writing? Who is shooting a sex scene in the woods or in a room? Who is a whore and a virgin? How to emancipate ourselves? What is sex and what does it say about society and individuals?<br><br>This film raises many questions, is a welcome criticism of sex as a taboo and explores Japanese sexual repression and oppression specifically, but touches on worldly and beautiful themes with a mature, daring tone. The conversation of teenage girls and their parents at dinner table is priceless and unheard of. A necessary discussion of equals that makes you think while shocking your preconceived ideas about sex and parenting, even if you are a liberal!<br><br>Thank you Sono for again pushing the boundaries.<br><br>Lots of beauty and thoughts in this seemingly absurd and self- absorbed subtle sexual and mental exploration.<br><br>Japan 2016| 78 min | Festival du Nouveau Cinema | Japanese (English subtitles)","user":"christian94","rank":[47,55]},{"title":"this is one crazy film","rating":8,"date":"15 May 2018","review":"First off, this is one crazy film. Not altogether surprising as the Japanese films we get to see in the UK have a tendency to be pretty crazy and this being a film by Sion Sono, we should not be surprised if it is double crazy. Ami Tomite is beautiful and scary, skimpily dressed and nude but always shouting. Unless she is on the receiving end that is because things do change around a bit here. Lest we get too comfortable with her ordering others to strip and perform as a whore or a dog, it is being done to her. For fun or for the cameras, because there is also a film crew within the film. They also seem pretty crazy and in case we should get the impression that this is lots of sex and violence just for the sake of it, there is a devastating message hear that basically concludes that Japanese men will never allow Japanese women to be anything other than a dog or a whore. Nice!","user":"christopher-underwood","rank":[11,13]},{"title":"Definitely not a Marvel","rating":10,"date":"9 November 2017","review":"Well, let's say... it's not simple at all. You need to know some works of Japanese cinematography and paths they leads, 'cause otherwise Anchiporuno will be a big pile of trash with screaming naked girls and messed storyline. Actually it is. But digging deeper expose another level - a brilliant poetic style and very sensual emotion, just like dissonance sonates in early XX's. It's a searching, passion, movement and goal of what's happens in the movie.<br><br>Plus naked screaming girls. Don't forget, this is important. <br><br>Or just I think so. <br><br>I don't think that it has some message, pointing to sexual problems of Japanese society (but if you find it, that's okay, I'm not judging), rather uncertain sense of madness binding by personal disorder. Sexual ego jumping upside down, but in some kind of wild baroque dance. <br><br>Awesome.<br><br>When you're watching works by Sion Sono you can't just rate it in half-ten stars or seven, or any other way, you either catch his wave or spit on the screen in agony. This one is a perfect Sono- catching. <br><br>P.S. Mariko Tsutsui acting is 10/10.","user":"kim-de-form","rank":[23,35]}]