[{"title":"The Witch in the Window: Surprisingly enjoyable","rating":7,"date":"5 February 2019","review":"Let's be clear, though The Witch in the Window is advertised as a horror and certainly has horror elements it's hard to identify it as such. I don't know quite why, it just doesn't feel right labeling it as one.<br><br>It tells the story of a father and son who are refurbishing a house with a dark secret.<br><br>Not exactly original right? Thankfully it's revelations are well above par, the cinematography is great and our leading man is excellent. Even the kid was quite good considering how I despise crotch goblins of all shapes and sizes.<br><br>More of a mystery genre type than anything else it's an intriguing little film which despite my claim isn't horror actually managed to have the biggest scares and most disturbing moments I've seen from a film in months.<br><br>I actually jumped several times as well as the proverbial sitting on the edge of my seat. I was gripped, I was chilled and most importantly I was entertained.<br><br>Sadly once everything wraps up it's not actually all that great an ending, it should have by all rights been better. If I had to do an analogy I'd say this movie is a beautifully crafted multi tiered cake filled with yummy sweet stuff but instead of a cherry ontop it has a brussel sprout.<br><br>Regardless this is still a very enjoyable effort.<br><br>The Good:<br><br>Alex Draper<br><br>Disturbing understated imagery<br><br>Really quite scary stuff<br><br>The Bad:<br><br>Disappointing ending","user":"Platypuschow","rank":[25,32]},{"title":"A good ghost drama","rating":6,"date":"8 June 2019","review":"Possibly a bit slow-burning for many horror fans, but I enjoyed this one. The horror elements of the story are passable, but what really elevated it in my mind was the rapport and dialogue between father and son, which was quirky and believable. The ghost was fine, not super memorable, but with a couple effective scenes. The drama aspects of the film, however, made it enjoyable. For such a short film, it dragged on a bit at the end, which is why I docked points, but still definitely worth a look.","user":"C_Jags","rank":[7,8]},{"title":"Watch in the day","rating":8,"date":"16 December 2018","review":"Decided to watch this alone in bed. It was a mistake haha\nGenuinely creepy slow burning horror. Doesn't go for easy jump scares, slowly builds the dread. Great performances by all the cast, really great cinematography. If you like your horror to have a bit more depth then give this a go","user":"mrshiraz_gigs","rank":[20,29]}]