[{"title":"Cool movie, just don't sit next to a sneezing man","rating":7,"date":"5 March 2018","review":"I very much enjoyed \"Before we Vanish\" at Serbia's FEST2018, the premise of an alien invasion allowing the film to stage an entertaining but believable depiction of humans robbed of very specific parts of their brains, namely the supposed segments which would contain ideas such as \"property\" and \"self\". Despite running for over 2 hours it stayed on course til the end, even against ever-escalating violence, and delivered a nice payoff with an ending worth talking about. <br><br>The predominantly youthful cast had fun with the script, in itself already full of laughs, though it never wandered off into goofiness for the sake of it. Really my only complaint of the whole experience regarded the person sitting next to my girlfriend, a college-student-looking dude who at first glance seemed like the best type of person to be sitting next to in the theater, making use of his time before the lights went out to read a very old looking book; only to disappoint us and many others in the venue by not making it more than thirty seconds without letting out a sneeze, cough or long sniffle. Even so, this seriously ill person managed to have a few chuckles of his own, supporting the film's notion that men left without crucial concepts like \"contagion\", \"karma\" or \"decency\" could still live enjoyable, if oblivious, lives.","user":"edesimuh","rank":[12,18]},{"title":"Concept is cool, but the ideas are all over","rating":5,"date":"30 October 2018","review":"The first 20 minutes of this film are amazing, eerie and keep you on the edge of your seat. Then the rest of the film falls flat from there. Some cool concepts but they're muddled all over the place and in the end, it's a one dimensional film that had so much promise but never delivered.<br><br>Worth watching the first 20 minutes.","user":"dallasryan","rank":[8,11]},{"title":"Slow Motion Sci-Fi","rating":3,"date":"5 November 2017","review":"Seen at the Viennale 2017: At the beginning I liked this movie. I like the succinct dialogues that appear to be very often a trademark of Japanese movies. But with ongoing time, I sat in the cinema thinking: come on!, we got it, please show us the next scene. I did not look for the time. But it became a pain. Very often I thought, okay now comes the logical end. But no. Another intermediate dialogue had to be followed. And another one. And another one. At the end I was really exhausted.","user":"qeter","rank":[24,46]}]