[{"title":"As Shock Treatment is to Rocky Horror","rating":7,"date":"5 February 2020","review":"Bear with me for a paragraph. Most people don't know that there was a 1981 sequel to \"The Rocky Horror Picture Show.\" Brad and Janet returned (portrayed by different actors) in a new story that bore virtually no relation to the original. Fans expected \"Shock Treatment\" to be \"Rocky Horror 2,\" which it definitely wasn't, so the film quickly vanished into obscurity. However, those of us who were able to overlook the ties to the previous movie were treated to a quirky oddity that presciently spoofed reality television decades before there was such a thing.<br><br>I wouldn't go so far as to say \"The Jesus Rolls\" is ahead of its time, but I can't help but draw comparisons to \"Shock Treatment.\" Yes, Jesus Quintana originated in \"The Big Lebowski,\" but if you're expecting more of the same, you're going to hate it. However, if you can just forget The Dude's adventure and accept this movie for the oddball little dramedy that it is, it's enjoyable.<br><br>Jesus gets out of jail, where he's met by his buddy, Peter (Bobby Cannavale). The duo sets off on a small-time crime spree, soon teaming up with hairdresser Marie (Audrey Tautou), and forming an unusual throuple.<br><br>Turturro imbues Jesus with a lot of extra dimensions (although frankly, that's something that many fans probably didn't want to see, as there's little mention of his prowess in the bowling lanes). The always-wonderful Cannavale is perfect as his self-centered sidekick. Tautou is charmingly odd as the duo's free-spirited not-girlfriend. And Susan Sarandon deserves an honorable mention for her hilarious and heartbreaking turn as a recently-paroled woman whom the guys briefly encounter. Other reliable actors like Christopher Walken, Tim Blake Nelson, J.B. Smoove, and Jon Hamm all essentially appear in cameos.<br><br>The film's biggest problems are that it lacks a strong plot and antagonists ( I've never seen the '70s French film that this was adapted from, but I surmise that's where these issues originated). Basically, it's a road trip movie where strange things happen to our protagonists as peripheral characters come and go. Road trip movies usually have something that the characters hope to accomplish when they arrive at their destination, but motive is largely absent here. Instead, it winds up being more akin to a character study. There's also a question of how much time passes. No major spoiler, but someone is injured at the beginning of the film, and they seem to have miraculously healed long before the credits roll. I only mention it because it doesn't seem to align with something that occurs at the film's conclusion.<br><br>The movie's not perfect, and it ain't Lebowski 2, but I was entertained for 77 minutes. Honestly, that's all I can ask of any film.","user":"VinnieRattolle","rank":[30,43]},{"title":"You Will Want To See it... But Don't","rating":3,"date":"4 February 2020","review":"We all loved Big Lebowski. It was a masterpiece. And The Jesus was such a great little part of it. But it doesn't warrant this debacle. I could waste your time with long-winded, yammering examples of what's wrong with it, but you can probably already tell. Just watch Lebowski again. Unless you're like me, you haven't seen it for awhile. Personally, I just finished watching it, to cleanse myself of this. Great cast, bad movie.","user":"genious-35413","rank":[52,82]},{"title":"A Mismarketed Mess of Bad Decisions, but an Amusing One","rating":5,"date":"4 February 2020","review":"I can tell You right away that if \"The Jesus Rolls\" wasn't masquerading as one \"The Big Lebowski\" spin-off &amp; promising bowling goods on every one of its posters, audience's response would be at least slightly better. I certainly don't know why, but John Turturro went and inserted his iconic character Jesus Quintana in the world of the writer Bertrand Blier - this recipe couldn't have ended in a justified and crowd-pleasing spin-off. And, of course, it didn't.<br><br>Despite \"The Jesus Rolls\" being quite the mess, it's a rather amusing one. The few redeeming qualities include a top tier, doing-their-best, entertaining cast &amp; contrastive, colorful cinematography. Everyone, from John Turturro to Bobby Cannavale to Audrey Tautou, to minor appearances by Jon Hamm and Susan Sarandon, manage to season the movie with some charisma and humor. The biggest problem of all is the marketing device itself, the very fact that this is a \"The Big Lebowski\" spin-off. Despite Turturro having delivered the memorable character of Jesus 22 years ago, he has made a mistake by choosing to brutally insert him in a story which just doesn't vibe with what a \"Big Lebowski\" spin-off could've been or should've been. The character himself is still awesome in the hands of Turturro, but he delivers maybe only the half of the amazement he did the first time. \"The Jesus Rolls\", adapting a lot of Bertrand Blier's material from \"Les Valseuses\" or \"Going Places\" which was (still is?) this movies working title, before \"The Jesus Rolls\". So, based on the aforementioned source material, \"The Jesus Rolls\" cfeatures a more than fair bit of sex, sexual jokes, sexual vibes and, well, just a lot of sleaze. It's not bad though, it's just that it's the feel of Bertrand Blier and not the brothers Coens. To top it all off, I'll break to You this - the only bowling you'll get to see in \"The Jesus Rolls\" is in a three minute long scene. That's it, folks.<br><br>There's a singular huge flaw behind the filmmakers decisions for \"The Jesus Rolls\", it's not what it should've been (spiritually a Coens movie) and it's also not what it could've been (a rightfully marketed movie based on the works of Berntrand Blier), but at the end of the day \"The Jesus Rolls\" is an amusing time killer at the very least. My rating: 5/10","user":"TwistedContent","rank":[24,36]}]