[{"title":"inoffensive holiday family movie","rating":6,"date":"14 August 2017","review":"Joy Hoffsteder (Bailee Madison) has a dysfunctional family. Her single dad Bob (French Stewart) is over his head. She pines to be in her seemingly perfect neighbor's family. She's a band geek with only one friend. She gets picked on by the popular cheerleaders and has an unrequited crush on Tom. It's the Christmas holiday. She keeps picking Change from her deck of cards. Then she gets hit by a car driven by the 'perfect' neighbor Marcie. It's a body switched into Marcie's family. She becomes the popular volleyball captain with boyfriend Tom but things are not all good. Her new sister hates her. Her old best friend is scared of her. Her old family is a mess and she's not in love with her new life either.<br><br>This is perfectly fine for a simple family holiday. Bailee is good at playing the trying too hard character. She should steer into that persona. Everything else is fine. It's a Wonderful Life. It's all that but not as good. The production is a little better than TV movie level. Don't expect too much.","user":"SnoopyStyle","rank":[10,11]},{"title":"Funny & Not Cheesy","rating":10,"date":"18 December 2016","review":"This holiday movie will not give you trite rants about the holiday spirit or bombard you with clichés. Through the power of her tarot cards, a girl finds herself having the kind of life she envied, but realizes that everyone has to work hard to get what they want and that no one can earn friendships with everyone. Instead of moping, she takes responsibility and tries to adapt to her new lifestyle. The bond between her (Bailee Madison from Once Upon A Time) and her father (French Stewart from 3rd Rock From The Sun) is the biggest highlight. It is also important that she turns down advances from an emotionally abusive boy at school. It is an all-around feel-good movie.","user":"TeamRocket_Jessie","rank":[9,11]},{"title":"Not worth it.","rating":3,"date":"5 November 2018","review":"First off I wouldn't call this a holiday movie, just a movie that happens to take place at Christmas time. While the concept was good but the classic, \"the grass isn't always greener on the outside\", the telling of it fell flat. The ending was just down right horrible and made zero sense.","user":"acborgia","rank":[5,6]}]