[{"title":"It will make you smile while you are crying","rating":10,"date":"22 September 2018","review":"Unpredictable, emotional, well- written dialogue, heart felt performances. When I read the bad reviews I was in shock. How can anybody not love this movie ? It touches on the essence of relationships, from the happy moments to the tragic moments. Please ignore the bad reviews and give this movie a chance. It deserves it.","user":"franceskamehmeti","rank":[437,499]},{"title":"Ignore the critics and the soulless...","rating":9,"date":"25 December 2018","review":"...because I'm glad I did!!! For some baffling reason this has low IMDB rating...I almost didn't watch because of this and boy I would've missed out on yet another brilliant Dan Fogelman story. Crazy, stupid love happens to be a go-to movie of mine and This Is Us is one of my favorite tv shows. So my husband and I gave Life Itself a whirl hoping for something similar in style. I'm pretty sure my heart exploded with emotion...in the best possible way. I LOVE movies that make me emotionally vulnerable (like opening montage scene of UP!) and this movie nabbed at every emotion humanly possible in 90 minutes. My combat veteran husband (who keeps his emotions on reserve, mind you) said, and I quote, \"Next to A Star Is Born, this is the best movie I've seen all year.\" On top of that, the acting is superb. Grab some tissues and enjoy.","user":"ari_nelson","rank":[197,223]},{"title":"Beautiful","rating":10,"date":"29 December 2018","review":"I went out of my way today to review a movie. Something I have never done before in my life, but I felt I had to. I saw a review after watching the movie that made me upset. A reviewer said it was sad people called this movie entertainment when they didn't even watch the first five minutes of the movie. I was upset by this because I experienced this movie in a completely different way. This movie does an amazing job of portraying how life is terrible and wonderful and unexpected all at once. It shows how so many lives marked with tragedy can lead to something beautiful. I'm sad for anyone who is too small minded to understand and appreciate what this movie is trying to do. Amazing cast, great director, beautiful camera work and a captivating story. I loved this movie.","user":"shailee-71432","rank":[150,173]}]