[{"title":"Technically nothing new for me, but I'm biased as IT security consultant, for many years interested in related subjects, partly professionally and partly personal interests","rating":8,"date":"4 October 2018","review":"Saw this at the Movies That Matter film festival 2017 in The Hague. The primary topic of this movie is that surveillance can be used for good and bad purposes. An important example shown in this movie was indeed thought provoking. Images shot by the crowd were collected and used against the police, who at first indicted Bruno for having thrown a Molotov cocktail to a policeman. In retrospect, the actual offender proved to be an undercover policeman, who was tasked to demonstrate that the riots were serious and that the police should catch the perpetrator no matter what. We see this often, being a common tactic to provoke a forceful reaction from military or police, and to justify any means to achieve that goal. This time, luckily, the officials were forced to backpedal. Only one day later, when confronted with undeniable evidence, the police changed their position and released Bruno from prison, and the news media followed suit. We know the term crowd sourcing for raising money, and the above example showed that we can invent the term sub-veillance for this purpose, as the people's variant of sur-veillance, indeed a thought-provoking concept.<br><br> Strictly speaking, there is nothing very novel or revolutionary about it, given TV-programs like America's Most Wanted, Crimewatch UK, or the likes we see in many other countries. Common theme is that the viewer's assistance is solicited for an ongoing police investigation. Yet, the topic of this movie is something else. Said programs usually are on the lookout for tips after official investigations went dead. But sub-vaillance has other goals than helping the authorities, it differs 180 degrees from aforementioned TV-programs. It looks for yet unknown pictures and images with a heavy impact on public opinion when shown, though typically not in favor of the police or authorities in general.<br><br> The second main topic of this movie is that surveillance is commonly used by two very different parties. Firstly, we see it in the form used by commercial companies, who process personal data for their own corporate goals, like showing tailored adverts, or showing products you may be interested to buy, or collecting statistics about visitors. Secondly, we see it actively used by government and law enforcement to control people, to prevent crime and related matters, goals everyone deems important, no matter the side effects. Both use cases can work in our advantage or against it, but mostly a confusing mixture.<br><br> The final Q&amp;A after the screening brought a very relevant question forward from the audience, whether the companies selling hacking tools are to be considered criminal organizations and thus deserve to be prosecuted. There was a recent discussion about this in Dutch parliament, with an outcome that was not exactly the one we were hoping for. On one hand, official policy is to get zero-day vulnerabilities fixed because eliminating these problems makes the internet safer overall. On the other hand, the police can add these to their toolbox and are thus not prepared to stop using these, nor are they willing to be open about their use. The latter was demonstrated in recent court cases about the covert usage by law enforcement of so-called IMSI catchers, aka Stingray. These devices masquerade as cell towers and trick mobile phones into making a connection, thereby facilitating the interception of private phone data. There is much secrecy about it being used, and the outcome is still unsure. In said court cases, the police were not mentioning the tools used to obtain evidence in fear of being declared invalid material for the prosecution, and thus dismissed from the court case, maybe even leading to a mistrial or a lesser sentence.<br><br> All in all, this movie presents interesting material and thus discusses interesting issues, that should interest everyone. It is important for daily users of the seducing information and social interaction tools on their computers and smartphones. And that \"everyone\" also includes politicians, who expect (too) much of the technical tools offered to law enforcement and governmental institutions. These politicians and are only prepared to consider the negative side effects when a scandal appears in the news media.","user":"JvH48","rank":[2,2]},{"title":"Citizens against censorship","rating":5,"date":"12 January 2020","review":"Who is Ronald Deibert? He is the author of an excellent book titled \"Black Code,\" of which this mediocre documentary is partially based on. The book introduces readers not already in the know as to the hidden and darker areas of cyberspace, as well as to things like metadata, fibre-optic cables, and the democratizing force of citizen journalism, among a whole host of other Web-related stuff. It's a heavy and a disturbing read, but an important one.<br><br>As for BLACK CODE, the movie: It -- much like the book -- champions the need for privacy, for without which, it is said, there can be no democracy. But I found the movie rather poorly structured and, unlike the book, not all that informative.<br><br>The movie BLACK CODE examines a variety of human beings throughout the earth; specifically those who are living in locations and in regions where there appears to be a shortage of stand-up comics. I don't think too many people will watch this if in search of a light-hearted distraction. It plays as -- if not more -- ugly than the six-o'clock news, and we get a steady 90-minute dose of it.<br><br>There's numerous shots, mostly captured on mobile phones, of protesters; of law-enforcement officers with taser guns and stun grenades; there's accounts of torture; we're informed of the overly surveilled citizens of China; there's the account of a tragic killing of a peace activist; and then back to more images of street clashes with police, in some other part of the world. And all over, it seems, this thing called the internet. Although you wouldn't know it, if you had just started watching this at about the 1 hour mark. It was at this point that I began to lose interest. Read: captured confrontations, ad nauseum. If I didn't know any better, I would think BLACK CODE the movie was designed to make its audience feel depressed. Obviously, that is not what it sets out to do, but for me it had that effect. To the point that, at times, someone just tuning in would probably be at a loss as to what all the fuss was about.<br><br>The first hour is watchable, and is intriguing to listen to, whenever we get to hear from those at \"Citizen Lab,\" where Deibert works as the director (at the University of Toronto), but aside from this, the rest of the production is a bit chaotic and was too gritty for my liking.<br><br>I wouldn't want to see it again. Whereas the book is a comprehensive and in-depth look at its varied content, BLACK CODE the movie seems content with only wanting to highlight one particular aspect of it, and in a rather unfocused manner to boot -- like watching a camera, hand-held and unsteady.","user":"take2docs","rank":[0,0]}]