[{"title":"A solid human drama with bonus on court action","rating":6,"date":"5 August 2019","review":"Evolving from fun genre mash-up and action extravaganza Zombie Ninja's vs Black Ops, Australian based filmmaker's Kylie and Rody Claude take things back down to Earth in their newest cinematic outing with basketball themed character driven drama Balboa Blvd.<br><br>Filmed in the picturesque South Australian capital of Adelaide, Balboa is a proficiently shot and acted independent offering that is sure to please basketball fans the world over, while also introducing us to potential future star Ek Harris, whose central turn as Balboa's driven protagonist and basketball prodigy Marquise is one that is likely to see the budding actor garner a fair share of well-deserved attention from here and across the pond.<br><br>Marquise appears in almost every scene of Balboa's runtime and Harris is both an impressive athlete capable of delivering the goods on the court but also equally as capable delivering the emotionally driven aspects of Marquise's journey off the court, that see him try to overcome the fact he was given up for adoption at a young age by a mother his never met, while also dealing with his new friendship with Adam T Perkins mentor and coach Ray and potential love interest with Tiffany West's Stella.<br><br>Its undoubtable that Balboa (the title of which stems from the famous street in the basketball surrounds of sun-soaked Los Angeles) follows a rather predictable and tried and true formula and that the central relationship between Marquise and Ray could've been evolved further, but with Harris and Perkin's working off each other to great effect, there's never a time where you aren't enjoying your time with these two lost but likeable souls as they look to better each other in a dog eat dog world.<br><br>Another key element of Balboa that marks this down as an above average local independent offering is the handling of the cinematic moments found within the Claude's tale and both Kylie and Rody show a deft hand at capturing the raw power and captivating nature of one of the world's favourite games.<br><br>Utilising Adelaide's natural beauty and directing the ample basketball action on show in Balboa in a way that lets us sit back and enjoy the spectacle and skill of the sport, the Claude's ensure that Marquise's obsession with the game isn't just a story gimmick but a character unto itself.<br><br>By doing so Balboa becomes a much more universally appealing film that would sit right at home in the American, European and Asian markets not just the local one and whilst it's a problem with many home grown films, having limited appeals outside of the rather unique Australian tastes and sensibilities, Balboa's relatable human interactions and lovingly crafted basketball set-pieces ensure it's a film for all to partake in.<br><br>Final Say -<br><br>Lead on court by a fantastic central turn from rising star Ek Harris and energized by its basketball showpieces, Balboa Blvd may not be a slam-dunk but its strong heart and execution ensure it's well worth the price of admission.<br><br>3 beach-side buskers out of 5","user":"eddie_baggins","rank":[12,16]},{"title":"Below average","rating":3,"date":"10 August 2019","review":"Main actor has charisma and enough athletism and basketball skill to potentially make this a good movie, but the acting, editing and script are so bad that me and my son, who both play, watch ans are addicted to basketball spent the entire movie glancing at each other with a look of why are we putting ourselves through this self inflicted pain, but just had to keep watching hoping some good basketball scenes would happen... but no just stupid multiple angle same shot 1 on 1 with stupid music in the background, the supposed deep story behind this works on zero levels","user":"ramacfarlane","rank":[11,19]},{"title":"Ball is life!","rating":8,"date":"20 July 2019","review":"I had seen the trailer on YouTube so I thought i'd give it a go and it turned out great! Quality production, acting and the storyline was great. This is one of those movies you need to watch to inspire or motivate you. Also if your a fan of basketball you will like this to. I'm giving it a 8.","user":"d-ramseeey","rank":[9,16]}]