[{"title":"Many critics unaware of the main character's condition","rating":9,"date":"24 January 2020","review":"While looking throughout the majority of the reviews, it's become very clear that the majority of the public knows nothing about Autism. The first sign was his need for the trash bin lid to be down and then his need to wear the same hat. His collection of pens and lining them up by color, his inability to read emotions on people, his need to recite all the President's names, etc. The way he crinkled the doctor's table paper because of the way \"it feels and sounds\" was also a very obvious hint.\nHe even sort of mocks his own Autism disorder when he's talking to the mother of his daughter and \"flaps\" his hand in front of her face. Hand-flapping is a self-soothing that many on the spectrum do. People on the spectrum can have strong obsessions and the murder of this boy became exactly that. This is a soul who feels pushed out and lost in a world that doesn't understand him. He felt empathy or connection to a boy who truly looked at him in his garbage truck and would smile and wave every day at him. Most people don't look at or pay attention to garbage truck workers, so there's a similarity there as well.....the being unseen and the unheard in our society.\nHe is full of love and determination and empathy. He is a troubled soul who lost his father and is taking care of his sick mother. He has spent years wandering through life feeling unloved and misunderstood and now he has something he can do that he is proud of. He's taking away something bad in this world when no one else would. This gives him purpose and redemption.\nThis is a beautiful story. And, for anyone who immediately knew and understood that he was on the spectrum and included that in your reviews, thank you.\nThe world won't ever understand Autism if they aren't awoken to it by others. I'm more disappointed that the director never let the word \"Autism\" be used in the movie.","user":"caseypthompson","rank":[36,36]},{"title":"Excellent film.","rating":9,"date":"15 April 2019","review":"The main actor plays the role of an autistic man who is fixated on making sure things are left as they should be, from something as simple as a dustbin lid being left open to a serious crime being left unsolved, that is not how things should be and he will have no peace of mind until things are put right even if putting things right is a matter of life or death.\nThe main actor deserves an Oscar, his performance was amazing, the story is dark and tragic but overall it is a brilliant film, and I'm not easily pleased,","user":"brummieman","rank":[75,84]},{"title":"Solid, if fairly familiar, small-town mystery/thriller","rating":6,"date":"27 June 2018","review":"It is surprising to learn that this is a British made film. Made entirely with UK money, an English director and a couple of Irish actors in the two lead roles. Most impressive given that this passes pretty easily as an American product. It falls into a category of crime/thriller/mystery which there seems to be quite a few of, i.e. one set in a small town in the backwaters of the U.S. where an ordinary individual investigates or is hurled into a crime scenario. Many American independent films have been of this type in recent years and I guess this is one aspect which goes against Steel Country slightly, in that it is an overly familiar set-up. Nevertheless, it remains a good enough film with a very impressive central performance from Andrew Scott in the lead role of a bin man with an Asperger's type of condition, whose particular mind-set impels him to not accept a recent account of a young boy drowning. He suspects foul play and this leads him on a dangerous path with reveals dark secrets in the local town.<br><br>The film works more as a mystery than as a thriller; albeit, there are a couple of memorable scenes which fall under the latter bracket, including a surprising one near the finale. But mostly, this one focuses on an amateur sleuth seeking the truth and a town which seems reluctant to reveal all. Ultimately, this is a good, if relatively standard, bit of Americana (even if it is actually British!).","user":"Red-Barracuda","rank":[40,45]}]