[{"title":"Mediocre","rating":5,"date":"13 August 2018","review":"It's not as good as the previous episodes. This is just average. Everything is mediocre and a lot of scenes made me yawn...","user":"jeymatt","rank":[2,2]},{"title":"Let's Welcome Back Old Friends","rating":7,"date":"9 May 2017","review":"In recent years, out of the studios of Hong Kong cinema comes an unlikely movie franchise that doesn't involve gangsters, martial arts and ultra-violence. In a cinematic landscape indundated by super action movies franchises from the world's studios vying for our attention, Love Off the Cuff is a breath of fresh air.<br><br>Love in a Puff (2010) introduced us to an unlikely pair – Jimmy, a man-child working in advertising and Cherie, an older woman in the cosmetic industry. The movie has a distinctive indie vibe and is a marvellous reflection of a time when smoking is prohibited in many opened areas in Hong Kong and the couple had their \"meet cute\" in the back alley together with other chainsmokers.<br><br>Director Pang Ho Cheung thought their story has run its course, but someone actually created the email address fleetingly mentioned in the movie and it was flooded with emails from fans of the movie. Two years later, Love in the Buff (2012) dropped and in not so many words this movie has become one of my \"lexicon of love\" films. Cherie and Jimmy are practically old friends to me and my wifey, and we are so glad there are more stories to be told.<br><br>In this third chapter Love Off the Cuff (2017), we find Cherie (Miriam Yeung) and Jimmy (Shawn Yue) back from their Beijing work stint and have settled down into a routine with their relationship in a comfortable rut. Jimmy's \"godmother\" (Jiang Meng Jie) and Cherie's estranged father (Paul Chun Pui) with his young fiancé Apple (Wang Xiao Chen) come into their lives, and their couplehood is again fraught with tension and is threatened. The path to finding the answer will be filled with laughter and tears.<br><br>The movie opens with a fan-nod with a yet again uncontiguous scene that will make you wonder whether you have walked into the wrong cinema. I like the opening horror scene because it subtly paints Cherie's relationship insecurities, personified by a Gat Gat Gang, a huge monster which eats children. This ridiculous-looking Monster bookends the film in a fitting manner. Like the previous installments, there are cameos galore but I wished the filmmakers have chosen household names that I would know. Nothing beats getting Ekin Cheng playing himself as Cherie's boyfriend in Love in the Buff. This being the third outing, the movie slips easily into comedy territory because of our familiarity with the characters. The first gag is a raunchy one which recalls a policeman from the first movie.<br><br>This being the third entry in a rom-com genre is a minor miracle in itself. However, it is very difficult for lightning to strike the same spot a third time. The stakes are much lower because you know that no matter what they will come back together. The plot moves in a predictable manner without much narrative propulsion. The first two acts feel like a cross- stitch of situation comedy gags. We laughed but the narrative wasn't compelling, but thankfully every disparate part comes together in the last act in a satisfying manner. Get ready for some major Yatterman nostalgia. The movie also feels like a reflection of the changing social mores and landscape in Hong Kong. In the end, it is our love for the characters that draws a line from our heart to the couple's. I have seen Miriam Yeung and Shawn Yue in other movies, but nothing they have been in is comparable to their roles here. Their chemistry is palpable and lived-in.<br><br>Judging from the four (or was it three?) hilarious end-credit sequences, the franchise may not be in its last legs yet, but I hope Pang has closed the chapter on Cherie's insecurities and Jimmy's roving heart, and will take them to new places. Sigh writing this review made me miss them already \"n 55!w !\"","user":"ctowyi","rank":[4,6]}]