[{"title":"Seriously Lacking In Quality","rating":4,"date":"17 April 2019","review":"Johnny is a teenage revenant back from the dead and seeking revenge on those who did him wrong and betrayed him.<br><br>Just finished this up. This film is based on a book of the same name written by Gregory Lamberson. I've never read it but after watching this film, I can say that the STORY isn't bad. However, that's the only thing going for this movie.<br><br>Let's start with the acting. Yeah. Um..it's pretty rough. I can't say that even one actor played their part with any skill. Every actor in this was off. You could really see that the acting was being forced and that takes away from the viewer's ability to invest into what is happening. Sorry but it really was rough.<br><br>Let's move on with the sound design and cinematography. Maybe the boom operators are new to the film industry but the audio seemed to sound hollow from time to time and the actors just didn't seem to be picked up with any consistency. The songs for the soundtrack seemed amateurish too. There were some ok moments with the cinematography but it had some weird moments too.<br><br>Makeup and special effects. I guess the makeup was passible. There was some CGI stuff and although you can clearly see that it is low budget, it may have been one of the better aspects of the film.<br><br>The good things about this are that I found out what a revenant is and Johnny was a character I could get into. I'm not too crazy about zombie flicks. I know that I'm in the minority here but they just seem so played out and they come in so many variations that I am just over them. Johnny is a bit different.<br><br>A revenant is a being that has reanimated their soul into their former body with the goal of revenge. A zombie is mindless. They do not remember their former lives. A ghost can remember their former lives. So, a revenant is a blending of a zombie like body with a soul similar to a ghost. I'd never heard of a revenant but I like it.<br><br>Bottom line. This is a great story made with a low budget and unseasoned professionals. If you can get past the acting, watch it for the story alone. I'm really glad I made it to the end. Hopefully someone else will come along with a better budget and a bit more finesse and do right by the story.","user":"Foutainoflife","rank":[8,8]},{"title":"Painfully slow","rating":2,"date":"17 April 2019","review":"One of those flicks you sit thru thinking it's gonna get better and never does.....\nTrying to wrap my head around a budget of $240,000\nwhen it seems like something could've been done for $100 bucks","user":"coflorida","rank":[8,9]},{"title":"Really bad.","rating":3,"date":"24 October 2018","review":"Just don't waste your time. No budget and boring, plot is bad too. Weak acting also. Avoid unless a die hard zombie fan like me. Still feel cheated though.","user":"timothycrugnale","rank":[8,18]}]