[{"title":"Ridiculousness","rating":5,"date":"4 April 2018","review":"Does anybody associated with a Lifetime Movies for Chicks have a brain?<br><br>For the following comedy of errors, here's your cast:<br><br>Martin -- Dana's father\nDana -- teenage girl, new to town/school\nJulie -- Charlie's mother\nCharlie -- teenage boy<br><br>Dana and Martin move into town. Dana comes home from her first day at the new school and it's clearly her first time in the new house. Wow. What, did her dad find the house, set it up, then retrieve Dana from wherever she was that morning and take her to school? So she had never seen the house before?<br><br>Her dad is cooking dinner and serves it to her. Presumably around 4:00 when she gets home from school. Ok. Sure. We all eat dinner right after school, right? I'm sure she had a lot of extracurricular activities to attend to.on her first day at a new school, so maybe it was later. Right.<br><br>Let's fast way forward to Day 2. On Day 1, Dana met a teenage boy, Charlie, and he invites her to dinner for the next day. Day 2. By the end of dinner, she tells her dad, \"I REALLY like Charlie. You know that.\" Wow. They just met.<br><br>Fast forward another day. Martin leaves home with the top down and the world dry, picks Julie up from the art gallery, and takes her to lunch at his place. They get out of the car and now the driveway and road are soaked from rain. Top still down. Nobody wet. Come. On. They walk to the back yard where there is no sign it has rained. Great!<br><br>While Martin was gone, a woman takes all of 2 seconds to break into the front door of Martin's $8000/month home with what looks like a tuning fork. Right. And she leaves the front door open while she's in there. Cause that make a sense.<br><br>Meanwhile, while Martin and Julie are having lunch on his back porch, and a woman intruder is in Martin's House, Dana has a \"free period\" at school and WALKS HOME looking for her dad. Cause why? We don't know. No reason given. (LATER Dana says she ran home to warn Martin that \"someone may be on to us\". Yeah, you had to walk home to tell him that. Texting would not suffice). And of course, Dana leaves the door open even wider. Cause people in Lifetime movies don't close doors like the rest of us. Let all the flies in and air out, who cares?<br><br>But when Dana finds her dad, and he's with Julie, she leaves (and CLOSES THE DOOR!) and heads to Charlie's. Inexplicably, Charlie is home apparently skipping school. Though Dana just saw him at school and he was going to class while she left to run an errand during her free period.<br><br>That night, Julie comes home to find Charlie and Dana hanging out. \"Hi Dana\". No questions, no \"what have you teenagers been up to while I was at work all day?\", no nothing. OK.<br><br>Sheesh.<br><br>Oh man, I thought I was done, but late in the movie, a customer who (early in the movie) tried to return a painting to the gallery (because, as he told the gallery owners, he bought it for his girlfriend but they split up), and was offered an exchange but irately refused, is seen leaving the gallery with another piece, and the co-owner says \"I'm so glad you guys were able to work it out, she's going to love this one.\" And he says \"I'm sure she will.\" Sheesh. Actors should catch this crap even if the script writers and editors and directors and producers don't. Continuity, people. <br><br>SPOILER ALERT: \nOh, one of the best parts! Dana and Charlie burst in on the climactic scene and don't think to call 911 until Martin (who is bleeding from a gunshot in the heart area) suggests it. Fantastic! But, best of all, fortunately paramedics were able to just patch up the gunshot wound at his residence! No bullet fragments to worry about, looks like a simple bandage will fix that bleeding heart!!! It was just a flesh wound! Through the heart! Shirt's back on and everything! Awesome!\nEND SPOILER ALERT<br><br>The movie is fairly interesting for a Lifetime movie. But the ridiculous timeline gaffes and plot holes are distracting at best.<br><br>(This show was called \"Seduced by a Stranger\" when I saw it on Lifetime Movie Network in April 2018. Not sure what's up with the different title than \"Ring of Deception\".)","user":"opieandy-1","rank":[2,2]},{"title":"Almost worth watching","rating":5,"date":"29 November 2018","review":"Worth watching if there's nothing else on. Slightly different plot than normal in that there are two bad guys, but not on the same page. The boyfriend is just a crooked jerk who apparently reforms. His former girlfriend is truely a nasty bad guy. Although they could have improved that character. The daughter and her boyfriend are fine. But unfortunately this is a \"can miss\" movie.\nThis movie made me notice something that pretty much all movies have in common. That is practically every house in the movies, they do not have screen or storm doors.","user":"tomfsloan","rank":[1,1]},{"title":"Worth Watching","rating":6,"date":"4 November 2019","review":"My take is different from the other reviewers which tells me that this is worth watching because it strays enough from the LFM formula to allow alternate interpretations. I was irritated by the LFN wrap up because I sympathized with the villain more than the heroes. The LFM writers were going for the 'lovable rogue' meme with the villains target and the other reviewers and I agree that he was not so innocent. He ends up bothering me quite a bit.<br><br>Full disclosure, I pretty much fell in love with Lucie Guest when she stepped out in black attire as the villain, perhaps that shaded my judgment. But by LFM standards she was a mild a villain as you can get, ooh, she ran over a bicycle. Okay, she should have gone to the police instead of seek revenge but then you wouldn't get to see her where black leather gloves to hide her finger prints.","user":"chris-j-chuba","rank":[0,0]}]