[{"title":"Interesting at times, but neither a powerful romance nor an impressive historical drama","rating":7,"date":"2 March 2019","review":"This is a great example of how a film can try to juggle and blend two different genres, and despite never really getting either perfect, can still offer up interesting and engaging drama. As a result, The Aftermath is far from a perfect film, and its frustrating misfocus given the potential of its historical setting makes for an often underwhelming watch. However, it still has the elegance, dramatic intrigue and often even emotion to keep you engaged throughout, ultimately making for a thoroughly watchable, but not exceptional, film.<br><br>So, the two ideas and genres that the film attempts to balance and bring together are romantic drama and pure history, and it's the historical side that I'd like to start off with, because while the film features some fascinating historical themes, it also fails to capitalise on the genuinely enthralling potential of its setting.<br><br>Set in the immediate aftermath of the Second World War, the film centres on the relations and tensions between the British occupiers and local German citizens, with emotions and suspicion still running high following six years of all-out war. In that, the film looks at both the continuing negative feelings between both peoples, brought to life early on by Keira Knightley, as well as the idea that, with the war over, there is no need for recriminations in the face of a rebuilding project for the better of all, which we see in Jason Clarke's character early on.<br><br>Now, while the movie does occasionally hit those beats in a little too on-the-nose (especially when compared with how the same ideas are presented in the brilliant Land Of Mine), it's not quite as clear-cut as you may expect. Subverting expectations by reversing the stereotypical roles and seeing the patriarch hold more sympathy to the Germans, with his wife holding onto more antagonistic feelings following the war, The Aftermath does offer up some genuinely intriguing historical discourse, which builds to fascinating and often even palpably tense heights towards the end of the first act.<br><br>However, the biggest disappointment about this film is that it doesn't follow through. Despite a strong start from the historical point of view, its second and third acts don't offer all that much more on the same plain, with focus shifting abruptly to a romance that, while perfectly pleasant and enjoyable, just doesn't have the depth or intrigue to prove really impressive.<br><br>Of course, that's not to say that the entire historical context goes out the window, and the romance that develops still focuses on the idea of relationships crossing political lines - similarly looked at in films like Suite Française. However, it's far closer to a generic period romance, rather than one that blends historical themes in to further what was developed earlier on.<br><br>As a result, the film grinds to a little bit of underwhelming halt as it edges towards a rather predictable finale. It's not a boring watch, and with strong performances from Keira Knightley, Jason Clarke and Alexander Skarsgård, there is still intrigue and entertainment to find, but it all feels a rather frustrating and disappointing approach given the potential of the opening act's historical focus.<br><br>If you're looking for a nice romantic drama, this film can prove an enjoyable watch, but you'll have to wait quite a while for the romance to start in earnest. On the flipside, if you're looking for a historical drama that depicts the aftermath of the Second World War (as I was), the film starts off in strong fashion, but its move towards romance later on will likely leave you disappointed.","user":"themadmovieman","rank":[115,147]},{"title":"10/10 for Jason Clarke","rating":10,"date":"8 January 2020","review":"Jason Clarke is one of few actors who can give me goosebumps just by looking at him, goodness! He's an absolute human emotion machine. He moves you and sends chills down your spine with his signature expressions, not least his crying his heart out. Oh my god!","user":"henrycoles9","rank":[9,9]},{"title":"a portrait of unresolvable grief","rating":8,"date":"5 May 2019","review":"There are many reasons a beautifully made film like The Aftermath (2019) ends up critically panned. Some describe it as slow, melodramatic, and predictable, but such labels often reflect unfulfilled viewer expectations rather than an ill-conceived or poorly executed film.<br><br>Set in 1946, the plotline is straightforward with few surprises other than its final moments. It opens with British Colonel Lewis Morgan (Jason Clarke) and his wife Rachel (Keira Knightley) arriving in the devasted city of Hamburg to restore law and order, as well as to root out remaining Nazi sympathisers. The thoroughly middle-class Morgans have requisitioned a stately mansion owned by architect Stephan Lubert (Alexander Skarsgárd) and his rebellious daughter Freda (Flora Thiemann). Lewis is a compassionate man who cannot bear to send the Luberts to a squalid refugee camp and invites them to stay in the attic, setting the tension lines that drive the film. When someone remarks that more bombs were dropped on Hamburg in one week than were dropped on London in one year, we enter an inverted moral paradigm where the line between victory and vanquished turns grey.<br><br>The slow start has a purpose. Few films respectfully explore the humiliation of defeat and many viewers would ask 'why should they'? The Aftermath dwells on prolonged moments where the victor strolls in and takes over the home of the vanquished; where a population is deliberately starved to keep them compliant; where a once-proud culture must confront its inner demons. Deep unresolvable grief permeates the city as well as the lives of the Morgans and the Luberts. Both lost loved ones and the times are not sympathetic to healing. In the middle of this swirling emotional vortex, a classic 'Lady Chatterley's Lover' sub-plot becomes the narrative device for rebuilding lives.<br><br>This film stands out in the war-drama genre because of its nuanced portrait of the immediate aftermath of the Allied occupation of Germany. It reeks of period authenticity in ways that only British films can do. The stunning cinematography captures the horror of the immediate post-war period without the usual reliance on the tropes of military casuality and destruction. Knightley and Clarke's performances are outstanding, while Skarsgárd adequately fills the role of a grieving, if over-confident, romantic antagonist. As happens so often, Knightley's commanding presence and extraordinary range of emotional versatility stamps her ownership all over the film.<br><br>If history is only written by winners it will always only be half-true. The Aftermath is an essay about the other half, blending sufficient historical insight into a romantic drama to hold our interest without emotional sledgehammers. There are minor lapses of pace, maybe a narrative digression or two that dilutes momentum; but overall, this is a satisfying film that takes an uncommon view on unexplored cinematic territory.","user":"CineMuseFilms","rank":[52,68]}]