[{"title":"Lost in the earth, found on the moon.","rating":5,"date":"14 December 2016","review":"This is a 2010 Russian film, but now it released in the English language. A 3D animation about the moon mission, but involves the human pets in the main parts. In the 60s, when the Soviet Union and the US competed in the space programme, a dog name Pushok from White House and two other dogs from Moscow set to meet on the moon, followed by to find mysterious events. Finding a solution for it and returning back to earth is what this film is about.<br><br>First of all, this film is for little kids. The teenagers and the grownups would find it stupid, at least some of the parts. But they are not the target audience, so I feel sorry for rating it low. This is around 70 minutes long, that mean short and fast. The animation was okay kind, and so the story. Definitely not anywhere close to Hollywood or the rest of the European animation, but overall an acceptable flick. So I recommend it particularly for the below 9 kids.<br><br>5/10","user":"Reno-Rangan","rank":[2,2]},{"title":"3D kiddie toon.","rating":3,"date":"3 November 2014","review":"No surprises in this 3D entertainment for tinies<br><br>After some hi jinx on the ground with the lovable animal leads arriving at the space station, two space probes head for the moon, our heroic animal duo competing with the banana fueled monkey astronaut. There the puppy lead encounters his space hero dog dad and a little green man, who rescues him with his sticky tongue.<br><br>The plot and imagery are unsurprising. Their best concept is a fat very Russian cat than manages to channel Oscar Homolka.<br><br>This proves to be a children's toon sequel with not too much to recommend it to big people.","user":"Mozjoukine","rank":[2,3]},{"title":"You have To Imagine Half The Movie","rating":4,"date":"7 December 2016","review":"This is neither for adults nor for the young. The plot lacks logic so adults will not be able to enjoy it. On the other hand scenes are too fast for a child, it goes from one scene to another scene too fast and there is no explanations for events so it is difficult for a child to understand.<br><br>It is a about a dog family. Father goes to space but mother and children does not know about it. Then there was a strange cat who suddenly knew that the children's father is in space and tell the small dog to go to space. But there is no scene in the movie to show that how the cat knew about the incident. <br><br>And there is no details about the film. Characters are coming and going without any notice. Lots of character which were frequent suddenly disappear like the pig, president's daughter.<br><br>There is also strange relation between human and animals. Humans are sending animals to the moon. Sometimes it was shown that animals are talking to people and they understands and other times it is like it just barks and stuff.<br><br>It was weird. The writers wrote whatever came to their mind regardless of previous scene and did not make an effort to establish even a small connection between the scenes.<br><br>Not Recommended.","user":"niaz_islam","rank":[1,1]}]