[{"title":"Modern minimalism with timeless substance; Realistically Optimistic!","rating":7,"date":"2 January 2018","review":"Columbus, like many recent indie films, draws from the realities often overlooked and almost even concealed by the overpowering push toward modernity. Kogonada elucidates the real life emotions interwoven by relationships that are unhampered by technology; optimistically demonstrating how our feelings and thoughts are so salient in face to face experience that sustaining our reticence becomes more than unreasonable. The film is minimalistic in almost every sense; whether in the subtlety and astuteness of Hammock's music, the alluring stillness of Elisha Christian's cinematography or simply the fact that it was filmed entirely in Columbus Indiana over 18 days. The portrayals of Jin &amp; Casey by John Cho &amp; Haley Lu Richardson are overwhelmingly distilled and encapsulate the emotions of the characters in such a way to inspire both progressive introspection &amp; nostalgia for a seemingly boundless innocence. Though Columbus is dimly innovative, Kogonada shows an incredible attention to detail creating a powerful and cohesive film that is more than worth a watch.","user":"JoeMIH","rank":[32,38]},{"title":"An unusually great movie (because of/ in spite of) its very slow pace.","rating":9,"date":"2 October 2017","review":"I really enjoyed this movie, even though it was easily the slowest paced movie I have ever seen. I'm not sure why this worked. It was almost as if the movie gave the viewer time to think about the characters because there were so many pauses in dialog. There was a mysterious \"real life\" experience to watching the movie, unlike any I had ever had before, and I found myself thinking about the characters for days afterwards in the way I might think about a puzzling friend. \"Columbus\" should have been boring, but it wasn't.","user":"wainscoat-1","rank":[60,76]},{"title":"A Critique of a Critique","rating":8,"date":"24 September 2017","review":"Much like the city that bears the film's name, Columbus is a rare unspoiled gem in a sea of same-old, same-old. It's a spellbinding whisper; a soulful, sweet and self-assured voice that you can only hear if you can calm your mind for long enough. The film takes something as simple as two strangers getting to know each other and elevates it to an art with unspoken spiritual dimensions. Every frame truly is a painting here. The colors on the palette – our actors and the man made wonders that occupy the space.<br><br>The film begins with the collapse of an elderly Korean scholar who was in town to give a talk on modernist architecture. He slips into a coma, anticipating the arrival of his son Jin (Cho). Jin in turn is forced to put his life in Seoul on hold as he waits for either the death or recovery of his estranged father. While this is happening, Casey (Richardson) a bright, kindhearted towny and unabashed lover of architecture approaches Jin while out for an afternoon stroll. The two kindle a friendship that subtly shifts their perspectives; a bond that is as deeply felt as it is melancholy.<br><br>No words can truly describe freshman writer-director Kogonada vision in this film. Dreamy, contemplative, ethereal – all worthy words in any context but in film they come not as adjectives but unfortunate value statements. We as a culture have silently, perhaps subconsciously ascribed these words to mean languid and boring, refusing to acknowledge any portents of purposeful design. I myself have fallen into this trap plenty of times. I've watched a grand total of three Yasujiro Ozu films over the course of my life, and all three times I have been left wanting.<br><br>Kogonada is certainly mimicking aspects of Ozu here, including a deeply wistful tone and using water as a leitmotif. But Kogonada's approach does have some stark differences. For one, large generational shifts in understanding are treated in an overall positive light. Casey's astute work friend Gabriel (Culkin) expounds with increasing clarity the idea that different interests and habits don't necessarily mean we lose sight of what's important. As the film meanders through its story, the camera holds lovingly on Indiana's strange architectural wonderland as if to say the wise and the eternal can coexist with the new and the modern. In its own unassuming way, Columbus almost acts like a critique of a critique.<br><br>Most of the time however, Columbus is a beautifully captured human story pure and simple. The odd coupling of John Cho and Haley Lu Richardson is reminiscent of Scarlett Johansson and Bill Murray in Lost in Translation (2003) only both are objectively less world-weary. As an actress of incredible, disarming vulnerability, Richardson fills every room, field and parking lot like a beam of sunlight. She's always had warmth to her popular performances but with Columbus she proves that she's much more than a pretty face. John Cho likewise is tremendous as the prickly and wounded Jin. The script requires that the narrative chips away at his tough exterior slowly. Thus all the guilt, anger and regret he wells up inside needs to stay just exposed enough to hold the audience interest. It's a harder thing to do than it looks but thankfully Cho pulls it off with aplomb.<br><br>If Columbus has any fatal flaws it strictly has to do with scale. The film dwells on the inscrutability of life and the beauty of the world if one only looks, but then folds all these ideas in a movie tacitly about daddy issues and life no longer being a tutorial. Additionally it can be argued that if this is a movie about looking, watching and appreciating, than why are we following two people who use looking, watching and appreciating architecture as a cudgel?<br><br>Personally when I watched Columbus I was struck by its serenity. It reminded me of a Lao Tzu poem I once read that more or less goes like this:<br><br>The supreme good is like water, Which nourishes all things without trying to. It is content with the low places that people disdain. This it is like the Tao. In dwelling, live close to the ground. In thinking, keep to the simple. In conflict, be fair and generous. In governing, don't try to control. In work, do what you enjoy. In family, be completely present. When you are content to be simply yourself And don't compare or compete, Everybody will respect you.","user":"bkrauser-81-311064","rank":[46,62]}]