[{"title":"Nice film, unusual warmth","rating":8,"date":"4 October 2016","review":"Here in Israel we're accustomed to nostalgic comic dramas about tight-knit, down-at-heel neighborhood communities. Often the drama originates in marital conflict, with the blame on the husband; in this case, for a change, it originates in religious conflict, fundamentalist versus liberal. The film takes the liberal side but without demonizing the opposition. Marriages are affected, but the film doesn't demonize the husbands either. Everyone's marriage is fundamentally stable, a remarkable thing in the movies, and we even see a rare portrayal of grandparents who are not only still in love but still physically affectionate. The whole large cast of characters is impelled by good intentions, and they make the movie a pleasant Saroyanesque experience. At one point the action emerges from the stone alleyways of Jerusalem to show us a view of the spiffed-up Old City and we realize there is no attempt to explicitly set the plot in the past, although there are few reminders of the present day and the community seems to live as if it were sort of a Brigadoon still living the 1950s. It's a better place than our own, and well worth a visit.","user":"Nozz","rank":[10,11]},{"title":"Women rebel against arrogant young rabbi's rejection.","rating":8,"date":"22 April 2017","review":"The film opens on a bar mitzvah and ends on a wedding. In both the religious element is subordinated to the communal celebration. <br><br>In the first ceremony the boy becomes a man. In the second the older student betrays his rabbi master to serve his bride, again choosing community over the letter of religious law. In Jerusalem, of course, the daily life is suffused with the holy. It's tempting to take the collapsed balcony as a sign of God's wrath — if one assumes divine authority unto oneself, as the handsome young rabbi does. The film's primary thrust is to prefer communal harmony and trust over the harshness of a literalist faith. <br><br>The boy feels responsible for the synagogue's destruction because he'd prayed to be saved from embarrassment at being ill prepared for the ceremony. That's a comic version of the young rabbi's assumption of extraordinary power and authority, especially when he presumes to teach the old rabbi he plans to supplant. <br><br>The film takes a clearly feminist position on orthodox Jewish life. Specifically the film valorizes the women who refuse to be marginalized by the young rabbi. They raise the money and campaign to restore the women's balcony in the rebuilt synagogue. <br><br>It's not an easy fight, because the rabbi succeeds in shattering their friendships and cowing their men. Ironically, the women's campaign is not for the Conservative or Reform Jew's integration of women into the congregation but for the Orthodox insistence on their separate place. They are rebels for a conservative cause. <br><br>For all the Jewish reference the film can be read as the universal tension between any religion's orthodox fear of women and the modern liberalism. The film should play as pointedly to a Muslim or a Mormon audience as to a Jewish.<br><br>But the theme ranges even beyond religion. The central evil here is the young rabbi's sophistry. His domination of the community is due to his ability to hijack an essential truth and twist it to his subversive purposes. His opening sermon to the men is about the superiority of women over men, their embodiment of the scripture that a lifetime of study cannot match in men. But this ostensible respect serves only to diminish them.<br><br>This strategy got well beyond religion into politics and indeed any debate over values and truth. The devil can quote scripture. The tyrant can apparently espouse the argument for liberty, the most self-serving elitist populism. Though the film's plot specifically deals with religion, its overall theme is the danger of false pretences and the abuse of logic and authority for dogmatic advantage.<br><br>So too the fragmentation of the community — the disruption of friendships and marriages and neighbourhoods — is here specifically on a religious difference but can be read more widely as well, as a political drama or as a matter of philosophic dispute bringing more destruction than light. The power of the letter of any law — religious or otherwise — shrinks before the value of the love Zion and Etti exchange over his anonymous gift of a fruit salad and her return of his gleaming, empty bowl.","user":"maurice_yacowar","rank":[7,8]},{"title":"You'll have to think like an Orthodox Jewish woman in Jerusalem","rating":9,"date":"12 July 2017","review":"The Israeli film Ismach Hatani was shown in the U.S. with the title The Women's Balcony (2016). The director was Emil Ben-Shimon. The movie begins with the collapse of the women's balcony in an Orthodox Jewish synagogue in Jerusalem. The rabbi's wife suffers head trauma and becomes comatose. The rabbi, although physically not injured, develops what is probably PTSD.<br><br>A new, young, charismatic rabbi appears to help the congregants rebuild their synagogue. Rabbi David, portrayed by Avraham Aviv Alush, is a natural leader. That, indeed, becomes the problem. Rabbi David convinces the men of the synagogue to rebuild the structure, but without a women's balcony.<br><br>A non-Orthodox Jew in the U.S. might think that this is a good thing. Why do the women need their own space? Why not just mix with the men? The reason is that--in this context--mixing with the men is unthinkable. So the women would be segregated in a small room, still away from the men, but unable to directly observe the rabbi and the male members of the congregation.<br><br>The plot really begins at this point. Do the women get their balcony, and, if so, how do they do it?<br><br>I enjoyed this film because it was well acted, well photographed, and well directed. It also gave me a glimpse into a culture that is very different from my own. This movie is one of many outstanding films shown at the remarkable Rochester International Jewish Film Festival. We watched it at the excellent Dryden Theatre, in the George Eastman Museum. It will also work well on the small screen.<br><br>Note that this film has an anemic IMDb rating of 6.8. It's better than that, and deserves your attention.","user":"Red-125","rank":[8,10]}]