[{"title":"A family values movie that isn't schlocky","rating":8,"date":"22 June 2018","review":"I like movies with strong ethical centers but I hate movies that are predictable or patronizing. <br><br>I am so delighted when I find a movie about a family with positive attributes but is also genuinely funny and original. <br><br>This movie is all that! <br><br>It deals with some heavy issues but isn't ponderous.","user":"cahimdb","rank":[11,13]},{"title":"cute family movie laughed many times","rating":9,"date":"17 November 2017","review":"I had the pleasure of seeing this movie at the VA film festival and was so pleasantly surprised at how funny, light heart-ed, and family friendly (13 and up) it was. I understand why more females are rating this movie higher, because I could not see my husband and his buddies relating to it. (no guns,explosions or man man stuff) But if you want to see a smart,feel good, laugh out loud, and have a good time movie this is it. I laughed so much, I totally had, that hair at that age. I am going with my two daughters to see Permanent when opens in LA, I think it is going to be a great fun girls night out. I love Patricia Arquette in this movie and Rainn Wilson completely broke out of his \"Dwight role\" I can not believe he was funnier than expected. Kira McLean was such a great little actress, really funny and held her own with such large names working on this film, I look forward to seeing more from her.","user":"kitkhaos","rank":[20,30]},{"title":"quirky, fresh comedy with depth","rating":10,"date":"12 November 2017","review":"This is the type of film that may fly under the radar, but with the right distribution and support, could be a breakout hit. Looking at a summary of the plot, may be easy to dismiss as \"teenage girl coming of age story\" or \"teen comedy with a heart\" and thus not get the attention it deserves. But it is in fact a very closely observed, detailed and fresh examination of a family using the idea of hair styles and how they shape a person's public persona and inner self-esteem. The film is filled with unexpected twists and created a nuanced, at times hysterical, portrait of a small southern town. Fantastic performances. Though very funny, there is also a poignancy to it which never becomes sentimental or easy. Really hope this finds a mass audience, for if it does, it will be a hit.","user":"onaona-74151","rank":[15,24]}]