[{"title":"start point","rating":31,"date":"31 July 2019","review":"A delicate theme. The voice of Jeremy Irons. A story for present, proposing a not easy message to contemporary society. So, the controversies are not surprising. From the stat of manifesto, for a part of public, to the historical accuracy and eulogy of Islam or Catholic Church. In fact, it is just a start point. For see, in new way, the near reality. Sure, it can be perceived as a fairy tale or as propaganda, or as polite work. But it represents a real start point. And it is enough.","user":"Kirpianuscus","rank":[3,3]},{"title":"Like all great art, timely, though provoking and acutely relevant","rating":7,"date":"1 April 2017","review":"From the Films on Religion category comes 'The Sultan and the Saint'. I was surprised to see this strong of an entry in a festival with such humble beginnings as the Calcutta International Cult Film Festival. A film that has obviously made its mark as a top quality production internationally, especially with the auspicious narration from Jeremy Irons. And then I thought, what perfect timing it was to circulate something positive and hopeful about the dynamics between Muslims and Christians.for a change.<br><br>This historical drama about a meeting between St. Francis of Assisi and Sultan Al-Kamil during one of the many tedious and violent Crusades, is informative if not inspiring. The value of this production lies not only in the cinematography, design and location, but in the many experts who collaborated on the project. Historians, art historians, religious thinkers and social scientists collaborated, to share their areas of expertise to tell this story.<br><br>This is a hard review to write for me, being one who is empathetic toward the human condition. I'm an American and my country has been involved in much geopolitical posturing in the Middle East for decades. The War on Terror has thrust many a good person into a state of \"nationalist\" paranoia and this cannot stand if we are to continue on as a nation and as a species. Even though we all come from our own environmental \"nurturing\", we sometimes lose track of the historical causes for unrest when we're being hit hard by the effects of history today.<br><br>Written and Directed by Alex Kronemer, and featuring Alexander McPherson and Zack Beyer, this documentary is an example of what I like to call \"good\" propaganda. Art, as free as it pretends to be, can always be recruited for the agendas of church and state. The visual art of independent filmmaking demands a departure from the censorship of either. It was refreshing to see how opposites can attract no matter how polarized the status quo has become to form a unifying message.<br><br>Like all great art, timely, though provoking and acutely relevant.<br><br>E.J. Wickes/Cult Critic/CICFF","user":"hlc-cicff","rank":[12,18]},{"title":"Propaganda","rating":1,"date":"27 December 2017","review":"Pure propaganda. Questionable history. A great deal of speculation. The beach is real, and beautiful,; it was filmed on Assateague Island, in Maryland.","user":"astrologygoddess","rank":[13,25]}]