[{"title":"Left with to many questions","rating":1,"date":"14 July 2019","review":"First off i started an imdb account just so i could post a review. I dont think in my whole life i have ever watched a movie that was this bad, EVER. And i have watched Ed wood movies.\nThe transitions from one scene to another were non existent. They tried to make the lead actor into an action hero but failed. I know that actors in movies cant do anything with a bad script or director, but i dont think anything could have saved this movie. I am sad that so many trees were destroyed in the making of this film if they used paper for the scripts.\nHaving said all that, i love anything zombie so i made myself watch it and to be honest it was horrendous.\nIf you're looking for a good movie or even an alright movie keep looking. I had to stop the movie several times to rewind it because i kept feeling as if i missed scenes but i hadnt, its just made this way. If you dont mind either wasting your time or money then this movies for you.","user":"rpatt-12248","rank":[1,1]},{"title":"And this is why you should avoid that holiday...","rating":2,"date":"29 November 2018","review":"Anything even remotely zombie, and I am there. However, more often than not does it turn out that the zombie movies are horribly. I had not heard about \"Valentine DayZ\" before stumbling upon it by sheer luck. And of course I gave it a go with no hesitation.<br><br>\"Valentine DayZ\" was a most horrible movie experience in many, many ways.<br><br>Let's story with the storyline, which was next to non-existing, and whatever coherency they did manage to put together from the fragments that made up the storyline, it was just not worth the effort. The plot was laughable at best. And the movie was just full of characters that you didn't care for in the least.<br><br>The zombie make-up was atrocious. Yeah, this is the style of zombie make-up where they opt to slap gray make-up on the face, dark circles around the eyes and frizzy hair. Yup, that was about it. Oh, I almost forgot the green blood. Because we all know blood changes color out of the blue. And the sounds these zombies were making just made the zombies seem like ridiculous spoofs on other zombie movies.<br><br>The dialogue in the movie was every bit as staggering and halting as the rest of the movie.<br><br>I dozed off once along the way, but eventually managed to sit through the movie to the very end, in the slim hopes that it would pick up and become better... It didn't!<br><br>If you are a zombie fan, don't bother with spending your time, money or effort on watching this movie.","user":"paul_haakonsen","rank":[1,1]},{"title":"If you came here for Carrie Keagan,...","rating":6,"date":"9 October 2018","review":"..., you probably won't be disappointed.\nBut if you came looking for Shakespear, look elsewhere.\nAnd if you came looking for something silly to watch with your partner, you'll probably end up laughing and grimacing in equal amounts.\nQuite beautifully framed and lit visuals, edited in a deliberately off-kilter manner, even if the dialog and acting is less then stellar, it's still an original work, though it's not until this one gets really effed up in the third act that it gets good.","user":"pidstr","rank":[3,7]}]