[{"title":"Wasn't bad. Would've benefited from Bigger names and better soundtrack","rating":7,"date":"16 January 2020","review":"This movie realistically was not a bad comedy. It would've benefited greatly with bigger name comedians and a better soundtrack, in regards to mass appeal. The script really wasn't any worse than what you would see in the theaters under this genre on average. Worth a watch. I enjoyed it.","user":"mielemurda-497-373240","rank":[7,12]},{"title":"A terrible film","rating":1,"date":"18 January 2020","review":"The premise sounded interesting: Billionaire pays high school class to re-enact one month of high school. Well, maybe \"interesting\" is too much, but it sounded Netflix-plot-worthy. Good enough to watch when literally nothing else interesting is on.\nAnd then there was the execution of the plot. I get it, this film looks decent enough, has multiple locations and real special effects, so being still relatively low budget, I assume the casting director went to a local restaurant in LA filled with aspiring \"actors and actresses\", and just emptied the place, because this is the largest assortment of C-list actors I've EVER seen in one film. Not a single recognizable face. Not even the lead. And you know what? That would be perfectly okay, if the cast had talent or at least a few talented members, because even great actors have to start somewhere.<br><br>These...aren't those actors. For some reason the lead has a very noticeable lisp, I'm assuming that's how he \"got into character as a nerd\", because the \"nerds\" in this film are delivered in such a heavy-handed way, you'd think The Big Bang Theory was a quiet character study of a slightly eccentric group of friends. The guy is an ultra billionaire Steve Jobs rip-off who is completely unbelievable as a genius or businessman or friend. He immediately abandons his one lifelong friend to hang with former HS jerks, and to hook up with someone obviously only into him for the prospects of his money.\nThe premise plays out with little jokes and even less humor, and the inane dialogue is just...awful, to sit through. Whoever wrote this script must be from an alien planet or a toddler, because they obviously haven't had human emotions for very long. Characters just immediately flip motivations for absolutely no / little reason, and the plot telegraphs what'll happen next a mile away.\nThere's a running \"poop your pants\" gag that runs literally the entire length of the film. That's the quality you're getting here.\nOh! And if all that wasn't bad enough, there's a super awkward scene where the lead is actively talking up how good the Revenge of the Nerds assault scene is. Could this film be more tone deaf? I might think that was on purpose, some meta reference to show you what a dip the lead actually was, but this film isn't that clever.\nMy advice to all, cast, directors, writers: Go to / back to school. Please, for the love of all good things. Go back.","user":"rmmil","rank":[2,6]},{"title":"Could have been better...but could have been worse","rating":5,"date":"5 April 2020","review":"You just have to appreciate this for what it is, or don't come knocking on the door. What we have here, is Canadian comedy film that brings comic efforts to the table. It's just too bad most of those efforts are forced. Although they tried to put together a quality, R rated film together here, its safe to assume most of the humor here is either dry, lame, recycled, or just plain dull. I would say in the entire hour and half running time, I got maybe 3 solid chuckles out of it. ( Averaging one every half hour, you decide if its worth your time.) Adam Pi is a very successful business man in the big world. Our film opens up with a commercial Pi put together, and from here, all we establish is that he's a rich man with more money then what he knows what to do with. He has it all. That is, he has it all, except for good memories of high school. After a high school reunion ( Class Of 97), Adam comes up with an idea....he wants to relive high school all over again, same students, now older, same teachers, now older. Some of them cannot do it, because they are established with the jobs they already have, and cannot give up their rent or mortgages to go back to a stupid school so that Adam can conjure some good memories for himself. That's where he sweetens the deal. He tells them that he'll pay for their full salary for one year, so that they don't lose anything, to go back to high school. Most of them are in. So what we have, is kids born in the 80's, went to school in the 90's, revamping favorite scenes of old 80's films, most of which belonged to John Hughes. ( They even go to Hughes High. I am 100% certain that I've seen that somewhere before!) It's just people who have gotten older, most of them haven't changed their ways or attitudes since they were teens, that is, except for Adam...which explains how he earned his nest egg, he worked hard for it! This is altogether a fair shake at cinema quality, its certainly no worse then some of the other comedy titles that have been handed to us over the years, being here in the United States, so I refuse to be too hard on a film that is what it is. So don't knock it around for what its not. I'm giving 37-Teen 5 out of 10 stars.","user":"tdrish","rank":[0,1]}]