[{"title":"Not as bad as review by others","rating":8,"date":"18 August 2017","review":"The movie lack of numerous characters, may be a low budget movie but it goes straight to the point. The movie has 1 topic and stays on track on that topic. Maybe that's why some people doesn't liked it much. There's no love story and there aren't numerous extras around. Like I said: it stays in one story line. I liked it because it doesn't have all those special effects from movies nowadays were you can tell that's fake or that's computerized. Yes, the fights are kind of slow but is because nothing is over reacted, everything looks like it should, if it was a real situation which I think it was a good change. It could of have better scenes but I think is worth watching. Enjoy!!!!!!!!!","user":"shino_chino","rank":[20,25]},{"title":"Weak actioner","rating":3,"date":"13 May 2019","review":"I frequently watch direct to DVD movies, enough that I am often more forgiving of any weaknesses they may have, and sometimes finding that the end results are pretty good. However, I am unable to muster much enthusiasm for this particular effort. Past IMDb user comments that the movie looks pretty tacky are unfortunately true; the movie really has the look and feel of a modestly budgeted television show. That might have been forgiven had the movie shown enthusiasm in other key areas, but sadly the bulk of the movie is not executed well. The script frequently has dialogue that sounds cliched and/or stilted, and plot turns that won't be much of a surprise, like who the mole in the S.W.A.T. team ultimately turns out to be. The action sequences, whether they are shoot-out or martial arts battles, are lamely choreographed and edited/directed in a mechanical manner. About the only bright spot in the entire enterprise is the presence of Michael Jai White, but even he can only do so much with his lame surroundings. The only possible useful thing the movie does is that it makes the original 2003 S.W.A.T. movie - which wasn't so hot - look much better.","user":"Wizard-8","rank":[4,4]},{"title":"Amateur hour (and a half - run time).","rating":3,"date":"31 July 2017","review":"What do you get when you assemble an amateur director and writers? S.W.A.T.: Under Siege<br><br>Sure this is a C-list, low production independent film, but it could have been much better, at least in a few areas. It seemed this was more of a failed low budget TV show production.<br><br>The story: done thousands of times - this being one of the worst The directing: amateur hour (and a half - run time). I have seen worse, but this film needed strong directing to get over all the other humps, and it wasn't there. The score: terrible. So bad in fact I noticed it every single time, and it did nothing to the scene but annoy me. Was it me, or did they try to get some of the original SWAT TV show jingle in there? The acting: atrocious - every single actor. Partial blame to the director, screenplay and casting director (see below). The editing: was there any? Where there was (fight scenes), it was too soon or too late. And for the first time, I will review two categories I've never reviewed before... casting &amp; action choreography.<br><br>Casting: There was not even one actor that fit their character, especially the SWAT team. Since when are there that many women on any one SWAT team? Adrianne Palicki was the worst in her role, the most unconvincing, especially as the sexy (why?) Captain (fail). And Michael Jai White did not belong in this film, I could not stand that fake overly-deep voice he was trying to pull off.<br><br>Action Choreography (fight and gun-fight scenes ): the worst I have ever seen. Add to the fact the amateur directing and really bad editing, all the fight scenes were way too long and very fake and unconvincing. Michael Jai White is getting too old and out of shape for these type of films... he's no Jackie Chan, that's for sure. The girl cat-fight was the worst.<br><br>I expected more and got much less. Thank God it was only 1:29 min long. Don't waste your time with this unless you're really bored. Rating this film on its merits of a C-grade indie film, it's still only a 3/10.","user":"TheTopDawgCritic","rank":[15,29]}]