[{"title":"Unexpectedly Moving","rating":9,"date":"13 January 2018","review":"I picked this movie to watch because of the title of the movie. I knew 'gook' means something offensive to Asian people in English, but in Korean language, it's not an offensive word so it made me curious. This movie didn't grabbed my undivided attention in the beginning, but more and more into the story, I got so hooked. This movie made me laugh and cry both. I really enjoyed watching the film. Seeing the characters' connections to each other slowly being revealed as the riot got more heated in the story really built the drama. It was very rewarding film to watch. The acting in this film is crazy awesome. I'm so looking forward to see another film by the same artists again!! Please~~make more films!","user":"heejooyoon","rank":[9,10]},{"title":"Tragic story from a rough place and time","rating":8,"date":"29 November 2017","review":"I believe Gook should not be overlooked. It is a film that will not leave you cold-hearted no matter what you think of it. It is set in Paramount, 1992 just before and during the riots in South Central, Los Angeles. The storyline is very simple but it never loses momentum or becomes dull. Not many films show what it was like there during those rough times since we so often only see the glamorous side of the city presented to us by the film industry. But not everything was and is always sunny in California.<br><br>The riots were fueled by the anger of people that the justice system failed. Some might say that there are too many stereotypes presented in the film whereas I think its goal was to depict to what extremes things can go where people find themselves stuck in a place that rarely offers an escape into brighter future and others only see them as lost causes and are left on their own. You can find good and bad people everywhere but unfortunately not everyone are equal which might cloud someone's perception of things.<br><br>I would recommended it if you are looking for something different, very well acted and gripping. The direction is good and the film works well in black and white. Do not read too many reviews prior to watching it, I think it stays more fresh that way..","user":"Lugo1989","rank":[12,15]},{"title":"Emotional and fun storytelling at a sad time W/O getting into the weeds","rating":10,"date":"27 August 2017","review":"I really enjoyed the movie and feel like it captured a lot of the interactions I had witnessed and encountered growing up. It was interesting to see how no matter what parts of the world that you're in, some things never change. As an Asian American I was able to relate a lot to the movie but was also drawn into all of the characters and it was well written, acted and directed. Although the movie was set during difficult times of the aftermath of the Rodney King verdict, the movie didn't dwell into the details of it but rather provided the perspective from everyday people in LA around that time. Back in those days, gangs were a lot more prevalent in LA and of course it was more dangerous. In this movie, you get to see how different people perceive each other based on their race and history. Different cultures are intertwined and everyone is trying to survive to make a living whither it is legal or not. But what's most interesting is seeing how two family's history can connect people together and how conflict is not without its consequences. David So was funny and you feel sorry for him as he experiences a bad day throughout LA. But he has it easy in comparison to other characters you start to care for who go through more struggles when they shouldn't have to. The ending was very emotional and you feel for those characters. Justin Chon did an excellent job with everything since not only he wrote and directed but acted too. It's refreshing to see the Korean-American perspective and I'm looking forward to his next movie on Korean adoptees.","user":"sym007","rank":[17,25]}]