[{"title":"A Devastatingly Real Canadian Experience","rating":8,"date":"14 June 2018","review":"In the first minutes of this movie, I was admittedly mostly struck by some bad, off-putting dialogue. I actually laughed out loud at one of the first exchanges. However once I got into the meat and bones of this movie, it really caught me by surprise. <br><br>Representation matters. That phrase means the most when you see something you know and cherish reflected back at you, especially if it's in a raw, weird and chaotic way. Everywhere you go in Canada, there's a section of youth culture that's pretty tough-necking, uniquely punk rock, lost, rowdy, and harrowingly - almost innocently -sincere. It's an aspect of Canada that NEVER gets representation in our pop culture. However in this little indie film, that essential part of our culture is captured with a devastating, compassionate authenticity. Sure it's corny in places, but it kinda puts its finger on the pulse all the more for it. <br><br>Remove the audio in the less-than-perfect moments, and you'll find the shots in this movie beautiful. The rockie mountain landscape, the minute details struck by the sun, the way friends talk and hang out and look, it's all so raw and real and beautifully reflective of what these places we know feel like in all of their minute, intimate parts. <br><br>Every youth friend group has people who are less than perfect, less than complete, but they love each other unconditionally all the more for it. The power of those moments of love and confusion between friends in this film also strikes me as devastatingly, beautifully authentic. <br><br>The soundtrack is rad and so representative of that great underground Canadian culture you find in pockets everywhere. Even when the dialogue shouldn't work, it just strikes a chord.<br><br>Finally, what matters most in this indie film is its balance of raunchy, careless humour with the expression of loss so delicately shielded underneath it. This movie for me was so indie, so punk rock Canadian, so authentic and heartwarming and heartbreaking, weird and inspiring. Movies that aren't perfect about friends who, by the same turn, aren't perfect can capture something that is often felt, often meaningful, but rarely represented or presented well. This is that movie for me lately. <br><br>It has a ton of heart and reality and beauty, all wrapped up in really unexpected places. 8/10 for being so much greater than the sum of its parts!","user":"hynesyo","rank":[5,12]},{"title":"Film for tv","rating":5,"date":"15 November 2018","review":"Nice effort of a canadian film close to where I live. This story feels very familiar and I think I have seen it in an old french film.","user":"sergelamarche","rank":[0,2]}]