[{"title":"Super villianess","rating":27,"date":"27 April 2017","review":"The minute I saw her appear on screen I hated her. She's that good. Of course, you can't wait for her demise but it is fun watching her do her dirty work. And she looks like the evil Queen in Disney's Snow White. Extreme make-up although she must take it off sometime. The movie is pretty predictable. You sort of know who will be knocked off from the beginning. You can see it coming. Most of the actors did okay, but the leading lady was fantastic. She never missed a beat to show her evil side and her phony side. I did think the little girl was a bit sickening. Sort of the whining type. I did like the girl who played her grown up sister. Feisty dame and good in the role. Again, LMN makes the males look like idiots and behind the ball when it comes to smarts.","user":"geoffox-766-418467","rank":[7,10]},{"title":"A Below Average Cliched Psychological Thriller","rating":4,"date":"17 January 2018","review":"Karen Cliche in a cliched film - who would have guessed, right(?)<br><br>So this is the story about a career-minded woman, Jessica (Cliche), who won't let anything stand in her way. When her husband is arrested for fraud she decides to track down her daughter, Allison (Martin). Allison has been raised by her father and his wife after she was born due to her father's affair with Jessica. Now that her father has passed away Allison and her sister, Sydni (Blanton), are the sole inheritors of his will... except that Jessica has other plans.<br><br>Serge does try to add something new to an old story, though he unfortunately also throws in some cliches - and well-used ones at that, which deters a little from his good work. Also, some of the narratives are a little heavy-handed and unrealistic.<br><br>Though what lowers the film most is the direction. Conradt sticks to a pretty tried and true formulaic structure with the filming. It wouldn't have hurt to add a few different camera angles and possible some nice pans of scenery and location. Also, a little bit of lighting to add atmosphere and mood would have gone a long way after all this is a psychological thriller.<br><br>The one bright side to this movie is Maddy Martin who does a good job with her character. She could be one actress to keep an eye on. It's just a shame that the rest of the cast isn't up to her standard, especially Cliche who is relatively wooden throughout the film. Though she has a striking face and a decent body, I just cannot understand why the men Jessica is with would find her attractive enough to bed, because, characterwise, there's nothing attractive about this woman. <br><br>All in all, I'd recommend watching any of the many other TV movies of this ilk out there as they are probably more enjoyable.","user":"stephenabell","rank":[4,6]},{"title":"****","rating":10,"date":"29 April 2017","review":"Terrific thriller with two sisters losing their parents in 2 years and the younger one, who thought she was adopted, finds out that her real mother had a brief affair with the father and has now returned.<br><br>The mother, Jessica, is one of the most diabolical characters I've met in a long time. Her scheme to gain control of the vast inheritance left to the younger daughter leads her to all sorts of mayhem, especially getting rid of people who are in the way of her ultimate goal.<br><br>Wait until you find out that the father's death in a plane crash wasn't an accident.<br><br>The older sister-wise but rebellious realizes that something is amiss so Jessica has drugs planted in her car to get her out of the way.<br><br>A wonderful thriller, greed was never better.","user":"edwagreen","rank":[3,5]}]