[{"title":"Emotionally flat about one of the greatest polar explores","rating":5,"date":"18 February 2019","review":"AMUNDSEN is another exploration of a key figure in Norwegian history by director Espen Sandberg, whom previously has been a part of MAX MANUS and KON-TIKI. Two films that also highlights great achievements by Norwegians. As a very small country, us Norwegians have a tendency to root for and glorify people that achieves the spectacular, and we celebrate them as heroes. AMUNDSEN is a film about Roald Amundsen, a Norwegian polar explorer that lead the first expedition to traverse the Northwest Passage and the first first expedition to the South Pole amongst other things.<br><br>It's a film that attempts to explain and provide insight into who Roald Amundsen was, more so than to retell his expeditions. This is not an action-oriented film that focuses on the fight between man and nature. Much of the film is kind of told through a conversation between Amundsen's brother and Bess Magids, one of Amundsen's romances. This is the framework of the film, with Amundsen's achievements plotted in between throughout this conversation. It's a fine enough structure in theory and I appreciate that the filmmakers have decided to not just show an expedition and leave it at that, but instead to fully explore the man behind these great achievements. It doesn't glorify him or lift his hero status in any way. He's portrayed as a very flawed and slightly bitter man outside of his accomplishments. Unfortunately, the film only seems to scrape the surface of who he was. Heck, I would say that the film only touches the surface of everything it introduces.<br><br>The huge issue with AMUNDSEN is that it feels like a PowerPoint presentation with bullet points from Wikipedia to jump into every aspect of his life. The film is focused on trying to tell so much that it barely tells anything, but more importantly, it feels dramatically flat. Amundsen's relationship with Bess Magids is never properly explored. We're never told why they really care for each other. Amundsen's relationship with his brother, which is one of the biggest parts of the story, never leaves the emotionally impact that it should. It's too quickly glossed over. Even Amundsen's journey to the South Pole feels underwhelming. We're constantly told throughout the film that it's a dangerous expedition, but they don't show us that. When Amundsen finally reaches the South Pole (which is very early in the film), we should feel a sense of triumph, but instead I just sat there with a shoulder shrug. And that's the thing, the structure of the film doesn't work. It never lingers on the moments that are important in defining who Amundsen was, what the people around him meant to him, or what Amundsen meant to the people around him. It moves too quickly, but yet so slowly.<br><br>The performances are fine. Pål Sverre Hagen does a solid job as Amundsen (though the make-up used to make him look older is slightly distracting). The cinematography is great. There are couple of beautiful shots in it and you could see that the budget has been well-used. Which is why it's such a shame that film is struggling on a narrative level.","user":"Bml-93","rank":[38,45]},{"title":"Great movie that left me \"high\" after watching it.","rating":1,"date":"1 March 2019","review":"The Norwegian critics haven't been too kind to this movie, but it is much better than the critics would have you believe. It was a fascinating and thoroughly interesting film, about a great man who lived a highly prominent life. I liked the scope, and that they focused not only on one major achievement, but gave time to all of Amundsen's accomplishments. It reminded me a bit of Richard Attenborough's Chaplin (1992) starring Robert Downey Jr. in the way it was told, and I liked that it was done in this way.<br><br>Pål Sverre Hagen was great in the lead role. The film rests on his shoulders and he was impressive. He captured the weight of the character, and was particularly successful in portraying Amundsen as a middle aged man. He was totally believable. I don't normally gush about Norwegian actor's, like most I tend to focus on the American and British actors, but Pål was a real star in this film. He captured a lot just with glances, without even speaking.<br><br>As perfect as most of Amundsen's achievements were, this film showed that a great man has to be ruthless at times to bring about such success. That single focus to succeed and relentless pursuit, was captured well in the film.<br><br>I will also applaud the director for not spoon feeding the audience. He didn't spell everything out, and he trusted the audience to be active participants in the telling of this story.<br><br>When you get that \"natural high\" feeling after watching a film, you know you've watched something good.","user":"Interlepos","rank":[16,26]},{"title":"Not the hero movie it should have been","rating":5,"date":"6 June 2019","review":"In these PC-days, a movie about a hero is made into a dull, slow moving internal anguish type study of the spineless brother of the great hero. Hope another director will make the great explorer justice in the future.","user":"sirtorch","rank":[15,28]}]