[{"title":"Everything is not what it seems! You have to think deeper!","rating":8,"date":"23 January 2019","review":"I fell for the trap that everyone fell for when they first saw this movie. It took me hours to really dissect what had happened and to really get Mel's complete point of view. After seeing the movie, I read the description of the movie and it said that it was a woman manipulated and betrayed by her husband. Of course, I totally disagreed with the description because I said \"But Robert Tried to get back with his wife\", \"She is the one who divorced him\" and \"He paid her back everything she lost and More\".<br><br>It took hours after seeing the movie to really get what happened. Let's be clear. Robert began manipulating Mel from the beginning of their courtship. He got her to buy him a car and then cheated on her. They get back together after her craziness and proceeded to drain her dry through 18 years of marriage. On top of that, she worked TWO jobs throughout their marriage when he did not hold One. He was also distant and cold to her throughout until he was sleeping on the couch in the end. Her sister finds this girl's wallet who happens to be the girl he cheated on her with 18 yrs ago. He also ruined the business of her siblings without a back wards glance. Mel kicks him out. His battery makes it and he comes to her and says he is sorry but glad that she stood by him. He gives her a check for ten million dollars and keys to her mother's house that she lost trying to help him. He stated the house was in slight disrepair( which reminded me of the line in \"Why did I marry you\"). Mel goes crazy and looks irrational to the judge, her therapist and her family until the end.<br><br>Now, I am an attorney and I am ashamed that it took hours afterwards to finally realize that I had been \"HoodWink\" , \"Bamboozled\" and \"Lead Astray\".<br><br>Here is my analyses. In the beginning, the girl he cheated on Mel with was really the girl he wanted. He got with her immediately after getting the car from Mel. However, Mel messed that up with the turning over of the trailer. You have to keep in mind that Robert had Nothing! No major family support and No financial support but he was smart! Had Mel not told him about the inheritance, he would have left her but he needed her to survive. He later tells her that he is a Felon. Something that he tells her AFTER they are married and she supports him through school. He manipulated all of financial independence from her. Instead of helping her with holding down at least one job, he is comfortable with seeing her struggle with two. But yet he loves her.<br><br>Now skip ahead 18 years. He finds out that his old cheating mate is in the company that he has tried to infiltrate with his design for close to two decades. He sets up a meeting with her but get this. HE DOES NOT TELL MEL ANY OF IT even though the girl suggested it. Now after Mel has suffered, she would not cared if a monkey helped them so keeping it a secret made no sense. The house is about to be lost and Mel's siblings come up with a plan. He gets a call from the company about the battery, instead of telling his brother in laws to come and meet him so that can take the delivery to where it needs to go, he sidetracks with no concern about their warfare or livelihood. In the meantime, her sisters found a red wallet of the girl's in the truck. Any normal person would have thought he was cheating. I believe the girl left her wallet on purpose. What was the girl doing inside the truck? How did she not realize her wallet was missing before then? She knew the potential of his battery and she knew his wife was crazy. All she did was plant the seed for herself to move on in the door.<br><br>But that was not the only thing that was slight of hand. Robert came to Mel after the divorce and gave her payment for all of her suffering. But all he did was counteract a future lawsuit. Had he not given her that money, She would have probably received close to halve of his battery revenue. It is the equivalent of giving somebody a $1 so that could not break the will. When they went to court, what did the judge say? He said that Robert gave her money when he did not have to and paid her back more then she shelled out. BINGO! Lawsuit was squashed for a fraction of the cost. You forget that he was under an attorney during the time he gave her the money and was probably advised to do so. He manipulated her AGAIN!<br><br>The reason why Mel kept saying he did not love her was because he knew Why she divorced him. She was just plain tired. It was not because she did not love him but she could not do it anymore. It also was not her sisters fault because Mel made the decision to marry him and divorce him of her own free will. I would have given my sister the same advice. If he had loved her and I mean truly loved her, he would have gotten on his knees and said \"Let's get married again and live the way we had planned\". Many men have done that after they messed up (cheated) with their wives and wanted another chance. They understood why she left but they kept fighting until they got her back.<br><br>That girl took him in for What! A few months but she gets pub for picking him up when his wife held him up for over 18 years before putting him down? He only fought to get back with his wife because he was waiting for a bigger check to come in and he needed her to keep supporting him until then. When he got on his own, he held a job and kept it. He gave to his new wife the yacht he promised Mel and had he cared for her, he could have created new dreams with the second wife.<br><br>What Mel was upset about was not the money which people said that she had enough for herself. Her sacrifice was not just about Money. She gave EVERYTHING to him. Her ability to carry a child, her self esteem, the respect of her family, her physical health and well beng, her soul, her heart, her patience , her tolerance and her future! She had nothing left. If you truly LOVE a women, you do not break her and walk away. Even before she knew about the money she missed him and could not gel with the new guy. She really loved him and if he loved her, he should have ached as well. However, he didn't. He got his dream life with an EDUCATED women. We forgot about that didn't we? Not once did he ask her what she wanted to do with her life since college did not work out. Did she want to go back for another degree or open her own business or get a technical degree. That would have been another ground for the judge to rule in her favor for half the money had he not made a preemptive strike.<br><br>What I think muddied the waters was the inclusion of mental illness. She was ill but it did not show itself unless she thought she was being used. He saw it only a couple of times in 18 years. Everyone just wanted to say she was crazy and they dismissed the point she was trying to make.<br><br>I also want to defend the family. The family did not turn against her and take Robert's side. They saw the spiral and they could not stop her. She had completely lost her mind and perspective and they wanted to protected her from being totally lost from them.\nI have to give it to Tyler. If you only see what the surface shows, you come out thinking just another crazy black women. But what everyone fails to get is that Robert was EXTREMELY smart. He could not have create a battery otherwise. He benefited from the beginning to the end. Mel felt like she was screaming in a vacant forest. No one SAW what he did! But I did! Well played Tyler. Well Played.","user":"jdpmd-82983","rank":[111,139]},{"title":"Ignore the rating!! See it for yourself!!","rating":10,"date":"17 June 2018","review":"Great Great GREAT Movie. Although it is just a movie it really embodies real life dreams and sacrifice seen from both parties perspectives. Awesome Movie. I was really surprised.","user":"jlife-93162","rank":[85,114]},{"title":"Is it the most underrated movie of 2018 ?","rating":9,"date":"23 June 2018","review":"Did you ever wonder how your life gonna be after university years ? Will you live the life you ever wondered ? Will your partner be your supporter or your depressor ? Will you believe in each other till the end ? What will happen if you did ? or you didn't ?<br><br>Kindly watch that movie if you want answers for the previous questions, and you will be amazed with the much of mixed feelings you will have throughout the movie.<br><br>The movie has a really nice start and finale with \"Nina Simone\" songs, it follows a lovely rhythm and the best story telling style i saw in a while. You will be involved in the story with your heart and soul easily, you will support different parties throughout the movie, and the good thing that you will have the freedom to choose the side you prefer.<br><br>Finally, it's a great drama,thriller and murder movie, about the story of a couple of fighters in life that worth watching,you will enjoy the acting, the story, the songs in the background, the feelings , the division of the chapters of the movie and you will definitely not feel bored at any moment.","user":"MplusA92","rank":[46,65]}]