[{"title":"A different take on the ending in particular...","rating":10,"date":"14 June 2018","review":"First of all, a fantastic film, deliberate in its pacing, its performances, its visuals and even in its quite sparse sound design.<br><br>Other reviews speak in greater detail about the themes and the 'plot' than I will here. What I want to talk about is the ending.<br><br>So, SPOILERS:<br><br>No, he doesn't go forward with the suicide bombing, which would have been a wonderfully dark, and explosive, finale for the slow burn of the rest of the film preceding it. But, also, I don't think he 'makes out with his girlfriend' as another reviewer put it. He wraps himself in barbed wire, an update on Christ's crown of thorns, and a well done visual, both graphic and slightly understated at the same time. And he pours that drano and then we get the 'Last Temptaion of Christ' moment. He DOES drink that drano and then in that moment of sacrificing himself-which will indeed be enough of a spectacle to draw public attention to the cause-he imagines (or is rewarded with the vision of) her coming to him. He imagines a happy ending and then he film cuts to black mid-scene because the drano has done its job. He has died. People will ask questions. The church's association with polluters will come to light.","user":"robertegblack","rank":[247,306]},{"title":"Thought-Provoking, Unsettling Character Study","rating":8,"date":"6 October 2017","review":"Paul Schrader's new drama \"First Reformed\" is a drama about a grieving reverend who is counseling a couple--the husband of which is a radical environmentalist. This is a talky, dialogue- driven, and unsettling thriller that makes you both empathize with its characters as well as send a chill down your spine at times.<br><br>The film's deeply intellectual and serious commentary on matters of religion and environmentalism is profound and thoughtful. This movie will likely not be suited for mainstream audiences desiring cheap entertainment, but serious viewers looking to be challenged in their thought processes will have much material to ponder during--and after--they view the movie. The acting is very strong, as Schrader commands his cast into giving low-key but quietly powerful and resonant performances. The standouts in the cast are Ethan Hawke's lead role as well as Amanda Seyfried and Cedric the Entertainer in the supporting cast. A gripping, dark (almost relentlessly so at times) tone keeps the viewer engrossed in the film. While this isn't a horror film (despite containing disturbing content and moments,) the film's simple score is incredibly chilling and gets under one's skin more than almost any other film's score I have witnessed in a long time.<br><br>My only complaints about this film are found in the third act. A dreamlike, surrealistic scene inspired by impressionism that involves the protagonist and Seyfried's character feels out of place given the grim tone deeply rooted in realism. Additionally, a quick and highly abrupt cut in the film's finale feels disappointing and almost like the equivalent of a 'cop-out' in film editing. It did not positively impact how I viewed the film's ending. But other than these concerns, this is a very well-made and serious drama designed to quietly shock audiences into a state of reflection on the world today as we know it. 8/10","user":"bastille-852-731547","rank":[212,276]},{"title":"A daring and unexpected piece of filmmaking","rating":20,"date":"20 November 2018","review":"I never expected to be so moved by \"First Reformed\", a small indie that tackles large themes such as climate change, mental health, and faith rather ferociously. Though it is a bit of a slow-burn at the start, it's impossible not to be drawn in by Ethan Hawke's magnetizing performance. He is masterful as Ernst Toller, a pastor who begins to unravel after an encounter a husband and wife who are environmental activists. The second half of the film is particularly strong, as Toller's polite and unassuming facade begins to crack, and writer/director Paul Schrader makes some daring filmmaking choices that add to the unpredictability of the film as it heads toward the climax. Though the ending has been controversial among audiences, I thought it was an incredibly bold, beautifully executed choice, and the final few minutes of the film have been seared into my mind. Regardless of how you respond to the ending, there is no doubt that this is a thought-provoking and important piece of art. A must-see.","user":"pjmdancer","rank":[63,78]}]