[{"title":"Decent film if you accept it for what it is...","rating":7,"date":"21 January 2018","review":"There's a glut of these sort of films but this latest offering from the ROTF franchise, documenting the trials and tribulations of Pat Tate and the people he comes into contact with, isn't too bad an effort if you like this sort of film. If you're able to look past the ageing actors and lack of attempt at setting the action in the 90's you'll find snappy dialogue and a good soundtrack, but most importantly you'll find that Craig Fairbrass really does excel at playing arrogant, psychopathic and dangerous characters such as the one they are trying to portray this time round in Pat Tate. If there was a TV mini-series produced which followed the adventures of Pat, Tony and Craig as they do drug deals, kick lumps out of people and get into various scrapes and capers with plenty of swearing thrown in, I would most definitely watch it. Each episode would always end with a mention of Mickey Steele's supposed drug-deal, followed by all three getting blasted away in the Range Rover, with 'Heaven knoooooows what life may brii-iing...' played in the background. Then, a sneak-preview of next week's episode - Tony and Craig set off to buy some drugs, but Craig leaves the money in a McDonald's toilets. Meanwhile, Pat glasses someone in a pub for looking at him the wrong way. Tune in next week!","user":"steveperry-53763","rank":[10,12]},{"title":"Terrible writing and even worse screenplay","rating":5,"date":"13 November 2017","review":"I'm a fan of Craig Fairbrass and really liked him in London Heist, of which was way better written (by Fairbrass) than this hot mess. Amateur writer Mike Loveday assembled a convoluted screenplay that basically shows violence and cocaine marathons and bounces back and forth in the scenes and has more plot holes than a strainer. Zackary Adler's directing was OK, probably the best he could do with such a poor script. It's too bad more effort wasn't put towards the writing of at least having a seasoned writer at least proofread this mess of a script. Although the comedy and violence was still entertaining, it's still only a generous 5/10 from me, more-so for decent cinematography and awesome location sets and visuals.","user":"TheTopDawgCritic","rank":[8,15]},{"title":"Christ On A Bike","rating":1,"date":"11 June 2018","review":"I don't know why I do it to myself, moreover I don't know why so many British actors that I half like keep turning up in this turgid nonsense. Undoubtedly there was, with the Essex shootings of three low level drug dealers a story to be told, this has been done with the first instalment and Essex Dogs. This rehash of the same old ground told from Pat's perspective is unsympathetic, patchwork story telling stealing ideas from The Business and it's own first two instalments. Dialogue that Danny Dyer would baulk at having to deliver and more cliches per minute than Premier League commentary. If Billy Murray is plotting a fourth instalment from Craig or Tommy's perspective it'll transform a snapshot of Britain's seedy gangster underbelly in to Soap Opera, I don't doubt that this guff makes money but, it's been done. Leave it alone. Now a half decent film about the 80s London firm.........that'd be a film worth making.","user":"robgair","rank":[4,6]}]