[{"title":"The potential was there","rating":5,"date":"18 February 2018","review":"I will always remember the film 'Vacancy' because I went into it with zero expectations and ended up having one of the best film experiences I can remember. Really the only similarity that 'Looking Glass' has to that film is that it was set in a motel in the middle of nowhere. Still though, a part of me had hopes of another hidden gem. It wasn't to be though. The film starts off with some potentially exciting plot points and mysterious goings on, but can never live up to them and provide any pay off.<br><br>There's also a serious lack of suspense in the film. At no point are you ever on the edge of your set needing to know what is going to happen next. The film just kind of drifts along and even when something that's supposed to be exciting is happening, it really isn't that captivating. The one bright point for me was Nicolas Cage. Even though his career has been in serious decline for over a decade now, he can still act the pants off most people in the industry when he tries. Sadly though, he's far from enough to save this forgettable film that I wouldn't recommend spending your hard-earned on.","user":"jtindahouse","rank":[50,64]},{"title":"Looking Glass is not a complete bore, but lacks.....","rating":4,"date":"22 February 2018","review":"I have to say that I don't think it was as bad as some of the other reviews say, I kept watching it till the end. However, it wasn't a movie I'd say \"Hey, go out and see Looking Glass!\" to someone. It is a slow movie that's definitely missing a lot of explanations, along with many plot themes that are plain unrealistic and things don't really add up at times. Many actions are unnecessary and make you wonder why they even threw them into the movie at all. Like I said, the movie wasn't great but it wasn't a complete waste of time, it was free and I was bored so it gave me something to do. If you just want something to occupy your time and it's free, check it out.","user":"dejavuicutooo","rank":[29,38]},{"title":"What?","rating":3,"date":"23 February 2018","review":"Why did they release this film? Despite Nicholas Cage being in it,the movie is blatantly incomplete.Its a turd. I was disturbed by the creepiness of the film but there were no explanations,no closure,not even a climactic revealing scene. When I saw it say \"the end\" i was confused.Did someone pull a hoax and release this movie incomplete? NOTHING is explained...i get it-some things are mystery and should be but wtf...this movie is one giant plothole.Its not worth watching unless you don't mind plotholes and well.lack of a plot...the biggest mystery is why this film was released.I've NEVER seen a movie with so many plotholes,misleading scenes seemingly deliberate..only to end abruptly as if the makers ran out of time.","user":"slhma-86182","rank":[36,53]}]