[{"title":"Not Oscar worthy and not cringeworthy, just a solid film.","rating":7,"date":"23 July 2019","review":"Some people have rated this a 1 star and others a 10, forget those reviews because those people don't have a clue, this movie isn't a 1 and it's definitely not a 10, it's a solid movie, it's not the best thing ever made and it's not the worst thing ever made, it's just a solid slightly above average film with some great acting spearheaded by an outstanding performance by Jamie Bell.<br><br>The story is kind of familiar and formulaic to every other similar kind of movie that deals with this subject matter, you've probably seen this story played out before, our main protagonist starts off with strong prejudices and beliefs which throughout the course of the film he starts to question, it's nothing new, but I didn't find it made his journey any less interesting to watch. It's got some great acting, it's filmed well, like I said above it's a solid film.<br><br>I did feel that some of the events in the film were a bit rushed, it felt like it could use a few more scenes to flesh out characters relationships a bit more, especially when it came to his relationship with the gang and 'Mom &amp; Pop'.<br><br>Worth a watch.","user":"freqeteq","rank":[88,127]},{"title":"\"What if I get all of (these tattoos) off, and I'm still a piece of s***?\"","rating":6,"date":"10 January 2020","review":"It may sound odd, but I can't talk about this film without talking about JOKER. The thing that most frustrated me about the backlash to that film was how it ignored Phillips's diagnosis of a problem. Senseless violence, the film implicitly argues, is being driven in part by society neglecting young men from troubled and abusive backgrounds, devoid of purpose and susceptible to mental illness.<br><br>Here we have what happens when a young man from a troubled and abusive background is devoid of purpose. He gets picked up by psychopathic predators who train him to become a violent white supremacist. And the journey to how he got there was the key to understanding him enough to get him out.<br><br>The biggest takeaway for me here is how violent and radical movements prey on vulnerable people from troubled backgrounds. This film is willing to sit down and look that dangerous movement, and these dangerous people, straight in the face and not blink. And most importantly, it does that long enough to understand Bryon. Condemn him too, sure, but know what drove him there in the first place, too.<br><br>That honesty goes a long way. It extends to his leaving, too, how enormously difficult it was between saying he was leaving and actually getting out. A really powerful story from start to finish and phenomenally acted by Jamie Bell. Props also to Vera Farmiga, one of the most underrated actresses in the business.<br><br>Empathy. Prayer. Community. If we don't reach out to these wandering, suffering souls, the monsters will. And they're good at it.","user":"yusufpiskin","rank":[11,13]},{"title":"This was a good movie","rating":8,"date":"17 October 2019","review":"Made me want to smoke cigarettes and drink beer. Made me happy I chose to let a few tattoo ideas simmer before going through with them. Made me tear up a couple of times--the courthouse wedding scene was beautiful, guys.<br><br>I'm glad I watched it.<br><br>It's a bleak story, that's for sure. And it's a poignant reminder that most fringe groups will stick to their ideological beliefs like a security blanket, but that also the occasional member can have a change of heart.","user":"gabethurau","rank":[10,14]}]