[{"title":"Featuring Donnie Yen in his most significant acting breakthrough since 'Ip Man', this compelling gangster drama is his and Wong Jing's best in a long while","rating":8,"date":"30 September 2017","review":"Just when you've come to hate him more than love him for truly frustrating duds such as 'From Vegas to Macau 3' and 'Mission Milano', Hong Kong's most prolific filmmaker Wong Jing compels you to take him seriously once again with the best gangster drama we've seen in a long while.<br><br>Written, produced and co-directed by Wong Jing, his latest period epic charts the rise and fall of two of Hong Kong's most infamous real- life characters from the 60s and 70s – the one-time most powerful drug lord in Hong Kong Ng Sik-ho (or better known as 'Crippled Ho') and the notoriously corrupt detective Lui Lok (or otherwise known as 'Lee Rock'). <br><br>Perhaps because he had already previously told Lee Rock's story, Wong Jing anchors this movie around Sik-ho (Donnie Yen), who first steps foot in Hong Kong in 1960 as an illegal immigrant from Chaozhou with his three buddies (Philip Keung, Wilfred Lau and Kang Yu) and younger brother Peter (Jonathan Lee). Although engaged in odd jobs, the quartet find more lucrative means of employment by being paid to make up the numbers in street fights. One such fight is that purportedly between rivalling triad heads Comic (Jason Wong) and Grizzly Bear (Ricky Yi). Unfortunately, the fight turns ugly with the arrival of the riot police led by the British Superintendent Hunter (Bryan Larkin), and before the night is over, Sik-ho ends up in a run-in with the arrogant and supercilious 'gwei-lo'.<br><br>All that is witnessed by Lee Rock (Andy Lau) and his right-hand man Piggy (Kent Cheng), who spies Sik-ho's superior fighting skills and decides to recruit him and his buddies while they are in lock-up. As circumstances would have it, in order to save one of his buddies caught stealing from mafia boss Bro Chubby (Ben Ng), Sik-ho will end up working too for the former, running his drug business within the legendary Kowloon Walled City. <br><br>It is within this hotbed of lawlessness that Lee will venture into one day. Things go south obviously, and the subsequent turn of events binds Sik-ho and Lee in a complex brotherhood embrace – Sik-ho springs to Lee's rescue but ends up caught in the crosshairs of another parallel ambush sprung by Sir Ngan in collusion with Chubby. In the ensuing scuffle, Chubby breaks Sik-ho's right leg as punishment, thus birthing a hardened and even more driven 'Crippled Ho' upon his discharge from hospital.<br><br>Sik-ho's transformation comes at the midway point, and it is in the second hour that he truly comes into his own. Not only does he resist Lee's manoeuvres to alter the state of play, Sik-ho takes matters into his own hands against Lee's better advice in order to exact his own vendetta against Superintendent Hunter. There is a lot of plot crammed into a slightly-past-two-hour runtime, but its machinations consistently revolve around the dynamic between Sik-ho and Lee; an especially poignant scene near the end has a visibly embittered Sik- ho pointing out squarely to Lee the personal costs and consequences of the latter's actions over the decade plus on the both of them, and the duo coming to recognise how little of life, death, or anything in between they can truly control.<br><br>Oh yes, the movie is equal parts plot and character-driven, and Wong Jing's (rare) achievement is how he balances both perfectly to deliver a sprawling but constantly spellbinding account of the fates and fortunes of his two key male protagonists. Due credit also goes to his co-director cum director-of-photography Jason Kwan, who not only brings a vivid cinematic feel to the visuals but also imposes rigour in crafting and building up several pivotal sequences, both of which are too often lost on a frequently sloppy Wong Jing.<br><br>More prominently, 'Chasing the Dragon' has been sold as a showcase of Donnie Yen's acting chops, and sure enough, Yen doesn't disappoint; in fact, as Sik-ho, Yen probably makes the most significant breakthrough of his career since 'Ip Man'. His portrayal of Sik-ho is understated, nuanced and impressively authentic, especially in depicting his character's transformation from underdog to kingpin. Yen and Lau don't share as many scenes together as we'd have liked, but the duo have great chemistry when they do, embodying the genuine camaraderie between their characters as well as the seeds of distrust, suspicion and resentment sowed by their own respective ambitions, egos and greed. <br><br>It should also be said that this gangster tale is always careful not to glorify its socially deviant protagonists – principally for fear of running afoul of Chinese censors – and is therefore less unhinged than the early 90s flicks of Sik-ho and/or Lee. In fact, Yen and Lau aren't playing so much criminals as they are anti-heroes, so not only are there redeeming qualities about their characters in this movie, both will come in an epilogue set thirty years later to realise and regret the folly of their ways. Yet these politically (and commercially) savvy considerations aside, Wong Jing's latest is still a solid and solidly entertaining example of the genre that is bloody, violent and thrilling.<br><br>Indeed, there is much to enjoy in this period gangster epic, from the storytelling to the characters to the actors and as well to the richly detailed sets of Tsim Sha Tsui, Wan Chai and Kowloon Walled City. This dragon is one you won't mind chasing from start to finish, and we guarantee you it will leave you on a visceral high.","user":"moviexclusive","rank":[11,14]},{"title":"A remarkable gangster epic","rating":1,"date":"1 October 2017","review":"Obviously, the movie \"Chasing the Dragon\" is not a remake of the 1991 movies \"Lee Rock\" and \"To be Number One\". Instead, it borrows their main protagonists and antagonists, and tells a completely different story. In some sense, \"Chasing the Dragon\" is a reboot of the gangster epics.<br><br>The production design, music score, action sequences and acting performances are most notably brilliant. The action sequences are unexpectedly brutal and bloody, and really stun me from time to time. Donnie Yen has long established himself as one of the best martial artists of all time, and here in \"Chasing the Dragon\" he gives an almost career-best emotional performance, even better than that in \"Rogue One\". The acting of Andy Lau, Kent Tong, Kent Cheng, and Ben Ng is fantastic as always. <br><br>On the other hand, the plot and the editing are not satisfying. Wong Jing is not a talented filmmaker. Some scenes simply lack consistency and credibility. <br><br>In a nutshell, the rating for this movie is 7/10.","user":"TheBigSick","rank":[11,15]},{"title":"When you chase that elusive dragon...","rating":7,"date":"15 August 2018","review":"Right, well with two of the heavy weights of Hong Kong cinema coming together in this movie, then what could go wrong?<br><br>I had not actually heard about \"Chasing the Dragon\" (aka \"Chui lung\") prior to stumbling upon it by sheer luck. I didn't even had to read the synopsis for it; I saw that it was a Hong Kong movie and it had both Andy Lau and Donnie Yen on the cover. This was an instant pick-up.<br><br>The movie turned out to be quite entertaining, and it is one of the better orchestrated gangster movies that I have seen in quite some time.<br><br>The storyline was good, fast-paced and nicely written. And the fact that the characters were so well detailed and unique also helped to make the movie experience that much better. Of course, having an amazing cast to portray these characters just helped the movie along all the more.<br><br>Donnie Yen was good in the role as an immigrant turned criminal in order to make a living in Hong Kong, and Andy Lau is, as always, doing a great job in a police role. Needless to say that both their performances were phenomenal. But the movie also boasted other quite interesting supporting actors. If you are familiar with Hong Kong movies, then you will definitely see some familiar faces - some of them even in small roles that weren't that important to the movie.<br><br>\"Chasing the Dragon\" was nicely paced and it didn't really have a dull moment throughout the course of its story. That worked quite nicely in favor of the movie.<br><br>If you enjoy Asian cinema, or Hong Kong cinema in particular, then you should take the time to sit down and watch \"Chasing the Dragon\"...","user":"paul_haakonsen","rank":[3,3]}]