[{"title":"Utterly fun and over-the-top sequel","rating":10,"date":"9 August 2017","review":"Attempting to get by in life, a dying man determined to win the affections of a beautiful woman finds that an alien parasitic lifeform has infected the city and turning himself and everyone into crazed mutants forcing him to battle them off in order to save her.<br><br>This was quite the enjoyable and bizarre effort. What really makes for a fun time here is the way this one goes for just about every kind of obscure, over-the-top and just plain demented setups as it possibly can. Once this hits the half-hour mark, the insanity present is as grotesque as it is bizarre, ranging from the start of the alien invasion and how they take over the city by placing the quarantine procedures in the city which gives this some exceptionally fun gags showing the people around the city being taken out by the glass structure encompassing the area. From there, the launch of the parasitic ships that latch onto their victims and begin the transformation into the deformed beings begins the craziness here as this one shows not only the sequence of the body being transformed but also the alien in charge of the whole ordeal which is what adds such an extra dimension to the affairs. Going almost instantly afterward into a series of exceptionally fun, crazy action scenes that once again take full advantage of the tactic from the first one of having the victim being endowed with enhanced traits that were preferred from their real-life selves, this one piles on the action scenes as he battles the mutations across the city which let this one embrace the wild and truly outrageous sequences from the initial brawl in the police station to the spectacular street fights against the residents and the show- stopping chase atop the motorcycle-driven being that serves as a grand highlight for the high-intensity action present as well as for the spectacular visual of a topless woman driving the whole being. As well, the battle between the officers and the multitude of stripper creatures in the remains of the club offers more great splattery fun with the need to take out more than one, and the big climax in the church all make for a great series of action scenes that offers plenty of not only great special effects for the creatures but also integrating all the fantastic splatter effects possible in here. These make for a demented fun time throughout here as this one is exceptionally over-the-top and delirious which has a lot to really like here to hold it up over the one minor flaw. The issue here is that there's such a nonsensical and confusing tack-on at the end where it shows the bizarre alien infomercial gives this a rather obvious tonal shift that's rather a downer to end this on. Beyond this, there's not much to dislike here.<br><br>Rated Unrated/R: Extreme Graphic Violence, Nudity, Language and violence-against-children.","user":"kannibalcorpsegrinder","rank":[14,17]},{"title":"Lots of blood and gore, but very little of anything else...","rating":4,"date":"10 August 2019","review":"Having seen the 2005 \"Meatball Machine\" movie, then I wasn't particularly in a hurry to watch the 2017 \"Kodoku: Mîtobôru Mashin\" (aka \"Kodoku: Meatball Machine\") movie.<br><br>But still, being a fan of Asian cinema and having a fondness of gore, I opted to sit down and watch this 2017 movie from director Yoshihiro Nishimura nonetheless. But it wasn't with much of any expectations at heart.<br><br>Turns out that this movie was every bit as odd, bizarre and well silly as the 2005 \"Meatball Machine\" movie.<br><br>Yeah, a simplistic storyline served with an abundance of blood and gore, and over-the-top creature ideas and pseudo-low budget special effects. Some enjoy this combination tremendously, others don't, and some even just find it to be mediocre.<br><br>I wasn't particularly impressed with this movie, and I found the storyline to be way too stupid and simplistic to offer any real enjoyment. And the characters in the movie weren't exactly fleshed out - pardon the pun - in an overly exciting manner, which resulted in the characters being mundane and pointless.<br><br>However, I did enjoy the gore, the grotesque ideas for creature designs and the downright campy, craziness that there was to the movie. But it was hardly sufficient to alleviate for the movie's shortcomings in terms of script and characters.<br><br>I was, however, pleasantly surprised to see Eihi Shiina make an appearance in this movie. But then again, she is no stranger to this particular weird genre of Japanese gore.<br><br>My rating for this movie is a less than mediocre four out of ten stars. The movie wasn't impressive, nor particularly entertaining or enjoyable. Sure, there were some golden moments here and there, but in general, don't get your hopes up for this one.","user":"paul_haakonsen","rank":[2,2]},{"title":"a geek blood slatter qurkie violent weird syfy horror","rating":6,"date":"19 December 2018","review":"I wish it was less quirky,more \"serious\"<br><br>be on drugs or/and big screen would help.<br><br>have also lots of breast showing .<br><br>I thought Tokyo Police Gore was better in many aspects.<br><br>still, recommended for at least one viewing.<br><br>Over the top.","user":"surfisfun","rank":[1,2]}]