[{"title":"\"Tremors: A Cold Day in Hell\"- Big, loud and silly... so basically, it's a pretty decent 'Tremors' movie!","rating":7,"date":"7 May 2018","review":"Chances are, if you're watching \"Tremors: A Cold Day in Hell\", you're either a die-hard fan of the long-running cult franchise, or you just stumbled across it on Netflix and put it on in a whim. Either way, you could definitely do a lot worse. As far as sixth-films in low-budget schlock series go... \"A Cold Day in Hell\" is pretty serviceable. Sure, it never quite recaptures the wonderful mixture of thrills and laughs that the original had in spades. Heck, it's not even one of the better entries in the series. But it is a fun one for sure. And as a fan of \"Tremors\" for well over twenty years, I enjoyed every silly moment of it.<br><br>Burt Gummer (Michael Gross) and his loud-mouthed son Travis (Jamie Kennedy) are in for a new adventure when graboids appear in the Canadian arctic. Together with a host of new characters, including a beautiful graboid-enthusiast (Jamie-Lynn Money) with a surprising tie to Burt's past, they set out to destroy this deadly threat. However, things take a dark turn when ole' Burt realizes he's been infected with a deadly graboid-based parasite, and will need to capture one alive in order to find a cure!<br><br>Part of the thing I've always loved about \"Tremors\" is the fact it's one of the few horror (well, horror-comedy) series that really and honestly cares about continuity. These films are peppered with references and callbacks, and \"A Cold Day in Hell\" is perhaps the most bombastic of the bunch in this respect. A large portion of the plot hinges on events that occurred several movies back, and it gives the movie a sort-of fun appeal that rewards longtime franchise fans. \"Tremors\" is almost episodic in that sense, and I really dig the direction they're taking the series in.<br><br>The central cast is also pretty darned good. As always, Michael Gross is the stand-out among them, and Burt is as likable (and wonderfully unlikable) as ever. You really get the sense that Gross absolutely loves the series to death, and he never phones it in. I also really liked Jamie Kennedy this time around. Scandalous, I know! Kennedy has gotten his share of flack in the past due to his poor choices in film roles, but I think \"Tremors\" is a good fit for him. I particularly thought he did quite well when given some honest emotional beats to work with later in the film. Jamie-Lynn Money is also incredible adorable and quite a good fit for the series, as a sort-of awe-struck oddball that's pulled into the journey. Unfortunately, the rest of the cast is otherwise generally forgettable though, and tend to sort-of disappear into the background.<br><br>Direction is handled by Don Michael Paul, whom also helmed the supremely underrated fifth entry in the series. While I could do with a little less shaky-cam, Paul does quite well for the most part with the script by series veteran John Whelpley. I've really admired how he's able to work with what is clearly a microscopic budget, and gives the movies a sense of scope that a lesser filmmaker would certainly lack. This looks and feels like a $30 million dollar film... when its actual budget is probably only about one-tenth that.<br><br>Unfortunately, all this praise does come with one pretty severe trade-off. And that's the fact that... this movie is pretty darned silly. Even by \"Tremors\" standards. There's a definite over-reliance on goofy gags and dopey character beats that start to feel a little contrived after a while. Especially in the first half, which is pretty much just a bunch of jokes and one-liners strung together by a loose storyline. The structure is also quite scattershot in the first act, and the film moves a bit unevenly. I have the sneaking suspicion that there wasn't a finished script when filming began, and it was written on the fly. And yeah... a few too many jokes fall flat on their face.<br><br>Thankfully, the sheer fun-factor at play does help you get through these issues, and by the midway point, the film course-corrects into sheer \"Tremors\" bliss. You just gotta get through about a half hour of nonsense before you start getting to the good stuff.<br><br>On the whole, this \"Tremors\" fan was generally pretty pleased by \"A Cold Day in Hell.\" Yeah, you gotta contend with a somewhat lame opening act and some unfunny gags before it starts to get good. But once it gets going, you'll definitely forgive it for its faults. Strictly as a longtime series fan, I'm giving it a pretty good 7 out of 10. It won't win over any newcomers, but it'll get the job done for people who have followed this delightful series from the beginning.","user":"MaximumMadness","rank":[35,44]},{"title":"Like visiting with old friends","rating":6,"date":"25 January 2019","review":"I have to concede to be an old \"Tremors\" fan from the gitgo. However, I approached this iteration with some anxiety: I appreciate \"Burt\" fro the beginning and really appreciated the chemistry in the first two issues, yet was this one going to be worth my time?<br><br>Happily, this one measures up to a solid B film status and if you are a \"Tremors\" fan such as I am, then you will appreciate this one.<br><br>Part of the joy of this series is its capability of knowing exactly what it is. There is no pretense of anything beyond what you see: a romp with some cheesy effects.<br><br>I appreciate that this one also is aware of where it fits in the cycle: there are references to Reba and Kevin in this one that I enjoyed.<br><br>There are huge plot holes and obvious flaws in character development. The effects are splatters and that is about it. Got those viewers of a post CGI generation, this miststep will diseffect you.<br><br>If, however, you know this franchise and you appreciated the first ones, then you'd enjoy this pleasant way to spend an evening with old friends.","user":"markkbranson","rank":[9,10]},{"title":"A solid entry into the Tremors franchise","rating":6,"date":"5 May 2018","review":"I like the fact that after 6 films they at least attempted to do something a little different. Honestly, it doesn't change the dynamics or what I enjoy about them. I think Jaime Kennedy &amp; Michael Gross actually have a good chemistry. While it's not on the Fred Ward/Kevin Bacon level, there's a good rapport between them that manages to be highly entertaining. <br><br>One of the only things I felt maybe lacking over some of the other films was the production value. While it doesn't look horrible it does look cheaper. The creatures don't look quite as fleshed out and at times a bit too CGI, but not so bad it ruins things. Also, a few of the supporting characters, mainly the quote-unquote bad guys were pretty wooden and really didn't add much to the overall story. They do, however, lead to a few comical moments of dialogue. <br><br>You more or less know what you're getting with these movies at this movie. If you've never seen any of them, I would go back and start with the first one and work your way through. That's still the pinnacle of the series, followed closely by the second. They're goofy, schlocky fun. Something that's always made me gravitate to the films is they seem to know what they are. It's one of those things where it looks like they probably had fun making them and it shows on screen. Part 6 is no exception to that rule. So, if you're a fan of the other films in the franchise. This is worth a worth.","user":"AverageJoesDriveInPodcast","rank":[26,36]}]