[{"title":"Great atmospheric spooky Swedish horror","rating":8,"date":"4 October 2019","review":"Although I got the impression the budget may have been tight, the makers of this film got everything out of it. The atmosphere of the forest was dark and the sense of foreboding it lent went along way towards making the movies low budget work well. The acting was good and the fact I knew none of them seemed to make it better. I was happy to stumble upon this film and would recommend it as a good watch if you like horror/supernatural films.","user":"chilversedward","rank":[23,35]},{"title":"Very well executed with the means at their disposal","rating":7,"date":"13 December 2019","review":"An entertaining film that was quite a bit scary in parts. The ending was a twist, but not a good one. If you like Vikings and Scandinavian lore you will enjoy this film.\nWould like to see a film with a good budget from the same directors!","user":"kristinaohrman","rank":[5,6]},{"title":"I am a sucker for Swedish film but...","rating":5,"date":"4 November 2019","review":"Have you ever watched an Asian film that wasn't meant to be marketed to English audiences , and you thought it was edited really badly because stuff just didn't make sense or wasn't explained enough? And it jumped from scene to scene without so much as a story to propel it?\nYeah sort of what happens here although I'm 100% sure it makes way more sense to a Swede. Something does get lost in translation.\nAnd it wouldn't matter so much except that the entire story line - this happens to.\nYeah in the end it makes sense , but getting there is difficult and it is such a good movie in other respects that you really want this movie to tell the entire story and you want the explanation. You want the back story. You want it all to come together clean.\nThis movie could have been one of the best indie movies of this genre - if it had done that. But instead it has characters that don't make too much sense ( why are they there and why does it matter and how do they connect to this?) and you have a loose at best story..... that for English listeners doesn't make sense- a story about an old lady who got buried and they had to cut her head off. A girl who enters your body- and takes over .... but it's the old ladies curse.\nBut then - that's not the story.\nActually at the very end - there was a homestead. And they cursed the land. Ok....\nbut so much could have been cool there that was wasted .... and I'm not sure if it was the translation or a bad script or just culturally implications that I missed - is it worth a rental? Sure.\nIs it mind blowing ? No.\nSeemingly up to standard production value also. Not a B film.","user":"airsnob-18715","rank":[9,13]}]