[{"title":"Great action movie","rating":7,"date":"20 January 2019","review":"This is a solid movie and a great action movie. The plot is mostly predictable and probably something you've seen before. What makes the action great is the realism. The gun fighting is up there and believable. Sure our hero survives a few times he shouldn't but that's what makes it an action movie. My biggest complaint is probably that the payoff didn't really exist. \"Mission Accomplished\" came to mind at the end. What was it all for?","user":"bingobongbangotango","rank":[30,34]},{"title":"Hard hitting","rating":10,"date":"2 September 2019","review":"An excellent movie. Excellent acting, story and battle scenes. Milo brings it. Stoic and emotionless. The people that think that is bad acting have know idea what it is like to be a seasoned soldier. What it can potentially do to the mind.<br><br>This is a man's movie. There are a few of us still out here. Let us enjoy a \"tough guy\" movie made for us. Go watch your own movies made for you. We don't watch your movies and then low score and criticize them because we don't understand them.<br><br>Everybody needs to just get over themselves.","user":"ttrimble-43363","rank":[7,7]},{"title":"Realistic Action with small budget","rating":8,"date":"26 December 2018","review":"I like the movies with realism in their action scenes. It makes you to get in to the film more. I have to give credits for John Street and his amazing team. From holding the gun to the preparing for battle, you definitely feel that actors got trainings. Director got an excellent job to allow the actors to use the militaristic atmosphere. The simplicity of scenario and gives the message to the audience what the movie is about. When it is about mercenaries, it is every men is for himself. Even Milo Gibson shows his characters dark side with the ideology.\nI enjoyed the movie overall. Gun battles reminded me Den of Thieves realism. And the general concept of the movie reminded me Ronin. I would recommend to every action movie lover.","user":"kaintrust","rank":[33,42]}]