[{"title":"A Cautionary Story Based On Actual Events","rating":6,"date":"9 January 2018","review":"I am surprised that in viewing the other reviews made by viewers of this movie none of them seemed to put together that this is based, albeit loosely, on a REAL event. The story has been altered a good deal but it is still recognizably based on an event that occurred in 2001. They have based the movie on the story of Derek and Alex King who came under the spell of a neighboring pedophile who recognized their thirst for attention and desire for a male role model's attention. The boys were only 12 and 13 years old at the time and they had been bounced around foster homes and family members for a good while and had not lived together during those times. When a neighbor, who was a friend of their fathers, began watching over them while their father was away and began showering them with attention and gifts and treats they never got in any other case, the boys quickly fell under his spell. It all ended with the boys being molested and under the neighbors spell and with his direction one of the boys killed his father with a baseball bat while he sat in a chair. For the details and more complete actual story you can simply do a search of their names, Alex and Derek King.\nThe movie loosely follows what happened while changing numerous details such as using only 1 boy and having the neighbor pedophile shot dead in an exchange with law enforcement. In reality he received a 30 year prison sentence and the boys received 7 and 8 year sentences, incarcerating them until they became adults.\nI have seen that some watchers thought the movie went to slow but I fail to see that. I was also some what surprised to not see any indication about it being based on a real incident. Perhaps because the boys were young minors at the time. I myself was fascinated by the movie and I recognized the the association with actual events after only a few minutes. I would suggest that perhaps viewers might want to read about the actual event after watching the movie. The movie depicts the terrible cost that pedophiles inflict upon their victims, both immediate and through out their lives. I see the movie as a cautionary tale of what can happen when we fail to treat our kids as human beings and as the most important things we have. The abuse of children, physical or psychological, is a terrible thing.","user":"ascendant01","rank":[53,66]},{"title":"Slow and Steady but Entertaining","rating":8,"date":"6 January 2018","review":"This film deals with some darker subject matter but it's done quite well. The characters and story is subtle but effective, it's not for everyone but if you stick with it you can find it to be effective. I would recommend it to anyone who enjoys slower dramas with meaningful visuals and music with sharp but small dialogue, but just know that it does deal with darker and disturbing subject matter.","user":"markgallup","rank":[27,35]},{"title":"The Strange Ones: Well it's got the strange part down","rating":1,"date":"30 January 2018","review":"The Strange Ones is a strange film, it tells the story of a man and a boy travelling across country and the secrets they hold.<br><br>Thing is everything is so vague, pretty much everything is open to interpretation and the whole thing is about as interesting as reading the back of a tin of beans and half as exciting.<br><br>All the way through I was thinking to myself that it was building to something, it'll have a payoff but it didn't it really really didn't.<br><br>Lifeless, unforgivably dull and with a story that partially makes no sense and partially just isn't very good.<br><br>I very rarely give movies a 1/10, it suggests a film is devoid of any redeeming features but that's exactly what we have here. It's been a while since I've watched a movie so deserving!<br><br>The Strange Ones is a remake of a short film created by the same people. I can't imagine the short is much better but can confidently say it won't be any worse.<br><br>The Good:<br><br>Nothing, nada and/or zip<br><br>The Bad:<br><br>Goes nowhere<br><br>Serves no purpose<br><br>Uncannily disturbing<br><br>Things I Learnt From This Movie:<br><br>They'll give awards out for ruddy anything these days<br><br>I don't blame the cup for leaving, I'd have too","user":"Platypuschow","rank":[48,68]}]