[{"title":"Touching, intelligent film. great Emma Thompson performance","rating":9,"date":"4 August 2018","review":"Based on excellent writer Ian McEwan novel, this film managed to balance very nicely two themes, a troubled marriage and exploration of religious freedom in life and death health decisions. Issues of sexuality dying in middle age couples, overwork's effects on intimacy quietly and maturely looked at. No easy answers given. What to decide when a religious family refuses to permit a medically needed blood transfusion for religious reasons. A really remarkable acting tour de force by Emma Thompson, Stanley Tucci very good as beloved but sexually frustrated spouse, and very amusing spot on character acting by the \"clark\". Interesting peeks into England's legal system, and some very good cinematography of English countryside.. Slightly flawed by some melodramatic and poorly explained plot turns, the movie is still a must see, very smart and entertaining.","user":"turetskyneil","rank":[80,92]},{"title":"Intelligent and well made","rating":8,"date":"4 September 2018","review":"This is a small but intelligent film that will stay with you for a long time after the final credits. It is well made in all categories and addresses a number of issues that are current and important today including faith vs law, love vs life, youth vs experience. This is probably the best adaption of one of Ian McEwans novels and benefits from a strong and nuanced performance from Emma Thomson who is hardly off the screen for a minute and excellent support from Jason Watkins as her clerk and newcomer Fionn Whitehead. As one of the characters says .. I could see you listening and thinking.. and this is really the crux of the film.What decision you come to in the end may differ... but at least you have the enjoyment of being challenged!","user":"andyge","rank":[43,48]},{"title":"\"And the Oscar goes to\"... (or should go to)... \"Dame Emma Thompson\".","rating":8,"date":"26 August 2018","review":"Judge Maye (Thompson) is a childless wife to her loving husband Jack (Tucci), but is also a workaholic. This is driving the long-term couple to the point of infidelity: a fact the ever-focused Fiona - whose life, to her, probably feels to be in a perfect if selfish equilibrium - is oblivious to. With Fiona's intense but comfortable world about to cave in around her, her increasing stress is not helped by the latest case she is working on: one where Adam ( Fionn Whitehead from \"Dunkirk\"), a Jehovah's Witness boy and a minor, is refusing on religious grounds the blood transfusion he desperately needs to fight his lukaemia. Fiona's decisions in the months ahead go much further than a simple judgement on the case.<br><br>Two acting giants - one born in London; one born in New York - tower over this Ian McEwan adaptation like leviathons. I bandy around the phrase \"national treasure\" a lot in my reviews, but here Emma Thompson is simply breathtakingly powerful in the lead role of Judge Fiona Maye, exhibiting such extremes of emotion that you would like to think that an Oscar nomination would be assured. (However, before I run out and put a £10 bet on her to win, the film is such a small British film that unfortunately both a nomination and a win seem unlikely! THIS IS A CRIME! Please share and lobby people, lobby! Perhaps at the very least we can hope for some BAFTA recognition). <br><br>Sometimes a masterly lead performance can make a co-star performance seem unbalanced, but no such danger here. Stanley Tucci makes a perfect acting foil for Thompson: if he were a wine he would be described as \"exasperation, frustration, compassion with strong notes of respect\". And he carries it off with perfection.<br><br>This is an incredibly intelligent film, working on so many different levels and subject to so much interpretation. Fiona's feelings for the troubled teenager feel more maternal than sexual, but when those feelings become returned and escalate the whole piece develops a queasily oedipal quality. Many films have focused on illicit attractions between teacher and pupil, but here lies a new variation, with Maye fighting against her best professional insticts to 'do the right thing'. \"I'm frightened of myself\" she eventually wails to a colleague. <br><br>In his opening hospital scenes, (not withstanding the comic similarities between the guitar scene here and a certain scene in \"Airplane\"!), Adam seems completely other-wordly compared to a typical teen and this comes across as utterly false. That is, until you consider the oddness of his family background and Jehovah's Witness upbringing. As such, the film just about gets away with it. Whitehead does a good job with a difficult role. <br><br>If you've been in a court, you'll know that there is something regal and magical about a judge in full regalia entering a packed courtroom. So it's unusual to see the view from the other side of the door... a non-descript office corridor and a non-descript door. Helping the judge on this side of the door is her PA Nigel, played by the brilliant Jason Watkins: a TV regular (e.g. \"Line of Duty\", \"W1A\") but seen far less at the movies. <br><br>As a story of obsessive fixation, it borders on McEwan's disturbing earlier work \"Enduring Love\". And it has the potential to go in lots of interesting directions as a sort of bonkers platonic love triangle (\"He wants to live with US?\" splutters Tucci). Where the story does end up going was not particularly to my liking, and a melodramatic concert scene was - for me - a little overdone. However it does give rise to a scene (the 'sopping wet' scene) that shows Thompson at her most brilliant: if she DID get Oscar or BAFTA nominated then this will be her pre-announcement snippet.<br><br>It's a great film for showcasing acting talent, but beware: it's short on laughs, not remotely uplifting and takes a while to mentally recover from!","user":"bob-the-movie-man","rank":[52,62]}]