[{"title":"Evil hands","rating":6,"date":"8 March 2019","review":"The story is about a puppeteer, Richie, came a to small town to visit his uncle. While I was watching, I thought he is a guy that is cursed by some spider spirit. He attempt to destroy the spider puppet but the spider keep on coming back to him.<br><br>At the last part of the movie, where he opens the door of a room, that's the time all truth reveals.<br><br>When Richie is still small, he was raped(my assumption) and tortured by his uncle Maurice. The scary spider is actually the representation of the hands of uncle Maurice. There was a drawing in Richie's diary where the spider is crawling toward him in his bed. I think it is the illustration of the childhood nightmare of Richie on how his uncle torture him using his evil hands.<br><br>First 5/6 of the movie was about Richie throwing away his puppet. As Richie grows old, he try to throw away the \"spider\"(trauma), but the spider(trauma) keeps on coming back to him. I can see the fear on his face every time he saw the spider.<br><br>At the last part of the movie, he enter the room. The childhood trauma replays and he can't bare it no more. He kills his uncle and set free a kid that his uncle kidnapped. I think setting the kid free symbolizes Richie setting himself free from childhood trauma.","user":"leonayt","rank":[32,36]},{"title":"A masteriece of horror; real and imagined","rating":10,"date":"1 December 2018","review":"It's often said that the definition of insanity is repeating your actions and expecting a different outcome. That is literally the best description of Phillip, the protagonist in \"Possum.\"<br><br>Phillip, a disgraced puppeteer, returns to his childhood home to confront his demons and his stepfather, a grungy, cruel man who taunts Phillip in every scene. The landscape, both inside and out, is dreary, repetitive, and barren. There is no variety in Phillip's life, nor in his mind. Everything is bleak. Everything is as it has always been.<br><br>From the start of the film the symbolism shows you exactly what to expect when you first meet Phillip. The balloons against the wallpaper in a child's room is a brief but succinct recap of the major trauma of Phillip's life, and the character does not disappoint when he appears. Clearly a traumatized and broken man, Phillip spends the entire film trying to rid himself of his baggage, which again, is quite literal in the overnight bag he carries with him everywhere and is always trying to destroy and leave behind.<br><br>Just when you think, right, he's done it, the next scene shows the bag and its contents still with him. At times I wondered if these sequences were a dream, or if they were meant literally and that something is really haunting him, and the answer, i believe, is that it's both.<br><br>Like 'Spider\", \"Possum\" is about madness eating away at us. No matter what we do to rid ourselves of it, we are unable. Its omnipresent, it is silent (the sparse dialogue is exactly true to this idea), it is unrelenting and it may very well win.<br><br>Harris' facial expressions and body language are almost painful to view; so adept is he at conveying the excruciating loneliness of losing one's mind. It's a brilliant performance.<br><br>I've read comments expressing dismay about the ending and lack of resolution. Firstly, the ending is shocking and came as a surprise to me. While I felt the duality of man themes expressed throughout (Harris' trench coat soaked with black mud on one side, and spotless on the other, was a good visual for that), I was focused on that duality being Phillip's). As for the lack of resolution for Phillip, there very often just is none. People go mad, people fall between the cracks, people disappear into their trauma and sometimes they are not saved. Bleak, yes, but true.<br><br>I've watched this twice in the past 24 hours and I'll likely watch it many more times. If you've ever been broken or traumatized, you may recognize some of yourself in Phillip. If you've ever known or loved, but never understood, a broken person, you may find this to be an incredibly empathic experience.<br><br>I can't rate it higher than 10, but I would if I could. Brilliance.","user":"horrorismyhome","rank":[48,73]},{"title":"Garth Merenghi's Dullplace","rating":5,"date":"2 November 2018","review":"Possum is a (very) slight yarn about shamed puppeteer Richie (Sean Harris) returning to the decaying home of his childhood. Richie spends his days wandering an undisclosed part of Norfolk ( population 10?) to the accompaniment of a Radiophonic Workshop soundtrack. There's a child abduction case lurking in the shadows too. Could Richie be involved, and what is that ghastly apparition nesting in the bowels of his bag?\nYeah, on paper, this one sounded like it'd be right up my street. So its with heavy heart I regret to inform you that Holness' debut in the writer/director chair is a major disappointment.<br><br>\nBased on a self-penned short story (and showing every inch of it) Holness' painfully derivative Lynchian pseudo art-horror would have been rightly rejected before a frame had been shot had his name not been attached to it.\nHowever, it's less Eraserhead and more Frank Henenlotter's Basketcase gatecrashing David Cronenberg's Spider without the wit &amp; intrigue of any of them. Surprise &amp; suspense evaporate within the first 20 minutes and it spends the rest of its time hitting the same dull beat until the non-too-shocking anti-climactic reveal.<br><br>\nI do appreciate the repetitive nature of the narrative is intentional and is absolutely fundamental to the vivid picture it attempts to paint of a nightmare in a damaged brain. But the lack of variation in tone and design (not to mention locations) make for a very ugly and oppressive viewing experience, and not in the way it's creator would hope.<br><br>\nThe performances are unconvincing too: Alun Armstrong as Richie's seedy Uncle Maurice, devours the scenery amateur-dramatics Bill Sykes style, whilst Harris (an actor I've irrationally had it in for since his rancid space-crusty turn in Prometheus) goes full method with one-note, misery-guts mug and mannered mannequin body contortions. And true to Lynch-clone fashion, he does it decked out in a gormless-looking, buttoned to the neck grey shirt.<br><br>\nIts ironic then that, the only positive thing to say about him (and Possum as a whole) is the major contribution he makes to the creepy-crawly thing you can see on the poster. The arachnid is sublime, and the only thing you'll remember long after you've forgotten the film.","user":"bobhartshorn","rank":[51,84]}]