[{"title":"Not a bad little \"End of the World\" flick...","rating":7,"date":"15 September 2019","review":"\"Riot GIrls\" is a fun little addition to the \"end of the world\" genre. Presented as a literal comic book, we're introduced to a world where a virus killed off all the adults and left only kids. The kids split up into two sections, divided by a bridge -- the \"West Side\", where all the cool kids live, and the \"East Side.\" The \"West Side\" is run by the Titans, a bunch of football players jocks who have imposed a rule of law over everyone in the West. The \"East Side\" is seemingly just a bunch of misfits. We're introduced to one group of misfits and their leader, Jack, who \"steals to stay alive\" according to the comic. After stealing stuff from the West Side guys, Jack is captured by them and taken into the West Side. His sister Nat, her friend Scratch, and Sony -- a guy from the West Side that Jack saved and brought back -- go on a quest to save Jack.<br><br>The film moves along briskly and is pretty entertaining. The two female leads -- Madison Iseman and Paloma Kwiatkowsi -- really shine and have a nice chemistry that holds the film together. Of course, as with so many of these type of films, despite the fact that these girls are on their own with no money, they sport detailed and very fine \"goth style\" eye makeup and a hairstyle that must take a stylist an hour a day to keep up with (I often wonder by no director has ever seen someone in their \"end of the world\" film sit in hair and makeup for over an hour to get their style done ever said, \"You know, someone in this situation wouldn't be able to keep up the grooming on a blow-dried mohawk with a side razor cut, or expansive goth style eye makeup.\").<br><br>The down side is that there's not really a lot going on. It's not exactly slow or boring, but if you're expecting an action packed film you're probably going to be disappointed. But if you're in the mood for something a little bit smarter than the average \"teenagers left alone\" movie, worth checking out. I enjoyed it.","user":"stsinger","rank":[10,12]},{"title":"Teen movie & bad","rating":4,"date":"12 November 2019","review":"Target for 18-22 age group and if you not, suggest not to waste tiMe. Really boring for story line.","user":"ks-60500","rank":[2,2]},{"title":"watchable low budget post apocalyptic thing from Ontario Canada","rating":6,"date":"14 September 2019","review":"In general acting is ok.\nI seen lot worse.\nsame with direction and script.\nsure, it can have been better wt time and money but this movie is just a past time popcorn one, not a deep representation of a real situation .\nalso at this time of review, there is not a bunch of fake ones to try to boost it so kudo to producers and crew .\nI can see the 2 main actresses progress easily to more work and recognition.","user":"surfisfun","rank":[7,13]}]