[{"title":"Fighting","rating":8,"date":"8 August 2018","review":"Life is a ... fight? I guess so, better than the other \"b-word\" comparison maybe. In this case it really captures what this is about. A girl that has father issues and also anger issues. Why not combine both and \"fight\" them? So that is what is happening here and it really hits home with the drama and the acting is really good too (fighting also).<br><br>This may offend some people, especially if you don't feel the relationship between her and her father. But it is painted nicely and it doesn't try easy ways out. It's not like you are going to get something you yearned for. Something a let's say more cliche movie might have done. So you may like this approach and ultimately (re)solution this aims for, or you may hate it for not being the way you would like it to be ... hopefully you'll enjoy it for what it is! And take the message to heart! Fight for what you believe in","user":"kosmasp","rank":[4,5]},{"title":"It really becomes a touching father/daughter love story at the end.","rating":8,"date":"25 May 2018","review":"'FIRST MATCH': Four Stars (Out of Five)<br><br>The new Netflix drama about a teenage girl from Brooklyn's Brownsville, who's spent years in foster care, that decides that joining the boy's wrestling team is the only way to reconnect with her estranged father. It was written and directed by Olivia Newman, and it stars Elvire Emanuelle, Yahya Abdul-Mateen II, Colman Domingo, Jharrel Jerome, and Jared Kemp. The film was released by Netflix through it's streaming site, and I found it to be a bit of a tearjerker at times. <br><br>Monique (Newman) is a teenage girl from the Brooklyn Brownsville neighborhood, who's spent most of her life growing up in foster homes. She really wants to reconnect with her father, Darrel (Abdul-Mateen II), and she thinks the only way she can do this is by joining the boy's wrestling team. The team even allows her to play, and she's good at it, but of course this isn't enough to win over her hard to pleased dad. So things become more extreme. <br><br>The movie is a little slow-paced, and too reminiscent of other similar themed dramas, but I have to admit that (towards the end of the film) the drama really got to me. Especially the climax. The two leads are really good in their roles (especially Emanuelle), and the movie really becomes a touching father/daughter love story at the end. There's even some exciting fight scenes in it as well. I definitely recommend it.","user":"Hellmant","rank":[5,7]},{"title":"Well written and directed","rating":7,"date":"7 April 2018","review":"Let me start by saying the wrestling and fighting scenes... Horrible. They should've done better at choreographing the scenes but I use to compete so probably over critical about them. Now that that is out the way, this movie really touched me. It wasn't about wrestling or fighting but about life choices. The characters grow on you just like the movie. At first it seemed to be to fast and scattered but finally finds a better rhythm, displaying the girls love for a father who is lost. I definitely recommend watching","user":"bosstrangla","rank":[6,9]}]