[{"title":"Relatable and Realistic","rating":9,"date":"29 April 2018","review":"A story about the reality of being a Christian in today's world and the level of faith and forgiveness that we should aspire to. I left this movie and immediately recommended it to friends and family. If you can't find something worthwhile in this movie then you honestly went in to it wanting to dislike it. Solid performances from all involved and well shot. Definitely recommended.","user":"kaipeace","rank":[10,12]},{"title":"A family movie with a modern message","rating":7,"date":"15 March 2018","review":"I watch this movie without bias, unlike the anti Christian's reviewing this film on here. For me, it is a solid 7, being that it has a message that everyone needs to hear, \"Don't text and drive\" but it also adds the message about being an organ donor and how a person can save the life of another. I don't go into this movie with the hateful opinions of the people who aren't believers so they don't believe in the power of God, the power of prayer and the power of forgiveness.<br><br>You see it all over IMDB. People adding hateful tags to Christian movies, such as \"indoctrination\", \"propaganda\", \"religious fanatics\" and the list goes on. There is no propaganda here, nor is there indoctrination or religious fanaticism. There is love, however. And forgiveness. And even anger at God at one point. These are called human emotions and this movie is full of them. Yet Christians are hated because of what we believe to be true. It doesn't matter if you personally don't believe it, it is true for us and we see the evidence all around us.<br><br>And that's what this movie portrays. We see this evidence all around us. Nothing happens by chance, as science would like to \"indoctrinate\" into us with their \"propaganda\" if I can use the same juvenile approach that anti Christian reviewers on here are using regarding all Christian based films on this web page. This movie deals with real issues and human ones at that.<br><br>Now, the reason I didn't give this movie a well rounded 10 stars is because this movie has been done over and over again, telling the same message but with different characters and a slightly different story. Even the intersection of lives that are all connected, it's been told before. However, I did give the film a higher rating than I normally would have due to the fact that they boldly told this story amidst all the hate and spite that would most definitely be thrown at it, which is evident by several of the reviews on here by confessed nonbelievers. They went into this movie with extreme bias to begin with, so of course their review would reflect that same bias.<br><br>I, on the other hand, went into this as a believer, but also as an honest reviewer. Yes, the story has been told before. Yes, the acting was sub-par. Yes, the character development was a bit shallow at times. Yes, as a believer I found it a bit odd that the main character drove an expensive Mercedes Benz in the movie, (on an ASSOCIATE PASTOR'S salary??) but that was a bias I have of my own, in which Christians are already portrayed as greedy, money siphoning people, preying on the elderly and poor to squeeze that little bit out of their own congregation. I don't feel that giving the associate pastor a Mercedes Benz in the movie was portraying the right message here. This is really nitpicking for me, and I know there are those Christians who believe God wants us to be rich, even though the Bible doesn't say that at all, so I won't dwell on it. It's a movie and Mercedes probably got their product placement in this movie without having to pay a dime or maybe they did contribute to the movie. Who knows.<br><br>That being said, go into the movie for the message it portrays. No the \"bad acting\" by many of the actors. Don't go into the movie just to write a bad review because you yourself don't believe in God. That's not the topic here. The movie and the message it portrays is. Don't feel the necessity to give a bad review on a movie just because it is faith based. Realize there are other people who don't share your beliefs and be respectful about another's beliefs. For me, I don't have enough faith to be an atheist, but I won't go out of my way to review an anti God movie based on my own bias of that fact. That's called being an adult and respecting others opinions about a matter.<br><br>In closing, I would recommend people watch this film. If for the Christian the message of God's love and forgiveness and grace, and how we deal with our great nations laws and medical options that benefit all humanity, or for the nonbeliever, the the same reasons. Go into the movie without the hatred for God and what you don't believe. Go into the movie to be entertained and to hear a message that's obviously foreign to you: love. For that is what this movie expounds upon. The love we have for others and the forgiveness which stems from that love. If that's why you hate God then humanity has no chance of survival. The Christian message is 100% about love. And it pains me that so many people are against such a wonderful trait.","user":"Greylogan","rank":[9,11]},{"title":"Everyone must see.","rating":10,"date":"27 June 2018","review":"I don't care who you are or what you believe, everyone of all ages should see this movie. Forgiveness is SO powerful.","user":"sarahcaughran","rank":[6,7]}]