[{"title":"Character and food, a lovely take on source material","rating":9,"date":"4 January 2019","review":"Kim Tae-ri has mostly done dramatic, ensemble films in her short but extremely promising career. Here she is the dominant character in a slice of life, and she carries it beautifully. There is not twists or turns, just a normal young woman dealing with growing up, and you stay completely engaged in her story thanks to Tae-ri's performance.<br><br>The supporting cast, Ryu Jun-yeol and Jin Ki-joo, playing childhood friends are wonderful as well. Ryu isn't the typical looks for a young Korean actor and all the better, he's actually charming.<br><br>Food is a supporting character in of itself, of course. Farming and cooking are centering, the work is worth the reward.<br><br>And if you wonder what happens at the end, note, she knows what he told the other woman ;)","user":"prettybox","rank":[10,10]},{"title":"Improves on the original by humanizing the story ...","rating":8,"date":"1 March 2019","review":"For the uninitiated, Soon-rye Yim's 'Little Forest' is a remake the Japanese minimal-arthouse film of the same name. I must admit, I was pretty uninitiated, and watched this delightful Korean film first. I actually preferred it to the original, it's a much easier view, focussing on the character Hye-Won played by the excellent Tae-ri Kim and relations with her mother and friends. It's a different approach to the original, more mainstream and accessible. Rural life is at the heart of things, but doesn't always take centre-stage. So, while the Japanese film documents so much detail (weather, food, recipes, cultural events, nature etc.) you lose sight of the people, which may have been the intention. Both films have their merits, but I found this one enchanting. The support work of the other actors makes the story fun and engaging (Jun-yeol Ryu is quite heroic and funny in the role of local farmer Jae-ha, Hye-won's possible 'love interest', and Ki-joo Jin is excellent as the feisty no-nonsense best friend Eun-sook), and there's a nice arc at the end, so some 'matters' seem to be resolved (unlike in the Japanese film, will they make a 3rd version so we can find out what actually happened to the mother, for example?).<br><br>So my advice, watch the original 'Little Forest' but take plenty of supplies and climb the 'mountain' in stages (with both 2014's Summer-Autumn and 2015's Winter-Spring that's 4 hours of dense and detailed viewing). While you're making all the necessary preparations, sit back and enjoy this little charmer!","user":"ok_english_bt","rank":[14,15]},{"title":"worth watching","rating":9,"date":"16 September 2019","review":"This was such a wonderful surprise - I absolutely want to learn Korean to view in native language - - I can not say enough about the filming, music, minimal production, screen writing and or directing - I did not know the story before but the symbology (ism), metaphors, or cinematic equivalents are very well delivered - might be dismissed by others as trite and done before especially with food as the story teller - but this was so refreshing - -","user":"memine23","rank":[5,5]}]