[{"title":"Pretty Funny","rating":7,"date":"15 March 2019","review":"Now, clearly this movie is not Scott Pilgrim, or Deadpool, both of which this flick borrows from, BUT, I did think it was pretty entertaining and often hilarious. Yes, the narration, as another review noted, is a little over the top, to put it mindly, however I often found myself laughing, surprised, or even shocked by some of the one liners, stop downs, and silly, bordering on ridiculous, sight gags they threw in this thing. All the \"big\" names in the movie were clearly there just for the paycheck, but I really got a kick out of Matthew Kingsbaker. He definitely went for it, and I loved the romance/paranoia subplot between him and the leading lady. Look, it's no Midnight Run, but if you dig wacky, over the top, self deprecating humor in a movie that clearly isn't taking itself too seriously, check it out.","user":"aok1979","rank":[10,12]},{"title":"ditch the narration","rating":4,"date":"13 March 2019","review":"This film gets quite obnoxious with all the narration they do, with some over stylized editing. Id ditch all the narration parts and maybe this film would have some more potential.","user":"gabaod2","rank":[9,12]},{"title":"Lost potential with cheese-ball narrating and amateur acting by Kingsbaker","rating":4,"date":"29 April 2019","review":"Decent directing by Guillermo Ivan (who also played Rafael), although the shaky-cam scenes were annoying. Good action (but very repetitive), and pacing that fit the 98 min runtime, but the writing was terrible and cliched. Four writers and you'd think at least one could write better than a 5th grader. The worst part was the infantile narrating that really failed this film, as did casting novice Michael Kingsbaker who's acting was amateurish and annoying. The rest of the cast was great, but not enough to get past the annoying Kingsbaker and his narrating. Any review above a 5 for this film (including out of the current 8) are all fake/paid. This film is no better than my 4/10. Avoid, even if you're bored.","user":"TheTopDawgCritic","rank":[7,9]}]