[{"title":"A 12 year old's perspective.","rating":1,"date":"20 July 2017","review":"When I turned on the the TV to see an ad for the new diary of a wimpy kid film I felt like I could do 200 cartwheels.I love the DOAWK films and books and was so glad for a new one. But I ended up so annoyed at the end of the film. Also I should probably mention I saw the film around a month ago but this is what as a kid I think of this film.<br><br>I tried so hard throughout the movie to like it. I wanted to like it. But I couldn't. The film is so poorly written it sounds like a skit from 2007 YouTube. Sorry to break this to you, but most kids over the age of 7 don't like lol random humour which doesn't make sense. OMG LOL HE COVERED IN CHEESE PUFFS XD. Instead of being lazy. Just make your actors look like humans. There vocabulary and voice acting is so bad they might as well be puppets that make sounds with you squeeze them. The acting is lazy and terrible. They act like there robots and are so unnatural it's creepy. I don't know what to say right now about anything else about this awful film apart from the extras. When they look into the camera it just cracks me up. And they lost 2mil from the and gained nothing. HAHAHA.","user":"ohc-28092","rank":[32,42]},{"title":"Diary of a Wimpy Kid, The Long haul - Simply put - don't waste your time on this awful attempt to resurrect the past!","rating":1,"date":"21 May 2017","review":"Diary of a Wimpy Kid, the Long Haul, simply put, is a bad Film. <br><br>Summing up The Diary of a Wimpy Kid, The Long haul = Predictable dialogue, predictable action, predictable repetitive jokes from the past, a lousy no-chemistry cast, and profoundly boring. The fact that everyone in the cast comes off as \"acting\" is just another nail in the coffin.<br><br>About 98% of the reviews on Long Haul point out how bad the movie is. Variety and Hollywood Reporter gave it some kudos. Which shows that a big studio, like Fox, can still \"Pay Off\" reviewers in an attempt at not making the film a \"total bust\", which it is. <br><br>You had an iconic cast in the first 3 movies that were excellent. The original cast had charm, chemistry, great interaction, and made 3 very entertaining movies based upon Jeff Kinney's Diary of a Wimpy Kid series. This movie, Diary of a Wimpy Kid, the Long Haul, just doesn't connect at all. <br><br>The Long Haul film is sort of like a stand alone idea created in an attempt to \"con\" the public into thinking this is a continuation of the original three movies. It is nothing of the kind. The movie is so bad on all accounts that 20th Century Fox had to go out and try and get the original cast members to say something nice about the movie. But that just came off as a \"cheap hustle\". <br><br>The story and performances are not funny. This movie reeks of predictable action and dialogue, as well as a cast that are, simply put - just bad, without cohesiveness or chemistry. <br><br>Our 4 kids, my wife and I really enjoyed the first 3 Wimpy Kid movies and we watch them over again, to this day. I don't think anyone could ever take the place of Zachary Gordon as Greg Heffley, even though a very weak attempt was tried. Gordon \"was\" Heffley and performed masterfully as the main character and kept true to the personality of Kinney's book series character. In the Wimpy Kid, Long Haul, the part of Rowley, which was so prominent in the first 3 movies and in Kinney's book series, has been completely downplayed to almost non-existence, with little screen time. Let's not even talk about the actor who they chose to play Rowley - what an amateur and not believable in any way.<br><br>The actor who plays Rodrick came out of \"left field\" and is a farce in that he doesn't fit the character of Roderick both in physiology and performance. He doesn't match the characterization as written by Jeff Kinney. Devon Bostick (the original Rodrick) could surely have played the part since Hollywood uses 25-35 year-old's to play Jr. High and High School kids anyway. In addition, attempting to replace Rachel Harris and Steve Zahn with Barrymore and Tom-Everet makes it all an underwhelming, futile attempt at movie making.<br><br>This is a movie that should never have been made. The original movies were fun and entertaining. Wimpy Kid, Long Haul is an empty attempt to make money as an \"after-thought\" and rip off the public because Fox was too stupid to make 6 back-to-back Wimpy movies, which they could have done, when they had the opportunity. Apparently, 20th Century Fox is not a pro-active or foresightful studio as, for example, Warner Brothers or Universal would have been. Ie: Warner Bros shot Harry Potter movies back to back. Fox could have easily made 6 Wimpy Kid series movies from the original cast long before they matured and everyone would have been happy.<br><br>Don't waste your time or money on this poor attempt at resurrecting the Wimpy Kid movie world. If the studio had 1/2 a brain, they would have made this an Animation Film instead, which might have garnered some interest from the fans.<br><br>Find something else to do with your own time or kids this weekend as sitting through the Wimpy Kid, Long Haul is just that - a boring long haul.","user":"donjohngone","rank":[62,93]},{"title":"This is just disappointing. Shame on Jeff for this one.","rating":1,"date":"20 July 2019","review":"THIS movie is terrible. Literally. See, I'm not even gonna get into the cast cause they are people, but when I first saw the trailer I was confused on who tf these people were and why Greg went down 5 ages, but I'm not gonna talk about that. I thought if I watched the film it would override the cast, but it DIDNT.<br><br>First of all the acting makes my head hurt because it's so BAD. Not everyone, but A few. Not only is the acting bad, but the story isn't ANYTHING like the book. The only thing that's true are a few things, like the road trip and that purple family, but that's it. I get how doawk usually doesn't exactly follow its book in the movies, but at least it's more than this movie. And they use other parts from different books in their other movies, this one they just went a completely different route.<br><br>There were no video game competitions, there wasn't any \"youtubers\" like wtf. I could barely even finish it because it was making me angry, it was cringey, and I HATED IT. this movie is bad, they shouldn't have made it in the first place. Shame on you Jeff Kinney. Shame on the producers, shame on the casting director, and shame on whoever was the idiot to think \"we should make another wimpy film but this time for follow the storyline at all!\".","user":"myawaire","rank":[7,8]}]