[{"title":"Epic historical movie done right","rating":9,"date":"13 September 2017","review":"I don't often watch historical Chinese movie but with God of War(2017) it a different story.Directed by Gordon Chan starring Sammo Hung,Wenzhuo Zhao and a handful of talented actors God of War deliver anything you want from a epic historical movie.The stand alone fight scene is well choreographed and the big action set pieces scene is just so bloody and brutal.Many fan of Sammo Hung will disappointed with this movie cause the real star is Wenzhuo Zhao when he sold the role as a brave general that also very afraid of his wife.It not the best movie China can offer but in the meantime it sure gonna entertain many people.Strongly suggest watch on theater","user":"phanthinga","rank":[16,22]},{"title":"Excellent historical war and martial arts movie!","rating":8,"date":"1 December 2017","review":"Wow, this was one hell of a ride! If you like martial arts and warfare, you NEED to watch this movie! The epic sword fighting scenes in particular, especially the final fight, are a must watch! None of that flying nonsense you get in Hero or Crouching Tiger, Hidden Dragon either, this is (very) fast, gritty, and realistic sword fighting! And you get LOTS of it! There are also several intense and mesmerising scenes of warfare, and there's lots of bloody violence, so you better be ready for that. There is some great cinematography as well. It doesn't have the same kind of high caliber dramatic story or acting as movies like Red Cliff (although these are still good), and there isn't as much fancy strategy as in some other good warfare movies (but it still has a fair amount of it), but the action is top tier! Personally I found this to be one of the most satisfying movies I've watched all year, after having watched tons and tons of mediocre or disappointing movies both from The West and The East this year (including many I had high hopes for...). So if you like warfare and warfare strategy, martial arts, and especially sword fighting, or all of the above, then definitely watch this as soon as you can!","user":"Eiriksterminator","rank":[10,13]},{"title":"Sumptuous war epic","rating":6,"date":"4 November 2017","review":"There are no less than six production company intros before God of War has even begun, giving an idea of the amount of money and co-operation necessary to make this film possible. Fortunately, they come together to pull off some of the most impressive battle sequences seen this decade. Unfortunately, God of War has similar pitfalls to other films of this genre and blockbuster Chinese films in general; a distinct lack of human engagement.<br><br>The year is 1557. A Japanese invasion force made up of trained samurai and bloodthirsty mercenaries have taken the Chinese coastal town of Cengang. After his previous success against such 'pirates', it befalls the renowned General Qi (Wenzhuo Zhao) to finish the siege and purge this great force from China for good.<br><br>What could have been outright propaganda, rapacious Japanese against the noble Chinese, is actually a somewhat layered film with established characters and motives on both sides of the fight. The respect of the filmmakers passes down to the leads, the rivalry of Qi and Commander Kumasawa (Yasuaki Kurata) reminiscent of Jack Aubrey (Russell Crowe) and his French adversary in Master and Commander.<br><br>God of War is attentive to a fault when it comes to historical authenticity, a middle section bloated by talk of an internal Chinese politics that never impacts the narrative at large. An early element of the plot is a Japanese general imprisoned on the Chinese mainland; this isn't followed up on as the plot progresses.<br><br>As a lead, Qi is a cipher. The audience never really feels his irritation at the Chinese higher command, nor at the sacrifices he and his men must make for victory. Great effort is made to mourn characters thinly established.<br><br>The most enjoyment I had with any of the characters was Lady Qi (Regina Wan). While at first her subplot feels as if it is going through the motions to justify a female lead, as the film progresses and she becomes more integral she is a joy to watch, asserting herself both against her husband and the Japanese invaders.<br><br>Where the film really stands out is not in character development but in its set-pieces. The film opens with a visceral attempt to lift a siege, and every battle henceforth is an escalation. Gunpowder (a Chinese invention) explodes across the screen. Even in the heat of battle, director Gordon Chan can focus on visual flourishes as tiny as the twist of a spear. A minor point is that the definition of the Japanese army is 'pirates', which makes me wish there had been a little bit more plundering and naval warfare.<br><br>The film makes a success of its martial arts sequences, hand to hand combat deftly interwoven with the clashing of armies. The highlight is when Qi faces off against a miner in order to secure his service, in a sequence that comes closest to any social subtext in the film.<br><br>God of War is the sort of film the Politburo loves to see, a spectacular and historic representation of an ascendant China. It's also far more watchable and authentic than this year's mess, The Great Wall. Alas, God of War stands as more a film of spectacle than substance, and while enjoyable at times may not linger in the memory. The wait for Chinese films that can combine Sixth-Generation character study with state-approved high production budgets continues.<br><br>@BrianInvincible christophermarchant.wordpress.com","user":"TwistedMango","rank":[10,14]}]