[{"title":"FANTASTIC!","rating":10,"date":"15 July 2019","review":"Sometimes when you take a chance on a movie with almost zero reviews it pays off in a big way! That's how I feel about Crown and Anchor. The trials and tribulations of this dysfunctional family had my full attention from the get go. Pop shows up near the end and what a flippn' winner this man is. No car chases, sexy women &amp; shoot em ups throughout, rather a gripping experience into the lives and the ramifications of rough people with bad behavior. If you like thriller-suspense-dramas, you'll probably really enjoy this movie.","user":"shellycaldeira808","rank":[5,7]},{"title":"My Review Of \"Crown And Anchor\"","rating":7,"date":"15 July 2019","review":"I have to admit, for a directorial debut Andrew Rowe sure meets his calling heading. \"Crown And Anchor\" rests somewhere between \"Training Day\" and \"In Bruges\". The attitude and pace of the film is more classic British thriller, but the incorporating of a dark and dingy cop in crisis hits more to the film styles this side of the pond. Appreciate considering the film is based from the point-of-view of a New Foundland native.<br><br>The story stays really traditional with familiar tropes, recognizable characters and mixed with steeley, tense angst. Even though the originality suffers a bit, the characters and situational drama is captivating and at times rife with dark humor. The acting is stellar and the build to a moment when these two tragic characters clash is compelling.<br><br>The suspense and intensity starts almost immediately in \"Crown And Anchor\". It gets stated in the beginning that some things have happened, we enter in the midst of the worsening chaos and things are only gonna get worse. Moments of botched criminal activity, interactions with unsavory characters, and a bit of blood and bandages bring in the thriller elements. The film could have easily been edited down about 20 minutes and still killed it, but overall \"Crown And Anchor\" is worth the watch.","user":"ASouthernHorrorFan","rank":[2,3]},{"title":"Good two hours 🎥!","rating":7,"date":"11 February 2020","review":"I had nothing to watch, so searching through\nPrime I found Crown and Anchor. It was better then expected and I really enjoyed it. Give it a try.","user":"wongieteam","rank":[0,0]}]