[{"title":"All Mewes","rating":9,"date":"16 August 2019","review":"I was going to buy this movie no matter the reviews as I am a fan of Mewes and think he is under appreciated. So much more fun when the plot of the movie is that he is under appreciated. This movie is not an Oscar candidate but it was really fun to watch. I dug it. I laughed.","user":"sherm44","rank":[15,17]},{"title":"Decently funny take on the irony of method acting","rating":6,"date":"5 August 2019","review":"This isn't great british comedy, Hot Shots or Best in Show, but it is entertaining.\nIf you look for the perfect comedy, this isn't it, but it you're happy enough with a comedy that does produce actual laugh out loud moments (in difference to the wast majority of romcoms) and plenty of chuckling moments this is a great pick.\nThis does have some really original comedic scenes and in others it dares to go for it, several things do not work some works but doesn't belong or rather ad to the movie itself.\n(I do not see this as a spoiler as it is the name of the movie, but if you think it is dont read the following sentence).\nThe parody of method acting and that it's really not acting but relative madness is quite fitting. For a laid back saturday or sunday when the rain poors down you can do alot worse.<br><br>The cinematography isn't the best, it's to raw - a trick used in low budget movies is usually to upscale the equipment and boost the contrast/bloom (afaik) to get a more expensive looking result - it's not used here. Something that does bring the grade up is the adaptation of it to the parody at hand, which works well.\nThe acting is what you can exspect, not aced but neither bad, Vinnie Jones does a solid performances and Gina Carano (which i personally have hopes for to become the first female Bond) even as alluring doesn't perform as well as could be anticipated.\nThere are some seeworthy side roles - Vinnie jones, Terri Hatcher, Stan Lee and Mickey Gooch Jr (which doesn't nail the has been ex cop but isn't too far from landing a decent performance - as that role pays homage to several well known spoofs and roles in known movies that is essentially better than anticipated).<br><br>*Most moviebuff will probably find this entertaining, there are plenty of homages and spoofs on other movies in it (note that they aren't as clear as mainstream usually feeds) - notice how the camera angles and cinematography change severely to mimic known pieces at a handful of times.","user":"shide_85","rank":[8,9]},{"title":"Mewes debut","rating":9,"date":"3 August 2019","review":"You have to love Jason Mewes, The debut of Mewes as director is not perfect, (which isn't a bad thing), but is fun, something that we need nowadays, plus, this blend of fiction with some real life events are handled in a very professional way, the cameos are perfect, and watching Stan Lee was great... I really hope this is the beginning of a series of movies where you can see Mewes and friends acting and having fun... Some people may not like it, but I loved to watch it!","user":"psygarg","rank":[14,22]}]