[{"title":"An old school tearjerker","rating":8,"date":"20 September 2017","review":"Okay okay I got lured and pranked by the cool title, thinking it's some zombie gorefest. I got even more keen to see it when I found out it's an old-school ten-hankie tearjerker. Cried, I did, and every tear is earned. Over the course of the film, the odd title takes on meaning and made a resounding impact.<br><br>I (Takumi Kitamura) am a high school student. I happen to find a diary by my classmate Sakura Yamauchi (Minami Hamabe) that reveals she is suffering from pancreatic cancer. She will draw me out of my shell and I will help her fulfill the wishes on her bucket-list.<br><br>12 years later, due to Sakura's words, I (Shun Oguri) am now a high school teacher at the same school where I graduated from. While I talk with my student, I remember the several months I spent with Sakura. Meanwhile, Kyoko (Keiko Kitagawa), who was Sakura's friend, is about to marry. Kyoko also recalls the days she spent with me and Sakura.<br><br>Yes, the main protagonist isn't named throughout the film.<br><br>This is a story about a burgeoning teenage romance between two high school classmates on opposite ends of the popularity spectrum. The socially awkward boy is a librarian who sees a lost book as a sad book, but Sakura sees it as lost treasure for the finder. He can never hold eye contact with anyone and protects the space around him for dear life. Whereas Sakura is a girl with a cheerful and optimistic disposition who just happens to be suffering from a terminal disease. Sakura may be dying, but she is not about to throw in the towel yet and wants to hit as many highs as possible in the few months she has left. Their friendship seems unlikely, but it is easy to buy into their blossoming love because they are so likable and their time is so finite.<br><br>Kitamura gives a restrained performance, allowing Hamabe to shine in counterpoint. When his character finally opens up in the end, we can feel the emotional impact like a swinging sledgehammer to the gut. Hamabe's Sakura is a beacon of hope, a cauldron of positivity and a dispenser of wisdom. It is easy to fall in love with her so much so that it becomes heartbreaking because we know what comes at the next turn. She is wisely not made out to be a saint in that she is curious about sex and her attempts at seduction you know what I shall let you discover that for yourself 😊.<br><br>Director Sho Tsukikawa seems like an old hand at crafting tearjerkers and he handles the emotional scenes with deftness. The emotional scenes don't feel manipulative or pretentious, carrying many nuggets of life's wisdom through the protagonists. He knows how to fill your heart with beauty and gradually inflate it till it explodes in an avalanche of cherry blossom petals.<br><br>The movie takes an interesting detour from Yoru Sumino's 2015 bestseller in that it jumps forward 12 years to show Sakura's impact on others. So essentially the story is told in flashbacks. Thankfully, they are well-handled and never becomes an over-used narrative device. When I was in one timeline, I kept wondering about the characters in the other.<br><br>The story has a sublime twist in the end, earning its namesake and proving that Sakura has achieved that most important thing in any person's life – to change the world around her. Her memory lives on in others.","user":"ctowyi","rank":[17,20]},{"title":"A Deeply Touching Movie That I Haven't Seen In A Long Time","rating":10,"date":"8 October 2017","review":"I've seen this movie in an advance screening in Hong Kong. All I can say is that it's a very very touching movie. The story and music are very well done. The music composer is the one who composed for 2004's classic Japanese romance movie \"Ima, ai ni yukimasu\" (aka \"Be with You\"). Highly recommended. 10/10","user":"yiuleungf","rank":[10,16]},{"title":"If you're looking to cry in public...","rating":10,"date":"13 November 2018","review":"If you want to cry for two hours at the start of your 10 hour flight from Brazil to Canada, this is a great way to accomplish that, and somehow this deceptively titled drama was featured in the in-flight programming on Air Canada. I had a few drinks, settled into my aisle seat on our giant plane and then loudly sobbed for two hours through this brutally depressing film.<br><br>10/10 would make fellow passengers uncomfortable again.","user":"drakHula","rank":[6,10]}]