[{"title":"wow!!!! Simply WOW!!! WHO COULD'VE THOUGHT SPLIT PERSONALITY DISORDER COULD BE USEFUL!!!","rating":9,"date":"5 May 2019","review":"What intrigued me watch this movie is Split personality disorder. And since it is a comedy I expected a \"Me, Myself &amp; Irene\" kind-ish movie. And I am almost satisfied with the movie, even though I know none of the people worked for this film.<br><br>Sandy Batchelor, the man who played Rupert. I never even heard of him before, but he is absolutely brilliant. Especially in the scenes of theater where he switches back to his normal self and just with a pat on the back he is angry again. If that is all a single take, then he definitely did a wonderful job. And the lady who rehearses with is also as good as he is. Her reactions to his outbursts are so good, even we feel that she is feeling guilty and threatened by him. I think they need to be recognized.<br><br>Even though this provides less comedic effect, it is exciting to watch when everybody mistakes his anger for method acting. The comedy is provided by the other characters, especially the director.<br><br>The only problem with this movie is that it looks very minimalistic, but luckily it never feels that way. This movie well written and editing is pretty good so you don't feel bored at all.<br><br>The main plot points I liked about this movie all the 3 personalities have the objective to become an actor and all of the 3 are well aware of each other and that they need ANGRY RUPERT to be in the part. But the conflict arises when THE ANGRY RUPERT starts to ruin his life by being a dick all the time. And without NORMAL RUPERT'S vulnerabilities he THE ANGRY RUPERT can't be loved. This kept me captivated to know what will happen by the end of the movie. It is more like working with an angry boss. you can't work for him, but you can't leave him. Which probes them to accept one another. This makes him like any other person because everyone controls their emotions and learn to redirect them for proper use. This is when \"THE FLIRT RUPERT\" comes in and when he faces rejection we feel again that he is troubled for real this time.<br><br>This movie is well written and performed. I highly recommend it.","user":"mnagaditya","rank":[9,30]},{"title":"A god awful twisted movie","rating":1,"date":"16 October 2019","review":"There's no flow, no solid characters and no interesting story.\nI thought it was the biggest waste of time since Ishtar. Dreadful Crap!","user":"ferdmalenfant","rank":[1,2]},{"title":"Great","rating":9,"date":"11 May 2019","review":"Great small budget movie with solid performances from all actors. Nice story, good acting.","user":"zaethermind","rank":[1,9]}]