[{"title":"Unintended consequences","rating":9,"date":"17 July 2019","review":"Mike has an incredibly boring job - he works in a restaurant. (One of the things I learned from this film is, do NOT tell restaurant staff it's your birthday. Several times a day they have to pretend to be happy while singing happy birthday to the customers, while inside, they hate it.)\nMike gets into a graphic novel, yes a comic, about a little known superhero called Captain Black. He decides to do a bit of cosplay, beginning with rescuing a cat from a tree. The neighbours are unimpressed. He improves his getup and goes to a Halloween fancy dress party, and across the room spots a woman dressed as Captain Black's female sidekick. It's immediate 'basic instinct'. Unfortunately for Mike, he goes along with what comes next, no questions asked, until reality sets in. And then his life falls apart.\nThis wasn't the movie I expected to see. I'm not sure what exactly I expected but it wasn't this. However, I was impressed by this film. Good acting, good direction, all too plausible.","user":"oldvinyl","rank":[5,11]},{"title":"Surprisingly good","rating":8,"date":"29 July 2019","review":"I was expecting the standard action hero garbage, and was watching this with pretty low expectations. This is way more mature, and even though there is a young kid and also a young girl in the movie, the story revolved around the adults, which was a nice change from the standard action movies. Although some of the characters really did not seem to serve much purpose, they were ok as background characters and made the main character more real. Older viewers would probably enjoy this movie more than teenagers, as it does deal with a rather complex situation that is not really seen in other superhero movies..","user":"SuperNewbee","rank":[2,3]},{"title":"Not worth the time","rating":2,"date":"26 July 2019","review":"I watched this movie not even knowing the plot. I thought it started off OK. I didn't mind the bad acting at first and it had a little bit of a Waiting vibe. Then it went down hill. The party scene killed all my interest in the rest of the movie, and yet I sat and watched as it never redeemed itself. The pace actually stalled at points and some of the conversations seemed like inside jokes that most people will not get. I want to give it a 3, but there was some animation/blue screen work that steer me more towards a 1 because it was so bad. So if you are looking at this thinking it might be a hidden gem like The Subjects or something slightly amusing like The Specials, keep looking. This is not the film for you. It is just a bad film with a very homemade feel to it.","user":"Micubano","rank":[2,4]}]