[{"title":"good? no, bad? no,... confusing.. yes","rating":6,"date":"1 September 2019","review":"This movie for a low budget one, seemed to utilize what little money they had exceptionally well. as far as spfx, lighting, cinema-photography, and the actors.\nthe story/movie.... well a bigger budget would have really helped for the movie itself. the story... yeah umm, its good but.... i had to struggle and draw my own conclusions several times as to what maybe happening. and i suspect i might be wrong about the writers ideas. like a prism, there seemed one thought going in with multiple tangents of where the heck should this go.\ni am a huge fan of apocalyptic/zombie/ we are all doomed type of movies, but this... i cant put my finger on it. its better than ok but not much above watching a movie while scrolling thru social media on your phone. sorta like this review.\nwould i watch it again, yes. should you watch it? yes, if you like these type of movies. because if your not into that genre, you will hate it.\ni couldnt give it less stars because i kinda liked it, i would have given more stars if i was positive about my assumption of the ending.","user":"meanolddrunk","rank":[14,27]},{"title":"Deserves a viewing!","rating":7,"date":"19 September 2019","review":"An interesting film... simple no, complicated, yes ! Great locations, large cast with an original soundtrack defying it's budget. Storyline is very different and unlike usual generic fair. IMO. this film, deserves watching by an audiences who appreciate something different.","user":"badgirl-48968","rank":[2,3]},{"title":"bad, just bad","rating":1,"date":"6 October 2019","review":"This isn't one of those B-Grades that's so bad it's good, this is just bad. I was literally falling asleep during it. Lots of walking/talking and weird camera scenes. I know what they were trying to do with the \"twist\" at the end, but by the end, I didn't care and the surprise ending was hardly a surprise.\nIn short, this movie is just bad, pick any other.","user":"jeffsmee","rank":[1,2]}]