[{"title":"It could have been so much more...","rating":5,"date":"9 June 2018","review":"I had not heard about this movie prior to getting the chance to sit down and watch it. And being a lifelong fan of horror movies, of course I took the time to sit down to watch it.<br><br>I will say that the acting in the movie was really good, and that was definitely what carried the movie most of the way.<br><br>The story, well, let's just say that it was mundane and generic, and something that has been used countless times before in the horror genre. So you shouldn't expect anything groundbreaking or innovative here.<br><br>The special effects in the movie were good, although there weren't used in an abundance.<br><br>This was more of a psychological take on the mother's mental state than it was an actual horror movie.<br><br>I had hoped for more focus on the Lammashtu, but that wasn't the case.<br><br>All in all, an average foray into the horror genre, but this is hardly a movie that I will watch a second time.","user":"paul_haakonsen","rank":[16,18]},{"title":"Not bad but falls apart towards the end","rating":5,"date":"11 February 2018","review":"A woman is having twins and the second one is still-born. When she gets home strange things begin happening and this turns into a quite a good horror film with subtle flavours of Paranormal Activity and The Grudge. So why then only a five star rating? It's the third act! Unfortunately, a few things happened which just made me shut off emotionally and shake my head in disbelief. <br><br>The first and second act I would give a six and the third act a three or four so I've given it an overall five stars.<br><br>I don't regret sitting through this and it has quite a lot to offer horror fans. The acting is good and it's pretty creepy all the way through so I would definitely recommend it - just remember it has five stars and not six or seven.","user":"michaelant555","rank":[26,34]},{"title":"Beware of the Lamashtu...And Beware of This Film!","rating":2,"date":"2 May 2018","review":"The Lamashtu was an invasive deity from ancient Mesopotamina who disrupted childbirth, stealing newborn children from their mothers. The goddess was the bloodsucker daughter of the Sky God Anu. Obviously, she needed a lot of company in the vast spaces of the sky, and she preferred her company to be young.<br><br>\"Still/Born\" approaches this mythological topic more from a clinical psychological perspective than as a mythical archetype. After Mary and Jack lose one of their babies, who is a stillborn, Mary comes to believe that her healthy baby Adam is also in danger of being gobbled up by the the voracious Lamashtu.<br><br>The main problem with the film is that it avoids examination of the mythical question and manipulates the viewer with the question of whether Mary is suffering from what the generic psychiatrist in the film calls \"postpartum psychosis,\" or the loss of the woman's ability to discern reality after childbirth.<br><br>The flimsy plot did not deliver many chills, and the lead character Mary was helpless and pathetic in confronting the challenge of Lamashtu. The reason why successful horror films like \"The Exorcist\" work is that characters put up a battle against the paranormal and unseen forces of evil. In the case of \"Still/Born,\" Mary is the quintessential victim.<br><br>Sadly, there were too many plot holes, such as the inexplicable escape of Mary from the psych ward and the puzzling ending that explains nothing about the true nature of Lamashtu. Overall, this was a direct-to-viewer film that added nothing new to the horror genre.","user":"lavatch","rank":[13,17]}]