[{"title":"Creepy premise tainted by stupid script, painful acting","rating":2,"date":"17 February 2019","review":"For me it was one of those horror films that when I'm not screaming at the characters about how stupid they are, I'm laughing at how poorly their lines are delivered. It's a creepy premise but even that quickly fades by the time the third act approaches. How many times have you seen a horror film where a character sees/experiences a traumatic supernatural event, and then when the chaos passes, they say nothing happened and go about business as usual? Strangled by a vengeful spirit? Her actual explanation: \"I must have just seen a rat.\" I mean even being assaulted by a human is enough to shake a woman so badly that she'd be visibly distraught for a while, but not this regular American girl, she handles it like a pro who has seen her share of mean stranglings. I'm sick of tropes like this and the old, \"let's split up\" or \"I'll be right back\" nonsense that was proven ineffective 20 years ago in satires like Scream. Somewhere buried in this garbage is an original idea, and it doesn't look like it was filmed on a cell phone, so for that I give it a 2.5/10.","user":"umimelectric","rank":[47,56]},{"title":"Meh....","rating":2,"date":"1 March 2019","review":"The Axiom started out as an okay B-Movie. The picture quality is very good. The acting is also pretty decent. BUT the comic-relief guy was too much and really annoying. Aside from that small detail, I initially thought this really would turn out to be a decent watch. The intrigue and mystery was well put together. But then everything suddenly turned really cheesy and bad when they finally got to the cabin in the forest. I actually thought the monster makeup was pretty good so that's not the problem. It's just the script altogether is just really, really bad. It seems like they didn't know where to go with their story. It turned into boring nonsense and I stopped being invested in the movie. There is definitely something fishy going on with the ratings on the site. It's a pretty crappy movie with nice visuals, a 3 at best. By the time it ended I was down to a 2, however.","user":"coolphantom666","rank":[45,57]},{"title":"Interesting plot, but awful ending","rating":3,"date":"5 July 2019","review":"It was a little creepy alot of cheap scares, but what made me dislike this movie so much was the ending. Nobody survives. I saved you two awful hours of terrible acting and lame ending. The sister just slits her throat out of nowhere because she thought she was dead when really the main girl made it out easy it's hilarious and dumb. I do not recommend this movie if you see it on prime video skip it,","user":"evoapollo","rank":[12,13]}]