[{"title":"Rubbish","rating":2,"date":"2 June 2018","review":"Please don't waste your time with this rubbish one of the worst films i've ever seen.","user":"sandrabetty-72592","rank":[15,18]},{"title":"WHAT THE...","rating":1,"date":"20 August 2018","review":"The artwork for this film made me interested. I mean here we have a picture of not just famed boxing legend Mike Tyson to look at but action star Steven Segal as well. A movie with the pair in it? Potentially facing off against one another? Sign me up!\n \nThe movie arrives, I pop it in the machine and low and behold within the first 20 minutes or so the clash takes place. And...that's about it. A few minutes of the two going at it mano a mano and then we're left with the rest of the movie to deal with. And it's bad. Really bad.<br><br>I went back after watching about half of the film and read some reviews others had posted elsewhere. Had I done so prior to starting the film I might never have watched it. Everything stated in those reviews ended up being dead on.<br><br>The film has an extremely convoluted plot going here. It takes place in some small African country in the middle of trying to figure out which cell phone company to handle the needs of that country. Yes, it's like a movie about ATT and Verizon battling it out with as much excitement as that brings to mind. At the same time Tyson is the last member of his tribe trying to take over the country. Segal is a bar owning dealer of weapons and warriors. Both have perhaps the least amount of screen time among the main cast members. <br><br>I could go into the different factions trying to this contract that comes down to a Chinese group and a French one but honestly their tech talk became so boring that I found myself just trying to stay awake and watch the movie. On top of that they use of subtitles for foreign films is nothing new to me and I normally have no problem with it. But in this case the dialogue was so fast and the subtitles so miniature that I had to literally sit a few feet from the screen just to read them. <br><br>On the plus side the film is very well shot and edited. Kudos to those involved on that end. And the promised though short lived fight between Tyson and Segal was fun to watch if over the top. Punching through pillars, kicking tables in half and nearly missing one another throughout the fight was outrageous fun. But other than that the movie fell flat. <br><br>I honestly can't recommend this movie. I mean if it shows up on cable or if you have a service that shows it sure, watch it for that fight sequence. But then find something more interesting to do like clean out belly button lint.","user":"kirbylee70-599-526179","rank":[6,7]},{"title":"Only gave it one star cuz I didn't figure out how to give it non","rating":1,"date":"7 June 2018","review":"An hour of life that I will never get back\nOnly gave it one star cuz I didn't figure out how to give it non","user":"asiribander","rank":[18,27]}]