[{"title":"A Beautiful Profile of the Struggles of a Homeless Man","rating":9,"date":"16 March 2017","review":"I am Another You was extremely well-received at Austin's SXSW Film Festival. It is a daring attempt by a Chinese director to explore the nature of homelessness in America by spending time traveling and living on the street with a homeless young man named Dylan Olsen. She actually spends a few weeks living with Dylan on the streets which is an amazing act of artistic commitment. The film takes a really interesting and somewhat unexpected path to explore the trials and tribulations of homelessness. I want give away the story arc. I will say the film was really touching to me, because I Dylan reminds me of college friend who also ended up homeless for similar reasons. <br><br>Director Nanfu Wang has done a beautiful job of presenting the story of homelessness through microcosm of one man's story. Sadly, we have all learned to dehumanize the homeless just so that we don't start crying each time we see a human being sleeping in the dust on street. This film gives us a chance to gain a better understanding of why people live on the streets. Dylan can help us personify and comprehend a larger problem. I hope this film is gains distribution so that more people are able to share Dylan's story. Additionally, I hope the film is used in schools to educate young people about the experience of homelessness. The level of homelessness in this country is a disgrace and addressing that problem requires educating the public about the underlying issues like mental illness and addiction that are interconnected with homelessness.","user":"JustCuriosity","rank":[16,20]},{"title":"Well done, but ultimately deluded by the misperception of obvious mental illness","rating":6,"date":"29 June 2018","review":"I have a nephew that suffers from the same exact mental illness. Call it what you will. The filmmaker and most in this movie want to characterize Dylan's perception of the world as an elevated way of being, a higher plain of existence. The sad truth is that his logic (and those like him) is an endless loop of inconsistent prattling that never leads to any certain conclusions. Always on the edge of brilliance, but never really reaching an epiphany of any kind. He is very much schizophrenic. That's the plain, simple, painful truth of it all that many want to write off as misunderstood. My Nephew with the same issues, walks the earth, damaging relationships, spending time in jail, walking the earth, hearing voices, getting into arguments, suppressing voices with drugs and alcohol, etc, etc, etc. <br><br>Is that misunderstood genius? Trust me, it's not. Seeing it first hand and watching a wonderful boy grow into a delusional man is a sad and painful experience, but it is what it is. Untreated schizophrenia.","user":"tracephotostudio","rank":[15,19]},{"title":"Safer?","rating":8,"date":"8 September 2018","review":"I was taken by our female Chinese documentarian when she said she, \" felt safer sleeping on the streets of the U.S. than traveling in China ... making a film about Chinese human rights.\" She films a homeless young white adult male to view his life on the streets of Florida. To some degree we see his alcohol abuse as well as some other hidden personal issues (some from an authoritarian Utah LDS background; some from how he uses people). Fortunately a warm weather state, a young female Asian photographer, and our subject's use of his Northern European looks to garner attention makes their lifestyle &amp; filming sympathetically easier. The complexity of a person's state of mind makes analysis difficult, but from my experience his mindset is common amongst the homeless. Perhaps over hundreds of thousands of years of human social bonding evolution the outliers who could not adapt (perhaps for biological reasons) to put the restrictions &amp; obligations of \"we\" before the \"me\" were shunned, and found comfort in a more solitary existence/niche or w/others of a similar makeup","user":"westsideschl","rank":[7,9]}]