[{"title":"Like a lot of the 80s sci-fi flicks I really enjoyed as a kid.","rating":7,"date":"31 August 2018","review":"'KIN': Three and a Half Stars (Out of Five)<br><br>A sci-fi action flick about an adopted teenage boy and his recently paroled brother who go on the run from violent vengeful criminals, as well as the law and aliens, with a secret otherworldly weapon. It was directed by debut feature filmmakers Jonathan and Josh Baker, and it was written by Daniel Casey (based on a short film by the Bakers). The movie stars newcomer Myles Truitt, Jack Reynor, Zoe Kravitz, James Franco and Dennis Quaid. It's received mostly negative reviews from critics, but I mostly enjoyed it. It's definitely uneven, and not a great film by any means, but it is fun and involving. The performances are all good in it, and it reminds me of a lot of the 80s sci-fi flicks I really enjoyed as a kid. I had a good time watching it.","user":"Hellmant","rank":[118,151]},{"title":"I went with the second ;)","rating":8,"date":"16 September 2018","review":"Born in the 80s, I grew up with the classical must see Sci-fi (Metropolis, 2001, Blade Runner...). These past few years, I have been witnessing a lack of innovation in the genre. It's rare to see a fresh new idea such as Gattaca or more recently Arrival. \nThe bad reviews intrigued me. They were either really bad, or very good. As if something either disappointed or surprised. I went with the second. It's great to see that there are some folks out there who can still create something which will interact with your imagination. Kin reinforces the basic theory that the \"less is more\", especially for this genre. Using dark modes, focussing on the characters performances, being meticulous with the soundtrack. All the ingredients which you can't trade for better SFX, CGI. So if you are the \"kin\" of person who's been thirsty for something creative in this space, then go watch Kin.","user":"Zoreilol","rank":[95,124]},{"title":"The ending was incredible","rating":8,"date":"3 September 2018","review":"Truthfully, half of the movie I was bored. The characters were good, the story was \"eh\". However! The ending W-O-W, I couldn't keep my eyes away, it was unexpected and I couldn't believe it was ending. Now I cannot wait until the next one comes out. Sincerely, the ending changed my whole view about the movie. I want to know more!","user":"capiz2008","rank":[109,148]}]