[{"title":"Nicely Done","rating":7,"date":"15 December 2018","review":"I enjoyed this film about an amnesic soldier hell bent on revenge. It gets a 7 star rating from me mostly because the english translation was broken and it hindered my ability to understand all that was taking place. Even with that barrier, I still understood most of what was going on and I liked what I was seeing. One thing that really helped out was how beautiful some of the camera and CGI work was. I'm glad I checked it out.","user":"Foutainoflife","rank":[12,12]},{"title":"The truth","rating":10,"date":"9 January 2018","review":"Hi, i watched a lot of movies, but this is the first time i write a review. Im from Serbia, and that is not the reason i put 10/10 for this movie (bcs all Holiwod fans put bad marks on most of Russian movies), in the same day i watched Star Wars and after that this movie. That only increased the enjoyment of this movie, after wathcing that terrible movie. It has love, it has war, it has bravery, it has comedy, it has everything a lot of movies today doesnt, it does has some similarities with 300 spartans. But still, this movie rly deserves 10/10. or at least 9/10, watch Stalingrad, Russian movie too, all around Europe it got a lot of awards and first places only on imdb it has bad marks... Idk why this site hates Russian movies so much probably bcs Russians dont vote on this site, they have there own. Nvm still you should still look this movie, its a gem.","user":"DeusExMachina326","rank":[84,137]},{"title":"Incredible visuals, great story.","rating":7,"date":"10 July 2019","review":"Bloody hell, the visuals are stunning!! This Russian action adventure drama is beautifully filmed, with incredible visuals and photography, and an awesome score to accompany it.<br><br>I enjoyed the characters and the survival element of the film. Ilya Malakov did a fantastic job as Kolovrat, a young man who believes he is 13 again every time he wakes up - due to a head injury when he was just 13. All the characters were likable, and the actors were really good. I felt their pain, agony, joy, defeat and determination. This was wonderful!","user":"paulclaassen","rank":[7,8]}]