[{"title":"Give this one a miss","rating":1,"date":"8 August 2017","review":"This is one of those Lifetime movies you should give a miss. There have been some pretty good thrillers recently but this isn't one of them.<br><br>A dense mother marries this guy who has schmuck written all over his face. He seems to have a nice house and money but soon starts abusing the older daughter. Strangely after abuse she doesn't tell the right people including her mother and starts looking more glamorous! She then runs away - not to a friend or relative but straight into the arms of some dope dealing lowlifes.<br><br>Don't bother.","user":"phd_travel","rank":[4,4]},{"title":"So bad it's funny","rating":3,"date":"9 August 2017","review":"Very typical thriller not many surprises. Director wasn't able to create suspense. I understand that low budget has it's limits but we have seen many good or decent thrillers with low resources. Richard is so over the top villain it's comical. You must see it to believe it. Mother is clueless. Dialogue is so bad it's funny. Main character actor was better than expected. Little sister read her lines like a robot.","user":"mikehillxd","rank":[2,3]},{"title":"Television for women disproved again","rating":3,"date":"15 October 2017","review":"Within the first couple of minutes the Lifetime catchphrase is put to the test, as we first see why Pacific Blue was a hit with men in the late 90's: Paula Trickey. In this example at age 51 in her underwear and then a low cut dress. +2 Lifetime movie points.<br><br>Enter the standard Lifetime Movie cast of characters: The boyfriend is the Lifetime Psycho (LP). He proves this early on by being a jerk with some kids and then by being creepy with the oldest daughter. He also fills in as the Guy Perpetually in Need of a Shave (GPNS).<br><br>The oldest daughter Maggie is the Lifetime Heroine (LH). She is hit on by the LP/GPNS and then finds out her teen boyfriend is cheating on her and comes home drunk. She has a hugely funny scene about 16 minutes in when she hurls on the LP/GPNS' $200 shoes. +1 Lifetime movie point.<br><br>The LH has a younger sister and the general outline is the LP/GPNS is going to marry their mom Peg (Trickey). Since Trickey does not fit into one of my preexisting Lifetime character acronyms, I'll have to add one for her, a play on their catchphrase: Lifetime Eye Candy for Men, or LECM. She supports this acronym with nearly every outfit she wears.<br><br>The LH is in a new school and meets a nerd pool boy named Chip. The LP/GPNS continues to push the creep factor by eyeballing the LH, who appears to reciprocate. Cut to her home alone at the pool and an ample supply of booze. Following in mom's wardrobe choices, she spends a lot of time in a bikini top. We get some actual plot development here when the LH snoops in the LP/GPNS' bedroom and finds her mom's diary with a missing person flyer inside.<br><br>Turns out the LP/GPNS has a surveillance system and busts the LH. In keeping with his character, he does so while the LH is in the shower.<br><br>The LH is busted again at school for fighting (actually sticking up for Chip) and inappropriate apparel and gets a 3 day suspension. No surprise that it is more alone time for the LP/GPNS and the LH. He gets the LH drunk and then appears to roofie her drink. This once again proves my contention that a good LP has a great supply of pharma products. He takes some pictures of the LH and then appears to rape her. In a missing scene, the LH cut her wrist. We see her with a small knife and then with a bandage on her wrist.<br><br>The running away plot is advanced when we learn via a sizeable plot hole type of error that the LECM ran away when she was 16. This is an error since on the missing person flyer her year of birth was 1956 vs Trickey's actual 1966, which would have made her 44 when the LH was born, and even older when the younger daughter was born. The LH enlists Chip to help her run away. They grab some of little sister's cash and take some pictures that were on the LP/GPNS' computer. Chip puts her on a bus where she meets Chuck, who appears to be a loser. This is reinforced when Chuck takes her home and the girl living there asks if the LH is a cop. The LH fills in as mom for the druggie chick Crystal who leaves her kid with her. She meets CJ, who is likely a Lifetime Good Guy (LGG).<br><br>Little sis finds her cash is gone. The LP/GPNS spins a lie about the LH being a tease and a general bad girl. He gets a threatening text and finds out the LH took the photos from his computer. Being a good LP means not only drugs but guns as well, and he has one in his drawer.<br><br>The LH lands a job at a bar thanks to the LGG. The LP/GPNS tunes up Chip by tossing him in the pool and then threatening him at gunpoint. The LECM and younger sis find him and he spills about the photos. Chip and younger sis go to Lifetime PD and talk to a detective.<br><br>The LH gets a \"fake\" ID that is another funny point. She reads the name Shauna McLaughlin from it, but it says Evelyn T. Sample, who was born in 1974- which would make the LH 43 years old. A quick trip to Google showed what she had is the state's sample driver license. The prop department lifted it and used it here. +1 Lifetime movie point for low budget creativity.<br><br>Up to this point, we've had limited females in jeopardy and no epic chick fights, -1 Lifetime movie point. The final 15 may change that! No sooner typed that done, as a couple of gun thugs bust in, shoot Chuck, and threaten Crystal and the LH. After one of the gun thugs force Chuck to reveal where the guns are, he leaves with the gun thug. Enter a third gun thug, who ganks gun thug #2 (body count: 1) as well as the fake ID guy (body count: 2). He KO's the LH and we learn it is the LP/GPNS! The LECM meanwhile has figured out where the LH is. We next see the LH tied to a chair. The LP/GPNS gives Crystal and her kid a free pass and then threatens the LH with a bat. The LP/GPNS ganks Chuck and the remaining gun thug (body count: 4). He then threatens the LH at gunpoint. She is rescued by the LECM, who KO's the LP/GPNS with his bat.<br><br>In the sunny day ending, the LH is in the hospital, the Lifetime PD detective appreciates a big bust, and Chip and the LH are potential BF/GF material.<br><br>Lifetime movie score (higher is stupider): 6/10. Real movie score: 3/10.","user":"darkavenger77","rank":[1,1]}]