[{"title":"Lacklustre road movie","rating":4,"date":"18 May 2019","review":"I was really hoping for something special with this as it has the wonderfully weird Udo Kier in it and I like Dane Cook and there is even an appearance from old timer John Savage but the film has such terrible writing that it goes nowhere even with all that acting talent.<br><br>They should have carried the journey further to Mexico and made more effort with some exciting scenes down Mexico way but instead it goes nowhere and ends on a dusty road. The script is about as dusty and barren as the road they end up on. I also did not like the photography with its yellow tone and poor panning shots, it made the film feel cramped and a bit depressing.<br><br>The action is very poorly orchestrated and the character interaction between father and son seems overly forced and unbelievable. The story seems as if it has been written and then re-written and still not right so they just decided to go with it and cross their fingers.<br><br>Everything about the film just says meh!","user":"omendata","rank":[12,14]},{"title":"sad sad sad","rating":2,"date":"23 June 2019","review":"\"Is your face a joke?\"<br><br>Family movies are almost always a miss, but this one is an absolute disaster. The acting is terrible, and the story is so predictable it's not even funny. I can't think of one good thing to say about this grotesque excuse for a film. Gosh, there's not even a good character. Do yourself a favor and don't even consider this","user":"dan_pap","rank":[4,5]},{"title":"A HUGE Misfire","rating":3,"date":"18 June 2019","review":"After watching this movie, about a dying man trying to reconnect with a son he abandoned years before, all I can ask is \"why was this made ?\". Movies like this have been made before and better. Filled with improbabilities and stupidity there seemed to be holes in the story or maybe scenes missing. I wouldn't doubt that realizing they had a bomb on their hands, they went through and re-edited this into the jumbled mess it is. If this was suppose to be an endearing road trip between father and son, it wasn't. Dane Cook and Levi Miller seem to be trying their best, but the script and plot were failing them throughout and in the end I felt nothing except that I'd wasted my time watching this. If the trailer makes you want to see this, believe me, the trailer makes this look much more interesting then it actually is. To add to it, they skip around a bit in the story, making it, at times, confusing, and the make-up artist put so much bright red lipstick on Levi Miller it's distracting. Poorly made on every level and a must to avoid unless you are a fan of the 2 stars.","user":"hampersnow-28905","rank":[4,6]}]