[{"title":"Really Over The Top & Entertaining!","rating":10,"date":"30 November 2018","review":"I felt compelled to review this thriller. It's a concept similar to movies like Locke and All is Lost and Buried. About one man trapped in an impossible situation as he tries to wile his way out of it. Ron Thompson gives a solid performance as antihero Anthony Peterson trapped in a metal cargo container and being held for ransom by, I'm guessing, terrorists. I liked a lot of the supporting voice over actors as well. The insanity and dark comedy of the film at times reminded me of Hong Kong cinema. Certainly not a film for everyone yet if you dig one man movies you'll probably like this one!","user":"redsrabbitead-01345","rank":[59,68]},{"title":"Cool Thriller Film","rating":10,"date":"1 December 2018","review":"One of the better thrillers I've seen in a long time. The concept is fresh, the look of the film is stark and engaging, a very good storyline overall. I love the synthesizer soundtrack as well. Flawed? Sure. Yet all in all a good thriller that's worth seeing.","user":"dayt-67965","rank":[47,55]},{"title":"Over the top","rating":7,"date":"17 November 2018","review":"I watched this because I'm a huge fan of Ron Thompson's work as Tony and Pete in the magnificent, underrated Ralph Bakshi film American Pop. I'm not a fan of horror thrillers. So why am I giving it a high rating? Because I appreciate what the filmmakers did here. This is an independent film through and through. No big budget. No fancy locations. But they came up with an interesting premise: Crappy, wealthy guy Anthony Peterson is being held in a cargo container for ransom. All the action takes place in the cargo container. Peterson doesn't know where he is. The only link to the outside world is a cell phone that cannot be traced. Peterson has to call anyone he can think of to convince them to transfer money to his abductors and secure his release. The voice acting of the folks with whom our \"hero\" Peterson interacts was problematic for me at first, but then I leaned into it, as I realized it was intentionally exaggerated, and it contributed to the over-the-top ride. Add to that the creative use of space, wild camera angles, and a stellar score from Thorsten Quaeschning of Tangerine Dream, and you've got a solid horror thriller. If you're into horror thrillers, you'll dig this movie.","user":"tashikitten","rank":[66,81]}]