[{"title":"A full emotional experience","rating":8,"date":"21 November 2016","review":"One of the ways I know a film is good enough for me to find the best words to adorn it is the feel of it the morning after. A good film should be a full emotional experience that you would find it difficult to let go off. It should create a warm hold on our feelings because through the course of the film we have unknowingly become a member of a family. Last night, we lived a lifetime with Qiyue and Ansheng. <br><br>The story couldn't be more cloying and overly familiar. Stories like this come a dime in a dozen, but this one is buoyed by the sured hands of debut director Derek Tsang (the son of screen veteran Eric Tsang), an inspired adapted screenplay, crisp editing, superb cinematography, a great soundtrack, and an outstanding sense of place and time. However, all these are naught if it doesn't get the casting right and right it so marvellously did. In the course of Qiyue and Ansheng's story, it is difficult to see any other actresses play their roles. Zhou Dongyu and Ma Sichun are born to play the roles and all the other parts they had played prior to this are just rehearsals for this. These are career defining roles and from this moment onwards, whether who will win the Golden Horse Award doesn't matter, because their stars are going supernova. This film lives or dies at the hands of these two actresses and both of them made it soar higher than it would want to admit. <br><br>IMHO the key to the film's structure is not about their relationship but how it lulls us into feeling it is about a relationship between us and both the girls. Who wouldn't want to have a soul mate like how it is depicted, not wishy washy with quick superficial emotions, but heart-wrenchingly hurtful and yet forgivingly embracing.. Their character arcs are superbly rendered with an awesome twist that felt totally earned. For me, the experience plays more like a spiritual experience than like a movie, maybe because I love deep friendships like this that I know can't happen. <br><br>Feted with seven Golden Horse nominations, including nominations for both actresses, director, screenplay, make-up, song and editing, my money is on Zhou Dongyu for a heartfelt performance. Her dismissive laugh hides a soul in turmoil so beautifully. <br><br>My affection for good films usually grows with familiarity, as it does with music and literature. That's why I can watch a good film again and again and relive the same experience without any dilution in intensity. I have a feeling that Soul Mate has found itself in this category.<br><br>Edit: Both actresses were rewarded with the Best Actress award. This is such wonderful news. It will be so cruel if only one got it for what are both towering performances.","user":"ctowyi","rank":[25,28]},{"title":"One of the rare gem of Chinese cinema","rating":8,"date":"6 April 2018","review":"What I love most about this movie is the great length they took to depict the time period, the realness and livelihood of ordinary people living in China. There's no rich guy trying to woo the girl or a character who went from a loser to being the hero etc. It is just a story about the friendship of two girls growing up. But the way they have set up the plot is brilliantly captivating and fast paced, unlike most Chinese movie I've encounter. Not many movies have two women as leading characters. The ones that do come in mind are Thelma &amp; Louis (1991) and Bridesmates (2011).","user":"roxxr","rank":[9,12]},{"title":"Like Their Performances","rating":9,"date":"26 March 2018","review":"Good story, good performances. The ambivalence of spirits is completely shown. Director Peter Chan is really expert at demonstrating the inside figure of characters.","user":"s-34708","rank":[7,10]}]