[{"title":"A decent, if cliched, story crippled by poor directing","rating":16,"date":"16 August 2019","review":"I get the concept this film was going for but it's just too rough around the edges to be enjoyable. The two main actors actually did a reasonably good job, which is impressive considering what a poor foundation they were given to build on. The music was good in some areas too, however, the sound effects and CGI killed any real sense of immersion.<br><br>The writer/director should've pitched this concept to someone more capable of bringing it to life. He doesn't seem to know how to build dramatic tension or create empathy for the characters, both of which are rather necessary for a horror film. If I don't care about the characters and I'm not afraid for them, what's the point? And while there are a few interesting ideas present, they are heavily diluted by bland filler.<br><br>I'd only recommend watching this one if you're a massive sci-fi nerd, don't mind B-flicks, and have literally nothing else to do with your time.","user":"tommy_tt","rank":[21,26]},{"title":"X-Files Fans May Appreciate This","rating":6,"date":"19 August 2019","review":"For a no/low-budget flick, this was better than I was expecting. The basic premise is that \"Sara\" is an investigative reporter travelling out to the sticks (presumably, in the U.S., though this film was shot in Spain) to investigate unexplained phenomena. There she meets a ranger who warns her about bears in the area that have the habit of attacking humans. Of course, the bears are not the problem. Rather, the source of the mysteries is a semi-abandoned military installation where, it appears, some awful experiments had once taken place. While there are many of the expected clichés, there are some well-done scenes and the story, for the most part, holds together like an X-Files episode. My main complaint was the writing. Sara, played by Andrea Guasch, spends too much time in the last half as the damsel in distress. I thought that was a wasted opportunity, given the interesting (if familiar) role she ends up playing toward the end.","user":"captainpass","rank":[7,8]},{"title":"Always trying to find a gem...","rating":1,"date":"25 August 2019","review":"Always trying to find a gem...Watching most of the even low budget horrors,trying to find some hidden treasure,instead getting this pile of horseradish(((Don't make the same mistake...","user":"tchitouniaram","rank":[8,10]}]