[{"title":"Dogmatic one-sided","rating":1,"date":"3 September 2018","review":"The most biased documentary I have ever seen in my life. The black and white dogmatic biased way of researching and presenting the facts losing any kind of credibility for the few points that could make sense. Definetely in the top three worst documentaries I have seen and a complete waste of time.","user":"billbasdras","rank":[14,19]},{"title":"One Truly Great Film!","rating":10,"date":"15 October 2016","review":"This is amongst my favourite films of all times. It talks about three major areas, health, environment, and animal ethics and the leading cause which is animal agriculture and the solution which is to eat plant-based vegan - no animal products at all. It features many prominent people in the movement, doctors, activists, athletes, chefs, musicians and more. The narrator/filmmaker, Michal Siewierski talks about his own journey to plant-based eating and how it connected him not only to his own health, but to the health of the planet, and to other living beings. The cinematography, music, and editing is extremely professional and assembled very nicely. I highly recommend everyone watches this beautiful work of art. - Michael Lanfield, Author of The Interconnectedness of Life, The Journey, and The Lost Love","user":"bookings-710-597961","rank":[34,53]},{"title":"Vegan Propaganda","rating":1,"date":"29 October 2018","review":"I was excited to see another documentary about food on Netflix because the subject interests me. With an interesting trailer and introduction boasting about finding ''the truth'' about our food and finding the one and only, most healthy diet... I did not expect to have to turn this off after 15 minutes. I simply could not watch another subjective documentary about food (already sat through ''what the health'').\nAfter minutes it is already clear, for people like me who take interest in healthy food, that this movie is not about finding any truth but just making propaganda for the plant-based diet. Although I appreciate the idea behind the vegan diet, I hate this kind of movies presenting pseudo-scientific mis-information as ''the truth''. They only show one side of the coin, leading to the conclusion that probably the whole movie is a lie. I will have to be waiting for Netflix to present a more neutral, informative documentary about this topic.","user":"peercox","rank":[21,32]}]