[{"title":"This is what I pay Netflix 14 bucks a month for","rating":4,"date":"3 June 2019","review":"It's the best movie set in a frat house recorded on an iPhone 5 ever made.","user":"ArcherAdam","rank":[16,17]},{"title":"Don't Waste Your Time","rating":1,"date":"3 March 2019","review":"Horror moments don't really happen until the last 20 minutes of the movie. Most of the Movie is shots of the frat party and a few couples they want us to care about. Absolute trash of a movie. With the most anticlimactic ending. Just terrible.","user":"LiAmberNichole","rank":[16,18]},{"title":"A non-scary haunting","rating":1,"date":"13 November 2018","review":"Part of me was semi-intrigued, being someone who is no stranger to horror films (really appreciate the genre too, despite what some of my previous reviews have implied), and the idea interested me somewhat despite being ridiculous. A large part of me was apprehensive though, having heard it was not good and that it looked like one of those cheap and overdone films with a muddled tone.<br><br>Which, when watching it, was what 'Haunting on Fraternity Row' essentially was, cheap and overdone with nothing interesting or scary. It is not just not a good film, it's an intelligence insulting waste of time. If it was trying to entertain, scare or both, 'Haunting on Fraternity Row' failed abysmally on both counts, making the film a terrible chore to sit through. Am not hating or trying to be malicious, it is just my genuine stance on a film that didn't do anything for me as well as many others<br><br>From beginning to end the acting, from particularly the leads, is both overplayed and stiff. In all fairness they were hindered by hammy direction, constantly awkward and limp dialogue and that the film has no interesting or likeable character whatsoever.<br><br>Script is childish, flabby and even improvisatory-sounding. The story is not much of one and takes forever to get going, when it finally does it is not for long and it is too late to care. It also over-emphasises the stereotypical teenage drama too much, which is a big problems with the characters being so irritating and in some cases personality deprived.<br><br>Unfortunately, any attempts at levity are completely witless, childish and so overdone it gets exhausting. The horror elements are a long way from tense or suspenseful, generating little interest even, the lack of scary atmosphere due to being so predictable and cheap-looking makes this haunting a very bland one. The kills were not creative and would go as far to say they were too tame, while the things there to by the film's definition \"spice things up\" came over as gratuitous and abused.<br><br>'Haunting on Fraternity Row' is a cheap looking film that even makes the scenery look tacky. Especially the photography, am too convinced that the film was made on a cheaper budget than has been cited here. The sound is obvious and intrusive.<br><br>Overall, terrible. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[17,22]}]