[{"title":"A fine, fascinating and often tragic look at the previously uncredited co-creator of Batman","rating":7,"date":"6 May 2017","review":"Bill Finger has recently been given his due credit for his part in the creation of America's most popular superhero, Batman. It is incredibly unfortunate that this took as long as it did, many years after his death, but it has finally happened and this documentary makes that fact all the more satisfying.<br><br>This film largely focuses on the efforts of one man as he has spent much of his life trying to get Finger's name next to Bob Kane's on comics and movies and whatnot, which is where it belongs. What I think many will appreciate is that this film sticks to facts and doesn't work to demonize Kane any more than the facts of the matter do themselves. It will be awfully difficult for anyone to come away without a negative opinion of the man who's name has been associated with Batman since his inception, but this film and the man behind this crusade would much rather you came away with an appreciation for the man who died having never been given credit for the great amount of input he had in the creation of the Dark Knight and the world he lived in.<br><br>The film is often tragic, which is befitting given the man's life, but it gives the viewer a great amount of hope as well and a reason to cheer by its conclusion. It also gives you a great appreciation for the man who worked so hard to make sure Bill Finger got the credit he deserved and it will make you believe in the power of the unknown voice who can come from nowhere and make a difference. <br><br>Any and all fans of Batman should watch this film. As the movie shows, it's important to know who deserves credit for the things we love so we can better appreciate their contributions, and here we see that there are quite a few people worth praising.","user":"dgroberts27","rank":[22,25]},{"title":"Watch it!","rating":10,"date":"9 May 2017","review":"If you are a Batman fan, this is the best 90 minutes you can spend learning about the history of the Caped Crusader. This is great story telling straight from the heart. The doc contains all kinds of trivia and history you never knew before. From the creation of the Batman character to the most recent movie, you'll find out things you never knew before.","user":"cbaw1957","rank":[24,28]},{"title":"Righting A Wrong Of Batman/Comic History","rating":10,"date":"30 May 2017","review":"One of my pet peeves when it comes to entertainment is when the creators of iconic material are not given sufficient (or any) credit—financial or otherwise—for their iconic creations. The example of this I always give is all Three Stooges dying basically penniless while their shorts will be played forever and make many other people much money. I realize that there is a legal side to all of this (sometimes creators \"sell off\" early in hopes of a quick buck only to see \"their\" property zoom in popularity), but I always have a soft spot for stories of \"creators vs. studios\" and the like. That is why I can give \"Batman &amp; Bill\" the full 10 stars here and consider it one of the most incredible documentaries I have ever watched, as it unearths a truly hidden story from the annals of history and restores creative credit where it is due.<br><br>Basically, \"Batman &amp; Bill\" tells the story of how author/comic fan Marc Tyler Nobleman started a research project into the origins of the Batman character. Initially he had no idea what he would find, but very quickly he stumbled upon a bit of an investigative gold mine: Though Bob Kane was given basically 100% of the credit for creating Batman back in the late 1930s, in actuality a man named Bill Finger was involved in a great deal of the process as well (likely coming up with the iconic cowl/cape/symbol costume design and a number of the original villains). Nobleman sifts through old articles, recordings, and personal recollections to reconstruct the story of Finger, of which barely any was publicly known. In order to take his research to the \"next step\" of actual getting Finger credited for Batman's creation, Marc must find an heirwhich he (rather improbably) does, at which point the story morphs into an emotional tale of a family still grieving a death from many, many years ago.<br><br>I think the reason that \"Batman &amp; Bill\" works so well is because it turns into a great story on two levels: First, Finger's influence on the Batman character is utterly fascinating, as well as the belligerence (and sometimes out and out negligence) of Kane, DC, &amp; Warner Bros. in keeping Finger's name off the Batman credits. Nobleman stays very fair and balanced throughout this entire investigative portion, fortunately, as the whole thing easily could come off as a ranting attack on \"big boys\" Kane/DC/WB. That isn't nearly the case here, however, as Nobleman backs up any claims on Kane's behavior with documented evidence to support him. The bottom line is that research and accounts show that Finger's name should be on the screen or page with Kane's when it comes to the \"created by\" credit, and it is amazing to think that this has been \"hidden\" (or at least not unearthed) for 75-odd years.<br><br>Perhaps just as important, though, is how the story turns out to be a very emotional one once Nobleman starts unearthing people who personally knew Finger or members of the Finger family. Finger himself was bisexual and died from AIDS, both of which were much more taboo in the era they occurred (1980s) and thus hidden or swept under the rug. What Nobleman finds, then, is a family yearning to have some closure on the life of their father/husband/grandfather. At times there were tears welling up in my eyes, as Nobleman really was doing this family a great service in painting a picture of Bill Finger's life.<br><br>Anyone who is a fan of Batman (in any iteration) or pop culture documentaries in general absolutely needs to see \"Batman &amp; Bill\". In terms of investigative work and righting some of the wrongs of history, the documentary is a shining example of how that is done. For those who might say \"who caresthis happened 70-some years ago\", all they must do is look at the impact this information has on the Finger heirs, and the \"who cares\" question is answered in emotional fashion. All told, easily one of the best documentaries I have seen in a long, long time.","user":"zkonedog","rank":[14,17]}]