[{"title":"Surprisingly Good","rating":8,"date":"5 March 2018","review":"I missed this movie when it first came out. I never was a Debbie Gibson fan. And I agree with several of the things the other reviewer said. Plus I really don't think Debbie Gibson is all that pretty (Pascele Hutton is very pretty), she is not a great singer or actor. But she was perfect for this part. I agree that the good story was the renewed friendship between the sisters, but the love story was pretty good too. I also disagree that it is unrealistic that Debbie can develop into a good teacher in one day. No matter what the politicians say, good teachers are born, not created in a college. My wife and daughter were born to teach. I found out I was not, though I had a master's degree in the subject. When I did finally find my calling, I inspected schools. We had a governor who actually said, \"anyone can teach\". I saw many people come out of industry and the military who could not. A few could. So to me, the real story was her love for her students and how she found her true calling, to teach.","user":"beachy-38431","rank":[8,8]},{"title":"For V & V's only","rating":2,"date":"12 November 2019","review":"The first V is for \"V\"egetarians only. Why? Because this made for TV movie is oh so CORNY.<br><br>The second V is for you over the hill, past your prime time \"V\"ain people who can't help yourselves and just want to live in your past.<br><br>Debbis Gibson, singer, songwriter/actress agreed to this vanity project because it allowed her to re-live some of her past stardom, but she is not relevant today, nor are her songs.<br><br>This made for TV film high school redemption of a former teen singing star is \"ALL ABOUT DEBBIE GIBSON\" and I gave it a 2/10 just so some people who watch it and want to live their own dream may feel there is at least a sliver of a chance of living your own dream.","user":"Ed-Shullivan","rank":[2,2]},{"title":"Disappointing","rating":4,"date":"7 September 2016","review":"As a Debbie Gibson fan of my youth I actually looked forward to this movie. This movie was a let down especially because of the fact it had the potential to be a lot better. Hallmark in the last few years have mandated the rom-com format for all its movies instead of letting them go where they go.<br><br>In this moview the romance seemed very forced and the movie wasted its time focusing on that. It could have been a nice C plot to tie up at the very end. However, as they key plot of the moview it did not work. The most interesting relationship in this movie was between the sisters. One became a pop star and the other moved away to be a teacher and really was not proud of her. Also, it could have focused on her career plummet a litte more at the beginning. Finally, while her becoming a teacher is a nice plot device her becoming an effective educator and embracing that role probably would not have occurred between the 1st and 2nd day.<br><br>In summary while not awful it was very disappointing because it good have been really good.","user":"jonathanrspalding","rank":[7,16]}]