[{"title":"A strange fairytale about growing up","rating":6,"date":"13 April 2019","review":"I wasn't quite sure how to categorize this film while watching it. As most fairytales go, there are some dark elements. There are hopeful themes, too. Overall this is different enough to be interesting and I found the cinematography in various scenes to be very enchanting.","user":"labng","rank":[5,5]},{"title":"Germany's version of 2003's 'Thirteen'...with a fish tail.","rating":9,"date":"3 March 2019","review":"The movie plays out like the 2003 film 'Thirteen', where we see a young girl called Mia, spiraling out of control into a world of sex, drugs and alcohol. At the same time her body starts going through unusual changes as she starts to question who she is and where she comes from...<br><br>You really feel for Mia on an emotional level, which I loved 💙. You experience the confusion and pain she goes through.<br><br>The film is more of a drama, with a splash of fantasy. It doesn't reveal much which I didn't mind as it leaves you thinking.<br><br>Tragic and slightly intense but also very beautiful, I highly recommend this film.","user":"tweezygum","rank":[17,23]},{"title":"Good but one flawed shot","rating":7,"date":"3 December 2018","review":"I think, the movie tried to explore the themes: \"being yourselves\" or \"embracing yourselves with all your oddities\" or \"finding how special you are\".<br><br>It is an interesting film, but leaves you confused at the end; all because one shot, I think, has gone wrong. The point is, the movie follows a grounded-realistic approach (not a surreal one). So, you expect the movie to give you enough information to build a believable world in which the story takes place. The problem is not with the believability, but with the incomplete information. So, at the end, you are left feeling that there is something missing.<br><br>This could have been fixed with the very first shot of the movie, in which it could have shown a new born lying on the beach crying, with no traces of any human around her. This would have raised the question, \"who left her there?\" or \"where did she come from?\". As these questions were quite satisfactorily answered in the movie, you would've felt that everything fell in place (including the theme). The parents' characters need a little development though.","user":"misternintythree","rank":[17,25]}]