[{"title":"Tension is maintained, the ominous music helps but the suspense is zero n the ending rushed n a big meh.","rating":5,"date":"25 February 2019","review":"Had read very bad reviews bah it n even the ratings weren't convincing but I had hope in Bousman.\nThe plot - A pregnant con woman seeks asylum in an isolated convent run by a bunch of outcast nuns. The woman's backstory is told through flashbacks.\nIt doesn't take much longer to reveal to us that the nuns r short of cash, their donors r limited, they r very extreme in their torture methods but somehow they do have a doctor always ready.\nThe set up is 50's n therefore one shouldn't question the plausibility.\nBut what really bugs me is the rushed up ending.\nAlthough ther is decent tension maintained n the ominous music helps but the suspense is zero n the ending meh.\nCarolyn Hennesy as Mother Superior is top notch.","user":"Fella_shibby","rank":[41,53]},{"title":"Weak & Dull, with a Few Decent Moments","rating":4,"date":"10 February 2019","review":"Darren Lynn Bousman has had some rough years as a director, yet his previous works, in my opinion, stand higher than this one.<br><br>\"St. Agatha\", as a horror, offers nothing new, original, amazing, extraordinary or even good. The writers responsible for the story and characters definitely do not deserve nor applause nor a subtle nod, maybe a little shaming. The story's fairly straight-forward, never builds up to anything unexpected, the suggested supernatural angle of the plot is not explored or explained much at all. The protagonist characters are traditionally dumb, the antagonist characters are sort of over-written, even annoying at some points. However, the acting did not bother me, given the variety of weakly written characters, the level of acting in \"St. Agatha\" is rather impressive.<br><br>Cinematography is decent, noticeably low-budget, but good enough to not annoy the eye of the viewer. There are a few decent, scattered scenes of violence &amp; abuse - the short, more action-ey parts of the movie are at least average. All is accompanied by a soundtrack that's mostly noticeable only when the ominous, creepy choir voices join in. The pacing is pretty draggy, there's more lows than highs. If you don't have a strong principle of finishing whatever You've started watching, as I do, prepare for the risk of poor Agatha putting You to sleep.<br><br>\"St. Agatha\" is a painfully average, if not below, indie horror flick. Disappointing. My rating: 4/10.","user":"TwistedContent","rank":[41,53]},{"title":"Cruelty, not Horror","rating":6,"date":"12 March 2019","review":"In 1957, the teenager Mary (Sabrina Kern) feels guilty for the accidental death of her young brother drowned in a bathtub. She decides to leave her alcoholic father to live with her boyfriend Jimmy (Justin Miles). They become con artists, but one day one of their victims discovers the scheme and take all their money. Pregnant and left without any means of survival, Mary decides to leave Jimmy, who is a musician, and move to an isolated convent to deliver the baby. She is welcomed by the Mother Superior (Carolyn Hennesy), but soon Mary learns that there is a scheme in the convent to take the babies from the pregnant women.<br><br>\"St. Agatha\" is a film labeled with the horror genre, but there is basically cruelty and not horror. However, it is not a bad movie, but the viewer needs to have the stomach for watching the cruelties that Mary is submitted in the convent by the nuns. My vote is six.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[36,46]}]