[{"title":"Real history twisted","rating":7,"date":"18 August 2018","review":"Even though I am the fan of Akshay,they should mention about legend Dyan chand.who played finals even throw had fever.and potryed Hitler as hated Indian team ,in reality he appreciated the team and offer Dhyan Chand a major post.cinema may be for entertainment purpose but it feed subconscious mind so bolly hood take care of these.","user":"jithendrajas","rank":[14,16]},{"title":"Great movie for Independence day","rating":8,"date":"15 August 2018","review":"If want to see something on this Independence Day then Gold is the perfect film for that. There is no greater pride in sport than to see your country's flag being hoisted in international stage. Starting of the movie is bit slow but it will become interesting in later half. In one word your sentiment for the country will be amplified for sure. Acting of Akshay Kumar is awesome. He justified the charecter Tapan Das. But some of the historical fact is changed to dramatize the film. The journey of Indian hockey team to London Olympic 1948 is different than in the film. Mouni Roy did a good job in her charecter. You will feel thrill at the end of the film. Critics reviews for this film is bad but I personally thinks its a good movie with patrism in it.","user":"arindambiswas-79930","rank":[45,60]},{"title":"1/10. A story more precious than gold turned into a snafu.","rating":1,"date":"1 January 2019","review":"When one have a story more precious than gold, then one needs to make sure that it's not always about making money.\nBy taking an actor like Akshay, whose slapstick comedy films r simply making money, then it shows that the producers were jus greedy to cash in on the success of the star value.\nRather than paying attention on the screenplay n direction, it all became melodramatic with Akshay's repeated overacting.\nAll the other good actors were sidelined.\nUnnecessary romantic story, with unnecessary songs.\nI was wondering did I pay to c the biopic on the historical win or a coach's story fabricated with too much melodrama n overacting.","user":"Fella_shibby","rank":[22,28]}]