[{"title":"A female empowerment flick that gets farfetched and very cheesy.","rating":4,"date":"5 July 2019","review":"'SKIN IN THE GAME' 4/10🌠🌠🌠🌠 = REGRET\nLet me atleadt say I give this film some kudos for attempting to approach the topic of prostitution and sex trafficking sort of in a different way. But that doesn't excuse the fact of it being pretty far fetched. Especially since this film was based on true events. Too many characters were way over the top whether acting extra cool and overly courageous like one of the lead characters named Lena played by Erica Ash or the beautiful hardcore female pimp Eve played by Angelica Celaya. Of course movies embellish for dramatical purposes but in this case it comes off feeling kinda corny. Not as bad as a lifetime flick but not that much better.<br><br>The dialogue also didn't help the many scenes that came across cheesy. None of the acting was superb but actress Elisabeth Harnois who plays the mom did a horrendous job, very inconsistent from one minute to the next and she was not convincing for a woman who's teenage daughter was recently kidnapped.<br><br>Is this movie watchable yes but it doesn't have a lot of entertainment value. Some audiences will get something out of it but I wouldn't recommend this movie.\nMy rating is a 4 equaling Regret.","user":"tkaine3","rank":[8,8]},{"title":"Do yourself a favor, Don't watch this garbage.","rating":1,"date":"12 July 2019","review":"Terrible acting. High score rating is obviously from friends of the cast and crew. Absolute rubbish try another career honestly because this isn't for you.\nOne of the worst movies I have seen in a long time. I won't waste many words on this review, as the poor production, camerawork, sound, and acting in this film does not warrant it.","user":"psxexperten","rank":[9,11]},{"title":"Covering the 2020 Bases","rating":1,"date":"22 March 2020","review":"Wow. Bad. Boring crap that isnt even interesting to watch. Plus it's nothing more than a virtue signaling movie with producers coming up with a limited budget to fulfill their minority quota for the year.\nIt's insulting and filled with untalented people who should not be making movies.","user":"arfdawg-1","rank":[2,2]}]