[{"title":"Portrait of emotionally disturbed teenager egged on by Improvisational acting class instructor proves pretentious and unfocused","rating":3,"date":"9 December 2018","review":"If you're into indie \"art\" pictures, then maybe Madeline's Madeline is for you. It's one of those Sundance creations that actually garnered a very respectable critics' rating of 76 on Metacritic. For someone like me who usually likes solid historical fare, \"Madeline\" simply features material in which I have little to no interest.<br><br>\nIt's a bit difficult to describe. In a nutshell, the protagonist (I'm sure you can come close to guessing this) is a 16 year old named Madeline who has emotional problems. One might surmise that she is bipolar but I'm not exactly sure of the diagnosis. She is played by newcomer Helena Howard. I had assumed that Howard was actually playing herself until I saw an interview promoting the picture on Youtube. Indeed her Madeline is strictly fictional so I suppose you can say she does a pretty good job in depicting someone who's emotionally disturbed. Nonetheless, Josephine Decker, the writer and director ensures that Madeline is an insufferable one-note character.<br><br>\nWhat the plot boils down to is this: Madeline is in constant conflict with her mother Regina (Miranda July) who has placed her in an improvisational acting class run by Evangeline (Molly Parker), who sort of becomes obsessed with the teenager and encourages her to \"act out\"; as a result, the acting piece she's been developing is scrapped for a new one starring Madeline, illustrating her life and relationships.<br><br>\nThe other students in the class become resentful, including Madeline, who gets back at Evangeline by attempting to seduce her husband at a party she throws at the teacher's apartment. Evangeline's obsession with Madeline is illustrated to the extreme when their images merge, both fantasizing about burning Regina's face with a hot iron.<br><br>\nIs supposed it to be a character study about a pretentious, authoritarian instructor who is so narcissistic that she is unable to see that she's not helping her emotionally disturbed charge at all and possibly making her worse? Simi Horwitz, writing in the Film Journal International, asks, \"Nobody asks-even thinks to ask-Evangeline what she's talking about (or what purpose it serves) when she instructs her students to 'act out metaphors' as they shape-shift into sea turtles or cats. 'Don't be a cat,' she prods Madeline. 'Be in the cat.'<br><br>\nMadeline's Madeline culminates in a bizarre street dance by the class which I am still trying to figure out what exactly is the point of the film's climax. Again, if you like weird indie \"art films,\" this could be for you. A mainstream audience (as well as the more critical, including myself) will find little of interest here.","user":"Turfseer","rank":[25,34]},{"title":"One-Line Review: Madeline's Madeline (3 Stars)","rating":3,"date":"8 November 2018","review":"It is easier to bear, and perhaps even cure, the passive-aggressiveness of two of the central characters (induced by mental illness and its exploitation) in Joesphine Decker's drama Madeline's Madeline than it is to complete watching it. Gosh, the exasperating background score made of vocal percussion just forces me to use another line here. TN.","user":"nairtejas","rank":[18,25]},{"title":"Wow","rating":1,"date":"18 March 2019","review":"Think of the worst piece of crap you have ever seen...now take it down a notch. If I saw this in the movies I'd ask for my money back.","user":"felipexmc","rank":[4,4]}]