[{"title":"Creepy and effective, if somewhat a bit lacking","rating":6,"date":"18 February 2019","review":"Movies involving evil or mean children often manage to creep us out the most for some reason. The Hole in the Ground is no exception. It's a small Irish production with only a few characters, but it manages to pull off a very chilling atmosphere of dread, after a mother and her son moves into their new house in a deserted area on the edge of a large dense forest. The movie really manages to make you feel their sense of loneliness as the mother stumbles upon a mysterious huge hole in the middle of the forest behind their house. Her boy begins to acts strange after he runs away one night in the forest, and she starts questioning his identity and also, her sanity. The actress playing the mother is very good at displaying her mixed emotions and the boy really conveys a feeling of unpleasantness. This coupled with the creepy atmosphere really pulls you in. It's more of a drama-psychological horror and not everyone will appreciate the slow and subtle tone of the movie, but if you enjoyed smart horror like Under the Shadow and Goodnight Mommy, then I think you will like this. It's not quite as good and it unfortunately lacks a little bit of explanation at the end, but sometimes I think it's okay for movie to leave a bit up to the viewers to figure out by themselves. I just wish it ran maybe 10 minutes longer to better develop the events leading to the conclusion.","user":"KawaiiKiwi","rank":[47,54]},{"title":"Very subtle glimpse into mental illness","rating":5,"date":"3 March 2019","review":"On the surface this film comes across as another semi-grade horror flick without merit. The characters are under-developed and the large number of loose ends that are never explained enforces the view that the director/screen writer couldn't be bothered to fill in the gaps.<br><br>What is interesting is that this seems to be intentional. There is a very well hidden parallel story that runs alongside the one which is presented to viewers. We see the story from the perspective of the protagonist Sarah O'Neill, who isolates herself and her son in a remote house near the woods. Her delusions gradually increase as the film progresses, and the viewer is dragged in to her fantasy world when there is no external context to help separate fact from illusion. The director plays upon uncertainty to construct the supernatural thread. However he also provides subtle hints that what you sometimes see are hallucinations (eg: the arm-wrestling scene).<br><br>Capgras delusion is the real focus of this film. Capgras is the condition in which a person holds the delusional belief that a close family member has been replaced by an imposter. The condition can be caused by trauma to the head (note the many references to Sarah's unexplained scar) and can also accompany other psychological conditions such as schizophrenia and psychosis. The final part of the film is clearly a psychotic event experienced by Sarah.<br><br>The use of mirrors within the film is another nod to Capgras. The film eludes to the fact that mirrors unmask the true nature of the person. Capgras sufferers can sometimes doubt their own identity after seeing themselves within a large mirror, although smaller mirrors may not produce the same effect. One type of therapy involves using many mirrors of different sizes to help the sufferer overcome the delusion.","user":"London456","rank":[131,162]},{"title":"Folk tales called them Changelings","rating":6,"date":"16 March 2019","review":"A movie about changelings. Finally a horror movie about Faeries. Faeries lore is scary as hell. The young actor is brilliant. Very talented. It's more tense than jumpy. Plenty of unnerving moments though, well worth a watch. Great cinematography and atmospheric music. The kind of story that could happen in any country. if the faeries replace your child with an imposter, you just beat the imposter until your sweet well behaved real child returns.","user":"MajidMsa","rank":[31,38]}]