[{"title":"Good Enough","rating":6,"date":"1 March 2019","review":"If you like teacher-student relationships, then this movie won't disappoint you. Though, the story lacked some intensity. At least, the ending was nice and it concluded the story beautifully. I also liked that the teacher was hidding his feelings until the last scene of the movie. Therefore, the movie ended up being more realistic. Although, the love story needed some work. Finally, the performances were really good and I also enjoyed the side characters, who were cute. So, six and a half out of ten, because the movie was just okay and didn't offer anything original.","user":"pennyelenabooks","rank":[6,7]},{"title":"This movie is all about Ikuta Toma's incredible acting","rating":9,"date":"9 September 2018","review":"This movie is all about Ikuta Toma's incredible acting. He even manage to portray such a controversial character and make it somehow worth it! That's surely something right!<br><br>There are lots of unnecessary scenes with the teens which were undeniably annoying and very poorly portrayed. But the main lead actor, Ikuta toma, nailed it. There were things in between lines. Like Mr. Ito's facial expression. In one time, he was lying but there was deep sadness in his face. Also, he did something which he normally won't do. As for relationship, he maintains a wall where suitors never got a space to enter yet that wall never really existed for Shimada! It was his acting that make it all sense. Even the guy friend of Shimada sensed that the love was mutual in their case. Here, Mr. Ito was workaholic, non-sociable and had some sort of complex in terms of relationship. But his heart melted by Shimada's innocence and he was grateful towards her, also apologetic for not being able to accept her or hurting her. That's why, that controversial relationship never felt wrong! And I'm not exaggerating anything. Mr Ito expressed everything in this tiny movie with his so little screen time and few dialogues! What I'm saying is I am totally knocked down by Ikuta Toma's acting. But the rest is pretty much slow and boring.","user":"pokatuki","rank":[6,7]},{"title":"Interesting premise, and good acting make this a good watch (Full spoilers)","rating":8,"date":"23 May 2018","review":"This movie is about high school teenagers who become attracted to their teachers. It centers on one high school girl who falls in love with her history teacher. The story gets deeper and it deals with topic such as love, teenage confusion, and societal views on what is right and wrong.<br><br>The actors and actresses are good in this movie, with the two main characters having great chemistry together. The story moves at a good pace and you never feel bored watching it. The three friends feel like real friends and react the same way most friends do.<br><br>(Main story plot points)\n~ The movie starts off with the main girl, Hibiki, entering high school and immediately becomes attracted to her history teacher. She happens to have two friends, a boy and a girl, who are also attracted to other teachers (seriously).\n~One day Hibiki goes to retreat a love letter that her friend mistakenly sent to a wrong teacher. The teacher who receives the letter happens to be Ito, the same teacher that Hibiki is attracted to. She becomes even more fascinated with him after seeing his dark sense of humor.\n~One day Hibiki sees Mr.Ito sleeping outside and drops a book on him, telling him that he still be late for class. He sees her in the hall and tells her she could have killed him if the book would have hit his head, but he thanks her for waking him up. Hibiki develops more feelings for Mr.Ito.\n~One day in class Hibiki is caught talking with her friend in class and forced to stay behind and do a test as punishment by her home room teacher. Mr.Ito comes into the classroom to shut the lights and realizes that Hibiki is there. He tells her that her homeroom teacher has left already and she can leave. She tells him she needs to finish the test, which Mr.Ito helps her.\n~He drives her home and he buys her a drink. Hibiki realizes that she is now in love with Mr.Ito.\n~One day after stumbling into a secret conversation involving Mr.Ito and another teacher, and hearing Mr.Ito's rejection of his co-workers relationship request, Hibiki goes into Mr.Ito's office and confesses her love for him. He tells her that she is just thinking foolish thoughts because she is still a young lady. She tells Mr.Ito that she will get 90% or more on her next history exam, and when she does, it will mean that she will continue to love Mr.Ito.\n~Mr.Ito and Hibiki spend more time together, mostly just giving her a ride home and talking to her about school. Hibiki hears from the teacher who got rejected by Mr.Ito that he is a good \"liar\" and can fake his emotions. This makes Hibiki sad as she thought he really cared for her. The teacher obviously did this due to being angry at being rejected by Mr.Ito.\n~Hibiki becomes distraught and goes to karaoke with some classmates and boys. She immediately feels uncomfortable when one of the guys tries to hit on her, and she leaves. Outside some Japanese men tell her that she should go home or else she will get in trouble by her teachers. She then breaks down and tells them that she loves her teacher. It starts raining and the two men leave her alone and walk away. Mr.Ito, being told by Hibiki's friend that she will be there\" walks up behind her and holds an umbrella. He takes her home.\n~Eventually the school has an event where they choose a girl to be dressed as a bride. Hibiki is chosen and on the day she happens to find Mr.Ito relaxing on the top floor of the school. He asks her why she is dressed up as a bride, at which she then tells him how much she loves him and talks about spending her life with him. Hibiki gets up to leave and right before she does, he hold her and kisses her.\n~My.Ito is fired due to a student seeing them and he prepares to leave. Hibiki meets up with him after being told by her friends that what she is feeling is not just \"high school feelings\" but that she really is in love with him and that there is no law stating that you cannot love a particular person. Hibiki's friend also tell her that she listened in on Mr.Ito's meeting with the school board and that Mr.Ito also is fond of Hibiki. He doesn't want her high school life to be ruined so he agreed to leave.\n~Hibiki finds him and after talking, Mr.Ito finally reveals his feelings and tell Hibiki that if she waits for him, he will wait for her after she graduates.\n~In the end she graduates and meets up with Mr.Ito.<br><br><br><br><br><br>The only issue with this movie I think is that the ending is a little bit \"too perfect.\" Everything just seems to work out in the end for everybody. Another issue is that they don't really explain why the main girl is so in love with her history teacher. He is a good looking guy, but it should be more than just that. She talks about the size of his hands and stuff, but it is all physical appearance that seems to draw her into him. He does bring up the fact that she is still a high school student and not totally understanding of her true feelings. He tries to tell her that she will eventually realized what she is feeling was just a \"high school moment,\" but then later on in the films he is also in love with her.","user":"RaidersOfTheLostCommunist","rank":[2,3]}]