[{"title":"I get it.","rating":8,"date":"24 January 2019","review":"I get why the numerous nominations and I get why some people were disappointed by the lack of storytelling.<br><br>First things first - the cinematography is stellar and poetic. You could pause the movie every 5 seconds and get a stunning photograph. The long takes simply got me.<br><br>Secondly - yes, there is no epic story here. And you know what? That's exactly how things are in life. This is what this movie is all about - the silent drama of the boring lives we, normal people, go through as we sit on time's sidelines. In the grand schemes of things, we don't matter. Just as Cleo's drama doesn't matter to anyone except her. She's all alone with her struggles, just as we all are.","user":"johnofardeal","rank":[595,880]},{"title":"Really, really great camera panning","rating":4,"date":"24 December 2018","review":"This movie is great if you like, nay, if you love camera panning. There is so much panning,\nit's truly fantastic. Very artistic. 90 degrees, 180 degrees, once even 450 degrees!! Oh and tracking also. Panning and tracking, tracking and panning, panning and tracking galore. And just when you think \"wow, this panning has been so great and so abundant, they can't possibly squeeze in any more!\" well, right at that moment you're in for a treat. No spoilers, you will need to see for yourself what treat I mean. Oh, there's also a story in there somewhere about a middle class family in the Mexico in the 70s, marital problems and a Mixtec indigenous live-in household help. But I truly don't think any of that is really relevant to the movie, at least not as much as the panning.","user":"Flusenboy","rank":[1,1]},{"title":"A slice of Life... with a major \"L\"...","rating":9,"date":"15 December 2018","review":"The story of Cleo and her 'family' might hit a sensitive chord for many viewers who grew up not just in Mexico but in any Third-World country, maybe not just in the 70s but probably the 80s or early 90s.<br><br>By no means am I depriving the story from its cultural core but it was Roger Ebert who said: \"The more specific a film is, the more universal, because the more it understands individual characters, the more it applies to everyone.\" Still, it's not just about the characters, I could relate to the context as well on a superficial but still deeply personal level.<br><br>Coming from a middle-class family of Morocco, we also had these girls who came from poorer backgrounds (generally rural areas) and whose treatment would look a bit like slavery from a European/\"Western\" standpoint. The term wouldn't be appropriate though as they were paid, certainly not mistreated and in most cases were considered like members of the family. Not all the ladies of the house treated them with respect but they were often loved by the kids as sister-figures or even surrogate mothers. I was practically raised by the same 'dada' from the age of 4, she dressed me, woke me up, cleaned me till I was 8 (my daughter does it alone since she's 3) and well, she was part of my life and I miss her a lot.<br><br>I could relate to the story of Cleo and I was glad that the film didn't take the predictable \"clash of the classes\" path: having her fired, being rejected or ending as a prostitute in some brothel of Mexico City... Cuaron is above these tiresome archetypes and his intention is clearly to take the opportunity of a nostalgic voyage through his childhood to show people with a strong capability of caring and being empathetic regardless of their origins or social backgrounds. And Cleo, played with mesmerizing naturalness by Yalitza Aparicio, is obviously a girl to inspire the very feelings she exudes: she loves the children she saw growing up since the cradle, she's devoted to her \"Signora\" Sofia, played by Marina de Tavira, and she values her luck to be part of that world... she knows she could have been unluckier.<br><br>It's also interesting that Cleo isn't conventionally good-looking, not in a glamorous Hollywood sense anyway, and her petite frame and youthful face illuminated with a wide smile accentuate her vulnerability. She incarnates a sort of third world within the third world, like an extra layer of fragility making her the perfect target for the kind of troubles no upper class European looking girl would get herself into. Though the film is overarched by the social and political context of Mexico circa 1970-71, I didn't feel like Cuaron tried to make some social commentary, maybe it's just a character study of a woman who could only depend on the kindness of strangers, like Blanche Dubois, but is able to find some inner strength to overcome a blind (but not malicious) adversity if not triumph over it.<br><br>And indeed, in her harrowing journey (that doesn't follow any pattern of cinematic predictability), it's less in what happens to her than the reactions it inspires. The film is less driven by plot points but the way people react and reactions to their reactions... or non-reactions for that matter. There is an interesting scene where a Karate master shows a trick that looks extremely easy until it's done with closed eyes, I don't know if it was supposed to symbolize one of the film's underlying messages, but it's true that many things that happen are due to people's obliviousness, carelessness or lack of empathy. And near the end, both Cleo and Sofia realize they had more in common than they would have thought, adversity strikes everyone... only in different ways. Blind again, but not malicious.<br><br>What I liked in \"Roma\", besides its realism, is the fact that it doesn't just try to depict a slice of life but Life with a major L, providing sights often suggested but rarely shown in the movies. Indeed, the film contains many graphic sequences including a naked male body (and I'm sorry to say that it's more distracting for me than a woman's... maybe because the thing \"moves\"... chuckles) and one that shouldn't be spoiled but that had me almost gasping with tears because it was the moment where many aspects of an editing that demanded some patience from us finally paid off, and I knew I had to expect a high spot of emotionality sometime in the film. Cuaron's \"Roma\" (whatever the title means) is truly daring by showing life and death with the same clinical detachment from his lenses, one that also shows in the climactic scene, hinted by the poster.<br><br>Now, I wanted to give he film a 10 because it has reached a cinematic level of perfection I rarely found in a movie but sometimes its beauty just feels so deliberate it becomes sophisticated. The film benefits from Alfonso Cuaron's perfect command of the camera (we're obviously talking of the Oscar-winner for Best Cinematography and maybe Best Director) but the cinematography tends to steal the story's thunder and compromises the film's attempt to be a realistic portrait of a Mexican's slice of life in the 70s in an atmosphere of love devoid of the cynicism we get from today's dysfunctional families. The children in the film are not only adorable but played with an authentic simplicity and since so many directors said it was a nightmare to direct children, Cuaron deserves a credit for that too.<br><br>So It's precisely because the story is so well told and well acted that I wished it wouldn't be so well directed... though I approve the choice of the black-and-white for no other reason that it gives the film a sort of dreamy aura fitting its nostalgia.<br><br>Overall, \"Roma\" is a great film with a few haunting moments.","user":"ElMaruecan82","rank":[365,587]}]