[{"title":"A good laugh","rating":29,"date":"29 November 2016","review":"This short animation tells the story of Scrat who loves his nut, and does everything to protect the nut. This time, he is in a spaceship trying to save his nut from zero gravity situation. However, he accidentally activates the spaceship and the numerous unbelievable functions, causing chaos in space. This is further complicated by aliens showing up to snatch his nut.<br><br>The first half of the animation is very familiar to me, as I watched it in the new \"Ice Age\". The second half has new scenes which are quite funny. Though each time I keep thinking that the idea of Scrat and his nut is getting very old and beaten, I still get a laugh every time I watch it.","user":"Gordon-11","rank":[3,3]},{"title":"Scrat as usual, just longer and in space","rating":4,"date":"17 November 2016","review":"\"Scrat: Spaced Out\" is a 2016 animated short film and as such the newest addition to the \"Ice Age\" franchise. Many Scrat short films exist and most of these are really short, but this one here runs for a \"massive\" 15 minutes which is unusual for the films about this character. I guess they still keep making these because of the success (Oscar-nominated) of the early ones. Yeah well, there is not a lot more to say. There was another Scrat short film from last year when he is in space and this new Ice Age full feature film (which was actually very weak) has a connection to space and meteors as well, so this subject seems to be really en vogue for the franchise here. But back to this Scratventure (oh yes I did!). The title character is basically flying through space, sometimes in a capsule, sometimes outside and tries to get a hand on his acorn as always. And as if Scrat was not struggling enough already with natural aspects, he also has to deal with a bunch of supernatural alien creatures (that look like Scrat in other color, female and in space suits). I must say the only funny scene in here was probably the one that involved the other Ice Age characters in a solid little reference. Other than that, I was neither impressed nor entertained, but then again i have never been a really big Scrat fan. His films jumped the shark a long time ago if you ask me, if they even made it up the shark to be honest. I don't recommend this newest films. Thumbs-down.","user":"Horst_In_Translation","rank":[3,5]},{"title":"Scrat, the adorable saber-toothed squirrel","rating":8,"date":"3 November 2016","review":"First of all, loved it! Yet another Scrat adventure and it was awesome. Causing chaos left and right only for trying to hold on to his beloved acorn.<br><br>I am a big animation fan and I enjoy Ice age, but it would not be the same without Scrat. Not because he is somewhat the driver of the story line (in my opinion) but because he is hilarious to watch and can only be praised for his effort trying to achieve the impossible over and over again.<br><br>And for those who like Ice Age and love Scrat, watching all his shorts in one go is like watching a Scrat movie and I hope they will continue this until they run out of ideas for Ice Age.<br><br>Great animation and a lot of laughs from start to finish.","user":"dejohnnie81","rank":[2,4]}]