[{"title":"This movie Deserves at least a 8/10 rating","rating":8,"date":"14 July 2018","review":"I don't think i have ever written a review here but i just had to write one for this movie.\nI have watched a huge amount of horrors and this movie is not just a movie with 3 jump-scares and call it a day.\nThis movie had me on a small amount of fear for at least the last 70%. \nBut the weird way that the horror element is brought here is just so disturbing that it completely sucked me up emotionally and physically.\nVery good acting, great twist in the story and just actually a great horror!<br><br>(i never wrote a review so i probably suck at this lol but i hope u understand.)","user":"peterbaeten","rank":[198,258]},{"title":"Incredibly haunting psychological horror. Must see for horror fans.","rating":9,"date":"14 July 2018","review":"Wow, wow, wow! I've been a horror fan for many years and many people ask me why since the genre is saturated with mediocre and flat out crap films, but I always say that I love it because when you find a good horror it's a true gem better than any other movie you'll find in any other genre and that's exactly what 'Ghostland' is - a freakin' gem!<br><br>I went into it completely blind (which I would recommend everyone to do) and based on the title and cover, I expected a typical mediocre haunted house horror, but I was proved wrong. The eerie tone that's immediately present in the opening scenes grabbed my attention and pulled me in, and it wastes no time in jumping straight into the nitty gritty. I was practically glued to my screen from beginning to end. <br><br>The acting is fantastic, the story is well-crafted and it ticks every box you could ask for from a horror. It incorporates psychological horror with sheer brutality and the result is harrowing. It takes A LOT to get under my skin and since I've seen so many horrors I'm rather desensitised, but 'Ghostland' deeply effected me. There were so many moments where I physically couldn't bear to watch, but couldn't bring myself to look away because I was so engrossed. Once again, due to the amount of horror movies I've watched over the years I find that I'm generally able to figure out the plot within the first quarter of the movie, but 'Ghostland' has so many twists and turns that you never know what's going to happen next. What you think the story is at the beginning, is very far from what it becomes and that unpredictably is what makes it so fantastic. <br><br>Although there's a lot of violence (similar to that featured in movies like 'The Hostel'), the movie isn't just built upon mindless violence, but a very intense and relentless insight into the human psyche. The psychological aspect of this movie is definitely what gives it its edge and it really got into my head. After the end credits came on, myself and my family were all saying how much it had effected us and even half an hour later, it was still at the forefront of our minds (in fact, I'm pretty sure most of us won't be having the most restful night's sleep tonight!) <br><br>'Ghostland' is the best horror I've seen in many years and I would recommend it to every horror fan, particularly those that are fans of psychological horror. Be prepared though, this movie is a tough ride and will put you through the ringer. It's one I certainly won't forget any time soon.","user":"shannen-l-c","rank":[123,171]},{"title":"This movie gets you","rating":9,"date":"11 August 2018","review":"It feels. It really does.<br><br>\nThe movie is divided into two big sections, pre-twist and post-twist. If you are not new to the horror genre you will catch the \"twist\" pretty fast, but the movie doesn't emphasize on it a whole lot. Rather works with it and does its job well indeed. At first I felt like, come on, \"I've seen this already, you can't surprise me with this\". But then...<br><br>\nIt is very atmospheric, it's brutal, it's hopeless, but what caught me is one emotional moment with the sisters, you will know it when you see it. It's unforgettable. <br><br>\nIt has it's flaws but is well crafted overall. This movie was able to share it's emotion with me and I enjoyed it.","user":"kuarinofu","rank":[55,81]}]