[{"title":"Questions about the end","rating":8,"date":"28 July 2018","review":"Good movie, tells same story from different perspectives. Funny parts (Jerry Trainor is a treasure) but leaves questions. Doesn't give much explanations and doesn't clear things up but overall good movie with good cast.","user":"fjobin9","rank":[4,4]},{"title":"Could be a short movie, I guess?","rating":4,"date":"15 April 2018","review":"Well, I didn't expect much from this movie. I just watched it because I like some of the actors, like Katie Cassidy, Drake Bell and Jerry Trainor. But even with low expectations, I was kinda dissapointed. <br><br>The movie is about four band members that are testifying about a murder, each one from their unique point of view.<br><br>I get that some things like Katie Cassidy's character Jackie make up differs in each story is part of everyone's perspective but I don't get why some stuff that have nothing to do with the plot are altered, like that in two of the four stories Katie Cassidy joins Jerry Trainor when the pizza guy arrives and in the rest she doesn't.<br><br>There are a lot of fillers plans and, also, the most important thing for me is the use of the characters. What do I mean? Katie Cassidy looks like a protagonist for the first 30 minutes and Austin Swift like kind of an antagonist. Then, we have Jerry Trainor who is the comic relief and does a fine job, but his character would be an absolute zero if he didn't have his own story. Last but not least, there is Drake Bell that I could call him \"less than zero\", due to just being there, looking good and entering the movie as a true character after 58 minutes!<br><br>We also have three supporting members, some girls that Austin Swift meets at a liquor store and play a crucial part in the story. One of them happens to be Debby Ryan, who turned to be my favourite character in the movie, just by being consistent.<br><br>The ending is supposed to be a plot twist, but I was more like \"why?\". And after the pointless twist and the ending that actually gives us nothing, we also have a post credit scene because...?<br><br>I think this film would be better as short movie. <br><br>I'll give it a 4/10 just because I was interested until a certain point and I liked some of the performances.","user":"Dimitris_Kountouris","rank":[4,5]},{"title":"Great movie with poor ending","rating":8,"date":"3 May 2018","review":"The movie gives perspectives of what occurred from each character's POV \nI was really intrigued by the premise however the ending fell short and didn't feel worth it","user":"atomsmasher-79274","rank":[3,4]}]