[{"title":"Quite good but could easily have been better","rating":7,"date":"4 May 2018","review":"The Delinquent Season tells the story of two married couples living in Dublin; Jim (<a href=\"/name/nm0614165/\">Cillian Murphy</a>) and Danielle (<a href=\"/name/nm0083795/\">Eva Birthistle</a>), and Chris (<a href=\"/name/nm0778831/\">Andrew Scott</a>) and Yvonne (<a href=\"/name/nm1254152/\">Catherine Walker</a>). As the foursome are having dinner one evening, an argument breaks out between Chris and Yvonne, with Chris behaving in a worryingly irrational manner. A few days later, Chris confides in Jim as to why he's been having mood swings of late, swearing Jim to secrecy. Over the next few weeks, as Chris's mood swings become physically aggressive, Yvonne turns to Jim for support, and soon, they are in the midst of an affair. Jim, however, continues to keep Chris's secret.<br><br>The film treats well the topic of middle-class malaise and ennui, deftly shifting the audience's sympathy multiple times throughout. However, in his feature directorial debut, <a href=\"/name/nm1248824/\">Mark O'Rowe</a> misses a great opportunity for a really powerful dénouement, letting the narrative drag on for 10 minutes or so too long. Still though, it's well acted, and extremely realistic, attaining an almost documentarian objectivity at times. Well worth checking out.","user":"Bertaut","rank":[29,32]},{"title":"Delicate & moving. So much better than the critics made it sound","rating":9,"date":"21 June 2018","review":"When I read last year that Andrew Scott and Cillian Murphy would be making a film together I got very excited, as they are both absolute favourites of mine. \nWhen I then read some online reviews after the film came out in Ireland, criticising it as boring, hugely disappointing and dull I almost didn't watch it, and how sad that would have been. I'm not entirely sure which film these critics saw, but I found it anything but boring and disappointing. \nQuite the contrary... I watched it about 5 days ago and it is still stuck in my head and I keep of finding myself thinking back to it. \nYes, it is slow paced in places, it doesn't have crazy twists and turns every 15 minutes and if you compare it to other relationship &amp; affair dramas it's nowhere near as shocking, but thats exactly what made it so much more interesting to me. It's so realistic! It feels exactly what I'd imagine it would feel like to have an affair, and the the way the story unfolds is extremely close to life and makes you feel exhilarated but completely uncomfortable at the same time. Yes, you can tell that the director has only directed theatre productions, which gives the film a certain spareness, but once again this makes it more unique to me. It's not overloaded with side stories and mind blowing cinematography, it gets to the point of human feelings &amp; needs. The constant questioning of what is right and wrong, of what makes you happy and how far you're allowed to go for it, of who you are and who you want to be and the issues you might have with yourself that lead to having an affair are so well played out, so is the struggle with love vs. lust and what it all really means! \nAt the end I felt like I really knew these people, and I deeply felt for them. It's such a small but perfect cast and such a tender and yet uncomfortable story. I personally can only very highly recommend it and will definitely watch it again.","user":"Nadine1301","rank":[45,52]},{"title":"Solid movie that has a lingering effect","rating":8,"date":"8 July 2018","review":"It was Cillian Murphy that attracted me to watch this movie. And I got so much more. Solid story with a presentation of moral dilemmas that have a lasting effect - both in thought and discussions. What would you do when impossible situations present themselves as attractive temptations? Cillian Murphy and Catherine Walker carry the movie, with great moments of Andrew Scott and Eva Birthistle. Solid hour and 3/4 of good acting. Most probably for the deeper thinkers, as this is not a light romance. I loved the ending and the outcome and the statement it makes. Counter-intuitive, I would say. Watch it to understand.","user":"eyefordetail","rank":[15,18]}]