[{"title":"Worth the watch","rating":7,"date":"3 August 2018","review":"I was able to see a sneak preview of I Think We're Alone Now at \"The Female Gaze\" Film Festival in NYC. I had high expectations for the cinematography in this movie by Reed Morano and they exceeded all of them. The lighting was gorgeous and the set design was spot on.<br><br>While there isn't a lot of action or answers that one might be looking for in a post apocalyptic flick, you get all the story telling you need out of the nuanced performances by Peter Dinklage and Elle Fanning who share an undeniable chemistry.","user":"alipaige-78849","rank":[97,136]},{"title":"A slow, eerie, romantic nightmare.","rating":7,"date":"17 September 2018","review":"I Think We're Alone Now is not the typical post-apocalyptic film most audiences are used to seeing.<br><br>After looking at the gorgeous poster and watching half the trailer to this movie, my interest grew. The further I looked into the project and the more I learned about the cast and crew involved, I was hooked.<br><br>The film is directed by Reed Morano and stars Peter Dinklage and Elle Fanning. The story follows a seemingly lone survivor of a mysterious apocalypse that stumbles upon a young girl. Throughout the film the two talk and bond, living in this quiet world Morano builds for his characters.<br><br>Dinklage's acting was quiet and subtle, very rarely talking and communicating in glances. Fanning's character is loud and full of energy. The two have great chemistry. The film's romance is similar to Lost in Translation but isn't executed as well. Throughout the film it seems they are close, but never really romantic, just surviving. If it was built upon more, execution would be better.<br><br>The cinematography in the film is spectacular. Morano's past in cinematography shines in this project. The atmosphere is built upon with the film relying on natural lighting. This has an amazing effect on the environment, giving it life and making it seem real.<br><br>There are downsides to this movie. About two thirds of the way into the movie, it seems to take a total shift in the mood and story. The ending seemed like it didn't belong, ripped out of a mid-two thousands teen dystopian book. While the ending didn't ruin the film, it still left me unsatisfied.<br><br>While the runtime of this film is just over an hour and thirty minutes, it takes its time. If you're going into this expecting a fast pace movie with quick dialogue and fast results, this movie isn't for you. If you're a fan of character studies and long, interrupted takes, you'll more than likely enjoy this movie.<br><br>Overall, I Think We're Alone Now is an experience that I haven't had in a theater in a while. It's different than most of the films in theaters this year which is refreshing. It teaches people the importance of a strong and satisfying ending and how not to do that, but also how to set up an effective and interesting universe Check it out.","user":"Fedoics","rank":[75,104]},{"title":"Just taxied around the runway and then crashed into a hanger.","rating":6,"date":"23 September 2018","review":"I THINK WE'RE ALONE NOW just isn't much of a movie. What's remarkable about it is how incredibly far the mere presence of Peter Dinklage in it goes to give one the impression that one is seeing a good movie. As good as Dinklage is, when the story finally wakes up and realizes that it isn't going anywhere and takes a sudden, jarring turn out into the weeds in a desperate attempt to save itself, as a viewer you suddenly come to your senses and catch on to the fact that the movie is just stumbling around in the dark trying to find something to say.<br><br>I THINK WE'RE ALONE NOW is a post-apocalyptic movie that tries to take the road less traveled by in telling it's story, which in and of itself isn't a bad thing at all. Most post-apocalyptic movies are about zombies or aliens and all sorts of heroic struggles and explosions etc. I THINK WE'RE ALONE NOW just starts out with everybody already dead and goes from there. By observation there was probably some sort of pandemic, but I THINK WE'RE ALONE NOW is not interested in the hows or whys but rather how Del, the apparently lone survivor and our lead character played by Dinklage, chooses to spend his majority of one. This premise was completely legitimate and COULD have resulted in a sensational movie but it just didn't happen. Somebody had a great idea and it produced a handful of great tableaus and Dinklage brought them to life, but apparently no one could follow the great idea through to a complete story.<br><br>When the movie begins, we start watching Del's version of overseeing the end of human history. Del was living in a small town of about sixteen hundred people and worked, apparently, in the local library when life as we know it came to an abrupt end. Del likes things orderly and organized (and what librarian doesn't) and has chosen to spend his remaining years cleaning up after the end of humanity... At least as it has ended in this particular small town.<br><br>There are corpses to collect and bury, some basic tidying to do when the dead didn't leave their circumstances dusted and shipshape when they \"joined the choir invisible\", smelly refrigerators to clean out, leaves to blow, photographs of a few hundred families to collect and organize into files, and so on. Just because it was an apocalypse doesn't mean it can't be clean, organized and odor free now does it?<br><br>Ultimately, Del is all about having the postapocalypse arranged in the manner he prefers it because, as we come to understand, so much of the pre-apocalypse WAS NOT the way he liked it.<br><br>Unfortunately, the sprucing up of the end of humankind is going along swimmingly, when, one evening, not far away from where Del has chosen to live, some fireworks suddenly appear in the evening sky. Evidently someone else is also still alive and THEIR view of the end of the human world involves fireworks.<br><br>The next morning Del goes looking for the source of the fireworks celebration and finds a young woman either passed out or knocked out in her car on the side of a residential street. While still knocked out, he takes her to a bedroom in one of the vacant homes, patches her up, and leaves her unconscious and locked up on a bed. He has no weird intentions mind you, he just wants to control her options when she wakes up and hopefully help organize her swift departure so he can return to his pleasant, well structured and tidy routine.<br><br>Which, of course, doesn't work at all. While Del's personality seems to be that of a love child between a librarian and an accountant, the young woman, Grace, seems to be the antithesis of everything Del. Grace is the embodiment of chaos, and, to Grace, the whole purpose of a postapocalypse is to be able to do anything you want without a lot of interference.<br><br>As you might guess, a good chunk of the movie, which is definitely not a comedy no matter how much I may be making light of it, is about the conflict between these two diametrically opposed personalities.<br><br>And then one morning, with absolutely no warning other than a rather unusual scar on the back of Grace's neck to tip us that there may be some other plot element at play, Del wakes up to find Grace, looking terrified, having breakfast with two strangers who purport to be Grace's \"parents\" who have come to retrieve her and return her to, of all places, suburban Palm Springs, California.<br><br>Suffice to say that the storyline takes a violent turn right off the rails from this point to the end. I will leave that part of the picture is an adventure of exploration for the reader.<br><br>It's all very well to say that we should view people from the perspective of who they are and their actions while overlooking their physical characteristics and limitations. It's entirely another thing to see that actually happen in the real world and especially in a place as artificial and hypocritical as Hollywood. It's amazing to me, given Hollywood's obsession for tall and handsome leading men, that it even gives Dinklage the time of day for obvious reasons. While I haven't got a SJW bone in my body, I'm tickled to death that Dinklage gets the roles he does because I find him one of the best actors I've ever seen. He is one of a handful of actors whose presence in a move me causes me to watch it for that reason alone. His screen presence is nothing short of spectacular. I typically find myself completely forgetting his dwarfism until some scene requires some physical activity from him that highlights it.<br><br>It is only Dinklage's presence in I THINK WE'RE ALONE NOW that makes it worth watching at all. If you think I'm wrong about this, go ahead and watch the movie and then just imagine, oh, say, Grant Gustin as Del instead of Peter Dinklage. Would you have been able to stay awake through the whole thing? I doubt it.<br><br>I do encourage you to watch I THINK WE'RE ALONE NOW just to see Peter Dinklage's reliably stellar performance, but be sure and brace yourself for a redonkulous ending from left field. At least it's a happy ending for what that's worth.","user":"S_Soma","rank":[53,75]}]