[{"title":"I made an account just to say how terrible this film is","rating":1,"date":"22 April 2019","review":"It is the worst rip-off of Disney's Cars I've seen yet. I mean, the mouths are identical, the whole graphical style is extremely similar, and the animation the same but worse.\nNot only that but it's lazy, most of the cars look the same, the plot may swell be Cars 1, the characters are the same. The girlfriend is even still based on a Porsche, the sidekick has buck-teeth and is dumb like mater, the main character gets a new paint job and keeps it, Frank is sort of like Doc Hudson, it just gets worse the more you watch it. I wish there was at least 1 little joke in there to make me chuckle.\nAlso there are literally 2 helicopters in the whole film, they appear twice, once at the start and once at the end. When they got to the end, they forgot which voice went to which helicopter! There are 2 choices and they got it wrong!\n1/10, next time just donate the the \"$20,000,000\" budget. Seriously 20mil on that?! I can think of so many better things to waste that much money on.","user":"jawz-93601","rank":[14,14]},{"title":"Bad. Very bad. The Emoji Movie is nothing compared to this movie.","rating":3,"date":"27 December 2018","review":"I am an Asian. The reason I chose to watch this movie at the theater is because I want to know how Asian animation is developing. And I was really disappointed when I finished watching this movie.<br><br>Except the animation, the rest is too bad. This may be the worst animation film I saw this year, although there are films that are not good like The Grinch or Ploey (Iceland). The plot is a mess, confusing and troublesome. The director was too greedy to put too many story lines in 1h30m . Humor = 0 and this is a ripoff of Pixar Cars at the upper level. Discrete film plot. The film has tons of characters, but any character does not do well. I know this is one of Malaysia's most expensive animated films. But unfortunately, a good film doesn't mean a high-budget film, it seems that this film burns money for fun.<br><br>Don't waste your time watching this movie. The Emoji Movie is much better than this. Trust me.","user":"caubemattich","rank":[11,16]},{"title":"Was like watching Disney's Cars all over again","rating":2,"date":"28 December 2018","review":"As a car enthusiast I will pretty much watch anything related to cars, good or bad. This falls into the latter category. As a Cars fan, this was a cheap knock-off. If you don't take my advice and watch it, as the film proceeds you start feeling the familiarity. Even one of the main characters Put Put is very close to tow mater, buck teeth, gets the main character into trouble, and is a bit dumb. Sounds familiar right? They spent so much money on the animation and forgot to get a unique story. What a waste of time and money. Overall 2/10 I wouldn't recommend watching this film.","user":"shahin-fard","rank":[10,15]}]