[{"title":"This doesn't end bad as some may say","rating":10,"date":"31 July 2018","review":"This is not a story of a women caving in as some said, this is a realistic portait of a women that grew in a harsh community and succeed to confront her homosexuality. The acting of both Rachaels is superb, academy material ! And the male character is really complex and beautiful","user":"anelsg","rank":[74,96]},{"title":"Disobedience (2018)","rating":6,"date":"30 April 2018","review":"Yes, there was another film that came out during Avengers: Infinity War release week. I was immediately excited for Disobedience as soon as I heard about it. I mean how could you not be? Rachel Weisz and Rachel McAdams (who I am infatuated with) in a film about a forbidden romance? I was so in. I did see Sebastián Lelio's A Fantastic Woman earlier this year, so I was really pleasantly surprised to hear he had another project out so soon. I can draw parallels between the two films and while Disobedience is not perfect and has lapses its well acted and has an interesting look at a religious community being scarred by a \"scandalous\" affair.<br><br>The film is about a woman who returns to a very strict Orthodox Jewish community when her father dies. While there she sees her former lover who is now married. The problem is the fact that people in the Jewish community do not know about the relationship that has occured and also because a lesbian affair is frowned upon in the community. Both women also must deal with harboring the feelings that they have for each other, while attempting to maintain their standing in the Jewish community.<br><br>The first thing that's instantly noticeable about the film is its depth into an Orthodox Jewish world. The films backdrop is its strict nature and how a lesbian romance must be hidden from the community. Rachel Weisz and Rachel McAdams are great in this as expected, and have great chemistry. Their intimate scenes (which are very very intimate) are believable and are a strong point in selling the romance. I always knew McAdams was a talent since she had a good showing on season 2 of True Detective.<br><br>The film reminded me of A Fantastic Woman in a way because in that film there is a struggle to accept a transgender person, although the implications in that film are more hostile. I also couldn't help but compare this film to Carol (which is one of the very best films of the decade). Its nowhere near the levels of Carol but does a decent job for what the film is. There are lapses where the film seems slow and it suffers from its best moments being purely when Weisz and McAdams share the screen. Its still a worthy watch, just don't expect anything spectacular.<br><br>6/10","user":"rockman182","rank":[60,93]},{"title":"very complex and very well done","rating":9,"date":"11 September 2017","review":"This project attracted the efforts of an abundance of talents because these are very good roles. Men and women alike. Roles that actors really want.<br><br>The complexity of the two leading lady roles must have drawn an abundance of female actresses and the two Rachels are close to perfect.<br><br>The Q&amp;A was particularly revealing.<br><br>The young and very witty director shone at the Q&amp;A. <br><br>This was his first English language film from this Spanish speaking Chilean director and for him to put together a smooth running evenly paced film with such complexity is very illustrative of his talent and abilities.<br><br>As to which female role is the supporting role I am not sure. They are both very good roles.","user":"michaeljtrubic","rank":[112,182]}]