[{"title":"Didn't have high expectations","rating":4,"date":"3 August 2018","review":"Picked this up in the bargain section of my local supermarket. A scary clown on the cover with a red balloon &amp; the word IT suggested an unoriginal film in the vein of Stephen King's book come movie. However it has no resemblance to that whatsoever. \nA group of strangers can win 250,000 dollars if they can survive the creepy home of one infamous clown called Kane. Needless to say they start getting bumped off, one by one.\nThere's plenty of clown creepiness going on here and its reasonably well done. There's also a fair bit of gore. However it is let down by a poor script and unconvincing characters, including Kane. It felt like a wannabe Rob Zombie movie, but just lacking his talent or budget. Wouldn't watch it again.","user":"Stevieboy666","rank":[8,9]},{"title":"A very lame game at the circus","rating":2,"date":"26 March 2018","review":"Saw 'Circus Kane' as someone with an appreciation for horror and who found the premise oddly interesting. Despite it not being a unique one and one that could have gone either way in execution, it sounded pretty decent and if done right could have made a guilty pleasure sort of film. <br><br>What 'Circus Kane' was instead was a very lame, if not irredeemable, film that did very little with its premise and its setting. The setting is the best thing about the film, to me also the only good thing, and is pretty creepy. Even that feels wasted, a shame because it was the one thing that was done pretty well and deserved better than what the rest of 'Circus Kane' turned out to be. Didn't get the sense as such that it didn't even try, other low-budget films seen recently have done a far worse job at that, but did get the sense that it didn't do what to do with itself.<br><br>The setting apart, 'Circus Kane' looks cheap. Photography was drab and the editing, while not incoherent as such, was sloppy. Faring worst were the special effects, their ineptitude and intelligence insulting cheapness being an assault on the senses.<br><br>'Circus Kane's' villain was not menacing or threatening, actually veering on the goofy side of things. In all fairness the material was cheesy and lacking in suspense, and the action was not disturbing, brutal or scary no matter how much gratuitous and cheap-looking gore or supposedly creepy but actually laughable imagery there was.<br><br>Its obvious and over-bearing sound really annoys and hinders the impact of any scares or suspense when they are telegraphed when being built up that they become predictable.<br><br>Script constantly sounds stilted and even cheesier than a large cheeseburger. The story is dull, lacking in any kind of atmosphere, tension or suspense and insults the intelligence by how ridiculous and confused it tends to be. <br><br>No better news about the characters or acting, the latter being one of the worst assets of 'Circus Kane'. The characters are bland and obnoxious, either or and in a few cases both, with truly dumb illogical decision making that makes them and even the viewer stupid and make one endear to them even less (and you don't even like them in the first place). The acting is a bad mix of over-compensating and disinterested. Jonathan Lipnicki with this film has fallen such a long way since his adorable child actor days. <br><br>Overall, very lame and does nothing with something that could have worked. 2/10 Bethany Cox","user":"TheLittleSongbird","rank":[9,11]},{"title":"Complete and utter rubbish, nothing about it is any good","rating":1,"date":"17 September 2017","review":"If you are looking for a horror film to watch, then leave this and go to your back catalogue for 2 reasons: 1) You know you will enjoy whatever you choose 2) You will not waste you time and still be unsatisfied<br><br>The only thing that stands out is the location for the filming. Everything else - the acting, the \"special effects\", the dreadful story, the acting (so bad it's worth noting twice), the character development is all nothing special. Like it came out of the 1980's.<br><br>Lord the characters, nothing about them was endearing and one in particular, shortly after meeting him I was already waiting for him to die - sooooo annoying. The acting was possibly what you would expect from fresh young faces who will do any job for experience and the script writing really didn't help them. The special effects, were like someone was given a bunch of plasticine and bright coloured paints, unconvincing and cheap.<br><br>As a film in it's own right it's bad, very bad but for a film trying to cash in on how popular the new IT is then it's REALLY bad.<br><br>Leave well alone.","user":"eggbp-378-544557","rank":[17,26]}]