[{"title":"It's better than I thought it would be","rating":8,"date":"20 August 2017","review":"Reading the reviews here before watching, I was pretty sure I would not like this movie. Well I was pleasantly surprised by how much I enjoyed it. Most of the negative reviews are based not on the quality of the movie but based on the fact that those reviewers do not believe in God.<br><br>I myself doubt that God exists but to pan a movie simply for that reason makes no more sense than giving Star Wars one star because you do not believe in wookiees.","user":"mandy-48322","rank":[169,229]},{"title":"The Case For Integrity","rating":8,"date":"13 August 2017","review":"Based upon the book by Lee Strobel, this is a journey through the spiritual, intellectual, and emotional struggle of a newspaper journalist conflicted by his wife's conversion to Christianity. Determined to disprove to his wife and, in effect to himself, Christ's Godhood and therefore the Christian faith, Strobel focuses on the key element--the Resurrection. If he can disprove the Resurrection, he can prove the falsehood of Chrisitanity, as he sees it, and win back his wife to \"reality.\"<br><br>The film also merges a subplot involving the shooting of a police officer allegedly by a known gang banger. These two parallel investigations by Strobel are well-integrated in the script and directed with a clean firm hand by the movie's director, and form a satisfying related climax, as Strobel employs a single-mindedness to both investigations fueled by his journalistic skills, but crippled by a blind drive to prove a pre-determined opinion. On one hand, his relentless crime story approach puts an innocent man in prison and on the other, drives a wedge between Strobel and his newly \"Christianized\" wife. And behind all of this, is a failed relationship between Strobel and his father.<br><br>The high production value, taut direction, top notch acting, and unobtrusive musical score all belie the low ratings given to this film by what appears to be the atheist community apparently, for some reason, being deeply offended. Frankly, giving a film like this a rating of 1 or 2 reveals more about the rater than the film. A key finding in Strobel's Resurrection investigation reveals, I believe, the reason for the strident and shrill objections by the atheist reviewers to this film: the most vocal and militantly resistant objectors to the Case For Christ shared a lack of a loving relationship with their fathers. That kind of lack--and the pain it brings--shows up in these reviews.","user":"lucascolebooks","rank":[68,107]},{"title":"One of the better Christian movies","rating":8,"date":"9 September 2017","review":"'The Case for Christ' dramatises Lee Strobel's journey from Atheism to Christianity. As you'd expect for someone who was not just an unbeliever, but scorned faith, it was not an easy ride. Predictably, many Atheists aren't going to like the movie, but I think it stands on its own merits. It is more biopic than apologetic and while a dramatisation, Strobels himself has said the movie is 85% accurate.<br><br>***Contains Spoilers***<br><br>It particularly focuses on his strained relationship with his wife. Strobels is a successful journalist, but this dynamic sends him into a tailspin and while he sets out to disprove his wife's faith, he also turns to alcohol and workaholism to cope. We see someone depicted as a loving husband and father, part of a loving family, start to fracture. I've heard something similar from a friend who went through the same thing when his wife became a Christian before he did and it felt like he was competing with another husband.<br><br>The spiritual aspects of the movie are pretty well handled. Scenes in which people pray don't feel awkward or contrived. Sermons are relevant and the whole thing comes across as authentic. Strobel's wife's more emotional journey to faith contrasts with his own.<br><br>A murder investigation is used as a foil for Strobels search for truth about Christ. As an investigative reporter he is portrayed as relentless, but he makes an error bias that gets a man jailed. It's meant to demonstrate both his doggedness in pursuing the truth but also his blind spots and challenges the viewer to see their own.<br><br>Along the way we do get apologetics, and on the whole it's handled well, I thought. It's definitely apologetics light, but it demonstrates that Christianity has rational grounds for belief and gives enough for anyone who's interested to investigate further. The overall impression given is of someone who's done his homework and been confronted by the credibility of Christianity. In the end Strobels has to make a step of faith, but as his Atheist mentor says (who is presented very sensitively - there were no 'angry atheists' in this), it's a step of faith either way.<br><br>One part that I thought may have been a little awkwardly handled was Strobels visit to a psychologist. He asks her about the hallucination theory, which she debunks (like most of Strobels questions, the answer is summarised rather than elaborated - it was already a 2 hour movie). However, she ends up confronting him about his father wound, which is another aspect of the movie. It didn't feel out of place but I can see how many Atheists will feel it was a little below the belt. But as portrayed in the movie, it is pertinent to Strobels' psyche.<br><br>Ultimately you could have changed the premise and this would remain a solid drama. Well constructed and well acted.","user":"alex-93-638754","rank":[50,80]}]