[{"title":"Not a travelogue!","rating":6,"date":"22 January 2019","review":"This film is certainly not a drama, nor a musical (as the IMdB genre tags have it), though a dramatic event and music are central to its purpose. And it's not 'easy viewing'. It's been described here as boring and pretentious, and such a description cannot easily be dismissed. And yet, at the end I decided it had been time well spent, though perhaps a little less time might have been adequate for its task. Some of the images are very beautiful indeed and relate to the fact that the narrator (and only character) is an architect. She uses her reflections on certain places in Stockholm (especially churches) as a way of coming to terms with her involvement in a fatal road accident. Such a coming-to-terms is a slow and often repetitive process, and although at times the film is turgid, it ultimately feels meditative and redemptive.","user":"frogball","rank":[7,7]},{"title":"Oranges are not the only fruit","rating":1,"date":"18 February 2019","review":"Stockholm is not the only syndrome.<br><br>\"Dad\" is not the only word.<br><br>Neneh Cherry is not the only actor.<br><br>It reminded me a little of Robinson in Space (1997). From the description on IMDB of that much earlier work: \"Robinson is commissioned to investigate the unspecified \"problem of England.\" The narrator describes his seven excursions, with the unseen Robinson, around the country.\"<br><br>But here the narration is drab and tired-out, so low-key. At any moment, it seemed like Neneh Cherry's character would decide she was more in the mood for a trip to Dignitas than a snail's pace mooch around Stockholm.<br><br>A film that makes you realise it is not inappropriate to walk out of a home cinema. (I gave it 24 minutes before I found myself out on the street.)","user":"frukuk","rank":[4,5]},{"title":"Self absorbed dated and head spinning","rating":2,"date":"20 January 2019","review":"Watching this film about a city I love reminded me of French cinema In the 60's - narcissistic, nihilistic and claustrophobic, there was nothing to enjoy.<br><br>I didn't watch the whole film - life is too short.","user":"darrantaylor","rank":[6,11]}]