[{"title":"rinse your eyes out afterwards","rating":7,"date":"18 September 2017","review":"Holy !@#$!@#$ that was probably the most disgusting movie I've ever seen and I consider myself well versed in revolting movies.<br><br>Scene after scene of people smearing poo and cum on themselves. It really is almost scat porn at times.<br><br>Apparently this was \"directed\" by Flying Lotus but it feels like an anthology movie by multiple directors working separately. Seems like the only instructions were: \"there was an earthquake and now everyone has zits... be incredibly vulgar\". Then they cut the resulting short films up and mixed it together a little.<br><br>The second half of the movie is much stronger than the first. There's more narrative, and there's more humour. If you are thinking of switching off after fifteen minutes due to lack of plot you should probably persevere.<br><br>Be ready to rinse your eyes out afterwards.","user":"Harold_Boss","rank":[14,17]},{"title":"Zits !","rating":6,"date":"22 August 2017","review":"If you like pure experimental trash, you have here something to enjoy. Don't expect any coherence, it's just a stream of weirdness happening after a mysterious earthquake, that gave to almost all humans some pimples all over the face. You have 3D cartoons (something between Terry Gilliam and Cool 3D World), multi-dimensional roommates, strange foreplay and you will know what's hiding in George Clinton's colon. Don't take it too seriously and you'll have lots of fun !","user":"acromegalix","rank":[11,13]},{"title":"A treat for fans of experimental film","rating":10,"date":"26 July 2017","review":"If you are familiar with Flying Lotus' music, then it shouldn't be surprising that his debut film shares many similar qualities to his music. It's experimental, unique, strange, beautiful, unpredictable, challenging, abstract, and technically great. He made a film that is unlike anything I have ever seen. It is a surreal ride through multiple story lines that are barely comprehensible. It's also surprisingly hilarious and disturbing. Sometimes both at the same time. Fans of experimental film should definitely check this out. It's definitely an acquired taste. Most people will probably hate it but you should still give it a shot if you are on the fence. Watch something different.","user":"jordanlongwood","rank":[17,27]}]