[{"title":"A slasher film with a brilliant twist and a profound message.","rating":6,"date":"19 July 2018","review":"\"Who's watching Oliver\" will certainly not be appreciated by everyone. It's a film about voyeurism, sadism and total insanity. At first sight, the film seems meaningless in terms of content. But as the film progresses, you'll conclude it contains a more pronounced message. The moment Oliver (Russell Geoffrey Banks) begins to abuse and torture a girl like a madman, under the watchful eye of his authoritarian mother (Margaret Roche), who's watching the whole show via a webcam, you assume that this is the umpteenth morbid torture film. But as soon as the handsome Sophia (Sara Malakul Lane) comes into the picture, the storyline tilts slightly. From that moment on it is no longer the Oliver who has to tolerate the whims of his mother, routinely take his two pills and goes off to search his next victim. No. Now he's the Oliver who realizes that there may be a way out of this violent existence.<br><br>Is \"Who's watching Oliver\" an excellent film? Well, I wouldn't say that. But it's a damn shocking and confusing film. Needless to say that I found the acting performance of Russell Geoffrey Banks sublime. The way he portrays Oliver is magisterial. That foolish expression on his face with his protruding lower jaw and crooked teeth. His silly glasses and backward combed greasy hair. The retarded mumbling and the in-mouth muttering. All this makes him look like a mentally disturbed individual. And the moment he bursts out laughing is both touching and frightening at the same time. The laughter of a fool or a schizophrenic madman. It's also obvious that Oliver's condition is directly related to his mother because she's on the same level. Also a totally insane woman. Even though we see Margaret Roche only on a monitor. The way in which she addresses the victims in a denigrating way and laughs with them felt outright diabolical. And the moment you find out what happened to her husband, you realize just how crazy this woman is.<br><br>And then you have the naïve and angelic Sophia who spontaneously seeks contact with Oliver in the amusement park. A place where Oliver comes to rest on a daily base. In retrospect, she's just another restless soul who's seeking comfort. It's not that you get a pronounced explanation about her past. But between the lines, you can assume that she also knew a past full of abuse and grief. Why Sophia approached him, ultimately remained a mystery to me. The final scene provides a variety of interpretations. Will Oliver escape from the grip of his mother at that moment? Or did he find his \"partner in crime\"? Your guess is as good as mine.<br><br>And there are more of those ambiguities. Why is Oliver wandering around in Thailand? And where does all that money to lure girls to his room come from? \"Who's watching Oliver\" is such a film where you as a viewer can't predict which direction it'll go. But if you leave out the explicit nude and bloody scenes, a fragile love story remains. But in a bizarre way. Everything feels rather absurd. Especially with that cheerful jazzy music playing while Oliver chopping up the dead bodies. And the daily trip to the amusement park in this Asian country emphasizes the absurdity of the whole. For those who love slasher films with a psychopathic character whose ruthless behavior causes bloody situations, this is definitely a must see. But this flick gives it a brilliant twist as well. Therefore it's no surprise this film has already won some rewards at a few film festivals.","user":"peterp-450-298716","rank":[12,21]},{"title":"Too much hype.","rating":2,"date":"19 July 2018","review":"I'm sorry, but this movie is not scary in any way. It's just scene after scene of disgusting behavior. The ending is no surprise. It's really not even disturbing because it is just over-the-top ridiculous. I tend to value plot and meaning...and neither of the two exist here.","user":"collinsdd","rank":[20,39]},{"title":"Really enjoyed this one!","rating":8,"date":"13 June 2018","review":"Oliver is mentally unstable and a loner at best, living a life that was forced on him by his oppressive mother. By day, he slouches through his OCD ritual, but at night, he wanders the streets and bars on a deadly mission. His life is brutal and filled with doom, but out of all this violence comes the opportunity to leave it all behind, thanks to a girl named Sophia.<br><br>\nWho's Watching Oliver is the directorial debut of Richie Moore, who has worked on the camera crew for the last two Hangover films and Mission Impossible: Ghost Protocol. He also co-wrote the script with star Russell Geoffrey Banks and producer Raimund Huber.<br><br>When we first meet Oliver (Banks), we see him counting down the seconds until 1 AM so that he can take his pills and Facetime his mama (Margaret Roche). Then, we watch as he meticulously plans and executes his daily routine, alone save for a random stray cat that intrudes on his morning. He boards a water taxi and heads off for his day in Thailand, a place far from home.<br><br>Soon, we catch up to him at night, in a bar. I really like how Moore keeps the focus on Oliver in these scenes, having him speak directly to the camera. I don't know what the budget was like for this film, but the assured camerawork and production design really make up for any deficiencies on that end. It looks like most of the money was spent making a great looking movie.<br><br>Oliver's interaction with a girl at the bar, all to get her back to his place to do drugs, is the first sign we see of him being a bit different than normal folks. Once he's alone with her, it's unsettling how off he is and the way he handles himself around another human being. As he stands alone preparing himself while she gets high, we juxtapose their own rituals: the steps of doing drugs and the steps of getting ready to kill a human being.<br><br>The big surprise comes when he flips the laptop toward us and announces, \"Mama wants to watch.\" What follows is one of the more depraved scenes I've watched in some time. Jess Franco fans will be pleased by this one, trust me. Also: props to the sound design team on the disgusting foley noises that they added to this movie. Wow.<br><br>Turns out that Oliver's OCD ways are the perfect mindset to have as a serial killer, as they lend him the same ability to methodologically clean up after himself and the crime scene. Then it's back to the schedule: two pills and talking to mother by 1 PM.<br><br>The backstory for the film comes with Oliver painting a comic book for the stray cat that comes to visit him. It's a quick way to explain just how things got this far.<br><br>Oliver becomes fascinated with Sophia (Sara Malakul Lane, Kickboxer: Vengeance), who he keeps running into at the park. His interactions with her are labored and strange, but she doesn't refuse his attempts to speak with her. And she has no problem telling him all about her odd dreams. She becomes the break in his routine and puts him off his game somewhat, which may be exactly what he needs. The only thing that took me out of this movie is that she seems so far above his level that it feels like the first untrue thing in the film. That said - later scenes show that she isn't that different from Oliver, at least in how she grew up, so perhaps I judged too soon here.<br><br>I got right back into things though and loved the scene where Oliver attempts to talk out his fight with his mother within the broken mirror. It's a hard thing to build sympathy for someone who we've just watched ruthlessly snuff out a human life and then get upset about it, but that's how good the acting is here.<br><br>This movie continues to shock me with how much it pushes things. If you're easily offended, I would stay far away. If you like transgressive film and to see how someone could become a killer, this is the one for you. But wow - it's not afraid to go all the way, circle the block and then go even further.<br><br>I'm really looking forward to what Moore directs next. The scene where Sophia follows Oliver home was really well executed and the lighting and camerawork were superb. For a first effort, this is way beyond expectations.<br><br>It says a lot about a film where I genuinely care about the characters' happiness. I didn't really dig the post-credit scene at all, as I felt that I took down what was a really interesting way to finish things. Your mileage may vary. It's an interesting film - not for all, as I said before - but definitely worth checking out.","user":"BandSAboutMovies","rank":[12,23]}]