[{"title":"Excellent documentary on pre-Beatles Lennon","rating":9,"date":"4 February 2019","review":"I'm a big Beatles fan and I've seen loads of documentaries about the Beatles which rehash the same material. This isn't one of them.\nThere are several interviewees who dealt with Lennon at the time, who I've never seen on screen before and offer tantalizing little insights into what made him the way he was.\nDon't miss it.","user":"pdmanning-20710","rank":[10,11]},{"title":"Detailed & Concise Look at Lennon's Early Years","rating":7,"date":"6 August 2019","review":"I've seen a number of documentaries and movies on the Beatles and in particular John Lennon, but I would say this doc was the most detailed and concise exploration of Lennon's early years, from childhood to the beginning of the Beatles.<br><br>The film covers Lennon's early years, in Liverpool, during WWll, to his extremely unsettled family life in his formative years, to his personality in school, and eventually his venturing into writing, poetry, illustration, and, of course music. All of this would lead to the shaping of Lennon's uniqueness and unquestioned charisma.<br><br>I found it fascinating how we got a vivid account of the first time Lennon met Paul McCartney, through a mutual friend, and how McCartney, and later George Harrison were incorporated into Lennon's first band The Quarrymen.<br><br>For me, my enjoyment of the movie was marred somewhat by the lack of subtitles and with the thick British accents it was difficult for me to make everything out.\nOverall though, this doc, directed by Roger Appleton, is a most interesting look at the early years of John Lennon, whose genius and talent I've respected since I was a teenager.","user":"larrys3","rank":[2,2]},{"title":"Best Documentary on Lennons early years.","rating":10,"date":"27 July 2019","review":"This documentary toke me by surprise, I had never heard about it saw no reviews n any papers or online, if ur a fan it's a must see, none of the usual waffle u get from most docs on Lennon, this is obviously made by genuine fans and scouser, interviews wit all his childhood friends, it's a great insight to how Lennon became the genius he was, highly recommended.","user":"bowedeclan","rank":[1,1]}]