[{"title":"Addiction sucks","rating":5,"date":"10 March 2019","review":"This movie sounds interesting but is just so mediocre. The plot synopsis might sound like a horror movie, but it's a drama, could be a TV movie of the week (back when that was a thing): John's addicted, watch his life fall apart, albeit in unusual circumstances. Never mind that his addiction is a doozy that no suburban rehab is going to fix, the potentially novel setup rapidly becomes melodramatic. The story so desperately wants to say something but in the end just meanders through the paces-John not knowing what to do, his friends not helping him, and help coming from the wrong places.<br><br>This movie has decent resources-budget, cast, locations-and does so little with it. Many of the set designs were poor, the costuming was off, the characters were unbelievable because the actors had so little to work with. The poster boasts a \"special appearance by Mischa Barton\" that's nothing special; her agent must've gotten her a hell of a deal for that billing. This must've seemed like a promising project but it just never came together. It was nice to see Madeline Zima from Californication in another role, too bad it was in this.","user":"moviefansme","rank":[7,8]},{"title":"Vlad the Surgeon","rating":2,"date":"20 February 2019","review":"John Clarke is a surgeon who has a car accident which kills his son who was wearing a seat belt. John suffers a unique style of PTSD and gets shakes and pain. The only cure is to drink FRESH human blood. He meets a man who can supply him, wink wink nudge nudge.<br><br>Not a real vampire story. The plot was a bit shaky and the film was low energy. John is a very boring guy.<br><br>Guide: F-word. No sex or nudity.","user":"nogodnomasters","rank":[6,7]},{"title":"Usually I always check IMDb first and this time I didn't","rating":3,"date":"11 September 2019","review":"The trailer is more exciting than the movie. The plot that goes no where!!! Save your 90 min and watch something.","user":"MovieQween-33622","rank":[3,3]}]