[{"title":"Meh,,,","rating":5,"date":"29 March 2018","review":"I love home invasion movies so when I saw this movie and read the plot I got really excited. Let's see what makes this movie a meh one:\n<ul><li>They actually spoiled the movie in the first few minutes, there was this scene that just spoiled everything.</li><li>The three stooges who invaded the house, their acting was really bad and unconvincing at all. </li><li>The editing was not that great and distracting sometimes, </li></ul>There were really some interesting stuff here and there that makes you say 'well, that's interesting' but it wasn't explored in a new way so by the end of the movie all you can say is ''meh, seen better'' and you move on to other stuff....","user":"sam_ramzy_1991-462-897428","rank":[10,10]},{"title":"You will regret watching this..","rating":1,"date":"29 March 2018","review":"This movie sucks. Plot is weak. You can predict the end easily. A total waste of time. Don't go with other reviews. It is one of the worst movie ever made..","user":"webcityaustralia","rank":[11,13]},{"title":"Fighting execution","rating":1,"date":"26 June 2018","review":"'The Executioners' drew me into seeing it, with a cool poster/cover, an intriguing if not particularly original premise and as someone with a general appreciation for the genre. That it was low-budget, which from frequent personal experience is rarely a good sign due to that there are so many poor ones out there, made me though apprehensive as well as the low rating and poor reviews. <br><br>It is sadly however yet another film seen recently, hence some reiteration because the exact same strengths and flaws those films have are present here, that to me was incredibly disappointing considering its potential which it doesn't do anywhere near enough with. 'The Executioners' is yet another terrible films, with a plethora of problems (huge ones too). There is next to nothing to recommend.<br><br>Lets start with the sole positive. The scenery is atmospheric and spooky at times.<br><br>Unfortunately, the scenery is not done justice by the rather direct to video schlocky way it's shot and edited and the drab colour palette, so much so it was hard to appreciate it, it was very clear that the film was made in a rush with no care or enthusiasm. In particular, the camera work was a nauseous assault on the eyes with its excessive amateurish-ness. <br><br>Going on further to the negatives, the story does feel paper thin, disjointed and over-stretched and some of it feels vague, under-explained in the last third where the film especially became duller, more predictable, more senseless and less scary. Too many characters are too sketchy and with nowhere near enough to make one want to endear to them. Their annoying and illogical decision making and behaviours frustrates.<br><br>Making the film feel bland and forgettable with not enough heart put into it. The effects are ropy at best, the sound quality is extremely cheap and poorly recorded and it's best not mentioning the uniformly inept acting, especially from the home invaders, role that are also written unbelievably and disastrously.<br><br>Dialogue can be stilted and rambling, with lots of clichés and no depth whatsoever, while the pace goes to a standstill very quickly and drags on forever with very little going on worth caring about and useless padding, never recovering. Found too many the supposedly shocking moments not surprising or scary and the supposedly creepy atmosphere dreary, due to the excessive obviousness, a lot of dumb and vague moments and explanations and the lack of tension and suspense. Would not have minded the lack of originality (the film is extremely derivative and in a dumbed and watered down way) if the story and atmosphere were at least alright in execution, in reality they were both very poorly done.<br><br>A lot of 'The Executioners' has underdeveloped plot elements and often nonsensical and confusing character motivations, while too many of the things to make you jump or shocked are far from creative or scary and are pretty tame. The ending can be seen from miles away and is insultingly absurd.<br><br>There is not enough threat, and what there is of it tends to be used poorly, it is completely unimaginative and more odd than creepy, completely failing to show any sense of horror or creativity. Everything here is neither creative, suspenseful or nail-biting. Some badly sagging momentum too and the gore and such are overused and gratuitous. The direction is leaden and like their heart was not in it or ill at ease, with the chemistry between the characters and actors coming over as constantly random and aggressive with the subtlety of an axe.<br><br>Overall, awful with no redeeming value apart from an element that is difficult to appreciate with it being complemented so badly. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[5,5]}]