[{"title":"Refreshingly original and unconventional","rating":8,"date":"8 December 2017","review":"I am well versed in the story of the Room and Greg Sestero's acting journey. I think it is fantastic that he not only has kept his acting dream from being completely extinguished by his association with the mother of all bad movies The Room, but managed to write and act in a gem that will hopefully open up the doors to him that seemed closed permanently.<br><br>It is difficult to categorise this movie into a genre. It's funny, strange, scary and silly, frequently all at the same time. If you don't know much about the plot, it makes the experience far richer, the surprises are half the fun. Greg is very good, but his reluctant life partner Tommy Wiseau is, believe it or not, actually quite good as well. I have a feeling they didn't let him go full on tyrant on this set and let him run completely amok like he did back in '03. He more or less plays a version of himself, or at least similar to how Greg describes him in the disaster artist, and is a compelling guy to watch, despite looking like dawn of the dead at whatever his age is. <br><br>The production value is good. The dialogue wasn't dubbed back in. I couldn't see any green screen rooftops and the dialogue is strange at time but not exactly \"Oh Hi Mark\" strange if you get my drift. Even if you know absolutely nothing about the story of these 2 men and just watch this movie like any other, you will still probably enjoy it. It's never boring or repetitive. In short, it looks pretty darn good.<br><br>If you really are sick of movies, even the good ones, that follow a very recognisable formula and want something truly unique and unpredictable then this is for you. It left me scratching my head, wondering exactly what it was. That is the highest compliment I can pay to a movie. In the words of harmony Korine \"Please just give me something different.\"<br><br>Best Friends is about as different as Transformers is the same.","user":"jackcwelch23","rank":[41,47]},{"title":"2 words: masterpiece","rating":10,"date":"9 September 2017","review":"Right from the first scene I knew this would go down as an all-time classic. From the beautiful cinematography, to the fantastic acting, this film has best picture written all over it. I really believed that Tommy Wiseau was someone who worked with dead bodies, and it seems like he may have done some method acting for the part. Of course this is just speculation, but the fact is the chemistry between Greg Sestero and Tommy Wiseau was electric, truly reminiscent of their previous film. And the writing by Greg was excellent. I wouldn't be surprised if Tommy gave him some tips. To quote Johnny from Wiseau's previous film, The Room (2003), \"Haha, what a story Mark.\" In conclusion, the results are in and this film definitely does not have breast cancer. 10/10","user":"nicholasamaxam","rank":[67,85]},{"title":"An Unusual Masterpiece","rating":9,"date":"7 September 2017","review":"This film is nuts. It starts off slowly. Jon (played by Greg \"O hai Mark\" Sestero) is a drifter who stumbles upon Harvey (Tommy \"I'm fed up with this wurld\" Wiseau). Harvey gives him a job for a day. The next day Jon comes back to Harvey for a full-time job. Little does Harvey know that Jon is going to betray him by selling bags of Harvey's gold teeth. What a story Mark (I mean Jon).<br><br>I saw the UK premiere of the extended cut and the audience was going crazy. There were a few references to The Room and whenever they happened the audience applauded with frenzy. It's not The Room, and I'm not going to compare them as others will do this. I will say that if you want an entirely unique viewing experience which will make you laugh at the poor/legendary acting and scratch your head with bewilderment, this is the film. <br><br>Best Friends is very good, and it is very bad, so it's impossible to give it a legitimate score with the usual ranking system. As stupid as this sounds, it's true, so I'll be interested how critics approach Best Friends on it's release. <br><br>The 9/10 is for the experience I had while watching it. It really is awesome to see Tommy and Greg acting again opposite each other, so this should not be missed.","user":"tom245-32-153383","rank":[34,48]}]