[{"title":"This was just awfu!","rating":3,"date":"28 October 2018","review":"I watched this because I hoped it had something to do with Kentucky, it doesn't. It could have been placed anywhere in the world and would have been just at terrible.<br><br>The cast never gets you attached to any of them, and I didn't care what happened to them at all. You get an explanation for 1 of them eventually, but he has made so many stupid choices by then it was beyond redemption.<br><br>These people just didn't make rational decisions. For example, after being covered with blood and agreeing to clean it up, they continue to walk around in the woods for hours without changing their blood splattered clothes. I can understand if they didn't have more cloths, but they clearly have fresh clothes on a line.<br><br>Overall the characters weren't relatable and didn't interest me. I'm extremely disappointed. There were 4 people in my theatre, and I know exactly why!","user":"tyrionisthecat","rank":[33,43]},{"title":"Well.. it was a movie.","rating":2,"date":"29 October 2018","review":"I'm from Evansville, heard there were some scenes filmed locally and that it was good from relatives of the crew. I went into it knowing it was a thriller. What I did not know was that this movie would be a train wreck. I'm sorry. I tried to enjoy it. But the characters were awful. Awful decisions. The ending.. if you can call it that.. didn't make much sense either. You got my wife and my 20 bucks. Good luck next time I guess. I'll probably pass.","user":"liggitystick","rank":[28,38]},{"title":"An Honest Review","rating":10,"date":"7 July 2019","review":"It's not a great movie, but it is a fun, entertaining, and trope filled Indie movie. It's the kind of flick that you would expect to come out of the indie craze from the 90s with all the appropriate (if not predictable just for the genre) twists and turns along the way.<br><br>It's not a bad film, I think the problem is that it's 2019 and the audience for a movie like this has aged a lot. It's not the action extravaganza that explodes with over-the-top special effects and, I'm pretty sure that hurt it.<br><br>It's stylistic enough to be fun. It's period enough to be fun. The acting isn't bad. The plot is typical indie bloodbath, and the movie plays out exactly how you would expect.<br><br>It's not as bad a film as people are making it out to be and, if you take it for what it is, it's a good film for the genre.","user":"generationofswine","rank":[7,8]}]