[{"title":"Absurd portrayal","rating":18,"date":"18 August 2019","review":"Let me preface my remarks by noting I served three tours in Afghanistan during OEF. I saw Kill Team while visiting my sister who was in grad in Venice last spring.\nAnyone who has studied the history of crimes committed during war knows there are two general types: a) cases of systematic crimes and b) events of a crime.<br><br>These are two very different phenomena. \"a\" comprises things like Nazi systematical crimes; Japanese systematic war crimes in China, Korea, Philippines,; ISIL/ISIS crimes; systemic crimes by Al Queda and the Taliban in Afghanistan including intentional stoning,burning of thousands of women and intentional mass murder of tens of thousands of villagers; mass murder in the post Yugoslav wars etc.<br><br>This is in deep contrast to isolated case of crim e that occur in EVERY, war, eg murder by Australians soldiers in WWII, direct murder of civilians by Union troops in the US Civil war, murder by British soldiers in initial occupied Germany, etc. The latter set do not generally characterize the conduct of the good guys, nor make the war against slavery or against Nazism or against Japaneses fascism, illegitimate wars.<br><br>At this point here is another IMDB user review, dated August 5 that is deeply ignorant and itself biased. It states the film represents \"what America is, does, and stands for declining rapidly into harsh reality\" and that it \"shows us Americans the truths that we might not be willing to face, and it also show us the pent-up toxic masculinity and murky grey areas that come with our Army being stationed in hostile areas for long amounts of time.\"<br><br>That is simply not true. This is a case of an OUTLIER sociopath, who for a very short period of time, held non commissioned officer command over a small unit at a forward base and committed a first degree murder of three none combatants. He was fully prosecuted, conflicted and sentences to three life terms and is in prison and not getting out. The young solders in his command received long sentences as well for abetting him and obeying unlawful orders. There was no coverup, there was wide-scale REVULSION within the US Army at these murders -- and full prosecution.<br><br>Really the fact that this film is being pitched, and as a result, seen, as emblematic of the war is itself, is itself a crime. Since that is a baldfaced lie, it destroys the utility of the understanding the event and how we have to take care to insure that such events do not occur.<br><br>I spent four plus years in Afghanistan. We fought heavily armed personnel who were murdering teachers, we fought against forces that were going through villages and murdering parents who let their daughters become literate, and murdering people who played non religious music. We fought against Al Qaeda forces who were given free reign by Taliban -- both AQ and Taliban committed to putting Afghanistan into the dark ages, and exporting that as well. The vast majority of the people, in the cities and the countryside were deeply victimized by the forces we fought against.<br><br>We were not motivated by racism, \"toxic masculinity' or any other such BS imagined by filmmakers and actors who never walked in our shoes.\nThis filmmaker already botched the documentary he did a couple of years ago. It started out fine in examining the crime, and then went of into exposition and extrapolation not supported by the facts. this new \"dramatized\" version is even worse.<br><br>By the way I also had to see scores of basic and cringeworthy factual mistakes in procedure, uniforms, equipment and standard military interaction in this film. That is not my main critique, but it is also telling in that it shows that no adviser with military background was used.","user":"random-70778","rank":[232,303]},{"title":"\"Absurd portrayal\"-guy didn't even watch the film. Film hits too close to home.","rating":8,"date":"19 December 2019","review":"\"Let me preface my remarks by noting I served three tours in Afghanistan during OEF. I saw Kill Team while visiting my sister who was in grad in Venice last spring. ...\" (random-70778 on 18 Aug 2019)\nNopers, it did not screen \"last spring\" in Venice Film Festival as this guy wants us to believe. The films world premiere was in Tribeca, late April 2019. Venice is in fall, not in spring and after Tribeca, it wasn't even released until way after his review (namely in October 2019). So, what else is he making up? Does he have a sister? Maybe. Was she a grad or ever in Venice? Who knows. Did he ever wear a uniform while actually being part of a military body? Just as likely as not. I've seen my fair share of pretenders, online and even on the streets, to be somewhat vary of people who claim a soldiers expertise in order to make a political point (or some other scam). It seems imdb has become just another platform that has fallen victim to ideology-driven \"reviews.\"<br><br>Alas, you just gotta love the irony in this specific case. One important question of the film is that of the bystander, the one who didn't commit a crime and the circumstances that make the simple act, otherwise known as \"calling the cops\", an act of courage for some, an act of treason for others. Examples of such circumstances are not limited to the military, but in the case of the film, they are. The overreaction in some of the \"reviews\" (or fake reviews) shows this in a brilliant way: not the criminal or crime is the focus for enragement for the ideologically motivated, but the one who calls it out. This of course speaks for a certain understanding that the crime, in fact, is a crime. Yet, this horrible crime should be something we should not care about. Again this bears the question if when speaking about ISIS/Daesh crimes, those people even bother about the horrid crimes they commit or if they're somewhat happy to found an opposing criminal, who can become the all-explaining excuse for commiting crimes themselves.<br><br>The reason the films hit too close to home is not the psychopathic killer that Alex Skarsgård performs in an outrageously convincing way or the (moral) dilemma of Nat Wolff, but exactly because of the peer pressure of the other bystanders. True psychopaths are pretty rare, even in professions with higher than average concentration (lawyers, ceos, soldiers) and the film does well in not trying to imply Sgt. Deeks would be the everyday case. It painfully shows that the damage a single monster in a position of power can inflict, is the result of willing bystanders. This is what makes the film partly painful to watch. The atmosphere of aggression and the expectation to accept rather than report crimes, is much more common than the murderous psychopat and showing this makes the film as painful as necessary.<br><br>It reminds us that standing up against evil is often so very hard, because normal people doing nothing and expecting you to do the same, is the most dangerous form of evil.<br><br>Watch it, it's surely entertaining, but it's not another hurray-war type of pseudo-warmovie.","user":"patriotreview","rank":[25,29]},{"title":"To be a whistleblower or not","rating":8,"date":"26 October 2019","review":"Well worth watching. This is a sparse effective but sometimes hard to follow movie about the murder of innocent Afghan civilians.<br><br>Alexander Skarsgård is making a name playing villains from BLL to this. His soft spoken menacing soldier is memorable. Nat Wolff looks a bit too clean cut and intellectual type to be the type of person who would enlist. His dilemma is well portrayed and the fact he didn't whistleblow is all the more tragic and realistic.<br><br>This movie is short. Wish there'd had been more story shown. Some of the events aren't easy to follow like what led to the exposure. Knowing the facts of the true story helps. The actual atrocities are clearly and effectively shown. Probably some of the more effective scenes of war crimes since Vietnam war movies.<br><br>A brave movie to make considering not a lot of people want to see this for entertainment.","user":"phd_travel","rank":[22,36]}]