[{"title":"Powerful doc dedicated to the power of the people.","rating":11,"date":"11 September 2017","review":"\"A riot is the language of the unheard.\" chapter heading <br><br>Having never participated in a protest, much less a riot, I felt I had done both after experiencing directors Sabaah Folay and Damon Davis's Whose Streets? Their documentary about Ferguson, Missouri, and the death of Mike Brown in 2014 is an unremittingly real and passionate participant point of view that celebrates the will of an oppressed people to be heard.<br><br>Whose Streets? documents the thoughts and actions of the largely black population as they experience the white-cop brutality of Ferguson and St. Louis police forces, culminating in Mike Brown's being shot 8 times by an officer who justifies the assassination with his fear. The grand jury believed he was faultless, leading to disbelief and riots reminiscent of the reaction to Rodney King's killers' exoneration.<br><br>The doc is especially effective bringing home the pain with portraits of such sufferers as Brittany Ferrell, a comely and articulate young lesbian who is not afraid to speak her outrage. We see her at home with her children and on the street with the microphone chanting the will to fight to be free, an anthem echoed by virtually everyone facing down the daunting police and national guard forces.<br><br>The street's-eye view happens largely because cell phones recorded the abuse with a probing expertise heretofore only the province of professional filmmakers. But not today, when those little devices are adjuncts to the spirit of justice, albeit not always enough to bring convictions. David Whitt, a Copwatch citizen videographer, meticulously records and publishes images that damn the militaristic response, for the film's expert doc makers put them together to devastatingly powerful effect.<br><br>Although white cop Darren Wilson, 28, had Brown in his sights after Brown allegedly robbed a convenience store, Brown should not have died for the crime nor should his body have lain in the street for hours while the community and security reacted. However, most of the forensic evidence and testimony proved that Wilson acted in self defense.<br><br>If there can be a criticism of this doc, it would be that the evidence finally exonerating Wilson is not presented; he remains guilty in the spirit of the film if not the reality. Although the filmmakers could claim an interest only in the people's plight and reactions, full disclosure for me requires that I also see where the police can be at least partially exonerated.<br><br>Justice both civil and spiritual is elusive. Whose Streets? is an estimable rendition of a disadvantaged populace struggling to be heard.","user":"jdesando","rank":[33,53]},{"title":"There must have been a white nationalist viewing party recently...","rating":10,"date":"18 November 2017","review":"I came here to read about and review this documentary after viewing. I was so moved by it that I am leaving my first review of anything. <br><br>Then I read the last two reviews, both posted on November 16, 2017. Neither are reviews of the documentary but attacks on Mike Brown. I won't get into how I grew up within 10 miles in of Ferguson or about how I've lived in St. Louis for 50. How I know that, even though I'm a white woman, racism is alive and well in St. Louis. This documentary was a very accurate portrayal of what the reality is for black people (and other POC) in St. Louis. I've witnessed it over and over again. <br><br>The documentary was very well done. It was straight forward and real. Everybody should watch it.","user":"bobina_sm","rank":[34,57]},{"title":"Solid film.","rating":10,"date":"14 August 2017","review":"Really shows the perspective of some local activists living in Ferguson of what the Mike Brown protests were all about. There is not huge detail into the Mike Brown shooting. It's more about raw footage of street protests, police reactions, some town halls, and so on. It really shows how the protesters were not armed and were faced with a much more weaponized police response. The police clearly are not a part of the community and one wonders why the officers appear so alien from the people they are policing. The police are portrayed as a failed institution. There are some brief news clips interspersed in. Most of it is just amateur video on the streets. There is a glimpse into the personal life of some of the activists. <br><br>At one point, one of the activists said that you can burn down a convenience store yet it can be rebuilt, however all the magicians in the world can't bring back a dead person. Therefore, the real question of violence should be: was anyone hurt? This encapsulates the overall theme of the documentary which is that people come before everything. Clearly the Mike Brown killing became a rallying point but he was also a symbol for much deeper grievances, which is the community didn't feel the police force treated them as people. You won't hear much from the other side in this documentary but it doesn't pretend to be that.","user":"BeetJuice","rank":[33,66]}]