[{"title":"Violent, tensed n the amazing daylight settings.","rating":7,"date":"26 May 2018","review":"Saw this recently on a dvd.\nBeen keeping a track of Kitamura's work after having enjoyed his Midnight meat train n No one lives.\nThe best part about this film is the daylight-soaked settings. Most of the action takes place under the scorching sun. There is no hand held camera stuff n even the night scenes were well shot.\nAnother good thing is that the film doesnt waste time n the thrill starts within minutes.\nHas shades of the awful Carnage Park n also of Roadside n Phonebooth.\nThe violence is excessive, there is solid tension n the editing top notch. The shoot-outs r brutal.\nIt falls into the category of edge of the seat thriller. Not even for a sec I paused the film.","user":"Fella_shibby","rank":[49,67]},{"title":"I don't care what other people say...I enjoyed watching this movie","rating":7,"date":"13 July 2018","review":"First off, it's a low budget movie with some seriously cheesy acting. That being said, I really liked it for what it is. It's suspenseful, intense, bloody, and original. Like almost horror flicks, some of the characters make some very frustrating and stupid decisions, and it can be kind of predictable. But it is fun, in a bunch of people getting sniped off kind of way. Honestly, if this movie had a larger budget and perhaps some better actors, it would have probably been a hit. As is, it is still better than a lot of horror movies that Hollywood is pushing out. If you can look past it's obvious flaws, you will probably like this one.","user":"mikedegroot","rank":[24,33]},{"title":"Good, tense thriller.","rating":7,"date":"15 July 2018","review":"Mysterious sniper tracks people at the roadside.<br><br>Good, tense suspense thriller. Yes, the acting is mid-range (I've seen far worse believe me), and the script won't win any Oscars, but the simple plot holds the attention throughout. <br><br>Quite violent at times (the people who are shot don't just fall over with strawberry jam on their shirts). <br><br>Whereas the characters aren't particularly threshed out, you get enough to justify their actions.<br><br>The ending is particularly unexpected, and also ambiguous but I'd advise checking it out. Without adding spoilers, the fate of the main characters isn't what you'd expect either, which adds to the fun.<br><br>Overall, drama, violence, tension and suspense supplied in abundance. Also good fun.<br><br>It reminds me of The Belko Experiment, Towerblock &amp; You're Next, but with little padding. If you like those films this one is recommended.<br><br>Animal action involves some wasps on a body, and a wolf and some crows who all disappear at the first sign of trouble.","user":"roscoe666","rank":[12,16]}]