[{"title":"im glad the toddler era is over","rating":8,"date":"6 March 2019","review":"I think a lot of grown ups that has decided to break and make a child, never could fantasise the burden and fatigue bringing up a child can be. the film is the a-z indeks of worn out parents.<br><br>the acting are spot on and very realistic, and the production are darn good and very intennse on the chill factor. whats intruding the house, i shall not spoil for you, but its proper planning and very well sorted out in the plot.<br><br>so beware the shadows, pest mask and broken water heaters, they are all indirect clues to the viewer. how the twist are revealed is tragic but true and may happen to everyone, because the alarm bell rings more than twice.<br><br>youre not a fool if you dont understand this film, but when getting the key youll set things in retrospective view, its brilliant filmaking. the grumpy old man recommends this film.","user":"ops-52535","rank":[16,30]},{"title":"Makes you work for it, but I thought it was worth it","rating":14,"date":"14 March 2019","review":"First off, if you're thinking about whether to watch this tonight, ask yourself are you in the mood to sit up and try and puzzle a story out or do you feel like vegging out and being entertained. If it's the latter, then skip this for now. Because this film doesn't spell it out, you have to work for it. The characters are having a hard time understanding what's happening, and I get the feeling the film wants you to as well. You shouldn't trust your eyes any more than they should. They do and say things that don't make sense at the time, but the good thing is it all becomes clear in the end.<br><br>It reminds me a little of a Black Mirror episode - not in the subject matter, or even the level of polish (don't get me wrong, this is a very low budget unpolished film) - but in the way it drops you into the scenario and doesn't hold your hand or feel the need to explain things, and yet there are clues along the way that are not really there for you to use at the time, but to look back on.<br><br>Is it scary? No not really. A few jumpy moments, but they're not particularly memorable. What it's more about is this weird feeling of unease that it just drips with, like something is wrong in there. And it bears mentioning that it's slooow in places, which is part of what gives it that atmosphere.<br><br>Without a doubt it could have done with a bit more budget, but I can overlook that and in the end I'm glad I gave it a chance and watched it.","user":"k9line","rank":[10,18]},{"title":"Breathtaking in a different way!!!","rating":10,"date":"24 September 2019","review":"If someone expects a classic horror movie, he is mabye wrong here. But if he is willing to get involved in this film, it will cut him off. This movie is a very special suspense story hidden under the cover of an intimate chamber play. What looks like a story of young parents with the mother in postnatale psychosis in the first place, changes slowly to a inexplicable threat. Clever and small placed twists are buidling up the situation bit by bit to a very special thrill. A thrill that creeps slowly up your spine, since nothing in this film is obvious. And along with all that - very surprising and very well done - with humorous moments.\nI liked it a lot and I am happy that I found this great film.","user":"axel-b-steinmueller-863-226117","rank":[3,5]}]