[{"title":"Worth Watching","rating":8,"date":"13 November 2018","review":"Worth watching. \"Making of a Killing\" is twisted tale of intrigue based on a real-life small town murder mystery. Christopher Lloyd plays an aging sex-offender who gets released from jail and returns to find out the town's mayor has double-crossed him. Hats off to Director Devin Hume for capturing this engaging story-line of why some small-town secrets are better left buried.","user":"chickyhawkins","rank":[5,5]},{"title":"Decent directing, but the terrible writing failed this true story","rating":6,"date":"29 August 2018","review":"Novice Devin Hume did a fairly decent job directing his first full length film, but failed miserably in the screenplay. <br><br>It was a hack job focused on the wrong narratives, with unnecessary scenes - or ones just thrown in without reason or explanation. There were too many plot issues, and the focus was too much about the brother's personalities, instead more of their past, their motives, and their plans going forward. There was too much slack in the screenplay, and some dialogue was just out of place. It left me unsatisfied in what this film was wanting to portray, and the story it was trying to tell. I still don't know who the killer was or why the two called themselves brothers.<br><br>The cast felt like they were bored, with the exception of Michael Jai White and Christopher Lloyd who were the only ones that seemed excited to perform their roles and were great in doing so. Mike Starr and Jude Moran were too monotonic and bland, but that could have been the inexperience of Hume not directing his cast properly. <br><br>The pacing was so ridiculously slow, I wanted to fast forward many scenes. The overly long 106 min needed some major cutting and editing to bring this film down to a comfortable 80-90 mins.<br><br>It's a shame this true story wasn't told better. I enjoyed reading the news articles more than watching this film, they were way more informative. They also made me wonder why Hume had to change some of the real facts with movie fiction, especially when he actually personally knew the two \"brothers\" in real life.<br><br>A very generous 6/10 from me.","user":"TheTopDawgCritic","rank":[9,12]},{"title":"THE TRUTH BEHIND IT ALL","rating":6,"date":"10 November 2018","review":"This movie was based on true story about my uncle CHARLES GIEBLER, HIM and Tony Wright owned a funeral home in Florence clorodao, plus owned a bakery and a guitar shop, my uncle was big in the community he was the mayor, the priest plus worked with boy scouts, WHAT PPL MAY NOT KNOW, they where not brother they where guy lovers been together for 24 yrs, it shocked my whole family when we found out about what him and Tony did, fact when my uncle died the urn was sent back to Ga to my nanny which is he's mother JOYCE THIGPEN, facts are there if you don't BELIEVE me Google what is the movie making a killing, true story about, than Google Charles giebler obituary","user":"allenholloway","rank":[5,7]}]