[{"title":"Bullying has no age.","rating":6,"date":"25 December 2018","review":"Let's just start by saying that Pin Cushion isn't a happy movie. You won't have a good feeling after watching it. Or you must be a bully yourself and you have no clue what for a lowlife you are yourself. The story is about bullying, about not fitting in. There is the bullying of a young innocent girl that does her best trying to fit in, and there is the bullying by adults towards a woman that looks differently. The acting is good as well as the filming. The story is worth watching, but just don't expect some kind of justice or feelgood moment as it is a sad movie.","user":"deloudelouvain","rank":[7,7]},{"title":"A hidden gem","rating":8,"date":"20 October 2018","review":"Pin Cushion. For a change I'd not read any reviews. Didn't even know it was British. All I knew was that it was about a relationship about a mother and daughter. I didn't know it would be an intensely bleak tragi-comedy / psychological thriller / dark social realist drama with fantastical overtures. A jaw droppingly intense study of the effects of loneliness and bullying. It was Carrie without the supernatural but with the girl with long red hair and strange mother. I was an emotional wreck at the end. 8.5 out of ten. Highly recommended.","user":"michael-kerrigan-526-124974","rank":[10,11]},{"title":"First full length feature for a new writer/director Deborah Haywood.","rating":10,"date":"19 August 2018","review":"A true life fairy tale that explores what so many people experience, the odd couple in a new town wanting desperately to make friends and become accepted, but find themselves lured by the wicked side of those around them to do things they think they must do and the consequences that human beings can lead others into when they enjoy making them unhappy rather than choosing love and the unhappiness and and truths that this brings home. Remarkable debut for someone who had never directed on this scale before and a thought provoking movie everyone should see, especially parents and schoolchildren.","user":"lesgrice","rank":[10,11]}]