[{"title":"hilarious account of early 1990s China","rating":10,"date":"9 October 2017","review":"Saw this movie yesterday (it was screened in London as an entry in the Longon Film Festival). It's hilarious, so I hope it becomes available to a wider audience soon - most probably in digital format as the director said during the Q&amp;A. The exchanges between Big Wong and his son Little Wong are priceless, but the rest of the cast are spot on as well.","user":"mtemelkov","rank":[5,5]},{"title":"A Like of Cinema","rating":6,"date":"14 October 2017","review":"Even in their own words, it is strange for a Chinese film to have an Australian writer-director and Canadian producer; one they even state is very much of a certain era in Beijing life. But as both were raised in China in the Eighties and Nineties, the informed outsiders may be able to take a more objective look of an era now most-likely lost.<br><br>Maybe not so much nowadays, but we've all been offered a pirate DVD in a pub. And that's the basic premise of \"King of Peking\": a father- son duo of Big Wong and Little Wong who create pirate copies of cinema classics to sell on street corners. Cinephile Big Wong lives with his son after the breakdown off his marriage. Showing films of improvised cinema screens on the street, Big Wong has his son working in every role in film, other than the role left or Big Wong: that of projectionist. <br><br>But soon with their equipment damaged, refunds offered and complaints about wasting money on watching old films they can see on video, the pair lose their market. Big Wong, wanting to still pursue his dream takes a role as a live-in janitor of a local cinema, Little Wong following him there. But without his ex-wife's blessing, she demands custody of the child or huge maintenance payments. Not wanting to lose his business partner, he opts for the latter, but needs to find a way of raising such a large amount of money. Working at a cinema, and fuelled by the seed of home entertainment planted by a disgruntled punter, Big Wong turns to video piracy. <br><br>Finding a test model of a DVD recorder in a second-hand shop, he enquires as to where it came from. An abandoned Japanese factory is the answer, which he soon locates, finding a mother-load of the same test model. Setting up a video camera in the cinema where he works, he makes multiple copies of each film shown there, his business partner making covers for the finished product and helping out with dubbing new soundtracks. <br><br>Making enough to keep his son and pay his ex-wife, all seems rosy, but his son is unhappy at the constant work and abuse from his father, using him for his own interests. Running away to his mother, he soon loses his business and son's respect, as well as his job, having been found-out. <br><br>Making a film you hope to make money out of about piracy is always going to be interesting as to the moral standpoint. And similar to Michel Gondry's \"Be Kind Rewind\" we a treated to a light-hearted look at film piracy, showing those making the copies are earnest film fans doing it for the love of cinema...and a little bit of money on the side to help them solve a problem. As such, we are forced to root for the pirates: supposedly the killers of the film industry (not multi-millionaire Hollywood producers). The comedy in making the pirate copies is inventive and charming, supposedly done for the right reasons. <br><br>And much like the pirate copies they make, Sam Voutas' film has its charms and entertains. Though more perhaps could be done here. While the shot of Big Wong wrapping an entire film reel around his body is clever, being a comedy, this feels rather light, when it could be made more cinematic and demonstrate the reasons why people love film in the first place. Little detail and back story is given to the break-up of Big Wong's marriage and to how things were before the camera starts rolling, and so his place as a good or bad father and man is left ambiguous.<br><br>Though despite lacking in more depth, the script has enough humour within it to maintain the film as a well-worked piece, helped by good cinematography and good performances from the two leads. But with a limited filmography as a director himself, Voutas' film comes across more as the work of someone who likes cinema very much, but perhaps lacks the depth of the true love of the cinephile. <br><br>politic1983.blogspot.co.uk","user":"politic1983","rank":[2,3]},{"title":"Sweet story, told in a nostalgic way. Very charming.","rating":8,"date":"8 May 2019","review":"This film echoed parts of Cinema Paradiso. Growing up around films and cinema in a space and time where it feels like nothing else matters. Nicely styled and visually tight with the occasional very special shot included, this film tells a sweet story of a man trying to hold on to custody of his son. Very nostalgic, very recognisable relationship writing and also very Beijing. To anyone who knows the culture, you will get a lot out of this film, to anyone who doesn't, you may see a more human 1990's Beijing than often portrayed.","user":"gulihere","rank":[0,0]}]