[{"title":"Fricking Awesome !","rating":9,"date":"13 July 2017","review":"I must say i was skeptical about seeing Stands in the live-action but it was beyond awesome, Takashi Miike did an amazing job portraying every characters as well as their Stands.<br><br>The other thing my cousin and I worried about was rushing the intro and story of Yoshikage Kira, who honestly is one of the best villain in the anime.<br><br>I can gladly say without revealing too much that Part 1 only goes as far as the showdown between Josuke Higashikata (Crazy Diamond) and the brothers Keicho Nijimura (Bad Company) &amp; Okuyasu Nijimura (The Hand).<br><br>The ending was the only thing that made me give a 9/10 as they changed something that does not make much sense as they skip a villain to introduce another one which had no motive to do what he did.<br><br>People were cheering like crazy at Fantasia 2017 Montreal and I for one cannot wait for Part 2.","user":"NovakGrey","rank":[24,34]},{"title":"feel slow.passable cinematography.terrible soundtrack and soundscape.","rating":6,"date":"28 February 2019","review":"Feel under budget and poorly post edited.\nvery disappointed at a missed opportunity of a great franchise.\nsure , some scene and characters were like the animation but too many uninspired long shot that make me thing this should have been trim 30 min.\nthey really screw up the ambience with the quasi non existent soundtrack.\nthis movie need to be recut, amplified the mood, maybe even re color the film stock.\nThis is my most severe critic to date . lazy Miike care of final products or post producing cost cut by studio.","user":"surfisfun","rank":[5,6]},{"title":"Best manga-anime movie adaptation yet","rating":10,"date":"28 June 2018","review":"Faithful to the source material, great use of cgi, amazing costumes and locations. Even the haircuts brought to life with such a way i would never have thought it could work in a live action film. Great action and pacing. Miike and his cast along with the whole crew really brought Diamond is Unbreakable to life. Well done.","user":"george-290-212204","rank":[9,15]}]