[{"title":"Cross, this off your list","rating":2,"date":"23 November 2019","review":"Well, I never knew that there was a school where you learn how not to act, this film is full of those actors that graduated from said school. Kudos to Patrick Durham for giving it a crack, that is where they stop. Personally, I think that he needs to go back and learn what it means to direct. Maybe Durham should have watched a few episodes of Charmed to help. I do not like to be too negative, but when people put their faith in the writer and director of a movie, I am sure they want something to work with and have a director that does not encourage wooden performances. You get two stars, 1 for the background workers and the other for giving it a crack.","user":"staunton-gary","rank":[9,12]},{"title":"Cross, Kronos, Red","rating":1,"date":"12 November 2019","review":"The production starts out by using cartoon drawings to introduce the characters and the back story. This takes 5 minutes. It is followed by a 5-minute shoot out that gets boring after 1 minute. Later fighting uses amulets and the rules that govern them appear to be made up as they go along. In spite of having a \"B\" film star-studded cast of action figures, the acting and script were amateur. It was painful to watch. And BTW plutonium is not kept at \"secret\" government buildings in downtown LA. You could not be able to or want to load enough plutonium to make a bomb in one room. In that regard, Patrick Durham is an idiot.<br><br>Guide: F-word. No sex or nudity.","user":"nogodnomasters","rank":[7,11]},{"title":"THIRD TIME IS NOT A CHARM","rating":2,"date":"17 December 2019","review":"I watched this film trying to remember if I'd seen the first two in the series. I know I saw one but it left such an impression on me that I forgot it within minutes of the end credits. If I hadn't written about this one soon after watching the odds of that happening twice would be good. Chances are within a week I'll have forgotten this one too.<br><br>If you haven't seen any of the films Brian Austin Green of BEVERLY HILLS 90120 fame stars as Callan, a futuristic hero who gains power from an ancient Celtic Cross who saves the planet from world dominating bad guys with the help of his equally heroic teammates. Having done so in the first film and then repeated the same in the second, we now have a third film.<br><br>As a group of game players gathers behind the locked doors of a comic book shop, they play a game that finds them helping Cross and his team. This makes for a strange set of circumstances as you're never quite sure if the game is a game or reality. By the end of the film it gets even more confusing as game members are pulled into the comic universe to help save the world but left with a cliffhanger ending.<br><br>This time around Cross and his team are pitted against super villains Muerte (Danny Trejo) and Drago (Manu Intiraymi). In their secret hideout Muerte plans on robbing Cross of his powers while elevating Drago with a cross of his own. So dire are the consequences that Cross must resort to asking for aid from previous villain Gunnar (Vinnie Jones).<br><br>I honestly can't write a whole lot more about this film. Made for the direct-to-disc market it stinks even for that group. The effects are some of the worst you will ever find and include things like the flashes seen from every gun that it fired in the film. How can you make a movie without a big enough budget for blanks? Explosions are the same with debris and launch pads used for the stunt people as they fly in the air surrounded by completely fake looking CGI explosions.<br><br>The acting is...well...it's...terrible. I love Danny Trejo and he can even make commercials where he does better than this. To say his part is phoned in is an understatement. The odds are he was paid great money to sit on a chair on one set looking at a laptop while laughing maniacally. That's about all his character is required to do here.<br><br>At 100 minutes this movie is 100 minutes too long. To think that it sets it up for a part 4 is just mind numbing. It makes you wonder how movies like this get made while knowing there are far better pictures in development hell.<br><br>I'm guessing they were hoping to tap into the super-hero market that is out there but this one makes those early Marvel films that people joke about look like they were Oscar contenders.","user":"kirbylee70-599-526179","rank":[3,4]}]