[{"title":"Has some nice teeth, but shows them too infrequently – even if the rest is still amusing (SPOILERS)","rating":1,"date":"1 July 2017","review":"Those coming into this third outing of The Trip should not be shocked to learn that the series is not changing directions at this point. If anything it seems to be entirely content with its base elements and keeps doing them. The good news though is that it does them a bit more than before. On the surface this means that the food and locations look even better and the show continues to take plenty of time over them. Personally though what I liked was that the more barbed content was pushed to be more than just brief moments of sad looks or moments alone for the characters.<br><br>There seems to be more teeth and edge to this season, and I liked that the riffed digs and remarks tended to be closer to the mark and has some weight to them. Likewise the moments of reflection for the two leads seemed more genuine – and it connected into their discussions whether it be the shared experience of aging, or the attempts to be more than they are perceived to be. I imagine that their characters are far from their real selves, but at the same time a lot of it seemed convincing and engaged me more for it.<br><br>The riffing and joking will not be to everyone's taste, but I enjoyed the gentle tone of it. The impressions are a bit more balanced out with other material, and there were only a few bits that I felt it could have done with less of (the guessing the bill bit for instance – although on repeat it does at least get used to reveal tension). Coogan and Brydon are both on good form, and they carry the season as normal. The loose plot is engaging enough to do the job – although I have no clue what sort of an ending that was meant to be (Coogan out of petrol, confronted by what appears to be ISIS). It was out of nowhere and just weird.<br><br>Mostly this Trip has the same flaws and strengths as the ones before. There are things I think it does better, but generally if you liked the others or not, the outcome will be the same here.]","user":"bob the moo","rank":[10,12]},{"title":"The Trip to Spain - anything to gain?","rating":6,"date":"14 December 2017","review":"As is the case with the previously released trips ('The Trip', 2010 and 'The Trip to Italy', 2014) with Steve Coogan and Rob Brydon, so it is with 'The Trip to Spain' that it does not really play out as a film but rather an extended TV show. Which it is. Although actually shortened and combined from the six episodes of the last (third) series. <br><br>What kind of show exactly is 'The Trip' itself, is quite difficult to determine because although the trips are partly to do with reviewing food, a minuscule amount of comments made on the subject actually reach the viewer. Same is with visiting different locations, though at least in that aspect there are small bits of useful information pointed out every now and again. Though it's hardly ever an extensive introduction to the place visited. It's not a documentary even though it might come across as such. Calling it a talk show wouldn't be quite right either. In a way it is a different version of 'Top Gear' with just as beautiful camera work but less information and unfortunately - as it is listed under comedy - jokes. <br><br>Steve and Rob get on with their usual antics which obviously include a lot of impressions, but it gets old at some point and I truly don't want the hear either of them say: \"I told you to blow the bloody doors off\" and then try to settle on the age of the voice etc. It's the constant competition between the two who's better at impressions which includes mimicking mainly just one sentence over and over and over and over and over and over again. Which brings me the horrific flashbacks from watching 'Dude Where's My Car' as a teen and not being amused. However, I can respect, accept and enjoy repetition (British comic Stuart Lee is a great example), but it has to serve a purpose. At the moment were not watching a film, ahem, TV show. We're watching to guys rehearsing for it. Despite that I'm not calling the show unfunny. No, far from it. 'The Trip to Spain' is still humorous. Just not necessarily laughing out loud funny. It has it's better moments though. <br><br>So basically, if you've enjoyed the previous films or TV series, you can probably appreciate this one as well, if not, then there's nothing that will convince you otherwise. It has its entertainment value but not for everyone. If I had enough money to go out for even one meal like in the film with a friend, I would've done that instead and had much more fun. But on the other hand perhaps wouldn't have learned all I know about the invasion of Spain by Roger Moors.","user":"Grumphy","rank":[9,12]},{"title":"Some Grins But No LOLs","rating":8,"date":"6 September 2017","review":"Good but not great, this movie had me smiling throughout at the lighthearted banter, which was apparently mostly unscripted.<br><br>The movie follows two friends traveling through Spain so that one of them can write a series of restaurant reviews. <br><br>The focus is on their dialogue while they visit some tourist sights or sit in restaurants. There is not much of a story, and overall the film comes across more like a travel documentary rather than a movie.<br><br>The dialogue mostly covers food, Spanish history, and being middle aged. Most of the humor comes from the friends taking mild jabs at each other, and their impressions of mostly British celebrities such as Michael Caine, Sean Connery, Mick Jagger and Roger Moore. (There are many James Bond references.) <br><br>Overall, the formula is entertaining but I would be lying if I said it was not wearing a bit thin by the end of the film. I understand there are now three \"Trip\" films. I have not seen the previous two and I want to see them, although I am in no hurry because this is not the sort of comedy you can easily binge on.","user":"lolchicken-98780","rank":[9,13]}]