[{"title":"Beauty is in the eye of the beholder, Art is still alive.","rating":10,"date":"13 April 2018","review":"Most of Stanley Kubricks work and Marlon Brando's acting was misunderstood and made sense on a deeper level. If you love art and music and watching a real actor at work then definitely check out Willem Dafoe in Opus Zero which was written and directed by Daniel Graham A film that feels like Stanley Kubrick and echoes of Sergio Leone. Beautifully shot, amazing music, solid acting from everyone and showcasing the beauty of Mexico and the fact that \"silence is a value by which we measure sound\".<br><br>Cerebral and the polar opposite to the mindless splatter of super-hero movies that just seem to be getting worse with a few rare exceptions eg The Dark Knight Watchmen and Endgame etc. Daniels work and Debut movie Opus Zero is the tip of the iceberg and testimony to the power of persistence and the preservation of Cinema, and is not another 500 million dollar wash and go movie. Art is still alive. Go Daniel Graham go,, and all Hail Willem Dafoe.<br><br>I felt relaxed and couldn't get the blues music parts of the movie's music soundtrack out of my head and i didn't want to.<br><br>Nice movie, GREAT music, breathtaking photography and philosophical grit.","user":"lonewolfleeisnoob","rank":[13,23]},{"title":"Meaningless","rating":4,"date":"21 November 2017","review":"Nicely photographed but emotionally empty film. It is split in two sections, the first one seems slightly interesting but the transition to the second loses one completely.<br><br>Pros: Photography Locations Willem Dafoe's acting Some lines of dialogue Usage of music Cons: Pacing Plot Character Development Empty, pretentious presentation Lack of a satisfying setup and conclusion Change in protagonists/point of view 4.5/10","user":"tavaresmd","rank":[10,21]},{"title":"I want my hour and a half back!","rating":1,"date":"7 November 2019","review":"Anything that has to do with watching paint dry, you might like this movie. If you enjoy watching someone sitting at a table while drinking a cup over coffee staring at the wall for five minutes, you might like this movie. If you enjoy watching people walk a flight of stairs, basically, just walking, you might enjoy this movie. You are watching the most boring person on the face of the earth do their routine for what ever reason they are doing it until the camera just stops following them. If this is suppose to be \"art\". I hate art.","user":"psxexperten","rank":[2,4]}]