[{"title":"One of the most important documentaries you will ever see","rating":10,"date":"7 April 2018","review":"Let me start by saying that i am very interested in computers, and i have been since the early 1980's. Since then i have been working with computers, used them for gaming, for social interactions, i have used them for entertainment, like listening to music, watch movies, and so on. I have basically spent my entire life since i was only a child, on a computer.<br><br>This documentary is about A.I. (Artificial Intelligence) and some of my favorite movies of all time are 2001: A Space Odyssey, Terminator 1&amp;2 and Wargames, all movies being used to describe things in this documentary. Some of these movies might have given many people the wrong idea about A.I. and eventually what it can do. I however have been paying attention somewhat closely. By reading articles and watching documentaries for decades about this, i am very aware of the progress being done in the field of A.I. But i don't think most people are. Therefor watching this documentary might be one of the single most important things anyone can ever do.<br><br>Also, i just have to mention that i deleted my facebook account many years ago, when i started to understand how much i could be manipulated using it. It was when the Snowden leaks happened, a lot of people said back then, that they were going to delete their facebook account, but as it turned out, less than 1% actually did. They had become so dependent on the platform, their entire life is now depending on it.<br><br>This is how it begins. It is one thing to become dependent on electricity for example, or that your food is guaranteed free of toxics and bacteria, or that your TV show actually begins on time. Being dependent on A.I. is something else entirely. We are talking about computers that already know everything about you, and are constantly storing information about you, building a profile to better understand what you want and desire.<br><br>This documentary does a great job in making you understand how the world you currently live in, is operated by code, without your knowledge, actually without anyones knowledge. Thing is, no one really knows how A.I. thinks, we only make it, and off it goes on it's own adventure. This can lead to catastrophic events that can end the entire human race in just moments. And this is not some distant future predictions, this is happening right now.<br><br>Everything from search algorithms, self driving cars, chess playing robots, robots used in medical industry to detect cancer and other deceases, surveillance systems that can detect and identify faces in milliseconds, military armed drones that can detect threat and intervene all on their own. All of this is already here, and this is already scary, but this is only the beginning. Were we go from here is a very uncertain path.<br><br>Elon Musk, which is one of the people being interviewed in this documentary has previously stated that he thinks there is a very high chance that A.I. will end us, and this documentary will go a long way explaining how that might happen.<br><br>Do you trust this computer? is essential for everyone to watch, it is well made, it explains things in a way that makes this subject a lot easier to understand. It however doesn't bring much new information to those that know a lot about this already, but i recommend watching it anyways.<br><br>10/10 - Essential watch","user":"FabledGentleman","rank":[30,45]},{"title":"Artificially counterintelligent","rating":1,"date":"13 September 2018","review":"This video annoyed and frustrated me.<br><br>There is little point in inviting billionaires and MIT professors to say things that we all already know. There is so little point, that it is immensely annoying and frustrating. The point, in the end, is to sit here and \"be told.\" There's not a single line of comment in this hour and twelve minutes that the whole audience doesn't already know, and hasn't already heard and talked about and thought about.<br><br>And yet it's a tremendously important subject. See where this is going? It reflects the situation in reality: We sit around and helplessly comment on things that we ourselves are causing (by buying and selling this technology). There is absolutely no intelligent, critical thought reflected or presented in this film. Instead, we get BS ted-talky comments like \"nobody can stop it!\"<br><br>The truth is that everybody can stop it. But it has to be everybody, not somebody else.<br><br>It's just unspeakably stultifying, how much of the film consists of the dumbest, most obvious statements a person could possible make:\n\"We've never had this data before!\"\n\"We've created tech that allows us to capture vast quantities of data!\"\n\"Google knows more about you than your mother!\"\n\"Data itself is not good or evil, it's how it's used!\"\netc etc etc. These are researchers at the leading universities.<br><br>The film is also full of people saying patently untrue statements (\"Uber is making transportation cheaper...\") that go unchallenged. It was not made by a journalist. So not made by a journalist. Why is that important? Because that's where the critical thinking would have come in. It's not about losing jobs to AI. People don't make money from jobs, they make money from .... owning capital and many other things that are exemplified by how the tech industry is making money, which points to how the AI problem is so much bigger than the principals here even recognize.<br><br>It's, again, symptomatic of where things stand, when you don't see any intelligence coming out of human beings, and certainly not out of their toys. Rather, we have been reduced to the \"fanboys\" of vacuous and senseless \"intelligent\" operations like AI. But you won't find that explored in the film.<br><br>It's a parade of evil people, stupid people, and immensely cynical, mentally lazy people. If you want to drastically reduce your faith in humanity -- from the public, to the experts, to the filmmakers -- this one is for you. If you value intelligence, you probably know where to go back and find it when you've closed the lid on your laptop.","user":"zelena33","rank":[6,7]},{"title":"is this art?","rating":2,"date":"8 April 2018","review":"It's comes across like a series of animated memes. \nDistracting moving images without informational content are interrupting a senseless string of short aphorisms spoken by various actors of the industry. \nThe required and expected attention span of the target audience is about 10 seconds. That's when the beat changes. bam bambam bam bam bambam. <br><br>I don't get the idea behind the piece. It's not at all informational - so it can't claim the label 'documentary'. <br><br> Is it trying to be a video opera in seventeen thousands acts? <br><br>Instead of enlightening the viewer it's aiming to create emotions. As such it might claim the label \"piece of art\". <br><br> But as long as the director sells it as a documentary it gets 2 stars out of 10 from me. 2 instead of 1. Because apparently, he put in some effort to collect what you might call \"interviews\". It's a real shame that someone with that kind of access to the industry players doesn't create a more intelligent film with his material.","user":"muellschoene","rank":[35,71]}]