[{"title":"Highly Recommended - One of the best films of the year","rating":9,"date":"16 August 2017","review":"TThis is one of the best films of the year. 120 Beats Per Minute dramatises a dramatic few (early) years of ACT UP Paris, a direct action AIDS advocacy group. The film opens by initially presenting many different participants in meetings and demonstrations to give an understanding of the diversity of the people affected by AIDS and the group itself. It then hones in on two main protagonists – Sean and Nathan. Sean is HIV positive yet starting to develop AIDS. His fiercely political and personal fight against AIDS, ignorance, fear and the lack of interest from Government, pharmaceutical companies and the general public to their personal plight is heightened by the growing number of deaths decimating the gay community around him and the little time he may have to live. Nathan is a new member to ACT UP, HIV negative, yet quickly learning about HIV, AIDS, drug interactions, scientific analysis, and the political and social landscape of AIDS. He eventually falls in love with Sean, and will eventually have to take care of him much earlier than expected. Both men are in their early 20's when we meet them and this is probably the most heartbreaking and devastating aspect of the film and its story- that this disease claimed so many young lives within a society that for the most part did not care about their plight and stigmatised them because they were gay, had AIDS, and / or did not like their sexual practices. The film follows ACT UP meetings, protest rallys and demonstrations (which are both shocking and humorously presented); alongside Sean and Nathan's growing relationship. One scene in particular I will never forget - when they gate crash a class at a high school to inform the students about safe sex, as nobody was informing them because of the sexual nature, and the camera keeps on returning to one young student mesmerised by the groups actions; showing how they did have an impact through their presence. All the performances are beautifully rendered, and while the running time may seem long it is understandable when seen in context with the emotionally powerful last quarter of the film. This film was an experience that haunted me for days afterward. HIGHLY RECOMMENDED.","user":"TrevorJD","rank":[42,49]},{"title":"Sobering look at the AIDS epidemic","rating":8,"date":"7 September 2017","review":"\"BPM\" (2017 release from France; 140 min.; original title \"120 battements par minute\" or \"120 beats per minute\") brings the story of a group of activists in Paris, France who are trying to raise awareness as to the deadly epidemic going through the gay community in the early 90s. As the movie opens, the Paris branch of ACT UP is welcoming 4 new members to its ranks. We witness the meeting where there is strong debate as to what action to take. Along the way, the movie focuses on one particular guy, Sean, as he struggles, health and otherwise. To tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is the latest movie of French director Robin Campillo, who previously gave us the excellent \"Eastern Boys\". Here he goes a very different direction, looking back at the dark days when AIDS was raging and little or certainly not enough was done by the government (with multiple stabs at then-president Mitterand) and the pharmaceutical industry. One of the strengths of the movie is that Campillo on multiple occasions lets the scenes play out without hurrying. There is little or no music to speak off in the movie, and again that only results in the film being ever more impactful (the last 40 min. pack an emotional wallop). Even though the Sean character is central, the movie comes across as an ensemble piece, with lots of stellar performances. Last but certainly not least, when watching this, I couldn't help but think back to that other AIDS movie from 2 decades ago, the Tom Hanks-starring \"Philadelphia\", in the \"Hollywood version\" of what AIDS was about. \"BPM\" easily blows \"Philadelphia\" out of the water. Bottom line: regardless of how you personally feel about the AIDS epidemic in the early 90s, \"BPM\" brings a sobering look and is nothing short of a masterful movie.<br><br>\"BPM\" premiered at this year's Cannes Film Festival, where it was met with immediate critical acclaim (winning, among others, the \"Grand Prix\" award--in essence the silver medal as compared to the \"Palm d'Or\" gold medal). I happen to catch this movie during a recent family visit in Belgium. The early evening screening where I saw this at in Antwerp, Belgium, was attended very nicely, somewhat to my surprise. I would think this will eventually make it to US theaters, although given the nature of the film, this certainly cannot be taken for granted. If you have a chance to check it out, I'd encourage you to do so.","user":"paul-allaer","rank":[28,34]},{"title":"Bracing fly on the wall look at the AIDS crisis in 90s France","rating":5,"date":"5 November 2017","review":"ACT UP was an activist group that sprung up in the New York City AIDS community. BPM is a bracing energetic look at its sister group in Paris in the 90s. To it's credit, BPM Director Robin Campillo and writer Philippe Mangeneot don't shy away from how controversial the organization was in general society as well as with other AIDS activist groups, and indeed, within the ACT UP itself. This isn't mere hagiography, but a living breathing testament to the era. <br><br>Much of the movie plays as a fly on the wall look at the issues and conflicts both outside and inside the group and its members. Campillo enlivens some of the dry technical talk with sporadic montage outbursts. But, they aren't just mere scene breaks, but, function as a way of showing these are dynamic three-dimensional people - not just \"victims\". <br><br>About midway, there's a long sex scene that, while intensely intimate, also brilliantly weaves in many of the movie's themes. The scene is between on of ACT UP Paris' co-founders Sean (Nahuel Pérez Biscayart) and a newer member Nathan (Arnaud Valois). From that point on the movie shifts from a more general look at the group to focus more on Sean and his declining health. It's a risky structural move, and not one that is entirely successful. While it is no doubt important to personalize the crisis on a personal level, it unbalances the whole a bit. It's also more than a little protracted, and feels rhythmically out of place with the better paced rest of the piece. It does lead to one particularly vivid final act of demonstration among the other members of ACT UP Paris.<br><br>BPM is one of the best movies on the AIDS crisis, joining another excellent French film, SAVAGE NIGHTS (1992) on that list. It's difficult, it's sometimes hard to watch, but, it's refreshingly alive unlike all too many films these days.","user":"gortx","rank":[13,15]}]