[{"title":"Funny (how)","rating":6,"date":"27 November 2017","review":"Let me clear the air from the start: Do not even begin to compare this \"What we do in the shadows\". They're both comedies and they are both with and about vampires. But very different in style and some of the humor too. The pseudo documentary (reality TV) aspect of the mentioned other movie makes it apparent, but I can tell you that some people at the festival I watched it, drew the comparison.<br><br>If you can let go of that, you will be able to enjoy a movie, that is more than decent, if you are not too Christian and/or easily offended. The jokes are not all hits and the movie felt like it slowed down midway through. But pacing issues aside, this was still fun to watch and had quite a few (crazy) things going for it","user":"kosmasp","rank":[14,18]},{"title":"Move Over, Mapplethorpe and Serrano","rating":6,"date":"7 October 2018","review":"Vidar left me unsatisfied. Here in Minnesota, the \"bachelor Norwegian farmer\" is a decades-running meme only recently terminated by #MeToo; that this character exists in film was cheering of itself, and he comes across as empathetic at first. The method of vampire siring -- hilarious to me, mind-blowingly offensive to Christians -- created the potential for a fascinating film. But the subsequent plot was too one-dimensional and the characters' motivations too thin. I stopped caring much, and at film's end my reaction was \"Meh. Quitter.\" It's worth seeing just for the audacity, but it could have been so much more.","user":"TrTm316","rank":[5,9]},{"title":"Wonderfully offbeat vampire comedy...","rating":7,"date":"24 September 2019","review":"Right, well I sat down to watch this 2017 Norwegian horror comedy titled \"Vampyr Vidar\" (aka \"Vidar the Vampire\") here in 2019. I hadn't heard about the movie prior to finding it, nor had I any idea what it was about. I was immediately intrigued by the DVDs cover, so I picked it up and sat down to watch it.<br><br>Let me just say right away, that \"Vampyr Vidar\" was a very entertaining and enjoyable movie. The movie starts out pretty nicely, and writers and directors Thomas Aske Berg and Fredrik Waldeland quickly found a pacing that worked and the movie kept up with a good pace.<br><br>The storyline in the movie was quite interesting, because they managed to throw a heap of different aspects into the movie, such as social awkwardness, megalomania, vampirism, jabbing at Christianity and much more. It all just worked very nicely together in the cobble pot that is \"Vampyr Vidar\".<br><br>Thomas Aske Berg, playing Vidar, was phenomenal in the movie, and he really was so well-cast for the character.<br><br>\"Vampyr Vidar\" turned out to be so much more than I had hoped or expected it to be. And I was genuinely entertained from start to end. If you haven't already seen this 2017 Norwegian movie, then I can highly recommend that you do so.<br><br>And the ending of the movie was just hilarious, it was such a glorious way to round up the events of the entire movie.<br><br>I am rating \"Vampyr Vidar\" a very solid seven out of ten stars.","user":"paul_haakonsen","rank":[0,0]}]