[{"title":"Not bad, but could've been better","rating":6,"date":"20 October 2019","review":"I expected more from this given the talent involved. It's a pretty straightforward and predictable story, which can work given good comedic material to supplement that. Unfortunately, Late Night isn't terribly funny and relies on the same \"woke\" jokes over and over and over again. Emma Thompson, however, is terrific and definitely carries the film. Late Night has an interesting premise that just never feels fully capitalized on.","user":"cardsrock","rank":[15,17]},{"title":"Fun but doesn't reach its potential","rating":6,"date":"7 September 2019","review":"This could easily have been an 8/10 if it wasn't so ... fluffy. Thompson and Kaling are really good together (who isn't Thompson good (great) with though?) and it's got some genuinely funny, smart moments. Overall though, it wasn't enough to be really good, just okay with a fantastic cast. It's enjoyable though and you should watch it if you like Thompson and/or Kaling.","user":"fccs23521","rank":[49,65]},{"title":"a Character Piece you don't see on late night tv.","rating":7,"date":"11 September 2019","review":"Emma Thompson is one of those actors that spans the range of roles, and makes every character real. This behind the scenes look at Late Night hosted by a successful now 56 year old woman had moments of humor, some social issues, Hollywood issues, and ends up deciding to do something different, be real. It does fall in the range of a good film, but not a great one, an enjoyable film not a laugh riot. The character is a driven woman who succeeded in a man's world, and the cuts of her hair, her pant suits, even how she behaves is very masculine, what women often do to succeed in a man's world. The character is layered and interesting as she walks through a kind of mid-life crisis, career and husband. It's more of a character piece, which I prefer anyway. A good evening's watch.","user":"lightheartedbeing","rank":[16,19]}]