[{"title":"Don't be put off by reviews - Watch and form your own opinion","rating":5,"date":"23 January 2019","review":"Overall I would say this is a great short movie and worth 30 minutes of your time. The cinematography is fantastic coming from such a small team and budget, there are beautiful compositions throughout and they are tied together by a great soundtrack. The movie does a solid job of creating a post apocalyptic world - It's not overdone or cheesy. It feels peaceful but lonely.<br><br>There are some flaws - The flow of the film is sometimes choppy between cuts, and the robot companion didn't make me feel invested or otherwise emotionally drawn in. J.J. Johnston did a solid job as the lead and had some great moments, although again, I didn't get a chance to become particularly invested in his character. The same goes for the story; it's very intriguing, but I never felt truly drawn in to it.<br><br>Will Magness has real potential as filmmaker and I very much hope this is the start of more to come. Although the movie didn't quite slot together perfectly, it still felt well refined and polished. It's not perfect but there is plenty of potential, I definitely want to see more of what Will can do.<br><br>Give this short a watch.","user":"RichMiles24","rank":[7,8]},{"title":"For big science fiction fans worth seeing","rating":4,"date":"5 August 2018","review":"\"The Manual\" is an American half-hour live action short film from 2017 and this one received a respectable amount of awards recognition already since its release. Writer and director is Wil Magness and this is his most recent work at this point. And it also reaches audiences like so many other science fiction short films, so it is not too difficult to get your hands on this still relatively new movie. There aren't many characters in here at all and I liked it, so the focus is crucial on one or two in the center of the story. Sadly, the story itself did not impress me as much as I hoped it would/could, but maybe this is also because I am not the very greatest science fiction film fan. Still the visual side, especially the robot, was pretty decent, but occasionally, the execution and ideas, also with the plot twist at the very end, simply did not match the talent, so it looks very ambitious, but the road and the production values, especially in terms of story telling do not really feel as good as I wanted them to be. It's not a bad film by any means, so everybody who likes the genre can give it a go I guess. Still there is nothing here that stands out, maybe the music comes closest, so overall I have to give it a thumbs-down and negative recommendation. like I said, one only for genre lovers.","user":"Horst_In_Translation","rank":[5,8]},{"title":"Last Man on Earth","rating":5,"date":"20 August 2018","review":"Short film. Photography is quite excellent. Dystopian society/last man on Earth diatribe (how would you know without searching the entire planet?) The main character is depressed throughout, a bit insane, and frankly I don't know why he just didn't commit suicide. Yeah, he attempted it but still...I mean, humans are social animals and there isn't much social interaction with a robot. A lot of Christianity in this. No where in the Bible does it implicitly state that those who commit suicide go to hell. It does say all are sin (Romans 3:23), are born of sin, and continuously live in sin. The only unforgivable sin is blasphemy against the Holy Spirit (Matthew 12:31). Which means all horrible things humans do to each other (murder, genocide, rape, suicide, etc.,) can be forgiven which is why the Bible doesn't implicitly state one goes to Hell for many things humans find to be detestable. Basically, what I got out of this film: for humans: Heaven and Earth is the same. If we create heartache on Earth, we'll create it in Heaven, as well. I'm sure that's not the message but that's what I took away from it.","user":"nammage","rank":[2,3]}]