[{"title":"This should have been a mini-series.","rating":4,"date":"11 March 2019","review":"I was browsing through Netflix to find something new to watch, and Juanita's trailer sucked me right in. The trailer made this movie look so promising, but the movie fell short of what the trailer set me up for.<br><br>As the other reviewers have said, this movie had a great cast, great idea but horrible delivery and a rushed, choppy pace. Personally, I also didn't like the take on Juanita's imagination and her talking directly to the viewer. It felt really out of place for a movie I just wanted to unfold on its own. For me, it felt like an easy out on rushing into her trip by having her explain her reasonings directly to us instead of letting us see it unfold.<br><br>I kept losing interest throughout the film and came close to switching it off early, but I powered on to see how it would wrap up. It didn't. There are movies out there that leave you ambiguously at the end, and it's perfectly done (i.e. Cast Away). Sadly, Juanita's ending felt incredibly abrupt and unsatisfying. Did she go back to Jess and Paper Moon? Did she decide this trip was enough of a rediscovery to go back home? When it got to the end scene and I could tell by the music that the credits were about to play, I was like \"wait what?\" Unsatisfied, I officially felt like I wasted the hour and a half.<br><br>This movie had the potential to be such a feel good story about an older woman rediscovering herself, but it flopped. It left so many points unresolved, not just for her story but the other characters as well. Way too rushed and under delivered.","user":"mrshollywoodsy","rank":[38,41]},{"title":"It could have been magical....","rating":5,"date":"10 March 2019","review":"Juanita was such a missed opportunity. It has all the right elements: a great cast, an interesting plot and lots of possibilities for story direction. Instead, it is a rushed, chopped and hurried mess. Juanita should have been a mini-series. This story is about transformation- not just for Juanita; but for all the people she meets on her journey as well. How fun and emotionally satisfying it would have been to be able to spend a little more time with these characters and take the journey with them!","user":"pjsandiego","rank":[44,49]},{"title":"Women's History Month Celebration Flick","rating":10,"date":"9 March 2019","review":"Perfect film for Women's History Month. Just told my Mom and friends to watch. This movie brings to life our feeling or a thoughts to focus on Us. Us women would love to be at a place in our lives where we could just pick up and go! Just pick up and leave to focus on you. As women we are natural nurturers and we often forget about our own mental and physical health. This movie reminds to take time for self and be unapologetic about it.","user":"hiphopphotos","rank":[29,35]}]