[{"title":"A whole new (different, but familiar) world....","rating":8,"date":"23 May 2019","review":"As soon as this live action version of Aladdin was first announced, it seems certain people were against it. While I too have fond memories of seeing the original animated version at the theatre, I was at least willing to give this one a chance. I'm glad I did. Firstly, people need to realise an animated film and live-action film are two different things. Some things that work in animation just won't translate too well into live-action. The other thing to accept is that, short of resurrecting Robin Williams, there was no way they were ever going to be able to replicate his unique take on the character of the Genie. Once you open your mind to the possibility that something can be 'different' but also *good*; then you'll have a more pleasant experience. That's what we get here: a movie that is familiar, but at the same time new/different (and that's not a bad thing).<br><br>From the very beginning, the movie is somewhat different to what we might be expecting when we're introduced to who is telling the story. While it was immediately evident to me what was going on, it wasn't a 'bad' addition. After sweeping shots set to the song 'Arabian Nights', we're introduced to the 'street rat' named Aladdin. Although much fuss has been made about the Genie casting, if Aladdin had been miscast, then the whole film would've suffered. Thankfully, I can say that I almost immediately liked Mena Massoud in the role. He's funny, got moves/charm, makes for a likeable 'thief' and his relationship with his pet monkey, Abu, is as good as I'd hoped it'd be. Speaking of, although people think of CGI characters badly a lot of the time, it must be made clear the animal companions in this are all wonderfully brought to life/fully-realised characters. Abu is expressive, funny, and helpful (despite sometimes getting them both into trouble).<br><br>Not before long Aladdin encounters Princess Jasmine (a well-cast Naomi Scott, who does a lot with the character and should make most Jasmine fans proud), who's undercover among the people. I was afraid that the movie would rush through their first meeting, but was happy with the amount of time devoted to them developing an interest in each other. I could instantly tell that the beloved character of Jasmine was in safe hands as portrayed by Naomi Scott and that she had nice chemistry with Massoud's Aladdin. Although not given as much to do as Abu, Jasmine's loyal tiger companion, Rajah, is another lovely animal created with CGI, who I appreciated wasn't largely ignored. Jasmine's other loyal friend, her handmaiden named Dalia, is actually a stand-out character in the movie. Nasim Pedrad has excellent comic timing, as does Naomi Scott, which is on full display in a fun scene where Aladdin comes to the palace and Jasmine attempts to maintain her cover.<br><br>The one 'miss' in the casting department is that of Marwan Kenzari as villainous Jafar. While others had pre-judged him based on the trailers alone, I was willing to give him a chance to make up for his lack of sinister voice with what would hopefully be at least a menacing performance. Sadly, he lacks even that. There's nothing particularly memorable about his portrayal (even near the end when he's given every opportunity to unleash in full-on villain mode, he falls way short). About the only 'positive' I could find regarding his character is his animal companion of Iago. The red parrot might not be quite as talkative as the animated version, but he *does* talk (and in a much more bird-like way), getting a few funny lines here and there (I'd expect nothing less from Alan Tudyk providing the voice). It's just disappointing that Jafar's miscast, and thus the 'weak link' in the film.<br><br>What most people are probably wondering about is Will Smith as the Genie. I actually thought he was pretty good here (and I found him more likeable in this role than I have in any movie I've seen him in since probably the first Men In Black). There are just one or two instances where I felt he tried to emulate Robin Williams' version and it didn't quite work, but on the whole I felt he brought his own energy/style to the character of Genie and it (mostly) worked. The most important thing was the friendship that he formed with Aladdin. While Smith's Genie may seem a bit more snarky than you might expect, when it comes to the emotional beats, his performance hits the right notes (especially near the end).<br><br>Speaking of notes, \"What about the songs?\" you may ask. I was pretty happy with them, there were just the right amount and they didn't feel particularly intrusive in any of the scenes they were featured. Even the new song, 'Speechless', isn't too bad (though there are those who'll no doubt complain). Massoud and Scott have really nice singing voices and did their songs justice, I thought. Will Smith's also decent with his main songs in the movie (the end credits one I could've done without, though).<br><br>I must also praise the costumes (Jasmine's are all stunning, as is Jasmine herself), the use of vibrant colours is quite impressive and the overall look of the film feels like something new/different to what we've seen time and time again in films (especially Disney ones). Things I forgot to mention: the Magic Carpet has as much 'character' as in the original (I especially appreciated seeing how close friends Carpet and Abu became by the end), and even the Sultan's head guard, Hakim, is given some depth.<br><br>In conclusion, if you go into the theatre already disliking/hating the film based on just the trailers, then you're probably going to leave the same way you entered: bitter and thinking things like \"It ruined my childhood!\" (such a rubbish statement). Just try accepting this is a different thing and hopefully you'll enjoy it.","user":"Chalice_Of_Evil","rank":[669,1]},{"title":"So much autotune.","rating":7,"date":"7 August 2019","review":"I was left cringing during each musical sequence due to the blatant over use of autotune. The actors bring no emotion to the story.","user":"littlejrd","rank":[278,473]},{"title":"Sadly, it met my expectations","rating":3,"date":"14 July 2019","review":"What's to say. Before even filming we knew Guy Ritchie was obviously the wrong choice to direct the film. His style doesn't quite lend itself to this type of film.\nMiscast Mena Massoud didn't bring any real character to the role of Aladdin he was simply okay/ functional.\nWill Smith is as usual charismatic and had difficult shoes to fill after Robin Williams' take on the genie but he was seriously let down by the VFX in blue genie mode and a weak script.\nAnother miscast Naomi Scott gave a good performance but I always felt i was looking at Indian and not Middle Eastern. In fact the film IS very bollywood with the Jasmin, Aladdin dance off Indian Style (and to Indian music) then Russian dancing(?) plus other times an Indian soundtrack.\nAnd i'm not even going to talk about that sorry excuse for a villain. No, no i am not.\nFor a Disney movie set in large Kingdom it sure does feel quite quite small. It looked cheap too. Weird.\nUltimately a dreadfully executed cash grab of a movie that no one asked for. Thanks D.\nThankfully this is exactly what i expected having seen the trailers.","user":"kshaharudin","rank":[406,711]}]