[{"title":"En Ami","rating":9,"date":"9 December 2016","review":"\"Pilger has taken on the great theme of justice and injustice. He documents the official lies that we are told and that most people accept or don't bother to think about. He belongs to an old and unending worldwide company: the men and women of conscience.\" - Martha Gellhorn <br><br>An interesting documentary by renowned journalist John Pilger, \"The Coming War on China\" details growing attempts by the United States to exert economic, political and military pressure on China.<br><br>Unlike previous films by Pilger, \"Coming's\" tone is one of ridicule and contempt; his film ends with a nod to Stanley Kubrick (Vera Lynn's \"We'll Meet Again\") and is largely told via a condescending narrator. Such a tone is appropriate: \"The Coming War on China\" details the greatest American-led build up of forces since the Second World War, an insane bit of posturing in which Russia and China are encircled by a nearly unbroken necklace of warheads, fleets and military bases, all capable of strangling trade, cutting off oil networks and instigating outright Armageddon.<br><br>\"The Coming War on China\" largely preaches to the choir. It does contain, however, some revelations, like scenes which show contemporary life on the Marshall Islands. Pilger describes the \"American apartheid\" on these islands, in which displaced and exploited locals are shipped to American bases to do menial work, and then shipped out back to their island slums. Sometimes they're unwittingly used as test subjects for nuclear weapons.<br><br>Other segments detail Nobel peace laureate Barack Obama's massive increase in nuclear spending (after promising to limit the construction of nuclear weapons), as well as the West's \"Asian Pivot\", which sees 2/3rds of the US Naval fleet deployed around Asia. Other scenes detail past attempts by the United States to covertly and overtly dominate, subjugate and invade, as well as Franklin Roosevelt's (32nd US President) family's connection to drug runners. Elsewhere Pilger, a cynic, doesn't shy away from China's own abuses, its massacres, its historical relationship with Western powers, and the massive levels of poverty and exploitation bed-rocking the glitz and glamour of 21st century Chinese state-capitalism.<br><br>Where \"The Coming War on China\" fails is in its ability to offer an economic reading of the situation it sketches. The role of money, private arms businesses who exploit lucrative markets, debt, banks, the US economy's own need for war, for market expansion and control, as well as whole financial systems which remain held together by magic, lies and faith, are issues too complex and interlinked for Pilger to coherently chart. And so the US-China rivalry, a revival of the Great Game of the late 19th century, goes on, largely mysterious and unmapped.<br><br>8/10 – Worth one viewing.","user":"tieman64","rank":[53,66]},{"title":"The other side of the story","rating":8,"date":"26 December 2016","review":"The movie started with the Bikini islands, which is a foreign island FAR from the US mainland annexed by the States for military and human laboratory purposes. China is indeed making a move on the disputed area of the South China Sea. While I am not defending the absurdity of this action, it is hypocritical of the US to criticize China while itself is spreading its military influence all over the world for it's economical and political purposes. The movie is rather unbiased because it also exposes the social inequality of China as a result of the economic reforms. Both countries have their problems, but this movie gives an insight to the viewers for the reasons we wouldn't see from the western media: Being demonized by the western mainstream propaganda, China has no choice but to react to the suppression of the States or it will meet the same fate as the Bikini islands or the Okinawa island.","user":"lvkuang","rank":[43,58]},{"title":"A plain and thorough conducted researched documentary","rating":10,"date":"12 December 2016","review":"The US government has been conducting covert operations since WW I. And probably many other nations do that same thing. The world is sadly so indoctrinated with false information and the media and the school systems are so controlled that the truth does not reach the people. Therefor I am glad John Pilger made this film and showed not only evidence of those covert actions by the US government but also the heroic and relentless effort that other so called ordinary people make to expose and oppose these actions. This movie is made in deep honor of all those who have been railroaded And even killed by these actions of a nation that has grown to have become the largest psychotic, delusional, megalomaniacal force in this world. Sadly again many of its inhabitants as well as people from other nations are indoctrinated because of false information and lack of true information and will hold on to that this film as well as many other proof belongs in the category of conspiracy theories. The only thing someone has to do to get to the truth is rid oneself of all prejudices and look at the information with an open mind. Take that challenge and watch this movie and see for yourself. Only the truth will set you free.","user":"onetree-280-291441","rank":[55,82]}]