[{"title":"The Humanity Bureau: Better idea than movie","rating":5,"date":"25 December 2018","review":"Another straight to DVD Nicolas Cage movie, I have absolutely no idea what's going on with this guys career.<br><br>The Humanity Bureau tells the story of a government agent whose job it is to establish who is contributing to society and who is not. Those deemed \"Not\" are sent to a place to live out there days away from civilization.<br><br>I actually like the idea, I like where the story goes and thought it was very thought provoking and scarily realistic (I could actually see something like this happening in the near future).<br><br>The trouble is the idea isn't fully utilized, the movie should have been better but instead comes across rushed, with chronic pacing issues and doesn't embrace the concept quite as tightly as it should have.<br><br>Cage phones in an average performance once again and everyone else except Hugh Dillon are instantly forgettable.<br><br>Some pretty scenery going hand in hand with some great ideas save it to an extent but it should have been so much better than this.<br><br>The Good:<br><br>Great visuals<br><br>Hugh Dillon<br><br>Unpredictable<br><br>Fantastic concept<br><br>The Bad:<br><br>Pacing issues<br><br>Wasted potential<br><br>Lifeless cast<br><br>Things I Learnt From This Movie:<br><br>\"It's easier to build fear than build a wall\" That term is oddly relevant at time of writing<br><br>Somehow, someway, despite everything, I'm still a Nicolas Cage fan","user":"Platypuschow","rank":[40,44]},{"title":"Oh dear how sad for all the good old actors of yesteryear - Is this where they go to die!","rating":3,"date":"16 November 2017","review":"It seems many of the movie greats have become straight to DVD fodder now. They have all gone down the Lance Henriksen, Ron Perlman, John Cusack route and I am very sad to say we have to add Nick Cage to the list of has beens. Is it because they are too old? Well, No I certainly don't think so; Nick and John Cusack both seem to be dying their hair with boot polish these days but at least Nick hasn't had too many face lifts like John Cusack (seriously have you seen him in CELL &amp; SINGULARITY - He looks like a woman). Nick looks half decent for a guy in his 50's so why why why are they not being offered decent roles?<br><br>This was really cheap from the very opening scene with the drone next to his car it looked so bad it wasn't even good enough to appear in a home made video. The cars were supposed to be smartphone computer controlled and it is supposed to be the future but they were all ordinary cars with nothing scifi about them except the Humanity logo - very, very poor show old chep!<br><br>The movie lurched from one cheap location to another as a different reviewer pointed out quite correctly to save money obviously. The guy with the eye patch - what can i say but cringe, cringe, triple cringe!!!<br><br>The acting was wooden and plodding as though they were all just picking up a cheque and the artistic integrity mattered not. The story really was like a retread of an old tired cliché and the poor effects just made the whole thing seem like another pointless exercise. I though singularity was poor but this is actually worse. <br><br>Scifi channel movies are better than this - if that doesn't give you the SP then nothing will!","user":"omendata","rank":[101,133]},{"title":"another Nicolas Cage special","rating":3,"date":"18 February 2018","review":"In the near future, America is devastated by evironmental and economic disasters. Noah Kross (Nicolas Cage) is an agent of the Humanity Bureau, a government agency which determines whether a citizen is productive or not. He is sent to evaluate the farm of Rachel Weller and her son Lucas. The farm is barren and Kross decides to send them to the relocation center. When he gives them a break, his superior Adam Westinghouse (Hugh Dillon) seeks to stop them all.<br><br>It seems like the filmmakers conceived of a dystopian world but failed to create a compelling story within it. This is another Cage special. It should be a warning sign for any of his recent movies. If he thinks the script is great, there is no doubt that something is wrong with it. The big reveal reminds me of Soylent Green. In fact, I'd rather have Soylent Green. This is generally cheap, inferior in every way, and lacking intensity. Cage is going through the motion. This is a small Canadian sci-fi indie trying to hit above its weight and failing.","user":"SnoopyStyle","rank":[55,72]}]