[{"title":"Great documentary about podcasters and their fans...","rating":8,"date":"11 July 2017","review":"I finally managed to watch my copy of Ear Buds: The Podcasting Documentary.<br><br>Ear Buds is the brain-child and pet project of podcasters Graham Elwood and Chris Mancini (The Comedy Film Nerds Podcast). Ear Buds is not about the technical aspects of podcasting, nor is it about the history of the medium. It is about the podcasters and their fans, and the way they connect through the podcasts. The documentary digs deep into the personal issues of podcasters (mostly comedians) and explains the way this medium allows them to be more in control of their material and its distribution. And the film introduces a number of podcast listeners who found solace in podcasts during a variety of personal crises.<br><br>This particular focus of the film also highlights the weird situation that podcasts mean so much to so many people, while still being basically unknown to 95% of the general public. Accordingly, the film opens on a vox-pop montage with people being flabbergasted by the question \"what is a podcast?\". It then moves into a very well-done animated PSA, and on to a series of introductions of various podcasters and also some podcast listeners. After a multi-layered introduction, the film settles in nicely, with a good pace.<br><br>While the documentary opens on the podcasters, and then moves on to the listeners, structurally it often moves between these two groups for most of the film. One reason is that some listeners are also podcasters themselves, but the main reason is that podcasters and listeners often do form a close community, which – as I stated above – is the main focus of the documentary. So by using this structure, the documentary manages to demonstrate that point even better.<br><br>The film looks very good thanks to the camera work and the efforts in colour correction. Ear Buds' main strengths are a great musical score and very good editing. Over the course of nearly three years, Graham Elwood and Chris Mancini saddled themselves and their editor Tina Imahara with many, many hours of footage, which must have been very difficult to boil down into the 102 minutes of net running time we have in the final product.<br><br>If the aforementioned focus of this documentary appeals to you, I can strongly recommend watching it. DVDs and downloads (including additional material options) are sold CFN store: https://store.comedyfilmnerds.com<br><br>note: Ear Buds will receive some form of distribution in the second half of 2017. Around that time, sales of the documentary through the CFN store will stop for a 90-day hiatus, for contractual reasons.","user":"Scrugulus","rank":[2,5]},{"title":"A must watch","rating":9,"date":"19 February 2019","review":"A fantastic doc about the podcasting world. See how these podcasts impact on the listeners and how podcasting has brought people together from all over the world.<br><br>I feel inspired.................. I think I might.............","user":"darren-mcgregor","rank":[1,2]}]