[{"title":"Review is Misleading","rating":9,"date":"17 May 2018","review":"The low review for this movie is so misleading. <br><br>Yes, it could be considered underwhelming in terms of drama and action if that's what you're looking for. It isn't Trainspotting 3 and was never meant to be. It's focus was on emotion and the hold that drug use can have on a family. It was real and not pumped up for the sake of making it a more exciting movie.<br><br>The performances, music, and story were fantastic. It's worth a watch. It will suck you in and really gets across the emotions that everyone in a family goes through when a member battles addiction.","user":"smithers-742-127438","rank":[18,20]},{"title":"Pretty good, not incredible...but definitely authentic.","rating":7,"date":"13 April 2018","review":"*Not REALLY a spoiler.*\nComing from someone who has personally dealt with this issue, it is extremely true to life. I could see how a person who hasn't been on either end of the spectrum could be quick to judge films about addiction (for example, thinking \"that wouldn't happen or she/he would never do that). But believe me, it does and they do. While this isn't the best film I've seen dealing with addiction, it is an amazing portrayal of how addiction is a family disease (especially w/codependence) and is so so brutal. Abbi Jacobson nailed her role, as did Dave Franco. \nAs for the actual \"film\", I thought it was really well done. There's a kind of narrative throughout this that I liked a lot. I prefer a character study and good plot/story over a big budget, full of explosions and car chases movie. So if you're looking for that sort of thing you may not enjoy this as much as myself. \nSo yes, definitely recommend:)","user":"merch10277","rank":[13,14]},{"title":"Not Perfect - But Raw, Real, And Incredibly Tense","rating":7,"date":"6 April 2018","review":"While it wasn't perfect, I can say from the personal experience of having spouse addicted to heroin, that this film honestly and truly captures the emotional horror and torment involved. Again its not perfect, but much of it is incredibly raw, emotional, and truthfully portrays drug addiction and how it affects people involved. The film centers around a woman who discovers her brother has relapsed on heroin, and embarks on a brutal journey to get him to a detox center, while at the same time dealing with her own life. The film perfectly portrays the duality of a person who has an addicted spouse, being emotionally torn between your own life and the spouse you love and want to get better. The tone is extremely thick with turmoil, suspense, and emotional intensity. Portraying a spouse who will literally do anything to help her sick brother. I can say from personal experience that this film gets very many things right, nails them even.<br><br>Now, because I'm a adult white man, I was never really the demographic for Broad City, so I never watched it or wanted to. But I found Abby Jacobson's performance to be excellent, a woman torn between her life and her drug addicted brother, feeling in a void between the two. Dave Franco's performance as the drug addict is also authentically played, kudos to him. Some of the dialog between members of the family is pretty average and nothing special but what is special is the dialog and intensity between the brother addict and the sister. Their dialog is many of the things I said to my spouse who was addicted to heroin, as well as the way others talk to the brother and sister, the pharmacy scene hits it right on the nose, very accurate. So all in all I like the film even though not every aspect was perfect, I found it very raw and emotional and would highly recommend it as a watch.","user":"neener3707","rank":[29,36]}]