[{"title":"The Nanny: What a shame","rating":5,"date":"19 October 2018","review":"The Nanny was a pick and mix movie for me, I went in knowing nothing but was happy to see Jaime Murrays name pop up on the opening credits. I would class her as one of my favourite actresses and just don't think she gets the recognition she deserves.<br><br>Here in The Nanny she puts in a career best performance, but in the end it simply didn't matter.<br><br>The Nanny tells the story of a single mother who (Shocker) finds herself needing a nanny for her two children. In comes Ms Murray who is a mysterious woman that everyone deems perfect for the job, except the daughter.<br><br>Truth be told the first half of The Nanny is excellent, it's so well crafted, beautifully shot and gripping. Then the second half comes and it all falls apart, I mean really badly! A combination of silliness, poor sfx and rushed concepts ruin what was primed and ready to be an excellent film.<br><br>Part horror, part fantasy this dark fairytale also stars Nicholas \"Xander from Buffy\" Brendon and Schuyler \"Country Singer\" Fisk. It's heartbreaking to me when a film with such potential falls apart as badly as this did. I would love to see someone reshoot/rewrite the second half as it has unlimited potential!<br><br>Sadly it's potential squandered, though Murray is excellent and the first half is very enjoyable the rest of the film is an utter mess.<br><br>The Good:<br><br>First half<br><br>Jaime Murray<br><br>Masterfully shot<br><br>The Bad:<br><br>Second half<br><br>Some goofy sfx<br><br>Lots of unanswered questions<br><br>Things I Learnt From This Movie:<br><br>Jaime Murray seems to connect herself to flawed movies<br><br>It's always nice to see Nicholas Brendon take time out of his busy schedule of prison to make movies","user":"Platypuschow","rank":[17,19]},{"title":"Shockingly bad","rating":2,"date":"16 May 2018","review":"This is one of the worst horror movies I have ever seen and I've seen a lot of bad ones. Bad script. Nothing makes sense. The nanny just shows up, mother knows nothing about her and she leaves her kids to her the same evening. She basically never heard of \"agency\" that nanny comes from but it doesn't matter. Later in the movie she meets a guy that lives in same town and had lost his daughter, yet she is the only person in town that doesn't know who he is. \"Special effects\" are 90's Power Rangers level bad. Everything is just awful in this movie and the only reason I gave it 2 stars instead of 1 is the small amount of suspense in the first 20 minutes. Don't watch this, people. It is not even \"So bad that it's entertaining\". It's insulting...","user":"jovanzeliczema","rank":[23,35]},{"title":"This was bad!","rating":2,"date":"16 May 2018","review":"I gave it 2 stars cause it keep my attention a bit, almost till the end of the movie. And then it just ended. This movie has so many unexplained statements and plot holes. You keep thinking something is going to happen and it doesn't. Makes no sense at all. Just a bunch of ppl who met by chance near the makeup storage and one of them had a camera, but no script or story. You will hate yourself if you see it.","user":"bilismit","rank":[24,37]}]