[{"title":"A slow paced boring story without any real beginning or ending","rating":6,"date":"24 February 2020","review":"This film is amateur director Matt Ratner's 2nd entry on his resume, and he delivered like a seasoned director. Billy Crystal and Ben Schwartz also delivered, but nobody could save this slow paced boring story without any real beginning or ending written by novice writer Peter Hoare. The comedy was about as stale as Schwartz's character. Ignore the fake/paid 10, 9 and 8 reviews... at best this is a 7/10 but get only a 6/10 from me as I expected much more.","user":"TheTopDawgCritic","rank":[8,13]},{"title":"Welcome back Billy, we missed you and you did not disappoint.","rating":9,"date":"22 February 2020","review":"I'm not one who usually goes for the comedy/drama type movies, but I am so glad I sat down and watched this. There cannot be a human being alive that is unable to relate to something in this movie, in a personal way.<br><br>The acting was spot on, not too much or too little of anything. All the actors, fit just right. There's no hurrying the storyline, it just flows. I found myself relating and reflecting to so much of the story and it was a good feeling.<br><br>In short, you need to see this. Don't be in a hurry to do anything while you watch it. Take the 90 minutes and let yourself be whoever it is you relate to in this film. The ending tied everything together in a nice comfortable way.<br><br>Buy it, rent it, download it, whatever. Just watch it.","user":"tspike911","rank":[7,11]},{"title":"Crystal strikes again","rating":7,"date":"20 February 2020","review":"Greetings again from the darkness. Billy Crystal hasn't starred in a film since 2012's PARENTAL GUIDANCE. Sure, he's had some appearances in movies and TV shows, and done some voice acting, but that's a lot of years between top-lining gigs. It seems writer Peter Hoare (KILLING HASSELHOFF, 2017) and director Matt Ratner (his first feature film) know exactly what to do with the now 71 year old legendary comedian, and it makes perfect sense that Mr. Crystal chose this role to end his drought.<br><br>Scott Rollins (Ben Schwartz, \"Parks and Recreation\") is a 34 year old struggling/failed stand-up comic who moves back home after a four year stint trying to make it in the Los Angeles comedy scene. His eternally-chirpy mother (Debra Monk) is thrilled to have him back in his room, but his business owner dad (Kevin Dunn) stays put in his recliner, his 30 year old sister (Grace Gummer, daughter of Meryl Streep) immediately starts jabbing him for failing (after all, she manages a pretzel stand at the mall), his friends have moved on with their own wives and kids, and Becky (Eloise Mumford), the dream girl ex that he deserted to pursue his dreams, has married another guy. Welcome to adulting Scott.<br><br>One of the most awkward 'meet-cutes' occurs when an inebriated Marty bumps into Scott on his way to urinate in the local pub's restroom sink. Soon Marty, who doubles as town-drunk and a dermatologist, is treating Scott's stress rash. The two strike up an odd friendship and the elder Marty is heard doling out life philosophy like, \"Regret is the only thing that's real\", and \"Nobody has their life figured out.\" Weed is also involved as the two similarly lost souls, separated by generations, find common ground in coming to grips with their individual missteps.<br><br>We glimpse more similarities as the backstories are unfolded for Marty and Scott. The elder man's two wives and two kids have resulted in loneliness and pain for the once successful (we can tell by his house) medical professional. His son Adam (Nate Corddry) angrily blames Marty for his mother's death, and daughter Taylor (Caitlin McGee), is mostly too busy for her old man. The younger Scott, previously broke off a solid relationship with Becky to pursue his dream. There was no conversation, just the actions of a younger man's whims. It's only now that he's questioning what matters in life.<br><br>Many clichés are leaned on and some quite familiar ground (do new friends really take the podium at funerals?) is covered, but it's enjoyable to watch an old pro like Mr. Crystal do what he does best. And the life lessons may be simple and obvious, but they are also ones that so many fail to learn until late in life. Some of the humor is offered with a twist. For instance 1986 is featured via HOWARD THE DUCK and Clemens versus Strawberry. Mostly the comedy plays the role of masking loneliness, and it seems when combined with friendship, that's a more effective salve than alcohol. Writer Hoare (whose face is on the giant photo at the wake), leaves us with: \"Lightning never strikes twice, but it can strike again.\" Just like Billy Crystal.","user":"ferguson-6","rank":[8,14]}]