[{"title":"Christine Conradt should have written it solo","rating":4,"date":"9 April 2017","review":"The first of the three films Lifetime showed from 6 p.m. to midnight April 8 was \"Girl Followed,\" an obvious pun on \"Girl, Interrupted\" but really a pretty conventional Lifetime tale of a young woman being the target of obsessive stalking and sabotage from a somewhat older man. This time around the girl was 14-year-old Regan Lindstrom (Emma Fuhrmann), who simply can't catch a break. Her parents Jim (Joey Lawrence) and Abby (Heather McComb) spy on her constantly and treat her with all the sensitivity and love of concentration-camp commandants. This is one of those stories in which the parents are so good at keeping tabs on their kids (not only Regan but her older sister Taylor, played by Gianna LaPera) one wonders why they don't make some real money with these skills by working for the CIA or NSA. They're particularly down on any boy she expresses even the slightest romantic interest in, and so of course Regan rebels at the earliest opportunity. When her crush object Austin (Jake Elliott) breaks up with her and goes with her cuter and richer best friend Sabine (Olivia Nikkanen) instead, Sabine tells Regan her secret was she sent Austin selfies of her in her underwear, and if she wants to get him back Regan should do the same. She does so, and Sabine critiques the photos, saying that she looks good in red (her bra was red) but she needs sexier undies to strike lust in the heart of her chosen male.<br><br>Accordingly, on a shopping trip for clothes with her mom, Regan shoplifts a hot, sexy bra and panties — we get the impression it's less because the family can't afford them and more because mom would never buy things like that for her in a million years — and her new set of sexted selfies gets spread all over the school and instantly earns her a reputation as a slut. Meanwhile, Regan frequently visits mom, who works as a nurse, at her hospital, where one of mom's duties is giving out tests and treatments for STD's (which may be offered by the writers, Christine Conradt, Chris Lancey and Melissa Cacera, as an explanation for why she's so otherwise inexplicably overprotective of Regan: she sees young people coming in with the wages of sexual experimentation every day!) — and she's attracted the lascivious attentions of Nate (Travis Caldwell), the STD clinic's 22-year-old receptionist. Nate is a young man who doesn't need to work — he lives in a big house and is pretty much alone because his super-rich parents spend most of their time on vacation (indeed, I recognized the house from a previous Lifetime movie, though I can't remember right now which one) — and he's also a suspect in the mysterious disappearance of Lana, another teenage girl from the same town.<br><br>Of course the moment we see Travis Caldwell, who's tall, dark-haired, baby-faced and drop-dead gorgeous, we know he's going to be the sinister stalker who's going to menace Our Heroine — and indeed he does, though he ramps up his campaign of revenge or obsession or whatever to attack her parents as well. Conradt's presence hints at a more interesting movie than the one that got made, and if she had been in charge of the whole project instead of just co-writing an \"original\" (quotes definitely appropriate!) story that got turned into a script by a third scribe, she probably would have made Nate a more complex character and given at least a hint of what made him \"run.\" Alas, Nate got depicted as your typical generic Lifetime sex-crazed maniac who gets progressively crazier as the film goes on. Also, Conradt, Lancey and Cacera offered no clue about how Abby would have reacted when she realized that the mysterious figure menacing her daughter was someone she worked with and therefore knew well and trusted. But the real person who screwed up this movie wasn't any of the writers, nor was it director Tom Shell (who did a perfectly workmanlike, though far from great, job with it), but the casting director, Mary Jo Slater. First of all, though Heather McComb and Emma Fuhrmann look enough alike to be believable as coming from the same family, McComb is young enough she looks more like Fuhrmann's older sister than her mom — and Joey Lawrence looks even younger. Lawrence has got a hot, blond, butch male bod and certainly could give Travis Caldwell competition in the looks department (too bad the writers gave him a character whose virtually only emotion is blustering anger, hardly the stuff to evoke the sexual fantasies I'd probably be having about Lawrence if I got to see him in a different sort of role), but he and McComb simply don't look old enough to have two teenage daughters. And what's more, the actress actually playing Regan's older sister, Gianna LaPera, is blonde, has curly hair and a different body type from Fuhrmann's — though maybe we were supposed to think Regan took after her mom and Taylor her dad, looks-wise. Girl Followed is a pretty generic Lifetime thriller, not all that bad but not transcendent either — though it might have been considerably better if Conradt had got to write it solo — with nice-looking people of both (mainstream) genders enacting a pretty stupid story that offers the usual Lifetime formulae but nothing more than that.","user":"mgconlan-1","rank":[8,9]},{"title":"Is the father a puppet or a non-method actor?","rating":1,"date":"21 December 2017","review":"I've never seen worse acting. The so-called actor playing the father is capable of two expressions. The mother is also wooden but at least can eke out three different faces. If their daughters are breathing, walking, eating, the parents reaction is \"Oh my God! They're gonna implode! The 5.5 big one is gonna swallow them up!\" Dreadful movie and complete waste of time. <br><br>Save yourselves viewers and run for the hills.","user":"donnagray519","rank":[6,7]},{"title":"A story that doesn't hold up.","rating":3,"date":"17 April 2017","review":"So the movie opens with an abduction of someone named Tara and then the bad guy for some unexplained reason changes his entire MO to stalking and falling for a 14 yo. At the end we find out in one sentence \"...Tara is OK...Where the heck was she the entire show that now she is OK?? No explanation at all. Dumb.","user":"psychassist","rank":[3,3]}]