[{"title":"Beautifully made film, but with serious structural and pacing issues","rating":6,"date":"25 December 2017","review":"Other reviewers will no doubt cover the nicer aspects of this film, most notably the overall aesthetics, cinematography, sound, and the performances of the two main characters, more elaborately and in greater detail than I will be able to, so please allow me to focus on the areas of this film where I think should have been better.<br><br>The pacing after the promising first half-hour or so is sluggish at best, downright dreadful at worst. Knowing its runtime, I kept checking the watch to see where I was in the story, and I almost fell asleep twice between 30min to 1hr30min of this film.<br><br>About 15-20 mins worth of footage can easily be cut out of this film with minimal impact on the story progression or the characters. Quite a few of the dialogue scenes in the middle part just seem to go on forever. One example: the Japanese monk tells our main protagonist Bai Juyi of his trip across the seas to visit the Tang Emprie. This takes place RIGHT AFTER about 3 mins of mind-numbing dialogue, and this not-very-useful reveal takes the audience next to a series of scenes taking up another 3-5mins of runtime, scenes which depict his journey and which serve no other purpose whatsoever. This could have been done more cleverly with a flashback or two, each consisting only a few shots, with the monk's voiceover telling us the more important points. I don't know if the script was rushed during development or pre-production, (how can you rush the development?), but the dialogue scenes in Act I genuinely seems better written and more on point than later scenes.<br><br>What's worse, the first Act sets up a rather epic fantasy tale full of suspense and action, an impression which is then gradually crushed within the next hour or so, and will leave audiences more accustomed to traditional Hollywood narrative cinema bitterly disappointed, or feeling misled. I'm not an action fan or a genre fan at all, but I fail to see the point of making a big budget CGI fest set in a fantasy version of ancient China, baiting us with lots of Hollywood style action and suspense building in the first 30-40 minutes or so (in a way reminiscent of the 1999 Mummy, or other similar creature features), and then leaving the rest of the film completely void of both action and suspense, where all the CGI seemed to have done was depicting banquets and minor characters performing minor tricks.<br><br>Even I was bored with all the endless talking and disposition aka Chinese TV opera style narration that occupy more than half of this film, which is a complete waste of its big budget visual spectacles. I could have basically shut my eyes after the first Act, and would have gotten 90% of the story right just by listening to the endless dialogue and voiceover narrations. The storytelling, I'm afraid, simply isn't involving or engaging enough for me to care.<br><br>This is not helped by the fact that our two main characters, who are really well set up and looked really promising, was forced into secondary status and were practically useless in the second half of the story, which is a shame for all the potential for a dynamic relationship that was wasted. Both of the two main characters received decent build-up in the first half, only for it to stop there like an unfinished project. This leads us to another important issue which this film unfortunately does not satisfy, and that is, a coherent structure that makes the entire two hour story an organic whole. Setting up a whole new set of characters, some of them absolutely crucial to the plot, only halfway through the film is a big risk, and I'm afraid it doesn't pay off in this film's case, or doesn't work as well as intended.<br><br>*spoiler alert*\nSince at the core of the plot is a murder mystery, why would you leave our two \"detectives\" out of the solving of the mystery like this? This film makes this year's Murder on the Orient Express look like a detectie masterpiece, when it decides to just show the audience everything they have been asking themselves, plus everything they may have been wondering, plus everything they may not even aware are there, plus some things nobody asks for. The middle part really, really is too long for anyone who can't be satisfied by beautifully choreographed visuals alone. For the entire second half of the movie, our two main characters are just standing there at various scenes, witnessing flashbacks with the audience. They are passive, irrelevant, and useless, and this is such a waste to all the character building efforts in the first half.<br><br>The film basically ends without even a perceivable climax, and I don't mean that there has to be a grand action set-piece near the end. I know the scene which you may think is the film's climax, but to me, it is simply insuffient, narratively, structurally, or emotionally.<br><br>Ultimately, the story is rather similar to some of those ever-so-popular young adult Wuxia novels out there these days, where everybody is secretly in love with everybody else, where everyone and everyone's uncle have been harboring a secret identity/secret past, and artificial plot twists come in ever greater abundance the closer we get to the end.<br><br>To summarize, this is a very good looking film with great visuals and sets, a very promising first Act, and then kind of falls apart halfway through when the film itself becomes a confusing mess of two timelines, two sets of characters, and many irrelevant plot points. 6/10. Okay, but could've been much better.","user":"samzzz-69448","rank":[17,19]},{"title":"Not just having beautiful shots, this film tells a profound story","rating":9,"date":"4 January 2018","review":"Chen Kaige's best film since 21th century. As the biggest Chinese-Japanese co-production film ever, Yao Mao Zhuan is very different from the Hollywood cliches. I can feel the flow between each shot, just like traditional Chinese ink-wash painting. And the story structure is very interesting. It splits into two parts, these two parts are like mirrors, you can find same symbols, characters and plots in both sides. And all those things come together, make the magnificent Tang Dynasty comes alive. However, Chen Kaige is not satisfied in telling the greatness of Tang, but also the dark side, the politics and humanity.","user":"wongrie","rank":[20,29]},{"title":"A interest fable","rating":7,"date":"30 July 2019","review":"If you like magic and ilusion in a interest fable in a ancient China you will enjoy this movie.","user":"lucasmpm-76-370214","rank":[3,3]}]