[{"title":"Smart New Horror from Africa","rating":9,"date":"2 August 2018","review":"Postpartum depression? Post Traumatic Rape Syndrome? Controlling mother syndrome? Haunted by the distant past? A combination of the four? In any case, whatever the girl's problem is-- the cinematography is fantastic! The pacing is excellent! The characters are all well-rounded and realistic. This is a Slasher film, if smart and sassy, so step into this one either able to deal with extreme horror or as a veteran of the same. This is a girl-leaves-home-gets-raped-by-redneck-has-baby-goes-back-home-kills-first-man-who-tries-to-rape-her kind of movie. Just so you know.","user":"beorhhouse","rank":[5,5]},{"title":"Siembamba: Seen it all before","rating":3,"date":"15 November 2018","review":"The Lullaby otherwise known as Siembamba (For some reason) is a horror title with themes we've seen many times before.<br><br>It tells the story of a girl who moves back in with her mother after giving birth to her first child. She's immediatly plagued by visions and begins fear some entity is after her newborn.<br><br>Sadly this movies near exact plot has been done before, you'll see the \"Twist\" coming very early on primarily because it's recycled.<br><br>It looks creepy to it's credit and I love that cover art but beyond that there is absolutely nothing going for the film. I knew from the outset what was going on, how the movie was going to play out and what the big \"Shocking\" finale would be.<br><br>It's 2017 where are the new ideas people?<br><br>The Good:<br><br>Cool cover<br><br>Looks the part<br><br>The Bad:<br><br>Seen it all before<br><br>Things I Learnt From This Movie:<br><br>Does mental illness come from having a child or do you need to be mentally ill to have one in the first place?<br><br>Even a non-parent like me recognises that leaving a baby alone with her is a bad move","user":"Platypuschow","rank":[9,11]},{"title":"Interesting take on postpartum psychosis","rating":10,"date":"16 March 2018","review":"I am well aware of what postpartum psychosis is and this is a really good depiction of it. This movie is more of a psychological horror than a full on jump scare horror. The mental illness was shown very well and for that I'm glad.","user":"youngmelissa-92766","rank":[13,18]}]