[{"title":"There are fake reviews and the cover is poor, but...it's a good movie.","rating":7,"date":"5 November 2017","review":"It's not the first time when I see fake reviews appearing for a decent movie, probably because the movie didn't get enough attention, I don't know. Note to distributors or authors - you're just shooting yourself in the leg, especially when you have a solid material. Stop. Doing. That. People won't believe your movie is decent and you'll just bring the people who will rate it 1/10 not because of the movie, but because of the fake reviews.<br><br>Tagline is also somewhat misleading, it's not really your typical exorcist movie. The cover is somewhat amateurishly made, the movie itself is not like that at all. Why spending budget on making a good movie but not ever think about cover?<br><br>As for the movie, I'd say it's a solid mystery / psychological thriller, told through the two connected stories (present / past events). Also, the one about the past is either shot on film or has a grain filter added in post-production, in any case it's a great touch. It's intriguing and captivating, characters are nothing special, but are memorable and the actors do their job. I also like the acting and voice of Andrew Divoff, he's just as charismatic as he was in Hatred (2017) and he's also playing a religious fanatic here as well. By the end you'll learn why the movie is called \"Demons\" (how I said, it's not really your typical exorcist movie).<br><br>Worth a watch, maybe even two or three.","user":"SashaDarko","rank":[10,15]},{"title":"Aptly Named","rating":10,"date":"8 March 2018","review":"This movie presents an insightful, thought-provoking, and deeply disturbing twist on the common exorcist theme. It's not that the question of the nature of evil is so rare, but that, when considered in the context of the storyline, the answer proves as elusive, as it does in life. Yet, in life, when confronted with such demands, after a time, we generally blow a circuit and change our focus to something else. It is as if mere humans just aren't designed to manage the failures in our design - but, one asks, why not? Why can't we, individually, or as a group, prevent the horrors which abound in our society? The movie gives us the opportunity to simply acknowledge our powerlessness and bewilderment, which are embodied variously by different characters, throughout the storyline. Contrary to the gist of several reviews, the seemingly low key nature of the horror, here, is no failure, but, rather, design. The notion of the invincibility of evil, when one takes a moment to savor the feelings brought up by the absence of triumph in the film, sinks down deep into our constant fears, sorrow, and coping mechanisms, laying bare the inner landscape, for the moment portrayed as a battlefield bloodied by failure, impotence, and defeat. If that seems overdone, pause to consider the lives of just those neighbors you know within a half block, the walking wounded you see everywhere you go, the daily horrors of abuse and neglect sickening so many around us and causing maladaptive reactions which only make things worse.<br><br>For a few minutes after the movie, we ponder the subtleties. If, as implied by the film, evil is not something outside ourselves, but some horror arising within, how can it be combatted, prevented, or accepted? In real life, of course, the situation would have been handled differently; but the film's focus on evil, itself, only benefits from the contrivance, as if to point out that dealing with the symptoms allopathically is all good and fine, when it works; but how can we direclty address a disease so deeply embedded in the human experience?<br><br>The acting was great. In fact, the actor with the most objectionable character does such a believable job that it was hard to watch. To avoid mentally slapping him, I had to switch to appreciating his craft.","user":"brindavani","rank":[7,12]},{"title":"Demons (2017) and the Quest of Indie Film","rating":6,"date":"6 October 2017","review":"Greetings from the Ether,<br><br>We were given the honor to attend an early screening of Demons, a new horror film from Mississippi powerhouse Miles Doleac (American Horror Story, The Magnificent Seven). We would first like to thank the director for the invite and for him reaching out to the Gehenna Post. We hope this will be the first of many, many more early reviews.<br><br>Alas, let's begin!<br><br>Former priest Colin Hampstead turns to a career as an author after an attempted exorcism goes wrong. The victim of said possession is none other than the younger sister of the woman he later marries. Together, and many years after the tragic incident, they battle the demons that aim to put them down, coming to realizations and truths about themselves in the process.<br><br>Now, the first thing that must be noted and thoroughly considered, is the fact that this film is not a Hollywood blockbuster. It is not on tier with many Oscar-nominated films. For average moviegoers, the experience may not be what they would hope. Nonetheless, the ability to admire the work that these artists put their hearts and souls into, with the limited resources they had, is something that we should take into acknowledgment.<br><br>There are good performances here, most notably from John Schneider (Smallville), Andrew Divoff (Wishmaster), and Steven Brand (The Scorpion King). Unlike previous outings with Doleac as director, he chose (in a risk that truly paid off) to put other cast members to the forefront. The character of Colin (played by Miles Doleac) is well done, as all of the director's on screen performances have been to date, but he truly gave the floor to other stars in a way that hasn't been seen and this was perhaps one of the most respectable decisions made.<br><br>Doleac's previous directorial and starring outings, The Historian and The Hollow were both in the field of drama, one being a cinematic academia-based investigation, and the latter being a southern crime noir. Stepping into the realm of horror was brave, and though Doleac doesn't have the most experience in this genre, his skill as a director and screenwriter shine through. There are some solid scares and a few very intense moments throughout the film, while maintaining a structure that is at times changing pretty fast-paced, but at other times seamless. During the Q&amp;A, we asked the director about the challenges he faced tackling the genre of horror, and he said something that we found to be very truthful, horror is \"character-driven.\" The reveals and expanding plot development surrounding the possession and why it happened are exactly that. This, Doleac nailed on the head.<br><br>Keeping in mind the struggles that indie filmmakers face in today's industry, Doleac continues to impress with the resources he is given. In the Q&amp;A after the film, the director revealed that the script was written relatively quickly, and despite the rushed nature of this animal's creation, there is some honest storytelling to be seen. If the director can write a screenplay like this in such a short time, one can only imagine his capabilities if given the proper resources and time.<br><br>Demons has flaws, and doesn't quite surpass what The Hollow achieved, but it is still worth watching, and more importantly, worth supporting. In a day and age where independent filmmakers struggle to gain recognition and have to work endlessly and tirelessly to produce a movie, it is more important now than ever to support indie films. As Doleac pointed out in the Q&amp;A, the theater industry is dying and it is near impossible to work from the ground up, setting your own foundations in the process.<br><br>Many facets of the film didn't work but the ones that did made up for it. It will be interesting to see where Doleac goes from here and if he chooses to pursue horror again. We are excited to see his progression as a director, actor, and screenwriter. We encourage you, our readers, to watch this film and to support indie film- making. Demons is not The Exorcist or The Conjuring but we hope it is the first in an ever-improving filmography from Miles Doleac.","user":"gehennapublishinghouse","rank":[10,19]}]