[{"title":"Plan 10 from Outer Space","rating":1,"date":"2 July 2018","review":"Aliens, ancient aliens, Roswell, atomic bomb....back story. Then we have Jack, who in 1988 was fighting in Iraq? While Hussein was still in power? No explanation. Then there is an alien that has Jack's DNA...which is on file because? Is Jack a criminal? sexual predator? Once you get past that, the track lighting, 70's wood paneling, and an alien woman who looks like she fell asleep in a tanning booth (nice cleavage) it is a pretty bad film. The dialogue was boring and trite. The acting was phoned in. The fight choreography was done using speed up and slow motion. Dominique Swain was a cameo. <br><br>Guide: F-word. No sex or nudity","user":"nogodnomasters","rank":[18,18]},{"title":"Some other dog, Not the Jetson's dog","rating":1,"date":"19 June 2018","review":"This movie is confusing, poorly written and badly edited and I wish it could have been better. A movie should tell a story, this story is so incongruent as to baffle even the most imaginative viewer. The story is about a billionaire right? No! it's about some ex-special forces guy who gets healed by aliens after being cut down in some middle eastern firefight. He's got a daughter who's gorgeous and actually does a fair job in her role. The fight scenes are fairly well choreographed the billionaire's son is a psychopathic freak, The main character speaks with a foreign accent yet his brother does not. The captive alien has his DNA but it's never properly explained how. The big boobed alien chick is visually spectacular but we never get to see her topless so don't wish for it. This movie goes on and on about secret societies, aliens living amongst us, transfer of technology... blah blah blah and until I was nauseated.","user":"tread-12728","rank":[14,14]},{"title":"unless you are MST3000 skip it.","rating":1,"date":"2 July 2018","review":"I could spend the day picking on 100's of little things that make this horrible.. but frankly, that is extremely low hanging fruit at this point... Instead I will focus on the major things. The screen play is poorly written and needs a rework.. The plot is not confusing as much as missing. The show is full of poorly realized cliché. If I could give this movie a half star I would have. Could have been at least a good idea; If only I could figure out what that idea might have been.","user":"doran7","rank":[23,25]}]