[{"title":"Jumble Sale of a film","rating":1,"date":"27 November 2019","review":"Quite why they made this remake I cannot fathom, let alone why it was set in wartime. The heroine's clothes, hair and make up were 10 years ahead of time, and some extras in a bizarre 'air raid shelter' (or 'thin sheet of painted corrugated iron' by a 1970s wall, to be exact) scene seemed to have been dressed by a 1990s jumble sale, with hair in a style no 40s woman would have been seen dead in, war or no war. Decor was courtesy of the 1980s - polyester peach-coloured ruffles included.<br><br>The story could have held promise, but the acting, settings, decor, costumes etc made me wonder if setting it in the present may have been wiser if their increased (?) budget didn't make it possible to achieve any kind of temporal accuracy. I even heard a radio announcer referring, in a non RP voice, to June 6 - US date format never used then - on a portable radio standing on a mangle! It may have given a sense of what was happening, but radios were very heavy and large, NEVER portable.<br><br>Suffice to say that the huge inaccuracies simply spoilt the film for me. It was like watching an amateur production. Sadly disappointing.","user":"fluffyfour","rank":[3,3]},{"title":"👎🏼","rating":1,"date":"25 September 2019","review":"This movie is absolutely a waste of time\ndon't bother yourself watching it","user":"88ni","rank":[11,17]},{"title":"My Review Of \"The Baylock Residence\"","rating":6,"date":"14 October 2019","review":"The story is the classic gothic ghost story with an almost longing reminisce of the past and lost bygones. \"The Baylock Residence\" stays within a refined, romantic style of storytelling where showing a past history, even one that is dark, means more than the shock value of modern paranormal horror. It is a neat, subdued thriller with more melodrama and theatric characters with tone-down horror elements.<br><br>The acting is pretty decent, it never reaches the fully developed attributes that make you truly feel these characters, but the actors know there lines and understand the material. I did feel the film lacked the atmospheric authenticity to make me really feel like I was lost in the time period. However, structurally, everything seemed to represent the time period \"The Baylock Residence\" is set.<br><br>The cinematography is done nicely. It is straightforward, unexaggerated third person point-of-view. It stays pretty traditional. Honestly I felt this movie plays well in a Masterpiece Theatre, made-for-TV market. The horror is very mild, \"The Baylock Residence\" features the expected gimmicks and CGI tricks one would expect from stuff like 'The Ghost Whisperer'. Overall the movie won't appeal to the \"Insidious\" crowd but if you like period melodrama with a spooky edge then check it out.","user":"ASouthernHorrorFan","rank":[3,4]}]