[{"title":"It may as well be the best musical theater on film I have ever seen","rating":10,"date":"22 October 2016","review":"Miss Saigon. I've seen it in the theater numerous times, in Dutch, German and English. I knew cast members who could sneak me in and seat me next to the engineers. I even auditioned for it. I know this show front stage and backstage. You might say, I'm a fan. <br><br>Talks about a movie being made made from it made me excited and worried at the same time (see what they did to Les Mis, the show is good, but the movie sucked in so many ways). Probably their decision (for now) to do the theater registration as a movie was really smart. This way you could not lose the pace of the story, the whole drama is already finished and the only thing you need to do is put a camera on it. <br><br>Sometimes I'd forget that they were on stage, you would hear the audience react sometimes and even than it was not completely clear if it was inside the cinema or inside the movie (I was seated last row). It could easily have been inside the cinema, the rest of the people clearly enjoyed it as much as I did, also for them it was a great night. <br><br>The acting was great, the singing was great and of course the story, based on the Opera Madame Butterfly, is a solid drama. It was filmed pretty up close, there were not so many wide shots, which made you get deeply involved in the drama even more than in the theater. At several moments, because of the music, the story, the acting, I just burst out in tears. Oh how I love me some musical drama. <br><br>And when the story was over, the show went on and featured a grand finale with (some of) the original cast members returning to the parts that made them famous or won them Tony's. And they were funny, really funny. <br><br>So this movie or registration or whatever you like to call it, did for me what so many movies can't seem to be able to do these days: move me. The logo for theater that has been used many times is the laughing mask and the crying mask and this night, in the cinema, this all came together perfectly. It may as well be the best musical theater on film I have ever seen. Very well done.","user":"koen_smit","rank":[28,30]},{"title":"Wow","rating":10,"date":"16 November 2016","review":"To quote the critic of the Daily Mail, \"The best live film of a stage show that I've seen\". And I fully agree with him. I am an avid fan of musicals with a DVD collection over 700+.<br><br>Having had to wait 25 years since my late wife and I saw it at Drury Lane, London, I have had to be content with the CD. <br><br>This production and the DVD are worth more than 10. If you buy only one DVD of a musical, stage or screen, it has to be this one. From the two showstoppers at the beginning and end, The heat is on in Saigon and American Dream, to the beautiful duet, The last night of the World, the score and the performances are fantastic. <br><br>After Les Miserables, still the best musical ever, Boubil and Schonberg came up with another smash, this time based on Madame Butterfly. And thanks to Cameron Mackintosh for his foresight in producing both shows.<br><br>Bringing this show to a smaller stage than Drury Lane created several problems the least of which was the helicopter and the number involving the statue of Ho Chi Min was more cramped. <br><br>There are two extras with the DVD, one giving a history of the musical and the other, the after show performances from the original cast which reduced me to tears of joy. Each member of both casts and the production team deserve a huge amount of applause, which they duly got.<br><br>The close up singing shots strongly suggest there were so many cameras, that many were on stage and thus part of the performances were filmed not on the night. If you love musicals, this one totally without fault with a dream cast and incredible production values. Enjoy.","user":"david_kravitz","rank":[9,10]},{"title":"A truly spectacular musical","rating":10,"date":"3 August 2017","review":"In 1985 Claude-Michel Schönberg and Alain Boublil brought us the outstanding musical 'Les Misérables', and only 4 years later they stunned theatre goers again with another spectacular musical, 'Miss Saigon'. Once notice got out that a new revival of the show was to return to the West End in 2014 for a limited run, the anticipation and excitement was enormous. Miss Saigon is set during the Vietnam war and tells of American G.I. Chris and Vietnamese bar girl Kim as they fall in love, and when the Americans finally pull out of Saigon, their lives are torn apart and the aftermath takes a heart-breaking turn as 3 years later, we learn, Kim has had Chris's child, Tam, and Chris has taken an American wife. Well, the show is currently on a tour of the UK and in my opinion, must be seen. It is incredible. There are some fantastic numbers, including the powerful Act 2 opening number 'Bui Doi' and the over-the-top showstopper 'American Dream'. Also, be prepared for the emotional ending which will have you reaching for the tissues. Although those, like me, who saw the original will notice some changes in this revival (and not for the better either, but you know me and change, I never like it). From lyric changes which spoilt the flow of the songs and the replacement of 'Now That I've Seen Her', a fantastic number for the character Ellen, in favour of a ridiculous number called 'Maybe', to the disappointing change made to the stand-out scene of the helicopter descending onto the stage, this is now nowhere near as impressive as it was and is now partly done with a projection. Having said all that, Miss Saigon is still easily one of the best musicals to hit the West End, and the special 25th Anniversary performance was just perfection (and was filmed for a one-off screening in cinemas, and can be bought on DVD to enjoy repeatedly). Jon Jon Briones is sensational as The Engineer, he is conniving, seedy, funny, ruthless and sleazy. Eva Noblezada is sweet and assured as Kim, and Alistair Brammer, too, is excellent as Chris, with a strong stage presence and another wonderful voice. Watch out too for the final 35 minutes of the DVD as a special encore brings together the original cast with the 25th anniversary cast to sing a few numbers and pay tribute. It is spine-tingling stuff. Original cast members Lea Salonga, Simon Bowman and Jonathan Pryce perform alongside their contemporaries. This was a well-meaning touch, but did the anniversary cast no favours. Even 25 years later, Salonga and Pryce were spectacular, helping explain why that first production was such a success (despite some daft controversies at the time). When Miss Saigon opened on Broadway in 1991, there were protests that the cast had too few Asian Americans; others complained about the then-outrageous top ticket price of $100. All that died down long before the original production finished its run a decade later, and it is now the 13th longest running show in Broadway history. There is also talk of a movie adaptation being produced (however I am seriously hoping it isn't an atrocity like the movie of Les Mis). If you love musicals then make sure you get the 25th Anniversary DVD, and get to see the show while it tours the UK. You will not be disappointed.","user":"ChristianLeFeuvre","rank":[3,3]}]