[{"title":"Where were the real fans?","rating":6,"date":"25 October 2019","review":"A rags to riches to rags again story. This is how White Wolf blew it big time when they had what was probably the biggest RPG property in the world. It was sad to see, especially when the company basically took an enormous dump on their loyalest fans for the sake of a buck. Who knows, they may have still been around if not for that single event alone.<br><br>What also struck me were the 'fans' they depicted as being VtG fans. They were all young, thin and beautiful. They were stylishly dressed or immaculately costumed if it was a historical setting. It just seemed a bit, improbable? Believe me when I say I have met many fat goths in my time and many fat role players, I didn't see either in the film. They all looked like fetish models, even the ones trying to look ugly. I suspect the hiring of extras or, at the very least, some very careful vetting!<br><br>Disclaimer: I'm not oil painting either and could certainly do with shedding a stone (or two.)","user":"midnightmosesuk","rank":[1,1]},{"title":"Rise and Fall of an RPG Empire","rating":8,"date":"9 October 2019","review":"This is essentially a documentary about the business side of White Wolf, a rise and fall of their company, interviewing the company heads and lead creative people behind their immensely popular game, Vampire the Masquerade. Throughout the documentary, there are interviews with fans of the game, particularly the live action version (called LARP).<br><br>The fan interviews left much to be desired. They basically talked to people who found a sense of belonging with the game and community, and showed scenes of them dressing up in costume and at Vampire LARP parties, but didn't go into their actual characters or how they actually play the game. We are told that this game was a huge influence and had this dedicated, die-hard community, but after watching the movie, I'm still not sure why.<br><br>As far as the documentary itself, one thing I found striking was how much greed and arrogance is on display from the former company heads. They claim the entire vampire popularity of the late 90's and early 2000's is entirely due to their game, and clearly were sue-happy when faced with financial trouble. This is despite the fact that the Vampire genre was already huge and popular before their game existed. They even sued their own fan club for using the name \"Camarilla\", alienating their most dedicated base. Even though we are shown that sales dropped off as a direct result of that, the execs still seem oblivious to their own behavior in destroying the good will of their name.<br><br>While Shane Defreest is busy claiming every vampire related movie or TV show ripped off the game, the actual creator of the game (who was fired by the company at the first sign of financial trouble), admits that he took ideas from popular 80's vampire movies, which, unbeknownst to him at the time, were all influenced by the best-selling Anne Rice. He's the only one who acknowledges Anne Rice's influence on the popularity of the Vampire genre in the 80's and 90's. She was still huge then, but Defreest and the rest seem to not actually read books or watch vampire movies that came before their game. The only person who can really claim to have been copied is the artist Tim Bradstreet, who was actually told his art was used in the first Blade movie by the film's creators.<br><br>In the end, they were done in by a series of bad business decisions, their own greed, hubris, and total lack of respect for their own fans as well as the creative people who helped bring the modern Vampire genre to life.<br><br>I have a feeling if Stewart Wieck hadn't passed away right before this film was released, more people would be talking about what a greedy jerk he is, instead of praising him as a genius.","user":"schlomo-jones","rank":[1,1]}]