[{"title":"Absolutely adorable","rating":28,"date":"28 October 2017","review":"I really enjoyed this Christmas movie. I fell in love with all the characters from the start. A few I started to loathe by the end, however. <br><br>I loved Meredith as the character Cynthia. She's so bubbly and fun to watch throughout the movie as she searches for her true love. Despite being adorable, it really started to bother me how she treats Liam after she thinks she's found her true love/the mystery man sending gifts. A true friend wouldn't be THAT blind to her best friend obviously pining over them. Nor would a true friend uninvite them to a wedding after dragging that friend to town to be their date.<br><br>I was so happy when Cynthia runs to Liam after she's all out of options he calls her on her BS, telling her he doesn't want to be her \"leftovers\". GOOD FOR YOU LIAM! Of course it's a Hallmark movie so you know there will be a happy ending in their future.<br><br>As much as I liked Janet (Cynthia's sister) in the beginning of the movie she seriously started to bother me the way she treats her fiancé, Roger. She's HORRIBLE to him for giving a crap about their wedding. She berates him for having bridal magazines and completely goes off on him for trying to plan a surprise honeymoon! I get he's a total accounting nerd and maybe he has no other options but neither of them actually appear in love and have zero chemistry. Janet buys the ugliest wedding dress ever and whines she's not a princess and just wants a simple, quiet marriage. Then why bother having a wedding in the first place? Go to the courthouse and stop being a total **curse word**. <br><br>Overall, I really loved this movie and have watched it several times.<br><br>PS - I love, love, love Gregory Harrison in every Hallmark movie. He's great in My Christmas Love and I loved him in Nine Lives of Christmas too!","user":"RenT-83065","rank":[8,8]},{"title":"What am I missing?","rating":3,"date":"19 December 2017","review":"I'm not sure what is appealing about this movie? The plot and premise isn't bad but the two sisters, the main characters that the story revolves around, are so unlikeable. Cynthia's problem isn't her perkiness, it's her selfishness. She starts off coming on way too strong with her boyfriend, then after he dumps her, she drags her friend Liam along with her just so she can have a date to her sister's wedding. When the 12 days of Christmas gifts start showing up, she automatically assumes that they must be for her. The rest of the movie is spent with her trying to figure out who sent her these gifts, including bugging all her old ex-boyfriends. At last, she goes after poor Liam (the best friend who is secretly in love with her trope). He rightly points out that she's come to him since there's no one left and leaves, realizing how shallow she is. He shouldn't have come back, he deserved better.<br><br>The other sister, the polar opposite, is completely miserable about her own wedding and hates everything to do with romance and Christmas. When her fiance wants to take her on a honeymoon, she throws a fit. Whenever someone mentions something romantic, she rolls her eyes like a 5 year old. She claims she wants to keep her family together, but it doesn't seem to matter what the father's opinion is. She just knows what's best for everyone. <br><br>In the last fifteen minutes of the film, it's revealed who the gifts are actually from, and it highlights how self-centered both sisters are. Then of course, they have their dramatic transformation, but it comes way too late. After the way they acted through the whole film, it wasn't believable. I felt bad for the rest of the characters having to put up with these two. <br><br>I'm giving it three stars because it was well produced and the acting was fine, it's the character writing that needed serious work. I watch these movies every year and this is the first time I was gritting my teeth at the end. <br><br>Want to see a good Hallmark Christmas movie? Try 'Window Wonderland' and 'Hitched for the Holidays'-- for funny, campy romance and 'A Nutcraker Christmas' or 'Journey Back to Christmas'-- for more dramatic, if sometimes cheesy romance. Want something with the similar 12 gifts until Christmas theme? 'On the Twelfth Day of Christmas' does this premise infinitely better than this movie. Hallmark has some great Christmas movies but this is not one of them.","user":"cjp-85196","rank":[12,13]},{"title":"Too perky and selfish main character","rating":27,"date":"27 December 2017","review":"Meredith Hagner was far to perky in the ole e as main character. She needed to play it down a bit more. Also the scriptwriters wrote the most awful main character for the film. She immediately assumed the gifts were for her because the accountant fiancé could no way have thought to sent such a gift. I really couldn't take to her at all.","user":"KikiT4","rank":[15,17]}]