[{"title":"If the writing was better, this film would've been a hit.","rating":7,"date":"14 December 2018","review":"It was good to see such great performances from Ron Perlman and Famke Janssen, but Richard Dreyfuss was about as convincing as his fake accent. The directing was right on point, as was the score. But the writing from amateur Jay Zaretsky is what killed this film. This was only his 2nd (first being a short) writing attempt, and although the story premise in itself was decent, the screenplay was terrible. This film needed a seasoned screenwriter to edit/cut out and speed up the overly slow paced and too long 117 min length down to 80-90 mins, as well as fix some of the poor dialogue. Had this film been played at 1.2x faster speed, it may have held my attention better. The entire last 15-20 mins only needed to be 5 min. Great to see Ron Perlman back on the big screen, need to see more of him in these type of roles, and hopefully we will. It's a 7/10 from me - would have been 8 or 9/10 had the screenplay been edited down and tighter.","user":"TheTopDawgCritic","rank":[30,35]},{"title":"Too cliched","rating":4,"date":"29 September 2019","review":"A lot of people have a lot of nice things to say about HITMAN REDEMPTION, a low budget action thriller starring Ron Perlman in a LEON-esque role, but I'm afraid I don't buy it. This one's just one step above an indie in terms of directorial budget and convincingness, and the whole thing smacks of cliche and predictability. As usual a hitman plays to retire after one final job, but things get messed up along the way and he himself becomes a target. Give me a break. This plot's so old it needs decent suspense and action to make it work, but sadly HITMAN REDEMPTION has neither of those; it's merely average. The one thing it does have going for it is a better-than-average cast, with Famke Janssen sensitive in a key role and old-timer Richard Dreyfuss popping up for the fun ofi t.","user":"Leofwine_draca","rank":[5,5]},{"title":"Interesting Piece of work....","rating":8,"date":"8 January 2019","review":"I just finished watching this piece. With an amazing cast like this. One will want to view this film. Ron Pearlman, brilliant as always, Richard Dreyfuss, Jacqueline Bisset. With this cast of actors on board. It'll make any film come out on point. Famke as beautiful as always. I always enjoy her performances. Overall not a bad piece of work to watch. This kind of film has been done before but you will enjoy this cast of extreme professionals as they make it look so real. I did enjoy watching...:)","user":"battlebuckships","rank":[12,16]}]