[{"title":"Cheesy and low-budget...but not unwatchable","rating":4,"date":"17 June 2019","review":"Not surprisingly at all, this low-budget film is pretty cheesy. The whole production is average at best, but it's not completely bad. The story is pretty played out, the effects are subpar, and the acting isn't going to win any awards. That being said, it is apparent the cast and crew actually tried to do the best with what they had to work with and overall it is watchable. I'm saying that it's good, but movies like this are usually only worth a 2 star rating but this one is worth a watch if you feel like turning your mind off for a little bit and enjoying some cheesiness. 4/10","user":"mikedegroot","rank":[5,6]},{"title":"VIEWS ON FILM review of A Haunting at Silver Falls: The Return","rating":3,"date":"2 July 2019","review":"\"Just like Ghostbusters\". No, not at all. Not just like Ghostbusters. Ghostbusters had a known cast, fresh comedic dialogue, production values, and box office sway. A Haunting at Silver Falls: The Return (my latest review) is more akin to a fanboy, student film version of The Ring.<br><br>Anyhow, have you ever seen a movie where the budget constraints are so abundant the pseudo-Hitchcockian scenes are cut off at midpoint? And have you ever seen a flick where the musical score is the same two chords used in countless scare fests via the last twenty years? A Haunting at Silver Falls: The Return is that movie and it's a sequel that needs to be \"returned\" to your local Redbox stat!<br><br>\"Return\", with its E-list stars, its community theater acting, its wink wink to all things VOD, and its massively cheapo special effects, is a continuation of 2013's A Haunting at Silver Falls. Devoid of any suitable jump scares, any jim-jams, and lacking anything resembling the conch of capable editing, \"Return\" is only frightening if you've never seen an actual horror film before. Yeah there's a couple of twin ghosts in \"Return\" that are clearly inspired by the siblings in The Shining. Still, they aren't nearly as creepy as those pale-edged girls from Stanley Kubrick's 1980 hit.<br><br>Shot in Oregon (which sort of looks like rural Europe) and directed by a cut corners rookie (Teo Konuralp), A Haunting at Silver Falls: The Return has to do with a phantom aunt who uses the body of a ruthless convict to terrorize a bunch of young twentysomethings.<br><br>Look for characters saying the most cliched of fright night readings (\"we've gotta get outta here\" or \"if we're gonna survive, it's now or never\"). Also, know that \"Return\" is probably the most restrained, PG-13-style horror pic you'll ever take in. Its non-theatrical release can be put alongside any recent Amityville-franchised endeavor. Bottom line: \"Return\" is hardcore \"downturn\". My rating: 1 star.","user":"burlesonjesse5","rank":[3,4]},{"title":"UNBEARABLY STUPID DO NOT WATCH THIS GARBAGE","rating":1,"date":"1 July 2019","review":"It isn't scary, the dialogue is so dumb it's almost funny, and the special effects are non existent. The director really made the trailer look decent and I'm a fool for having spent money to watch this trash. This \"spirit\" hides in a corner and tries creeping out like a human actor.. I just can't. Please save yourself the time and skip this one. Oh and the plot makes NO logical sense.","user":"melodydetrick","rank":[3,4]}]