[{"title":"Goodbye, Adam West (1928-2017).","rating":10,"date":"9 April 2018","review":"This film is the perfect way to cap off the career of Adam West. With the script by Michael Jelenic &amp; James Tucker (inspired by a story by Harlan Ellison), and a supporting cast of Burt Ward, Julie Newmar &amp; William Shatner as \"Two-Face,\" there can be no better way to bid farewell to the Caped Crusader. At the film's end, comes this heartfelt goodbye: \"Rest Well, Bright Knight.\" We'll never forget you, Adam. Godspeed.","user":"mkurland23","rank":[9,10]},{"title":"You are forever legend Adam West 1928-2017","rating":9,"date":"31 December 2017","review":"This animated film is a great tribute to Adam West who made the role of Batman iconic, sadly passed away the summer of 2017 at 88. But it was a joy watching this, like the other Batman animated movie which where also by Adam West and Burt Ward. this one also never takes itself seriously.<br><br><br><br><br><br><br><br><br><br><br><br>William Shatner does bring his own charm has the voice of Harvey Dent/Two Face, so does Adam West and Burt Ward has Batman and Robin. But there is a spoof moment between Julie Newmar as Catwoman and Lee Meriwether who voices a lawyer, but who also played Catwoman in 60's series. The animation was wonderful done. Any fan of the 60's Batman series will find this fun, It's a wonderful way to remember Adam West.","user":"DarkVulcan29","rank":[8,9]},{"title":"Pure nostalgia","rating":9,"date":"15 October 2017","review":"Anyone old enough to remember the original 60's Batman TV series will love this. It's great that this movie mirrors the 60's show i.e. it has the old batmobile and even better the voices of Adam West, Burt Ward and Julie Newmar as Catwoman. Another former Catwoman Lee Meriwether also has a small part. William Shatner does an excellent job as Dent/Two face and the whole movie embraces the tongue in cheek wackiness of the original series. This must've been one of the last projects Adam West was involved in prior to his death. All I can say is that he went out on a high.","user":"beej44","rank":[17,23]}]