[{"title":"All the same \"Jackals\"","rating":5,"date":"7 June 2018","review":"It often happens that the directors stand in the place of the editors, and also the editors become directors. So it happened with Kevin Grotert, the same person who mounted all the beloved \"Saw\" as a \"Game of Survival\", and several subsequent films. But, unlike the first \"Saw\", in the projects \"Saw 3D\" and \"Saw 6\" Kevin acted as a director. In addition, he withdrew the \"Jezabel\" and the same horror \"Visions\" with Jim Parsons.<br><br>The story of the \"Jackals\" or, as decided (cruel and merciless) Russian hire \"Circles of the Devil\" tells of a family who has gone to a small house in the middle of the forest to get his son out of the sect. The theme of the story is reminiscent of \"Strangers\", \"You are the End!\" And of course \"The Last Expulsion of the Devil\", but here is a much simpler concept, during which we watch an hour and a half as a guy tied to a chair sits and depicts an obsession.<br><br>From the positive aspects of the film I can highlight the realistic game of Ben Sullivan and Stephen Dorff, who literally decorated the picture with his presence. As soon as it becomes smaller in the frame, the film ceases to be interesting. Even beautifully shot scenes, with a chilling blue color that enveloped the backyard and killers in masks, does not save this mediocre story.<br><br>\"We need children ...\" - may be needed, but only in this desire there is absolutely no drama, nothing that would catch the viewer. The killers copied from \"Strangers\" do not have their own character, they are only a murder weapon, whose story is not interesting to learn.<br><br>\"Jackals\" or, excuse me, \"Circles of the Devil\" - an unfinished project that looks once, and then safely forgotten.","user":"BiiivAL","rank":[70,80]},{"title":"Not terrible, but not at all memorable either","rating":2,"date":"2 September 2017","review":"Just another knockoff of The Strangers. In fact, this director worked on that movie, so I guess that's where he got the idea. The bad guys here have slightly more motive than in The Strangers, they're attacking this house to get one of their members back, but beyond that we know absolutely nothing about them or their motives, only that they're another group of mysterious masked people who like to arbitrarily torture and murder anyone in their way. <br><br>It's not a terrible movie, but it doesn't really do anything new or interesting either. It's watchable, but completely unmemorable. Don't expect any form of satisfaction from the ending either. <br><br>One more thing. Why did they bother to make this set in the early 80's? It seemed to have no bearing at all on the plot or characters and if it wasn't for the old style TV and picture of Ronald Reagan on a mantle that they show for a few seconds in the beginning, you'd never know this was supposed to be happening in the 80's. There's no 80's feel to anything in the movie. Somehow I suspect that they did this for the sole purpose of creating an excuse for no one to have a phone...","user":"horrorgasm","rank":[25,27]},{"title":"If only it was made in 2006......People who r comparing it to The Strangers aint aware of the far superior French film Them aka Ils.","rating":7,"date":"20 May 2018","review":"Saw this recently on a blu-ray. Had seen the trailer n the concept of cult group n the theme of home invasion piqued my interest. Of course Kevin Greutert's name was the other good factor. The guy being an editor himself knows how to control his film's pacing and how to build suspense.\nMost people r comparing it to The Strangers (2008) but if u read the trivia section, the script of this film was written in 2006. The other thing is Greutert was the editor for The Strangers but the real fact is The Strangers itself was a copy of the far superior French film Them aka Ils (2006).\nComing back to this film, the director managed to start the film well with the initial home invasion murders a la Halloween style n then cut back to the van kidnapping scene n the cabin in the middle of nowhere.\nThe settings n era were good too. The 80's era was obviously to show the lack of mobile phones n a reference to the Charles Manson cult group.\nThe mask-wearing villains were creepy, Stephen Dorff's role was very small. I really wanted some showdown between him n the villains.\nSome viewers may complain that it would hav been better for the family to leave the cultist son but if u notice the start scene, the cultist person do come back to slaughter his family.","user":"Fella_shibby","rank":[29,32]}]