[{"title":"Is it a comedy or isn't it a comedy?!","rating":6,"date":"24 October 2017","review":"In the description of \"Under the Tree\" in the film festival guide, it was a bit difficult to see whether or not the movie was a comedy. And, in watching it, this difficulty was NOT alleviated. Some folks saw the film as an ultra-dark comedy (perhaps like \"War of the Roses\") others saw it as a drama or cautionary tale. As for me, I just felt it was too dark to be laughed at and overall I found that it was well made but miserable to watch.<br><br>The film is about a husband-wife who split up as well as the parents of this husband and their arguments with their neighbors about unimportant things. In both cases, the people become so embroiled in winning that they lose sight of what is right and what is reasonable and it all occurs in stages.<br><br>At times, the film just went too far with these arguments. For example, one neighbor couldn't find their cat so they assumed the neighbor killed it. So, they had the neighbor's dog euthanized, stuffed and left it on their doorstep. Some might laugh at this...I was just horrified. The acting was good and the film watchable but incredibly nasty and unpleasant.<br><br>By the way, something extraordinary happened during this viewing at the Philadelphia Film Festival. One man in the audience was laughing uproariously throughout the film. His response was extreme and unusual to say the least. Well, it apparently really offended another guy in the theater and through the course of the film they began screaming at each other. At the finale, it got uglier and I rushed to get Film Society staff because it looked as if they'd come to blows!! So, obviously one guy thought this was a great dark comedy and one thought it was a drama and it was offensive for anyone to laugh at the hellish story. Amazing that neither apparently saw that they were acting out the picture!!","user":"MartinHafer","rank":[27,33]},{"title":"Hilarious, unsettling, and thought-provoking","rating":8,"date":"19 February 2018","review":"Atli is pushed out of his home by wife Agnes after she discovers him watching a sex tape that features him. He tries desperately to talk to her and get time with their daughter Asa at her kindergarten, but his behavior turns stalker-ish. Atli has crashed at his parents' place: Baldvin and Inga have commenced a fight with their neighbors over a tree in their yard that the neighbors, Konrad and trim young second wife Eybjorg, complain throws too much shade on their deck.<br><br>All the characters misread situations, let their anger push them to escalate in vengeful responses, and often give one another good advice which nobody follows. It might be misleading to call \"Under the Tree\" a dark comedy, because although it is often hilarious and even approaches over-the-top farce at times, the plot raises multiple serious issues in its fairly believable yet inexorable way, from aging and mental health, to grief and the fatal consequences of failing to speak up when one should.<br><br>Coolly but beautifully shot, and fiercely acted, especially the unsavory roles portrayed by Steinþórsson as Atli and Björgvinsdóttir as his fierce and cruel mother Inga, this is a startling story that does not take any easy turns.","user":"dloft59","rank":[15,18]},{"title":"Decent, but forgettable","rating":6,"date":"20 August 2018","review":"Anyone who knows anything about Scandinavian cinema knows two things. The first is that Nordic noir is huge at the moment. Originally used to describe crime fiction told from the perspective of the police (good examples are <a href=\"/name/nm0803711/\">Maj Sjöwall</a> and <a href=\"/name/nm0883908/\">Per Wahlöö</a>'s Martin Beck novels, <a href=\"/name/nm0542520/\">Henning Mankell</a>'s Kurt Wallander novels, and <a href=\"/name/nm1867674/\">Jo Nesbø</a>'s Harry Hole novels), the term has more recently been employed in relation to a wider-ranging genre of television shows (<a href=\"/title/tt0826760/\">Forbrydelsen (2007)</a>, <a href=\"/title/tt1733785/\">Bron/Broen (2011)</a>, <a href=\"/title/tt3561180/\">Ófærð (2015)</a>, <a href=\"/title/tt3498622/\">Fortitude (2015)</a>, <a href=\"/title/tt4836846/\">Midnight Sun (2016)</a>) and films (<a href=\"/title/tt0119375/\">Insomnia (1997)</a>, <a href=\"/title/tt0805576/\">Mýrin (2006)</a>, <a href=\"/title/tt1731998/\">ID:A (2011)</a>, <a href=\"/title/tt2106476/\">Jagten (2012)</a>). The other thing that anyone knows is that Nordic comedy is jet black, with its opacity often such that non-Nordic audiences are left asking \"was that really a comedy?\" Not necessarily because they didn't find it funny, but because they're not entirely sure what parts they were supposed to find funny, how they were supposed to find it funny, even if they were supposed to find it funny.<br><br>I'm thinking of films such as <a href=\"/title/tt1740707/\">Trolljegeren (2010)</a> (found-footage of a trollhunter, who operates by weakening his quarry with the sounds of Christian rock), <a href=\"/title/tt1401143/\">Rare Exports (2010)</a> (a research team in Lapland find a massive underground chamber, in which is held a hibernating Joulupukki, the murderous Scandinavian precursor of Santa Claus), <a href=\"/title/tt1034314/\">Iron Sky (2012)</a> (Nazis living on the moon since 1945 return to earth to re-establish the Third Reich), <a href=\"/title/tt2113681/\">Hundraåringen som klev ut genom fönstret och försvann (2013)</a> (the 100-year-old resident of a nursing home escapes from a window and has a series of adventures), <a href=\"/title/tt2675914/\">Kraftidioten (2014)</a> (a snowplough driver starts a gang war whilst seeking vengeance for the death of his son), <a href=\"/title/tt3296658/\">Hrútar (2015)</a> (two brothers who haven't spoken in decades must work together to save a herd of sheep), and <a href=\"/title/tt3877674/\">Mænd &amp; høns (2015)</a> (a group of five middle-aged half-brothers learn of one another's existence for the first-time). In Iceland, the term used to describe this kind of comedy is \"gálgahúmor\" (\"gallows humour\"), and it's a style which is often lost on international audiences - as the brief plot summaries above suggest, it often focuses on dark subjects which one wouldn't immediately recognise as comedic - what we might term, only partially correctly, as \"tragi-comedy\". And so, with all of this in mind, we have Undir trénu, as textbook an example of gálgahúmor as you're likely to find.<br><br>Written by <a href=\"/name/nm2619779/\">Hafsteinn Gunnar Sigurðsson</a> and <a href=\"/name/nm1458057/\">Huldar Breiðfjörð</a>, and directed by Sigurðsson, the film begins with Agnes (<a href=\"/name/nm3987519/\">Lára Jóhanna Jónsdóttir</a>) accusing her husband, Atli (<a href=\"/name/nm2621096/\">Steinþór Hróar Steinþórsson</a>), of cheating. Although he denies it, she throws him out, and he returns to his parents, Baldvin (<a href=\"/name/nm0797610/\">Sigurður Sigurjónsson</a>) and Inga (<a href=\"/name/nm0084908/\">Edda Björgvinsdóttir</a>). A shadow hangs over the family in the shape of the disappearance years earlier of Atli's older brother, Uggi. Whilst most people, including Atli and Baldvin, believe Uggi committed suicide, Inga refuses to accept this, still expecting him to return home at some point. Next-door live Konrad (<a href=\"/name/nm0045489/\">Þorsteinn Bachmann</a>) and his wife Eybjorg (<a href=\"/name/nm1485923/\">Selma Björnsdóttir</a>), who is closer in age to Atli than she is to Konrad himself. The two couples are in the midst of a passive-aggressive dispute concerning a large tree in Baldvin and Inga's garden, which is casting a shadow over Konrad and Eybjorg's sundeck. Baldvin is open to the possibility of trimming it, but Inga point-blank refuses, arguing that Konrad's first wife never had a problem with it, and it is only because of Eybjorg's vanity that there is an issue now.<br><br>All of this is set up within the first ten minutes or so, and what plays out for the rest of the film is a juxtaposition of the two main conflicts - that between Agnes and Atli on the one hand, and that between the neighbouring couples on the other - as each becomes more and more bitter, and the parties involved more extreme. And this is essentially the film's bread-and-butter - a serious marital conflict contrasted with a farcical neighbouring conflict, with each commenting upon and informing the other; no matter how serious the dispute regarding the tree becomes, it is always tempered and rendered preposterous by the much more consequential issues playing out between Atli and Agnes. Likewise, no matter how acrimonious that conflict becomes, it is always called into relief by the comedic elements in the dispute concerning the tree.<br><br>This is how a lot of gálgahúmor works - the serious and the absurd placed alongside one another so as to create a somewhat unrealistic milieu. An especially good example of this in Undir trénu can be found in the opening scene, which plays out in a more conventional comedic style than is typical of the genre, before a tonal shift renders everything far less humourless. The film begins with Agnes and Atli going to bed, as Agnes puts in ear-plugs, and the sounds of a couple having sex can be heard on the soundtrack. The film then cuts to a shot of a couple in bed, with the sound bridging the cut, and letting the audience know this is the same couple heard in the previous scene. Except it isn't. Another cut reveals that some time has passed, and the couple in bed is actually a film Atli is watching on a laptop in the living room. Wearing headphones, he doesn't hear Agnes come in, and as he begins to masturbate, she asks him if he's watching porn. Slamming the laptop shut, he jumps up and flat out denies it. However, he is unaware that the porn he was watching is now playing on the computer screen behind him, in full view of Agnes. All pretty funny up to this point. However, the farcical manner in which the scene has progressed thus far is undermined as Agnes realises he hasn't been watching professional porn - rather, he has been watching an amateur video, in which he is the star. The multiple misunderstandings and layered realisations, coupled with a well-handled manipulation of audience expectation (and an excellent example of an L cut being used thematically) render the scene farcical, but only up until the point Agnes recognises Atli on screen. Here, the tone shifts dramatically as the film essentially switches genres mid-scene.<br><br>Another example of such a shift is found during a resident's meeting in Agnes and Atli's apartment block. The meeting has been called by an especially fastidious resident to address the loud love-making of a young couple - the same couple heard in the opening scene. As the irritated chair and his heavily pregnant wife detail all they've had to listen to at night, including a truly hilarious reaction to the young couple's dirty talk, the scene plays out in a fairly conventionally comedic way (the addition of a hard-of-hearing neighbour who doesn't understand what all the fuss is about is particularly funny). This comedic element is maintained when Agnes attempts to embarrass Atli by standing up and asking the residents if they think it's normal that he films himself having sex with women and then masturbates to the footage, to which the man in the loud couple nonchalantly responds, \"Sure.\" However, the scene darkens considerably when nobody reacts to Agnes's question the way she expected, and she is effectively dismissed and told to sit back down, leaving herself far more embarrassed than anyone else. Comedy in the midst of heartbreak, tragedy transposed into humour.<br><br>The film also features elements which are much more straightforwardly funny, albeit if relying on the audience's capacity to detect irony. For example, as Agnes and Atli's split becomes more and more bitter, Baldvin chastises Atli, telling him that he and Agnes should have been able to sort things out by now, talking things through \"like grown-ups\". Good advice. Except, when Baldvin offers it, he is about to spend the night sleeping in a tent in his back garden so as to prevent Konrad (who had purchased a chainsaw earlier in the day) from cutting down the tree. Atli himself doesn't point this irony out to Baldvin, and it's up to the audience to read between the lines and see the absurdity on display.<br><br>Unfortunately, however, for a film with such a farcical plot, it's immensely predictable. About twenty minutes in, I guessed how it would end - not just in terms of where the plot would go, but I literally guessed what the last shot would be. And I was right. A colleague of mine came to an identical conclusion when he was watching it. That kind of predictability is never good. It's also a little difficult to see what Sigurðsson is trying to say with the film. Part absurdist comedy-of-manners, part satire of first-world problems, there isn't a huge amount of substance here. Is the film offering up a commentary on the inherent pettiness that can come to dominate divorce proceedings, or is it more concerned with mocking the self-importance of middle-class suburbia and the attitude that an argument about a tree can be seen as more important than the breakup of a marriage?<br><br>Also, when the inevitable happens, and the humour gives way to inexorable darkness, with the two conflicts dovetailing, and tragedy enveloping all six main characters, I don't think Sigurðsson handles the transition especially well. Rather than allowing the material to become as ultra and unironically serious as he does, perhaps maintaining a comedic through-line would have been more effective (Kraftidioten is a good example of how to do this - although the film gets exceptionally dark in the final act, which features precious little seemingly worth laughing at, it maintains its comedic edge, right up until, literally, the last shot). Undir trénu lets the comedy drop away entirely, and although the last scene may be an attempt to share a wink with the audience, it comes on the back of a couple of scenes which weren't especially well integrated into the tone of the preceding narrative.<br><br>All in all, it's enjoyable enough whilst it lasts, but there isn't a huge amount of substance, and, in the long-term, it's not especially memorable.","user":"Bertaut","rank":[19,25]}]