[{"title":"1922 review.","rating":8,"date":"20 October 2017","review":"1922 is a slow, methodical look at guilt and the consequences of moral compromise. Adapted from Stephen King's novella, 1922 is a film that will divide certain audiences. After a summer of successful, suspenseful King adaptations (IT, Gerald's Game), this is almost an anti-king film, it's a film that basks in its atmosphere. It's also a film that's solely focused on its characters rather than plot. Thomas Jane stars as Wilfred James a dedicated ranch owner who conspires with his son Henry (Dylan Schmid) to murder his wife Arlette (Molly Parker) when she starts the process of selling the ranch.<br><br>1922 is written and directed by Zak Hiditch. Hiditch and his cinematographer Ben Richardson do a wonderful job of nailing the time period. The film's setting is gorgeous to look at, and the homestead has an almost omnipresent feel to it. It becomes a character in and of itself as the corn fields glisten against the backdrop of beautiful sunsets, whilst hiding darker secrets in the cracks of its foundations. The technical aspects of the film are expertly crafted.<br><br>Thomas Jane is fantastic is his role as a somewhat unhinged man filled with rage and regret. Every time he's on-screen he pulls you in with his mesmerising presence. As the film increasingly focuses on him it becomes more of a character study than a thriller/horror film. Whilst I feel this may be divisive, I enjoyed the direction it took. The films eerie, nihilistic tone makes up for the lack of urgency in the script.<br><br>1922 is a film that's assured of itself, thankfully being on Netflix the creators don't have to worry about turning this film into a lowest common-denominator jump-fest. Instead it respects its audience and asks them to come along on a journey through the protagonists mind. The only downside with the film is with so much focus given to Jane, the rest of the cast aren't fully developed, and some of their plot threads felt under-developed. However the film does a fantastic job of developing Jane's character which makes up for the short-comings of others. The films attention to detail makes 1922 an effective psychological (horror) film.","user":"Ben-Hibburd","rank":[155,183]},{"title":"Incredible movie. Gotta read the book ASAP!","rating":9,"date":"22 October 2017","review":"I loved it from start to end. Thomas Jane gives another excellent performance! <br><br>The plot is thrilling and makes you want to keep watching even if it's a slow-paced film. It reminded me a lot of old school horror/suspense films from the 80's. The ones that didn't depend on jump-scares or stupid demonic creatures to make the whole movie.<br><br>Don't listen to those few people arguing the film was boring because it was slow. Maybe they're used to jump-scares and serial killers. This is a very simple but deep plot that is worth seeing.","user":"jonathancg-12884","rank":[100,131]},{"title":"Thomas Jane's one of the finest performances!","rating":8,"date":"22 October 2017","review":"Based on Stephen King's novella of the same name, 1922 is like Stephen King's own version of Allen Poe's timeless classic THE TELL-TALE HEART story that set around here Wilfred James, a Nebraska farmer with a bitter wife named Arlette and a loyal son named Henry. This hardworking but not-too-successful farmer finds himself under increasing pressure from his wife when she clearly started to express her frustrations living in the country and wants to sell her all of the 100 acres of land that she got inheritably and move to the big city. Through their disagreements, when Arlette threatens to divorce him, taking the son with her, Wilfred plots to murder her and methodically persuades his son to become his partner in crime. This is beautifully done, an effectively slow-burn horror-drama directed by Zak Hilditch and like the way Carla Gugino turned GERALD'S GAME into her own showcase of versatile acting talent, this time almost an unrecognizable Thomas Jane delivered one of his best performances in career, IMO. His deeply sincere &amp; committed performance as an early 1920s manipulative, desperate farmer with a slowly rotten psychewas not only an absolute treat but surely this year's one the best so far that deserve some recognition in the coming award season.","user":"sanjidparvez","rank":[74,96]}]