[{"title":"This is a Sweet Film","rating":7,"date":"19 November 2016","review":"Christmas for Miranda is a painful reminder of the family she never had. Her mother died when she was young, never revealing the identity of her father. But, three days before Christmas, she unexpectedly receives a clue as to the whereabouts that takes her to a beautiful New England town where she meets Ian, a young man who helps with her search. As the clues lead to her father's identity and Miranda discovers the possibility of love. <br><br>Now if you like movies with Happy Endings then watch this. If you hate Christmas movies then you might not like this movie. <br><br>Now I found the whole film well made and very plausible. You can understand Miranda's not only hopes and dreams but also fully under stand her fears of not wanting to disrupt a family once she learns the truth about herself. This film is not as predictable as might think.<br><br>It is a nice change a pace for the typical Hallmark Film.","user":"Christmas-Reviewer","rank":[26,27]},{"title":"The mystery of finding the father you never knew","rating":8,"date":"18 February 2017","review":"This should read 'Finding my unknown father at Christmas time'. The actual title could mean shopping malls, low-rent bars, old people's homes and very occasionally somewhere very far north. In fact it's about a young woman who lost her mother very early in life and has grown up never knowing who her father was. She unexpectedly discovers a number of clues about her mother's secrets, the most important clue for us being that it's just before Christmas. From here we are presented with a mystery which she has to follow, with some of her own concerns; but for us it is most engaging and heart-warming.<br><br>Early in her pursuit of answers she comes across a suitable interest. To test my observation I rewound, and sure enough, the expression and turn of her head gave it away. Unlike most other romances, he remains as a constant, providing a counter-balance for her fears and anxieties. Together, she is better equipped to handle what turns into a very complex situation.<br><br>Set in a small Vermont town, the customs and Christmas activities of the villagers introduces us to all the main characters. Finding that one person who knows everything takes us down a winding path with a surprising ending. An ending that leaves the warmth from a good helping of Christmas delights.<br><br>Conclusion: 8.0 Xmas points, for a delightful cast and a story to keep our interest throughout.","user":"peterkoch-98114","rank":[8,8]},{"title":"Amazing Christmas movie.","rating":8,"date":"1 March 2017","review":"This movie sounded special even by reading the title, and it was. I absolutely loved the main story - Miranda trying to found out who her father was after her mother passed away while performing on stage and never got to tell her- I, personally, haven't seen anything like it on Hallmark. Someone trying to find where they came from. <br><br>The love story was not the main one, but yet it made the movie special as well. Both leads did an amazing job. I really enjoyed it. The only thing that bothered me was when Miranda saw Ian talking with Peter's mother with the photograph on his hand. That was very Hallmark of them to make the main character think wrong about the other lead's character. <br><br>On the contrary, I loved the fact that there was not any major drama with the leads. These movies tend to create a problem between them and it's not until one of them is on the other side of the country that they realized their mistakes. I'm glad Ian and Miranda talked the morning she was supposed to leave. It might be a detail, but I noticed and I liked it! <br><br>I also think that this movie was somehow not that predictable. Maybe the happy ending, yes. But there was a change in the order things happen - at least my thought - so I never knew when things were going to happen. I absolutely loved it. <br><br>A must watch.","user":"MIssM19","rank":[7,7]}]