[{"title":"Unexpected Gem","rating":9,"date":"29 June 2018","review":"Before watching this movie I came here and read the one and only glowing review and looked at the voting and saw that out of 43 votes 46% had voted 10. Unfortunately, based on past experience, a high rating with that few votes and one glowing review are normally huge red flags for me on IMDb. Vote rigging has become a big problem on here and I very nearly dismissed this movie based on these red flags.<br><br>Happily I ignored the red flags and sat down to watch what I thought might be a waste of time and got a very nice surprise.<br><br>Just about everything about this movie was as close to perfect as you can get, some of the cinematography was simply awesome, it made me want to be there. There are always going to be flaws and holes in the plot, but this simple story only had a few minor ones that didn't detract from the movie at all. <br><br>Tony Curran, I have seen many times before and I always expect good acting from him. Martin McCann, Jack Lowden, Ian Pirie and Kate Bracken did a really good job and their acting was of a very high standard along with the rest of the cast. All did a great job.<br><br>This movie tells a very real story with realism you only see in top end productions. It had me glued to the screen almost from start to finish, not many movies do that for me.<br><br>Highly recommended, but not for the squeamish. Even though there isn't really any over the top on screen violence in the movie, I still felt it was pretty gruesome. I really felt for the two main protagonists in places, but felt the ending was right.<br><br>Easily a 9/10 for me, 100 minutes well spent.","user":"nowego","rank":[219,265]},{"title":"Felt compelled to write my first IMBD review....","rating":9,"date":"30 June 2018","review":"This was an excellent movie. Tense and atmospheric from the start, you could sense from the beginning that something pretty dark was going to happen. \nI thought the acting was excellent from the entire cast especially the lead character. I really found myself feeling for these 2 characters and the very unenviable position they had found themselves in.... it was completely gripping and made for some uncomfortable viewing at times.\nI check all my Netflix choices on IMDB first yet have never actually left a review. Was surprised at the very average 6.6 rating so thought I'd do my bit to share what a fab film this is. If you like your movies tense, gripping &amp; well acted go for it you won't be disappointed.","user":"evemhayes","rank":[110,137]},{"title":"Great Scottish thriller!","rating":9,"date":"11 August 2018","review":"There is not much wrong with this film and it deserves a better score than what it is resting on just now.<br><br>Two lads decide to go for a hunting trip in the north of Scotland before one of them becomes a father. When hunting a deer it all goes horribly wrong resulting in a confrontation with their emotions, morals and a close community who slowly become more suspicious of them.<br><br>All performances are very convincing and the plot is simple yet believable. <br><br>It's a great Scottish thriller that will have your hands arching over your mouth in shock.","user":"eighteendoorsdown","rank":[37,45]}]