[{"title":"Very well done, quality film... BUT... a LOT of people are going to expect something different... Bluray: Excellent A:9 V:9","rating":8,"date":"18 February 2018","review":"It's totally understandable why there are SO many negative reviews and why so many people are genuinely disappointed with this movie. You have to understand that this is NOT a hard@ss crime film with a lot of action. As a matter of fact that isn't the point of the film at all.<br><br>To me, the overwhelmingly main thing is that this movie is done VERY well. It is extremely well written and acted, despite what some have said here due to expecting a completely different type of film. As a matter of fact, if someone had pitched this film to me just telling me what the primary underlying theme is (basically a well written, character study and a film for dog lovers) I probably would have passed on it. I don't usually go out of my way to see straight Dramas, except real Classic ones. BUT... and THIS is the point (at least to me...) The director was deliberately constructing a situation where we truly get to know the kind of people these 'criminals' are, and in what I feel in a VERY clever way, he placed this story in the context of a heist, criminals, and a VERY scary dog.<br><br>In my lowly and wretched opinion, the POINT always is this... 'Is it a well made film?' and, 'Does it do precisely what the director wants it to do?' In this case, I think that the answer to both is a very strong 'Yes!'<br><br>Just because a person goes into the film expecting a brutal Tarrintino film or some hard@ss action, and then they come here and P*$$ all over the movie because they find it 'Slow &amp; Boring' does NOT make it a bad film. Despite my normal avoidance of 'Dramas', I genuinely found the movie to be very moving, the characters very involving and real, and YES, even though it basically is just a simple tribute to dog lovers, I felt it was done very well, thus the '8' rating, which I do not give to often.<br><br>BUT... please keep in mind, this is most definitely NOT your usual 'Crime Thriller' at all. There IS excellent Suspense and Action it it, but that is not the main thrust of the story. In order to enjoy the quality of this film, you absolutely HAVE to understand and EXPECT it to be a strong, well done character study and an affectionate tribute to dog lovers...","user":"lathe-of-heaven","rank":[46,61]},{"title":"I enjoyed this movie","rating":8,"date":"18 January 2018","review":"I was surprised by how much I enjoyed this movie. It´s not the best movie ever but it tells different stories, the filming and acting is great, there were twists and surprises.. I enjoyed it.","user":"tlarraya","rank":[44,60]},{"title":"Dont watch if u expect lots of action n creature mayhem. Solid character driven survival drama/thriller with enuff scenes of tension n suspense.","rating":7,"date":"15 March 2018","review":"I am writing a review of this film again as my old review got deleted somehow n so this time i will make it a short review.\nSaw this on a dvd. The trailer, the star cast n the plot were superb but most people will b disappointed cos its not an action oriented or fast paced creature flick. But i enjoyed it. There is too much talking between characters n if u pay attention each character has a story n each involves an animal that had an impact on their lives.\nThere r small scenes of solid tension/suspense n dog chase scenes. It is a small scale survival thriller with more emphasis on characters.\nMost of the dogs aggressive nature is told off screen n there aint enuff body count.\nThe directors earlier effort Grace was a bit slow too. Has shades of Cujo n Reservoir dogs.","user":"Fella_shibby","rank":[58,82]}]