[{"title":"What Have I Got Myself Into?","rating":20,"date":"20 March 2019","review":"\"The Russian Bride\" depicts a kind single mom in Russia, who meets an older American man on the internet, leading eventually to marriage. Nina takes her daughter Dasha from Russia to the United States, where they move into an unpleasant, dilapidated mansion owned by the wealthy husband.<br><br>Karl Frederick, the Prussian-sounding name of the older gent, turns out to be a monster. When Nina learns a bit of his background, meets his sinister friends, and catches him snorting cocaine, it does not take long for her to begin asking herself, \"What have I got myself into? And the audience of this film has to be asking the same question!<br><br>This strange, low-budget film was a combination of dark comedy, thriller, mystery, horror, film noir, and slasher films. There is a creepy character named Hagen, who was born without a tongue. He now lives in the cold barn and does odd jobs (like committing murder) for his boss Karl Frederick. He also has a collection of old reel-to-reel classic films like \"Frankenstein\" and \"Nosferatu.\" But this film is not really like those classics. It is closer to \"Friday the 13th.\"<br><br>Much of the film defied logic, especially in the treatment of the former wife of Karl Frederick. Apparently, he murdered her, and Nina eventually comes across her skeleton. But the ex-wife also appears in the flesh to little Dasha. Was she a ghost, or was the wife being held captive by the psychopathic husband?<br><br>While the filmmakers created a chilling atmosphere in the mansion and the exterior, there was still an amateurish feel to the film. It was remarkable that the actors could keep a straight face with some of the lines of dialogue and situations. Some credit should go to the film's director for the wild finale. Still, this was a lackluster film whose theme was apparent in the early scene where Nina decides to leave her home in Livny to take her chances on what appears to be a relationship that seems too good to be true. If it feels that way, most situations in life are indeed too good to be true.","user":"lavatch","rank":[20,27]},{"title":"Gore-mungous, Hammer-tastic Female Revenge Thriller - So Sweet!","rating":6,"date":"26 March 2019","review":"Some other reviewer mentioned that the acting was shocking. well not really most of the cast were not that great but Corbin and in particular Oksana Orlan made the movie for me - she was rather sexy and a real tough ass kicker and her acting was far and away superb in my opinion - she made the movie for me. Stellar performance Oksana Orlan don't let the critics get you down.<br><br>So many critics these days cannot just sit and watch a movie without digging out plot holes and other inconsequential drivel - its a HORROR movie, they are not known for their literary masterpiece or amazing plots or acting - I go to watch and leave this world behind and become immersed in what is on the screen, not sitting nit picking every little detail, how accurate the historical details are - oh man those people bore the hell out of me, a bit like Mark Kermode and his dissection of a movie into its minutae and that would be fair if the movie was a great epic but folks this is a tongue in cheek horror / thriller and you get what is on the tin so save the literary criticism for War &amp; Peace and let ordinary folks just enjoy the film. I guess some people have lost the inner child and have become old before their time - I can still sit and watch Doctor Who from the 1970's or Space 1999 and believe its not a rainy quarry in Newcastle on a wet Sunday afternoon but the Sontaran homeworld and I am over 50 and that is what a lot of people seemingly cannot do these days - I pity them, what a bore life must be for you!<br><br>I digress, well the story has been done many times before notably with a French movie whose name eludes me for now and many copies thereafter and it does meander along for the first hour and then hits you with a pickaxe in the closing quarter with some kick-ass gore and violence and after all it is a horror/thriller and tongue in cheek it did finish with aplomb! Corbin is always a dab hand at the tongue in cheek horror as The Dentist he played rather well. Add in some cannibalism references and a bit of Frankenstein's monster and stir it all up and out comes a crazy hour and a half of female hammer wielding mayhem!<br><br>I was going to give it an average 5/10 but the last half hour gives it an extra star as it lifted what was seemingly a tame horror/thriller into the above average echelons of gore and female revenge!","user":"omendata","rank":[28,41]},{"title":"It is what it is: fun and creepy","rating":7,"date":"4 September 2019","review":"You can't expect a masterpiece with a title like this BUT you can suspend your 10 star attitude and have fun with it. It's great! Corbin is always someone to watch.","user":"laragi","rank":[9,11]}]