[{"title":"Was not expecting this to be this great!!!","rating":10,"date":"23 April 2019","review":"This movie blew my mind. It was so raw and real and the actors did such an amazing job. The weird quirkiness is what really made me love this film. I highly recommend this to anyone who came to read reviews before watching this. 10/10","user":"taraelizi","rank":[17,28]},{"title":"Everything Ladybird should have been","rating":10,"date":"8 June 2019","review":"How in the world this film has such a low rating (a 3.8 as of writing this) is inconceivable. The only explanation I can come up with is that someone involved pissed off the wrong people and those people ensured that this film would a) be unseen by the general population and b) be given zero positive credit in the online review sites.<br><br>It is possible that this film isn't relatable to just anyone. This isn't a film about being a lost and confused hormonal teen. It is much deeper than that. It is about being an adult who has only ever felt completely unlikable, has genuinely never been understood or wanted, and who craves to find and be wanted by at least one person. The general mass may not understand where the characters are coming from but they should still be able to appreciate the idea and have sympathy for their struggle.<br><br>Daddy Issues is the film we needed - more than another indie dramedy about a supposedly dysfunctional (yet totally functional and normal in reality) family and another woebegone teen.\nWe needed to see the side of the world where families exist side-by-side, not seeing or loving each other.\nTerrible and awkward situations happen and aren't just laughed about ten minutes later, but are left to rot and fester and be foul the rest of life. Terrible secrets are kept or even happen in front of each other and are never discussed and rear their ugly head years or decades later.<br><br>This is a film that addresses that side of reality. It also recognizes the masks and disguises we use to hide our human experiences - sometimes, the more glossy and bright the costume, the more broken and dark the inside.<br><br>But when we start being honest with ourselves and others, we can start to heal those wounds - and, sometimes, starting over alone is what that takes.","user":"wrmees","rank":[12,19]},{"title":"LOVED THIS Movie Truely Unique!","rating":10,"date":"22 April 2019","review":"I normally dont do reviews for movies but for this one I decided to because it's a shame it got a low score on here. Should be at the least 8 out of 10. This movie was well done kept me entertained the entire time and I felt that the actors portrayed their characters very well!","user":"justincampo","rank":[16,27]}]