[{"title":"Wasted opportunity, more like a fake advert for a movie than a documentary.","rating":4,"date":"27 June 2019","review":"For some reason they felt the need to insert Alec Baldwin for dramatizations, padding out the story instead of going into any depth it felt like a promo for a movie instead of a documentary.","user":"yavoyavo","rank":[22,30]},{"title":"Documentary with the most 'F-WORDS' in History","rating":1,"date":"8 January 2020","review":"I wouldn't want the distinction of being the the documentary with the most 'F-words' ever.<br><br>They should have reigned in the son of John DeLorean who must have said 'f---k' maybe over 60 times. Every other word emanating from his mouth was the 'F-word.<br><br>It ruined an otherwise amazing film that I would have given a '10' to. Imagine the incredible, hard work that got all the footage, amazing actor Alec Baldwin and the director couldn't just tell DeLorean's son, \"Hey could you maybe not use the F-word so much?\"<br><br>It's like dumping an entire shaker of salt into your wonderful omelet. The use of the 'F-word' so many times ruined the entire movie.<br><br>I saw this on Hawaiian Airlines and shame on this stupid airlines for not editing the profanity out. One 'F-word' is fine, but not 60.","user":"mgyler","rank":[17,23]},{"title":"dreams and nightmares","rating":7,"date":"6 June 2019","review":"Greetings again from the darkness. Hollywood is known for taking a real life person or event, embellishing the details, twisting the facts, and creating a fictionalized version meant to shock ... or at least entertain. John DeLorean lived a life that made it almost too easy for Hollywood, yet numerous attempts at a biopic have stalled over the years. Co-directors Don Argott and Sheena M. Joyce were there to pick up the pieces and deliver a documentary with dramatized reenactments of actual (and hypothetical) moments. Co-writers Dan Greeney and Alexandra Orton assist with a cinematic version likely to cause those who recall actual events to marvel at the full story, and those too young to remember will likely find it difficult to believe ... or perhaps, sadly, all too believable!<br><br>The film provides the backstory where John DeLorean was a talented engineer at General Motors and became a star on the rise within what at the time was the world's largest corporation. Turning around GM's flailing Pontiac division by introducing the GTO as a muscle car, DeLorean's success was a mixture of technical knowledge, marketing savvy, risk-taking, swagger, and ambition. Despite his actions leading directly to higher profits and large executive bonus checks, the stodgy old school regime forced him out in 1973. DeLorean, seen as a swashbuckling rebel, started his own company, De Lorean Motor Company, with the unusual stated goal of mass producing exotic sports cars made of stainless steel.<br><br>The dramatizations and reenactments involve Alec Baldwin as DeLorean, Morena Baccarin as his (third) wife, supermodel Cristina Ferrare, and Josh Charles as Bill Collins, the chief engineer he 'stole' from GM. We even get a behind the scenes look as Baldwin discusses the role from the makeup chair, and Ms. Baccarin is interviewed on how she viewed Ms. Ferrare. These dramatizations cover possible conversations between DeLorean and Collins, as well as home life with Ms. Ferrare and the kids, and are more distraction than help.<br><br>More effective than these \"what if\" segments, are the actual interviews with the real Bill Collins, as well as others who were involved at the time. Unfortunately, we only see the actual Ms. Ferrare in clips, as she understandably wouldn't want to be relive this part of her life. However, their kids, Zach and Kathryn, are interviewed on camera. Both are quite forthcoming with their thoughts, recollections, and the impact of growing up as DeLoreans' kids. Zach carries his hostility on his sleeve, while Kathryn offers a bit more reticence. Both reactions are understandable, and 'the car vs the dad' discussions are fascinating ... and these interviews are the film's high points.<br><br>Opening with FBI footage of DeLorean's lie detector test administered in 1983, possibly the most interesting aspect from an overall perspective is the contrast between his trial for drug trafficking and his later trial for embezzlement. Despite his being a truly desperate man when he agreed to the drug deal, it seems quite obvious - as the jury found - that DeLorean was a victim of FBI entrapment (possibly the first time many of us had heard the word). In the aftermath of what was a media circus not dissimilar to OJ's trial, we do hear from both defense attorney Howard Weitzman and prosecutor Robert Perry as to how each viewed the case. However, the shell company in Geneva and the aspects to his embezzlement lead us to believe DeLorean's character was truly compromised - or possibly revealed.<br><br>From a business viewpoint, it was quite interesting to learn that DMC (De Lorean Motor Company) ended up being based in Belfast, Northern Ireland (a great trivia question) due to 30% unemployment and the large government subsidies meant to stimulate an economy in the dumps. The lack of infrastructure and a workforce with no automobile experience led to quality issues that were simply too great to overcome ...especially when combined with other issues on Planet DeLorean.<br><br>John DeLorean led a flamboyant life and experienced a very public fall from grace. Screenwriter Bob Gale explains how the DeLorean car was chosen for the BACK TO THE FUTURE trilogy, and how a letter from DeLorean showed how much he still enjoyed the spotlight. Was DeLorean a renegade visionary or a con man? Was he a victim or a cut-throat businessman? Whatever your thoughts, he's a textbook example of how the American Dream can come true, and still be followed by one's worst nightmare. Sometimes there is no need to print the legend ... fact will do just fine.","user":"ferguson-6","rank":[18,32]}]