[{"title":"Great movie. Powerful.","rating":9,"date":"20 June 2018","review":"Saw this at Sundance. Great film. None of the people in the film are actors. It aids in the realism but also is a testament to the director's ability. This is a subtle, emotionally impactful experience. By the end of it your heart breaks but is also hopeful. Good story of friendship and also coming to grips with not being able to do what you truly love to do. How does one make life meaningful?","user":"MarlonBrando0110","rank":[61,68]},{"title":"Authentic and Heart-rending","rating":8,"date":"11 October 2017","review":"The joy of doing what you love burns away any pain. For Brady, a rodeo rider who just emerged from a coma, the joy and pain come in equal measure. Brady is told not to ride again. \"Play the cards you are dealt,\" says his father \"let it go.\" Yet Brady's purpose in life is hitched to riding horses. Also, living in a trailer and eating rabbit soup is not the stuff of champions. In the starlight, around a campfire with friends, listening to his little sister sing simple yet beautiful songs, and in dreams, Brady ponders his next moves.<br><br>This authentic and heart-rending film integrates the real lives of the actors into the story. It is balanced in its portrayal and rightly does not cast judgment. The cinematography is up close and intimate so that emotions are revealed in faces and eyes (horse and human) as much as words. While the director, actors and horses are just starting out in their film making careers and it shows, there is power and magic in how genuine they are in their portrayals. In a sense, they have been preparing for this film their entire lives. Human nature and the real West are on display here, and there is as much beauty in that as there is in the prairie sunrise. Seen at the Toronto International Film Festival.","user":"Raven-1969","rank":[92,106]},{"title":"A truly great movie that brought me to tears","rating":9,"date":"13 May 2018","review":"I love big budget blockbusters like Black Panther and Infinity Wars but there is a special place in my heart for the little guy with the little film with a little budget that can still bring the story home. I do not usually like sad stories. I firmly believe that movies should first entertain and then teach a lesson just like the best children's story. This is sometimes painful to watch but you have to root for Brady Blackburn. The shots of the Badlands are spectacular, the emotion heartfelt and the filmmaker's vision realized.","user":"garygwilliams","rank":[56,65]}]