[{"title":"One of the better B-grade low budget films I've seen in a while","rating":8,"date":"10 October 2018","review":"This film was better than expected. It certainly is no Hollywood blockbuster, but clearly a well made low budget film that used its budget wisely. <br><br>The directing was great - especially the camera shots and angles. The cinematography was perfect for the landscape. Even the score was surprisingly great for a B-grade film. The 89 min length was perfect as was the pace. The writing was good, as the tension was constant throughout the story, but I would liked to have seen a bit more 'pow' in certain scenes - maybe more of the creative Home Alone antics.<br><br>Nevertheless, novice director/writer Michael Peterson who's resume is mostly short films and documentaries did an outstanding job with this film. <br><br>Aside from well known actor Michael Ironside, the rest of the cast are pretty much C-listers as I've never heard of them. All performed quite well, with the exception of Chenier Hundal as the dad who I felt was too bland and seemed as if this was his first acting role.<br><br>Otherwise a very good film that I do recommend. An honest and well deserved 8/10 from me.","user":"TheTopDawgCritic","rank":[24,28]},{"title":"Much better than I was expecting.","rating":8,"date":"20 December 2018","review":"Full disclosure...I was an extra in this film (the airport scene, you can almost see me but not quite) so I'll admit I have a bit of a bias towards this film but I really had no idea what it was about until I saw it. Anyway, after reading the positive and negative reviews I was cautiously optimistic but set my expectations relatively low.<br><br>I was actually quite surprised at how much I enjoyed the film and think the negative reviewers either missed the point or are maybe a case of you can't please everyone all the time. Sure there are predictable elements but there are a number of surprises along the way as well. I thought it was a very taught thriller that kept up a really good sense of dread and foreboding all through the film. Right from the beginning, things don't feel right and the bleak winter Canadian prairie location (even though the film is set in the US) really add to the uneasiness. This film never lets you feel comfortable in your seat as the cinematography, score, and acting just keep things feeling tense. If you don't like that kind of feeling, this movie isn't for you.<br><br>I thought the director managed to work very well within his limited budget and put together a pretty decently acted and constructed film. The villain especially brought a spine tingling creepiness to the roll. Overall, to me it didn't feel like a low-budget or b-rater horror flick as it wasn't trying to be something that it wasn't. It was aware of it's limitations and wasn't trying to be a slick Hollywood blockbuster. Without giving anything away, my only minor beef was with one part of the ending that I thought could have had some further fleshing out or explanation. You can assume certain things but it just felt like a string or two was left hanging.","user":"bookem_danno_x","rank":[11,13]},{"title":"Can't believe this is Canadian","rating":7,"date":"5 October 2019","review":"This is a great suspense/horror movie, that has a slight arthouse feel. The plot, sfx, and acting feels like a hybrid of the Shining and Home Alone.","user":"fejmoc","rank":[5,5]}]