[{"title":"Overall, I am Not a Witch is a clever, funny, and provocative film which will linger with you long after its credits roll","rating":8,"date":"1 December 2017","review":"I am Not a Witch is a hilarious and harrowing tale from one of the finest new voices.<br><br>I am Not a Witch is the debut film from Zambian-born director Rungano Nyoni. It tells the story of a young girl, Shula, accused of witchcraft after a trivial mishap. The phenomenon in Zambia relates not to a cackling Shakespearean witch, but a relatively innocuous kind. These witches change the weather, read minds, and would fly away if untethered. Purportedly. It is a ludicrous social construction used by selfish men to oppress women. Although the subject matter is alarming, the narrative mostly filters through the comedy of its absurdity. The humour is at times reminiscent of Sacha Baron Cohen's movies or Monty Python. It's probably the grandiose confidence of foolish characters. There is a moment where the whole judicial system is reduced to Shula's guess.<br><br>But a deeper meaning flutters behind the comedy, like the platform behind a racing train. Seen only in the flashes of space between the carriages. This movie certainly has a dark side. And the unexpected appearance of the cold reality almost grated against the lighthearted side. The dark truth appears every now and then like a needle scratched off a record. This is by no means a bad thing. It makes the glimpses of truth all the more impactful after you inevitably lose yourself in the comedy again. The reality behind the movie is no more forgiving once the credits roll, because it ends on one final needle scratch, and leaves you to digest the movie, and its relation to our modern world. There are obvious parallels between the African political system, or lack thereof, and the Trump Administration and post-truth media.<br><br>The deep truth underlying this movie needs to be heard.<br><br>The cinematography of I am Not a Witch is also excellent. The shots are very minimalist, giving a sense of realism and intimacy with the narrative, and there are dashes of creative flair, with lingering shots during the realist scenes.<br><br>Review from Student Pages: https://www.studentpages.biz/i-am-not-witch-review/","user":"edwardjones-23192","rank":[42,47]},{"title":"This is not a comedy--it's a tragedy","rating":10,"date":"19 November 2018","review":"I Am Not a Witch (2017) is a Zambia/UK/France/Germany production.\nThe film was written and directed by Rungano Nyoni, who was born in Zambia and moved to Wales as a child.<br><br>The movie stars Maggie Mulubwa as Shula, a young girl who arrives in a rural Zambian village and is arbitrarily accused and convicted of witchcraft.<br><br>It's hard for us to believe, but in Zambia there actually are witch camps, which are convict gangs for women accused of being witches. (I checked local news sources, and apparently this is true.)<br><br>The witches are usually older women, but a child is accepted as a witch. Each witch has to wear a long canvas \"ribbon,\" which prevents her from traveling further away from the camp than the length of the canvas. (They're attached to the ribbons by a device worn on the back.) Little Shula is told that if she cuts the ribbon, she will be turned into a goat.<br><br>The corrupt government official, Mr. Banda (portrayed by Henry B.J. Phiri) is like corrupt government officials everywhere. He's fawning to his superiors, and ruthless to those under his control.<br><br>It's hard to say I enjoyed the movie, but my eyes were glued to the screen for the entire time. The situation was so outrageous that I couldn't believe that this is Zambian reality.<br><br>The movie is well directed and well photographed. It wish it were fantasy, but it's not. We saw the film at its Rochester premiere at the wonderful Dryden Theatre at the George Eastman Museum. It will work almost as well on a small screen.<br><br>Find it an watch it, painful as that may be. It's a window into another world.<br><br>P.S. I want to make note of the work of Nellie Munamonga as Police Officer Josephine. Josephine appears smarter than anyone else in the film. She surely doesn't believe in witchcraft. However, she has a job to do and she does it. You might think she would take pity on this small, frightened child, but she doesn't. She asks for orders, and she carries them out. After all, orders are orders.","user":"Red-125","rank":[9,9]},{"title":"Remarkable Debut","rating":8,"date":"11 April 2018","review":"I was profoundly moved by I Am Not a Witch. Many members of the cast are in their first film feature, and all are stellar, especially Maggie Mulubwa, who plays Shula. Her face is so expressive. Director and writer, Rungano Nyoni, transported me to a place I'd never been. It's rural Zambia. It's modern day (I won't ever forget that the first time we see little Shula, she has a t-shirt that says #bootycall). Yet, it's a cultural phenomenon that I don't know much about, witch camps.<br><br>Despite the dire subject matter, there are comic moments. Many times that I wanted to laugh, though, I also wanted to cry, because the circumstances were ridiculous to me, and Shula is caught up in a world where she apparently has no control, no say in her own life. She's asked to resolve disputes, judge others, alter weather patterns, even be on display, when all she really wants is to be a 9 year old, go to school, be nurtured. In the end, we see parallels to other, more familiar, stories. It's haunting.<br><br>Cinematography by David Gallego and Art Direction by Malin Lindholm are perfection. The images will stay with you.","user":"Thistle-3","rank":[9,10]}]