[{"title":"Generation Fail","rating":3,"date":"17 November 2018","review":"The first generation iron was brilliant (see my review on that) but this one, is a joke.<br><br>It just seems thrown together without good characters, following their struggles and journey and has nothing interesting about it, don't waste your time and I can only hope generation iron 3 is better.<br><br>Go watch the first, pumping iron, born strong or something similar.","user":"dreamwalk1986","rank":[5,8]},{"title":"It was OK","rating":5,"date":"12 June 2019","review":"I love bodybuilding documentaries though I have no interest in the watching the competitions or reading the magazines so I didn't know who most of these people were but I don't think that matters. It entertained me while I was feeding my baby in the middle of the night and that's pretty much all I can ask for!<br><br>Looking back though, it was a bit dull and has no repeat viewing value. The only interesting 'character' was Rich Piana, for his frankness, honesty and controversy. And also because he died from his lifestyle. And also because he looks psychotic. Kai Greene and that Australian guy both had zero charisma and were less interesting to watch. They also came across as a bit desperate &amp; sad with their attempts to break into the acting world and, in the case of Kai, make a graphic novel.<br><br>It's definitely a rather bland documentary and nowhere near as good as the excellent Pumping Iron.","user":"d_m_s","rank":[1,1]},{"title":"Bodybuilding, muscles and bussines - movie in three words","rating":7,"date":"27 July 2019","review":"It's really interesting even for somebody who's watching bodybuilding scere for some time. I like that you hear opion of the best bodybuilders of the past and present.\nThe point of view of somebody who was bodybuilder in 60's is totally diferent than bodybuilders that are still active. You will get here lots of interesting informations about how long can be career of pro bodybuilder or how much are currently social media important for bodybuilding world and in the promotion whole trend of bodybuilding. This documentary will be for sure interesting for anybody and i recommend this for everybody.\nSee ya at other review\nMarko","user":"markoacamovic","rank":[0,0]}]