[{"title":"Crowding virtually all Lifetime's clichés into one script","rating":3,"date":"18 April 2017","review":"I put on the TV April 15 for the second \"Premiere\" movie on Lifetime, something originally called \"Secrets and Sins\" but aired under the much duller title \"Secrets of Suburbia.\" One would think it's really not that novel an observation that people in suburbia often have affairs with people other than the ones they're married to, but Damián Romay, who both wrote and directed this (and therefore, as I like to say about bad movies in which the director and writer were the same person, he has no one to blame but himself), seems to act like he's just discovered it. The IMDb.com page on the film fails to identify one of the four leading actresses (there's only one significant male part) — the young, attractive Black woman who plays Monica, the divorce attorney who as the film begins has just successfully represented Scarlet (Tara Conner) in her divorce from a man named Troy. The film begins at a party where Scarlet is celebrating her divorce and thanking the friends who made it possible and supported her through it at their regular Thursday night get-togethers at which they absent themselves from any menfolk in their lives, get drunk on wine, play card games and gossip, gossip, gossip.<br><br>It's also established that the action takes place in a college town and all the principal characters — Monica, Scarlet, Kim (Linn Bjornland), Gloria (Brianna Brown, top-billed) and her husband Phil (Joe Williamson) — attended the college, which is called St. Francis. However, while Scarlet, Gloria and Kim all came from families with money, Monica and Phil were scholarship students and, as George Orwell described his life in a British prep school in his grim essay \"Such, Such Were the Days,\" the students with money looked down heavily on the students without it, bullied them and called them \"charity cases.\" That didn't stop Gloria from agreeing to marry Phil when he proposed after Scarlet dumped him, but she's kept him on a strict allowance and has set up the $10 million she inherited from her father in a tightly controlled trust fund he isn't allowed to touch because it's being saved for their kids (they have a son named Bradley, played by Brody Behr, and a daughter who's sort of in the background, and they pack the kids away to summer camp at the start of the plot so writer Romáy doesn't have to slot them into the later action).<br><br>The big thing that happens at Scarlet's divorce party is that her ex, Troy, shows up with a gun, threatens her and her three best friends, then shoots himself in front of her guests — but that is pretty much forgotten through the rest of the film. Instead, we get periodic flashbacks to the party as we learn what else is going on between the four women and Phil. We're led to believe that Phil's and Gloria's marriage is rocky but we don't realize how rocky it is until we see Phil use a hypodermic to extract a toxic fluid from a blue plastic bottle (it's antifreeze, we later learn) and inject it through the cork into the wine bottle Gloria is going to take to the next get-together. My husband Charles came home one-third of the way through \"Secrets of Suburbia\" and told me when it was over that what he'd seen made no sense — and I assured him that it didn't make any more sense to me even though I'd seen the film all the way through.<br><br>It seemed through much of the running time as if Romáy had been attempting to crowd all the Lifetime clichés he could think of into one script, and about the only even remotely creative thing he did was in his casting of Joe Williamson as Phil. Instead of the drop-dead gorgeous type that usually portrays a Lifetime male villain, he cast a stocky guy of medium height and tousled hair, reasonably nice-looking but hardly irresistibly attractive, the sort of actor that generally gets cast on Lifetime as the understanding husband who helps his wife fend off the maleficent attractions of the hot-looking stalker or psycho who's after her for nefarious reasons. Other than that, and some bizarre touches like the quartet of four cellos that entertains at Scarlet's party and the use of the fast theme of Rossini's \"The Barber of Seville\" overture as running gags — it's established that Gloria herself was an amateur cellist and was good enough to pursue it professionally but gave it up when she married Phil (and there's a nice scene that shows her frantically playing her cello when she returns home after killing Kim and waits for the police to show up and interrogate her), \"Secrets of Suburbia\" is just a typical Lifetime movie, and not an especially good one at that: other Lifetime writers and directors, notably Christine Conradt, have got considerably more out of these familiar situations than Romay did.","user":"mgconlan-1","rank":[7,9]},{"title":"not the norm","rating":10,"date":"13 June 2017","review":"I really love this movie a lot of Lifetime movies are about the same thing this movie is just so different I think the writing is brilliant the directing is brilliant I just love it but I give the actors and the directors all 10s across- the-board most movies are about a crazy stalker something like that but this one was totally different loved it","user":"keona-76985","rank":[4,20]}]