[{"title":"Can't get over how extremely poor script was...","rating":2,"date":"14 April 2018","review":"Honestly it was so hard to get through this movie... One poor scene after another., where nothing made sense.<br><br>The woman kept beating his ass to the ground, yet she always left him in a fine state ready to overtake her again, until the end where she turns into some kind of monster.<br><br>I have no idea how this movie keeps a score above 3, which would still be a kindness.","user":"VioleTAK","rank":[48,63]},{"title":"Mediocrity In A Cell","rating":4,"date":"13 April 2018","review":"10x10 is a by the numbers (pun intended) mystery thriller starring Luke Evans and Kelly Reilly in principle roles as a kidnapper (Lewis) and his victim (Cathy). The movie starts of interestingly if unrealistically enough when Cathy is kidnapped in broad daylight in front of a shopping mall. From there onwards what ensues is supposed to be a cat and mouse game between the two with the kidnappers motive becoming explained as well as the fact that Cathy is not an innocent victim in the story. <br><br>The relatively good aspects of the film are the acting by the two main characters and the nice house in which most of the movie takes place. The poor aspects of the movie are the increasingly weak story and the fact that Cathy has 3-4 excellent chances to overpower Lewis and subdue him and yet she gets recaptured every time. When the explanation is finally offered for the whole mess, the movie becomes even less believable as Cathy is actually a murderer who killed Lewis's wife and other patients in a hospital where she worked as a nurse. So this supposed Angel Of Death who had numerous chances to escape and/or kill her kidnapper allowed herself to be captured a number of times. It just doesn't add up. <br><br>Overall a poor thriller that could have been better if care was taken to develop the characters and make their actions more believable.","user":"nebk","rank":[52,69]},{"title":"Just two stupid mistakes kill the entire movie","rating":3,"date":"28 April 2018","review":"Escape one time, hit the guy hard and doesn't finish him. Escape twice and she has the time to lock him into the 10x10 room and she doesn't. Last thing this 160 lbs woman is stronger than a 200+ man... shame.","user":"hongm-45381","rank":[43,57]}]