[{"title":"Harsh and surreal.","rating":8,"date":"26 January 2019","review":"This film plays heavily upon the mindset that people enjoy watching others suffer. Not just suffering but in a extremely sick sadistic way.<br><br>This movie combines the purge, with hostel and gives you a dark film.\nNow I have seen dark films in the top ten of the world such as I saw the devil and Coldfish. This film rates up there with those.","user":"brianjc-00142","rank":[1,1]},{"title":"Does what it says on the cover.","rating":7,"date":"8 August 2017","review":"I wouldn't particularly say the story is groundbreaking, although moving with the times going from hand held found footage to streamed footage is a progress for slasher movies. Obviously being a slasher movie, the story is rather far fetched but that's what these movies are about and on occasions with some hidden meaning. It could be seen as potentially as a statement about the dangers and exploitation of the power of the World Wide Web can have over the fast progressing world of technology, freedom of speech and freedom of privacy. It could just really be about psychopaths being out there. Either way, perhaps don't overlook things and think of it as a trashy horror.","user":"parksmathew","rank":[2,4]},{"title":"Hacked","rating":8,"date":"30 July 2017","review":"After watching this film yesterday it left me really thoughtful.<br><br>This film was a great story a little far fetched or is it. Basically a Grad student is doing a project and acquires a grant to sit online all day and evening speaking to different people on a chat network (The Den) pretty much like Skype. She witnesses a murder and her computer is hacked and people around her go missing and die. Its gruesome really.<br><br>I personally think its a good way of showing young people how easy it can be to be hacked and also the dangers of strangers on the internet. Im certainly going to ask my daughter of almost 18 to watch it as she is convinced there are no dangers.<br><br>Very good movie format and better than most found footage movies that are all over the place out of focus and annoying. Story line is good a little too far fetched but good for a movie night. I preferred this to the movie 'Unfriended' that I would of given a 3 out of 10 score.<br><br>Great film if you want something different and something to make you jump.","user":"jahoolie-09562","rank":[2,4]}]