[{"title":"Mother secures family farm in WW I but not without selfish ruin.","rating":8,"date":"25 June 2018","review":"The title is inadequately translated. The English \"Guardians\" is gender neutral. The French \"Guardiennes\" is explicitly feminine. \n That's the point. This film, a noble return to the classic French narrative style, exalts the role women played during WW I, not just running the family farm but in preserving the family unit, the larger social structure and civilized values. \n As the first two shots explain, the men are off dead and dying on the battlefield. Meanwhile, back on the farm, it's the matriarch Hortense pushing the plow behind the overworked mare.\n The rural beauty of France stands in implicit contrast to the violent destruction wreaked in the war. \n While the school kids learn a poem about the inhumanity of the Bosch (translation: Krauts), a returning soldier shares his contrary wisdom: the enemy German soldiers were just like their enemy French, simple ordinary folk thrown into a conflict neither of their making nor of their will or understanding. But the deaths and dread and nightmares roll on. \n The film's noblest soldier is Francine, the orphan girl Hortense hires to help in the harvest but who works her way into a permanent position with the family. That is, until their son Georges and she fall in love, threatening Hortense's control. \n For being a responsible, even heroic guardian is not enough. What's crucial is the values being guarded. \n Despite her affection and respect for Francine, Hortense lies about her virtue to dissuade son Georges from marrying her. She comes from nobody, she explains, with whoredom in her blood. Later Hortense refuses to tell Georges Francine is carrying his child. \n Thus Hortense meets what she sees her responsibility to maintain the family honour - letting Francine carry the guilt that daughter Solange has provoked - and to consign George to marry his drab childhood friend Marguerite. \n At this point the film's domestic point unfolds into the larger theme of French values, even European, indeed the entire Western Civilization that both World Wars ostensibly defended. Killing and dying for one's values may be a fine value - but that depends on the values. And whether the values defended in war are sustained in peacetime.\n The heroes' martial valour is undercut by Hortense's inhumanity both to her son and to his lover. She betrays her dutiful servant out of class snobbery, an exalted vanity and her need to keep control over her family. \n When she glimpses her unacknowledged grandchild, Hortense briefly realizes the horrible costs of her misdeed, even to herself. But she makes no amends. It's too late or her strength has left her too weak to undo the damage she did the son she thought she was protecting and the woman who served her so faithfully.. \n There's a sting in the tail at the end of the narrative. The eldest son back from the war, the farm thriving and modernized thanks to the women's initiative, the men fall to arguing over the division of the estate. The war briefly unified the men that can't live in peace at home. \n The only harmony and cheer are provided by the triumphant and resourceful Francine. Raising her child on her own, she's now also a locally successful singer, still brightening her world. \n Poor Georges in the audience is still enchanted by her and will never know his loss. He returned wounded from the war but emotionally crippled by his mother's betrayal. He won the continental war but lost the domestic battle.","user":"maurice_yacowar","rank":[24,24]},{"title":"One of the most beautiful films in cinema and a best of the year.","rating":30,"date":"30 May 2018","review":"\"Two years of hell, some people went mad.\" \"After the war, it will be different.\" Constant (Nicolas Girard)<br><br>The WWI soldier, Constant, in director Xavier Beauvois' The Guardians, captures the ambivalence of the \"the war to end all wars\": combat insanity that comes home with soldiers and the hopeless hope the world will be a better place. The only \"better\" is the film's depiction of strong women taking the reins of a farm, modernizing it and making a profit. <br><br>It's a small village whose story begins in 1915 and ends in 1920 in rural France, just long enough for women to take prominent places in the farms at home and for their returning men to find adjustment a challenge as they carry the memories of unspeakable horrors in the trenches of that \"great war.\" <br><br>Hortense (Nathalie Bye), an aging owner of a working farm, rides the plow while she attends to the politics of the large farm without the crutch of a domineering male. She does well enough to engage the services of a young maid, Francine (Iris Bry), who is a change agent for Hortense and her soldier son and a signal of the complications war brings to the world.<br><br>The cinematography is a perfect reflection of the tranquil country side lost in a trance of bucolic tasks until the war's change agents arrive. Leave it to French cinema to languish over faces and landscapes, as if Manet or Constable were the artistic director. The slowly panning shots of laborers are as softly powerful as paintings in the camera's movement.<br><br>The Guardians is one of the most beautifully photographed and quietly told stories of women abiding the tyranny of war with an aplomb unseen in modern cinema. This minimalist epic is one of the year's best films and an appropriate emblem of the French ability to make cinema art. All other cinema pales by comparison.","user":"jdesando","rank":[16,18]},{"title":"Beautiful, subtle film about women's day to day during First World War","rating":9,"date":"25 August 2018","review":"Xavier Beauvois just does the most beautiful films. As with Of Gods and Men, The Guardians is full of quiet dignity and humanity, and it gets the emotions just right. There are so many films about the battlefront, it's great to see one focussed on the scene back home and on women's work, their hopes, their endurance, their grief, and even their betrayals. The pace is slow, and follows the events of the narrative as much as the seasons and the labour they entail. Beauvois is someone who takes the time to show people who are not often seen on screen go about their everyday life, their toil. When do we get to see women shovelling dirt, feeding fodder to cattle, or doing the harvest? It's sometimes hard to believe this takes place between 1916-20 and the contrast with our post-post-modern world is all the more valuable. We're lucky that a director of such talent chooses topics like this for his work.","user":"jabberwhack","rank":[8,9]}]