[{"title":"It's 30% Deeply Moving and 70% Deeply Boring","rating":6,"date":"28 September 2017","review":"If you prefer a movie rich with dialogue, A Ghost Story is not for you.<br><br>There is very little speaking throughout the movie. Only one scene features much talking and it's not even a conversation. One man launches into a lengthy, detailed monologue about the infinite size of the universe and our relative insignificance within it. The man believes that the speech is profound and laudable, but in reality it sounds like something a college kid would say while high at a party.<br><br>The gist of the man's speech expresses that the universe is too vast for any of us to truly leave a legacy when we die. The ghost (played by Casey Affleck) is especially compelled by this speech because he has just died and is now especially compelled by things concerning his legacy.<br><br>The ghost observes what he cared about most while he was alive. He haunts his house. He observes his wife, struggling to watch her struggle to cope with his death. He wants desperately to comfort her, but cannot. It's heartbreaking.<br><br>In addition to heartbreak, this movie evokes many other feelings: warmth, humor, boredom. Boredom comes up a lot. For every genuinely beautiful and moving moment of the movie, there is at least five minutes of emptiness. The runtime is short, just over 90 minutes, but it feels longer and could easily have been trimmed by 20 minutes.<br><br>One scene in particular that involves a pie seems to drag on for at least four days, even though it actually only lasts four minutes. In the moment, the scene is likely unbearable to many viewers. I plead for your patience. Do your best to empathize. Think about how you would feel in the situation. Do this, and the scene becomes haunting and powerful.<br><br>That's probably the best way to sum up the movie—many scenes may feel boring if given little thought, but are actually deeply moving if given honest consideration. Not all scenes fit this description—some, no matter how much your squint, are just extended moments of vapid emptiness. The emptiness outnumbers the deeply moving by about 2:1, so this movie requires patience and commitment. The movie contains no conflict, only contemplation and some glorious music.<br><br>If that sounds like enough for you, give this movie a chance. But fair warning: if you bore easily this movie will feel like a waste of your time.","user":"Jared_Andrews","rank":[280,421]},{"title":"Impossible to rate","rating":6,"date":"6 March 2018","review":"Imagine a joke that takes 90 minutes to tell, you never get to hear the actual punchline, and part of the point is how long and incredibly boring it is to get there - yet it makes sense at the end, and in some strange way seems fulfilling. If this sounds like your cuppa joe, you might like this flick. I'm glad I watched it, but wouldn't watch it again, and can't recommend it.","user":"samandor-15781","rank":[185,277]},{"title":"Oh DEAR LORD. A Most Awful Ghost Bore","rating":1,"date":"23 September 2017","review":"To begin, let me state that I actually LIKE \"pretentious\" movies and films that speak to you on a different level. THIS, however, was pure torture and while I feel that the creators truly wanted to say something, it was MORE THAN APPARENT that they didn't have ENOUGH to say and so they filled it with mindbogglingly SLOW and sluggish scenes. <br><br>SPOILERS:<br><br>I see that many have already covered the scene with the pie, but I feel that they didn't quite get the point across correctly or do the utter banality of it, justice. <br><br>You have a FULL FIVE MINUTES (_time them_), although they truly feel like ten or more, of the main female lead doing nothing but EATING A PIE! And yes, she does so rather well, in that it is meant to make you uncomfortable, and it does, but not in the way I imagine it was intended to do so. <br><br>Trust me when I say that NO film EVER, in the history of films, needs a scene where for five minutes someone does nothing but eat a pie. Beyond that, it is not counting the ten minutes it took her to walk into the house, put her mail down, walk around, stand at the sink, look out the window, turn around and FIND THE PIE ... ... <br><br>.... OR for that matter, the forever minutes earlier in the film where she literally drags a chest or box of some kind to the curbside - and I must bring your attention to the use of the word DRAGS. The scene is shot in painstaking detail and unbelievable SLOWNESS as she does this, across her ridiculously lonnnnng front yard (really, can a front lawn be that large or was it CGI?), and then does not cut while she THEN walks back across her lawn into her house. <br><br>Oh! AND HOW, just how, can we forget the never-ending completely passionless / emotionless scene at the beginning where the couple is in bed? In fact, the word which fits this movie to a \"T\" IS \"EMOTIONLESS\". Trust me when I tell you that I have literally seen two Kleenex tissues at the bottom of a trash receptacle which had more chemistry and emotion and a bond than these two people had. <br><br>Honestly, it is just too much ... of nothing. <br><br>This film should have been a short of some kind, or else it needed more work before it was released. <br><br>I applaud the creators in wanting to bring this film to the screen, BUT if you KNOW a project is not ready or not worthy, WHY do it and insult your viewers with such trash?","user":"Her-Excellency","rank":[270,430]}]