[{"title":"A long in depth look at the making, rise, and fall of the king.","rating":8,"date":"20 April 2018","review":"This \"HBO\" doc called \"Elvis Presley: \"The Searcher\" is long and drawn out as it's really informative and educates all about the life and the making of Elvis from his early life all the way up to death. Really it's a great biography type film to see with classic footage of concerts, interviews, and comings and goings of the one and only \"King\". Also the film is supported by talk and narration from the late Tom Petty and \"The Boss\" Springsteen and ex wife Priscilla all talk about his impact on music and culture and all recall the good and bad times.<br><br>Early you see how the blues and gospel music and being around blacks influenced \"Elvis\" to be outside the box and mix his music to a blend to be classified as many different styles. Then along the way his journey to \"Memphis\" and meeting Tom Parker would help shape his music life.<br><br>Yet a downfall and backslide was Presley's dive into movies and acting which hurt his image and would age him and cause his need to start over with music. However his pressures and stress would lead to drug abuse and a much to early departure. Overall good look at the life and times of the king the one and only \"Elvis Presley\"!","user":"blanbrn","rank":[19,19]},{"title":"Rarely Has a Film More Exceeded My Expectations","rating":28,"date":"28 May 2018","review":"This is, without a doubt, one of the best documentaries I have ever seen. And I've seen a ridiculous amount of films in my life. Even if you are not a big fan of documentaries, and I'm generally not, this is worth seeing. Even if you are not a fan of Elvis Presley, this film brings a perspective of American history worth a look. <br><br>Usually, when someone is that famous, and died decades ago, we tend to believe we must know everything there is worth knowing. Two things make this film very different. First, the personal views of those who knew him best, like Priscilla Presley, and those influenced by him, like Bruce Springsteen and Tom Petty, give the film a gravity rarely seen. Second, this is the rare film that neither worships nor belittles him. It approaches Elvis Presley as a human being, much like any other, whose life had an amazing range of ups and downs.<br><br>I've rated thousands of films on IMDb, but reviewed very few. This one was worth a few minutes to share my thoughts. Well done to all involved.","user":"roland_lmt","rank":[13,16]},{"title":"Like Elvis, the first part is the best","rating":8,"date":"23 April 2018","review":"It's amazing how many people now think of Elvis only as a caricature, with a few hit songs and girls screaming in front of him. This documentary goes a long way in helping those who don't know why Elvis was a pioneering artist, why he was so much more than just an early rock and roller, how he re-imagined the blues, country and even bluegrass into a form uniquely his own. Much like his life, the pre-Army years are the most interesting. I wish they had interviewed more contemporaries - surely there are people still alive who were actually at some of these concerts, tapings, etc.? I so appreciate the film-makers making it clear that Steve Allen was attempting to humiliate Elvis and kill rock and roll - he definite deserves \"credit\" for that attempt. The doc also gives a good view of Colonel Parker - why Elvis picked him to manage him, why that absolutely was a great idea early on but how it turned disastrous at the end and how, for all the great things he did for Elvis early on, he ruined his career, and perhaps his life, at the end. What a shame that, at the time of this doc's release, the 1968 Comeback Special isn't available on DVD (unless you are willing to pay someone almost $100 for it) - this doc made me so hungry to watch it again (haven't seen it since a NYE broadcast in Germany back in 2007 or so).","user":"jcravens42","rank":[10,12]}]