[{"title":"Horrible Film","rating":1,"date":"23 January 2017","review":"This film is total waste of time. It is definitely the worst movie of 2016. Everything about the movie was terrible. Sinbad is one of my favorite character, I grew up watching the TV series but they just ruined the character with this movie.<br><br>The cast was a total joke, their acting was so bad that you will feel sorry for them. The script was pretty weak. The main try so hard to make some jokes which were more terrible than the movie itself. The actions scenes are ridiculous. There was no sequence between the scene, one second the sword in the floor, next scene it was in the hand. There were retakes between scene but they did not fix it or maintain the sequence of the previous scene. They did not even bother to make the movie enjoyable.<br><br>The film had a pretty low budget with bad CGI. They don't even use the boat in the sea. And did the shooting was mostly indoor, there was not much outdoor shooting.<br><br>NOT RECOMMENDED AT ALL.","user":"niaz_islam","rank":[23,24]},{"title":"Furies made me cry","rating":1,"date":"25 January 2017","review":"One of the worst movies I have watched in my whole life. Script is pathetic, no screenplay.Casting is just a joke for the director. Actors don't know how to act. The actions scenes are ridiculous. Actions are like, people are cuddling. The only hilarious about movie is, Whenever furies were crying, producer of movie was also crying. When you are making a movie mentioning Adventure, you are supposed to include that. Closed up shots, no scenic views, makes the viewer searching for forward button. They destroyed the career of Sindbad in movies.<br><br>Don't watch this. don't watch this. don't watch this. Don't watch this.<br><br>This movie is injurious to your mental health.","user":"tallmanstanding","rank":[13,14]},{"title":"This rating is very generous.","rating":2,"date":"21 January 2017","review":"If you love B-movies, you might like this, but even as a 'B', it is missing the amusing 'cheese factor'. Bad acting, bad directing and bad editing. If this movie was intending to be tongue and cheek, this doesn't work either.<br><br>I would usually not bother to have watched it until the end, but I did want to see if there would be any redeeming features.<br><br>Cheap films these days are not the crap they used to be. There are some very talented people out there and even a movie made without all the bells and whistles can be entertaining.<br><br>This movie really misses the mark for me. <br><br>If you feel I am being too harsh, remember, this is my opinion, which is the only one I am qualified to give.","user":"wmeltcher","rank":[13,16]}]