[{"title":"A surprisingly thoughtful, well-executed thrill movie","rating":7,"date":"1 September 2018","review":"This film makes the most of a modest budget. I watched it well aware that it had received fairly horrible reviews from most film critics, expecting to turn it off after a few minutes. I was surprised to find a film with such an air of specificity to its details. There are actual layers to what goes on in this film, and actual depth to the character development and performances. Although the plot does indulge in the heightened excesses of its horror genre (at times it seemed to be keyed in at the level of a fairy tale, a point which is nodded to in the screenplay), the majority of this film maintains an admirable level of meaningful, lived-in realism, tackling everything from generational trauma to parental disappointment to bullying to gender identity and more in a nuanced and intriguing way.<br><br>I guess what I'm saying is that so many low budget horror movies are full of hackneyed tropes, pitiful jump scares, predictable twists, and dialogue that was clearly typed by a screenwriter onto a page and then read aloud by an actor. This movie, however, is refreshingly vibrant in addition to being highly entertaining. The camerawork is likewise skillful, and although I wouldn't say this movie is actually scary--not by a long shot--it is quite suspenseful.<br><br>Plus, I gotta give extra credit to any movie with the audacity to execute its action climax with its boy star wearing the costume that Luke Prael does here.","user":"nehpetstephen","rank":[39,54]},{"title":"Surprise surprise!!!","rating":10,"date":"1 October 2018","review":"U really couldn't guess where the movie is going until you finish it till the end.... Freaking beautiful executed and amazing cast... it's dark, coming of age, self realisation and little psychotic... totally worth a watch","user":"viggyjiggy","rank":[24,32]},{"title":"a coming-of-age story for social outcasts","rating":10,"date":"7 October 2018","review":"This film's trailer had me intrigued, with its sequences of what appeared to be a gender-nonconforming child being sent to an 'exclusive school, especially designed for unique young people like yourself'. Written and directed by, of all people, Boaz Yakin of Remember the Titans notoriety, Boarding School depicts a journey of self-discovery of its adolescent protagonist who, it's -strongly- hinted at, struggles with repressed feelings and uncertainty about their gender <br><br>others apparently considered unique enough to be sent to the eponymous school are a child with Tourette's, a semi-verbal autistic child in need of a caregiver, and a male burn survivor named Phil, who incidentally is played by a female actor. None of the characters' 'uniquenesses' are ever identified by name, an interesting choice among many that lends itself to analysis and reflection<br><br>the acting is really good all around, with a particularly outstanding performance by Luke Prael, assisted by a brilliant script and dialogue. The cinematography is masterfully executed and artistic, though not to the point of perplexing audiences, and every scene furthers the narrative. It's not bogged down with filler, and the pacing is consistent<br><br>the horror element is layered: there's the physical violence depicted in the trailer, and the metaphorically portrayed systemic violence affecting its variegated cast of marginalised characters, which makes it profoundly relatable as both a transgender and autistic viewer<br><br>after the movie ended, i wanted to watch it again immediately. It's an instant 10/10 from me, and i expect it will be my favorite film of 2018","user":"re-animatresse","rank":[19,25]}]