[{"title":"a true story showing why the media is despised by despots","rating":8,"date":"26 January 2018","review":"The term 'fourth estate' was coined in 1841 by philosopher Thomas Carlyle when he said that the Reporter's Gallery was far more important than the 'three estates' of parliament. This titbit of history tells us the battle lines over 'fake news' are as old as 'the press' itself. It is also the context for The Post (2017), a dramatic thriller and civics lesson about the media's role in checking government power. The Post shows why the media is despised by despots and is thus essential viewing for anyone wanting to better understand today's shambolic attacks on the media. <br><br>The facts of the story became world news. By the mid-1960s, most Americans were losing faith in the nation's prospects of an honourable conclusion to three decades of conflict in Vietnam. While various Presidents told Americans that success was assured, the top-secret Pentagon Papers revealed that national policy was based on a litany of lies. Former military analyst Daniel Ellsberg notoriously leaked the Papers to the New York Times, but publication was suppressed by court order. The rival Washington Post acquired a copy and had to decide whether to publish and risk the paper's future, or not publish and lose the respect of its journalists.<br><br>A dramatic high-tension wire is strung between Post heiress and socialite Katherine Graham (Meryl Streep) and her hard-core news editor Ben Bradlee (Tom Hanks). They are polar opposites: she is a darling of the establishment, uncertain of her ability and fearful of losing not only the business but her social standing. Bradlee is a truth-seeking journalist who mistrusts lawyers and would publish at any cost. Described as \"the most highly classified documents of the war\", the President commands an army of lawyers threatening Armageddon if the paper goes to print. The film's period set design is brilliant: the reporter's room is a galley of buzzing typewriters and the printing press a mechanical maze of oiled steel grinding out papers in a frantic atmosphere of unrelenting deadlines. Against this background, the pre-feminist newspaper owner must make a decision that could bring down a President. When the choice is made, the Post must then face presidential retaliation via the Supreme Court. <br><br>This story requires no narrative embellishment, nor does it need dramatic performances to convey the high-stakes of an extraordinary moment. The casting of stars and support is excellent. Streep and Hanks give their most understated performances of recent times; no other contemporary actors could have filled these roles with their authority and authenticity. Spielberg's direction keeps the events unfolding at a brisk pace to leverage the tension curve upwards while sticking close to the facts. This is masterful storytelling based on an important event that resonates into the modern era.","user":"CineMuseFilms","rank":[168,222]},{"title":"\"Catastrophic events do occur, you know.\"","rating":8,"date":"20 February 2018","review":"I'd bet dollars to a whole bunch of doughnuts that not many people watching this film today are aware that the history of the Vietnam War precedes the presidency of Richard Nixon by four prior administrations, dating all the way back to Harry Truman. Nixon gets most of the blame of course, for the country's failure in Vietnam, somewhat undeservedly, whereas he does shoulder all of it for the break-in at the Watergate Hotel. Perhaps the title of this picture might better have been 'The Pentagon Papers', with the Washington Post playing it's role, but it was Katherine Graham's newspaper, and as portrayed by Meryl Streep, Graham's stewardship required the requisite amount of diplomacy and resolve. I thought her confrontation with Ben Bradlee (Tom Hanks) over his relationship with the Kennedys while JFK was in office was quite remarkable, knowing that as President, he did get a pass on all of his extracurricular activities.<br><br>What this film probably does best is bring us back to a time in the country when there was such a thing as investigative journalism. Sources were double and triple checked before stories made it into print, while today all it takes sometimes, is a tweet, to send reporters into a frenzy. Personally, when the Pentagon Papers story broke, I was somewhat conflicted and on the fence whether or not a newspaper ought to print stories based on classified government data. In retrospect, the country's national security posture was not harmed, and as an informed public, we're better off knowing what our leaders are up to, especially when decisions to send soldiers into harm's way are concerned.","user":"classicsoncall","rank":[39,49]},{"title":"A Timely Reminder","rating":10,"date":"22 December 2017","review":"\"The Post\" arrives to remind us about the indispensable role of the press in a democracy, ours in this particular case. An historical fact that comes to illustrate the dangerous times we're living now. The story of The Pentagon Papers is not ancient history and yet people seem to have forgotten. Americans in their 20's don't know about it as they didn't know about the House Of UnAmerican Activities. Education is at the center of our future so thank you Steven Spielberg for contributing to the awakening. In \"The Post\" the economy of the retelling is part of its brilliance. Tom Hanks as Ben Bradlee is not Jason Robards but a Hanks, profoundly human, version of the man and Meryl Streep - Oh Meryl Streep ! - gives life to a woman who was not used to be the center of attention. A daughter a wife never in charge. Her dilemma is the sort of dilemma that, artists, teachers, parents, often confront. Her process to arrive to her decision is immensely moving and real. One of the miracles that Meryl Streep manages to perform again and again is that one forgets that it is her a second after she appears on the screen. I know this is a film I see again and show to youngsters at every possible opportunity. Thank you for that.","user":"littlemartinarocena","rank":[320,527]}]