[{"title":"Holy Jumpin' Vampires Batman","rating":6,"date":"25 December 2017","review":"This cockamany story has the \"hero\" bitten by a vampire but he turns out to be immune (explained in the first twenty minutes) and joins a Ghostbusters like anti-Vampire crew only to be assigned to sweeping the floors, where he develops kung fu like moves akin to the Karate Kid. On a search for vampires he encounters a drowned ugly one [aren't they all?] that swallows his cell phone. He falls into the water trying to retrieve it and they lock lips making the vampire iurn into a beautiful twenty year old woman who died (was buried alive) in the 1800's. <br><br>She hops around, as apparently Chinese vampires do (which helps me better understand \"Crazy Safari\" where a Ctinese vampire falls out of a plane over Botswana {The Gods Must Be Crazy #3 of 5}). She is able to communicate account the cell phone she shallowed (using Siri like exchanges). She takes a fancy to old Chinese Operas on the television so he leaves her watching while he attends his other duties - what could go wrong?","user":"futuretype","rank":[2,3]},{"title":"Nice movie with a heartwarming ending.","rating":7,"date":"15 August 2018","review":"The movie is surprisingly good, i thought it would be one of those lame vampires movies but it wasn't ,, the comedy was clear, fast and comprehensible, the action and fight moves were also impressive.<br><br>The cinematography and CGI was really good,, the story itself though appeared short ,, this would look much better on a TV show .. I liked the intro where it looked like the credits from Sherlock movie ..<br><br>The cast are funny and engaging ,, loved them all.<br><br>Final thought,, lately i'v been watching a lot of Korean movies ,, and this Chinese one popped up by accident on my list ,, but it was all worth it so it is without a doubt recommended.","user":"Aktham_Tashtush","rank":[1,1]},{"title":"Quite likable but not especially good Hong Kong action-comedy-horror","rating":5,"date":"27 June 2017","review":"After a sinister late-night encounter, a geeky young guy discovers that he is immune to vampire toxins. He is, therefore, summoned by the Vampire Cleanup Department who are a small group of specialists dedicated to combatting and dispelling vampires.<br><br>This Hong Kong feature is a genre mash-up of comedy, horror and action (with even a little bit of romance thrown in for good measure). The comedy wasn't especially funny, the horror was peripheral and the action was fairly unremarkable, resulting in a middling movie. The most interesting character was the female vampire that our geeky hero develops a love affair with. She is played like a fish-out-of-water innocent and displays some of the very unusual vampire traits associated with China, i.e. the hopping vampire! This type of detail specific to China is good fun to see and the character of the girl vampire was pretty good value. But the film as a whole was a bit ho hum otherwise with nothing much else sanding out very much. It is quite a cute film though and is hard to dislike but I personally only found it sporadically entertaining.","user":"Red-Barracuda","rank":[9,39]}]