[{"title":"The best sequel for \"The Boxar Children\" based on the books.","rating":10,"date":"10 May 2018","review":"All of the actors nailed it. The animation is the best and it looks so realistic. I didn't care what the people say but this movie is just so amazing. I highly recommend it just like the first movie. Please see this sequel when it comes on DVD in case if you forgot to see it in theaters.","user":"j-f-dameshek","rank":[6,12]},{"title":"Wonderful family series","rating":10,"date":"25 August 2018","review":"A wonderful movie that is great for the family and gives the feel of reading through the classic children's book. I hope they continue this series.","user":"slepor","rank":[2,4]},{"title":"Is it just me, or does this one seem like a downgrade from the first?","rating":6,"date":"24 January 2020","review":"Okay. I feel bad because I actually enjoyed the first movie and was fond of the books as a child. Aside from which, it's a kid's film so I hate to pick on it. But I'm sorry, this sequel feels incredibly downgraded in every aspect.<br><br>The story was fine. The voice acting was awful. I don't know if it was the new director that was brought in or the fact that three-fourths of the Alden children were recast, but the delivery and inflections in every line and reaction were so off. Even Joey King, an otherwise fine actress and the only child to reprise her role from the first film (she plays Jessie), also seemed to have some problems delivering her dialogue effectively. To top it off, the actor playing new character Joe spoke with the inflections of a child born in the Nineties (as opposed to a kid living in the postwar Forties). His language wasn't dated as such, but he definitely sounds more like a product of his time, than Joe's time.<br><br>Where a major issue lies with me is the character of Benny. I don't recall the original actor being nearly this obnoxious with the role, but in this one the recast actor shouts literally. Every. Single. Word. I half expected everyone to tell him to STFU, although some characters did acknowledge his outright annoying behavior. And yes, the character of Benny is supposed to be rambunctious and spunky, but not to the point where he's this obnoxious. The story and the film are supposed to have a quiet, timeless feel to it, as with the first film, and here we have this kid shouting every single one of his lines and disrupting what are otherwise charming, pleasant, atmospheric scenes.<br><br>The animation looks worse too. While the animation in the first was nothing special, the animation in this one is even more horrendous! Just awkward and ugly from beginning to end.<br><br>I gave this a slightly higher score because despite these issues, it is still a harmless film that can be enjoyed by young kids and it is a nice story about the Alden kids' summer trip to the family island and introducing new friends and characters. But do not expect much more than that from this movie. If you can keep this in mind and not hold it to such a high standard, you may actually enjoy this sequel a bit.","user":"scorpiovani17","rank":[0,0]}]