[{"title":"Some will love some will hate no doubt","rating":8,"date":"4 January 2019","review":"I saw Evan Rachel Wood and knew it had to be at least a decent movie. I was not let down. She renders a believable character, with realistic emotional expressions , with good and bad. And Julie Sarah doesn't disappoint either. It's pretty much a given that this movie won't be everyone's cup of tea and not just because of the plot which is touchy to begin with. It's not quite your run of the mill movie, it doesn't follow the pattern you see in most movies, it doesn't really offer the kind of gratification and structure many people are used to when viewing movies that are considered good. Rather it's pleasantly and/or painfully realistic both in the backstory and the emotions that are conveyed. It's meant to be that way, it's meant to represent a kind of drama that happens in real life whether we want to acknowledge it or not. In several respects one can draw a parallel between this movie and for instance Lolita, but not the movies in which the plot was altered somewhat to be allowed on screen, but the book. The lines are blurred, and there's no clear cut value of right or wrong that we are mostly used to in movies. And after all is said and done, can we really say where an abuse victim ends and an abuser begins? No, we can't but what this movie may force us to do if we allow it is to empathize with the characters and that isn't meant to bring any closure or relief either. There are joyful moments and gut wrenching moments but overall there is an underlying heaviness that never leaves throughout. There's just two people in need of rescue, in need of feeling loved and understood who happened to be on the same orbit for a while and this is a fragment of their lives. No happy ending no explanation. It's up to the viewer to understand and feel what they're going through.","user":"bloodmist88","rank":[13,14]},{"title":"Hard to watch, but worth it.","rating":9,"date":"14 June 2018","review":"If you've ever experienced an emotionally abusive relationship, this movie will probably ring true. I was intrigued by the way Laura was portrayed: not as a villainous one-dimensional abuser, but a woman in pain and inflicting pain. Evan Rachel Wood and Julia Sarah Stone had a great frenetic chemistry. Wood's obvious mental fractures and Stone's fear/sympathy combined to make a potent tension throughout. Many long, thoughtful silences and static shots. The camera work was brilliant. This isn't one of those films you'd pop in the DVD player on a Friday night, but I would recommend it for anyone seeking a quality character study.","user":"daciracher","rank":[19,28]},{"title":"Twisty erotic thriller!","rating":7,"date":"5 June 2018","review":"Evan Rachel Wood stars in this twisty erotic thriller about a cleaner who strikes up a friendship with a client's daughter.<br><br>A woman sits up and inhales. This is the first thing we see in Allure, the feature debut of brothers Carlos and Jason Sanchez, previously best known for their work in photography. \"What the hell's wrong with you, you crazy bitch!\" a man tells the woman, after they have had disengaged, violent intercourse that puts her very much on top and leaves him feeling exploited and emasculated.<br><br>Allure may open with a sex scene, but it is defiantly unsexy: mechanical, angry, abusive, and ending abruptly in the frustration of both participants. The woman is 30-year-old Laura (Evan Rachel Wood), a house cleaner working for the company owned by William (Denis O'Hare). When we first meet William, he seems to be an old ex of hers - but we soon learn that he is actually her father, anxiously indulging her destructive sexual behaviours with co-workers and others out of familial obligation. \"Anyone else would be fired for this,\" he says - but he keeps her on, and keeps an eye on her.<br><br>Meanwhile, Laura is drawn to 16-year-old Eva (Julie Sarah Stone), who is deeply unhappy that she must move in with the new boyfriend of her cosseting mother (whose house Laura cleans). \"You don't have to let your mother make your decisions for you, or control your life,\" Laura reassures Eva, with an irony that will only gradually become apparent, and so she encourages Eva to move in with her instead, without telling anyone. As police search for Eva, Laura shifts from being cool big sister to controlling mother - with an inappropriate sexual element coming between the women as well - and Eva finds herself a prisoner, physically but also psychologically.<br><br>Allure is the story of an abusive relationship (or of two, actually). For as we watch Laura manipulating, gaslighting and emotionally blackmailing her confused and sexually inexperienced young ward, it is clear that this is a replay of Laura's own traumatic loss of innocence. If Laura, in all her isolation and conflicted neediness, becomes 'sugar mama' to Eva, she also has a sugar daddy who is giving her employment and accommodation both to assuage his own guilt and to keep her close.<br><br>Shot by Sara Mishara in (mostly) long shots and subdued colours, Allure adopts a certain clinical distance from its three main characters which somehow - paradoxically - both eschews moral judgement and invites sympathy. Everyone here is caught in the toxic damage of someone else's desperation, and although the film is for the most part rigorously realist in its presentation, occasional shots of someone (it is too dark to tell who exactly) sinking and drowning in liquid shift the film's themes of emotional suffocation to the realm of metaphor.<br><br>Allure sets itself up to be an erotic thriller, but is all the better for avoiding cheap bunny boiler tropes, and instead focusing on character. Though hardly new, the notion that nobody abuses like a victim is here intensified by breath-taking performances all-round.","user":"asifahsankhan","rank":[16,23]}]