[{"title":"An uncomfortable film for those with uncertain paths","rating":7,"date":"4 July 2018","review":"This is a film that wants you to take a deep breath, that wants you to get context before you take the plunge into its depths, which though admirable, hasn't been executed to its fullest potential, and yet it has a heart. The actors do their job, and at some point you get past their insane hotness, which is complimentary, of course. The story revolves around an impulsive (maybe slightly drunk?) wedding and its implications for a very young couple, who haven't yet rooted themselves in terms of what they want from life. <br><br>The film gets into the rut of a possibly accurate on an average, but an over used male stereotype, that of a lazy ass, porn-watching, XBOX playing deadbeat young husband, but the catch here is, he's insanely attractive and kinda sweet, which helps. The glossy young couple were maybe meant to begin that way, maybe we were supposed to look through the eyes of an outsider, to whom everything would look glossy, but impractical. An unlikely, but possible theory. But anyway, the movie doesn't remain template driven for very long and soon gets it's own if not full bodied, at least a decent upper half. <br><br>Any movie that makes me uncomfortable, puts me in a different frame of mind than what I walked in with, is worthy of watching, so go ahead, it's a decent attempt at the fallacy of impulsive decisions leading to happy endings, but with a hot cast.","user":"sushmithaserenity","rank":[11,14]},{"title":"Good one but ....","rating":5,"date":"25 July 2018","review":"I am not sure I am the only one who don't know the end after watching the whole movie. I got the message what they want to give through the movie and get the same feeling if I were in the actress place. But I am not sure how to end the movie because there are a lot of what left in my mind after the movie such as How do the movie end ? What was the message that the director want to give in final scene ????","user":"tinttehlyanwai","rank":[3,3]},{"title":"Depressing....","rating":7,"date":"28 June 2018","review":"I gave it a 7, my feeling was to give it a 5, not because the acting was bad, not because the directing was bad, on the contrary, acting, directing was good, but because, having been in 2 marriages which ended, first one after 22 months due to her indiscretion and the second one lasted 21 years and again, due to her indiscretion with a work colleagues, ended.\nSo... If you are newly married or contemplating marriage, then watch this and LEARN! This movie is about a lesson in fidelity or infidelity, of seriously knowing exactly what both parties want out of life.\nIf you have split, then don't watch it because all it will do is remind you of the hurt, the disappointment, the sadness of an ending.","user":"Australian1","rank":[10,15]}]