[{"title":"CONSTRUCTIVE CRITICISM PLEASE.","rating":6,"date":"13 April 2018","review":"First off: a movie is a story (sometime fictional, sometimes not) that becomes virtual reality due to: 1) great cinematography 2) excellent script 3) good acting 4) CASTING choices. This movie falls into FANTASY, so you are not judging their government or their censorship. As far as special effects: they are not good, or even close to perfect, but terrible? I work with computers all the time. My 13 years old nephew can spot the smallest oversight. Still they are not making the movie \"unwatchable\". The acting overall is good, but taiwanese actor Darren Wang is EXCELLENT. The casting is flawless and the 3 main characters mesh together brilliantly. Finally, the screenplay. I would have give them 7 stars, if it wasn't for the special effect. What a pleasure to laugh like that ! Only Guardian of the Galaxy 2 has a better screenplay in terms of laughs. Also, I gave the an extra star because THIS MOVIE HAS NO GUNS, EXPLOSIONS, OR ACTION like we are used to. So, to me, it's a plus.","user":"rosiejackson-61661","rank":[13,14]},{"title":"Great, light-hearted fun!","rating":8,"date":"25 July 2018","review":"I think people dissing this movie are coming from the background of watching too many (exorbitantly budgeted) slick Hollywood movies and that is the bar they use to compare all other cinema. That is just NOT FAIR! <br><br>This movie should be watched with an open mind - forget the CGI - that's not the point - for me - its all about how creative the storylines are. The script was pretty good - but the imagination of these people... That's just brilliant! Winged people and Naga pearls ... Chinese mythology is so RICH! <br><br>If you are sick and tired of all the (plastic) Hollywood tripe - I would highly recommend getting into Asian cinema. Some of the most original and creative stories I have ever come across and just SO different. Love it. <br><br>This is a great popcorn movie. It's by no means a masterpiece of cinema - but its DEFINITELY entertaining! :)","user":"novyl-493-386937","rank":[8,9]},{"title":"Just another Chinese flop","rating":6,"date":"12 August 2017","review":"With the censorship of movies and lack of imaginations. very few movies from China worth your time to watch. This is definitely not one of those. I enjoy adventure movies, that's why I enjoyed the movie. This got full and logical stories, soso acting, OK special effects and make up. The music is thin. I won't recommend you to see this unless have time and money.","user":"lanjie731","rank":[14,24]}]