[{"title":"Ignore the clueless reviewers","rating":8,"date":"15 October 2018","review":"Before I even get into the laughable complaints made by the clueless, I must write that this is the first film in a very long time that I found compelling and didn't notice the \"long running time.\" Some films deserve to take their time to reveal the story. If that bothers you--go watch the latest inane, super hero CGI fest that spoon feeds you your shallow entertainment.<br><br>The idea that Man corrupts religion for his own ends is the main theme. It is obvious that many viewers have lost the ability to actually watch a film and grasp its concepts. They complain about \"no plot\" when it's right there on the screen. If the film is not edited with the frenetic pace of a television commercial--it is considered slow.<br><br>Yes, there are thematic similarities to the original Wicker Man (not the pathetic Americanized atrocity made recently) but that is just due to the use of an isolated setting and Pagan religion and mythology. The plots are distinctly different.<br><br>Someone made a comment about the use of a \"Zippo\" lighter being somehow how bad the film was. Quick research (which obviously the filmmaker did) shows that \"automatic\" lighters where available by 1889 and the particular lighter shown was available in 1905! Zippo did not invent lighters--they just refined them and mass produced them for WW2. Don't claim knowledge if you don't posses it.<br><br>Another complaint was the island's village was too primitive for 1905? Really, Hand-hewn buildings look just like this. Again, every idiot who can thumb type thinks they know better than the filmmaker.<br><br>This is not a review of the film but more a review of the proliferation of useless, pointless \"opinion\" blurbs that people believe are reviews. A review is also not just a recounting of the plot. Just typing \"this movie was a waste of time\" is not relevant to anyone but the typist.<br><br>If a film about man's corruption of religion and an creepy use of Celtic/Earth mythology acting as the metaphor and some gruesome violence thrown in doesn't hold your interest maybe Transformers would suit you better.","user":"davidbdr-1","rank":[496,680]},{"title":"Beware of high praise and scathing critique","rating":6,"date":"11 December 2018","review":"The people giving this film 10/10 are being too nice and those giving 1/10 are being overly critical. The truth, for whatever my opinion is worth, is somewhere in between. The acting is actually quite good, with Michael Sheen giving a particularly extraordinary performance. The setting is beautiful and the film overall beautiful to look at.<br><br>The concept is interesting as well and the first 45 minutes actually seem to fly by because the premise is so compelling; you'll want to know what's going to happen. Unfortunately, the plot seems to slowly deteriorate after that as Gareth Evans remembers that he needs to throw in a healthy amount of gore to please his greatest fans and the storytelling takes a serious hit in the process. It ends up somewhat confused and chaotic and not in an interesting way.","user":"flynncam","rank":[56,71]},{"title":"Its a sin that this film did not get a theatrical release.","rating":9,"date":"12 October 2018","review":"I cannot believe there are any bad reviews for this film. I'll keep this brief.<br><br>This film is an absolute gift for anyone who loves true horror. Much like The VVitch it is a beautifully acted and written period piece set in the early 1900's. The pacing is perfect, the tone is driving and rhythmic, never was there a point during this film where I was bored. The characters were fleshed out and easy to empathize with. Overall I thought this was fantastic. I think it's almost a waste that its a netflix film and did not get a theatrical release. <br><br>Anyone who loves the idea of paganism, cults, religion without pandering to Christians (which is what The Conjuring does, even though I am a fan of those films), or period pieces will love this film. Do your self a favor and give it a chance.","user":"eliasmmorris","rank":[385,547]}]