[{"title":"A Great Time!","rating":10,"date":"30 October 2017","review":"What a terrific time! After a long, tough day, I sat down in front of the television daring something to entertain me. I'm so glad I stumbled on A Dash of Love on the Hallmark Channel. The whole setup was really engaging, the performances were spot on, and the story hooked us in from start to finish. I thought I knew where the whole thing was going, but the screenplay, by Judith and Sandra Berg, kept me guessing. Don't let this gem pass you by.","user":"pirwinc-897-839428","rank":[5,5]},{"title":"This movie is on fire!","rating":9,"date":"15 February 2017","review":"OK, maybe I intended to make a pun and it backfire. What do I have to say? I LOVED this movie. I expected this to be a classic Hallmark movie that I enjoy for half and hour, and maybe pause three or four times to check twitter, but let me tell your something: I didn't paused it, not even once! And that's when I know it's going into my Hallmark's favorite movies list. <br><br>First of all. The plot was good. The acting was good, even the secondary characters were good. I swear 30 minutes into the movie and I was smiling life a fool.<br><br>Brendan Penny - and here I thought he had chemistry with Rachel Leigh Cook - may be one of my favorite Hallmark guys (along with Andrew W.Walker) and even though I enjoyed what he has done, he had me here smiling like an idiot. I saw Jen Lilley in \"The spirit of Christmas\" just yesterday and she did a good job, but in this movie, she was great, she played the adorable girl who is trying to get her dream come true. The most important thing is that...<br><br>What had me smiling for an hour straight is the chemistry between the two leads, OH MY GOD, I'm still smiling while I write this. I really hope they get to make another movie together. I'll be the first in line to watch it.","user":"MIssM19","rank":[10,12]},{"title":"Another Great! But what's the song?","rating":10,"date":"17 September 2019","review":"Love Jen Lilley and Hallmark. They know how to keep the classic plots fresh and engaging with great actors, music and filming. Even low scoring hallmark movies are better than most of what Hollywood produces.\nWhat is the song!??\nI've searched the web with unsuccessful results... \"They made the world for you and I, and it's splendid!\" Great song I wish I could find.","user":"dhillfw","rank":[1,1]}]