[{"title":"Truly Joyful!","rating":10,"date":"25 February 2019","review":"What started off slow soon took me on a journey of mystery and emotions. This familiar tale told from a new perspective was refreshing and brought new insight of why things happened the way they did. The actors did an amazing job of portraying the characters they played. The addition of just the right amount of humor added a refreshing and comforting feel to a not so comforting subject. This is a truly joyful film to share with family and friends.","user":"mdc-84948","rank":[8,10]},{"title":"I felt healing in my heart.","rating":10,"date":"7 February 2019","review":"I want to point out that I know one of the actors in this film. I came into this movie to support him and the filmmakers involved but as a film buff I was looking forward to the film after watching the trailer last year. As a Christian I am on the constant look out for new Christian films, sadly a majority of the films released in this genre are mediocre at best. I support them but yearn to see high production in these films. The Christ Slayer completely caught me by suprise. I knew from the trailer it was going to be powerful but not to the extent that it turned out to be. We all know to often that trailers don't always depict how good a film will be but this one certainly exceeded the trailer. This doesn't mean the film comes without its faults such as the visual effects which cheapen the film a bit.<br><br>An important note is this film is NOT biblically accurate. One of my main reasons for giving it 8 stars is due its inability to stay in line with the historical details of scripture. I'm fine with the story, the different viewpoint and all but the film could have portrayed areas that are detailed in scripture. This is one of the areas that I struggled with. Thankfully the story, the message and the execution of it allowed me to \"overlook\" this and get captivated. Music was great! The story beautifully executed and the acting certainly needs to be applauded. The rollercoaster of emotions I went on this film was intense. Almost everyone delivered a great performance especially Albus. What a sweetheart! My heart melted everytime he was on screen and I would catch myself laughing often. Great casting choice! What a fine young man. Another noteworthy performance is the lead himself. The emotion pulled out of me was unreal (I'm telling you sobbing like a little girl) and like my title I felt healing in my heart. POWERFUL! There are too many scenes to name that just blew me away. I highly recommend everyone to watch this film, not as a biblical account but a message of Christ's love and forgiveness. If you need healing WATCH this movie!","user":"DEE_CEE_1","rank":[10,16]},{"title":"Totally captivating!","rating":10,"date":"12 February 2019","review":"After watching this film, I realize I had been completely immersed into it and was not even aware of things happening around me. I was so captivated by this story and the quality of this production that I very highly recommend everyone who reads this review to watch and enjoy this movie as much as I did.","user":"rpalmer-12128","rank":[9,15]}]