[{"title":"Horrible","rating":1,"date":"30 June 2017","review":"Words cannot express how horrible this movie is. There is nothing else to say besides save the 1.5 hours of your life and read a book. The reviewers are now telling me I must write at least five lines for a submission. Seriously, I am 50 years old and this was by FAR the worst movie I have ever seen....and I have suffered through Will Farrell movies. Enough lines yet?","user":"oreo-30953","rank":[66,69]},{"title":"Everything is sooo bad","rating":1,"date":"19 February 2017","review":"I saw the IMDb points (6.9) and rented the movie. That cant be bad I thought. After seeing few minutes from beginning I realized that this was just waste of my time and money. I checked the IMDb rating again and noticed that only 30 people had given the rating by that time and half of them gave 10! Those were obviously the whole cast and the other members of staff. I cant call them as directors or film makers when the more correct term should be \"con artists\". The movie poster shows the statue of liberty mostly under water but of course we won't see anything like that in the movie. The synopsis (made by film makers) tells about the \"arch\" that is built by a scientist whose warnings are not taken seriously. The \"arch\" is a MOTOR BOAT! The whole plot and the acting is so unbelievable that one can't even start to criticize it. You can maybe have some kind of an idea of what I am talking about from one scene: There is a kid playing on the floor, a woman comes and tells that his mama has just died. The kid is very sad and cries. Another scene happens on the same site after about 10 minutes. The kid is still playing the same way and looking sad. The same woman enters and asks \"What is the matter with you?\". The kid answers, that he is sad because \"nobody wants him\"!! They both just forgot that his mother has just died. That fact did not play any role anymore in their life. This movie is so bad it is not even a good bad movie. It is just a \"wanna be\" big catastrophic movie with a budget of a small home movie and it really looks like one.","user":"markus-miikkulainen","rank":[53,56]},{"title":"Oceans Rising: I was rooting for the ocean","rating":2,"date":"17 August 2017","review":"In this brand new shiny Asylum mockbuster we see the earth flooded with no ark in sight! Just two scientists, their small craft and a few people who somehow someway survived the torrents of water.<br><br>Being an Asylum movie as you can imagine it's awful! From the sfx, to the cast, to the script, to the entire movies creation.<br><br>Ridiculous concept, countless flaws, plot holes and just little to no redeeming features.<br><br>I've always said that The Asylum should stick to slapstick comedy as the few bearable movies they've done have come under that category.<br><br>When a story about a flood is less realistic than the biblical one, you know you have a problem!<br><br>The Good:<br><br>Nothing<br><br>The Bad:<br><br>Usual Scyfy pseudo science<br><br>That bloody kid","user":"Platypuschow","rank":[21,21]}]