[{"title":"May be over-dramatic yet not that untruthful...","rating":8,"date":"3 May 2017","review":"Any review of this film is very much depended on the angle the reviewer looks at it. And for certain it can not be free of its tragic historical background. It's possible that a foreign viewer may consider the story of \"Roza of Smyrna\" too excessive and too over-dramatic to be really touched by it. This wouldn't be the case if he new the whole story, that is to say the huge historical burden it carries for its heroes. This burden has to do with the events that marked the fall of the Ottoman empire after the end of world war 1. In brief: The Greeks invaded Asia Minor which according to their own ethic ideology/story was the cradle of their national rebirth since this area was Greek speaking before the Turks conquered it less than ten centuries ago and since by the time of the W.W1 ending, millions of Greek orthodox Christians were still living there, especially by the Black Sea coast (\"Pontos\"), the Aegean coast, and eastern Thrace. This invasion resulted in an unprecedented disaster for the Greeks. The Turkish troops, re-organized by their new leader Mustafa Kemal, defeated the Greek army who had to leave the area, abandoning the Greek population to the anger of the Turks, especially the numerous insurgents, guerrillas and all kinds of irregular soldiers who were fighting on the side of the regular Turkish army. Smyrna (Izmir),this amazingly developed for the standards of that time great city of the Aegean coast, a city where the prosperous Greek community was the prevailing one in power, wealth and numbers was set on fire and totally destroyed and its frantically and in horror and panic trying to escape Greek population to an unbelievable extend slaughtered. As a result of this story, the Asia Minor Greeks either fled in millions to Greece and elsewhere or left their bones on their homeland which ever since lived in the Greek collective memory as a lost Paradise. This unprecedented disaster -not really known abroad- is named by the Greeks with a single word \"i Katastrophi\" (with a capital K: the Disaster, the Katastroph). Well unless you know all this in details, it's rather difficult to really understand how a Greek may approach Roza's of Smyrna story, for it may seem too unreal, too excessive, too over-dramatic. It may be so, yet, there are so many real tragic stories about unthinkable individual human tragedies that took place during and due to those events (the \"Katastroph\") that for the Greeks, no story connected to those historical events really looks unreal, exaggerated, overblown, or far-fetched. And this one, which is actually a really well made Greek-Turkish co-production is not about bad Turks and their good Greek victims. It's a story about how any ethnic angle of viewing at it may be misleading and underestimating the human factor (the simple ordinary people who are the victims of their national-political leaders)and thus unjust. This is the message delivered to the main character of the film through his investigation and his efforts to unveil the secret that Roza, an old lady descending from Smyrna living in Athens, persistently tries to keep for herself. The title of the film could be \"Roza's secret\", and i think one may find quite thrilling the process of unveiling it, and once it's uncovered, he may justify the dramatic reaction of its carriers, and thus be really touched and deeply moved.","user":"philipposathina","rank":[14,19]},{"title":"You have to know history to understand","rating":7,"date":"26 December 2018","review":"The greatest problem is that you have to know history to understand this movie and be touched so I think the director should have given a prologue at the beginning as it is done in many movies.This is very important if we want a movie to be seen by everyone not only from Turkish and Greeks.Good performances and it is a very educational movie which talks about the disaster that war causes to both sides...for this humanitarian approach I give a higher rate than the movie deserves\nIf there was a historical prologue,more scenes from the past in Ismir between Ross and Ismail as flashbacks this would be a much better movie.\nStill deserves to watch it :)","user":"evi-75011","rank":[3,3]},{"title":"good for educative purposes","rating":6,"date":"23 February 2018","review":"It would have been far more fair if the title were chosen as \"Roza of Clichés\". Death after saying the last love words, transformation of a typical hardliner etc... Nothing special. I got particularly frustrated that despite its title the number of scenes set in Smyrni/Izmir is too few. Seriously, why does Roza's story end up in Istanbul, a city which she has no connection, instead of a dramatic return to Izmir?<br><br>So the movie is an average one in any sense. <br><br>But since it focuses on the lies of nationalist history-writing and promotes the Greek-Turkish friendship, I think this kind of movies must be produced even if they have many flaws like this one. It will help teenagers of both countries overcome the effects of brainwashing of their states.<br><br>By the way, the tourist guide in Izmir was Ömer Kavur, who was actually a well-known movie director. Nice reference.","user":"sakarkral","rank":[3,4]}]