[{"title":"Mind Candy","rating":9,"date":"23 July 2018","review":"If you're expecting the gritty, sweaty reality of rent boys in London, you'll find this movie disappointing. While there are some brief, decidedly homoerotic poses struck by the boys that replicate some of Caravaggio's paintings, the rent boys in this fantasy film are more about the cerebral than the physical. As mentioned several times in the film, they do not like the term \"rent boys,\" preferring to be called \"raconteurs.\"<br><br>The clients are obviously drawn to the physical beauty of the boys, in particular Harris Dickinson, but (and one must be reminded that this is a fantasy) it is the boys' ability to discuss artists such as Caravaggio in depth that seals the deal, so to speak.<br><br>One reviewer referred to this as \"pretentious 'dibble'\". Not sure what \"dibble\" is. I didn't notice anyone in the film dribbling, so presumably he meant \"drivel.\" I have to totally disagree with that. I found it all to be fascinating and the actors carried it off with marvelous skill.<br><br>If I attempted to explain what it all meant, I would undoubtedly descend into pretentious drivel. It was somewhat amusing and presumably intended to mentally stimulate the viewer by making it all open to different interpretations. It undoubtedly explored the different forms of exploitation, but not in a way that demands all viewers react in a singular, predictable way.<br><br>I thoroughly enjoyed Postcards from London and will probably watch it again because, like a painting by Caravaggio, it contains far more than can be absorbed in one glance. I can easily see that it wouldn't appeal to everyone, but it definitely deserves attention as a thought-provoking film.","user":"Suradit","rank":[27,34]},{"title":"Signpost for the career of Harris Dickinson","rating":8,"date":"31 March 2018","review":"The film will not get widespread acclaim as it is a classic, non-classic, arty film in the same way that Betty Blue, Withnail &amp; I, Donnie Darko, Jonny Suede and Cool World were.\nIt's a showcase for the undoubted talents of Harris Dickinson, a man who exudes charm and emotion - also in real life, which will get him far in a transition from indie to mainstream.\nKeep an eye out for him.","user":"simon-49467","rank":[17,25]},{"title":"R-Rated thematically, PG-rated visually","rating":3,"date":"5 November 2018","review":"I saw this at Frameline42 and the descriptions given played up the sexiness of the movie. While thematically it was risqué, it could have been shown on PBS due to the lack of any real nudity. While the acting was well done, the production was sub-par.<br><br>There was a scene where the protagonist is having promotional photos taken. The photographer asks him to drop his underwear. He shrugs his shoulders and it is implied that he is pushing his underwear off. The camera stays above his waist during the entire maneuver.<br><br>The sets were very stylized and claustrophobic. It felt like they were filming a play. And not in a good way.","user":"mtoda","rank":[8,14]}]