[{"title":"Goosebumps meets Saw","rating":8,"date":"10 March 2020","review":"A stockholm syndrome horror story, full of gore and gruesome scenes that make your senses tingle, with a twist or two along the way. The main character is twisted, the cast is believable. Like an \"R\" rated Goosebumps book. Like Saw without the righteousness.","user":"eyewonder-66730","rank":[5,5]},{"title":"Paper thin plot and cheap jump scares","rating":5,"date":"13 December 2019","review":"Saw this as an early viewing for Friday the 13th.<br><br>The Dare has a lot of potential. Though the plot is paper thin and questionable, it could have been a lot more enjoyable if the movie was constructed a little differently - cut some scenes and add some more backstory. The characters felt underdeveloped and I didn't care for what happened to them because of it.<br><br>There were a few moments which made this movie great, but were quickly ruined by cheap jumpscares, guy with a mask and actors that seem to have no previous experience in acting.<br><br>All in all: If you want to make a gore horror movie, then do it and do it good!","user":"jelliejune","rank":[11,16]},{"title":"Brilliant, struggling to understand the low ratings","rating":8,"date":"4 March 2020","review":"In a completely over-saturated revenge torture horror, I'm very impressed. Yes, we've seen Saw and God knows how many piss-poor clones before, and admittedly nothing particularly new is done here - but its done with style, with good acting, a decent plot with a backstory that makes sense, has great lighting, direction and isn't just a showcase for torture and twisted ways for people to die. It could have done with a bit more background on some of the characters, but overall, this is a great late night horror flick that manages to avoid most genre specific cliches and try to give a degree of realism, mystery and empathy to the protagonists case. There's absolutely nothing new here, but what you get is what you expect, and it's all done very well. Bad reviews here must be from non-genre fans or from rival studios perhaps... Everything in the movie, other than depth of characterisation (main hero and main bad guy fleshed out nicely, others were waiting to drop off A'la Star Trek...) No idea what they were expecting, or why they mark down a quality piece of work... Great late night fun!!!","user":"mark-179-360743","rank":[7,11]}]