[{"title":"Olivia Wilde was made for this","rating":8,"date":"4 April 2019","review":"It's great to see a film that deals with such subject matter in such a stark and realistic way. Films like peppermint do little to elevate tired approaches of women fighting back, as they're so unrealistic they're laughable, but this film is so different to that. Olivia Wilde shines in this role, as the wounded healer who helps women and children escape the war zones of \"domestic\" (hate that phrase) violence, and fleeing her own abusive husband. It's an understated, yet powerful, portrayal of a widely under reported blight on society. It's a shame this film hasn't received the attention and acclaim it deserves, as it's fraught with tension throughout, presents in an empathic and sensitive way and is really engaging. Interpersonal violence is still a misunderstood and under resourced issue that hasn't ever been tackled effectively, certainly not in the uk. We are losing 3 women and 2 children a week to their perpetrators, yet are losing shelters every month that could save lives. Films like this explore the possibility of a world where it could be different.","user":"lizshotter-19401","rank":[72,90]},{"title":"Tough to Review, tougher to watch","rating":7,"date":"29 March 2019","review":"I think some of the other reviewers were expecting Death Wish or Taken 4. That's not this movie. This story is about abuse survivors. It's about what it takes to break free.<br><br>It has some powerful moments that make your stomach drop and your heart ache. They felt real to me. Several times, I found myself wondering if they hadn't cast real victims retelling their stories. That's how good it is in that portion. But this is a slow film, so slow that I almost pulled out my phone to do stuff. That's never a good thing. I dropped my stars to a 6 because of that. If I were more honest, the story is more of a 5, but I bumped it up to a 7 because of the acting. It really is phenomenal, imo.","user":"Brattsy","rank":[88,115]},{"title":"No, not just another revenge movie. This one grabs you by the throat and it won't let you go.","rating":7,"date":"14 April 2019","review":"I'm looking out the window,\nand the trucks won't stop coming.<br><br>Anyone saw \"John Doe: Vigilante\"? No? I hope you're not going to waste your time on that one. Just put that intention aside and watch the movie \"A vigilante\" instead. The latter is much better, much more intense and at times awfully brutal and cruel to see. Highly recommended. The most disturbing is the fact that in reality, many people are the victims of physical and psychological abuse within a family circle. People who are mistreated daily in an inhumane manner and who can't find a way out of these miserable circumstances. And strange but true, most victims have an immense sense of guilt and sometimes can't bring themselves to turning their back on the abuser.<br><br>Sadie (Olivia \"Life itself\" Wilde) is a female version of Joaquin Phoenix in \"You were never really here\". Victims call her and first say an agreed phrase and then state their personal details and home situation. And Sadie doesn't let any grass grow under her feet. In no time she appears at the door of the person concerned and she takes care of the situation. The first fragment she makes it clear to an abusive businessman how things will continue from then on. It's quite shocking. One moment Sadie looks at a confident, arrogant person who doesn't tolerate contradiction. Let alone from a woman. The next moment you see the same person beaten up, anxiously agreeing with the requested requirements and leave the house with a clear message. And that message is to never return. I had to fight the urge to start cheering, but I wouldn't mind if there were more ladies like Sadie walking around on this globe.<br><br>Sadie, herself a victim of domestic violence, is on a mission. A goal she set for herself with the help of a fellow victim she knows from a support group. The message from that person was quite clear. She was talking about victims that don't make it every day. That cemeteries are full of women and men who didn't survive. And that Sadie wastes her time while she's still alive and doing well. That she must fight back. Even if it kills her. And when Sadie finds a book about combat techniques, her decision is made. In fact, that's the only thing I had questions about. First of all, I thought that the roommate's plea was rather presumptuous. Or was she also a vigilante who beats up perpetrators? And second of all, it seemed a little unlikely to me that a handbook could transform someone into a dreaded revenge machine. Perhaps the survival trips Sadie undertook with her ex, also provided experience.<br><br>\"A vigilante\" is not a pleasant film. It shows the downside of our society. And Sadie tries to turn the tide here like an outright John Wick. The intention is not to kill the targeted persons, but to remove them out of the victim's life. But it's not only the reprisals that demand attention. The most impressive images are those in which you see Sadie languish and how she's still tormented by her own past full of abuse. The moments that she suffers physically and psychologically and crawls around anxiously while grinding her teeth and whimpering about demons torturing her are painful to see. Her inner wounds are probably as horrible as those present on her back. In my eyes, this was a piece of brilliant acting by Olivia Wilde.<br><br>\"A vigilante\" isn't just a revenge movie. It's more realistic and more shocking than other revenge films such as \"Revenge\". And this mainly because of the realism. The real-life testimonies of victims and Sadie in the support group. At those moments it seemed like a current affairs programme. Sadie also has another goal in mind. Kind of obvious when you see the meticulously filled map of the US. The fact that the revenge will be sweet and a life insurance policy plays a specific role, is something you get from Sarah Daggar-Nickson very slowly. The story itself is an entanglement of the present and the past. It takes a while before you know what's going on. And the highlight is the ultimate confrontation. This section increases the spectacle content of the film and reminds you that it's a feature film. And yet you are left with that uncomfortable feeling and you realize some people live in a hopeless situation. And not only female victims. Also male victims. So ... Help us, Sadies of this world!<br><br>More reviews here: movie-freak.be","user":"peterp-450-298716","rank":[29,37]}]