[{"title":"whoa !! , a lot of mixed feelings, unrealistic reviews up in here..","rating":7,"date":"23 August 2018","review":"Let me cut it short,, not the best romance comedy ever,, but gotta give them it was enjoyable ,,<br><br>The plot for me was original ,, and it peaked perfectly, with that easy connected script ,, i really liked it .. the comedy was quick, wasn't laughing on my back, but had more than few giggles here and there , and the ending of was satisfying with a little funny surprise.<br><br>The cast ,, first time watching Milo, Mil Gibson's son ,, and apparently he's been acting for less than two years now ,,but honestly, the man got the acting genes and he did well ... as for Jordan Hinson, Oh, i loved her back in Eureka ,, amazing show, gotta watch it if you didn't,,, and she was good here too,, also liked they brought Colin Ferguson as a guest too,, wished he had more lines though .. :D <br><br>anyway,, saw a lot of 1/10 followed by 10/10 reviews ,, Nah,, not that bad and neither that good .. the move is good , enjoyable and is recommended..","user":"Aktham_Tashtush","rank":[21,26]},{"title":"Good original movie","rating":8,"date":"25 August 2018","review":"I enjoyed watching this movie, the script is original. You cannot fully predict what will happen in the movie. had some good funny moments. It allows you to kind of get attached and feel for the bad guy.","user":"manexact","rank":[9,13]},{"title":"At first I wasn't sure, but...","rating":7,"date":"20 August 2018","review":"Already at the beginning of the movie I thought, No, I don't like people who break into homes, this is not my kind of movie. But... separate myself from my feeling about burglars, the movies, the cast did a really good job! The story, without giving anything away, drew me in, I felt for the characters, I could understand how it could happen, if someone is not a bad person deep down and would really like to do the right thing, while the other is a bit of an attention seeking nut case.\nOne thing was the number plate, I expected more to happen about that...\nI think it is entertaining and funny enough to watch and Milo played his part well. Someday he may be as good or as popular as his Dad, even if there is no Mad Max.","user":"Australian1","rank":[10,16]}]