[{"title":"Great finale of modern Yakuza triology","rating":8,"date":"22 September 2018","review":"This is the last movie in Outrage serial, and what a great ending it is. There are a plenty of new charachters and some of the charachters from previous Outrage movies, but Otomo is still there, this old style Yakuza is giving creeps to all of Yakuza clans, fantastically played by Beat Takeshi, you can feel his specific and nihilistic humour, just enjoyment to watch, other actors are also great in their roles and this is the last movie to feature Ren Osugi, he was one of my favorite Japanese actors in the last 20 years, may he RIP. I must admit that i enjoy more this movie than the previous, Beyond Outrage, i still don't get it why so much negative reactions and rates for this installment. If you love Beat Takeshi, Yakuza and gangster flicks with sense of humour this movie is definetely for you.\nI gave 8/10.","user":"aleksandarsarkic","rank":[8,10]},{"title":"Unsatisfying end to the trilogy","rating":5,"date":"20 October 2018","review":"Outrage Coda is a violent but unsatisfying end to the Outrage Trilogy. The main problem is that Takeshi Kitano's Otomo is barely in it and little time is given to his story/motivations. As a result, when he goes on his climatic rampage (that's not a spoiler if you've seen the Outrage films -- He always goes on a rampage), you don't care because the film hasn't built it up properly. The rest of the major characters are all very superficially drawn and equally evil, so it's tough to care about who is doing what to whom during the convoluted schemes. The ending seems like it was supposed to be very moving, but is more likely to leave you going, \"huh?\"<br><br>That said, I strongly recommend you watch this immediately after watching the first 2 films. At the very least, Kitano's character's lingering resentment from those films may carry over and round out his character in this film.","user":"ipkevin","rank":[8,12]},{"title":"Not as Good as the Previous Two Outrage Movies","rating":8,"date":"5 August 2018","review":"Being a huge fan of the first two Outrage movies, I anticipated the newest (and apparently last) Outrage movie in the franchise, Outrage Coda.<br><br>After watching the movie I had the definite sense something was missing. The most obvious was that many of the participants in the first two movies weren't there. They were all killed off either in the first or second movie. There's plenty of mob killings in Outrage Coda. Yes, there is action galore, but ....<br><br>In my opinion, the absence of Detective Kataoka, the slimy, scheming, corrupt detective who was the Iago to Otomo's Othello is a serious drawback. His conniving scheming between the major crime families and between Otomo and the crime families provided the drama which made the story and the action compelling. Detective Kataoka is not in Outrage Coda obviously, he was done away with in Beyond Outrage, but the scheming, conspiracies, and intrigues between the two families are. This results in a lot of back-and-forth between the families, conspiracies, action, and shoot-outs, but an overall less interesting movie than the first two.<br><br>Takeshi Kitano is a good filmmaker, and it is a good movie. For this reason, whether or of you are a confirmed fan of the first two, you should purchase this movie. If you are an Outrage fan, you will watch the first two movies a lot more and this one less.","user":"kaljic","rank":[7,11]}]