[{"title":"I liked it!","rating":9,"date":"18 July 2019","review":"I know there's a lot of diss from other reviewers. Nobody seem to like the script, the actors, or the humour. I can understand that there are some uneasy moments and scenarios or jokes that are cringe-worthy and kinda offensive. But isnt real life the same? There's no censorship. No rules. No mannerisms. Just plain, ugly truth to life. This is it! So that's why I found myself enjoying this movie. The movie follows the downward spiral of Kate Stone who focuses only on herself and doesnt even do a great job of it. She gets to look after her awkard, cannot-fit-in-society type of niece for a short few days but through trial and errors, she soon realizes that she cares for things which she once despised (ie. family, coworkers, life in general). It's a story of redemption and triumph!","user":"hic66","rank":[20,22]},{"title":"Some Laughs in This Quirky and Predictable Comedy","rating":6,"date":"17 July 2019","review":"Some laughs here, as well as some rough spots, in this quirky and predictable comedy starring Taylor Schilling. She is excellent in her portrayal of Kate, a completely self-absorbed workaholic, employed as a Senior V.P. for a New Jersey hedge fund.<br><br>Kate is asked by her brother to watch over her 11-year-old niece Maddie (Bryn Vale) for one night while they place his mother-in-law in hospice care. Of course, I don't have to tell you things will not go according to plan and they'll be plenty of misadventures and lessons to be learned along the way.<br><br>In addition to Vale's fine performance, Kate McKinnon and Brian Tyree Henry add well to the mix here in supporting roles. All in all, I did get some laughs at times, and I would say this movie was a decent feature debut for writer and director Laura Steinel.","user":"larrys3","rank":[11,14]},{"title":"Very enjoyable, Taylor Schilling is awesome!","rating":8,"date":"3 January 2020","review":"A very lovely story, pretty funny, and heartwarming! All the stuff that happens is entertaining; everything about Family is great I'd highly recommend it. I love watching Taylor Schilling in anything after Orange is the new black.","user":"UniqueParticle","rank":[4,4]}]