[{"title":"A refreshing approach to the subject.","rating":8,"date":"1 October 2018","review":"As a physicist and a SciFi fan, I rather enjoyed the movie. It was very approachable in terms of dialog and the science seemed reasonable and accurate. I would highly recommend this if you like a thoughtful SciFi approach to UFOs.","user":"docdetroit99","rank":[55,58]},{"title":"Bring out your inner geek with this thoughtful film","rating":7,"date":"7 September 2018","review":"This was a very decent film and definitely worth watching - the acting was underplayed and there were no stupid special effects - just a good interesting plot and story. <br><br>I have no idea if the math was accurate but it seemed quite plausible and the mystery kept me waiting until the end - I almost felt like a math genius just watching it unfold.<br><br>The acting and direction was good - the usual aspergers/autistic type math genius that gets to prove his point by solving a really hard problem - made me think that the future of human kind will probably be in the hands of someone like this.<br><br>Not the average action packed sci-fi alien squealing fest but very entertaining.","user":"tarquin-65274","rank":[70,81]},{"title":"Thoughtful and refreshing approach to UFOs","rating":8,"date":"5 September 2018","review":"\"UFO\" definitely went under the radar, no pun intended. I had not heard of the film until browsing the Internet. I was intrigued by the plot description and after watching the film I can say it did not disappoint. First off I was excited to see \"UFO\" took place in my town of Cincinnati. The story was clearly inspired by the real life events at Chicago O'Hare airport in 2006 where dozens of airport personnel, pilots and passengers witnessed a saucer shaped object hover over the airport before darting up into the sky at an incredible speed. In the movie after a similar event at CVG, Cincinanti's largest airport, both the government and a brilliant math student race to resolve a mysterious binary cipher delivered by a craft that briefly appears over the airport. The story is fascinating and mirrors the aftermath of the Chicago sighting, when the media was quick to label it simply a weather phenomenon but many silenced witnesses were left frustrated with what they know they saw. The director takes a refreshing approach in actually delving into the topic, rather than exploiting and ridiculing it. You won't see any crazy special effects or Amy Adams talk to a genius octopus, just ordinary people trying to make sense of an extraordinary situation. The film has a satisfying ending but you will be left wanting to know more. I highly recommend this film to the UFO enthusiasts and the skeptics alike, as well as those just looking for a smart and interesting SciFi movie without Matthew McConaughey getting stuck in the wall.","user":"cabezatuck","rank":[108,136]}]