[{"title":"Absolutely ridiculous and free to do anything","rating":6,"date":"6 August 2017","review":"This movie continues further into be so horrible, ridiculous, and stupid that is entertaining, enjoyable, creative, and glorious. Not the best, but great. Sharknado was originally a cheesy shark movie with a tornado, but this franchise has gone berserk. All hell breaks lose in this movie, but I love how this ends and cant wait for Sharknado 6, this movie honestly seems like a set up for sharknado the final chapter or something. This movie was hilarious and great with all it's bad movie elements, but it is obvious they acknowledge that and go for it. I still like the story somewhat and the characters even though it is mostly ridiculous.","user":"SerialKillerFTW","rank":[21,26]},{"title":"Ridiculous, but fun","rating":6,"date":"12 August 2017","review":"When going into a Sharknado movie, I think the first thing you have to remind yourself is that, it's going to be pretty rubbish. The whole series is just absolutely ridiculous, but that's what makes Sharknado, Sharknado. It's just a bit of out of this world fun, with terrible puns (seriously, Fin and Gil?) and just some really bad acting. And bad acting, especially is something you have to remember that is going to be going on throughout any Sharknado movie.<br><br>But the actors do really well, I wouldn't be surprised if they were told to act badly instead of taking the job seriously.<br><br>Sharknado 5 is, in my opinion, the best Sharknado of the series. We actually get to learn more of the science in the series. It was quite a leap from the last one, and it was pretty good. This one did a good job and I think it might have done the series some good.","user":"SyoKennex","rank":[11,13]},{"title":"Sharknado 5: It just doesn't get any better does it!?","rating":1,"date":"21 August 2017","review":"Sharknado 5 is by far the wackiest, craziest and most over the top movie in the franchise. But here is the problem, that isn't a good thing.<br><br>The action sequences are still dumb and look awful, the wall to wall \"Jokes\" simply aren't funny and the movie has absolutely no redeeming features.<br><br>Movie references, various celebrity cameos and Tara Reid grunting like a pig in heat in every other scene.<br><br>I do hope, I do pray (And I don't even believe in that nonsense) that this is the end but considering the cliffhanger ending I fear we'll see more shortly.<br><br>The Good:<br><br>Chris Kattan as the British Primeminister is still better than Theresa May<br><br>The Bad:<br><br>Sam Fox, really!?<br><br>Tara Reid<br><br>Still a Sharknado film!","user":"Platypuschow","rank":[22,30]}]