[{"title":"Unexpected....","rating":7,"date":"22 September 2019","review":"So I'm home looking for something scary and I come across this little movie I've never heard of. Is it scary, is it a comedy, at first it's hard to tell. Looks like a Hallmark movie at the start! But I have to say I was pleasantly surprised! It's so unexpected. It's so cute with a touch of creepy, and just a great story. I didn't look at reviews until it ended and I'm happy to see most agree with me!","user":"dionrenee","rank":[9,10]},{"title":"Light Comedy Thriller With A Shakespearean Twist","rating":8,"date":"14 July 2019","review":"This is a neat little comedy with an edge of suspense. The premise is basic: A theatrical troupe gets together on an old estate in New England in order to rehearse and present MacBeth. It being \"the Scottish play,\" things go wrong.\nIf you know a little about theater, you may know that productions of Shakespeare's play about a murderous pair of royals often go awry. Alec Guinness, for example, got the worst reviews of his life for a MacBeth he did in 1963 or so. (I've heard the audio version he did for Caedmon. It sounds like a great performance to me.) Actors, directors and producers have stories about bad productions and disasters surrounding the performance of MacBeth.\nGhost Light makes clear from the start the superstitions around the play. You do not have to know much more than that to enjoy what is a nice, light look at people who make theater for the love of it.\nThere is a lot of nuance in this film. The actors are shown in multiple lights. Carol Kane is sympathetic as an overplaying Witch, Cary Elwes, who, at first, seems like a self-centered ham, becomes a serious MacBeth. Roger Bart as the stressed, kindly director, centers the movie.\nIf you know the play fairly well, you'll notice the parallels between the actors' lives and those of the characters they play. The cast in uniformly good. Shannyn Sossamon is very convincing as the lady who wants to play Lady MacBeth. Tom Riley, whose character rehearses Macbeth when the actor whose supposed to play him is momentarily out of commission after a mysterious on-set accident, is really good at playing an actor AND playing MacBeth.\nLiliane Klein and Zele Avradopoulas as the landladies who lease their space to these over-ambitious but weirdly gentle troupers, highlight the world outside the play, until...well - watch it.\nThe special effects are good, and, indeed, a movie which has, as its goal, the idea of showing how and why this particular play makes actors a little cray-cray, should have good special effects.\nThis is an enjoyable way to spend a little over ninety minutes. if you have affection for theater and enjoy a few riffs on a bardic theme, this is for you.","user":"fcwemyss","rank":[9,11]},{"title":"Loved this movie","rating":16,"date":"16 October 2018","review":"We were grateful to have caught this flick at the Woodstock Film Festival. It was showing at noon in a small town about 45 minutes from us. But the plot sounded intriguing, and the movie did not disappoint. Great ensemble cast (indeed, the movie ended up winning a special award at the festival for ensemble cast) and , just the right use of special effects for a dark comedy that sought to spook you a little bit. This is a gem of a small-budget movie.","user":"johnpenneynews","rank":[26,40]}]