[{"title":"I want to work with them \"In the Aisles\".","rating":8,"date":"2 December 2018","review":"This movie has a unique nature, it will move your mood to a different level ,it will ring a lot of bills and it will make you wonder a lot about life.<br><br>It starts with a beautiful \"Johann Strauss\" music, then we will be taken into a journey between the aisles of a supermarket, this journey starts with the process of hiring a new employee \"Christian\", then the events follow to know more about the routine of the employees and their habits during different occasions.<br><br>The performance of the actors is the best here, they look as normal people we see everyday, their reactions are normal or not cinematic so they give you the feeling that anyone of us can be in their places.<br><br>The background of each character is introduced in a simple way, and to a sufficient extent.<br><br>Most of the events happen in the supermarket, but there are some external scenes. However you may wish that all the events remain in the aisles as they have a unique magic that attracts you.<br><br>The movie has a message about life that is delivered in a very simple way, but not all of people may catch it in the first time.<br><br>The directing added a lot to the nature of the movie, there's a great attention to details and this is clear in the connection between the final scene and the scene in the 9th minute.<br><br>Finally, if you ever wondered about the life of people in IKEA or any supermarket, then this movie is recommended for you. You may feel it's elongated as two hours movie, but you may wish if it could stay more. It's not boring and rewatchable.","user":"MplusA92","rank":[21,23]},{"title":"Beautiful drama with a dreamy Workplace","rating":10,"date":"7 January 2019","review":"The story is nice and the environment of the story is it's key aspect. The characters are unique and nice. The workplace is shown in a well detailed manner and makes you want to work there and be like these normal people in the store.","user":"aramthilak","rank":[10,14]},{"title":"Between the shelves","rating":6,"date":"30 May 2018","review":"\"In den Gängen\" or \"In the Aisles\" is a new German movie from 2018 and one of my country's big players awards-wise this year I think. Director is Thomas Stuber and he worked again with his longtime collaborator Clemens Meyer, who is the man in charge of the original short story this film is based on. Looking at that origin, it may be a bit surprising that here we have a movie that runs for over two hours in fact. Stuber's last theatrical release was maybe the career-defining work for actor Peter Kurth and so nobody can really be surprised that he is on board here as well again, even if only in a supporting role. The one surprising thing is perhaps that he did not receive any awards recognition this time. The heart and soul of the film is Franz Rogowski though who won a German Film Award for his portrayal of Christian, an ex-convict and lonely man who starts working at a building center where he quickly manages to make an impact on all his colleagues including the experienced worker who trains him (Kurth) and a female worker from the sweets department who is stuck in an unhappy marriage apparently and ends up as a potential love interest for Christian. I think the one thing this film manages really well is how it succeeds in combining the cold, almost sterile environment of these building center alleys, with a certain sense of longing and romance even, but eventually tragedy too. As for Rogowski, he is perhaps Germany's most wanted actor right now if we ignore those starring in stupid self-inportant sex comedies like Schweighöfer, M'Barek and Schweiger to a lesser extent. And his work here is really where he won me over for the first time. The voiceover parts did not do too much for me, but the performance and how he did so much with so little dialogue from start to finish (he is in pretty much every scene) was truly impressive. Hüller is fine too as usual and she is of course known to many for her role in the Oscar-nominated Toni Erdmann. But back to this one here. The writing is spot-on most of the time, only struggles in those really dramatic moments a bit, like most of all the scene when he quietly enters her apartment. Another example would be the suicide near the end and maybe it could have been a better film without that. Then again, the elaborations afterward in the scene when we see them all mourn or also the references about how Kurth's chacracter lied about his wife mean additional depth and room to discuss his character and how tragic he was overall. I did not expect it though, even if in retrospective the meeting at his place and how much he wants it to happen and all the details going along with it like how much he says he misses the road are on a level where it really should not surprise anybody anymore. But it did surprise me. The final shot with the hugging moment on the forklift was nice too and a good reference back to the comment on how 2 people should not be on it, I especially enjoyed that training session part earlier on. Still I don't think it was the perfect way out, I would have preferred a picture of Rogowski's face from up close while Hüller's character hugs him. There is a bit of a happy ending for sure as we see that the two are a couple obviously eventually and that is a bit typical following the tragedy before that. I also liked Kurth's character's comment about how Hüller's character needs one to treat her kindly earlier which she herself always seemed to hide a bit with her easy-going comments and jokes about the \"Frischling\". So yes, this definitely was a film I recommend checking out. Greatness maybe not, but Rogowski's extremely likable turn here was the only thing thatg deserves more than 3 stars out of 5. Overall, however, there's also nothing in here at all that felt like it rang false or anything. Quality film, reliable from start to finish and at this running time, it is always a success when a film drags almost never. This description certainly applies to this one here. Go see it if it plays near you, also abroad. It's an exhibit how German cinema still delivers quality. You just need to look closely and not fall for those films you may see first starring some of those actors I mentioned, like Fack ju Göhte. Now as for this one here, I give it a positive recommendation without hesitating. Thumbs up. Watch this truly authentic movie.","user":"Horst_In_Translation","rank":[15,23]}]