[{"title":"A Huge Disappointment for Madea Fans.","rating":2,"date":"31 January 2018","review":"First let me say that I love the Madea of old. The last few films have really started to become obscene and have lost any sense of morality they once had. Not only is this film not funny it's torturous to sit through. Tyler Perry has traded quality and morals for a quick buck and cheap obscene attempts at laughter. Don't waste your time on this crap. Re-watch one of the earlier films when Madea was still funny and endering.","user":"kevinpleasant","rank":[16,21]},{"title":"Tyler Perry needs to just stop...","rating":1,"date":"3 January 2018","review":"Totally love when I followup one of the best movies of the year with easily ONE OF THE WORST of 2017. This somehow managed to learn nothing from the god awful mistakes of its predecessor and made an almost exact identical movie, but even worse...how do you do that??!! How can Tyler Perry figure out a way to make the exact same movie twice, yet worse the second go around???<br><br>I hated the first movie and I seriously loathe this one. Everything about this movie sucks. The writing is lazy since they just rehash the first movie all over again. The story is basically the same from the first movie. Tyler Perry's daughter is a terror that does whatever she wants and has no respect for her father. She sneaks away to go to a frat party for Halloween. Madea and her gang of morons get together to try and get her back home. \"Spooky\" things start to happen about halfway through the movie to where the characters believe that there are ghosts and people dying. Turns out it's all just a prank to teach the daughter a lesson to not be an ungrateful brat. Roll credits.<br><br>The characters are all annoying and unlikable. Madea, along with her two lady friends, are just loud and obnoxious from beginning to end. They have two modes; either they are talking about literally nothing with their terrible adlibbing skills or they're screaming at the top of their lungs like idiots and that's it. The other Tyler Perry character, Joe, has three jokes throughout the whole movie that he repeats over and over again; Madea is a dude, he likes drugs, he's a pimp. And that is all the depth we get with his character. There is nothing else he has to say other than \"Madea's got a dick\", \"Come on now, I need to get me some drugs\", \"I run bitches and hoes like nobody else 'cause I'm a pimp. I pimp all you hoes, bitch.\" ...THAT'S IT! Tyler Perry playing...Tyler Perry...is probably the least annoying character in the whole flick, but he's still not funny. The daughter is a total nightmare, like she was exactly in the first one as if the events of the first movie never happened and she didn't learn a single lesson about how much an entitled little monster she is. The movie adds in a few new characters to the mix; Tyler Perry's ex-wife who is obviously the reason why their daughter is such a colossal monster of a human being. The daughter's new step-father...who has almost no lines and adds nothing to what's happening. And lastly, Tyler Perry's new friend, played by Tito Ortiz...who is easily the worst actor in the whole film. He has very few lines yet somehow that was too difficult for this guy to perform with. He was legitimately a terrible actor. I may have hated the other characters more than him, but at least I could say they were acting. Tito Ortiz is not an actor and I have no clue as to why he was included in here, other than to make everyone else look \"good\" by comparison.<br><br>I didn't laugh once in this...SOMEHOW 90 MINUTE TORTURE DEVICE THEY CALL A MOVIE!!! The comedy in this movie is the same tired material that they used in the last movie and repeated for 90 minutes. An hour and a half of everyone trying so hard to improv and not landing a single funny joke in the process. Aside from the comedy being absent, the production value of this movie somehow is also bad and even worse than before. The makeup they put on Tyler Perry and Patrice Lovely to make them look like their older people is so awful this time around that I'm pretty sure they just went to a Spirit Halloween to get this done. It always looked bad to me before, but this time it's as if they're cosplayers of the characters they're supposed to be. Yet somehow this movie cost 25 million dollars to make. Not a joke or an exaggeration, this movie supposedly cost 25 million dollars to produce...I call bull. Tyler Perry pocketed every cent of that. I'm calling it right now. There is no way that this \"made for television in someone's backyard\" piece of crap cost more than what I have in my wallet right now. No freaking way.<br><br>Oddly enough, with as cheap as this movie looks and feels, there are just such glaringly cheap moments that don't even make sense to me. Like the fact that they build these small sets and break the fourth wall by literally running through it. For instance, there's a scene where two characters are sitting in a tent where it is obvious that the production crew cut out a giant hole in order to film the two as they sit completely still at their marks. And then when someone comes up to the entrance of the tent attacking them and the characters literally run through the hole specifically made to be filmed through and not actually supposed to be there. There are also times where, instead of having an editor chop down this needlessly long and repetitive dialog containing curse words, they blatantly censor and dub over random cursing. For some reason, half the run time they're allowed to say sh*t, piss, hell, and damn but other times they aren't. And when they're not allowed to say those words they'll literally just blank out that dialog or clearly dub over it with another word like 'darn'. I don't know why, it is bizarre and jarring every time it happens. Especially since there's a scene where a character says the 'N' word and 'f*ck' in the same sentence, but in the next sentence they dub the word 'damn' with 'darn' three or four times in a row. It makes no sense.<br><br>I hate this movie so much. I really do. I couldn't stand every second of this thing. Listening to all these extremely annoying characters constantly talk about random nonsense that adds nothing to the plot and isn't funny. And repeat those unfunny things again and again. Hearing them scream and yell in between those unfunny bits of dialog. Seeing zero effort being put into this thing at least on a production level. It was a truly miserable time I had watching this. It nearly broke me, I couldn't take another second and I hope to God that there isn't a third movie. Please...I can't do it...don't do this to me again. I'll do anything. I'll become a priest, just make it stop. No more.","user":"johnplocar","rank":[14,21]},{"title":"Boo 2 or Boo Who? Familiar Tactics Will Please Fans With Laughs, But Plot Fails Like Being Sick On Halloween","rating":6,"date":"19 October 2017","review":"Hellur! Tyler Perry's signature character has made her mark for so many years, teaching lessons in her own unique manner. These movies have come in all sorts of scenarios, many being close carbon copies of the predecessors that laid the foundation. This series continues to rope loyal fans into the theater though, never tiring of the gimmicks cooked up at Perry Studios. Tonight, the sequel to Madea's Halloween tale emerges, in hopes of mimicking the success it brought not long ago. What's the verdict? Robbie K, here asking you to read on to find out his opinions. <br><br>LIKES: <br><br>Familiarity: When it comes to Madea, you don't expect much deviation from the formula, a comforting factor indeed. Perry's writing doesn't try to be anything it's not, and that nets some respect in bringing the laughs that make so many laugh. And if you're a fan of this series, you'll have nothing to fear in regards to the comedy at hand (as evidenced by many people howling with laughter in my showing.)<br><br>Plenty of Madea: Some Madea movies don't do give the mad lady her adequate screen time, choosing instead to go for a more drama (soap opera like) plot. Boo 2 is more than happy to give you a Madea fix, with much of the 100-minute run time staying on our \"protagonist.\" She leads much of the banter, and her insults are more than enough to keep things engaging alongside her older colleagues. So, for a movie promising Madea, this film delivers on this aspect as well. <br><br>Fast Pace: Another positive for Boo 2 is that the movie doesn't dawdle when it comes to getting to the laughs. A small, simplistic opening makes way to the comedy at hand, taking less than 20 minutes to get to the first bout of Madea running her mouth. Once that first joke flies, the movie continues at a steady pace and creating the effect of time flying (seriously had no idea an hour had passed). This leads to an entertaining environment that is simply fun on many levels, that's right no complicated thinking in this film. <br><br>Joe: By far the best part of the movie for me is Madea's brother Joe. While his sexually harsh jokes, lack of respect for others, and intense focus on drugs are not my main source of humor, this character has some of the best comedic moments of the movie. His timing is well- executed, and his lines are just harsh enough to offset the bickering this movie holds within. The piece de resistance though, is how well Perry delivers that gruff edge in his humor to maximize the punch of the line and keep the laughs fresh. I found myself laughing the most with his scenes and was glad to see more Joe in this film. <br><br>DISLIKES:<br><br>Unoriginal: Familiarity is fun and entertaining, but it is also lacking the original twist I like to see in the films. Every Madea film has a slight twist to it, but this film is too much a copy of the first Halloween movie that the tactics are fairly stale. Had it not been for the comedic timing at some parts of the movie, the bantering would have gotten much staler as the old folks complained about the same things consistently. This dislike also goes to the fact that Madea's jokes are losing favor with me, especially when they drop the morals for incoherent babbling and arguing. <br><br>The College Kids: If you read my last Madea review, you know the college kids didn't impress me. Sadly, this movie managed to make me loathe these characters even more. Rather than giving the younger characters some admirable qualities, outside of superficial looks, Perry crafted them to be the same, shallow, annoying selves they were in the past, only much worse. The fraternity brother are even hornier, stupid meatheads with little contribution to the movie. Leah (Lexy Panterra) is reduced to a squabbling airhead, who does little, but flash off her own body with overacted gestures and a skin-tight leopard shirt. Yet, the worst character goes to Tiffany (Diamond White) the arrogant brat who supposedly learned her lesson last time. After all the punishing blows, the hotheaded teen hasn't learned a thing and has fallen back into the same annoying qualities I despised in the first film. What's even more pathetic, is that they don't use her selfishness very well to drive a moral filled plot, but just as a tool for more jokes. Sadly, this movie doesn't give the satisfying punch that its predecessor accomplished. <br><br>No story: Boo 2's other major dislike for me is that lack of a story. It's true, the movie runs at a quick pace and is entertaining, but the trailers have tricked you into thinking there is a story. This particular Madea story is the lamest story of the bunch, with only a hair thin plot to ground the comedy too. Past this skeletal frame, the movie is only about cramming the most jokes into the run time, which also took away from the Madea formula. <br><br>The VERDICT:<br><br>Boo 2 is a sequel that accomplishes the goal of making you laugh with the same familiar tactics Perry has capitalized on for the last decade. It's simple fun, fast paced humor will keep fans howling in delight, while also welcoming a new age in with its simplicity. Yet, I found this movie to be the weakest of the installments, particularly due to the unbalanced characters and lack of story to guide the mischief better. Safe to say this movie is meant for home viewing pleasure where you can enjoy the banter and insults with better snacks and bathroom privileges. <br><br>My scores: <br><br>Comedy/Horror: 7.0 Movie Overall: 5.0","user":"rgkarim","rank":[50,92]}]