[{"title":"Hard to resist the FFWD button","rating":1,"date":"11 September 2017","review":"AKA Followed. Mate of mine lent me this on DVD, promising a \"great\" movie. Well, we obviously have different ideas as to the definition of that word. An annoyingly perfect Ken &amp; Barbie social media couple, who film their every move - hence this is a found footage movie (yawn)- go camping in the woods. Not surprisingly this predictably turns out to be a bad idea. It does then turn into a found footage within a found footage movie, some credit for that. Sadly this film is incredibly slow &amp; boring, despite a fairly short running time. The characters have no depth, they all just got on my nerves, and the end descends into something ridiculously bad. And if it's gore that you are after forget it.","user":"Stevieboy666","rank":[14,18]},{"title":"You can't tell them, \"Everything will be alright.\"","rating":2,"date":"4 May 2018","review":"Found footage video.<br><br>Brooke (Amanda Delaney) is a pretentious on-line V-logger babe who you immediately want to see naked and dead (No swearing sex or nudity). She goes camping with her boyfriend Caleb (Justin Maina- equally dislikable) on their one year anniversary. He plans to propose, while she is planning to break up. Then about 30 minutes we start with the subplot, i.e. their on-line followers and then at 17 minutes from the end I get a real unexpected twist I didn't expect in Florida's Hillsbough River State Park. I think Seminoles would have been better from a historical setting. <br><br>They did the inside the tent \"what is that\" early in the film, something normally saved for the last scene. It was boring.","user":"nogodnomasters","rank":[3,4]},{"title":"Would have been better as a short film","rating":2,"date":"7 September 2018","review":"I did hit FF a few times. Typical \"girlfriend never been camping\" and bad stuff is gonna happen story. Same scenario, interchangeable antagonists, insert actors here. Can't say I liked it and can't say I didn't. Useful as background distraction when doing something else.","user":"vmalast","rank":[2,4]}]