[{"title":"Story?","rating":6,"date":"7 April 2019","review":"This was a decent watch. Decent acting but I wish they would of expounded on the cult. What was all that? The movie was all over the place. I think it would have been better had they made all about the \" cult\" or whatever it was. Like what was it? Why did they act so weird to him when he came the birthday party. We never even get to know if the girl genuinely liked him and all we see is them all dying in the pool. Now why comes in because we really know nothing about them and could care less. My favorite part was when he left the money for Joe? I think that was his name. made the movie. I think it could have been very good had they went in one direction. Was it about a single mother , the campfires, The cult?","user":"Headturner1","rank":[4,5]},{"title":"California Weirdos","rating":26,"date":"26 September 2019","review":"In the opening scene of \"Locating Silver Lake,\" the protagonist Daniel Willingham is rejected by his girlfriend Samantha Dolnes during the college graduation ceremony. By the end of the film, it becomes apparent to the audience that Sam made a smart move by dumping Dan.<br><br>While the film has some good footage of the great sites of L.A., there was a major problem with the lack of credibility of the characters. Daniel wins a lucky bet at the roulette table, but it was not clear how that stash of cash would make him independently wealthy. It was also unclear how no one in the film apparently had to work for a living.<br><br>The strangest group of characters were the individuals who fell under the spell of a cult-like guru named Seth, who had resonances of Charles Manson. There is the nearly silent character named Lilith. There is Daniel's old high school classmate Ella and her girlfriend Bonnie. Daniel falls in love with Ella's sister Talya, who goes by the user name of Mamihlapinatapai. Talya too has been brainwashed by Seth.<br><br>Daniel also has a one-night stand with his neighbor Luisa, a woman separated from her husband and raising two young children. After their tryst, Luisa has the realization that she no longer needs men in her lives, breaks off the relationship with Daniel, and moves out the area.<br><br>The most interesting group of characters was a number of men who have suffered traumatic losses and have weekly bonfires and drinking sessions. Daniel bonds with the men, opening up especially to his landlord Jose about his own troubled past. Daniel's father was emotionally wounded when his wife took a lover. The father left home, leaving the mother depressed. After she died in an auto wreck that was due to her driving, Daniel was left an orphan and a negative perception of love.<br><br>The film tries to turn Daniel into a 21st-century Jack Kerouac with his bible Kerouac's book \"Maggie Cassidy.\" It was never clear exactly what was the purpose of the cult of \"found ones\" led by Seth, whose ramblings about \"chaos\" were as boring as they were self-indulgent. Were they a symbol of the hedonism associated with L.A.?<br><br>Daniel appears to have a kind of epiphany in his rejection of Seth and the cult, finding meaning in writing about the true story of Herman Silver, for whom the L.A. reservoir is named. But it is not clear if he has any new direction in life other than getting as far away as humanly possible from Silver Lake.","user":"lavatch","rank":[2,2]},{"title":"Pathetic","rating":1,"date":"3 April 2019","review":"Boring as hell with awful and whining characters.These movies are for the easily offended millenial idiots.If you can't sleep this garbage can do the trick","user":"mauriziopirasmetal","rank":[23,49]}]