[{"title":"Worth a watch over a TV dinner but you're not going to be wow'ed by either.","rating":5,"date":"7 March 2019","review":"Imagine sitting down to enjoy what, at first glance, appears to be a tasty meal only to discover that a lot of it is... underdone.<br><br>STRAY is like that. Underdone.<br><br>STRAY starts intriguingly with what appears to be a dead person, still standing and still smoking, burnt to a crisp in the middle of an old warehouse. The police are called in to investigate this perplexing discovery, and in the course of time we find out that the dead body was not burned, but rather was petrified, and apparently 1000 years old according to carbon dating. What on earth could this mystery be?<br><br>Because of identification found nearby, the lead police investigator on the case, Murphy (Christine Woods), easily tracks down the home and remaining family of the petrified victim. Here she discovers the grandmother and daughter of the victim who, unexpectedly, decline to go and identify the body. Further, they don't even seem to want to talk to the police about their murdered, or at least strangely killed, family member.<br><br>But the granddaughter, Nori, sneaks out at the first opportunity and goes to Detective Murphy and asks to see her mother's body. As soon as she does, a blatantly supernatural incident occurs and, utterly incongruously, Detective Murphy doesn't react with anything more than mild surprise. From my perspective, this is where the sense of being bland and underdone begins to build.<br><br>The movie goes forward in this way, somnambulating along through scene after scene with remarkable things happening but very little explanation or reaction from the characters forthcoming. The context or history of these magical capabilities is never really explained. All we ever really find out is that Nori is the \"good\" version of these special powers and her brother, Jin, is the \"evil\" version. Given that we have a good and evil version of super or magic powers at hand, it's just about guaranteed that they will either merge into a holistic whole (a la DARK CRYSTAL) or there will be a battle between good and evil to the death (a la about a million movies). I will leave these entirely predictable possibilities for the reader to explore.<br><br>The notions of good and evil are carried through to the special-effects. The good power of Nori is depicted as the air being filled with a close approximation of the ripples cast upon the floor of a swimming pool shortly after everyone has gotten out, followed by plants suddenly growing at an accelerated rate and culminating in blossoms springing even from the petrified form of Nori's dead mother. Conversely, Jin's evil powers are depicted as the air being filled with smoke and ash precipitating out of the air. Not the best special-effects ever, I suppose, but adequate to purpose and for representing the point the director wished to make.<br><br>Thematically, I had a problem with STRAY because the notions of good and evil as depicted are very alloyed. It could be easily argued that Jin was, initially, a complete innocent. While he was born with \"evil\" powers, a completely arbitrary cultural designation, they simply were what they were and he certainly didn't ask for them. When Jin is still just a child, there is an incident in which he reflexively uses his powers to protect his mother, which is completely reasonable and understandable, and his family (mother and grandmother) responds by abandoning him. If Jin is evil, then he was made that way by his mother and grandmother who, like Nori, our supposed to be \"good\". Initially, Jin only attacks his mother and grandmother is a downstream consequence of his abandonment and whatever horrors may have been visited upon him as a young abandoned child.<br><br>I really don't see how one could defend the mother and grandmother is being \"good\" given what they did to Jin.<br><br>Additionally, Nori kills just as effectively as Jin with her powers as she demonstrates very effectively by killing Jin.<br><br>In short, I'm not really sure what the message or point to STRAY was supposed to be. It can't be a representation of the battle between good and evil because they don't exist unambiguously in this movie.<br><br>I was also confused by the selection of the title \"Stray\". It doesn't seem to be descriptive or indicative of anything about the movie or any of the characters. Nori isn't a stray; she's an orphan. Jin isn't a stray; he was betrayed and abandoned. Who was the stray? Why was that title chosen?<br><br>Not only was the plot line more like a rough draft than a fully completed story, but the story as written seemed to be full of plot holes. For example, the grandmother surely had to recognize the manner in which her daughter was killed, petrified as she was in the warehouse, as clearly related to something that might have been done by her \"evil\" grandson or certainly the same kind of person with the relevant special powers. But either grandson or someone else, it clearly was not an accident and was related to the supernatural powers that were at the core of this family. Whoever killed the mother had to be aware of the rest of the members of the family and quite possibly where they lived; why would the grandmother foolishly leave herself and her granddaughter sitting ducks in the family apartment? No surprise that whoever was doing the killing quickly showed up and killed the grandmother when she was alone in the apartment. The whole thing didn't make any sense. Plot beats just need to happen and they happen whether they make sense or not.<br><br>So I return to my initial statement. STRAY was just underdone. Photography was fine, the special-effects were adequate to purpose in our current world of an endless succession of superhero comics brought to the big screen, the acting was acceptable, but the whole thing ended up being flavorless.","user":"S_Soma","rank":[9,12]},{"title":"Weird little story that never turned into anything","rating":6,"date":"20 July 2019","review":"This might have been better as an 8 part series so the characters, like the main ones, could have been developed better as to learn what their powers were all about. We got about a two minute explanation, sort of, about 3/4 of the way through from the brother that didn't explain much. All we knew was they had some sort of smokey power that could kill or heal and not much more than that. The acting overall though was fine just not enough time to get into anything real. Special effects and production value were fine as well. It was a slow rolling film that skimmed over the top of everything that might have added interest in the characters which also made the second half sort of boring. The first half at least was trying to figure out what was going on, so it could have actually been better with a better more developed script. It's watchable but only if nothing better to do.","user":"safsurfer","rank":[3,4]},{"title":"a mysterious thing","rating":4,"date":"2 March 2019","review":"Earth to earth, ashes to ashes, dust to dust; in sure and certain hope of the Resurrection unto eternal life......or something like that the priest mass at the edge of the grave, and i will draw correlations from there to this mystery horror drama.<br><br>its a small american family of japanese herritage, that has been gifted or blessed with surtain supernatural abilities, that may be protective to some and lethal to others. when mum abruptly dies under mysterious circumstances the police are connected to the family. its from then on for the police to phatom what a mystical case they've let themselves into.<br><br>its a drama at many levels,so if youre into the''herreditary'' or ''the silent place'' kinda films this will suit you well.<br><br>as a product it has some nice but nevertheless on bargain special effects, most of the actors are what i call b-standard, but the story and acting ,settings and locations , makes this film drifts to scratch the surface of air, and borderlining the A-standard. the score though ruins more than building suspence , so the selection is bad. the sound effects though are flawless.<br><br>remember , im an old grumpy man, that didnt like '' it comes at night'' nor ''suspiria'', so im not the film guru sleeping on a nail bed, so a bit squemish i am,so take care when i say its recommended.","user":"ops-52535","rank":[9,20]}]