[{"title":"Nice Movie...","rating":2,"date":"2 December 2016","review":"It may not be the greatest Christmas movie ever made but it is sweet. The Chicago Christmas scenes are pretty nice. Another review stated that Kristin Davis was too old for the part. Really??? Kristin is 51 and Eric McCormack is 53. Does that mean that people in their 50's or older can't fall in love? We are never too old to look at our lives and make changes! Yes, it is somewhat predictable but this one had a somewhat surprise ending. Hallmark movies are meant to be enjoyable and take you away from this crazy world for two hours. Christmas movies are fantasy! I for one was touched by A Heavenly Christmas and loved it. Who knew that Eric McCormack could sing? Not bad either! Enjoy the movie!!!","user":"shopperv","rank":[11,13]},{"title":"The angelic winners from Hallmark go on and on and on.....","rating":8,"date":"4 January 2017","review":"Eve (Kristin Davis) is a workaholic investment counselor. Very successful, she has sacrificed nearly everything to be a partner at a young age. Once close to her brother and his family, she sends her PA out to buy them gifts and squeezes in a few minutes with them here and there. Even after sharing a cab ride with an amazingly handsome man, Max (Eric McCormack), she isn't fazed, even though he seems to have eyes for her. Beyond that, her pushy schedule makes him lose a musical audition, as he arrives too late. Ah, but Eve is about to get a reckoning. One day near Christmas, she slips and falls on the ice. When she awakes, she finds she is in Heaven and being lectured by a talkative angel, Pearl (Shirley MacClaine). It seems that, yes, Eve has landed beyond the pearly gates but, her time on earth is not finished. Pearl instructs her that THEY are going back to bring happiness to a sad gentleman and his young niece. Wouldn't you know the man who lost his sister and singing partner happens to be Max? Can Eve truly change and focus on human relationships instead of work? What if she falls for Max and then has to go back to her Heavenly mansion? Wait, this is Hallmark, so there must be some secrets! What a lovely Xmas romance, another in the long, long line of beautiful, funny, touching Hallmark films. McCormack is one of those handsome, talented guys who is tailor made to play the romantic lead while Davis, very lovely, has a sweetness that belies her pushy role. MacClaine, too, is a treasure at all times while the young lady playing Max's niece does a fine job, too. Naturally, the film has been carefully made with great costumes, sets, a clever script and a touching direction. Maybe you missed this one during the rush up to Christmas? Look for it in the coming year as it is welcome any day, any hour, any month.","user":"inkblot11","rank":[6,9]},{"title":"Beautiful Story","rating":10,"date":"1 December 2016","review":"What a beautiful story. Kristin Davis, Eric McCormack, Shirley MacLaine as well as the little niece were all wonderful. Thank you for bringing joy, Hope and happiness to others. Not only was the story line inspiring, the music, city views, holiday decor was awesome. I have loved Shirley MacLaine since I was a child. I am a huge fan of Will and Grace and Sex and City. I own the DVD's of all seasons for both so I am very fond of Kristin Davis and Eric McCormack. To see Eric sing was a treat, very talented! Kristin is just as adorable as ever. Beautiful Story Thank you all for bringing joy, hope and happiness to others. Thank you Hallmark for all of your masterpieces. I've enjoyed them through the years.","user":"moviemaker4","rank":[6,9]}]