[{"title":"The story makes No sense","rating":1,"date":"2 June 2018","review":"The storyline makes no sense. There are Way to many different storylines, and the characters relationsships are not at all explored properly, so the chemistry is non-existing. It is by far the worst film I have ever seen. The progress of the film made me angry.","user":"christinabossen","rank":[15,17]},{"title":"idk if youll read this but im mad LOL","rating":1,"date":"3 February 2018","review":"Long review. <br><br>Characters- 2/10 RUSHED &amp; little character development\nPlot- 1/ 10 <br><br>Let me get this straight, I didn't think this would be a good movie in the first place. I actually LIKE cheesy cliché movies, even when they're kind of bad. But this movie... this cheesy cliché movie tried to be all meaningful and it just doesn't work here. The jokes also fell flat. I only laughed ONCE.<br><br>Summed up, Cora (Debby Ryan) falls down the stairs &amp; has her photo taken by the paparazzi. She's so embarrassed that she moves in with her aunt in Australia. This is where she meets Chika and the love interest... I don't even remember his name and I just watched it lol. <br><br>Every moment Cora has with her family or new friends is in a montage so you don't really feel the connections or chemistry that well. There were like, SEVEN, LONG MONTAGES. <br><br>It got to the point when the characters hung out I'd be like \"I swear to god if this turns into a montage... oh, another mONTAGE. WHO KNEW\"<br><br>The whole movie dragged &amp; a lot of the character bonding happened in montages so when conflict happened, I didn't really care. Plus, all the conflict was solved almost instantly. <br><br>And, Cora was a B**ch. She was a hypocrite and she was mean to EVERYONE who helped her. She was mean to her aunt for no real reason! Her aunt was all \"do what makes u happy\" and Cora's all \"u don't even swim bc ur husband died\" like wtf LMAO <br><br>(I think that was just because lazy writing. They needed more conflict so they had to make Cora start some.)<br><br>Also, she was instantly forgiven every time she apologized. She wasn't held accountable for what she did. <br><br>Cora is supposed to be a strong individual trying to find herself but she's not. I honestly would hate to be friends with her LOL. She's everything I try NOT to be. <br><br>The plot was soooo messy. Besides the slow pacing and meaningless montages, there were TWO climaxes, one right after the other. It just felt rushed and weird. NOT TO MENTON, that the middle climax was waaaayyyyy to close to the last two climaxes.<br><br>I also didn't care for the aunt mourning over her dead husband subplot lol. <br><br>Near the end, the mom had a redemption arc and she needed one but it was SO rushed. There wasn't enough character development for the mom to suddenly be a caring mother! <br><br>I'd like to think that kids would enjoy this film, but I'd be lying. I don't think a child could sit through this. It was slow, boring, and predictable. <br><br>Rip Tide sucked.","user":"aric-76670","rank":[17,22]},{"title":"Beautiful moments weakened by underdeveloped story and rushed production","rating":6,"date":"12 April 2018","review":"For me, \"Riptide,\" is a Stephen Cannell TV show from the 80s. Yes, I knew going into \"Rip Tide\" there would be no Sikorsky, robot, or detective story. While that was slightly disappointing for me, I mention this so you know something about the author of this review. Why was I watching this movie? I like smaller films and independent filmmakers. <br><br>Things I liked: Australia. The New South Wales locations were stunningly beautiful. I can't mention the natural beauty of the land without also giving a nod to the composition and cinematography that captured it. This aspect of the movie was very satisfying. The location acted as a perfect contrast for NYC and the ideal place where Cora could reconnect with her extended family and her inner self longing to break free.<br><br>One of the best sequences in the film was when Cora is coaxed into the ocean by Chicka. The experience for Cora is depicted as baptism. She goes down into the water, and this begins her cleansing from the pain and filth of her trouble in NYC. This is the point at which Cora commits herself to the transformation she desired to accomplish in setting out for Australia. Australia is the land \"down under\" and Cora goes down under the water to become a new person. She is turning her world upside down, and this foreshadows what will transpire later in the story. When Cora receives the call to return to NYC, all the inner healing she accomplished is thrown into reverse and culminates in a \"reverse baptism,\" going backwards up through the water and out into her old life. To me, this was an example of the pinnacle of the film's artistry, giving us a view into what is happening inside Cora just with the images alone. Very well done, I think.<br><br>I really liked the characters played by Valerie Bader and Naomi Sequeira. Bee, Chicka, and Tom are especially important roles because they have little pretense. This is exactly opposite to the catty, backstabbing crowd Cora is more familiar with at home. Ultimately, this is a \"catalyst\" character story. Cora, Margot, Bee, and Tom all have inner pain to be worked through. Cora will be the catalyst for the Australian group's pain and the Australian group will be the catalyst for Cora's struggle. Once Cora appears in Australia, the fuse it lit, and the mutual emotional reactions begin with hopefully good results by the end. That's the general idea for the story.<br><br>Criticisms: Story and character development. I'm sure the pressure to get everything done on time and within budget was just crushing. In fact, the whole production feels pressured. Many of the key moments in the film should have been refined more and re-shot. Miss Ryan also needed more directorial guidance for her performance in key scenes. Miss Ryan is a remarkable and capable young actor working to extend beyond comedy into drama. That's not easy to do, and it doesn't help if the entire production is stressed and compressed. Screen Canberra claims the movie was shot in 18 days and took six months total from money drop to debuting at Sydney film festival. Impressive, but I think the schedule may also have caused problems in the product. <br><br>Furthermore, the story was underdeveloped and did not explore the emotional journeys of the characters in significant depth. As a result, the explosive moment between Cora and Margot was more cringe-inducing than emotionally fulfilling. The whole movie is a character story, but the emotional aspects of the characters' problems and pain are only allowed to create major conflict in a few places. So, the rest of the time the action is listless, unfocused, and dysfunctional. This was really disappointing to me. The story should have developed the baptismal idea further and given us Cora's wilderness journey since a time of suffering/wandering must always follow baptism. The call to return to NYC could then be cast as a temptation to be avoided rather than the reversal it was portrayed to be.","user":"samgill2929","rank":[3,3]}]