[{"title":"This really knocked me out","rating":8,"date":"3 December 2017","review":"I was really stunned by this, how it turns a tragedy into a redemptive triumph. I knew very little about the band prior to the events in Paris, but the way this brings you into their world and underlines how this horrible night dove-tailed into their story is deeply moving. It shouldn't matter whether or not you agree with Jessie Hughes' views on gun control. This is peripheral detail and beside the point. I would be highly disappointed with anyone who comes away from this movie without an appreciation for the humanity of the man; going through something so unbelievably atrocious such as this, but refusing to let it take away MUSIC - one of the few truly positive and uniting things we have in this ever more divided world.","user":"jon_crooke","rank":[7,8]},{"title":"Good time band gets Serious","rating":8,"date":"21 January 2018","review":"I've been bingeing on music docos that I missed over the last year and watched this yesterday. I'd recommend it to anyone, whether you're a fan of TEODM or not. I'd always thought of TEODM as a good time outlet for Josh Homme, but in this genuinely moving doco, it reveals a sympathetic side to the band and the human cost of a very real tragedy.","user":"ruralmilo","rank":[6,9]},{"title":"New Fan Of Eagles of Death Metal","rating":10,"date":"17 March 2017","review":"I Watched The HBO Documentary and was Hooked on \"Eagles of Death Metal\" and I ended up recording it on my DVR. I Have Watched It a Dozen Times Already For Their Story, The Bond Between Jesse and Joshua But Most Of All The Music......I Am Hooked, I Love Their Music Plain and Simple, Love Love Love It ! I Love Jesse's Connection With His Fans, and Joshua's Connection with The Fans Also. Plus Jesse is so Compassionate and I Adore That About Him, If Anyone Deserves To Be In That Business It Is Jesse Hughes ......His Talent Is Off The Chart. Thank You For Opening My Eye's and Ear's To This Great Music.","user":"leeafoneandtwo","rank":[4,11]}]