[{"title":"One Immature Comedian and Her Dead Cat","rating":7,"date":"19 January 2018","review":"\"Mr. Roosevelt\" is about a young woman, a struggling actress and comedian, who spends most of the film acting like a petulant teenager. I mostly get impatient with movies about adults who can't grow up, and whether or not I can tolerate them is wholly dependent on how much the person at the film's center can make me like him or her. Noel Wells, who also wrote and directed this movie, isn't hilarious, and in another mood I might have found myself irritated by her, but she was funny enough to keep me watching, and when I think back on this film I do so with fondness. It's no big deal, and it doesn't really show us anything we haven't seen before, but it has that low-key indie vibe that's easy to relax into. And I did really appreciate the protagonist's attitude about her Facebook-obsessed generation, born of equal parts envy and legitimate frustration, because they're attitudes I've felt myself.<br><br>If you go in with reasonable expectations there's a good chance you'll like this one.<br><br>Grade: A-","user":"evanston_dad","rank":[7,9]},{"title":"Very funny","rating":9,"date":"9 January 2018","review":"I went into this because it seemed like a cute little film, and it was. It's not flawed or that amazing, but it's super enjoyable and funny, and it has a super hilarious actress in the lead role. I loved Noël Wells in Master of None's first season and I had no idea she was such a talented comedic actress. She's aces here and is definitely the best reason to watch the film. She's a huge talent to watch out for, not just in acting but in writing and directing.","user":"Red_Identity","rank":[8,12]},{"title":"Mr. Roosevelt, we hardly knew ye! Likeable DIY comedy explores the dilemma of art vs. commerce, the perils of \"unmonetized\" Youtube celebrity and other current issues","rating":8,"date":"26 February 2018","review":"I liked the way this film pushes back against the prevailing indie wisdom that anyone with a smidge of artistic talent just needs to follow their dreams until they catch them... The script may seem flimsy at times (maybe one too many chance meetings, even for a small college town?), but the setup's quite ingenious: UT Austin grad Emily's leading the dreary life of an aspiring sketch comic in LA when the cat she left behind with her ex gets sick. <br><br>Back in Austin, things have changed: her ex, a struggling rock guitarist, is hoping to get his real-estate license; his new S.O.'s a stylish, code-writing \"entrepreneur,\" and the remnants of Emily's old life have been consigned to a backyard shed. At dinner with the couple and their bougie friends, Emily has a serious meltdown. Suffice it to say that it takes her a while to resolve all her issues... Richard Linklater fans will enjoy the scenes set in historic weird Austin; Daniella Pineda stands out as a kickass rock drummer/waitress.","user":"The_late_Buddy_Ryan","rank":[4,5]}]