[{"title":"Honest, sad and heart warming at the same time.","rating":10,"date":"20 January 2018","review":"Being a huge Ted Gärdestad fan for two some years, I was really excited when I heard that this movie was being made, and I was not dissapointed. I have seen some of the directors/writers (Hannes Holm) previous films: \"Behind Blue Skies\", \"A Man Named Ove\" and \"Klassfesten\". All had a good sense of humor and could keep the dramatic moments at a good level. So I thought he would be a very good choice for this picture. As for the actors; there are a good amount of well known established swedish actors in the movie, and they all held up their part. They play more the supporting roles but they did good. But the main focus and the best part of the movie are the two leading actors, whom of wich I've never heard of before but they very much impressed me. Ted (Adam Pålsson) and Kenneth (Peter Viitanen) give some of the best performances in Swedish film history I have ever seen. Adam Pålsson shows Ted as a wide eyed, curious, funny, musicly gifted and lovable person, but still expertly shows his darker and more tragic sides later in his life and It is heart breaking to watch. Excellent! Peter Viitanen portrays his brother Kenneth as a caring, understanding, brilliant songwriter, and a loving big brother. Not an easy role, but he brought it to the table. The music is very good, even though Pålssons singing voice isn't that great, there is still so much heart and passion put into it that it doesn't distract you. The cinematography is also very good, It puts you right in that time period of early 70's up to late 90's Sweden. So one of the best Swedish films i have seen in a long time. Could not recommend it more. Go see it!","user":"tommen90","rank":[23,29]},{"title":"Embarrassingly bad.....","rating":2,"date":"16 January 2020","review":"Sadly I felt the need to tell my oppinion on this b-movie.<br><br>I grew up with Teds music and followed his career, and looked forward to this film and can´t understand how they managed to come up with this gibberish...<br><br>I will not mention the bad acting and script, it would take too much space..<br><br>In the first nine minutes we get to know almost every single important event in Teds life, from playing Bjorn Borg in a tennis cup, to Ted meeting two important females in his life, to show his emotional instability, his emotional sensitivity, to his stiff upper lip dad, his understanding brother and so on and so on...<br><br>The film staple important happenings in Teds life one after another until it looks and feels like a hastily composed commersial. This is sad, because Teds life could have been so much better portrayed and acted!<br><br>Huge disappoinment!","user":"me2621","rank":[1,3]}]