[{"title":"More than about sexual orientation","rating":10,"date":"13 September 2018","review":"I am a 71 year old heterosexual woman and I loved it. It left me with a large lump in my throat so I went home to see what it was about. And big surprise it took me back to my high school years when I felt so frustrated, bored, trapped by the stupidity of what I was spending my days doing. Taking tests on regurgitated information that didn't interest me at all. I just cried the lump out that was a ball of similar feelings to the ones portrayed in the movie. This was outwardly worse and very poignant and it makes me understand why so many kids today are lost and angry. They are right to be angry. Who is caring for who they are- not who everyone wants them to be?<br><br>Thanks for your courageous movie. I think almost anyone could get something out of it.","user":"anandshakti","rank":[154,192]},{"title":"Affecting drama about 'gay conversion therapy'","rating":7,"date":"3 January 2019","review":"\"How is programming people to hate themselves not emotional abuse?\"<br><br>That question, posed by the title character, is at the heart of The Miseducation of Cameron Post, in which Chloe Grace Moretz portrays a teen put in a \"gay conversion therapy\" camp. If you think gay conversion therapy is a sensible idea and not abusive, then this award-winning film is not for you. For the rest of us, Miseducation is worth the 91-minute run time.<br><br>Moretz, one of the best screen actors in her age bracket, does a more than competent job as Cameron. And her scenes with worldly campmates played by Sasha Lane and Forrest Goodluck crackle with authenticity and humor.<br><br>The story and dialogue are, overall, just \"OK.\" There's nothing in the story that'll make you exclaim \"wow,\" and I don't think anything in the dialogue's any better than the prosaic quote above.<br><br>Still, there's affecting drama here as we watch young people whose very lives and beings are under siege for same-sex attraction.","user":"stimp-1","rank":[29,33]},{"title":"Socially relevant yet non-vindictive","rating":7,"date":"11 April 2019","review":"You have to take this film for what it is: a low-key exploration of the experience of teenagers in a fundamentalist Christian gay conversion camp. The biggest mistake a movie like this could make would be to overly vilify everything about the camp and it's staff rather then dealing with them as human beings who are the products of their own misguided religious belief systems. The second biggest mistake a film like this could make would be NOT to address the emotional abuse that such a practice delivers. To this end, the film lets the harm of conversion therapy be self-evident without overtly pointing to it in a reactionary, outraged fashion. This is no easy accomplishment. The film is subtle and features solid acting performances by promising young actors, led by the magnificent Chloe Grace Moretz. They managed to portray the realistic ambivalence experienced by LGBT youth who find themselves in such situations. Although it will win no great swards, will be no blockbuster, and will not become a cult classic, this film definitely belongs on your must-watch list if you care about this issue.","user":"hudson-todd","rank":[12,13]}]