[{"title":"THE BOOK THIEVES","rating":8,"date":"28 May 2018","review":"True story this, though the quartet of perpetrators of the most audacious literary crime have trouble keeping their story straight. That's part of the fun in recreating a 2004 Kentucky teenage heist: having the now grown ups involved, recount the events, separated by distance from each other, and time from the deed.<br><br>\"American Animals\" seems too goofy for fact, but as usual, fiction loses out in the strange category. Spencer, Warren, Eric and Chas, (yes Chas), are privileged white boys getting their feet wet at University, itching for the action adult life has promised, which of course, is lacking. <br><br>Solution: robbery! Seems the campus library has a twelve million dollar book, and the only obstacle is an elderly librarian. Seeing their fair share of heist movies, the greedy group hatch an elaborate plan to snatch a big bird book from the poorly guarded nest. Convoluted schematics are drawn up. Maquettes are constructed. Ridiculous disguises are made. This is the thrill of their lives, and makes for irresistible film.<br><br>Evan Peters as the excitable and sketchy Warren, owns his delicious role, especially when steering the reluctant dreamer Spencer (Barry Keoghan) to the point of no return. Even better are their real counterparts, as they contemplate on the events, and each other, fourteens years on. It's an ingenious bit of movie magic, that could not have been scripted better.","user":"js-66130","rank":[104,162]},{"title":"One of the most underrated movies this year so far ..","rating":8,"date":"14 August 2018","review":"Just a sensational story ,, The script writing is brilliant ,, but the most noticeable was the Directing !!! Bart Layton did both and he did one amazing job.. bringing up the characters themselves telling their side of the story was a nice touch.<br><br>Casting Evan Peters and Barry Keoghan was a good move ,, they are both rising stars and they take the job seriously , and here they were engaging and so convincing.<br><br>Now my issue is ... the movie went on the big screen at the beginning of this year , toured all around the world festivals, and premiered 1st of June on movie theaters ,, yet .. no sound what so ever ,, the marketing is so bad for this movie ,, or it is hated for some reason ,,, or maybe the critics think this is in a way glorifying crime \"which isn't\"... I knew about this by accidentally looking for some cast members of \"American Horror Stories\" and clicked on Evan Peters's IMDB page to see what's new ,and this came up !!!","user":"Aktham_Tashtush","rank":[68,109]},{"title":"A fresh new vision of a weary genre","rating":8,"date":"14 September 2018","review":"'American Animals' is, formally, a difficult film to describe. It retains the structure of the heist films that came before it, even referencing them from time to time, cementing it as a disciple of those pioneers. Where the film stands out, however, is in the way it tells its story, in a non-linear fashion that seamlessly blends between the reality and fiction of this true-crime narrative. Whereas documentaries often use dramatisations to help visually realise their subject matter, here, these dramatisations take centre stage, supported by the painfully real inflections of those who were actually involved in this 2004 heist. This conflux, use to provide commentary, as well as irregular but welcome flair within the recreated narrative, help to differentiate 'American Animals' from other films of its pedigree. Furthermore, these aforementioned recreations feature standout performances from the likes of Evan Peters and Barry Keoghan, further distancing Layton's film from the somewhat shabby predecessors that deploy similar techniques. On a technical level, the film is fairly regular, lacking inspiration with its cinematography which arguably helps ground the events which it portrays. The score nicely compliments the action on-screen, effectively building upon the tension set up by the visuals. The film can, however, drag in places, particularly during the first act, whereupon it hits familiar story beats that could have been addressed quicker, the time taken with the set-up juxtaposing the otherwise revolutionary approach the film takes to the heist formula. Otherwise, the third act is nothing short of thrilling, with the conclusion proving a melancholic reminder of the reality of these events, and the impact they can carry, with its audacity to allow the audience to decipher the difference between what is true and false. 'American Animals' is a heist film through and through, but differentiates itself from others through the methods by which its tells its story and provides connections between the characters and audience. Whilst the pacing can prove problematic at times, persistence ultimately proves rewarding. Should Layton continue to adopt this unique approach to other genres, he may become a standout in years to come.","user":"rorymarsh00","rank":[35,55]}]