[{"title":"No one noticed?! The women from outside is actually...","rating":10,"date":"8 June 2019","review":"The biggest plot twist which would explain the entire movie is given out right in the beginning and verified multiple times throughout, then again at the ending.<br><br><ul><li>The '13867 days since extinction event' in the opening sequence indicates 38 years have past. Yet the daughter shown was only a teenager. That's because the women from outside was the 1st daughter ever... let me exlpain:</li><li>During the middle of the film when the current daughter takes the exam + discovers that the robot mother had lied and killed 'failed' children before, it shows that her label is APX03, and APX02 have failed (incinerated), but 3 embryos were used from the lab... get it?</li><li>The women from outside was APX01, the first \"daughter\", she matches the 38 years old timeline. Remember the robot said to her in the end \"wonder why you survived this long out here as if someone had a purpose for you? Until now\" Because she is the ultimate test to see if APX03 is truly ready to take on the role as mother for a new generation of humans (she returned hence passed the test so the robot left her alone). The women's memory was clearly altered/erased, that's why she totally couldn't respond when the robot said \"Tell me... Do you remember your mother?\"</li></ul><br><br>Some more details...\n1. The women sunk into a state of confusion when she saw the tonight show playing, and said she used to watch it a long time ago - her vague memories from living in the facility. She would never have seen it if she was out there for the whole 38 years. (Due to the end of civilization)\n2. The women was meant to find the facility at that moment, everything was planned, including the bio suit, which obviously didn't need to exist otherwise.\n3. This is speculation, but the women's artistic abilities might've been her training as a child. Remember the current daughter started prcating dancing since a young age? The robot recognized the importance of art and tries to incorporate that into each daughter's education.<br><br>I created this account cuz I couldn't stand how many morons are saying negative things about the movie... including critics, sadly.","user":"daniel-33683","rank":[3,3]},{"title":"Even the title is misleading. Brilliant.","rating":10,"date":"10 June 2019","review":"I cannot say anything else that has not been said yet about the plot. Yes, the Woman (Hilary Swank) is APX01, yes the daughter (Clara Rugaard) is APX03 and APX02 was killed by the droid. Yes, I say droid because even though Daughter called the droid Mother, the title clearly states that the real mother is the one being prepared for motherhood by the droid, the Daughter. Hence the title « I am Mother », the last scene shows Daughter being the Mother of the new mankind, she has been raised to become the real Mother. That's why somewhere in the beginning, when the first child asked the droid about why her brothers and sisters could not be created at once, the droid answers that ´Mothers need time to learn', i.e. the child needs to be up to standard and pass the test before the others can be 'born'. This movie is a gem and definitely asks to be watched twice. Netflix did it right this time.","user":"skyshops","rank":[1,1]},{"title":"People mistake hint for an error (13867 days)","rating":9,"date":"8 June 2019","review":"A lot of folks here say that Daughter should be 38 years old, so the \"13867 days passed since extinction event\" was an error. It was not. The woman (played by Hilary Swank) was in fact the first child brought up by Mother. Daughter was APX03, the remains in the incinerator was APX02, the woman was APX01.","user":"lessermagic","rank":[587,648]}]