[{"title":"Laughing nervously","rating":9,"date":"24 December 2018","review":"In 2008, Italian director Paolo Sorrentino made a film about a, then, still living sinister political figure Giuliano Andreotti. The ferociousness of the portrait was acceptable to the public at large because it was presented as a stylish, slightly surreal comedy. Adam McKay sets VICE in a more realistic universe but the results are just as pungent, disturbing and funny. Christian Bale is spookily perfect. And Amy Adams is a modern day Lady Macbeth of major proportions. The most unsettling part of the whole experience, because Vice is an experience, is the knowledge that this are the people chosen by the people. The fact that countries have the governments they deserve gives me a chill in 2018. A remarkable film with remarkable performances. Bravo.","user":"danielledecolombie","rank":[505,683]},{"title":"Cheney had US hook, line, and sinker.","rating":31,"date":"31 December 2018","review":"This is one of the best films I've seen this year &amp; left the theatre with the same feelings toward the political system as I did after BlacKkKlansmen (2018) &amp; Sorry To Bother You (2018). A pseudo-documentary/dramedy biopic that tells the story of Cheney's political career while skewering the Republican Party &amp; Washington DC politics in general, from the Nixon administration to today. It brings to light how politicians will sell-out everything in the pursuit for power, just how much sway one person can hold in politics, how media was forever changed under the Bush administration, &amp; how all of this is still effecting us today. It's a film that has as many laughs as it does moments of bitter truth, many of them bleeding into each other. Again putting his body through a drastic change for a role, Christian Bale is absolutely incredible as Dick Cheney with his mannerism &amp; glare down perfectly. I'm just as impressed with Amy Adams, Steve Carell, &amp; Sam Rockwell. The editing is fantastic &amp; the narrator was an interesting touch, especially once it's revealed who he is in relation to Cheney. And the mid-credits scene perfectly expresses what the reactions to this film will be.","user":"derk144","rank":[275,393]},{"title":"\"So, what do we believe?\"","rating":9,"date":"25 December 2018","review":"As Adam McKay's follow-up to The Big Short (one of my favorite films of 2015) he is back with another dark satirical comedy.<br><br>Just like in The Big Short, the amount of information McKay throws at you is a little overwhelming, especially if you don't fully understand it. It is a little slower paced of a movie, but the way he frames every scene has such gusto that you can't take your eyes off the screen.<br><br>Other than the brilliant script the main thing to note in this movie is the perfect casting. Christian Bale and Amy Adams teaming up again, this time as Dick and Lynne Cheney further prove they should team up in every movie together. Christian Bale is so believable as Dick Cheney that you suddenly forget that you are even watching Bale at all. Then you have Steve Carell as Donald Rumsfeld, Sam Rockwell as George W. Bush, Tyler Perry as Colin Powell, Naomi Watts, Lily Rabe, Jesse Plemons (in a role that I did NOT see coming), and plenty more.<br><br>There is a fantastic scene between Lynne and Dick where Plemons' character narrating notes - that we wouldn't know what they actually would have said in this certain moment, but he images it would be something quite Shakespearian. Then Lynne and Dick start talking like they are in Macbeth. Their chemistry is just fantastic and you get to see how much Lynne stepped up, and her ambitions and reservations with going into this political world.<br><br>As much as this movie paints Cheney as a villain, McKay still gave him depth and compassionate moments, and showing all of his health troubles. You really see how this man became the most powerful VP that we have ever had in the history of the U.S. Presidency and how scary that is because it is all true. We have lived it.<br><br>This movie is definitely not for everyone but I really enjoyed it. There is a funny after credits scene that shows how divided our country is, and the quote above is exactly what you should be asking yourself at the end of the movie. So, what do we believe?","user":"kingsgrl2010","rank":[207,301]}]