[{"title":"The incredible adventure...","rating":8,"date":"24 June 2017","review":"With all the horrors and depressing events going on currently in the world, it is refreshing to be reminded of a human endeavour that was wholly positive in outlook and execution. The Farthest is the story of the two Voyager space crafts which were launched way back in 1977. These probes were tasked with two objectives - to explore the outer planets and to carry messages to other potential life forms deep into interstellar space. At one point in the late 70's it became possible for this mission to be achievable, a time which occurs approximately once every 175 years where Jupiter, Saturn, Uranus and Neptune are aligned in such a way as to allow a space craft to travel between them using the gravity of one to propel it onto the next. This window of opportunity was grabbed and NASA formulated the Voyager programme, with Voyager 1 navigating the first two giant planets and Voyager 2 following behind but adding the final two to its trajectory.<br><br>Its genuinely quite an incredible story. Especially when you remind yourself that this extremely complex, technical and frankly unprecedented undertaking was achieved using mid 70's technology. In 2012 Voyager 1 became the first man-made object to leave our solar system and reach interstellar space, having orbited all four of the giant planets taking a series of incredible pictures of them and their moons. It achieved this with computer memory a tiny fraction of what can be found in a modern smart phone. Its bordering on a miracle that this mission was accomplished, especially when you learn that certain moments were executed with split-second accuracy, a fracture of a second more would have led to destruction, such as the moment where the probe was propelled between the atmosphere of Uranus and one of its moons. It's all the more impressive when you discover that the probes were re-programmable via communication with a craft which was over a billion miles away. It was in summary one of the greatest undertakings humans have ever executed.<br><br>The documentary takes a fairly traditional talking heads format where we hear recollections of various scientists involved in the programme. Its these moments themselves which add a considerable amount of emotional weight to proceedings, making it clear that these space probes were ultimately far more than scientific equipment, they represented something far more and quite wonderful. It's not just the scientific angle of the mission but also the philosophical, such as the moment late in the mission that the cameras were reversed to look back at Earth which was now a pixel, making it clear how small we are in the universe while simultaneously making us realise that we need to look after our small planet as this little dot on a picture is all we have. There is some considerable detail given to the golden record, which contains the music, sounds and imagery of Earth. The music ranged from Mozart to Chuck Berry (with The Beatles foolishly refusing one of their songs), the imagery constitutes about one hundred pictures which attempted to convey the world as much as possible. This alien contact element of the mission was unsurprisingly given a lot of publicity at the time but it is only now that the probe has finally left our solar system that this has become the whole mission. But really, the imagery of the four mysterious giant planets is the real pinnacle of the Voyager missions and the incredible imagery that it captured remains quite extraordinary. These probes will more than likely hurtle onwards through deep space at 10 miles per second for billions of years long after our planet and sun are gone, and that says it all really.","user":"Red-Barracuda","rank":[37,37]},{"title":"Beyond Stellar","rating":10,"date":"6 August 2017","review":"I was privileged to see this amazing documentary as part of the New Zealand International Film Festival in Christchurch, NZ. If you are enraptured by astronomy, physics, drama, tragedy, philosophy of science, or just amazing stories, don't miss this documentary. And if you're not, still see it and be prepared to change your mind. The documentary traces the whole story of the two Voyager missions to the outer planets of the solar system (and now beyond), from its earliest planning stages through to lift off and then all the incredible and unexpected discoveries since. The audience clapped loudly at the end of the showing, and deservedly so. Three cheers for the romance of science!","user":"peter-hallinan-874-731934","rank":[28,28]},{"title":"As remarkable an achievement as its subject","rating":10,"date":"7 September 2017","review":"Have a lot of high appreciation for documentaries, on a diverse range of subjects. The story behind the two voyager space-crafts was a remarkable achievement at the time and still holds much fascination now, even for someone who isn't an expert and has admittedly never considered science a famous subject of theirs.<br><br>'The Farthest' does its subject justice and as every bit a remarkable achievement. It is for me a highlight of 2017, and is accessible to anybody. One does not have to have deep knowledge of the story of the two voyagers to be completely fascinated by 'The Farthest'. It will illuminate those who do, nobody should be frustrated at not learning anything new, but has enough that will attract a wider audience who may have heard of it but not in great detail or have no knowledge and want to know more.<br><br>Visually, 'The Farthest' is stunning, beautifully photographed and those images of Jupiter, Saturn, Uranus and Neptune are enough to take the breath away. Loved the wide variety of music choices and felt they added a lot.<br><br>Emer Reynolds' direction impresses hugely, she does play it safe with combining the NASA interviews with simulations of CGI, poetic shots of Earth and archive footage. Yet it doesn't feel too safe at all, with enough ambition that never comes over as over-ambitious.<br><br>Loved the way 'The Farthest' was written and assembled. The scientific elements are hugely intriguing and illuminating to anybody watching regardless of how expertly or limited their knowledge. Then there are some philosophical elements that are thought-provoking and even touching, without being self-indulgent.<br><br>Where 'The Farthest' particularly excels are how the enthusiasm (perceptive and honest and never glorifying) of the crew (namely the scientists and engineers) is conveyed, adding even further to how inspirational this mission and story are, and how ingeniously imaginative the technology (the technology itself and behind the scenes of how it came to be) is in making the mission possible. These are presented in a very humble manner.<br><br>In summation, remarkable. 10/10 Bethany Cox","user":"TheLittleSongbird","rank":[18,19]}]