[{"title":"Only one complaint...","rating":9,"date":"28 November 2017","review":"(These are only \"spoilers\" if you don't know Dickens' basic biography and/or the impact of Victorian England on what is considered a \"traditional\" Christmas) <br><br>This review is written in response to a critic who called this film \"highly fictionalized.\" As someone who has taught Dickens and specifically \"A Christmas Carol\" for almost 10 years now, I wonder what the critic's problem was? Dickens truly did have a very rough period in his childhood when his father was sent to debtor's prison for living beyond his means and the young boy was forced to work in a boot blacking factory; this experience indelibly affected his outlook on life and his writing, and the movie absolutely captures this. In addition, Dickens was indeed strapped for cash in late 1843 and coming off the flop that was \"Martin Chuzzlewit\" (which he considered his masterpiece) so he did actually punch out the \"Carol\" in an amazing mere 6 weeks as a desperate cash grab. As far as I could tell, the movie was quite accurate, so I don't know what the critic was whining about (maybe he just doesn't know his Dickensian history). <br><br>Meanwhile, my one complaint...if you're going to call the film \"The Man Who INVENTED Christmas,\" you need to establish how Christmas was (or in this case, really WASN'T) celebrated in England pre-1840s. Aside from the very quick mention by the publishers that \"no one celebrates Christmas anymore\" and a brief reference at the end about a \"tannenbaum\" (aka Christmas tree) and how the German Prince Albert had imported his tradition into his wife Queen Victoria's household, and now everyone will copy the royals, there isn't much mention of how Dickens' work and the period in general affected our concept of Christmas. For example, did you know that 1843 was also the first year printed Christmas cards were sold? And there's a reason little lit up ceramic houses on Christmas display are called \"Dickens villages.\" It just seems that the movie could've included more information about the impact on the holiday. Other than that, a very worthy effort which will be worth referencing during my Dickens lessons in the future!","user":"StorieLuver","rank":[105,113]},{"title":"Dan Stevens and Christopher Plummer head wonderful cast","rating":10,"date":"26 November 2017","review":"When Dan Stevens asked that Matthew, his \"Downton Abbey\" character, be \"killed off\" so he could pursue other acting opportunities, I thought his career would go directly downhill. Matthew Crawley was a pleasant young man - but really didn't give Stevens much meat to chew so I figured his career would go the unsuccessful way of many other actors of limited talent who left successful TV parts. However, he was right to leave. He is much more talented than Matthew Crawley allowed him to be. His versatility is showcased to perfection as Charles Dickens in THE MAN WHO INVENTED Christmas.<br><br>It doesn't hurt that his Dickens is surrounded by a charming group of eccentrics, some of whom exist in his 19th century reality and others of whom exist only in his fertile imagination. I particularly liked Anna Murphy's Tara, the Irish housemaid who presents Dickens with inspiration for several key elements in his \"A Christmas Carol.\" Ms. Murphy's career should advance as she has a quite likable screen persona and an ability to stand out in any scene.<br><br>Christopher Plummer is wonderful in every part in which he plays. What woman wouldn't want to heal the heart of his Captain Von Trappe (THE SOUND OF MUSIC)? Who wouldn't want to hear his Chang declaim Shakespeare in its original Klingon(STAR TREK VI)? And who couldn't be caught up in the soul of Hal in his Academy Award winning BEGINNERS? I saw him in his stage presentation of BARRYMORE and was mesmerized. His Scrooge is equally mesmerizing.<br><br>The script is tight, the acting is solid, the sets, costumes, and staging are perfectly 1843. This movie should become a true Christmas classic - just as \"A Christmas Carol\" itself is a classic. In short - I loved it!","user":"gwmbkm","rank":[53,65]},{"title":"An unexpected mix of biopic and fairytale","rating":21,"date":"21 November 2017","review":"It actually took me a while to put this movie into a box. Is it a biography about Charles Dickens, or another version of the classic story being told? It's both. <br><br>It's actually like you watch a theater play that includes special effects you all have to imagine yourself during a play. You can clearly see the theatrical approach that the director wanted to take here. Christopher Plummer is an excellent Scrooge, the perfect fit! Even though this film throws in a good bit of comedy into the pot, it doesn't harm the story at all. If anything, it brings a little bit of freshness to the old classic of \"A Christmas Carol\".<br><br>I wouldn't describe it as a Christmas movie, or something that the whole family can enjoy for Christmas, but it certainly is a (long needed) new and modern approach to this story and that is still fascinating me, that this story indeed, never gets old.","user":"FilmFlowCritics","rank":[45,56]}]