[{"title":"What a load of crap","rating":11,"date":"11 February 2017","review":"After watching the movie then reading about Belle Knox, I realized the majority of the movie was made up in an attempt to make her look like a victim. Then again, it was a Lifetime movie and they usually try to paint the woman as the victim, so that shouldn't surprise anyone. Seriously, spend 10 minutes doing some research on Belle Knox, and you'll find that 99% of this movie is a lie. There was no mention of mental illness or her being a cutter, and in reality, that was the truth. They made her out to be this good little Catholic girl, and that couldn't be further from the truth. She has scars all over her legs from where she used to cut herself (she even carved the word \"fat\" into her leg), so there's obviously something wrong with her mind. No mention of that at all. In her first real adult scene, there was no makeup lady, she was never slapped and she asked them to do all the disgusting stuff after claiming she was a feminist. This \"based on a true story\" crap is just 100% modern day feminist propaganda where women aren't allowed to be held accountable for the choices THEY MAKE regardless of how bad the outcome is. Don't waste your time.","user":"RedQuinn","rank":[74,124]},{"title":"Utterly fictional take on her life","rating":1,"date":"13 February 2017","review":"This is just another one of those made for TV movies that twists the truth as much as humanly possible to get you to feel sorry for the main focus, she was not a straight A down to earth catholic girl by any sense of the word, she was quite the opposite with serious mental problems who took to cutting to deal with it, had they stuck with her real life story it might have been an interesting watch, but as always lifetime has to make the women out to be innocent and weak, it ruined what could have been an interesting true story with another pointless waste of time.<br><br>Don't bother watching this whether you are a huge fan of hers or never heard of her before, because either way you'll just be getting lied to throughout and come out believing she is someone she most definitely is not.","user":"airfaith","rank":[53,90]},{"title":"Did anyone else want to just smack her?","rating":1,"date":"22 February 2017","review":"* Spoiler alert<br><br>I'm 15 minutes into the movie and I want to smack her. She was offered a full ride to college, but went to a different school she couldn't afford? While I understand not wanting a bunch of loans I am not sure choosing to do porn is a better choice. <br><br>I am going to finish watching it, but so far I am just annoyed at what a spoiled brat she seems to be.","user":"micciknese","rank":[28,49]}]