[{"title":"Magical","rating":8,"date":"9 October 2017","review":"A friend WhatsApp-ed me the movie poster and shared with me in enthusiastic words that it is based on an amazing book and it is going to be a good movie. I thanked her and filed it at the back of my mind and forgot about it. Then one night in bed, I found out that the story is written by Keigo Higashino and a resounding \"whoop\" escaped from my lips and my wife next to me had a shock. That was it we had to see it. Between the both of us, every time a Keigo Higashino book is released in English, our life events will revolve around it till we have both read and dissected it. Author of The Devotion of Suspect X and Journey Under the Midnight Sun, Higashino writes intricately plotted mysteries that will give your brain a good workout and your soul much needed nourishment. The Miracles of the Namiya General Store is a rare foray into fantasy and drama for him, but it displays the same multi-layered plotting and attention to detail we have come to expect.<br><br>One night in 2012, Atsuya (Kyosuke Yamada from the pop group Hey! Say! JUMP) and his two buddies are up to mischief. To stay hidden from the police, they decided to hide in an abandoned provision shophouse. When the coast is clear, they decided to leave, but no matter where they run they will eventually land up at the derelict shop. They holed themselves up in the shop to make sense of things. Some time in the night, a slot in the metal front gate opens and letters drop in. It turns out that the letters are addressed to Mr Namiya (69 year-old veteran Toshiyuki Nishida), the owner of the store 32 years ago, asking for advice for their personal problems. Scourging the internet for clues, they learn that Mr Namiya used to dole out advice for anyone who writes to him with their problems and leave the replies written in long hand in a delivery box for bottled milk. With time on their hands, the three wayward guys take turns to pen replies and the recipient of the replies will receive them 32 years ago. In the process, the trio embark on a journey of self- discovery.<br><br>Okay I know you are thinking of The Lake House (2006), which is a remake of the Korean movie Il Mare (2000), where a ubiquitous mailbox acts as a conduit between two timelines. Director Ryuichi Hiroki and writers Hirosh Saito and Keigo Higashino, expand that idea so marvellously that the story encompasses so much more than just a romantic story.<br><br>In the hands of another filmmaker, the movie could have become conveniently episodic, but here the stories are layered so sublimely that they eventually resemble a slice of the perfect rainbow cake. This is drama done well, the situations may feel contrived and mawkish, but a magical twist in the end makes it come up smelling like a bed of roses. Stories don't end, they become seeds for the next one, proving once again that good acts create ripples in the tranquil pond of the human experience. That's just one of the many lessons I drew from it – sometimes you do not see the effect of your good acts because you do not have an omniscient view, and sometimes the far-reaching effects may just stun you.<br><br>The sense of place and time is strong here, and the 1980s is well depicted. The nostalgia is in full bloom. One of the joys of the movie for me is ravishing in the art of the written word. Technology has accelerated so rapidly that it has sounded the death knell for the art of letter writing. Very few narratives deal with this lost art of letting words simmer in your mind before putting them carefully on paper. Namiya doesn't dole out clichés and broad strokes – he pens each reply meticulously and thoughtfully. Sometimes they can be hilarious and most of the time they are poignant and hits the nail on the head. I am of the opinion that most people who writes in to Aunt Agony don't need help with their problem. They already know what they intend to do, but what they crave for is affirmation and the movie addresses this interesting aspect.<br><br>Hiroki does over-play his hand in allowing moments of over-acting and lingering on poignant scenes a tad longer than needed. But how I wish there is a movie like this playing in the cinemas every other week. This belongs to a rare breed of movies that nourishes the soul and reaffirms life, that no matter what station of life you are in, always do good and your legacy will be secured.","user":"ctowyi","rank":[20,24]},{"title":"Mindblowing concept!!!!!! Very touching!","rating":10,"date":"2 May 2018","review":"Wonderful movie... How both the worlds meet... The past meets the future.... The past shapes the future and the future shapes the past... Both Yamada and Nishida well best...Especially liked Nishida... He is always great in whatever roles he plays....<br><br>At times,I was confused with the timelines. But,as the movie came to an end,I understood everything....","user":"giteckm","rank":[6,10]},{"title":"Heart touching","rating":10,"date":"12 November 2018","review":"Caught me off guard because I didn't expect it would make me cry several times. The acting is touching. The concept is touching too. I appreciate and believe in human kindness more after watching this movie.","user":"khongthibichngoc","rank":[2,3]}]