[{"title":"Why is everyone sleeping on this?","rating":8,"date":"21 November 2019","review":"Because of the apparent total lack of reviewer interest in this film, SPELL, I was tempted to ignore it myself. The trailer pulled at me just enough to get me to check this out. My conclusion is that the filmmakers aren't greasing enough palms nor paying anyone for positive reviews, so it is fending for itself and that is not enough in 2019.<br><br>The fact is, the film is actually quite good and I was pleasantly surprised by how engaging it is. It is not a film to slot easily into one category or another, as it isn't really horror nor is it a dark comedy but has elements of both genres and would be a credit to either genre if you insisted on putting it into one or the other. It is a an engaging and unsettling story of a man named Benny dealing with a tragic loss made harder by a mental condition for which he has no medication to help control it.<br><br>Just the premise that his reaction to such a great personal tragedy is to to take an aimless trip to Iceland puts the story on tilt straight away. Benny's journey is affected by a small cast of odd characters who are drawn to Benny because of a possible magical connection that suggest Benny's choice of destination may be guided by the hand of fate and not as random and impulsive as Benny believes.<br><br>I choose not to rehash the plot beat for beat; I prefer to give an impressionistic account because the less detail you have, the more impactful this film will be. I will say that Benny's journey is at once deeply human and moving and believable, and his loss and his attempt to grapple with it is very recognizable to me. It is also true that his decline takes Benny and the viewer into some very dark terrain, literally and figuratively, and the story does intentionally jump the rails into a space that forces the viewer to question how much of what Benny experiences is real, how much is emotional and mental slippage, and how much is simply the terrible weight of the hand he has been dealt. It is daring in this way.<br><br>The story itself is also quite entertaining because Benny is resilient and his compulsive nature compels him to explore his grief, as heavy as it is, even though you suspect from the beginning that he expects no healing revelation, no happy ending. Still, he chooses to follow the mysterious trail offered him to its end for better or worse. He comes off initially as a slightly off-kilter \"man-child\" trying to make sense of a loss that was inherently senseless. That veneer inexoribly wears off and what emerges is a man in extraordinary pain who doggedly follows the mysterious thread offered him in search of meaning, even as he understands he may be sliding toward madness.<br><br>I deeply enjoy when filmmakers can demonstrate that a good story told by a talented team can take a budget of any size and create expansive spaces, seductive mystery, dramatic and deeply human character arcs. When you consider all of the mid-tier and mega-budget dreck that is produced year in and year out, smart films like this one demonstrate that there is no clear correlation between budget and quality. I think is proves exactly the opposite.","user":"danmartini-404-729014","rank":[21,25]},{"title":"In search of a lost lover","rating":6,"date":"6 April 2019","review":"Acting: 7\nStory: 7\nProduction values: 5\nSuspence - thriller level: 6\nAction: none\nMystery - unknown: 9\nRomance level: 8\nFilm noir ~ neo noir density: 6\nComedy elements: 5\nOverall: 6","user":"imursel","rank":[11,36]},{"title":"Decent film, good story","rating":7,"date":"3 March 2020","review":"I wouldn't put this on the MUST SEE list but if you have some extra time and are looking for a decent film, this one won't disappoint you. The story is enjoyable and the acting is decent.<br><br>I'm not picky but I don't spend much time on a movie if the first half hour or so isn't entertaining or engaging. This movie will definitely keep you interested.","user":"dustinh-76726","rank":[0,1]}]