[{"title":"I love this new Brecht movie","rating":10,"date":"22 March 2019","review":"I love this new Brecht movie. Especially Tom Schilling as a young Brecht is very impressive. Keep it up.","user":"Petra_Huber","rank":[4,9]},{"title":"A good film, certainly not a broken record","rating":6,"date":"24 February 2019","review":"This is \"Brecht\", a German movie from 2019, so really new and fresh and this premiered at the Berlin Film Festival recently. It was actually made by Heinrich Breloer and if you take a look at his body of work, you will find an impressive amount of prestigious projects over the years. The man turned 77 a week ago, so you could think he was retired as he hasn't made a movie in over a decade, but I guess the itch in his fingers came back and unsurprisingly, some of the finest german actors were on board for his newest project. His biggest successes are all small screen releases and this one here was initially intended as one too. Still, it was shown during the time of the Berlinale or slightly after for one week at theaters. But only for one week really. So if you went for the watch there, you made a wise choice, even if it is a film that also works on the small screen for sure. I could also say two films indeed asthis one here consists of two episodes of approximately 1.5 hours each, so the entire thing runs for slightly over 3 hours all in all. It is long, but can certainly be checked out in one sitting. The cut is clean. The first half is about the early years of Brecht, how he falls in love with far more than one woman and needs a little while to figure out who's the right one for him. Ironically, the one he picks eventually is basically the only one I did not find too attractive, but yeah what can I see. Leonie Benesch I always found stunning and I liked Friederike Becht too. And if we make the jump to the second half, there is Maria Dragus, who i always found oddly fascinating, even if she goes against everything I physically like in women and also Laura de Boer who seemed to have been Brecht's final lover. Oh and how did I forget Mala Emde early on, she is as stunning as on the recent road movie she's in. So yeah many many amazing women circling around Brecht here and luckily they are all also good actresses, which makes it even mroe worth seeing. I must say I am not the biggest Tom Schilling fan, but still I enjoyed the first half for the most part. And he sure wasn't bad. But there were some moments when really I found Brecht truly despicable and despite his talent, it was very difficult, honestly impossible for me, the cheer for him and want him to find success in all areas of life. The most crucial moment would be when his lover has a miscarriage and he gets to her bed at the hospital and shows her the photos that depict another Brecht child playing happily. Honestly, this was really sadistic, even if she did not 100% end the relationship with the other guy. Another scene would be when there is a phone conversation and he tells a girl he's been with / still was that he will not accept her affair in any way and that he will ruin her while having one on his own. By the way, the woman's affair was Theo Lingen at that time, a truly likable German actor from many decades ago, especially during his senior years in comedy. But lets not drift away. In these scenes, not just the one when he seduces a girl, he turns into his character Baal, being exactly as despicable and cold-hearted as he is. So yeah the first half are the years before the Nazis come in charge in Germany, while at the end we already see the impact this shift in power has on brecht and everybody around him.<br><br>Now the second half makes a considerably jump time-wise. There is no focus on the Nazi years itself, the story continues a while after the end of the 3rd Reich, even if there are references back to the years 1933-1945 of course. There is also talk about how Americans were really not too fond of Brecht's potentially too close connections with communism and this is especially emphaiszed during a hearing. You know what I mean when you see it. And again, there is major focus on Brecht's romantic relationships, most of all with Helene Weigel, but also others including a Danish woman who really fell for Brecht. The former is played by Adele Neuhauser, normally not a huge fan of her, but here she was fine and honestly her striking similarity physically to Weigel makes her perfect for the role, even if the make-up team did a fine job for sure too. The latter is played by Trine Dyrholm. I must say I am not too familiar with her, but saw her in some projects, but I would not have recognized her here. Her acting was as good as everybody else's though. A very competent cast for sure. Now I diid not mention yet the lead actor though, shame on me. Brecht is played by Burghart Klaußner in the second half, certainly one of Germany's finest actors these days and I like him a lot too, one of my favorite German actors and he has appeared in many projects I appreciated. This is another. However, despite my clear preference for him over Schilling, I was surprised that I did not really like the second half more than the first. Both are good, neither is great. I think ti all comes down to the story. the odler Brecht here struggles most of all with the location where his plays are prepared, performed and shown to the masses. And again, Weigel comes into play here as she runs the show basically in Brecht's new location and he was always closely connected to her, even if he had all these other women. So yeah, I am definitely not saying Klaußner did a weak job here or anything, but he also somehow did not make the character his own as I hoped he would. Both Brecht actors here are pretty much on the same level as Lars Eidinger in another recent German film about Brecht, more specific about a certain work by Brecht, the Three Penny Opera, a real classic, and while the Eidinger film is almost completely about that project and the failed attempt of getting it from the stage to the screen, there are only minor references to that one in this 2-part movie we have here. But as briefly as it may have been included here, it is still one of the more memorable parts of the film, especially because of the intriguing songs and music, this one has to offer. So now I am right at the beginning of the film again when I am right at the end of my review. My suggestion is to check this one out. I think it is a solid watch from almostevery perspective, also in terms of costumes, make-up and art direction. One of the better, but not best 2019 German films I would say. Only a must-see if you really are into Brecht and his body of work and life.","user":"Horst_In_Translation","rank":[2,5]}]