[{"title":"12 Days of Smiles","rating":7,"date":"21 February 2018","review":"Review Date 2/20/2018<br><br>PLEASE BEWARE OF SOME REVIEWERS THAT ONLY HAVE ONLY ONE REVIEW. I HAVE OVER 400 REVIEWS OF \"CHRISTMAS RELATED FILMS &amp; SPECIALS\" WHEN ITS A POSITIVE THERE IS A GOOD CHANCE THEY WERE INVOLVED WITH THE PRODUCTION. NOW I HAVE NO AGENDA! I REVIEW MOVIES &amp; SPECIALS AS A WAY TO KEEP TRACK OF WHAT I HAVE SEEN! I HAVE DISCOVERED MANY GEMS IN MY QUEST TO SEE AS MANY \" C H R I S T M A S \" MOVIES AS I CAN.<br><br>Now Someone keeps reporting my reviews. I guess they are jealous because I do tell the truth. I want to point out that I never make snide remarks about actors weight or real life sexual orientation. If there acting is terrible or limited \"I talk about that\". If a story is bad \"I will mention that\" So why am I being \"picked on\"? IMDB? When one of my reviews gets deleted IMDB will not even tell me what someone found offensive. Well on to this review.<br><br>This film a man wins a sizeable amount of money. Not Lotto money but sizeable. His finance wants him to save it or spend some of it on their future wedding. She gets mad when she finds out he has been spending the money being a secret Santa. <br><br>This whole is built upon the premise that its \"Better to give than receive\". The film works and its not perfect but it's not a time waster. <br><br>This is one of the better Television Christmas movies","user":"Christmas-Reviewer","rank":[15,16]},{"title":"Potentially good story","rating":4,"date":"21 December 2017","review":"Unfortunately it's ruined by a bad child actor who was given an unlikable character. <br><br>Am I supposed to find the disobedient kid who blackmails someone doing something nice, cute? Because no, I hate that kid. Maybe his acting sucks so much because he hates being that kid. <br><br>Anyway, there are better movies out there, but this one is okay in a pinch.","user":"Kate1976","rank":[12,18]},{"title":"Dumped Netflix ... thank God","rating":10,"date":"14 July 2019","review":"I keep finding these movies on my Roku- all with messages of kindness, gratitude etc... less slick than Hollywierd but each one with its own beauty.<br><br>Thank you to all makers of these films that cause the heart to open up and hope.","user":"ingabente","rank":[2,2]}]