[{"title":"I love the Hallmark \"Royal\" themed Movies","rating":14,"date":"14 January 2017","review":"I LOVE These Hallmark Royal films!! (Christmastime and Winterfest are my faves). This movie was exceptionally good, and looks like it was filmed in the same location, as A Crown for Christmas. This is equally well casted and scripted as 'A Crown for Christmas', and 'A Princess for Christmas.' <br><br>Maggie, a recent law school graduate from NYC is deciding what direction she wants to go in, and gets invited by a girlfriend to go on a vacation to a small European country to think things out, and get away from the pressures of her dad. While there, she meets the handsome, and fun Prince Adrian, but she doesn't know he's a prince, and It's chemistry at first sight.<br><br>I love the actors! It's refreshing to see new faces in Hallmark flicks. The movie, like most is predictable, however, it wasn't what I like to say \"saccharine-sweet\" which is awesome! There was wit, great dialog, and beautiful sceneries. I hope, and look forward to more Royal-themed movies!! <br><br>Keep it up, Hallmark :)","user":"LuLuBelleKy","rank":[14,17]},{"title":"Pretty typical plain vanilla prince meets commoner story","rating":5,"date":"16 January 2017","review":"The story is pleasant enough for a romance movie. Maggie gets swept off her feet by a wonderful man who turns out to be a prince who is about to be crowned. Like many Hallmark movies, at least one of the lead characters has none of the personal traits required to hold the position they hold, or aspire to, in life. In this case Maggie is too laid back to be a corporate lawyer. She is timid and indecisive. Meanwhile the Prince is the cliché \"playboy prince\" that he is reputed to be. He has avoids important duties and responsibilities and he wanders the town apparently flirting with girls. This is mitigated in part by his special foundation. Another trait of Hallmark movies is how minds and even personalities do a complete 180 all of a sudden. And the climax is pretty much predictable. This movie lacks anything that stands out as special, so although it is pleasant, it is also just average.","user":"Jackbv123","rank":[20,29]},{"title":"Better than the average Hallmark Movie","rating":10,"date":"26 October 2017","review":"While the female lead is supposed to be a corporate lawyer, the story states up front that is not where her heart is. So she is not portrayed as the typical corporate lawyer. The character of the prince, on the other hand, is played as the typical playboy prince he is supposed to be. As mentioned by other reviewers, he does do a 180 degree change in the middle of the movie, but he has good reason, he has fallen in love. And the young woman has found a kindred spirit; one who is interested in the betterment of common people. The best thing I like about this movie is the actor playing the female lead is actually the age of the character she plays. She is not in her late 30s or early 40s playing a character in her mid to late 20s. And she is not already engaged to a self-centered boyfriend with greased back hair. Why are so many other Hallmark female leads who are supposed to be so smart, actually so stupid to date these guys?","user":"beachy-38431","rank":[9,12]}]