[{"title":"Selfies, selfishness and sex: a pessimistic view on society","rating":9,"date":"3 October 2017","review":"\"Nelyubov\" (\"Loveless\") starts as a psychological movie about a divorcing couple, then evolves into a thriller after their child disappears, focusing on the search. Yet overall it is a critical view on modern society, notably Russian.<br><br>*** WARNING: CONTAINS SPOILERS ***<br><br>The tone is pessimistic. The story focuses on a few individuals, however news heard on the radio or TV are depressing: the end of the world, corruption, war (Ukraine). Characters are confronted to a harsh environment: at work, bosses impose their arbitrary views to employees (no divorce, religion); the police cannot assist to find a missing child; missing children are commonplace.<br><br>The main victims of society are children. They are not desired: Zhenya wishes she had aborted; none of the parents want to keep Alyosha; we understand Boris' girlfriend got pregnant \"by accident\". They are not taken care of: Zhenya did not have any milk for Alyosha when he was a baby (a revealing metaphor); Zhenya and Boris only realise after two days that their son is missing; at the end, Boris removes the crying baby instead of taking care of him.<br><br>All this is a repetition of the past: Zhenya was not desired by her mother either and now has harsh contacts with her. Hence we feel that eventually children will grow up to be like their parents, forever perpetuating the lack of love within families. This perpetuation is emphasised by similar shots at the beginning and end of the movie: empty snowy landscapes with the same tense music.<br><br>The \"loveless\" context spreads to all relationships: Zhenya tells Anton she loves him but he does not answer; at the restaurant, a young lady easily gives her mobile number to a complete stranger before sitting down with her date. People only care about themselves: what matter most is wealth (Zhenya's comment about Anton), appearance (the beauty parlour) and social media (various selfies). Symbolically, when the coordinator questions Alyosha's friend at school, the blackboard in the background shows cold mathematical formulas instead of words or drawings (detail emphasised afterwards when the teacher erases the board).<br><br>The atmosphere is not only bleak: it deteriorates progressively, noticeably after Alyosha's disappearance. This evolution is illustrated in different ways:<br><br>1. SITUATIONS. At the beginning, Zhenya and Boris are separating cruelly, but are hoping for a fresh start in new relationships. These are shown in parallel, always in the same two apartments, highlighting their similarities and hence developing a systemic view on couples. First, the vision seems positive: the two new couples each have dialogues and a long erotic scene. However, couples then slowly drift apart: dialogues are reduced, doubts about the relationship emerge, there are no erotic or tender scenes any more. Finally, couples are physically separated despite being in the same home: Anton watches TV while Zhenya practices on the balcony; Boris watches TV while his girlfriend talks to her mother in the kitchen.<br><br>2. IMAGE. To start with, shots highlight the tension between Zhenya and Boris, living together unwillingly: the camera uses long focals (sharp foregrounds, blurred backgrounds); frames are saturated (Boris in the crowded elevator, Zhenya in the crowded metro, close shots on the tray at the canteen, etc.). After Alyosha disappears, characters seem lost among high buildings, deserted places and endless forests. They increasingly bump against elements: cold and wet weather, metal fences (twice), large river, gigantic radar in the middle of the forest. Noises are menacing: barking dogs, traffic, planes, etc.<br><br>3. PLACES. After Alyosha disappears, cosy apartments are replaced by Zhenya's mother's neglected house, then a huge derelict building, then a dreadful mortuary. The sequence in the derelict building is pivotal: it used to be a pleasant place of gathering (room with many seats), music (standing piano) and enjoyment (beautiful art deco bar); all is now destroyed. The schoolyard, where children ran at the very beginning of the movie, is now empty, just filled with snow. At the very end, Alyosha's bedroom is torn down and completely reworked: the little that remained of the boy's soul is definitely gone.<br><br>4. ALYOSHA. The boy actually is the main role: he opens the movie and is very present in the first part; after he disappears the entire plot revolves around his search. Yet we never see him again: this vacuum becomes the icon of a soulless society. The only elements that eventually remain from him are the posters with his picture, scattered in empty places, and the tape he threw into the tree at the beginning: two derisory reminders of his existence. (Side note: the tape is striped red-and-white for safety, announcing the forthcoming tragedy.)<br><br>The overall message is: we could have built a convivial society, but instead brought void and selfishness. Economic conditions can only partly be blamed since characters belong to middle or upper class. At the end, Zhenya is running on a machine, outside in winter, wearing a training suit proudly showing \"RUSSIA\": this cold society seems to be moving, but it is standing still, going nowhere. Meanwhile, Anton and Boris are watching propagandist news on TV. The allegory could hardly be more explicit: it is common knowledge that Zvyagintsev is very critical towards his country in general and the present government in particular.<br><br>That said, \"Nelyubov\" has a few downsides. First, it is almost too skillful: messages and codes ooze from every situation, with minutely crafted images. Also, the vision is hopeless: nobody is truly positive, except maybe Alyosha who precisely disappears and the volunteers who mostly remain anonymous (the exception being the coordinator, who is nevertheless severe). Last, characters are somewhat stereotyped: to summarise, women are hysterical and men autistic. All these elements render the movie relatively one-sided, almost cynical: everything is thrown overboard.<br><br>Nonetheless, \"Nelyubov\" remains an aesthetically impressive movie, to the extent that it never feels long despite its minimal action. Zvyagintsev again demonstrates he now is one of the leading Russian directors. His mastery seems to increase with every movie.","user":"Teyss","rank":[197,211]},{"title":"Reflects the growing emptiness of human relationships","rating":9,"date":"15 October 2017","review":"Whether or not it is designed as an allegory of modern Russia, no film in recent memory has examined the growing emptiness of human relationships with such expressive force as Andrei Zvyagintsev's (\"Leviathan\") Loveless, a heart wrenching drama about a couple on the brink of divorce whose emotional neglect of their son leads to devastating consequences. Though the film has been characterized as \"bleak,\" the feeling tone is more like sadness and regret that many today have lost the capacity for compassion and empathy. Accompanied by Evgeny Galperin's rich cascading piano score, the film opens as cinematographer Mikhail Krichman surrounds us with the quiet beauty of a Russian winter.<br><br>Almost immediately, we are staring at an cold-looking stone building that could easily be a prison in Siberia. There is no sound or movement. Suddenly a door opens and children, released from school, swarm through its exits. Though some are laughing, it is not a happy scene. 12-year-old Aloysha (Matvey Novikov) makes his way home through a barren forest but there are no warm greetings awaiting him. The marriage between his mother, beauty-salon owner Zhenya (Maryana Spivak) and his father Boris (Alexey Rozin, \"Leviathan\"), a desk-ridden management functionary, is over. Seeking status, money, and freedom, both are immersed in new relationships. Boris is with the pregnant Masha (Marina Vasilyeva, \"Name Me\") and Zhenya with the well-to-do business executive Anton (Andris Keishs, \"What Nobody Can See\").<br><br>Though their apartment has been advertised for sale and their divorce is in its final stages, custody of Alyosha has not yet been agreed upon. It is clear that he is an unwanted child, the result of an unexpected pregnancy and a marriage of convenience. Like emotionless machines, the warring couple continue their repetitive spiral of mutual recrimination as Alyosha crouches behind the bathroom door. Fearful and alone he absorbs every last ounce of malice, his face becoming contorted into a mass of silent tears that well up from deep within his being. It is a shocking scene that mirrors every despair the world has ever known.<br><br>Since the film takes place in the year 2012, talk radio focuses on the Mayan calendar and its apocalyptic date in December. News reports tell us about the bloody war in the Ukraine. Amidst the barely-controlled paranoia in the air, Boris tells a co-worker that he is afraid to lose his job if his boss, a fundamentalist Christian, finds out about his impending divorce. Fear of losing his job becomes secondary, however, when Zhenya tells him that Alyosha has not shown up for school for two days and is now missing. Far from coming together to patch up their differences, however, the estranged couple only double-down on their mutual acrimony.<br><br>The inefficient police offer little expectation that they can find the boy and try to reassure the parents that, in most cases, a missing child is with a friend or relative or out on an adventure and will soon return home. Not satisfied with officialdom's inertia, they turn to a volunteer group who put up posters, talk to teachers and neighbors. An interview with Alyosha's only friend points them to an abandoned apartment in the middle of a forest. In a scene of eerie darkness where there is a palpable feeling of hopelessness and loss, the rescuers, wearing bright orange jackets, comb every space in the decrepit building but Alyosha is not found.<br><br>A boy matching Alyosha's description is found at a nearby hospital but it is not him, and a subsequent visit to the morgue only offers more tears. Taking a risk, the two visit Alyosha's mother but the visit only succeeds in bringing hatred up to a level of ecstasy. With no explanation in sight, Zvyagintsev teases us with the sight of an unknown man walking alone into the forest, a man hidden from the camera in a fancy restaurant asking a call girl for her phone number which she provides while looking directly into the camera, a man pausing at a bus stop to read the flier about the missing boy, then turning and walking away, and a teacher cleaning her blackboard after students have left.<br><br>These tantalizing scenes, however, do not bring us any closer to a solution to the mystery of Alyosha's disappearance. Loveless is a deeply disturbing film that explores the dark places of human behavior, upending our most cherished beliefs about the bond between parents and children. Making it clear about what can happen when an unwanted child is brought into the world, Anton tells Zhenya that no one can survive a life without love. If Loveless serves as any kind of warning, it may be to help us discover that the world cannot survive either unless we begin to re-envision it as sacred.","user":"howard.schumann","rank":[109,122]},{"title":"Excellent drama about unhappy people","rating":8,"date":"1 October 2017","review":"Parents love their children. It's one of the most fundamental and universal forces in the world.<br><br>But not in this film. Zhenya openly regrets not having aborted her son, who is now 12 years old, and her husband Boris agrees that an abortion would have been better for everyone. This unhappy family is finally falling apart: Zhenya and Boris are getting a divorce and are considering a boarding school for their son. Both hope to find happiness with new partners, and clearly they don't want the boy to interfere.<br><br>This situation takes an unexpected twist when the son doesn't turn up at home after school. Reluctantly, the parents inform the police about the missing child. A volunteer corps starts a search of the neighbourhood. Even after the boy's computer is inspected, his best friend has revealed their secret hideaway, and his grandmother has been visited for possible clues, the boy is not found.<br><br>The search for the boy puts Boris and Zhenya in a ambivalent situation: they are supposed to be heartbroken, but in reality they consider the disappearance of their son as a rather fortunate event. On their minds are their respective new partners, more than the whereabouts of the boy.<br><br>Just leave it to director Andrey Zvyagintsev to turn this situation into an excellent, but pitch black drama without even the least shimmer of hope. The hate between Boris and Zhenya is extremely intense, and the rest of the cast doesn't show much human warmth either. On countless occasions, the characters check the screen of their smartphone. When nobody exchanges a smile or a kind word, digital friendships are better than nothing. The last scenes are the most desperate: even with their new partners, Boris and Zhenya don't seem to find any happiness.<br><br>Surprisingly, Zvyangintsev doesn't use any urban decay or Russian dreariness to accentuate the general negativism. On the contrary, Moscow looks modern and many scenes could just as well have been set in an American or European city.<br><br>Apart from the drama of a family falling apart, the film has something to say about Russia. There are news flashes about the war with Ukraine, and a police officer complains about not having enough resources to fight all the crime that's going on. The ultimate metaphorical statement is in the very last scene: Zhenya is running on a treadmill, wearing a training jacket with 'Russia' on it - not even in Cyrillic letters. The message: Russia is wasting its energy and not making any progress.","user":"rubenm","rank":[53,65]}]