[{"title":"The Power of Self-Suggestion","rating":1,"date":"31 May 2017","review":"Look, if you're not a scientist or a geologist, it ultimately doesn't matter whether you believe that the ancient Book of Genesis is fact or fiction. You'll probably go your entire life unaffected ultimately by your belief on an ancient flood, or a deity creation myth, or anything in the Book of Genesis.<br><br>That being said, what struck me the most about this documentary was this wasn't made from facts, it was made from statements of belief.<br><br>\"I believe....\"<br><br>\"I believe....\"<br><br>etc. Through the ENTIRE documentary, over and over and over.<br><br>These are BELIEFS. That's all. <br><br>If you think this doc might answer the question \"Is Genesis history?\", unfortunately it was not and will not be answered. <br><br>Maybe one day we'll get the documentary that many have wanted \"What parts of Genesis are based on fact?\", but until then, we'll have to settle for pseudo-scientists and others waving their hands at the Grand Canyon and regurgitating quasi-scientific technobabble.<br><br>Noah's Flood is a much older story than the one that is included in the Bible. Flood myths stretch back thousands of years before the Bible. We even found one, in The Epic of Gilgamesh, virtually identical, except someone else building a boat, not \"Noah\". <br><br>So the \"literal\" flood is a retelling of a story that didn't even involve anyone named Noah.<br><br>The documentary didn't even notice this little fact, so what else did it leave out while talking endlessly about what they believe the Bible says? So a book that's been translated, not once, but three times into modern English. Ancient Hebrew to Ancient Greek to Latin to Vulgate Latin to English contains accurate history and nothing else?<br><br>OK...time to move on to another documentary...","user":"magicgrabz","rank":[156,253]},{"title":"An underwhelming, misleading, wholly biased documentary, supporting bad science.","rating":1,"date":"12 June 2017","review":"Once upon a time I used to be a fundamentalist Christian who believed in a literal six- day creation account, which I ardently defended. I no longer meet these qualifications, and have become an evolutionist. I watched the documentary expecting it to be a faith-filled defense of Genesis, despite its logline of \"Presenting two view.\"<br><br>Here are numerous issues I discovered within the documentary:<br><br>The film only interviews literal six-day creationist scientists, and offers no rebuttal or counter-evidence from opposing beliefs. This gives the film a significant bias, with scientific opinions being founded foundationally upon subjective, religious beliefs. It creates an echo chamber for the film, where the only opinion you're told is the one you're expected to believe in.<br><br>The film is highly dichotomous. You either believe in 100% of Darwin's theory, or you believe 100% in Genesis. No room for theistic evolution, old-earth creationism, day- age, or anything. This is a further problem of the echo chamber mentioned above. One of the film's interviewees after the film's released attempted to redact some of his statements for being misconstrued as advocating this false dichotomy.<br><br>Perhaps most horrifying is how presuppositional the film is—it's bad science. Everyone interviewed in the film believes the Bible is 100% literal (except the parts that aren't), and, consequently, will not believe in evolution anyways. \"Well Genesis is 100% true so anything else can't be right\" seems to be the feel throughout.<br><br>What is funny about the film though, is that if you're familiar with evolution, the film helps reaffirm your position. A lot of the experts in the film clearly recognize what evolution is, but they won't admit they believe in it. They believe in specieization (that species evolve within phylum), but they won't believe it on the macro-scale. They recognize the difference between a Sea Urchin and Starfish is just a few genetic changes, but they again presume God first, and then deny the potential for evolution.<br><br>This film has beautiful cinematography and scenery, but it was not written well. It is not definitive, or even remotely helpful. It is a perpetuation of the echo-chamber of fundamentalism.","user":"linkoo","rank":[120,195]},{"title":"Same old Creationism, not Science","rating":1,"date":"6 June 2017","review":"There is no science in this so-called \"documentary\"; it is a more slick version of the same ridiculous Creationist films done years ago. The claims are those long held by Creationists, with an attempt to suggest that Genesis is just another alternative scientific theory. Of course, Biblical scholars (many of them believers) take Genesis for what it is: myth. Beautiful, poetic, compelling, yes, but myth. Not sure what a myth is? Check out Joseph Campbell online. Want to check out the pseudo-scientific claims in this program? Check out the work of Stephen Jay Gould and many others. There is no debate going on in scholarly communities about whether Genesis is \"history\". For discussions of the Bible as a historical source, see the works of William Dever or \"The Bible Unearthed\" by Neil Silbermann and Israel Finkelstein.","user":"harrisr-48952","rank":[123,204]}]