[{"title":"A powerful and enjoyable film","rating":8,"date":"16 January 2020","review":"I didn't know much on this story when it all happened, possibly cause I'm based in Australia and it was an American scandal, but the whole story is so powerful and should be shared across the globe.<br><br>When Gretchen Carlson (Nicole Kidman) is let go from her job at Fox News, she sues the CEO, Roger Ailes (John Lithgow), for sexual harassment. Going up against a powerful man in a even more powerful company, Gretchen seeks help from other female employees to come forward and speak up and make an end to this man.<br><br>I really enjoyed this film, but felt I could've enjoyed it even more if I knew more about the story when it was happening. In saying that, it didn't make the film confusing or bad in any form.\nIt's a powerful story that needs to be shared for how woman can be treated in the workplace and hopefully spreads the message that inappropriate sexual behaviour is never acceptable and should be spoken up about.<br><br>Nicole, Charlize and Margot were all so damn good in this film. Three incredible ladies. I would've liked to have seen a bit more on Margot's character, but I then learnt after that her character isn't part of the real life scandal.<br><br>This is a great movie to start off the new year.","user":"olivewahh","rank":[87,134]},{"title":"Thank you one-star reviews for convincing me to watch this","rating":8,"date":"21 January 2020","review":"I was hesitant at first to watch this movie. I couldn't imagine watching anything nearly two hours long about the Fox Network. But as sometimes happens when I look at one-star reviews, the haters convinced me to give it a try. If the film enrages them so much they are driven to defend two old white guys who were fired by their own far right bosses for sexual abuses, the movie must be pretty hard hitting.<br><br>I found it to be entertaining. I gather one of the main characters isn't a real person, but rather a sort of amalgam of many women who were sexually abused and either left Fox or were disposed of in other ways. I liked the husband who supported his famous wife so loyally, and got a kick out of the shenanigans the lesbian character had to go through to stay hidden in plain sight. I never expect a documentary with these films, so small changes don't enrage me and provide one-star ammunition. I have to be in a certain frame of mind to watch documentaries anyway.<br><br>So if you are a gun carrying member of the far right tribe, perhaps you should skip this movie and save yourself the trouble of posting a one sentence review. I'm here for you, guys.","user":"narrator56","rank":[136,221]},{"title":"Consistently disengaging","rating":5,"date":"27 January 2020","review":"BOMBSHELL 5 out of 10\nConsistently disengaging.<br><br>Charles Randolph, co-writer of best adapted screenplay Oscar winner The Big Short (with Adam McKay, based on the book by Micheal Lewis), wrote Bombshell. He should not be allowed to write alone.<br><br>The material he had to work with in bombshell had every opportunity to be engaging, however it was horribly executed with maybe 1 good scene of tension and drama.\nThere is a cautionary foremessage about the presence of dramatisation in the movie. There is no way the movie is less boring than the real events that occurred.<br><br>No character was given any depth, with the only distinguishing feature being the A-list actor in the part. Randolph could not choose a focus for the story, not any of the characters or even the main issue was followed to any significant degree; instead, the movie diverts to unnecessary tangents about what our characters are up to in their personal lives in what I can only assume was an attempt to humanise the cardboard cutouts. I couldn't care for any of the characters.<br><br>By an acting standpoint, I managed to spot 3 good actors, Charlize Theron, Margot Robbie and John Lithgow. Lithgow's performance was genuinely engaging as was most of Theron's.\nThe few Australian accents in the movie from the Murdoch family were laughable as they parkoured between British, American and have-heard-of-Australia levels of accuracy.<br><br>Maybe in an earlier draft of the script Kate McKinnon served a purpose, Bill O'Reilly was more than a name or Margot Robbie wasn't reduced to an extended cameo, but these are only some of the useless elements that made this movie feel an hour longer than it was.<br><br>Thematically, the story is hollow, with the only thing the movie says is 'sexual harassment bad', delivering a message beyond safe, that it barely registers as a message. Randolph was unable to even fully commit to any political view on such a significant event, with certain scenes trying to be apolitical and political, displaying anti-trump notions whilst emphasising the reliability and integrity of Fox News, with only a slight left lean, leaving the story forgettable. (The Trump sections were played as cute references?) However, seeing how it reflects my political ideology, it must be good 10/10.<br><br>But wait. Isn't it hypocritical for such a big Hollywood movie to condemn sexual harassment whilst also practicing a far more toxic culture than a Fox News office? No because the movie is anti-sexual-harassment, so I think they learnt their lesson.<br><br>There were very few scenes of significant CGI use, but boy were those 2 scenes very distracting. An actor on a roof looked like they were floating, with surrounding buildings and rooftop antennae looking less real than their wigs, and an actor was not well composited into archive footage.<br><br>Consider me thoroughly disappointed. Should this win any of the 3 Oscars it was nominated for? Probably not.","user":"LiamDoesntLikeMovies","rank":[54,83]}]