[{"title":"Doesn't get any worse than this","rating":1,"date":"7 July 2017","review":"Disappointing is a word I would normally use when discovering a below par movie, but I did not expect much from this movie to begin with so the bar was set quiet low in my expectation. Somehow the director managed to lower that bar considerably. Terrible direction, no style of any kind whatsoever.. terrible sound editing,, a gunshot sounds like someone farted loudly.. awfully clichéd dialogue, wooden acting at its worst, lighting was poor, cinematography was childlike and vacuous,. This was a calamitous endeavour from start to finish. Watch it only to learn how not to make a western.","user":"chumgriffin","rank":[58,77]},{"title":"Average Western with disappointing action and plot","rating":5,"date":"15 August 2017","review":"I am a fan of well done, action packed Westerns but this movie fails to deliver any exciting or believable fight scenes. The gun play sequences are poorly paced and not very believable and the transitions between scenes are awkward. The worst flaw was the lack of continuity between scenes. A young boy is shot in the right leg and we watch as the bullet is removed by a half drunken doctor but in a scene five minutes later, the boy is shown sitting with a bandaged LEFT leg, only to be shown later with an injured right leg again. Overall this was a promising movie that did not live up to my expectations.","user":"nevideo-92913","rank":[22,27]},{"title":"What a shame.","rating":2,"date":"8 July 2017","review":"This had so much historical fodder for storytelling and they did this. The writing was terrible, the direction worse, and many of the actors seemed to be just phoning it in fora paycheck.<br><br>The most sad thing of this had to be Kris Kristofferson who seemed to be reading from a slow loading dialogue delivery system of some sort. The only actors that did well were those with few paychecks behind them.<br><br>Action and SFX were beyond poor and the entire film was a train wreck in that you can't stop watching to see if it can get any worse.<br><br>Kris and Bruce? It's time to retire. You had great runs but it has gotten down to the point that peeps might think you just don't give a shot anymore. Loved you both in your earlier stuff.","user":"rareandfirsts","rank":[50,67]}]