[{"title":"Charming, lovely and well made movie","rating":10,"date":"29 December 2019","review":"A simple wedding is a well made romantic comedy that provides a good insight to the Persian culture. There is a great chemistry between the cast, although, the movie start a bit rough and rushed at the beginning. But after the characters are developed, it is easy to connect with them and enjoy a wonderful story.","user":"kemtehani","rank":[13,23]},{"title":"Terrible. What a waste of a fantastic cast.","rating":2,"date":"18 February 2020","review":"This movie was nothing but a bunch of tropes thrown together. The writing was awful. None of the jokes landed. I was excited to see it because of the cast. Maz Jobrani and Shohreh Aghdashloo are terrific and hilarious when given even half decent material.<br><br>All the charm and cultural aspects of My Big Fat Greek Wedding was missing in this movie. Nothing in this movie other than a few scenes where the characters speak Persian had anything to do with Persian culture or humor. It was as if the writer was guessing what Iranian culture is supposed to be. I wanted to stop watching after about 30 minutes, but continued to watch in the hope that there would be one scene that made it worth my time. That moment never came. Avoid this film like the plague.","user":"farbodh-513-51858","rank":[6,9]},{"title":"A disappointment","rating":1,"date":"11 January 2020","review":"A simple wedding had a couple of chuckles. But, besides that it was a waste of time. Before anything, the bad acting of the main male actor was absolutely unbearable.\nThe story was simple. It was about a guy who wanted to marry a rich minority girl and become rich. She got cold feet. His plans fell through. He got upset, and blocked her on social media. But, based on the movie the light at the end of the tunnel for every Persian person is a white person of another gender. So she did everything in her power to get the guy back.<br><br>Who wrote this westernized and orientalized screenplay? Nothing in this movie was culturally sound either North American or Persian. It was a mash.","user":"shila-18970","rank":[8,16]}]