[{"title":"Game of mirrors","rating":7,"date":"10 July 2017","review":"One reason I'd like to see 'L'Amant Double' for a second time, is just to count the number of scenes featuring mirrors. A rough estimate: somewhere between twenty and thirty. Sometimes there are two or three mirror scenes in a time span of just a few minutes. A few of them really stand out in a cinematographic way. In one scene, we see a conversation between two people, but it seems as if they are talking to each other's mirror image: they are never shown talking directly to each other.<br><br>The symbolism of it all is clear. In 'L'Amant Double', lead character Chloé is in love with twin brothers. At least, that's what she thinks. And that's what we think. Unless the twins are really two sides of the same personality. But two sides of which personality exactly? His, or a projection of hers? What is real, what is imagined? Director François Ozon plays the game of mirrors perfectly, and keeps it up until the very end. When you think it's all clear, there are still some strange things. Which one of the twin brothers was the smoker again? <br><br>The film is very stylish. Ozon has made the most of the locations. In the museum where Chloé works as a guard, outrageous art is being exposed. It's a perfect backdrop for some visually beautiful scenes. The clothing, the hairdo's, the furniture: everything is done in the best of Parisian tastes.<br><br>There's much to enjoy in 'L'Amant Double', for different kinds of moviegoers. It is a thriller of some sorts, with the suspense building up until the last few minutes. It's also a psychological drama, with lots of twists and turns. And in the very end, there's even a little bit of horror. But overall, this is a very French film, with some kinky scenes and a nice amount of Parisian elegance.","user":"rubenm","rank":[61,85]},{"title":"Not nearly as smart as it thinks it is","rating":5,"date":"16 June 2018","review":"From prolific French auteur <a href=\"/name/nm0654830/\">François Ozon</a>, L'amant double is partly a study of sexual obsession, partly an oneiric mystery (think <a href=\"/name/nm0001403/\">Neil Jordan</a>'s <a href=\"/title/tt0120710/\">In Dreams (1999)</a>), and partly a conventional thriller (more whoisit than whodunnit). \"Freely adapted\" from <a href=\"/name/nm0643093/\">Joyce Carol Oates</a>'s 1987 novel Lives of the Twins (published under the pseudonym Rosamond Smith), and written by Ozon and <a href=\"/name/nm0681350/\">Philippe Piazzo</a>, the film tells the story of Chloé (<a href=\"/name/nm4297691/\">Marine Vacth</a>), a woman with a fragile mental state, who falls passionately in love with her psychoanalyst, Paul (<a href=\"/name/nm0753737/\">Jérémie Renier</a>). Within a few months, she has moved in, however, as time goes by, she slowly starts to learn of a significant part of his identity which he has been concealing.<br><br>Imagine, if you will, <a href=\"/title/tt0052357/\">Vertigo (1958)</a> remade by someone like <a href=\"/name/nm0637615/\">Gaspar Noé</a> or <a href=\"/name/nm0001885/\">Lars von Trier</a>, and you'd be some way towards getting a handle on Ozon's latest; completely barmy (you know you're in strange territory when the second shot of a movie is, quite literally, an internal shot of a vagina). As one would expect from Ozon, the aesthetics are solid - the film is built upon an inventive visual style employing juxtaposition, pseudo-split screen, and copious amounts of shots with one person in the frame proper, and the person to whom they're talking only visible in reflection. The sound effects are also excellent and really jolt you out of your seat on a couple of occasions. Similarly, the acting is strong, with Vacth and Renier unrecognisable in their respective roles.<br><br>However, the melodramatic and self-congratulatory plot is an absolute mess. Many of Ozon's standard tropes are here; a dissection of the academic middle class/intelligentsia, an examination of the schism between appearance and reality, an attempt to elucidate the mind of a complex woman, a psychoanalytical bedrock, the mutability of identity etc. But it's all diffused through an utterly farcical narrative, which fails to get even the basics right. For example, sex is a central theme, but by the time we get to the fourth or fifth sex scene, it has completely lost its potency (compare, for example, the infinitely superior <a href=\"/title/tt2278871/\">La vie d'Adèle (2013)</a>, where sexuality is just as central, but which features only two sex scenes). The same goes for the increasingly ridiculous plot twists, once you get to three or four and you're still in the first half of the movie, you just stop caring. Ozon has always been hit and miss, for every <a href=\"/title/tt0157044/\">Sitcom (1998)</a> and <a href=\"/title/tt0324133/\">Swimming Pool (2003)</a>, there's an <a href=\"/title/tt0783767/\">Angel (2007)</a> and a <a href=\"/title/tt1189076/\">Ricky (2009)</a>, and L'amant double is, in the end, a rather pointless film that seems to think it's saying something exceptionally profound about desire and identity. It isn't.","user":"Bertaut","rank":[25,34]},{"title":"Twice as much ...","rating":8,"date":"11 April 2018","review":"Or only half of what you might be getting ... which actually may ring true to those dissapointed in this. The movie really sucks you in and you have to think and figure things out. Answers may be there (or not), but you have to look closely and maybe even watch it more than once to really get what the director wanted you to see.<br><br>Having said that, this is really suspensful from start to finish. It keeps you guessing and whatever the answer is you can embrace that or be annoyed. It is very well made and if you don't mind nudity and adult situations, you won't be freaked out by that part of it. It's also important to understand the main character and her journey","user":"kosmasp","rank":[14,19]}]