[{"title":"What werewolves?","rating":1,"date":"1 April 2018","review":"I was hoping for some werewolve action. Unfortunately by the time you see any the movie is almost over. Also the action is not really there. I am a B-movielover. I can easily take poor effects and see the humor in it. This movie doesn't. It steals lines from 'full metal jacket' and changes them in some words. It steals from 'Inglorious basterds'. If you see fat concentrationcampvictims, roadblocks that you can drive around at but don't do, english with a bad german accent, german with a lot of words spoken wrong and macho men then you know it is better to spend you time and money on something else.","user":"sandvink","rank":[9,9]},{"title":"It Is not a Trash Movie, It Is Garbage","rating":2,"date":"5 March 2019","review":"The cover of \"Werewolves of the Third Reich\" is highly attractive and promising - and that is all. The film is not a \"trash movie\" (such as \"Braindead\", \"The Toxic Avenger\" or \"Piranha\") but a complete garbage. The story and the screenplay are laughable in the bad sense. The cast is ridiculous, highlighting the ham Lee Bane, an annoying \"actor\" with terrible accent. Nothing works in this movie, the special effects are worst that those from the Sci-fi Chanel and the mask of the werewolf is terrible. See the DVD cover and forget the flick. My vote is two.<br><br>Title (Brail): \"Lobisomens do Terceiro Reich\" (\"Werewolves of the Third Reich\")","user":"claudio_carvalho","rank":[11,12]},{"title":"An HONEST review","rating":1,"date":"20 December 2017","review":"This is one of the worst movies of all time, and I use the word 'movie' generously here. And before I continue I would like to point out that I am a huge fan of the Asylum movies so I am no film snob.<br><br>I'll only talk about the first 20 mins of the film because if I write any more, I will lose the will to live. <br><br>So what happens in the first 20 mins? Absolutely nothing! No, I mean it. Nothing. Sure there are a couple of scenes but there is absolutely no point to them. We get to learn that some prisoners (more later) are going to have drugs tested on them and that's it. 30 seconds of 'important stuff' in 20 mins.<br><br>My most enjoyable bit? Overweight concentration camp prisoners. I don't think the makers of the movie studied WWII history. <br><br>The makers don't seem to know anything about Jews either since the biggest, fattest prisoner has a huge tattoo on his chest. It is pretty common knowledge that Judaism still frowns on tattoos and 70-odd years ago things would have been much stricter.<br><br>Second favourite bit? The actor chosen to play Hitler - the only prerequisite being the ability to put on a moustache as far as I could see. I look more like Hitler and I'm 6 foot, balding, and fat.<br><br>I would like to suggest watching it for the comedy value but Sharknado 5 this ain't. It is not even funny bad. It's just bad. <br><br>Rather than spend 1 hour and 34 mins watching this 'movie', I would suggest that members of IMDb use the time more wisely. I won't give any suggestions. Literally ANYTHING would be time spent more wisely.","user":"ensorgiles","rank":[23,29]}]