[{"title":"One of the best korean films I've ever watched!","rating":8,"date":"22 February 2020","review":"My opinion--- Pandora is a catastrophe film, written and directed by: Park Jeong- woo, even if there is not an original scenario, the film is still very well realized, we feel well the idea that wanted to develop the Director with this film mainly making attention to the serious nuclear accident of Fukushima Daiichi \"Japan\" in March 2011. In staging this reconstruction of the facts he wanted to make the attention that with all the nuclear power plants of his country , That such a catastrophe could one day come if we did not take all the resolutions of security and prevention for maximum protection of the people of South Korea. It is frightening to see all the damage and consequences that such catastrophes can have on the inhabitants and even on the whole human race. Even if the special effects do not live up to the film, it is nevertheless a very good film witnessing this kind of accident and these serious consequences.","user":"MR_Heraclius","rank":[37,38]},{"title":"Mind blowing","rating":9,"date":"18 March 2017","review":"This movie is nothing new about the script, even the story is striking familiar with the Japanese people. This movie retell the story of Fukushima Daiichi Nuclear Powerplant disaster with Korean adaption. However, the actors/actress and director deliver a emotional, heartbreaking story with a sense of reality. The heroism acts is not just random actions, it is a sense of responsibility, love and a clear mindset. I believe, this movie should pay tribute to Fukushima 50, the name of the group of volunteers that stay and handle the situation within 20km zone around the Fukushima Daiichi plant.","user":"tranvanminh","rank":[51,67]},{"title":"Not a waste of time at all.","rating":7,"date":"20 February 2017","review":"This movie clearly deserves a 7 or 8 out of 10. You can already guess the story. However, the acting was mind-blowing. A movie that's simple but speaks out the truth of such harsh experience or possibility. I personally recommend to watch the movie with family (not kids if they're not used to violent movies). Don't miss it out. Great watch with loved ones.","user":"florapax","rank":[45,63]}]