[{"title":"Don't be misled by the negative reviews here for this movie","rating":8,"date":"19 January 2018","review":"Just came back from the one time only screening of this movie in Austin TX. I'm a bit confused by the super-negative reviews of this film. I guess people were expecting a film on par with past Studio Ghibli movies? Lets be real here, as sad as it is, the age of Studio Ghibli is over, unless Hayao Miyazaki decides to return to the directors seat and make another full-length feature film. Which at this point seems unlikely. The fact that we have a studio like Ponoc to carry on the torch of 2D animated projects in the style of Gibli should be celebrated I think. <br><br>I went into this movie not expecting it to be on par with any of Studio Ghibli's past works, yes it's no Howl's Moving Castle or Spirited Away. I did enjoy Mary and the Witch's Flower more so than Miyazaki's last two films, The Wind Rises and Ponyo. The only other Hiromasa Yonebayashi films I've seen was Arriety, never saw When Marine Was There. I do think this film is better than Arriety was.<br><br>Mary and the Witches Flower looks like a Studio Ghibli film, the character animation is really great, the backgrounds, while reminiscent of past Ghibli works are nice, but not on the same level of detail, which was fine to me. The characters and the story is good, again, not as solid as past Ghibli works, but I enjoyed it overall. The biggest thing lacking to be was a musical score from Joe Hisaishi, but he has never done music for a Hiromasa Yonebayashi film. The last film he composed music for was The Princess Kaguya, which was a big deal. <br><br>I'm getting off-track here, but the last I will say is that is if you are a fan of Studio Ghibli, and are yearning to see a full-length feature film in traditional 2D animation, go see this film if you are able to, just don't go in expecting it to be as good as one of the Studio Ghibli classics.","user":"Chickengirl001","rank":[71,83]},{"title":"Not perfect, but gorgeous, enjoyable and delightful nonetheless","rating":7,"date":"8 July 2017","review":"This is such a nice film. With a fun and imaginative story surrounding pleasant characters, all set to the backdrop of yet more incredibly beautiful animation, Mary And The Witch's Flower is the perfect film to get you smiling within an hour and a half. It's not perfect, occasionally struggling with pacing issues and a lack of character depth, but on the whole, it's a wonderfully enjoyable and uplifting watch from start to finish.<br><br>What's most important to note about this film is that it's not a Ghibli movie. Although directed by Hiromasa Yonebayashi, who made Arrietty and When Marnie Was There, as well as bearing huge resemblances to Ghibli in animation style and genre, there are some key differences that set it apart from just being another Studio Ghibli movie.<br><br>Above all, the type of story that we see unfold in this film differs somewhat from what we've been used to from Studio Ghibli. While Ghibli dealt more often than not used fantasy stories to deal with some very deep themes and create intimate and engrossing watches, Studio Ponoc, the company that makes this film, has gone for something a lot more pure and family-friendly, in a similar vein to the likes of My Neighbour Totoro or Kiki's Delivery Service. In that, it's a little more similar to Disney's storytelling style, although thanks to the beautiful animation here, Ponoc stands out well as its own.<br><br>And if there's one thing that is so brilliant about Mary And The Witch's Flower, it's undoubtedly the animation. Not only does it bring back the mad and imaginative worlds that Studio Ghibli have transported us to so vividly before, but it shows another step in this style of anime that adds significantly to the visual beauty throughout. So, while we still have the gorgeous hand-painted scenery backdrops portraying the lush English countryside, there are some scenes that venture closer towards the photo-realistic style of animation that many other anime films have taken on board in recent years, yet has never been a choice of Studio Ghibli's.<br><br>As a result, you get the warm and delightful feel of a Studio Ghibli movie, but there's still even more eye-popping visuals throughout to make it seem all the more impressive, and with its fantastically colourful palette that brings the fantastic world to life, it's a vivid and visually gorgeous watch from start to finish.<br><br>Moving on from the visuals, Mary And The Witch's Flower also succeeds in delivering a properly entertaining story from start to finish. It's not a repeat of Kiki's Delivery Service as some have suggested, but rather based on a famous English story called The Little Broomstick, and it's a hugely enjoyable watch throughout.<br><br>There are times when the wizarding world it dives into strays a little too far into Harry Potter territory, occasionally getting a little bogged down in magic jargon, but on the whole, it's a story about a young girl finding her confidence in the most extraordinary of ways, and given that we have such a likable protagonist in young Mary, it's a delight to follow her along on this magical journey of a lifetime.<br><br>In general, the film works really well to give you a fun and pleasant watch from start to finish, although it's not completely perfect, given that it really struggles to build a beautifully calm and intimate opening act with something a little more Disney in the middle and early third portion, frustrated by a jarring change in pace on a couple of occasions.<br><br>With all that said, however, I had a wonderful time with Mary And The Witch's Flower. It's a visually beautiful movie that you'll be marvelling at from start to finish, thanks to the incredible animation from Studio Ponoc that steps up Ghibli's legacy by another notch. Its fantastical and storybook-style atmosphere makes for a lovely watch throughout, featuring a delightful protagonist and various mystical worlds that will undoubtedly have you smiling right to the finish.","user":"themadmovieman","rank":[36,42]},{"title":"The Spirit of Studio Ghibli Lives On In This Delightful Fantasy Adventure","rating":8,"date":"29 January 2018","review":"Based on the 1971 children's novel The Little Broomstick by Mary Stewart, this anime fantasy adventure is a satisfying debut from Studio Ponoc that manages to carry on the glorious legacy of Studio Ghibli.<br><br>Founded back in 2015 by producer Yoshiaki Nishimura in the aftermath of Isao Takahata (Grave of the Fireflies, The Tale of the Princess Kaguya) and Hayao Miyazaki (Spirited Away, Howl's Moving Castle) announcing retirement and Ghibli moving away from feature film animation; MATWF crew members consists of the director behind The Secret World of Arriety and the wonderful When Marnie Was There Hiromasa Yonebayashi along with several ex-Studio Ghibli animators.<br><br>So if you saw the trailer and wondered to yourself \"This looks really Ghibli-ish?\", that is because MATWF is essentially another Studio Ghibli release in all but name.<br><br>Everything that was great about Ghibli is still present from the colorful crisp animation, to the gorgeous spacious shots of countryside landscape, the magical castle serenely floating in the sky, it's well-developed and relatable young female protagonist and technology vs. environmentalism themes, although this time magic is used as a metaphorical substitute for technology.<br><br>One criticism that could be leveled at this film is that it almost echoes Ghibli too much. Longtime fans will easily be able to spot elements from Kiki's Delivery Service (focus on magic and witchcrafts, Mary's black cat), Castle in the Sky, Howl's Moving Castle (Madame Mumblechook office) and Spirited Away along with other films such as Harry Potter (magic school setting) and even Willy Wonka and the Chocolate Factory.<br><br>Although given this is Ponoc's first movie and thus their initial flagship title (their logo consists of an image of the title character), I can understand why the filmmakers felt compelled to play things close to the chest this time. Hopefully for the their next set of feature films we will start to see more experimentation in the vein of Only Yesterday, My Neighbor the Yamata's, Whisper of the Heart, and The Tale of the Princess Kaguya.<br><br>In the meantime, MATWF is a fantasy action adventure of the highest order that can be enjoyed by individuals of all ages.<br><br>From the opening sequence alone portraying a young witch making a high-flying escape from an exploding castle in the sky while dodging shape-shifting henchman, the movie does a really good job of hooking the audience in with awe-inspiring spectacle and unique visuals. Admittedly the film does slow down a bit during the first twenty minutes when it's introducing Mary and her ordinary country-side living; but once she discovers her flying broom and is transported to Cloud City Hogwarts, it's a delightful adventure that features unique interpretations of old Ghibli themes.<br><br>The pacing is gentle but brisk and there is a great sense of danger amidst the wonderment, which is further enhanced by some splendid comedy gags such as the mishaps pertaining to Mary's magic powers and a certain running joke involving a monkey.<br><br>Takatsugu Muramatsu returns from Yonebayashi's previous film When Marnie was There to provide another fantastic melodic score. It complements the graceful visuals like bread on butter and has a great neoclassical European vibe with it's use of string instruments and flutes that perfectly goes along with the film's more adventure movie tone.<br><br>It's certainly far from the level of Ghibli's masterpieces (Castle in the Sky, Spirited Away), I personally did wish for more world building and Peter, Mary's male companion, sadly goes under-developed with the \"sick mother\" plot point never having a payoff.<br><br>However, as a longtime admire of the work done by Ghibli and it's crew, seeing this movie for it's one-night only showing at my local Marcus Cinema was a great experience, especially when seeing it in a theater packed with moviegoers both young and old.<br><br>I look forward to what Studio Ponoc will release next!","user":"nbfcblog","rank":[24,28]}]