[{"title":"Touching, funny, relevant","rating":10,"date":"3 June 2017","review":"This is my first review on IMDb. I got a chance to see this film at Sundance London and it was so incredibly inspiring that I felt this film must be seen by people. Sadly this screening coincided with Trump pulling out of the Paris climate change deal, which makes this film even more important.<br><br>The director Jeff Orlowski and his crew embark on a quest to document and show the audience how quick and devastating the effects of global warming are on the coral reefs around the world. <br><br>The documentary has funny laugh-out-loud moments, takes us on an emotional journey where we see how deeply the filmmakers care for this subject, but most importantly it brings the message home - that things are changing and something needs to be done. A fantastic, motivating and hopeful film that is 100% relevant to the issues we face today, not to mention the stunning cinematography 10/10","user":"re_incarnate","rank":[24,27]},{"title":"The 6th Mass Extinction has begun","rating":10,"date":"16 July 2017","review":"This important documentary serves as a wake up call to deniers of man made climate change and also to those who just don't see the need for concern. It takes the time to teach us about basic coral anatomy, their reliance on zooplankton, and then chronicles the surging ocean temperatures and the direct correlation with the death of entire swaths of reef. This film will make you cry as it makes you come to grips with the reality of climate change. Watch it, and then share it with others too, to help educate those too distracted to understand the calamity we're witnessing.<br><br>While it doesn't go into ocean acidification, that is where I'd challenge the viewer to explore next. It's not a counter theory, but rather the two are interrelated.","user":"karlealdinger","rank":[17,21]},{"title":"Let's just destroy everything on this planet and just don't do anything about it.","rating":7,"date":"16 June 2018","review":"Chasing Coral should be an eye opener for everybody, but that would only work if everybody watched it, especially influent people that have to take big decisions. For people that continue to deny global warming is going on. Unfortunately those influent people, like are so-called 'world leaders', could not care less about all this, because greed, destruction and world domination is their only goal in life. The documentary starts slow, with some good footage but also some blurry archive footage. It's all interesting to watch though. But the best part, if I can say best in this case, is the ending, and i's not that colorful anymore. We, the humans, the so-called smartest specie on earth, are in fact the parasites of our planet, destroying everything at high speed. If the coral reefs are bleaching it's all our fault, and if this eco system dies in the next decades it will be our fault as well. The end of the documentary wants to give us a bit of hope, but honestly I don't believe in it. We are doomed to go from bad to worse, as greed and selfishness are the only goals of us humans. So Chasing Coral is a good documentary, but a sad and emotional one. It should be mandatory in schools or for everybody to see, so that maybe we would change our attitude, but that's just wishful thinking. The future generations will pay the price for our neglect and destruction of our once lovely planet.","user":"deloudelouvain","rank":[8,9]}]