[{"title":"Yet Another BAD Movie with FAKE Reviews","rating":1,"date":"10 February 2019","review":"Take notice that before my review all the written reviews are 10's while the movie's aggregate score is 5.5. How does that happen?<br><br>Only one way -- fake reviews.<br><br>It's disgusting that this goes on.<br><br>Well here's a real review -- the movie is horrible. It's slow and very poorly directed. VERY.<br><br>In fact, the direction is amateurish at best. Like High School.<br><br>The writing? Idiotic. It's written like the writer never got beyond 5th grade.<br><br>It's a pathetic low budget pandering piece of garbage","user":"arfdawg-1","rank":[14,27]},{"title":"Suesan Sarandon touches you","rating":7,"date":"31 October 2018","review":"For me, the movie does not let down. Susan Sarandon plays a nurse whose son's a freelance journalist who gets kidnapped, while in Syria and she struggles to do what needs to be done to get him back.<br><br>It would be a Lifetime movie of the week if it was not for Susan Sarandon's involvement, and it really helps. Such a fine actress portraying the frustration of a woman who's son has been missing for three months and it seems like her government is not doing anything and she's not sure if an alternative that was given to her (the Viper Club the pulls their resources together in order to pay ransoms for kidnapped people the government will not help) will work.<br><br>It's also different from Lifetime as the movie is a real downer, but Ironically that's what makes it good.","user":"subxerogravity","rank":[12,26]},{"title":"susan does this brilliantly","rating":10,"date":"26 January 2019","review":"This is a 100% drama movie, there are absolutely no comedy and no action. its a story of heartbroken life driven by the magnificent acting by susan sarandon and the rest of the cast making viper club worth to see.<br><br>its a dramatic film about a mothers loss, having a son that has been captured by the ISIS in syria somewhere, and about her actions made to try to set him free, through official channels,that are not so helpful, then through unauthorized organisations,to try to make contact with the captors and to try to pay him out , which officially comes in conflict with u.s antiterror laws,that ssay that if you trry to bail out someone held by a terrorist organisation,you can face legal actions and be found guilty for supporting the organisation financially , aka supporting terrorism. god forbid that happening to my children, its a terrible nightmare for sure.<br><br>mrs sarandon do really stretch her talents to the limits in this drama, the longing, the dispair, the desillusions, the fatigue,and most of all the helplessness are so exclusively done.. if you wanna have a taste of true hardships of life do watch this movie. highly recommended.","user":"ops-52535","rank":[9,21]}]