[{"title":"Fails to grasp ideas beneath the surface","rating":4,"date":"8 September 2017","review":"After the suicide of his father, a withdrawn young man travels to the family home on Sway Lake to retrieve a valuable record, only to encounter his shrewd grandmother with the same aim.<br><br>As the many shots of Sway Lake itself reveal, this feature debut from director Ari Gold regards nature as a thing of beauty. Alas, what this film never manages to achieve is sharing a greater fondness for the characters and the drama before us.<br><br>Bursts of Kerouacian hedonism and chauvinism from Ollie Sway (Rory Culkin) and his thrillseeking Russian friend Nikolai (Robert Sheehan) make way for a more melancholic film upon the arrival of Ollie's grandmother Charlie (Mary Beth Peil), who is looking to sell off the property. There is much focus on what once was, and a nostalgia that threatens to blinker the present for generations young and old.<br><br>Charlie and Nikolai are the most interesting characters and have an engaging interplay as each is fascinated by a romanticised version of the other. Unfortunately, there is very little for them to actually go out and do together, putting this subplot in circles for much of the film.<br><br>There is at least a little complexity to Charlie, who is at once cruel to those close to her and wistful for a lost husband and a lost era. A great hindrance to The Song of Sway Lake is its lead character Ollie being totally bland, and neither he nor his relationship with local girl Isadora (Isabelle McNally) is of much interest beyond bemusement that she would give such a weedy voyeur the time of day.<br><br>At the core of the story is a hunt for a fabled record of much value, recorded and named after Sway Lake. Ollie is convinced his recently deceased father would've wanted him to have it as a work of art, while Charlie wants it purely for its monetary value. Charlie is the only surviving person to have specifically been left the Sway Lake record; how Ollie has any actual claim to it is one of the many things never fully delved into. Perhaps more interesting than this tired trope is Nikolai, who appropriates the Sway family history in substitute for his own lack of one.<br><br>Unfortunately, there are only so many ways you can film someone looking through troves of vinyl, and the film meanders through them. This is a real shame as a soundtrack of Cole Porter and Fred Astaire show Gold's passion for music, which is also reflected in the attitudes of the Sway family, but a character's obsession with grading records is equally as unwieldy cinematic material.<br><br>There seems to be an awareness that some of the film may struggle to capture an audience's attention, yet the nudity sprinkled throughout Sway Lake smacks of desperation. Particular focus is on Nikolai's body, and while the man is undoubtedly beautiful, it's hardly a substitute for an engaging plot line.<br><br>Sway Lake is about time standing still and always moving, preserving the beauty of nature, the selfish joy of youth, the untouchable essence of love. There are many ideas present; perhaps too many for much of it to really resonate. Two affecting moments perk up the film in the final act, but ultimately cliché and melodrama sink the ship.","user":"TwistedMango","rank":[17,25]},{"title":"Bitter happiness.","rating":10,"date":"22 May 2019","review":"From the first time it is difficult to say what exactly is meant in the film. Is it about the collector and his search for the record? About how a person finds love? Or is it a story about the past, present and future? Everyone will find in the picture its meaning. The meaning that is close to you.\nThis film immerses you in a world far from the hustle and bustle, where everything lives its unusual and unique life. Light melancholy about summer and childhood, about the time when the world was completely different. The action takes place slowly, giving us a feel for the atmosphere and characters. It doesn't make you bored, it makes you dive into the movie again and again.\nFor me it was a story about the past, a painful and sad past that does not allow me to forget about myself. The story of Ollie, who lost his father-the only person who understood him. He wants to find something special for him. The story of Nikolai, who is looking for wealth, but finds something completely different. He faces the fact that not everything can be stolen. The past cannot be returned, history cannot be rewritten.\nEach of the characters is afraid to meet with himself, to reveal himself and his feelings for others. You will remember the story for a long time after viewing, go back to it again and find something new.\nMany thanks to the whole team for this incredible story and emotions experienced during the viewing. Such a vivid and sensual film a great rarity now.","user":"kuchelbeker","rank":[4,5]},{"title":"Song of Sway Lake - A Shimmering Nod to Reminiscence","rating":9,"date":"21 December 2017","review":"Sway Lake and summer go together like sun and hammocks .. or martinis and olives. Ari Gold's The Song of Sway Lake was actually released on June 21, the first day of summer! Location? A swanky lake house in the Adirondacks -- a dazzling paradise for swell-egant parties of the New York jazz-age upper crust. <br><br>Sway. It's not a common word but it conjures up sensual images of hips, dancing, bourbon and Gershwin. It could mean swing, undulate, guide, persuade. From the opening, rather erotic, underwater scene, The Song of Sway Lake blends the dreamy and the realistic, the mystical and the practical, blurring the lines between the ephemeral and the concrete, the past and the now. The first plunge into the lake is both a dip into misty memory and a crisp splash to erase it. <br><br>The cinematic period piece makes the viewer feel as if he/she is floating back in time...hearing the silver tones of Ethan Gold's mesmerizing melody, crooned by both John Grant and the Staves (Andrews Sisters reincarnated) is almost like being drawn in by the Sirens -- only we're not in Ancient Greece. We're not even in the 1940's. We're back in the 1990's...but completely sweetened by reminiscence.<br><br>In fact, reminiscence permeates the film, from plot to soundtrack. From the opening montage, one feels the pull (dare I say sway) of a time gone by, hovering in a '40's haze. Ethan's music is as haunting as the film - it's a blend of misty and crisp. Cole Porter or Ethan Gold ? The soundtrack title song wafts through the film with charcoal smokiness. I truly can't get the Song of Sway Lake melody out of my head -- nor do I want to. It's totally addictive and liquid like the lake, yet solid like a long-lasting sliver of art, rock or humanity. <br><br>As I see it, there are two types of people: those who are nostalgic and those who aren't. Proust nailed it with his Madeleine moment. With Song of Sway Lake, filmmaker Ari gold and twin brother, composer Ethan Gold appear to be members of the former club. A maestro of cinema, Ari paints the screen with wide, elegant brushstrokes of memory, sprinkled with speckles of here-and-now. <br><br>Plot? Jazz music collector Ollie Sway (the soul-searching, fiery Rory Culkin), grandson of Charlie (divinely timeless, elegant Mary Beth Peil), the owner of the magical house on Sway Lake, is on a mission to find a valuable record -- the only pressed 78 recording of her wedding song. He enlists his rough-around-the-edges Russian drifter friend (charming Robert Sheehan) to help steal the record from his wealthy grandmother 's estate. There's even a rather enchanting if offbeat, romantic seesaw sway between Charlie and her grandson's comrade.\nTheme? The tug between grasping tidbits of our past, archiving our detailed lives vs. letting go, living in the present. Style? Eric Rohmer meets Wes Anderson.<br><br>The Brazilians think that melancholy and bliss are connected. Perhaps the Gold brothers are part Brazilian --the translucent lake scintillates with the fragility of life and the permanence of death -- the fascination with murkiness and fear of finality. <br><br>Ultimately, Song of Sway Lake glistens. Like our lives, it is layered with dissonance and harmony, raw in texture. It is both evocative and haunting.","user":"randeemia","rank":[7,15]}]