[{"title":"Fireworks is significantly simple and dissatisfying in terms of plotting compared to the wondrous visuals displayed","rating":5,"date":"24 November 2017","review":"Despite the baffling title, Fireworks, should we see if from the side or bottom? is very much a simplistic tale about two young star- crossed lovers with a magical gimmick thrown into the narrative. Though it's essentially a remake of a 50-minute live-action TV movie made in 1993 by Shunji Iwai (Love Letter), fans of last year's megahit, Your Name will be curious to check this one out.<br><br>Norimichi (Masaki Suda from Gintama) and Yusuke (Mamoru Miyano) are two best friends who both developed a crush on their classmate, Nazuna (Suzu Hirose from Let's Go, Jets!). With the intention of eloping with the one she loves on the night of the annual fireworks festival, Nazuna has quietly chosen Norimichi to be the fateful one. However, Nazuna's plan is thwarted by her mother and Yusuke until Norimichi figured out the only way to escape is to make use of the strange orb which Nazuna has picked up from the beach earlier.<br><br>Last summer, Makoto Shinkai's hit body-swapping, time-travelling animebrought a new viewing experience especially to non-anime fans. Your Name was funny, throughlyengaging from start to finish and utterly touching. No doubt, Fireworks attempt to embark on the same formula though this time, the narrative is tedious, repetitive and mostly frustrating to last a mere 90 minutes.<br><br>The title refers to a running gag by Norimichi and his group of class buddies, a pointless argument about whether fireworks are round or flat when see from the side. It's very much a side gag just like the one about their form teacher's bust and her underground relationship with a fellow colleague. The gist of the story revolves around Nazuna, the torn teenager who refused to move to a new place with her mother who is remarrying for the third time. <br><br>The strange magical orb is an unexplained gimmick or device to allow Norimichi to relive the day with Nazuna else there wouldn't be much of a story to tell. By throwing the orb into the air, Norimichi is able to turn back time and changed their ending. The time spent with Norimichi and Nazuna however happened to be the most meaningful aspect of the anime as we get to learn more about the struggle and backstory of Nazuna, an angst teenager who dreams of leaving her current state to be a pop idol and wondering if she is following in her mother's shoes as she eloped with Norimichi.<br><br>Unfortunately, the narrative makes little effort to delve more into it and instead of giving the story a more rounded emotion feel, the anime is contend in delivering outstanding visual and breathtaking effects and colours especially during the fireworks climax. It's definitely a good thing for SHAFT Studio which is renowned for their acclaimed technicalities though not anyone will appreciate the blending of 3D objects and traditional 2D animation.<br><br>After two recent satisfying animes, Your Name and A Silent Voice, Fireworks turned out unexpectedly to be a huge disappointment. Suzu Hirose is pefect as the voice of Nazuna, Masaki Suda on the other hand sounds way mature for a junior high student. I for one have no problem with the sometimes photo-realistic often visually striking animation and the mesmerizing theme song by DAOKO. It's the somewhat disjointed and unfulfilled message that disappoints.","user":"moviexclusive","rank":[26,28]},{"title":"Plenty of potential unrealized","rating":5,"date":"6 July 2018","review":"I just saw this screening in it's limited run in the USA. The movie was subtitled for me, so that is what version I will be going off of for my review.<br><br>Plot overview: \nThis film tells the story of a schoolgirl who finds a pretty transparent ball by the sea, on the day of a fireworks display of a religious festival in a seaside town in Japan. She plans to run away from home to escape from her unhappy home, as her mother is about to remarry for the third time. However, her escape fails until her male classmate finds out the supernatural power that the transparent ball has.<br><br>Plot review:\nThe story had a lot of potential had it been executed better. The perspective shifts from multiple people (Yusuke, Nazuna, Norimichi) to almost exclusively Norimichi by the half way point. The \"time travel\" ball was not explained (and never is) and it begins to affect the world (certain things don't appear as you would expect them to, and at the end at one of the final iterations, the world is very distorted). But none of that is explained, none of the details about the worlds they are in or the repercussions of using the orb are discussed (besides the altered effects of their surroundings, people seem unaffected). The end is abrupt and doesn't really address the importance of the character plots they tried to develop. The film couldn't decide if wanted to be a sci-fi movie, youth romance, or coming-of-age, and tried and failed to be almost all of those at once. It's unfortunate since Your Name., while not a perfect movie, found a way to balance all three of those items from both a male and female perspective. Fireworks unfortunately couldn't handle any of them well. <br><br>Characters:\nThe characters in the boy group are initially very off-putting with their first introduction being them arriving at school and discussing girl cup sizes and their teacher's large breasts, eventually discussing how one will get an up-skirt panty shot of their teacher as a prize for their bet about fireworks. It's probably meant to come off as \"oh those silly boys\" but in the current climate (at least in America) it came off as crass and made me dislike the boys initially. After that, they really don't seem to do anything devious and are generally tame, so not sure why they focused so much on their sexual deviance as the first point of introduction as if that was a big issue their group would have to answer to or learn about (never happens). <br><br>Nazuna appears to be an enigma early on but later on just becomes some naive princess who thinks she can run away as a youth and make it as a pop idol in Tokyo or hostess at a club. It's clear she isn't completely serious about it, but they devote so much time to her talking about it that it doesn't come off as a thought in jest, but as an honest plan for what she'll do if she can run away. Had they stuck to the \"I just want one day to make memories\" the movie would have made a much bigger impact. <br><br>Norimichi is fairly bland and doesn't have a lot of character besides seemingly trying to do the \"right\" thing in most cases, or at least what he thinks is the right thing. There is very little story or character development given to him and he actually is just a tool to keep the story going by resetting the time with the orb and changing plot points as he and Nazuna try to run away (at least for a little). <br><br>Yusuke appears to be a main character but by the half way point he is nothing more than \"one of the boys\" and has very little contribution to the story / group dynamic besides being mad that Norimichi is with Nazuna (since Yusuke likes Nazuna too). <br><br>Animation: \nI liked the overall animation (high quality, good colors, clean) but it's use of CGI in random scenes was jarring in some cases like switching from the boys riding down a hill on bikes / skateboards / scooters in traditional anime style and then arriving at school in a CGI rendered in anime style. They also show a lot of scenes in purely CGI like the school staircase, over and over, which, again, is jarring when the rest of the scenes are not CGI (at least in that same style). There's also a very odd scene about Nazuna singing and transporting herself and Norimichi to a princess land with very poorly executed CGI. Overall had the movie ditched the CGI many of the scenes would probably have had better impact and been less distracting. Other than a few scenes of poorly used CGI, the animation is great and very pretty to see (like the CGI fireworks, which blended well with the animation). <br><br>Other:\n<ul><li>The movie has some symbolism that is a little on-the-nose like a light bulb with filament that spells out \"IF\" and the town being called \"moshimo\" which is Japanese for \"if\". </li><li>Some of the discussions are repeated over and over and over and over.... like asking whether fireworks are round or flat when viewed from the side. It's a wasted discussion and if they were going to repeat it, could've done so with a different spin, more stylized, or found a way to make it mean more than just understanding that the ball flattens fireworks and round things the more that it works. </li></ul><br><br>Overall:\nWhile most of the things I said have been negative, it is still an enjoyable movie when taken at face-value, it's just far short of what it could have been given the premise and those involved. Had they fixed the ending, added some scenes explaining the ball and what it does (alternate dimensions? time travel? dreams?) and developing the main characters better, the movie could've been much better.","user":"boojitsu","rank":[20,21]},{"title":"Pretty but disjointed","rating":4,"date":"23 February 2018","review":"Uchiage Hanabi, Shita Kara Miru ka? Yoko Kara Miru ka? is the newest entry in the new anime film era started with Kimi no na wa, which follows similar trends: high school years, romance, comedy and melodrama, time traveling and striking visuals. However unlike Your Name, Fireworks is very weak in many aspects. It's not a bad movie by any stretch but certainly not good one either. <br><br>The movie suffers for the most part for three problems.<br><br>The orb gimmick: a supposed mcguffin, which the main character uses to travel through time and returns to an specific point. It is never explained or detailed where it came from, why it works that way and why it can travel in time since is just a firework. This also leads to a world building problem, anime movies tend to be good on creating and using fantasy elements on modern settings, something american films can't do and thus they heavily rely on historical periods, but this movie can't achieved that at all leading to scratch your head every five minutes. The whole orb issue wouldn't be a problem if wasn't for the ending, particularly the last scene lead to a much more confusing story.<br><br>Not so much melodrama. This has a lot to do with culture differences but, it really is hard to believe the drama of a young girl who makes a huge take on her mother having a new husband. Now, there was an opportunity to explore on possible father issues or her relation to her mother's past but they don't go there at all which makes the conflict rather shallow. Not to mention the main characters rivalry with his best friend and the bid between the boys that goes absolute nowhere. So i guess the whole conflict is Norimichi and Nazuna being together at least a day, and all could have work if it wasn't for the ending, I swear that if i don't included the ending here is for spoiler purposes.<br><br>Animation: Now, the are some good use of computer animation but there are some objects and scenes where it felt underwhelming, mainly some of the human animation and some backgrounds like the school hall or the water, just looks off. The character design with the exception of Nazuma is not very interesting. Something i notice for this new era of anime films is that they tend to have a more tv anime style over a more film style, not sure it's because i'm accused to ghibli or what.<br><br>Besides all the negative towards the movie you'll think there isn't any redeeming qualities, for me at least, but there are a few. <br><br>Weirdness. I know it was not done in purpose at all but there is something about this tone, that i kind of absolutely love on how sometimes Japanese filmmakers tend to exaggerate even the most mundane conflict, making at least a consistent tone throughout the movie. Also this might be as to how a teenager sees the world, as their issues/problems are the most important thing, maybe not the most sympathetic thing but in some cases, relatable. The biggest example of the scene where Nazuma imagines herself as a idol princess it's was so odd i could help myself but enjoy it.<br><br>Animation. Besides my hiccups with it, like always seeing 2d animation is a joy, even if it's not best I've seen i still quite decent. The CGI for the crystal orb it's really amazing, i kind of wish it was the only element in computer animated and the rest in traditional but it's what we have i guess. Finally the colors with the fireworks are gorgeous, the scene where our main couple are together in the lighthouse or the \"climax\" is really breathtaking.<br><br>Score. The musical segments are pretty good sometimes a little exaggerated again going with hyper shallow melodrama of the film so go well the scenery. There are some good songs in here as well.<br><br>Perhaps i'm having a soft spot for it but i did have some fun watching but don't hold your breaths to high for this one, it's not complex, it's no the greatest romance, it's no profound or anything and worst of all the message is all over the place, specially due to that ending. If you don't mind exaggerated anime soap with pretty colors this one's ok but if you're looking for a excellent anime movie, skip this one, you won't lose anything.","user":"disup","rank":[18,19]}]