[{"title":"Awful","rating":1,"date":"19 July 2017","review":"This was a terrible movie: the story line was unbelievable, the acting was stiff &amp; unbelievable! The mother's and daughter's acting was really bad! There was no real emotion! If a mother found out her son was gambling and in deep debt, there's no way she would smile and softly say it's going to be okay! There would be screaming and threat of consequences and getting professional help for him. It was like the daughter was sleep walking throughout and when she was bound &amp; gagged----it was actually laughable! It might have been better with better casting and actors that could actually act!","user":"marsmii","rank":[6,8]},{"title":"An okay time waster but please refrain from that awful dramatic music score continually playing in the background","rating":5,"date":"19 February 2019","review":"Of course there were huge holes in this plot and the inept police and FBI who were responsible for arresting the real mobster were laughable. I found the soccer star daughter Denise (Sarah Grey) most irritating from the opening scene when she starts asking her mother Anne (Cahrisma Carpenter) a continuous stream of endless and curious questions about her mother's activities and receives double talk from Anne.<br><br>Mom and two (2) teenagers lost their father a year ago but they somehow are able to maintain a lifestyle in their multi million dollar estate home on mom's part time jobs of being a hair dresser and casserole maker.<br><br>Most irritating about this made for TV movie was the background dramataic soap operatic music score which had the reverse effect on me to maintain a level of suspense. Really? As bad as I am making this movie out to be, and the dialogue is near bearable it does have a few twists and turns and a happy ending so it is an okay time waster.","user":"Ed-Shullivan","rank":[2,2]},{"title":"Terrible Movie","rating":2,"date":"24 June 2018","review":"Mind boggling that we have such movies being produced in 2016","user":"nyotatimothy","rank":[3,4]}]