[{"title":"Beautifully shot with a thought-provoking story","rating":9,"date":"3 December 2017","review":"Most films now-a-days rarely dear to be pushing the boundaries of the artistic form of cinema. Joachim Trier does this brilliantly by being able to make the viewer experience the same emotions the main character, Thelma, does during the whole movie.<br><br>During this beautifully shot piece, we're taken through a very eventful period of Thelma's life and learn to know her whole backstory, which is thought-provoking to say at least. It's a coming of age story told in a stylistic environment with some well-executed acting performances which makes the characters seem genuine. The viewer is thrown into a whirlwind of emotions throughout the film and as told earlier, Trier is great at making the viewer step into the shoes of Thelma.<br><br>The story is told in a beautiful manner, even though it might seem slow at times for some viewers. However, I reckon the film would've lost a lot of the suspense and tenseness it manages to create if it was shorter and/or faster, as Trier really lets us dive deep into Thelma's emotions.<br><br>Do certainly not hesitate to watch this movie as you will not regret it. Even for those not liking this film as much as I do, it's still a good movie which does not let you down, neither acting, telling or shooting-wise.","user":"kickeeen","rank":[64,83]},{"title":"I want to see it again already.","rating":8,"date":"25 November 2017","review":"I feel like in the future, I might appreciate this movie even more. You really have to respect the ethics of it. Odder, unusual movies are commonly only screened at festivals, so it makes me very happy that this is one that slipped through the cracks and made it to the regular theaters. This is one of the most unique experiences I've had all year.<br><br>It revolves around Thelma, who grew up in a religious household and now is an adult living on her own. She's pretty shy and doesn't know how to talk to anyone at school. One day when she sits besides a girl (who will become very important to the story), she starts shaking and crows crash into the windows. She's having an epileptic seizure. But why?<br><br>Once she starts to have feelings for Anja (with Anja showing feelings back) as well as drinking and smoking (which her parents openly have discouraged), her powers start to spiral out of control even more, having horrifying nightmares and weird visions.<br><br>This is a very nice and slowly paced (in a good way) movie, but \"nice\" does not always equal comfortable. It will make you happy with emotions bubbling up in you, it will scare you one other moment and it will make you very sad. As the movie goes on it gets darker and darker, but instead of delving into full-on horror territory it makes you think a lot, and deals with Thelma getting increasingly emotionally conflicted. Why does she have these powers if they don't do any good for her? Is she punished by her sins or is she punished because she has lived out her life restrictfully? There's an interesting conversation at the beginning, where Thelma makes fun of creationists for believing the Earth is only 6000 years old, and her parents tell her she shouldn't make fun of what others believe and that she doesn't know much more herself about what created the world and what controls it. Thelma feels belittled, like she's been relieved of all sorts of independent expression. Despite this, she apologizes to her father afterwards since she's too afraid to break their rules, that she'll lose her love if she deviates too much from what she's been brought up to think.<br><br>The romance aspect is handled very nicely. It doesn't feel the slightest bit sappy, Elli Harboe and Kaya Wilkins play their characters gracefully, and their scenes together are never bloated by Hollywood esque music, which would remove some of the subtlety.<br><br>Joachim Trier also makes this movie look GORGEOUS visually, you often feel like you're inside of some strange lucid tangible dream world, and whenever scary things occur it's absolutely beautiful to look at.<br><br>It's not suitable as simple escapist entertainment, but if you want something which will make you think about the characters afterwards, not just how well-acted they were, but them as people, then I promise you won't regret it.","user":"mattiasflgrtll6","rank":[68,90]},{"title":"One of the darkest supernatural love stories","rating":8,"date":"16 February 2018","review":"Thelma is a hard film to categorise. It contains everything from drama, mystery, supernatural elements, a bit of horror and is essentially a story about love, self-discovery and the fear it may be attached to it. It is a very slow film but the pace is even enough so it never gets dull or drags. The opening sequence is perfect and sets the tone of the film right from the very first seconds. All the performances are simply top-notch and photography stunning. There is also a bit of symbolism present so you will get your share of food for thought. The symbolism nicely compliments the film, it is not the focus of it and thus does not make Thelma a full on art-house film where you can't decipher or understand what is going on. It is very well written although it is very hard not to think of or compare it to Carrie since there are similarities. <br><br>Everyone who love dark films and stories with haunting atmosphere, good performances and beautiful photography should not miss this one. Recommended.","user":"Lugo1989","rank":[24,33]}]