[{"title":"Inaccurate in many ways but could have been interesting film if it had not devolved into melodrama tropes","rating":18,"date":"18 October 2019","review":"The initial premise isn't too bad. There are some problems. For example when the science on recovering and using A(ancient)-DNA gets better, you aren't going to see these types of experiments in North America, or Europe as in both surveys show a very large amount of resistance. But rather in east Asia where the surveys show a lot more borad public acceptance of human DNA experimentation.<br><br>There is also an issue with the way the Neanderthal's boy's intelligence is dealt with. We know that on broad averages individuals and population groups with more Neanderthal DNA input have better spacial intelligence and comprehension of metaphor and symbol -- not less. In that sense this film inverts the science. Neaderthal most likely extinction was caused by competition and with Homo Sapiens with Homo Sapiens key advantages being in long, medium and short burst running speed and a couple of other attributes, including greater sexual dimporphism, that led to better specialization.<br><br>but those are not the main problems with this film. The main problem is shoehorning an interesting science fiction piece with a tired melodrama of a kid being different, wishing they were not, and then acceptance. it makes this film a hallmark card/lifetime channel trope that isn't even above average in that field.","user":"random-70778","rank":[24,34]},{"title":"Bah could have been better.","rating":5,"date":"18 October 2019","review":"Interesting idea but it wasn't really well done, far too much of everyday life was simply left out like social media etc etc.<br><br>It has a really meh ending to boot. I have to wonder if the people writing these stupid endings think it's fun, or unique from the myriad other movies with suck endings? Frankly it adds nothing but a negative star.<br><br>I think maybe the people that made this saw \"Iceman 1984\" one time too many.","user":"veryprivateswag","rank":[10,18]},{"title":"and the neolittic saga goes on","rating":7,"date":"18 October 2019","review":"Well, having read jean m. auels books from the 1980's about ayla the sapien- like girl who were found by a tribe of neanderthals that took her in and brought her up, well its a speculativ fantasystory that ranges over 6 thick volumes, that leads me back to my point and main subject of this film, William, a lab prepared humaneanderthal born from a human and spliced by cloning the genomes of respective spieces. its speculative times square, and lots of mindboggeling impressions i have had after viewing the film.<br><br>the weakness of the film is the superior lack of development in the'' making bacon '' part of the story and how the bun beacame a wedding cake of two species . you are getting some flashbacks of williams upbringing, but not the scientific part of the bit, so for the sci-fi people this film could have been a marvel , but can be a dissapointment for some.<br><br>buuuuut the maincast does deliver a great performance, some of the extras does not, the light and depth of the filmo are outstanding, and its very cleverly composed and presented by the director and editor..<br><br>but as an good old grumpy neanderthal i think the story could have dug deeper, and especially the confrontational phases could have been more developed, but that maybe done in the sequel about an indochinese neanderthal. although quasiscientifical,its a passable mix of humanity, moral, ethics and fantasy.i recommend with a seven.","user":"ops-52535","rank":[4,11]}]