[{"title":"I am a fan of horror but what was that???","rating":1,"date":"26 May 2017","review":"1st of all I fell asleep during my 1st attempt to watch this film... It looked like a bunch of high school students stretched an idea over their childhood film \"swampthing\" - acting, story-line, direction, and mixing... everything is so basic... It just seems they shot an extra film during their trip as a bonus.","user":"Waheed-Anwar","rank":[6,6]},{"title":"It is time brother.","rating":2,"date":"5 July 2017","review":"This is the story of the Canadian swamp creature which has its ancient origins in 1967 or maybe 1992. Some college kids go to the area to investigate the disappearance of their professor only to encounter the creature.<br><br>I thought I had seen this film before. David DeCoteau likes to film his productions in the same area, use the same stock footage, use the same bad camera shots and house in Cowichan Valley, BC. \"Asian Ghost Story\" is the same movie except it has a ghost instead of a swamp creature. The creature breathes real heavy whenever he is sneaking up on someone, perhaps being a deformed human and spending a lot of time underwater has something to do with it, except when he is not stalking, there is no heavy breathing. When guys see the creature they take off running...we are talking 4 minute mile speed. The swamp creature moves at the speed of someone using a walker. Yet, the creature appears down the road in front of them. The bulk of the film is filler material of scenery and people walking in the woods. There is a lot of close ups of shoes and the creature's feet. It has the same walking scenes, dock scenes, and house scenes used in other films. It appears if you have seen one David DeCoteau film you have seen them all and that is one too many.<br><br>Clearly Donald Trump had this film in mind when he said we need to renegotiate NAFTA and build a wall. :) Guide: No swearing, sex, or nudity. Not much dialogue.","user":"nogodnomasters","rank":[5,6]},{"title":"Some things should just remain out in the swamp...","rating":2,"date":"22 May 2017","review":"When I sat down to watch \"Swamp Freak\", it was without any knowledge about what it was about, who starred in it, or what to expect from it. I was interested in it solely because it was a horror movie and because of the title.<br><br>The title should have triggered a bell somewhere, because this was a blatant rip-off of the \"Swamp Thing\" creature, although to a less successful extend.<br><br>The movie starts out by spending way too long on following a guy walking around in the woodland area in the beginning of the movie. And that basically set the premise for the rest of the movie.<br><br>A serious amount of time is wasted on showing scenic views of the nature. While it is beautiful, it is not essential for the movie. This resulted in an incredibly slow paced and very uneventful movie, with no real solid storyline.<br><br>I will say that \"Swamp Freak\" does have some good atmospheric music, although a bit too loud in comparison to the rest of the sounds in the movie.<br><br>The creature is painstakingly obvious just a guy wearing a suit plastered with vegetation. And the sound that it made was just too much, it sounded like it should be the sound of some large predatory beast, not a two legged man-thing from the swamp.<br><br>All in all, \"Swamp Freak\" was not an impressive or memorable movie in any sense, and I managed to sit through a whopping 40 minutes of it before I gave up out of sheer and complete boredom.<br><br>\"Swamp Freak\" is not a movie that I have any intention of returning to finish, because there was just nothing worthwhile to hold my interest here. My rating of \"Swamp Freak\" is a mere 3 out of 10 stars.","user":"paul_haakonsen","rank":[5,7]}]