[{"title":"A Superficial Story About Superficial Love","rating":4,"date":"23 July 2017","review":"The Girl from the Song is a movie about a story as old as time - a story about young love. Passionate to the extreme, yet superficial to the extreme. The main character Eric, a stereotypical quiet nice guy, falls in love with Jo, a stereotypical wild girl, and follows her all the way to Burning Man in the Nevada desert. What follows is a lot of silly, predictable drama and beautiful images of Burning Man. The movie is like a beautiful picture with no soul. All the main characters look like models who just walked off of a Mad Max-themed fashion show in Paris. Except for one character, who is supposed to play the role of the old, wise man who mentors Eric and helps him on his quest for love, but only comes off as incredibly creepy. I feel like I never got to know who Eric an Jo really are and what motivates them, which made me not care for what happens to them and what becomes of their love story. On a positive note, the two actors who portrayed Eric and Jo were actually pretty convincing, despite the silly script, and there was some good music.","user":"maja-furlanic","rank":[24,32]},{"title":"Girl from the shallow end.","rating":2,"date":"7 September 2017","review":"I really wanted to like this. The title alone conjures up all kinds of romantic imagery. <br><br>A young man comes across a young woman and falls in love with her. She warns him every step of the way. The first time they have sex she tells him \"This is just sex\". That in itself should have woken him up. <br><br>But no, he sells his guitar and travels from the UK to Nevada for the Burning Man festival. When he gets there we can see that he has interrupted some kind of menage a trois that is being planned by another woman and her boyfriend. <br><br>He is clearly the 5th wheel as it were here. There is a Mad Max Thunderdome fight scene where the other man beats our hero pretty harshly. There is rolling in the mud, lesbian kisses and a fire act. <br><br>Nothing really happens though, we never get to know these two people, I certainly didn't care about them and in the end they go their separate ways. Perhaps our hero Eric should have listened more carefully.","user":"Sleeper-Cell","rank":[17,25]},{"title":"An Unexpected Experience","rating":9,"date":"1 August 2017","review":"Going into this film I had not read much about it, and I typically like to know what i'm diving into. But I decided to take the risk and give it a watch. The more the movie's plot began to fill in, the more you got to know the main character Eric and the more you felt connected to him. Eric was a big reason why I stayed glued to the screen. He gave such a genuine feel to the movie. As so did the girl he falls in love with \"Jo\". She is a magical person with such a rich personality, and so much mystery. The two of them together created an essence that was addicting to watch. By the end of the movie, I was very pleased with how it went. I would suggest giving it a watch, especially when you have some alone time to really get sucked into the plot.","user":"alexanderiby","rank":[17,28]}]