[{"title":"Disturbing. Gripping. A must for fans of true indie.","rating":8,"date":"10 April 2019","review":"At a budget of $45,000 you can't get anymore indie than this. Matriarch will trade punches with a lot of multi-million dollar movies and put many to shame.<br><br>Matriarch shows a couple's desperate fight to stay alive while trapped in a remote farmhouse inhabited by an evil and sinister family.<br><br>Its a slick production, head and shoulders above most low budgets or indeed any micro budget I've ever seen. The acting is superb and highly realistic. And astonishingly there's some 'laugh-out-loud' moments.<br><br>Matriarch is not your average bloody horror or a jumpy fright fest, instead it burrows into your psyche with chilling nightmarish scenarios that are often hard to watch. It takes you to places where your mind doesn't want to go and is nothing short of an emotional roller coaster.<br><br>There is nothing scarier than being alone and lost in a place you don't know, but being held captive against your will is the stuff of nightmares.<br><br>Matriarch is a powerful horror / thriller film which builds on your own fears and plays with them in ways you won't expect. The movie is an original, thrilling and disturbing survival story which delves deep into the horrors of being stranded in a rural hell.<br><br>While many independent horror films take influence from elsewhere, Matriarch doesn't fit any particular mould, it finds its own niche on its own soil and runs with it.<br><br>Also worth mentioning that this movie was apparently shot for less than Blair Witch Project and in less time. An unbelievable achievement by the filmmakers which leads me to ask: what could they do if they get a decent budget? Ones to watch out for I think.<br><br>Matriarch is an impressive, thought-provoking film which leaves you wondering what would happen if you ended up in the same situation.","user":"GeniusJessie","rank":[179,201]},{"title":"If you liked Misery you'll love this.","rating":8,"date":"12 April 2019","review":"As a mother this film was actually hard to watch at times but that's the thing, I couldn't stop watching it. There's a very harrowing scene with a newborn about 25 mins in but it connects you to the lead character and from that point on you experience every single moment with her. I actually watched the movie again today with my husband - it really stays with you and all my girlfriends have been messaging me to discuss.<br><br>It also looks like the movie has gone over some heads judging by some of the the low score reviews. The movie is not your average gory, slasher horror, it's a dark as hell psychological horror with depth. I think many are missing the point - if you liked The Nun - this is not for you!<br><br>The movie definitely has similarities with Misery but It also reminded me of Wolf Creek (a hell of a lot better than Wolf Creek though).<br><br>One of the best low budget indies I've seen in a while - if you love a dark indie movies this is for you.","user":"dianajean1976","rank":[148,166]},{"title":"Moms watch with caution","rating":8,"date":"12 April 2019","review":"So.... as a Mom this movie certainly had an effect - parts were very hard to watch but it's one of those where you just can't look away. Its not gory or particularly violent more sinister, stirring and gritty.<br><br>The cinematography of Scotland is stunning also, in contrast to the subject matter. My husband and I were gripped by it.<br><br>The acting is very very good from the two leads. The pain and anguish of the main character is visceral and real.<br><br>A dark entertaining movie that has a real indie / European tone and vibe.","user":"sersiejacobs","rank":[133,151]}]