[{"title":"1 star is over-rated","rating":1,"date":"20 April 2018","review":"Poor storline, CGI from amateur,, lots of unnecessary boobshow\nI find nothing good in this film.","user":"darrelramos","rank":[21,24]},{"title":"This is a very lousy film filled with unnecessary n overlong nudity, bad creature effects n headache n sleep inducing flickering lights.","rating":2,"date":"14 April 2018","review":"The film has a decent opening scene with the desert location n a couple running away from something. We get to c a very plastic looking Tara Reid. She beheads the other person in a fit of hysteria n the dead man's head starts talking to her. This was sufficient to convey wher the movie was heading. Still i had hopes after reading in the trivia section that this film got some achievement award in Calcutta (city in my country India). I dont kno how far that is true.\nCut the scene n we get to c a girl who gets invited to board a bus which is heading towards Nevada for some burning man festival.\nThis is a very lousy film filled with unnecessary topless scenes, boring n lengthy lesbian orgies, bad cgi, repeated scenes of lesbian orgies with blood while the men jus stands aside.\nLots on boobs on display, one lousy sex scene n one very lousy creature. There was absolutely no tension or suspense. The dialogues were horrendous. Apart from Tara Reid who is also the producer, the only actor i cud recognise is Sadie Katz from Wrong turn 6. She too doesn't hesitate to go topless. Her voice n face r seductive though. In one scene the tatoos/reptiles from Sadie katz's body comes out alive. This scene was supposed to be creepy but the headache n sleep inducing flickering lights ruined the entire scene.\nThis is the second time i encountered a bad movie experience regarding almost similar title n synopsis. The first one was Hard ride to hell. Well apart from the titles being a lil similar, even the synopsis n the settings were very similar. Cult satanic group n desert location. Both the movies r awful.","user":"Fella_shibby","rank":[34,41]},{"title":"The Overrated IMDb User Rating Is a Bad Joke","rating":2,"date":"12 July 2018","review":"\"Party Bus to Hell\" is the typical movie that reflects how sad the IMDb is after the recent modifications. The film is an unfunny garbage, with the cameo of Tara Reid that looks like an unhealthy dummy (or mummy?). There are also fake reviews and ratings to promote this flick and lure the unwary reader. The gore, nudity and breasts are so stupid that never entertain and the poor CGI is awful. The overrated IMDb User Rating (5.5) is a bad joke. In the end, what could a viewer expect from a film entitled \"Party Bus to Hell\" with Tara Reid as the lead actress? My vote is two.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[22,26]}]