[{"title":"A Different Type Of Story, But Its Themes Are For All Of Us.","rating":7,"date":"29 August 2017","review":"Struggle is something that is universal. Adversity doesn't care who you are, where you have come from, or even who you know. Granted, it can be relative, but no matter who you are, road blocks are still road blocks. Documentarian and first-time narrative director Joshua Z. Weinstein takes this theme but looks at it from a different direction with \"Menashe,\" featured at this year's Dallas International Film Festival and now getting a wider release.<br><br>The title character is played by Menashe Lustig and is a widower who is just trying to get by in his ultra-orthodox Jewish community. He is still mourning the loss of his wife a year later while constantly chasing his bills working at a local Jewish market, and he is also dealing with the fact that he does not have custody of his son, Rieven (Ruben Nidorski) due to his religious beliefs that children must be raised in a two-parent household. Until he remarries, Rieven has to live with his brother, Eizik (Yoel Weisshaus), and his family. Menashe has always been seen as the lesser of his siblings, so he embarks on a journey of self-discovery and responsibility just to try for a normal life.<br><br>Weinstein takes his documentary-style of filming (with no score and a lot of steady-cam shots) and applies it here, which gives it an intimate feel that really enhanced my emotional investment into his story (which he also co-wrote with Alex Lipschultz). In my comments to our vendor after the screening, I used the phrase \"both heartbreaking and heartwarming,\" and this is the best way I can describe \"Menashe\". Lustig plays the lead character in a way that even though his struggles are specific to a demographic, there are themes of independence, responsibility, and family that each and every one of us can identify with and feel for him during. His work with Nidorski is very organic, and it works on every level. Almost the entire film is translated from Yiddish, but as real and powerful as this story is, the subtitling bothered me even less than it normally does.<br><br>It is true that this film may not be seen as \"for everyone\" due to the community that it takes place in, but I fully and whole-heartedly disagree. Its universal themes are presented in a way that its context is well-explained so that the audience can see why the traditions are what they are. Much like \"Donovan\" earlier this year, \"Menashe\" is an independent film that tells its story in an honest and grounded way that deserves to be seen by as large of an audience as possible.","user":"Obi_Bamm_Karaoke","rank":[16,18]},{"title":"Authentic, Emotional Masterpiece","rating":8,"date":"28 August 2017","review":"Menashe is an authentic, emotional masterpiece telling the story of a kind, hapless, Hasidic grocery store clerk who battles to keep his family together after his wife dies. Directed by Joshua Z. Weinstein and starring Menashe Lustig, the film was shot clandestinely because of the beliefs of the Orthodox Jewish sect. I love this film because it took willpower to make. You can't say that about many films nowadays. <br><br>Menashe is about a kindhearted, but miserable grocery store employee that must remarry in order to care for his only son. It is against the Hasidic beliefs that a child be taken care of without a mother in the home. While Menashe ponders his situation, his well-off brother-in-law is given custody of Rieven by their Rabbi. Menashe is frustrated by this and is only able to get back custody of his son for a week, while he looks for a new wife. It doesn't seem that he really wants to get remarried, because when he goes on one date he isn't particularly friendly. <br><br>Unlike the rest of his family and friends, Menashe is more at ease with the secular society surrounding them in Brooklyn. He dresses more casually, without the requisite black hat and coat. While he takes his religion seriously, he wants to embrace life and freedom, more than the sect allows. My favorite part of this film is when Menashe drinks malt liquor with the Hispanic employees after his late night shift. They talk about life and try to get Menashe back on track. <br><br>One of the attributes of this film is the way it educates you about the culture of ultra Orthodox Judaism. The other very impressive fact is that it is the first film in 70 years to be filmed in Yiddish. Most of the film is subtitled for those who don't speak Yiddish. Both Menashe Lustig and young Ruben Niborski convey the closeness they have between father and son. One downside of the film is that it is low budget, which is reflected in its grainy resolution. Some of that could also be due to the fact that it was shot in secret. <br><br>I give this film 4 out of 5 stars for its authenticity and emotional punch. I recommend it for ages 13 through 18. The film is in limited release throughout the country at art house cinemas. <br><br>Reviewed by Clayton P., KIDS FIRST! Film Critic.","user":"rannynm","rank":[10,13]},{"title":"A father's endearing love for his son and the challenges he faces","rating":8,"date":"20 August 2017","review":"The Hasidic tradition that a child must be raised in a household where there is both a mother and a father is one of the cultural issues brought to the fore in Joshua Weinstein's bittersweet film Menashe. Co-written by Alex Lipschutz and Musa Syeed (\"A Stray\") and set in the Hasidic community in the Borough Park section of Brooklyn using all non-professional actors, Menashe is an engaging character study that provides rare insight into a society largely hidden from the outside world and a father's endearing love for his son and the challenges he faces strike a universal chord.<br><br>Spoken almost entirely in Yiddish, Menashe (Menashe Lustig) is a widower who wants to live his own life and raise his young son Rieven (Ruben Niborski) by himself. Unfortunately, the ultra-Orthodox community of which he is a part does not see it that way. In his opposition to Hasidic cultural norms, he risks his son's expulsion from school and jeopardizes his status in the community. Menashe wants to do right by his son, but the Talmud says that a man needs three things: a nice wife, a house and dishes (presumably no paper plates). Without a wife Menashe has to allow Rieven's gruff and super critical uncle Eizik (Yoel Weisshaus) to raise the boy. The burly, sloppy-looking Menashe fancies himself as a rebel, refusing to wear a hat and jacket required by Hasidic custom, but he is a rebel without a cause.<br><br>Weinstein, however, does not stand in judgment of his main character and tells his story in a straightforward, if not entirely sympathetic manner, but it is a hard sell. Menashe's job stocking shelves at a local market is barely enough to make a living and his ineptness draws the ire of his boss when one thousand dollars worth of gefilte fish falls out of the van he is driving. In addition, the small unkempt one-room apartment is a dubious environment to raise a child. Menashe feeds his son junk food and sodas for breakfast, but the boy, though critical of the way he treated his mother, still loves him.<br><br>The stakes are high but Menashe refuses to remarry, telling friends that his previous arranged marriage with an Israeli woman was filled with constant conflict and unhappiness and tells a beggar to avoid marriage because \"it's better for your health.\" He goes on a date with a widowed mother with children who is not reticent about telling him what a fine husband he would make. When Menashe shows his reluctance to enter into a marriage of convenience, however, she condemns Hasidic men, saying that \"First your mothers spoil you, then your wives.\" Menashe appeals to the rabbi (Meyer Schwartz) but he is unyielding. Eventually he takes pity and offers a compromise: Rieven can stay with Menashe for one month, but if he hasn't remarried after the anniversary of his mother's death, the boy must return to Eizik.<br><br>Desperate to prove himself to be a worthy father, Menashe asks the rabbi if he can host a memorial for his deceased wife in his small apartment. Reluctantly all agree that \"even a bear can learn to dance.\" Menashe raises complex issues about the conflict between social acceptance, religious dogma, and human needs and desires. Unfortunately, the film's running time of eighty-two minutes seems inadequate to explore the complex issues the film raises. Weinstein, however, does not want to go there. He said, \"I was interested more in the non-plot elements than the plot of the film. It was about the texture, the anecdotes, faces, moments.\" These poignant faces and moments are what we cannot forget.","user":"howard.schumann","rank":[9,12]}]