[{"title":"WHAT is up with the rating?!","rating":10,"date":"11 February 2019","review":"I do not understand how this masterpiece can be so overlooked. I was terrified going into it as if it would turn cheesefest or whatever at any moment - hence the 5.7 stars. The rating in here is completely insane. All I really have to say: Go watch this gem for yourself. You'll see. I mean, unless you're Donald Trump? Or Hitler? Or a close-minded supporter? I, honestly, have no idea whom else would dislike it, and I *rarely* say that.\nAs someone who loves studying characters and story structure, this was incredibly pleasing. It's complex, fast-paced, gritty and honest but with a great amount of heart. The fact that this is the reality for some people ... it's mad. I'm speechless, and ashamed that I haven't thought more about what the whole immigrant situation was like, even though I knew it was bad. I guess it comes to show once again that movies do serve for more than entertainment - and with its authenticity and high quality-making, Icebox qualifies as one of those movies everybody could gain from.<br><br><ul><li>I guess there are some sort of minor flaw somewhere that I don't really care at all about?</li></ul>+ Everything character\n++ Everything structure\n+++ That court room-climax scene!<br><br>(do not recommend to: Trump, Hitler's ghost, Trump supporters and neo nazis, in all seriousness, do not recommend to people who expect light hearted material; read the synopsis though, and I'll laugh if you think you're in for that)","user":"lukas-ingel","rank":[13,20]},{"title":"WOW!","rating":10,"date":"10 December 2018","review":"I was left in tears! The show was very powerful. I can relate to the pain and hardship that little Oscar is dealing with. I have witnessed it first hand. Very powerful performances! A must watch!","user":"blrlicious","rank":[22,42]},{"title":"Powerful film","rating":10,"date":"18 May 2019","review":"Most people will never experience what life is like for an immigrant. This movie follows the story of a child in the current administration. It will touch your soul and give you a glimpse into the world that has been created for many seeking refugee and peace.","user":"fitnessmedic","rank":[5,7]}]