[{"title":"A crazy project flawlessly executed.","rating":10,"date":"20 January 2017","review":"If you have any basic knowledge of film making, acting, lighting, sound engineering and broadcasting, after watching this film you might agree it was an incredible achievement given the limited budget and schedule and all the obstacles and circumstances in which it was put together. When judging all the elements in the film, but particularly acting, it is fair to consider the EXTREME emotional and physical endurance all the actors and crew needed in order to materialize this (crazy) project, specially Woody who also served as director and, as he later explained during the QA session at the end of the movie, couldn't stop thinking about all the details while the camera was rolling. Remember, this movie was broadcast LIVE in one camera shot with no opportunity for screwing up, with the constant threat of technical glitches in sound (150 microphones) and video streaming, bad timing of actors and scenes, falls (the cameraman was running up and down staircases and other obstacles) and even bad weather, given that in London it can rain at any time and great part of the movie was shot outdoors. If you factor all these elements in, then Woody's performance was Academy Award ( or Tony? or both? ) winner. So for this reason, I am giving this movie a solid 10. What Woody and the rest of the crew have achieved is short of impossible. The plot and dialogues were good and entertaining, not a deep and thoughtful story, just a fun and silly comedy based on Woody's mostly-true recount of an awkward night in London. If you didn't have the opportunity to watch it live and would like to watch it now, please do so with an open mind and remember, this was an experimental project with incredible odds of not going well at all, and yet somehow it did!.","user":"mrwhite000","rank":[67,82]},{"title":"Astounding! First rate comedy!","rating":9,"date":"19 January 2017","review":"If you can imagine BIRDMAN done as a CURB YOUR ENTHUSIASM \"bearing and rending of Ego\"...you've got a good understanding of what to expect from LOST IN London. Absolutely amazing, and it's really hard to believe they pulled it off in a single take...LIVE. If I hadn't stayed for the Q'n'A afterwards, I'd still have my doubts...it was that impressive of a feat. <br><br>It would be difficult to ruin the plot, as it's mostly an excuse to follow Woody through one entertaining night of fumbling...I really hope this will be available as a recorded purchase, so that I can revisit it, and have a closer look at the artistry of it. The acting is superb, the camera work is as good as anyone could do (and better than most!), and the cinematography was spot on. <br><br>The biggest possible flaw a project like this may suffer from (as with any project, even) is a flinching, uninsightful, uninspired, and semi- conscious delving into the ego of the writer/director/actor. Harrelson avoids these pitfalls, and handles it like a master. From his acting over the course of his career, there's always been a hint of brilliance beneath...but it's always tough to tell in a truly great actor where the acting ends and real person begins. He handles this roll (admittedly one with which he should be very familiar and had lots of practice) with an honesty and depth of character that shows he's been through it and come out the other side wiser for it...unless it's all an act. <br><br>Hard to tell, but a damn fine yarn, and funny as hell. I'm honored to have borne witness, and really hope to see it again, soon.","user":"BaiNst","rank":[28,40]},{"title":"What an eventful night out!","rating":8,"date":"20 January 2017","review":"What a great technical achievement this film was. One camera. One shot. Great sound (mostly). Fantastic theatrical performances throughout. Considering it was way past my bed time, I never once took my eyes off the screen, just watching in disbelief that this was all actually happening NOW in and about the London streets outside this cinema, in the very early hours of a cold Friday morning. There were some laugh out loud parts. Some rather black moments. And some cringe- worthy. But all good entertainment. Unless the cast hadn't pointed out a few problems in the Q&amp;A afterwards I wouldn't have noticed them. As a live event it was spectacular. We'll just have to wait and see how it stands up as a film in its own right.","user":"mikkocase","rank":[22,34]}]