[{"title":"It is Okay","rating":6,"date":"16 August 2018","review":"This movie is pretty much a well worn tale, and low budget. There had been many movies with higher budgets, that with better marketing, were hugely profitable. If you are time constrained, yea, this is probably not a movie to see. However, it is not a bad watch, is okay, and beats quite a few higher rated flicks. This will not blow your mind by any means, but it entertains. Shrugs to the ppl complaining about acting, which is fine in an okay way.","user":"bsx-05384","rank":[14,19]},{"title":"Fairly entertaing, won't inspire awe","rating":6,"date":"24 September 2019","review":"For a movie that doesn't appear to have much of a budget, The Heretics is fair entertainment. It deals with a dark theme, the process of summoning a demon into the body of an unwitting young lady. If you are disturbed by the subject, as my wife was because of real life events, I would suggest you don't engage this movie at all. Otherwise, dive in, but don't expect a reinvention of the whole demonic genre.<br><br>The lead character in the movie, Gloria, is portrayed as a beautiful but troubled young adult who is plagued by a series of reoccurring nightmares. Years ago she was apparently kidnapped by a cult and barely survived a strange ritual that left most members dead. She works on her past trauma through a recovery group with the help of her girlfriend, Joan. Gloria is chloroformed and kidnapped by a mysterious, scarred figure, Thomas, and taken out to a shack in the middle of nowhere. He is a former cult member who claims to be trying to save Gloria's soul.<br><br>As the movie progresses, they are some minor twists in the road but we can see the curves ahead of time. There are no earth shaking surprises. Thomas initially appears to be the heavy but we can quickly deduce he is sincere. We figure out Joan is very involved in the cult through her increasingly psychotic behavior. The dialogue is not particularly clever or original.<br><br>Through all of this, The Heretics remains a watchable film. The atmosphere is dark and foreboding. The music is ominous. There is not an over-reliance on jump scares or a CGI blood fest and body count. Tension is maintained. When we do finally encounter the appearance of the demon it is dark and a bit unsettling.<br><br>The acting of the two main characters is good. Gloria seems genuinely baffled at her deterioration from beauty into a disgusting creature. Joan is menacing in her emergence as a remorseless cult leader.<br><br>My only problem comes with the actor who played Thomas. He keeps a bug-eyed wonderment on his face for the entire movie. It's almost as if he is playing the character for laughs. He reminds me of David Arquette's performance in the \"Scream\" series. I just never took him seriously.<br><br>Aside from that, The Heretics is a decent scare. There are worse ways to spend an hour and 27 minutes of your life. It only drags a little at it's worst and makes your skin crawl with the creeps at it's best.","user":"themick2008","rank":[6,7]},{"title":"Better than what I expected","rating":7,"date":"6 April 2019","review":"I bought this DVD a couple days ago. And i really didn't expect much until i watched it. It was a lot better than my expectations. It does have originality and a dark setting compared to most horror movies that circles along the satanic cult type setting.","user":"joshjack-35680","rank":[11,17]}]