[{"title":"Good Movie, Bad Timing","rating":7,"date":"9 November 2017","review":"The SNIPER movies have gone up and down as far as quality goes. The original film released in 1993 was a solid piece that offered more depth of story involving a professional sniper matched with an office type sent out to take down a rebel leader in Panama. The action was there but the interplay between the characters lifted this out of direct to DVD status. Subsequent films haven't matched the first one but this one comes close.<br><br>Jesus Morales, a Colombian drug lord, is employing a professional sniper known as El Diablo to take out his competition. In doing so he will then control not just the drug trade but all smuggling operations coming out of South America.<br><br>The DEA is concerned about his efforts and feels that the best thing to do is take him down before he can achieve his goal. The problem is he moves from location to location, never in the same place twice in as many days. And once they do find him they need to not only take him down but make sure that El Diablo doesn't take them out at the same time.<br><br>To aid in this mission Washington liaison Richard Miller (Billy Zane recreating his role from the first film) recruits Brandon Beckett (Chad Michael Collins), perhaps the best sniper the U.S. has. Arriving in Colombia Brandon is whisked off to the task force's headquarters where he learns the man on the ground running things is Thomas Beckett (Tom Berenger also recreating his role from the first film), his father. The two are glad to see one another and the plan is explained led by DEA agent Kate Estrada (Danay Garcia).<br><br>Word has reached the task force of Morales possible location and they launch a team to take him prisoner on a remote farm. The problem is that the location was a trap to take out the task force as the building there blows sky high. This is followed by the efforts of El Diablo to take out the rest of the team from a distant sniper location. Only the skills of Brandon on hand with the team saves those few who remain unscathed. Reviewing the remains of the attack the team discovers that El Diablo is using new technology, a smart bullet that tracks its intended victim.<br><br>Another attack on the team leaves them realizing that there is a mole in their midst providing information to Morales. Unwilling to sit back and wait to be taken out, Brandon and Kate take to hiding on their own and looking for information. No longer completely plugged in to the system their odds of survival increase. If only El Diablo can be neutralized and Morales taken down.<br><br>The movie is a solid B-film when it comes to major releases and yet it doesn't come off that way in execution. The acting is better than most films released this way to begin with. The story seems more plausible than most and holds your interest from start to finish. Seeing Berenger and Zane together again is also an added plus to this one.<br><br>As to why the film had bad timing it was released far too close to the sniper shootings in Las Vegas. Odds are good that most people weren't interested in watching a movie about such a tender subject at the time. I know it pushed my review back a few weeks due to a sense of respect for those victims. The amount of gore in the film from the killings of El Diablo also helped with that decision.<br><br>But if you've enjoyed the other films in the series you'll enjoy this one as well. It offers plenty of action combined with story and above par acting that will keep you watching till the end credits roll. While watching I kept thinking that the way the story is told reminded me of more than one Jack Reacher or Mitch Rapp book that I've read in the past. Consider that a plus for this outing.","user":"kirbylee70-599-526179","rank":[10,12]},{"title":"Written Poorly, Technical Director Fail","rating":4,"date":"18 June 2019","review":"First off, Things like mounting a Light between the Sights shows a lack of a Clue on the part of the Technical Director. The writters scripting things like You could all be court marshaled when talking to civilians , Typical Hollywood Guns that do magic. The acting is the strongest part of the Movie... That is saying something. While I hoped for much more I was sadly disappointed. Hollywood hire people that know something if you want to make this kind of movie.","user":"thomas-c-walton","rank":[4,4]},{"title":"Written by kindergarteners for airsoft gamers","rating":1,"date":"21 December 2018","review":"LOVE this movie! This movie employed so many high school students and newbies! Screenplay was by the third guy from the left in Binghampton University's Screenwriting 101 class; visual effects from Miss Percey's Kindergarten Class of 2017, and military tactics was by the third cousin of the (in)famous Mall Ninja. (Google it.)<br><br>This movie not only employed hundreds of amateur writers, actors and crew, it was an boon to the airsoft gun industry and cheap Chinese radio dealers in South America. Female casting was obviously done by Harvey Weinstein, as every female in the entire movie was either a pushy b**** or a large-breasted whore. It was also nice to see that the traditionally disadvantaged film workers like the blind could get a job in continuity and editing.<br><br>Certainly, last time I attended USMC scout/sniper school, rule #1 was, as soon as the lens caps come off, randomly twirl the dials on your scope. Everyone knows a sniper can't hit anything until he/she randomly twirls a few dials.<br><br>Yes, I'm being sarcastic. I can tolerate radio earpieces in upside down and highly-trained military and DEA agents with their stupid fingers in the trigger guards (that should NEVER happen) because ... well, it's a movie. But when the \"BEST sniper in the United States Marine Corp\" has his flashlight mounted on the TOP rail of his (fake) M4 carbine - effectively blocking his view of the sights - I turned it off.<br><br>Dumb. Boring. Insulting to an audience who wants at least SOME semblance of reality. Just to illustrate how bad this movie is, even Billy Zane was so embarrassed to do this movie that he appeared only in brief cameos. And this is Billy Zane. The case rests.","user":"John-PaulJones","rank":[16,23]}]