[{"title":"a beautiful and insightful documentary about wealthy Chinese teenagers' journey to a prestigious prep school in rural America","rating":10,"date":"4 May 2017","review":"An incredibly lyrical film that is at times a quiet discussion about culture, at times an open meditation on coming-of-age. The subject matter is timely, characters are engaging, and the original score is beautiful. But the real star is the cinematography where each scene is carefully juxtaposed against a scene later. While the narrative unfolds through two years of teenage lives, recurring images, symbols and dialogues remind us that life is never truly linear. And so little by little, we are inevitably drawn to the journeys of the two young protagonists. Who will they become? Will they become who their parents (who sent them from Chinese mega-cities to rural America) wish them to be? Will they become who they themselves thought that they would be? Or will they become who we the viewers wish them to be? In the process of watching these teenagers grow up, we come to see ourselves more (and perhaps in equal parts less) clearly in a complex world.","user":"browniestyle-93661","rank":[5,6]},{"title":"We Are More The Same Then We Are Different","rating":10,"date":"26 April 2018","review":"Being an International student myself, it's easy to relate to this carefully crafted documentary. America and China are two very different countries with vastly different cultures. The film looked closely on the students journey of growing up within this cultural clash and did a great job portraying the struggles of young adults. It is hard, for us, being separated from our parents, facing an entirely new country with complete confidence. The documentary attempts to grasp the deeper intentions of Interantional students by asking questions to its audiences. Questions like, \"Why are they doing this?\", or, \"In which way are we different from each other?\" are asked and answered through the lives of these two narrators in the course of three years. Hopefully, this documentary will serve as a pioneer on the understanding between these two cultures, and further, teaching us how to learn from our differences. We are always more the same then we are different.","user":"gaw-76868","rank":[2,2]},{"title":"An Interesting film that could have been Better","rating":7,"date":"11 March 2017","review":"Maineland was well-received at its world premiere at SXSW Film Festival. It is an interesting look at Chinese exchange students going attending a private school in Maine. The director does an intrepid job following the young high school students lives from urban China to the contrast of rural Maine. Some of the scenes are certainly entertaining, but the film seems to lack a clear direction and story arc. It does too little to clearly explore the sociological impact of both the young people and how they impacted those around them. They didn't really focus on the racism they experienced or the impact on their peers. There was too much of just cinema verite presentation without really clearly steering the narrative clearly enough. Often the exchange students seem just like any other student coming-of-age, but that doesn't provide a very intriguing story for the audience. A different editing of the same material might well have produced a more compelling portrait of what happens when cultures collide.","user":"JustCuriosity","rank":[2,3]}]