[{"title":"Some Might Miss the Subtle Touches...","rating":10,"date":"30 July 2018","review":"Just gorgeous, well acted, beautifully and invisibly directed, though some seem to miss the subtle way the cinematography flattens the spaces and abstract the shapes like Gauguin's best artwork does. Cassel is mesmerizing and looks uncannily like Gauguin's self portraits. His portrayal can make us understand the he had no choice but to paint, and all costs.<br><br>The simple loving relationship between Paul and Tehura is worn down and corrupted in the same way the People of Polynesia were by sickness and greed introduced by the colonizers. The innocent playful fun, the jealousy, suspicion and pain... this film tells a story that shows there is no running away from the human condition.","user":"blueskystyling","rank":[19,24]},{"title":"Has Its Moments","rating":6,"date":"14 November 2018","review":"I thought this film, directed by Edouard Deluc, had its moments but with its very methodical pacing and depressive tone can be a difficult watch. Vincent Cassel gives a fine performance as the acclaimed artist Paul Gauguin, who unable to sell his paintings in France, leaves his family in Paris to find inspiration for his work on the island of Tahiti.<br><br>There he meets the Tahitian beauty Tehura (Tuhei Adams), who, while living together, begins to pose for Gauguin's paintings and sketches. However, despite the lush atmospherics of it all, Gauguin finds himself still impoverished, in failing health, and becoming more and possessive and selfish when it comes to young Tehura. The envisioned idyllic life is slipping away.<br><br>Overall, despite the powerful performances from Cassel and the debut of Adams, the movie to me just became mostly a slog, although, at times, it seems to come together nicely, but those moments are too few and far between. Thus, just a fair rating for me.","user":"larrys3","rank":[11,14]},{"title":"Gauguin -- the Disney version","rating":30,"date":"30 March 2018","review":"This film fails in every possible way. Even the cinematography manages to flatten the lushness of Tahiti. But the story line is worse. <br><br>One has to wonder how and why it is near impossible for modern people to reconcile that Gauguin can be both a despicable pedophile and a great artist? I guess this is the fruit of ever decreasing interest in the classics, where literature for 3,000 years did not have the difficulty we have today in portraying real or archetypical legendary persons as both great personages and contemptible.<br><br>Consider that the entire film fails to mention, even once, this \"wife\" was 13 years old. That his relationship with her, and the natives, is a refection of his own selfish and predatory individual colonialism. Even his abandonment of his wife and children in France, attested to as abandonment in the sourced biographies, is inverted into them not wanting to come with him.","user":"VoyagerMN1986","rank":[48,87]}]