[{"title":"Where have we seen this 137 times before?","rating":3,"date":"19 April 2018","review":"Just because a horror film is Argentinian, it doesn't by default mean that it's worth seeing or even remotely interesting! \"What the Waters Left Behind\" looks appealing and gets programmed at international genre film festivals all around the world, but honestly the overall quality level never rises above that of any random sequel in the \"Wrong Turn\" or \"The Hills have Eyes\" franchises! It is a 200% derivative and uninspired South-American exploitation horror flick with dumb characters, poor performances, zero ingenuity or tension and lame &amp; customary slaughtering. Some will refer to it as a loving tribute to the original \"Texas Chainsaw Massacre\", but I'm simply calling it a blatant imitation. The continent of location is different, obviously, and the buzzing chainsaws are replaced by barbed-wired bludgeons, but apart from that it's an exact copy of Tobe Hooper's horror landmark. The only interesting thing I learned from watching \"What the Waters Left Behind\" is the sad historical disaster that overcame the town of Epecuén in 1985. The part about the poor inhabitants losing everything because of a flood and never receiving any help from the government to rebuild their homes is factual. The part about a bunch of irritating twenty-something imbeciles shooting a documentary about Epecuén but finding themselves kidnapped and tortured by a cannibalistic freak-family is fictional rubbish. I'm so sick and tired of wannabe shocking horrors with redneck/inbred families, by the way! We get it now: their dental hygiene is terrible and the mothers/fathers are even crazier and more bloodthirsty than the offspring. <br><br>This was my first acquaintance with the acclaimed directors' duo Luciano and Nicolas Onetti, and I must say I'm very disappointed. I sincerely hope their previous work is a lot better, since I just bought their film \"Francesca\" after reading that it was a visually striking giallo-homage.","user":"Coventry","rank":[33,37]},{"title":"Completely forgettable","rating":2,"date":"21 June 2018","review":"Rarely I write reviews, but this film is so bad, that I feel compelled to warn people about it.<br><br>Granted, the trailer looks kinda cool, but that is it.<br><br>The plot is non-existent, the characters are all indistinguishable one form another, the acting is amateurish at best, the soundtrack sucks,suffers from editing problems, the twist near the end is so, SO stupid.\nI understand that some movies don't bring anything fresh to the table (in this case is a Texas Chain Saw Massacre / The Hills Have Eyes rip-off) but this movie is simply too bad &amp; idiotic.<br><br>The only two OK qualities of the film are the photography and the locations.<br><br>Please, skip this one.","user":"JairHCastillo","rank":[22,25]},{"title":"Starts out interesting and goes downward from there.","rating":2,"date":"2 May 2018","review":"As I was watching this, I realized, as another reviewer stated, this was a ripoff of several movies, most notably, The Texas Chainsaw Massacre. Hell, they just about copied the scene with the family at dinner. There were also scenes similar to those found in The Hills Have Eyes, Blair Witch Project and Motel Hell. Not an homage to those films, but a blatant copy of scenes and stories. This film devolved into gore (to which I have no aversion, if it furthers the story). This was gore, for the shock value, IMO. Stay far away from this disaster.","user":"mjrosato00","rank":[19,22]}]