[{"title":"One of the best Teen Titans movie!","rating":9,"date":"22 August 2018","review":"Well, watching it in 2018, this movie is seriously action packed, gripping, thrilling and also imparts a bit of an emotional connect which makes it even more spectacular. The graphic action stands out--- just impeccable! The storyline's concise and on point. They've definitely gone deep into every character this time. Nightwing's role in this movie proves why he's Nightwing, and why he deserves to be the best protégé's of Batman. Damian too, on the other hand, is growing up to be one of the best in the business. Though I was disappointed I didn't see much of Starfire in action, her personal life was given more screen time this time, which in my opinion, is not that bad. The post credit scene makes me excited for the next Teen Titans movie, if it's in the making. Though I haven't watched the TV show completely, the movies have definitely made me a huge fan of Teen Titans/Titans.","user":"siddhanth8","rank":[8,8]},{"title":"Much better than expected","rating":8,"date":"3 June 2017","review":"We used to watch the Teen Titan series and enjoyed that immensely, however, seeing the latest series, it's not only lost its grit, it's become too stupid for kids in my opinion.<br><br>This movie however, turns that on its head. The story is pretty normal for the genre, but instead of being written for the prepubescent demographic that many of the X-Men style movies have recently, this is for adults who enjoy animated fare - me especially.<br><br>Don't expect either the original cartoon voices though, or for the characters to even have the same names as they did in the series, but do be ready for real action. I mean graphic action; the kind that has not been so sanitised as to make the writers of the original graphic novels shudder and wish they'd never agreed to let their material be abused in such a way.<br><br>I scored it 8/10 because it wasn't perfect, but it did make me glad that that I watched it and I would recommend it to any others who want a moving picture portrayal of some brilliant graphic novel material.","user":"nick-931-815280","rank":[12,13]},{"title":"Justice of Youth","rating":7,"date":"19 December 2017","review":"'Teen Titans: The Judas Contract' may not be among the best of the numerous animated superhero/comic book films, and there are some pretty good to excellent ones out there (as well as some disappointments). To me, it's a worthy effort though the divisive, leaning towards the positive, opinions are understandable. <br><br>It's certainly far more preferable than the series 'Teen Titans Go!', that was cheap, poorly written and was basically dumbed down childish stupidity that forgot basically everything that made the original series so great. 'Teen Titans: The Judas Contract' is a very welcome return to the dark grit and touching upon complex sensitive themes, both done very well indeed.<br><br>Animation consists of atmospheric colours, detailed character designs and backgrounds and fluidity of movement. The music has an ideal mix of haunting intensity and jaunty infectiousness. The writing balances light witty humour, poignant drama and dark tension.<br><br>Most of the story is very absorbing and it's well paced and coherent. It's standard stuff that doesn't break new ground by any stretch, but a lot happens and the film succeeds in making most of the story and characters interesting and well done. <br><br>Particularly well done of the characters are Deathstroke (much more than a typical villain), Blue Beetle, Beastly and Nightwing. Nightwing and Starfire's chemistry is incredibly well done in the comedy and drama. The voice acting is very good, especially from Christina Ricci and the revelation that is the late Miguel Ferrer.<br><br>For all those great things, 'Teen Titans: The Judas Contract' has shortcomings. It could have done with more development to Damian and Terra's motivations and character development to be made clearer and more consistent.<br><br>A slightly longer length by about 10-15 minutes may have helped perhaps. Just personal opinion of course.<br><br>On the whole, worthy if not brilliant. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[4,4]}]