[{"title":"Somebody is goshdarned lying about this film.","rating":1,"date":"20 August 2019","review":"I'm willing to bet dollars to pennies that these other reviews were bought and paid for by people tied to the movie. This film was one of the lowest of low budget trashterpieces I've seen in a good decade. The practical effects look like someone fired the makeup artist and just sent one of the interns on a Dollar Tree run and gave them a promotion for a few hours. The acting was so ridiculously thespian that I was waiting for the house lights to come on mid-film. And the editing...why do low budget films feel the need to hang onto long dialog pauses? Edit that stuff out and move to the next line and/or scene already. The humor had a few small puns that exerted a snide chuckle here and there but it was mostly sophomoric at best; we're talking freshmen level National Lampoon here. Don't get bamboozled, folks.","user":"capnwinky-93784","rank":[18,29]},{"title":"Fun low budget flick","rating":6,"date":"23 August 2019","review":"I really rather enjoyed this movie.\nIt certainly hasn't been graced with the largest budget and A list actors or anything, but it more than made up for that by being fun and original. The acting was not superb but it was better than a lot of television acting in syndicated shows. It may have helped that I've known some the stereotypes depicted in this to actually occur, especially with misinterpreted text messages. The plot moved along rather briskly and had numerous twists and deceptions lain throughout, while still being firmly based in horror tropes. The wit in the movie flopped badly at times but still delivered a few great laughs.\nAll in all I came away pleased that I'd spent my time viewing the film and instantly thought of a couple friends who'd enjoy this at least as much as I. Gravitas seems to be picking up a higher quality collection of films this year after seeing this and Blood Paradise.\nI read some other reviews before watching this and realized that I had to write a review that wasn't oddly biased like the others I'd read. Hopefully you'll give this one a chance if you're into low budget silly horror flicks.","user":"xianboyd","rank":[8,11]},{"title":"Thought I'd give this a try. Regretted it","rating":1,"date":"21 August 2019","review":"I watched this because it's listed as comedy-horror. I thought maybe it would be like Tucker and Dale vs. Evil (great movie, btw. If you haven't seen it, go watch that instead of this) but no.<br><br>I don't want to be mean here, so I'll say one nice thing about this. The story was somewhat unique. Now onto the bad:<br><br>The acting - some were over the top, while others seemed to be phoning it in.<br><br>The dialogue - It came across unnatural and silly. I founf myself wondering more than once \"who talks like this?\"<br><br>The comedy - I kept waiting for the funny, but the jokes just fell flat. It felt as though a laugh track might have helped as a que to let people know \"oh, that was a joke.\"<br><br>The horror - what horror, where?<br><br>If this is/was a student film (which is exactly what it felt like) I'd say they deserve at most a D+ cause at least they tried, kinda.","user":"sean-lovett","rank":[13,21]}]