[{"title":"Sensitive and Haunting","rating":9,"date":"28 February 2018","review":"I went to IMDb to see what other people had said about this film, and the very first review I saw had the title of \"Boring.\"<br><br>\"Beach Rats\" is quiet and thoughtful, and it demands a certain amount of patience, but it breaks my heart that someone would dismiss it as boring. It follows a lost youth navigating the no man's land between teenager and adult as he tries to figure out how to be the person he wants to be -- whoever that is -- in an environment that tells him who he should be. He hangs out with a bunch of losers who speak in a kind of dumb bro language and couldn't string together an articulate thought between the three of them while wandering aimlessly around Coney Island and its environs looking to score easy drugs. Meanwhile, he carries on a secret life of gay encounters with older men while at the same time trying to force himself to enjoy a relationship with a young woman who's too mature for him.<br><br>Is he gay? Probably. Does he specifically seek out older men as father figures because his own dad just recently died of lingering cancer? Maybe. But the point is that he doesn't have the tools required to process any of the things he's feeling because he lives in a stunted place surrounded by stunted people, and it's easier to escape into feeling good the bad way than to put work into feeling better the hard way.<br><br>More than anything \"Beach Rats\" is about how hard it is for men to explore their own feelings in a culture that has rigidly defined what it means to be masculine. <br><br>Grade: A","user":"evanston_dad","rank":[97,111]},{"title":"A film that exploits the sadness of the closet","rating":5,"date":"24 November 2017","review":"It is a little shocking to see this movie in 2017. The desperate situation that the writer/director creates for her character as entertainment is so dark and frankly, cruel, that it offends me as someone who lived/lives with that desperation. Frankie is a typical street kid from Brooklyn in many ways. He and his crew don't have much to do, so they go to Coney Island and take prescription drugs to create mild entertainment. He's atypical in that he's capable of being pleasant and respectful, when necessary. He's also gay in a world designed for straight bros, and he lives out that part of his life on a hook-up chat website. This set-up is straight from a gay 1990's movie, when the AIDS epidemic was winding down and being gay was scary - queer films reflected that back then. Like those tragic movies of yesteryear, Frankie becomes more and more isolated by his choices and actions. He finds himself alienated from his friends, his family, his straight girlfriend, his potential boyfriends and himself. And then the movie ends. The writer/director is a straight woman whose artistic decisions amount to having a character put in a glass box that is slowly filling with water just to see what happens. It's cruel. I think the problem is that as gayness is more socially acceptable as a topic for film, straight people feel empowered to tell those stories but their conception of gayness is from the 1990's. \"Brokeback Mountain\", \"Moonlight\" and \"Beach Rats\" are all straight people's assessments of gay life, and man are they bleak.","user":"Bayamon_Hill","rank":[74,101]},{"title":"Doesn't really go anywhere","rating":5,"date":"15 November 2017","review":"This is another one of those gay themed movies that tries to show some deeply hidden emotions or something, but instead goes nowhere.<br><br>Let's start with what's good first... Most of the cinematography is pretty good - expect for overly shaky camera in few scenes. There is a lot of eye candy in terms of shirtless guys and more - can help in making the movie at least a bit more interesting. And the acting isn't totally bad. At least the actors don't feel stiff.<br><br>Sadly that is where good things end. There is little dialogue in the movie, though that is not always a bad thing. But in this movie it actually is. Because we don't really see any character development and no real story. We have a young guy that takes drugs, has sex with older men and spends time with his friends doing stupid things. That's almost the entire story. Backing characters have no names, no personality and really don't do anything. Main character... pretty much the same. No ambitions, no desires, no anger, nothing. He just is. Pretty much the whole thing can be seen in the trailer.<br><br>You will get the same story if you look at pictures of random strangers in a city near a beach. Though those will probably have more depth. Overall I can't really recommend this one. If you want teens coming to terms with life and their sexuality go watch something like Hidden Kisses or Boys and leave this one alone.","user":"suse-prinas","rank":[35,46]}]