[{"title":"Good biking - but check out the inspiration for it","rating":7,"date":"25 March 2019","review":"Go figure - the narco kingpin of Paris quietly trundles his wares across Europe in sensible unmarked transit vans until it gets within a couple of hours from Paris .... but then for the last few miles he hands it over to a wired motorcycle courier who is ordered to ride at lunatic speeds, to crash the same toll booth each night and to refuel in the same layby.\nIt's hard to think up a plan more likely to lose both drugs and rider.\nThis French film puts more effort into the exciting dash-cam scenes than the plot , which is a shame because it has a gritty feel and a cool lead.\nIf you want to see the obvious inspiration for the movie, take a look at GhostRider's video's (see YouTube) of him riding around the Paris Peripherique at night at over 250kmph. Yup, Burn Out captures the same images of blurred scenery and terrifying tunnels\nFor an even bigger thrill, check out the b&amp;w movie that inspired GhostRider - a DIY video of a Frenchman nicknamed Le Prince Noir (The Black Prince) doing the same ride in broad daylight and heavy traffic. Your teeth will be on edge. Now that's movie making, and no plot was needed at all.","user":"AlucardOfLondon","rank":[13,16]},{"title":"Different enjoyable movie","rating":8,"date":"25 March 2019","review":"Probably one of the best motorcycle movies I've seen..as a motor cyclist I give it 1 more star than it maybe deserves","user":"davehaydock","rank":[11,14]},{"title":"Good one","rating":6,"date":"30 August 2018","review":"Will start with the fact that the movie is European, so this itself makes it pleasant and different to watch, as well as scenes and acting. A nice story of a guy, his dream, the event in his life and how it all mixes up. It just looks too real, something we see less in the US movies to a point where a good, but more realistic way of showing something might seems not well done, while it's the contrary.","user":"Tsetso_AP","rank":[7,9]}]