[{"title":"Something You Have to Live","rating":9,"date":"18 July 2018","review":"After clearing out deceased parents' home with brother and sister and experiencing the nostalgia associated with objects, to experiencing younger generational grief,, Thought this film really hit the nail on the head. it was acted superbly and the many moments with sister and brother, grieving parents, death expectant elder man, and especially the contained and deep emotion of the insurance agent, made this a very quality film. for some reason we have become hardened and inexperienced in sharing intense moments of life openly and a lot of the reviews of this film are so superficial to the point of tragic. Good one to see.","user":"travelmail-54879","rank":[13,15]},{"title":"Well-acted but overly episodic treatment of unsual subject","rating":12,"date":"12 February 2018","review":"Casting Jon Hamm, with his \"Mad Men\" iconic persona adding much to the role, in \"Nostalgia\" was the best decision made by the movie's writer and director. Otherwise, they seem to have fumbled the ball.<br><br>This morbid look at how people become attached to the objects accumulated in a \"life lived\" to quote the show's most moving term is loaded with arbitrary and contrived connections that attempt to link individual story vignettes into a cohesive whole. With the absence of action, which is what moving pictures are really all about (I learned that early in my formative movie buff years watching foreign films from around the globe without English subtitles as a crutch), we are left with a cold, gloomy movie.<br><br>First half is quite promising, with an unusual central character played by John Ortiz. He's an insurance investigator, visiting people either inheriting a home or possessions or those in a position to bequeath same. He doesn't appraise but checks out the scene and gives advice on getting an appraiser for example. And he's about as welcome as a coffin-maker in a Western doing body measurements on somebody before they go out to have a gunfight.<br><br>Ortiz' character reminded me of Marvin Miller in \"The Millionaire\" TV series, one of my favorites as a kid growing up in the '50s. Miller would give a check for a million bucks made out by the enigmatic (never shown) J. Beresford Tipton to a seemingly random person, and we in TV land would watch for half an hour how the moolah would change that person's life.<br><br>Opening scene elegantly establishes the movie's main theme, as Ortiz sits in a diner admiring waitress Shinelle Azoroh's necklace, which she reveals is a treasured family heirloom. He goes to the home of Bruce Dern to check out his lifelong accumulation of stuff, and octogenarian Bruce is cavalier about the importance or value of it, clearly not wishing to play Ortiz's game. We see that Bruce has an estranged pregnant daughter who doesn't care about him, and the film suffers from our not finding out anything about Dern's character, other than gazing at various photos of the actor in his youth, circa his screen breakthrough so long ago in Hitchcock's \"Marnie\". <br><br>Next up Ortiz interviews Ellen Burstyn amid the ashes of her burnt-out home. She survived a fire but only had time to save some jewelry and a baseball (signed by Ted Williams, hint, hint) that her late husband treasured. She's now living with her kid and mate, and clearly they feel she's just a burden to them, so she heads to Las Vegas to have the ball appraised. At this point Ortiz disappears from the movie, never to return, and I missed him as potentially the central character and unifying force.<br><br>Burstyn's expert acting makes her vignette work dramatically, but she too is given short shrift as we meet Jon Hamm, running a sports memorabila store (and expert in the field), who informs her in cliched Antiques Roadshow fashion that the ball is worth perhaps $80,000 to $100,000. Ellen was never directly attached to it, now only treasuring it as a connection to her late husband, so she sells it to him. No matter that it is clear Hamm is cheating her to some extent (could be worth a million bucks perhaps?), he takes over the movie from here to fadeout.<br><br>SPOILER:<br><br>Not to be outdone, Catherine Keener as Hamm's older sister provides the emotional punch in the later reels, where a contrived plot twist has Hamm moving from uninvolved spectator (a la the Ortiz role early on) to \"shoe is on the other foot\" deeply involved protagonist when tragedy strikes his family on cue. <br><br>Writer Alex Ross Perry and director Mark Pellington (whose thriller \"Arlington Road\" packed the wallop missing from \"Nostalgia\") key the show to objects and artifacts, but as a lifelong collector (from baseball cards, to philately, to ultimately valuable Jazz LPs) I found this morbid approach to be off-point. One can be nostalgic over the ephemeral, namely memories just as mine of \"The Millionaire\" came rushing back without material objects to prompt them. Similarly, for all the assiduous accumulation of Jazz albums over the years, it is the memory of the artists performing live, and getting to meet and even interview them, that linger with me rather than the collection itself - Hamm in the attic examining Rollins and Coltrane LPs left there by his dad drove home that point specifically. <br><br>Even if the auteurs are ultimately arguing (it's questionable given the emphasis on loss, as in a key scene comparing the ephemeral nature of photos stored in the Cloud via smart phone and lost, compared to tangible and treasured snapshots retained the old-fashioned way) the obvious point of memories of a life lived being so much more important than mere talismans of same, the movie fails to deliver that message forcefully.","user":"lor_","rank":[13,16]},{"title":"Noatalgia (2018)","rating":6,"date":"19 February 2018","review":"Didn't know a whole lot about this, and I assume it really wasn't in many people's radar this month. I haven't really seen much of Mark Pellington's work outside of The Mothman Prophecies (which I liked quite a bit). Main reason for wanting to check this film out was the fact that the film employs a really talented cast. I'm always a fan of Jon Hamm getting more roles in film as he is a great actor. This film was tedious, slow, and a failed attempt at an interesting idea.<br><br>This film links a few stories and characters together through a common thread of loss, love, and memories from objects. We start off by seeing an insurance agent and eventually his story links with another character who in turn links with a different one for segments of different stories. I like the idea quite a bit and I've seen this type of storytelling work in the past, but this film can't utilize this method with success. Its a dull affair.<br><br>The cast is great as expected, especially Catherine Keener in a nice standout role. The characters don't carry any weight and its easy to lose track of one's story as its just boring and bland. You sit there thinking that nothing even goes on. This is okay if there's some sort of style or intriguing dialogue that adds to the story, but none of that happens here. Near the end I was just hoping for it to end.<br><br>There may be few who will find this film to be a moving experience but for me its a film that tries to hard to be spiritual and emotional while never leaving first gear. I see what is being attempted but the film has no weight to its characters or their turmoils. Not in any rush to see anything else from Mark Pellington unfortunately.<br><br>6/10","user":"rockman182","rank":[15,20]}]