[{"title":"I love it","rating":10,"date":"10 June 2019","review":"...for performances. For white-and-black image. For a story who reflects the rhytm and atmosphere and expectations of a period. For message. And for the emotions ball after its end. A confession - film . Not original, not great. But useful and beautiful. Bitter and large circles of problems, from motherhood and fatherhood to old close friendship and relation between brothers, from gay life and coming up challenge to shadows from \"Death of a Salesman\" to the indie love stories. Short, a film for feel it. The job of Jamie Chung and Virginia Madsen defines, in splendid way, this special-special drama.","user":"Kirpianuscus","rank":[7,7]},{"title":"A Study in Compassion","rating":8,"date":"19 February 2019","review":"It was the darkest of times to be gay, and compassion for those ill with and killed by AIDS was rarely to be found. We had a president who wouldn't even speak about it and speculated the plague was god's will. There was a lot of fear and misinformation about how the virus was transmitted.<br><br>I found it a rather healing thing to see a movie about compassion and not anger. A closeted son with AIDS returns after several years to visit his conservative hometown, following the death from AIDS of his partner. He lost his job because someone found out and maxed out his credit cards to buy nice and thoughtful gifts for his family. He is in effect saying goodbye and struggling with whether to tell them the truth of who he is.<br><br>He never does. It turns out his father knew, and though not able to accept it, still establishes that he will be there for his son. It turns out his mother knew in the way that mother's know, and hopes she will handle it well when it comes out into the open between them. His high school friend/girlfriend didn't know, but he finally tells her in the hopes his younger brother will eventually know the truth about him. His younger brother is too young for us to know if he may or may not be gay, but it is clear that his interests in drama and pop music are not the norm for his conservative area.<br><br>For me, the most powerful moment in the film was when the son was packing to leave and tosses the nice bible his father gave him for christmas into his suitcase. He hears his father arguing with his mother about putting on the fancy coat the son bought the father for christmas. The mother asks him to put it on for her, if he won't put it on for their son, just to make the son feel good. The father doesn't. The son, saying goodbye to his father (who once again makes the point that he will be there for his son), does his own version of \"putting on the coat\" and says he read the bible the father had given to him and was going to try to be a better person.<br><br>I found it healing to be able to look at the era from a perspective other than rage. Thank you to all involved for your work on the film.","user":"fromdecatur-10126","rank":[10,11]},{"title":"Realistic Emotional Drama","rating":8,"date":"16 February 2019","review":"This film is quite good. The movie portrays the struggle with being gay and the family dynamics during the AIDS crisis in 1985, but not with a flashy Hollywood style, but from a realistic and personal side.","user":"mtsinara","rank":[10,11]}]