[{"title":"Disastrous destruction","rating":1,"date":"11 February 2019","review":"Just in case anybody wonders or is wondering, there is no personal bias against low-budget films. There never has been regardless of what people might think reading past reviews that have seen me be quite critical. There are good ones out there. Nor is there bias against disaster films, again there are some good ones, despite what has been said about some in the past.<br><br>Even when taking it for what it is and what it tried to be, 'Destruction: Los Angeles' just does not work on any level. Not even for novelty value, because one is left feeling bored and insultingly frustrated to be getting any unintentional entertainment. Had absolutely no problem with it being made on a low budget with hasty time constraints and was expecting the production values to not be great as such, there has never been the mentality of if a film is low budget it is immediately bad. Not the case at all. It is when it looks and feels like those involved didn't try and that no effort, care or enthusiasm went into any of the components when it bothers me. That's how it felt watching 'Destruction: Los Angeles', when watching it on television during a \"have nothing else better to do\" period when the weather was too bad to go out. When a film is low budget and done in a short space of time, yet either may lack a little visually but comes off surprisingly well in most other areas or works on most levels and still also looks good (and there are numerous examples of both), it is proof to me that a film's budget shouldn't be an excuse for how the film overall turns out.<br><br>Was expecting the production values to be wanting, and was more than willing to forgive that, but not this wanting. Describing it as amateurish is an understatement and it is painful to watch to the point of being physically ill. The editing induces nausea, the camera work is drab and the special effects are horribly fake and look like an afterthought. The music tends to overbear, both in instrumentation and how it's recorded, and instead of adding to the action, let alone enhancing, it's discordant with it and is completely generic.<br><br>The direction indicated someone completely at sea with what to do, despite the fact that he had done many films before 'Destruction: Los Angeles', his direction is not indicative of that and instead looks like severely underachieving film class student level. The story is truly ridiculous a lot of the time in an impossible to take seriously way and in places vague to the point of confusion, the too-many-loose-ends and rushed ending being one of the bigger offenders. The pace never comes to life and coupled with the lack of surprises, even less suspense, even less than that thrills and excessive predictability it constantly feels very run of the mill.<br><br>On top of that, the ham-handed and stilted dialogue is an embarrassment with the worst of it inducing cringing and toe-curling. The characters have no personality, behave irritatingly and illogically and lack any kind of development. They are severely under-acted too to the point one is wondering whether there is any acting at all, even Cynthia Watros whose performance is far removed from her Libby from 'Lost'.<br><br>To conclude, disastrous. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[15,16]},{"title":"Confusing","rating":2,"date":"10 February 2019","review":"Um since when would you put someone who doesn't know the car well enough to even start it...is a visitor to Los Angeles so doesn't know the roads and is an asthmatic with no inhaler behind the wheel.....much quicker if Marcus who owned the car and knew the roads and wasn't sick or injured drove.....also how did the guy survive at the end....should be dead","user":"keith-n-williams","rank":[9,9]},{"title":"Worse than passing a kidney stone.","rating":1,"date":"23 January 2019","review":"This movie is total crap, terrible acting and bad computer disaster effects. High score rating is obviously from friends of the cast and crew. Absolute rubbish and wasting time to watch this B movie.","user":"psxexperten","rank":[27,35]}]