[{"title":"Don't read the reviews, just see it for yourself!","rating":8,"date":"7 April 2019","review":"Gotta love these IMDb reviews from people who know nothing and rate every Marvel movie 10/10. \"nO mOnStEr FiGhTs So I gIvE 1/10\". You can't expect stuff like that from a low budget film like this. This film was unique, it had cool landscapes, great cinematography and ending that I wasn't expecting. I would love to see more of this type of dark medieval movies in the future but with bigger budget. This was a very small-scale film. There's just 1 actor, very little dialogue and you don't actually see him fight the monsters, only the aftermath. For a low budget movie this didn't look that cheap though. I loved the look of the setting, gloomy atmosphere and the monsters heads looked really good.","user":"jereniemonen","rank":[125,163]},{"title":"A new standard for low budget movies","rating":7,"date":"8 April 2019","review":"The visuals are amazing, you wouldn't guess this movie is shot on such a low budget. Story and character is paper thin but that's kind of the point. It's not about the action but the main character and his journey. The film is indeed a horror fantasy but it also plays as a mystery, the cuiorsity of what happened is what keeps you watching. The lead actor does a phonemeal job with only his expressions and without much dialogue. The last 20 minutes are a bit of a downgrade in regards to the rest of the movie but I would still recommend. The ending will stick with you long after you've finsihed watching it. It's a monumental task to try to create a fantasy movie on a low budget since the genre requires a lot of expensive visuals but this is a more than worthwhile effort, I hope more movies are made in this style.","user":"thomaset","rank":[77,100]},{"title":"Don't be too quick to judge!! For a 30K budget I am blown away!","rating":10,"date":"8 April 2019","review":"I give it a 10 to balance out these 1 star ratings from people that found this movie and expected a game of thrones multi-million dollar production full of fight scenes. What you get in my eyes is different but just as gratifying. As many here have also agreed, this is a slow burn and a movie that you can throw your imagination into. The music, the story, acting and cinematography are simple and beautiful. Simple to me is a great achievment nowadays, stepping back and fully letting yourself be immersed in this vikings world, listening to the amazing soundtrack and the stunning visuals is enough to put a smile on your face. If you are a fan of art and movies you will find that this one will not disapoint. The effort and love that went into the making is noticeable on screen. You guys had me emotionally gripped the whole movie and the ending really cemented a beautiful journey. Thank you and please make more movies like this","user":"mariostew","rank":[72,100]}]