[{"title":"unexpected","rating":10,"date":"16 March 2018","review":"I have gone to faith based movies before and always left for the most part unsatisfied. I can tell you this movie is different. You do not have to be Christian to understand and appreciate the story line. The movie is about forgiveness and hope and there is nothing wrong with that. The acting is well done, the story line is easy to follow and i must say there were more then a few times i got dust in my eyes and they watered. The song has touched millions and now the story will to. I heard it once said the song seems to never go away. Well there is a reason it never stops giving and the movie does not disappoint. I highly recommended this film.","user":"jim-32179","rank":[105,138]},{"title":"A good Christian movie.","rating":8,"date":"16 March 2018","review":"A lot of Christians movie are badly acted and cheesy and this isn't one of them. This movie was well acted, had heart and had emotion. I love MercyMe and the song I Can Only Imagine and it's so great to see the story behind the song. I could relate to what Bart went through with his dad and I think a lot of people can relate to that. This movie had a really good message and I believe even non Christians will like it.","user":"snperera","rank":[109,153]},{"title":"What the Film Doesn't Tell Us About Pop","rating":6,"date":"6 July 2018","review":"There is a certain dishonesty about a film biography that leaves out one of the pieces of the puzzle of a man's life. In the case of \"I Can Only Imagine,\" we have a conventional portrait of a wife batterer and a child abuser in the figure of washed up football star Arthur Millard, resulting in years of anguish for his gifted son to try to come to terms with his dad. <br><br>But the film does not tell us that Mr. Milliard was seriously injured when he was struck by a diesel truck while working for the Texas highway system. After awakening from an eight-week coma, the man was never the same, due to brain damage. The details about trauma to the temporal lobe and mood changes are touched upon in the bonus track of DVD of \"I Can Only Imagine.\" But that part of the story is left out of the film itself.<br><br>The background above is not intended to give the abusive father a free pass. But it does suggest that the film is a whitewash because it chooses not to offer the total picture of the Millard family. There is no doubt that young Bart Millard was a horribly abused child, but one with tremendous resourcefulness and survival skills.<br><br>One of those skills was the childlike ability to imagine. The act of fantasizing removed the child from his terrifying environment. But it also sparked his creative energies, leading to accomplished work in sketching and, above all, in the expression of music. The music Bart loved was inspirational. It was also escapist, saving the child's sanity. It also culminated in the blockbuster song that is the title of this film.<br><br>The film is also successful in dramatizing the power of forgiveness, as Bart's forgiveness of his dad relieved the debilitating incompleteness of his life. The story was well told and superbly performed by a gifted singer-actor. Another strong character development was the gravel-voiced manager who believed in Bart both as a singer and as a human being.<br><br>But the one nagging criticism of this film remains: Why didn't the filmmakers reveal the truth about the father's accident? If Mr. Millard indeed had permanent brain damage, leading to violent behavior, then his transformation through Christianity into the man who could win back the love of his son was even more remarkable. <br><br>Were the filmmakers wary that the focus of the film could shift too far afield from the son's hit record to the father's miraculous transformation? As the real Bart Millard observes in a brief sound byte, in the bonus track: \"If the Gospel can change that dude, it change anybody.\"","user":"lavatch","rank":[28,36]}]