[{"title":"Seems to have a built-in mechanism for self destruction","rating":8,"date":"22 July 2018","review":"\"You don't have to go looking for love when it's where you come from\" - Werner Erhard<br><br>\nIsabelle (Juliet Binoche, \"Ghost in the Shell\"), a divorced fiftyish artist, is attractive, urbane, and highly intelligent but her relationships seem to have a built-in mechanism for self destruction. The men in Isabelle's life offer her little except temporary physical pleasure and are pretty much ciphers (and not very nice ones at that). Loosely based on Roland Barthes' book \"A Lover's Discourse: Fragments\" with a screenplay by Christine Angot, Claire Denis' sophisticated comedy/drama Let the Sunshine In (Un beau soleil intérieur) is lighter fare than normal for Denis, but it has its probing, self-reflective moments and Juliet Binoche, as usual, is an appealing screen presence. <br><br>Like many of us, Isabelle wants to find someone who fits her pictures but, as most of us discover sooner or later, life often does not fit our pictures. All of Isabelle's relationships start out to be very promising but eventually the decisions she makes about her partners seem to get in the way of her satisfaction. Whatever she thinks that she is looking for, she does not find it with either banker Vincent (Xavier Beauvois, \"Django\"), actor (Nicolas Duvauchelle, \"Wedding Unplanned\"), ex-husband Francois (Laurent Gréville, \"A Perfect Man\"), or any other potential beau for that matter. The film begins with Isabelle in bed with the married, pretentious Vincent. Things are looking a-ok until she decides that he is taking too long to climax, a fact she decides reflects badly on her. <br><br>Vincent asks her whether she has had more success with other lovers, but her response is a convincing slap in the face. She is with him when he bullies a bartender but she does not react. The next time he visits her in her apartment, however, she calls him an unrepeatable name, then tells him to leave and not come back. Instead, she hooks up with a young actor (Duvauchelle), also married, though with a better disposition. When she invites him in for a drink, they play endless games about whether he should stay or leave. When he decides to stay, they go through the motions together but by the next morning he concludes that things were better before they had sex and wishes that it had not happened.<br><br>The next one up is François (Gréville), Isabelle's ex-husband, who is concerned about their ten-year-old daughter after she tells him that her mother cries every night. This is not good news for her to hear and she uses it as a reason to end any chance for reconciliation. There are several more suitors that follow but Isabelle always finds something about them that she dislikes. She meets Sylvain (Paul Blain, \"All is Forgiven\") at a club who literally carries her away with pleasure as they dance to Etta James' beautiful \"At Last.\" Unfortunately, Fabrice (Bruno Podalydès, \"Chocolat\"), an art gallery owner, convinces her that Sylvain is wrong for her because he is not a good fit for her circle. This provides cover for her to end yet another relationship, one that had barely even begun.\n \nThere is not much left for her of course but to go to a clairvoyant (Gerard Depardieu, \"You Only Live Once\"), but his banter provides little certainty that she will find \"the one.\" There are times in Let the Sunshine In when Isabelle has moments of happiness and optimism, but she can also come across as needy and, at times, almost desperate. Through the magic of Binoche's performance, Isabelle is a sympathetic figure and one that we root for. Her quest, however, has a touch of game playing to it and it seems that, for Isabelle, it may not be whether you win or lose but how you play the game.","user":"howard.schumann","rank":[21,27]},{"title":"Not for everyone, as you can tell from the other reviews here","rating":10,"date":"20 February 2018","review":"Claire Denis' \"Let the Sun Shine In\" is an exhausting and overwhelming experience, as is the choreography of romance and life it is set in. In the world of tinder, it's all 1s and 0s, but real life these days is much less binary and less immediately satisfying. You won't find that kind of easy romcom satisfaction in Denis' film. One is buffeted by indecision, imprecision, and inaction while swimming in self doubt and self loathing. Isabelle, our stand-in for the duration, is emotionally exhausting. She asks a lot of her lovers and of the audience. She says \"stay with me, stay,\" and Denis uses Juliette Binoche to maximum seductive affect but it's not an easy journey. Isabelle is, by turns, a strong woman with a lot to offer and who knows what she wants, but also a weak human being filled with doubt. She's a paradox and a contradiction, but she also understands without acknowledging that she will always have opportunities...another opportunity. She is someone who is exploring the boundaries of her self. It's perplexing territory to the men she meets but also to herself. Denis shows us as many facets of Isabelle as we are willing to see, that we can see. I think there's a lot more there than I could see at one sitting. A unique portrait. Her best film since \"White Material.\" I'd love to talk to her about it!","user":"LWong1999","rank":[37,57]},{"title":"Little suspense or character development in tale of lovesick painter thwarted by coterie of commitment-phobe males","rating":4,"date":"15 May 2018","review":"Despite the overwhelming positive critical response, there were a few critics who took French director Claire Denis to task for Let the Sunshine In, in French \"Un beau soleil interior,\" best translated into English as \"a beautiful sun inside.\" Written with co-writer Christine Angot, \"Sunshine\" stars the iconic Juliette Binoche as Isabelle, a divorced abstract painter who can best be described as \"love-starved.\"<br><br> \nA few female critics were angry that Denis depicts Isabelle as a woman who defines herself solely through her relationships with men. That wouldn't be so bad if the men depicted were an interesting lot-unfortunately they are not. What's more, Isabelle's back story is gravely lacking-we find out little about her professional life as a painter as well as the nature of her relationship with a 10 year old daughter (whom we meet only very briefly mid-narrative).\n <br><br>Perhaps the most worthless review of Let the Sunshine In is the highest rated on Metacritic (a 100)-by Justin Chang writing in the LA Times who terms \"Let the Sunshine In\" a \"sublime comedy of sexual indecision.\" He's right about Isabelle's sexual indecisiveness-but where is the comedy?\n <br><br>Clearly Denis treats her beleaguered protagonist with kid gloves-she's really the woman with the \"beautiful sun inside.\" She might be a \"glutton for punishment,\" but in the end it's really the men who are at fault here (and a sad bunch they are indeed!).\n <br><br>Perhaps potentially the most interesting man that Isabelle tries to hook up with is an oily banker whom we meet first (in the opening scene they're having a rather unsatisfactory sexual encounter). The banker's crime is that he wants an intimate relationship but will not give up his relationship with a wife to whom he's been married for many years. \n <br><br>Denis unfortunately is loathe to build any suspense in her inert plot, so our frustrated banker makes a lame attempt at the art of stalking by plying Isabelle with a bouquet of flowers. He's unceremoniously given the boot by our lovesick protagonist and that's the last we hear of him.\n <br><br>The rest of the Isabelle's potential suitors need little more description. They include an actor, Isabelle's ex-husband, a working class schlub and an art curator. Unlike the arrogant banker, their shortcomings amount to a coterie of dating misdemeanors: they're basically all a bland bunch and simply unable to commit.\n <br><br>Finally Isabelle decides to go to a \"professional\" for advice after so many failed attempts at love. He turns out to be as bad as Isabelle's aforementioned love objects. It's Gerard Depardieu as a \"medium,\" whose generalized \"psychic\" predictions prove as lame as their source-another abject mediocrity who believes in his own BS.<br><br>\nLike the entire prior narrative, the medium goes on and on as the credits roll. Is Claire also mocking Isabelle for her gullibility? If she is, it's gentle mockery as it's already been established that the men here are the \"butt\" of the over-extended joke.\n <br><br>Perhaps Denis can be forgiven for her feminist bias and her gentle ribbing of the male sex-but her main shortcoming here is an aesthetic one. Despite a good deal of smart, sophisticated dialogue and Juliette Binoche's performance (infused with verisimilitude), it's Denis' inability to build suspense and present a protagonist with an internal arc that displays a modicum of change.","user":"Turfseer","rank":[19,30]}]