[{"title":"Good!!","rating":7,"date":"19 March 2020","review":"Teen Spirit is a very well made musical drama. Elle Fanning delivers an excellent lead performance. She shines throughout this film. The supporting cast also does a good job in this film. The film is very well directed by first timer Max Minghella. The film is very stylish, and makes good use of its pop soundtrack. You are never bored during its runtime, even when you know where this film is going. Easily the film's main weaknesses is its storyline. You know where the film is going right from the start. But it's so well done that you can forgive it. Overall, this isn't anything really new, but it's well made enough to keep you entertained.","user":"MR_Heraclius","rank":[34,44]},{"title":"Screenwriting at its worst!","rating":5,"date":"3 May 2019","review":"This movie had so much potential, but the screenwriter did a rushed and awful job. So many side stories on the movie could have been expanded in order to make it rich for our thirsty eyes. The end was so abrupt that made me think that they finished it in a hurry because they were running out of budget. I recommend seeing it but without high expectations, or else you will be disappointed.","user":"PanosKou","rank":[39,83]},{"title":"Novice screenwriter/director's take on a teen vocal competition proves mediocre at best","rating":4,"date":"1 July 2019","review":"Teen Spirit is British actor turned first time screenwriter Max Minghella's directorial debut. It's a drama about an American Idol-like contest in the UK. Minghella's protagonist is Violet Valenski (Elle Fanning), a teenager of Polish origin who resides on the Isle of Wight (where Minghella himself hails from).<br><br>\nThe plot is rather simple: Violet is taken under the wing of one Vlad played by the Croatian actor, Zlatko Buric. He plays a washed up opera singer who offers to be her manager. Buric is supposed to play a character who's endearing but physically he's unpleasant to look at (not only disheveled but overweight to boot). I'm not sure why we're supposed to root for Vlad, especially after he offers to represent Violet for 50% of the winnings. Only after Violet's ballsy mother sets him straight about his remuneration as manager, is Violet permitted to try out for the contest.<br><br>\nThere's very little else to say about Teen Spirit. I suppose if Vlad had a little bit more of a backstory, things could have been a bit more interesting. But he doesn't and has little to do in his interactions with Violet (there's a brief scene where he gives her some perfunctory breathing exercises). There's also a rather predictable twist when Violet fails to get selected for the show but later is accepted when the girl to whom she initially lost is disqualified.<br><br>\nA subplot involving an aggressive record club exec trying to sign Violet to an exploitative record contract results in one of the few moments of tension-this leads to a brief falling out between Vlad and Violet but things of course are made whole in the end.<br><br>\nAs for the Teen Spirit contest itself, we find out virtually nothing about Violet's rivals. What's more Fanning proves to have a decent enough voice but we wonder why she ends up winning the contest. In other words, her Violet character is thoroughly average. A few of the covers she sings are decent enough (Elle Goulding's \"Lights\" stands out) but most of the songs (and dancing) are simply not memorable.<br><br>\nTeen Spirit is also one of the new films that is technically below average. Just about the entire film is darkly lit and one occasionally misses the action because of the poor cinematography.<br><br>\nIf you like American Idol or the X-Factor you might want to see this, but the bottom line is that novice writer Minghella has a ways to go before he comes up with something significantly compelling and original!","user":"Turfseer","rank":[37,84]}]