[{"title":"I wanted to stop watching this UK low budget C-grade indie film, but couldn't.","rating":6,"date":"12 February 2020","review":"For starters, this is a low budget C-grade (never heard of anyone involved in this film and even most actors don't even have an IMDb profile or photo) UK indie film, so any expectations of seeing a Hollywood quality production are absurd, and so are the undeserving 1's. Reviewers need to cut some slack for new film-makers, and take into consideration their experience and production value.<br><br>The directing from camera-work point of view was not bad for amateur (only 2nd full length film and 1 previous short) writer and director Neil Rowe, but he failed in directing his cast, especially Katherine Drake who was either adequate, or falling asleep. The writing was decent for an amateur, and the 84 min runtime would normally be acceptable for this type of film, but I felt with the slow pacing and the many long dragged out scenes, this film should've had either more content, or reduced to a short or 1 hour TV movie. There were also a few plot and technical issues. The dialogue could've also been much better as some of it was just cheesy. The sound was also off with muffled gunfire in some action scenes. On a positive note, what really stood out for me was the score, which was very eerie and fitting - a rare quality in most b-grade films, the visual effects, cinematography and those creepy af robots and aliens - of which were the main reason I kept watching. Even the gore was on point.<br><br>This film is not a 10 like the fake reviews, but certainly not worth the 1's. It's an honest and fair 6/10 from me. Click on my username to see any of my 1000+ ratings and 800+ reviews.","user":"TheTopDawgCritic","rank":[19,22]},{"title":"Low budget attempt","rating":4,"date":"11 February 2020","review":"I am in no way connected to this movie, just a fan of scifi that loves finding hidden gems online.<br><br>The special effects are good to excellent for this type of movie. The acting of the supporting characters is doable but Sgt Zoe keeps waking you up from the illusion.<br><br>I think the actress has a wider range than what she shows but I've seen more emotion from the animated rug in Aladin than her. Maybe it was intentional, being coached to act \"in shock\" but the writing certainly didn't help. At no point do you believe she is a trained police officer,let alone the highest ranking one in the area. The writer has her throw out police procedure from almost the very beginning and every other decisions she makes is a facepalm moment. Certain story arcs go nowhere or add nothing to the story. The bit with the armed units arriving was extremely bad and I think the last person they meet was only in there to get to a 84 min runtime.<br><br>I know a lot of people did their best for this movie so I gave it 4 stars but Neil (writer&amp;director) you have to do better. Give it a go if you really want to watch it but you have been warned, this is for hardcore fans of the genre.","user":"dhooghesven","rank":[18,22]},{"title":"Budget or lack of it but still enjoyed it","rating":5,"date":"13 February 2020","review":"REVIEW - ALIEN OUTBREAK<br><br>As we all know films do cost a lot of money to make and films made must try their best to make a profit, Hollywood has the monopoly on this and uses their money to advertise films which are made there, whilst the British film industry has less money but even Hollywood would argue that sometimes British movies can be better.<br><br>This film is a prime example, it could have been so much more, don't get me wrong the story is very good with a twist at the end which you don't see coming, but if this had more money thrown at it this could have been one of the biggest British films this year as we have seen with 1917.<br><br>Acting terrible, story good with a twist, special effects are passable but isn't as paced as some films and unfortunately the lack of budget is evident, but saying all this I still enjoyed this British film about a part of Britain being invaded by aliens (or is it?).<br><br>Rating 5 out of 10","user":"markthomassintek","rank":[5,5]}]