[{"title":"Easy to enjoy, hard to say why","rating":9,"date":"23 November 2018","review":"I'm truly amazed at the naivety of so many of the reviews here. The Coen brothers don't try to make simple narrative films working within the conventions that so many of their viewers expect. It's ludicrous to say things like story six should have been number five, or to allocate different ratings to the different stories, or even to complain that the red indians are not fairly represented!\nThe Coen brothers are fascinated by the way that over thousands of repetitions, enormous numbers of rules have become hidden away among the narratives that are produced as films, and they love to subvert and play with those hidden rules. One simple example: at the beginning of 'Fargo' a frame appears that says \" This film is based on a true story\". In fact there is no true story. When asked why they put the statement up, one brother said \" because we always wanted to make film that started like that.\"\nNow if that sounds like it's somehow cheating or breaking a contract between the viewer and the film makers, ie the opening statement is a fact though the rest of the film is of course actors working through a script, it means you haven't realised there aren't really any rules, just umpteen conventions that have accumulated in popular films especially the Western genre, and blunted their capacity of to make fresh and new connections with us.\nSo, one reviewer says that the first story is a good old fashioned western that they wish had been extended. It's not. Buster is a ludicrous mid 1950' s Gene Autrey like figure. His clothes, even his guitar, are completely anachronistic in the rough tough greasy setting of his segment , his shooting skills are impossible, every element in his story is an outrageous overextension of a traditional western, so, the Coen brothers take the genre forward to a ludicrous conclusion and he abruptly dies and flies off to cheesy bluegrass heaven.\nWe are now a bit unsettled and confused about what might happen in the following segments. Since they are all stunningly realistic with arbitrary insertion of death, disaster, and coincidence we cannot just sit back and work our way through the usual tropes. A bank robber has a miraculous escape from hanging, as they always do in westerns? Nope ten minutes later he'll be at the end of a rope again but this time.. Gotcha! He dies.\nBy now the film has you firmly in its grip, anything can happen, and it does, we can't hide safely behind the settee of our expectations, as brave old prospectors, pathetically disabled actors, cheeky little dogs, occupants of a stage coach, all take their chances in life, and we find that we care!<br><br>As the jolly bounty hunter in the stagecoach says, if you can get your quarry drawn into a story you can pounce on him before he knows it.\nIn a Coen brother's film it's quite dangerous to make our usual identifications with key characters, you can't afford to relax.<br><br>The underlying message of this film is simple,enjoy the movies, but remember most of the them tell us reassuring lies, a film like 'The Ballad...\" that is really trying to reinvigorate Western genre, works to escape the comfortable rules of underlying logic, consequence and fairness, and best of all to remind us that in the end, of course, like most of the key characters in this film, sooner or later, we all die.","user":"martinlucas-469-207968","rank":[445,518]},{"title":"The Coens return with the most unique movie of the year!","rating":8,"date":"16 November 2018","review":"The Coen Brothers are some of the most popular and also best movie directors currently working. They created one of my all time favourite movies in The Big Lebowski (1998), and some of the best movies of their respectable decades such as the cult hit Fargo (1996) &amp; the Neo-Noir Western No Country for Old Men (2007).\nAnd now they return in 2018, together with Netflix, to present the most unique movie of the year!<br><br>The Ballad of Buster Scruggs tells six individual and self contained storys in the Wild West.\nAs usual, the movie looks stunning. It is beautifully shot, has some of the best cinematography of recent years and it's just a joy to watch. Also the composed soundtrack is really fitting.\nAs said, the movie is cut in six minor portions: The Ballad of Buster Scruggs, Near Aldgones, Meal Ticket, All Golds Canyon, the Gal who got Rattled &amp; the Mortal Remains.<br><br>They do not have anything particular in common plot wise, but thematically they all tell the huge story of the Wild West - the dark &amp; crazy, sometimes sad side of it. Because make no mistake, this is a really brutal movie.\nWhile the first story is very big on comedic relief, the later chapters get really dark, especially the third having a heartbreaking and strangely poetic ending. The fifth story was probably the most cinematic story, since it told a beautiful little tale that could've been easily explored in a regular film. And the last story is basically only one huge dialogue. It's remarkable at how the Coens write their dialogue - it's eventually only people talking about their lifes and out of nowhere the mood changes into complete danger and suspense.\nThe acting of the over all many performers was great as usual, with especially notable performances by Liam Neeson, Tom Waits &amp; Tim Blake Nelson.<br><br>There are a few tiny things that bothered me (would've liked a bit more of Gleeson), but these are minor concerns. The Coens are back with another tightly written, thought provoking and fully enjoyable movie that reflects on not only their recurring themes/patterns of violence &amp; fantastic dialogue but also to tell the huge story of the Wild West in its most heartbreaking fashion.<br><br>This is the most unique movie of the year!","user":"philipposx-12290","rank":[349,449]},{"title":"In this day and age, this is a real gem of a movie","rating":10,"date":"18 November 2018","review":"Finally a movie that feels genuine start to finish and a movie that entertains.\nYou are never sure where it starts and where it will end,all the characters immediately feel real without wasting any time.\nAnd perhaps most importantly, this is a movie that does not insult your intelligence like almost all other movies do.","user":"alex-1250","rank":[339,446]}]