[{"title":"Read the reviews and decided to add mine because most (if not all) got it wrong.","rating":10,"date":"29 November 2018","review":"I assume everyone who is reading this has watched the movie. The title became clear to me when there was a flashback that included Sakie and Misumi killing the father. That was when I realized that Sakie had a hand in killing her father. However, this was changed when Misumi told Shigemori that he was not at the river bank and he did not kill the father. Flashback to the driver who earlier said that the father had a wallet that smelled of petrol already. Misumi stole his wallet already with petrol and Sakie later killed him when he tried to rape her by the river bank again. I thought Shigemori understood this when he wanted to change the plea of Misumi. Even Misumi thought Shigemori understood this when he shook hands with Shigemori after judgement - because he thought Shigemori believed him.<br><br>The ending of the movie is the saddest, when Shigemori went back to visit Misumi. It totally broke Misumi's heart (and mine), when Shigemori confessed that he only changed the plea because he thought Misumi wanted to protect Sakie from the embarrassment of rape. Because of that, Misumi changed his story again, which he does every time people do not believe in what he is saying. \"It must be as you say it is\" cuts right to the heart of a person whom nobody believed, even Shigemori. Misumi never wanted to protect Sakie, he just wanted the truth to be told and believed. Look at how he did not even exchange glances at the guilt-stricken Sakie when he was led out of courtroom.<br><br>The third murder was committed by everyone who did not believe in Misumi's innocence and story, everyone who judged that he killed, including Shigemori and Misumi who didn't tell the whole truth.<br><br>I had to write this after going through the reviews and finding out that so many reviewers finished the movie still not believing Misumi did not kill.","user":"wildcat-31","rank":[28,32]},{"title":"\"Time to kill\"","rating":8,"date":"7 June 2018","review":"An experienced lawyer undertakes to defend a man accused of brutal murder. Everything is clear, like a day. The accused confessed and in the distant past had already passed through a similar case. However, intuition tells the lawyer that in this case everything is too smooth ...<br><br>The new work of Hirokazu Koreda (After the Storm, Son in the Father, Miracle, After Life) is fascinating at first sight and does not let go. The producer, a dog who has eaten on meditative festival pictures, delays into the \"mainstream\" narrative easily and unobtrusively. The tape, although it has a number of contingent plot surprises, uses the standard detective canvas only as a background for deeper reflections. Each dialogue or phrase dropped carries a semantic question, the answer to which the viewer is trying to find together with the director.<br><br>Despite the seemingly outward asceticism of the production, the tape does not look simple at all. Excellent camera work Mikiya Takimoto, with whom the director worked on the paintings \"Son in the Father\" and \"Diary of Umimati, literally erases the boundaries of reality. And the music of Ludovico Einaudi (\"1 + 1\", \"Strange crime\") harmoniously complements the magic cinema.<br><br>The lead actor's duet is incomparable. Conversations and transformations of the \"lawyer\" Masaharu Fukuyama (John Woo's \"Hunting for the person\", \"Suspect X\", \"Son in the father\", \"Summer formula\", \"Sensation!\") And the suspect Koji Yakusho (\"The Emperor in August\", \" Tree of the Cicadas \",\" Thirst \",\" Harakiri \"and\" 13 murderers \"Takashi Miike) are built and lived filigree. In the background, the charming Kotaro Yoshida (The Clinic of Love, The Woman Who Loves Lies, the Doric of Sentimental Tokyo) looked good as a colleague in a law firm.<br><br>Summarizing: definitely, a heap of awards of \"the Japanese Film Academy\" the tape has deserved quite deservedly. Excellent directing, an indescribable mood and parable motives in a deceptively detective shell. Movies of great style.","user":"BiiivAL","rank":[59,75]},{"title":"Complex, maddening, beautiful told","rating":9,"date":"12 May 2019","review":"One of the most psychologically and thematically complex autopsies of truth, ethics, and morality I've seen. It reminds me of Rashomon in some respects, except that much of the fluidity and subjectivity of truth in this movie is found within a single character, and within societal systems of \"truth-seeking,\" i.e., the \"justice\" and legal systems. Even the camera movement in this film is perfectly attuned to those themes, subtly moving into, over, and out of scenes from all directions. Koji Yakusho is superb as usual, and all other acting and casting is excellent as well, as is the score and the editing. I will be thinking on this one for a while.","user":"ebeckstr-1","rank":[6,6]}]