[{"title":"Franchise: Terminated","rating":6,"date":"15 January 2020","review":"This really isn't a sequel to T2. The plot of this movie actually negates the first two movies, only to retell basically the same story. There are some great action sequences, by the story is basically the same as previous Terminator films. Someone from the future is sent back to the past to protect the 'only hope' in the future.<br><br>We know from T2 that Skynet is stopped, so Judgment Day never happens. But none of this matters, because a new company called Legion, ends up doing the same thing in the future anyway. Basically, this movie tells us that an AI Judgment Day is inevitable. Even if they stop Legion in this movie, another company can just take its place in any future sequel.","user":"JasonXIX","rank":[289,361]},{"title":"We did this","rating":3,"date":"3 November 2019","review":"We, when we watch it, when we pay a ticket, we encourage these people to keep trowing garbarge at us, we need to stop...","user":"ericck90","rank":[1,2]},{"title":"Why the Terminator series is done","rating":5,"date":"3 November 2019","review":"I'll be honest, Dark Fate is more mediocre than unwatchable, probably the best Terminator since T2... yeah, I know, the bar is so low, it's like limbo dancing at this point. This feels similar to The Force Awakens: in itself a slick, decent movie, but I've already watched the much better original, so thanks but no thanks.<br><br>Positives? Mackenzie Davis, for whom I've had a hopeless crush since seeing her as a cute NASA geek in The Martian (and then again in Blade Runner 2049), plays a relatable, compelling character, with an intriguing mix of power and vulnerability. There are also a couple of neat set-pieces, especially in the first half, before everything becomes over-the-top tiresome.<br><br>Linda Hamilton and Arnold show up for fanservice. It's kind of nice to see them both back with significant roles but, as is typical of fanservice, it's like gorging on too much chocolate: tastes good at first, but then come nausea and a vague feeling of shame.<br><br>My main point is, the Terminator series is now hopeless, as the last movies, especially Genisys, have poisoned the well. The continuity is a mess and keeps being rebooted, so everything is pointless: no development can feel meaningful. Show of hands: who would be particularly surprised if the next Terminator movie was once again about John Connor leading the Resistance in another alternate continuity? No one? Thought so.<br><br>Also, the new villain being so talkative was possibly the single stupidest idea in the whole project. You know why Arnold in T1 and Robert Patrick in T2 were so terrifying? Because they shut up! They said very little and, the few times they spoke, it always felt like something they did out of pure necessity (probing for informations, setting up a trap) but was fundamentally alien to their nature.<br><br>This Rev-9 tries to talk its antagonists out of fighting him! Can anyone picture the T-1000 reasoning with its targets? The great Robert Patrick studied and imitated the body language of birds of prey to look creepier and inhuman, and the new bad guy wants to chat. Give me a break.<br><br>5/10","user":"petra_ste","rank":[893,1]}]