[{"title":"Don't waste your time","rating":1,"date":"13 September 2018","review":"I could watch Cobie read poetry for hours but this film is a mess that looks like it was made by a first month film student. There is no charm, no really funny moments, just a really, really, really, really bad film. When I say that there's no chemistry between the leads, don't assume that there's some kind of plot. There is no plot. Literally, throughout the entire film, Cobie acts as if she high or drunk in EVERY scene. I mean drunk like when your friend gets drunk and thinks she's really funny until she sees video the next day of just how stupid she really was the night before. I have to assume that Cobie made this film because the director is a family member or someone she owed a really big favor to.","user":"AMZCali","rank":[9,12]},{"title":"Laziest movie of 2018?","rating":2,"date":"12 September 2018","review":"This movie is so bad and cringy its painfully hard to watch, where to even begin, the plot, the non existant logic behind the character motivations and how they are supposed to act,or the annoying in your face try hard gender role reversal this movie is constantly banging you in head with. so the lady from \"how i met your mother\" the main character in this is a 90s Britpop band singer, after her band breaks up while on tour in the uk for some reason they never tells us she meets with her lesbian friend that lives in the same town and drunkenly apply to go back into university in that same city and basically things just forcefully happen from there. the guy she meets the night of the breakup at some bar is the same guy responsible for college applications or something and the barbecue party in the beach where she makes the stupid bet with her friend where they bet on who has sex first so the guy can find about it and be mad that he is just a part of a bet, oh and i almost forgot about the long painful scene where they invite the university guy to this party where they tell him to bring only \"sexually active male friends\". basically everything in this movie is just is just a plot device the movie doesn't even care about making you sympathize with these characters its just boom this happens so that this other thing can happen. these people obviously just rolled the cameras and started improvising it feels like it was slapped together in two days in literally 4 locations the dorm, next to the big tree, the beach and the cafeteria this movie might be the laziest film i've ever seen and it shows, if only it was a bit serious it could actually became a little bit funny bad and not annoying condescending tone bad.","user":"Omar-Khalfi","rank":[9,12]},{"title":"Just a dumb movie","rating":2,"date":"12 September 2018","review":"So hard to relate and therefore unable to say I actually enjoyed the movie. 2 minutes in I thought what the heck go and have a beer and a steak and enjoy the evening, but no I last the 95 minutes. Damn","user":"srjcochrane","rank":[8,14]}]