[{"title":"Not A Bad Movie At All But Didn't Quite Live Up to the Hype","rating":7,"date":"13 April 2019","review":"Nickelodeon Movies are back with another movie under their belts, this time back to animation once again, with the concept of a theme park brought to life by a imaginative girl, sounds super promising and could be a strong animated film, so I was pretty excited for the movie after the teaser, with it's perfect choice of music and beautiful visuals, the other trailers went in a comedic way which didn't quite grab me but other wise it's still got me interested, but after it was released in the US, I have not heard great things about it, in fact it sounded quite underwhelming, which is ashamed because from the teaser, it seemed like the animated film that would deliver something strong, so I saw it a few weeks after the US release and....... it really wasn't that bad, I know it's not great but it's watchable at best, so let's talk about it.<br><br>June always imagined being the theme park of her dreams to life called \"Wonderland\", with the help of her Mum (Jennifer Gardner), with animal mascots based on her toys, Greta (Mila Kunis), Steve (John Oliver), Gus, Cooper (Joe Sugg, Casper Lee), Boomer (Tom Baker) and the main mascot and ride creator Peanut (Norbert Leo Butz), but after June's Mum gets ill and is taken to hospital, the darkness in Wonderland is brought in and takes over the park with cute Chimp toys that turn into Chimpanzombies that are now tearing the park apart, so it's up to June to go to the park and help her friends to save the park, well i mean.... you can guess from there what is going to happen, it's pretty predicable from top to bottom, you know what will happen and it will end exactly like how you would imagine, it doesn't take any risks or become interesting since despite it's unnecessary PG rating, it's a safe piece of fluff, with a weak script and it felt so rushed with nothing a lot to take from it, that and the moral and it's theme is all over the place, however despite all that, the movie's execution isn't too bad, it makes up for it with decent comedy, scenes that are generally fun and exciting at times to watch and the first few minutes before June heads off to Wonderland, are probably the best parts of the movie, it's touching, funny, strong and it has a decent set up for the movie, however half way through it grinds to a halt and just becomes a perfectly watchable film, the writing may has not saved the movie with it's predictability, bland and generic elements to it, confusing and rushed, it does save it with it's heart, chuckleworthy comedy and the first thirty minutes being great, so in a way, it's Splendiferous!.<br><br>The animation is easily the best thing about the movie, but at the same time it's also the thing that makes the movie not very.... well \"movie\" worthy, first off it is a very beautiful looking movie, there is a lot of effort that has gone into making the movie, the different rides, the character designs and scenes where the rides malfunction are very well done, making it a pleasant film to look at, however!...... it's not the best looking animated film out there, although it's a impressive looking movie, it's also a very bland looking film, most of the characters look like it was done by a animation student, the Chimpanzombies look very basic and far too similar to the Minions and out of most the animated films, this one feels like it belongs to Netflix, not on the big screen with it's quality and especially opening and ending credits, but despite that, the animation is still a beautiful, but yet fun ride!.<br><br>The characters are fine as they are, nothing about them stands out, but they aren't bad at all, June is quite likeable and relatable, although a bit bossy and bratty and a tad bit annoying but likeable, Peanut is probably the best character since he is delightful, interesting, loveable and funny, the other animals don't offer a lot, they deliver personality that may seem stereotypical, like Greta is the boss, Boomer is the one who always falls asleep, Gus and Cooper are the brothers who always fight with each other and Steve is pretty much the comic relief who has a crush on Greta, they are fun I guess?, but pretty forgetful, the parents are okay, although June's Mum has relatability and her chemistry with June is quite sweet honestly, other characters like Banky don't do anything to the movie besides being June's friend and love interest with not that much chemistry, however the voice acting is great, Brianna Denski does a good job as the voice of June, Norbert Leo Butz is spectacular as Peanut, Tom Baker is charming as Boomer, Mila Kunis is fun as Greta, John Oliver is amusing as Steve, as for YouTube vloggers Joe Sugg and Casper Lee, they are okay..., nothing special, just basic and doesn't stand out, but not a bad performance, the characters are a mixed bag, sometimes they have wonderful performances by great actors with some entertaining, relatable and likeable characters, on the other side, they are basic, nothing special, not very interesting all that much and are just stereotypicals.<br><br>*sighs* Oh Nickelodeon Movies..... you were close to going back to the 2011's when you did animation in a amazing way, i mean... it's good to see ya back and all, but I'm a bit underwhelmed and kinda disappointed with your new film, it is better then Monster Trucks, I mean far better!, but.... not all that great, Wonder Park is a passable, watchable, perfectly fine animated film, kinda like this year's Boss Baby if you will, it has beautiful animation, a great concept, good voice acting, some funny and likeable characters and it is quite fun, this movie could of been a really strong and powerful movie about childhood and imagination, like Spike Jonze's 2009 adaptation of Where the Wild Things Are, however unlike that film, Wonder Park didn't quite hit all the right notes with a predicable story, animation that feels like it came from Netflix, comedy that is juvenile, characters that are nothing special and it feels confusing at the same time, so it's pretty good, but not amazing...., which is a shame, I can see this movie working as a well crafted original movie, but it doesn't quite get that..., honestly if they released this to Netflix then I would of been a bit more forgiving, but as it is, it's..... just fine, if you want to take the kids to see something colourful and that will keep them quiet, I guess go and see this, although Missing Link is still out and that one is far better, take the children to see that, but if you are interested, then see it, it's really not as bad as people are putting it, ignore the critics and form your own opinion on the movie, as for Nickelodeon Movies, maybe the TV series might be better and I hope they improve from this movie, maybe a Tintin sequel or a original movie?, but for now, we'll have to wait and see.<br><br>I'm going to give Wonder Park a 7.2/10.","user":"Clank_Zoka","rank":[14,17]},{"title":"Good family movie","rating":6,"date":"22 June 2019","review":"I thought this was a great family movie! It seems there is a hard change from kid movies to adult movies. I like that this is another one that we can all watch together.","user":"ourkingfamily","rank":[5,5]},{"title":"Not the best but far from bad","rating":7,"date":"15 March 2019","review":"Wonder Park is a movie that has a pretty cool premise and potential but doesn't quite reach greatness. One issue is the pacing of the films tone, during the first arc it's back and forth between whimsical, cutesy, funny and then dramatic until we get the park. The humor isn't laugh out loud either but their are some laughs to be had. One of the films strong points are the action sequences like the introduction the park at the very start and when June and the mascots are dodging the oncoming destruction of the park set foot by the zombie sock monkey toys (I can guarantee you this is the only movie to that zombie Sock monkeys).<br><br>The characters are typical but likable but the relationship with June and her mom is one of the films strong points they get along real well and they time their on screen together is just so precocious and Junes arc of dealing with uncertainties of weather her mom can return to her is when the film has it's best moments. Though the pacing is better in the middle of the film it still isn't smooth as butter I don't wanna spoil too much but there's a scene in which the mascots believe June betrays them and it's shown as a big deal, but the next day after helping with the one of the rides, she regains all their trust instantly.<br><br>I'm pretty sure the films issues have to do with the directing, there was some drama where the director was called out for harassment charges and had to leave production, so the studio had to carry on with either a new person in charge who has not been credited as of yet or they pressed forward with what they had done so far, and it's pretty sad cause this movie could have had it's issues ironed out and given likely would have dodged a lot of the criticism thrown it's way.<br><br>The movie isn't a broken mess it's just their was a lot more that could have been done with it, as it stands now it's a fun movie even if it feels unfocused and has some mood-swings with the tone from scene to scene. It's also a pretty short movie too.<br><br>I should also note that much like Jimmy Neutron Boy genius and Big Hero 6, Wonder park is getting TV series that will air on Nickelodeon in the not too distant future and hopefully Wonder Park gets more justice done their.","user":"cameroniacono","rank":[25,38]}]