[{"title":"The Jane Collective","rating":6,"date":"16 May 2019","review":"Greetings again from the darkness. Sometimes the message of a movie is so much more important than the production quality that we can look past the 'how' that would normally make watching a chore, and instead focus on the 'what' and the 'why' to find enlightenment. Writer-director Rachel Carey's first feature film, co-written with Cait Cortelyou, tells the fascinating story of The Jane Collective ... also known as 'The Janes' and 'The Abortion 7'. It's yet another true life story that finds us asking ourselves, \"How have I never heard of this before?\"<br><br>The film opens in 1972 when abortion was still illegal. The camera focuses on women in a jail cell ... women that seem quite out of place behind bars. We then flashback 4 years to a dorm room in Chicago, and female students are discussing the predicament of one of their friends. This leads to the development and early stages of the Jane Collective, a secret organization to assist women in obtaining counseling and abortion. This was a time when not only was abortion illegal, but doctors would often speak directly to a husband about medical options for their wife, leaving the women with little information and no power to make their own decisions. The film touches on just how desperate women were. Rat poison, self-punches to the gut, razor blades, knitting needles, and even jumping off roofs were all used as 'solutions' to a situation for which they were only half responsible.<br><br>Now depending on your views, you may find abortion unacceptable. This underground abortion network assisted 11,000 women between 1968 and 1973, when Roe vs. Wade legalized the procedure. This landmark legal decision put an end to the Janes, as well as the back alley con artists and dangerous methods women previously used. Co-writer Cait Cortelyou stars as Rose, a character based on the real life Heather Booth, a hero to many. Supporting roles are covered by Cody Horn, Chloe Levine, Sarah Steele, Ben Rappaport, Sophie von Hasleberg, Alison Wright, Danny Flaherty, and Michael Rabe (son of the late Oscar winning actress Jill Clayburgh). Judith Arcana, a real life Jane, has a cameo and was a consulting producer on the film.<br><br>With a budget of only $250,000 raised (fittingly) through grass roots donations, the film is not a slick Hollywood production; however, these are women from recent history who deserve to be recognized and remembered for their courage and commitment. Women were forced to look out for each other, and these women certainly stepped up. With the recent legal attention being brought back to the topic of abortion, this story is quite timely, despite having taken place 50 years ago. How sad.","user":"ferguson-6","rank":[14,19]},{"title":"Well acted- and timely","rating":10,"date":"11 October 2019","review":"I first saw this film at the Athens Film Fest in NY this spring in a packed theatre where it was enthusiastically received. The praise was well deserved. The history of the Jane Collective in Chicago in the late 60s was both enlightening- I had never heard of it- and unfortunately timely (although the film was produced before the SCOTUS threat to Roe v. Wade was quite as pronounced). Everyone should see this film - it is a solid reminder of the actual dangers and fear that women faced before pro-choice legislation, which is rarely showcased.<br><br>As several reviewers pointed out, the small budget limited the cinematography to mainly right/small shots- but rather than this being a distraction, I found that this created a more intimate relationship with the characters- much like a play. The story was- and should be- the focus here, and it is an important one.","user":"capekc","rank":[4,4]},{"title":"Entertaining history with a great ensemble cast","rating":9,"date":"5 October 2019","review":"This film takes you back to 1969 to remind you what life was like in the pre roe days. But it's more than that. How do some college women become abortion providers? How do you find a Doctor willing to go to jail? How do you let women know that you have a service, without going afoul of the police? Exactly how condescending were doctors to women back then? This film deftly interweaves multiple stories to give a full picture. And it has a great ensemble cast.","user":"kaplanphilip","rank":[6,7]}]