[{"title":"Funky Little Shack","rating":7,"date":"30 August 2018","review":"This film is much better than it has any right to be and that all comes from writing and characterisation. They clearly didn't have the budget or time to put together something truly polished, but what they made is pretty much better than many horrors out there today.<br><br>The fact that you actually care about the characters and what happens to them is remarkable, and it doesn't have to rely on a crazy villain or nudity to get your attention. The dialogue is immature, but it is meant to be, seeing as how the leads are all adolescents. The only real downside is the pacing and editing as both are a little jarring and detract from the overall quality of the production.<br><br>Overall I would definitely recommend this movie to any comedy horror fan. It isn't the most hilarious or gory, but it is smart and clearly the effort was made to produce a unique story, and it works.","user":"scythertitus","rank":[14,15]},{"title":"Rather fun and highly enjoyable entry","rating":8,"date":"9 August 2017","review":"Taking a relaxing trip to the woods, a young kid joining his best friends' family on a camping vacation in the wilderness finds their next-door neighbor is keeping a cannibalistic secret with her and must find a way to force their parents to believe them in order to get away alive.<br><br>This here wasn't all that bad of an effort. One of the more impressive elements present in this one is the fact that there's quite a large amount of atmosphere built up here alongside the surprisingly funny comedy. The opening half, filled with looming shots of the woods at play here as well as creating a strong central air that grows progressively more intense the more this one unfolds as their discoveries in the woods and finally the first peak in the house makes for quite a strong set-up. Once they actually witness what's going on in the cabin, where the deformed creature is feasting on the victim they've been spying on makes for a nice launch into the latter half where the zombified creature is loose and they must rely on each other to survive as the action there is quite fun. From the surprise visit to their house which features the great brawl being observed from the hiding spot that has to remain undiscovered to the chaos of the creature ambushing them in the house and being forced to deal with the shambling creature and the victim stashed away to the later confrontation back in their house with the transformed girlfriend, they give this the kind of big high-end action required to enjoy here. That all leads into the film's biggest action scene with the final retaliation back at the cabin where this one really manages to score nicely with the outdoor confrontations with the zombies, the final brawling in the house where everyone tends to take a little damage and leading up to the gruesome resolution sequence that's quite fitting considering the bloodshed unleashed. Given that the fun of all this is from the rather great comedy between the group, whipping off one- liners and insults against each other as well as engaging in some rather hilarious situations that make this feel far funnier than it really is, adding another nice layer to the film. While these here do make this one rather fun, there are a few minor issues to be had here. The main problem here is the fact that there's some rather glaring pacing issues here that crop up from time-to-time, as the film takes way too long to get the family out to the cabin with it taking too much time showing them traveling in the car, stopping at the restaurant and antagonizing each other there, it all just really drags this one out and it takes awhile before they actually show up in the cabin. Even then it takes awhile for the true horror to be felt, and it's somewhat stilted pacing is a minor problem. Likewise, there are also some minor issues with the low-budget nature showing up from time-to-time, as the low light levels and somewhat cheap- looking gore do get to this one at times and it's rather obvious. However, these aren't really distracting and it's quite fun regardless.<br><br>Rated Unrated/R: Graphic Violence, Graphic Language and children-in- jeopardy.","user":"kannibalcorpsegrinder","rank":[19,27]},{"title":"Had some laughs - worth a look if you're bored","rating":6,"date":"9 March 2018","review":"DEAD SHACK was a random pick that had the sort of honest reviews on IMDB that make me watch a B grade movie on purpose. I didn't know Lauren Holly was in it until her name popped up at the start and she's still got that certain something.<br><br>Some parts of the script had very deliberate, very cringe inducing *crickets* moments. Some of the dialogue was so natural you'd swear they were just having a dysfunctional family argument at times. It is also over the top, ridiculous and contains some proper laughs. It's a Zombie flick after all, and it treads the path competently.<br><br>Lots of flaws but fun enough for you to forgive them.","user":"Mikelikesnotlikes","rank":[13,18]}]