[{"title":"A Blaze of Legend","rating":7,"date":"21 August 2018","review":"Greetings again from the darkness. \"When the legend becomes fact, print the legend.\" \"I don't want to be a star, I wants to be a legend.\" The first quote comes from THE MAN WHO SHOT LIBERTY VALANCE and the second is drawled by Blaze Foley as he snuggles with his muse and lover in the back of a pickup truck. We can imagine the first quote inspired many stories over the years by those who knew Blaze, and it might also have served as a driving force for writer/director Ethan Hawke as he crafted this graceful tribute to an underappreciated songwriter and his too short life.<br><br>Mr. Hawke is a 2-time Oscar nominee as an actor, and his best known previous turn as director was for CHELSEA WALLS (2001). He (a distant relative of Tennessee Williams) has also been twice Oscar nominated as a writer (BEFORE SUNSET, BEFORE MIDNIGHT), and his movies are often music related or influenced. His latest is a biopic of a mostly unrecognized country-folk artist, and Hawke collaborated with Sybil Rosen to adapt her memoir \"Living in the Woods in a Tree: Remembering Blaze Foley\". It's Ms. Rosen who shared the bed of that pickup referenced in the first paragraph above.<br><br>Ben Dickey plays Blaze and Alia Shawkat plays Sybil. Not only does Dickey capture the spirit and sound of Foley's music, but the scenes with Blaze and Sybil as a couple are some of the most touching and realistic relationship sequences we've seen on screen. We understand their connection ... and their disconnection. It's proof that two people can be both 'made for each other' and 'wrong for each other'. Director Hawke utilizes different time periods, as well as a framing device in the form of a radio interview. None of this works in traditional biopic manner as the interview features the great troubadour and musical poet Townes Van Zandt (played exceptionally well by Charlie Sexton) recollecting the times (both good and bad) he spent with his friend Blaze. He's joined by another Foley friend and collaborator, Zee (Josh Hamilton) as the two color in the blanks to ensure the legendary status desired by Blaze. The DJ is voiced by Ethan Hawke, who is only seen from behind.<br><br>In addition to the radio interview and the relationship with Sybil, we also have multiple scenes of Blaze's final live show being recorded at the old Austin Outhouse. The nearly two hours of music and philosophizing were turned into a record release that remains (nearly 30 years later) a mesmerizing listen. These 3 very distinct pieces fit together to bring Blaze into focus as both a songwriter and troubled man - one who found himself in too many fights and, ultimately, on the wrong end of a gunshot in 1989.<br><br>Philosophy and homespun wisdom and catchphrases flow from Blaze during his songs and even when he's just hanging with his buddies or Sybil. The real Sybil Rosen plays her own mother in a scene where Blaze meets the parents, and there is a touching moment in the film where Blaze plays for his estranged dad (a wonderful, albeit brief performance from Kris Kristofferson), the founder of The Singing Fuller Family where Blaze got his musical start. It's these kind of touches that elevate the film into a must see whether you are familiar with Blaze Foley or not. <br><br>BLAZE FOLEY: DUCT TAPE MESSIAH is a 2011 documentary that would nicely compliment Mr. Hawke's film, although this version contains much more humor - including cameos by Steve Zahn, Richard Linklater and Sam Rockwell as Zephyr Records executives. With Louis Black (founder of SXSW and a former film class TA of yours truly) as an Executive Producer, and songs by Blaze Foley and Townes Van Zandt, this little gem is likely to awaken viewers to a bygone era of music that tends to be remembered only for Willie, Waylon, Jerry Jeff and Merle.","user":"ferguson-6","rank":[32,37]},{"title":"A Moving Portrait of an Authentic Music Legend","rating":8,"date":"3 September 2018","review":"I rarely write movie reviews, but this poignant film of the life, and music, of Blaze Foley compelled me to sit down and do so while the memory of it is still fresh in my mind. The movie evoked memories of lost simpler times in Austin, when one could buy a cheap pitcher of beer in some rustic venue and stay out all night listening to music performed by folks who would go on to become legends. Two of those legends, Blaze Foley, powerfully portrayed by Ben Dickey, and Townes Van Zandt, brought brilliantly to life by Charlie Sexton, are deeply interwoven into the tale of Austin's music scene, so if you need a reminder of what drew you to Austin in the first place, or are just the least bit curious about Austin's music heritage and beginnings, this is the movie for you. The music alone is worth the price of admission.","user":"smolen-91724","rank":[27,33]},{"title":"Thanks for the introduction","rating":8,"date":"25 August 2018","review":"Blaze was not another story about a washed up country singer who just couldn't help himself, but more like a guy who very humanly did the best he could in a most authentic way. The supporting cast of characters were amazing and this story was about love, destiny, pain and acceptance. Ben wrapped the whole thing up with a bow when delivering the monologue at the end, where Blaze allowed himself just a second to acknowledge his father's effect and his own regrets before putting on the armour and standing up for right. Being lucky enough to attend a Q&amp;A after makes me ready to see it again. Why is Alia Shawkat not listed in cast &amp; crew?","user":"Hillegeistrn","rank":[18,22]}]