[{"title":"Digital Killed the Cartridge Star","rating":7,"date":"19 February 2020","review":"A very interesting documentary about the last breaths of the small business, used video game store industry. The stores featured are really impressive...massive collections of games across the entire lifespan of physical gaming, and even more exciting is the passion from the people who facilitate these operations. Many of the retro shop owners opened their doors at least 10+ years ago, before or when digital copies were just struggling to break into the mainstream, and have in recent times discovered the gradual decline in interest in their business they love so much. They still seem to get a lot of trade-ins from customers, but perhaps the sales have faded in comparison to yesteryear, evidenced in some cases by warehouse-sized basements of back-stock beneath the shop. As someone who grew up in the times of 80's and 90's cartridge gaming, but now exclusively makes digital game purchases out of convenience, this perspective was eye-opening to me in some ways. What happens if 10-15 years from now some of our digital purchases have licensing issues for this reason or that reason, and licenses we once bought but deleted for storage reasons, are no longer available for re-download from Nintendo's eshop cloud, or Playstation Network's store? We've seen this already with some older games on Steam, where even small things like unwanted changes a developer made to a game cannot be undone because that digital media received an update that we can't refuse. Or look at Google Stadia...what if this goes under (which it looks like it really could) but people who paid full price for the right to play a cloud game on Stadia could no longer play that game because their account, the cloud that hosted their digital library, or the service itself are now closed? Scary stuff- I guess you don't really own something unless you can hold it in your hands. Thought provoking doc for gamers everywhere.","user":"umimelectric","rank":[8,10]},{"title":"Nice concept, so-so execution","rating":7,"date":"24 February 2020","review":"This was a fairly well made movie that would really appeal to fans already, or those familiar with the hobby. It doesn't do a great job of bringing any outsiders inside, and can occasionally lose focus when it drifts into digital game dev stories, but when it stays on the store owners and the enthusiasts, it shines. Personalities, stories, memories, feelings, that's the core here, not the history of Rocket League or the break dancing game.\nSolid movie well worth watching.","user":"jellopuke","rank":[5,6]}]