[{"title":"An amazing take on time travel. A Must Watch.","rating":7,"date":"2 April 2017","review":"\"Will You Be There?\" is an adaptation of Guillaume Musso's 2006 bestselling novel with the same title. South Korean cinema adds one more feather in its cap by adapting such a fantastic novel and Hong Ji-young did true justice to it.<br><br>A surgeon (Kim Yun-Seok) helps an old man by operating on his granddaughter during a flood in Cambodia. The old man asks what is your last wish and surgeon says \"my only wish is to see my girlfriend\" but she died in an accident 30 years ago. The old man gives him 10 pills which allow him to travel in time to the past. <br><br>The narration is immaculate and the idea of time travel is utilized magnificently, going back in past and meeting yourself is portrayed with great ingenuity, a dash of humor &amp; melodrama. South Korean movies are known for this peculiarity.<br><br>The characters are developed seamlessly; human emotions are captured well. It also draws the protagonist's conflict with relationships and who to choose, the sacrifices are irreversible.<br><br>Attention to the details is commendable here as we see the height, smoking style, hairstyle and body language of the protagonist is similar. The cinematography is spectacular and editing makes the movie crisp as the transition of scenes from 1985 to 2015 happens flawlessly.<br><br>A must watch film.7.5/10","user":"ajit2106","rank":[11,11]},{"title":"A bad time travel love story.","rating":4,"date":"13 June 2019","review":"The movie started off good and I was hoping some mind twisting time travel and beautiful love story. But it was a big disappointment. The love story was weak and time travel was full of plot holes.\nThe main character could have saved his love interest, still be friends with his best friend and still have had his daughter. This was my first korean movie disappointment.","user":"cool_andhot","rank":[3,7]},{"title":"Tear Jerker","rating":10,"date":"6 August 2019","review":"This is a fantastic movie. As with most good time travel movies, you have to think outside the box. Most others you also have to ignore the loopholes, but not in this one. The ending had tears rolling down my cheek, then a few minutes later, tears again. This movie actually had multiple sad and happy endings, until the final, which is, well, you just have to watch it. The acting is great, the characters are great, and some comedy relief from his best friend. I promise you it is worth every minute of your time...","user":"stantmann-208-822421","rank":[0,0]}]