[{"title":"Is this a movie?","rating":1,"date":"4 June 2018","review":"This \"movie\" is a psychological test to see how much you are willing to put your mind through. I'm sure the actors are solid in other ventures, but good lord this movie is one terrible one liner after another. This is glaringly obvious the moment the driver opens his mouth. I urge you do not watch this \"movie\" unless you are prepared for an all out assault on your intelligence. There are zero redeeming qualities in this.","user":"stevocbk24","rank":[13,19]},{"title":"Horrendous.","rating":3,"date":"26 July 2018","review":"I rarely review movies, but this was so bad, I felt compelled to do so. It will have been worth my time if I save one person from wasting 99 minutes they will never get back. I should have trusted the people that rated this atrocity 1 star. As for those who gave it 10? My only guess is they are taking the drugs the killer in the movie laced the water with. The best part of this movie other than the ending credits? The smart-alec cop! The worst? Everything else. Genre - thriller. By no means. The only thing that made this a thriller was me being on the edge of my seat for this nightmare to end. The driver has to be the worst actor I have ever seen, by far. The snippets of \"suspenseful\" music were poorly placed. The storyline had potential, but was not executed. Just don't bother. \n***SPOILERS BELOW***<br><br><br><br>One of the most ludicrous scenes was when he drugs the burger and the boyfriend comes home, doesn't hear the cell phone ring or him yell \"sh$t!\" in that tiny apartment? Sure. \nThe 10 minute argument regarding the hula girl on his dashboard was right up there too. Then 3 guys get in a Hitch car and recognize he fits the description of the Hitch killer, shares the same name, and they stick around to ask him about it, then discuss it out loud? Pretty sure he can hear them sitting in the back of that huge Prius! This is so dumb. This whole scene belongs in a spoof movie. \"Would you like a (cue suspenseful music).....gummy bear?\" This is so stupid! These are just a few examples of how absurd this movie was.","user":"Orlando355","rank":[7,9]},{"title":"Don't waste your time","rating":1,"date":"22 June 2018","review":"This is such a lame movie. There are no redeeming qualities. The acting is lackluster, the writing is dreadful. It feels like a movie that was made as a joke, trying to make an awful movie. This is not even a so bad it's good situation. The premise was interesting but it did not deliver whatsoever.","user":"benc3141","rank":[8,13]}]