[{"title":"A good low budget film","rating":8,"date":"27 March 2019","review":"A good, low budget thriller/drama. Good central performances especially from lead Mark Barrett. The film begins at a gentle pace, giving us time to learn about who we are watching which I liked a lot. Too often films try to push straight into the \"action\" without giving us time to care about the characters and their relationships. There is a tension to the opening as we learn, almost in the background, that a girl is missing and it's interesting trying to work out how the characters fit into this plot line. But we get a sense that something is wrong with a simple glance that Cleek makes to a street security camera whilst talking to a prostitute. From then on we are locked into what he's up to, as his actions get weirder and weirder. And then a reveal that's quite disturbing. It's a lovely balanced performance by Mark Barrett and brings to mind Ralph Fiennes creepy psychotic in Red Dragon. We know that behind his cold stoic expression something is waiting to explode. The film isn't too graphic when it could have been, which I liked, although there is some blood and gore of course - it's a serial killer movie! It's well shot and edited - with some really nice night time location shooting.\nA good low budget movie which is held steady by a very strong central performance from Mark Barrett.","user":"contact-43595","rank":[3,3]},{"title":"once a week habbit","rating":5,"date":"28 November 2018","review":"Well to summarizee it is a film about addiction,very various kinds of addictions, but the main character bears the worst of them all.\nits also a story of sosiopathic psychopathy, relentless killings and dismembermenting the victims and then feed the big fat pig somewhere in western Scotland.\nthe film bears all the signs of amateurism, low budget, weak storyline,below average photographic and sound. the acting are not very well directed, and that bleeds throughout the story.\nits a watchable movie if you like the scottish accent and demeanors,can sitn through 105 minutes of mediocreism . i will not necesarilly recommend it. i give it a low 5","user":"ops-52535","rank":[12,20]},{"title":"Great Scottish film","rating":10,"date":"11 April 2020","review":"I am in this film so 10/10. Great director. Decent cast.","user":"graham-mckinnon","rank":[0,0]}]