[{"title":"a very powerful and relevant drama","rating":8,"date":"9 February 2019","review":"Brutally simple child-abuse drama, with the usual South Korean penchant for sadism I've come to know pretty well by now. Which is to say I entered expecting blood, so unpleasant moments are present, but also no surprises in this regard. What surprised me is how Lee Ji-Won keeps it all tight and focused. Instead of relying on long, pointless moments of gratuitous violence and desperation, Miss Baek shows what's enough, and maybe just a little more, to understand lives forever ruined by a horrible childhood. Thus a tale of compassion and revenge becomes an attempt at reconciliation with one's own past and memories. Amidst the horror, tenderness is abundant, and that's when Miss Baek works better for me. The final shot is nothing less than heartbreaking.","user":"aminifatimaaa","rank":[21,25]},{"title":"Expected a thriller, got a drama, and how well made this is!","rating":7,"date":"7 April 2020","review":"The poster of Miss Baek that I saw misled me. It showed Han Ji-min, who plays the titular character, holding a gun and shielding a child. I went in expecting a thriller, something that was not helped by the fact that the first scene of the movie was a crime scene. Detective Jang-sup (Lee Hee-joon) is shown approaching a dilapidated house in a broken down section in the outskirts of Seoul. Inside the house is the dead body of middle-aged woman, possible dead for weeks. He takes some notes, and the scene ends. Next, we are shown a young but scruffy woman washing cars. This woman, we soon learn, is Miss Baek. Rough around the edges, coarse and no-nonsense, she makes a living working multiple jobs, and lives with Jang-sup, who apparently is her partner. Jang-sup tells her about the dead woman, and we learn that it was Baek's mother. Flashbacks show that she was an alcoholic and was abusive towards Baek, and her indifference at the morgue identifying her mother shows Baek hasn't forgiven her. Another flashback shows a schoolgirl Baek defending herself from sexual assault, dealing a grave injury to a rich kid, who dies, and her getting sent to prison for it. Life has hardened her and she thinks a normal life isn't for her, frequently rejecting Jang-sup's proposals of marriage. It was only at this point that I knew I was in for a drama (and a well-made one so far).<br><br>One day Baek chances upon a little girl, Ji-eun, on the street, shivering from the cold and covered in dirt and bruises. She takes pity on her and takes her to a food stall. Soon a well-dressed woman appears looking for her, and even though she is suspicious, she lets the little girl go. Beak finds out that the woman, Mi-kyung, is the girlfriend of Ji-eun's neglectful father. Mi-kyung, respected in the locality, makes money by doing various hustles and the welfare check the state pays for Ji-eun's upbringing. Beneath the smooth and polished veneer though, lies an abuser whom Baek can identify from her own tragic life experiences, and she embarks on a mission to save Ji-eun from Mi-kyung; to prevent what happened to her from happening to the little girl.<br><br>This movie is a story of two women in unfortunate circumstances, and a girl, whom they fight over for different reasons. Han Ji-min, who made her name in Korean soap operas, delivers an emotionally powerful performance as a survivor of abuse and unfortunate circumstances. I haven't seen her other works, but I can confidently say that this movie must count very prominently in her career. Kim Si-ah, who plays the little girl, radiates innocence and hurt from her eyes and body language. Kwon So-hyung, who plays Mi-kyung, pulls out all stops to match Han in every frame, a worthy adversary to Miss Baek. She elevates Mi-kyung from an evil stepmother archetype to a complicated woman who struggles mightily against her circumstances as best as she can, making her as compelling as the titular heroine. In a way, she is what Baek would have become, an ugly, distorted mirror image of her, if compassion and empathy were missing from her.<br><br>The battle between these two anti-heroines takes place among the outskirts of Seoul, where the underclass, ignored and underrepresented in mainstream, struggles to make everyday living. Away from the shine of the glittering cityscape, the camerawork gives a gritty realism that perfectly accentuates the tight script. For a first time director, \"Miss Baek\" is a superlative effort from Lee Ji-won. Korean cinema has a rising young superstar.<br><br>VERDICT: Excellent drama, worth a watch.","user":"abhijith-alpha","rank":[0,0]}]