[{"title":"Excellent film with wonderful performances","rating":9,"date":"6 August 2018","review":"This is a beautiful piece of Scandinavian film making that held me spellbound from the first minute. The story of Astrid Ericsson's (later Lindgren) early life unfolds lyrically, with sensitive handling of the many controversies that shaped the children's author. While the cinematography is beautiful, and all performances are great, Alba August carries the film with a magical performance as Astrid. Every moment is perfectly told through August's acting, and caught by the director. <br><br>I would say that this film isn't quite as subtle as some Scandinavian films, but it's always difficult to fit life stories into a single film. This film made me want to see a series of films about Lindgren's entire life.","user":"sugarmack","rank":[49,65]},{"title":"A moving biopic","rating":7,"date":"10 May 2019","review":"Although I do not really know neither Astrid Lindgren nor her characters Pippi Longstocking, Karlsson-on-the-Roof, ... I loved the film which is based on the exceptional performance of the lead actress Alba August as well as an extremely neat photography. We might think that this film is jointly sponsored by the tourist offices and the ministries of culture of both Sweden and Denmark.<br><br>This biopic traces the life of Astrid during a small decade, in the 20s. We discover first of all a talented, mischievous and dreamy teen, then a young, fighting and resilient woman. Although the intended public of the books is very young, that of the film excludes, in my humble opinion, the children. Instructive and moving!","user":"FrenchEddieFelson","rank":[13,16]},{"title":"Great film but leaves some questions unanswered.","rating":8,"date":"13 May 2019","review":"The film itself is excellent and Alba August, who portrays Astrid, is unbelievably good in her role and well supported by the rest of the cast. The cinematography is awe-inspiring and you really do feel that you are in early 20th Sweden.<br><br>My only quibble, which prevents me from giving a full 10 stars, is that I feel it doesn't really provide the answer to the central question : why and how did Astrid Lindgren become the world-famous author of children's stories which, instead of simply preaching morality, encouraged children to give a bit of free rein to their childhood?<br><br>The film attempts to do this, of course, but in a somewhat \"Hollywoodian\" manner (Astrid is distraught at having had to give her son born out of wedlock to foster care for some time and, when she recovers her son, uses her story-telling powers to reconnect with him), but I can't believe that this was the single driving force.<br><br>The film also glides over what in more modern times would be considered as somewhat unsettling behavior : a secretary who simply cannot resist sleeping with, not one but two married bosses (and ultimately marrying the second one, who left his wife for her). The first situation is glossed over by portraying the wife as an already unstable personage prior to her husband's meeting Astrid, the second is ignored entirely (a note in the credits explains that she married Mr. Lindgren but not that he left his wife for her). I know that Astrid Lindgren has, quite properly, been considered considered a heroine to generations of children (and their parents), but I thought this was sweetening the sugar, so to speak.<br><br>Still, an engrossing and thoroughly enjoyable film.","user":"Partnerfrankreich","rank":[6,8]}]