[{"title":"What an unusual cocktail!","rating":5,"date":"9 March 2019","review":"Take a small pinch of Sleeping with the Enemy (domestic violence), a dose of Matrix (am I really real?), another dose of Finding Nemo (but reverse the father-son roles) and finally sprinkle with The Old Man and the Sea (main frame). Mix well .... Let simmer slowly on low heat ... And hop! ... without getting too tired, Netflix wrote Serenity. I seem undoubtedly teasing but the result is nevertheless correct.","user":"FrenchEddieFelson","rank":[79,99]},{"title":"Good Lord, I Loved This Film","rating":9,"date":"30 January 2019","review":"Why do people enjoy films with an abstracted hyper style, like 'Shutter Island,' or Zulawski's 'Possession' but dismiss it here?<br><br>Perhaps people are just primed to like (or pretend to like) a film directed by someone they think is important.<br><br>Another thought: Imagine something like this film made during the German Expressionist period of cinema. Silent cinema. Subtitles. Foreign. The techniques employed become acceptable.<br><br>I loved the sheer ballsiness of everyone's commitment to this movie. Matthew McConaughey, Anne Hathaway, Jason Clarke give it everything. And that only comes about by having confidence in the film.<br><br>The plot twists aren't there to surprise the audience in the manner of something like 'The Usual Suspects', they exist to create the feeling of a troubled conscience. Perhaps, that's what everyone is snickering at? When one of the most popular pass times is shaming people on social media to whom we feel superior, the idea of self doubt and uncertain morality are things we need to ridicule?<br><br>I dunno. I'll say this: I was never bored watching this film, which is more than I can for most films these days. Some day it'll find a proper following. It deserves it.","user":"cgrady-2","rank":[303,407]},{"title":"For entertainment value alone","rating":7,"date":"25 January 2019","review":"Before you get mad about the score I'm giving this beautiful mess of a film, please keep in mind that I rate things on a scale of how entertained they kept me as opposed to how \"good\" they actually were.<br><br>That being said, this movie is not anywhere close to good. In fact, it may even be outright bad. But I'll be damned if there was a single moment in the film where I was less than entertained. I laughed more during the course of Serenity's runtime than I did at a good majority of last year's intentional comedies.<br><br>The performances were attempting to evoke a noir feel but came across more John Waters and the camp factor alone was a fascinating hybrid of cringy and hysterical. From Matthew McConaughey drinking during nearly every frame of the movie to Anne Hathaway saying \"daddy\" every other line, I won't forget their acting any time soon.<br><br>The plot is a convoluted mess and some of the turns it took won't be well-received but who cares? By the time the \"twists\" twisted, I was already so engrossed by this deranged piece of filmmaking that I didn't mind one bit.<br><br>Go with incredibly low expectations, try to lose yourself in the strange spell Serenity weaves, and you might just have as good a time as we did.","user":"ndschaaf13","rank":[308,415]}]