[{"title":"\"Housewife\" - Movie Review","rating":4,"date":"12 September 2017","review":"I had the opportunity to watch \"Housewife\" during the 11th Edition of the Lisbon International Horror Movie Festival, Motel X, in September 2017. Having watched Can Evrenol's brilliant and nightmarish \"Baskin\" last year, I was really excited to watch this movie in the midst of fellow horror movie aficionados. Not only that, but the only preview I could find on YouTube was actually quite compelling, so my expectations were at their peak as I entered the movie theater. Alas, as my initial excitement faded, my expectations would soon be laid to waste. While the movie had a promising start, it quickly went astray. The acting was mediocre, at best, but all I kept wondering was why on earth would any studio hire a non-English speaking cast to speak in English for the majority of the time when these events are not even occurring in an English speaking country? It's distracting, to say the least, and adds absolutely nothing to the story. Furthermore, while most of the dialogue focuses on exposing who these characters are, what they do for a living and how they came to know each other, not much of it is truly dedicated to clarifying some of the most meaningful aspects of the story, such as the identity of the old lady in the painting or the importance of the pendant that she wears around her neck. We can try to guess and speculate, but we never really know for sure. Plus, the nudity, sex, blood and gore also feel gratuitous and bear no significance to the story that we're being told. They're just randomly thrown into the mix. The only hint of purpose is only provided at the very end, where all threads are tied together, but the ending itself failed to have much of an impact as I wasn't invested on these any characters to even care about what happened to them. There was simply not enough meat on these skinny bones. In conclusion, the acting was wooden, as there was very little chemistry between the actors themselves, the characters were underdeveloped, the plot was weak, the story was insubstantial and the on-screen violence, even though it was well executed, served little purpose apart from attempting to shock the audience. If you are a hardcore horror movie fan or if you're into H. P. Lovecraft's body of work, feel free to check this one out. However, I personally think that here are far better movies out there for you to watch, so I suggest that you don't waste your time on this one.","user":"fnduarte","rank":[19,26]},{"title":"Very forgettable.","rating":3,"date":"23 October 2017","review":"Really disappointed after enjoying the previous film from the director. I really tried to enjoy it, but the acting was so bad I couldn't get into the film. Also the severe lack of any story ark made it a really tiring watch. I repeatably checked my watch so see how long I had left. Hopefully his next film actually has a story. If you want to see it, I recommend saving it until your next hangover so you can watch it in bed without using your brain.","user":"claraclara-73802","rank":[21,33]},{"title":"Did somebody saying acting?","rating":1,"date":"8 October 2017","review":"Dear god this has to have some of the worst acting in a horror film. And not the kind of bad its good, but just plain bad its almost impossible to watch the film. Its obvious the director doesn't understand the English language so why shoot it in English? Its also shot in Turkey? The whole film is a mess. There are some pretty images sprinkles through out the film but the story isn't interesting and any kind of fleshed out character is completely absent. A lot like the directors previous film, all flash and no content. Go in with low expectations.","user":"gonholla","rank":[26,43]}]