[{"title":"a fun movie, dark subject matter","rating":9,"date":"16 April 2019","review":"Stockholm can be described as a fun and comedic film, covering a dark subject matter in order to show its audience how human beings cope with stressful, life threatening situations. The film is based on the Swedish bank heist, and hostage situation, that would later inspire the coining of the phrase \"Stockholm syndrome,\" which describes the phenomenon of a hostage forming a bond with their captor. Of the many things the film does well, what stands above the rest is the films ability to make the audience realize how someone might actually succumb to Stockholm syndrome. The main anti-hero of the story, Lars (Ethan Hawke), shows early on that all he really wants is to get his buddy, Gunnar (Mark Strong), out of jail. You the audience member even find yourself sympathizing with him as over the course of the film he goes out of his way to care for his hostages including letting one of them, Bianca (Noomi Rapace), use the telephone to call her family. The comedy in the film comes across quite well, at some points I found myself audibly laughing, and allows the audience to establish a better connection with Lars. Apart from the story, the 70's aesthetics were executed perfectly with a very pleasing color pallet focusing on shades of orange and teal, wonderful b-roll of a 70's Stockholm, and a few Bob Dylan songs thrown in for good measure. It was very enjoyable to watch and had my interest peaked right from the get-go.","user":"maxbryantx","rank":[50,63]},{"title":"Good, but could have been better","rating":7,"date":"17 June 2019","review":"Writer and director Robert Budreau did a great job directing, but his writing needed more \"oomph\". Pacing was a little slow, and not much comedy - all of it pretty much shown in the trailer. The acting however, was outstanding, especially from Ethan Hawke and Noomi Rapace. Enjoyable film on how Stockholm Syndrome was recognized as a psychological diagnosis. A 7/10 from me.","user":"TheTopDawgCritic","rank":[23,33]},{"title":"Remember the Alamo!?","rating":6,"date":"12 April 2019","review":"Greetings again from the darkness. The film opens with a title card informing us that it is \"based on an absurd but true story\". In 1973 the Kreditbanken of Stockholm Sweden was held up by an armed man. The ordeal was unusual for low-crime Sweden and it was broadcast live on TV. It has also been credited as being the origin for the term \"Stockholm Syndrome\" - a term to describe the bonding that sometimes occurs between a hostage and their captor.<br><br>Writer-director Robert Budreau wisely wastes little time with setting the stage. Lars (Ethan Hawke) dons a disguise meant to trick the police, and storms the bank lobby armed with a sub-machine gun. Wearing a cowboy hat and a leather jacket with a Texas flag, he proclaims \"Remember the Alamo\" as he secures some hostages and presents himself as Kaj Hansson, a well-known criminal. Of course, Mr. Hawke is certainly an American, and the actual robbery/hostage event was conducted by a Swede.<br><br>Lars is loud and boisterous to the cops, while simultaneously being sympathetic and understanding to the hostages - especially Bianca (Noomi Rapace), a married woman with two kids. Christopher Heyerdahl plays Police Chief Mattison, and he employs some unexpected psychological gamesmanship with Lars that gets even more convoluted when Swedish Prime Minister Olaf Palme becomes involved. Lars' real goal here is to spring his buddy Gunnar Sorensson (Mark Strong) from jail and have them both ride off to freedom in a mustang like the one Steve McQueen drove in BULLITT.<br><br>Yes, I should mention that although guns are fired and hostages are held, this is really an offbeat comedic bank heist. It focuses on how the hostages bond with their captors and how Bianca quickly realizes that not only is she smarter than Lars and Gunnar, but that the cops are more of a threat to her than the criminals. She strategizes better than either side, and Ms. Rapace (from the original Millennium Trilogy) is the standout performer in the film.<br><br>Filmmaker Budreau and Mr. Hawke previously collaborated on an intimate look at jazz trumpeter Chet Baker in BORN TO BE BLUE (2015), and they prove again that they work well together. The other two hostages are played by Bea Santos as Clara and Mark Rendall as Elov. When Prime Minister Palme refuses to negotiate or allow Lars to leave with hostages, we can sense the emotional tide turn as Clara, Elov and Bianca realize they are safest remaining with the hostages.<br><br>Of course there are some liberties with history taken for cinematic reasons, and since most of the filming takes place within the confines of the bank, we do get to know each of the participants pretty well. The similarities to Sidney Lumet's DOG DAY AFTERNOON (1975) are unmistakable, and one of the reporters covering the story even comments that it's \"almost like watching an American movie.\" The odd ending works for the film, and thanks to Ms. Rapace, there is enough heft to the characters to prevent the humor for taking over.","user":"ferguson-6","rank":[27,40]}]