[{"title":"Romans vs Vikings?","rating":4,"date":"31 May 2018","review":"Low budget affair with some decent acting in places with notable fight sequences. However they certainly got their history wrong with this title! We have Romans making Vikings fight to the death! There is no mention of a fantasy mash up anywhere in the film where clans of completely different time periods could co-inhabit and battle it out. <br><br>Apparently one of the actors was in Game of Thrones so there's merit in that, quite a good film, boring and stagnant in many places but I must commend the few and far between fight scenes, they were quite hard hitting and believable.","user":"colinthemagpie","rank":[13,18]},{"title":"A Happy Surprise","rating":9,"date":"29 May 2018","review":"Like most low budget indies tackling historical/viking dramas I started this film fully intending to stop after the first horrible ten minutes, but no. This film turned out to be a very happy surprise. Good writing, decent acting and (given the low budget) extremely well done fighting scenes, make \"The Lost Viking\" is well worth the watch. <br><br>The story is a typical Joseph Campbell Hero's Quest we've seen in countless other films but then, it is one of our more popular myths which all depends on the telling. In this case, instead of the cliched revenge cycle most of these movies follows, the writers have adopted a more intelligent and original approach in which, through his tribulations, our hero evolves into a more thoughtful and philosophical person which is far more satisfying than the typical \"he becomes king and they live happily ever after\" cliche. <br><br>If viking/medieval dramas are your thing, you could do far worse than this little gem.","user":"mzand-751-539572","rank":[21,34]},{"title":"Film School Trite","rating":3,"date":"1 June 2018","review":"Watching this movie- they seemed to take everything right out of film school. I don't know if the writer/director just graduated or what but this is as cliche as it can get. In the first 20 minutes- you have: The woman getting attacked while the man can't protect her, the antagonists son getting killed by the protagonist. The camera blurry to show the protagonist can't see clearly due to a concussion, The audio silent then distorted due to the protagonist losing his hearing. \nThe obligatory animal he shot turning into his dead sister to show his guilt.<br><br>Come on- Every trick here is 1st year Film School. Need to watch more historical drama / action movies for this to even bee ok. Only good thing about this so far is some of the acting is good- which I'm guessing is not due to the director. but due to their natural skill. I could be wrong on that- he could be a good actor director but doesn't understand how to tell a story yet though.","user":"paradoxical1","rank":[10,15]}]