[{"title":"Don't trust the 8.2 rating: this movie is garbage","rating":1,"date":"27 September 2018","review":"First of all, even though I say there are spoilers ahead, this is a movie that can't actually be spoiled, because it has no redeeming features. So it's like I warned you: hey, don't eat poop, it tastes terrible! That's not really going to spoil the experience of eating poop.\nThe story: in the future an alien race wants to dominate Earth by polluting the air so it becomes breathable to them.\nSo they send soldiers that are machines and mutants that can pass off as humans to capture human engineers to develop a giant robot able to pollute the world.\nEarth is almost completely devastated by the year 2050, but humans developed glasses that see who is an infiltrated alien, one uniform that increases the fighting skills of it's user, a time machine, and a girl developed a lot of psionic powers. \n A scientist sends 3 young people to the year 2013 to change history. They find a robot engineer that used the future info to gain a lot of money in the stock market and use the funds to create another giant robot to fight against the future alien's giant robot.\nAliens attack the engineer's brother. He's saved by the future young people, that take him to the secret base, where he meets his brother and find out about the future and the robot.\nThe engineer had disappeared 3 years ago without telling his family, so the brother is mad at him. Also, as a child the engineer promised his brother to build a giant robot so his brother could use it to fight against bad people, so he made it so that the human's giant robot could only be piloted by his brother.\nThe base is attacked by aliens. All humans escape in the giant robot, except for the engineer that gets captured.\nThe brother goes to the Moon to learn to fight with the robot.\nWhile that happens, aliens use future info gotten from the engineer to develop faster their alien robot, and send it to a big city.\nBrother returns and fights alien robot, and after a lot of BS, wins.\nAlien says he was only going to conquer Earth because it was already a planet that was going to destroy itself. They kill the alien.\nIn the original future timeline the scientist that was left behind opens the door to find that the alien robot is being defeated by a human robot. To be continued...\nIf you haven't spotted all the stupidity in this movie yet, here are some questions to help you: why the need for giant robots? Why didn't the first scientist come through the time portal? Why didn't they stop the giant robot with a nuke? How does an alien have technology to reach Earth, but not have enough technology to build a giant robot by itself, and needs to enslave human engineers to develop the technology? How did the whole human planet became polluted with only one robot polluting it? Where's the explanation to the psionic powers of the girl? Or her clothes (shorts + 2 layers of clothing on her upper body)? If they have glasses that can see who is an alien and who isn't, why aren't they using that all of the time? If they can build clothes that make people better at fighting, why didn't they build one for everyone? If they know what's the aliens are going to do, why didn't they warn the whole planet? How come the humans didn't find out about the aliens when all of the top engineers were abducted? Why did the aliens go and fight the engineer's brother? Why are all the characters and actors and plot and writer and financer of the movie so dumb? Etc. I could keep writing for hours, but this won't make this movie any better, so I'm stopping.","user":"o_oraculo","rank":[4,8]}]