[{"title":"This was a brilliant Idea","rating":8,"date":"4 February 2018","review":"It's a reality movie. It's like the Real Cancun, which was the first reality movie or an episode of Hogan knows best.<br><br>A Joe Carman Writes, Directs and produces a film about his life as an aging MMA fighter and how he juggles it with being a family man. It's actually a great set up for a reality TV show for ESPN or something, but instead he releases it as a film.<br><br>The cameras follow Joe and his family around capturing his life but Joe let's the cameras do all the talking and does not have those interviews in dark rooms you see in a bunch of reality shows. I love that, and I think it was brilliant. Doing it that way, It honestly took me awhile before I realized It was not a straight up narrative. <br><br>No wonder the acting was sooooo good, it was not acting. There were these scenes in which Joe is interacting with his parents and his children are having a private discussion about their dad that pound at your heart better than any actor ever could.<br><br>So far the best most exciting movie I've seen in 2018. This unconventional approach cinema wins the fight in my book.<br><br>","user":"subxerogravity","rank":[6,7]},{"title":"Sometimes you see a film that feels like it's fiction","rating":10,"date":"1 June 2017","review":"Sometimes you see a film that feels like it's fiction, and then you discover at the end, it's true. <br><br>I remember sitting at the end seeing the end credits roll through and seeing the name \"Joe Carman\" and then the names of all of his four daughters all with the last name \"Carman\", and part of me couldn't accept that this film was real. <br><br>Joe is an amateur UFC fighter, who just turned 40 in the film. This film will appeal to anyone who's interested in mixed-martial arts and wants to see what goes on behind the flashy fights we see on Pay-per-view, what we don't see—the intense training before sunrise, the belittlement from coaches, the ups and downs of family life, and interesting hobbies of the fighters (Joe maintains a couple goats). <br><br>But the real story is the family story. Director Jeff Unay puts us into intimate spaces like the living room, the kitchen, and the doctor's office. He makes it feel shockingly close. He made us feel like we were in the cage during the fight. And in the audience of the fight. And in the bathroom after vomiting because we had just been punched in the gut. He shot this so well, it was ridiculous. <br><br>Joe's family wants him to quit fighting; they have trouble understanding why he continues to do it. Joe is conflicted himself – he deeply loves his family, but he can't stop putting himself and his health at risk, because of the feeling of independence he gets being in the ring, one on one, with a competitor. <br><br>It's not just Joe. Every character in this film is two people at once – Joe's wife is angry and resolute, and then she's troubled and scared. Some scenes with the daughters and you think it's the happiest family in the world. Other moments you think it's the most difficult family in the world. Opponents in the ring are portrayed as brutish mutes, and later in the film, we discover that they're kind and empathetic. <br><br>I couldn't believe that the people in this film weren't actors. I studied acting, and studied boxing and Brazilian Jiu-Jitsu. These were ordinary people but they had extraordinary presence on screen, whether it was Joe's mom pleading with her aging husband to stop yelling at her 40-year old son, or Joe's teenage daughters fighting among themselves whether to confront dad or accept dad. In one scene, we see three of Joe's teenage daughters in a parking lot of a fast-food restaurant, arguing about whether or not to bring up at home the pain their dad's fighting was causing them. It was like Unay knew exactly where to be, exactly when to be there, and exactly when to focus the camera and when to zoom in.<br><br>Joe's captured rolling around in the grass with his daughters in a park, seconds later, he's beating the hell out of a punching bag on the ground at his training gym. You decide the type of man he is. <br><br>I saw this at the world premiere, and during the Q&amp;A, one woman after a couple of questions had been asked, shouted out of turn at Joe and his family on stage, \"Stop fighting!\" Immediately afterwards, a man from a different part of the crowd, and there were some MMA guys in attendance, shouted, \"Keep fighting\". It was an awkward moment, not because they were both wrong, but because they were both right. <br><br>For anyone looking to understand why Joe does what he does, I recommend reading, \"Tribe: On Homecoming and Belonging\" by Sebastian Junger, for answering what it means to be a warrior in the modern world.<br><br>There's also beautiful footage of the Pacific Northwest here so anyone from this region will be sure to enjoy that too. <br><br>Overall, I strongly recommend seeing this film. There's some aspects of it everyone will relate to, being passionate about something, having difficulties with one's families, and ultimately leaving us raw. 10 out of 10.","user":"j-maimon","rank":[7,9]},{"title":"Great Film","rating":8,"date":"31 August 2017","review":"Watched this at the Sidewalk Film Festival as a movie to pass the time to one I really wanted to see. I was pleasantly surprised! While not the most exciting movie, it was a good story about a man with moral dilemmas, split between being closer to his family or pursuing his passion. I really forgot this was an actual documentary because it was so well made. Really hope this and more great independent films get more attention in the future. Best of luck to the great family in this film!","user":"videogameisfunney","rank":[6,9]}]