[{"title":"Less an action fantasy than a fantasy romance, this third chapter of Soi Cheang's 'Monkey King' franchise sidelines its titular character as well as the mismatched travelling","rating":5,"date":"14 February 2018","review":"Though Stephen Chow's 'Journey to the West' series has been the more buzzed-about one in the last few years, director Soi Cheang has been studiously building up his own 'Monkey King' franchise. The first chapter, which boasted a spirited turn by Donnie Yen as the titular Wukong who defied Chow Yun Fat's Jade Emperor, was nonetheless a huge disappointment because of its stilted storytelling and laughable CGI; but the sequel, which saw Aaron Kwok take over the golden staff (pun intended) with a more low-key but also more nuanced performance, was a marked improvement that benefited generously from Gong Li's devilish turn as the White Bone Demon. Not surprisingly, Kwok has agreed to reprise his role in this third chapter, although this time round he's been reduced to no more than a supporting act.<br><br>Whereas most, if not all, 'Monkey King' films have played on the dynamic between Wukong and his master Xuanzang, Cheang and his writer Wen Ning have placed the focus this time on Xuanzang (Feng Shaofeng) alone. Stumbling upon a kingdom populated only by women after an encounter with an unfriendly River God (revealed later on to be a vengeful god played by Lin Chi-ling), Xuanzang falls in love with its Queen (Zhao Liying), thereby presenting him with an apparent conundrum whether to forsake his religious calling to love all mankind. But perhaps more crucially, Xuanzang and his companions - Wukong, the pig demon Bajie (Xiao Shenyang), and the blue-skinned sand demon Wujing (Him Lo) - have to first escape execution directed by the kingdom's Empress Dowager-like Madam Perceptor (Gigi Leung), who is adamant that men are the worst poison to their kind. <br><br>Alas their attempt to escape is thwarted by an invisible, magical net around Womanland, though it's not difficult to guess that the key to penetrating the spell is none other than true love itself. It's also not difficult to guess that Xuanzang and the Queen will eventually discover that secret by their love for each other - a love that will quite literally see them 'through the sun and rain', as the couple are banished from the kingdom and forced to endure both elements in a wooden boat out at sea. Besides testing the mettle of their relationship, the voyage will also clarify Xuanzang's choice between the love of one (wo)man or the love of all sentient beings; although his decision should be obvious to most viewers, since it will take a lot of gumption for this movie to attempt a completely revisionist take on Wu Cheng'en's classic, and you can probably guess that it isn't nearly that bold. <br><br>To his credit, Cheang does undertake some brave moves for a Mainland-centric film. For one, its notion of a female-only land seen against China's male chauvinistic society is progressive to say the least, especially given its people's extremely dim and fatalistic view of the male gender. For another, it handles the subject of abortion with a certain cavalier, and some would say careless attitude - after his companions accidentally drink from a fertility spring known as the Motherhood River, Wukong approaches a cross-dressing hermit in the Miscarriage Cave to obtain its tears to terminate the unwanted pregnancies. And for yet another, it depicts an unrequited lesbian romance between a mortal and an androgynous spirit that at its most audacious has a scene with Gigi Leung and Lin Chi-ling locking lips.<br><br>But perhaps its most audacious choice is to attempt a genre switch in this third chapter that turns what used to be an action fantasy into a fantasy romance. Oh yes, if it isn't obvious by now, there are hardly any epic battle scenes to speak of; in fact, there are just two - one in the middle with two big scorpions, and the other right at the end with the bitter River God threatening to drown the entire Womanland. Whereas its predecessors took pride in crediting Donnie Yen and Sammo Hung as action directors, there is no one explicitly mentioned in that role here, which is just as well given how underwhelming these two sequences play out. Diminishing the amount of action in the film also further reduces Wukong's significance - after all, he is Xuanzang's bodyguard - and gives Kwok even less to do, and the same can be said of Bajie and Wujing too.<br><br>That is ultimately a pity, because these unlikely travel buddies have established quite some chemistry. Indeed, two of the most amusing scenes in the movie are thanks to their witty banter - the very opening scene that sees them making their way down a gentle river (before being rudely interrupted by the aforementioned River God) sees some funny back-and-forth about who had taken away Wukong's pants while he was bathing; and their very first attempted escape from lock-up in Womanland, as well as their subsequent interrogation, is a riotous hoot what with Wukong's impudence, Bajie's flirtatiousness and Wujing's masculinity on full display. Tempering cheekiness with conscience, Kwok has also revealed himself to be quite a fine Wukong, and sidelining his character here inadvertently makes the film much duller.<br><br>While it is understandable why Cheang has decided to make this third chapter tonally different from the earlier two, 'The Monkey King 3' is a lot less entertaining as a result. Its philosophical musings about true love are not quite so insightful, but more crucially, it hardly gives its more charismatic performers enough screen time. It may have seemed a timely choice given the momentum and publicity that the female empowerment movement has gathered of late to adapt the quartet's misadventures in Womanland for this movie, but in the grander scheme of their 'Journey to the West', this is at best an interesting sidenote and at worst an unnecessary detour. The ending hints at a fourth instalment set to tell the more well-known Fiery Mountain episode - and on hindsight, the franchise should probably have simply gone straight there than bothered to stop over here.","user":"moviexclusive","rank":[11,16]},{"title":"This has nothing to do with the book, not with the two previous movies","rating":3,"date":"3 April 2018","review":"This movies started so well, with good design, good cgi and a apparently story unfolding to completaly stole at about 30% of it full lenght, into pregnant men, meaning of love and sacrifice through a childish and 200% boring vision to end up, like any action movie this past 10 years, into a giant, useless and pointless cgi battle. I thought that journey to the west 2 by tsui hark was a disaster, after watching this monkey king 3 i should probably raise my rating on it by 1 or 2 points.","user":"ron_capuccino","rank":[6,8]},{"title":"Not a good movie","rating":1,"date":"22 July 2018","review":"No good at all. Dont waste your time. The story has nothing to do with the 2 previous movies.","user":"blue-52550","rank":[3,4]}]