[{"title":"Had potential but falls short","rating":3,"date":"24 October 2019","review":"It appears that David Arquette is now a B-movie actor. I got the feeling he didn't even want to be on set for this film. It is the worst acting I've seen him ever do.<br><br>The story, set in the not to distant future, is about the use/miss-use of nanotechnology to create super humans. There little more to the story which seemed purely a vehicle for the fight scenes.<br><br>The only person who seemed to be putting in any effort was the lead actor Jackson Gallagher. I think he has real potential and could be a future martial arts star given the right opportunities. The fight scenes where the only saving grace.<br><br>If you're bored, got nothing better to do and like some well done martial arts action then watch. If you're after a decent story and reasonable acting give this a wide birth.","user":"mognam","rank":[12,13]},{"title":"Why did I do it?","rating":1,"date":"24 October 2019","review":"The trouble is with being such a sci-fi fan, is that I can watch any cross until the end to see if it has any redeaming features. This offering did not. Bad acting, massive plot holes and illogical story arcs makes this one of the worst films I have ever seen. Save 85 minutes of your life by painting a wall and watching the paint dry. It will be much more satisfying than this cross.","user":"DrTeeth007","rank":[9,11]},{"title":"Had potential but went nowhere. Lead actress atrocious.. BORING.","rating":2,"date":"24 October 2019","review":"Arquette must be hard up for money if he takes roles in this massive waste of a film. The premise is ok at start but then it treads water and the budget starts to show.\nIt actually becomes kinda boring and I found myself looking at phone and had it on in background.\nThe lead actress was absolutely awful. Her acting was so wooden, so bad. I actually thought she was a robot or something.\nThe fight scenes were average at best. Tedious even.\nThe song at the end also sucked. Ha ha","user":"Jester222","rank":[6,7]}]