[{"title":"Curious movie, the women have the super powers.","rating":10,"date":"10 August 2019","review":"My wife and I watched this at home on DVD from our public library.<br><br>It is set in an unspecified place at an unspecified time, it could even be a fictional parallel universe. A running theme is that water is very scarce, crops are drying in the fields, rain is badly needed, towns are becoming ghost towns.<br><br>British actress Gugu Mbatha-Raw (I love that name) is the lead character Ruth who must go on the run because of some incidents resulting from her \"gifts\" that we eventually learn run in the women of that family, passed on to each new generation. We meet both her mother and her young daughter.<br><br>It is hard to say what the story is really about. It isn't clear what their \"powers\" can accomplish, but we mostly enjoyed the movie as an entertaining 100 minutes. It appears that the ending set up for a sequel and in fact I read that Amazon has begun to make a series that probably will be available on Amazon streaming.<br><br>The filming was done in New Mexico and the small, dusty town is Estancia. Online maps street view clearly show the Blue Ribbon Bar, for example.<br><br>Pretty good movie, if you don't expect too much.","user":"TxMike","rank":[18,21]},{"title":"COLORFUL VIEWING","rating":8,"date":"18 January 2020","review":"What we have here is good story-telling. It is as simple as that. Add people who possess powers, hidden secrets, and the lure of what those powers are and what they can do. The movie may cause you to ask what would you do with these powers? Before you boast a perfect answer everything comes with a hitch in life. So you may use these powers but at what cost? Will others just stand still while they watch you do what you do? The old \"what's in it for me\" kicks in and that is why the premise of secret powers is so powerful. People with them hide them. Superman and his alternate Clark Kent is a good example as is Batman and Bruce Wayne and Spiderman with Peter Parker. Powers have a way of their own and learning to live with them and by them is not so easy. Of course you will say no problem and let me have them. Well, watch the movie then. Also pay attention to whatever is happening in this movie as it can be controlled or corrected and at some point this may dawn on you or not. There was a Twilight Zone about a boy with powers to do most anything which this story may stir up in your memory. The kid was a brat however and in the remake not so much or at least reachable. Here those with the power are still learning but hiding as they do. Interesting concept. It does entertain however","user":"Richie-67-485852","rank":[6,6]},{"title":"Relaxfully entertaining.","rating":10,"date":"4 January 2020","review":"What a wonderful movie! Not your typical \"Hollywood\" tripe. Imagination required for this one. Characters are as developed as they need be, thus insuring the viewer use their own to fill in the blanks. Excellent choices for the soundtrack, as well.\nGive this one a shot. Sit back, relax, empty your mind and be thoroughly entertained.","user":"lakatsas","rank":[5,5]}]