[{"title":"Are you kidding me?","rating":2,"date":"14 May 2018","review":"I just have to laugh at all these positive reviews! I gave it a 2 star rating (Because I reserve the 1 star rating for Asylum movies) I disagree with the other reviews. Not so hot acting, I really didn't feel it \"suspenseful\", \"thrilling\" or \"riveting\". The only reason the flick was \"thought provoking\" was due to the lack of lack of story. So it makes to try and feel in the gaps. And by these reviews, these people had more of an imagination than what's in the movie. I came to the conclusion that it was the cast members who gave the rave reviews.","user":"Max_Lucas","rank":[47,64]},{"title":"DeWeldon Wields Star Power","rating":6,"date":"20 May 2018","review":"I have seen Daneil DeWeldon portray a Tennessee Williams cross-dresser with heart-wrenching vulnerability, and in Anonymous 616 a PTSD plagued vet who unravels with terrifying believability. This actor is a chameleon who can deliver the best, the worst, the darkest, and--yes--the creepiest of the characters he undertakes to serve up to the audience so fearlessly. His next stop should be with A-listers in a mega-hit. That said, this movie was a vehicle for a mind-blowing performance by a gifted lead actor; but the story was hardly deserving of his talents. Brutal and, in many ways, offensive, I would not recommend it to people of delicate sensibilities. Not sure whether it was trying to make a statement about drug use bringing out the worst in a sufferer of PTSD, or implying that torturing prisoners of war can invite Satan into your heart. Either way, the outcome was unsavory and both the vet and the viewer end up losers.","user":"trudi_knoedler","rank":[11,16]},{"title":"What in the hell is that 6 rating for??","rating":1,"date":"14 May 2018","review":"Worst movie of this decade.!! no story no acting.. B grade, low budget crap i would say. The whole movie is a crap , just a drugs related badly shot dillusional movie","user":"xrionitx","rank":[22,38]}]