[{"title":"A journey we can all idenfity with","rating":9,"date":"15 September 2019","review":"This film was a delight. As the trip progresses the family learn more about each other and about the impact their deceased sister had on them, and they on her. They open up old jokes and old rifts between them. They have parties and panic attacks. The father is a big character, set apart from his children by a generation. We see how they spent their final moments with their sister, and how they learn more about her demise. I've said enough, just go watch the film. My only critisism is that it should have been half an hour longer.","user":"ListenToChris","rank":[9,11]},{"title":"Memories of a beloved Sister","rating":9,"date":"18 February 2020","review":"This movie is so very intimate, each member of the family had memories of their sister, some very pointed toward the stress and anguish their beloved sister was experiencing.\nEach member of her family remembers moments they shared with their sister and the funny often hilarious family moments they all had together with their departed mother.\nMemories of a dear sister unexpectedly died, their emotions run high, when each of them remembers past conversations with her; each recognize belatedly the turmoil she was in, and realize that they missed the signs of her extreme distress.\nThe cast is well chosen for their depiction of a family dynamic, have the expertise to show how the family members would handle the surprises they find along the way, very believable.","user":"Maryjnberry","rank":[2,2]},{"title":"A very slow movie","rating":2,"date":"26 March 2019","review":"This film started very slowly with numerous stops for coffee or tea and jostling for positions in a car convoy. Many shots inside of vehicle and concentrating on conversations. This script would be more suited to a play than a movie. The family group appeared disorganized which was frustrating to watch. Story didn't seem to be going anywhere fast.","user":"alsupremo","rank":[14,33]}]