[{"title":"The Legend of Robert the Doll: 4th part is not the charm","rating":3,"date":"30 March 2018","review":"Robert (2015) was a really quite terrible effort at a killer doll horror movie which somehow someway has had a sequel every year since. So here we are on part 4 and unsurprisingly I wasn't excited to see it.<br><br>The first 3 movies amassed nine out of a potential 30 points from me here on IMDB, the best by far being the third. <br><br>Here we see the Toymaker on the run from german forces, all eager to get hold of his book and the secrets it contains. If you're watching for killer doll action then you're not going to be happy, the dolls probably make up around 2 minutes of the film total. This is not a film about Robert at all.<br><br>Once again it has strong vibes of the Puppet Master (1989) franchise, but fails to live up to even their lackluster quality.<br><br>With shoddy effects, ridiculous prosthetics and a generic script this is another dud for the series.<br><br>The Good:<br><br>Well scored<br><br>Archive footage<br><br>The Bad:<br><br>Most pathetic German accents I've ever heard<br><br>Weak sfx<br><br>Badly false advertised<br><br>Things I Learnt From This Movie:<br><br>Somewhere along the way the creators thought people would be happy with a killer doll movie with no actual killer doll action","user":"Platypuschow","rank":[19,20]},{"title":"Possibly the worst film I have ever seen.","rating":2,"date":"23 May 2018","review":"Everything about this film franchise is baffling from start to finish. I only watch them for their comedy value (and believe me, they are so bad that they are genuinely hilarious). \n1) Why the 40 minute digression in the beginning, setting up the characters of the abusive husband and the runaway wife? They were completely irrelevant to everything! \n2) Why not just cast a real old man for the role of the Toymaker?? Why the extremely rubbish and unconvincing make up job on Lee Bane, who is a much younger man??\n3) In the original Robert film we were told that the doll became possessed after the boy who originally owned it was murdered. Now in the sequels we're supposed to suddenly swallow all this magic book and marauding Nazis crap. Which brings me onto...\n4) What exactly is the filmmakers obsession with Nazis? Did he just buy a bunch of expensive Nazi costumes and want to get his money's worth out of them? \n5) How on earth is the Toymaker, who already looked about 150 in 1940-whatever, still alive in 2012??\n6) Why is his sister also still alive and only about 70 years old too? And why is he German and she not?\n7) Why, why, why??? \nIf you're looking for a well made, scary horror movie, this ain't it. If you're looking for a good laugh, watch it by all means.","user":"screenager19","rank":[9,9]},{"title":"Very very bad","rating":1,"date":"7 April 2018","review":"I feel obligated to write this review because the only thing horror here is acting. Make German movie but please do not do this ridiculous accent thing. I mean Germans do have and accent but this way too much acting. It is so bad, like telenovela bad, facial expressions are so extreme it is almost a parody. The story is even worse. If there is a slightest thing I like, costumes are good and photography is not that bad. The 4 stars rating this movie has is way too much than it deserves. I will assume this would be kinda interesting if I was 10 or 7 maybe. In my humble opinion do not waste your time.","user":"dolly_valkyrie","rank":[10,11]}]