[{"title":"Our emotions, as humans, shown in an exceptional way","rating":9,"date":"6 November 2017","review":"This movie, to me, is not about how they meet, go through life or the open relationship. It is about that moment we always look for, the instant chemistry, which makes us euphoric and therefore happy. That bubble that everything is oke, everything is in line and I love somebody and that person loves me back in that moment. <br><br>The way this movie is shot, the high level of acting, it is as if you are watching your own life in some way. I think everybody can take moments from it and see what moments happen in their own life and how they react. <br><br>It is not intended as a movie to learn from, but just to hold a mirror up. It is not good or bad, just how we walk through life. To me, it is a good thing to keep realizing it. <br><br>If I had to pick one thing that stout out, I would say; that moment the bubble bursts. When you start to talk to each other and learn more about their way of thinking. At that point you are going to hear something you don't like and in an instant, your face changes and you need to deal with that emotion. That's when the euphoria stops and you try to get it back. <br><br>This review shows that this movie won't be for everybody, but watch past the first 10 minutes and get taken away by the emotions and reflect on yourself.","user":"charlotte_v_dijk","rank":[76,86]},{"title":"More a feeling than anything else","rating":8,"date":"5 November 2017","review":"Movies like these don't come along very often. This is my third Doremus film (after Like Crazy and Equals) and while Equals probably remains on the top of my list, Newness comes in at a close second. Newness explores the dangers and thrills of online dating in an urban world, where distractions are easily found and easier to be pursued. In the midst of it all, Martin and Gabriela are trying to find their way as a couple. The movie's appeal comes from its splendid directing and cinematography, which was already outstanding in Equals. The wash of hues, the angles, everything fits like a glove and helps underline the vivid and thrilling nature of the movie's theme. It feels organic, authentic and vigorous, not least due to the unadulterated performances of its main cast - Nicholas Hoult and Laia Costa (who was already brilliant in Vicotria) have chemistry coming up the wazoo, it's almost ridiculous. This movie took me on an emotional roller coaster; it's definitely not for everyone. And it's not a perfect movie by any means. Watching this movie simply felt a bit like falling in love, which - in my book - always seems like a good thing.","user":"nathaliehrivnak","rank":[58,68]},{"title":"Emotional roller-coaster","rating":10,"date":"3 November 2017","review":"My first review ever. Just finished watching this gem of a movie, and I am blown away. There were so many emotions played out in this movie, it should be impossible not to relate to.<br><br>The topic is a coming-of-age story. Two young people in the big city, who want to experience everything. And it seems like everything is available today. And your smartphone just amplifies all the choices you have. <br><br>The tone of the movie is slow and somewhat grey all throughout. Camera action and music is slow and deliberate really supporting the heavy emotions. It is not sad though. Just really intense. The movie explores many emotions and experiences, and gives you plenty of time to feel them yourself. Don't want to spoil it, but they get to go through a lot.<br><br>The main casting was really good. Actors took their time to get into the roles. Some background stories were told but only when needed. Also plenty of good supporting roles.<br><br>It all makes for a very interesting story, and as a viewer you really relate to the characters and what they go through.<br><br>It is rare that a movie has the guts and takes the time to deal with so much, and do it so well.<br><br>The subjects are bound to cause reflection, so if you watch it with your significant other, be ready to take some time afterwards to reflect and discuss.<br><br>I was very impressed 10/10","user":"danmand-36663","rank":[54,75]}]