[{"title":"Not great, but enjoyable","rating":6,"date":"9 July 2018","review":"Went into this movie with VERY low expectations, but I actually enjoyed it. Not very good, but it was still a very fun, lighthearted, and funny movie.","user":"convon","rank":[12,14]},{"title":"I Went To Action Park","rating":6,"date":"8 June 2018","review":"When I saw that there was a movie called \"Action Point\" that was loosely based on Action Park I felt obligated to see it. For those not from New Jersey, Action Park was a Vernon, NJ theme park notorious for unsafe rides and intoxicated customers and staff. \"Action Point\" was mediocre and predictable. But some movies are about the journey, not the destination. If you want to see it go to the theater ASAP because it is not doing well at the box office. It will probably be available on DVD by the end of next week.<br><br>They drank a lot of Schlitz beer in the movie. It was obviously a product placement. I don't recall Schlitz being that popular in New Jersey in the '80s. But that was before I drank ... legally. I can't remember the last time I saw Schlitz in a liquor store, but have not purchased beer in a long time. I do remember the Schlitz Rocks America advertising campaign. They sponsored The Who's first farewell tour.<br><br>I went to Action Park at least a few times as a child. I wish I would have gone as an adult. I did not realize how historically significant it was. I think I felt fortunate to escape unscathed and didn't want to push my luck. The first time I rode the Alpine Slide I saw a guy who flew off the slide and was lying face down on the grass. The sufficiently scared me to be very careful. There really were many casualties at Action Park. I think most of the fatalities occurred on the water based attractions.<br><br>There are some great Action Park stories. And many of them are true. I heard they purchased new ambulances for the town of Vernon. A lot of people blamed the rowdiness of patrons on the fact that many were New Yorkers. One of my favorite stories was when \"MTV's Headbanger's Ball\" taped an episode there featuring the band Alice In Chains. The band members did not have to wait to go on the rides. And somebody screamed at guitar player Jerry Cantrell, \"Hey burnout! Get back in line!\"<br><br>Maybe I should go into more detail about the movie. It is an R rated comedy. Maybe that is why it struggled at the box office. A lot of the jokes were people falling and/or getting hurt. That isn't very funny ... well ... sometimes it's funny. I like the tee shirts that say \"it's funny until someone gets hurt. Then it's hilarious\". There should have been a disclaimer at the end of the movie that said \"no humans were harmed in the making of this film\". Does anyone care about humans getting hurt? <br><br>Most of the movie was Johnny Knoxville's character, D.C., telling stories about his crazy theme park to his young granddaughter. He referred to his motley crew of employees as \"shitbirds\". Maybe those characters could have been more developed. <br><br>Maybe the movie could have been based more closely on the real Action Park. The movie took place in California and was filmed in South Africa. I have no idea why. Vernon, NJ was rural. Some people do not even know that there are rural parts of New Jersey. I am from the Exit 153 area so that makes me a city boy. When I was a little kid my mother's best friend and her family moved up to Sussex County. We went up to visit many times. I had so much fun up there I can barely remember most of it. They moved to the country to get away from it all. And their kids found it all. <br><br>Action Park was 50 miles west of Manhattan and considered the New York area. They showed commercials on New York TV stations and attracted many patrons from there. A lot of people blamed many of the problems on the New Yorkers. Many of the drowning casualties were New Yorkers who couldn't swim and/or drank too much. Some of the New Yorkers did not speak English and few if any employees were bilingual. New York is definitely part of the Action Park story. <br><br>The corporate rival theme park was 7 Parks. I assume that was supposed to be like Six Flags. The nearest Six Flags to Action Park was 90 miles away in Jackson, NJ. There were definitely competition, but not that close. <br><br>Action Park did provide entertainment and it heard it was usually piss poor. That could have been a very funny part of the movie. <br><br>The movie reminded me of some of the comedies I watched growing up that pitted slobs versus snobs like \"Animal House\", \"Caddyshack\", etc.. <br><br>I am trying to remember what beers were popular in New Jersey back in the '80s. I didn't drink. ;) I think my friends liked Old Milwaukee and Busch. Michelob was considered the good stuff.","user":"jefgg","rank":[31,42]},{"title":"Not A Great Movie, But a Great Movie Theater Experience","rating":6,"date":"5 June 2018","review":"There is a certain stipulation that comes with any Jackass movie. You're not sitting down for an Oscar caliber movie. You're not expecting great film. Rather, you're coming to see a bunch of dumb guys getting hit in the nuts, falling into cacti, and wrestling with dangerous animals. The real life stunts, and the sh*t these guys put themselves through for a laugh, is why you go, and it is endlessly entertaining. With Action Point, star Johnny Knoxville is going in a different direction. Instead of the film just being a bunch of sketches and stunts edited together, there is an actual story going along with it. It's a real movie, with a narrative and characters and everything, but all the stunts are done for real in true Jackass form. The blend is an interesting idea, and it's one that made me actually kind of excited for this movie. Bad Grandpa had some narrative to it, and it actually worked out pretty well. But I was interested in seeing how it would work when they went completely in on it. And it works out quite well, actually. Action Point isn't a great movie, but it's entertaining as hell. I had an excellent time in the theater, cracking up laughing with all my friends, enjoying this movie. Is it stupid? Yes, absolutely. But if you like the style of humor that the Jackass movies present, then you're going to enjoy Action Point. The movie centers around D.C. (Knoxville) who, in his elder years, recounts to his granddaughter his glory days of operating a sketchy amusement park called Action Point.","user":"themovieparadise","rank":[18,25]}]