[{"title":"Scooby Doothulu","rating":1,"date":"8 December 2017","review":"Who thought that turning H.P.Lovecraft's brooding cosmic horror into fodder for kids tweaking on Lucky Charms was a good idea? <br><br>\"Howard Lovecraft and the Undersea Kingdom\" is a sequel to \"Howard Lovecraft and the Frozen Kingdom\", and as bad as the first foray into kiddie dimension hopping was, this second go-round is even worse. The use of the word \"Frozen\" in the 2016 first feature title was nothing more than a marketing tool to sell this substandard animated feature to unsuspecting parents at Toys 'R' Us. Now we have the terrible sequel, which has faint echoes of Disney's \"Atlantis\", or \"The Little Mermaid\" (little Howard is here seen turning into a fish and becoming an acolyte of the sea-god Dagon). Try explaining all this to your seven-year old. <br><br>The title character, the young Howard Lovecraft is presented as a waifish snaggletoothed Goth kid complete with black raccoon eye makeup stolen from Robert Smith of the band, The Cure. Little Howie runs between dimensions trying to save his mother, his father, and his pet Spot who is in reality the elder god Cthulhu. The dread, horror, and insanity found in H.P.Lovecraft's tales of fear have been dumbed down to Scooby-Doo levels rendered in terrible animation that went out of fashion decades ago. What kid could follow, or understand the storyline here? It's all a sugary sort of nightmare in pretty colors and faint echoes of Harry Potter uttering spells that stop monsters in their tracks.<br><br>I watched this simply for the same reason people slow down to see a bad accident on the freeway. Some part of your reptile brain knows better than to watch, but you do it anyway. Whoever gave the go-ahead to make a Saturday morning TV cartoon out of one of literature's greatest visionaries should rethink their career arc. This stupid exercise in kiddy occultism was many things, but magically delicious wasn't one of them.","user":"Atomickid1950","rank":[28,42]},{"title":"Not a kids movie. Not a family movie. A movie for... no-one!","rating":2,"date":"8 March 2019","review":"I agree 100% with the other reviewer.\nWe sat down as a family to watch this, thinking the kids may enjoy it. After falling asleep 30mins in, due to the scientific jargon and black magic cult like script, terrible 80s animation sequences, and uninteresting scenes, even the kids soon had enough.<br><br>There is a reason why Disney is the king of family movies. It uses great stories, animated or acted well. with colour and music to keep you alert, interested and wanting more. This movie has none of those. With it's star studded voice actors, you'd expect they had a decent budget to make something great. So what happened?<br><br>One of the worst movies I've seen in a long time - and we watch a lot of movies! I feel sorry for the kids sitting through it, as I don't think their minds were expanded or helped in any way.<br><br>Give this one a miss. Watch anything else. Or just read a book for 90mins. You'll feel much better for it.","user":"Zelnak","rank":[4,8]},{"title":"Absolutely love this child version of hp lovecraft","rating":10,"date":"19 October 2019","review":"My 3, 5, and 9 year olds absolutly enjoyed this movie. We sat and watched it as a family . Great animation and story. Cant wait to watch the last in the trilogy. Huge Lovecrft family.","user":"mjsbaby-03495","rank":[1,4]}]