[{"title":"Starts excellent, finishes ok","rating":6,"date":"26 August 2018","review":"Anna and the Apocalypse is a fun film that starts excellent and finishes ok. The early songs are extremely good and worthy of any high end musical out there. The lead Ella Hunt is a star in the making with not only great vocals, but a believable performance as Anna. Whilst she could stand firm in any west end musical, I feel her talents are destined to stay with the silver screen, as she is able to capture beautifully subtle facial expressions which make the character very likeable and real.<br><br>The support vocals and acting are very good from some and ok from others, but overall it never lives up to the strength of the opening 30 minutes.<br><br>The horror zombie element was very well done and a similar quality to Shaun of the Dead, but I wonder if this could have actually been two separate films. One musical and one comedy horror, as it did both fairly well, but for me they didn't mesh together well enough to sustain for the whole run time.<br><br>Not enough cool zombie kills for horror fans and not enough quality songs for musical fans.<br><br>Overall though, I enjoyed the film and would recommend it to any fan of either genre.","user":"justinhyne","rank":[62,84]},{"title":"Delightfully ridiculous, albeit not quite perfect","rating":7,"date":"3 November 2018","review":"As far as Christmas-themed zombie musicals go, Anna And The Apocalypse has to be the best out there. With a gleefully silly premise that's backed up with some strong comedy and entertaining performances throughout, the film proves an immensely enjoyable watch, and although its musical side may leave a little to be desired, it's still an absolute delight from beginning to end.<br><br>Given its core premise, comparisons with the likes of Shaun Of The Dead are inevitable, but the brand of humour here is a little more on the nose than Edgar Wright's comedy classic, something that led me to remember Attack The Block, which is far more similar to Anna And The Apocalypse.<br><br>So, if you're a fan of Attack The Block, then this will surely prove an entertaining watch once again, as it takes its small-town setting and blows it up with a chaotic zombie outbreak, turning ordinary secondary schoolers into undead-slashing masters as they attempt to make their way across town to safety.<br><br>Given that the film attempts to blend so many (seemingly incompatible) genres together, certain parts of the movie are bound to stand out more than others, and while the Christmas and musical elements don't quite hit the right beats every time, the zombie comedy-horror is at least a consistently entertaining side to the movie, continuously growing and growing throughout in equally impressive form to any serious horror flick.<br><br>It's not a scary film by any means, but as far as zombie films go, Anna And The Apocalypse does a great job at getting the undead just right - not making them too powerful like World War Z, but still giving them a little bit of menace to keep the tension and excitement there throughout.<br><br>But the horror stuff wouldn't work so well if it wasn't for the excellent comedy throughout. I won't say that every single joke lands throughout, but the majority of the humour here is hugely entertaining, and with its playfully ridiculous vibe (particularly in the early stages of the zombie outbreak), it managed to put a big smile on my face.<br><br>When it comes to the film's wide variety of other genres, things don't work out quite so well. Although it occasionally adds a pleasant quirk here and there, the Christmas setting doesn't really play that much of a role in the movie. None of the songs are particularly festive-themed, and despite a nice bit of decoration in the background, come the end this doesn't feel like it has any outstanding Christmassy-ness, which I was a little disappointed by.<br><br>However, the boldest part of Anna And The Apocalypse is that it's a musical. And it's not just a movie with a couple of quick songs, there's a good handful of big musical numbers that take up a large part of the film.<br><br>Does it work? Well, while I have to say that I was impressed with the film's confidence and audacity in sticking with the musical genre right the way through, it's not something that adds immensely to the movie's wow factor. It's not a bad musical, and with the exception of the opening number, the songs aren't jarring or particularly disruptive to the flow of the film, but the songs themselves aren't all that great, and each musical number doesn't really add anything to the film's story in the way that the best musicals do.<br><br>Of course, this is never intended to be an all-time classic movie musical, and with the objective of simply being quirky and enjoyable, the film does a great job, but it is something that doesn't quite pay off in the manner that the filmmakers intend to, which is a shame to see at times.<br><br>Overall, though, I had a lot of fun with Anna And The Apocalypse. Blending a whole range of random genres together, it proves a delightfully silly watch that, despite not always hitting its beats perfectly, will leave you laughing and smiling throughout.","user":"themadmovieman","rank":[48,72]},{"title":"Amazing genre bend and a delightful time","rating":8,"date":"2 August 2018","review":"The best part of this film to me is it's ablity to not only combine two completely different genres (horror and musicals) seamlessly. It also shifts the seriousness of the film with out throwing the tone off at all. I also have to say the the songs and score fit perfectly in the film and are incredibly well done. It is some of the most fun I've had watching a film in a long time and hope to see more from these film Makers.","user":"hoescjac","rank":[44,74]}]