[{"title":"I kind of liked it...","rating":6,"date":"26 June 2019","review":"First of all, I have nothing to do with the folks who made this film. No bias here, just my honest opinion. Well, maybe a little bias since I'm a sci-fi nut in general.<br><br>I thought the story held together decently. Not perfect but I've seen worse...\nActing was decent, effects were decent... I'd watch it again.<br><br>Not sure why so many dislike it, I'm gonna go with \"matter of taste\".<br><br>Not a block buster but not horrible either. Perhaps watch it as a \"warm up movie\" on your movie evening, then you'll still have something better to watch IF you don't like this one.","user":"peter-2002","rank":[21,24]},{"title":"Should be called - Attack of the shill reviewers","rating":2,"date":"8 June 2019","review":"I really wish IMDB would screen reviewers. The other two either are friends of the actors or paid by the production company.<br><br>Bad acting, boring and snail pace movement with no direction. What else... bad writing, ridiculous special effects and just plain blahhhh.<br><br>It is mostly just a group of people (and yes, they know each other...mostly) with no acting skills talking with occasional flashback that made no sense. Difficult to follow and hard to watch. Also a bad version of the Matrix's Oracle (an obvious copy), and I'm still trying to work out the 'Generals' rank with staff sergeant stripes? pips changed from 3 to 1 during the movie, perhaps someone could enlighten me.<br><br>Don't waste your time, not even worthy of a B grade, a 2 because I was having a good day.","user":"andrewrye-06535","rank":[63,85]},{"title":"Bad","rating":4,"date":"16 October 2019","review":"Greetings from Lithuania.<br><br>\"Project Ithaca\" (2019) had its moments and had a potential - i liked the concept (main idea), but unfortunately the execution wasn't any good. The plot left me confused, but its not its biggest fault - biggest fault (and there are many of them), is that this movie had any character development - i did not care about anyone or anything here. Also dialog were only like exposition - its like characters were trying to explain the plot to each other and audiences during the whole movie, which at running time 1 h 24 min. dragged.<br><br>Overall, this movie wasn't well made and had a very confusing plot. Add here a small budget and zero creativity to the material, and you have a bad movie. Its not a worst movie ever, but that does not give it additional points.","user":"851222","rank":[5,5]}]