[{"title":"A charming portrait of The Avett Brothers songwriting and recording process","rating":10,"date":"17 March 2017","review":"May It Last premiered this week at SXSW in Austin. The crowd was a mix of festival goers and die-hard fans of the band (made possible by a generous invitation by the band.) And while the film was,in part, preaching to the choir, it is a successful project that will likely play well to people with little or no knowledge of The Avett Brothers. The use of music is glorious. Songs are allowed to play out in full, but it never slows down the pace of the film. The music sounds rich and full in the theater and the casual observer will leave the theater with a good primer on Avett music. Watching the Brothers write together, play ping pong or help their father with chores, we see a group of people who love deeply, work hard, and have a lot of fun together. Some personal stories are shared, but it never feels intrusive. I love music documentaries and count myself as a huge fan of The Avett Brothers, but I also see this as a film that shines a light on the writing and recording process, shows the sacrifices that band members and their families make to sustain their careers, and show that important and meaningful words and music can be created without sacrificing integrity, important family moments, and a lot of fun along the way.","user":"barkleybug","rank":[16,17]},{"title":"Beautifully Done","rating":10,"date":"25 March 2017","review":"I was excited to see this documentary at SXSW a couple of weeks ago. I didn't even know that anything was being filmed until an email was sent revealing that May it Last would be screened at The Paramount in Austin. I didn't know what to expect, but I figured it would be one of those films that shows the making of an album, which I would enjoy as well. But this was so much more.<br><br>I wish I could write more eloquently what I felt while seeing this because it felt both like I was at a concert (all of the fans were singing along) and getting to see behind the curtain. <br><br>As a huge fan of The Avett Brothers, I have enjoyed their music for years and often wonder what their process is when writing music, or what inspired different songs. And then Judd and Michael gave us this. I cannot commend them enough for the time they spent to share these talented men with us. Scott and Seth allowed us into their lives, their families, and their music while creating True Sadness and it was beautiful.<br><br>A personal favorite song of mine is No Hard Feelings - truly a moving and emotional song for me. There is a point in the movie where the guy are recording this song and their reaction when it is completed show us two raw, creative, emotional men who put everything into their music. In the end, this experience of watching them and their journey was wonderful. It's clear that Seth and Scott inspire and respect each other and I hope we will continue to hear their music for many more years.","user":"tonyakillian","rank":[4,4]},{"title":"May it Last?","rating":10,"date":"4 August 2017","review":"Seen at the outdoor NewportFILM summer documentary series in RI last night. We tend to go to the series because it is a fun summer evening thing to do. The selected films can be a bit uneven - but that's usually offset by a soft evening out under the stars. So I'd also never consciously heard of the Avett brothers and wasn't expecting much either way.<br><br>What an EXCELLENT film. As record producer Rick Rubin says on screen at the outset - \"Think of all the brother groups that eventually fall to infighting - these guys haven't\". The film then explores through interview with principal characters their honest and hard work ethic and grounded family life that probably significantly contributes to this. Intimacies are shared briefly - except for bass player Bob Crawford's life threatening family health issues which had a significant effect on the band being able to operate while on tour. Other intimacies are hinted at but not deeply explored - just enough for you to see how it affected how the music developed over the years. Vignettes of how the brothers write a song, record and integrate with family life keep the whole thing moving along. As band members are recruited they introduce themselves to the time line and comment on what it is like to be in the band.<br><br>Technically the film is constructed around shooting in 2012-15 with archival footage before that and some later material added on the end. The increasing texture of the film demonstrates the increasing power of the band. Not with volume - but with the competence of the playing and quality of the material they are singing. An almost continuous soundtrack of full songs, not edited supports the story.<br><br>Near the end of the film the full on recording of \"No Hard Feelings\" shows the true cost of performing and the differences between the brothers. One compartmentalizes the session by the quality of the playing, the perfection of hitting every chord correctly and singing every note on tune. The other - completely emotionally drained and unable to continue to the next song without a significant time out.<br><br>As the movie then moves to a wrap from this high - the scene is a Madison Square Garden concert filmed after the bulk of the film - you see a changed band on stage - the style and dress is different and of course there is new material.<br><br>Of course the band will keep developing. But will it last?","user":"swjg","rank":[3,3]}]