[{"title":"Overly generic.","rating":3,"date":"16 January 2018","review":"While Taraji P. Henson shines as the lead role, Proud Mary is simply a thinly written, chopily edited, and overly predictable action film.<br><br>What started off as a classic, nostalgic feel, is now every other action film cliche that we have seen countless times.<br><br>Again, Taraji is really the only actress who was able to save this film.","user":"nintendo-60208","rank":[45,60]},{"title":"Wanted to love it......","rating":5,"date":"22 January 2018","review":"Not a fan, the story was all over the place and unbelievable. I love Henson as an actor, but this movie is better left for cable and not worth the price of a movie ticket.","user":"edeninvsvs","rank":[38,50]},{"title":"The most disappointing part of this movie is that it is so disappointing.","rating":3,"date":"14 January 2018","review":"Our take: Not worth the 88 minutes of your life.\nPost credit scene? No.<br><br>There was so much potential in this movie that was squandered. Henson shines in almost everything she's been in, and Billy Brown (as Tom) has held his own on How to Get Away with Murder. The plot isn't the worst either. Yet, what came out was a mediocre movie.<br><br>The first issue we noticed was the weird scene changes both literally and tonally. At times, a transition would come in the middle of a scene, out of nowhere, in an extremely obvious, and not at all sophisticated fashion (think the screen-wipe transition you can use on PowerPoint). Tonally, all scenes would start out fairly mundane, jump immediately to something that was meant to be profound and thought-provoking, and then fall right back to a casual exchange in less than five minutes. It was awkward and left a bad taste in the mouth. Moviegoers are lucky that the movie is only 88 minutes long.<br><br>The half-assed dialogue, the utter lack of character development and non-existent chemistry made it impossible to recover from these mistakes. Essentially, it seemed that this movie's main goal was to have a shootout scene set to \"Proud Mary.\"<br><br>Big wheel keep on turnin' BAM BAM\nProud Mary keep on burnin' BAM BAM\nRollin', BAM BAM rollin', BAM BAM rollin' on the river BAM BAM<br><br>It would have been an effective short, because this scene was really awesome, save for the fact that members of a major crime family can't seem to land a single shot.<br><br>In a world where people are hungry for more movies featuring POC and women in the lead, the filmmakers do a big disservice by making a subpar movie. Couple that with the complete lack of marketing budget this film seemed to have (perhaps because they had already sunk $14M into what they realized was a lackluster final product) and it's no wonder this film opened 8th behind a busy holiday release slate.<br><br>Featuring: A movie set in Boston with ZERO Boston accents. But the Russian was good? (Probably because they hired actual Russians.)","user":"SmashandNasty","rank":[44,60]}]