[{"title":"Now This Is How You Make A Low Budget Movie","rating":9,"date":"14 August 2018","review":"I went into this movie having no clue what it was about and wasn't expecting much, but I loved it.<br><br>There are innumerable movies with huge budgets that simply fall flat, and Upgrade, with a Budget of around $5,000,000, which doesn't cover the cost of catering on some of these huge budgeted flops, honestly looked like it cost a lot more than it actually did.<br><br>Intelligent script, good action, very few unnecessary scenes, and though I thought it was sure to let me down, a very good ending.<br><br>And although I have seen much of Logan Marshall-Green's work and was never a huge fan, he does a very good job here.<br><br>Recommended.","user":"Athanatos173","rank":[746,805]},{"title":"Wasn't what I expected","rating":8,"date":"1 June 2018","review":"The commericals made Upgrade look like merely a sci-fi action/revenge flick, which it kind of is, but there was more to it than I expected. I'm glad I saw this.<br><br>The film contains tight directing, acting, and music as well as some creative kills. I was very impressed with some of the futuristic decor in this. <br><br>The plot is fluid and competently handled. Though some parts are predictable, the movie really did play against expectations in one part I won't give away, and overall the film does a good job of surprising.<br><br>The film does get darker than I expected, but I understand where the filmmakers were going and credit them for taking risks.","user":"jwwalrath-227-85487","rank":[532,590]},{"title":"Was not expecting it to be SO GOOD","rating":10,"date":"1 June 2018","review":"This has seriously become my favorite AI movie to date. I can't believe it was low budget because it's impossible to tell apart from the unknown actors who all do an excellent job. I will do my best to replace its lack of marketing with recommeding it to everyone. I was expecting something entertaining and instead got an amazing plot with a mind-blowing ending. If you enjoy this genre, you can't let this one pass you by. What everyone says is true, it's like a long, perfectly executed Black Mirror episode. I rated it 10 stars for the simple reason that I could not fine anything wrong with it or anything I didn't like. From beginning to end, this movie is amazing. I cannot recommend it enough.","user":"natygance","rank":[754,841]}]