[{"title":"Pathetic","rating":2,"date":"13 August 2019","review":"I saw this lamentable movie, by chance, on TV, because it had started immediately after the previous movie, without any intermediate ad. I watched 5 minutes out of curiosity, then 10 others to confirm the mediocre quality. It's completely daft! The script, the dialogues, the actors' play ... everything rhymes with cheapness.","user":"FrenchEddieFelson","rank":[8,12]},{"title":"Enjoyable, but nowhere as good as the first two movies","rating":5,"date":"28 October 2017","review":"This is the third part of a trilogy and as such the novelty of the scenario is fading. The first movie was surprisingly good and not as expected. The second movie played in an entirely different environment which added a few new elements to the story. Now the third movie's setting is back where it all started: at school.<br><br>To me it seemed like the movie does not really know what it wants to do. In the first two movies, the main protagonist (the ex-con teacher) gradually opened up to the children, became friendlier, and started to care for them. This movie reboots the whole thing by making our guy dislike the children at first, only to let him warm up throughout the movie once more. In general the movie seems to re-establish many things for viewers who have not seen the first two movies. The same thing goes for the jokes, which are very similar to the two previous movies, too similar even. Overall I just felt like the two movies never happened and we are seeing more or less the same thing again. Maybe this is why the first half-hour of the movie also seemed a bit like not having a clear purpose at all. The movie wants to establish the situation, but not really. It wants to continue where the predecessors left off, but not really. It throws around jokes that are not new, really.<br><br>The second part of the movie gets more interesting and starts following a clearer story-line, albeit in a linear and predictable way. This is not unsurprising for a comedy, but compared to the predecessors it is just not as good.<br><br>If you truly enjoyed the first two movies, you will still like this one. If you did not care for the first two movies, this one is definitely not for you. It suffers from exactly the same problems as similar trilogies at the point of the third installment. Take Despicable Me for example. Not a bad movie, just nothing new and no surprises for the viewer.","user":"mrpanda-00412","rank":[23,45]},{"title":"Road to the A-Levels painful and predictable to watch for any audience member","rating":2,"date":"16 October 2018","review":"\"Fack ju Göhte 3\" or \"Suck Me Shakespeer 3\" is a German film from 2017, still relatively new, and as the title gives away the third installment of its franchise. It was clear before that already that this would be the last film and that it would end as a trilogy. The man behind this is Bora Dagtekin and his lead is Elyas M'Barek and these two have worked together on projects begore FJG already. Now what can be said about this one? I think the original film, a huge commercial success, was tolerable, the second was pretty weak and this one here is just plain horrible. So the winner you could say is Karoline Herfurth who decided not to return to play the protagonist's love interest. The only winner I guess. Still they got a decent cast together as there would be no doubt that this is gonne be another commercial success, which sadly says nothing positive at all about German theater audiences. Jella Haase is back of course as Chantal and maybe she is the central female character this time. Katja Riemann is back as well sharing some screen time with Sandra Hüller who somewhat fills in for Herfurth and I think she is a pretty talented actress, not only in Toni Erdmann, but yeah she is terrible here, which is probably more becazuse of the way the character was written than to her performance. Chantal gets away with Toxic. Hüller doesn't. Good actors and actresses like Maertens, Harfouch, van Acken and Hermann are wasted with minimal screen time. Sucks to see somebody go from being a Fassbinder regular to Fack Ju Göhte. Oh well, the comedy is at the film's very core. The film does not feel fluent at all, but it relies on individual scenes. One or two were mildly funny perhaps, the rest is trash and that the film runs for a massive 110 minutes (plus another 10 minutes of credits) is not helping matters at all. It's never funny, let alone laugh out loud funny. Had this been the only problem, maybe I could have been more generous with my rating as I rarely give 1 out of 5, but yeah, the film tries to make important statements on crucial subjects like bullying, suicide, poverty, struggling mother-daughter relationship, violence, career paths etc. and it takes itself so painfully important at times that it is just horrible to watch. Of course, it is also an extremely predictable movie. The conflicts all feel like nothingness and are solved right away. I mean if a core conflict is a teacher buying magazines by one of his students that she things people read them, then that says it all. Everythign of course turns out happy, everybody succeeds with their exams and A-Levels, the teacher ends up loving his job and succeeds at his own test where superiors watch the way he handles his class. Also after school the kids are all successful. And maybe the most cringeworthy moment is how and what this film is trying to sell us as art and creative painting and how one boy succeeds with his unorthodox method. So yes it is an unbearably bad 2 hours and I recommend everybody with decent taste in film to stay far far away from this one. Unless they love other crap like recent Schweiger and Schweighöfer films. Then they will probably appreciate this one here too. It's not cool. Not smart. Not deep. Not insightful. Not charming. Just plain bad. Best decision in the process of making this film? To end the franchise afterward. Highly not recommended.","user":"Horst_In_Translation","rank":[9,23]}]