[{"title":"I was taken by surprise with this film","rating":8,"date":"22 February 2020","review":"This is my first user review and I really feel like this movie deserves more than the current 6.3 score. Most of the negative reviews dig into the hows and why's of the Cold War, but has nothing to do with this movie. Okay, it's fictional and probably won't fit how things really went back in those days but there is so much good to say about this movie.<br><br>First of all: the acting performances are really great. Every personage fits well and keeps the story alive. Dohn Norwood is once again great. His mimics, gestures,... really blend in.<br><br>The atmosphere also gets really good. Dark, cold,.. it really sucks you in and make your experience the tensions of that moment in the Cold War.<br><br>This movie really surprised me and is well worth your time.","user":"sidameel","rank":[25,27]},{"title":"Good cold war entertainment.","rating":7,"date":"23 February 2020","review":"I watched this largely because it was pointed out to me by someone who knows I'm a big chess addict.<br><br>Clearly there are a lot of liberties taken here, kind of mixing the 1972 Fischer match with the 1962 Cuban situation, but I believe this artistic license was justified. Just do not go into the movie expecting historical accuracy in the chess sense. Reviewers who gave really bad reviews based on that are entirely missing the point.<br><br>A decent watch.<br><br>7.5","user":"corteseconsulting","rank":[17,18]},{"title":"A decent cold war movie with a few mistakes","rating":5,"date":"8 February 2020","review":"The Coldest Game is a relatively unknown film whose scene is set in the deepest moment of the cold war, i.e. the Cuban missile crisis. It is a well made film, professionally directed and produced, despite a slightly old fashion a d artisanal look-and-feel. The plot, though well conceived, is affected by a few mistakes which to a certain degree put me off; one is a detail of general context: every time the players get of the cars there is a crowd of paparazzi waiting for them....paparazzi in Warsaw in 1962? Excuse me?\nThen there are a few more substantial mistakes regarding the espionage tradecraft: is it possible that there was no more discreet place for a Russian spy to pass a super secret microfilm to the opposition than a crowded chess world championship at the centre of everybody's attention? Lastly, there are a few too many murders, and it is well known that killing was a means used very very exceptionally by field agents in the course of their operations.\nNevertheless the movie is a decent one and quite watchable.","user":"gcarpiceci","rank":[46,58]}]