[{"title":"The greatest cinematic depiction of modern Korean history","rating":10,"date":"3 January 2018","review":"For the past decade, South Korea has steadily presented motion pictures based on real life figures and events in its modern history. May 18 (2007) and National Security (2012) were solid movies, well-intended and meaningful, but generally deemed too serious to reach a large audience. A Taxi Driver (2017) was a huge commercial success, grossing $88 mil/12 mil admissions in the domestic box office. Still, many regretted that the movie left something to be desired in terms of cinematic quality.<br><br>And here at the end of the year that commemorates the 30 years of the June Democratic Uprising came a motion picture that delivers both an accurate account of history and ample entertainment value. Despite a complex plot with a large ensemble cast (K-movie fans will have a blast recognizing those faces!), the movie never loses its focus--not a single scene redundant or wasted. Opening with a death of a college student during a police interrogation, the movie spends the first half of its running time as a well-crafted political/crime thriller. Then more characters appear and more things happen...which all culminates in that fateful day in June 1987. <br><br>To those that are not familiar with contemporary Korean history, the plot may seem contrived. But almost all speaking roles in this move are based on real life figures, with their motives and actions intact, which I believe makes the whole story even more astonishing.<br><br>E. H. Carr defined that history is an unending dialogue between the past and present. I would say that this movie is a superb example of how a motion picture can facilitate such a dialogue.<br><br>10/10","user":"Woody A","rank":[48,49]},{"title":"impressive and explosive","rating":10,"date":"13 February 2019","review":"I shall be the first to admit that i dont know much about south korean post korean war - till present day, i do though remember the student uprising that was mentioned in norwegian news, ''crazy punks'' i thought then, but that was then. after watching 1987 that covers the run up for the june struggle ,i have got another insight angle, and do see better what they fought for, that nearly let south korea into a stand still due to protests and general strikes until the regime and president were overthrown.<br><br>this is one of the best east asian movies that i have seen. the acting are very convincing, the grave violence and brutal force that the anti commi squad were using were plausible, as where the scenes of grief , sorrow and pain. espescially the screams of the captured victims were gruelling real. there are so many actors, so to accentuate any would be unfair, because the spirit seems to be filled with pride just to be a part of this project.<br><br>the cinematography are great, the unbelievable number of locations and setups, and the direction of the crews and extras are impressive.the pace are definately not slow, the narrative story are extremely well told,the plot and timeline are easy to follow, magnificent editing and the make up and bad weather department have extended their limits of their profession..<br><br>there have been used a little bit of visual effects,and some real news coverage to fill the base of the story, very well balanced.<br><br>the high tension , and the tragic loss of lifes , did really affect me. so if you are gonna watch this flick of 10 stars , do read some political history of south korea in the 1980's before viewing the film 1987, that will enhance the impression of this historical drama. its highly recommended by the grumpy old man.","user":"ops-52535","rank":[10,11]},{"title":"What 1987 wants to tell 2017's generation*","rating":8,"date":"2 January 2018","review":"This is a movie more than a movie. It's also a history, emotions and lives in Korea, 1987.<br><br>No actor(actress) has been consumed in vain in the movie.<br><br>Every moment is well directed. This is the great movie such like 'Citizen Kane' and 'Shawshank Redemption'. It's a historical movie, a humanism drama dedicated to freedom fighters all around the world.<br><br>*. 1987: The direct democracy has been declared in Korea.\n2017: The corrupt government has been collapsed in Korea.","user":"wolfzrain","rank":[18,22]}]