[{"title":"A Charming New Spin on the Tradition of British Rom-Coms","rating":8,"date":"18 April 2017","review":"Finding Fatimah is the latest in a long line of British rom-coms, but unlike the countless Hugh Grant vehicles we've seen in the past, this one puts a unique spin on things.<br><br>It features Muslim characters but their religion is never the focus of the story. As a white, atheist, I frankly found it refreshing to see characters from these walks of life who weren't terrorists or the bit-part owner of a corner-shop.<br><br>The film obviously stems from a very low budget, but that almost adds to the charm as it helps everything feel that much more sincere. And the film's charms really are its strength. The two leads have a wonderful chemistry and are set to be big breakout stars if their work on this project is anything to go off of.<br><br>Along the way, they bump into a slew of cameos like Dave Spikey from Phoenix Nights, Ewen MacIntosh from The Office and a whole slew of Eastenders and Corination Street stars, which all help to keep things light and funny.<br><br>Ultimately, the film is a rom com and doesn't exactly try to break that mould so much as it takes it and does it very well. Imagine Bend It Like Beckham as written by Richard Curtis and you're almost there.","user":"BillCarrBrooms","rank":[12,18]},{"title":"Not my cup of tea. Dull and dragged out","rating":2,"date":"4 January 2020","review":"Been waiting months to watch this film with my wife than decided to pay on prime and have a movie night expecting something fresh and new.<br><br>Started off well with the movie but then became long and boring. As a Muslim, I know what is allowed and not within Islam. This film shows it is okay for you to meet a potential life partner without the presence of a \"mahraam\". In other words, creating new ideological thoughts for the new generation. Overall, the film was just nonsense to be honest.","user":"mj-80986","rank":[6,8]},{"title":"What happens when you get a government grant to make a movie about minorities?","rating":1,"date":"29 March 2020","review":"Take Ali G and combine it with Four Lions, then remove all traces of humour - and you've got Finding Fatimah in a nutshell.<br><br>It's really little more than someone capitalising on government grants for the production of movies about and/or catering to minorities in the UK; the script is entirely unnatural and rushed, and the casting appears to have been a mediocre attempt at a shoe-in to fit the script.<br><br>Definitely a \"don't bother\" experience.","user":"Angry_Santa","rank":[1,2]}]