[{"title":"A Powerful Account of Man's Tragic Death","rating":9,"date":"14 March 2017","review":"Blood is at the Doorstep was extremely well-received at its world premiere at Austin's SXSW Film Festival. It does a beautiful job of telling the story of the tragic killing of 31-year-old Dontre Hamilton by Milwaukee policeman. While the concept is very similar to Stranger Fruit (about the death of Michael Brown in Ferguson, MO), Blood is at the Doorstep is a much better film. It is a less angry and less propagandistic film. It tries to tell the story in a way that presents an honest picture of the victim and which clearly documents the institutional racism involved in the police action and the criminal justice system. It is less about trying to reconstruct the crime and more about the reactions of the family and the movement that grew out of Dontre's death. It tries to show how the community reacted. The tone was less about accusations and more about trying to develop a space for healing the community following this terrible injustice. I hope this film is widely distributed, because more people need to see this take which really points in the direction that the movement for racial justice should be going.","user":"JustCuriosity","rank":[8,10]},{"title":"Amazing documentary about a family's loss and their fight for justice.","rating":10,"date":"20 March 2017","review":"I saw \"The Blood Is At The Doorstep\" at its premiere at the 2017 SXSW Festival in Austin. Am amazing film about a a family's struggle at the loss of a beloved son, a victim of a police shooting. The film follows the family through the pain of losing Dontre and how they bond as a family and battle for answers and justice. The film is as heartbreaking as it is intense. During confrontations with local police and the justice system, you become immersed in the film and feel like you are part of the story as it unfolds. This documentary was masterfully done.","user":"dljung","rank":[2,6]},{"title":"Poorly done.","rating":4,"date":"27 February 2019","review":"I'm normally all for movies and documentaries about injustice and police corruption, as it should be shown since they always get away with it, over and over, but in this case it wasn't very pleasant to watch. It all looked fake and done by amateurs. I'm not saying the story of Dontre Hamilton isn't sad but the movie about it just doesn't make it justice. I struggled staying awake more than once with The Blood Is At The Doorstep and that shouldn't happen when you watch this kind of stories.","user":"deloudelouvain","rank":[1,2]}]