[{"title":"Don't be fooled !","rating":1,"date":"14 February 2019","review":"I went into this because the subject matter of sex addiction sounded interesting, but could find no reviews , even from critics and no trailer. I made it through 20 minutes and I can see why. If your're expecting to see even a low budget film on sexual addiction as this film claims, forget it. The movie, like some cheap 1950's horror film, even opens with some old man telling the viewing audience this is a film about sexual addiction that may horrify you. What follows is a grainy , student project type film with bad acting, a loud voice-over of the lead actor's conscience and in the 20 minutes I watched, one male bare buttocks and some breasts. There is nothing erotic here, nothing about sexual addiction, just nonsense. The writer and director is also the star and every line he utters is delivered in the same flat monotone as if he were mentally challenged. I fast forwarded through the rest and saw some people wearing masks, a scene where the lead talks to a theater of empty chairs and more poorly filmed grainy scenes of people talking. If you have a craving to watch bad acting from unattractive amateurs shot on no budget with an old camera-phone this is your movie.","user":"hampersnow-28905","rank":[36,42]},{"title":"Really? The movie broke midway through?","rating":1,"date":"22 February 2019","review":"You'd think with this subject matter some level of explicitly would come into play.<br><br>Jake you're a moron not a sex addict.","user":"johan-77905","rank":[5,9]},{"title":"Strange Independent Film","rating":5,"date":"15 February 2019","review":"Like most people who stumble across this obscure independent film you will probably be lying if you say you weren't drawn to the storyline of a young sex addict hoping to see some soft porn. Unfortunately you don't see that, but what you do get is an honest portrayal of a lonely strange attractive young man living a seedy lifestyle of prostitutes, S&amp;M and having a somewhat unnatural interest in his sister. The above reviewer is right, the lead does deliver his lines in a flat monotone and his acting is not the best but that helped make this movie realistic in a documentary style I thought. For a first effort, director/writer/star Ricki Hostutler has done an above average job, just don't watch it expecting to see anything other than a documentary-style character study with a view bizarre imagery thrown in for good measure.","user":"jakegormander","rank":[5,9]}]