[{"title":"A competantly done film, just flawed in execution and suspense.","rating":5,"date":"21 May 2018","review":"Pros:\nCinematography is well done\nActing is exceptional at moments\nPractical effects were decent<br><br>Cons:\nThe soundtrack of the film is a bit overbearing and often leads to more of a sensation of melodrama rather than suspense\nThe feeling of dread and suspense doesn't really kick in until the later half of the film\nThe film relies on multiple occurrences of look in direction, nothing there, look away, look back, somethings there. This happens to end up flawed since suspense is not built up enough for these moments to pay off<br><br>Overall, a good watch but I wouldn't suggest paying a full price of admission to a theater. The film feels more at home on a movie streaming service.","user":"cmharelson-92486","rank":[14,17]},{"title":"Done before many times with no entertaining suprises","rating":3,"date":"18 May 2018","review":"This international folk lore tale has been told in many variations but with the same basic emphasis on a child kidnapped then returning and being different. This film however may be the worst rendition to date. \nVery slow through out and highly predictable. The main characters acting wasn't too bad but the performance of the cast as a whole was subpar. The special effects were not too cheesy but were virtually non-existent albeit a scene or two. This movie wasn't the worst film to watch for an hour and a half but it definitely is a movie you should avoid if possible. \nI would give this a poor movie rating.","user":"tkaine3","rank":[16,21]},{"title":"The Hollow Plot","rating":2,"date":"19 May 2018","review":"Remember those painting kits where you filled in the colors by the numbers? This is the film equivalent. All the stock conventions are used, there's not an ounce of originality in the whole movie. No surprises,no shocks, from the very beginning it follows its predictable course until the very last moment when we get the usual cheap horror film trope of the 'shock' ending.<br><br>The story is the age-old myth of the changeling. Children are vanishing into the woods and being replaced by the creatures that dwell there, goblins, fairy-folk, Hollow Ones, call them what you will.<br><br>The actors do their best with the material but it's beyond help, lazy writing and bad directing. The final shot is laughable. (I'd have given the film a 4 but for the idiotic ending. Avoid if you value your time.","user":"aldiboronti","rank":[13,17]}]