[{"title":"Very slow movie","rating":15,"date":"15 August 2019","review":"The events in the movie are very slow, that I almost fell asleep. There are also many scenes in Japanese where you can't understand what's happening but you have to guess. And the end is not good. In short, the movie can be shortened to a half an hour instead wasting two hours on such slow movie.","user":"Mah_Jam","rank":[4,5]},{"title":"Not Hawaiian, Poorly Done","rating":1,"date":"7 October 2019","review":"I need to start off by saying that Taka Yamaguchi is a fabulous and underused actor. It is a shame he was cast in this and that he will be associated with this film for all time. He was completely wasted as this character. Watch his performance in \"Sophie and the Rising Sun\" and you will see what I mean.<br><br>As for the movie itself, while the events pretty much keep to the facts, the production is sorely lacking, as is the acting. The location where they actually filmed this was poorly chosen. Ni'ihau is an arid island that is almost in continuous drought because it lies in the rain shadow of neighboring Kauai. There are no lush plantations, rain forests or thickets of tropical plants as depicted here. The fact that the production designers didn't even attempt to make this look authentic put me off immediately. It does not feel Hawaiian -- more like a South Pacific location or even New Zealand. (I lived on Maui for 30 years so I do have at least a little knowledge first hand of all of the islands. I was also very good friends with the late Mary Gay Robinson who was related to the owners of Ni'ihau and who owned Lanai at one point. She is turning over in her grave at the thought of this film.)<br><br>The acting is sub-par, but then who ever wrote this script obviously knew very little about Ni'ihau culture or even Ni'ihau itself and didn't give the actors much to work with. Perhaps the fault doesn't lie with the actors but the script. It's a shame. Throwing in a handful of common Hawaiian words here and there doesn't make a film Hawaiian. In the hands of an actual Hawaiian production crew, a writer that knew how to write authentic and interesting scenes, and a location that even remotely resembled Ni'ihau at least a little bit, then that would then give this film a fighting chance -- instead it is pathetic.<br><br>This story deserves to be reworked and told by someone who will respect the islands and the culture of Ni'ihau, use Hawaiian actors instead of South Pacific islanders and put more effort into an actual script. How this ever got produced and released is a mystery to me. There actually were a few Japanese living on Ni'ihau at the time and the Japanese actors cast in this production were the most believable out of the whole bunch.<br><br>The only reason I wanted to see this movie was because of Taka Yamaguchi. If you are not a fan of his, please don't waste your time of money. Even if this was free on Amazon Prime (it should be because it certainly isn't worth renting) it is basically a waste of time other than Taka.<br><br>Shame on the production crew for releasing this poorly put together film.","user":"JDahlNV","rank":[2,2]},{"title":"i know im sitting on the dayside of the earth","rating":5,"date":"13 August 2019","review":"But even as hawaiian this story was it was barely a mediocre one. if you expect war your lost, if you would like some harakiri then your in. you will also find a whole lot of village around the bonfire talking or walking and not much more than that. there are some fistfights between friends , and foes too. itll may have some appeal for the right wing japanese audiences, because it has some japanese imperialism in its hidden agenda.<br><br>the acting are at b and c level, the locations and settings are rather like ''your mama and my mama, sitting by the fire'', and feels like a bunch of locals in a theater company joining forces to tell their part of the islands war history.<br><br>the grumpy old man saw it and will attend the haugesund international film festival later today","user":"ops-52535","rank":[8,18]}]