[{"title":"Romantic, funny and entertaining","rating":9,"date":"9 November 2017","review":"This film tells the story of a woman who used to play table tennis because her mother was the coach of the town's table tennis club. After a hiatus of 15 years, she decides to play table tennis again to be close to the man she likes.<br><br>\"Mix\" is a typical romantic comedy. The great thing is that there is a lot of comedy. The characters are all different and distinctive, so it is really easy to tell who is who. The story is good, as it provides the background information on why Tamiko stops playing, then her struggle to play, then her struggle to practice very hard for the national competition. The final match is intense, engages me and makes me want to know the outcome of the match. I enjoyed it a lot as I found it entertaining.","user":"Gordon-11","rank":[4,4]},{"title":"A film for the fans of Yui Aragaki","rating":6,"date":"10 March 2018","review":"Apparently, this is a film that is made for the fans of Yui Aragaki, all her fans will love the film.\nTechnically, although the original story is very perfunctory, the grinding of the details is relatively mature.Also, all the stars proceeded cartoonish performances through the whole movie, so the main plot of immature is predictable.However, several major point of emotional processing is appropriate, and the necessary emotion manifestation for a genre film is was well executed. \nAs for the performance of two major actresses, Yui Aragaki won in the temperament, while Ryoko Hirosue showed her power of a veteran skill.","user":"e-70733","rank":[2,2]},{"title":"A fun time","rating":8,"date":"15 August 2018","review":"Nothing too interesting here, this is kinda an underdog story. If you have seen Rocky, you have pretty much seen it all. The actors are good and it was cool how most of them have their own story arc. Main actress is fun, and the main actor is cool too. Overall this is just a light hearted (kinda funny) movie about ping pong in Japanese, with a mix of revenge thrown in.","user":"EasternZZ","rank":[1,3]}]