[{"title":"Quite Clever & Funny","rating":8,"date":"11 September 2019","review":"I thought this movie was quite clever and funny. Logan Miller portrays Philip, a teenager who decides on spring break to deceive his parents and head up to the lakeside Starling Festival with his best friend.<br><br>However, upon arrival, he will get the shock pf his life when he discovers his father (Jim Gaffigan) has a complete second family. Of course, from there things will get very, very complicated.<br><br>All in all, this type of movie is not easy to get all the pieces to fit together. But I thought director Amanda Bailey and writer Glen Lakin did well here to get the elements to gel nicely. Although the movie can be sad and cutting at times, I did find myself laughing a lot and I really enjoyed the film.","user":"larrys3","rank":[7,10]},{"title":"quite a pleasure","rating":8,"date":"10 September 2019","review":"Infidelity and adultry, siblings and halfsiblings, a wife here and a wife there, never mind it tastes good, the bitter taste comes in the end whatever you do<br><br>its a comedy with a bit seriousity, alot of hide and seek, some teenage festival humour, and a whole lot of family-business. its the story about the man that has made himself two families, and have lived that life successsfully for nearly 20 years till the day he is being disclosed by one of his somns, and so the blackmailing and the whole charade starts.<br><br>its quite an original turn on the idea, and the sort of filmgenre that is hard to make a good ending on, but i think they do it well, and the acting are allover pretty good and you really feel the desperation at times. some may feel the makers are just scratching the surface of the topic , but its meant to be a comedy, and they have made a good one too( i skiped dinner to end the film)<br><br>so the grumpy old man recommends a view of this family bundle, its good and its fun...","user":"ops-52535","rank":[6,9]},{"title":"Great movie with a major flaw","rating":5,"date":"1 January 2020","review":"The casting and acting were nearly perfect in this film. If you could take the first 90 prevent of it and stick a new ending on it then it probably would have been one of the best movies of the year. Unfortunately the ending falls completely flat. The viewer gets no reward for the time invested in these characters.<br><br>I can't even really recommend it to anyone because even though the vast majority of the movie is wonderful it ultimately falls short. Completely and utterly.","user":"brandon081571","rank":[2,2]}]