[{"title":"What is going on with the voices","rating":2,"date":"8 March 2018","review":"I'm watching it right now on Netflix with my kids and I started Googling to see if this was originally in another language, but it doesn't appear so. The animation to match mouth movement and voice acting is sooooo bad. At first I was surprised it wasn't too low-budget looking (I don't think this went to theaters in the US), but they need to tune up this aspect. My kids will watch almost anything so they seem unfazed, but really poor quality.","user":"dobie-39925","rank":[30,38]},{"title":"Not even fit for a kids movie.","rating":1,"date":"28 November 2017","review":"I don't think I've ever seen a worse movie in a cinema. I watch loads of movies and saying this means a lot from me. I'm extremely dismissive of movie mistakes and plot-holes, but this, oh boy. It's loud, it's obnoxious, it has scenes that go on for too long. This movie has no plot, no structure no nothing. Yes, I understand this is a kids movie, but at least have the movie make sense. In fact, the movie is so terrible, in the first 30 minutes or so I left because I couldn't stand it anymore.<br><br>TL;DR, don't go to see this movie, not even with your children, they will most likely not like it either.","user":"freddyfazbearentco","rank":[33,45]},{"title":"Sent the kid to sleep","rating":1,"date":"5 March 2018","review":"Quite possibly the worst film I've ever had the misfortune of sitting through. Even the vocal talents of Jason Isaacs and Celia Imrie couldn't save it. <br><br>Appalling script, cast sound as though they'd be more excited to read the phone book, rehashed storyline, endless fart jokes.<br><br>One kid liked the bats, the other fell asleep after 30mins.<br><br>If you want a decent monster movie - stick with the likes of Hotel Transylvania and avoid this like the plague. <br><br>Suggest Sky stick with their monstrous prices and leave the monster movies to the experts.","user":"elinavarro","rank":[18,24]}]