[{"title":"It's alright","rating":6,"date":"25 April 2018","review":"Don't listen to the other guy above giving it a 1 star. The acting is fine. CGI is bad at some scenes though. Many jump scares, and it's good. Good plot. Too bad if haunted houses are \"old and boring\" for you. Overall it's an OK movie, not bad by any means.","user":"classicsmy","rank":[26,30]},{"title":"Predictable, but a decent ride","rating":7,"date":"30 September 2018","review":"Ok, so *spoilers*, this is kinda haunted house meets Insidious meets The Sixth Sense. Which means that the plot twists you can see a mile away. But quality-wise, this is no worse than a middling Hollywood horror film. And, honestly, its better than a lot of B-movies. The acting is fairly solid, the effects are quite high all things considered, and it is interesting to look at. This is not a bad film! It's not a great film, but hey, at least it's not terrible. So if you forced yourself to sit through any mid-2000's horror movie from Hollywood, you can watch this and feel that nice warm feeling of comfort of knowing what you're in for.","user":"mistressofevil001","rank":[9,10]},{"title":"The 3rd Eye: Another passable Indonesian effort","rating":6,"date":"26 January 2019","review":"I'm building up a real appreciation for Indonesian cinema, sure the movies are hardly ground breaking but they're at least consistent which is more than can be said for the US.<br><br>It tells the story of a girl who see's spirits and is being tormented by one in her old family home which she is forced to return to after her parents pass away.<br><br>With a fantastic lead and some genuine creepy moments the 3rd Eye succeeds in doing everything it set out to do. I'd say that Indonesian horror takes influences from both the US and Asia so expect to see many of the usual tropes and the Japanese insistence of having the creepy long black haired antagonists.<br><br>I was quite shocked at several points throughout the film how creepy and how scary it was, they played it perfectly. But then it hits the half way mark and the films quality dips heavily, it begins to take itself a tad seriously and fails to deliver.<br><br>By the end I was happy at some of the incredible sequences that the movie had presented me with but saddened that it hadn't been more consistent. If the whole movie had been like the first half I'd be likely ranting and raving about how great it is.<br><br>The 3rd Eye is another solid but flawed bit of Indonesian horror, if you like one you'll likely like them all.<br><br>The Good:<br><br>I'm still in awe over Indonesian architecture<br><br>Jessica Mila<br><br>Some genuine tension<br><br>Great visuals<br><br>The Bad:<br><br>This \"everyone in Indonesia is wealthy\" thing is getting silly<br><br>Some ropey sfx","user":"Platypuschow","rank":[3,3]}]