[{"title":"When a bunch of amateur filmmakers decide to make a film, a 5th grader can do better.","rating":2,"date":"1 October 2018","review":"I've heard enough whining/whimpering sounds from a teenager in this film to last me 2 years. What was the point of this film? Most of this film is irrelevant dragged out ridiculous fighting scenes with the worst choreography I have ever seen.<br><br>A teen girl named Molly has this deadly power simply by yelling/screaming, yet only uses it a few times, but instead she manages to beat up/kill every adult 3x-plus her size and weight throughout most of the film - and makes constant whimpering sounds in doing so. 75% of this films dialogue is her whining when fighting, walking and breathing. The other 25% is the lamest dialogue you have ever heard. Who wrote this garbage? <br><br>And the the horrible acting by everyone else in this film... total amateur hour! The directing was such a mess that even two directors Colinda Bongers and Thijs Meuwese didn't even know how to hold the camera. Fake schoolyard fighting with half the choreography missing! Scene shots with the bottom have of a relevant scene missing. I could go on and on.<br><br>This film had the dumbest plot to go with the worst writing, lamest acting and atrocious directing I have ever seen. This seems like the worst high school drama class won the lottery and made this garbage. We don't know how Molly got her power, and we see some irrelevant flashbacks that don't conclude. <br><br>I get this is a low budget film, but where did any budget go towards? It wasn't the acting, choreography, wardrobe, effects, writing, directing, editing or sound... I'd say $100 maybe towards some 1970's robotic arm and some green \"quarantine\" tape. I've seen an entire film made in a phone booth that was Oscar worthy. <br><br>Ignore all the fake reviews above a 5 and don't waste your time with this horrendous mess. I give it an honest 2/10 only for decent cinematography.. that's it!","user":"TheTopDawgCritic","rank":[44,65]},{"title":"Really not that bad!","rating":5,"date":"30 October 2018","review":"It really is not that bad. With the budget they had, it was surprisingly watchable.","user":"nedraikhumen","rank":[6,7]},{"title":"A tiny budget post-apocalypse entertaining story with an unlikely hero","rating":7,"date":"16 April 2017","review":"I hadn't actually planned to watch this but accidentally got mixed up in the world premiere by mistake. So it goes.<br><br>The movie follows an unlikely post-apocalyptic hero, not a dashing Mel Gibson, or a long-legged Nikita, but a normal looking girl called Molly, who nevertheless proves endlessly resourceful and unexpectedly gifted in surviving the 'wasteland', which I guess is probably the old WWII German bunker ridden Dutch coastline. This is immediately the best part of the film, our bumbling heroine who stubbornly refuses to die, and carries the movie almost singlehandedly.<br><br>There are some other actors who make a good contribution, the black chap and the robot-arm girl especially, but for the rest its not high quality. We're talking C-movie level here so this is to be expected. The few special effects were unexpectedly good. What I especially loved about Molly were the realistic (and thus very messy) fights.<br><br>We're not about to win Oscars here but given what the makers had to work with I am quite impressed. I am wondering how Brits and Americans will copy with Dutch-accented English. I have no idea what they will make of it. <br><br>If you like Mad Max movies or Turbo Kid you will enjoy this.","user":"LuckyLuigi","rank":[30,61]}]