[{"title":"You've Told Us What Kracauer Would Have Thought. Here's What I Think.","rating":5,"date":"15 April 2018","review":"When the narrator started out by quoting Kracauer to the effect that cinema tells us what a nation is thinking, and then proposed to go through a dozen years of German films, from 1933 through 1945, to find proof of this, I winced. Doesn't a film tell you what the film makers were thinking?<br><br>While I have seen fewer than a hundred German films from this period, they have been a diverse bunch; certainly, you can prove any thesis you wish by cherry-picking which films you wish to highlight; and by the end, the film makers had done a lousy job of it. In any case, investigation is not to find confirmation of your theory. It's to find facts that support or disprove your hypothesis. This movie ignores the latter duty.<br><br>Even more, there are basic flaws in this view of German cinema in this period. After we discount the fact that people like Kracauer were working on old memories at the time they were writing, the view they offer of German film implies that all that German people looked at was German film. In reality, Hollywood -- America's Hollywood -- had siphoned off much of the talent and money of the industry in the 1920s and a good part of the movies that Germans saw when they went to the cinema were Hollywood movies. When they weren't, they were French and Scandinavian and even Soviet films. Movies were big International business. German film makers weren't showing their own works to a captive audience; Goebbels didn't have everything his own way. These producers were competing against Paramount and MGM and British International Pictures, and UFA couldn't distribute their movies to Chicago and Boise and Adelaide as easily as the competition.<br><br>As a result, German film makers often worked in fields that the big Hollywood studios didn't feel worth their effort. In the US, the smaller studios turned out B westerns. Those movies which the narrator claimed reflected the German zeitgeist? Could those be programmers that Louis B. Mayer thought wouldn't play in Peoria, and not worth Culver City's resources?<br><br>The movie makes a fuss of the peculiarities of German cinema, starting with their stars, all of whom seemed to me of types familiar from Hollywood or British film studios of the period; looking at clips of TRIUMPH OF THE WILL on the big screen, for the first time in a quarter century, while the narrator talked of the totalitarian use of bodies as geometric assemblies, I noticed their similarities to Busby Berkley shots from Warner Brothers musicals. Surely other people have made the connection before me! This was followed by clips from OLYMPIA. Those reminded me of Berkley's later work with Esther Williams.<br><br>In the end, this movie has interesting clips from dozens of movies, few of which I have seen. I want to see them. They look like good movies. We have spent far too many decades listening to what people who haven't seen them tell us what they mean, and convincing others of the same, as if every film is a unique event, every national cinema is completely walled off from every other throughout history, and this is what they mean to each and every one of us, ever and forever, amen.<br><br>No! Give us the opportunity, and we will look at them ourselves, and we will decide what they mean to us. This movie starts off talking about propaganda and mind control. The best way to control some one's mind is to slip him the 'right' answer before you ask him the question. Show me the films, not the clip. Then ask me what I think of them. If you want to tell me what you think of them later and why -- and 'why' does not mean \"Kracauer says\" -- we can have a bang-up argument about it. Hooray.","user":"boblipton","rank":[40,56]},{"title":"When Germany challenged Hollywood","rating":8,"date":"20 April 2018","review":"In 105 minutes Ruediger Suchsland's 'Hitler's Hollywood' provides a startling retrospective of German cinema under the skillfull hand of Hitler's propaganda mage who was Josef Goebbels. As Reichminister for Propaganda and National Enlightenemnt, he had total control of cinema, radio, press and theatre. Evil genius that he was, he had a deep intuitive understanding of mass psychology, and in 'Hitler's Hollywood' we see a large swathe of Nazi controlled films from 1933-to 1945, when the first Oscar winner Emil Jannings was in the midst of staring in a film. With great intelligence, we also see how the Nazis through talented film makers out did Hollywood in romantic comedies, musicales and extolling the 'virtues' of the 'master race' in physical beauty. And yet, the dark eyed Swedish singer Zarah Leander appeared in musicales with military themes, or the German penchant for exotic Slavs or Gypsies. And yet, her career in post war Europe, there she was with a number one hit 'Wunderbar', sung in English. Her sultry, deep throat voice still even today has not lost its mystery and allure. [See, YouTune]. Hans Detlef Sierck's 'La Habanera' made her a star and a household name. Sierck remade himself after the war, and much lionised in Hollywood as Douglas Sirk. There he was the masterly eye behind luscious romantic films like 'Magnificent Obsession' and 'All Heaven Allows'. He honed his technique at the Ufa Studios and theatre, and the influence of Goebbels ideas found its way in Hollywood, perhaps. Popular singers like Hans Albers who sang of and longed for the South Seas, transitioned to a postwar career without a hiccup. Suchsland does make a seamless cloth of Nazi cinema from the 1930s to the change of fortunes of defeat in Russia and the collapse of the Third Reich. Films became more realistic, less romantic and cotton candy. One thing remained a red thread: anti-Semitism. 'Jud Suess' by Van Harlan, with his wife, Krista Soederbaum, is an infamous anti-Semitic film that pulls no punches as an odious film, yet one extolling Nazi pathological hatred of Jews. And, he, too, survived the war, and continued to make film until his death in West Germany. Goebbels understood 'soft power', and German films flooded European markets as they did in America's ethnic picture houses that spoke to 'benign' anti-Semitism that flourished in Europe and the US. Even Ingrid Bergman as an ingenue appeared in a German film before she left for Hollywood. Suchsland script alludes to her guilt, which maght have been, and he repurchasing her guilt by playing Isle in 'Casablanca'? A reviewer cannot do justice to 'Hitler's Hollywood' but strongly suggest you go see it, and visually and emotionally and intellectually absorb the dazzling cross section of 'Hitler's Hollywood'. And this documentary is a cautionary tale of techniques that used today. 'Caveat emptor!'","user":"jakob13","rank":[14,22]},{"title":"Should have been better","rating":6,"date":"23 February 2020","review":"While the basic subject is interesting, the analysis provided in this documentary is ultimately superficial. Much of the runtime simply functions as a clip show of Nazi-era films with the occasional biographical detail added for a director or actor. The sound mixing is way off at points, with a film's music or dialogue drowning out the voiceover (or voiceunder in this case) narration.","user":"nickjones-96546","rank":[0,0]}]