[{"title":"Good simple strong idea","rating":8,"date":"5 March 2018","review":"This is a dark short incursion into the dark side of the human nature. Veijo is a haunted older guy who takes upon himself to pay retribution to those who hurt animals, according to his own understanding of how karma works. He is fair and relentless, he doesn't make excuses and he often gives lesson to those who deserve them, in one way or another. He has his own moral code: you need to take accountability for the pain and hurt you caused others, and if you don't you must be obliged. He considers that those people who are aggressive they are lost, they don't know their place under the sun, they are lost and with no purpose or understanding of their lives, so they hurt others because they have no identity, no inner core, no resilience inside them. He takes the role of a euthanizer in his conflict with a lost soul, excellently played by Jari Virman, only to end up dealing with his own karma.<br><br>Later we find out that Veijo himself is a troubled soul, through the strain relationship with his father. Good circular script, with good lines and a strong character, well played by Matti Onnismaa.","user":"claudiadarian","rank":[20,22]},{"title":"Plain simple. \"Euthanizer\" is an extraordinary flick.","rating":7,"date":"24 July 2018","review":"\"Everyone has to pay for the pain that they've caused.\nPain needs to be balanced.\"<br><br>Every detail was just perfect in this Finnish low-budget indie. From the first second, this film intrigued me and managed to hold my full attention. Not only the magnificent acting of Matti Onnismaa and Hannamaija Nikander, as the bitter and sinister person Veijo and the strange figure Lotta whose sexual preference is also rather lugubrious, caused that. The narrative and the message that simmered under the surface also fascinated me. Yet it's not an easy, everyday film. On the one hand, there's the language. Finnish isn't something I'm confronted with on a daily basis (well, for everything there's a first time), so I understood absolutely nothing. On the other hand, the story itself is rather unorthodox with the euthanizing of pets as a central topic. Not exactly cheerful material, even though it sometimes felt comical.<br><br>Veijo is the local freelancer who offers his services to help pets out of their misery in an inexpensive way. He's, therefore, a not so well-liked competitor of the local veterinarian. To be honest, nobody likes him. Veijo thus creates its own Pet Sematary. Dogs are simply shot in an adjacent forest, after which their necklace is dangling from a branch as the only remembrance. Cats and other minuscule creatures from the animal kingdom are gassed in a pimped station wagon. A cat carrier graveyard next to his meager shed is the final result. The first ten minutes alone made it clear an extraordinary film was presented to me.<br><br>Euthanizer is a film about pain and suffering. And according to Veijo, pain needs to be balanced. And that's something this pipe-smoking anti-social person applies in his life. Also on himself. The owners who bring their sick, disobedient or simply annoying pets can expect a psychological analysis first. Veijo apparently has the gift of being a dog whisperer. And some of those owners get a similar treatment as their pet. In the same way, he approaches his dying and suffering father, an alcoholic who apparently treated Veijo very badly and brutal during his childhood.<br><br>The moment Lotta enters Veijo's life, a life in which human contact is quite an obstacle for Veijo, I can vividly imagine his confusion about his feelings towards her and at the same time about her reasonably perverted fantasy. The reason why she feels attracted to Veijo was unclear to me. Was his aloofness or morbid profession something she related to? Or did she have suicidal thoughts for herself? Is she fascinated by death in a macabre way? It was a mystery to me. But they certainly go down in history as the most bizarre couple.<br><br>The weakest element in the whole film was for me the would-be Finnish neo-Nazi club \"Soldiers of Finland\". Notwithstanding that Petri (Jari Virman), who is only too keen to be part of this gang of jackasses, has an important part in the denouement, I thought it was a laughable fact. Apart from stealing some car tires and some provocative behavior, they seem far from being dangerous. And when they are singing as four choir boys for a karaoke machine, the image of these pseudo machos changes into purebred sissies. There's even one of them who can't control his emotions during that musical moment.<br><br>Euthanizer is a cruel and filthy film. Filthy in multiple ways. A film that shows how cruel people can be. A film with contradictions as well. Gasifying animals with the exhaust fumes of an old station wagon is, in my opinion, not a peaceful and pleasant way. And yet Veijo is an animal lover who wants to put these poor creatures out of their misery. Euthanizer is breathtaking. A gem. Fans of small-budget non-mainstream films will enjoy this. I did for sure.","user":"peterp-450-298716","rank":[14,17]},{"title":"My Review Of \"Euthanizer\"","rating":8,"date":"1 August 2018","review":"The story is a bizarre mixture of blunt-force exploration of everyday life, and disturbing behavior bordering on cruelty. Teemu Nikki manages to humanize and rationalize his dark, disenfranchised characters, while pushing the limits of likability with ease. At times hard to watch, especially for the animal lover, \"Euthanizer\" touches ground in experimental, exploitative states. There is balance and breath, if only slightly, in a cast able bring to life fully developed characters that feel natural. <br><br>The effects are stark, visceralmoments of realism that cause knee-jerk \"look away\" urges. There is dark sense that lingers over every moment that tickles at shock value simply by experiencing the events asthey unfold. The subject matter and in-your -face cruelty create the real horror.<br><br>Overall \"Euthanizer\" is gonna be one of those films you either like or you hate. It blends the darkside of everyday affair in arthouse fashion. The story disturbing and compelling. Characters are recognizable and easy to hate.The things you see unfold are harsh and hard to watch, but it is worth the watch","user":"ASouthernHorrorFan","rank":[10,12]}]