[{"title":"No stars","rating":1,"date":"30 March 2019","review":"This movie deserves no stars. It's a waste of the hour and a half. I can not believe so many big name actors were part of it and it was as bad as it was. I can't believe someone actually wrote this movie. It felt like someone followed Matthew around with an iPhone camera while he smoked pot. That's it. That is the movie.","user":"lrdeiorio","rank":[115,167]},{"title":"A Middle movie with no real beginning or ending","rating":5,"date":"22 March 2019","review":"Beach Bum is a movie about Moondog. He's a staple in Key West where he spends his days getting high, drinking PBR and occasionally writing. He's a poet by profession but dedicates all his time medicated. He has a wife that has a lover and a daughter that settled into marrying a man so dull he makes a Mormon seem exciting.<br><br>Beach Bum is director Harmony Korine recent attempt to highlight a character that colors outside the lines. If you're familiar with his work, you know that his movie pace can be belaboring such is the case here.<br><br>Matthew McConaughey playing a Stoner is not a stretch. Those expectations remain low upon viewing this movie.<br><br>Beach Bum has many issues. The movie boasts an all-star cast but grossly misuses them.<br><br>The concept for Beach Bum wasn't wrong; its execution is what was troublesome.<br><br>Moondog eccentric mannerism was only charming for an hour after that it became laboring.<br><br>Snoop Dog was also misplaced. One would think a movie that features weed as one of the themes and the charisma of Snoop would create magic on screen, but it doesn't. He's a limiting sidekick. One of the most dynamic artists of our time and he's lackluster.<br><br>Jonah Hill as Lewis Moondog's publicist also isn't very interesting.<br><br>I get that this movie was about celebrating Key West laid back way of life. The whole idea of tuning out very much exists there lamented among the thousands of tourists but it's not executed well.<br><br>Zac Efron pops up as a fellow stoner and luckily for him, this performance will hopefully be forgotten seeing that he just turned in a fantastic performance as Ted Bundy.<br><br>The bright light in this train wreck was Martin Lawrence. Lawrence hasn't made many movies lately. His comedic bone brings much-needed humor to a film that otherwise seemed in slow motion at times.<br><br>Director Harmony Korine has given us much better work. I understand what he was attempting here, but the bottom line is the movie got stuck in neutral and just became predictable, instead of giving us an insight to a character that is very comfortable in his skin Moondog became a caricature.<br><br>They're not wrong with going of grind, but a movie requires progression. You know a beginning, a middle and an end. We got two hours of a middle.<br><br>Matthew McConaughey at this stage in his career should not portray boring characters such as this; however, since his academy award, his roles have been stale. Gone is the young gunner from Texas that shook up Hollywood and in its place an artist that seems to have settled for an easy check. I am not giving up on McConaughey yet, but Beach Bum isn't the way back to memorable.","user":"cupofsoulshow","rank":[98,142]},{"title":"Not everyone will enjoy it...but I did","rating":7,"date":"31 March 2019","review":"Most people would agree with the statement that McConaughey does his best work in stoner roles, this is not a straightforward stoner comedy however so don't be disappointed if that's what you are expecting. Anyone who expects anything other than a strange arthouse film from Harmony Korine must not be aware of his style. There is lots to be enjoyed in this film including the humour, music, and supporting cast. It is worth viewing with an open mind, just don't expect Pineapple Express or Cheech and Chong.","user":"DeadMansTrousers","rank":[115,169]}]