[{"title":"Underrated meditation on relationship, community and belonging","rating":8,"date":"17 February 2020","review":"It appears that most reviewers sought an adrenaline-filled action thriller or jazzy melodrama. This is not one of that too-common coin. Rather, like most films in which the quietly brilliant Bill Nighy appears, this one is delicate, smooth, evocative, relevant to just about every human who is not trying to escape being human (or is working to escape the madness of modern society and return to being just human).<br><br>This film honorably expands the canon of interwoven lifelines each of which, like the Borromean rings, supports and enriches other already-solid stories. Like Crash, 360, Magnolia and Hereafter, all of the characters are entirely plausible, especially when they find themselves coping with unfamiliar and threatening circumstances. Most rise to opportunity for self-improvement; a few find a chute to the pit.<br><br>Like most truly mind-expanding (dare one say \"spiritual\"?) movies, this one faces the conscious viewer with a series of \"I've been there too\" and \"what would I do?\" and \"who would help me?\" moments. And for the generous of heart, two persistent questions: How have I been helped along by people with no reason to get involved but their own generous mindsets; and What opportunities to help others, and thereby myself and my world, are presenting themselves in this moment?<br><br>Quiet, compelling, and worth a slot in any ethics or social-psychology class.","user":"Cten05","rank":[11,12]},{"title":"A trainwreck. Skip it.","rating":8,"date":"8 December 2019","review":"This was just an awful film. Tennessee Williams and Zoe Kazan's grandfather must both be rolling in their graves. The director and writer ought to both get out of the film business, as should half of the cast.","user":"random-70778","rank":[14,30]},{"title":"Remember \"feel good\" movies","rating":9,"date":"18 February 2020","review":"Old school feel good movie. Came away feeling very pleased. Cast of diverse characters whose fates brought them together in a lovely story. Enough connection between characters so as not to feel you are trying to follow multiple/individual story lines.","user":"gemfesty","rank":[3,4]}]