[{"title":"Seriously?","rating":1,"date":"29 December 2018","review":"Who thought this would make a good film? None of the people working on the film ever had this thought? I had to walk out during the second half because of how absurd it was","user":"amber-57438","rank":[270,395]},{"title":"A weird, disastrous film","rating":4,"date":"24 December 2018","review":"Zero was a weird film. Like REALLY WEIRD. It's not as bad as Race 3 (which made me stop watching Hindi movies for 6 months), but it's not groundbreaking either. Which is a shame really, because Shah Rukh Khan can do better films than this.<br><br>Shah Rukh Khan really had energy in his performance. Even though he's 53, he still has the energy that makes me smile. 😃 Surprisingly, Katrina Kaif was far better than Anushka Sharma. In my opinion, Anushka's acting was a bit over-the top. Others were fine I guess. (SRK's friend, played by Mohammad Zeeshan Ayyub was a laugh riot! Perfect comic timing and the brightest spot of the film.)<br><br>Story was a letdown. It was an old-people romance, The Martian copy and Bollywood Insider unevenly mashed up into one. SRK, I know you're the king of romance. But why go back to garbage lover-boy films that don't work anymore? Find a new niche. You can easily play a romance mentor (like in Dear Zindagi), or even something innovative that doesn't involve romance. Zero may have been innovative, but it wasn't a good risk at all. If you wanted to do an astronaut film, you should have just stuck to that rather than mix it with small-town romance and B-town scandal.<br><br>The only saving grace of the film is its soundtrack, which easily contains the best songs of the year. \"Mere Naam Tu\", \"Issaqbaazi\" and \"Husn Parcham\" are songs that will really give you earworms and stick with you long after the film ends. However, the film is disastrous as a whole. It's better to stream it instead of paying for a ticket.","user":"asokandanny","rank":[120,193]},{"title":"Feel good film","rating":8,"date":"22 December 2018","review":"Don't compare it with epic films like chak de ..Swades.. but it is definitely much much better than dilwale .. happy new year and all..it is an entertaining film but not for those who like slapstick comedy..item numbers..if you are among the few who liked fan(I did) then go and watch it ..films like these don't come so often","user":"Deepakkaushik143","rank":[241,424]}]