[{"title":"Missed opportunity","rating":5,"date":"11 January 2019","review":"In a documentary which is by it's very definition supposed to span the global refugee problem this documentary spends all of 5 of its 240 minutes in Africa. It visits one refugee camp in Kenya and a boat of arriving Eritreans (granted this scene is exceptionally powerful). Oh and a couple of shots of 'Africans' in Southern Italy but Ai Wen Wen doesn't bother to give them a nationality, an ethnicity, or a voice.<br><br>Two of the five largest refugee populations by country of origin come from Africa. Most counts place more than half of the top ten countries on the continent. By host country, African nations again dwarf European and some Middle Eastern ones.<br><br>Like Gaza and Lebanon, some countries host refugees for generations. The world's longest running refugee camps both exist in Kenya.\nThe vast majority of these people are displaced by conflict and yet Human Flow seeks to explain away the African refugee climate to the unpolitical cause of climate change.<br><br>The platform is enormous, and yet in a documentary that seeks to highlight complexity, misses an enormous opportunity to tell the many diverse and complex African refugee stories.","user":"briannamcfarlane","rank":[8,11]},{"title":"Everyone must see","rating":9,"date":"29 October 2017","review":"I saw this today after having heard Ai Weiwei speak a few weeks ago at the Cooper Union about this film and his NYC project of fence sculptures around the city.<br><br>The film documents the plight of global displacement of humans due to unprecedented civil strife and climate disaster - displacing more people than WW2.<br><br>It was a bit long but, in fact, that was probably a strategy to mirror the enormity of the problem.<br><br>Not moralising, more show than tell, I respect this method of documentary making.<br><br>Thank you.","user":"narvnamm","rank":[31,56]},{"title":"If you are European....","rating":8,"date":"29 December 2018","review":"If you are European like me, this film will open your eyes on the migration events that you read on the news everyday. Europe has missed to create a right way to approach these migrations and now is panicking. I don't see a bright future for it. Great film, that gives you a large overview that many other films are unable to give.","user":"Giulio_zzgfont","rank":[6,8]}]