[{"title":"The ring is, indeed, the thing","rating":10,"date":"21 October 2017","review":"The Ring Thing (2017) was directed by William Sullivan. It's an interesting lesbian love story about two successful, ambitious women. Sarah, played by Sarah Wharton is in love with Nicole, portrayed by Kristen Jennings. and Nicole is in love with her.<br><br>The women have a good chemistry, but Kristen is ready for marriage, and Sarah isn't. The movie begins with Sarah showing Kristen a ring, and Kristen thinking that Sarah is proposing. Of course, we know she's not proposing, but we understand why Kristen would think it's a proposal.<br><br>Naturally, there's much discussion about whether or not to marry, and more discussion about where to work and what work to do. The women are not drifting from dead-end job to dead-end job. They are professionals, and they have roots. That doesn't make things easy.<br><br>The movie is carried along on the shoulders of the two leads, although the supporting cast does a great job as well. It's hard to know whether Sarah or Kristen is \"right,\" or even if there is a \"right.\" It's definitely worth seeing to find out the answers. <br><br>We saw the film at Rochester's excellent Little Theatre. It was shown as part of the great ImageOut--Rochester's LGBT Film Festival. This screening was a New York State Premiere. (It's very impressive when a movie is shown in Rochester before it's shown in NYC.)<br><br>The film will work on a small screen. It's definitely worth seeking out and watching.","user":"Red-125","rank":[5,7]},{"title":"Uninteresting.","rating":2,"date":"31 October 2018","review":"Long story short, if this was a heterosexual couple, the rating would be closer to a 3. It is simply yet another piece of film for liberals to vote a 10 and praise as modern Shakespeare so they can feel good about there great moral superiority. If you don't vote an 8 or above, it is because you are a homophobic unenlightened hate-monger, and nothing else.<br><br>It couldn't possibly be as simple as you think the film is completely bland in every way, and you choose not to be discriminate and give it an 8+ for the sole fact that it contains homsexuals, as that helps no one. No problem with homosexuals, completely libertarian, so I wont give this film a raving review based on that.","user":"efreed09","rank":[6,18]},{"title":"Beautiful Layered, Complex Love","rating":9,"date":"3 May 2018","review":"As with love itself, The Ring Thing is a layered and complex work that moves like a memory piece but forward rather than back. My husband and I make a small appearance in this film by William Sullivan. We appear as ourselves and are subjects of Sarah Watson's (played by Sarah Wharton) documentary she uses as a means to explore her \"to wed or not to wed\" questions. After a clumsy, misunderstood moment involving a family wedding ring, Sarah and her live-in lover Kristen (played nicely by Nicole Pursell) stumble forward down their respective paths trying to determine if this would/could be the right step to take. Kristen is ready at first but Sarah has reservations and uses her creative life to help work out the question.<br><br>The beauty of the acting on all fronts and the ambiguity of the questions they wrestle with makes for a film that is alternately frustratingly confusing, romantic and uplifting much like LOVE itself. Each of these women take their turn seeking their happy ending. Wharton &amp; Pursell have nice chemistry together especially in their more \"sparky\" moments. Wharton stands out particularly as she so brings to life all the love angst and joy while representing everything Pursell wants and simultaneously being the chief obstacle to that dream. Conversely Pursell represents what Wharton loves most but is also most terrified of for inexplicable reasons. The supporting cast gives both the ladies all the right tones, colors and acts as their sympathetic sounding boards as Wharton's Sarah works on her documentary about long term love and marriage.<br><br>All in all The Ring Thing is an adept exploration of all the pitfalls in this new age of same sex marriage.","user":"patdwyer4","rank":[2,6]}]