[{"title":"Must watch!!!!","rating":1,"date":"12 July 2019","review":"If you have been bored by the last 10 scary movies, this must be the must watch piece. After this movie, you will certainly think of the last 10 scary movies weren't that bad. There's no bad movies but there's a worst, this is the worst. I seldom give rate 1 but this movie totally deserve it.","user":"ks-60500","rank":[4,4]},{"title":"very bad","rating":2,"date":"8 July 2019","review":"There are 2 naked swedish girls in this movie...Thats all that is good about it....","user":"zathan-32848","rank":[5,8]},{"title":"Flawed if sometimes intriguing effort","rating":5,"date":"19 July 2019","review":"Looking to get new inspiration, a crime writer decides to take a holiday in Sweden on a remote farmhouse trying to find her next book only to come across the increasingly unhinged and psychotic individuals around the farm and tries to find a way to get herself to safety.<br><br>Overall, this was a decent enough if still troubling effort. One of the better features here is the generally odd atmosphere at the farm that invites plenty of generally creepy feelings the longer we're around. Ranging from the generally bizarre farmer and his eccentric lifestyle to the obsessive fan and his wife that plow their way into the story, the general feeling from the environment is exceptionally creepy that goes hand in hand with the general beauty of the landscape. This explodes into a grisly and violent final half where it's built entirely on the reversal of those elements to become a fun grindhouse-styled adventured laced with some dark comedic sequences and plenty of fine gore. Tossed off with some solid nudity from those well-qualified to deliver and there are some generally enjoyable elements to this one. However, there are still a few flaws here. The main troublesome aspect is the glacial-like pacing that takes the viewer out of the film with very little of any interest happening for long periods. The time spent on the farm getting used to the various quirks and eccentricities of that lifestyle do nothing but showcase how she's so unaccustomed to farm-life being from the city. Nothing about this is creepy or thrilling, and the one time it could've been with her clothes being stolen while skinny-dipping doesn't even register as she takes off without alerting or informing anyone about what happened. The result is that there's way too much time taken here before anything starts going on. The other big issue is that there's no clear indication of what the film's trying to be. The influx of several vastly different storylines, from the rustic lifestyle on the farm to the posh lifestyle she lives that's supposed to provide fish-out-of-water comedy to the quirky neighbors that get involved in the story and the matter-of-factness of the different people on the farm that they go about their lives without bothering her until the very end means there's a seemingly discordant tone that arises. Whether it's supposed to be funny or creepy is never really explored and the film feels awash in numerous plot-points that don't mesh into any kind of worthwhile hole. These here are what hold this one back.<br><br>Rated Unrated/R: Full Nudity, Graphic Violence and Graphic Language.","user":"kannibalcorpsegrinder","rank":[1,1]}]