[{"title":"Another Masterful HBO Documentary","rating":9,"date":"11 April 2018","review":"The Man, The Myth, The Legend and also The Friend, The Sensitive Man, The Human Being. This film is a wonderful and sometimes saddening journey in the life of Andre The Giant, learning about who he was as a human being as well as a legend, and how those things conflicted. The film also takes us through the history of professional wrestling, but I'll talk about that in the second paragraph. This film so beautifully portrayed this complex man, a legend who captivated the country, and a man cursed with health problems and a sensitive soul. The film takes a look at how Andre had to live in this small world, chairs and eating utensils were like childrens toys to him, how 14 hour flights with bathrooms he didn't fit in. He was a sensitive man who felt bad when people stared and made fun of him, the film is moving in its portrayal of Andre as a human being, and I really commend them for that.<br><br>So not only does it tell the story of Andre, it also tells the story of professional wrestling as an industry and how Andre shaped it. It tells the story of how wrestling began on a regional level and how Andre conquered the regional tours and captured the hearts of fans everywhere. It tells how the New England region overtook the entire nation, and how that launched Andre to a national name. The film also discusses how Andre shaped Hulk Hogan, not only giving inspiration to Hulk, but also mentoring him and endorsing him, and eventually passing the torch to a new era in wrestling history. The film is very emotional towards the end when Andre deteriorates, I gotta be hones, I got a little choked up. It was a truly great documentary that cannot be missed, even by people who are not into sports or wrestling.","user":"neener3707","rank":[39,40]},{"title":"Myth AND Man","rating":8,"date":"14 April 2018","review":"Towards the end of this film, someone compares Andre to Davy Crockett - as much myth as man. It is an apt comparison, and it makes a film like this pretty tough to make. You could tell every mythic Andre legend and skip the humanity...you could focus only on the humanity and miss the legend. This doc resides right at the intersection, and it succeeds for that reason. They capture what made Andre Andre while resisting the urge to tell every single story for 5 hours. As a child of the 80s, simply revisiting the first few Wrestlemanias and The Princess Bride was a blast. It is entertaining, and - just as importantly - it is human. Also, it is captivating.","user":"cliftonofun","rank":[11,12]},{"title":"A well done and informative look at an icon a humble and gentle freak of a giant!","rating":9,"date":"12 April 2018","review":"Always was a pro wrestling fan grew up with it in the 1980's during it's height of fame. And all of us remember and were thrilled with the 8th wonder of the world the one and only \"Andre the Giant\"! And this new \"HBO\" doc is wonderful and great as it tells of his upbringing and rapid growth in a small French town. And the stories of how \"Andre\" started his journey to the ring, finally breaking into the \"North America\" circuit during the days of regional and territorial wrestling.<br><br>As the doc showed it was in the early 80's when Vince McMahon took over the then \"WWF\" and would expand it nationwide with the use of cable TV by putting it on the \"USA Network\". This prime exposure helped \"Andre\" grow into a superstar and household name. Also along with his feud with star \"Hulk Hogan\" helped put the giant on the map and his popularity would grow as even movie roles became available.<br><br>Also shown and seen was the pain and sorrow that \"Andre\" faced due to his size like knee injuries, and his body was slowly breaking down due to his size as common things like sitting, sleeping, and travel was such a challenge due to his freak size, plus he was a food and alcohol freak! The highlights and footage is classic and revealing interviews are given from \"Hulk Hogan\", \"Ric Flair\", and \"Vince McMahon\" as they remember the good times and were sad and emotionally touched by his tragic downfall at the end. Overall this is one doc to watch if your a classic wrestling fan as it's a historical tribute to an icon and liked legend who was special for being different and being himself by being the one and only giant and that was \"Andre\"","user":"blanbrn","rank":[11,12]}]