[{"title":"Interesting story let down by a poor documentary","rating":4,"date":"13 July 2018","review":"Dry, that's probably the best explanation of what's wrong with this documentary. <br><br>While the stories are interesting and let you into another time of computers, when there was an almost hippy ethic to getting products to market, the interviews get a little boring after a while, major figures are introduced without fanfare so it's hard to keep a track on who was important and who's not. But the worst part is there is very little in the respect of showing off the hardware or the software, just a lot of talking heads.<br><br>example: \"People are still programming games for the Commodore 64 and Amiga\" - then show you no examples or even box art.<br><br>It suffers from the Star Trek Paradox. We must get to point A, the whole fleet is there ready to engae the big ship that's chasing us. Big ship disables the Enterprise and we never get the (hopefully) special effect laden space battle we were promised.","user":"toshxs-18310","rank":[11,12]},{"title":"Would have deserved much more..","rating":5,"date":"27 July 2018","review":"It is confusing. Difficult to follow who is who.\nThe models are not really secribed or compared.\nNo games are shown as examples or music or demos showed.<br><br>It could have be much more interesting and nostalgic.\nDifficult to watch this long.<br><br>\nBut all in all thank you for making it as it shows so much infos we could not knwo before. And also for paying respect to these beautiful creations.","user":"tszula","rank":[7,7]},{"title":"Great stories. Bad film making.","rating":3,"date":"7 July 2018","review":"The film maker appears at the start introducing and narrating but he is not skilled in front of camera and it starts off on the wrong foot. Then we get choppy cuts on interviews, accidental shaky cam on constantly annoying slider shots and strange zooms on static photos. A lot of recent Commodore films have been made so this is too little too late and unfortunately badly executed.","user":"rikki-10","rank":[10,11]}]