[{"title":"what happened?!","rating":1,"date":"23 April 2017","review":"I literally have watched every monster high movie, and this one as well has \"welcome to monster high\" (came out in 2015) were completely AWFUL. First of all, apparently Draculaura met Frankie before Clawdeen, which makes no sense since the first movie says they were best friends before Frankie moved to monster high. Then it says that Draculaura and Frankie built monster high, and \"saved\" all the monsters by introducing them to monster high. Also you can tell that some of the actors who originally voiced the characters were replaced (Frankie, Cleo and Lagoona are all I noticed). For some reason, spectra is now British. Abby, Heath, Toralei, Ghoulia, Clawd, Gil and Howleen are NO WHERE to be found. Not sure why the werewolf characters turn into wolves, something they never did before. Also noticed that basically all the characters have fangs, including Deuce and the zombies! Plus, Cleo and Deuce aren't together and neither are Lagoona and Gil!! I will not be watching this movie again.","user":"adriannar81","rank":[6,8]},{"title":"Not inpressed","rating":5,"date":"4 July 2018","review":"Can we go back to the first generation characters????? Not feeling these second generation characters.","user":"teyanmike","rank":[2,2]},{"title":"Just why","rating":1,"date":"23 February 2020","review":"So I'll start with the good which is far and few in between. The plot was a nice idea, Raythe is an interesting new character, it had SOME of the the original voice actors and the animation style is smooth as well as pleasant to look at but everything else made this movie Tank! While I said the plot was good, the execution? Less so. There were so many needless shots with simple reactions where the character goes uh-huh or just makes a simple expression. It feels like they took a half-hour long episode of a show design for tv and try to stretch it as far as they could do it could qualify for a movie.\nNow on to the animation.\nEvery kids show seems to fall into these issues of same face but Monster High was the one to challenge this! It was loved for the height, body and facial differences! Now it's just falling into line and if it continues to do so I'm afraid it's going to fall out of fashion like it's predecessors Bratz.\nAll other movies up until this one and Welcome to Monster High were amazing! They really showed what stories were capable of when you have such crazy creatures that live way past the life span of a human! Compared to Barbie the stories are actually believable! In a world where zombies and yetis go to school together, one can believe that there is also a school exclusively for ghosts! Why they have to try and turn these amazing situations into the usual weekly adventure to save a monster or save the normies is absurd.\nSpeaking of the normies the villain's whole plan was just to harass them, not even something truly evil like make them live in the shadows and fade away from monster society or even just enslave them!\nFinally I have to dock points for all of the characters missing from the original animated series; Ghoulia, Toralei, Gil, Clawd, Howleen, Heath, Slo Mo, etc.. Also I'll be docking points for the stupidity that was Znap, a awful combination of Minions and Bibble from the Barbie Fairytopia series, his one redeeming quality was that terrifying angry face that told you how you died.\nOver all it was just a bad movie that only contains one good meme.","user":"kontengudragon","rank":[0,0]}]