[{"title":"The seismic expert did what?","rating":3,"date":"22 September 2018","review":"Seismic Expert on the top floor of a large hotel: \" we got to get out of here! There is an earthquake coming!\" Steps into the elevator...","user":"rblonar","rank":[91,118]},{"title":"Not even close to its prequel!","rating":5,"date":"31 December 2018","review":"It's sad but true. The wave was amazing not just because of its suspense, but also because its characters'actions made sense. And what makes this one even worse is that they are the same characters only stupid! I didn't mind the slow build to the the actual disaster; what annoyed me the most was how everyone was lame and slow and just unbelievably wrong when it comes to their reactions! Scenes where they're supposed to be running for their lives, but instead having melodramatic moments. Human instincts don't work that way or else there would never be any survivors in any life-threatening situation ever! It was so irritating to watch them behave this way after the amazing performance of the previous film!\nIt was a disappointment.","user":"Sull-Aura","rank":[44,57]},{"title":"To be honest I preferred The Wave (Bolgen).","rating":6,"date":"7 February 2019","review":"The prequel of this movie was The Wave (Bolgen) and was slightly better than The Quake (Skjelvet), but I still rate it the same because there are some moments of suspense towards the end even though it were also those same moments that were annoying at some point. Annoying because of the characters having a little chat or emotional moments while the only thing they had to think about was trying to escape death and disaster. It just didn't make any sense and therefor it brings the ratings down. The actors were the same as in The Wave but again I thought they did a better job in the prequel, maybe due to the story telling this time. But if you like disaster movies it's worth watching once. To me it could have been much better if there were more disastrous moments and lesser emotional moments. When you fight for your life there is just no time for sentiments.","user":"deloudelouvain","rank":[24,30]}]