[{"title":"Somewhere amongst this confusing and disjointed film is a fantastic film trying it's best to get out.","rating":5,"date":"22 August 2019","review":"This film had so much potential. Great cast and the story could have been really good but it ended up a disjointed mess of a film.\nEditing is terrible.\nPacing is thrown about chaotically and feels like large chunks of storyline are missing.\nSeems like a huge waste of potential.\nI managed to watch all of it and there are some very interesting moments. Acting us top notch .....especially the main protagonist who is a very underrated actor.\nKingsley character wasn't fleshed out enough, just hinted on and a wasted character who is seemingly able to get away with serious crimes!?\nMaybe there are scenes on a cutting room floor somewhere that would have made this a great thriller but sadly the final result they went with us a mess.\nShame.","user":"Jester222","rank":[70,83]},{"title":"Okay Film. Brendan Fletcher As The Oddball Was Worth The Price Of Admission, Though.","rating":6,"date":"19 October 2019","review":"Gandhi and Superman couldn't save this movie - and they were in it! They just seemed detached and were just going through the motions for the paycheck. Plus, the story wasn't that great to begin with, so I suppose they had to make do with what they were given. The young Canadian actor I'd never heard of before, Brendan Fletcher, did a good job as the weird guy. It reminded me of the first time I saw Ed Norton in his first film, Primal Fear. He was really believable in that movie, so much so that he was even nominated for an Academy Award for it. I really thought Ed Norton was mentally challenged in real life, like Giovanni Ribisi in The Other Sister. This movie is really a '5'. The additional point was for Fletcher.","user":"redrobin62-321-207311","rank":[16,17]},{"title":"An entertaining, free on prime, thriller","rating":8,"date":"1 January 2020","review":"I honestly don't know what is going on, maybe it's people who have an all or nothing response. I didn't expect this movie to be amazing, but for something streaming free on Prime, I thought it was great! Wonderful cast and acting, good thriller and action. Yeah some things, if done differently would have made this better, in my opinion the finale came out of nowhere and was one more clue that wasn't really needed. A couple of other things, like the father, weren't really sketched out. And I had a hard time buying into the Rachel-Simon relationship. But overall, if you're looking for an entertaining Friday night thriller, I definitely recommend this!","user":"emilyaschubert","rank":[18,20]}]