[{"title":"Okay, after 10 mins","rating":2,"date":"22 November 2019","review":"I love British horror movies, from the serious horror to the comedy ones, but I honestly believe this one should be a comedy horror for the first 10 mins or so, until they get to 1988 - cut out all the first part.<br><br>The first 10 mins is more in the style of 'Stitches', the one about the clown? But how can you take this one seriously as a strict horror?<br><br>You have a baby that cry's in the opening few minutes of the film, without moving its lips. The short skirts on the nurses, I don't think the NHS would of approved that one! And gotta' mention the black curly wig. The group of friends all look in their mid-twenties, and not about 16, which I believe they are supposed to be? I could go on, but I think you get the idea.<br><br>To its credit its okay, further in, but I just can't get away from the actors - a bit amateurish - the effects - not much money spent - I know its all down to money, and the music, which would of been better using akin to early Carpenter movies like Assault on Precinct 13, or the thing. Something more atmospheric, instead of relying on keep the finger down on one key on the chorus settings.<br><br>I wanted to like this, but it summed it up for me when the evil character was behind a nurse, and the other actor says in Pantomime style... 'Behind you!'<br><br>I take my hat off to all involved in this film, from actors, production and writers - because I cannot do any of that and I'd be even worse acting, but I watch a lot of movies, and for me it was a miss. It was more like an amateur theatre production. But effort is 10/10, end result is (this time) more like 2/10<br><br>God love 'em, don't give up, keep trying - next one will be better. Spielberg had to start somewhere.","user":"enquries_2","rank":[6,9]},{"title":"Oh MMMMmmmmyyyyyyyy","rating":1,"date":"2 December 2019","review":"If you think 5 minutes of upfront screaming, really really bad acting, out of focus camera work, music lifted form 70's, and a totally stupid incoherent story makes for a good movie, you are wrong.<br><br>Oh so wrong.","user":"arfdawg-1","rank":[6,10]}]