[{"title":"further adds to the mystery","rating":7,"date":"4 April 2017","review":"\"Tickled\" was among my top films of last year, and had me gripped and startled like few other documentaries ever have and ever will. While it is a masterpiece of documentary filmmaking, it still ended with many questions left unsolved, which is why I was highly anticipating a follow up and hoped to see how this story would escalate in the future. \"The Tickle King\" is certainly a worthy, but brief, follow up to the first film, which begins quite mundanely and soon becomes more and more uncomfortable. This short documentary does not focus on the original mystery as much as it does the reactions the film received from the subjects it villainized. The film allows its opponents to speak, but also rebuts them in a mature and well done way. If you were a fan of the first film and are eager to see the case as it continues, this is certainly an essential piece to the puzzle. However, I do wish that the filmmakers waited a bit longer to release the film so they could gather more footage as the controversy progressed. If this film were to come out 1-2 years from now, there would certainly be a lot more interesting material.","user":"framptonhollis","rank":[10,12]},{"title":"a necessary coda with some uncomfortable moments right at home with Tickled","rating":8,"date":"18 March 2017","review":"In this follow-up, which is a brief but all the same absorbing 20 minutes, to the 2016 doc Tickled, we see what happened to the directors when on the festival circuit and how, now finished, the proverbial s*** finally hit the fan to the extent that it could possibly hit: Farrier and Reese see some of the shady subjects from the first film at the Sundance screenings (ironically, perhaps, using a similar recording method that Farrier used); private investigators have to be escorted from another screening as the same shady 'Jane O'Brien' company; the filmmakers get hit with a lawsuit - the first legitimate done - and try to see what can be done with the district attorney in the county D'Amato lives in; D'Amato shows up at the Los Angeles premiere and turns it into a circus with his double-talk. It all builds up to being about as strange as the most unsettling moments in the feature itself, There's only so much insight that can be shown, but there's enough weirdness and oddness that makes it necessary to watch after seeing Tickled (luckily both are available on HBO on demand). I don't think it does much good for me to say too much more about what happens in this except to say 1) you should watch it only after seeing Tickled, and 2) the most fascinating part is when D'Amato shows himself and engages with the co-director Reese. To see this man on screen, as well as his gray-haired associate, is so cringe-worthy in his self-awareness and simultaneously lack of it that you may not know how to handle it.","user":"Quinoa1984","rank":[7,9]},{"title":"The Tickle King Review","rating":8,"date":"10 July 2019","review":"It does not solve much, but it's 20 minutes of suppresses and clashes.","user":"felipepm17","rank":[1,2]}]