[{"title":"Good for my Spanish.","rating":6,"date":"20 January 2019","review":"There are good and bad things about Yucatán but overall it's an okay movie to watch once. The bad things to me would be the length of the movie, it's just a bit too long, the singing scenes, there are too many and too long, and the plausibility of the story, as that would never happen in real life. The good things are the actors, they're all good in what they do, and the story is entertaining and easy to follow, and it's also good for my Spanish. But it's not a movie that I will remember or that I will watch a second time in the future, but that doesn't mean it's bad, that just means there are a lot of better movies, that's all.","user":"deloudelouvain","rank":[11,12]},{"title":"A very smart scam movie; tender but full of humor","rating":9,"date":"10 January 2019","review":"Aboard a cruise; a group of scammers are trying to make their living on the unsuspecting travelers. The movie is basically the competition between then to catch a big fish; a lottery winner with 161M travelling with his family.<br><br>The movie combines a very healthy and classy humor (only one scene indulges with bathroom humor); a lot of smart ideas and unexpected twist. A great homage 1960s picaresque comedies.<br><br>Production values are very high for a Spanish production. Perfectly staged action scenes and musical numbers.<br><br>Aside from the language; it technically as good as any Hollywood production but with a far better and smart script and without Hollywood cliches. Both male protagonists are criminals; and the movie does not try to moralize them In fact the just perfect final joke at end; defines the moral ground of the story.<br><br>None of the above is surprising considering Daniel Monzon curriculum. A director capable of doing excellent thrillers and also comedies.<br><br>The only small criticism to YUCATAN; is that some trimming could had benefit it.\nCutting some overacting from Rodrigo de la Serna and perhaps shorter some unnecessary musical numbers or dramatic situations.<br><br>In brief; as comedies went in 2018; this is by far the best and classiest","user":"abisio","rank":[13,18]},{"title":"Bemusing and fun movie about a pair of expert thieves attempting to rob an old man who won the lottery","rating":6,"date":"5 January 2020","review":"Diverting and amusing comedy with a lot of entertainment, twists and turns. Concerning a lot of passengers who go on board of a luxury\nboat. They are : Lucas, Luis Tosar, he is a white collar thief who embarks on a boat called Sovereign to carry out a peculiar theft. There he meets Clayderman , Rodrigo de la Serna, a previous colleague with whom he did business. Both of whom shared their stealing activities by neither being together in the same ocean, nor in the same boat, however, today they encounter at the same ship, breaking their past covenant and to proceed similar robbing jobs. Nowadays, Clayderman works as a pianist and public relations along with his girlfriend, Stephanie Cayo, the ship singer called Veronica and she was also the former Lucas' lover. But Lucas' actual target results to be an elderly baker, Antonio : Joan Pera, who won millions in lotto. Shortly after, Clayderman learns the true intentions of Lucas and he decides spy him and he plans his own alternative plot to get a large amount of money from the baker. Meanwhile, the old man dates and eventually falls in love for a mature woman : Gloria Muñoz.<br><br>Disconcerting and fun comedy shot in ups and downs, being a Boat-movie with a lot of fun, mayhem, funny scenes and amusement. Dealing with a big swindle to carry out by a duo of rogue thieves, both of them compete fiercely to get their purports. This film bears certain remembrance to El robo mas grande jamas contado or The biggest robbery never told , also starred by a team to carry out a fabulous theft : painting Guernica by Picasso and equally directed by Daniel Monzon. Main cast and support cast are pretty well. Luis Tosar plays the roguish stealer especialized to rob passengers and Rodrigo de La Serna as his contender who attempts to follow his steps to take the same target. While Stephanie Cayo is the beautiful singer who decieves both, Lucas and Clayderman . Other secondaries outstanding are as folllows : Joan Pera, Gloria Muñoz, Toni Acosta, Alicia Fernandez, among others.<br><br>It contains a brilliant and colorful cinematography. As well as a lively and catching musical score by Roque Baños, he is a prestigious musician who has composed notorious films as Fragiles, Machinist, 800 bullets, El robo mas grande jamas contado, Sexy beast. It displays a twisted and surprising script with plenty of turns by Jorge Guerricaechevarria, Alex de La Iglesia's regular writer. The motion picture was professionally directed by Daniel Monzon, though it has some flaws and gaps, being inferior to his former films. Monzon is a good director, a fine crftsman who has written and directed a few movies but with considerable success such as El Niño, El corazon del guerrero or Heart of warrior, his greatest hit : Cell 211, Kovak box, The biggest robbery never told and Desvio a paraiso. Rating : passable and acceptable 5.5/10. Well worth watching. The picture will appeal to Spanish cinema buffs.","user":"ma-cortes","rank":[1,1]}]