[{"title":"Disappointed... Maybe my expectations were to high. Not scary and mostly boring.","rating":2,"date":"14 September 2019","review":"I was really looking forward to watch this movie. Clown sightings always intrigued me and I was really hopping this movie could make me feel uneasy and creeped out.\nUnfortunately it fails miserably in everything a scary movie should acomplish. I had the impression that the movie was 2h30 long since I was really bored. No creepy scenes, no eerie atmosphere, no nothing. Even the parts that were supposed to be scary are so lame.<br><br>And what the hell was that ending?? If you're looking for answers about the clown identity or why does he just stands there watching people... well, prepare yourself to a \"no answers\" ending. Seems like they created the story, but as they could not explain it themselves, they just made that uninspired ending.<br><br>I really think hard before doing a bad review because even if the movie is bad, it has some amount of effort by the crew and actors. But then again... I didn't feel that they even bothered to write a plot that makes sense.\nSorry, but I cannot recommend this movie to anyone, unless I want that person to be bored for 1h30m...","user":"Carlos_1984","rank":[10,11]},{"title":"An Entertaining but Confused F-Footage Horror with Hit & Miss Social Commentary","rating":5,"date":"12 September 2019","review":"It's been a while since I saw a new found-footage/mockumentary horror flick, so \"Gags the clown\" was welcome on the screen this evening &amp; I really did enjoy it, however, it's not a very good one.<br><br>A pretty fast moving found footage horror comedy (with nearly zero actual comedy) taking course over one night, put together from live news, police cameras, teens and their smartphones, cctv's, a podcast team etc. - I liked this approach, the many cameras, characters, locations really helped with the pacing and visual diversity. So the whole city is either looking for or hiding from Gags the clown. The characters involved are very simple and one-dimensional, with a concerning amount of a-hole roles. As it happens in a lot of horror movies, some characters and their actions don't always make sense. The acting is as good as the script allows. The story is pretty straight forward, trying to build up the climax, the mystery behind the clown, only to reveal what it had revealed already before - it's all a social commentary, a satire on today's media, society and other related things. Not that it's bad, it's just that somewhere \"Gags the clown\" falls a bit flat, not hitting the nail on the head. The scares and most of the potential for creepiness is abruptly stopped with digital glitches and the gore is weak. There were a few little, cool elements I liked, for example, the balloon shtick (You'll have to watch it if You want to know). Visually, judging by the found-footage genre standarts, it's quite alright, could've been better if the budget allowed more than a \"let's cut it with a glitch\".<br><br>I think \"Gags the clown\" has a great idea somewhere in it, but is confused within itself. The fast pacing &amp; many faces and locations provide a level of entertainment, and if you like or, even better, are scared of clowns, you might enjoy this. My rating: 5/10.","user":"TwistedContent","rank":[9,12]},{"title":"Gags: Clowning around with fake news!","rating":7,"date":"27 June 2018","review":"Gags was surprising entertaining and refreshing way of merging clown phobias and the idea of fake news. Its production values looks good and good acting. Apparently the director, Adam Krause and screenwriter, John Pata was inspired by real accounts of a person in California and another person in England who dressed as a clown walking at night, baiting for people take pics of them.<br><br>For this film, director Krause took that idea turned it into an interesting fun movie with jump scares and a bit of humor. Some of its cast create memorable characters like the ultra right/social media figure, Charles Wright (played by Aaron Christensen) who goes on a live social media event chase-hunt for Gags. It makes for its funny dialogue!<br><br>Recommended it for a fun time and of course clowns are usually creepy, Gags succeeded at being such an enigma. Other characters such as Heater Duprey (played by Lauren Ashley Carter) represent the local public media reportage and channel stations trying to get the latest news of Gaga sightings before the social media coverage does.","user":"babyjaguar","rank":[9,17]}]