[{"title":"Hidden gem. Do not overlook or underestimate this movie.","rating":8,"date":"6 August 2017","review":"This movie really surprised me honestly. I did not expect at all to like it as much as I did. I'm a huge fan of the found footage genre when done right and it's very hard to find some good ones out there. This movie in particular was hands down my favorite \"indie\", as you can all it, found footage movie.<br><br>From the beginning there's already a sense of suspense to it and mystery behind what happened to the missing trio. It's kinda obvious based off of the type of movie this is that they are abducted, but what leads up to it is very interesting. A slow burner for sure, not much interesting happens until the last 30 minutes but before that is a very well crafted backstory and \"mockumentary\" style movie. They go in depth of the backstory of each of the kids and the protagonist of the movie is on a constant search for not only her missing brother but the other 2 that he brought along with him. Being an AZ native I was very surprised at how realistic this movie is and really, even if you're not from there, this movie is VERY realistic. The acting seems real, the way it's filmed feel very 90's, and the actual events aren't your usual CGI and jumpscare filled horror. There's a lot of suspense and mystery behind what actually happened.<br><br>This movie I would recommend to anyone with a willing eye, or just anyone in general.","user":"dnathanr1111","rank":[45,55]},{"title":"A LOT better than I expected from reviews on here","rating":7,"date":"21 August 2017","review":"Just goes to show what is someones trash is someones treasure and looking at reviews on here I nearly did not bother watching this and that would have been a shame as its a good movie and certainly as good as any other found footage movie out there and better than a lot of them to.<br><br>I started to watch this with a finger close to the stop button on the remote but I never stopped it. In fact I was riveted from beginning to end. I loved the way they blended real events and news reports with the fiction parts of the story which really grabbed you and the lead in with all the footage of the kids messing around made you want to watch until the end to see what happens.<br><br>Don't always believe the reviews on here and watch this movie you might be very surprised.... I was","user":"english_artist","rank":[18,23]},{"title":"Way better than most reviews would suggest","rating":6,"date":"6 October 2018","review":"The acting was natural. The story is interesting (the three kids going missing aside, it's based on a true story. The Phoenix Lights really did happen and are well documented) and up until some special effects at the end, pretty convincing.<br><br>I think this is one of very few found-footage films that felt like a \"real\" documentary to me. If I didn't know better, I'd believe that it was truly filmed in the late 90's. <br><br>It's a pretty fun film if you've got the free time. It's no masterpiece but it's good!","user":"bingobingo25","rank":[7,8]}]