[{"title":"Funny and well themed","rating":7,"date":"29 April 2019","review":"I enjoyed this movie. The animation was simple, but it was clearly a particular style they were going for, and it was well executed.<br><br>The jokes I found were entertaining, and the dialogue good also. I like how it's not made for kids.","user":"rogertang-39880","rank":[7,7]},{"title":"Wacky and funny as hell","rating":7,"date":"21 October 2018","review":"Plot wise, not much to say, but then again it isn't about the plot it's about DC humor, or better yet, Harley's humor. To me it was very entertaining. For mature crowd, since it has some \"adult humor.\" All in all a good tribute to the Adam West TV series.","user":"Valhala90","rank":[7,7]},{"title":"Quirky & Strange but oddly enjoyable","rating":7,"date":"27 August 2017","review":"I didn't take this movie quite as serious as some who've reviewed it here on IMDb. Their views are perfectly valid and insightful and I for one appreciate their efforts; I guess I just assumed this movie was going to be offbeat (due to the title) and went in just hoping to be entertained not to have a life-changing experience. Guess what?! I really was (entertained that is)! In my opinion, it was just the right amount of nostalgia for Batman The Animated Series (BTAS) of the 90's with a bit of modern WTF &amp; OMG thrown in for good measure. I was genuinely shocked a couple of times (you'll know when you get to THAT scene) and laughed out loud at others (keep your eyes out for the Batusi!!) Thought I must admit, I really missed Arleen Sorkin's voice as Harley. Not sure what happened there WB?! I mean, it seems like a no brainer to bring her back if you bring everyone else from BTAS back (just sayin').<br><br>One way you might be able to enjoy 'Batman &amp; Harley Quinn' more is if you just look at it as a really long \"lost episode\" of BTAS, not an addition to the DC Animated Universe. That's what I found myself doing. I didn't love every single episode of BTAS (gasp!) but I did love the entire series overall. There are people who will trash this film, stating that it somehow destroyed their childhood, but honestly, if that's the case then they took it WAY too seriously. It was exactly what the title implied; a crazy hybrid story that intertwines Batman (and Nightwing) with a Harley Quinn story. My suggestion is this: if you are hankerin' for an animated film, want to be entertained and maybe kill 75 min., watch this quirky, sometimes shocking flick.<br><br>Lighten up people, or as a great clown once said...\"Why so serious?!\"","user":"morty-58-757170","rank":[58,79]}]