[{"title":"Not a movie for the average viewer","rating":8,"date":"30 July 2019","review":"Having read some of the negative reviews here I was driven to add my own. This is one of those movies that is easy to misread in it's intent. It's not meant to scare you, nor is it meant to horrify you. It's an exploration of the alternative mindset that many people out there have... the \"wierd\" people, people who enjoy hallucinogens, the people who can't exist in the day to day 9 to 5 routines, the people of the night. I'm one of them, and far from being a fantasy, this brought back memories of screwed up, trippy, extreme and highly entertaining long nights from a distant past. A decade or two ago, this would have been an average night out for me and the other \"wierdos\" I mingled with and sought to meet. I suspect that with time, this will become a bit of a cult movie and the current rating will climb as it reaches a more suitable audience. I thoroughly enjoyed it and my only complaint is that it ended far too soon.\nJust to be clear on this: She certainly would not have killed him (she spent far too much effort on making her apartment look good to throw it all away on murder when guys actually pay her to cause them pain...), she would have just enjoyed teaching him a good lesson, perhaps skewering him in non-threatening but frightening places a few times and then she'd have sent him home. Who knows? He may even book her again....","user":"bostockleigh-75918","rank":[20,22]},{"title":"Great style, precious little substance","rating":5,"date":"12 November 2018","review":"From <a href=\"/name/nm2073372/\">Nicolas Pesce</a>, the writer and director of <a href=\"/title/tt5225338/\">The Eyes of My Mother (2016)</a>, and based on the 1994 novel by <a href=\"/name/nm0613487/\">Ryû Murakami</a> (who also wrote the novel upon which the similarly themed <a href=\"/title/tt0235198/\">Ôdishon (1999)</a> was based), Piercing is a darkly comic psychosexual thriller. Partly a screwball comedy about a fastidious man's attempt to murder a prostitute, and his confusion and helplessness when he realises that that prostitute is far more disturbed than he is, the film dares the audience to attempt to figure out who is in charge at any given moment, and to ponder whether one (or both) of these characters would actually be quite happy to be the other's victim. Purposely made to look like a sleazy seventies skin flick, the film's sense of nostalgia drips off the screen, manifest in everything from the music borrowed from giallo films to the art-deco production design to the patently fake urban skyline to the lurid opening credits (complete with retro \"Feature Presentation\" card). In this sense, Pesce is a stylist, in the best sense of the term. However, at the moment, he's a stylist without much to say; as in The Eyes of My Mother, he is unable to match his not-inconsiderable aesthetic acumen with any kind of significant or tangible emotionality. The two leads are not necessarily the type of characters we're naturally predisposed to feel empathetic towards, but we surely must be expected to feel something. Anything. However, with no real sense of psychological verisimilitude nor much in the way of interiority, they remain essentially blank canvases, and primarily for this reason, the film feels more like a sketch than a finished product.<br><br>Set in a non-specific city, the barely-there plot concerns Reed (<a href=\"/name/nm3571592/\">Christopher Abbott</a>), who decides he is going to kill a prostitute in an attempt to purge himself of the thoughts he's been having about murdering his own baby. Planning every aspect of the murder, he rehearses everything from how long the chloroform will leave her unconscious to how best to carry her to the bathroom to begin the dismemberment, and records every detail in a small book. However, when the time comes to do the deed, things go down-hill fast, as Jackie (a superb turn from <a href=\"/name/nm1985859/\">Mia Wasikowska</a>) isn't entirely sane herself.<br><br>Partly a film about coming to terms with desires deemed fetishistic by society, and partly an erotic thriller about two people who seem genuinely confused as to whether they're teammates or opponents, the film's most salient theme is, perhaps, the issue of sexual consent, and how easily muddled it can become. It's a brave theme to take on in this post MeToo era, with the film daring to ask whether consent should still be applicable if a person has consented to something harmful to their person, even up to the point of consensual homicide. Although there's no cannibalism in the film, the storyline reminded me a little of the 2001 case of Armin Meiwes, who murdered and ate Bernd Jürgen Brandes with Brandes's complete consent. The film doesn't deal with the case explicitly, but the shifting sexual power-play between Reed and Jackie, and the fact that at least twice, one of them believes they've been granted permission to murder the other, raises similar moral issues.<br><br>Within the parameters of this theme, one of the most obvious aspects of the film is its sense of humour, with many of the laughs coming from how utterly anal Reed is. Half Patrick Bateman, half Frank Spencer, once an unpredictable human element is introduced into his scheme, he finds himself unable to think on-the-fly. As his meticulously laid plans go up in smoke, he proves comically inept at handling any kind of interpersonal relationship. However, the fact that most of the comedy lands on his shoulders throws into relief perhaps the film's most egregious problem; although a good 90% of the narrative is told from his perspective, there's precious little to his personality. Granted, a couple of final-act flashbacks fill us in on why he is so obsessed with murder, but his character simply isn't capable of filling out the film's 81 minutes. And there's less character detail on Jackie than there is on Reed. Despite this, Wasikowska gives a superb performance, all facial tics, unspoken volatility, and nervous mannerisms, with an almost balletic way of moving.<br><br>The problem for me is that nothing in the film really lingers - and when some of the imagery is this extreme, it should definitely linger. For example, I've never been able to completely forget my first viewing of Ôdishon - not because of the violence per se, but because the film spends so long building up the character of Aoyama (<a href=\"/name/nm0410903/\">Ryo Ishibashi</a>), so that when those needles and that wire saw come out, you absolutely feel the weight of what is about to happen. In Piercing, I don't really think there's any depravity that Reed and Jackie could have inflicted on one another that would have provoked an emotional response, because I didn't know them, and therefore was unable to care about them, as people.<br><br>Aesthetically, however, there's a great deal to praise here, with the sound design particularly inventive. During Reed's rehearsal of the murder, he goes through the entire act, from the initial drugging to the dismemberment. On screen, we see him pantomime the actions, but on the soundtrack, we hear the disturbing foley of everything - so as he's miming sawing, we hear a saw cut through flesh and bone. It's a brilliant way to place us firmly within his subjective experience, and it also serves to remind us that the innocent looking Reed is very much planning to do real harm to someone. On a similar note, the music is absolutely top notch. Eschewing an original score, the film instead employs pre-existing tracks primarily from giallo films, including <a href=\"/name/nm0006102/\">Goblin</a>'s scores for <a href=\"/title/tt0073582/\">Profondo rosso (1975)</a> and <a href=\"/title/tt0084777/\">Tenebre (1982)</a>, and <a href=\"/name/nm0006214/\">Bruno Nicolai</a>'s score for <a href=\"/title/tt0068444/\">La dama rossa uccide sette volte (1972)</a>.<br><br>The visual aesthetic is oftentimes as impressive as the aural. Exteriors (of which there are very few beyond the opening and closing credits) are obviously miniatures, with very little effort to make them look photorealistic. This sets an otherworldly tone right from the start, as if the film is taking place in a slightly alternate reality, as the real and the fake mix together in Reed's confused mind. Interiors are blank, as if they are show-houses, not actually inhabited by a flesh and blood person - one shot, for example, shows a drink's cabinet where the bottles have no brands, just the name of the alcohol. Again, this sets the film's reality apart, as if everything is happening just outside our own world, or our own conception of the world. There are also a couple of nods to the master of body horror, <a href=\"/name/nm0000343/\">David Cronenberg</a> - a stomach wound pulses and expands as if breathing, a gigantic beetle crawls out of a toilet and infects a character's face, scissor wounds are curiously fingered, a character's ear is split open with a tin opener. It's all very Disney!<br><br>Ultimately, however, Piercing is more interested in aesthetics than exploring the psychology of the characters. The increasingly extreme goings-on are never anything more than a jokey end unto themselves, with the psychological path that has led the characters to these extremities relatively ignored. With Pesce focused on comedy beats, there are certainly a few laughs, but there's precious little substance. He's undoubtedly adept at evoking the most absurdly grotesque comedy, but he is, thus far in his career, equally as uninterested in developing character or plot. And for that reason, the film comes across more like a calling-card than a self-sustained and complete product.","user":"Bertaut","rank":[68,86]},{"title":"Senseless","rating":3,"date":"31 December 2018","review":"It's half-way nostalgia style fetish, half-way sadomasochist play, and halfway thriller, where nothing works in full.\nTo be fair, the only fully developed thing is the lunacy the characters, which renders the movie pointless in a charicatural word where nothing needs to make any sense. No one to root for, nothing to expect but more lunacy. At some point all we hope is that he won't kill her, because that would mean we are left alone with the main character - a dorky, flavorless average Joe, wrapped in a velvet-coated mess.","user":"slt-filho","rank":[48,72]}]