[{"title":"One of the best foreign films I've seen!","rating":9,"date":"6 July 2018","review":"The wannabe critics are at it again smh... comparing this film to big budget Hollywood blockbusters with A-list actors.<br><br>I will critique this film for what it is... an independent low budget foreign B-grade film with C-list no name actors, a novice writer, and a director who's only experience is a TV series and this film. A well deserved 9/10!<br><br>Right from the start, the directing of this film could have not been better. It's far superior than most of the big Hollywood experienced directors have been putting out lately. The close ups, angles, capture moments and scenic shots were outstanding. The cinematography was sheer perfection. The acting by almost all cast members, especially Leandie du Randt, was great. The writing could have been tighter, but still decent. The pacing could have been a little faster, but still good enough to hold my attention throughout the entire film. The length was perfect. I'm not a fan of subtitles, but going in knowing this was a foreign film, the lack of too much dialogue made the subtitles bearable. <br><br>Overall this film was a fun ride, produced very well. I recommend this film, and go into it knowing it's a low budget foreign film - and not comparing it to Hollywood blockbusters, and you will enjoy this as much as I did!","user":"TheTopDawgCritic","rank":[17,23]},{"title":"Good film","rating":8,"date":"29 September 2018","review":"Good film with strong characters, good filming for a low budget!","user":"barrywilson-67563","rank":[7,8]},{"title":"Great tension and cinematography. Perfect in its genre.","rating":8,"date":"9 August 2019","review":"I like movies that get you from the start and this is one of them. The tension is kept till the end, even as the story takes a few unlikely turns here and there.<br><br>The cinematography is just great and really adds to the story; watching this will put you in that wide and deserted area on a hot summer day. This movie is perfect in its genre.","user":"thijsflix","rank":[4,4]}]