[{"title":"Loved the idea, not so thrilled about the result.","rating":5,"date":"7 December 2019","review":"As a fan of conspiracies for entertainment purposes I was really happy to find this film. The acting was pretty good and the plot too, but I still felt something was lacking from the film.\nMight be more enjoyable for those who already know about this particular conspiracy, rather than for those who have never heard of it.","user":"alexalex-44708","rank":[19,23]},{"title":"An Uninteresting Take on an Intriguing Subject","rating":5,"date":"6 December 2019","review":"Tricks of the mind, psychological phenomenons and conspiracy theories are very intriguing themes &amp; promising plot devices - provided the effort, of course. \"The Mandela Effect\" is a small scale indie scifi drama/thriller and I do deem it quite effortful, just not in all the right areas. If you want an in-depth or just a fresher look at the phenomenon of mandela effect - this movie is not it.<br><br>\"The Mandela Effect\" has a few things going for it. A few minutes in &amp; it's more than obvious that the budget was small, but the enthusiasm of filmmaking is there &amp; technically it's an allright indie feature. Charlie Hofheimer &amp; Aleksa Palladino provide decent performances &amp; it was nice seeing my beloved Penguin from \"Gotham\" or Robin Lord Taylor, although portraying an uninteresting character this time. And Clarke Peters simply didn't get enough screen time. The effort can also be appreciated in all of the visual aspects of \"The Mandela Effect\", cinematography's not exceptional, at all, but not sloppy either. The problem, however, is that, for a movie based on such an interesting subject,which has sparked and still sparks infinite discussions, it's just.. an uninteresting take on it. Grantedly, topics like this one don't have any definite resolutions, but it has no boundaries in creativity when trying to depict it in arts and fiction. \"The Mandela Effect\" tries to keep the story up and going with only half succesfully focusing on the tragedy that's tormenting our two main charaters, while all the other themes - the intriguing ones - eventually just wind up nowhere. \"the Mandela Effect\" will get you intrigued, then drag for a bit in the middle &amp; end it all vaguely beautifully and also highly unsatisfyingly.<br><br>It almost feels like it could've been a bit better if they just renamed it as something not widely known &amp; changed the narration just a bit. Promising secrets and mystery solutions, \"The Mandela Effect\" provides only an average indie flick with a disappointing core shtick. My rating: 5/10.","user":"TwistedContent","rank":[22,29]},{"title":"Effective Near-Perfect Philosophical Sci-Fi (which would benefit from a better poster)","rating":9,"date":"6 December 2019","review":"Excellent mind bending Sci-Fi which uses limited technical means expertly and puts big budget productions dealing with a similar subject matter (The Matrix, eXistenZ, The Thirteenth Floor) to shame.<br><br>The trailer features an Alan Watts (British Philosopher which created a unique cultural bridge between Western and Eastern Philosophy) audio lecture on the topic of perception and asking questions such as: How much of what is do we perceive? In what measure can we trust our senses? What is reality?<br><br>The movie features a family in a future altering moment of their lives. A momentary decision will change their reality forever. The father being a computer coder subsequently notices oddities in day to day life which chases him down a rabbit hole of conspiracy theories (the Mandela effect) to uncover the \"truth\" behind reality itself.<br><br>However the movie is more than just the expertly crafted family thriller. It dares asking and also answering some of the deepest philosophical questions which current developments in technology (informatics and measuring devices such as the CERN particle accelerator etc) and theoretical physics are starting to grasp. The fact that what is \"real\" is so only in relation to an observer. If the observer isn't there, \"reality\" doesn't manifest. What happens if a tree falls in the forest? Does it make a sound or not if there isn't anyone to hear it? Of course it doesn't make a sound. Because sound is a relationship between the object making a sound (vibrations in the air) and the ear-drum hearing it. The ear evokes the reality of the falling tree. Existence is therefore RELATIONSHIP.<br><br>I enjoyed the movie immensely mostly because it challenges Western assumptions about the Universe, ourselves, our role (free will) and what is real and it opens a gate to questioning and perhaps uncovering some ancient wisdom along the way. Yes, we believe that we are on the brink of uncovering the \"truths\" of the World through technology. We are certain that we must. Because we want to control everything. But what if we are instead just going to uncover that we have ignored what our fore-fathers already understood. Indeed the binary language of computing is based on an ancient Chinese philosophical book called i Ching (The Book of Changes - Ying and Yang, Black and White, opposites secretly mutually revealing themselves). Which in turn is based on even older Buddhist (in turn an of-shoot of Hinduism, an even older philosophy) philosophy which gave birth to Taoism in China. And Buddhism is the one philosophy of Reality which is consistent with measuring techniques and calculations of modern physics. It opens up perception into a \"reality\" in which there is no outside observer (Us) but only experience as such arising from the relationship between observer and the observed. A non-dual eternal happening which is forever coming into being anew through vibration. Yes it is a \"simulation\". But not in the V.R. sense. It's a neurological experience. When we open our eyes we see what is in our brains. The \"outside\" World is created \"inside\" our brains and thus is ourselves. Which leaves Western man and his \"exact World of calculus\", in which he believed to be a center of thought and action, revealed as a hallucination. Because there isn't anything to hold on to for him. Not concepts. Not \"real, tangible\" things. No Creator Ruler of the Universe. No way to pin it all down (Although the movie suggests a creator and goes down the path where man can and does manage to \"control\" things in a minor way, if only by using a crafty lever. But these are the devices of western story-telling and they are used masterfully, here).<br><br>\"Your MIND is all there is, everything\", Alan Watts.<br><br>\"If there is any religion that could cope with modern scientific needs it would be Buddhism\". Albert Einstein<br><br>P.S.: I believe Alan Watts should have a credit in this movie","user":"CarsonTrent","rank":[34,53]}]