[{"title":"I Must Have Missed the Comedy Here","rating":2,"date":"2 May 2018","review":"Adam Pally stars here as Billy, who's returning to his hometown of Valley Stream, Long Island, after a number of years away for Thanksgiving and to pack his things, as his parents are selling the house and moving to Sante Fe. When he was in high school there he was extremely popular, but also a prankster and a bully, even known as the King of Valley Stream.<br><br>However, Billy soon finds out that his schtick of the past has worn thin and his friends have matured for the most part and moved on with their lives. The plot will mostly center on Billy's suspicions that he's seen his neighbor (Vincent Kartheiser), who's now dating Billy's ex-girlfriend (Rachel Bloom) ,commit a murder. <br><br>Although this movie received rather glowing reviews from pro critics, I really was hard pressed to find the humor here, and I wondered if we all watched the same film. To me, the humor just fell flat or was just mean-spirited or even cringe inducing at times.<br><br>All in all, maybe this is a demographic thing as others may have thought it was funny but I was happy when it finally ended.","user":"larrys3","rank":[16,20]},{"title":"Adam Pally kills it","rating":8,"date":"4 May 2018","review":"I randomly saw an ad for this movie on Instagram and liking Adam Pally (but not actually knowing his name) definitely wanted to check it out. He of course was hilarious as the down to earth and, to me, likeable Billy. \nMuch of the supporting cast I was previously unfamiliar with, but thoroughly enjoyed. Everyone's performance definitely added to this quirky comedic take on a murder mystery. I sincerely recommend checking out this film.","user":"ketny601","rank":[11,16]},{"title":"Amusing comedy-mystery that gets funnier as it goes along","rating":7,"date":"19 April 2019","review":"I was just seeing if Rachel Bloom had been in anything besides Crazy Ex-Girlfriend and found this movie. I didn't see a lot of enthusiasm for it, but I have a special fondness for comedic murder mysteries so I couldn't resist.<br><br>The movie is about a guy, Billy who was a popular douche in high school and is now an unsuccessful douche in the real world. He goes back to his hometown where he finds the ex-girlfriend he dumped then never got over is dating the guy he used to torture in high school. After that guy's mother dies, he develops the idea that it was MURDER!<br><br>The main character is an awful person, but he's amusing in his awfulness, and I laughed at things like him tooling around town on a scooter. The story itself does a good job of keeping just enough mystery going while never losing sight of the ridiculousness of the protagonist. There are some great bits, like a cop's pregnant wife who flirts blatantly with Billy while screaming at her husband about the smell of pears, and the last, most frenetic moments of the film almost reach hilarious.<br><br>Overall it's a pretty minor movie, but if you like comedy mysteries, which is a very underserved sub-genre in the modern day, I would definitely recommend this.<br><br>Blooms part, by the way, is quite small so I wouldn't watch it just for her. But I'm glad her name lead me to it.","user":"cherold","rank":[3,3]}]