[{"title":"Take nothing but pictures. Leave nothing but footprints. Kill nothing but irritating punk kids!","rating":4,"date":"1 November 2018","review":"I added \"The Ranger\" straight to my watchlist, because I instantly liked the premise of a psychopathic National Park Ranger. Some of the best slashers of the 1980s took place in the backwoods, but the killers were always toothless rednecks or cannibalistic inbred families, so this could have been an interesting and original new angle, especially because the film (like so many others nowadays) supposedly also takes place in the 80s. But alas, \"The Ranger\" never fully lives up to its potential despite the cool titular killer and an adequate performance by Jeremy Holm, and that's principally because co-writer/director Jenn Wexler is seemingly more interested in a bunch of pathetic punkers and atrocious loud music than in atmosphere or scenery. Running from the police after an idiotic and unnecessary incident at a punk club, five vexatious teenagers seek shelter in a cabin in the middle of a National Park. One of them, the introvert Chelsea, spent much of her childhood vacations here with her uncle, and her own dark secrets from the past gradually come back to the surface. Meanwhile, the psychopathic Park Ranger ensures that Chelsea's disrespectful and arrogant friends receive the excruciatingly painful deaths they deserve. \"The Ranger\" is a textbook and thus unmemorable slasher that sadly doesn't make proper use of the locations, the villain, the numerous potential slash-methods or the 80s setting. The grim film poster remains by far the best asset of the entire production.","user":"Coventry","rank":[30,37]},{"title":"Meh...at best","rating":4,"date":"11 May 2019","review":"Boring for a \"slasher\" movie. A pretty slow start and middle. In my opinion how people are killed make for the most entertainment, and these are just boring.","user":"patrickbivona","rank":[7,8]},{"title":"Punked by a Horror Gimmick","rating":4,"date":"27 August 2018","review":"Got sucked into this one with all the over the top hype at the Fright Fest film festival, I guess putting a punk rock sound track into a films sound design means a film is \"Unique\" and \"Something New\" in the genre. It wasn't. The premise and plot are well worn - aka Cabin in the Woods - The Hitcher - Stalker. This film doesn't do anything that's already been done really well in the aforementioned films except for it's 80's theme. Throw in some bad, over used teenage angst and it's a thinly veiled episode of Buffy the vampire slayer in a park with a punk rock sound track to boot.","user":"barbaragolia","rank":[26,39]}]