[{"title":"Who wrote this?","rating":22,"date":"22 June 2019","review":"Who wrote this - I would like his job. No effort and still got paid.<br><br>The conversations are flat and the actors look uncomfortable saying them.\nThere is a plot and in the same time, you feel like there is no plot.\nI lost interest in what was happening very quickly.<br><br>Do not watch.","user":"melio10","rank":[604,757]},{"title":"Fod God's sake, please stop making movies","rating":1,"date":"19 June 2019","review":"It's difficult to destroy the best franchise from the Marvel Universe... and yet this director somehow managed to...<br><br>The acting is clearly dull from the very first scenes - McAvoy was a fantastic actor in Days of Future Past (and also in First Class), nicely paired with the huge talents of Hugh Jackman and Fassbender... but here, not only does he not act at all, but - Dear God Almighty!!! - he is turned into the bad guy (because that's the trend in some foggy minds of Hollywood these days), he is accused by his students, whom he taught, formed their characters and helped to grow into compassionate beings...<br><br>...and he is deprived of his School?!?!?! at the end of the movie the \"Xavier School for gifted youngsters\" changes name to Jean Grey School?!?!?! Seriously?!?! (what did she do to deserve such an honor???)<br><br>and the fundament, the basis, the Heart, the Mind, the One who formed and gathered them all together... is reduced to a sad (not even old!) man who wastes his time as a retired old man and Magneto comes to him to sweeten his days of exile by treating him to a final game of chess?!?!?!?!<br><br>To destroy the very core of X-Men is to destroy the X-Men... and somehow this \"director\" has managed to do so... and i'm sure it wasn't unwillingly...<br><br>The acting was utterly bad (the good actors had no script to act with, Sophie Turner had no talent to act with) - the music was utterly nonsensical (Hans dear, stop falling asleep on the keyboard while composing), the same score stretched continuously for half a movie, then a slightly different score playing continuously for the other half... - the dialogue was stuttered (for all of them) - the camera angles with lots of close-ups tried to give the illusion of emotional weight, but failed miserably - the whole movie felt like a looooong bad dream, or like the spawn of someone who messed up his brain with some w**d and then got into the director's and writer's chair...<br><br>Applauses, simon k., for destroying such an wonderful franchise!...","user":"navi23","rank":[724,933]},{"title":"The best storyline in the X-men canon, and they crapped all over it.","rating":2,"date":"23 June 2019","review":"Don't know where to start with this. If you're going to dig up the greatest story in the X-men canon, you need to bring it. And this film brought nothing. It all felt so hollow. The characters didn't ring true. The story didn't ring true. It was all over the place with many nonsensical choices throughout. I was so excited for my favorite storyline and was disappointed more than I can put into words. This political and social propaganda piece missed the mark by miles.","user":"mossow92","rank":[593,763]}]