[{"title":"Forget this exists","rating":1,"date":"9 May 2018","review":"Seriously, there's nothing good about this movie. The plot and script are sensationally bad. I'm a huge fan of Scott Adkins but I don't know what he's even doing in this movie. I'm pretty sure he just had a free Tuesday and he owed someone a favour. There is not one single positive to take from this, not even the fight choreography which Adkins films have been noted for.<br><br>In short, do not waste your time. It's kind of similar to Lockout with Guy Pierce and Maggie Grace but somehow manages to make that movie look like a maserpiece in comparison.","user":"im_southy","rank":[39,45]},{"title":"Do youselve a favor and watch Lockout instead","rating":1,"date":"8 May 2018","review":"This movie is quit bad, but what to expect another C grave bad acted movie with Scott Adkins, i used to really like that guy but is decent in the bad movie making and old style martial arts is getting old real fast.<br><br>The FX for this movie are terrible as is the acting, do yourself a favor and watch Lockout with Guy Pierce and Maggie Grace instead top notch effect and a much better movie.","user":"kaefab","rank":[45,57]},{"title":"Not a grabber, to put it mildly","rating":3,"date":"3 November 2018","review":"While I don't think this movie is quite as bad as some other user commenters have labelled it, I will agree that it is a pretty bad B movie. And this opinion comes from someone who usually likes to watch low budget B movies. The biggest problems with the movie don't come from its somewhat cheap look and feel, but that there is precious little in the movie to grab you and keep your interest. For example, there is almost no action in the first half of the movie. And while there is more action in the second half, it is usually choreographed, edited, and directed in a way that is not only quite drab, it is also often hard to follow. The footage surrounding the action footage is even worse, with characters often standing around and not doing much of anything. The movie is padded with talk, and it's not particularly engaging talk. The script does provide a minor plot twist towards the end, but it's too little and too late. Even if you are a Scott Adkins fan like myself, this is one effort of his that is best avoided.","user":"Wizard-8","rank":[11,12]}]