[{"title":"Amazing Cast. Big disappointment.","rating":4,"date":"23 March 2019","review":"With a cast like this, I was expecting The Raid, Ong Bak, Boyka or The Night Comes for Us quality.<br><br>My advice is don't build your hopes up.<br><br>I can look past awful dialogue and ridiculous situations if the action is good but theres nowhere near enough to keep you distracted from what is, a bad movie.","user":"running_with_scissors","rank":[71,90]},{"title":"Too little with too much","rating":6,"date":"22 March 2019","review":"Like the title says, the director has too much martial arts star power and too little to do with all of it. First and foremost tiger chen , has a very generic fight style and it brought down the scenes he was in. Iko continually gets beat down but thanks to overused cliches the bad guys talk too much and he gets in his hits. Tony jaa even feela slightly wasted compared to the protector. The final fight feels meh, without spoiling too much, that fight should have went a little different, but the director played it like an old action movie with no twist or anything that suprised us. Summed up, considering the star power in the movie, it should have been better done. I'm a huge fan of most of the cast and this movie failed to showcase their skills or fighting styles. Watch once and done.","user":"yodaandme","rank":[33,41]},{"title":"Great cast, excellent choreography, terrible writing.","rating":6,"date":"24 March 2019","review":"If I downloaded a movie from the Bahamas, does this make me a Pirate of the Caribbean? Because this pirate's film didn't have sub-titles for the non-English parts... aaaaaarrrrg!<br><br>I spent most of the film's running time hoping that these famous martial art pros get to work together again in a film worthy of their talents, instead of this ridiculous script that had more plot issues and was more predictable than a soft porn film. A 5th grader could've written a better story that made actual sense.<br><br>The fight choreography was excellent, especially towards the end, but also limited with the screenplay that needed work from its muddled narrative about criss-crossing allegiances, noble billionaires, shadowy criminal enterprises, and one guy out for vengeance that had dozens of opportunities from the get-go, but instead risked and/or allowed civilians to die before the obvious end result.<br><br>Don't see it for the plot, see it for the fight scenes... these guys all deserve a better story. It's a very generous 6/10 from me - solely for the all star cast and their multiple martial-arts discipline fight scenes.","user":"TheTopDawgCritic","rank":[54,71]}]