[{"title":"To sell your soul for a star","rating":18,"date":"18 July 2018","review":"Yeah 2 reviews before me, jamesedehartcomposer and anahelt, both rated this movie to a ten, They must have been paid to do so I think. Both have reviewed only ONE movie guess which one! I am wondering how they pay you, is it by the amount of stars (1 star 1 $), please explain how it works. Do you do this for a living?\nThis movie is a 2-3 stars, nothing new, nothing we haven't seen before. The acting is poor, bad casting I think, the movie is boring and dull. It was a struggle to watch this movie from beginning to the finish.","user":"franka_van_loon","rank":[11,16]},{"title":"Worthless!","rating":1,"date":"18 July 2018","review":"Not worth your time! Awefull acting, incomprehensible storyline, no effects worth mentioning! In short; terrible","user":"oostbrink","rank":[6,13]},{"title":"Wanted this to work - but it doesn't","rating":3,"date":"29 July 2018","review":"The 10 * reviews must be fake.<br><br>Anyway. When I saw this film's synopsis I thought it looked interesting, and I always like to see low budget films get a good run.<br><br>Unfortunately, this was nowhere near the film I was expecting, and lack of budget is not the reason.<br><br>OK, so I am not expecting super Hollywood performances from the cast, and it was obvious that some of the supporting cast were inexperienced, and that is fine and to be expected. Some of the performances of the main cast were good too.<br><br>Whoever colour graded this film needs some serious training and experience. Colour grading is more than making the screen a colour - it is about the subtle use of colour and effects to being the viewer into the story and invoke mood and emotion - not a raging headache. I can see why whoever did this might think monochromatic blue was the way to go, but it just doesn't work the way it is applied.<br><br>Teh editing was far too loose. Some shots lingered for too long, some shots we just not cut together very well generally, and many others were just pointless in the context of the story. It also made the actress playing the main character unprofessional and a bit dim -which she is not.<br><br>The 'special effects' are what they are - not all that special and it may have worked much better if the film had less of them and more thought had gone into producing physical effects rather than relying on computer generated ones that looked false.<br><br>In the end this could have been a good film, even for the budget. But lack of attention to detail and poor technical skills ruined it.","user":"mjsreg","rank":[3,5]}]