[{"title":"Nice Surprise","rating":7,"date":"16 February 2019","review":"I started this movie with little expectation, and found a hidden acorn. I really liked it, it was not just \"wrong turn\" movie the story had some substance. Acting was good and the story moved along with some twists and turns. Worth watching.","user":"bobtis","rank":[35,43]},{"title":"Rarely do I give out an 8 out of 10!","rating":8,"date":"27 January 2019","review":"I stumbled upon this movie but was worried about any graphic rape scenes that are included in so many of these type. I think it was very well done. There was action, drama, lots of twists and the acting was good. I really enjoyed just a great drama and thriller without the extra gore many other titles bring. It is definitely worth renting.","user":"coxpnw","rank":[35,45]},{"title":"Ignore the Feminism-related Noise","rating":7,"date":"7 January 2019","review":"Rust Creek is a good little drama/thriller. The story is pretty good. The directing, cinematography and acting are good. I don't remember any cringe-inducing moments where supposedly smart people do dumb things to move the plot along. And if there's an intended female empowerment message it's not obtrusive.<br><br>I know that in our current overly PC culture we have a few movies that are thinly-disguised excuses for male bashing (I'm looking at you \"Bad Moms\"), but this isn't one of them. The main (and only) female character is smart and brave but not unrealistically so. She worsens her situation by making some understandable mistakes. The three bad characters are made up of two men who are truly vile and one guy who, if left on his own, would probably make kinder choices but he's too stupid and weak to not go along with the other two. That's it for the bad men. All the other men have admirable character traits with one whose desire to fight injustice and protect the main character rises to the level of heroic.<br><br>This is a good movie made by competent people and I would recommend it.","user":"alanfiske","rank":[65,95]}]