[{"title":"Nice Photography for a 'C' Flick","rating":2,"date":"26 October 2018","review":"This movie gets worse by the minute, but if you happen to like nicely framed shots and unusual lighting, you may want to watch. The plot begins fairly decently, but transgresses into pure silliness about an hour in, the whole time seeming like a lengthy episode of DARK SHADOWS from the 1960s--a show I watched as a child. 2 stars for good filming techniques.","user":"beorhhouse","rank":[8,9]},{"title":"WTF?","rating":1,"date":"2 December 2018","review":"I have no idea what I just watched. This movie is all over the place. Just saying it was a hot mess would be a compliment. If you want to waste a couple hours, by all means, this is your movie. There is no coherent plot or storyline. The scripting is a nightmare. The acting is overly exaggerated and tries to hard to be deeply dramatic. The filming is not polished. The only thing that held any quality was the setting. The house and grounds played their part well seeing as all they had to do was exist. Very strange movie.","user":"Foutainoflife","rank":[7,8]},{"title":"It had potential but...","rating":3,"date":"16 October 2018","review":"Nearly two hours... TWO HOURS! <br><br>This film started firmly in the 7 rating then went to a 6 and rapidly to a 4 and ended up at 3 after two hours of torturous viewing.<br><br>It's not that it's a bad concept, and it seems some effort has gone into the intention to make a decent film, the problem is the intention just doesn't translate in to the reality of what this film could be, or have been.<br><br>I was hoping that this was going to be a good British horror and at least live up to the hype - but it is neither.<br><br>It feels like a local amateur dramatic club has cobbled together some cash to make a project film.<br><br>The majority of the acting is wooden and strained and really fails bring the characters or story to life, or to engage the viewer. It's not necessarily that the actors are bad at acting. It could equally be that the director has not taken the time to either relay what they expect or are too busy rushing through scenes to pay attention to detail and give the actors what they need for best performance.<br><br>There are obviously one or two actors who have great potential, and may well have theatre experience, but without proper direction their skill is not being allowed to come through in character in this film.<br><br>The film looked visually promising to begin with, but like other things, rapidly became fairly ridiculous for the period the film is supposed to be set in. Some scenes were visually perfect and interesting, while the majority just seem to be shots where the camera was set on automatic and to hell with taking time to get the lighting right. It really wouldn't have taken that much effort or time to make a few fundamental changes.<br><br>The same with the sound. In some scenes it is clear that thought has been given to recoding and balancing the mix, while in others (ironically usually when there was substance to a character's dialogue) it was difficult to separate dialogue from the overpowering volume of music or the far over/misused sound of thunder - which just became annoying in the end. Sound quality also seemed to be a serious issue with medium to long shots often sounding like it had been recorded with a baked bean tin.<br><br>Next up - prop interaction. Oh my goodness, someone wasn't paying attention.<br><br>There are times when the characters interact with props in a way which is obviously wrong, if not downright amateurish and stupid. Without using spoilers I can't really give examples, not that I would have to for anyone half-awake watching this film.<br><br>Overall, this film looked as though it might be a good watch. If the people who made this film were as good as the hype they wrote then this would be brilliant. Unfortunately, this seems to be (yet) another example of people with too much spare cash and a woeful lack of skill and attention to detail thinking they can do something they obviously can't.<br><br>Perhaps they are more suited to shooting family videos with an iPhone.<br><br>As for the 10 ratings - they are obviously false.","user":"mjsreg","rank":[10,14]}]