[{"title":"ROmantic drama as it should be.","rating":18,"date":"18 October 2018","review":"Having been subjected to Nicholas Sparks's romantic sludge for years, I am pleased with a romantic drama that feels real and painful without hearts, flowers, or bottle messages. The brilliance of After Everything (fka Shotgun) is that writer/directors Hannah Marks and Joey Power keep sentimentality at bay while directing two fine actors, whose chemistry is astonishingly believable. It's the year's best romance.<br><br>Elliot (Jeremy Allen White), reminding me of Dustin Hoffman's Graduate look and persona, gets a life-defining diagnosis while meeting the girl of his dreams, Mia (Maika Monroe). Despite his bleak prognosis, they fall in love and marry. Of course, already the situation is unreal, but the characters are so sincerely in love that we become complicit in their seemingly skewered decision.<br><br>However, the film is dedicated to showing authentic love that sacrifices certainty for the abstract promise of everlasting love. And they love in a fetchingly warm connection that makes us forget he seems doomed to early death.<br><br>I'm not an overly-sentimental type, but After Everything is close to my perfect screen romance. It's real and touching without the dross that usually accompanies this type of drama. A date night-you bet!","user":"jdesando","rank":[19,23]},{"title":"Refreshing!","rating":9,"date":"10 January 2020","review":"This movie threw all the cliches about romantic comedy/drama films out the bathroom window and started working on its own path and the result was a beautifully crafted piece of art. This is how good movies are done and this (aside from the Notebook) is the only romance movie I'd gladly watch a second time!","user":"tavongaishefaneti","rank":[3,3]},{"title":"Quality movie, worth the watch","rating":7,"date":"17 April 2019","review":"Yes this general storyline has been used quite a bit lately it seems, but while not radically different this was unique enough to be intriguing. All aspects were well-done (writing, cinematography, acting, etc.), didn't try to be anything more than it is.","user":"HowieRS","rank":[3,7]}]