[{"title":"Great but brutal footage, limited story, wonderful insight to a deadly sport in an era gone by","rating":9,"date":"20 July 2018","review":"I generally agree with the 5 previous reviews to mine, but I loved it. It tells the story well about the risks the drivers took (and perhaps pushed by Enzo, their fans and their women), the camaraderie among drivers despite their competitiveness, and how dangerous the sport was back before crush zones were designed into the cars, tracks had runoff areas, and research backed helmets and hans devices were mandated. It's sad because it's all true, but great because it tells and shows the story. In summary: <br><br>The bad: limited coverage of Enzo, limited mention of other Ferrari drivers debatably more important to Ferrari's history than Collins and Hawthorn (which the film tends to focus on), poor editing of the new filming of the old cars in action vs the original footage.<br><br>The good: Fantastic old race footage with clean visuals and good coloring, great story about Collins and Hawthorn, good stories about a few of the other earlier drivers. Wonderful, if sad, story of how it was back then about the dangers and the drivers.","user":"michaelpusa","rank":[8,8]},{"title":"Another treat for motor racing fans","rating":9,"date":"2 December 2017","review":"Another great documentary about motor racing and Formula 1 after McLaren and Williams, two films that also came out this year. Ferrari: Race to Immortality takes place in the mid 50's and tells the story of Enzo Ferrari, his complex character, his famous racing team and the drivers with emphasis on two great British masters of the wheel, Peter Collins and Mike Hawthorne.<br><br>The film is beautifully made, the archive footage of the races and cars are great. The story is told through interviews and narration by Enzo Ferrari, fellow drivers, wives and girlfriends. Drivers back then were a special breed of people, their determination, passion and love of racing is hard to understand sometimes but it is also hard not to find it beautiful and inspiring. They lived their lives on the edge and to the fullest, basically trying to cheat death every time they drove those cars. They were warriors, gladiators, stars and gentlemen. It is impossible to compare Formula 1 of today to those times, it almost seems like a completely different sport.<br><br>The film has quite an emotional punch as well, many young lives tragically ended, families lost sons, brothers, fathers and husbands in their pursuit of speed and dreams. <br><br>Strongly recommended to all motor racing and Formula 1 fans regardless if you are a Ferrari supporter or not, I believe you will not regret it.","user":"Lugo1989","rank":[19,23]},{"title":"Mike Hawthorn - Peter Collins: The Ferrari years","rating":6,"date":"24 December 2017","review":"In a documentary about Ferrari, it is very disappointing on how little effort there was from the director on portraying Enzo himself or the team. Apart from one interview and some \"il Commendatore\" quotes, the film solely focuses on the drivers and mainly Mike Hawthorn and Peter Collins. In fact, Mr Goodrich chooses to completely overlook José Froilán González (the driver who gave Scuderia Ferrari their first Formula 1 victory), Alberto Ascari (the first Ferrari F1 champion) and casualy mention Juan Manuel Fangio (arguably the best driver of that era).<br><br>And although Hawthorn's and Collins' story is compelling indeed, it is not what you come to expect from a documentary called \"Ferrari: Race to Immortality\". In this point, i have to note that we first see a picture of Enzo beyond the 18th minute and actual footage of the man himself beyond the 22nd minute.<br><br>On the other hand, this film has its moments and it does really well in presenting the 50s F1 era, along with the emotions, the danger and the camaraderie of the drivers and their loved ones. It has Phil Hill (former Ferrari champion) who is the only one of those who speak in the film, trying to delve deeper in Enzo's feelings and character and give us some real insight. It also shows rare clips of the races and private lives of drivers, all beautifully presented. But i didn't like the mix of old footage with newer ones, which didn't knit together nicely. Thankfully these parts were sparse.<br><br>In conclusion, for a Ferrari documentary this is an average try. From a british drivers view, on the 50s era and the Ferrari team, it would be OK. Being very lenient indeed, i give it a 6 out of 10 and i highly recommend that you check out instead the Williams (2017) one.","user":"dim_zax","rank":[5,6]}]