[{"title":"Curious little movie ultimately left me feeling robbed.","rating":6,"date":"21 September 2019","review":"This is an odd little movie and it will be enjoyed best if you don't think about it too much. That's because if you do give it much thought, you will realise that the plot is full of holes and so much of what drives the plot is just not logical.<br><br>Without giving too much away, the story has to do with a father who kidnaps his dying son from hospital and takes him on a trip to South Africa to help him fulfill a bucket list of sorts. This is all told in flashback as, in the present, the father is in Germany on his own and is arrested by the police who, egged on by the boy's mother, are trying to find the missing boy. The father, it turns out, is some sort of urban poet and is competing in something called a 'slam', where poets face off against one another in front of a cheering audience. This must surely be one of the most boring 'sporting' events imaginable in my opinion, but to each his own. Anyway, it soon becomes apparent to the lead cop on the investigation that the father's poems are giving clues to the son's whereabouts. Will they decipher these clues before it's too late? Will the police allow the father to continue competing in the 'slam' so that he can give all his clues'? Why doesn't the father just tell them where the son is instead of being so cryptic about it? The first two questions are answered during the movie. The last one is an abiding mystery.<br><br>The movie features quite a bit of questionable acting and a lot of truly unsympathetic and unrealistic characters. In fact, the only truly likeable character is the dying son.<br><br>I must confess, I was tempted to abandon this movie quite early in the piece, but I'm glad I stuck with it because it does start to draw you in as the story unfolds. Unfortunately, the movie is let down by a plot twist at the end which we all should really have seen coming as the clues are there early in the movie. You probably won't notice them first time through though, but I expect they will be more apparent if you give this a second screening. The trouble with the plot twist is it is the factor that will make you question the plausibility of all that has gone on before it.<br><br>As I said, this is an odd little film. It's bleak and depressing and ultimately it is unsatisfying, but it only goes for around 80 minutes so you won't lose too much by watching it even if, like me, you feel a bit cheated by the denouement.","user":"CabbageCustard","rank":[2,2]},{"title":"Best movie ever","rating":10,"date":"16 April 2020","review":"One of the best movies I have ever seen . At first , you think you know everything , but In the end , you know nothing . I would 100 percent recommend this movie","user":"saraalhadeethi","rank":[0,0]}]