[{"title":"Really hard to know who to blame!","rating":1,"date":"29 December 2018","review":"This movie have a lot of elements that should be able to make it a good experience;\nA basically ok story\nA cute princess in Rebecca Dyson-Smith\nA good king in Mike Mitchell\nA evil prince in Jon-Paul Gates\nA couple of knights in Ross O'Hennessy and Ben Loyd-Holmes\nA couple of female warriors in Zara Phythian and Jemma Moore\nA lot of weird evil fantasy creatures\nA bunch of undead zombie creatures\nA couple of dragons to top it off.<br><br>BUT still its something that is really missing here, not sure if its to blame a weak director or the lack of good script. After just a short time watching you start to feel bored and wonder when the amazing special effects will show up, (the poster promises that there are more dragons than in the combined Hobbit films)\nIn the poster it also claims that the same special effect crew as the one in the Harry Potter movies are hired, but the film makers must have forgot to promise them money for their job, because there are \"a bit difference\" in the effects and how they looks....\nWell there are a couple of dragons, and they are \"not too bad\" for a low budget movie. But they are not \"OMG SO AMAZING\" by far.\nThe creatures have average costumes/makeup, blue coveralls and ski mask for many of them.....<br><br>The acting is a chapter on its own, its not good, its not average, its really close to bad. This could be to blame on a weak director, but I'm not really sure thats the only reason. For my untrained eye it seems that the actors don't have any chemistry with each others, and are \"acting on autopilot\".\nOf the actors I think the best are Jon-Paul Gates, playing the \"evil prince\" he clearly is good at being evil, but its only limited how much screen time he gets (and he is maybe only looking good because the others are sooooo bad)<br><br>The movie ends in a weird way, and my Christmas indulged brain is worried that the ending insinuate a follow up in the future some time.\nThis can only be better than tis movie (crossing fingers), but I still hope it takes a couple of years, at least :)<br><br>If you have other interesting things to do, like watch paint dry, please consider that before watching this movie","user":"SpecialWeirdo101","rank":[24,26]},{"title":"Don't even bother with this","rating":1,"date":"27 December 2018","review":"Just don't even bother. It looks like it could be a school play. Just don't","user":"dieperdsegat","rank":[18,24]},{"title":"Truly pathetic!","rating":1,"date":"25 January 2019","review":"Ive been in several big budget films and a bunch of low budget and student films and of course watched thousands. Ive never seen worse.<br><br>As suggested elsewhere, they did in fact sneak into heritage reconstruction sites to film or got permission. I've been in that very village I believe.<br><br>They dont even bother to try to hide the 21st century signs though they do film from the back side of them but you can clearly see their shape and the modern bolts.<br><br>Even worse as they enter the first village look to the left of the screen as they pass the very small shed thats the size of a one man toll booth.<br><br>Plainly visible on the door is a modern calendar with a picture of a slice of pie on the top.<br><br>Then the circular seating area on their left as they enter is clearly made of planks sitting on modern concrete blocks.<br><br>Perhaps worse still. Look at any seem with farm animals and take not of the modern wire fencing.<br><br>It just gets worse and worse.<br><br>The acting is so incredibly lame, especially the pathetic troll called Prince Favian.<br><br>They should be ashamed they wasted their resources on this when 100 bucks of stage muslin could have fixed all the stuff I mentioned other than the acting.","user":"crusadermagnus","rank":[10,13]}]