[{"title":"Yaawwwwwn","rating":5,"date":"23 January 2018","review":"I hate rating fan films. But they put 'em out there so...<br><br>Yet another \"light saber fight in the forest\". (Don't people ever get tired of making those?) The audio is exceptional, the directing, filming and choreography is good, which is why I give it 5 stars. I give it only 5 stars because it has zero story / plot, the bane of all shorts. <br><br>If you want to watch a few minutes of yet again two people having a light sabre battle in a (rather pretty and interesting) forest, this is the film for you. Beyond that this would best be classified as a \"teaser\". One does have to wonder: if they're going to go to the trouble of making something like this (and I'm sure it took some doing), why not make it a few minutes longer and fill out the story line a little better? Perhaps some day fans will learn that the key to a good film is a story foundation. Beyond that, it's just fancy lights and footwork among a bunch of trees. It's been done before... and we frankly don't need to see yet. another. light. saber. battle. in. the. forest.","user":"Snootz","rank":[14,18]},{"title":"Okay for a fan film, not enough for general standards","rating":4,"date":"20 February 2019","review":"\"Star Wars: The Force and the Fury\" is a 7.5-minute live action short from 2017 and the most recent filmmaking effort by director Jason Satterlund. It is an American production in the English language. And if you wonder why this is now a contender for Satterlund's most known work, then just take a look at the title and you will know better for sure. It is the connection to perhaps the most successful franchise in film history that is also going very strong again these days thanks to the new episodes 7-9 coming out, which further boosts this short movie. Overall, I would say the film maybe relies too much on successful formulas from Star Wars movies without really getting in own creativity. Also they were trying to achieve too much for a running time of under 10 minutes. The scene itself with the light saber fight (and that is what I mean what I just described) isn't all bad. It is visually fine and also from the stunt perspective as much as an untrained eye like mine can be the judge here. The two actors are doing a solid job as well. The woman is really stunning in my opinion. I think this movie could have worked if it was a longer sequence and part of a full feature film and nobody could have complained. But here we just lack so much, especially in terms of a background story. That's why overall I would not recommend the watch. Then again, maybe it also has to do with my subjective taste as I may be biased being neither a great Sci-Fi fan nor a huge Star Wars fan. But I give it a thumbs-down all in all.","user":"Horst_In_Translation","rank":[3,6]},{"title":"What!","rating":1,"date":"12 February 2019","review":"I'm not sure what this is supposed to be! Is it meant to be a parody of Star Wars/Mortal engines?","user":"warrenravx","rank":[4,12]}]