[{"title":"Surprisingly good","rating":8,"date":"24 December 2018","review":"I didn't expect much from this movie when i started it but it was very interesting and good. The story is pretty interesting and the build up is also perfect. It keeps you waiting shrouding you with mystery. The cast is perfect. Personally i thought Jeff bridge's performance was perfect. The other cast also give a solid performance. All in all the movie is very enjoyable and i definitely recommend it","user":"abenezerberhanu","rank":[221,292]},{"title":"Go see this movie!!!","rating":10,"date":"2 October 2018","review":"Go into this film knowing nothing. Part of me wishes I hadn't seen both trailers because even though they didn't reveal much of the films plot, I would've loved to have been surprised. Hemsworth gives his best performance yet. He is truly menacing. He is what a Negan should've been on the past couple of Walking Dead seasons. The music is great! Cinematography is great! The hotel set is great! The one downside is that the build up is a wee bit slow, but it definitely pays off when the action and mystery begins.","user":"chmuptacular","rank":[434,677]},{"title":"It keeps you engaged from beginning to end. Before comparing it to Tarantino style films pls watch Jean-Luc Godard's films.","rating":10,"date":"23 December 2018","review":"The film starts with a man moving all the items of a hotel room in one corner, he then removes the carpet n the floorboards, stashes a bag underneath n puts back all the things in place. After he has finished his mysterious work.....\nFast forward ten years n destiny brings together a group of people who all end up at this same hotel on a dark rainy night due to different circumstances.\nComparison to The Identity is present but please do not compare it to Tarantino style films jus cos it has a nonlinear approach.\nFellas who r comparing the nonlinear film style to Tarantino's films ain't aware of Jean-Luc Godard, the pioneer of nonlinear filmmaking.\nIs it a coincidence that the surname of the director of this film too is Goddard.\nDrew Goddard is in full Jean-Luc Godard-esque mood.\nAttention is required as every person at the El Royale has a story n\nthe background story of all the characters were properly interwined.\nSome of the scenes r way too slow n the editing needed some post production work.\nJus few days back i saw Chronicles of the Ghostly tribe n i wrote in its review that the flashbacks were confusing n not at all gripping but in El Royale the flashbacks were intriguing n not at all confusing.\nThe film is visually striking and offers a high level of ambience.\nIt has lots of eerie mood, good suspense, a great sense of dread throughout. The background story of one of the character which is shown towards the end is a bit shocking n well placed.\nThe owners of the hotel remained mystery but that is another story.....","user":"Fella_shibby","rank":[126,199]}]