[{"title":"Worth the watch","rating":7,"date":"28 December 2017","review":"\"Youth\" is a beautifully made movie with amazing acting, a decent storyline, and a good rendition of a difficult time in China.<br><br> This movie definitely has its share of problems though. There seems to be a particularly large amounts of plot holes and unanswered questions. An example would be the strange event involving the main character's sudden emotional downfall. The editing also seems very harsh in places, extremely noticeable in the war shots. I would also like to say that the English translations in the theaters are quite bad to be bland. As a person who both understands English and Chinese, I was amazed by how debatable some of the translations were. They seemed to find a way to overcomplicate the translations, and make the complicated screenplay look simple.<br><br> \"Youth\" has some great acting from newcomer stars like Miao Miao and Elane Zhong. Xuan Huang gave the best performance in the film as Liu Feng, and Miao Miao surprised me with how much charisma she had playing He Xiao Ping. The acting overall is quite strong, and the actors all developed their characters well despite the small amount of character background. The visuals are nothing short of stunning from the beautiful dancing and choreography, to the breathtaking scenery that is very pleasing to the eye. Feng Xiao Gang also successfully produces a movie that accurately depicts the 1970's of China. This time period is basically untouchable, because of how delicate the government was then, but this movie really does try to show how the living condition was back then. Feng Xiao Gang seemed to have found a way to make a movie about the 1970's in China without offending the government too much.<br><br>\"Youth\" is full of lovable nostalgia and relatable moments. This movie will absolutely tug at your heartstrings and make you look back and treasure the moments of your youth.","user":"jenisedong","rank":[14,15]},{"title":"A Rare Treat from China","rating":8,"date":"12 January 2018","review":"Absolutely beautifully filmed Chinese movie. Most \"nearly great\" movies like this require a little suspension of belief and a \"just go with the flow\" attitude. Knowing what I do about the Cultural Revolution, I assume this is a fair glimpse of a very small facet of it. The tragic side: the burning of books, children sending their parents to prison, the destruction of careers and reputations, is not shown, but most informed people should know this by now. And, there are hints of it. And, in a totalitarian country, what else could you expect from a Chinese film.<br><br>I was very irritated by the review of this movie on RogerEbert.com by Simon Abrams. Though it's hard to tell, I think he was criticizing this movie for some over-simplified view of the Cultural Revolution. I say \"hard to tell\" because some of Abrams' sentences are incomprehensible and make no sense. But, clearly this movie is not responsible for informing everyone of the whole story of the Cultural Revolution.<br><br>Maybe the best measure of authenticity of \"Youth\" is the fact that it is being attended in the U.S. by droves of Chinese Americans. Many of these, at least their parents, may have lived through the Cultural Revolution. When I went, my friend and I were the only non-Chinese in the theater.","user":"emailbillphillips","rank":[13,16]},{"title":"A Sentimental Period Drama of Modern China","rating":9,"date":"26 December 2017","review":"Youth is the latest work by Xiaogang Feng, a well-known Chinese Director with many domestic box office success and ambitious effort to make serious movies. The screen play was written by the talented writer Geling Yan, whose life trajectory closely paralleled with the story line. Both Feng and Yan shared the experience of living and working in the Military Cultural Troupe, a special unit serving the Military with 'artful' performances but later largely disassembled as the Chinese society moved to market economy in 1980s. The majority of the stories in the movie occurred from mid-70s to early-80s, which marks a historically critical period of modern China and the youthful years of a generation who are around 60 years old now. <br><br>The well crafted production settings, costumes and makeups immediately reset the clock for 40 years and bring you to the late stage of Culture Revolution. The signature dance moves, songs, body gestures, and use of words strongly evoke one's memory of that time; such rich cultural message unfortunately may be lost to western audiences. The nostalgic sentiment has overpowered many (millions) Chinese viewers for sure. In a sense, it was the Age of Innocence when the youths were largely shielded from dating and selfish motives. However, as the plot developed, conflict arose, things got escalated and people's fate changed. The movie is unpolitical and intends to tell the story of a group of regular young people limited by their historical environment. Most of the female leads are new faces on screen, whose performance was refreshing and enjoyable.<br><br>Overall, the cinematography was done in a lively manner with nicely coordinated music scores. The movie was told from a young lady's perspective, thus may feel a bit on the feminine side for some. To me, it is beautifully done and quite an achievement.","user":"wc1234567","rank":[13,17]}]