[{"title":"Kid approved and nostalgic too","rating":10,"date":"11 March 2018","review":"Aliens Ate My Homework is a story I read in the sixth grade (the same age as \"Rod\" in the movie), and I'm pleasantly surprised to see a movie adaptation twenty-something years later! The movie is fun, adorable, and made me a bit nostalgic for the days I'd get dropped off at the movies without my parents to see a kids adventure film like Explorers, The Wizard, Masters of the Universe, Flight of the Navigator, SpaceCamp, etc. It's got a little bit of magical realism where something extraordinary happens in your own backyard and while dealing with the real world of bullies, bad grades or struggling parents. And who didn't have a goofy friend totally obsessed with explosive edibles?! The kids they cast are so normal and believable (imdb shows that 2 actors have been in Oscar-nominated films already) and the aliens are both mysterious and funny. William Shatner, who plays an ALIEN, is full of wordplay, a total wink to the older \"kids.\" Since it is based on a series of books, maybe we can look forward to more adventures with the Galactic Patrol.","user":"gizmostrange","rank":[28,36]},{"title":"Great For A Kids Movie","rating":8,"date":"26 March 2018","review":"I thought the acting from the children was great. I especially like Ty Consiglio as the school bully/super villain. The plot was a bit iffy.<br><br>The movie starts with Rod and his friend Mickey trying to escape the school without encountering bully Billy. They are unsuccessful and Billy squishes a bug and rubs it in Rod's hair. Billy appears to be dumb and unintimidating. Yet Rod takes it from him and doesn't stand up for himself. He comes home and finds out his annoying cousin is staying with him. He then discovers a tiny spaceship with tiny aliens who make Rod's life miserable and threaten to kill him if he tells anyone about them. Rod breaks this rule multiple times. Luckily no one believes him. The aliens finally help him stand up to Billy. Rod later discovers that Billy is the evil alien that is trying to destroy the world. (Not exactly a twist. The bully being the villain. A stupid 12 year old bully turns out to be a criminal mastermind who lives alone and is constantly plotting? Can the movie at least be consistent with its characters?) Though Rod was afraid to stand up to Billy before, now knowing he is a literal monster capable of destroying him, has no problem fighting back. The whole school sees this, while there is clearly abnormal activity, yet nobody questions it. The teachers don't even do anything about the two boys violently fighting in front of the entire school. Rod helps the aliens get back on their ship and hopes to see them again. Mickey still has no idea what is going on, even though Rod told him and played it off like a joke. Rod also never found out what happened to his father, though it was brought up several times. This totally sets the movie up for a sequel.<br><br>Important lesson to teach kids:\nBullies are all one-dimensional people with no intention other than to be cruel. They may be aliens trying to destroy the world just to be cruel. I guess villains don't need a better motive.","user":"benghill","rank":[21,27]},{"title":"good family movie","rating":18,"date":"18 March 2018","review":"It was a good movie for young kids. The flow of the story is good find it interesting most of the time.","user":"aris_a_puevas","rank":[21,27]}]