[{"title":"Very Powerful No Agitation","rating":9,"date":"11 January 2019","review":"Again another film with lots of characters from real life with universal concerns and problems reflected very successfully... Another part I liked about this film is small town people having some deep existential discussions made very natural where nothing stands out as made up or boring.<br><br>I must say I am as much or even more intrigued by the father character where him being different, isolated and looked down by others because of somewhat materialistic failures in his life (gambling etc.), but yet somewhat he represents the true success in life by living a self sufficient life in a small basement, with a dog and other animals, still with a sense of humor, with no harm done to anyone or expecting much of anything from anyone, and in the end perhaps being the least depressed. Furthermore certainly by being the only person who cared for his son's writing.<br><br>Like many people to me the more I think about the film afterwards means the better that film is and I sure still think about, and digest this film and the anecdotes within.","user":"goren-60463","rank":[31,35]},{"title":"Wild Pear Tree: An incomparable experience","rating":10,"date":"3 June 2018","review":"Is it possible to feel the same things with somebody struggling to build his own life, the difficulties he faces to be free from his parents' expectations or oppressions, to realize that they are not his supporters but his obstacles?.maybe a part of it, yes the duration of the film may be longer than the standards (who determines them?) at the end i felt that every scene was necessary to get closer to Sinan's feelings. Asuman who watches a Yilmaz Guney's film, the mother slapping his son's face scene in that film, maybe inspired her to make \"why you didn't get the money from him\" conversation with her own son or the imams and Sinan's debate about faith, the famous writer's and Sinan dialogue then conflict..even the scene about the tight budget of the lottery salesman maybe reminded Sinan his father's situation. I feel very lucky to watch this film in its original language and I'm still digesting it but as soon as the film ended, i felt like Idris, Asuman, Sinan and all other people around him are still living there, in that town Çan!","user":"billurdabak","rank":[68,88]},{"title":"Witty and Beautiful","rating":9,"date":"4 November 2018","review":"The wind rises as Sinan and Hatice kiss at a spring on the outskirts of the forest. It is the threshold of many things, not merely the forest. A few steps in the right direction will lead to love and the fulfillment of dreams. The wrong steps invite heartbreak and the crushing weight of societal expectations. Which way to go?! While Sinan inspires Hatice to let her hair down, a big step in Turkey, he can't seem to help himself. The gambling addiction, fawning desire to please and wild schemes of his father are not where Sinan wants to go, yet understanding his father is the key to understanding himself, for better or worse. Wild pears are isolated misfits, and so are father and son.<br><br>This witty and beautiful film is full of metaphors, wonderful imagery and deep, intriguing conversations. The film revolves around many interesting themes. Among these themes is that ruptures in the soul should be treated with joy and patience for they help us discover who we are. The cinematography is luminous, mesmerizing and far ranging from lamp lit streets at night, rainfall and close-ups of Hatice's flowing hair. I want to linger in each place. It is a long film, but for what it reveals about contemporary Turkish society and human nature, it is a fantastic bargain and worth the price. From the director of Winter Sleep and Once Upon a Time in Anatolia. Seen at the 2018 Toronto International Film Festival.","user":"Raven-1969","rank":[28,36]}]