[{"title":"Not great, but way better than 1 and 2","rating":5,"date":"3 August 2018","review":"Compared with the first two movies this one is way better in terms of story, acting and overall tone. Instead of having overtly atheist two-dimensional straw men as in the first two films, all of the characters both religious and non are drawn with some depth. And instead of the religious characters being unambiguously good and everyone being evil, both character types are given to actions both good and bad.<br><br>I can't say that this is a \"good movie\" in comparison to big budget titles, but within it's trilogy and within the genre it's a cut above the rest.<br><br>Full transparency; I am an atheist, but not a fallen Christian. I watch these movies to get a sense of what this segment of the Christian community is saying about people like me. And where in the first two movies I was laughing at the naive portrayals, this one was much more balanced.<br><br>In summary, It's pretty much a Hallmark movie, but with more overt religiousity. If you're into that, give it a go.","user":"jherr-65-410650","rank":[34,51]},{"title":"It just don't happen that way","rating":3,"date":"3 April 2018","review":"David A.R. White who is probably the premier actor in Christian films takes center\nstage in the third God's Not Dead film. In the previous two he was in support. As Reverend David Hill his church is located on the grounds of the university campus\nand also houses the campus ministry. <br><br>I'm not sure I could find enough space to tell all that was wrong with this one. In\nmy city a landmark building like that, no way would it be torn down not with\nthe active preservationists that are here. Even after it being firebombed because some don't like the message it was giving out it would have been repaired and preserved, eminent domain or no eminent domain.<br><br>Firebombed it is by a disgruntled youth played by Mike C. Manning and the fire\nand explosion cost the life of visiting pastor from Africa, Benjamin Onyango.\nThe battle lines are set between White and University President Ted McGinley\nand the campus divides.<br><br>The confrontation also brings about a reconciliation of sorts between White and older brother John Corbett. He's one of those secular humanist lawyers,\nbut when you need one good to have one in the family.<br><br>Shane Harper returns from the first God's Not Dead film. He's changed careers\nand now is a youth pastor working with White. Harper describes himself as a\nliberal type himself, he does Habitat For Humanity type work, he says he battles for civil rights. I wonder if that includes LGBTQ rights. No gays or\ncampus gay organization in sight on this large university.<br><br>This one surely has a fairy tale ending though which you have to see to believe.\nI wish it were all that simple. And as for young Manning I will say that the killing was not his intent. If you watch enough Law And Order you've heard\nthe phrase 'intent follows the bullet'. What happens to Manning is just plain\noff the wall. If this were New York County ain't no way Jack McCoy would have\ncountenanced it in a New York minute.<br><br>Things just don't work out in the real world compared to what we see in God's\nNot Dead: A Light In The Darkness.","user":"bkoganbing","rank":[54,98]},{"title":"As a Christian, this movie is bad.","rating":4,"date":"31 January 2019","review":"Okay, to all of my fellow Christians out there reading this, it is OK to not like Christian movies. Yes, their message is good, but it doesn't mean its presented well. God taught us to be loving, accepting, and forgiving...<br><br>But I'm sorry, these movies are atrocious. The setups are unreal, over the top, and in all honesty made to scare christians. They show that everyone hates our religion and is actively trying to destoy it, which there are some that do believe that, but chances are you're not gonna have to encounter that. So much money is put to a franchise that builds off of propaganda that makes every little thing in someones life extremely important and dramatic. A lot of pureflix films are as cheesy as Blumhouse horror films at times. Really look at the way its shot, take away the stilted acting, the way it's directed shows how terrible they are. Shots where we're supposed to feel emotional makes us laugh because they're so over the top and cringey. I know the actors are trying their best, and the younger actors aren't too terrible, but these movies aren't low rated because of everyone hating on Christianity. They're hated because they're actually poorly and cheaply made films.","user":"AllidoisxWynne","rank":[11,17]}]