[{"title":"A realistic look at the fallout on one family on dealing with Alzheimer's","rating":7,"date":"10 November 2018","review":"\"What They Had\" (2018 release; 98 min.) brings the story of a family dealing with Alzheimer's. As the movie opens, we see an older lady getting up in the middle of the night, getting dressed and leave the house while it's snowing hard. Some time later, her husband wakes up, and realizes that his wife Ruth, who has Alzheimer's, is gone. He calls his son Nicky to come help look. Nicky in turn calls his sister Bitty who lives in California. He asks her to come help with the situation, and Bitty along with her daughter Emma fly from California to Chicago. The next day Ruth is found, but it is clear this cannot go on. Or can it? At this point we're 10 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is the writing and directing debut of actress Elizabeth Chomko (who does not appear in the movie). Yes, another movie dealing with Alzheimer's. As someone who has deal with this horrible disease up close (my dad deal with extreme Alzheimer's at the end of his life), I am more often than not surprised how \"off\" these movies are. Take Julianne Moore's \"Still Alice\" (for which she won a Best Actress Oscar no less): I thought it was a pretty weak movie. In contrast, I was surprised how \"on\" Chomko has it. The movie focuses more with the fallout onto the family having to deal with Ruth, rather than Ruth dealing with the disease, and that is a smart tack. Along the way, the script also explores the tensions between Nicky and Bitty, between those two and their dad, and between Bitty and her 20 year old daughter Emma. THe movie benefits from a strong ensemble cast, led by Hillary Swank as Bitty and Michael Shannon as Nicky. Beware: this movie is mostly an emotional gut punch, particularly in the last half hour. This isn't the type of movie where you walk out of the theater and think \"that was a jolly good time!\"<br><br>\"What They Had\" premiered at this year's Sundance Film Festival and it finally opened at my local art house theater here in Cincinnati. The Friday early evening screening where I saw this at was attended okay but not great (about 10 people). I can't see playing in theaters very long. For that the movie is too downbeat. But hopefully this can find the wider audience it deserves when it becomes available on other platforms. If you have an interest in Alzheimer's, or simply want to see a good drama, I encourage you to check it out, be it in the theater (if you still can), on VOD, or on DVD/Blu-ray, and draw your own conclusion.","user":"paul-allaer","rank":[30,37]},{"title":"A grim and surreal look into a hard to understand disease","rating":10,"date":"9 January 2019","review":"This film isn't just about a disease, but a life well spent and a life well lived. The drama between your inner circle, the ups and downs and most importantly the commitment that is needed to see it all through.<br><br>Such Grammy material, superb and beautiful acting by the main fast and the message itself is one to take to the heart. I highly recommend this film.","user":"vau-51847","rank":[26,34]},{"title":"Great Cast & Great Directorial/Writing Debut For Chomko","rating":9,"date":"10 January 2019","review":"Terrific all-star cast here and a remarkable directorial and writing debut for Elizabeth Chomko. Difficult to watch at times, as the movie depicts the devastating effects of dementia, not only for the person affected but for their families as well.<br><br>The dialogue here is incredibly realistic, the characters completely believable, and the interplay between them works exceptionally well. Somehow, Chomko manages to get in some well placed humor along the way.<br><br>Overall, just a powerful and poignant drama and I might suggest keeping some tissues close by for the final 20 minutes of the film.","user":"larrys3","rank":[22,29]}]