[{"title":"Great film, but should have been a 6 episode mini series","rating":8,"date":"9 November 2018","review":"Outlaw King is one of the most visually breathtaking films of 2018, the cinematography, the set pieces, costume designs, are absolutely perfect. The story, based of a true event, is very engaging, and the film does a great job at making you route for Robert Bruce. However, the film feels like it should have been longer, which makes me believe that it should have been a mini series instead. The period in which this film takes place, was a major event in Scottish history, and they crammed it all within a 2 hour movie. Some of it works, and some of it doesn't.<br><br>The actors are all fantastic, Chris Pine was great as the Bruce, although I would have preferred Gerard Butler in the role, Pine gave a very convincing performance. Most of the other characters are very bland, and you don't get much time to spend with them, as they just stand in the background and do some cool stuff. Aaron Taylor Johnson however was the highlight of the film, and I wish we got to see more of him. He was insanely entertaining here, as a savage lunatic eager to avenge his family.<br><br>Some reviews I have read have pointed out that the English are portrayed in a very negative manner, which is true. They are made to be evil in this film, burning castles, and slaughtering innocent people, but this film is as historically accurate as possible, and these events most likely took place. But like I said before, everything is crammed together quickly, if they had made a mini series they could have showed more of the story.<br><br>The action scenes are brilliant in the Outlaw King, and you can tell that most of it was inspired by Braveheart, from the gore, to the realism. However I feel the movie put style over story and characters. I would watch it just for its visuals alone.<br><br>The Outlaw King will disappoint fans wanting a new Braveheart, but history buffs, or hardcore movie goers will love this film for what it is, a good piece of entertaining visuals and action.<br><br>7.7/10","user":"Dannyboi94","rank":[240,289]},{"title":"Directors Cut Please","rating":6,"date":"9 November 2018","review":"This film has so much potential, the scenery is stunning and the acting was strong (Pugh, in particular was excellent). The problem with this film is that it felt far too rushed. The scene with the queen's declaration of love after barely establishing a relationship between the characters on screen showcasing this problem.<br><br>I'd love to see the full directors cut. It seems Director David McKenzie has been caught out by perhaps trying to appeal to the masses by cutting around 30 mins from the original screening in Toronto, following heavy criticism from the film critics. Critics often get it wrong, without proper screen testing it seems like a knee jerk reaction has been taken, which is a shame.<br><br>Hopefully he releases a directors cut, the full, as intended Toronto screening, or a longer version of what has been released on Netflix, I would like to see if that solves the pacing issues, and if so, this could easily move up a couple of points on the rating.","user":"rgdw","rank":[113,142]},{"title":"Don't listen to the negativity.","rating":9,"date":"10 November 2018","review":"This was a legitimately moving and entertaining movie. The acting is absolutely fantastic, the cinematography is impeccable and the practical effects are undeniably realistic.","user":"ryankhawkes","rank":[238,311]}]