[{"title":"Painting and surrealism","rating":6,"date":"5 November 2019","review":"Anna Maria Dalí (1908 - 1989) was the sister of the well known painter and multimedia/performance artist Salvador Dalí (1904 - 1989). She was born in Figueres and lived most of her life in the Catalonian coastal town of Cadaqués. She was a close friend of Andalusian poet Federico García Lorca, who spent several summers in the Dali home in Cadaqués, and knew other budding iconoclasts of the Spanish cultural scene like the surrealist cineast Luis Buñuel. Anna María was a writer in her own right; her themes were her brother and the people and happenings in her hometown.<br><br>In 1942 Dalí wrote a fanciful autobiography, The Secret Life of Salvador Dalí (in French, later translated into English). His relation with truth was notoriously lax, and he saw no difference between living and playacting. Anna María wrote two works to refute or correct many statements in Dalí's autobiography, Salvador Dalí Seen by his Sister (in Spanish, 1949) and All Year In Cadaqués (in Catalan, 1951).<br><br>Most of the film consists of spoken reminiscences (in English) by Anna María, played with authority by the Welsh actress Siân Phillips. She gets the best lines in the script. Anna María studied English in Cambridge, which explains her mastery of the language and gives opportunity to introduce a friend from Cambridge played by Claire Bloom. Hers is a thankless role since the script limits her to react benevolently to all of Phillips' statements and add some platitudes from time to time.<br><br>The first objection to this film is its length. There is a lot of repetition, and it could be pared down to normal length without essential loss. The second is, although Dalí is seen painting in many scenes, none of his works are shown at all, not even his many paintings of Anna María. Nevertheless, I enjoyed viewing this movie, with some discreet use of the fast-forward button here and there. I also learned a few new tidbits; for instance, Dalí's shameful support of dictator Francisco Franco after the Civil War may have been motivated by Anna María's harrowing experience as prisoner of the anarchists at the end of the war.<br><br>The retrospective scenes (in black and white) that show the painter and Anna María in their youth with their friends and parents are perhaps the best achieved. Joan Carreras plays Dali unaffectedly and the rest of the actors are equally good.<br><br>A final objection. The use of subtitles in the copy I streamed is inconsistent; the dialogue in many scenes is spoken in Catalan, and left untranslated.","user":"hof-4","rank":[0,0]}]