[{"title":"Unconvincing, uninteresting undercover blues","rating":5,"date":"29 June 2017","review":"Another user here called this flick 'heroic bloodshed'. I find that qualification a bit misleading. I'm of the opinion (not shared by everyone) that 'heroic bloodshed' should be reserved for a particular wave of Hong Kong action flicks of the late eighties and early nineties. For my taste, EXTRAORDINARY MISSION is too far removed from the meticulously choreographed, highly stylized gun violence that was so typical of those flicks. (The same user review that equates this flick with heroic bloodshed also mentions Bay as a reference point, which is more on the nose, I think.) <br><br>If we have to stick with Eastern action flicks for references I would call this a cross between INFERNAL AFFAIRS (written by the same guy) and last year's OPERATION MEKONG. Sadly, this flick borrows the convoluted plot from the first flick and the overall ridiculousness (and not to mention nationalistic attitude) from the second.<br><br>I have nothing against ridiculous action flicks, far from it, but EXTRAORDINARY MISSION tries to be a serious undercover cop drama while serving up nothing but clichés. It fails to be believable. Neither was MEKONG, but what that flick at least delivered was a barrage of hard violence and insane action sequences (with the shoot out in a mall half way through as the real high light). To see anything similar in EXTRAORDINARY MISSION you will have to wait until the last 20 minutes or so. The action is spectacular, but for me, it wasn't worth plowing through ninety minutes of unconvincing, uninteresting undercover blues.<br><br>If you're an action fan and haven't already seen OPERATION MEKONG I suggest you put this flick aside and watch that one instead.","user":"bobcobb-84371","rank":[5,6]},{"title":"Not THAT bad, but I'll probably forget it.","rating":4,"date":"20 June 2018","review":"After a promising start, some fine action sequences and beautiful scenery, the film slows down significantly around the halfway mark. It then drags the viewer through a series of events that I just did not find compelling enough. It only livens up towards the end again to bring us a great climatic chase scene with shooting and explosions galore. Like most drug trafficking films it did not capture my attention for the duration of the movie. I must admit, though, this one did have more depth and emotion than most films of the genre, and featured beautiful music, as well. I enjoyed the fact that all the characters managed to find closure for their inner demons.","user":"paulclaassen","rank":[2,2]},{"title":"What a load of crap!","rating":6,"date":"6 June 2017","review":"Other than those chasing and gun fights, what we got here is a stupidly written screenplay and very bad and wrong casting job. So you just give some fake identity cards to a entry level cop, then this guy could so easily become an undercover druggie who could so easily infiltrate the drug cartel and rapidly raises himself as one the key persons in the cartel? What a joke! Then this guy could so easily arrange meetings with his handler and submit the cartel's activities, manufacturing factories, routes and whatsoever. The crappy screenplay simply making everything look so easily and readily arranged. And then we got the serious problem of casting. The leading actor who plays the undercover guy did a poor convincing job, his only thing to act like a lowlife is just keeping chain smoking. The car chase, the escape....whatever, every scene just look so conveniently and easily self-explained but simply highly unlikely and impossible, yet every impossible scene and scenario just worked out easily. <br><br>This film just borrowed a lot of thrilling action scenes to cover up all its impossible and improbable scenarios. The screenplay simply sucks big time, it gives you lot of busy scenes on the screen but never paid any attention to the logic and reasoning. It's more like a video game instead of a convincing movie.","user":"LogicIsEverything","rank":[10,18]}]