[{"title":"If only they put more work into the script...","rating":4,"date":"15 September 2019","review":"I have found a number of Chinese movies and television shows to be entertaining, so I don't have an automatic prejudice against them, as apparently some other IMDb users have. This particular Chinese movie has some interest in that while it was officially based on a book, it's clear that it took a little inspiration from the American blockbuster \"Independence Day\". It aims to stand up well to its inspiration, and to a degree it does, having top notch cinematography, sets, and props. The CGI does look a little cartoony at times, but that didn't bother me too much, since it's often that way in American blockbusters.<br><br>What DID bother me, however, was the script. The scriptwriters definitely should have had some professional feedback to fine tune it before filming started. As it is, the movie first starts off with an almost incomprehensible opening, as if several pages of explanation had been written but were ripped out. A bigger problem is with the characters of the movie. There is no attempt to make the alien invaders anything more than a mindless robot-like foe. Also, there's little attempt to flesh out the human characters; they generally come across as stock characters you have seen in other movies before instead of having true and interesting personalities. Also, the story comes to a halt for long periods several times, resulting in some dull patches.<br><br>While this Chinese blockbuster is a better than the recent Chinese blockbuster \"The Wandering Earth\", it's not by much. I will end this review by saying what I said for that earlier film: If Chinese filmmakers really want their homegrown blockbusters to be embraced by a world audience, they really need to make sure the scripts are decent enough before filming starts. If that were to happen, Chinese movies would start being serious competition for Hollywood movies.","user":"Wizard-8","rank":[18,22]},{"title":"Rubbish","rating":1,"date":"16 August 2019","review":"The plot mixes love story, war and science fiction, but none of then has been clearly expressed.<br><br>Also the voice problem, the voice is dubbed by actors themselves, however, it cannot match their mouthes in screen!<br><br>An interesting comment in Chinese movie web 'Dou Ban' reads below:<br><br>\"Wandering Earth had opened the gate of Chinese science fiction movie.\nNow Shanghai Fortress has closed it again\"<br><br>While the box office has been a disater for this rubbish, I'm still having good hopes on Chinese SF movies' future.","user":"malavia-94356","rank":[41,62]},{"title":"Who wrote such a horrible script?","rating":1,"date":"12 September 2019","review":"I want to like this movie but don't waste your time. Wolf Warrior 2 and the Great Wall got a 7/10 from me. Wandering Earth doesn't make a lot of sense but there was at least some good story lines, characters and decent cinematic. That got an 8. Operation Red Sea got a 4 and I thought that was pretty bad.<br><br>Shanghai Fortress is a whole other level of \"face palming, oh my god, what am I watching kinda bad.\" The premise of the story was already kinda contrive but they don't spend any time explaining what the hell is going on. No setup, no background, no nothing. Then there was whole love story and team building aspect that was just thrown in there to tug at heart strings.<br><br>It's like a 14 year old wrote the script but any other 14 year old would have done a better job. Yes, it's that bad. They should have saved some money from all that CGI and hire a better team of script writers.","user":"Silhouette10","rank":[34,52]}]