[{"title":"Not My Cup of Tea","rating":5,"date":"19 June 2019","review":"I saw that this documentary received very high praise from pro critics, but it's not my cup of tea. From what I read, the young director RaMell Ross , making his feature debut, shot 1300 hours of footage over 5 years and was looking more in this presentation to be poetic and lyrical rather than offer a cohesive storyline.<br><br>As Ross depicts day-to-day life in a small predominately African-American town in Alabama, there are certainly some striking images here One segment of the movie is just completely sad and shocking. But the film was just too disjointed and fragmented to appeal to me on the whole.","user":"larrys3","rank":[10,11]},{"title":"\"Samsara\" for the American South","rating":7,"date":"31 January 2019","review":"With documentaries, we are used to being explicitly told the narrative. We are used to linear storytelling. We are used to talking heads, some witty banter with the filmmakers, an occasional irreverent interviewee, and some title cards at the end to explain what happens to everyone after the project has finished. With \"Hale County This Morning, This Evening,\" not only are these items nonexistent; there's barely any context for the film we're left with.<br><br>The only context we're given is delivered quickly, right up top, explaining that RaMell Ross, the director, began the project in 2009 as he was tracking the local basketball team. There's a considerable focus on these teens in the final cut of the film, but there's much, much more, too.<br><br>There's Daniel, the basketball star who dreams of getting his family out of poverty through attending Selma University. There's Boosie, caring for her child with two more on the way. There's Quincy, Boosie's husband, whom we first meet crying as he has his nose pierced. And there's, of course, Quincy and Boosie's kid, a hyperactive youngster who adores the camera.<br><br>Through each of these characters and a handful of peripheral personalities, \"Hale County\" constructs a dreamcatcher of moments -- I hesitate to call them stories, given how loosely the film treats them, so \"moments\" is more appropriate. But in those moments, the African-American, low-income world of Hale County breathes deeply, forcefully. A police officer stops a car, and a deer steps out, trepidatiously, onto the road to get a better view. Its breath comes out in billows of condensation. At another point in the film, a young man stands with his father as a thunderstorm crackles over the horizon. The wind tugs at their clothes and threatens to pull them away.<br><br>Beyond these standout moments, aided by Ross' divine cinematography and precise editing, the majority of the film is told through the perspective of children. The best shot in the film sees a plane gushing a smoke trail as it falter in mid-air and falls, dramatically, plumes running behind it. As it falls, in one continuous shot, we find ourselves staring at Quincy and Boosie's child, crying, so close to the camera that you can see the tears sparkle.<br><br>For narrative lovers, \"Hale County\" will understandably disappoint. It fires on the levels that \"Samsara\" and \"Baraka\" do -- this is a tonal piece more than a narrative one. To this end, however, the sound recording leaves a lot to be desired. Some of the flourishes work, like leaving in a rough, barely audible background conversation between the filmmaker and a chatty subject. But most of the film features poor recording, and much of it with unmic-ed subjects. At a certain point, I stopped trying to understand what people were saying and just watched for the visuals and the music.<br><br>If you go with the film and let it take you on its winding, existential journey, \"Hale County\" travels the breadth of the human experience, from a blissful two-plus-minute shot of an infant running to and fro across the room like an excited puppy to a solemn view of smoke from a burning tire, cascading over trees as it reaches toward the sky.<br><br>Some parts of \"Hale County\" hit me harder than \"Won't You Be My Neighbor,\" another, more widely seen doc from this year. In those scenes and in the more quiet, reflective moments, the movie calls to mind that trope about the \"long night of the soul.\" \"Hale County\" isn't THAT dramatic, but its humanism and its experimental storytelling capture, hauntingly and beautifully, the morning and evening of the soul.","user":"horsebeaverfoxman","rank":[9,17]},{"title":"good","rating":5,"date":"23 June 2019","review":"Undeniably well made, this documentary focuses on the residents of this small town and shows their lives. However, i did eventually lose interest in it as there really isnt much forward momentum in the storytelling.","user":"AdityaLovemovies","rank":[3,4]}]