[{"title":"Great movie. amazing acted & made","rating":9,"date":"23 February 2020","review":"'A Quiet Place' is a somewhat post-apocalyptic thriller co-written, directed, and starring John Krasinski with his real-life wife Emily Blunt. The pair and their three kids (not-real life) are up against a villain who really doesn't like noise. The sound design is some of the best in recent time. The sound and sometimes (often) lack there of make this movie. Krasinski shoots to precision with a pretty good story to match. Are there a few inconsistencies? Yes, but there is never a time this movie lost my attention. Your nerve will be challenged and your skin may crawl, but don't let that stop you from watching this riveting feature. Final Score: 9/10","user":"MR_Heraclius","rank":[56,70]},{"title":"A great concept with frustrating choices","rating":6,"date":"10 April 2018","review":"Anyone who lives in the world and follows movies has a pretty good idea of the main concept behind a quiet place: there are beings that will kill you if you make a noise.\nThe film does very little to try to explain where these beings come from, all we know is how long they've been there for and that they have change the face of the planet in a pretty radical way.<br><br>We follow the Abbot family, who lives in a remote country house with an elaborate system to keep each other safe, but the main thing is that they have become very skilled at being very quiet.<br><br>The incredible result of that premise is that the film has very little dialogue and instead, makes great use of visuals and sound. And there are truly stunning set pieces in this film, and without spoiling anything, Emily Blunt gives a stellar performance, as usual. <br><br>Frustratingly, because the film chooses to concentrate on the action and the premise, it failed to give real substance to its characters and their relationships. A very artificial conflict is created between the dad and his daughter, and it truly feels like it was added into a later version of the script to give some sort of emotional arc to the characters, but the result is clumsy at best, a bit ridiculous at worst.<br><br>Additionally, the film fails to create very clear rules on what the creatures can and cannot hear, how they function, how they are able to detect obstacles in their path, how many there are, or how fast they move, are all animals dead, and the list probably goes on. The result is that whatever is established at one point inevitably changes later on to fit the dramatic needs of the story, but it undermines our ability to suspend disbelief. Repeatedly, it feels like the film is doing its best to thrill, even if that means going against the film's internal logic. <br><br>On a similar note, around the middle of the film John Krasinski takes his son hunting. At some point, they stop by a waterfall, next to which Krasinski starts yelling, casually explaining to his son that as long as there is a louder sound next to them, they are absolutely safe. I was thinking the same thing during the first half of the film, namely - if these creatures follow sounds, then, wouldn't it be simple to constantly distract them with sounds everywhere? We certainly have the technology to do that. Also, shouldn't there be sound proof shelters? Couldn't all humanity focus on sound proofing all of their homes??<br><br>But even if we accept for one second that these solutions are impossible, then, why not move next to a waterfall or any other natural place that is always very loud?? Plus, it doesn't look like they are able to shower at all, a waterfall would make a lot of sense hygiene wise.<br><br>I understand that this is a movie and sometimes internal logic needs to be sacrificed, but this became a tough sell after that moment and it felt like the film did very little to address that glaring problem.","user":"CharlesAncelle","rank":[979,1]},{"title":"Original","rating":7,"date":"11 December 2018","review":"A Quiet Place is a flawed film with many illogical decisions but non major enough to be considered brainless.<br><br>The films main flaw are its own creatures (who kill whatever makes a sound) and the lack of explanation behind them makes the concept fell rushed. The film fails to clarify what those creatures can or cannot hear and how they move or function.<br><br>Another flaw is the family's lifestyle. We know they've become skilled at being quiet and we know they live on a farm in the countryside. Inside their house is a basement which muffles the sound yet the family doesn't use until ¾ in the movie. Other illogical flaws beg a few questions; Why doesn't the family have a house near the river? Who don't they apply soft fabric to their shoes instead of using sand to muffle sound?<br><br>Accept those and a few other issues A Quiet Place does a fantastic job making use of its visual and sound effects as well as having minimal dialogue. All the actors, especially Emily Blunt give realistic enough performances.<br><br>Ultimately A Quiet Place fails at being scary and is quite illogical at times but its tense enough to be entertaining and its originality are a nice change of pace for horror/thrillers good enough for a second viewing.<br><br>Final Grade: 7/10","user":"Aaron_Kyle","rank":[271,378]}]