[{"title":"Funny, Relatable, Not To Be Taken Too Seriously","rating":8,"date":"19 January 2019","review":"I didn't expect much from this movie, I decided to watch because of a couple funny gifs I saw on Tumblr. I haven't seen much of McKinnon's work but after watching TSWDM I would gladly watch everything she stars in. I love her style of humor - quick, raunchy at times, honest. Maybe shes \"a bit much\" to some, but I really enjoy her silliness and the chemistry she and Kunis share. Two beautiful, funny, smart and completely relatable best friends getting into secret spy shenanigans in Europe? Sign me tf up. I've watched it twice and I'll more than likely watch again.\nIn conclusion, this film obviously isnt going to be everybody's cup of tea. But I personally laughed my a** off. To the low reviewers: watch without taking it so seriously and you might enjoy it too.","user":"msand1793","rank":[56,67]},{"title":"Enjoyable.","rating":7,"date":"16 December 2018","review":"I expected fun and laughs and that's exactly what I got. Everyone played their parts alright, especially Kate McKinnon who is hilarious and Sam Heughan who I'm a big fan of.<br><br>As far as the plot goes, well it's a bit far-fetched but that's expected in comedies nowadays, these odd plots somehow work. It's nowhere near great, but it's a decent watch on an afternoon. I'm accustomed to watching these type of comedies so I judge them according to what they are, essentially. I just went along with it.","user":"patriciogl10","rank":[63,80]},{"title":"Very entertaining","rating":9,"date":"22 December 2018","review":"Don't expect deep charater studies, layered storylines, plot twists like apparently some of the reviewers do. Frankly I find it absurd to rate a solid, entertaining, popcorn movie with 1 or 2 stars. Maybe you don't like this genre. But rating a Bach concert with one star because you hate classical music or Bach doesn't make any sense. Within its genre I would have rated it with at least 7 or 8 IMDB stars. I gave it 9 to balance out some of the super negative reviews. There are plenty of chuckle moments some good laughs, good and even great action, a simple but effective storyline, good acting, nice build up. Kate McKinnon gets better throughout the movie. I wonder if they actually shot the second part later than the first part, or if the script just suited her better in the second half.\nI was entertained throughout. And would recommend it to anyone who's looking for a lighthearted, action/comedy movie.","user":"magus-4","rank":[49,62]}]