[{"title":"A good flick if you find it at the right time.","rating":7,"date":"17 December 2019","review":"Sure, this movie isn't going to be buzzed about for years to come and isn't breaking some new ground- but I happened upon it when I needed it.<br><br>When Green's character asks \"don't you miss your life\" and McCaulkin answers \"how can I be missing my life if I'm living it\"- this film delivered a message I didn't know I was looking for. The story, path and characters were relatable to where I'm at/feeling currently and it delivered a message to slow down and enjoy what's right here.<br><br>If you need a movie where you can get lost with a cast dealing with their own lives, give this a try. There's some good humor and it doesn't try to be anything it's not. It was an easy, quick watch that left me feeling like I'm ready to get out there and live.","user":"dpszakacs","rank":[17,17]},{"title":"Beautiful","rating":9,"date":"20 October 2019","review":"A beautiful and gentle film. Short but perfect, and captivating to watch. Friendship, warmth and empathy. Unlike so many other films today it has spirit and holds the attention without resorting to sex, violence and expletives. Maccauly Culkin proves once again that he is still a brilliant actor.","user":"ajhmacleod","rank":[9,9]},{"title":"A good road trip buddy film. With good lessons on caring.","rating":7,"date":"4 September 2019","review":"First, I want to say that I think most of the review are pretty harsh. O think alot of this review we hate Seth Green so there is a great deal of bias. This is a small film and I'm a small film lover. This film has an amazing backdrop and a great cast. This movie is about friendships and about deciding and fighting for what you want. This movie is not about drama or answers it about not just letting life happen to you. I'm a male, if bonding and real friendship goes no further than get drunk and talking about pu--y. Then this film is not for you you will hate it. It reminded me of another small film of just life \"The Great &amp;the Small\". I think this film showcases friendships that I guess a small community of us are fortunate and blessed to have in their lives.","user":"picassovegas-912-724150","rank":[9,10]}]