[{"title":"Stunningly beautiful Giant Bluefin Tuna imagery - I will NEVER eat sushi again","rating":17,"date":"17 July 2019","review":"OMG - I had no concept, no idea at all about Tuna - other than food. This documentary gives the viewer an up close and personal perspective of these MAGNIFICENT creatures both in the wild and whilst being slaughtered - the images and imagery captured and provoked by the film makers are poignant. stunningly beautiful and truly disturbing - all at the same time.<br><br>It seemed to me that one of the goals of this documentary (by inviting the viewer to be physically so VERY close to these magnificent creatures) was to create an emotional response, empathy and an understanding of Giant Bluefin Tuna as a wild animal &amp; not that a piece of meaningless sushi that has been gorged \"worldwide\" so that they are VIRTUALLY extinct - if so, the film makers certainly succeeded with me<br><br>Whist I am virtually helpless in stopping the Giant Bluefins from extinction - as over 90% - NINETY PERCENT of their population has been gorged mainly for sushi and their best breeders are also the favorite target of big game fisherman - a truly miserable outlook and most likely extinction seems the only viable possibility for these magnificent creatures........... I can at least marvel at their magnificence ...........you know, the GIANT REDWOOD aint just another tree and the Giant Bluefin aint just another fish - far from it<br><br>I can also NEVER eat sushi again - for me it is impossible to do so after this truly thought provoking experience I had while watching this very well put together documentary","user":"telecashcard","rank":[3,5]},{"title":"Extraordinarily brilliant piece of work!","rating":10,"date":"3 August 2019","review":"An absolute must see film. Stunning photography and thought-provoking. Have compassion. Show empathy and feel for those we exploit and subject to immense suffering. Take a stand against violence -- violence of any kind. Without awareness there is no free choice. Be mindful of how your daily actions can affect others.","user":"sac8175","rank":[1,2]}]