[{"title":"Had it's moments","rating":5,"date":"17 May 2019","review":"There is a good idea behind the film and generally the lead 2 were likeable however it did have the feel of a TV movie in my opinion and the rest of the cast didn't seem to be on the same level. There were moments I was really buying into it but others where it was misfiring. With a few changes from the writers and an increased running time could certainly have been better then ending especially seemed rushed which is suprising given its short lengths and the powerful scenes that could potentially have been had at the weeding leading up to it and following. Still not a bad film but not enough to stand out for me.","user":"muamba_eats_toast","rank":[8,9]},{"title":"Everyone needs a little faith.","rating":9,"date":"9 October 2018","review":"Tucked (2018) is an English movie written and directed by Jamie Patterson.<br><br>The film stars Derren Nesbitt as Jackie, a straight man who performs as a woman at a nightclub. He's not just Jackie, as he tells us. He's \"The one and only Jackie.\" <br><br>Within the first few minutes of the movie, we learn that Jackie has a particularly aggressive form of cancer. His physician tells him to ease back a little, but naturally that's exactly what Jackie doesn't want to do.<br><br>Enter Jordan Stephens as Faith, a new performing artist at the club. We're never sure if Faith is straight or gay, and that's the way he wants it. He's very talented, and he certainly could be successful, especially after Jackie takes him under his wing.<br><br>There's a subplot about Jackie's estranged daughter, which is predictable, but works well enough. Actually, the entire film is fairly predictable. We know the beginning and we know the end.<br><br>What makes the film work is what happens along the way. It helps that the acting is truly outstanding. We learn to care about both Jackie and Faith and to care about exactly what will happen next.<br><br>We saw this movie at Rochester's great Little Theatre, as part of the outstanding Image Out, the Rochester LGBT Film Festival. It will work well on the small screen.<br><br>This movie has too few IMDb ratings to be meaningful, and I believe that I'm the first IMDb reviewer. So . . . you'll have to take my word for it that Tucked is worth seeing. Or, as Faith says, \"Everyone needs a little faith.\"","user":"Red-125","rank":[13,18]},{"title":"A for Idea, Concept & Acting, D for execution - it falls flat","rating":3,"date":"7 May 2019","review":"What a lovely concept &amp; idea, and what fresh, committed actors. Some of the integral scenes where the actors flourished were really powerful. Another positive is that this is a good attempt for something new, outside the common McHollywood gay-gay-rah-rah tripe. Otherwise, it needs a lot of help.<br><br>This seems to be another victim of made-for-cinema TV melodrama is relied upon to carry the whole film. The main character is terminally ill.<br><br>Script: the dialogue is so illogical at times it completely throws any mood the actors worked to build. Basic time &amp; place problems, chronology and believability. Young person arrives, is 21 years old, but somehow not old enough to stay on a coworkers couch? And then, the repetition - same sob story about the terminal illness and being abused by \"dad\", and \"I'm not gay I'm straight\" - it borders, I believe unintentionally, on misandry and internalised homophobia.<br><br>And how many times do you need a main character to fall on the floor, and how many fart, potty and pee lines do you really need in one film? It did not serve the film. Jackie's makeup told more of the life he/she lead that all the falling on the floor Reality TV nonsense.<br><br>And for all that's good and great in the world: PLEASE STOP WITH THE JERKY CAMERAS. No one is ever going to want to watch these films in 20 years - and what's with the manipulated screen proportions - aspect ratio? Dream sequences? Maybe. The entire film? no, please.<br><br>Second is the desperate attempt to pack the film full of every Pollyanna PC Pronoun cause you can find - we don't need the preachey lessons on gender and all that - we need to see these particular characters flourish in THEIR environment, as THEY are. Problem with this is - even the stereotypes are inconsistent and sometimes painfully misused.<br><br>And overall - there's just too much going on. A hot mess. The saving grace of the film were the incredible jokes and rough-trade delivery of them by the Jackie character. But once we get taken on the ride, the car runs out of gas.<br><br>It seems the filmmaker had a great concept, but needed a lot of help making it into a compelling script. And needed a director with a keen, scrutizing eye. And an editor to get rid of all the extraneous &amp; unnecessary junk packed in there. Less is more. Let is happen. These actors were underserved.<br><br>I kept thinking all along that we had a young Jay Davidson emerging, and a fantastic, quirky new film to come out of indie land. Crying Game 2.0 - but this comes nowhere near. But it appears - for whatever reason - the decision makers strove to iron and choke every ounce of fresh air out of this film.<br><br>I'll be interested to see what comes next from this group. Drop the agenda, and just make the story. It's a good story.","user":"scotartsproduction","rank":[5,7]}]