[{"title":"All you ever needed to know about Roger Stone, and politics for the last 50 years...","rating":9,"date":"13 May 2017","review":"Netflix really scored big time by releasing and airing this doc on Stone. It's going to be talked about a lot, and probably for a long time, which will make RS very happy, and increase his fees.<br><br>It seems the central point might be that hate, and beyond that, fear, might be the most powerful force in the US today, if not the world... RS has gleefully exploited that observation, and built a career around it.<br><br>The doc makes it clear that RS had a lot to do with getting our current prez elected, and hints that he might have been involved with the story that is in the news at this moment.<br><br>This was five years in the making, and was started when RS was on the outs with the Republican Party, and was relegated to working for foreign dictators.<br><br>Even the filmmakers didn't know that Stone was going to be back in the limelight again by the time the film was being finished.<br><br>You might as well see the film now, because it's going to all anyone will be talking about for the next few weeks...","user":"sgcim","rank":[44,53]},{"title":"Roger Stone Taking Credit for Everything","rating":7,"date":"12 May 2017","review":"About midway through the documentary, Tucker Carlson asks \"Is it more brilliant and impressive to influence world events, or to stand on the periphery of world events and yet get recorded as having influenced world events.\"<br><br>While he was referring specifically to Roger Stone's self-proclaimed crucial role in getting George W. Bush elected in 2000, Carlson's question could apply to almost every major moment in Stone's life.<br><br>Unfortunately, the documentary does not question whether Stone is actually a major figure in American politics, but rather, takes Stone at his word that he is. Thus the documentary isn't so much a look at Stone's life as much as it is a look at Stone taking credit for everything - especially the ascendancy of Donald Trump to the Presidency. <br><br>Donald Trump is the supporting actor of this documentary, second fiddle to Roger Stone, who is seemingly the mastermind of his entire candidacy. The problem, however, lies in the film's inability to provide much supporting evidence that Stone is really as important as he claims to be. <br><br>For example, there are montages which show Stone saying something on a radio show followed by Trump saying the same thing on the campaign trail. But, we are never given much context for these clips. Is Trump repeating Stone or is Stone repeating Trump? Is Stone the only one making these campaign talking points that Trump is repeating, or are others as well? Without context, these lingering ambiguities make it more difficult to conclude that Stone was a major player in the Trump candidacy. <br><br>Additionally, Stone is given such an out sized role in the Trump candidacy that other crucial members of the Trump campaign - specifically, Steve Bannon and Kellyanne Conway - are barely mentioned. And while there is no doubt Trump did associate with Stone, the extent to which Stone helped elect Trump beyond securing the vote of the Alex Jones/InfoWars audience remains questionable. <br><br>The documentary is well-made and offers much in the way of flash and bedazzle, primarily due to its flamboyant and outrageous star, but it offers little of actual substance. In a sense, the documentary itself has been co opted by Stone for his own benefit to make sure, as Tucker Carlson said, that he is at least recorded as having influenced world events. Whether he has or not, remains a mystery unexplored by the documentary.","user":"michaelmcdonald-20730","rank":[43,55]},{"title":"Excellent expose of a truly effective political genius","rating":7,"date":"14 May 2017","review":"This documentary is a thrilling history lesson that paints Roger Stone for the persona he has created for himself -- a deviling political provocateur whose ruthless appetite for controversy and infamy influences all things he touches, for better or worse.<br><br>Whether or not you're a Roger Stone fan, Trump supporter, liberal, conservative, American or otherwise, this documentary is fascinating to watch because Stone is such a unique character in an otherwise boring and mundane facet of society, the American political system.<br><br>\"Get Me Roger Stone\" is essentially a history lesson and mythical propaganda machine at the same time. Is Stone really to blame for all the political scandals he has a hand in? Or is he merely a larger than life figure who happens to revel in his own sense of political clout? The documentary does a pretty good job of letting the viewer come to that conclusion, albeit through an expectantly liberal lens. The editing, production, and musical score always play against (or with, depending on how you look at Stone's persona) the protagonist and while it does not overtly disparage the man, it certainly pulls no punches either.<br><br>The only truly atrocious bias in the film comes from the brief clips of Alex Jones's expectedly erratic behavior which aims to align the \"racist\" \"conspiracy theorist\" and overall \"unstable madman\" with Stone's persona. I felt it was a very cheap shot, and while I'm not an Alex Jones supporter in the least, the footage they use is definitely cherry picked to make Stone's association with InfoWars to paint him as a fringe lunatic. <br><br>If you watch the documentary carefully, you'll see that Roger Stone is anything but an irrational, crazy, or otherwise unruly brute who has a hand in nearly every political campaign in the past forty years. Instead, he's merely an ingenious machiavellian who will always play the political game as if he has nothing to lose. <br><br>As a documentary I'd give it 6.5/10 As a character piece, I'd give it 9/10 Altogether it's a strong 7.","user":"juhanijspurdo","rank":[31,45]}]