[{"title":"Amazing Low-Budget Film Artistry","rating":27,"date":"27 November 2019","review":"In the bonus track of the DVD of \"American Dreamer,\" there is an extended segment called \"No Free Rides--The Making of 'American Dreamer.'\" The filmmakers described how their shoot in Norfolk, Virginia lasted only sixteen days, prior to the editing work. Volunteer students from Old Dominion contributed as interns in all aspects of production. The result was an unusually high-caliber independent film.<br><br>The title in the film in its draft form was \"All the Animals Come Out Tonight,\" and the final film cut focused on three central characters. Cam is the taxi driver shuttling a drug dealer named Mazz around Norfolk. On one of the stops, Mazz visits his infant son Prince and Mazz's girlfriend Marina.<br><br>It is in the triangle of Cam, Mazz, and Marina that the driver hatches his ill-conceived plan to kidnap the little boy and hold him for a $20,000 ransom. But Cam is so incompetent that the plan falls apart, leading to loss of life when Mazz and Marina desperately seek to locate the child.<br><br>While the subject matter of \"American Dreamer\" is grim to the extreme, the three main performances are riveting. Somehow, the actors, screenwriter, and director were able to evoke a synergy from the three characters that resulted in depth and complexity to each character.<br><br>A concept of the filmmakers as explained in the DVD bonus track was that of \"invisible people\" with a character like Cam who was once relevant as a computer programmer, but whose life fell apart when he lost his job. Mazz clawed his way up to the top and is ruthless, yet still loves his son and the concept of family. Marina is a drug addict who has lost her way, sensing almost immediately that her life is over when her son is missing. The humanity of these invisible people comes across remarkably in their lives of desperation depicted in this film.","user":"lavatch","rank":[7,7]},{"title":"Gritty & Dark Drama","rating":8,"date":"20 November 2019","review":"Gritty and dark drama with decent suspense throughout.<br><br>Jim Gaffigan is excellent as Cam, a rideshare driver who has strong mental problems and is under severe financial stress. Robbie Jones is also superb as Mazz, a drug dealer who hires Cam's vehicle for the day. In one desperate moment, Cam decides to kidnap for ransom Mazz's young son, and things will take a terrible turn thereafter.<br><br>Overall, definitely not your feel-good movie of the month, but if you like very dark films you may very well like this one. Raw language throughout, increasing violence, and one explicit sex scene.","user":"larrys3","rank":[7,7]},{"title":"Very Strong Performances From Jones & Gaffigan","rating":9,"date":"24 September 2019","review":"A very dark thriller that keeps you watching.\nI just finished watching \"American Dreamer\" via VOD.\nWhat a great movie. Jim Gaffigan was great at being such a dark character and Robbie Jones was menacing and intelligent in this.\nThe whole movie takes one dark turn after another.\nThe director did a great job at keeping the story moving non stop.\nIf you love a good dark thriller of a movie, watch this ASAP.\nAnd if you want to see a slightly insane Jim Gaffigan, you need to watch this movie! I highly suggest it. I'm mad I didn't know about this movie before today? I seen it was finished in 2018 but just now being released late 2019??? People are really missing out on a great flick!","user":"smithdean-22092","rank":[14,16]}]