[{"title":"Inventive and well acted","rating":7,"date":"27 February 2020","review":"This is a very interesting little tale about a young director taking on his first feature film. For a small film, this is filled with great characters and even better outstanding performances from everyone in the cast. Chris Browning is excellent as the producer of the film within the film, but the entire film hinges on Chase Williamson's lead as Jack, the director who finds himself in way over his head. Mr Williamson is totally believable and was perfectly cast. There's some LOL moments, but most of all the movie is genuinely different and enjoyable, well shot too. With so many big budget films getting everything wrong, this movie is well-written and directed, with performances that really make this is a must see for viewers who appreciate fine indie films.","user":"hampersnow-28905","rank":[4,5]},{"title":"What a relief...it didn't suck!","rating":6,"date":"26 February 2020","review":"This is no masterpiece, and the premise requires a fair amount of suspension of disbelief, but I was pleasantly surprised by the decent camera work, colors used, sound editing, and overall presentation of the story. It's more of a dark comedy/drama than a horror or thriller, with some amusing, well-written scenes. The acting is mostly pretty good among its main characters, and carries the story nicely even if it has a somewhat lukewarm finale. On a day where I watched and reviewed a truly terrible horror movie with F-list actors, I was appreciative of this film's cast. The beginning minute or so made me a little nervous because it looked like it was going to be another garbage movie, but then that part ended up being an intentionally goofy scene where our protagonist was pitching a bad movie to a producer. Is it a classic? No. But if you're sick of giving chances to unknown indie films that end up exploding in your face with stupidity, you may agree that Greenlight is a surprisingly enjoyable trip into relative madness. 5.5 out of 10","user":"umimelectric","rank":[5,7]},{"title":"Not a SuperHero film. It actually has a plot!","rating":8,"date":"6 March 2020","review":"So glad I took a chance on this one. Surprisingly good for a low budget indie flick. All of the acting was excellent, which is usually not the case in these films. My only beef is the ending which I didn't expect! I watched it twice and picked up some subtle foreshadowing and other subtle clues 2nd time through. If you are sick of superhero movies this is worth the watch.","user":"Reeljunkie1","rank":[2,3]}]