[{"title":"For lying, just a rate of 1 instead of 2","rating":1,"date":"17 September 2018","review":"The first 9 reviews and a rating of 7,2 is in. All a LIE people, not 1 reviewer wrote a critic about another movie.\nIt is a very low budget movie with bad actors and failed comedy, this is a one man's project. I didn't even make the 20 min. mark where I usually decide to watch a movie further, it was torture. The dialogue and the behaviour of the characters made me nervous. And also there was too much shaking with the camera. This ain't even cheap entertainment, this movie is just all the way cheap and bad. No fun on this road trip, I even didn't make it to the resort.","user":"webwizardbe","rank":[12,18]},{"title":"Go back to school, buddy","rating":2,"date":"1 January 2019","review":"The final scene gives this movie's purpose away: the director's way to show his middle finger to the teachers in film school he dropped out from.<br><br>The movie is something you've seen before dozens of times, only done worse. The special effects are the funnyest thing in this: they reach \"so bad it's good\" level - it makes \"Buffy The Vampire Slayer\" look fresh and advanced.<br><br>To sum it up: acting is mediocre, story is bad, CGI is funny. Waste of time if you ask me.","user":"wroblewski-radek","rank":[2,2]},{"title":"Realismo mágico goes to SOCAL, grabs some gringos & an RV, then heads down to Baja on a spirit quest. What's not to love?","rating":7,"date":"22 September 2018","review":"I really liked Baja. I've spent plenty of time wandering down thru Mexico, without knowing exactly why. It's a magical, mysterious, and beautiful place. If you look up the history of cinema, in fact, proximity to Mexico (and distance from Edison) was one of the key reasons why the film industry settled in Hollywood to begin with. The Cal-Mex connection has been alive and well for at least a century, and that is very clear in Baja. I get it, I appreciate it, I value it.<br><br>Sure, there were plenty of cheesy moments in the film -- which is why I didn't give it an even higher rating. But that didn't bother me so much. I loved the passion and spontaneity and the magic realism of the trip. Oh yea, and plenty of laughs along the way, too. Well done!","user":"zkotpen","rank":[2,3]}]