[{"title":"Fantastic action scenes but mediocre clichéd story","rating":7,"date":"12 February 2018","review":"This movie reminds me of Batman vs Superman, fantastic action sequence, good cinematography and great score but terrible script.\nThe movie action sequence are like Kingsman except much more brutal. The cinematography was also beautiful. However the main characters were dumb and the villains were cartoonishly evil. You could see the plot twist and the characters motives as soon as you saw the character. If the movie had a simple plot like Raid or Die Hard, it may have been spectacular but instead it tries to be Shakespearean Hamlet saga and fails.","user":"bettyjbettyj","rank":[13,15]},{"title":"Good, but could've been great","rating":7,"date":"18 December 2018","review":"It shows that this film was written and directed by novice Byung-gil Jung, and although most of the directing was decent (some was bad), he really failed in the writing department. There were too many convoluted flashbacks that were mainly out of place. The editing was also terrible, as this film needed to be mended much better. The fight scenes where choreographed really well, and the acting was on point, especially from the lead Ok-bin Kim. Had this film been screen-written properly and most of the flashbacks organized and edited correctly, and the 129 min length trimmed down to about 90 or 100 mins, this film would have been great. Still, an impressive production that deserves my 7/10","user":"TheTopDawgCritic","rank":[15,18]},{"title":"The Action Film of the Year","rating":8,"date":"13 July 2017","review":"Sook-hee (OK-bin Kim) was just a little girl when the assassin training started in Yanbian, China. After the death of her mentor, she went to South Korea to work as a government agent. They promised her that she would be free after ten years of service, but the truth was not so easy.<br><br>Everything you need to know about \"The Villainess\" comes in the first ten or fifteen minutes. The opening scene is a first-person, frenetic fight scene that just never seems to end. Much like the hallways fight scenes on Netflix's \"Daredevil\", the punches and kicks are well-coordinated and just get more enjoyable as they go. And despite ultra-violence that goes well beyond Peckinpah, Tarantino, or maybe even Miike, in \"The Villainess\" it never seems gratuitous. There is an art to the whole thing, which may be less surprising once the viewer discovers the assassin's ballet background.<br><br>Some viewers may compare the lead character to the Bride from \"Kill Bill\", which is not altogether off-base. There is also something of a connection to \"The Professional\" and \"La Femme Nikita\" (coincidentally both from Luc Besson). But any comparisons will only go so far, because Sook-hee is a character all her own. While she is trained by her assassin school to be a world-class actress or gourmet chef, this only enhances her ability to get the job done when she needs to fight off several thugs on motorcycles while using a katana. Each fight scene manages to dwarf the previous, going so over-the-top you have to wonder how the stunt people and fight choreographer managed to work it all out.<br><br>While writer-director Byung-gil Jung is relatively new to film, genre fans will likely recognize his star, OK-bin Kim, from her role in \"Thirst\" (2009). If she was not already a big deal, this is the perfect showcase for a wide range of talents and on-screen emotions. To say that Sook-hee carries the film would be an understatement. Amazingly, cinematographer Jung-hun Park and editor Sun-mi Heo have practically no other credits to their names. With the impeccable lighting and clever editing to make long shots seem continuous, it boggles the mind how these folks could not have been in the business for years.<br><br>If any criticism of the film needed to be made, it would have to be in the lack of real depth. The characters are two-dimensional at best, and most of the plot twists are fairly obvious up front. While this sort of criticism would be correct, it would also be completely beside the point. \"Villainess\" is a fun movie, and a real popcorn-munching escape. This is not a cerebral tale with any satire or symbolism, but it never pretends to be.<br><br>The Fantasia Film Festival picked this visceral action flick to be their 2017 opening picture (July 13). This was a wise choice. Whether or not it will be considered among the best films at this year's festival remains to be seen, but it is easily one of the most satisfying. Nothing puts rabid genre fans in the mood for three weeks of insanity like a fast-paced ninja-themed bloodbath. Standing ovation? You bet! (For those not attending Fantasia, the US rights were purchased by WellGo earlier in 2017, so expect a limited theatrical run and a home video release in the not-too-distant future.)","user":"gavin6942","rank":[36,49]}]