[{"title":"Not impressed","rating":5,"date":"23 February 2020","review":"Despite delivering a (very) few admirable moments, Blumhouse fail to conjure up anything other than a dull execution of a story with more than enough potential. Unfortunately for TRUTH OR DARE it's not particularly clever, with a heavy dose of laughable CGI and a bland script completely void of scares or tension.","user":"MR_Heraclius","rank":[41,46]},{"title":"The movie does not deserve the low reviews","rating":6,"date":"29 June 2018","review":"The movie did not receive the bad amount of comments or opinions it got from other users. Quite frankly, they are wrong in calling Truth or Dare a bad movie, as it is not meant to be a masterpiece but a fun movie to watch in a rainy day scenario. <br><br>If you are looking for a movie that you can switch off to and just watch a movie that is mindless entertainment then Truth or Dare is a movie i recommend it if you can look past of the cliche horror tropes. <br><br>Overall the movie as some decent young actors in it and is a passable horror movie so i suggest giving Truth or Dare a chance.","user":"treebeard-44735","rank":[159,217]},{"title":"People are too hard on this","rating":7,"date":"17 April 2018","review":"I'm seeing a lot of bad reviews on this, and I think people are being way too critical. Don't get me wrong, this isn't the next \"A Quiet Place\" or \"It.\" This is a PG-13 teen horror flick that shows a lot of sexy young adults being killed. It's goal is just to provide mindless, violent entertainment for a couple hours, and it serves its purpose well.<br><br>I've heard someone compare this to \"Final Destination\" and that's a pretty apt comparison. The driven force of this movie is some creative kills. The movie also keeps you guessing as to who meets the chopping block. I'm also a found of the weirdly distinctive smile effect the monster uses when it possesses people.<br><br>I've heard complaints about the script and characters, but I don't see that. I mean there's nothing here to write home to mom about, but I found the script, characters, and acting to be solid.","user":"jwwalrath-227-85487","rank":[205,296]}]