[{"title":"Funny, but a little canny","rating":7,"date":"19 August 2019","review":"There were a lot of great moments in the movie, I love that Vasquez held onto a good amount of his humor as the years have wore on, I'm sure many things have changed for him as has the world &amp; culture around him, so it inspires me to see the unique expression of all the bizarreness &amp; absurdity in a time that has largely departed from this style of humor &amp; show.<br><br>I enjoyed the movie &amp; I would recommend it, it really punches you in the nostalgia bags &amp; gives a lot of good laughs.<br><br>I only have a few small gripes about the movie, having been a huge fan of the original series.<br><br>The movie departs a bit from the vibes of the original series, for whatever reason. For one, the movie exhibited a lighter atmosphere, I understand that perhaps the production assumed that the audience has changed and was afraid to alienate their audience, but Invader Zim was great in large part because its irreverence, many great art pieces are great because they're bold &amp; actually defy people's expectations. There was never a good comedian who only said what was socially acceptable, and that's why it brings me some sense of sorrow to see Zim made less intense, diminishing near the first point of contention, even Dib &amp; his family having obscenely 'normal' moments. Gaz is not someone pretending not to care about her brother, being annoyed with him, &amp; looking for ways to injure him, but in the movie she is, and Dib's dad doesn't really care that much about him, he's actually consumed by his passion for science to a fault, except in the movie.<br><br>The power &amp; intensity of the individuals are diminished in the movie, the nature of their reality is toned down perhaps to tailor to more modern audiences, there is less darkness &amp; ugliness, less witty, repulsive, absurd, nihilistic, subtle commentary, &amp; more silly, apprehensive humor that pulls too many punches.<br><br>I would gladly watch a remake because I still love the humor when it hits right &amp; the remnants of the original atmosphere they kept, but that doesn't change the fact that the movie could have been\nbetter if it was significantly more authentic &amp; daring.","user":"quike23","rank":[25,25]},{"title":"It's Amazing!","rating":10,"date":"16 August 2019","review":"I loved.. loved this! Such a wonderful comeback from a show I used to love watching :) Professor Membrane was hilarious and awesome in this too. Not sure why they changed his hair a bit, but it was ok. All around it was funny and a good story. I liked this so much more than the Rocko reboot which was still pretty good.<br><br>Also, that intro! Loved the anime impression in the beginning.","user":"technusgirl","rank":[38,47]},{"title":"Welcome back Invader Zim.","rating":10,"date":"17 August 2019","review":"While i didn't grow up with Invader Zim, i was introduced to it when i was a teenager but the show was so captivating and bizzare, and it's charm hooked me in.<br><br>Now fast forward to 2019, it is just incredible to see for the first time in so many years a return, Netflix saved this show from the deepest void and now we have Enter the Florpus.<br><br>It was everything i ever wanted from Invader Zim, and it feels like they have\ntaken few notes from Rick and Morty with the expansion of the world and it's characters. Let's just hope that this gathers enough attention to create more movies or maybe a continuing series in the future?<br><br>Welcome back Invader Zim.","user":"awfulketchup","rank":[28,35]}]