[{"title":"Ok U.K. flick.","rating":6,"date":"25 December 2018","review":"Clearly a low budget C-grade amateur U.K. film, and as such, and although it's flawed, not a bad watch.<br><br>This is experienced stuntman-turned-newbie-writer/producer/director David Newton's first attempt at a full length feature film, and considering I've seen way worse from more experienced writers and directors, this was not all that bad - again, comparing apples to apples of course, and not comparing this to big budget Hollywood blockbusters with A-list talent.<br><br>This film had a sort of 'Bourne' franchise feel to it. Again, nothing new or extraordinary, but after all, new filmmakers have to start somewhere.<br><br>The directing was actually not bad at all. The writing was typical and nothing exciting, but again, a first attempt. The 99 min length felt a little long, but that was due to the slow pacing in some scenes. The action and choreography was pretty decent. The acting was also not bad, but you could tell the director did a better job on the camera than directing his talent.<br><br>My biggest issue with this film was the non stop annoying score. A film doesn't constantly need to have music in the background all the time. Had it been a little toned down, and not so much frequent, the film would have been more enjoyable.<br><br>Nevertheless, props to David Newton's transition from stunts to filmmaking, he certainly shows promise in his new field of work.<br><br>This film does not deserve any 8, 9 or 10's, but it doesn't deserve 1, 2 and 3's. It's a well deserving 6/10 for this caliber type of production from me. It kept me engaged throughout, and it's a decent action film to watch on a Sunday when there's nothing else on.","user":"TheTopDawgCritic","rank":[10,13]},{"title":"Great independent action film","rating":10,"date":"17 January 2019","review":"Absolutely loved this great British independent action film. The cinematography was really impressive and the actions scenes extremely well put together. I thought the story was gripping and interesting which is refreshing for a film of this genre. Hats off to the director and the production team for executing a really awesome action movie that definitely had the feel of the more recent Bond movies and Bourne films.","user":"adamactcollins","rank":[3,5]},{"title":"Too much action, can't be compared to Taken movie","rating":3,"date":"28 April 2019","review":"Basically you will see all ordinary things you can see in your neighborhood. Violence, guns, blood, pain, crime, enemies, disappointments... Story is not clear and audio is not good enough to make us hear what they say. Action without story is not action. Action without adventure is not action, either. There is lack of emotions too. Everything happened too quick and too typical. Without thinking, planning, explanation, in a rush. End is typical too, with usual twist where somebody saves somebody. I liked the weapons and shootings that reminds me of action computer games and teaches us some weapons skills.","user":"asocialis","rank":[1,1]}]