[{"title":"Drowns in amateurism","rating":3,"date":"27 July 2019","review":"At one point in DEAD WATER (a rip-off of 1989's infinitely superior DEAD CALM) one of the characters boasts that his brand new harpoon gun is, \"the same kind of harpoon-gun that Quintin used on Bruce.\"<br><br>\"Bruce?\" someone asks.<br><br>\"The shark from JAWS.\"<br><br>Fascinating. Except Robert Shaw's character in JAWS was named \"Quint,\" not \"Quintin.\"<br><br>The most iconic character in a truly iconic movie - a masterpiece of cinema - and the filmmakers were so sloppy that nobody - from the screenwriter, to the director, to the actors, to the editor - could be bothered to get his name right.<br><br>And that kind of sloppiness informs the whole production. A dialogue scene takes place in a stationary car because the filmmakers obviously couldn't afford to film it as the car was moving. And a short while later, characters talk on the deck of a supposedly moving yacht that is obviously standing still.<br><br>Entire scenes are not properly \"covered\" by the director, and numerous scenes are borderline inaudible because they didn't have enough money to fix them in post-production.<br><br>And that's just technical stuff. As for the plot and dialogue ... oh my God, where to begin ...<br><br>Here's just one example of how bad this story is: Dude A carefully arranges for the murder of Dude B because he is secretly in love with B's wife - a motive that makes perfect sense - yet A starts putting the moves on B's wife (and freaking her the hell out) before B is even reported dead, which makes ZERO sense.<br><br>The whole thing reeks of amateur hour.","user":"filmklassik","rank":[14,15]},{"title":"Boring wet sunday afternoon material!","rating":3,"date":"27 July 2019","review":"Nothing new to see here, no sharks, no scares, no story.\nBeen done a million times before and much better!\nAlthough Casper is looking good for an old guy so the ladees might get some excitement from this but sadly not for me it bored me to tears!","user":"omendata","rank":[13,16]},{"title":"Three annoying people on a boat","rating":3,"date":"4 August 2019","review":"Hey, characters, we're all having a tense time. Let's go on a small boat where there's nothing to do in the middle of nowhere and drink a lot. Great idea.<br><br>Every character in this schlockfest is a cheap ripoff you've seen before:<br><br>Newscaster \"babe\" is a low-rent Renée Zellweger with the annoying voice of Leslie Mann. Unfortunately, she's the only sensible character.<br><br>Pirate guy is the Dollar Tree version of the bad guy who is always standing in the back left of the mob boss's office. Normally he never gets any lines. This movie shows you why.<br><br>The two main guys are basically indistinguishable. No, wait, the creepier guy has a cleft chin.","user":"imdb-2920","rank":[5,5]}]