[{"title":"Nice movie, nice crew & a good message","rating":9,"date":"20 April 2018","review":"In the ironic world in which we live today, where the rights for all should be something common and accepted, where discrimination should be a word forgotten by the past, we realize that for nothing sexual,gender rights or worst in basic human rights as being able to be treated the same regardless of physical aspects or medical differences, the human is still being unable to treat the others as he would like to be treated himself . <br><br>In this film we see this reality, but we also see how that assumption we always make in the face of what others can and can not do ends up being wrong. <br><br>The improvement and achievements that for some do not seem to be the great thing, for many is an epic achievement. <br><br>This film is not only well done in the film aspect, it also gave in the background aspect a lesson , that I hope many apply in their lives.<br><br>Not always the best movies have implicit the great effects, famous actors, and millionaire budgets, in this case the casting was perfect choice, the touch that the protagonists in real life are people with \"mental disability\", and I think they should be an example for many actors that today are more divas than what they act, the movie gave us also a script well taken, turns in to a comedy that takes you to the joy at times, (not simple laughs) and that true feeling sensation , and a very good direction that I think has merits that I hope the academy and the public in general can recognize.<br><br>For last ,remember we all are the same ............HUMANS, the movies should be this, something inclusive, as everything else should be<br><br>A movie that has to be seen by everyone, 100% enjoyable and to have a good time at the cinema<br><br>EN HORABUENA JAVIER FESSER","user":"realart_ds","rank":[36,40]},{"title":"It's good to be predictable when your focus is your message","rating":8,"date":"8 September 2018","review":"This tender and beautifully made movie is quite obvious and predictable. But it is worth to sacrifice originality when your goal is to focus in the moral message. And this movie has a strong an powerful moral message, so overwhelming that it makes you feel almost like in a church listening a sermon of an old and good hearted priest. It is like 2 hours of visual Aesop greek fables where the characters, instead of animals, are archetypical humans. The most important critic is to our own Spanish history: the National Basketball team cheated in the Paralympic Games of Sydney 2000, because 10 out of 12 of our basketball players did not have any mental disability. They won the gold medal, but they had to return it afterwards. Also the film showcases the extraordinary negative consequences of hyper protective parenthood in raising narcissistic people, completely immature in their 30s an 40s to the point that they can not endure the risks and challenges of sustaining a relationship, facing rejection or creating a family. Specially consistent during the whole film is the critic to our society, based in success over experience, performance over playfulness, fitness over kindness, dominance over community. Finally, the most subtle but powerful subversive message in the movie is questioning to which extent are sick and poisoned the people that consider ourselves \"normal\". Much of our \"normality\" might be counter productive, to the point to make us too rigid, cold hearted and stressed because of our own insane standards. All the special basketball players of this special team show us that most of the times it's ok to look silly, to do something stupid or to fail constantly, because they still have each other. So many of us can not say the same. <br><br>This movie is such a nice, entertaining, sweet and tender way of reflecting about all these moral values. It's been selected to compete for the Oscar to the best foreign film, but honestly I think they have no chance. We are still too much into an Instagram Age to take a movie like this one seriously.","user":"francescgo","rank":[33,38]},{"title":"Brutal!!!!! Soooo funny","rating":10,"date":"12 October 2018","review":"Non stop laughing!!!!! I think one of the best Spanish comedy","user":"mariamianowska","rank":[15,17]}]