[{"title":"Wow! Talk About Amazing Talent!","rating":10,"date":"27 August 2019","review":"Motown was the greatest assembly of musicians that the world has ever heard. Their music transcended time, cultures, generations and ethnicities. To this day it remains as some of the most popular and captivating music ever recorded. I loved watching the making of the music and especially the clips of the live performances. Little Stevie Wonder, Little Michael Jackson &amp; The Jackson 5, Diana Ross &amp; The Supremes, Marvin Gaye, Smokey Robinson, The Four Tops, The Temptations. The list goes on and on. Detroit will forever be known as Motown.","user":"t-73531","rank":[13,16]},{"title":"Superb show about the greatest decade in soul music history.","rating":25,"date":"25 August 2019","review":"Well written documumentay chronicling the beginning of Motown/Tamla records from the late 50's to the early 70's. Narrated on screen by Berry Gordy and Smokey Robinson. Many of the surviving writers/producers of Motown are interviewed as wel as artists such as Otis Williams of the Temptations, Martha Reeves of Martha and the Vandellas and Stevie Wonder who started his career as Little Stevie wonder. Wonderful early clips of almost all the stars of the era. Didn't need fireworks or dozens of background dancers. Only talent. This was evident with the Temptations singing acapella in the studio in the early sixties. Great rapport between Gordy and Robinson who have been friends and partners for decades. A must see for any up and coming singers of today.","user":"jaylynnr","rank":[9,15]},{"title":"Early Motown 101","rating":10,"date":"26 August 2019","review":"There have been a number of music documentaries that have covered the era in focus but I give this documentary high praise not just for presentation but on the focus of what actually drove Barry Gordy to start the Motown enterprise and to grow it.<br><br>\nLet me explain upfront I don't have the musical background or training required for making a truly honest assessment of the documentary but being that much of the focus is on the human element behind the music I can point out some key things.<br><br>\nOn the entrepreneurial side, learning from failures, perseverance, belief in oneself, and having a vision is embedded in the story. Having everyone in the enterprise share that vision and understand it even more so.<br><br>\nI appreciate how he gives his parents credit for raising him with the values needed to be a success. Civil rights is discussed but ultimately having a vision that is color blind is shown to be more important. The diversity he brought to his enterprise and the use of everyone's talents shines through as well.<br><br>\nThe music is great too and making wish there was a Motown collection that I can purchase or a soundtrack to the documentary with all the full songs on it.<br><br>It is a helpful watch for anyone considering starting a business regardless of field. Barry Gordy shares credit with Smoky Robinson and others but for me it was clear he was the one driving the train..<br><br>\nP.S. Looking forward to comments from professional in the industry as well.","user":"jrneptune","rank":[8,16]}]