[{"title":"Identical Dicks","rating":8,"date":"20 January 2020","review":"Dave (Jonas Chernick) is a young aspiring Scientist who is close to becoming the Worlds First Time Traveler, and will stop at nothing to accomplish his Goal. His obsession is ruining his relationships with his co worker Girl Friend Courtney (Cleopatra Coleman) and blowing it with his Boss Dr Rowley (Frances Conroy) and sister Meredith (Tommie-Amber Pirie). While going for a late Coffee Dave encounters Jimmy ( Daniel Stern) who claims to be Dave from the Future ? Jimmy insists that Dave must not Travel thru Time because it will ruin his Life and He is there to warn him. Jimmy claims because of Time Travel he is always STUCK in Time and has a miserable Life because of it. Dave does not believe That Jimmy is really himself from the Future and makes Jimmy prove it. I saw this Film at the Santa Barbara Int'l Film Festival and both the Director /Writer Jeremy Lalonde and Star Jonas Chernick were in the audience and did a neat Q and A after ! I thought this was a really Funny Movie and before giving away anymore of a Plot that is both Sci Fi and Comedy, I just encourage you to keep an eye out for an April 2020 release. Add to Your Watch List","user":"Intermissionman_","rank":[11,17]},{"title":"A little Indie gem","rating":8,"date":"13 April 2020","review":"A tasty cocktail of sci-fi, romance and comedy mixed for you by Jeremy LaLonde and seemingly effortlessly delivered to you by Jonas Chernick, Daniel Stern and Cleopatra (what a name) Coleman. And of course Tommie-Amber Pirie who, just like Jonas, starred in LaLonde's How to Plan an Orgy in a Small Town.\nThe movie is a little gem about love, life and time travel (and Schrödinger's cat). It is well edited and Jonas, Daniel and Cleopatra treat us to an excellent performance balancing perfectly on that thin line between a love story and a comedy.\nBut what most impressed me is that this movie deals with the Grandfather Paradoxand comes up with some nice solutions for it. This paradox basically states that if you go back to a point in time before your grandfather met your grandmother and then kill him your mother will never be born an thus you will never exist. And if you never exist then who killed your grandfather? Most movies involving time travel completely ignore this paradox, like in the Terminator where Arnie gets send back to kill Connor, the future leader of the resistance. However, if Arnie was to succeed to kill Connor he would never be the future leader of the resistance so there would never have been a reason for Arnie to be send back to kill him in the first place. This movie not only deals with this paradox, it actually presents it to us (the entire universe could cease to exist) and comes up with the solution of James-from-the-future having to disappear if his actions lead to his life being better and him not having any reason to come back in the first place.\nSo 7/10 for the movie itself and an extra 1/10 for taking care of the Grandfather Paradox.","user":"gvwln","rank":[2,2]},{"title":"Come timetravel with me","rating":8,"date":"4 April 2020","review":"What can I say - I'm a sucker for a good time travel movie. Since I was a little kid I wondered what could've happened if I would've seen myself younger, from a perspective of an older man who has already seen stuff and learned to deal with it. I know I would've wanted myself to correct the mistakes from the past so that I couldn't have ended up alone with nobody by my side but my own bad decisions that led me here, wouldn't we all? James vs. His future self is surprisingly good in terms of storytelling and narrative. It shows all there is to see in life - that they don't call it present out of nothing: it is not only a gift that we should cherish every single day but we also should be in it to witness it firsthand. Daniel Stern is absolutely fantastic in this one; for a while I didn't see him in anything and the way he handled this role kind of reminded me of the old days of Home Alone glory of his and what a brilliant actor he truly is. In short, it is a good movie with fine acting, not extraordinary but a relevant plot, masterful soundtrack and some nice aftertaste.","user":"jamesjustice-92","rank":[5,8]}]