[{"title":"Fascinating Documentary","rating":9,"date":"26 April 2018","review":"Fascinating documentary on the gorgeous, brilliant, and complicated screen star Hedy Lamarr. Her beauty was known to all, even serving as the inspiration for the face of Disney's Snow White. Yet few, including myself , knew of her inventing genius, and how one of her patents (frequency hopping) would serve in later years as an important part of cell phone, Bluetooth, Wi-Fi, and military technology. <br><br>All in all, I thought this was an exceptional documentary filled with surprises.","user":"larrys3","rank":[23,24]},{"title":"A Straight forward biography we should all see and learn from","rating":9,"date":"18 July 2017","review":"No trick photography, no special gimmicks. Nothing out of the ordinary is needed when the life story we're presented with is so unique. The Hedy Lamarr story is way more than a biography of an old timer who used to be a Hollywood star. It's more than the story of \"the most beautiful woman in the world\" whose talents well exceeded her beauty.<br><br>It's a story of our failings as a society when faced with whatever defied the conventions we live by. And the tragedy of those that wouldn't fit under the labels we like to stick on whoever crosses our path. To put it in a single sentence it's a story most of us know nothing about but all of us should. If you do get the chance just go see it.","user":"ayoreinf","rank":[42,46]},{"title":"Totally underrated and unappreciated during her lifetime","rating":8,"date":"25 April 2018","review":"4/25/18. This is a really well done biopic about an underrated actress who got her just due with this film. I really liked her in Samson and Delilah although I haven't seen any of her other movies. Over the years I have heard her mentioned as an inventor and thought that was a curious fact to share about an actress. This biopic goes into enough detail for the viewer to understand just how intelligent Lamarr was in electronics and that her inventions are still being used in our time through the technology we use. Sadly, she was never compensated for her patents. If she was she wouldn't have lived such a hardscrabble life in her later years and had all that plastic surgery that really ruined her face. It is somewhat sad to see how such a talented woman had a series of unhappy marriages that emotionally ruined her and how Hollywood never gave her the recognition she wanted and so truly deserved. Worth catching.","user":"bettycjung","rank":[18,19]}]