[{"title":"Unexpectedly impressive","rating":8,"date":"2 November 2018","review":"Taking its inspiration from the history of Magdalene Laundries in Ireland, specifically the Bon Secours Mother and Baby Home in Tuam, <a href=\"/name/nm5240404/\">Aislinn Clarke</a>'s laudable debut feature, The Devil's Doorway, is a found-footage horror film. It undeniably has its share of clichés, but overall it's an impressive piece of work, dealing in an interesting manner with a truly shameful part of Irish history.<br><br>Ireland, 1960. Father Thomas Riley (<a href=\"/name/nm0734498/\">Lalor Roddy</a>) and Father John Thornton (<a href=\"/name/nm2192867/\">Ciaran Flynn</a>) have been dispatched by the Vatican to a Magdalene Laundry to investigate a possible miracle; apparently one of the statues of Mary is bleeding from the eyes. World-weary and disillusioned, Thomas is the polar opposite of the young and enthusiastic John. Although Thomas is determined to find the \"trickster\" behind the bleeding statue, his initial focus is the manner in which the girls in the laundry are being treated by the nuns. Because of this, he immediately butts heads with the rigid Mother Superior (<a href=\"/name/nm2376067/\">Helena Bereen</a>). However, with Thomas's focus on the girls, John comes to feel that something supernatural is happening - he hears, and later sees, bedraggled children playing in the corridors, despite there being no children in the institution; handprints appear on his window; strange sounds emanate from the bowels of the laundry.<br><br>Between 1765 and 1996, it is estimated that upwards of 30,000 \"fallen women\" were confined in these laundries. The women confined there were sex workers, orphans, victims of rape and child abuse, the mentally ill, young girls considered too flirtatious or beautiful, and those who became pregnant out of wedlock. Essentially used as an unpaid slave labour force, they spent their days washing sheets, and were physically and psychologically abused by the nuns and exploited by the Church, which was fully aware of what was happening behind closed doors.<br><br>One might think that nothing more horrific could be made of this subject than the actual facts of the case; after all, <a href=\"/name/nm0611932/\">Peter Mullan</a>'s superb, but exceptionally disturbing, <a href=\"/title/tt0318411/\">The Magdalene Sisters (2002)</a> is a horror film in everything but name. However, what Clarke and her co-writers <a href=\"/name/nm1467483/\">Martin Brennan</a> and <a href=\"/name/nm1997893/\">Michael B. Jackson</a> do in The Devil's Doorway is use the very real issues as the foundation for a socially conscious horror film which serves as a conduit for the anger felt throughout the country. Far more concerned with the shifting moral positions of the two priests than it is with devils and demons or silly jump scares (although there are a few of these), the film thus functions as a kind of microcosmic allegory of Irish history; John represents Ireland of the 1960s, innocent and blindly faithful, unwilling to believe anything negative about the Church, whilst Thomas represents the Ireland of today, jaded and disillusioned.<br><br>Reading between the lines of the horror tropes, this is a film about human evil - the primary story is not the investigation into the statues, it's the discovery that the institution has been discarding the bodies of dead children in a vast underground catacomb, with the full knowledge of the Holy See. Clarke, an atheist herself, is thus far more interested in showing the hypocrisy of the Church's culpability, condoning the torture of woman and the unsanctified burial of children, whilst it preached morality to the masses, warning of the esoteric dangers of contraception, the evils of homosexuality, and the iniquity of blasphemy. In her view, the evils perpetrated by the nuns against defenceless children are far more horrific and disturbing than anything a demon could unleash on the world. Looking at issues such as the illogicality of blind faith and the history of organised religions' tendency to marginalise women, often to the point of violating their human rights, Clarke exposes the Catholic Church's duplicity, laying bare their utterly contemptible and self-serving role in Irish history, and it's the anger and sincerity of this message that lingers far longer than any of the film's genre elements.<br><br>One of the film's greatest strengths is Lalor Roddy's performance as Thomas. Playing the priest as cynical and disheartened, worn down by years of debunking claims of miracles, at least initially, he is far more interested in the treatment of the girls than the possibility that the statue's bleeding may be authentic. As the film goes on, Thomas becomes more and more angry about what is happening in the laundry, leading to one of the most thematically relevant and narratively justified f-bombs I've ever heard in a film. One of the film's primary themes is the hypocrisy of the Church, and the ugliness of organised religion in general, and this theme is carried primarily by Thomas. Roddy's layered interpretation is the primary reason the film works so well in an emotional sense. Painfully aware that acceptance of dogma, faith in the Church, and belief in God are three very different things, Thomas finds it increasingly difficult to reconcile his genuine love for God with the practices the Church carry out in His name.<br><br>At Dublin's Horrorthon 2018, Clarke was asked if there were any concerns regarding accusations of exploitation during the making of the film. She acknowledged there were, explaining that she remained very much aware during filming that many people who lived in the laundries are still alive today. She also said she had heard from several Magdalene Survivors who had loved the film, and one woman in particular who travelled from Cork to Belfast to view it, giving an emotional endorsement when it was finished. Indeed, Clarke explained that the film was originally written to be set in 2018, with a group of urban explorers running afoul of eerie goings-on in an abandoned laundry, and it was only when she came on-board that it was relocated to the 1960s. She chose this period because it was during the 60s that the laundries were at the height of their powers. Believing that setting the film in 2018 and depicting urban explorers would have been disrespectful and exploitative (something like the disgusting <a href=\"/title/tt1991245/\">Chernobyl Diaries (2012)</a>), Clarke felt that to relocate it to 1960 lent it an air of authenticity, whilst also allowing her to deal head-on with the moral issues thrown up by the scandal.<br><br>Aesthetically, the film is also interesting, managing to sidestep many of the inherent problems with found-footage films. For example, the fact that it's set in 1960 means it's shot on 16mm rather than VHS or hi-def. The 1.37:1 Academy Ratio, complete with rounded corners, has the effect of making <a href=\"/name/nm2975835/\">Ryan Kernaghan</a>'s carefully composed images look like historic photographs. The shaky and imperfect footage also gives the film a sense of an old cinema verité-style documentary, with the amount of artefacts helping to sell the first-person immediacy of the cinematography - lens flares and burn-outs are especially common, and the handheld nature of the filming has a suitably disorienting effect. Granted, John's Bolex camera manages to pick up far more detail in dark locations than would be possible, but this is a relatively minor gripe when the overall look is so good. This point also nicely illustrates the avoidance of a pitfall of found-footage horror films - why the hell don't they drop the camera and get out of Dodge. A problem in many such films, here, the answer is simple - in many scenes, the camera is providing the only source of light, hence why John keeps it turned on and filming.<br><br>Also worthy of praise is the sound design, which, as with the cinematography, manages to avoid a bugbear of found-footage films - pitch-perfect sound irrespective of location and people's distance from the camera. Here, there are multiple examples of dialogue being muffled when spoken away from camera. It's a very simple touch, but it adds a nice air of verisimilitude to proceedings.<br><br>Of course, the film isn't perfect. As the latest in a long line of found-footage exorcism/possession horror movies, the crowded nature of the subgenre, and the general lack of quality of many of the films, doesn't do it any favours. Additionally, especially as it nears its climax, it regurgitates a number of genre clichés - floating beds, upside down crucifixes, scary nuns, creepy kids, creepy dolls, skeletons, underground caverns, jump scares which don't make a great deal of practical sense. Falling back a little too much on the generic conventions it has managed to avoid until the last half hour or so, in this sense, the film ultimately plays it disappointingly safe.<br><br>However, all things considered, this is an excellent piece of work, and an accomplished debut. It looks amazing, and is far better than the majority of found-footage movies. The acting is terrific, and it's properly creepy in places. Perhaps most importantly, however, if you can look past the hokum, you'll find a socially conscious film engaging with a painful national scandal.","user":"Bertaut","rank":[31,36]},{"title":"Suprisingly good!... Don't believe what rating and hater say!","rating":9,"date":"7 October 2018","review":"From the first i saw how it movie setting at 1960 with found footage style i'm rather skeptic how it will going like another trash footage horror movie style, but really this movie give me goosebumps, acting are very natural, and special effect is good even is just simple, but it really works to make you wanna shut your eyes, i don't know why this movie have such a low rate, its unfair, people nowdays just hate horror genre for sake of horror, just watch it. I recommend it.","user":"Herlinda_Marlina","rank":[9,10]},{"title":"Much Better Than Most Found Footage Garbage","rating":7,"date":"13 July 2018","review":"So as you've noticed by the trailer, the film has a unique way of presentation, using the old-school aspect ratio. Its not perfectly clear whether they used real film stock, or created it digitally, but as someone who worked at a film archive, I can attest that they did a pretty darn good job. But is it scary? Is it really like the critics say, that its the best found footage film in years, being a ode to The Exorcist and Rosemary's Baby? Well no, its not anywhere close to those masterpieces, but I agree its much better than the found footage garbage we so often see. With a boat load of Hollywood found footage trash, we also get a wave of films made by anyone who has an iPhone, and the vast majority of them are terrible, and while Devil's Doorway is not amazing, its certainly to as bad as I'm used to.<br><br>But was it scary? Its hard to say yes or no, I would rather say it was hit and miss, some of it got me, some of it didn't. The atmosphere also appeared and disappeared, sometimes it was effective, sometimes it was either not there or was not as effective. Its no masterpiece, but it most definitely had some cool stuff in there. The aspect ratio adds to it, the story its based on is an interesting one (surprised it has been done to death), and some of the plot points, shocks, and scares were alright. Again, alright, not perfect. So don't go in expecting a masterpiece like some critics say, or are paid to say.","user":"neener3707","rank":[20,27]}]