[{"title":"Lin Shaye Has A Room For You","rating":7,"date":"4 October 2019","review":"Lin Shaye has long been one of the hardest working and most underappreciated character actresses out there. Even if you don't know her name, you'd recognize her face and Room For Rent appears to be the first time she's been tasked with headlining a film all by herself and she proves to be more than up for the challenge.<br><br>After her husband's death, a painfully awkward widow (Shaye) is left penniless and decides to open up her spare room for guests. A handsome younger man takes her up on the offer and, in no time at all, she's snooping through his things, using his toothbrush and deodorant (in a comically creepy scene), and dressing up in a provocative manner to entice him. She's not going to let this one go and she'll fix anyone who gets in the way.<br><br>Room For Rent is low on style and scares, but there's a true human element to the story that many films of this type miss out on. The concept and material wouldn't feel out of place as an afternoon movie on the Lifetime network (and the production values are about the same), but Shaye's performance and a few disturbing touches keep it just barely out of those swampy waters.<br><br>Unfortunately, a lot of the other actors aren't up to Shaye's level and the film does suffer because of this. Some of the dialogue doesn't always help as in one scene where a group of young punks terrorize her on her way back home. No one in this scene resembles a real human being (even Shaye suffers during this bit) and one wonders why it's even in the film since these kids are only in two scenes and never heard from again. One wishes Shaye would have taken a kitchen knife to them at least.","user":"annablair-19191","rank":[12,13]},{"title":"The BEST WORST movie ever!","rating":7,"date":"13 July 2019","review":"I really enjoyed this strange, sad, and laughable film. It has a lot of the truisms of life embedded in it. It's a step up from a Lifetime film with an odd lesson from a female perspective.","user":"laragi","rank":[11,12]},{"title":"Meh....","rating":5,"date":"11 May 2019","review":"Upon the death of her husband, an older woman is put in the position of needing to find a way to take care of herself financially. She opens her home as a bed and breakfast and soon becomes attached to one of her guests.<br><br>So, this isn't a bad film but there's not much to be said about it. It is a psychological thriller but there isn't much thrill to it at all. The creepy factor is there and you wonder what is coming next but there is no real climax. You are just stuck watching a slow but steady deterioration of a woman's mental state but the bang isn't there and the viewer is left feeling unsatisfied.<br><br>If you are ok with the pace and the lack of a climax, check it out. If you can't stand those things, you probably should pass this one up.","user":"Foutainoflife","rank":[15,19]}]