[{"title":"self-imposed penance","rating":7,"date":"29 March 2019","review":"Greetings again from the darkness. In a film that is both grounded in realism as well as playing like an ode to underappreciated character actresses, our wonderment turns to full comprehension once we realize this is the work of Kent Jones. Mr. Jones is one of today's foremost authorities on film, having been a respected film critic, served as director of the Film Society of Lincoln Center, and delivered a tremendous documentary showcasing the conversations of two more publicized film experts with 2005's HITCHCOCK/TRUFFAUT. In other words, he's a man who loves cinema and has both a trained eye and an instinct for what makes a film worth watching.<br><br>Mary Kay Place (THE BIG CHILL, 1983) is Diane. Our first reaction upon seeing her is that she has the well-worn, hangdog look of a woman burdened by life. As we follow her around, we soon learn that's very true and that there is even more to her story. Diane is the kind of person who, rather than keep a list of things to do, keeps a list of people for whom she has to do things. And there are many on her list. Chief among these are her dying cousin Donna (Diedre O'Connell) and her drug-addicted son Brian (Jake Lacy). The self-imposed penance Diane pays all day each day stems from a story referred to as \"The Cape\" ... a long ago act of betrayal and indiscretion that has clung to Diane ever since.<br><br>The rest of the cast is filled with faces you'll recognize (and names you can't recall), many for their work in the 1960's, 1970's and 1980's, including: Estelle Parsons (Best Supporting Oscar winner for BONNIE AND CLYDE, 1967), Andrea Martin (MY BIG FAT GREEK WEDDING, 2002), Joyce Van Patten (sister of Dick, ST ELMO'S FIRE, 1985), and Glynnis O'Connor (ODE TO BILLY JOE, 1976). But don't mistake this for some nostalgic tribute - each of these women offer up exactly what's needed for their respective characters. It's a joy to behold their work - and easy to take for granted.<br><br>This little Massachusetts community is tight-knit and speaks freely on the lives of each other. There are few secrets. Everyone asks Diane about Brian - her son that lies to her face, acts perturbed when she tries to help, forces her to listen to bible-thumping, and finally comes clean on why he's treated her the way he has. Filmmaker Kent's first narrative feature is an organic character driven story about aging, carrying a burden, striving to make amends, and suppressing true feelings by constantly serving others. When Diane writes in her journal, \"My loved ones are gone and I'm left to be\", it takes her (and us) closer to her soul than any soup kitchen possibly could. Casserole dishes can only heal so much., and a lead role for a respected actress serves us all.","user":"ferguson-6","rank":[26,30]},{"title":"Interesting character-driven movie","rating":7,"date":"26 July 2018","review":"'Diane', a character-driven study of a woman coming to grips with her past life choices, aging, loss of friends and family, and most importantly, her ongoing struggle to relate to her drug-addicted son, ws featured at the 2018 Tribeca Film Festival. Mary Kay Place (remember her from the TV series 'Mary Hartman Mary Hartman', or movies 'Being John Malkovich' and 'The Big Chill'?), is quite good as the title character and is in virtually every seen of the movie, which, according to director Kent Jones in a post-viewing Q&amp;A, was filmed in 20 days and has won Best Narrative at the 2018 Tribeca Film Festival. Diane spends the movie always reaching out to others with a helping hand but just cannot seem to grasp the idea that she needs, via those that she helps, to focus inward at times and be at peace with herself and her choices. It is a very interesting movie with several great performances, but at times leaves the viewer scratching their head about timeline, certain images, and seemingly non-congruent scenes, but overall a very good study of a flawed human. By the way...the name Diane is derived from Diana, goddess of the hunt, childbirth, and the forest-very appropriate for the movie's character.","user":"Nagfilms","rank":[28,33]},{"title":"I WILL SURVIVE","rating":8,"date":"30 May 2019","review":"Small town New England, where the skies are grey, trees cast skeleton shadows, and folks drive endlessly to nowhere. A group of baby booming women gather for spirited, neighbourly warmth, as the ravages of time loom ominously on their well lived lives. Their men, the ones that are left, shuffle in the background.<br><br>Diane has things to do, it says so in long hand on her daily reminder note. But her mundane errands belie a couple of hardships: dealing with an adult son with a history of addiction, and a dying cousin hanging on to a lifelong grudge. As Diane, Mary Kay Place strikes a nuanced balance of vulnerable strength, a woman tough enough to bully her offspring into sobriety, good-hearted enough to bring true friendships to many, and broken enough to dance drunk solo in front of a jukebox.<br><br>Filled with excellent turns from a bunch of Golden Girls - actors who cut their chops back on the sets of \"Love American Style\" and \"Mannix\" - this film brings enough community spirit to perfectly complement Place's solo tour de force. Friends start to drop. Diane continues her lonely drives. The clouds never break. Nothing much changes, and it's all in Place's stony face.<br><br>Not for everyone, \"Diane\" is a moody chunk of cinema which is oh so rewarding for those willing to stick with it..","user":"js-66130","rank":[8,8]}]