[{"title":"Terrible Camera Work And Acting At Its Best","rating":1,"date":"4 June 2017","review":"It was pretty hard to decide what is the main base of this film. It has myth, magic, karate, spaceship, science, robot, weapons both swords and guns. Maybe the script writer did not want to leave out anything, so he put all the things he can think of in it.<br><br>And the screenplay is so hilarious that they could even add sound of passing shooting star as if one can hear it from earth. And the story also does not make any sense, simple things were happening in a complicated way. This kind of script needs a bit of comedy in it to lighten up the viewers mind as the scenes hardly made any sense. But there was not a shred of comedy.<br><br>The camera work, was out of the world or should I say out of the frame. Horrible camera work, full of close angle shots. There were hardly any wide angle shots. Seems a lot like amateur work.<br><br>Lastly, the acting. The acting was another horrible aspect of this film. The acting could not be more obvious than this. There was no emotion, expression or charisma at all. In some scenes it seemed like that they just have to deliver the dialogue somehow and move on to the next scenes. There was no commitment to the roles. And the dialogues were full of awkward unnecessary pauses. <br><br>Do yourself a favor, don't watch this movie.<br><br>NOT RECOMMENDED.","user":"niaz_islam","rank":[17,19]},{"title":"A less than legendary return","rating":1,"date":"3 April 2018","review":"Now 'King Arthur and the Knights of the Round Table' had a decent idea and did have the potential to work. Really liked the idea of turning the story and characters on their heads, not something novel in any kind of media but it was hard not to be intrigued by it. Part of me was nervous though considering the less than favourable (putting that kindly) reception. <br><br>A reception that, after seeing 'King Arthur and the Knights of the Round Table', is justified. Was hoping to find some kind of value, being an encouraging generally reviewer, but 'King Arthur and the Knights of the Round Table' really is that bad. It completely wastes its concept by trying to do far too much in the writing, but it is the very amateur hour execution in every area that brings it down so catastrophically. <br><br>'King Arthur and the Knights of the Round Table' looks terrible. The costumes wouldn't even pass for fancy dress, even bargain bin quality clothes look better. The effects and such are shoddy. Worst of all are the utterly chaotic photography and editing that is enough to make one physically ill, had to lie after the film to stop myself from getting more queasy. The over-obvious and discordant music doesn't appeal at all and a lot of the sound gives one the creeps. <br><br>The script is really embarrassingly cheesy and stilted. Meanwhile the story is an over-crowded kitchen sink of different tones. Far too many and none handled well, it does affect the coherence (which badly suffers throughout) and it gives the sense that the film didn't know what it wanted to be, what direction to take and who to aim it at.<br><br>Found nothing interesting or endearing about any of the characters, all of which have no traits other than dull or obnoxious. The acting is wooden and passionless, only Sara Lane tries and even she isn't very credible as a result of trying to carry the film single-handedly (something she struggles with). <br><br>Overall, terrible. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[8,9]},{"title":"One star is too generous","rating":1,"date":"23 March 2018","review":"This movie is so bad, I wish there was a way to give it a negative star rating.","user":"rpwoolford2003","rank":[6,7]}]