[{"title":"For those who didn't like the movie because of its second half","rating":10,"date":"18 October 2019","review":"It's not really a review but my attempt to explain how I interpreted the movie to those who complain that the film is overrated, especially if the reason is that they didn't like the second half of it.<br><br>It's much easier to understand the message of a movie when the 'good guys' win or the 'bad guys' get punished in the end. I'm not saying that all Hollywood films are so naive in their portrayal of moral values. But still, I believe that Parasite is much more subtle than most other movies that people are accustomed to watching in which there's a character with a clearer 'moral center' whom audiences can easily relate to. So, I think it's no surprise if the message of this film had failed to register for some of the audiences.<br><br>Some complained that they don't understand Ki-Taek's motive for killing Mr. Park. But to fully appreciate this, you need to understand the meaning of a recurring expression in the dialogue which is, \"crossing the line\".<br><br>It's a deliberately ambiguous phrase that can either read as one should respect other people's privacy or as one should mind one's own (social) position instead of meddling with the affairs of those in a different position. If interpreted as the latter meaning, it can serve as another image that emphasizes the subject matter of the narrative, along with more easy to notice the metaphor of the two families' respective dwellings.<br><br>It would probably have satisfied such audiences who expected more lighthearted drama if the movie focused on an underprivileged, but more likable family exploiting a cold hearted snobbish family in a comical manner. But the movie would have lost all its genuine charms if Bong Joon-Ho chose such a path, and he is too good a director not to see such a danger.<br><br>Instead, he chose to make Mr. Park a reasonable enough character, despite his occasional hints that reveal his true nature. He seems to treat Ki-Taek fairly enough at first, but he also warns the latter not to 'cross the line' if Ki-Taek attempts to pry into his private life.<br><br>At first, it seems that it's quite easy for Ki-Taek and other members of his family to sneak into Mr. Park's house in various roles and mingle with them. Ki-Taek even compliments how nice Mr. Park's family is, but his premature admiration soon gets challenged when he overheard, when he was hiding under the table, what Mr. Park really thinks of him - almost a different species of the human being who doesn't even smell like him.<br><br>Ki-Taek's final disillusionment came when Mr. Park cringes from the smell of the dead basement dweller and shows much more concern for his son's shock while virtually ignoring Ki-Taek's daughter's status who's dying on the ground, spurting blood from the stab wound.<br><br>That moment, Ki-Taek realizes how Mr. Park sees him and his whole family as not an equal human being, but something much more insignificant.<br><br>And he also realizes the 'line' that separates the two families is not just that of courtesy or proper social behaviour. Instead, it is a line that can even determine the life of those 'lesser' human beings to be less important than the passing unpleasant feelings or mental shock of those 'proper' human beings.<br><br>However easy it was for Ki-Taek's family to sneak into Mr. Park's house, or however they try to socialize and mingle with Mr. Park's family, their existence is no better than that of a 'parasite', which is also visualized so effectively by the presence of the hidden basement room inside the house.<br><br>With such disillusionment and anger, Ki-Taek chose to kill Mr. Park, as a parasite could to its host, and like a parasite, he keeps hiding deep inside the dead host's body until he could claim the whole of the carcass and use it as nourishment for his offsprings.<br><br>The tragedy was not something caused by any exceptional defect or vice of either Mr. Park's or Ki-Taek's personalities. Instead, it's a 'line' drawn by an invisible hand, separating those classes according to their respective social conditions, which can be so brutal as to be able to deprive the two families of their humanity in contrasting manners. And that is what I believe to be the message this film is trying to convey.<br><br>Of course, not every movie must make a commentary on society rather than providing a care-free pastime that everyone can understand.<br><br>But without if the movie didn't change its gear in the second half to shed light on a serious inherent problem of our society, it would be just another heist gone wrong type comedy, instead of a deserving candidate to be called the best film of the year.","user":"mysticfall","rank":[3,4]},{"title":"One of the best films of this decade","rating":10,"date":"5 July 2019","review":"I am remarkably stingy with my 10/10 ratings. I'll be the first person to acknowledge this. Of the roughly 2600 titles I've rated on here, only 34 have a 10.\nParasite is one of them. If this isn't a masterpiece, then I don't know what is.<br><br>I'm going to keep it vague on the plot-front, because I didn't know anything about it going in, and was really excited to see it progress and unfold in satisfying, unexpected ways.<br><br>What I will say is that this film, more than just about any other I've seen, put me through so many different emotional states during its 132-minute runtime, and did so without ever feeling muddled or tonally inconsistent. Parts of this movie were hilarious. Parts were heartbreaking. Other parts were insanely suspenseful (I'm honestly not sure if I've felt this close to the edge of my seat since the final season of Breaking Bad, way back in 2013).<br><br>And it does all this while being perfectly paced, beautifully directed, and amazingly acted from every single member of its cast. All the characters are understandable and sympathetic to some degree; the amount of conflict, drama and tension derived from a narrative with no clear heroes and villains is staggering. You come to care for just about all of them.<br><br>I'm stumped to come up with any flaws for this movie. And sure, I've seen many movies that are hard to fault, but it's rare that a movie appeals to me on a gut level and excites me to this degree while also being so close to technically perfect. It's extremely entertaining, thoroughly moving in so many different ways, and as icing on the cake there's a ton of social commentary and some heavy themes to chew on once the movie's over (and this one's not going to leave my head for a while, I can tell).<br><br>Catch this one when you can and believe the hype. Joon-Ho Bong has made many great films (and so far no bad one's), but this even manages to stand head and shoulders above all the others.<br><br>When it comes time to consider what the best film of the 2010s was, this one will surely be up there.","user":"Jeremy_Urquhart","rank":[1,1]},{"title":"You name a genre, this movie covers it","rating":8,"date":"6 October 2019","review":"I can't remember the last time I saw a movie that contained as many genres as 'Parasite'. The movie starts out almost like an 'Ocean's Eleven' heist film and then expands into a comedy, mystery, thriller, drama, romance, crime and even horror film. It really did have everything and it was strikingly good at all of them too.<br><br>I love a film that respects its audience. There are so many details in this movie that are crucially important and yet the film trusts its audience to notice them and acknowledge them without ramming them down our throats. There are a lot of layers to this film and I suspect for this reason its rewatch-ability factor will be very high.<br><br>The film was incredibly entertaining too. I can't think of a boring scene in this movie and yet on the surface for large parts of the film you would say not a lot is happening, at least in terms of action. Fascinating characters and brilliant dialogue are what create this. I had a great time with 'Parasite' and I think most that give it a chance will too.","user":"jtindahouse","rank":[624,824]}]