[{"title":"A guy with a plan","rating":7,"date":"16 May 2017","review":"Greetings again from the darkness. Lao Tzu wrote \"The flame that burns twice as bright, burns half as long\". Though the math might be a bit off, that phrase aptly describes the too-brief life and career of shooting star Heath Ledger. As a 20 year old from Australia, his talent seemed to leap from the screen in 1999's 10 Things I Hate About You. As his popularity soared, so did his commitment to avoid being typecast as the charming and handsome love interest by the desperate directors of every upcoming rom-com project.<br><br>It seems inconceivable (that word means what you think it means) that Mr. Ledger only made 15 more movies before an overdose killed him in 2008 (at age 28). Adrian Buiterhuis and Derik Murray co-direct this portrait of the man, the artist, the friend, the father. We see the young Heath, nearly always with camera in hand, flouncing about with his buddies as he seeks his next adventure. The home videos and photos fill the screen with luminosity that we recognize from his movies  the camera loved his face, and he seemed to love everything about filmmaking.<br><br>Interviews, often the bane of biographical documentaries, provide a real sense of the admiration and love that Ledger attracted. His father, mother, sister, childhood Aussie friends, agent Steve Alexander, former lover Naomi Watts, and close friend Ben Harper pay tribute not just to the star who burned out too soon, but also the warm-hearted man they all connected with.<br><br>The film walks us through some of his key movies: his chance to work with his acting idol Mel Gibson in The Patriot, A Knight's Tale, his devastating performance in Monster's Ball, The Four Feathers, Ned Kelly, reminiscing with Catherine Hardwicke on Lords of Dogstown, his stunning turn in Brokeback Mountain, and his final movie The Imaginarium of Doctor Parnassus with his beloved director Terry Gilliam. Of course, there is also a full segment on his most famous (and his own personal favorite) role as The Joker (a guy with a plan) in The Dark Knight. The role not only won Ledger a posthumous Oscar, it became the most talked about film performance in years.<br><br>Even more interesting than the recollections from the various movie sets are the bits and pieces we get of Ledger as guy sharing the journey with his buddies, approaching master status as a chess player, as an artist dedicated to his craft, or as a photographer honing his style (in music videos) in what surely would have been an intriguing path as a director. Director Ang Lee brings us closer to understanding what we have missed out on in regards to Ledger as an artist, and with actress Michelle Williams, the mother of his daughter Matilda, choosing not to participate in the film, we still have the distance between fan and man that allows for due respect.","user":"ferguson-6","rank":[20,24]},{"title":"Just Great","rating":10,"date":"6 May 2017","review":"I Am Heath Ledger is a great movie. It is just great. The movie has Heath Ledger's family members and friends tell their experience with Heath and his life. The film is heartwarming and sad at the same time. It goes from Heath's family talking about his experience making films such as The Patriot, Brokeback Mountain, and The Dark Knight, and his joy making them, to the sadness throughout the time of his death within their family and around the world. It is a great film. It made me cry. If you are a fan of Heath Ledger and his work, definitely check this one out. 10/10.","user":"nyzeenews","rank":[13,16]},{"title":"An Informative, Emotional Look At The Life Of Heath","rating":8,"date":"1 June 2017","review":"I was basically introduced to Heath Ledger via his Joker performance in \"The Dark Knight\", a movie that completely blew me away in large part because of that incredible acting. I was shocked and saddened just like everyone else when Heath unexpectedly passed away shortly afterwards, and was not on hand to receive his Best Supporting Actor Oscar, provide further quality work, or be a father to his child. I really didn't know much of Heath's background before his \"Dark Knight\" years, so \"I Am Heath Ledger\" was a very informative (and of course emotional) documentary for me.<br><br>Basically, this documentary chronologically covers the years of Heath's short life, both in terms of his acting roles and family life. His love of adventure and creativeness are heavily referenced, as they made up such a large portion of his life and made him such an engaging figure. Heath's mother, father, and sisters talk about Heath from a family perspective, while noted creative luminaries &amp; friends (Naomi Watts, Ben Mendelsohn, Dijmon Hounsou, Emile Hirsch, Ange Lee, Catherine Hardwick, &amp; Ben Harper, to name a few) give their unique perspectives as well.<br><br>Despite the fact that Heath's life ended in tragedy, \"I Am Heath Ledger\" does not revel in it or take a somber tone (until perhaps the final few minutes). Mostly, this is a positive view of Heath's life, not unlike a wake of sorts where fond memories of the departed are shared in order to heal and try to move forward. I appreciated his approach, as it allowed me as a viewer to get a much clearer picture of who Heath Ledger was pre-Batman.<br><br>The only reason I won't give this doc the full 10-star treatment is because, in all honesty, I wish it would have discussed the circumstances of Heath's death more directly. All we get here is a brief \"he had his demons\" line of dialogue. I realize that directors Adrian Buitenhuis &amp; Derik Murray wanted to keep the tone positive (and it is clear they are always striving to do that), but I wonder if more could be learned from Heath's unfortunate demise by examining it frankly. Sure, no one wants the \"Ledger was a druggie\" myth to perpetuate (untrue as it may or may not be), but from my knowledge Heath died because of prescription medication abuse. Sad as it was, I would rather examine the issue for what it is instead of clouding it in mystery. Perhaps a lesson can be learned for future adventurers like Heath in order to better control their specific set of problems.<br><br>Overall, though, \"I Am Heath Ledger\" is an excellent documentary that gives a very well-rounded picture of Heath's acting, relationships, and life in general. Fans of him specifically or just actor stories in general will be satisfied (as well as emotionally touched) by the final product here.","user":"zkonedog","rank":[9,11]}]