[{"title":"Octopus","rating":10,"date":"11 June 2019","review":"I don't get it? Why are there so few ratings?\nDon't we always crave and scream for authentic LGBTQ+ content?\nThis is part of our history. I loved it. And I love Netflix being so open about them representing our community and why it's nessecary.<br><br>The only thing I don't get is the OCTOPUS?!","user":"jasminhegmann","rank":[59,65]},{"title":"Amazing Story !!","rating":8,"date":"8 June 2019","review":"Such a heart warming story of two girls who were madly in love with each other and their struggles to be together at all cost. Give it a try you will not regret it.","user":"panwarhemant-97433","rank":[25,32]},{"title":"Remarkable","rating":8,"date":"11 June 2019","review":"A beatifully shot and crafted film, as one has come to expect from Isabel Coixet, but also a brave one, one that in addition seems to defy the increasingly conservative trend towards what's dealt with (and shown) in maintream movies and what is not (paraphrasing Sir Elton John's recent remark on his biopic, life is not meant to be pg-13!). The following might qualify as spoiler: I would have switched the roles between the actresses, as perhaps Greta Fernández would have looked more convincing as a man. As she is, however, I find her the more interesting actress. Coixet assigns her the role of Marcela, portrayed at first as a rather naive character promptly and easily seduced by the more assertive Elisa (portrayed by an also magnificent Natalia de Molina), but subtly (yet without pause) she develops Marcela into the more forceful of the couple and the one who makes the ultimate sacrifices for their love, as is not only purposefully falling pregnant to facilitate their getting away with their \"marriage\" facing the town's folk but also surrendering her newborn daughter to the portuguese thitherto childless couple that facilitates their trip to South America, where they will find refuge and peace in a remote location in Argentina. The big question Ana, Marcela's left behind daughter, poses to her biological mother upoin their encounter, many years later, of whether the whole affair and scandal was worth the effort, remains with a somewhat ambiguous reply, and I think Coixet does that on purpose as this is no fairy tale. Yes, they were left finallly in peace in the remoteness of Argentina's Patagonian regions, but what Ana finds is a couple of rather lonely oldish women, cut off from the world, Marcela a probable heavy drinker, who as time went by might have drifted somewhat apart but remained together as they had no other recourse. Neither of them could return to Spain or Portugal due to a threat of incarceration, and if they went to a more populated area in Argentina they might have faced a similar fate. Remember the action takes place in the beginning of the 20th century, in a Spain where a civil registry did not exist until the 1930's and where the Catholic Church had a heavy presence, especially in the province where Elisa and Marcela met, rural Galicia. Not an easy choice then, not an easy ending.<br><br>Horay then for Isabel Coixet, a film maker one has grown to respect more and more over the years, and thumbs up to her two valiant protagonists.","user":"mplaza-38753","rank":[14,17]}]