[{"title":"A Trip!","rating":10,"date":"26 August 2019","review":"This is wacked out and will offend the average horror movie fan. It's more like Funny Games then Cabin in the Woods. Some good scenes, a good ending. I think there are too many ideas here and wish the filmmakers stuck to just one or two and fleshed them out more.<br><br>Worth the watch.","user":"HarryOhReally","rank":[9,13]},{"title":"\"I Love Movies\"","rating":10,"date":"8 September 2019","review":"The meta-horror movie is almost as over-done as the found footage horror movie. Incredible Violence shows that there is still new angles to explore with meta and the result is a fun movie that stuck with me well after the movie was over.<br><br>The Good:<br><br><ul><li>The idea and the movie are funny. A director has to make a horror movie, doesn't have the money anymore so he decides to kill actors for real and deliver that to the people he owes. Easier said then done as the bumbling would-be Jason or Mike Myers finds that actors won't do what they're told, people don't die as easily as the movies say they do, and the clean up takes forever.</li></ul><br><br><ul><li>There are two or three scenes that you can see how much fun the crew had making. It reminds me a newer day Tarantino because the joy of making it is palpable.</li></ul><br><br><ul><li>Steven Oates is a star in the making. We don't see nearly enough of him as I would have liked. I was left wanting more and cannot wait to see this guy in other movies.</li></ul><br><br>\nThe Bad:<br><br><ul><li>A few performances are shaky. Dollar-store Jason Mamoa can't seem to make up his mind if he's a good guy or a creep. Might be a problem with the writing but it took me out of the movie whenever he was on screen.</li></ul><br><br><ul><li>The low budget shows in a few of the effects shots. It doesn't ruin the movie, but, again, it took me out of it for a moment.</li></ul><br><br>End conclusion is that this is a movie I'm glad I watched. I'm not a huge fan of horror movies so the levels of violence wasn't exactly a walk in the park for me but it was used sparingly and wasn't as in bad taste as the title would suggest. Show the kids!<br><br>Side note: I hope they make a sequel someday which is the making of this movie. Meta-in-meta-in-meta!!","user":"RightHand2God","rank":[6,8]},{"title":"Feminist Horror a MUST watch in 2019","rating":10,"date":"6 September 2019","review":"I came across this movie by accident. I never heard anything about it before hand, I liked the title and the poster. I can't believe I'm not hearing more about this movie!!! ESPECIALLY after the #MeToo Movement. It's clear the filmmakers were paying attention to what women have been saying since those creeps in Hollywood have been exposed. If you want to know where these feelings are coming from in the entertainment business, then this movie will educate you about what women go through to obtain their dreams.<br><br>The movie follows the story of the director (G. Patrick Condon, played by Steven Oates) but the more interesting story and who the movie is truly about is Grace (brilliantly portrayed by MJ Kehler). A first time actor who gets what she thinks is a lucky break by being cast as the lead actor in a run-of-the-mill slasher movie. Grace starts the movie off by being young, hopeful with stars in her eyes (Literally the first thing she says in the movie is the famous Sally Field \"You Like Me\" oscar speech) and from there she willing puts herself in situations that I was screaming at the screen for her to be smarter about (when your co-stars go missing, you leave!) but she pushes herself further and further because she must attain her dream of being an actor.<br><br>I think MJ and the filmmakers were making a statement throughout the movie about how insane women are treated in the movie business. Even in most of the information I've seen written about this movie, it focuses on the MAN killer character when the real story is about Grace, but like most men bloggers, the woman's story comes 2nd and the man's story is put front and centre. This all dovetails when Elizabeth makes a speech about how she got into the movie business. Her first role was a woman's horror story about being naked in an audition with a room full of men, having been promised one thing and then given another.<br><br>If this is what a post-Harvey Weinstein Hollywood looks like, then sign me up. 10/10. An important movie that everyone needs to watch.","user":"MsChurchill","rank":[10,16]}]