[{"title":"Wow","rating":10,"date":"26 March 2019","review":"All I can say is Jess Wexler is an absolute revelation. I was so lucky to catch this at NOLAFF and I was blown away. If you have no idea what the film is about please just just take my advice and give it a chance you will not regret it!","user":"dionnewray-98669","rank":[15,25]},{"title":"Soldiers of cinema","rating":10,"date":"21 December 2019","review":"Often, the self aware cinema goes to useless ends. Often a visible frame will be rebelled against by audiences, or then, a film of frames will attract puzzlers not audiences. We don't like to be made a fool of, or within some intellectual feat, so once a frame is visible it's received with harshness; the notion itself is more troubling than the thing. Also why Rosenthal brings such an extreme psychological weight with his presence that we, like her, feel dread at the start knowing he's coming. It's not rational, but subliminal. Of course once he arrives, he's harmless, sweet, and neurotic before the art begins, where the hyper vivid fantasy performance ensues. But then, why after, am I so affected, drained, upset? It's because the performances don't seem to lead to his fantasy but a desire for a real life. This is the effect of theater taken to the most literal, functional end. It feels cathartic because it's so productive. Even he, in his neuroticism to know the lines, works tirelessly to play this myth, to use it as a tool for the great ritual he's at center. His disfigurement becomes a performance tool. Wherever its vignettes experiment, it constantly arrives at theater, at artifice, at integration. It is constantly defending or offsetting or preceding itself this is not the theater of the strange, but the cleansing act of theater itself. Films go to nature or eroticism for transcendence, but here both: he plays this form in our mind, a 'Beauty and the Beast' or 'Phantom of the Opera', where he functions as nature itself, furthering the film's grand subconscious vastness in the very reversal with his transcendent escape being life at all. Shakespeare, also, if we go upward to remark on the theater of the gods, for how it tracks all the way down, raises in its ritual, in the process, aggrandizes the outsider giving him the platform. The great act to raise in the process lands at a place of normalcy; it's saying art is not just useful, but life itself... not to say this in a clever way, but that the two lateral frames within an outer frame will function as the same frame from the higher point. Or, the truth and lie is still bringing out the psychological truth, so there is no distinction. Every frame from the base reality brings the methodology narrowing the theater further, as a way for remarking on the frame above it, down the further dimwit reality. Over and over there is the scene, then the camera pans to the real. Even after the third or fourth time there's no doubt left, it's never going to be real, but it doesn't matter by then, it's more a ritualistic act of performance--&gt;audience than a journalistic one of revealing artifice--&gt;truth. The irrelevance of the encapsulating frame by then is that distinction of actor and camera past the threshold of the screen, is just our fellow audience, propping this act to witness and enable Rosenthal the Great.","user":"ReadingFilm","rank":[8,12]},{"title":"ending confuses","rating":6,"date":"29 January 2020","review":"Mabel (Jess Weixler) is an actress filming on location. Her director had lived with a circus and has hired a bunch of circus freaks for his movie. The lead actor Rosenthal (Adam Pearson) has a badly disfigured face. Mabel and Rosenthal develop a relationship as they work together on the film set.<br><br>The theme from the opening text is the advantages of the beautiful over the lesser endowed. I always like Weixler as an actress and I like her relationship with Rosenthal. I like the acid twist and turning the table on the premise. The ending is a head-scratching. Instead of moving forward with the acid, it does something else. I'm not sure if they're dumping the acid incident. I'm not sure if it's a flashback. The ending doesn't give an ending for their relationship which is its biggest problem. This is a beauty and the beast situation. It seems to be going somewhere interesting with the premise. The ending confuses more than illuminates.","user":"SnoopyStyle","rank":[3,4]}]