[{"title":"Excellent film","rating":9,"date":"18 October 2017","review":"The story is not that complicated.<br><br>But the execution is very good. I was glued to my seat throughout and only breathed with relief (from pressure) when the roller credit came out. It proved that a good movie does not necessarily mean investing huge amount in computer graphics or famous (and costly) stars. All it takes is a good script, talented direction and good acting.<br><br>Bravo for Thai film industry!","user":"hitomi69","rank":[48,65]},{"title":"Entertaining and interesting movie! Got To Watch","rating":9,"date":"27 February 2019","review":"Now im not watching many Asian movies, but when i watched this ones trailer, i knew that i have to watch it and oh boy i was right.\nActors are amazing in this and so is the story.\nThe director,writer and cast knew what they were doing and were doing it right.\nWhat sold me on this was the fact that they didnt use CGI or if they did it was so small i didnt even notice.\n9/10 Must watch!","user":"Oliver-Dawson","rank":[6,6]},{"title":"Entertainment movie - Rebirth","rating":9,"date":"15 September 2017","review":"The movie defies opinion and stereotypes. Although originated from what can be known as a \"B-rated\" market - Thailand, the product - what may have been seen as a typical teenager movie - stands out in its own field with brilliant production and composing. I came in the cinema with almost zero hope for what could be the next definition of modern entertainment movie, yet the show proved that it got all the elements ready. The casts, while still in their early years, depicts the characters as-what-they-are, with enough depth and individuality. Next,the surprisingly excellent screenplay, cinematic sound and effects took every single breath away. In short, what's here is a play inside a play, a concert inside a movie. The photography skill here was taken to the next level. The sound team was truly praiseworthy. No one expected how intriguing a simple exam scene could be until they see the pencils were dropped while Mozart notes are stepping in the beautifully shot frames. No second was left out or wasted, scene after scene followed one another like the flow of water, with all the intensity a film this kind needed. What's next? What's there left behind? - The viewers are left with the question thorough the play and were not disappointed. Could this be the all time classic for generations? Hardly, but could this piece of art here linger in your thoughts, days after days? Certainly. It was all too simple at first look, until the drama started: the thought-consuming piano flow kicked in and the clock started moving, seconds by seconds.","user":"haitrantdn1999","rank":[34,49]}]