[{"title":"Shockwave: Not actually terrible","rating":5,"date":"28 September 2018","review":"Shockwave: Countdown to Disaster is another of those films that will be repeated on the Scyfy channel for years to come. <br><br>It tells the story of a super weapon that has been set off and is burrowing through earth causing rampant eartquakes that are gradually tearing the world apart.<br><br>It's your usual generic cliched to hell disaster movie stuff that has every trope going. A goverment who don't listen to the warnings, an estranged couple who are both experts in this particular field, the whiney kid of the estranged couple, every country getting destroyed but it being the US who save the day etc etc etc.<br><br>CGI is average, performances are slightly above average and the plot is a combination of fairly good and really quite terrible. It get's weirdly dark in places, has your standard filler middle and sickly sweet finale.<br><br>For what it is it's actually above par, against your average film however and it's still a mess.<br><br>The Good:<br><br>Has its moments<br><br>One great comedic relief character<br><br>The Bad:<br><br>Same ol', same ol'<br><br>Things I Learnt From This Movie:<br><br>Once you've seen one of these movies you have literally seen them all","user":"Platypuschow","rank":[17,19]},{"title":"One star is tooooo high for the CRAP","rating":1,"date":"28 January 2019","review":"I've seen better acting on daytime soap opera's from Australia\nIgnore the fake ratings\nAVOID AT ALL COST!!!","user":"pubquiz","rank":[7,8]},{"title":"Because they deserve it","rating":1,"date":"31 January 2018","review":"I'm rating this one star for very obviously gaming the IMDB rating system. Anyone well-acquainted with this system can spot fake rating stats almost immediately. 800+ \"high\" ratings. However of those 800+ ratings we find only 3 reviews... and all of them negative. I would tend to believe those 3 reviews more than the 800 questionably high ratings.<br><br>I've said it before and will say again: If you have to fake your own ratings, you've already failed... and not just in film making.","user":"Snootz","rank":[27,41]}]