[{"title":"It's a shame the producers chose amateur filmmakers for this production.","rating":6,"date":"17 November 2018","review":"This film is based on the true story of Don Aronow (changed to Ben Aronoff in this film), of which I've never heard of until after seeing this film. At first I thought \"why John Travolta?\" but after Googling Donald Aronow, I see the uncanny resemblance.<br><br>I'm a fan of films based on true stories, and I enjoyed learning something new, especially about the beginnings of the cigarette boat racing industry.<br><br>Where this film failed miserably was in hiring amateur director Jodi Scurfield of whom this is his?/her? first ever film directed. Why? Was Jodi one of the 25+ executive producers significant other or child?<br><br>This films editing was one of the worst I've seen in a while. Then there's the writing; you would think at least one of the five writers could have re-read the screenplay and see how hacked it was. The were many jumpy plot issues and omissions. I feel certain scenes needed more relevance to what was happening or how/why they happened.<br><br>The 102 min length felt much longer due to the slow pacing contributed by the bad editing and sloppy directing. The SFX during the storm was 1980's technology. The cinematography was adequate, as was the score.<br><br>The cast however all provided decent performances, considering the director probably had no input during scenes of their performances. It showed from the flat and unconvincing relationships of Travolta's two wives and children.<br><br>I'm disappointed that of the 25+ producers, no one made the effort to hire professional filmmakers to make this film way better. This story had much potential.<br><br>I know this film will get bad ratings due to all the negative reasons I've stated above, but oddly enough, I still enjoyed it and liked learning something new and interesting from this film's base of a true story. If you can look past the flaws, you might enjoy it as well. A generous 6/10 from me, only for the base story and the cast's performances.","user":"TheTopDawgCritic","rank":[75,91]},{"title":"Speed Kills","rating":1,"date":"26 November 2018","review":"The worst movie I've ever seen. We laughed at it for its absurdity. Close ups of John Travolta smiling into the camera seemingly staring at his own reflection, multiple times, very creepy. Numerous boring long periods of him driving a boat and smiling, weird. Him with multiple women, not even believable. His hair looks awkwardly fake. Sluggishly slow. Torture.","user":"bill-n-terri2006","rank":[42,56]},{"title":"Speed kills ?","rating":4,"date":"23 December 2018","review":"I wonder what was in their minds when they decided to make this movie. A lot of money spent, endless hours of work.This movie has on its cast famous actors with huge revenues,who have already played in very good movies or TV series.What is the reason for this movie? I made an effort to see it by the end. I'm curious if John\nTravolta had the patience to watch it all the way. I can say that the only thing that this movie excels on is the banality.That is not art.","user":"Concorde2512","rank":[15,18]}]