[{"title":"A very bland horror comedy...","rating":5,"date":"26 June 2019","review":"\"Fubar\" (aka \"Killer Weekend\") was a movie that came into existence without my knowledge, and I happened to stumble upon it by random luck in 2019. And now that I've seen the movie, I can honestly say that the movie will equally silently and unnoticeably return into obscurity.<br><br>This movie was bland. Writers Ben Kent and Joel Wilenius attempted to come up with something that would mix horror and comedy, I suppose. But the finished result was one that was mediocre. I can't claim that I was particularly amused with what transpired on the screen and I definitely wasn't laughing. Nor was it enough in the horror lane to actually be interesting enough to watch.<br><br>However, I managed to endure \"Fubar\" to the end, hoping that the movie would pick up along the way and become better. But it just never did, so no thumbs up for director Ben Kent here.<br><br>The characters in the movie were bland and you didn't really care much about what happened to them, and that was a terrible blow to the movie, because there definitely was some potential to it.<br><br>The storyline of the movie wasn't particularly innovative or overwhelmingly interesting to me, so it only made for a mediocre watching. I sat through it to the end, but I will never watch the movie a second time.","user":"paul_haakonsen","rank":[4,5]},{"title":"The fight before","rating":9,"date":"11 January 2019","review":"First things first: this is more fun than it has any right to be. The story is pretty simple. A last fun trip before marriage with the bros ... and the father in law of course as a major part. The dynamic and chemistry is set pretty early on. And while that may sound like cliche (relationships to each other), they all play out nicely.<br><br>Actually better than nicely. This is so much fun, I was kind of surprised. It is very well acted, you get many fun moments (especially if you are not easily offended, this is comedy after all and it does not take prisoners - quite literally at times). This was one of the best comedies I saw last year and I can only recommend it - the fun is shining through to the viewer in a big way","user":"kosmasp","rank":[20,38]},{"title":"DNT WATCH","rating":1,"date":"17 June 2019","review":"Absolute rubbish dnt waste your time watching, it's meant to be a comedy... its not even funny, the acting is terrible and its beyond low budget.","user":"heblon","rank":[7,14]}]