[{"title":"All the required ingredients for Lifetime","rating":14,"date":"14 June 2017","review":"As the movie opens, we see and hear a female pounding on a door. She is no doubt the Lifetime Psycho (LP).<br><br>The following scene introduces the Lifetime Heroine (LH), mom Heather, who is a tax attorney. Her daughter is Rebellious Teen (RT) Lisa, and dad is the Guy Perpetually in Need of a Shave (GPNS) Tim, who is moving out. Tim has a bud that is also a GPNS, who is opening a new restaurant and giving the GPNS a shot at his dream of being a chef, which was a big factor in him separating from the LH since she wanted him to raise the RT until she left home. I'll acronym restaurant owner as GPNS2.<br><br>The GPNS meets a female Jamie at a lunch truck and pays for her meal. My money is on her being the LP. They learn they are neighbors at the apartment complex where they are apparently the only residents, as no one else is ever there. Either that or the budget did not allow for extras.<br><br>The RT is having a hard time over the separation, and is not doing well on the swim team, where Madsen is the coach- and another one of those as Dean Winchester puts it no talent douche bags that wears sunglasses inside. The RT also has problems with both her BFF and BF, Penny and Steven.<br><br>I don't have enough room here to describe all of the creep-o-meter the LP does, they are that numerous. She also has mad skills to include lock picking, hacking, Krav Maga, and shooting prop guns (no recoil, that effect was also not in the budget).<br><br>The entire family is seeing the same shrink. The RT does not have much to say, while the LH and the GPNS do a lot of arguing.<br><br>Cut to the GPNS swimming, and the LP seizes the opportunity to show off her pasty Canadian body in a skimpy bikini and take some swim lessons. This leads to a kiss and drinking. The LP suggests the GPNS needs the right wife coupled with an under the table foot rub. The GPNS is reluctant to sleep with the LP, and she has some selfies of them kissing. Saying \"I have a family\" does the trick and the LP leaves.<br><br>The LP though uninvited shows up at the restaurant's opening and just when it looks like an epic chick fight is about to take place, GPNS2 steps in and asks the LP to leave. The LH asks her to step outside and more words are exchanged, with the LP showing the LH the selfies she took with her and the GPNS. The LP leaves and the LH goes back in and accuses the GPNS of sleeping with the LP. He denies it and the LH takes the RT and leaves. The GPNS2 goes off on GPNS and tells him to keep that psycho out of here. +1 Lifetime point for using the term psycho in some dialog. The LP wastes 15 seconds of movie time screaming. That's some great cinema there.<br><br>The LH gets some screen time and barters with a client that is starting a security service.<br><br>The LP follows the RT to school. She follows the RT's BF as he leaves. Maybe now we'll get a body count. Success! The LP hits him with her car and then runs him over for good measure. Body count: 1.<br><br>In therapy, the RT uses the term psycho to describe the LP. At BF's funeral, the LP is spying on them and the security dude is spying on her. My money is on the LP ganking him. He swipes a bag of the LP's trash for DNA.<br><br>The LP shows up at the GPNS' restaurant and causes a scene as the GPNS2 arrives. He is no doubt a fan of Barney Stinson from How I Met Your Mother and has seen the hot/crazy scale. He asks the GPNS \"How come the hottest chicks are the craziest, huh?\" Security dude has some info on the LP about a past employer, and just walks into their house. He finds a photo shopped picture and tries to call the LH, but the LP is waiting in his SUV and ganks him through the seat. Called it! Body count: 2.<br><br>Things are working out for the LH and the GPNS, he is moving out of the apartment. The LP calls and says she is going to see a shrink, and tells the GPNS to come over and get a family photo she took. She didn't leave, and like a dumb ass, he goes there and is knocked out by the LP. We finally see a female in jeopardy with about 17 minutes left. The LP knocks out the RT with a cloth over her mouth. She comes to tied to a chair, as is the GPNS. The LP threatens them at gunpoint and the LH attacks her, and we finally get an epic chick fight. Heather loses the fight and instead of completing the strangulation, the LP goes for a convenient knife. She gives a brief speech just as the RT frees her hands and picks up the gun the LP conveniently dropped near her. She shoots the LP just before the LH is stabbed, the police arrive, and the LP is wheeled out on a stretcher screaming.<br><br>In a deviation from the normal sunny day followup closing scene, the LP has switched places with a new orderly at the loony bin and is going to walk out the door past Dr. Plothole. Apparently it was his first day also, as he didn't recognize the now healed LP.<br><br>Real movie score: 4/10 (higher is better). Lifetime movie score: 7/10 (higher is stupider).","user":"darkavenger77","rank":[15,17]},{"title":"Oh dear oh dear!","rating":3,"date":"9 August 2018","review":"As film fodder goes this is pretty diabolical from an acting and directorial perspective. How some of the 'actors' ever got the job is one of life's mysteries as you wouldn't see anything more wooden even if you studied an IKEA wardrobe. Characters were almost laughably stiff delivering excruciating well worn tropes. I only gave this calamity any stars at all for the unintended laughter it induced and for the goofy finale.","user":"AndreanDatura","rank":[6,6]},{"title":"Why so wacko?","rating":5,"date":"29 October 2017","review":"This is an average psycho thriller. A pretty psycho woman targets a recently separated father. The cast is fairly likable and the lead actress is pretty and quite effective. The story could have been flushed out a bit more. Mainly some more explanation for the wackoness. Usually Lifetime reveals some reason or history for the villain's actions. Here it seems glossed over. It seemed rather dumb that the mother appeared without any weapon at the end. About average for the \"wrong --\" series of television movies.","user":"phd_travel","rank":[6,6]}]