[{"title":"Cult film?","rating":5,"date":"8 April 2018","review":"This movie has all the ingredients to be the next great lesbian cult film. Naked women fighting, bad acting, bad script and low budget. That's as good as it gets.","user":"briteview","rank":[9,11]},{"title":"Better of the worst","rating":6,"date":"23 April 2018","review":"Not a bad movie overall but I wish I had known the amount of nudity shown. I was not prepared for the sexuality on this supposed thriller. Other than that I felt the movie had a good, original enough concept. The acting was average but still captivating enough for me to get through the movie with interest. I wouldn't necessarily recommend this movie as a thriller but if you've seen as many on Netflix as I have then you may as well cause it's one of the better of the worst.","user":"ecmedford","rank":[10,13]},{"title":"It's as good as it gets.","rating":6,"date":"9 September 2018","review":"Having watched it on Netflix not too long ago, I really can't see what all the fuss is about. I will assume that most people who hated it had their expectations a little too high. The film features an entire cast of unknowns, obviously. It stars Kelly McCart as Mallory, a young American girl living Southeast Asia who is sent to prison after a self-defense attack on a bully. It's not until 7-10 minutes in as the plot gets going. But when it does, things get, there I say, pretty crazy. I did not expect this to throw as many punches as it did (literally), and boy did it show; again, literally.<br><br>Now, many have criticized the film's writing, as well as the acting, and I can certainly see why. The premise (as interesting as it may sound) ain't nothing new, and this is coming from someone who saw Jailbait about a year ago; and as I've stated before, the plot doesn't really get going until 7-10 minutes in. The acting (while not good, per-say) is, in my honest opinion, not terrible.<br><br>All in all, this flick ain't nothing special. if you're one of the seekers expecting a form of substance, prepare to be disappointed, as you'll find very little of it in this. If you are, however, a movie buff seeking entertainment, this flick is definitely for you, because the true saving grace is the lead actress' (there I say) astonishing figure.","user":"LBarlane24","rank":[9,12]}]