[{"title":"why you should see this film","rating":10,"date":"2 August 2018","review":"Marcello Fonte's award winning performance which totally convinces as the doting father dealing coke on the side and in so doing so has made one of his customers, Simone (Edoardo Pesce), a hulking beast of a sociopathic bully, into a true monster. Something utterly devoid of charm, empathy or indeed a single redeeming quality. The 'dogman' however, through his actions, is a morally ambigous character. On the one hand, he's a loving, devoted father to his daughter. He shows a warmth, affection, empathy and understanding towards the dogs in his care, who are sometimes agitated. On the other hand he bears a great deal of responsibility for making Simone into the coke addled monster that he is.\nQuestions are opened up about the nature of evil, how it arises and what it is that prevents evil from taking hold. I think the film invites us to consider what we live our lives for - do we live solely in order to serve ourselves and our narrow interests or do we put aside our selves and try to live for and consider others? How do we deal with the consequences, foreseen or otherwise, of our actions?\nThe direction - use of location, cinematography. This is definitely a movie to see on the big screen, the decrepit sea side resort where the action takes place is packed full of detail this is masterful film making - making full use of the setting to reinforce the interior world of the characters.\nThe sure sign for me of a skilled director is an absence of incidental music - this movie has none, it doesn't need it. The action speaks for itself. It relies upon and allows the audience intelligence to consider what is going on.\nA magnificently intelligent film about the human condition about how humans allow tyrants to run over them, about power, how power is abused, how we treat those weaker than ourselves.\nI'll warn there is some stomach churning violence so this might not be a good 'date' movie but if you want a serious and deep film exploring the human condition and masculinity in particular then this one is for you. More questions posed than answers offered...\nIf you're an Italian buff and know your way around the Naples region this will be even more for you, but that said the story could happen anywhere.\nSaying that suddenly brought to mind Shane Meadows film 'Dead Mans Shoes' which this would sit very nicely with in a double bill. It's quite a different film, with a damaged male protagonist making choices with serious consequences and also a 'revenge' flick.\nDOGMAN was released in France back in June where I saw it in Italian with French subtitles I speak OK French, not brilliant, there's always stuff you miss but that didn't seem to diminish the impact. I'll finish by saying that despite the dark themes it's not without some sharp humour. ENJOY!","user":"trpuk1968","rank":[103,130]},{"title":"Italy is a country full of stories","rating":8,"date":"3 February 2019","review":"This is a small but lovely and dark Italian gem.\nIts such a stylish and well-told story. It feels so iconic and classic and the two leading actors give exceptional and unique performances. I felt invested from the very first minute and the whole movie had a dark charm and told a not-so-important, but thrilling story.\nThere are some elements, like the quirky performance of the leading actor and the impressive storytelling that make this film kind of exceptional.\n8/10\nWatch it","user":"nikxatz","rank":[35,45]},{"title":"A well-made modern fable","rating":7,"date":"31 October 2018","review":"Loosely based on a real-life incident, Dogman is an intimate character drama telling the story of an inherently good man who pays the price for attempting to foster a friendship with an irredeemable and sociopathic brute. Directed and co-written by <a href=\"/name/nm0308520/\">Matteo Garrone</a>, the film operates on the level of both social realism and as a kind of modern-day Aesop's fable. Postulating the somewhat nihilistic view that, when pushed to extremes and backed into a corner, man is no different than a dog, the film returns Garrone to the mob-infused milieu of his breakout, <a href=\"/title/tt0929425/\">Gomorra (2008)</a>. However, the two are markedly different films - whereas Gomorra weaved five separate stories into a complex narrative tapestry, Dogman focuses tightly on one simple core story; whereas Gomorra told the story of a widely-influential and powerful organised criminal enterprise, Dogman tells the story of a localised and utterly ridiculous criminal mentality; whereas Gomorra depicted mob figures both powerful and insignificant, Dogman depicts people not even on the lowest rungs of the ladder. However, there are also undeniable similarities between the films. Both emphasise the importance of omertà, and both explore some of the less glamourous aspects of gangsterism - the casual and often pointless brutality, the illogical sycophancy, the centrality of pusillanimity, the power granted to dealers by addiction, the nature of poverty and/or ignorance, the abdication of immediate self-interest in deference to potential long-term accruement. Essentially, if Gomorra showed us how the Camorra is run, Dogman shows us the squalor and sordidness at street level.<br><br>Diminutive and inoffensive, Marcello (<a href=\"/name/nm7535164/\">Marcello Fonte</a>), owns a small dog-grooming business in a run-down Neapolitan sea-side suburb. Separated from his wife, Marcello is devoted to his daughter, Alida (<a href=\"/name/nm8422389/\">Alida Baldari Calabria</a>). However, to pay for the expensive holidays on which he takes Alida, he sells cocaine on the side, his best customer for which is the hulking Simoncino (a ferocious performance from <a href=\"/name/nm3034455/\">Edoardo Pesce</a>). An unpredictable and volatile ex-boxer who everyone in town fears, although Simoncino treats Marcello with utter contempt, Marcello wants to foster a real friendship. However, when Simoncino decides to rob the gold-for-cash store next door to Marcello's business by busting a hole through Marcello's wall, Marcello is immediately uncomfortable. Failing to talk Simoncino out of the robbery, Marcello eventually decides he's had enough of being pushed around.<br><br>Dogman film is based on the case of Pietro De Negri. Known as \"Er Canaro\" (the dog keeper), De Negri was the owner of a dog-grooming business in the Magliana area of Rome who dealt cocaine on the side. In 1988, fed up with being bullied by former boxer and cocaine addict Giancarlo Ricci, De Negri laid a trap for Ricci, imprisoning him in a dog cage, and murdering him. The case made headlines in Italy because of the details of De Negri's confession, in which he claimed to have tortured Ricci for over seven hours prior to his death. However, an autopsy quickly revealed that much of what De Negri had confessed hadn't actually happened, with the coroner estimating that death had taken approximately 40 minutes, not the seven hours De Negri claimed. During his trial, it was argued that De Negri suffered from paranoid psychosis, exacerbated by his own cocaine addiction, and he was sentenced to 24 years in prison. He was released in 2005. Dogman is one of two 2018 Italian films based on the case, along with <a href=\"/title/tt8406750/\">Rabbia furiosa (2018)</a>.<br><br>Narratively, Dogman is relatively uninterested in the culmination of the relationship between Marcello and Simoncino, and much more in the events that build to that culmination. In this sense, the narrative is fairly evenly bifurcated, with the first half of the film focusing on the increasingly dangerous and destructive \"friendship\", whilst the second explores the fallout from the cumulative abuse, looking at what can happen when even the most mild-mannered individual is pushed too far too often.<br><br>The film goes out of its way to ensure that the audience feels sympathy for Marcello, if not necessarily empathy, depicting him as a fundamentally decent person, coke dealing aside. Yes, he's weak-willed and a terrible judge of character, but he dearly loves his daughter, who he treats like a queen, he is respectful and accommodating to his friends, and he seems to genuinely believe he can save Simoncino from himself. When Simoncino proposes robbing the gold store, one of the reasons that Marcello offers as to why he doesn't want to do it is that, \"it's important that people here like me.\" Although this could come across as narcissistic, the way Fonte plays the character instead suggests that being liked sincerely makes Marcello happy, and he is quite content to do what he must to earn the admiration of his peers. In this sense, his hamartia is that he believes he can apply logic to his friendship with Simoncino - if he gives Simoncino what he wants, then Simoncino will come to respect him, and at that point, Marcello can turn him away from the path down which he is travelling. Highly skilled at placating the snarling dogs who don't want him anywhere near them, Marcello believes he can do the same with Simoncino. The problem, of course, is that he is 100% wrong about this - Simoncino is a wild beast, permanently in battle mode, and logic cannot be applied to such a man.<br><br>Especially worthy of praise is the film's almost post-apocalyptic location, which is practically another character entirely - the beach is ugly, dirty, and overgrown; the buildings are unoccupied, paint peeling off the walls, vines crawling up the facades, some of them literally only shells; the shopfronts are rusty. This ties into the film's allegorical concerns, as the desolate nature of the locale mirrors the barren souls of the men who live here. Director of photography <a href=\"/name/nm0117692/\">Nicolai Brüel</a> often shoots the dilapidated housing blocks in extreme long shots, rendering the already diminutive Marcello even smaller and more oppressed. The film also mixes subjective handheld camerawork, with more elevated and fixed, pseudo-omniscient shots. The colours are also extremely limited, with white, yellow, and beige predominating.<br><br>Fitting very much into Garrone's oeuvre, Dogman bears a number of similarities to <a href=\"/title/tt0322725/\">L'imbalsamatore (2002)</a>; both are loosely based on real events, both are set in run-down coastal suburbs, both focus on co-dependent and toxic relationships between mismatched male characters. In Dogman, however, the allegorical content is taken further than in any of Garrone's previous work. Co-written by Garrone and his regular collaborators, <a href=\"/name/nm0158323/\">Ugo Chiti</a> and <a href=\"/name/nm0309979/\">Massimo Gaudioso</a>, the film wants to convey universal truths in respect to humanity by focusing on the micro rather than the macro. Of course, for an allegory to work, it must first and foremost function as a stand-alone story, and the argument could be made that this is where Dogman falls down. The storyline is very slight, with Garrone more interested in philosophising than he is in story-telling.<br><br>However, there are certainly metaphorical aspects that work. For example, it's telling that the activity most favoured by Marcello and Alida is scuba-diving. Similarly, \"Dogman\" may be the name of Marcello's business, but it also describes both protagonist and antagonist - Simoncino is the vicious dog who Marcello must try to calm, whilst Marcello is the unfailingly loyal lapdog who always returns to his abusive master. On the other hand, are the caged dogs seen throughout the film supposed to represent how Marcello is entrapped by Simoncino's violence, or are the shots of Marcello pampering them a metaphor for his servility to an indifferent master? In other words, the film is a little muddled on which side of the allegorical equation the dogs belong.<br><br>However aside from this slight impreciseness regarding the allegory, Dogman is a fine film. Humble in its aspirations, and small by design, some viewers will find it too uneventful, whilst others will find the ending too abrupt. However, all things considered, it's a strong piece of cinema.","user":"Bertaut","rank":[36,52]}]