[{"title":"If you want to test man's character, give him power","rating":5,"date":"5 April 2018","review":"An interesting movie for 2 main reasons: 1) it shows the fragilities of the Nazi Germany towards the end of the war, with many German soldiers deserting the army (something nobody talks about) and 2) it shows the depths of the human ego and the decadence of character when power is given arbitrarily","user":"val-soph","rank":[101,113]},{"title":"The beast within","rating":9,"date":"17 March 2018","review":"The film revolves around authority, the trust we tend to have towards a person we endow with authority, official ranks, hierarchy, \"Kameradschaft\", the sense of belonging to a group, and (for me at least), egoism in general. It is also quite brutal and sadistic. The story itself, with the most improbable twists, is taken from a real life story at the end of the war.\n It is rare in war films to have the perspective of the criminal. We do not sympathise with him, but rather he impersonates the beast in every one of us. \nAnother merit of the film is quite natural: German actors can of course impersonate German soldiers better than for example US ones, it also gives a realistic touch to the film as opposed to US war movies featuring evil nazis.\nThe message of the film was for me clear and delivered with a great impression - I will not write it here as it would be flat in my words.","user":"barta-46978","rank":[108,122]},{"title":"corruption by power","rating":7,"date":"26 July 2018","review":"Greetings again from the darkness. It's mind-boggling how many fascinating stories - both large and small - continue to come from World War II, even 75 years later. Writer/director Robert Schwentke (RED, FLIGHTPLAN) abruptly opens his latest with a single soldier desperately running from a posse of Nazi soldiers who appear to be hunting him down. The soldier manages to escape, kicking off an incredible journey that we are informed occurred during the final two weeks of the war (April 1945). <br><br>Max Hubacher stars as Willi Herold, the soldier we are to assume has deserted his military outfit and is now dirty, hungry and cold as he evades German patrols. Things change drastically for Herold when he stumbles on an abandoned suitcase neatly packed with a German Captain's coat and full uniform. We are left to wonder what happened to the officer, but do get to watch Willi's crazy next few days as he impersonates a German officer and assumes command of his situation.<br><br>Circumstances result in \"Captain\" Herold gaining followers, each of whom are as lost or unwilling to continue fighting as himself. The ragtag group ends up at prison camp Aschendorfermoor ... a camp containing German deserters and looters. Herold has convinced those in charge that he has direct orders from Hitler to take command of the camp, and a horrific massacre of prisoners takes place over the next few days.<br><br>While this is a stunning story ripped from historical documents, the film works even better as a psychological character study. Herold first employs his newfound power as a survival strategy, but he is soon corrupted by the power of his assumed position. We witness as some blindly follow orders, and we watch (dumbfounded) as Herold's thirst for power overtakes whatever integrity he might have had prior to the desperation injected by war. <br><br>The film moves at a meticulous pace and at times feels redundant. It could have been a stellar short film, but director Schwentke uses the slow pace to allow our shock to grow as Herold evolves into a coy monster (with a fine performance from Mr. Hubacher). Filmed in stark black and white, it offers some beautiful shots from cinematographer Florian Ballhaus (THE DEVIL WEARS PRADA), the son of famed cinematographer and 3 time Oscar nominee Michael Ballhaus (GANGS OF NEW YORK). The elder Ballhaus passed away in 2017, and the son continues to build his own legacy. Set in Germany during April 1945, this blend of docudrama and black comedy is a collaboration of German, Poland and France, and as a true story, packs quite a punch.","user":"ferguson-6","rank":[54,65]}]