[{"title":"some dead ends along the journey","rating":6,"date":"19 July 2018","review":"Greetings again from the darkness. Those of us in the United States have always loved a rags-to-riches success story ... it's the personification of the American Dream. The only thing we seem to enjoy more is tearing down the pedestals that we build for those folks, and then ripping apart their legacy. Acclaimed director Eugene Jarecki (WHY WE FIGHT, 2005) strains rigorously in his attempts to connect Elvis Presley selling out his talent for money with the transformation of the U.S. from a democracy to a crumbling capitalistic empire (likened to ancient Rome). The really interesting thing is that the film, despite being a staccato mess, is quite fascinating.<br><br>Director Jarecki's gimmick here is that he is taking a musical and historic road trip in the 1963 Rolls Royce once owned by Elvis. Along the way, he picks up passengers - some of which are musicians who perform in the backseat. The passenger list includes James Carville, John Hiatt, M Ward, Linda Thompson (ex-girlfriend of Elvis), Immortal Technique, and \"best friend\" Jerry Schilling (a comical description if you've read his book). <br><br>Chuck D from Public Enemy is interviewed due to his famous lyric: \"Elvis was a hero to most, but he never meant s**t to me\". The contradictions from this interview fit nicely with the contradictions throughout the film. George Klein takes Jarecki on a quick tour of Humes High School, and Ashton Kutcher babbles about fame - though he makes one spot on remark regarding the prison of fame, something much of the film seems to ignore. Producer Ethan Hawke spends a good amount of time on camera and in the front seat, while author and activist Van Jones seems narrowly focused on cultural appropriation and angry that Elvis never used his clout to help the minorities that influenced him.<br><br>Filmed in 2016, the film works hard to include the Presidential election, and we even see the sanctimonious Alec Baldwin adamantly proclaiming that Trump won't win. Jarecki is himself an activist, and here he stretches to prove his points - tying together everything from Elvis' induction into the Army to the Trump election more than a half-century later (and 40 years after his death). \nThe road trip kicks off in Elvis' birthplace of Tupelo, where we meet some locals who talk about the lasting impact of Elvis on their town - a town still drenched in poverty. Memphis is next, and we hear about the 3 local kings: BB, Elvis and MLK. Jarecki even inserts a shot of the Rolls next to the Lorraine Motel. There is a terrific bit with the students from Stax Music Academy who perform \"Chain of Fools\" in the backseat. We then head to NYC and Nashville, capping off the musically creative portion of Elvis' career. Next up is Hollywood, Hawaii, and finally Las Vegas. <br><br>At times, the film is just flat out weird. One segment force feeds parallels with the 1933 King Kong movie (yes, really), then Elvis as a tourist, and finally, Dan Rather's all too familiar voice performing \"America the Beautiful\" ... each piece featuring the Empire State Building. But just when a Bernie Sanders rally makes you want to turn off the film, we get an insightful Mike Myers effectively pointing out the hypocrisy of the American Dream as sold by the government, or David Simon questioning the choice of the Rolls over one of Elvis' prized Cadillacs, or Sam Phillips' (Sun Records) son re-telling the story of how his father lost Elvis to the carnival-barker Colonel Tom Parker (neither a Colonel nor a Parker).<br><br>Jarecki and co-writer Christopher St. John try to weave a tapestry of fame and money with cultural and societal shifts. Some segments work, while others fall flat. The editing of talking heads sometimes gives the feel of a debate, but often the scattered and choppy film meanders through multiple messages whilst driving the backroads of the country. We get clips of Elvis on the Ed Sullivan Show and getting his famous locks sheared in the Army, and the 1968 comeback special; however, there is little mention of Priscilla, Lisa Marie or Graceland. <br><br>Judging Elvis for money grab without seeming to take into account his young age (he was 21 when he first appeared on Sullivan, and 23 at his Army induction) and his extreme poverty of youth, much less the power of his domineering agent, seems to be harsh judgement in an era that had never seen such media giants as the Kardashians or Justin Bieber. When Jarecki's road chief admits, \"I don't know what the hell you're doing\" (when Jarecki asks him what he thinks he's doing with the movie), it's the first time we can actually relate to what someone has said. Despite all of that, you'll likely be glued to the screen for the full run time - either enjoying the songs, watching the clips, or trying to see if Jarecki's puzzle pieces even fit together.","user":"ferguson-6","rank":[21,23]},{"title":"\"He had it all, and he had more of it than anybody.\"","rating":1,"date":"12 March 2019","review":"You pick up a copy of \"The King\", knowing that it's about Elvis Presley, and you expect a warmhearted tribute to one of the pioneers of early rock n' roll. What you get instead is a scathing indictment of America and what was once considered admirable, the pursuit of the American Dream. For example, did you know that Elvis Presley was at the center of America's cultural, military and economic imperialism? That's according to self proclaimed Communist and CNN contributor Van Jones, one of the names interviewed for this rolling look at director Eugene Jarecki's twisted view of the music icon. In it's own way, the film does nothing less than bash the legacy of Elvis Presley, accusing the singer of cultural appropriation for bringing gospel and blues to the forefront of America's musical tastes. Personally, if Elvis had even one percent of the things on his mind that he's alleged to have had in this picture, I'd be incredibly stunned. With a host of left leaning commentators like Jones, James Carville, rapper Chuck D, Dan Rather, Mike Myers and Ethan Hawke, there's no doubt that the narrative is agenda driven to rewrite the legacy of the King of Rock n' Roll. Actor Hawke was particularly acerbic in his personal comments about Presley, whereas most of the others engaged in talking points about America's history of racism and exclusion. I had all I could do to make it to the end of the picture while firmly grasping the arms of the chair I was sitting in, but to be fair, I maintained self control in order to give the picture it's due. For potential viewers, this is peripherally about Elvis Presley, with a smattering of music and clips of the singer you might not have seen before. You might pick up a thing or two you didn't know before, and a lot more propaganda than you bargained for.","user":"classicsoncall","rank":[5,5]},{"title":"A dense and impactful Documentary, but stretches the concept too much","rating":2,"date":"2 July 2018","review":"Unorthodox documentary not so much \"about\" Elvis Presley, but about how Elvis affected --and was affected by -- American culture. The gimmick Director Eugene Jarecki employs is that he purchased Elvis' actual Rolls Royce, and then films interviews of a wide variety of folks in that vehicle as it travels across the places that Elvis himself stayed at various points in his life, from his hometown in Tupelo Mississippi to Memphis (although, curiously, Graceland is barely mentioned) and places in between. <br><br>Even though Jarecki doesn't give us a straightforward biography of Presley, THE KING does a pretty fine job of covering the bases, even if indirectly. The most effective part of the Doc comes early on in a discussion of whether Elvis was a cultural appropriator of black music, culminating in his early crowning as The King Of Rock And Roll. The movie gives a fair-minded balance of pro and con with people like Presley's guitarist Scotty Moore, Emmylou Harris and John Hiatt on one side and rapper Chuck D on the other (he, of the infamous song lyric: \"Elvis was a hero to most. But he never meant **** to me you see.\"). There's also a clip of Big Mama Thornton's blistering original version of \"Hound Dog\". Jarecki then follows Elvis' travels to NYC and even bigger fame and riches. Then, it's off to the Army and Presley's decline into B movies and Vegas schmaltz. The clips of 'fat Elvis' at the end are truly shocking even all these decades later. <br><br>Where Jarecki over-reaches is that he isn't satisfied just showing Elvis' effect on the public, but then tries to tie it in with today's culture wars. Shot during the 2016 campaign with such guests as Alec Baldwin, Van Jones and James Carville, Jarecki makes tenuous connections. VERY tenuous connections. No question that Elvis was a seismic force when he hit, but, save for the brief glory period after the '68 Comeback Special, Presley can hardly be looked upon as a central artistic force after the very early 60s. While significant figures can certainly have a long influence, the fact that Elvis passed on in 1977 makes it a stretch to say that he is symbol of our Red-Blue state America today. If anything, Elvis is the very definition of 'Purple' celebrity - equally loved by all demos. <br><br>Even with this central flaw, there is no question that THE KING is a dense, engaging Documentary. One can't help but feel that they have gone on some sort of journey itself, much like Elvis's well-traveled Rolls itself.","user":"gortx","rank":[12,15]}]