[{"title":"Virtually everything about this film screams idiotic.","rating":2,"date":"28 May 2019","review":"The Intruder is about a man played by Dennis Quaid who sells his house to a young married couple. The only problem is that the man selling the house has a serious obsession over it.<br><br>I went to this movie during opening weekend, and I was the only one in the theater. I don't think that it has everything to do with the fact tha Avengers: Endgame came out the weekend before because after watching it, I can see why. This is one of the worst movies I have seen in a while.<br><br>A big problem with this movie is that it's filled with several sub-plots that go absolutely nowhere and bring it to a screeching halt on multiple occasions. There are, for example, several points in the film that test the relationship of said married couple, and a few minutes later, the tension drops immediately, making it feel absolutely pointless. There's also a sub-plot involving the male lead who is against gun use, which is hardly foused on, which also makes it feel pointless up until the climax. I could point to other examples, but that would just drag the review.<br><br>My biggest issue with the film, however, has to be that the main characters are total idiots. They make so many choices that make me question their sanity. For example, when Quaid's character shows up frequently, which makes the male lead uncomfortable, he tells himself to call the cops, and never does. There are moments like that plagued all over the film that made me want to scream at the screen, and I should've, considering that I was the only one here. The female lead, in particular was absolutely atrocious, as she's easily manipulated by Quaid's character throughout nearly the entire film, and she doesn't question his motives. I don't want to get into spoilers, but there were so many instances where she could've thought about the fiasco with the former house owner.<br><br>The only thing that saves this movie from being considered a 1 for me is Quaid's performance as the former house owner. He does a fantastic job with what he is given to work with as the villain of this film. He comes off as discomforting, creepy and psychotic, which is exactly what I would expect from a character like this. He's the best part of the movie by a landslide.<br><br>Aside from Dennis Quaid, The Intruder was plain awful. This film is filled with so many unnecessary plot points and stupid moments that it made the movegoing experience harrowing for me.<br><br>2/10","user":"eparazak","rank":[95,129]},{"title":"Disappointing","rating":4,"date":"24 June 2019","review":"It started off being promising . Then it became a cliche and very predictable . Then end scene was very clumsy and it seemed as though the director just wanted to get the movie over with . Maybe he didn't want to go over budget .<br><br>Some scenes were just plonked in and didn't flow in the movie . And didn't need to be in there ! It was like to fulfil the cliche 'this and that ' had to be in the movie , so they dumped it in!<br><br>Dennis Quad's acting was great at the beginning , even in the middle part he was good , but then suddenly he started overacting . Why? It's much creepier when an actor is silent and works with his eyes and slow movements, instead of overplaying the role. Quad looked ridiculous in the final scene<br><br>The final 5 seconds at the end was good.","user":"honeybloggs-69648","rank":[44,58]},{"title":"you already know the ending","rating":4,"date":"3 August 2019","review":"Just looks awful even though Dennis Quaid was believable as the psycho, I didn't care for M Good's character. So dumb and naive she was, which made me mad her character was so naive that it began to annoy me a bit. Annie \"the wife\" has to be one of the DUMBEST characters I ever seen in a movie. She was dumber than a blonde bimbo in a Friday the 13th movie. Never seen Dennis Quaid in a role like this before. Sorry to say it sucked. It was long, and slow, I am all for black leads in a film but we have to stop making this trash. Stop supporting it. And demanding better written/ directed material. This movie belong in the 90s. Snooze. Sad that Dennis Quaid is wasting his talents in movies like this","user":"MajidMsa","rank":[32,41]}]