[{"title":"Excellent Movie!","rating":10,"date":"5 August 2018","review":"Just saw it on Netflix, really good movie, everything was done well, script, acting, effects, locations, direction and cinematography. 10/10. Please keep making more motion pictures like this! <br><br>If you like this, you'd probably also like Bad Guys Vile City (over the top violence, but good story and acting) and Stranger (Secret Forest) on Netflix. The only issue I have is having to pause and go back sometimes to read the dialogue. Netflix only has Korean (of course) and Spanish SAP, no English.","user":"adobepro","rank":[11,11]},{"title":"Steel Rain Review: A masterfully crafted action film definitely worth watching!","rating":9,"date":"15 March 2018","review":"Movie: Steel Rain (15): Action - Korean<br><br>Positives:<br><br><ul><li>The performances of the two lead actors Jung Woo-sung and Kwak Do-won are excellent, and the relation they form is a delight to watch.</li><li>The visual and technical aspects of the film are top notch.</li><li>The action scenes are shot and executed very well.</li><li>The emotional aspect of the film has been dealt with very well.</li><li>The film is very gripping thanks to the excellent story and crisp editing.</li></ul><br><br>Negatives:<br><br><ul><li>The film could've been slightly shorter.</li></ul><br><br>Repeat value: Yes<br><br>Undoubtedly, STEEL RAIN is a masterfully crafted action film which is a must watch for all!","user":"Prashast_Singh","rank":[22,25]},{"title":"Thumbs Up","rating":7,"date":"18 March 2018","review":"I really enjoyed this film. The first five minutes looked cheesy and I had no idea what was going on. I almost quit the film but after reading other reviews I kept with it. I'm glad I did because suddenly a very good film appeared. Allow me to just explain the opening (no spoilers). A military coup happens in North Korea. The coup leaders fake an American attack from South Korea that kills many North Koreans. Meanwhile, at the same time, our north Korean hero saves Kim Jong-un and takes him to the South. Then the film starts to get good. He meets a South Korean hero and I'll stop there! What I liked about this film was, it's an interesting look at how all sides would act should a military coup happen in the north. Anyway, thumbs up","user":"thekingsdom","rank":[19,22]}]