[{"title":"I can only suspend my disbelief so much until I walk away. (SPOILERS)","rating":5,"date":"1 May 2018","review":"Exactly like my subject. I don't buy it from a quarter of the movie on. No one would survive being impaled like that. And if they did they wouldn't be able to walk across the desert for miles IN THE SUN, BAREFOOT! C'mon! I get it. It's an extreme revenge flick but there are so many REALLY unbelievable things that just don't work.<br><br>Good things about the film. It's filmed beautifully. The sound and soundtrack are great. The acting, ok. <br><br>I wasn't expecting perfection but I just can't buy into it.","user":"xxmelmothx","rank":[216,302]},{"title":"Asks way too much of you","rating":5,"date":"13 May 2018","review":"I know sometimes with revenge films you have to suspend your belief somewhat, ignore little things here and there because you just wanna see this person be vindicated, but this film is just a little too outrageous.<br><br>We're supposed to believe this woman freed herself from an impaling by lighting the tree on fire? Then under the influence of a drug that renders her painless, she heals her wound shut basically, walks around the desert heat barefoot and kills everyone. And the last guy standing also is superhuman. He gets blasted to the stomach with a rifle, wraps himself in plastic wrap and walks around the house in circles like nothing lol <br><br>If it was a little more grounded then it would've been more enjoyable.","user":"johnnyutah31","rank":[141,199]},{"title":"Ridiculous, stupid, dumb, brilliant.","rating":8,"date":"7 August 2018","review":"Ridiculous, Stupid, dumb, unbelievable, but somehow brilliant at the same time. <br><br>Lutz is smoking hot, with a peach of a butt(that line is in the movie, honest), but thats not even the best thing about her. She strangely convinces as the part of bimbo come rambo.<br><br>Sure they lose gallons of blood and keep on going, sure sustain wounds that would down a Rhino but they keep going, but have you seen \"The Punisher\" and that has a high rating.<br><br>Yes its very bloody, sometimes gory, sometimes stupidly unbelievable, but as long as you dont take it as a Michael Crichton novel, and you dont mind the blood and gore, you might just like it.","user":"merpman-94402","rank":[99,138]}]