[{"title":"Not quite worth the effort...","rating":3,"date":"19 October 2019","review":"They should have stopped after the first movie. Whereas the 2013 movie \"Escape Plan\" was actually good, the 2018 sequel \"Escape Plan 2: Hades\" and now the 2019 \"Escape Plan: The Extractors\" have been abysmal, to put it bluntly.<br><br>The storyline in \"Escape Plan: The Extractors\" was just pointless, and it even seemed that none of the cast actually bought into the plot, script and storyline here either. Just what were writers Miles Chapman and John Herzfeld thinking here? How did this script actually make it to become a movie?<br><br>The movie is monotonous, and that is actually putting it mildly. There is no adrenaline kicks throughout the movie, and it quickly settled into a boring trot and never got out of that mundane gutter. Yet, I managed to endure the ordeal, as this is a Sylvester Stallone movie after all. Not one of his best movies, not even by a longshot.<br><br>It was actually Devon Sawa whom carried the movie here with his performance, as he was the one that had the most screen time, the most energy and the most on-screen presence, whereas the likes of Sylvester Stallone, Dave Bautista and Jin Zhang were just autopiloting their way through this movie at the hands of director John Herzfeld.<br><br>\"Escape Plan: The Extractors\" not only lacked a proper storyline, it also lacked character motivation and the ability to engage the audience. The entire movie just felt like a copy/paste job quickly put together for the sake of cashing in on the franchise before it is too late.<br><br>By skipping out on watching \"Escape Plan: The Extractors\" you will not be missing anything vital to the franchise. This 2019 movie wasn't really worth the time or money invested into it. As such, my rating for it is a mere three out of ten stars.","user":"paul_haakonsen","rank":[15,17]},{"title":"Deserves better than 4.3/10","rating":7,"date":"13 July 2019","review":"This wasnt that bad. It was a basic formula. Cheesy. But it was entertaining and a good way to kill a bit of time. Turn your mind off and watch for fun.","user":"barbell_28","rank":[33,43]},{"title":"Better than the second, not as good as the first.","rating":7,"date":"21 June 2019","review":"When the first one made 25 million in the US, but a further $75 million in China, it makes sense that it got Chinese backing for sequels and the producers took the money and ran. Whilst the second one used Stallone and Batista for a poster and credit only to suck you in, it was a vehicle for Asian market with Asian stars. With a more competent direct on John Herzfeld on the third, there's a noted improvement. First Stallone gets about 40 minutes of screen time, whilst he barely got 10 minutes in the second one, there's still great fights for Max Zhang to shine, but Stallone gets more to do here, 50 cent is in it for 2 minutes (always a bonus) and Bautista is the Terry Crews of Expendables, big guy with the big gun, gets a few minutes to shine. HIghights include the career resurgence of Martial Arts Action Star Daniel Bernhardt gets a great end fight with Max Zhang and Stallone gets brutal with Devon Sawa 90s heartthrob from the Final Destination movies. Overall, a vast improvement on number 2, nowhere near as good as the original, but we get fights, we get blood and we get Stallone kicking but here and there. It's easy to see why he's established Balboa Pictures in his twilight years and doesnt want to get caught doing these sequels and Backtrace style films for a quick payday. He cares more about his career than a Cage or Travolta or Bruce Willis at this point and doesnt want to do this for the pay cheque. Overall, starts bad and gets better and ends well. Worth a watch and support with your purchase.","user":"dandelts76","rank":[86,127]}]