[{"title":"My honest review = outstanding! Ignore the haters and wannabe critics!","rating":9,"date":"29 December 2018","review":"If anyone questions this review, click on my name and you will see my over 530 reviews, not just this one review.<br><br>This film was surprisingly outstanding, and something today's society needs to see.<br><br>For starters, it is something fresh. Then I give the highest props to both joint writer and directors Abby Kohn and Marc Silverstein, of which this is only their 2nd film directing (1st being a short) and they nailed it. I never would have guessed this was directed by 2 novice directors. Also as seasoned writers, this one is a winner for me.<br><br>This film had everything, a great story - and message- for current social issues, comedy, and romance. It was 100% pure entertainment. All these whiners complaining it's predictable... so what? So is a roller coaster ride, and I still go on it over and over, because it's entertaining and I enjoy it. What level of moron does one have to be to nitpick apart or psychoanalyze a comedy anyway??<br><br>I am shocked and appalled at all these haters and wannabe critics slamming this film, and especially at those who gave this an undeserving 1, 2, 3, 4 or 5! There are so many garbage films out these days - bad writing, directing, casting, acting and lame humor that have higher scores than this film and it makes me shake my head.<br><br>This film made me laugh - literally out loud, more than any other comedy this year, and almost cry. Sure maybe it was cheesy, but is was LMAO cheesy, and we have Amy Schumer to thank for that. I will admit, I'm not the biggest Amy Schumer fan, but she simply just nailed her role in this film - and probably her best performance to date, and I can't think of anyone else that could have been cast better for this role. Mad props to Amy Schumer as she now has my full respect and I am a fan!<br><br>Everyone in this film was cast perfectly, from Emily Ratajkowski who also nailed her role and was perfectly cast for it, to the basement computer guy Adrian Martinez.<br><br>The pacing was perfect as was the length. For me, this film was near perfection. Ignore the haters and wannabe critics and watch this fun and entertaining film, you will not regret it, and I'll bet you'll be just as surprised as I am!<br><br>Will certainly recommend and watch again. A very well deserved 9/10 fun ride from me!","user":"TheTopDawgCritic","rank":[134,198]},{"title":"What The Hell?","rating":10,"date":"30 April 2018","review":"Surprised to see how low the rating is for this movie. I went to see this movie when I felt like giving up on life in the hope that it would help me feel better and it did. After watching I Feel Pretty I realized it's not about what happens in my life, but how I see it. Wonderful movie I love it","user":"Mesayon","rank":[453,801]},{"title":"It doesn't try to be anything that it isn't. And that's kinda the point.","rating":8,"date":"20 April 2018","review":"You're going to see a lot of reviews on here say that it's predictable, silly, probably a few other criticisms that are perfectly fair. But this movie knows what it is, and the authenticity makes it enjoyable. It has a genuinely sweet romance, great comedic moments, and good messages. It's a silly romcom with a lot of charm and heart, and it's worth a couple hours of your time. Give it a chance.","user":"valarik564","rank":[397,721]}]