[{"title":"I'm not him","rating":3,"date":"17 December 2018","review":"There is nothing like a drug-crime-action film involving an aging British boy band. Okay, there is, it is called root canal.<br><br>A drug called Venom is being smuggled into the country. Cameo role Tom Sizemore didn't get the drug after he paid 3 million pounds. D5 boy band leader, Donnie Martin (Luke White) is the suspect. He is kidnapped by the bad guys and drugged and smacked around for the money/drugs. Then we get an odd backstory described in the film blurb. It seems the real Donnie Martin died in a car accident and this guy is an imposter who knows nothing.<br><br>Bai Ling was in the film less than Tom Sizemore. The movie was bad, but like a train wreck, it was hard to turn away. For some reason, it held my interest without being overly entertaining.<br><br>Guide: F-word. sex. no nudity.","user":"nogodnomasters","rank":[6,7]},{"title":"So bad you just have to watch it!","rating":3,"date":"9 December 2018","review":"From the DEA mini vans to the grossly overweight underwear models... this film is a disaster. I haven't listened to such bad dialog since...well, since never. Who ever wrote this and had the balls to submit it to a studio has got to be applauded for shear chutzpah. Sadly, its the only applause Dead Ringer will get.","user":"savior-11","rank":[6,9]},{"title":"Not too shabby!","rating":7,"date":"6 December 2018","review":"I'm a fan of Tom Sizemore and it was good to see him in this film, albeit a small role, but newcomer Luke White was impressive. The other actors were also decent, although some a little over the top, and the actresses were very easy on the eyes. This is Richard Colton's second film ever directed, and he did a great job with the camera, although he could've directed some of the cast a little better. Not sure who wrote this, it's an excellent story premise, but the screenplay needed some fine tuning with the plot issues, especially towards the end. The pacing was a little slow and the film needed to be trimmed down by about 10-20 mins, but nevertheless it kept my attention. The (boy band) soundtrack was also a little too much in the beginning. Nevertheless an enjoyable B-grade UK action/drama flick. Not worth the 9 and 10/10 previous 4 fake reviews, but worthy of an honest 7/10","user":"TheTopDawgCritic","rank":[13,24]}]