[{"title":"A failure at trying to capture the spirit of the original.","rating":3,"date":"6 November 2019","review":"TL:DR- You know when you're with your friends and want to watch a horrible movie just to make fun of it? This movie is for you.<br><br>When I saw the title on Netflix a few hours ago, I thought I was seeing things. The first Undercover Brother was a huge part of my teen years. While it was low budget and campy, it was at least genuinely funny. I don't know if it's the lack of A-listers or poorly written social commentary, but this film just misses. Honestly I only finished it to write this review.<br><br>Undercover Brother has returned to the hood from years of fighting The Man. He meets up with his younger brother, who he feels has become a punk in his absence, and proceeds to do a training montage with him to make him better. He and his younger brother are frozen for 16 years in an avalanche in Austria while trying to track down The Man. Undercover Brother's younger brother wakes up first and convinces the new Chief of the Brotherhood to let him join to get revenge on The Man for causing the avalanche to kill them, and to stop The Man's most recent evil plans. Without giving any spoilers, what ensues is a crazy show of poorly done commentary on our current social climate with spattered callbacks to the original Undercover Brother.<br><br>Not to say that there aren't interesting concepts and funny moments. Terrible as I thought it was, I laughed at a few parts and even thought the twist wasn't too bad if it had been a better executed movie. But make no mistake, any true fans of the original UB who actually make it through this whole film will find it to be cringeworthy, random, and honestly kind of boring.<br><br>The film is also low budget and campy, but this story is poorly written and poorly but together. It seems like a collection of random scenes that a fanboy/girl of the original might have written down were strung together to make a movie. The original UB was quippy and intelligent in its social commentary, but this film simply mocked current social climates in a few monologues without offering much else for us to think about or laugh at.<br><br>Now for perspective I personally am black myself, and I would really rather not rain on anybody's parade. But this is a movie review :/ And I'll say this is one of those films that, for a real fan of the original UB, probably isn't worth watching even once.","user":"bowen101-160-829536","rank":[21,26]},{"title":"Not funny without Eddie Griffin","rating":1,"date":"12 November 2019","review":"This movie is no good in comparison to the original one with Eddie Griffin ( a real comedian who is hilarious ).\nIt is a sacrilege! 😪","user":"mariomont-50181","rank":[8,9]},{"title":"Say What?","rating":1,"date":"7 November 2019","review":"These people did not even try. If it was me that financed this trash we would be in litigation right now.","user":"busaman","rank":[12,16]}]