[{"title":"Enjoyable enough but hardly hitting all the notes, this film would serve as good entertainment if you don't need to keep track of what's actually happening","rating":9,"date":"9 December 2017","review":"There are a few stalwarts in the Hong Kong movie industry, and two of them are in this film.<br><br>Tsui Hark's hand in creating commercial cinema during the \"Golden Age\" is legendary. Both entertaining and original, his classics such as A Better Tomorrow, A Chinese Ghost Story and Green Snake have all been milestones of any Gen X's cinema experience.<br><br>Yuan Wo Ping is the other heavyweight, and is renowned for his martial arts choreography in Crouching Tiger, Hidden Dragon, Kill Bill, Ip Man and the Matrix trilogy. His innovative sequences rejuvenated the genre, keeping audiences riveted with his fresh treatments.<br><br>The Thousand Faces of Dunjia sees them as producer and director respectively, so expectations can hardly be faulted. The scale doesn't disappoint because we transcend both galactively and spiritually spheres, but the storyline feels fragmented and occasionally aimless, and I think I know why. The fantasy action flick seems firmly handled with the F word in mind - I'm talking Franchise.<br><br>Let me first lay it out there - there is a sequel planned for this movie. That said, the film does provide closure with part one.<br><br>Dao Yichang (Aarif Lee) is the village's newest constable. The motivated young man, thick-browed and sharp jawed doesn't always play by the rules, but always does the right thing in the end. While fighting a criminal-turned-demon one day, he gets tangled up with Iron Dragonfly (Ni Ni), who subdues the imp and brings it back to her clan.<br><br>Turns out that an unspeakable evil force is gathering, and already demons both trapped in the earth and comets are emerging to prepare for its arrival. While this is happening, Dragonfly's Wuyinmen clan hunts for their new leader, and clansman Zhuge Fengyun (Da Peng) sees hope in the form of Xiao Yuan (Zhou Dong Yu), a child-like waif locked up in a prison for an incurable disease. This flimsy urchin turns out (expectedly) to be their potential salvation.<br><br>While the film has lofty goals, featuring stunning sets and a plethora of characters, it's not something that impresses all that much.<br><br>First of all, the plot feels like its setting up too much for the sequel, with story nuggets dropped but never picked up. Even when it does, such as the painting or the powerful sword, questions are still left unanswered. All this might be considered a purposeful cliffhanger, but it's only a metre drop down. Without background or context, the tidbits answered with more jargon just leaves the audience uninvested in what's coming. Maybe if Hark and Yuan had spent more time in fleshing out the story than focusing on distractions like piddling jokes or abrupt titles, The Thousand Faces of Dunjia would have had a better chance at being exceptional.<br><br>There's also the matter of - the effects. CGI has come a long way, and even though Asian cinema has always struggled, in The Thousand Faces of Dunjia it's like the whole team gave up. The renderings are so awkward with the scenes they are in, you never obtain the full wonder it's meant to deliver. Blasphemously, they also ruined a lot of great action sequences. Half blocked by water serpents masquerading as blows, or fuzzy discs that spin so fast you can barely see what's the damage, the impact meant to be delivered landed like an apology from SMRT - unbelievable and detached.<br><br>I will say the production design is still as gorgeous as ever, and the colours are trademark Tsui. Lush and romantic, it will no doubt still engage the visual senses. The actors also do a decent job of filling up their personas, though Lee and Da Peng do stand out for their natural performances.<br><br>Hark's recent repertoire have received more box office success than critical acclaim, and it would seem that The Thousand Faces of Dunjia would continue that streak.","user":"moviexclusive","rank":[17,21]},{"title":"Long movie and the story line is not easy to grasp","rating":5,"date":"12 March 2019","review":"I know i won't watch it again. I don't want to sit through this again.\nThe story is all over the place. I can't figure out the story line.","user":"juzerjk","rank":[3,3]},{"title":"Three Eyed Purple People Eater","rating":8,"date":"31 July 2018","review":"Yes, it's mostly a fantasy CGI green screen wire rope flying/jumping sequence after sequence film which can get really tiresome because theses movies have been done so many times, but I thought they did a quality job on all those elements including a bit of historical Chinese myth as plot backdrop. The three eyed toothy fish was hilarious. Acting was good. Entertaining as any to be found in this Chinese genre.","user":"westsideschl","rank":[3,3]}]