[{"title":"It's what you expect it to be","rating":7,"date":"4 December 2018","review":"You go into watching a film like this generally knowing what to expect. It's not great art but, for a teen dance film, it's enjoyable.<br><br>Hip-hop dancer Fabian Svegaard Tapia is a terrific dancer and, I have to say, doesn't do a bad job on the acting either. On top of that he's very very easy on the eyes, with a pleasant amount of charisma and intensity about him. Lisa Tiege isn't dreadful either. They do have a good chemistry and their final dance scene together I found very expressive and intense, aided by a really good song, haunting with great lyrics (Youth by Daughter).<br><br>All-in-all I enjoyed it. but then I'm a bit of a closet teen romance kind of woman; perhaps I never grew out of the brat pack phase despite my advancing years! Throw in some good dancing and I'm content.","user":"alison1963","rank":[27,29]},{"title":"These kind of movies never really get good ratings, but...","rating":7,"date":"2 December 2018","review":"I think theyre exactly what they should be. They make you feel stuff, they make you cringe and they make you smile. Thats what these kind of movies are supposed to be for me.\nAnd Battle did the job well. I do not expect a masterpiece in storytelling and visuals in these kind of movies. Yes it could've been done better, but it did what it had to for me to recieve the 7 star rating. Well done.","user":"aarongnr","rank":[25,29]},{"title":"It was exactly as I expected it to be!","rating":7,"date":"6 December 2018","review":"It tells the story of a modern dancer, when her father went bankrupt, her life changes completely. Then she meets a hip-hop dancer who helps her discover who is she.<br><br>This is a Netflix original movie, and it's my first time watching a Norwegian film. It was a good experience.<br><br>The movie was great, I did love it, and especially the relationship between Mikael ans Amalie, hence it was a predictable one, but it was so passionate.<br><br>The acting was pretty good, the dancing was enjoyable.<br><br>Well, I know it's a typical romance-dance-teen movie, but I loved it anyways.<br><br>I do recommend it, you should give it a try!","user":"Cheer_amee","rank":[15,17]}]