[{"title":"Touching and hearfelt movie","rating":20,"date":"20 March 2018","review":"This movie really surprised me. I understand some challenges can arise when working with younger talent, not the case for this picture. These young actors shined. The story was wonderfully written and the picture was put together well. The lead Aphrodita Nikolovski was excellent; as was young actress Calhoun Koenig. <br><br>Harley Wallen made a warm and special movie. Congrsts to the cast and crew.","user":"ShaneHagedorn","rank":[12,19]},{"title":"Refreshing Feed Good Mocie","rating":10,"date":"19 December 2018","review":"A not so ordinary family film, tackling acceptance, diversity, a love story, being deaf and it's challenges not to mention music and dance! Oh and having genuine challenges of overcoming..<br><br>I see some of the other reviews and wonder how on earth they missed it but then again some people have an agenda...<br><br>What I really love is it's ability to do so and still touch such a wide audience. I saw it in theaters and saw men cry and people hug and parking lot conversations about life after.<br><br>If you like a little romance, a bit of comedy and some drama set in a big family setting, you'll likely like the movie!","user":"harleytheswede","rank":[2,5]},{"title":"Like watching a trainwreck","rating":6,"date":"5 May 2019","review":"This is one of those movies that sucks you in. The direction, writing, acting, and elements like art direction are all over the place. My wife and I almost bailed about 20 minutes into the film.<br><br>The quirky characters, and basically a good story kept us in. At times a scene would work, and work well and then the next scene would be a disaster with over the top writing, a lack of direction and non-existent acting.<br><br>There are fact dumps, over the top PC moments, a very scary post plastic Tara Reid, a PC Dennis Haskins are some of the negatives, yet the chemistry with some of the children, and story line make parts of this movie work.<br><br>I've seen this reviewed as a romantic dramady which is about right.<br><br>If you like a character driven movie, with some interesting characters you might like this movie.","user":"intelliprompt","rank":[1,2]}]