[{"title":"A Brilliant Wuxia Film","rating":9,"date":"4 May 2019","review":"I've always loved foreign cinema, especially the Asian culture; it's so diverse and unique that one could spend years and years studying and still barely scratch the surface. The history is vast and rich, and the films of Asian cinema always bring that to light. There's something about the craftmanship of such films that just feels so much more visceral and rewarding as compared to most American movies. And with Shadow we find director Zhang Yimou (\"Hero\", \"The Great Wall\") at his truest form, giving us his most visually satisfying, narratively complex, and action packed movie to date. The film does have a slow start, building the world that we're in and the characters and what their motives are. It's a layered narrative that requires a good bit of attention, each character giving meaning to the scene. Although the pacing is a tad off, it's always an absorbing watch due to the gorgeous cinematography, from the sweeping landscapes to the dense foggy atmosphere this movie just looks phenomenal. I found myself wanting the biggest screen possible to watch such a spectacle. There's a scene when opposing soldiers use their umbrella swords and twirl their way down a cobblestone street all the while firing their crossbows at the enemy, it's bonkers but it's so stylish and inventive. I thought I'd seen it all by now, but Shadow only goes to show there's probably a lot more to see. Overall Shadow is an exceptionally well made martial arts film, one that uses slow burn to a wonderful effect, never distancing itself from the viewer, but still able to build a strong hero and villain organically.","user":"truemythmedia","rank":[40,45]},{"title":"Every Frame is Beautiful","rating":10,"date":"26 September 2018","review":"During the Three Kingdoms 1,650 years ago, deception was often employed to survive in the high courts of kings. The war commander of one nation is nothing more than a shadow. His twin brother, the real talent, bides his time in the underworld until he can stage a coup and take revenge upon the king. Yet decoys assume a life of their own, and the shadow twin may take the power and possessions of the one he serves, but only if he is willing to strike and at the right moment. A love interest could provide all the motivation he needs, or perhaps all the distraction to cause him to fail and to be recognized for who he is.<br><br>There are many layers to this complex and resplendent film. Every frame is beautiful. Backgrounds are in bold black and white, with human figures providing the color. There is pulse quickening action, seductive romance, the eerily enchanting chords of the Chinese harp and ambient sound of rain and running water, wonderful dialogue, humor, history, yin and yang, intriguing stories, attractive people, fantastic acting and sword play, constant surprises, and more. Deng Shao plays both the shadow and the commander, and he does so brilliantly. North American premiere and the best film I saw at the 2018 Toronto International Film Festival.","user":"Raven-1969","rank":[82,103]},{"title":"cinema as an art","rating":10,"date":"30 September 2018","review":"I just watched this movie a few hours ago and i am still dizzy. \nThe lack of background colors and the almost constant rain add to the complex intrigue.\nUntil the end, one does not know where the director will take us.\nIt is beautifully crafted, the action is realistic, the acting is perfect. \nThis is another \"Chef d'oeuvre\" from Zhang Yimou. \nIt will be one of these few movies which I shall watch again.. and again, with the same pleasure","user":"contact-01618","rank":[61,77]}]