[{"title":"Beautifully filmed story that delivers a poignant message about protecting elephants","rating":10,"date":"23 April 2018","review":"Phoenix Wilder and the Great Elephant Adventure is a movie about an orphaned kid named Phoenix Wilder, who goes to a strange new country, South Africa, to live with his aunt and uncle. Phoenix then gets lost in the South African savannah and finds and rescues an elephant from a gang of elephant poachers. He becomes friends with the elephant as they are both looking for their families and, together they take down the elephant poaching gang. <br><br>I really enjoyed that they use real elephants in this movie. I kept wondering how they trained them. I also like that they found a way to not have a single gun being shot throughout the entire film. A few of the scenes look like things are going to get violent, but then they don't. The scenery in this movie is amazing. There is so much wildlife! When Phoenix is on safari with his uncle, some of the scenes we see through his camera are absolutely fabulous. This film really makes me want to go to the South African savannah.<br><br>The three main characters in this movie are Phoenix Wilder (Sam Ashe Arnold), the orphan that gets lost, Aunt Sarah (Elizabeth Hurley), Phoenix's new guardian and Uncle Jack (Tertius Meintjes) Sarah's husband. The movie switches between following Phoenix to following Uncle Jack and Aunt Sarah. Phoenix is trying to survive, save his elephant friend's family and find help. The others are trying to find him and get him back home. Other characters are Blake Von Stein (Louis Minnaar), the villain who is the leader of the elephant poachers and Col. Ibori (Hlomla Dandala), the army commander that helps Jack and Sarah find Phoenix and chase the poachers.<br><br>My favorite scene is when Phoenix uses the elephant to attack the poachers. This scene is very funny because the poachers are just hanging out at their camp when suddenly a boy (Phoenix), riding an elephant, jumps out and rips apart their camp. My favorite character is Phoenix because he shows that kids can do mature stuff. Phoenix shows his survival skills throughout the entire film. The message of this movie is that elephants should be protected because they are smart and beautiful creatures. Over 3,000 elephants are killed every year by poachers taking part in the illegal ivory trade. If this continues, they will become extinct. Another message that this film delivers is that kids can survive if they believe in themselves.<br><br>I rate this film 5 out of 5 stars and recommend it for ages 8 to 18. Younger kids might not understand the message of this film. I believe adults will like this movie too. <br><br>Reviewed by Damon F., KIDS FIRST! Film Critic. For more reviews by youth, visit kidsfirst dot org.","user":"rannynm","rank":[13,17]},{"title":"A Thanksgiving Surprise!","rating":9,"date":"28 November 2018","review":"We brought this home to watch as our Thanksgiving family film, everyone loved it! Even the cynical teenagers. How they got real elephant's to do all that amazes me. It was incredible to watch the elephants, they are the real stars here. 100% recommended!","user":"jeffalbine","rank":[4,4]},{"title":"An African Adventure....","rating":7,"date":"1 November 2018","review":"Overall a solid movie. Certainly no content that would be offensive to a young audience, I appreciate that. The elephants are the real stars and I enjoyed watching them very much. I can recommend this to parents and animals lovers of all ages.","user":"davidnorthcote","rank":[4,4]}]