[{"title":"Unblended cinema magic!","rating":8,"date":"21 February 2018","review":"This film drags you into the world of Pio, the main character, from the very first shot to the last, making you descend very slowly and blissful back onto your seat, long after the lights have gone on. Unblended cinema magic! You could feel the passion and heart that was put into this throughout; the filming took more than 90 days (wich is abnormally long) but this care and eagerness to bring Pio's world to life in a pure and enthralling way is reflected upon every scene. An important reason for this was probably the characters who felt delightfully authentic, not infected by hollywoodian handsome faces but (apparently the director also used real people from the area) real human faces of wich you simply couldn't doubt there truth and were going straight into your heart. Another decisive factor in the film's relish was beyond a doubt the dynamic and beautiful camera work, capturing the streets of South-Italy and it's powerful faces in warm colours and shifting it's close focus across the action. At the same time A Ciambra shifts your own focus upon Pio's social reality, offering you an absorbing and enriching window upon this poor region in Italy in the spirit of Italian neorealism.","user":"lukasserwir","rank":[11,12]},{"title":"The Gypsie life like we all think it is.","rating":7,"date":"1 August 2018","review":"A Ciambra is set in Calabria, a beautiful region of Italy, but that's not what you get to see. Instead you get to see the dark side of Gypsie life, the life we all think about when it comes to Gypsies. At least that's what I've always been told here in Europe, to not trust the Gypsies as they are raised thieving. I don't think there are much people thinking differently about Gypsies here and I don't think it will change after watching this movie. Because thieving and deceiving are the major points of this dark movie. I wonder what the Gypsies think about this movie? Are they proud of them being portrayed like that? In this case they used a real Gypsie family as the actors, almost playing themselves. The Amato's are not the kind of Hollywood actors we all know, without flaws, beautiful and tanned, but they are real and that makes this movie exceptionnal. Pio Amato is the youngest brother of the family, and the story turns around him, watching and learning how to provide for the family. Unfortunately that is by thieving. It looks like stealing is their only way to survive. For not so professional actors I thought they did a brilliant job. A Ciambra is a simple but good movie to watch, a drama that won't change the opinion most people have about Gypsie life I'm afraid.","user":"deloudelouvain","rank":[3,3]},{"title":"The first realistic film about Romani life","rating":8,"date":"16 July 2018","review":"Almost a sequel to American director Jonas Carpignanos' multi-prize winning \"Mediterraneo\", \"A Ciambra\" succeeds at something every European director has failed to do so far: To give a realistic, non-judgmental portrait of Romani life, in following 14-year-old Pio Amato's rapid coming-of-age process. Pio already appeared in \"Mediterraneo\", as did his refugee friend (Koudous Seihon), who was the principal character.<br><br>As you can tell from another review here, the attitude towards Sinti and Roma is to this day extremely racist and completely ignorant of the fact that they have been living in Italy for 600 years (Pio's surname is Sinti, i.e. his family has not migrated from the East). In Italian film, gypsies are always thieves and / or murderous psychopaths, \"Suburra\" and \"Jeeg Robot\" being the most notorious recent examples. By just reenacting Romani life, \"A Ciambra\" succeeds in showing how this racist exclusion of Roma (and refugees) creates exactly what it justifies itself with: a marginalized sub-society which perceives the law as hostile, and therefore resorts to crime as a means of survival and defiance. And in this dog-eats-dog world, family is both the only reliable safety net, and the biggest hindrance to an honest living - the film does a good job showing that.<br><br>If it's not a masterpiece, then because Carpignano adds nothing to this bleak outlook. There's not a shred of hope for Pio's future, and while this is realistic, it also doesn't give the audience much to work with.","user":"Radu_A","rank":[5,7]}]