[{"title":"Amazing ideas/poor follow through","rating":5,"date":"29 January 2019","review":"I love that Fox wanted to tackle something as complex as RENT.\nThe set, direction, art and costumes are all phenomenally done.\nThe band is GREAT.\nBut the casting of this musical...I just don't understand using \"up and comers\" who CANNOT sing over established stage vets who could rock the house down.\nCollins was amazing. Mark was great. Other than that...it's a hard pass from me on the cast. Valentina was AWFUL. Jesus. I get that she's \"hot\" right now, but she should not sing on stage. Can we get someone like Todrick? A guy who can pull off drag AND actually sing and dance.\nThis was a valiant attempt at doing something strong and provoking, but it fell tragically flat","user":"cameron-wst","rank":[13,15]},{"title":"Some Wins, Some Losses, but overall it was OK","rating":7,"date":"28 January 2019","review":"I'm such a purist with certain things and admit that change can be tough for me. Last night watching Rent Live was an interesting experience. It was great to hear music that I grew up on, it was great to watch characters reinterpreted, it was great to bear witness to this generations \"interpretations\" of what was a monumental show for its time and most of all it was great to critique it.<br><br>The Core Cast\nMarc - Jordan Fisher captured the essence of Marc, except for his overarching Jewishness and quirkiness. I had a hard time adjusting to this person cast as this character, but ultimately warmed up to him. He did, however, possess a bit too much swag for Marc, but overall his singing was on point. He nailed his choreo and lyrics in La Vie Boheme (more on that number later)\nRoger - Brennin Hunt's portrayal was absolutely, hands down best of this entire cast. His rawness, grittiness and pure \"rock\" was beautiful (not to mention his musicality on point...or fleek as today's kids would say).\nMimi - Tinashe was alright when solo - I wish he signing had a bit more \"oomph.\" She was quickly overshadowed by her cast mates, but her chemistry with Hunt was fantastic.\nMaureen - Vanessa Hudgens is my second favorite casted character. She slayed and delivered like some of the greatest Maureen's I've ever seen.\nJoanne - Kiersy Clemons was a great choice. Super powerful and what I'd expect from anyone cast as Joanne.\nAngel - Valentina was an utter disappointment. There are other words I'd like to use but shall refrain. But to say I was left appalled is an understatement. One of the most iconic drag characters in modern theatre was left gassed, off pitch and with no All Star quality I'd vote for.\nCollins - Brandon Dixon as Collins was my third favorite character. He brought his energy to Collins' character and chyle...he was good! His \"I'll Cover You\" reprise was easily up there with one of my top five performances of the night.\nBenny - Mario as Benny brought him to life. Not the best. Not the worst. He was acceptable. Too much of his usual lines seemed to have been cut.<br><br>Supporting Characters\nCy - played by Keala settle was a gender-flipped version of Paul. I missed his character although Keala delivered and brought life to her roles. While she absolutely came through, she is a bit too polished for this show at this point in her career. She needed to be a bit more raw and organic in her approach.\nGordon - meh.<br><br>Iconic Moments (That failed)<br><br><ul><li>The opening - the change in lyrics and softening of language is just not ok. It's ok to curse. Sometimes they provide the exact words needed.</li><li>It's Hicksville. It's always Hicksville that can't be taken out of the girl. Always.</li><li>I'll Cover You - thank the world for Dixon who carried an absolutely ghastly (and utterly gassed) Valentina.</li><li>La Vie boheme. So much was lost here. I was deeply saddened by the blatant omission of lyrics. I want my meatless balls and tofu dog platter.</li><li>Seasons of Love. There is something so simple about this song that was only accentuated by the humanity seen under spotlights...singing. Simplicity. This song was overdone and lost its feeling. Sad moment.</li><li>Contact - it was let down by the obvious issues I voiced above - but from my memory of each time I have seen this show this scene should be the juxtaposition of sex/masturbation/self-love with Angel dying. It's a terribly hard role to manage and portray and it was utterly lost.</li></ul><br><br>Moments that Stole the Show<br><br><ul><li>One Song Glory - thank you Brennin for delivering (even if it wasn't entirely \"live\")</li><li>Life Support - this was well done and thank you the staging for appropriately lighting up Roger; \"Because reason said I should have died, three years ago....\" There was no need for a lyric change here.</li><li>Over the Moon - Hudgens slayed this - plain and simple.</li><li>I'll Cover You (Reprise) - second best moment of the entire show. This moment brought and delivered ALL of the feels.</li><li>Seasons of Love - when the original cast showed the world what it's supposed to be like. Thank you for redeeming and bringing back the feels.</li></ul><br><br>Thank goodness the second half of the show made amends, to some degree. The moment that filled my heart was when the OBC sang, as it was meant to be sung, Seasons of Love. Thank you for closing the show that way. I know it meant a lot to the original rentheads. As for the people bitter about the show not being \"live?\" Get over it. Accidents happen and yes, they gambled. But since it was filmed live we didn't miss a damn thing. And did you see the cast Brennin was sportin'? C'mon now...<br><br>It was overall an OK performance - three out of five. I've seen better live versions of the show - and the whole nod to Shakespearean \"theater in the round\" was a bit...um...yeah. Just not my cup of tea of this production. I shall watch it again, and likely again...and again. It's is Rent, after all. I am glad that the messages are still on point and affecting new generations of people in the same ways that it affected us who grew up with this music in the 90's. I know Jonathon Larson is smiling down and happy that his vision and dream has been realized. I cried the day I heard he died...but at least Michael Grief has continued to pass on and allow Laron's legacy to live on.","user":"nutritionalresearch","rank":[12,14]},{"title":"Live Audience Big Distraction","rating":5,"date":"28 January 2019","review":"The live audience drowns out sections of the production. The were even moments that the camera focused on the audience which stops the storytelling cold. And it felt like theater in the round which I always find distracting. Other than that it was nicely done with some great performances.","user":"jgboston","rank":[16,20]}]