[{"title":"A 5th-grader can write a better screenplay","rating":3,"date":"26 July 2019","review":"Even all the fake 9 and 10/10 reviews can't save the rating of this film.<br><br>Actor, turned novice writer-director Tom DeNucci, did a fairly decent job behind the camera as director, but failed to direct his cast properly.<br><br>But his screenplay... wow, why didn't anyone else proofread this mess? This is one of the worst screenplays I've seen, and seriously failed what could've been a great biopic. A 5th-grader could've written a better screenplay. The first half was ok, for a novice writer, but what was the point of 80% of the second half? Long dragged out and unnecessary scenes with a terrible pace. I literally had to FFW some of the long useless scenes. The 99 min runtime should've been cut down to 80 mins max with the content filmed. Editing was the next flop... did someone simply use scissors and tape randomly to edit the first half of the film, then simply not edit/cut anything at all the second half?<br><br>The acting was decent, considering the director did a lousy job directing his cast, but not as bad as other reviewers mention. The cinematography was great and the era settings/props where on point. The score wasn't bad either.<br><br>It's a shame Tom DeNucci didn't at least get a seasoned writer to proofread his script, as it would have made a great film on this biopic (for actual story, Google \"Wikipedia Bonded Vault heist\"). Hopefully he learns from his mistakes. Sadly, it's only a 3/10 from me.","user":"TheTopDawgCritic","rank":[25,30]},{"title":"Don't bother","rating":2,"date":"14 June 2019","review":"A good story because it's based on a real heist but the acting and script was bad. Very poor acting and much of Deuce's and Chucky's acting was laughable. There was no way that 2 low-IQ goons could do this heist but apparently, they did. I was very surprised/shocked that I watched it all the way through! Never mind, it could have been much worse, but a 2 rating is all that I felt it deserved. Sort of proves how poor the acting was if these goons did actually pull off the job with their 'buddies'!<br><br>I think IMDB/Amazon should also be able to filter out all of these fake ratings and reviews that are occurring. Several reviews, all on 14th June, a 9 or 10 rating, and written in the same format! Pretty pathetic if this can't be detected and just proves that fake reviews with high ratings is needed to help this rubbish film along. Just changed my rating from 3 to 2 by the way!","user":"contactmaz","rank":[40,54]},{"title":"Not very good","rating":4,"date":"29 June 2019","review":"Poor script, pacing, acting, just generally not a very good film. The only redeeming feature being the great soundtrack. I recommend that you watch it with your eyes closed.","user":"damocles128","rank":[14,17]}]