[{"title":"Fantasy over investigations","rating":8,"date":"3 December 2018","review":"Detective Dee: The Four Heavenly Kings is quite different from the other two entries about the modest, intellectual and clever Tang Dynasty investigator. While the first movie relies on its mysterious atmosphere and investigative techniques and the second film explores the detective's early career, the third movie is set between the two and is best described as an intrigue with supernatural elements. This is a very entertaining fantasy movie with dynamic martial arts elements and colourful costumes and settings but it doesn't have much depth, doesn't feature a surprising plot and doesn't rely on investigative techniques. Some people might therefore consider this the weakest entry in the franchise thus far. However, I have a different opinion. If you are ready to accept this movie as a wu xia fantasy film inspired by classic Hongkong cinema of the late eighties with contemporary images and sounds, you will experience a most entertaining blockbuster that doesn't only equal contemporary Hollywood fantasy movies but also beats most of those thanks to its intriguing historical references.<br><br>The title of the movie is somewhat misleading. The four heavenly kings are only statues that are referenced in a note and then shown in one scene mid-way through the plot that lasts for about five minutes. They are never mentioned again afterwards and have no significant influence on the story. Detective Dee and the Dragon Taming Mace would have been a much more appropriate title.<br><br>The story is set between Young Detective Dee: Rise of the Sea Dragon and Detective Dee: The Mystery of the Phantom Flame. Emperor Gaozong appoints Di Renjie to head the Department of Justice and gives him the mysterious, powerful and prestigious Dragon Taming Mace. Empress Wu disapproves of this as she realizes that Detective Dee might be her biggest obstacle on her ambitious quest for ultimate authority. She orders Di Renjie's sworn brother Yuchi Zhenjin to steal the mace and discredit her opponent. She hires a group of sorcerers to see the plan through and promises to not assassinate Di Renjie and his family. Di Renjie has however realized that the Empress wants to steal the mace from him and starts to investigate her motivations. He quickly realizes that she is manipulated by a group of discredited Indian sorcerers who want to take revenge for having been used and abused by Tang Dynasty officials. Di Renjie has to rely on his colleagues, a renegade criminal and a Buddhist monk to save the empire.<br><br>The movie convinces with a steady pace and introduces the main plot right from the first scene. The film keeps this pace from start to finish and remains highly entertaining despite a running time over two hours. The most important characters are introduced quickly and coherently. The settings in old Tang Dynasty look incredible even though they appear to be a little bit too extravagant, polished and shiny. The visual special effects are astonishing and show a fascinating world between fantasy and history. The martial arts sequences are creative, dynamic and inspiring. The intrigues at the court are interesting to follow even though they don't offer anything new to the formula. The film's showdown is quite intense and of epic proportions in the key of something you would expect from The Lord of the Rings and the likes.<br><br>On the negative side, the plot is somewhat predictable and lacks the wit, precision and cretaivity of previous installments. The investigative techniques that characterized the first two films of the franchise are certainly lacking in this movie. Still, Detective Dee: The Four Heavenly Kings is such a colourful, dynamic and imaginative movie that these minor flaws don't drag the film down.<br><br>Detective Dee: The Four Heavenly Kings might be a cinematic blockbuster that is lacking depth and precision from time to time but it's the perfect film to escape your everyday life and explore a fascinating world between fantasy and history. You might feel disappointed if you are looking for a profound drama or clever thriller but you will explore a dreamy martial movie and an entertaining fantasy flick for sure. If you take this film for what it is without comapring it too much to the style of the previous two installments, you will get your money's worth while watching this Chinese blockbuster at your local cinema or at home.","user":"kluseba","rank":[11,11]},{"title":"Movie Has Its Faults But it is Spectacular in Many Ways","rating":7,"date":"30 November 2018","review":"This latest Detective Dee film, directed by Tsui Hark, is a colorful epic ancient Chinese saga. It's filled with martial arts sequences, acrobatics, as well as plenty of treachery, deception, sorcery, illusions, and pageantry.<br><br>In the movie, the intrepid Detective Dee, head of the Bureau of Investigations, is awarded the super powerful Dragon-Taming Mace by the Emperor for his past heroism in saving the Kingdom. But the Detective will have to contend with the power hungry and evil Empress, as well as a reemerging cult, named the Wind Warriors, who seek control of the Dynasty as well, using magic and mind control.<br><br>I would say the film is somewhat overly long at about 2hrs. and 12 min. and it can be confusing and complicated at times.The final battle sequence I thought was too drawn out as well.<br><br>However, if one can just sit back and enjoy the wild special effects, the intrigue, the twists and turns, and colorful pageantry of it all, there are rewards here, although the movie is not for everyone.","user":"larrys3","rank":[8,9]},{"title":"Another enjoyable piece of foreign cinema.","rating":8,"date":"28 July 2018","review":"'Detective Dee: The Four Heavenly Kings' is the third in this series of Chinese kung fu films, after the original 'Detective Dee: Mystery of the Phantom Flame' back in 2010 and 'Young Detective Dee: Rise of the Sea Dragon' (2013). The plot follows Dee (Chao) as he leads an ancient FBI and his friendship/rivalry with Yuchi (Feng) and mentorship of Shatuo (Lin), as they try to protect/hide the Dragon Taming Mace, which has powers (like Excalibur). <br><br>Despite the four 'heavenly kings' of the title, they barely make an appearance or have an impact on the story. Rather, it's all about sorcery and a clan (the \"Wind Warriors\") who want to topple the dynasty. The sorcery aspect means there's plenty of special effects, most of it really well done. The dragon and the battle at the end are exceptional. Even the \"illusionists\", including Water Moon (Ma), are pretty cool.<br><br>There's still some mystery and police work for Dee to solve, but it's also merged well with the sorcery and political intrigue with the Empress and Emperor. It's well paced, not too long, with some funny moments and, obviously has excellent stunts and fight-scene choreography that's more than worth the price of admission. It all adds up to a fun ride!","user":"gavinp9","rank":[11,15]}]