[{"title":"The Boredom Within","rating":1,"date":"10 July 2019","review":"This movie really does its best to confuse the heck out of you. The director/writer rely heavily on flashbacks for exposition. On top of that time jumps and warped reality are standard parts of the messy plot. Instead of asking myself the question: \"I wonder what will happen next?\" I found myself wondering \"What the hell is going on?\" for the most part of the movie. Instead of building suspense and mystery the director/writer seem hellbent on confusing the s--- out of their audience. As well as boring them to death.<br><br>It starts well enough with a scene in a military research facility where they're testing subjects for their psychic abilities. Something goes wrong and a bad looking black CGI smoke starts coming from one of the subject's mouth. It turns out that subject 142 and the lead scientist's son had made a psychic connection with an evil entity. We jump to the present and the son is all grown up and a mess. He doesn't remember anything about his childhood. Not even what happened to his parents. We know that something bad has happened to him recently because his shrink tells us. His girlfriend has left him because of that. The shrink suggest that he spends a couple of days in his parents cabin. He does and finds a vial containing some kind of a green liquid hidden under a rock. He decides to drink it on a whim and the fun begins.<br><br>This is where conventional storytelling is abandoned and we're thrown on a roller coaster of visions, flashbacks, time warps, dreams, hallucinations...The antagonist finally shows up. Its an ordinary looking CGI monster. I have no idea what its motivation or purpose is. All I know is that it is linked with our protagonist Marcus ( Paul Flannery ) and the green liquid woke it again. It sometimes comes in a shape of a human just to screw with him. At this point in the movie we get a lot of scenes of our hero running around scared and confused. We also get a lot of tedious exposition via flashbacks, dreams and hallucinations. I wish I had counted how many times Marcus suddenly wakes up as if from a dream. The movie plods along with the pace of a snail. The screenplay finally stops torturing the hero and the audience and shows us what really happened to the parents. Marcus decides to get rid of the evil entity because its constantly playing tricks on him. And the movie ends to the relief of everyone.<br><br>Final verdict: Not worth watching. It starts interestingly enough but soon becomes boring and tedious. This has a lot to do with the messy, convoluted and confusing plot. The movie relies too heavily on flashbacks and visions as storytelling devices instead of actually telling the story. There's a grand total of zero interesting characters in this movie. The monster isn't scary or interesting either. Its a badly designed CGI that has no clear purpose or motivation. It just appears from time to time and makes strange noises. The scenes with the monster should be a highlight of a movie like this but in this one they just felt oddly irrelevant.","user":"bastian-kreuzer","rank":[7,8]},{"title":"Driving me to sleep","rating":1,"date":"14 July 2019","review":"Sorry didn't make it pass 20 minutes of it..normally give a film chance to warm up but lost interest quickly on this one","user":"briankift","rank":[4,5]},{"title":"Slow and Not Scary","rating":4,"date":"1 August 2019","review":"I did not end up liking this movie. It did get better in the second half but it was hard making it there. There is not a lot of new ground in this one. The acting is solid but it hinges on the main character and he goes for long stretches without saying anything. I like a lot of imagery, but this was hard to follow sometimes.<br><br>The best part was the monster. It was cool looking and menacing. It just wasn't in the movie a lot and I don't even really know if it is more than a hallucination anyway. Still, I liked it.<br><br>Watch this one if there isn't anything else or if you really like psychological thrills.","user":"timothygartin","rank":[2,3]}]