[{"title":"There was just so much potential squandered here...","rating":5,"date":"17 December 2018","review":"I so much wanted to love this movie, given its premise and concept. But the movie just failed to convince me and turned out to be a rather mundane and, let's just be bluntly honest, mediocre movie experience at best.<br><br>The storyline had so much working for it, but writer and director Kurt Knight just failed to bring all loose ends together in a fulfilling way, and the potential of the storyline and story arches were nowhere near utilized to the extend of their full potential. Nor were the characters properly being utilized throughout the story, which definitely put a restriction on the acting performers.<br><br>I will say that they had a rather impressive ensemble of cast together for performing in the movie. Baylee Self - playing Isabel, the alleged witch - really carried the movie most of the way with her genuinely creepy performance. And I must say that Michael Flynn - playing abbot Scipio - also really performed exceptionally well in the movie, it was just such a shame that his character was not a more prominent one, especially given the outcome of the character. The same goes for actor Adam Johnson - playing Felix - his potential wasn't properly put to use either. And the lead roles played by Jake Stormoen and Kristian Nairn were also quite adequately performed - despite them not having the most interesting characters in the movie.<br><br>There was a genuine creepy atmosphere to the movie, with the lack of proper lighting and the enclosed tunnels, which definitely worked in favor of the movie, just a shame that all the potential of the movie was left squandered in a dark corner somewhere on the set.<br><br>\"The Appearance\" does have the audience guessing and speculating for sure, but it feels rather anti-climatic once the ending of the movie comes to fruition, and that didn't really help to lift up all the shortcomings that the movie had along the course.<br><br>I liked the atmosphere and the props, sets and costumes of the movie quite a lot actually, because it seemed very accurate to the period of time in which the movie was taking place, and it added a good amount of creditability to the movie, which was much needed.<br><br>This is the type of movie that you will most likely just watch once and never get around to watching again, because the movie just doesn't have the contents to support more than a single viewing.","user":"paul_haakonsen","rank":[18,21]},{"title":"The original is better","rating":6,"date":"14 December 2018","review":"And its called The Name of the Rose (1986) , a weak remake lost the original feel","user":"thefanfx","rank":[29,39]},{"title":"Snore","rating":3,"date":"17 December 2018","review":"I had a difficult time with this film. It was very slow paced and not very interesting. Took some effort to see this one through to the end. On the plus side, it does have Hodor (Kristian Nairn) from Game of Thrones.","user":"edgalarza","rank":[12,17]}]