[{"title":"Another in the long line of shark themed drivel","rating":2,"date":"5 August 2017","review":"This movie tries to combine Mad Max with Jaws and the end product is about what you expect when you see \"shark\" in a movie title these days. The only thing I liked was the setting, the various boats and mixes of technology made for an interesting setting. Everything else was absolutely awful. The acting was bad, even for a made for TV movie. The writing relied heavily on long over done clichés and tropes and the plot was rather uninteresting. As with all of the latest crop of this kind of film the sound design is overdone and distracting, potentially to make up for the awful writing. It makes the cheesy action scenes even harder to sit through. Overused bargain bin CG adds to the unbearable cringe that describes most of this movie. The main villain is beyond comical, the actor's performance combined with the writing makes his appearances on screen almost comical, but still somewhat painful. <br><br>In short, this movie is bad, not \"so bad its good\" but \"Why did I waste 90 minutes of my life on this\" bad.","user":"hashime","rank":[20,20]},{"title":"Every bit as to be expected...","rating":3,"date":"20 August 2017","review":"First of all I must say that I was lured in given the title of the movie, as I am a fan of the creature feature genre. And yes, there is just something fascinating and interesting about sharks in particular. But the title alone for the movie had B-movie screaming all over it, and when the SyFy name appeared, I must admit to a 'oh, one of those types of movies!' thought crossing my mind.<br><br>But still, I decided to sit down to watch the movie, because it is sharks after all. And who knows, SyFy have been known to make a great movie every now and then. They are rarely, but they do exist.<br><br>As for the acting in the movie, well I was familiar only with John Savage, and he is always fun to watch in movies. It was really hard to take Jonathan Pienaar serious in this movie given his body gestures and way of acting, whether it was called for in the script or it was his style, I have no idea, but it sure was annoying.<br><br>\"Empire of the Sharks\" falls prey to the usual SyFy level of special effects and CGI. So don't get your hopes up. The effects and visuals are there and they function well enough for their purposes, but they are not impressive eye candies to behold. And the fact that the sharks were growling menacingly as they were swimming about was just ridiculous.<br><br>There was something in the movie that was taken directly out of \"Conan\". It was the scene where chained people were working some kind of milling wheel. A subtle homage or just a random coincidence? Who knows...<br><br>I suppose that \"Empire of the Sharks\" can best be classified as \"Water World\" meets \"Jaws\".<br><br>The storyline in the movie was easy to follow and required no complex thinking from the audience; so it is essentially just to lean back and watch the movie here. However, the concept of an army of sharks controlled by someone wearing a pair of gloves was somewhat difficult to accepts as a serious idea.<br><br>For a shark movie then \"Empire of the Sharks\" was not overly impressive or particularly enjoyable. It is just another movies in an endless line of less than mediocre shark movies that clutter the genre.","user":"paul_haakonsen","rank":[10,10]},{"title":"Future empire under the sea with sharks","rating":1,"date":"18 March 2018","review":"Have made no secret in the past of intensely disliking, and even outright hating a lot, a vast majority of The Asylum's and SyFy's (near-universally maligned for good reason) output, though there is curiosity as to whether they are capable of making something good and compulsive about their output's badness. Admittedly, both The Asylum and SyFy do have a small group of watchable films and the occasional (big emphasis on that word) above average one, unfortunately outweighed by the lacklustre at best and often dreadful films they churn out.<br><br>Before anybody gets defensive, am well aware that films like 'Empire of the Sharks' are not ones to be taken seriously. Have seen my fair share of low-budget shark films, and any other kind of low-budget creature film, and will admit to finding some guilty fun in some of them (i.e. the first two 'Sharknado' films). There are far worse shark films, but is that an endorsement or saying much? Not really. <br><br>Take no pleasure in rating films low or leaving negative reviews. Actually always aim to be an encouraging and perceptive reviewer, and 1/10 ratings are extremely rare.<br><br>Sadly 'Empire of the Sharks' is just too amateurish to accept as a guilty pleasure, where nearly everything is just poor quality that it's insulting and there is nowhere near enough fun, intentional or unintentional, moments. Was not expecting anything intelligent here, am well versed now to know that it is not that kind of film, but it does feel like it was made by somebody who didn't know how to give a film brains, so much so that it'll make the viewer feel dumb and that is not a nice sensation to feel watching a film.<br><br>Cheapness and ridiculousness were taken to extremes here in 'Empire of the Sharks'. Some marginally intriguing, if very silly, ideas but comes off so far-fetchingly that it is impossible to take things for what they're intended to be let alone take them seriously. The whole shark-caller stuff was even sillier than it sounds.<br><br>Visually, even when knowing what to expect, 'Empire of the Sharks' still looks really cheap. Any nice scenery that the movie has is difficult to appreciate when the movie is shot in such a drab way and when it's edited so amateurishly that bacon-slicer-like editing looks more refined. Worst of all in this regard are the effects, as it was made on low-budget it would have been forgiven a little if it was not great, but when the effects for the sharks look as if no effort was given in making them without looking so goofy and unfinished-looking that is hard to ignore.<br><br>No better news about the sharks' personalities. Not menacing or fun, they're basically bland and for titular creatures they don't feature in the film anywhere near enough. The shark action is nothing to write home about, not enough of it and easily forgettable with no suspense or even unintentional humour.<br><br>Writing ranges between incredibly bad to appalling. Any comedy is incredibly forced and is so cheesy it is enough to make the eyes roll in disbelief, while the more serious moments are very awkwardly written and as trite as anybody can possibly go. To describe the story as weak is being too insulting to the word weak, it is a very lethargically paced and thin as ice story with lots of padding that is either badly written or serves no point at all to the movie, other than attempts at novelty value, which falls flat on its face because it all feels so tired. It is not fun, it is not scary and it is not thrilling or suspenseful, it's just nothing but tired stupidity, with silly ideas being ridiculous and muddled in execution.<br><br>As for the characters, they are a mix of bland and annoying. Particularly one of the hammiest villains in recent memory. The acting ranges from bored to over-compensating, Jonathan Pienaar is irritating beyond belief especially. <br><br>Summing up, awful. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[2,2]}]