[{"title":"What is going on at Netflix?","rating":3,"date":"4 August 2019","review":"I am starting to get concerned by the quality of output from Netflix. I find myself starting to watch a film, and often switching off ten minutes in. I did, however stick with White Chamber, as I thought the premise was decent, and it featured some good actors, including Sharon Maughan and Nicholas Farrell, but I wish I hadn't.<br><br>The truth is, this is a bad film, it cannot be dressed up any other way, after an interesting start, it goes downhill very quickly, the whole thing feels cheap and amateur. It's like a film an independent company would have produced in the early 2000's, not something millions of paying a subscription fee for.<br><br>Sharon Maughan and Nicholas Farrell do provide a bit of quality in terms of acting, but both are up against it in terms of script. It had potential, but ultimately it's a bad film. 3/10","user":"Sleepin_Dragon","rank":[43,51]},{"title":"Not sure it realises its potential?","rating":3,"date":"3 April 2019","review":"A fairly basic story that has been explored in other films, unfortunately weighted down by an unsubtle political message poorly communicated.<br><br>The acting is good, the production values high and dialogue well delivered despite the bland script. I feel the actors really working hard to make the film gel, which makes it more the pity that it doesn't. After an hour of gratuitous torture I felt like the person in the box.<br><br>The experience wasn't going well and this gave me too much time to ask myself where this film was going? It was going nowhere...<br><br>This one is going to sink without trace having failed in its social message. What one is left with is an over articulated cerebral video nasty.","user":"fad-38798","rank":[31,36]},{"title":"What a waste of energy","rating":3,"date":"5 August 2019","review":"Think of Am Dram at the village hall and you are not even close.<br><br>Seriously considering \"binning\" by Netflix account as ( in particular ) the middle and Far East percentage of its library content is deplorable. Now you have this tripe that was \" nominated for a BAFTA\" ? Your having a laugh ?","user":"dspb","rank":[15,18]}]