[{"title":"The boys are back, and they're crazier than ever","rating":10,"date":"8 December 2017","review":"It was such a delight to hear the Psych theme song again and see the wonderful cast, including James Roday, Dule Hill, Maggie Lawson, Kristen Nelson, Corbin Bernsen, and Kurt Fuller. The only one missing was Carlton \"Lassie\" Lassiter (Timothy Omundson) who actually did appear when Maggie contacted him by phone.<br><br>When the film begins, it is three years later, and the whole group is now working in San Francisco. Shawn (Roday) continues to search for the engagement ring he wanted to give Juliet (Lawson), Gus (Hill) has a beautiful stalker, and someone is out to get Maggie.<br><br>There are the usual one-liners, the singing in harmony, and some familiar villains, including a hilarious bit at the end of the film. There's a scene in a closed insane asylum and one in Alcatraz. All par for the course.<br><br>I really miss these guys. I think today we need to laugh more than we ever have, and the Psych group belongs on the landscape. Thankfully, I don't think this is the last time we'll see them.","user":"blanche-2","rank":[51,63]},{"title":"An Honest Review","rating":10,"date":"9 December 2017","review":"OK, maybe this one would be better titled a \"bias\" review.<br><br>You see, the TV show had this thing where it made me laugh out loud at least once an episode. At LEAST. And honestly, there aren't that many shows that have really made me laugh out loud.<br><br>And then, well, James Roday and Dulé Hill are just brilliant together, hands down the best comedic duo I've seen in a VERY long time.<br><br>So...walking into this, well, I had high expectations and, I kind of already knew I was going to love it...<br><br>Except...Timothy Omundson, breaks the heart about his stroke and he was missed, a lot, because, yeah, he was hysterical too.<br><br>And, as in the the TV show, the only week part is really Maggie Lawson and that's not her fault, she just...the straight one. She does a good job, but with Roday and Hill sharing scenes with her, it's hard for her to get out of those shadows.<br><br>Still, \"Shawn stop talking,\" she has her moments.<br><br>And the same pretty much stands for this movie as well. Everyone is hysterical, Roday and Hill play off one another to great effect, and poor Lawson is stuck playing it straight while Corbin, Fuller, and the rest get to ham it up until, well, until you're laughing.<br><br>Really, they came back without missing a beat. It was like they were all made for their roles.<br><br>AND...did I mention it was funny, like really funny? Isn't that the most important part? I laughed out loud again. It was hysterical, just like the show and...just reminded me how much I missed it.<br><br>So funny that there were scenes you just had to rewind a few times.<br><br>Just so funny and, with shows like this, that is all that matters.<br><br>It was really like seeing old friends again.","user":"generationofswine","rank":[34,43]},{"title":"Patchy although does more or less enough for the easy-going fan","rating":26,"date":"26 December 2017","review":"Eight seasons and a movie, as the saying almost goes. Psych returns with a holiday special which I was looking forward to, being a fan of the show for how well it does what it does. It is mostly a welcome return, although it is affected by the pressure to be an event, and also a bit of a lack of confidence in its own fundamentals. As a result the movie is really very busy at times - too many tick box characters showing up to not do enough. It is nice to see so many of the cast back, but at the same time there is a lot of shoe-horning in there and maybe it would have worked better if it had been more focused and kept supporting characters' time down.<br><br>The plot itself isn't great, but it provides a decent enough frame for the duo to be themselves. Mostly this is enough, although it doesn't quite have the spark and freshness that it once did - again a feeling added to by weight and baggage of the characters. There are some nice laughs and enjoyable sections, certainly enough for fans who are just happy for new material - but it is far from classic Psych and it does make it feel like it needed a tighter hand to make it happen the way it needed to. The cast are all on reasonable form - although Roday and Hill don't quite gel as they have in the past, and the rest of the cast feel too present but without enough material - Fuller has a high hit rate though, but Bernsen didn't need to be there, and Omundson is hard to watch even though it is a nice gesture by the film.<br><br>All told it is a so-so movie, which is patchy but offers enough to justify fans watching. If they do another I will be there for that, but will be hoping that it can be a better product than this.","user":"bob the moo","rank":[9,10]}]