[{"title":"A point of view...","rating":7,"date":"20 June 2018","review":"There are some movies that just aren't meant to be understood, Napoli Velata is one of them without a doubt. Maybe it doesn't have the most amazing plot, it's quite intricate, but I found that the best thing about this movie is the breathtaking sceneries that the city offers, even if just inside a house.\nMany have said that it doesn't feel whole because Naples is barely there, but I think that the film just shows a different version of the city that perhaps the \"outsiders'\" eye can't catch and isn't used to. I was born in this city and one thing that really moved me is actually the way the city is depicted. It's impressive how Ozpetek managed to take the city and use it as the protagonist but at the same time as the background to the story.\nIt's evidently the point of view of someone that went well beyond the stereotypes (finally) and deep into the roots of the culture and the customs, elements that very much characterize a Neapolitan's identity such as theatre, superstitions and numbers. The movie doesn't want to give a definitive and defined definition of what it shows and I really appreciated it.","user":"beatrice-music_star","rank":[21,23]},{"title":"If you're willing to suspend your disbelief for a moment, you'll love this film","rating":10,"date":"30 August 2018","review":"In theatre, they call it \"suspending disbelief\". That is an art of the audience of which many Americans have lost their talent. The Europeans, less so. If you are willing to suspend your disbelief; to play in the world of possibility, of love, of romance, of momentary insanity, and redemptive goodness, then this film is for you.<br><br>No, it doesn't hand you the answers on a silver platter, but what fun is knowing the certainty when the unknown, the mystery, is so rich in possibility?<br><br>For those willing and able to play, to be compassionate to, in brief, be a little more European, this film will please you in every aspect of the word.","user":"activateyourdna","rank":[16,18]},{"title":"a poem","rating":11,"date":"11 July 2018","review":"... or a portrait. portrait of Naples. using pieces from Fellini and the love as axis. a film about a world. honest, touching, labyrinth - like. usefull. for the sentimental geography. for the story like arena. for cultural references. maybe, for courage. and for seductive beauty.","user":"Kirpianuscus","rank":[13,16]}]