[{"title":"A rare film about everyday Americans","rating":7,"date":"2 December 2018","review":"It's a rare film that showcases the hardships of everyday Americans. Hollywood seems to be too busy nowadays with Superhero films, Sci-fi, Historical dramas etc. and seems to have forgotten about the dreams and hardships of average Americans. This film tries to showcase that, and it succeeded without being overly dramatic. Regina Hall delivered an excellent performance in this film.","user":"ikadery","rank":[27,33]},{"title":"Well, I liked it","rating":7,"date":"30 August 2018","review":"Support The Girls was an odd one. It started off promising as an offbeat comedy drama, then steered completely into drama territory. Regina Hall as an always-positive-strict-and-firm-manager was charming to watch as she desperately tried to weave through multiple problems at once during the early morning, stealing almost every scene she's in, and the supporting characters (mostly the girls employed by Regina's character) carry the film well too, especially during scenes of Regina intereacting with these girls almost like a surrogate. For the most part it was interesting to see the work relations of these characters, becoming more evident as the movie went on that the supposed \"sisterhood\" of these employees that is mentioned early in the film isn't just work motivation but what feels like an actual family. If you like independent dramas then check this out, but if you are expecting an easy string along plot with a feel good vibe avoid this one. I'm not sure what the complete message of it was, but admittedly in the end I was left wanting more. That's not to discredit the touching ending of how a manager and her employees share a thick as blood bond even after the chaos that ensues, which is what pushed me to write this review because I thought at least that deserved some praise, but the climax leading up to the final scenes just felt very rushed and hard to process exactly what it was all for. Some might say this was a boring film but it worked for me, it kept me interested to see how it would all unfold, eagerly waiting for an either positive or negative outcome for each little problem our protagonist dealt with, if you stumbled across this movie and were intrigued enough to look at the reviews, just see it for yourself. It's by no means terrible.","user":"matdog321","rank":[29,39]},{"title":"Uninspired and Flat","rating":5,"date":"6 December 2018","review":"Not sure what to make of this film. It's branded as a comedy, but it's not funny. As a drama, it lacks a compelling plot and character development. The lead performance by Regina Hall - as others have mentioned - is fantastic. I wish she was in a better film.<br><br>Reminiscent of The Florida Project, Waiting and Alice Doesn't Live Here Anymore, but not nearly as self-assured or accomplished as any of those films.","user":"AlGranthamMusic","rank":[20,29]}]