[{"title":"Hobbs & Shaw","rating":7,"date":"13 February 2020","review":"It's not a plot you haven't seen before and you need to suspend your disbelief on some action scenes and plot elements (like most of the Fast &amp; Furious movies), but is it entertaining? Yes. Hobbs and Shaw is like an a cheesy 80s action movie made in 2019 that embraces it's almost silly plot and makes for an fun action movie that is aided by the chemistry of Dwayne Johnson and Jason Statham and some entertaining over-the-top action scenes.","user":"MR_Heraclius","rank":[50,52]},{"title":"Adrenaline-fueled ride absurd in terms of its believability but fun","rating":7,"date":"3 October 2019","review":"\"Hobbs &amp; Shaw\" is a very mixed bag, but its mostly a fun affair. The laughs, action, chemistry, and set pieces are all there, along with two great cameos. The car chases feel rote and more of a franchise obligation than a necessary part of the story. Idris Elba as the evil Brixton is quite good, so maybe he will be Next 007. Most problematic about the film is the third act, but overall, I had a good time and I really did enjoy the soundtrack :) If you want mindless mayhem, \"Hobbs &amp; Shaw\" delivers.<br><br>Rating: 7-/6+","user":"akcenat","rank":[259,295]},{"title":"Not a masterpiece, but entertaining AF!","rating":7,"date":"3 October 2019","review":"Like I said, it's not a masterpiece, and it certainly has some problems, but the movie knew exactly what it needed to be and what it needed to do and it did it well. Statham, Johnson, Ilba and the rest of the cast all did a pretty good. The action is over the top but entertaining and exiting. The movie was also pretty self aware and wasn't as arrogant as the other F&amp;F movies. And I loved the choice to make a F&amp;F movie with such a bizarre and over the top plot.\nAt some points the movie got a little to repetitive and cliche for me, and some of the jokes and skits were a little bit weaker than others, but like I said this movie is not the one made to be a masterpiece, or to be analysed for messages or deeper meaning, its just a dumb summer movie but a really good one at that.","user":"cherrysunday","rank":[181,206]}]