[{"title":"Just watch this film. An epic proud Indian moment awaits you.","rating":10,"date":"25 May 2018","review":"It's a shame that I really had almost no idea about the event it's based on. That very event changed the world's perspective towards our nation and it was indeed a proud moment for us all. PARMANU: THE STORY OF POKHRAN is a mindblowing film. It not only stays true to the event but also makes sure that those who didn't know about it would be able to experience it in a stylish way.<br><br>PARMANU is a very tightly scripted film. There are thrills, drama and some cool action. Everything is balanced so perfectly that I felt it couldn't get any better than this. There's almost no flaw to find and the lack of musical numbers ensures that a wider audience embraces the film. There are no commercial compromises, and the director has mixed all the elements perfectly to give you a touching patriotic story which proves that unsung heroes can be remembered and honoured on any day. <br><br>John Abraham is fabulous in this film. He plays a different kind of role and impresses totally, especially in the climax and an action sequence in the second half. Well, I didn't really need to say that since we all know that he's an action hero. This time, he doesn't really play one, but still reminds us of the excellence with which he has mastered this genre. Boman Irani is extraordinary: give him any role and he's gonna play it his way, the perfect way. Diana Penty is impressive and her character is neatly written. Rest of the cast does a splendid job.<br><br>The review would be incomplete without praising the film's director, Abhishek Sharma whose skilful direction has helped the film become what it became: A perfect entertainer and thought-provoking historical action drama/thriller which also allows for some natural humour to breathe in.<br><br>Enough of the bashing by critics. This film is awesome and is capable to entertain all ages. PARMANU: THE STORY OF POKHRAN is much more than just a history lesson: it's a phenomenal historical saga which realizes its strengths and thus chooses to remain totally realistic. If you like action dramas/thrillers based on real events, then I would like to congratulate you, since you're definitely in for a treat.","user":"Prashast_Singh","rank":[52,71]},{"title":"A must watch patriotic film. John's career best.","rating":9,"date":"25 May 2018","review":"Directed by Abhishek Sharma, Parmanu is a film based on true incident of nuclear testing in India (1998). Film features John Abraham, Diana Penty, Boman Irani and Anuja Sathe in prominent characters. It speaks about the historical event of India becoming a nuclear state.<br><br>First of all, let me tell you frankly that I was not going for this movie till the last night. Somehow I felt that it's going to be a boring film as what will they show about nuclear test! But last night, I read one tweet praising about it. So I made up my mind to take a risk. Believe me, I am extremely satisfied now!<br><br>What went through during the test of nuclear, that also with super secrecy from entire world, especially CIA. There is a constant pace that the film continues on with lot's of happening in between. There is a strong emotional factor, too. And above all, the patriotism makes it a worthy watch for every Indian. <br><br>John Abraham is at his best. Many will say that this is his best film in the entire career. Also, he is a producer of this film. There were some issues, and because of that the film's future went in danger. But he somehow manages to break all the odds and Today he made it to the theatres as well. Kudos to him for lifting up such a story which the entire nation needs to know.<br><br>Diana Penty looks perfect for the role. She acts beautifully and looks charming. Anuja Sathe delivers a solid performance as a wife of John. Boman Irani is excellent. His conversation scenes with John are the best! Supporting cast, especially the Pandavas have done a great job. They keep you engage as well as entertain throughout.<br><br>Music by Sachin-Jigar adds an element of Rajasthani touch. Folk tunes and voices are very much relatable to the story and situation. Sapna by Arijit is my favourite from this album. <br><br>Location adds thrill to the story. Storms and sands are captured well. The whole setup of plant was developed superb. It is hard to crew for the setup pf 1998 in the current year, but they have done it nicely. Though, the blast could have been shown better. Although, it is nice now. Usage of old footage such as speech by Bajpayee is also good.<br><br>Overall, this film should not be missed. You will feel proud for sure. This film is an ode to our engineers and scientists. And that too in a thriller format. John Abraham and Abhishek Sharma deserve applaud for making such a wonderful film. And I wish John will make such films in future as well (like his production house did in the past). So, a must watch story of Pokhran. 4/5.","user":"maulin5","rank":[33,48]},{"title":"The Kind of Movie Bollywood Needs","rating":8,"date":"26 May 2018","review":"We have people blaming #Bollywood movies for content all year long and when a good film releases there's no one to watch it. Intentionally watched #Parmanu with 50% occupancy and what a film it is!! Such stories need to be told, these are the stories which children need to know.<br><br>And not movies on Sanjay Dutt, not movies on Dawood, Haseena Parkar, etc. #Parmanu invokes patriotism in you and that's what should be remembered. Anyway will have people bashing the upcoming Race 3 and blaming the audience for taking it to 500cr. <br><br>Whereas a Parmanu silently arrives and leaves without anyone noticing. Hope it gets what it deserves. \nAn audience!!","user":"gokscasm","rank":[26,38]}]