[{"title":"Movie crap","rating":1,"date":"22 August 2018","review":"Trying so hard but plot is messy and lost... u lost me after 15 mins of the movie and don't know what is happening ...","user":"loft_zen","rank":[9,11]},{"title":"A muddled third act undermines what is otherwise an intriguing neo-noir about the existential nature of crime in an unequal society, punctutated by some thrilling blasts of ex","rating":6,"date":"1 May 2018","review":"Having cut his teeth with some of the best and worst in the Hong Kong film industry over the past three decades, two-time Golden Horse Award-winning best actor Nick Cheung has in recent years demonstrated a confidence to reinvent some of the genres which the industry has been closely associated with. So after taking on the horror/ supernatural genre with 2014's 'Hungry Ghost Ritual' and 2015's 'Keeper of Darkness', Cheung has here set his sights on the classic crime thriller with a hyper-stylised entry that seems equal parts inspired by 'Sin City' as it is Christopher Nolan's 'The Dark Knight' trilogy.<br><br>Like them, 'The Trough' unfolds in a fictional city where crime is rampant and in need of a (reluctant) anti-hero willing to subvert the law in order to upkeep it. That hero here is the frequent undercover cop Yu Chau (Cheung), whom the first act sets up as a somewhat disillusioned individual from spending too much time with those on the other side of the law. An overlong introduction to his last stint with mob boss Yun (Michael Miu) culminates in a fierce gunfight in a laundromat that leaves all but Yu Chau dead, and the latter goes off into the African desert to cleanse himself - which, as the opening credits demonstrate, apparently involves showing a hyena just who is more menacing.<br><br>The real story here begins only about half an hour into the movie, when Yu Chau is summoned back by his handler Zhan (He Jiong) to uncover the identity of the criminal mastermind nicknamed 'Boss'. To do so, he will have to go undercover once more with the abrasive ringleader Chun Hua (Yuen Wah) to kidnap a young girl, but as Yu Chau soon discovers, the case involves not only some very powerful individuals at the highest echelons of society, but also reeks of corruption at the highest levels of the police. Not that you'll have to wonder just who they are - there is no attempt to hide the fact that Zhan's superior Diane (Maggie Cheung) is one of them, or for that matter, any buildup to Xu Jinglei's Japanese-born socialite as the 'Boss' herself.<br><br>Co-written by Cheung, the film isn't so much a whodunnit as a whydunnit, which Cheung turns into a meditation on the nature of crime and justice and whether either is simply two sides of the same coin. Unfortunately, those expecting a compelling treatment of the subject matter will probably come off disappointed and in fact frustrated by the sheer narrative illogicalities. Why would 'Boss' risk her own life by getting into an elevator with Yu Chau? Why would she send a whole army of henchmen to delay him while she makes her escape, and then shortly after willingly let herself be apprehended by him? Why would she end up killing those who did her bidding, while hoping that Yu Chau will somehow carry on her legacy? Not much in the final act of the movie makes simple common sense, and that is a pity, because the first hour is arguably pretty intriguing.<br><br>Before its conceit falls apart, 'The Trough' hooks you with its relentless bleak tone and its blasts of explosive gunplay. In probably one of the most memorable nihilistic sequences of the film, Yu Chau is seen walking down a street at night in seeming utter detachment to the law-breaking around him: prostitution, carjacking, and most egregiously, a group of teenage hooligans gunning down a man. Like the weather phenomenon that it is named after, the skies over the city dubbed Solo Field are perpetually overcast, so much so that the entire movie unfolds in different shades of grey.<br><br>Amidst that overwhelming sense of despair and desolation are episodes of intense action - notably, a thrilling vehicular chase along the city's downtown streets that see the complete demolition of a couple of police cars, and an equally exhilarating one-versus-many shootout in a building that climaxes with a mano-a-mano between Cheung and Philip Ng's unnamed kung fu kicking assailant. Cheung was in two of Dante Lam's most acclaimed cops-versus-robbers films in the early years of the last decade (read: 2008's 'Beast Stalker' and 2010's 'The Stool Pigeon'), and channels similar ballsy sensibilities in choreographing and staging his film's own fiery shootouts. Cheung's own experience with triad movies also lends itself well to some of the tense underworld exchanges, including that between Miu and Lam Suet's middleman to settle the former's debt and another in an abattoir where Cheung susses out if Li Haitao's disgruntled underling is in fact the 'Boss'.<br><br>Alas these accomplishments are not quite enough to make up for a muddled script that doesn't quite know how it wants to set up the central relationship between Yu Chau and the 'Boss', and therefore how to portray its key message on the rightful place that crime should or should not have in a inherently unequal society. That said, the fact that Cheung has attempted a neo-noir spin on the traditional Hong Kong crime thriller should in itself be lauded, and despite its shortcomings, 'The Trough' is never visually or stylistically boring. One does however hope too that the city had more character and definition to it, ditto Yu Chau himself, so that we can better appreciate the context behind the latter's struggle to uphold justice. It's no classic, but Cheung's third time in the actor-cum-director's seat confirms yet again a bona fide Hong Kong cinema veteran reinvigorating the industry in small but significant ways.","user":"moviexclusive","rank":[4,8]},{"title":"Great Deep Big Budget Movie give it time to develop","rating":10,"date":"16 September 2019","review":"Yes the 1st part of this in depth big budget john wick meets mission impossible movie is trippy but the journey is worth it... really enjoyed it","user":"warsyntaire","rank":[0,1]}]