[{"title":"Unexpected and interesting combination of science fiction and horror","rating":8,"date":"12 December 2018","review":"A very young woman marries an older doctor. In their honeymoon he shows his impressive house and explains that everything belongs to her but there is one room she should never get into. As it obvious she did to and things get very ugly.<br><br>Explaining more will ruin the many unpredictable surprises after that event. The movie becomes more interesting and engaging even when its pace is it sometimes a bit slow.<br><br>The cast is perfect with the calm tone of the movie. Abbey Lee is surprisingly good in a character that needs to generate empathy and sympathy in order for the movie to work.\nCiarán Hinds and Matthew Beard are intriguing and mix of good and diabolic as they can be without much effort. The underrated Carla Gugino perfectly handles a mysterious character whose motivations are unclear until the very end.<br><br>The only major critics could be; the pace that is sometimes a bit slow and those looking for pure horror will be disappointed; this is mix of science fiction and horror; but overall there are many interesting things to think about that will stay with you after the movie ends.<br><br>In brief; far from shallow a movie that deserves to be seen","user":"abisio","rank":[40,46]},{"title":"The core theme of \"Elizabeth Harvest\" is Narcissistic abuse","rating":10,"date":"13 August 2018","review":"The movie is a symbolical representation of Narcissist-Empath relationship. \nSebastian Gutierrez describes a typical abuse dynamics between a Narcissist (the husband) and an Empath (the wife). The Narcissist is brilliant and cruel; the Empath is naive and sensitive. The names of the main characters are not randomly chosen - Henry 8th Tudor executed many of his wives, and Elizabeth is the name of his daughter, who survived his abuse and even thrived as a Queen. \nThe abuse cycle has two phases - an idealization phase, represented as a honeymoon; and a devaluation phase - symbolized by the killing of Elizabeth.\nThe typical Narcissistic abuse cycle repeats six or seven times, thus there are six copies (clones) of Elizabeth, all of them created by Henry. In the sick mind of the Narcissist he virtually \"creates\" and \"destroys\" his partner.\nBy saying to Elizabeth not to enter the forbidden room, Henry set a trap for her. He knows that she will \"disappoint\" him at some point of the \"relationship\" by disobeying him. So he plans her devaluation and annihilation in advance.\nThe Narcissist even creates his new false ego - Oliver. He has a lover (a secondary source of supply) - Claire and a friend - a tertiary source of narcissistic fuel.\nThe Narcissist harvests energy (positive or negative) from the emotional reactions of other people. The drained emotional energy boosts his ego. He needs constant validation and attention. \"You can either torture or be tortured.\" The most important thing for the Narcissist is to be in control because he feels superior this way.\nIn order to break free from the abuse the Empath has to acquire new knowledge about herself - she has to face her childhood traumas which brought her to this kind of \"relationship\". Elizabeth educates herself - symbolically represented by the picture of the owl. This is the only thing that she takes when she finally escapes her prison.\nIn the movie there are several references to Stanley Kubrick's masterpiece - \"The Shining\" - 1980: the road, the tunnel, the villa/Overlook hotel, the secret harvesting room/room 237, naked woman in a bathtub...etc.\nBrilliant movie! 10/10\nEnjoy and educate yourselves!","user":"batmanbatka","rank":[115,150]},{"title":"Intriguing movie","rating":11,"date":"11 August 2018","review":"This movie is definitely something different, it was interesting and entertaining and somewhat engaging. Having just watched the movie I'm not sure how I feel about it yet other than I'm glad that I stuck with it, having been interested at first and then puzzled for a little bit until it started unfolding. They went out on a limb with this one and I think they got most of what they wanted, it is a good movie.","user":"braddy4","rank":[65,87]}]