[{"title":"Stupidity Level: Hollywood","rating":3,"date":"6 June 2019","review":"It actually started fine with the hostages situation on the ship and chasing the pirate, to the clash in the big city which had the deepest scene in the entire movie: a civilian forced to suicide bomb to save his son. it all went well until the mortar scene (which was the most stupid one, in case you have seen a real mortar shelling a target before), the good guys dodging bullets fired at them 50 meters away, the mortar terrorist stops shelling when a smoke cloud blocked their view (they were shelling the convoy a while ago, why did they stop, looks like they had no idea that the shell could go through the smoke), the terrorist sniper shot the helmet in a split second but missed 2 clear shots on a moving soldier, the bus explosion (this one remind me of Hollywood action movies, i mean some one must tell the directors or who ever in charge of that stupidity that the sound of such explosion alone can kill a person standing 20 meters away), the tank shell penetrating 6 columns, infinite ammo, a non-armored car that could actually stop thousands of bullets (a 9mm pistol can penetrate a car to the other side, tell that to the directors too) and the fireworks \"frag\" grenade. the only good scenes in this movie are the pirates scene and city fight scene. so... watch the first 50 minuets and don't waste your time.","user":"karamidris","rank":[56,71]},{"title":"Great action movie","rating":9,"date":"29 November 2019","review":"Similar to American made war movie in terms of action, equipment, tactics, but more realistic showing that enemy's capabilities and good guys getting hurt and shot! Some people say it's Chinese military propaganda, I'd say it's about the same level of s**t as u see American war movies. If only bad guys die so much more often than good guys, we wouldn't have so many wars. 🤔. A good change to see heroic action movies that don't speak English!","user":"brianpleung","rank":[5,5]},{"title":"Political Propaganda? You guys watch Hollywood war movies as well right...?","rating":8,"date":"8 December 2018","review":"It recently came to Netflix, so I figure more US audience would be watching the movie, then I see so many reviews saying it's bad because it's propaganda. Thanks for showing how double standard works guys. It's not the best movie, but it's fun, thrilling to watch, based on real event and reasonablly realistic, so I give it an 8. On the other hand, If it is pure propaganda, I'm glad to know that when things go down, Chinese government get stuff done, fast.","user":"dmv_gary","rank":[55,86]}]