[{"title":"A Taxi Driver Review: South Korean Cinema at its best & in its finest form.","rating":10,"date":"30 September 2017","review":"Movie: A Taxi Driver (15)<br><br>Rating: 5/5<br><br>I've been highly impressed long time by Song Kang-ho, and I've been watching many of his movies since later few months. I was highly excited to watch his new historical action drama A TAXI DRIVER, because the trailer was highly impressive. It showed how the film would turn out to be. I just wanted to see it as soon as possible and I finally got the opportunity. <br><br>A TAXI DRIVER, without a second thought, is the best South Korean film I've seen till date. From narration to execution to performances to presentation: it's perfect in each and every aspect. The change in the tone of the film has been brought up extremely well, thanks to its director Jang Hoon. The screenplay is never disappointing throughout, and the film comes out as both a refreshing as well as a memorable experience. <br><br>The film's editing is top notch as it doesn't take much of time to introduce and set up the characters as well as the storyline. As the film progresses, you find yourself connected to the characters, especially the ones of Song Kang-ho and Thomas Kretschmann. Both actors have delivered extremely excellent performances, and rather so excellent that I ended up rooting for them completely. When they smiled, I smiled. When they cried, I cried too. Rest of the supporting cast, especially Ryu Jun-yeol and Yu Hae-jin deserve a lot of praise. <br><br>The film's technical aspects are top notch. The visuals are breathtaking and the story is well captured by a first-rate cinematography. The film's action sequences are another major highlight, as they induce a lot of excitement along with tension as to what would happen next. The film's not extremely violent, and thus I recommend you to watch it with your family. There's no vulgarity or obscenity in this film.<br><br>There are plenty of emotional sequences which make the film a totally unforgettable experience. Watch the film and you won't find it difficult to guess which scenes I'm talking about. Various emotional, thrilling as well as action packed sequences have been elevated by the brilliant music. <br><br>A TAXI DRIVER is a hard-hitting film which must be seen not just for its overall excellence but also for the message it delivers to its viewers. It's hard and almost impossible to forget the film, as you're left highly emotional &amp; impressed by the time the credits start to roll. In short, a perfect masterpiece from South Korea!","user":"Prashast_Singh","rank":[51,53]},{"title":"You know that a movie is good when you leave it asking yourself \"Why haven't I heard of this before?\"","rating":12,"date":"12 November 2017","review":"1980. The movie starts harmless. A widowed taxi driver in Seoul struggling to make ends meet for himself and his little daughter. He more or less wants to do the right thing in a country where circumstances aren't all that well but you can live your life. The movie pulls a few heartstrings here and there but never too much. It is surprisingly tactful and the director wisely steps back from the story and lets good actors paint a picture of everyday life. <br><br>Enter a German reporter who smells a good story after being tipped off by a BBC colleague who tells him that the generally tense situation in South Korea somehow got worse recently. He needs a driver and the taxi driver needs the money. It is a relation out of necessity and neither of them actually seem to take a liking to each other. <br><br>Both soon have to come to terms with the fact that they put themselves into a situation which has great relevance to their country and their professions. Turning away just isn't possible. \"Doing the right thing\" means that an average person has to find extraordinary courage. <br><br>I have to commend the director and his actors for this eyewitness feeling. It is almost like you're another passenger sitting in that little taxi. You don't watch a movie but you are actually there as it happens. The fact that I was largely ignorant of those events in history makes this movie even more significant. <br><br>The end result is a movie which is well-directed, with competent acting and impressive camera work. I had very little to criticize but a lot to think about when I left the show and that -to me- often is the sign of a truly good movie. Go see it!","user":"Kevin-42","rank":[45,47]},{"title":"A masterpiece","rating":10,"date":"26 December 2017","review":"I've been watching Korean movies for a long time now, and this is just another amazing work of art from Korea.\nGreat acting, Song is one of my favorite actors, he is amazing in this movie, but all the cast is to be praised. The story is very well told, it grips you to the screen from start to finish and it is not a small movie.\nI knew part of the troubled history of Korea by i had no idea this massacred ever existed. The way the director gets us there is no short of an amazing accomplishment, you never feel the movie is too long or just going trough the motions, it involves you in the story, you really feel like you are there.","user":"joaosantos20","rank":[32,34]}]