[{"title":"Ridiculous vs Boring!","rating":2,"date":"20 October 2019","review":"I went into watching this film by reviewing some of the previous reviews - VERY BAD MISTAKE!<br><br>I cannot begin to explain what a complete waste of time and energy this film was. The acting wasn't too bad, slightly stiff. The dialogue - Oh My! The directing and cinematography - all over the place. The story overall - Ridiculous! The film overall - Very Boring!<br><br>Please save yourself the effort and do not even bother wasting your time on this rubbish! I already saved you that!<br><br>This scores a fantastic 2 out of 10 stars!<br><br>Bleh!","user":"grahammwiles","rank":[10,16]},{"title":"Excruciatingly awful","rating":1,"date":"31 January 2020","review":"Within 20 minutes this film went from odd to awful with a local getting belligerent over a simple photo taken by our newcomer (Ben). Following this encounter he is met by another judgmental local assuming some \"big city\" person just wants to take advantage of poor helpless folk. He took a picture and he is a monster? After this the film continues to leave you lost and confused about the \"mystery\" of what happened years ago at the farm our newcomers (Ben &amp; Lydia) purchased from an obviously shady realtor who clearly didn't disclose the dark secrets of their new home. We see Ben and Lydia acting as amateur sleuths and part time creepers searching for answers but only getting cryptic information. To add to the nonsense they are being harassed by the local sheriff who is also short on information and long on judgment and, while people \"don't like him\" he is still holds an elected position... The plot was the only thing that kept me engaged for an hour and a half hoping it would all come together but when the end came I found myself wanting to know who the writers were to make sure I never endure another one of their creations.","user":"jefline","rank":[3,4]},{"title":"Yes, it has warts. But they're GOOD warts.","rating":8,"date":"26 September 2019","review":"Absotively, posilutely, beyond a shadow of a doubt, THE FIELD is DEFINITELY a \"B\" movie. That having been said, it must be admitted that it does exhibit a few of the ailments endemic to \"B\" movies. I make these proclamations up front because I don't want to take a ration about being a shill or some other nonsense about THE FIELD's obvious blemishes and how could I have possibly rated it so highly and blah blah blah. It is what it is, I know what it is, and it's STILL a good movie, it's warts and body odor notwithstanding.<br><br>A young couple from Chicago buy a rundown farm in a very rural area of, if memory serves, Manitowoc County. The husband of the pair is a very talented but unfortunately over-driven chef, and his work obsession was ruining their marriage. The purpose behind buying the farm was not to work it as a farm but to be a bucolic setting for the husband to pursue his nature photography and for them both to take on a more relaxed lifestyle.<br><br>Almost immediately, however, the pair begin to notice some peculiar goings on around the farm. Through his photography, the husband, Ben, begins to notice blurry, phantom figures appearing and disappearing within his photographs out in the overgrown field behind the barn. His wife, Lydia, while cleaning the ramshackle, rundown farmhouse discovers photo albums depicting naked, blood-soaked rituals that have obviously been photographed around the farm, replete with apparent sacrifices and ominous, unknown symbology. The discovery of some of the stained clothing around the house that appeared in the mysterious photographs heightens the tension.<br><br>And if that's not enough, there's a strange old woman, Edith, who lives near the edge of the farm property in a practically collapsing little house. While Edith is apparently harmless enough, she seems to wander around the farm property at will. Trying to be good-natured about all of this, Ben photographs Edith as an interesting subject, but when he shows the picture to the local owner of an art studio space in the nearby little town, George, George all but bodily throws Ben out of the studio and threatens to call the local sheriff on him.<br><br>The entire town seems intensely protective of Edith and practically everyone except the local librarian (and it's anybody's guess why she's an exception...) berates Ben apparently based on the presumption that Ben is somehow taking advantage of Edith. The Sheriff, Roy becomes openly hostile to Ben and begins making actual threats.<br><br>The remainder of THE FIELD covers Ben's enthusiastic attempts (and Lydia's unwilling participation) at finding out just what's going on in that overgrown field out behind the barn.<br><br>Interestingly, there are at least 2 \"namebrand\" actors in THE FIELD. Barry Bostwick plays the cantankerous art studio space owner, George. He's a bit actor, but he has been in practically everything since the early 70s. To my way of thinking, he is eminently forgettable but you probably recognize him immediately because you've seen him on screen for almost a half-century. He's the very epitome of the working actor.<br><br>Veronica Cartwright plays the semi-crazy old woman, Edith. Her claim to fame with me is that she was the character Lambert in ALIEN whose terror and abject stupidity gets Parker (Yaphet Kotto) killed. Frankly, I thought Cartwright looked wizened in 1979 and, to my eyes, she might even look a little better today, 40 years later.<br><br>Anybody wanting to poke holes in THE FIELD in either storyline, plot points or effects is not going to have to peddle very hard. It's a easy, slow-moving target for such criticism. However, given its station in life, budget and origins, I still found it to be one of the most enjoyable films I've seen in a long time. Yes, if you think about the story carefully, many of the little mysteries sprinkled throughout for ambience don't really have much bearing on the actual, central mystery or just simply go nowhere. What did all the Satanism-like rituals depicted in the photo albums have to do with anything? What about that bottomless well that people disappeared into never to return? Where did that fit into the grand scheme? As several recognizable townspeople appear in the dubious images within the photo albums, did everybody just leave those photo albums lying around out at the farm for decades for just any old person to discover and peruse?<br><br>Most of the \"unfolding\" and exploration of the central mystery is just anecdotal \"stuff\" thrown at the audience to maintain the mood and fits in about as well as a brick into a jigsaw puzzle, but it's still fun, still entertaining and a very worthwhile watch in my opinion. Most huge-budget blockbusters nowadays have storylines that don't stand up to scrutiny and count upon the special-effects budget to distract you from the fact that most of what you're seeing doesn't make sense. Holding a LITTLE movie, made with pocket change, to account for the same sin seems arbitrary and actually unfair.<br><br>On my relativistic scale, an 8/10 seems entirely appropriate at least from the perspective of actual entertainment. THE FIELD loses a couple of points because of the giant letdown at the end. There is never a word of explanation of what the phenomenon in the field is all about. We have a happy ending, joyful reunions all around, and all mysteries just left dangling. In all likelihood, if the makers of THE FIELD had actually tried to give an explanation, much of the movie would've lost its mysterious impact and the nature of the mysterious phenomenon would have transitioned to something mundane and probably present in an endless number of other science-fiction movies. Still in all, the journey of exploration through a mystery requires a solution at the end for the journey to be complete. Just abruptly calling a halt to the activities with no answers at the end of a movie is the definition of a copout. All other issues aside, this copout at the end constitutes the only genuinely unforgivable sin in THE FIELD.","user":"S_Soma","rank":[6,12]}]