[{"title":"How Sausages Are Made","rating":9,"date":"13 September 2018","review":"Filmworker provides invaluable insight into how sausages were made, into the workings of the greatest post-studio system director in the world, Stanley Kubrick. Leon Vitali was his right hand. Vitali's story, intimately told in the first person, is indirectly Kubrick's. We see the backbreaking details of what it took Kubrick to make 2 of his 5 perfect, genre-defining films: Barry Lyndon, the defining period costume drama, and The Shining, the defining Gothic horror film. (Vitali did not work on Dr. Strangelove, the defining Cold War film (and satire), 2001, the defining outer space film, or Clockwork Orange, the defining future dystopia film. He did, however, work on Full Metal Jacket and Eyes Wide Shut, lesser films, IMO.)<br><br>The movie consists of real, factual, technical nitty-gritty, not the self-congratulatory generalizations which make up almost all documentaries about filmmakers and their films. This is the mountain both Kubrick and Vitali fought their entire lives to surmount. One comes to see how poor and shabby today's films are by comparison, especially with TV streaming and cable replacing real films. <br><br>Leon Vitali is a fascinating character study, a unique man, in and of himself. One wonders if Kubrick could have made his films without the blind devotion of Vitali. Those who question his devotion miss the point. Vitali was as uncompromisingly devoted to Kubrick as Kubrick was to his films. They both served the same demanding mistress, art.<br><br>If you love Kubrick, you have to see this.","user":"ockiemilkwood","rank":[11,11]},{"title":"A Must See!!","rating":10,"date":"3 June 2018","review":"If you're a film fan or a Stanley Kubrick fan this movie is a must see. Leon Vitali truly gave and is still giving his life to the work of Kubrick's legendary films. Leon does not begin to get the recognition he deserves. He was truly Kubrick's right hand man. There is so much that goes into completing a film project and Leon became the jack of all trades strictly for the art of Kubrick's films. It has taken a physical, mental, and personal toll on his life, but the man is not bitter. In the current day of digital aid Leon Vitali perfected the films without this help. This film displays literally thousands of documents and notes that Leon wrote while filming. He is truly a one man film crew. Other crew members and actors bring the story to life on how this man gave everything he had and more. Fantastic and inspiring documentary.","user":"gator1110","rank":[10,10]},{"title":"Egoless qualities","rating":8,"date":"30 September 2018","review":"It's interesting to see in this documentary the egoless human quality of surrender that make greatness possible, through commitment, hope and trust in other people rather then oneself. Kubrick was only Kubrick because he managed to be surrounded by committed and truthful assistants, family members and friends that trusted not only in his talent and vision, but in his condition as a great human being. And not only Leon Vitali, not only his great handy-man Emilio D'alessandro (not featured in this documentary, even in name form), not only his wife Christiane, but everyone in the Kubrick circle became a filmworker because he knew how to make people work for him. Kubrick, I believe, being such an intelligent person, was not motivated to associate perfection to his name for aesthetic and self-centered reasons, but rather and above all, to express the maximum intellectual capacity of the human race though the medium of art. Working for Kubrick, one of the last real artists of our time, was being in service for art itself, not him, exclusively.","user":"brunodr","rank":[8,8]}]