[{"title":"Disappointed","rating":5,"date":"18 April 2019","review":"I wanted to like this movie, I was so excited about the trailer and I like the idea behind it, it's very original... but it simply didn't happed. Although we can say that Jordan Peele is a filmmaker who thinks outside the box and brings important and strong subjects, I thought the movie was poorly developed. I need to believe in what I'm watching, but there are so many plot holes and inconsistencies that the whole experience was damaged. The metaphors are confusing, the explanations are flat and forced, the writing felt really lazy to me.\nAnd to add, I thought the mix of comedy and horror, that can be made in very harmonic ways, was unbalanced. All the time the comedic moments came up to break the tension, so I was not able to get scared at all and I wanted to be.\nNevertheless, I'd like to point out the amazing acting of Lupyta. Her delivery is always intense and strong, no matter which character she is playing. And I hope Peele keeps his originality, but learns to develop better narratives in the future.","user":"Goonie_BR","rank":[76,89]},{"title":"Spoilers... Ending Complete Ruins the Films Logic","rating":6,"date":"23 May 2019","review":"Spoilers Ahead, DO NOT CONTINUE!!<br><br>Look, it's an interesting film that's an ok way to kill 2 hours. But the ending complete ruins the entire premise of the film.<br><br>The mother we believe to be the good mother is actually the \"evil\" version (who swapped identities in the beginning of the film unbeknownst to the audience).<br><br>1. The original premise - that the mother does not remember what happened in the mirror house, is perfectly logical. She has amnesia due to fear. However, the amnesia and fear does not hold up if the mother was the evil version all along. There should be no amnesia and the only reason for it is to deliberately trick the audience.<br><br>2. If the mom was the evil version all along, she shouldn't be scared of a \"shadow\" of herself as she claims. Sure she could be scared (of being revealed to be a fraud by the true her) but not of a shadow. Again, purposeful misleading to set up the twist.<br><br>3. Why does the good version go insane and deciude the only way to get revenge on her evil self is to raise an army of evil duplicates that murder their good halves? Again, contrived and makes no sense.<br><br>4. Why didn't/ couldn't the good version of the girl use the escalators to escape the evil realm? This really doesn't make sense.<br><br>5. How the hell did all of the evil versions have enough food/ water to survive?<br><br>6. Surely not every single copy of everyone in the world was stored in the one bunker shown. So how did the \"Good\" girl convince all of the evil copies (of all the rest of the world) to arise??<br><br>There are probably many many MANY more issues with this film. But god does it destroy itself trying way too hard to set up a profound twist that is just completely illogical.","user":"callumfaulkner","rank":[1,1]},{"title":"So much potential...so much confusion.","rating":7,"date":"21 March 2019","review":"I liked the movie a lot. I thought it was very well shot and very well acted, and I can appreciate Peele's subtle homages to previous horror films throughout. However, the story itself is very weak and a bit of a mess.<br><br>A big concern for the main characters, as well as for the viewers, is why these doppelgängers (known in the movie as The Tethered) are attacking. So we are lead from almost the beginning, to want those answers, and when they're actually delivered, it's pretty unsatisfying.<br><br>The logic (or lackthereof) of The Tethered's existence and motivation is very messy and ultimately ruins the final conclusion of the film, because it leaves too many holes in the story that need to be answered.<br><br>If Peele had removed the explanation element as to the Tethered's existence, functionality etc. it would have made it a better story in my opinion. It becomes then a survival horror film, and leaves more to the viewer's imagination and thoughts as to the how and why, and that could even leave some good opportunities for symbolism etc. which Peele is known for. Not to mention it would have made the final conclusion even more shocking, compelling and thought provoking, and viewers would be talking about it for a long time, in all the best ways. Instead we're left talking about the many plot holes in the explanation.<br><br>All in all, as a standalone movie, it's really good and I can appreciate it for what it is, despite some of it's plot points I'd like further explanation on.<br><br>Also, I don't really think it can or should be compared to Get Out in any way because they're two completely different films, in genre and the overall tone. Us is a horror film and Get Out is a social thriller. So it's unfair to pit them against each other, or put them in the same league, even though they share the same director. I feel like people looking to do that are going to end up disappointed with this movie no matter what.","user":"thejilliebean16","rank":[938,1]}]