[{"title":"True to the spirit of Cervantes","rating":8,"date":"1 December 2019","review":"A neurotic loner who has raised himself on books instead of real life, loses his sense of reality and thinks he is Don Quixote - who, in Cervantes novel, thought he was a knight several hundred years to late for knighthood.\nThe soul of the original story is present all the way. But instead of fighting windmills, this modern version lets Don fight oilpumps, and his Sancho Panza is an overweight outsider, and so forth. Things go from hilarious to embarrasing.\nThe modern world slowly catches up in the last quarter of the movie, and he might end on antipsychotic medicine and antidepressants. But things take a turn once again.\nThis might not be the masterpiece of the year, but it is areal good antidote to the navel-gazing paranoia that haunts many american movies and TV-shows these days. This is about accepting the weirdness of the world, so that you can live in it and with it.","user":"capografik","rank":[3,3]},{"title":"I expected better to be honest.","rating":5,"date":"20 October 2019","review":"Based on Miguel de Cervantes' bestseller El Ingenioso Hidalgo Don Quijote de la Mancha (The Ingenious Gentleman Don Quixote of La Mancha) this movie portrays a modern Don Quixote, a man reading to much chivalric romances, losing his mind and deciding to become a knight-errant to revive chivalry. Tim Blake Nelson did a good job playing Don Quixote. After The Ballad of Buster Scruggs where Tim Blake Nelson also delivered he plays another weirdo. Personally it isn't really my kind of humor. It might work for awhile but not for an entire movie. I'm devided about this movie, the acting was good, the vocabulary was the funniest part, but the story is a bit slow and not that really entertaining.","user":"deloudelouvain","rank":[3,5]},{"title":"Quirky and delightful","rating":10,"date":"31 December 2019","review":"Eccentric and hilarious while touching on heavier themes like mental illness, The True Don Quixote puts a modern spin on a classic story that will leave viewers warmed and pensive. Recommended for those who enjoy witty, ironic dialogue and the charms of discovering the extraordinary within the ordinary. (think Scott Pilgrim vs the World, Little Miss Sunshine)","user":"harperaltshule","rank":[1,1]}]