[{"title":"From a certain angle.","rating":10,"date":"13 September 2018","review":"This is not a \"slow burn\". It is a crafted piece of film put together to tell a story of a man who yearns to live in a part of society he can never truly be a part of. If you watch this film with that thought in mind, you'll understand it better.<br><br>Dr. Faraday we learn early on, is a small town doctor who prides himself as being a respectable, proper gentleman. He does all the little things required to be a part of upper society but can never really be upper class as he is the son of a lower class family whose mother was a maid. <br><br>The defining moment of his childhood (shown in the film) was a visit to Hundreds Hall for a party thrown by the well-to-do Ayres family for their young daughter Susan (Suki). he notices the opulence, the pomp and circumstance of it all. The event is from a different world than the one little Faraday lives in. He knows he doesn't belong but he yearns to be a part of this group of people. A photograph, where Suki jumps in front of Faraday is a small example of this exclusion.<br><br>Through a coincidence, he is able to get into the house that was restricted to outside guests, and delves further into the life he cannot possibly attain. In the kitchen he literally gets a taste of the sweet life when he licks cake batter off a spoon as his mother talks with some of the maids. <br><br>While she is distracted, he wanders off through the house, admiring the size and luxuriousness of the interior halls. He arrives at the grand staircase and he thinks deeply about wanting nothing more than to be a part of this family; living in this house. He wants it so bad that he breaks off a stone acorn from the wall. All the while, Suki is watching, smiling at this foolish little pleb of a boy.<br><br>His mother find him and confronts him on his disappearance. He reveals the acorn and she slaps him across the face for his doltishness. He should not even have dared to dream of being a part of this world.<br><br>As we move into the present day with Faraday now Dr. Faraday, he has grown up but he is, in a lot of ways, still that little boy. That little stranger who does not belong in that house with that family. Understanding this will help to understand the movie. It is not a supernatural horror film. It is a film about a man trying desperately to be part of something he cannot ever really be a part of. As hard as he might to be a refined British gentleman with glowing credentials, he is still the lower class country boy. <br><br>When Faraday meets the Ayres family, they, like the house they live in, are all in various states of disrepair and neglect.The mother has never gotten over the death of her first child Suki. The son, and heir to the estate, has been physically damaged in the war. The daughter, frumpy and tired, has let herself go, resigned to the fact that her mother loves her dead sister more.<br><br>Upon meeting and then visiting the family often, Dr. Faraday builds a rapport that he hopes will bring him closer to that childhood desire of being a part of this class. However, even as they are all shadows of their former selves and he is a rising star amongst his middle class peers, Dr. Faraday never attains their upper class status.<br><br>As each family member side-tracks him from that ambition, he coldly takes steps to eliminate them. We never see on screen the wicked deeds he executes but he methodically gets rid of anyone in his way of winning the prize he so desires. He banishes the son to an asylum, he fakes the mother's death as a suicide, he murders the daughter who turned down his marriage proposal. <br><br>In the end, with the Ayres family gone, the house is left desolate and barren. There is no furniture and the rooms are littered with dead leaves, blown in from the outside through broken windows. Dr. Faraday holds the keys to the house suggesting he its the owner. It it literally a hollow shell of its former glory, but to Dr. Faraday, the house is a prize worth having no matter the derelict conditions. <br><br>The last shot of the film is a teary eyed little Faraday, standing at the top of the grand staircase looking down as if to suggest he never stopped being that sad, little boy who just wanted so desperately to be a part of something.","user":"mattdzolan","rank":[201,233]},{"title":"This Explains The Movies Metaphors PERFECTLY!","rating":10,"date":"11 September 2019","review":"There's a sinister secret nested snugly at the center of Lenny Abrahamson's \"The Little Stranger.\" In trailers, this adaptation of Sarah Waters' novel seems a spooky haunted house tale set in the austere decadence of early Windsor-era England. For most of its runtime, the film appears a gothic romance in which the mild-mannered Doctor Faraday (Domhnall Gleeson) must combat the unknown evil inhabiting the illustrious Hundreds Hall so he might marry its gruff but lovable heiress, Caroline Ayres (Ruth Wilson). But the haunting final image of \"The Little Stranger\" reveals something more cerebral and starkly feminist is at play within this unconventional horror story.\n\"The Little Stranger\" reveals the Ayres tragedy through the eyes of Faraday, a \"common village boy\" who grew up in the shadow of Hundreds Hall and became a respected doctor with a gentleman's manners. Through a reserved voiceover, he introduces audiences to the once affluent family whose fortunes have fallen-as their once pristine home has-into ruin. Still, Faraday is enchanted by the old house and by Caroline, a \"terribly brainy girl\" on the verge of spinsterhood, having squandered her promise and youth looking after her mother (Charlotte Rampling) and war-wounded brother Roderick (Will Poulter). Stoic and stalwart, Faraday provides a shoulder to cry on, a voice of reason, and even his hand in marriage. But he is not to be trusted by the Ayres or us. For Faraday is not the romantic hero he paints himself as, but an unreliable narrator and the source of the spiteful spirit that torments the Ayres to death because of a ferocious form of toxic masculinity.\nThe final shot of the film reveals that the poltergeist of Hundreds Halls was a manifestation of Faraday's decades-long desire to possess the grand home. His passion for the place grew into an intense sense of male entitlement, believing deeply he was owed the thing as a reward for wanting it so desperately. And so a territorial and violent force was sparked. Over drinks, a colleague explains that extreme negative emotions can cause a subconscious break that could birth a poltergeist. For Faraday, this fateful moment occurred 30 years before, when he first snuck into the exquisite foyer of Hundreds Hall and broke a plaster acorn from its elaborate décor. In flashback, a foreboding rumbling precedes the horrid crack of plaster. Recalling it to Caroline, he rationalizes, \"I wasn't trying to vandalize. I was overcome.\" Faraday compares himself to a lovesick man stealing a lock of hair from the woman he fancies. Caught up in his own desires, he ignores the violation and theft entailed in each act, reframing it as romantic and himself as the helpless victim of passion. As absurd as it seems, Faraday basically victim blames the house for his violation of it, suggesting Hundreds Hall was dressed too provocatively to be left unmolested.\nFaraday believes his passion for the house excuses this crime. But there will be more. And they will become more violent. The first victim of his poltergeist is young Suki Ayres, punished for witnessing his embarrassment at being slapped by his mother for his vandalism. Mrs. Ayres notes that was the very day her beloved first-born became mysteriously ill, before withering away to death. While Faraday went off to grow up and become a doctor, his poltergeist has lurked in the house, quietly resenting its residents. Upon his return to the village, the paranormal activity at the Hundreds Hall becomes more aggressive, a coincidence Caroline remarks on without understanding its significance. It was a poltergeist outburst that led to Betty calling for a doctor, which brought Faraday to the Ayres door. Every paranormal event after that can be seen as violent retaliations whenever Faraday feels rejected.\nThe first comes during a cocktail party, where a little girl is abruptly mauled by Caroline's dog. The timing suggests this is no accident. Though the girl has been pestering the pet relentlessly, its off-screen attack occurs the moment after Faraday realizes the event is a matchmaking setup meant to pair Caroline with an arrogant, new-money ad-man. The hurt to his pride is taken out on the pretty blond girl, just as it was with Suki. The gruesome and inexplicable assault benefits Faraday three-fold. It scares off the would-be suitor, gives the doctor a chance to impress by swooping in to mend the wounded child, and offers an excuse to euthanize Caroline's beloved pet, eliminating one more rival for her affections. Whether Faraday realizes it or not, he is working in tandem with his poltergeist to achieve Hundreds Hall. When the polite and socially acceptable methods fail, his subconscious lashes out in violence. And their next obstacle and target will be Rod.\nThrough voiceover, Faraday expresses a thinly veiled disdain for the limping man of the house, sneering, \"I couldn't help but think the house deserved better.\" Implied is that Faraday is the better the house deserves. After all, Faraday is a dapper and dashing gentleman, while Rod a marred, drunken recluse with no hopes of finding a wife. Using his position as a trusted friend of the family and respected doctor, Faraday pushes to have Rod committed, arguing his plans to sell off part of the estate are deranged. When this fails, his poltergeist sets Rod's bedroom ablaze, nearly killing him and making him seem an unhinged danger to himself and others. So, Mrs. Ayres and Caroline take Faraday's recommendation and have their lone male heir exiled. The very next scene shows Faraday, smiling like the cat who caught the canary, as he cuts the Christmas roast. Blithely taking over the role of man of the house, he rejoices in voiceover, \"It made me feel-just for a moment-a part of the life of the house.\"\nWith Rod out of the way, Faraday ramps up his efforts to woo and wed Caroline, taking her to a dance, where his POV shot of watching her dance feels ominous, like a predator zeroing in on his prey. \"What the house needs is a dose of happiness,\" he crows in his marriage proposal. But after Mrs. Ayres makes it clear that Faraday would only get this house over her dead body, his poltergeist terrorizes her with chilling sounds and vicious cuts, driving her to suicide. And once Caroline rejects him too, her death is imminent\nAfter she breaks off their engagement, Faraday laments, \"Hundreds Hall was lost to me ... as was Caroline.\" At this moment, our unreliable narrator's true priorities are laid bare. This was never a love story about boy meets girl, but boy meets house. Caroline was a tool to him. That the object of Faraday's desires is a house and not actually Caroline emphasizes the dehumanizing nature of male entitlement, as entitled men do not regard the women they crave as people who have autonomy and the right to reject them, but as a thing they can grab. Their desire outweighs the feelings of its object. But once Faraday realizes that his manipulations and social niceties have failed to win him the prize of the girl-and by extension the house-his cool veneer cracks, unleashing into a flurry of fists and shouting in his car while his poltergeist pushes Caroline to her fatal fall off the balcony.<br><br>Through his plaintive voiceover, Faraday would have us believe that he is a romantic hero who fought for love and lost. He and his poltergeist never come face-to-face in the film, so perhaps he truly believes it. But \"The Little Stranger\" sees through his subterfuge. For even if Faraday is completely ignorant of how his true intentions influence the poltergeist, he knowingly uses his position of power as a doctor, a friend, and a gentleman to manipulate the Ayres to reach for his goal, no matter the cost. Yet there are moments where it seems he has some hint.<br><br>Looking back on his first day at Hundreds Hall, Faraday says, \"I could not help but imagine I belonged. A proper little gentleman. Of course, I was no such thing.\" On the surface, it appears he's speaking about how his clothes made this commoner seem suitably posh. But on reflection, this line also speaks to his façade of gentility in adulthood. Outwardly, Faraday is calm, patient, and magnanimous toward the Ayres family. Hidden is his dangerous dark side that would rather see them dead than reject him, that would rather see Hundreds Hall abandoned than without him. Worse still, Faraday gets away with all his crimes, because who would believe such a nice, respectable man could be capable of such evil?<br><br>\"The Little Stranger\" is a horror story not about evil spirits or haunted houses, but about the too real terror born from toxic masculinity, which blinds men to their trespasses and threatens women with objectification and violence. The film sounds a warning, begging some to look past the nice guy veneers, and others to search the darkest corners of their desires. For we are not always the heroes we imagine ourselves to be.","user":"brentkingery-937-541108","rank":[55,68]},{"title":"it's missing something, but I'm not sure what","rating":6,"date":"13 September 2018","review":"I'll be kind to this film in this respect: Lenny Abrahamson didn't set out to play by the usual (or at least de rigeur) rules that govern a lot of creepy-old house stories, as this is about 90% of the time a drama with some touches of very staid and not-all-there romance, and then in the last third he and his crew try their hand at a couple of sequences where some supernatural entity attacks a couple of the characters left in the Hundred's (sic) Hall in this small provincial English town (which you know is far from most civilization as characters talk of London like it's some far away distant land, and this is in the 1930's I think).<br><br>The studio who put this out may have been between a rock and a hard place: how to sell a movie that has the veneer of Gothic Horror, but doesn't have the passions of a Jane Eyre (I believe Focus Features, which also put out the 2011 Eyre, put this out too), or Crimson Peak (which I now love even more for just GOING FOR IT as far as a massively extravagant stylistic experience). And for some reason, perhaps due to the bankability(?) of Domnhall Gleeson - who I like a lot generally, especially now as General Hux in the new Star Wars - it was released on more screens than it should have been at an inopportune time. I wish it had done better in some capacity, maybe at an earlier time in the year when people might not be busy with the Back to School season, or with less awards-fare competition, but.... it may just be that it's \"Alright\" quality was going to leave it struggling. Not to mention that poster; like, what the hell IS that? Terrible.<br><br>Anyway, The Little Stranger isn't as dull as you've heard, at least if you stick with it past its opening half hour. Except for a somewhat nutty and make-up overloaded performance from Will Poulter, it starts off as dry as an eraser-board. Maybe some of it is due to the mood of this emotionally tight English feeling of the early 20th century, or the place this Hall is at in general, but it is hard to get into this mood at first with the color scheme on the gray side (which, yeah, again it is England on any given day, I get it). Once the plot really kicks in as far as it goes, that this Dr Faraday becomes ensconced with this family, most especially Ruth Wilson, and they showed a bit more of Faraday's backstory of his attachment (or his unspoken terror) of the Hall from when he was a boy, then I started to want to know more about what was going on and where it goes to.<br><br>And with Gleeson here, he's... good, but something I can't really vocalize or think right now holds him back somehow. That may be by design, either in the writing or from Abrahamson, but he is *so* reserved that you suspect he may be hiding something, until it is beyond the point of caring what it may be about. He may be both entirely right *and* entirely wrong for this part, if that makes sense, as a doctor who is supposed to ignite something in the Wilson character - will she leave this place, maybe marry, find some other path in life than staying in this house, and she actually has a more interesting arc in that respect than he does -but ultimately there's complications if nothing else from the Hall itself... or the perception of things going on in it. So I'm not going to say he's miscast, as he does what he can, but maybe it's some misdirection somehow, or that if there was something more in the book this was based on it never got off the page.<br><br>Oh, don't get me wrong, I'll still be happy to see a performance from him that is just 'Okay' than by many others who don't rise up to the challenge. And Poulter, Wilson and Charlotte Rampling are all doing excellent work from what they're given (Wilson particularly near the end reminded me why I grew fond of her difficult character on The Affair). And the Hall itself can't help but he an intriguing location to shoot in. However, when this reaches into its last third, I can't help but feel its dips into horror take away from what would be a more... I'm not sure, emotionally complex given how much the filmmakers try to make it more about the characters than about the kind of schlocky jump scare horror effects that go out to the popcorn audiences. In other words, I get why it does become a horror movie in its last third, but something feels lost in the process.<br><br>This may seem like a higher star rating than it deserves, but I didn't dislike this film. I think Abrahamson is too skilled at making good scenes and some impactful images (i.e. Poulter burning that bookcase, the dance scene) for it to be a total disappointment. That said, after the one-two punch of ROOM and the underrated rock and roll trip FRANK, it feels like a step down in some way that's hard to articulate even after stepping out of the theater.","user":"Quinoa1984","rank":[25,30]}]