[{"title":"\"Why do we float through this weird thing called life without living?\"","rating":8,"date":"17 May 2019","review":"Be yourself. Be true to yourself. Don't settle for what you are not. Quotes from this movie resonated with me. My mind has been wandering on lines like: \"Why do we float through this weird thing called life without living?\". Live life and don't simply exist. Like the Professor says: \"You got one shot at this. Don't let a moment of it slip by.\" A genuine performance by Johnny Depp and the whole cast. I enjoyed the writing. With the emphasis on observations and the thoughts of the mundane, relationships and the honesty of people. It also includes the best acting I've seen from Danny Huston. I full heartedly bought his friendship with Depp's character. The story starts with a slightly quirkier tone, but gets more and more real as you get to the second half. Depp plays the broken man and you can see that pain and regret in his eyes. A very human story that eventually tugged at my heartstrings. Some scenes could have been handled differently during the first half. But the deep thoughts and confessions presented later was able to bring it all home. I do feel better for having been on this little journey of a man and his emotional bender. It's very unfiltered, so it's definitely not for too young minds. You gotta be somewhat ready the face hardships of existence. While not perfect, the director and the whole crew still made one thing very clear: That this one was from the heart.","user":"paulijcalderon","rank":[140,159]},{"title":"touching, funny and a brilliant mix of good directing and high class acting.","rating":8,"date":"10 July 2019","review":"Just wow,,\nfirst time seeing Johnny Depp into this level of Drama since Secret Window ,, add to that his lighthearted comedy was a perfect addition to the original genre.<br><br>The plot is not new (of someone dying of cancer trying to live his last days to the fullest) but it all looked original and genuine and that's not because of the cast , but also because of the script itself felt quick, connected and easily followable ... in fact i have not been this focused with a movie screenplay in a while ,, it was just good.<br><br>As for tha cast ,, i don't think it needs to be said .. Depp is as always the \"captain\" of our hearts :D . he was a real \"beast\" in here ;) , the other cast members from Danny Huston to Rosemarie DeWitt and Ron Livingston they all made a very good effort making this not look like a solid rigid drama .<br><br>Final one word .. Recommended .","user":"Aktham_Tashtush","rank":[47,55]},{"title":"What's with all the hate?","rating":8,"date":"28 November 2019","review":"Well it ain't actually my traditional type of review, just me talking about the movie a little. I went to IMDB to rate the movie and was surprised to see it getting only a 6 then I was even more surprised to see it featured in WatchMojos \"top 10 worst movies of 2019\" list.<br><br>This isn't the type of movie that everyone can enjoy equally and I feel the movie speaks volume if you're suffering in life and going through stuffs as that's exactly what this movie deals with. This movie spoke to me on a spiritual level for those same reason and I cannot help but love this and comply.<br><br>The story is plain and simple as this review is gonna be. I was genuinely surprised at how comedic this movie is. It is hilarious at times and equally sad and heartbreaking at others. There's this weird balance that works out so well. The cinematography is not groundbreaking but does its job impeccably. The score works brilliantly and the whole cast gave a very adequate performance.<br><br>I'm the biggest Johnny Depp fan I know and even I have been saying how he is a shadow of his former self. He definitely gave one of his better performance of recent years but that performance was really special to me. There are a lot of actors that could've played the lead role but Johnny Depp here worked perfectly. For starters it really goes well with his Jack Sparrow shade and for once benefited from that. And secondly its because of his real life struggles and hardships that has really been taking a toll on him for quite a long time. It is probably the most realistic version of Johnny I've seen and there are parts where I swear that he didn't feel like he was acting, as if the lead character IS Johnny Depp and going through the pain. He has always been good at hiding his real self and immerse into eccentric roles, this time he showed his real self and I love the man even more now.<br><br>Well that's pretty much I wanted to say. I already said that this isn't going to be one of my traditional reviews where I go in depth on the movie. I cannot give this movie more than an 8/10 due to technicality and my grading style. But rest assured this definitely had quite the impact on me. I mean its hard to remember a movie where I simultaneously broke into laughter and had a hard time holding in the tears about a person dying. Definitely watch this movie, hope you guys enjoy it as much as I did!","user":"redcanofevil","rank":[24,27]}]