[{"title":"The History of Propaganda","rating":8,"date":"14 February 2019","review":"Saw this at Berlinale and was impressed. Agnieszka Holland created a strong historical drama, employing artistical license here an there. But the main points (different from what user-973-741969 claims in his review) are true. Blasphemy it is only to those who still worship Stalin.\nThe movie follows political advisor/journalist Gareth Jones. After losing his job with the british foreign secretary in London he tries to reeignite his career through an interview with Stalin. And why not since he already interviewed Hitler and Goebbels (where the movie lazily unterplays his admiration for the pre-war-Nazis. Sadly Jones didn´t live to see their downfall and could never reevaluate his naivety). In Moscow, Jones contacts NYT-Reporter Duranty, who is well connected an a staunch supporter of Stalin. Jones doesnt make it to the Soviet Leader but can board a train south to inspect the industrialisation of the Soviet Union. But he escapes the agents that accompany him and travels on his own through Ukraine to witness the Holodomor, a famine that cost millions of lives as a result of Stalins communist reshaping of agriculture in 1933 and was until then mostly unheard of outside of the USSR - and even in the SU. Back in the west Jones has a hard time to prove his allegations. His camera was taken, Duranty, who has a much better reputation calls him a liar and even the british government doesn´t want to risk the lucrative economic relations with the USSR. Holland focuses only partly on the famine and more on the role of stalinist propaganda and the gullability of western media and politics, that swept this catastrophe under the rug for decades. It´s a thrilling movie that doesn´t have the budget to show millions of dead and instead focuses on intimate an gruesome details. The luxury of the elites (western &amp; russian) in Moscow are in stark contrast to the suffering of the peasants. \"Mr Jones\" brings us to the beginning of worldwide propaganda and fake news strategies where a journalists live is cheap and the people are just pawns in hands of big powers.","user":"marcus-fliegel","rank":[70,83]},{"title":"Back in the USSR","rating":9,"date":"9 February 2020","review":"This is a powerful film which I'm afraid few people will watch. Even those who watch it, may feel the situations it portrays are exaggerated or completely made up. They are not. The problems caused by Stalin in Ukraine are, if anything, downplayed.<br><br>But beyond the historical accuracy are the questions about the behavior of the people and their morality as it is portrayed in the film. Did diplomats and politicians really behave like this? Not only did they behave like this. They continue to behave like this. I've worked in government NGOs overseas and I've seen the insincerity of most diplomats close up. I've also experienced their ability to blind themselves of the truth if the truth endangers their high paid positions.<br><br>There are people out there now who know the truth and who are being told to keep quiet. There are people I've known who were undermined when trying to do what was right. So, this movie is telling the truth for them. You may not like what it has to say, but who says the truth has to be pleasant.","user":"SteveMierzejewski","rank":[23,30]},{"title":"Difficult role of journalist right before war","rating":8,"date":"7 November 2019","review":"Another very good film presenting the fight of the truth against geopolitics and money. Based on facts with an important narrator. Recommendable!","user":"januszkiewiczadrian","rank":[22,30]}]