[{"title":"Well done but NBC screwed the pooch","rating":5,"date":"2 April 2018","review":"Dear execs at NBC<br><br>I love your idea of presenting live Broadway shows. But it really ruins the moment when a sad song like \"I don't know how to love him\" is followed by a PCS commercial and a KFC commercial and commercial after commercial after commercial. If you are going to do keep doing things like this, and I hope you do, they need to be done with limited commercial interruptions. The overrun of commercials just kills this for me.<br><br>Well, that's not truly fair. The hyped up crowd is taking away from the show as well. They really need to take it down a level or four. Maybe a Prozac placed on each seat when they walk in? Otherwise, the cast is very good, as expected, and I enjoy the staging. But I am furious at NBC for all the commercials. You can't treat a live performance of a Broadway Musical like your other shows.<br><br>2020 edit - NBC has had two years to listen to the complaints, and while they have the power to reduce the number of commercials, which ruins the flow, they instead decided to re-air and if anything they increased the number of commercial breaks. Please, NBC, no more airing of live Broadway musicals. You obviously don't have a clue how to do them.","user":"williamjpenfold","rank":[89,106]},{"title":"Ted Neeley fan","rating":7,"date":"2 April 2018","review":"I'm a professional musician, and JCS is my favorite musical. I've seen it twice live with Ted Neeley. I thought the overall production was good. I liked the ensemble and excitement of the live televised show. For me, Dixon was the stand out and really made the show worth watching. I liked Bareilles and thought Alice Cooper was a cool choice for Herod. I think John Legend has a beautiful voice, and there's a sweetness to him.... but I don't think he was the right choice for this role. I would've liked a stronger presence for the role of Jesus. He seemed almost uncomfortable, while the rest of the major roles were filled by people who really owned them. I appreciated seeing this on tv, even with all the commercials...","user":"seraichyk","rank":[47,54]},{"title":"Great performances","rating":7,"date":"2 April 2018","review":"I thought the choreography and setting were excellent. The musical performances were stellar. <br><br>My only complaint are the advertisements. They wreck the flow of the show.","user":"ladyaedin","rank":[41,47]}]