[{"title":"Amateurish","rating":3,"date":"5 October 2018","review":"I watched this film based on on the 2 glowing reviews already posted. All I can say is that these people must be easily pleased and satisfied to watch amateur actors playing out their roles in an unconvincing manner. Special effects, if that's what you can call them, looked like a schoolkid had created them, obviously no budget for anything decent. Switched off after an hour as I could not justify wasting another 40 minutes of my life on this.","user":"stevewennell","rank":[8,13]},{"title":"Much better than the first","rating":6,"date":"5 October 2018","review":"This was a big improvement over the first, and moves the complete narrative of both movies alone nicely. I'm a lover of anthology movies too though, as well as low budget horror stuff in general. So considering that, I thought the effects were actually pretty good. Especially since there wasn't an egregious amount of CGI thankfully. <br><br>You know what to expect with the acting and such with something like this, so don't act shocked when it's very amateur. But the villains and stories were kinda fun, even if it starts to fall apart at the end. Actually the soundtrack was pretty good too now that I think about it. <br><br>Anyway, 6/10 and a solid Halloween watch if you're into anthology or low budget horror!","user":"TheBeardedWonder","rank":[7,12]},{"title":"A big improvement from the first in the series...well worthy watching for horror fans.","rating":18,"date":"18 November 2018","review":"I believe in giving lower budget films a chance and I respect what a filmmaker can do with the money he has available and some good old-fashioned imagination. Some extremely successful films have been made on relatively small budgets; 'The Blair Witch Project' ($60,000 budget) and the first 'Halloween' ($300,000 budget) come to mind. The first movie in this series 'Terrortory' was...how do I put this nicely...well it was pretty bad all around...especially the acting and directing, yet it must have made some profit to warrant this sequel. I felt this movie was a marked definite improvement from the first one, just guessing but perhaps Kevin Kangas, the writer/direcotor, had gained more experience and money to work with to make 'Terrortory 2\". The lead actor who played the hiking man mapping out the terrortory was pretty good in the role, since he tied the stories together and had the biggest part, it was important that at least he be a better actor than the others and he was. His name might be Richard Cutting I'm not really sure by the cast listing at the IMDB. All the stories were imaginative to various degrees and in a strange way made sense in keeping with the over all weird main storyline. Even the idea of the Terrortory having some limitations and buffer zones made sense and added to the fun; you have to give the characters some sort of hope to make the story more intriguing, IMO. Having safe zones was a great idea. I do not like gore fests so I could have done with less gore and more atmosphere, but I guess the filmmakers were playing to a different crowd than me in that area. Luckily the gore was not overwhelming. This is a good movie for Halloween viewing especially. (On the negative side the filmmakers did bring down the overall quality of the film with that low class credit comment at the end saying \"All of the actors, actresses, and crew who came out and suffered under my tyrannical iron rule for nothing but snack bags, water, and five minutes with the on-set hooker\", we didn't find that funny, it made us cringe, and knocked down my overall opinion of the filmmaker's humor; also it made the film seem more low budget and trashy than it might have.)<br><br>I did like the ending and how they tied the mapmaker into the story. I hope they bring that character back for any further sequels. I also recommend they continue to put more effort and gained experience into any sequel to continue their climb into a better quality of film for the masses.<br><br>I've been a fan of horror anthologies for decades, big budget and small and I have to say this was worth my time and I did enjoy it overall. I even found myself looking forward to a sequel. I'll give it a 6 out of 10 stars.","user":"Mikel3","rank":[3,4]}]