[{"title":"very enjoyable","rating":8,"date":"26 February 2018","review":"I really don't understand the dislike for this movie. I enjoyed the back story, superimposed over the beginning of the conflict on the train. Eastwood shows us how these boys lifestyles contributed to putting them in the perfect frame of mind and experiences to thwart this particular attempt at terror. I've seen people commenting on their acting abilities but honestly, I thought they did better than some people who actually call themselves actors. Eastwood and these three men did a great job with an amazing story and I was very glad I took the chance on it","user":"kristen_225","rank":[202,264]},{"title":"Know what you're getting","rating":6,"date":"12 February 2018","review":"I have to confess I didn't research this film to any great extent before I sat down to watch it. However, the two things I did know - mainly courtesy of all marketing - was that it was based on the true story of three men who foil a terrorist attack on a train and that it was directed by Clint Eastwood. Both seemed like equally good reasons to watch the film. And - technically - both of those statements are correct. However, I guess because the promotional material seemed to focus so much on the 'terrorist attack' that I expected something more like 'Under Siege 2' or 'The Commuter' than what I got.<br><br>The film starts off with the three Americans as young boys and shows us how they meet. First of all I wasn't that impressed with the acting ability of the boys and was quite pleased when this segment ended. Then we get our first glimpse of what's to come, i.e. something bad happening on a busy commuter train in Europe. And then we're back to the boys again. Only now they're young men and we see what they're doing once they've left education. Only we mainly just focus on one of the three. The other two seem to get relegated into secondary characters. Cue another flash-forward to the terrifying events on the train and we get back to the men travelling round Europe. Then the bit on the train happens. Then the film ends.<br><br>Now, you may think I'm being quite cynical and scathing towards the film, but I did actually enjoy it. I just thought it was going to be something it wasn't. Once the child-actors are out of the way the adults take over and they're all decent enough heroes who you find yourself able to root for. Clint Eastwood's direction is nothing special, but it's functional approach works well with the subject matter, i.e. overly-stylish camerawork and effects would seem well over the top and out of place in this film.<br><br>It's not a bad film, but I think any audience needs to know that what they're sitting down for is some sort of drama about regular guys (who then happen to get caught up in a terrorist attack). If you go in expecting 'Die Hard on a train' then you're going to leave thoroughly disappointed. It's a slow, character-driven piece that is deliberately underwhelming in order to show how real life terrorist attacks differ to the Hollywood representation. If you're in the mood for something slow, serious and with meaning then you should enjoy this.<br><br>","user":"bowmanblue","rank":[61,77]},{"title":"Underrated by all - enjoyed the bravery and real guys who were absolute heroes","rating":9,"date":"6 March 2018","review":"All the reviews by the professionals said this was just an ok film. Yet, having read the story of Eastwood deciding to star the actual \"stars/heroes\" I thought it might be worth seeing. Also, the three soldiers who were on the train meant to be having a trip through Europe for pleasure and their \"being in the right place at the right time\" was amazing. They actually were so genuine and the film managed to convey the decency as well as their bravery in an incredible moment. \nWhy this got poor reviews I do not know. Maybe such heroism is not \"cool\". But as a normally liberal older person, I so agree with Francois Mitterant that we should attempt to \"do something\" and not cower if possible. The three brave men were wonderful to watch in the film as well - not bad \"actors\" at all!","user":"melaniewoolfenden","rank":[156,230]}]