[{"title":"Surprisingly Funny","rating":6,"date":"16 June 2019","review":"I had zero expectations going into this movie. It's so dumb although I haven't laughed this hard in a while. It's not a masterpiece by any means but destined to be a cult classic. Pretty good bad acting and Christopher McDonald is great as usual.<br><br>If you don't take life seriously you'll probably enjoy this movie.","user":"gwrmarines","rank":[6,11]},{"title":"Wow! Old Dark House meets Waiting For Godot in Porno Land!","rating":10,"date":"6 July 2019","review":"I rented Deep Murder expecting a fun homage to bad 1980s sexploitation and horror tropes, but discovered instead a brilliant postmodern fairy tale on Modern American culture which had my jaw on the floor the entire time. In this smart and snappy deconstruction of a \"sex-horror-comedy,\" an assortment of charismatic dopes find themselves trapped in an Old Dark House-style murder mystery which lurches into a harrowing Waiting For Godot-style existential crisis of anguished self-awareness. This bold conceit succeeds wildly due to an amazing screenplay, brought to life by an exceptionally strong cast. (Seriously, this is a dream cast; you will fall in love with all of them.)<br><br>The adorable, but seriously troubled characters all start out as easily recognizable genre movie cliches (Horny Nerd, Sexy Mom, Clueless Dad, Dumb Babysitter, Pretentious Scientist, Arrogant Detective, etc.), ego-fueled, sex-addicted fools trapped in a lust-driven purgatory (nicely embodied by one of those horrible faux-Spanish mobster mansions nestled in the San Fernando Valley). One by one, these poor saps look into their own soul-mirror and realize that they are awful, stupid even worthless people, who are then stuck in the quandary of, can they do anything about it?<br><br>Thanks to the introduction of sudden, violent death into their stifling, insular world, these damned souls each become slowly aware of who they are, or rather, who they are not, and profoundly painful crises of confidence ensue. With the exception of the killer, who refuses to grow up and thus exposes his profound failure as a human being via cowardly acts of meaningless violence, everyone slowly, painfully strives to become a better person, struggling valiantly to rise above \"the horny animal.\"<br><br>Along the way, the film offers a lovely lesson to anyone interested: regardless of who you are, or what your limitations, personal evolution is always attainable, and always desirable. As long as one breathes, one can improve one's self. The first step in this personal apothesis is discarding one's low, sexual self for something more worthy and ethereal, something akin to spirituality. Each person's path is unique, of course, but discovering the true self is key, and a painstakingly honest appraisal of one's personal moral compass is essential to this noble quest. Another fine lesson, lost on most viewers assuredly, is the lifelong gift of learning through education to improve one's mind and thus one's self.<br><br>And lest one think that Deep Murder is a preachy morality fable, be assured that the final genius stroke is the fact that the film succeeds also as comedy, and is funny as all hell. How they did this without dropping the ball once is anybody's guess, but Bravo! In fact, preachy moralizing is one of the film's recurring conceits, as each character, upon achieving his own personal Eureka! moment, gets on his/her soapbox to tell the other characters how wonderful they are now! Hilarious! Yet throughout all of this heavy stuff, Deep Murder also entertains as a conventional murder mystery, so clever and circuitous is the dazzling screenplay.<br><br>Throughout, Deep Murder pontificates humorously yet adroitly on that time-honored existential question, \"Who am I, and Why am I here?\" Characters continually stand outside themselves, pondering their actions, wondering, \"Who is writing my script?\", thus cleverly illustrating the primal conundrum in narrative texts as well as in human life itself: what guides human action, predetermined destiny or free will?<br><br>Yet the penultimate lesson of Deep Murder is one which can be accessed by any rank porno flick of the era invoked, in which low mongrels rut and moan and fondle to no apparent purpose. The viewer who is not a low mongrel himself can see therein stark proof of what happens when you succumb to your bases urges, accepting these limitations as your lot in life. The end quote to any porno flick could well be, \"There but for the grace of God go I.\" Yet Deep Murder states it even more profoundly: \"Evolve, lest ye devolve.\" I really didn't think they made movies like this anymore. Brilliant.","user":"Atomic_Brain","rank":[8,16]},{"title":"Light one up, and have a laugh!","rating":10,"date":"6 July 2019","review":"AMAZING to watch stoned! I've never laughed so hard!!","user":"snugglepot-59130","rank":[9,19]}]