[{"title":"A hidden gem","rating":8,"date":"25 December 2018","review":"Well thought, well executed, well acted. Minimum cast, minimum budget - maximum solidity and persuasiveness. A humble masterpiece.","user":"spas-grigorov","rank":[29,44]},{"title":"Surprisingly outstanding French-made crime noir.","rating":9,"date":"23 November 2019","review":"Novice French producer and writer Jérémie Guez makes his full length feature film directorial debut in this stunning character study turned crime thriller noir.<br><br>This film is insanely watchable, mostly due to the overall soundness of its stunning cinematography and visual compositions, and the stellar performances notably from Roland Møller and Lola Le Lann. The great performances and old school tension are the key ingredients here, and they come together very intimately and surprisingly in this touching film about a man wrestling with his own fate, that morphs from a character study into crime film as the action grows more taut.<br><br>Although I'm not a fan of slow-burn films, this one is an exception. The 85 min runtime was perfect, and the constant tension and directors camera shots kept the suspense running non stop. Even the score was perfect and evident at the right moments.<br><br>For a non-Hollywood foreign-produced film, this is outstanding, and I hope it's nominated for multiple awards, deservingly so. It's a well deserved 9/10 from me, and I look forward to seeing more from Jérémie Guez.<br><br>To see more of my 1000+ ratings and 600+ reviews, click on my username.","user":"TheTopDawgCritic","rank":[15,30]},{"title":"Great lead character","rating":5,"date":"18 November 2019","review":"The lead in this movie was great. Quiet mysterious dude straight out the pen. He didn't really do much talking but still managed to look like a total badass. Great character but the movie itself was pretty bland. It was a minimal dull story with nothing special. Movie needed more action and storyline. Felt they played it pretty safe. I want to give the movie 6 stars but it was just missing too much for more then 5. The shower scene was awkward.","user":"Draysan-Jennings","rank":[9,19]}]