[{"title":"A Whole Lotta Grace for your Money","rating":7,"date":"5 May 2018","review":"This is half concert film, half intimate portrait. What I took a way from it most was the stark contrast between the stunning visuals and slick production of her performances and the bare bones existence of Spanish Town in Jamaica where she was born. (Yet here's a certain tranquility to the people we meet there.)\nFortunately the subject of the film is someone to whom a lot of people could listen and watch all day. For those who aren't into her, 115 minutes may seem too long, but even they would have to marvel at someone in her late sixties moving with such agility and athleticism. (She sweats buckets.) I do think she could have let her guard down a little more. I don't think we got as much of the woman behind the image as we could have, but she shares a lot of her history, and that is enough. Sophie Fiennes dad an excellent job balancing the spectacle and the person, with as much as Grace was willing to reveal.","user":"Clothes-Off","rank":[13,13]},{"title":"Extraordinary View of a Magnificent Lady","rating":9,"date":"11 May 2018","review":"Grace Jones is a force of nature. At least a Hurricane, if not a comet about to hit the earth. The musical numbers in the movie are about the best I have ever seen in a concert film, and the recording of the music is outstanding. For that alone, the movie should be considered for an Oscar for Sound (even though it is a documentary, the Producers and Director have spent a good deal of money to make the soundtrack as perfect as possible during the concert.<br><br>For the entire length of the movie, I had the feeling that Grace was never hiding her feelings from the camera, and allowed us to see her from all angles, even the moments when she comes out from a shower naked. And she is timeless -- not only in terms of voice and performance, but in her attitude towards her family and neighbors from her childhood in Jamaica. Even though there were times when I could not understand the broken English, I sensed the love and compassion she feels for her family and friends from the Shantytowns where she grew up. At one point, she returns to the Church (where the Preacher is apparently her brother?), and where her mother sings an obscure Bluesy Religious number (in a very high Soprano, which is somewhat difficult to bear, especially having heard Grace sing in her deep voice), but Grace gives each of the clan equal respect and not once does she ever show a single moment of pretension. <br><br>Congratulations go to the Director for taking us on a personal journey. The only drawback is that the other people are not identified. I had hoped that there would be lower third titles to at least let us know who the other people in the film are, and where in Jamaica the scenes were shot. <br><br>Finally, there is Grace herself, who is a work of beauty and absolutely flawless for her age (she was performing in this movie at about age 60, and looks like she could be 35.) Her body is in perfect shape, she has gorgeous eyes and a stunningly beautiful face -- amazingly perfect in every way. A true beauty, even without makeup. During the movie, she tells her son that when she was his age, she could go dancing all night and still make it to the photo shoot the next day, and we can easily believe it.","user":"nick94965","rank":[7,8]},{"title":"Grace Jones: Jamaican Roots and Artistic Freedom!","rating":7,"date":"2 May 2018","review":"This documentary is quite needed, many has been mesmerized by the antics of Grace Jones. The exotic myth is dispelled, filmmaker Fiennes (related to actor Ralph Fiennes) tries to show Jones's origins via beautiful snapshots of her native Jamaica with on-location candid family and friends interviews. Aside of reliving Jones's childhood memories, the documentary depicts the frustration of an artist trying to keep her creativity free from the media and music industry. The film does a full circle for this iconic pioneer in club music and performance art: Jones's life is humanized!","user":"babyjaguar","rank":[7,8]}]