[{"title":"Meta-Level Observation and Contemplation on the Creation of Life As We Know It.","rating":9,"date":"1 March 2020","review":"Not interested in posting prolix commentary laden with iambic pentameter. And neither does this movie. It's amazing what perplex story can be presented with an obviously low budget. That alone garners my respect. I would call it an observation on the human condition, presented in the framework of something like a \"creation story\" general enough to fit a biblical, pagan, or Taoist ideology. It makes no apologies for its raw imagery and innuendos. But it need not so, as any keen observer will be hard pressed to proffer up criticism against it, as it reeks of truth. The story does a good job at pushing your buttons - but to transcend rather than provoke (should your mind stay strong and patient enough for this realization to occur). It is shocking, though accomplished without today's overdone shock value attempts. It is disgusting, yet within beauty. Any sadness it provokes matures into a state of yugen. Very simple scenes and speech belie the unspoken communication within. I highly recommend it. But not while you're eating a rare steak. And seriously folks, it's not kid-safe.","user":"wolring","rank":[3,3]},{"title":"Nice idea, but bad realization","rating":6,"date":"8 February 2019","review":"Wouldn't say that was waiting for the movie since it has been declared, but planned to watch it if there will be such a possibility. So, as the picture appeared in the Internet I decided to try to watch it. That was tedious enough.\nThe movie represents a good idea concerning some of philosophical questions about the social inequality and place of a human on the Earth, however these questions are shuffled with meaningless scenes in style of bad blockbuster/horror/thriller. Think it will be enough to point out that there are lots of scenes with fighting for something as well as scenes with blood. Of course they are needed to explain the main idea but in my opinion, firstly, there are too much of them, and secondly, they are shown insufficiently beautiful.\nWhat about beauty of the movie and composition in whole - the plot is overconcentrated on things that could be omitted and time might be used to more clearly draw some ideas. The camera is moving too fast and it's shiftings are completely disorganised. Actors are nice but not perfect. Interior design of scenes is poor and does not catches attention of a viewer.\nAs a result I would say that the movie is bad enough to guarantee that I won't rewatch it later and won't recommend it for watching to other people (or maybe only in case you have got some time and desire to watch a movie and you are in hard doubt).","user":"zeionara","rank":[8,14]},{"title":"Brother from a different mother!","rating":10,"date":"14 February 2019","review":"Now while I do mention \"mother!\", it is not so much that this tells the same story. But this tells a story that has so many layers to it, that may or may not annoy you. Something that did happen with mother too. And this also has things happening that are not \"normal\". Both movies tend to do things quite crazy. Add to that some violence and social commentary and end of the world scenarios ... not to mention that ending. Or that older (wise?) man and ... well you could actually talk about any other character too.<br><br>Everyone is representing someone and the movie itself warrants multiple viewings. That being said, it doesn't mean you have to like it. And it's not about being intellectual or anything, it's about taste and what you want to have in the movies you watch. So if you are into something that challenges you, this is the movie to watch ... still not pleasant or entertaining in the usual sense of the word","user":"kosmasp","rank":[9,19]}]