[{"title":"A Must Watch by Every Indian","rating":9,"date":"30 April 2018","review":"I saw Bharat Ane Nenu and I liked the movie.<br><br>In these days of extreme corruption and Chalta Hai attitude of the Citizen, It requires some guts for a Director to take a movie enunciating a Strict, Upright and Corruption Free Value system. Self-Governance and Direct Financial Allocation to the Villages, Huge Fines &amp; Stringent Penalties to the non-abiding citizen, Combination of Highest Level of Moral &amp; Intellectual Integrity, Leadership by Example, Purpose, Focus plus Super Human Physical Strength of the Chief Minister, are brought out very clearly. Movie is a must watch by each and every citizen and while most will laugh it out as impractical fiction, at least Director Koratala Siva and Brand Mahesh Babu would have sown a seed of introspection in one and all.<br><br>Mahesh Babu who plays the Chief Minister is extremely Handsome, Strong and Acts Very Well 5/5\nPrakash Raj who plays the Party Chief and role of the Villain is Simply Brilliant 5/5\nHeroine and all other Character Actors have done complete justice to their roles 4/5\nMusic by D S P is good 4/5\nMovie &amp; Storyline 4/5","user":"baba-15945","rank":[19,22]},{"title":"Well-Executed Political Drama w/Mass Elements","rating":10,"date":"20 April 2018","review":"Koratala Siva has directed a film that appeals to both class and mass groups. Learning from his mistakes in his previous films, especially from his weak and unsettlingly quick climaxes, he has drastically improved. As for the performances, Mahesh Babu has delivered one of the best performances of his career. Not only him, but all supporting cast members have also delivered aptly.<br><br>What to expect: Political Drama with Commercial Indian Cinema Elements<br><br>Pros: Storyline, Production, Cinematography, Direction, Performances, Dialogues, Background Score<br><br>Cons: Some Lagging Moments (Necessary for Character Development; Excusable)<br><br>Final Rating: 10/10","user":"vrravuri","rank":[30,40]},{"title":"A Solid Promise","rating":10,"date":"4 May 2018","review":"Review : Bharat Ane Nenu - Best CM<br><br>Bharat Ane Nenu is from the stable of super star Mahesh Babu-Koratala Siva has hit the screens today with high voltage expectations and and also fan jubiliations . Coming after Srimanthudu in the win -win combination of Mahesh Babu- K Shiva has the hero in CM role and the trailer released had promised huge record breaking at box office as a youth quotient is very high.<br><br>What all that Mahesh Babu does as CM and his message is all open for public and fans to rush to the screens .<br><br>Story : Bharat Ram ( Mahesh Babu) had to abruptly give up his studies at Oxford University and return to India after death of his CM father (Sharat Kumar) . He is pressurised and pushed by party leaders into his father's place as CM, inspite of his inexperience and . The film is about his journey of learning experience and how he develops the state manages the conspiracies of his opponents . His message to opposition and people , perhaps in the wake of fluid conditions in the state currently is the concept.<br><br>Plus Points :<br><br>* Mahesh Babu acting\n* Kortala direction\n* Story\n* Music and Cinematography<br><br>Minus Points :<br><br>* Slow pace and narration in second half<br><br>Percormance of Actors :<br><br>* Mahesh Babu as usual stellar performance in his debut role as young and stylist CM and appears cast for him and brought laurels for the role as CM for united AP. His punch political dialogues and his performance has earned mass appeal .<br><br>* Kaira Advani with debut performance in MS Doni film in Bollywood has stunned everyone as Vasumati ,lover of Mahesh , and matched Mahesh in both glamour and acting despite being her first Telugu movie.<br><br>* Character actor Sharat Kumar as CMs father is back in Telugu industry after a long gap and director has enlivened his role with dialogues etc.<br><br>* Yesteryear heroine Amani is back in Mahesh Babu mother role .<br><br>* Rau Ramesh as father of Vasumati has done justice to his role and Ajay, Srinivas is Mahesh's brother in good role .<br><br>* Though for a short while Brahmaji has brought out laughs and Prakash Raj is in his full form in usual role.<br><br>* Rama Prabha, Devaraj, Sitara, Posani Krishna Murali, Devadas Kanakala,Ravi Sankar,Jia, Yaschal Shara etc have brought a richness to the film.<br><br>Technical Wing :<br><br>* Devi Sri Prasad music has been a major combination with the story and his background score is super . Like the song Vachadayya Swami of Srimanthudu ,the title song of Bharat ane Nenu has become hugely popular .<br><br>* Cinematography pf Ravi K Chandran,S Thurru is just matic particularly the assembly scene and the glamor shots of hero and heroine has been embedded in the film.<br><br>* Art direction of Suresh Selvarajan ,particularly in assembly and other sets stand out as highlight of the film.\nThe interval fights, climax fights of Ram Lakshman stunt director is a hit with mass audience .<br><br>* Srikar Prasad and his editing has given more stamina and value to the film .<br><br>* The producer Danayya of DVV entertainment banner has lavishly spent on the movie to give story and concept a new look.<br><br>* Lastly director Koratala has been on block buster hit journey as his other films -Mirchi,Srimanthudu and Janata Garage- have done a hat trick for him . His teaming with Mahesh has spiraled expectations .<br><br>* Koratala has summed up the audience and fan expectations in the film which mirrored the fluid political situation and has given an equitable dose of both class and mass look to the film .<br><br>Finally : Mahesh has brought a new look and concept to politics in the Bharat Ane Nenu as he did in Srimanthudu where he adopted a village. Here hs shows what a CM should do for developing the state and fulfilling peoplesaspirations instead of garnering enough bribes for generations of his family.<br><br>At the press meet of CM Mahesh has mirrored the concept of the director through his punch dialogues and also thought provoking words for the media . For his story selection and performance Mahesh Babu could bag the best actor award easily and the film could have a rain of medals .<br><br>Over all Bharat Ane Nenu is the portrayal of what and how a CM should deliver and conduct himself. The young CMs in waiting in both states of AP and Telangana should take cue and lessons from Mahesh Babu role, dialogues and also concepts .","user":"suvarnamaamidala","rank":[11,13]}]