[{"title":"Don't think of At Eternity's Gate as a movie movie","rating":10,"date":"10 December 2018","review":"Rather think of it as a painted film, with one artist (Schnabel) trying to convey what it is to be another (Van Gogh). At Eternity's Gate is an immersion into the world of Van Gogh. Art conveys something about the world and the human condition words can never express. After watching the movie I came to realize other ways of trying to understand Van Gogh and his art fall short of this immersion. If you were to take an audio tour of a Van Gogh exhibit you would not finish the tour with the same feeling or understanding as you might get from watching the movie. Everything about the movie is spare, whittled down to an essential nub. The dialogue doesn't matter. What does matter are the long, silent scenes of Van Gogh in Nature and at home, and the times where he speaks directly to the audience, informing it of what it is to be Van Gogh. The occasionally jumpy camera shots and the overlapping dialogue may not have been completely necessary (and obviously a major turn-off for various other viewers), but they do help to establish what it may have been like to be Van Gogh. Madness? Sure, if that label works for you. Clearly, Van Gogh was different. Mad or not, he had his difficulties fitting in to society, any society. The last 20 minutes or so are the most painterly. After absorbing an hour of background material, all the film and Van Gogh have told you allows you to understand his world. When he talks about light, the screen is flooded with light, but even when the screen turns to gloom, you see the world as Van Gogh did. The walls are painted as they were in the background of a Van Gogh painting. And you the viewer? You sit back and drink it all in.","user":"markgluckstern","rank":[135,164]},{"title":"A must see","rating":9,"date":"20 February 2019","review":"The last years of <a href=\"/name/nm0994883/\">Vincent van Gogh</a> with his extreme sensitivity and mental instability. It's perfectly filmed with a colorful and adequate staging. And <a href=\"/name/nm0000353/\">Willem Dafoe</a> plays brilliantly!","user":"FrenchEddieFelson","rank":[45,52]},{"title":"Uncomfortable to watch but that's what made it great (like the artist himself)","rating":9,"date":"27 November 2018","review":"This film tackles the story of an artist creating masterpieces for later generations but not for his own. All the techniques that bothered other reviewers--the handheld camera, loud piano soundtrack, looped dialog--all emphasized a life of loneliness and ridicule that made the audience experience those emotions.<br><br>Clearly the story lacked a typical plot, not so much because it wasn't there as much as that Van Gogh's story is so well known and portrayed. I sensed that my companions may have been wishing they had chosen a different movie but for me this film further added to the tapestry of Van Gogh's unique story. Plus the film addresses the two biggest points of contention about him ... his ear and his death ... and suggests that Van Gogh's character traits have turned those into unsolvable mysteries.","user":"thomas1298","rank":[95,123]}]