[{"title":"Hey Why Don't You Come Over & Watch Our Vacation Slides","rating":5,"date":"18 June 2019","review":"Let me get this out of the way first - just because Tom Burke, Honor Swinton Byrne &amp; Tilda Swinton do a excellent job (the reason for a 5 &amp; not a 3) in this movie (even though Tilda Swinton is little used); the cinematography is good (though a bit washed out, but that could be on purpose based on the total lack of tension in this movie, so why have anything but pastel hues?); the direction I found to very good (even though Joanna Hogg, working from her own script) loves wide framing that seems to collapse on close encounters. The script though is just a lot of talking, talking, talking that seems to be leading us nowhere. Scene after scene of conversation that is all very nice but has little purpose. The only person who has anything interesting or useful is Anthony (Tom Burke). Julie (Honor Swinton Burke) seems to be so unaware that it gets very tedious watching her sleepwalk through this mess. (I have yet to understand the title \"The Souvenir\" as it relates to the story. I give guesses but the might be spoilers)\nThis movie is like being with friends &amp; having a nice evening (The reviews &amp;Trailers for this movie) and then just as you open the second bottle of wine they stand up and say now let's go to the den so we can show you the slides of our vacation to the Kansas &amp; Nebraska Prairie! (The movie starts!) (No offense to the great states of Kansas &amp; Nebraska, but you are flat!). This movie builds no tension between its characters, it does nothing but shows a day in the life of a slick, maneuvering man &amp; a woman who has no sense of the world around her &amp; is a prime enabler. Is it about her blind love for him. Is it about his manipulation of her. Is it about her lack of knowledge of...of...well basically everything. I kept hoping this movie would do something, would go somewhere, would show us something that we could care about (especially regarding Julie) but it never did, it just kept wandering and wandering to the expected conclusion with a closing shot (reminiscent of the final shot on The Searchers, although I am sure it was not on purpose).\nAs you read all the glowing reviews about the acting, etc. I would say 2 things - 1. All that great acting, cinematography, even directing doesn't mean squat without a script that means something and 2. They said that the English Patient was a great movie too!","user":"deager","rank":[68,92]},{"title":"Longest two hours of my life","rating":3,"date":"15 June 2019","review":"I was so genuinely bored while watching this movie that I found myself checking the time on my phone constantly throughout. The movie tries to give you a taste of the everyday life of a young woman in film school who is juggling her work and older boyfriend who happens to be an addict, however it is unbearably dreary and dull. The main character is boring and has no defining personality other than being a pushover film student, and her catering to her manipulative boyfriend does not encourage any sympathy. This movie is basically a vignette of nothing happening.","user":"avasikhye","rank":[72,98]},{"title":"Obvious and inscrutable","rating":4,"date":"31 May 2019","review":"This film seems to be trying to turn its back on every narrative tradition. It shows us so much, and lingers so long on so many shots and scenes that are utterly unilluminating of any plot or character, and leaves out almost every detail that might help us contextualize what is going on or who these people are.<br><br>I love Malick, and really appreciate the heuristic style he pioneered. I'm glad when directors don't point at everything and instead let an audience just have an experience. But I, at least, need more than was offered here, where the arcs of all the characters seeming punctuated and unmotivated, and the mise-en-scene mostly arbitrary.<br><br>I didn't find the cinematography gorgeous at all, it seemed just like whatever was there, often flat and muddy, only occasionally catching a nice bit of light.<br><br>Maybe a little spoiler here (I guess?) but the last shot reprives a repeating shot, held painfully long, that I guess was intended as chapter markings, reminiscent of the brilliant wide shots that broke up Breaking The Waves, but which seemed completely empty of any meaning, even after that final reprise.<br><br>Without 2 Swintons, this film would never have gotten a theatrical release.","user":"nesdon-2","rank":[40,53]}]