[{"title":"Go for it. This is a gem.","rating":8,"date":"13 September 2019","review":"The movie will appeal to an adult, mature audience, and to sensitive souls. A glossy, visually stunning portrait of solitude and the many obstacles to true bonding and communication. Ms Moore is fantastic as usual, mesmerizing and gorgeous. There is subtle beauty everywhere - lights and photography, camera angles, screenplay lines, superb acting. Great songs add to a very rewarding experience.","user":"vivienlidia","rank":[15,16]},{"title":"Julianne Moore is absolutely perfect in this underrated little movie.","rating":15,"date":"15 June 2019","review":"Five years after the Chilean original, Sebastián Lelio decided to remake his own movie and direct an American version starring Julianne Moore as the main character. I have to admit to having liked this more than the version with Paulina García - both performances are equally formidable, but perhaps it's my personal admiration for the legendary Julianne Moore which caused me to feel more attached to Gloria's character in this film.<br><br>This is a film for a very special audience, and many viewers outside of that audience will probably find it difficult to relate to the everyday life troubles of a middle-aged woman struggling with sexuality, motherhood, health issues and work life (just look at the audience rating on Rotten Tomatoes or the negative comments on IMDb). I mainly watched this because of Julianne Moore and since I have really liked Sebastián Lelio's work so far, and I didn't regret it for a single second. Moore is perfect and gives one of the best performances of her career, which says a lot since she was so fantastic already in films such as \"Still Alice\", \"Far from Heaven\", \"The Hours\", \"Magnolia\" or \"Boogie Nights\".<br><br>\"Gloria Bell\" feels like it's about celebration of life. It's full of positivity; it is uplifting even in its sadder moments thanks to its poignant use of music, and a refreshing breath of vibrancy drifts through every single scene. An intimate and all around glorious character study from one of the best rising directors of the last decade, with one hell of a courageous and captivating final act.","user":"Councillor3004","rank":[31,39]},{"title":"Single 40 and Up Women Will Appreciate This Film","rating":8,"date":"22 September 2019","review":"I almost did not watch this film as a result of all the bad reviews. However, I can relate to this storyline after dating many men with baggage such as insecurities, adult children who are still depending on them financially, and men who do not know how to communicate their feelings. Ladies, if you have experienced dating this type of man, watch this flick. You will appreciate it. Moreover, you will enjoy Julianne Moore's character. She played this woman so well!","user":"hillar-36881","rank":[17,21]}]