[{"title":"Simply an amazing film","rating":10,"date":"19 August 2017","review":"It is rare that a film leaves me feeling as this one did. It was moving, touching, honest and a bit haunting. More than anything, however, I want to stress the honor that I felt in being allowed to share in such an unbelievably intimate portrait of a family that has climbed a mountain and found another behind it.<br><br>It is a story off a man's consuming passion for a sport that would eventually lead him to the absolute pinnacle at the same moment that his life was tragically turned inside out by an accident caused by the very thing he loved, speed. More than that, however, it is a story of the grace of two women, his wife, Virginia and his daughter, Claire. While there are countless interviews with some of the greatest names in Formula 1, it is Virginia and Claire that truly steal the show and I was simply left in a bit of awe of them both.","user":"sam21462","rank":[21,21]},{"title":"A riveting story with a powerful emotional core","rating":8,"date":"5 August 2017","review":"Although it may not look like it from the outside, the Williams F1 team is deeply intertwined with the Williams family history, and that's what this documentary does so well. Bringing to life two fascinating sides of the story of the family, it's a riveting and powerfully emotional story that holds your interest from start to finish. It may occasionally get a little muddled when trying to pick a side to focus on, and is possibly a little inaccessible for non-F1 fans, but it's still a fascinating watch throughout.<br><br>Now, I'm a big F1 fan. My favourite documentary of all time (and the highest rated film of all on this website) is Senna, a beautiful, elegant and thrilling tale of one of the sport's greatest drivers. Although I can't say that I found the same thrills in Williams as I did in Senna, I have to say that there is a lot about it that bears a likeness, particularly when it comes to the all-important topic of a thirst for competition in motor racing.<br><br>The film is a piece about the Williams family, but there's no doubt that Sir Frank, the man who started the team, is the centre. Although he was never a driver, one of the most powerful messages that this documentary brings across is just how determined he was as a competitor, in whatever capacity. Through some incredibly difficult times over his years in F1, Frank's determination and obsession with the sport is so similar to the emotions that dominate Senna, and that's what sets up such an enthralling and emotionally affecting watch.<br><br>I do worry that viewers who don't have the same fervour for motor racing may not be able to relate to the film as much, because there is so much focus on Frank Williams' unstoppable obsession despite all the dangers of motor racing, but if you are an F1 fan, or indeed a fan of pure competition, then it's very clear to understand how strongly the man has felt about the sport all his life.<br><br>However, the entire film isn't all about Sir Frank Williams. There's a sprinkling of on-track action throughout, delving into the rivalry between Nelson Piquet and Nigel Mansell in 1986, when the Williams family was at their most difficult moment, but the true focus of the film is how the family itself played a role in shaping the team that has endured very strongly up to the present day.<br><br>As a result, the film's three major players are Frank, his wife Ginny, and his daughter Claire. Alongside Frank's racing obsession, we get an enthralling insight into the woman who was always at his side, and the core of the film's emotion really comes from contrasting the thrill that Frank got from being in Formula One to the difficulties that it often caused for his wife.<br><br>It's not a story that in any way criticises either party, but it highlights the fates of the people who aren't always at the forefront, and how much of an emotional drain such an intense profession can be on their personal lives, something that I found absolutely riveting.<br><br>Furthermore, Frank's daughter Claire offers a very effective and relatable position for you as the viewer. Much of the film focuses on the fact that Frank is a very emotionally introverted character, something that also contributed to a degree of stress in the family, but with the insights from Claire, someone who is both prominent in F1 nowadays, but also has the benefit of being so close to Frank Williams, you get a very clear and collected insight to the whole family saga, and it's her descriptions, along with a collection of fascinating tapes from Ginny Williams, that give the film such a powerful emotional effect.<br><br>On the whole, this is an excellent documentary, but it's not without a couple of small flaws. For one, its first act struggles to really tie all of the aspects of the story together well, jumping back and forth a little too much between the three main players, Frank, Ginny and Claire, as well as trying a little too hard to assure you that there will be some racing cars in the movie too. For me, I would have been perfectly happy to see a slightly calmer introduction to the story that focused on the family heritage, and brought in the wider F1 context a little later on.<br><br>Overall, however, I was absolutely enthralled by Williams. An excellent documentary that looks at a wide range of stories around the Formula One paddock centring around the Williams family, it will have you absolutely riveted from start to finish, and even tug at your heartstrings, such is the emotional power of the family's story.","user":"themadmovieman","rank":[23,25]},{"title":"An emotional insight into a raging workaholic","rating":9,"date":"4 December 2017","review":"I went into this expecting to learn more about the team 'Williams', but I found myself learning more about Frank, the man, and the family, than anything else, but don't misinterpret that as a bad thing.<br><br>I'm an avid F1 fan, I have been since the days of Michael Schumacher in a Benetton, but being of a relatively young age I didn't know an awful lot about the Williams team other than whom ran the time, who drove for them and that they were British.<br><br>The documentary touches on many insights into how the team came to form, struggles within the family and I think most importantly, the relationship between Frank and Ginny. It does a fantastic job of showing you enough of both sides to walk away from it with a much better knowledge of what it was like for everyone involved and it doesn't pretend to pull any punches.<br><br>There's comedic moments where Frank will recount something in such a blunt and unforgiving manner that you can't help but laugh but then there's moments where you feel great sadness for them.<br><br>It's beautifully shot and the score is excellent, I'd HIGHLY recommend this to motor sports fans, but I'd also recommend it to those who aren't, because it's a poignant reminder of struggle no matter who you are or where you're from.<br><br>9/10","user":"chrissatchell","rank":[10,10]}]