[{"title":"Inspirational Journey with Pope Francis","rating":8,"date":"18 October 2018","review":"In his latest film, biographical documentary Pope Francis: A Man of His Word (2018), coproduced internationally between Switzerland, Holy See of Rome (Vatican City State), Italy, Germany and France, acclaimed director Wim Wenders takes us on a personal journey with Pope Francis, condensing in just about an hour and a half Pope's urbi-et-orbi addresses, dispatches and other communications from an abundance of ideas and messages well based and inspired by traditional religious views, though often customized to the challenges of contemporary world. By thoroughly professing vow of poverty (which is, in Pope's position, modified to living on advanced necessities required and sufficient to respond to his functions), chastity, and obedience, just as Jesuits, he himself belongs to, do, in five years since he's been voted as the 266th and current Pope and sovereign of the Vatican City State, in his wisdom and compassion, modesty and kindness, Pope Francis indeed has established himself as one of the leading moral authorities of contemporary world, who certainly deserves to go by his adopted name, Francis, thanks to his adherence to the teachings and spiritual disciplines of the Franciscan order and its founder, Saint Francis of Assisi, who himself embraced and lived a simple life of poverty, penance, brotherly love, and peace.<br><br>Dedicated to his mission of speaking to people most deprived of life's essentials, in need of bare necessities, the poorest, homeless and hungry, sick and weak and otherwise vulnerable, he travels to a great many places in the world just to personally deliver his message of encouragement and hope to victims of unavoidable natural disasters (floods and quakes, draughts and famines, pandemics...), but also highly avoidable catastrophes, sadly mostly people-made ones (wars, transport and industrial, nuclear and radiation accidents...), and even doesn't shy away from visiting a good many people subjected to legal persecution, marginalization or social isolation (e.g. convicts in detention facilities). Certainly, it is not only deprived, but mainly good-willing people throughout the world who are his most attentive audience. Some can help more (e.g. members of the General Assembly of UN, American congressmen...), but anybody and everybody can make a difference, no matter how small, and his word gets to all... \"Some of the hard-boiled congressmen were moved to tears\" by his speech, which comes about much easier when one has been confirmed and recognized as A Man of His Word.<br><br>As an example, this is what Pope Francis says on avoiding consumerism: \"The way to escape consumerism, this corruption, this competitiveness, this being enslaved to money, is the concreteness of day-to-day work, is tangible reality! I like to talk about the three 'T's: 'trabajo' (work), 'tierra' (land) and 'techo' (roof). 'Roof' means home, family. Recovering this sense of family. 'Land' means work, cultivating the land. And work means precisely the most noble thing that man has: to imitate God with your hands by creating!\"<br><br>In a message chosen to conclude this cinematic journey, Pope Francis accentuates benefits of good humour and advises to keep smiling as often as we can. In that respect he brings to our attention St. Thomas More's Prayer for Good Humor, which, admittedly, he himself prays every day. Prayer starts with the plea \"Grant me, O Lord, good digestion, and also something to digest\", and reminds me in the second part of this verse of the proverb included in my high-school Latin language lessons (professor Josip Selak R.I.P. (Requiesce in pace)), already (incredibly) more than four decades ago: \"A full stomach does not study willingly\" (Plenus venter, non studet libenter), left by responsible authorities of the era (purposely?) incomplete, by omitting its additional, even truer remark: \"but empty even less\" (sed ieiunus eo minus), apparently by moderating this factual highlight out.<br><br>Touring the world with Pope Francis, exploring the workings of his mind and crossing the landscapes of his thoughts, in a sort of illustrated extended homily, never tires, but rather inspires... a lot to ponder on, even more to go by.","user":"Davor_Blazevic_1959","rank":[49,65]},{"title":"Tierra, Trabajo, Techo","rating":8,"date":"26 May 2018","review":"Beautiful film about a man with a simple message. We need to respect our planet, our tierra/earth on which our existence depends. We also need a roof/techo over our heads and meaningful work/trabajo to give us dignity. The film traces the early life of Saint Francis of Assisi and his links with our present day Pope. We follow Pope Francis around the world as he interacts with people in the most profound ways. Truly a message not to be missed.","user":"clarkj-565-161336","rank":[46,64]},{"title":"Leading by example","rating":10,"date":"30 November 2018","review":"Pope Francis is telling us all an inconvenient truth. We should all listen carefully, Catholic or not, Christian or not.\nIt's a short documentary (around 90 minutes). Don't trust reviews (even mine) and give it a try to make your own opinion.","user":"tdeleval","rank":[32,45]}]