[{"title":"Great ideas wasted by undercooked story","rating":4,"date":"29 February 2020","review":"Guns Akimbo can best be described as a film that had ingredients for a cult classic but its lack of adequate direction and pacing hold it back from reaching its full potential. This film is a bit too full of itself to capture a wide audience because of its overbearing gamer culture references which easily could have been dumbed-down or removed completely. Another big problem of Guns Akimbo is the borderline amateurish dialogue which made almost every exchange between any character seem either unintentionally funny or uncomfortably dull.<br><br>It goes without saying that Guns Akimbo is not a horrible movie as it does have its moments featuring charismatic performances from Daniel Radcliffe and Samara Weaving, some gory violence and a simple enough plot, making it at a fun ride throughout. It doesn't particularly deliver on anything; there are some mid-budget shootouts and chase scenes which are fun as can be expected but nothing that you haven't seen already. This project just should have spent more time in the furnace and been decorated with more colourful toppings.<br><br>In all of its splattery glory, Guns Akimbo is very fun to watch if you can get behind the pacing, the needless gaming references and its self-assertive plot.<br><br>Final Rating - 4/10","user":"Aaron_Kyle","rank":[85,113]},{"title":"Over the top, ridiculous, and entertaining","rating":7,"date":"1 March 2020","review":"This is the kind of film you have to just put your mind on autopilot for and enjoy. The action and shootout scenes are very well done, with some sharp direction and editing. The story is a little too absurd and not based in reality whatsoever, but that's the point. It reminds me a bit of the movie Shoot 'Em Up, which was another tongue-in-cheek gun extravaganza, but fortunately Guns Akimbo is a lot funnier and more stylish, making it a pretty cool watch if you're not looking for anything mind-expanding.","user":"umimelectric","rank":[55,86]},{"title":"A three for the trouble","rating":3,"date":"29 February 2020","review":"Really. This film is a editing nightmare. Maybe mindless but not even fun. Dialogue is one-liners and not funny. They are all trying but is is just one big mess","user":"contact-19621-51933","rank":[72,123]}]