[{"title":"Nope","rating":1,"date":"11 June 2018","review":"No scares, no real plot, no anything. There are only 2 characters, ok 3 and I didn't care or feel anything about them at all. I kept waiting for this \"horror\" movie to get better. Hint, it never does. It was supposed to be so deep but, it was just a dried up creek. Don't waste your time. Nope","user":"debbiecords","rank":[15,21]},{"title":"This quick movie had one jump scare and was a terrible attempt to infuse a theory known as Schrodinger's cat.","rating":2,"date":"20 March 2018","review":"First off let me be clear, I would classify this film as an extended short because the running time is 1hr. 7 mins. Which is a good thing in this case because the movie was not enjoyable. \nMost people who have never heard of the Schrodinger's cat theory or are not big fans of philosophy will get to see an example of the theory as soon as the movie starts. Basically the theory of the cat in a box and if you punture this box with an object like a knife is the cat dead or alive &amp; how will you know without opening the box. Schrodinger also theorized that the cat is dead and alive at the same time, Yes I know it's pretty out there but this is not the reason for this films failure it was the lack of execution on many levels. The sound effects used when trying to create a jump scare were horrible, Reminiscent of a film from the 1950's. The acting was below standard even for a indie film the actors showed little depth and at times were not very convincing. That may be due to the fact that the dialogue was poorly written. In the beginning it states that you should watch the film in complete darkness and to the directors credit it does work for 10 minutes and heightens the fear factor and makes it more scary for watchers when light flickers in and out but after seeing the bad special effects it looks very fake the blood the perceived dead bodys, without realness you lose that frightening feeling a good horror film induces. <br><br>One thing I do appreciate about this film a lot of movies anger me with is in the explanation department. Movies tend to end with so many questions on the table and to often leaving you confused with no answers on what just transpired, This movie doesn't do that they hypothesize and throw out random explanations albeit not very plausible explanations but atleast they try. The camera angles at times were either too close or fuzzy but not that bad for a low budget film. \nAll in all i would say skip watching this film nothing here is memorable and if it was longer than an hour i wouldnt have made it through the entire film. \nStay Safe Stay Blessed.","user":"tkaine3","rank":[5,11]},{"title":"Great Buildup of Suspense","rating":8,"date":"26 October 2018","review":"Terrific frightening movie.Watching in the dark was very cool. You are literally sitting on pins and needles waiting for the worst to happen. The opening sequence with the cat was very clever. All in all, great fun.","user":"johnjrudolph","rank":[3,6]}]