[{"title":"Fun mystery solving in the sun","rating":7,"date":"20 September 2017","review":"Being a huge 'Scooby Doo' fan for goodness knows how long, any new show, special or film would be watched with great anticipation. While 'Scooby Doo Where Are You' is still the jewel of the crown of the franchise, it was interesting to see 'Scooby Doo' rendered in Lego.<br><br>There have been two feature-length Lego 'Scooby Doo' films, the first one being 2016's 'Haunted Hollywood'. This second outing from 2017 is to me the superior film. 'Haunted Hollywood' is certainly worth watching if very flawed, but 'Blowout Beach Bash' had the better executed mystery, was better paced, had more content (whereas 'Haunted Hollywood' felt overstretched, thinly plotted at times and padded. Neither are among the best 'Scooby Doo' films, not like 'Zombie Island', 'Witch's Ghost', 'Big Top', 'Goblin King' and 'Mask of the Blue Falcon', the rest are decent to very good with only 'Monster of Mexico' of the feature films disappointing ('Arabian Nights' is terrible but was made for TV).<br><br>'Blowout Beach Bash' could have been executed a little better. Daphne is still somewhat bland and her Lego design is still not doing much for me. A few of the songs are not particularly great or memorable, despite some clever nods to past beach films. Was not hugely surprised by the reveal, though it wasn't blatantly obvious. Although the mystery and pacing are much better than in 'Haunted Hollywood', not everything felt necessary.<br><br>However, the mystery has the classic fun and spooky feel that makes me love 'Scooby Doo' in the first place, with a great sunny atmosphere on the beach and creepy villains. The pace is lively and crisp, the gang interact beautifully together, they have far more distinct personalities that are true to their original ones generally (whereas only Scooby and Shaggy came off well properly in 'Haunted Hollywood', only Daphne could have been done well) and the supporting characters are generally stronger (though nobody is as memorable as Drella Diabolique in 'Haunted Hollywood').<br><br>Animation-wise, animation is very nicely done. It's very colourful and atmospheric, with some of the visuals also being inventive. The music is both dynamic and groovy, with a lot of energy and a haunting undercurrent.<br><br>When it comes to the writing, 'Blowout Beach Bash' is smart and endearingly goofy, particularly with Shaggy and Scooby, and it also feels very quirky and nostalgic in both classic and current 'Scooby Doo' fashion. Thrills and scares are aplenty.<br><br>Voice acting is very good. Frank Welker shows no signs of being long in the tooth despite voicing Fred since the very beginning way back in 1969, so nearly 50 years and he is going strong. His Scooby voice took some getting used to, having been so accustomed to Don Messick since forever, but it's definitely grown on me. Matthew Lillard is a worthy successor to Casey Kasem, a very difficult feat that he pulls off with ease, he is hilarious and an immensely likable goofball.<br><br>Kate Micucci does well as Velma, sounding positively adorable, and Grey DeLisle makes a valiant effort doing as much as she can with Daphne.<br><br>In summary, fun and the better of the two Lego 'Scooby Doo' films. 7/10 Bethany Cox","user":"TheLittleSongbird","rank":[3,3]},{"title":"Scooby-Doo and the ghastly Lego pirates...","rating":6,"date":"16 August 2017","review":"Sure, I grew up with watching Scooby-Doo on the TV as a youngster, and I still do find the time to sit down once in a while with my 7 year old son to watch Scooby-Doo on new adventures, as he enjoy the tales of the Mystery Gang as much as I did when I was a kid.<br><br>However, I am a little bit reluctant when they branched over into Lego. Sure, the animation and CGI is top notch, but it is just not the same. The essence is there, for certain, but it is just not Scooby-Doo in the way it was meant to be.<br><br>I sat down to watch \"Lego Scooby-Doo! Blowout Beach Bash\" with my son, and I must admit that the storyline in this particular adventure was actually one of the better story lines in quite some time. So it was rather easy to distract myself from the aversion to it being Lego.<br><br>The CGI and animation was amazing, as to be expected of course. And it they had a great amount of details in all the scenes, which was genuinely pleasant to see.<br><br>And it is of course always a treat to have recurring voice actors return to reprise established characters, and here we are having Grey DeLisle, Matthew Lillard, Kate Micucci and Frank Welker of course.<br><br>I was genuinely surprised with the outcome of this particular Lego rendering of a Scooby-Doo tale, and it was a very entertaining storyline to say the least.<br><br>If you have the chance to watch \"Lego Scooby-Doo! Blowout Beach Bash\" then you should definitely do so, whether you are a newcomer or a long time fan of the Scooby-Doo universe.","user":"paul_haakonsen","rank":[3,5]},{"title":"This movie good","rating":10,"date":"10 September 2017","review":"this is a good my favorite was strange dog strange dog i recommend this to all scabby do fans scabby-door is a good movie i hate my life life is pain strange dog is a masterpiece i love this is a good movie ten out of ten gay i love my strange dog SD what does that stand for strange dog?","user":"kaiw-78195","rank":[3,8]}]