[{"title":"Great animation, lacking a decent script","rating":5,"date":"23 August 2017","review":"How disappointing this film was. The book that is the foundation of this series far surpasses anything that has been done cinematically, and this movie falls very short as well.<br><br>The animation and artwork were top-notch; it's the lack of anything resembling a sensible plot that is so grating. Not for the first time I wish that someone with knowledge of military matters had some influence on the scriptwriters. We see the usual thousands upon thousands of enemy bugs attacking without regard to their own safety or whether they live or die; this is fine, this is how insects in our world do operate, so that part is OK- though it lacks any nuance.<br><br>But having soldiers who are just as mindless, who are totally inept, and careless of their own safety? Cracking jokes while their comrades are being massacred? Troops that have no idea about defensive formations, who don't worry about ammo, who bunch up in the middle of a plain and allow themselves to be surrounded &amp; never think of taking cover? Who shoot off nuclear arms and then stand around to watch the bang? This is too silly even for slapstick! <br><br>The Martian Lieutenant was a buffoon who trips over his own feet and shoots a nuke when he meant to shoot his rifle. I guess that was supposed to be funny, but good grief. Shaking my head! This could have been such a good movie, if only the makers had \"played it straight\" and tried to tell a good dramatic story instead of deciding to make soldiers look like moronic fools. (Though the art &amp; animation were so very good that at times I forgot that I was watching an animation and it felt like I was watching a live-action movie.)<br><br>All I can say is, grab the book by Heinlein for a really good story. It'll make you think; and you'll wonder (like I do) how anyone could take such a marvelously good story and turn it into this pile of rubbish! I'm still waiting for someone to make the first decent film of this wonderful book!","user":"rdenisw","rank":[24,29]},{"title":"Starship Troopers Traitor of Mars: Best ST movie since 1997","rating":7,"date":"12 October 2018","review":"Starship Troopers has a long history dating back all the way to the tail end of the 1950's, it's movie's started in the 80's and ever since it's been a very rocky road. They hit pay dirt with 1997's Paul Verhoevens epic but after that it all fell rather flat.<br><br>In 2012 they released Invasion which was the first animated Starship Troopers movie and it wasn't bad, in fact it was the best since 1997 as parts 2 &amp; 3 of the live action were pretty terrible.<br><br>Here in 2017 with Casper Van Dien returning as Rico and oddly Dina Meyer returning as Dizzy they succeeded again as this is the best Starship Troopers movie they've made (With the exception of 1997).<br><br>Also returning for the ride is Carmen and Carl, but don't expect them to be voiced by Denise Richards or Neil Patrick Harris.<br><br>The plot is a conspiracy regarding a bug outbreak on mars and it's actually not all that bad. The animation though not entirely fluid still looks the part and even if it is a tad cheesy the voice acting is on point.<br><br>Starship Troopers: Traitor of Mars is a rather enjoyable addition to the franchise. More of this would be greatly appreciated.<br><br>The Good:<br><br>Looks great<br><br>Some oddly good humour<br><br>The Bad:<br><br>Dizzy looked weird<br><br>Things I Learnt From This Movie:<br><br>Kicking someone to the ground who is in possession of a nuke makes perfect sense<br><br>Battlesuits come standard with butt cheeks<br><br>Approval ratings are monitered active and live at all times","user":"Platypuschow","rank":[14,17]},{"title":"If you were a fan of the 1st one, don't watch this one","rating":3,"date":"25 August 2017","review":"I'm giving it 3 stars because of the voice actors (original cast). Other than that, the film is garbage. I'm no military expert but the military/logical errors in the movie are terrible. It feels like the who script, story was written for some 10 year olds. Full of boring, old clichés and jokes that makes you want to fall asleep. If you really have nothing else to do, watch it, but even brushing your teeth for 1,5 hours is more entertaining than this. Such a shame they killed this great franchise after the first movie.","user":"bencex","rank":[33,45]}]