[{"title":"A solid procedural thriller with taut performances.","rating":10,"date":"13 January 2020","review":"I am a bit biased (fan of the series n the characters Carl, Assad n Rose)\nThe film is very intriguing with enuff tension n a satisfying ending n it holds you in its grip from start to finish, with taut performances n some amazing cinematography.\nInspite of the movie going backward n forward, it doesn't get incoherent at all.\nIn the present we c two young girls enter an abortion centre n the flashback scene is of a man who puts his daughter in an institution as a punishment for being morally wrong.\nIn the present, workers discover mummified bodies all connected with the same institution.\nWhile the mummified murder case is fresh, it is passed onto Department Q as the bodies has been ther since 12 years.\nWhile Assad has been promoted, Carl n Rose r still working in the basement aka Department Q pertaining to unresolved cases.\nCarl starts investigating n Assad too joins him as he has one more week left before his promotion.","user":"Fella_shibby","rank":[29,32]},{"title":"A well-written, well-acted thriller that only lacks a FINAL JOLT! [+72%]","rating":7,"date":"23 February 2019","review":"I had no clue that 'Journal 64' (or 'The Purity of Vengeance') was part of a series of films known as 'Department Q', before looking it up on IMDB (and that was after watching the movie). Well, even if it wasn't, the screenplay has added enough layers to its lead characters to make it a totally engaging fare. Assad, one of the cops in Dept. Q, is set to move to another division and his partners Carl and Rose are finding it hard to come to terms with his departure. The uncovering of a few mummified bodies behind the false wall of an apartment in Copenhagen brings an exciting case on the desk of Dept. Q once again.<br><br>On the side, in 1961, we are introduced to Nete (and how she ends up on The Girls' Home in Sprogø for 'the morally defective'), her roomie Rita, the fascist doctor Curt and his unsympathetic assistant Gitte Charles. The film provides a fair bit of an insight into the grim realities of what went down in that island facility, and it's definitely not for the faint-hearted. Does the past have a connection with the goings-on of the present? Watch the film to find out!<br><br>Adapted from the novel by Jussi Adler-Olsen, the screenplay packs enough thrills and punches to keep the viewer on their toes for the most part. A conspiracy is unraveled slowly; we realize the subplots aren't mere subplots. Every character shown on screen has at least one or more relevant scenes. That clearly indicates the screenplay's strength. With a cast that's already popular among Danish viewers, director Christoffer Boe had his job cut out to an extent. He has retained some of the gruesome details of Sprogø to reinstate how big of a terror-show it once used to be.<br><br>Incorporating elements from a past era into a film can sometimes come across as too dramatic and struggling to convey the right notion. Director Boe doesn't have any of it. The daunting flashback sequences at the facility are as thrilling as the duo (and their female colleague) trying to crack their case several years later. The crafting is excellent, the thrills very carefully placed. The plot, however, gets predictable beyond a point. The supposed twist in the tale isn't exactly what one would term 'remarkable', but in a thriller universe, I believe it fits.<br><br>The climax is a bit of a stretch too, with the extended scenes catering more to fans of the franchise than to the plot. If that doesn't bother you, you have a really good thriller in your hands. The camaraderie between the leads is also one of the reasons this film works so well. It has well-rounded protagonists (one of them fundamentally flawed, and for the right cinematic reasons!), above-par performances, detailed plotting, and just the right amount of thrills and action set-pieces that can make your weekend a wee bit more interesting!<br><br>What I immediately need to do is seek out the older counterparts to this movie and binge-watch them.","user":"arungeorge13","rank":[20,25]},{"title":"Love this movie series!","rating":9,"date":"30 March 2019","review":"I was so impressed with the first movie and it has always been an impatient wait until the next instalment. I just love how the Danish can come up with such quirky characters. Sometimes the character put you off because they are so different but as time goes by you grow to love them and it is amazing how the subtle acting can convey so many emotions if you look out for them.\nI would be very sad if this was the last we see of these quirky characters.\nI just hope there will not be an English language version remake!!!","user":"growns_up","rank":[17,22]}]