[{"title":"The best part about the movie was the cover/poster...","rating":3,"date":"11 September 2018","review":"Well, let's just be honest, with a title such as \"Snake Outta Compton\" and the movie's cover/poster, then you know it is going to be one of those movies. And true enough, \"Snake Outta Compton\" turned out to be exactly that. But still, there is just something oddly fascinating about these movies that keeps luring me in. Perhaps this will be the one movie that stands out in the crowd, it has been known to happen. But such was not the case with \"Snake Outta Compton\".<br><br>The story in the movie was next to non-existing. A nerdy scientist mutates a snake with a growth ray and the snake goes on a murderous eating rampage in the neighborhood. Yup, that was basically about it - because the whole band and record deal was just a side order to spice up the movie.<br><br>The acting in the movie was as to be expected. Then I haven't said too much, because you know what you are getting yourself into here.<br><br>For a movie such as this to work out even just remotely, then they need proper CGI. The CGI in \"Snake Outta Compton\" was not overly impressive. So the movie couldn't even stay afloat on that account.<br><br>This movie is not really worth the effort, unless you are a die-hard fan of anyone on the cast list, or perhaps you yourself was involved in the creation of the movie in some way.","user":"paul_haakonsen","rank":[3,3]},{"title":"Destined to be a cult classic","rating":8,"date":"15 May 2018","review":"I've been a huge fan of the works of Hank Braxtan since I saw his fan film Freddy VS the Ghostbusters. I've watch Hank grow as an artist over the years from his first feature film release Chemical Peel to his killer polar bear film, Unnatural. Hank knows how to use even the smallest budget to its advantage. He knows how to culture fantastic performances from his actors. He also knows how to mix CGI with practical FX, something a lot of directors of this generation still need to learn. Hank Braxtan is an artist. Snake Outta Compton is his latest and best work to date. It is a cool sci fi/horror/comedy full of parodies of a number of great films. It features a fun soundtrack of original raps. This film is a fun popcorn film that you can pair with a number of other similar fun popcorn films like Bad Ass Spider or Vampires of Zanzabar. This is a fun film that doesn't take itself seriously and that is its charm. That is why I say it is destined to be a cult classic. I look forward to Hank's next outing...WORD.","user":"cracker910","rank":[8,12]},{"title":"Low-budget parody with clever script","rating":4,"date":"2 May 2018","review":"Snake Outta Compton (2018) offers an intelligent script, combining the ridiculous with ridicule and subtle parody. However, despite the participation of five credited writers, it feels under-written. The producers did a reasonable job, working with an evidently limited budget. The special effects are rudimentary, but not laughably amateurish. The actors all seem invested in their roles. Some of the humor is sophisticated, particularly a dream sequence involving Rutherford B. Hayes and two deceased rappers. <br><br>It's possible to produce memorable, critically respected, financially successful films on modest budgets. Movies that come to mind include Kenny (2006), Dark Star (1974), Clerks (1994), Locke (2013) and Dinner Rush (2000), although not all were equally successful on each criterion. If one strips away all the elements of blockbusters that aren't available on shoestring budgets, such as A-list talent, huge casts of Bollywood dancers, car chases through throngs of tourists at exotic locations, armies of animation artists, specially constructed cities, 70mm Panavision cameras, etc., the one critical element is a brilliant script. SOC has a good script, but it's not good enough to overcome the production limitations, even with heartfelt performances and competent editing and production values.","user":"ginocox-206-336968","rank":[7,11]}]