[{"title":"The pieces don't quite fit","rating":3,"date":"28 August 2018","review":"This is a very strange little movie. The main character, Agnes (Kelly Macdonald), appears sympathetic at first-- a housewife in Connecticut who discovers she has a talent for speeding through jigsaw puzzles. But as the movie progresses, she reveals herself to be not only selfish, particularly about sharing her own emotions and desires, but also distrustful and cruel. <br><br>The odd thing is, no other reviewer I've yet read has felt this way, so I feel obliged to offer evidence:<br><br>1. She's deceitful. When she discovers her puzzle skill-- which is formidable, her hands don't even pause while she's working a jigsaw puzzle-- she connects with a wealthy man named Robert (Irrfan Khan) and begins commuting twice a week from Connecticut to his townhouse in Manhattan to practice for the national championship. Instead of telling her family-- a husband and two grown sons-- of her new interest, she lies to them. Why? Her husband Louie (David Denman) is an old-fashioned man-of-the-house type, but he's a loyal, loving, hard-working garage owner, and a dedicated family man. Their sons also love her and, when she finally does tell the truth, they encourage her, which positively influences their father. So she knows her own family so little that she doesn't know she can trust them?<br><br>2. She's more housewife than mother. Their son Ziggy (Bubba Weiler) is depressed because he hates working in his father's garage but he doesn't know what he wants to do and claims he's \"not good at anything.\" How does Agnes respond? Does she say, \"But remember in school, how you loved math / were so good at chemistry / at languages / at woodworking / at whatever...\"? No. She apparently has no idea what her own son is good at or even what he's interested in. It's only when he says he wants to cook that she responds with, first with genuine surprise, then with support.<br><br>3. She betrays her husband. When she has sex with her puzzle partner, it is a bolt out of the blue. There was little flirtation and no evidence of passion (not even for jigsaw puzzles, really, though they talk about how it calms their tumultuous thought patterns). The sex happens exactly once, on the very day Agnes tells her husband about her puzzle hobby, and her admission shows little respect for him: \"I think I'm having an affair,\" she says. \"You THINK you're having an affair?\" he says, in tears, devastated. <br><br>4. She also betrays her puzzle partner, and in the worst possible way. They actually win the national championship, which elevates them to the international competition in Brussels. He believes they're in love because they both said as much to each other, but when he calls her to say he's booking the ticket, she refuses. She gives up the competition, and him. Never mind his commitment to it. Does she give him a reason? No. Do I know why she backs out? No, I do not. Does she still love him? Did she ever? Who knows.<br><br>Even played an actress as engaging and naturalistic as Kelly Macdonald, Agnes is hard to believe as a realistic woman living in the 21st century. There's a jolt in the very first scene: Agnes is shown vacuuming, cooking, etc., preparing her home for a party-- which turns out, in a revelatory little twist, to be her own birthday party. A housewife through and through, she is more servant/hostess than honoree until it's time for gifts. One gift is a 1,000-piece jigsaw puzzle that fuels the plot. Another is a cell phone from her son. A cell phone? Both my companion and I were surprised at seeing modern technology in a movie that we both thought was taking place in the 1950s. <br><br>Agnes projects some emotional depth, but truly gives herself to no one, which suggests that she has little capacity for life-fulfilling love. I did check the spoiler box, but I won't reveal the ending simply because it's so contrived, and almost arbitrary. It does, however, confirm Agnes as an essentially callous, self-centered woman. <br><br>The reason for my low rating (3) is that I think the filmmakers failed to make Alice a sympathetic character, though it seems quite clear that's what they intended. I rest my case.","user":"Irie212","rank":[83,116]},{"title":"Puzzling out the Game of Life","rating":7,"date":"20 October 2018","review":"Living in provincial Connecticut, married to an auto mechanic with two grown sons, Agnes resembles a church mouse, suppressing her own aspirations in order to maintain an ordered household. On the surface, she appears to be a devoted wife and mother, but timidity and low self-esteem have disconnected her from family, friends and herself. A jigsaw puzzle birthday gift leads to Agnes learning she possesses a hidden talent for piecing together these games of fragmented images - and this discovery opens the door to new experiences which force her to question how she's living her life.<br><br>Agnes' journey doesn't follow a smooth or conventional path as she struggles to liberate herself from self-inflicted shackles as well as those imposed by others. Kelly McDonald shows her usual excellence, range and subtlety in the lead role, with the script and direction complementing her talents nicely. Although the story's action takes place on a small stage, the characters' are confronted with major issues and upheavals before Agnes is able to figure out what she really wants, and begin the process of realizing it.","user":"tigerfish50","rank":[24,30]},{"title":"Puzzle (2018)","rating":7,"date":"4 August 2018","review":"Gotta love them independent movies. I try to go out and watch whatever I can with my Moviepass, and thought this looked like an interesting film. Kelly Macdonald is pretty underrated, having seen her and her acting talents o Boardwalk Empire. After watching the film, I thought it was simplistic, understated, but highlighted loneliness and what people do to seek out comfort from others.<br><br>The film follows Agnes who is a bored housewife. Her relationship isn't exactly stimulating and she is seeking a challenge in her life to escape the mundane day to day she experiences. She stumbles across an ad from a man seeking a puzzle partner for a competition. When she meets him she reinvigorates her love for solving puzzles and also starts to bond and fall for her competition partner. This of course, causes waves in her relationship with her family and she must seek a way to balance both.<br><br>The film can feel slow and uneventful for many people, I get it. It is definitely one where there is a lack of events, but the heart of the film is really in the portrayal of Agnes. She is somewhat subservient to the whims of her husband at first but then finds her voice and truly goes for what she wants. Its a depiction of loneliness, which is so common for most of us and the amazing moment where we think we find something new to do to occupy our lives.<br><br>The chemistry between Irfan Khan and Kelly Macdonald is good and I think that's what gets you to stay invested in the film. You would think that a film about two people putting puzzles together would be boring, on the contrary I found it simple and rather enjoyable. Its not something to write home about (despite me writing about it now) but its something you could see if you ever felt bored and needed something to pass the time. Much like the leads in this film.<br><br>7/10","user":"rockman182","rank":[22,29]}]