[{"title":"Built with imposing emotional depth, Sweet Country is an angry discourse on racism.","rating":8,"date":"9 December 2017","review":"In the ever widening divide between colour, cast and creed, director Warwick Thornton takes the traditional setting of a frontier western and builds the foundation for a brutal and angry discourse on racism and savagery. But unlike a typical Hollywood western, the savages here are not the indigenous people who fight for the preservation of their ancestral land-dwelling. Set in 1920s Australia, and just a few decades after independence, Sweet Country seeks to echo the haunting wails of the founding fathers of modern Australia. <br><br>Both haunting and tragic, the film is politically provocative and poetically proverbial in narrating a dark era when Australia's justice system was still in its infancy. On the run for killing a cruel white settler, Aboriginal Sam (Hamilton Morris) and his wife have little chance of escaping the law, especially during a time when lawmakers were the laugh of the town. It doesn't help either that a frontier soldier (played by Bryan Brown) is out for blood as a self- proclaimed lawman. Sam's only aid is his charitable employer and preacher Fred (Sam Neil). But there's something about the whole incident that Sam and his wife have kept to themselves and the only way for any sliver of redemption is to get caught. <br><br>Although deliberately paced (the very first scene is a symbolic pot on the boil), the final showdown is suspenseful but also gut- wrenching and ultimately heartbreaking. An Aboriginal himself, Thornton (who is also the cinematographer) uses gorgeous vistas of the Australian landscape to juxtapose the ugly nature of this story with the sheer beauty of his land. And amongst all this beauty there is suffering, trauma, barbaric colonialism, and absolute disregard for human life. As impressive as the visuals is Thornton's meticulously composed storytelling and it's a power structure with imposing breath, width and emotional depth.","user":"LloydBayer","rank":[45,64]},{"title":"a visually stunning outback tale with a message that resonates today","rating":8,"date":"23 January 2018","review":"Using the Hollywood label 'western' for an Australian outback drama casts an odd cultural shadow over the achievements of Sweet Country (2017). At a Q &amp; A preview in Sydney, director Warwick Thornton told the audience \"people think in boxes so we need to call it something\". However, 'western' is an awkward box for an Australian tale of such contemporary relevance and cinematic beauty.<br><br>Set in 1920s outback Northern Territory, the narrative is deceptively simple. Indigenous farm hand Sam Kelly (Hamilton Morris) and his wife are lucky to work for god-fearing landowner Fred Smith (Sam Neill) who believes that all are created equal. Fred allows Sam to help his unstable war-veteran neighbour Harry March (Ewan Leslie) for a few days but it sours quickly and Sam kills Harry in self-defence. The rest of the story tracks the hunt led by Sergeant Fletcher (Bryan Brown) through treacherous country that is home for Sam. Eventually white man's justice must be faced.<br><br>This is an outstanding film for many reasons. In terms of visual impact, it is stunning. The cinematography shows a deep love of country with majestic panoramas that dwarf humans. Rich red colour palettes evoke the hot, dry, heartland of an ancient land. The camera tracks seamlessly from wide-screen images to small details like a balletic sand scorpion or a cold hard bullet being loaded into a chamber. Scene after scene, we find symbols of the conflicted relationship between white man and nature; there are no words more jarring than to hear Indigenous people being referred to as \"black stock\".<br><br>In terms of aural impact, silence has never been so beautiful. It takes some time into the film before we notice there is no musical score, and none is needed. As Thornton put it, when you stand in the desert there are no orchestral violins to tell you what to feel. Silence conveys the outback. You hear the rustle of leaves in the wind, the sound of a flowing river, horses' hooves pounding the ground, and most confronting: the sound of a heavy chain being dragged across desert sand, manacled to the black hand of a fleeing Indigenous youth.<br><br>The casting is excellent. Bryan Brown and Sam Neill are almost cameo performers in their roles as hard-core outback characters. The emotional centre of the film, however, is Hamilton Morris. He speaks little and emotes even less. His face is a wide, impassive, deeply etched, and painful canvas that speaks of Indigenous people's dispossession and barbaric mistreatment by armed invaders. Views will differ over whether the Johnny Cash cowboy ballad during the credits makes this more or less of an Australian story. This powerful but disturbing film reminds Australians of our history and need to reconcile with the past.","user":"CineMuseFilms","rank":[32,45]},{"title":"A must see","rating":9,"date":"7 February 2018","review":"This movie is an absolute masterpiece of Australian cinema. The way it tells the story is nothing short of amazing. The Cinemaphotography is a joy to take in, it really shows the Australian outback in all of its glory. This film is a must see for anyone looking for a film that will impact your life in a very real way. This is real cinema in all of its glory","user":"AdamChapman1996","rank":[34,51]}]