[{"title":"Insults One's Intelligence","rating":2,"date":"2 January 2019","review":"I just found this movie to be quite awful, with terribly lame and stilted dialogue throughout.<br><br>Jimmy (David Arquette), Rachel (Allie Gonino), and Scott (Ryan Donowho) form a band called Hollow Body. Gonino is the lead singer and has an appealing voice, to go with her sultriness and charisma.<br><br>However, one night suffering from stage fright, she's struck by lightning in a car with her mother who had come to drive her home. Thereafter, Gonino becomes some type of a possessed electrically charged demon. Yes, it does sound ridiculous and it is.<br><br>I would say do yourself a favor and avoid this turkey, as it's seriously hokey and below even B-movie quality, in my opinion.<br><br>To note, there were no subtitles on my DVD copy.","user":"larrys3","rank":[9,10]},{"title":"Fizzles More Than It Rocks","rating":3,"date":"23 October 2018","review":"Lightning Strike also known as Hollow Body is a cheesy horror film in which Jimmy (David Arquette) a one-hit wonder musician and producer tries to restart his rock career by forming a new band with two young musicians Scott and Rachel (Ryan Donowho &amp; Allie Gonino) who crashed his birthday party. Things go badly when their first show is a disaster with Rachel's stage fright. Things get worse when she is hit by lightning, killed and resurected as something else. Instead of a shy timid singer she becomes a extroverted rock godess and the band becomes successful. The only problem is she burns and sucks out energy out of her victims.<br><br>Overall the idea was promising but the movie goes nowhere and is ultimately slow and boring. The narration by Jimmy gets tedious after awhile. The role of Luke Wilson as a music promoter/producer brings nothing to the film and the music is bland and generic. Overall a poor effort that tries to be rock and roll cool but fizzles out.","user":"nebk","rank":[8,9]},{"title":"Desperation strikes again and again!","rating":8,"date":"18 January 2019","review":"High Voltage rocks harder than expected! Whether you long for retribution, youth or love you will find a world that responds to lust and greed in the most electrifying of ways. It may be a shock to realize what remains after the storm blows over. Should there be a time for reflection or do we rock on?","user":"barrylanejr","rank":[1,8]}]