[{"title":"Doesn't have the same charm as the original","rating":6,"date":"1 August 2018","review":"Mamma Mia was my favorite movie growing up. It came out when I was 10 and my friends and I learned all of all the songs. Going into this movie, I was expecting to absolutely love it. However, minutes within the first scene of the movie it was revealed that Donna had died. This really upset me because Donna made the entire first movie. And they didn't even bother to mention how she died. Next, we get to the flashback scenes of young Donna. This I love because the fashion is beautiful and Lily James is wonderful and has a good singing voice. I really like how she sang the original songs but the newer songs were just meh (I don't see people getting into them). At first it doesn't really make sense how she meets the three dads because during the flashback in the previous movie they look way different. The current time scenes were pretty boring and just revolves around everyone being depressed about Donna. They could have done so much more if they had kept her alive. The movie overall lacked much of a plot or direction and you knew exactly what was going to happen (other than maybe Cher arriving on a helicopter?). Ultimately, Mamma MIA, Here We Go Again cannot match the charm and authenticity that made me and everyone else adore the first movie but I still think it's worth a watch.","user":"liveyanne","rank":[140,197]},{"title":"If you liked the first \"Momma Mia\", you'll love this one!","rating":10,"date":"21 July 2018","review":"I spent 90% of this movie with a huge smile on my face and 10% trying not to ugly cry. Wonderfully cheesy and lovely!","user":"andersond-266-146287","rank":[304,450]},{"title":"Here we go again","rating":10,"date":"21 July 2018","review":"In a world that has gone crazy, it was so nice just to sit back for 114 minutes and forget about real life. Transport yourself back to a simpler time and of course to the wonderful music of ABBA. \nThroughout the movie you go through all the emotions yet once it had finished you just want to sit there and wish you could do it all again \nThe whole cast looked like they had as much fun making it as we did watching it. Everyone did their bit although Lily James was outstanding as the young Donna.\nIt's one of those rare films as you leave your seat and enter the real world you do so with the biggest smiles of your face.","user":"lee_murcutt","rank":[216,320]}]