[{"title":"Better than I expected","rating":5,"date":"17 December 2018","review":"Ok so post apocalyptic films will always get compared to Mad Max and this is no different. But with the obvious small budget it has to work with here Supergrid succeeds in delivering what you expect. The performances are passable but not high quality as are the effects and action. Nothing stands out here but the film is watchable and better quality than many I have seen of a similar budget range.","user":"arranwilson","rank":[9,10]},{"title":"It's good Sunday night Sci-Fi flick","rating":7,"date":"28 December 2018","review":"This movie was clearly loosely based on the novel Roadside Picnic. If you're familiar with the STALKER games, you'll know exactly what this movie's about. Male leads were quite good and there was lots of action.","user":"nickb-13","rank":[4,5]},{"title":"Escape from Canada","rating":3,"date":"7 January 2019","review":"In the future the Sino-Gazam company mines in the Northwest US and Canada. It is foreign owned and for some reason is allowed to violate all environmental laws. Their mining causes earthquakes or tremors which didn't weigh into the film. It also poisons the water and has caused a lung disease which is treated with pharmaceuticals instead of natural products.<br><br>The company needs people to make trips into and across the zone by vehicle because planes...well I don't know why they didn't fly, other than it wouldn't make for an interesting movie. Deke (Marshall Williams) and his brother Jesse (Leo Fafard) are coerced into making the trip into the grid to pick up a mystery package. The Grid is occupied by a gang known as Jackals (Jacks for short) who are also infected. They demand clean water to pass through.<br><br>This is an apocalyptic type action film. The truck has a thorium engine and I have no idea how a man at the other end of a radio can detect if it has a radiation leak and the levels. The plot wasn't solid. The script incorporates the issues with fracking and adds in big Pharma conspiracy theory as well as right-wing misinformation about the Uranium One deal where a foreign country takes complete ownership and operates unchecked. On top of that, the dialogue was forced and the acting couldn't support it.<br><br>Guide: F-word. No sex or nudity","user":"nogodnomasters","rank":[6,11]}]