[{"title":"One of the better films about Amityville.","rating":8,"date":"7 April 2019","review":"There have been a handful of decent films on the subject of Amityville but also a few real straight-to-video stinkers. I personally think this is one of the best films to tackle the subject.\nI understand why it has gotten some low ratings. In a world where people want horror films to be full of jump scares and unsubtlety, this offering is very much understated...and is all the better for it. Suspense is slowly built up and then sustained and special effects are used sparingly.\nAmityville has become part of contemporary folklore. The debates about whether or not it was a hoax will continue undoubtedly. What the ending of this film does, with the use of crime scene photographs and family photographs, is remind us that at the centre of the legend is the undisputed fact that a family was murdered in the house on Ocean Drive, regardless of whether or not we believe the rest of the tale. It's a sad truth that is often lost among the folklore and is a sobering thought.","user":"halcyonbear","rank":[12,15]},{"title":"Shockingly good!","rating":8,"date":"11 March 2019","review":"I was expecting little to nothing from this entry. Am not a huge fan of the series. Thought the original and the Ryan Reynolds reboot had their respective merits. Figured I could passively watch this while multi-tasking. To my surprise it was very good. By no means on any of my \"all times\" list but far better than I could have reasonably expected. Don't know how accurate it is--and the people that would know are not talking--but, assuming it is, it's a good account of the events that led up to the original film. If you are interested in a slow-burn thriller--ostensibly based on real events--check this one out.","user":"reywal99","rank":[15,20]},{"title":"Looked better in the previews","rating":3,"date":"5 April 2019","review":"Slow moving, full of little historical inaccuracies and lacked authenticity.<br><br>Acting was \"meh\", watching the mother try to smoke/not smoke that cigarette in the kitchen was painful. Modern doorknobs, electrical outlets and LED candles? I would think that if you were planning to make a retelling of something historic, you'd make sure sure that every effort to ensure authenticity in your sets. Isn't this kind of research what interns are for?<br><br>If your budget was the problem, you should have just told the story in the first-person in Butch's head and used stills of the actual DeFeo's when you needed them...","user":"joeplai","rank":[8,10]}]