[{"title":"Awesome comedy. Dark, funny, witty n a superb ending.","rating":9,"date":"8 April 2018","review":"SPOILER: Saw this in a theatre. Was highly anticipating it because i loved the director's earlier effort Delhi Belly which was outrageously funny. Of course the other reason is Irrfan Khan.\nThe film follows the life of Dev (Irrfan) and his sometimes odd, sexual preferences. The missing photographs scenes were hilarious. The face cover scenes were hilarious too.\nDev who is most attracted to his wife when she's sleeping, has a habit of peeping through a hole into his own bedroom. One night Dev comes early as advised by his colleague, finds his wife sleeping with another man.\nSurprisingly, given this dark subject matter, hilarity does in fact ensues. \nThe film is filled with wacky complications, it takes a turn into darker territory with blackmailing, murder, conspiracy n accidents. One of the best part is that ther r no bloody songs except for one item song which was necessary for the colleague getting drunk n opening his mouth.\nThere is some cleverly intelligent comedy here, but thats what I come to expect from Irrfan n Abhinay Deo.\nThis film is really Irrfan's. He imbues his character with a sweetness that makes him more human and we as audiences wants him to win in his Pac-man game as well as in his revenge.","user":"Fella_shibby","rank":[32,41]},{"title":"Irrfan rocks! Amit Trivedi's good music. Bit slow. Reccomandable.","rating":7,"date":"6 April 2018","review":"Film has Irrfan in the lead and that is fine enough for somebody to decide whether he is going to watch or not! Director Abhinay Deo is back in his favorite genre - Dark Comedy.<br><br>Well, comedy is something which one enjoys loudly while seeing it. One laughs out loud or cheers mainly in comic scenes. But here, not a single person in the hall was laughing. Actually, I was the only one who laughed at some points in the film. So, I would not term this film a Dark Comedy, but a Dark Humour. <br><br>Film is about Dev (Irrfan) who finds out one night that his wife (Kirti) is cheating on him. Because of EMIs and other interests, he decides to blackmail his wife- Reena's lover for some money. The lover boy (Arunoday Singh) asks for money to his wife Dolly (Divya Dutta). But her parents want the amount back from him. So, Lover Boy also blackmails his lover a.k.a. Dev's wife. Eventually, Dev is giving money to his wife which later he collects from that Lover boy. Meanwhile, colleagues of Dev also come in the picture to make some money. The chain becomes extremely complicated. For unlocking it, watch out this one.<br><br>Irrfan is superb. The scene of him running from his house after getting shocked to see his wife with another man is fantastic. Kirti is suitable and good. Arunoday delivers a good performance. Divya Dutta is as usual classy. Omi Vaidya is nice, too. Anuja Sathe plays an important role along with Pradhuman Singh and Gajraj Rao. <br><br>After Irrfan, the major plus point of this film is its music and songs. Amit Trivedi has given superb songs. First time I enjoyed all the rap songs in a film. Each and every song is perfect according to the story line. Lyrics has been written accordingly as well. 'Bewafa Beauty Pyaar Mein Cheating Kar Gayi!' Urmila Matondkar is there too in this item song. 'Nindaraan Diyaan' &amp; 'Sataasat' are perfect. Patola and Happy Happy are not in the film, but they're also good. <br><br> Abhinay Deo is a good director. Each scene has its own element. First song of the film where Irrfan is all alone in the office and goes to bathroom says it all. The detailing of each posters and usage of props are up to the mark. <br><br>Though, this film is not as good as Delhi Belly. It is very slow. If you don't like to see new concepts in films, you will never gonna complete this film. Background score is superb. But still, we feel too much length of many scenes. Good editing or a good screenplay could have put this film in the league of classics. As of now, if you have patience, than only you will love it. Also, post interval part is not that slow as the pre-interval part. The game is happening till the last frame. So if you are giving it a chance, wait for the end. You will surely feel that- 'The time spent well'!<br><br>On the whole, pray for Irrfan's speedy recovery. Take your time along with you to enjoy his latest dark humour- Blackmail!","user":"maulin5","rank":[12,16]},{"title":"Another Irfan's masterpiece","rating":10,"date":"16 June 2018","review":"As Irfan Khan never stops giving up his amazing performance.. this film follows the same..<br><br>The story and direction is upto par.. and every character have done justice to the movie.<br><br>Overall an excellent movie to watch... Total worth","user":"jems_acharya","rank":[6,7]}]