[{"title":"Not even close to a faithful representation of the Bible","rating":3,"date":"18 February 2018","review":"I went in with an open mind--didn't read any of the reviews, etc. I wish I would have. <br><br>They tried to make this a story about a humble man in love who made some bad choices, but that is not the story of Samson. Samson was a proud man who had been strong all his life (and took it for granted) and was driven by lust. I understand certain liberties here and there, but when they try to make the story about love and forgiveness, that is not Samson's story. The only time Samson asked God for strength was at the very end when he was blind and his hair had started to grow back. Then he asked God to give him strength one last time to avenge him for his two eyes. It was then that he killed more Phillistines at his death than he had during his life. I liked the actors, the costumes, the scenery. <br><br>Discrepancies abounded: The dialogue from the Bible wasn't even used most of the time. There was a younger brother Samson never had. What should have been in the movie, but wasn't: Samson's wife had pressed him for the answer to the riddle for the 7 days of the feast (not just the last night) under threat of death from the Phillistines. Samson set the Phillistines cornfields on fire after her father gave her to his companion because he was angry with her(which was also not in the movie) After Samson's wife was burned to death with her father, he announced he would be avenged for the Phillistines killing her and that is when he killed them with a great slaughter. After the men of Judah \"delivered\" Samson to the Philistines is when he used the jawbone of an ass and killed 1,000 men. \n Delilah had been approached by the lords of the Phillistines and promised 1100 pieces of silver from each of them if she found out the secret of his great strength. Clearly, the woman never loved him, she was just using him. He lied to her several times and she said \"the Phillistines are upon you\" each time, and each time he got out. She got mad at him and kept after him until he finally told her his secret. She never had remorse for betraying him, she was only in it for the money. <br><br>This was as frustrating and disappointing as the revisionist version of the Bible miniseries by Roma Downey and Mark Bennett. I never thought Christians would butcher the Bible as badly as Hollywood has (think of Noah and Exodus). I expected better from Pure Flix. The people who read the Bible and know the story will be upset (as I was) with the lack of respect given to the word of God. Those who didn't read the Bible before the movie probably won't after this to get the real story, but even if they do, they'll probably wonder why they didn't stick to the truth since that's what we're supposed to be about. <br><br>If they wanted a redemptive story, they could have had it narrated by a father in the future Israel teaching his sons not to be like Samson who was driven by pride and lust.","user":"starrywar","rank":[54,83]},{"title":"Boring, tedious, bland and highly insulting to such films of cinematic history.","rating":1,"date":"3 May 2018","review":"Samson (2018) - There is a reason MOST directors should never, EVER try to take on the GIANTS of film, such as Cecil B. DeMille or Alfred Hitchock. This is one such classic film that has been cut to crap by a amateurs.<br><br>Being a remake of the classic Samson &amp; Delilah (or whatever they want to call it) I found it quite boring. If you are going to \"try\" and do a remake of what that DeMille did, make sure you are worthy enough to step into his shoes. Even the scene where Samson kills he lion is very poorly done compared to the 1949 version. Story was full of plotholes and endless scenes that were non relevant to the actual story. This seemed to be a hybrid story to appeal the followers of Twilight at best.<br><br>Boring, tedious, bland and highly insulting to such films of cinematic history.<br><br>This version at the box-office worldwide raked in $4.7M only, while the 1949 version ranked in $29M in the US alone (nearly 300M today). What does that tell you? :)<br><br>Rating: 0 out of 10.\nRating for Cecil B. DeMille 1949 classic: 10 out of 10.","user":"authorcamilson-499-156858","rank":[35,59]},{"title":"Not Bad but not great","rating":6,"date":"1 March 2018","review":"It was pretty accurate to the biblical story. I wished for a little more character development though. They did good though with the low budget that they had.","user":"john_s_johnson","rank":[22,35]}]