[{"title":"Why the negative reviews it's great!","rating":9,"date":"26 September 2018","review":"It's cheesy,corny as hell and comedic just like the old romantic comedies.It's about time they went back to old school,who want's these so called dark comedies there depressing. Take a holiday from real life and watch this light hearted romantic comedy. I'm really surprised by all the negative reviews, maybe they like watching depressing movies. Or maybe I just like cheesy like my Pizza's. \n I really wasn't expecting this film to be so funny and entertaining it really brightened up my day. You can always tell why a comedy is funny by the short clips at the credits of the actors having fun making the film. If they have fun making it,it's always more fun to watch. Romantic comedy of the year for me. Loved it more please! Like another reviewer said eat pizza whilst watching it. Have fun!","user":"knightrider-ch90-168-8385","rank":[78,111]},{"title":"JUST FUNNY!!","rating":22,"date":"22 September 2018","review":"I dont understand all the bad reviews, this movie it is what is: funny, cheesy, corny.. and what? Sometimes, we need to be reminded to what truly is life about: family, friendship, and specially love...<br><br>Wacht it having a pizzza!!!","user":"juanmargetts","rank":[53,84]},{"title":"If you like rom-coms, this one's a tragedy","rating":1,"date":"26 August 2018","review":"Two households, each bereft of dignity,\nAt College-Bathurst, where we lay our scene,\nWith \"paisano\" stereotyped ethnicities\nAnd more clichés than should be on big screens.\nFrom forth the pizza shops of these two foes\nA pair of star-cross'd lovers take their life.\nI'm kidding! None dies or even comes to blows\nThough wish it otherwise I'll bet you might.<br><br>Hayden Christensen and Emma Roberts are the unlucky, not-very-Italian actors saddled with performing in this modern-day Romeo and Juliet, set in Toronto's Little Italy and scrubbed clean of any poisonings, sword fights or deadly misunderstandings. (On the plus side, no gnomes!)<br><br>In spite of a 10-year age gap between the actors, we're meant to believe Leo and Nikki were childhood buddies growing up in neighbouring pizza shops, one run by Vince (Gary Basaraba), the other by Sal (Adam Ferrara). The two pie-stros were once best friends themselves, but had a falling out years ago; the reason is revealed at the end of the film and is no more worth the 100-minute wait than a delivered pizza would be.<br><br>Anyway, cut to the present day, when the kids are now in love but just don't know it yet. Nikki has just returned from England, where she's an up-and-coming chef. Leo continues to work in his dad's pizzeria, and moonlights at Luigi's bar, where the big joke is that Luigi (Andrew Phung) is actually Chinese.<br><br>Oh, and speaking of ethnic insensitivity, both pizza shops have resident Indian waitpersons (Vas Saranga, Amrit Kaur) who hurl insults at each other and - is this a spoiler? I'm going to say no - eventually fall for each other as well. But my favourite bit of colour-blind, accent-deaf casting had to be Andrea Martin as Nikki's granny, who delivers all her lines while staring into the distance as though waiting for a paycheque. Between this and My Big Fat Greek Wedding, she's become the go-to older relative of whatever nationality you need.<br><br>Little Italy was directed by Donald Petrie - Mystic Pizza; I know! - from a script by Steve Galluccio (Mambo Italiano) and Vinay Virmani (Dr. Cabbie). William Shakespeare's name is not in the credits, although the filmmakers were kind enough to include the rarely used scene from Act IV where Romeo chases Juliet through an airport. Otherwise, it's a pained mish-mash of rom-com clichés, including old people being horny and making Beyoncé references. <br><br>The leads have a soupçon of chemistry, most of its predicated on Roberts' squeaky laugh and Christensen's ability to be gentlemanly while drunk. But it's not enough to recommend this tired outing. I'd advise you to walk pasta theatre that's showing it.","user":"cknight-2","rank":[67,114]}]