[{"title":"Get your popcorn and settle in for a terrific movie!","rating":10,"date":"14 October 2018","review":"Being a huge Michael Kelly fan, I couldn't wait for this movie, All Square, to come out. He adeptly plays the role of John \"Zibs\" Zbikowski, a morally challenged man who does what he feels he needs to do to get by as he journeys through the residuals of his hard-knock life. <br><br>Zibs, a bookie, down and out, finds an opportunity to take bets on little league baseball games in a small-town community. Having attended more than a few children's sports games in my time, the action and ambition of the parents at these baseball games was funny and spot on.<br><br>This story subtly shows us that life is full of challenges, and the road we travel on is always full of choices, and not always easy ones to make. Sometimes we make the best decision-other times we don't. No matter what, we live with the repercussions of those choices.<br><br>My favorite part of the film was the relationship established between Zibs and his ex-girlfriend's twelve-year-old, wanna-be baseball pitcher son named Brian, who was flawlessly played by Jesse Ray Sheps. These two actors have a great on-screen chemistry. Zibs, in spite of his mis-deeds, is likable and an inherently good-hearted man.<br><br>Another aspect of the movie that shows how the decisions we make impact our lives is skillfully shown in the relationship between Zibs and his father, Bob, (played by Harris Yulin).<br><br>This movie, reminds us that we are our choices, and we are often given the opportunity to re-direct our lives based on those choices we make. The impact of what we decide to do may be life altering or simply a small step forward toward a different life path. \n \nThe message of this terrific film is delivered through an engrossing story that is demonstrated through humor, in a delicately complex and understated way. <br><br>Thrillers and high-action films are great, but I wish they'd make more unique movies like All Square. I highly recommend it.","user":"beverlyknauer","rank":[5,10]},{"title":"Slow at few scenes for a gambling movie,, but it was over all enjoyable ..","rating":7,"date":"2 December 2018","review":"The movie is really good, loved seeing Michael Kelly back after that \"House of cards\" break ... it was a nice touching plot ,, mostly drama ,, as i said, it got a bit slow in few scenes but again the it picks right up with some quick thrilling comedic run ;)<br><br>I think i had a problem with the the screenplay and the directing style .. the script even though looks tight and connected ,, it still had some holes and gave a bit of dullness to the sequence of the whole purposeful sense... directing wise ,, it as i insinuated, it should have been faster for a gambling movie.<br><br>The cast were all good ,, Michael Kelly and Jesse Ray Sheps engaged really well..<br><br>so least to say, the movie is recommended ,, not strongly though... meaning if you like Michael Kelly i think its worth spending the 7 dollars on these 90 minutes.","user":"Aktham_Tashtush","rank":[2,3]},{"title":"Dont b e fooled with trailer, it's a drama not comedy, with rare funny parts","rating":6,"date":"26 December 2018","review":"John (Michael Kelly) is a bookie whose black-market business is being severely undercut by online gambling and the unwillingness of his clients to pay him the money they owe. So he is deciding to bet on local Little League games.<br><br>\"All Square\" hits too many familiar beats to be memorable, also it remains low to the ground for the most part not to mention that it doesn't succeed on the humor front - probably because of the director John Hyams, who is an odd choice for this film 'cos of his previous involvement in the action genre (\"Dragon Eyes\", \"Universal Soldier: Day of Reckoning\"). With a larger budget, \"All Square\" could have been more of a cinematic thriller with twists and turns at every corner. Instead, it's a smaller-focused feature film that serves as a character drama study. Basically, while \"All Square\" is not an entirely enjoyable ride, it's all a bit too thin. 6+/7-","user":"akcenat","rank":[2,4]}]