[{"title":"Kangana effortlessly brings Manikarnika to life.","rating":8,"date":"25 January 2019","review":"Manikarnika: The Queen of Jhansi is a biographical account of how Rani Laxmibai waged a war against the East India Company.<br><br>Manikarnika starts with Amitabh Bachchan's booming baritone where he throws light on how the riches of India are fast being plundered by the British. Within seconds, we are led into the world of Manikarnika through Kangana Ranaut's imposing screen presence.<br><br>Kangana captivates your attention in every frame and grows from strength to strength as the film progresses. This is clearly one of her best performances.<br><br>The narrative of the film directed by Kangana Ranaut and Krish, stays on course showing the internal struggle within Jhansi's royal family and unraveling important historical events during the 1800s. Some incidents like the Meerut Sepoy mutiny of 1857 are used as reference points, but the focus remains on Jhansi's rebellion against the British.<br><br>Film succeeds in stoking the patriotic passion within the audience without being too overbearing.<br><br>The second half is where the real drama unfolds with scenes on the battlefield, intense action sequences, bloody killings, escape, loss and triumph.<br><br>There aren't much dull moments in this rousing war drama.<br><br>Overall, Manikarnika is a well-made film that highlights Kangana's prowess as an actor.<br><br>Short of an epic, this larger-than-life war drama has enough valour and spirit to keep you engaged in these pages of history.<br><br>\nWorth a watch..!!","user":"Tejas_Vinda_AITS","rank":[56,87]},{"title":"Mindblowing !","rating":10,"date":"25 January 2019","review":"Literally, by the end of the movie my brain had been blown to bits - in a good way that is. The second half of the movies is so shockingly intense that I, for one, wanted to join in the battle, particularly because I saw the movie on a big screen. And that seems to be the main goal of the film-makers here - bring the legend of the great warrior queen, sensationalized not only by historical records but also a famous Hindi poem by Subhadra Kumari Chauhan, alive on screen, so that you can live the experience of the events that occurred more than one and a half century ago. And how the film succeeds in doing so!<br><br>Performance (especially Kangana, though the supporting cast is exceptional too), costumes, score, cinematography - everything in the film works very well. Editing could have been better - in many places, the events feel disjointed, though admittedly, because the screenplay had to jump places, I cannot imagine what could have been done to make it more easy-flowing. Kangana;'s performance goes a full arc from an innocent but brave teenager, a wife and lover, a mother and to finally a patriotic warrior, and she nails every shade with priceless facial expressions.<br><br>To be clear, if you are expecting a multilayered biopic that explores the Rani's character in depth, this movie is not that and it is very obvious that the film-makers did not have that goal in mind. The Rani is therefore depicted somewhat like a real-life superwoman from the annals of history, and just like 'Gandhi' did for Karamchand Gandhi, everything in the film, including the supporting cast, has the sole purpose of polishing that image of Rani Laxmibai's as a virtuous warrior and a superwoman. I think it is very important for the audience to understand what expectations to go into the theater with.<br><br>Having said that, it should be mentioned that the audience will be treated to a pretty well-depicted backstory of the Rani's life in the first half - before she became the \"veerangana\" who fought the British. It would not be incorrect to say that if you love emotional drama, the first is your half of the movie and if you love action, the second is your half.<br><br>To conclude, you are in for a huge treat if you are Kangana's fan and if you have loved movies like 'Braveheart', 'Gladiator' and '300' - this movie glorifies the Rani's saga in pretty much the same manner that '300' glorified that of the Spartans.","user":"lamemoviesguy","rank":[57,90]},{"title":"Best cinematic experience and Must watch for every Indian","rating":10,"date":"25 January 2019","review":"Best cinematic experience and Unable to differentiate between the actor and the real Queen.<br><br>Waited for a long time. But finally had the experience. This will be known as one of the best movie made in Bollywood. I am sure this is going to rock box office too. Will leave an impact on u &amp; fill u with patriotism","user":"nageshmanu","rank":[42,66]}]