[{"title":"10 Stars from 26-year Navy veteran","rating":10,"date":"10 November 2019","review":"If you want to bypass the quibbles and get straight to the meat of this review, please skip to my last paragraph.<br><br>The Battle of Midway is a story that's well known to most Annapolis graduates of my generation and earlier. The battle was a key inflection point in World War II, perhaps the pivotal moment changing the course of the Pacific War.<br><br>Although I loved seeing Henry Fonda as Nimitz in the 1976 version of \"Midway\" (Fonda was to play Nimitz in \"In Harms Way\" as well), unfortunately, I found that movie to be surprisingly dull, historically inaccurate, unnecessarily melodramatic, and generally not very good.<br><br>Because my experience is that more recent movie renderings of historical subjects usually don't improve the historical accuracy (I'm thinking of 2001's God-awful Ben Affleck \"Pearl Harbor\" vis-à-vis 1970's \"Tora Tora Tora\"), I did not have high hopes for this new \"Midway.\"<br><br>I was wrong.<br><br>In short, \"Midway\" is a terrific movie. Not only does it get the history (mostly) right, it's a tight, elegant, and superb rendering that does the historical figures proud. It succeeds to pack way more into its 2 hour, 18 minute run length than you can imagine. It covers the attack on Pearl Harbor, the PACFLT-Washington tension &amp; dynamic, Nimitz's ascension to command of the Pacific, LCDR Layton's contribution to the intelligence picture, Joe Rochefort's robe-wearing genius, Yamamoto's soul-searching, Halsey's tenacity, the ascendency of naval aviation, a tiny bit of the submarine contributions to the battle, and-oh yeah-the actual battle itself, to include the incredible, unbelievable jaw-dropping (but true!) heroism of our Yorktown and Enterprise naval aviators. And it does all this justice, in a superb bit of moviemaking.<br><br>Can a 26-year Navy veteran like me find nits to pick on? Of course:\n<ul><li>I saw a few collar devices that weren't pinned on right (I'm talking about you, Layton!)</li><li>At least one scene that is historical legend but didn't really happen</li><li>The substantially underrepresented submarine role in the battle (being a submariner, perhaps my biggest regret)</li><li>Some Annapolis grads wearing their class ring on the wrong hand (tradition has us wearing our rings on our left hand, not the right)</li><li>Sailors not \"squaring away\" their Dixie cup hats the way they would have back then</li><li>I wish the Pearl Harbor officers' club was as nice as they portrayed it in the movie!</li><li>They placed a non-existent cemetery on Pearl Harbor's Hospital Point</li><li>Kimmel didn't watch the attack from the Pacific Fleet headquarters, he watched it from his office on the Pearl Harbor submarine base (which later became my office and is on the national register of historic places)</li><li>They would not have worn their service dress khaki in the Officer's Club-- they would have worn service dress whites (chokers)</li><li>The band in the O-club would have been locals not sailors (they missed an opportunity to have somebody like Gabby Pahinui playing!)</li></ul><br><br>But the good stuff way exceeds the nits:\n<ul><li>They got the Pacific Fleet headquarters right-- it's not the Pearl Harbor shipyard commander's building</li><li>They got the torpedo failures right-- torpedoes were terrible early in the war</li><li>They got the Yorktown repair in 48 hours in Drydock 4 in the Pearl Harbor shipyard right-- the shipyard rendering was near perfect</li><li>They got the code breaking room in the basement of the PACFLT headquarters right (when I was stationed there the room was being used to store furniture and I petitioned to get it on the national register of historic places)</li><li>It might have been a lot of CGI, but it was really good CGI. They rendered Pearl Harbor almost perfectly. I could even make out my Ford Island house from my time as commodore, as well as a historically accurate rendering of Pearl Harbor Naval Shipyard, the Pearl Harbor submarine base, and of course, the ships and planes.</li><li>Something I never thought I'd hear myself say: Woody Harrelson was superb as Nimitz. He's no Fonda, but he was understated and believable, the way I've always seen Nimitz in my mind. Not a casting idea I would have thought of, but it worked!</li><li>Except for the collar device issue listed above, the uniforms were exactly right for the period, from the flat shoulder boards that were being used in that era, to the beaten-up look the ship's laundry would have given Service Dress Khaki, to the way the sailors were dressed, to the way the pilots wore their wings, etc.</li><li>It even brought out the fact that movie director John Ford was on Midway doing a documentary when the battle went down. The fact that Ford volunteered for the Navy, saw battle, and was injured, while John Wayne remained (in his mind) safely at home, become a point of tension between the two men, with Ford being one of the few who felt comfortable belittling Wayne for his lack of service as the years went by.</li><li>I really liked the outtro mini-bios of the real characters at the end. I didn't learn anything new there, but thought they were extremely well done.</li></ul><br><br>In the end the 2+ hours flew by for me. It was so good, I plan on seeing it again next weekend. What a terrific way to celebrate Veteran's Day.<br><br>Of course, Roland Emmerich's prior movies have been, on the whole, simpleminded blockbusters. But this time he took a risk by doing something thoughtful, respectful, accurate, and artistic. The only way to ensure movies like this continue to be made is for the public to show we care about history and accuracy, and to make this movie a success. I very much hope it does well. Then maybe we have a chance of getting the right movie made about the Indianapolis.<br><br>A final thought: I've been disgusted by many of the cynical, snarky reviews written by professional movie reviewers, many of which sneer at the bravery of the warriors depicted. Yes, the dialog in this movie is sometimes simple, tired, and trite. A few of the characters are not well developed, particularly the women. It's perfectly appropriate for reviewers to criticize elements of moviemaking. One reviewer made fun of the line of dialog where Best says \"This is for Pearl Harbor.\" There is nothing silly or unreasonable about that line. You can bet one of the pilots actually said something like that that day. As somebody who survived 9/11 attack on the Pentagon, when I later went to Afghanistan, you can bet if I had the chance to do so I would have said, \"This is for Gerry DeConto,\" one of my friends who didn't make it out that day. But many these sneering reviewers have gone on to say to readers that because of these weaknesses, they should not see \"Midway.\" Keep in mind that there were similar elements of Spielberg's \"Lincoln\" that could be considered inaccurate and/or over-the-top movie-making (most of the scenes depicted in Congress, for example), but on the whole the events portrayed in that movie are important for Americans to understand. Same is true here. So the point I want to make is this: a movie can have elements of poor moviemaking, and yet be an important movie for viewers to watch. \"Midway\" is one such movie. It depicts a poorly understood event in American history, but one that Americans should be exposed to. The events depicted, and the people depicted, are real. They really did these things. The bravery was real. Americans need to know this, and reviewers who have likely never risked anything in their lives should have the good graces not to sneer at those who have.","user":"subcmdr","rank":[769,917]},{"title":"Account of Crucial Naval Battle in Emmerich Style","rating":8,"date":"29 October 2019","review":"This film is a straightforward retelling of the events in the first months of the War in the Pacific beginning with Pearl Harbor and culminating in the Battle of Midway (June 1942). In between, it also touched on Doolittle's Raid on Tokyo (April 1942) and the Battle of Coral Sea (May 1942). The story was told mainly from the point of view of two American soldiers, namely pilot Lt. Dick Best (Ed Skrein) who led his dive bomber squadron at Midway, and intelligence officer Lt. Comm. Edwin Layton (Patrick Wilson) who with his code-breaker team predicted the Midway attack.<br><br>Along the way, we meet other famous American soldiers: Admiral Chester Nimitz (Woody Harrelson) Commander in Chief of the US Pacific Fleet; Vice Admiral William \"Bull\" Halsey (Dennis Quaid) who led the aircraft carrier USS Enterprise; Rear Admiral Raymond Spruance (Jake Weber) who took over the Enterprise for the Battle of Midway; Best's fellow aviators Lt. Comm. Wade McClusky (Luke Evans), Lt. Comm. Eugene Lindsey (Darren Criss) and Lt. Comm. Jimmy Doolittle (Aaron Eckhart); cryptographer Commander Joseph Rochefort (Brennan Brown) and Aviation Machinist Mate Bruno Gaido (Nick Jonas).<br><br>The side of the Japanese Imperial Army and their unique military culture were also given fair screen time in this film. Admiral Isoroku Yamamoto (Etsushi Toyokawa) of the Imperial Japanese Navy and the Commander in Chief of their combined fleet, was portrayed with calm and quiet dignity. We also get to meet other Japanese officers and their own brands of leadership Rear Admiral Tamon Yamaguchi (Tadanobu Asano) who commanded the Hiryu with nobility, and Vice Admiral Chuichi Nagumo (Jun Kunimura) whose controversial battle decisions had negative impact against the Japanese campaign.<br><br>The execution of the critical battle scenes are the main draws to watch this film. Director Roland Emmerich will always be remembered as the man who brought us \"Independence Day\" (1996) and \"2012\" (2009). Of course, there are big explosions and massive destruction here as well. The massive scenes showing fiery exploding seacraft and aircraft were rendered with crisp cinematography and meticulous visual effects to create impressive screen spectacles. The aviation scenes, particularly the dive bomber runs by Dick Best, were excellently staged, shot and edited to elicit an exhilarating rush.<br><br>For its 2 hours 18 minute run, the story of the crucial naval battles and the heroism of its real-life protagonists were front and center here in \"Midway.\" There were no fictional characters or cheesy love stories like in the first \"Midway\" film or \"Pearl Harbor.\" While seeing some popular young actors like Criss or Jonas can be distracting, the all-star cast generally rendered honor and respect to the heroes they portrayed. Focusing on soldiers of lesser rank allowed for some intimate personal drama in actual battle situations, perhaps with not much depth as possible. As this movie is rated PG, so do not expect to see graphic injuries at the level of \"Saving Private Ryan.\"","user":"3xHCCH","rank":[368,484]},{"title":"Hollywood actually made a decent war movie without pushing a political agenda","rating":9,"date":"10 November 2019","review":"This is probably the first time in over 50 years Hollywood made a solid war movie without inserting a sappy, contrived romantic sub-plot, pushing some radical political agenda, or re-writing history.\nThe movie is good. The dialogue is believable, natural, and convincingly delivered in almost all cases.<br><br>While no movie is perfectly accurate historically - historians don't even agree on much, so who is to say - the few errors here are trivial and immaterial to the how events progressed. As somebody who is a buff on this period of the early Pacific war - reading every book by Prange, Lord, and many others - I was very impressed.<br><br>I went into this movie expecting the worst from Hollywood, but this was their best historical piece in generations. Even the casting seemed to echo the real people in looks and demeanor.<br><br>The Japanese point of view wasn't neglected either. While I can't say whether the Japanese dialogue was believable or well-delivered, by all outward appearances this acting was also top notch. The similarity between the real Admiral Nagumo and the actor was particularly striking. They made the right call in using solid Japanese actors speaking Japanese.<br><br>The accurate portrayal of the friction between the Imperial Navy and Imperial Army with Emperor Hirohito almost powerless to restrain the militarists was very refreshing. This was a very important, complex contributing factor to the war. Few outside Japan and some narrow historical circles ever learn about this dynamic.<br><br>About the worst I can say about this movie is the pace was too fast. Unless stretched into an 8 hour mini-series, I can't imagine they could have avoided this. With my background, I could fill in gaps and context the movie seemed to miss. Others might be left confused. Even though not well-read on this chapter of history, my spouse followed the storyline without issue and really enjoyed the movie as entertainment.<br><br>Kudos to the producers, writers, actors, and entire crew. This was a job well-done and a fitting tribute to heroes like Layton and Best.","user":"brian-carter-110-625553","rank":[282,390]}]