[{"title":"Jaoui-Bacri, the censors of morals, strike again!","rating":8,"date":"17 July 2018","review":"Following the model of their great ancestor, La Bruyère, and his famous 'Caractères' (1670-1694), Agnès Jaoui and her partner Jean Pierre Bacri, besides being the talented actors we know, have been correcting the manners of their times by laughing for three decades and a half now. Starting in 1992 with 'Cuisine et Dépendances' (the play and its film adaptation), the two new La Bruyères have been unremittingly hurling barbs at the pretenses, hypocrisies, mediocrities, foolishness, meanness of our contemporaries. They strike again with 'Place publique', their latest project to date. This time around, the devilish couple have gathered together and locked up for a couple of hours a sample of individuals who, of course, will not emerge unscathed from the experience. All are guests at a house warming party in the countryside (but not too far away from Paris !), during which they will show, beyond social manners and affected airs, who they actually are. Having responded the invitation of Nathalie, a TV producer, are celebrities or \"semi celebrities\" like Thomas - an actor, Biggistar - a YouTube star ; Castro - a TV host whose star is paling), committed people (Agnès, Nathalie's sister - a leftist militant ; Jean-Paul - a Doctor without Borders ; Guy - a sought-after organic gardener.) There is also a handful of everymen and women such as Manu - Castro's young driver ; Mickey - a sound engineer ; Vanessa - a waitress more inclined to flutter around V.I.Ps than to do the job she has been hired for ; Delavenne - a quick-tempered farmer.\n Trapped in such a unity of space (from dusk till dawn) as well as of space (Nathalie's house and its premises), the characters first greet each other, exchange platitudes and words of circumstance (oh, such a lovely place in the country! And so close to Paris!), pat themselves on the back, drink champagne, show off their best clothes, but it does not take long before the joyful atmosphere deteriorates and the guests' true nature appear. And off we go for a relentless game of massacre!\n The worst of the gang is undeniably Castro, a self-centered, conceited, falsely affable, ex-TV star whose show consists in pumping famous people for some dirt. Other defects of his pop up as the story develops, among which jealousy, spying over his girlfriend (half his age naturally), unfairness (the way he treats his driver). The man, who was once married to Hélène and shared her ideals of justice and equality has given them up for long over cynicism. His ex-wife, as for her, has stuck to them, still showing sympathy for the weakest and most underprivileged, always there with a petition to sign. At the moment, she is moving heaven and earth to have Castro invite an Afghan refugee in his show - the last thing on earth he wants! But the virtuous lady is not beyond reproach either. For instance, having damaged a car while parking, she is in no hurry to get known by its proprietor. On the other hand, has she been such a good mother to Nina ? Didn't she show sympathy for all... - but her ? And what about Hélène's relationship with her sweet life companion ? Doesn't she, believing (wrongly) about Jean-Paul's feelings for her, envisage dumping the poor fellow without further ado? Well, it looks as if the saint has feet of clay! \n I will not go into details concerning the other characters, but be assured that their foibles, hypocrisies and ridiculous behaviors are a guarantee of chuckles throughout.\n Some will blame \"Place publique\" for not breaking new ground. Well, they are not wrong in this but so what? Should all works be avant-garde? I would say no, as only a minority of pioneers explore new ways of expression; which they do at the risk of disconcerting the public. The great majority of filmakers simply try do a good job of entertaining their public. And the best among them are those, like Jaoui and Bacri, who have the twin ability to make us laugh and to step back and look at ourselves. Viewed in this light, \"Place publique\" is just excellent. A clever plot enhanced by clever lines uttered by clever professionals, seasoned or still in their prime..., well, there are worse things on earth, aren't there?\n You will certainly take pleasure in a satire that constantly bites home. And you may also rejoice over the authors' determination not to sink into sterile bitterness. Jaoui-Bacri's causticity is indeed (and quite rightly to my mind) softened by their handling of two characters, Manu, Castro's chauffeur, and Nina, Hélène and Castro's daughter. Neither Quixotic dreamers nor awful cynics, both are no nonsense persons who grapple with life as it comes, without cheating or putting themselves forward; Manu and Nina simply do the best they can in a callous society so oblivious of its youth\n A way for the La Bruyères of modern times of paying homage to the new generation and professing their faith in those who will take over. By the end of the story, the two young people are about to form a couple - a nice way to conclude a film which otherwise, would have been sour and nothing else.","user":"guy-bellinger","rank":[12,14]},{"title":"Funny.","rating":6,"date":"9 January 2019","review":"French humor and irony. Good jokes and great music. Enjoyable to watch.","user":"andrebatucadabsb","rank":[2,3]},{"title":"Seulement trinte cinq minutes.","rating":6,"date":"18 September 2018","review":"Impecable French, including that of YouTube generation. Very peculiar maid, Instagram related, I suppose. \nThose things usually happen in real parties. \nSo, nothing new.\nCinema isn't always about cutting new paths, walking known ones must count as a go.\nIt seemed very real in the realm of fiction. \nOK. \nOcasionaly inteligent, almost touching in some moments.\nI am not patronizing. \nBeautiful location, good actors, but that you already know, of course.","user":"bjpafa","rank":[2,6]}]