[{"title":"Are We There Yet?","rating":8,"date":"26 December 2018","review":"A journey of reawakening in a Country like ours - Gore Vidal called it the United States Of Amnesia - the absurdity of the behavior in the Southern communities even the kindest ones have a jarring effect. Viggo Mortensen is sheer perfection as the all American Italian. The opening of his heart and of his mind is a total joy and Mahershala Ali provides another magnetic character to his already rich list of magnetic characters but what makes this film fly so high is the humanity that Mortensen and Ali infuse their characters with. I loved them and Green Book provided me with one of the most satisfying endings of 2018. It leaves you with the hopeful thought that perhaps we're not there yet but that we are on our way. Happy New Year!","user":"martindonovanitaly","rank":[536,607]},{"title":"Green Book","rating":10,"date":"14 February 2020","review":"This film proves why movies can be so powerful with a touching, poignant and some times funny story of opposites attract. Enjoyed every moment although it isn't always easy to watch. Mortenson and Ali shine and there are strong supporting roles as well.","user":"MR_Heraclius","rank":[60,64]},{"title":"\"Green Book\" is Gold","rating":10,"date":"25 November 2018","review":"We loved Green Book along with the sold-out crowd who applauded loudly at the end. Based on true story of piano virtuoso, Don Shirley's road trip through the south during the 60's, the film pays tribute to his genius and courage as a black man who tries hard to soar above the ugliness of the times. The elegant trappings of his home and his success as a concert pianist leave him arrogantly cold and lonely, but his life begins to change when he hires Tony as his road trip driver. With a history as nightclub bouncer with Mafia connections in New York, Tony is the antithesis of Don's perfection and their evolving relationship on the road makes the movie soar above the ordinary and become magical. Viggo and Ali in the main roles are remarkable, and it's funny and endearing to watch them discard stereotypes and discover their mutual humanity. What we liked best is the\nmovie teaches without preaching, it all unfolds through a myriad of natural moments between two great actors and a strong supporting cast. Top all this off with a really good soundtrack, excellent direction and production values, and an audience that laughed out loud and vigorously applauded at the end...this one is a true 10!","user":"taylor_king-890-815491","rank":[624,736]}]