[{"title":"An enjoyable film","rating":9,"date":"25 April 2018","review":"The film keeps you engaged from the start, and leaves plenty to think about when it's over. And yet it is neither preachy nor pretentious. It starts off as a film about the things people would be prepared to do in order to achieve their dreams, but it moves on to other themes, such as what you think you need vs. what you really need, being able to live with oneself having achieved something through trickery and evil deeds, or good outcomes eventually arising from people's intentions to actually do bad things. The film does not involve action, it is based around dialogue. But rest assured, it will never bore you, and it will keep introducing twists that will keep you engaged and constantly guessing what will happen next.","user":"harryplinkett14","rank":[25,29]},{"title":"Amazing premise - too bad it's just a remake","rating":7,"date":"17 April 2018","review":"\"The Place\" is an Italian movie directed by Paolo Genovese who became more famous after his previous film - \"Perfect Strangers\". Good news is that the premise of the movie is fantastic. We are inside \"the place\" throughout the whole runtime where we're listening to conversations between a man and several guests who are approaching him with numerous wishes. To have your wish fulfilled, you get a non-negotiable task from the man that you must complete. Simple wish gets a simple task, but a complicated one... Well, it can leave you wondering if you really want it that much. Bad news is that the whole idea and stories that go with it (with a little tweak here and there) were taken from a Canadian show called \"The boot at the end\" which consists of 2 seasons with 5 episodes each. If you're a fan of the show, you will probably find enjoyment here, but basically the only difference is that several episodes have been merged into one cohesive story with just a few new, original ideas which you may or may not notice.<br><br>Still, that being said, performances are very good overall and movie is an easy watch. Although, it leaves one disappointed that director choose to go the safe, more light hearted route and didn't have enough courage to do what must be done and give his characters more believable closures. With some casualties, most of them get a happy ending, and unsurprisingly they are the ones we were supposed to be more sympathetic to. \nWith all that in mind I would definitely recommend the series first but dont be afraid to give this flick a shot. \nFrom me - 7 out of 10.<br><br>Fun fact is that based on the director's most famous movie that I mentioned earlier (\"Perfect Strangers\") a remake was made in Spain, with the exactly the same premise and story and I saw the remake first. So I suppose the joke is on me.","user":"jasha89","rank":[24,28]},{"title":"When 2 geniuses meet","rating":10,"date":"24 March 2018","review":"This movie is simply perfect, thanks to the 2 geniuses who cooperated: the writer, Christopher Kubasik, and the director, Paolo Genovese. The story of Kubasik is absolutely original, and I think Genovese did a fantastic job as a director. The actors are awsome, the pace, the dialogs, the editing, the atmosphere are flawless. This is a must see.","user":"hannynorbert","rank":[31,39]}]