[{"title":"A public descent into hell","rating":8,"date":"18 April 2019","review":"I went to see this wonderful movie with a minimum of information, as usual: a Spanish movie directed by Rodrigo Sorogoyen, with Antonio de la Torre. Nothing more. De facto, with a very positive a priori. During the first minutes, the atmosphere is a Dolce vita full of show-offs, with yachts, rolex, penthouses, prawns orgies and tutti quanti, in a universe of corrupt politicians. A scandal burgeons and one of them will immediately be designed for a sacrifice, in order to preserve the party and the government. Thus, in this extemporary exercise of musical chairs, the victim is Manuel López-Vidal, the main protagonist interpreted by Antonio de la Torre. The movie is quickly and suddenly transformed into a descent into the abyss, or rather a breathless race against the clock until an ultimate and terrific confrontation that might easily be considered as a merciless fight between the two last gladiators still standing within a Roman arena, with a combativeness boosted to the extreme, for the delight of a bloodthirsty audience.<br><br>The film deals with corruption through the eyes of a man for whom one feels almost empathy, despite the absence of sympathy. Thus, if this film addresses corruption without really judging it, the focus is primarily on the ability to survive, like manifold other movies, in fundamentally different contexts: <a href=\"/title/tt8305116/\">Ayka (2018)</a>, <a href=\"/title/tt1454468/\">Gravity (2013)</a>, <a href=\"/title/tt0898367/\">The Road (2009)</a>, <a href=\"/title/tt0289043/\">28 Days Later... (2002)</a>, <a href=\"/title/tt0068473/\">Deliverance (1972)</a>, ... Thus, with El reino / The Realm, we may see what a corrupt politicien is ready to do to save his own skin. No matter what! As a conclusion, despite a few idle times, this movie is excellent.","user":"FrenchEddieFelson","rank":[24,27]},{"title":"Great script, brilliant directing and some really outstanding performances","rating":9,"date":"1 October 2018","review":"This is without a doubt the best Spanish movie I have seen in years (and I'm Spanish). It depicts the politician corruption in an excellent way. For me, the script was really really good, the directing was 100% on point and the performances were amazing. There is an actor called Luis Zahera who I didn't even know and it gives the most credible performance in the movie (as Cabrera). He is soooooooo good. The scene at the balcony should grant him all the awards he can get in his category this year. You cannot go better than that. Impossible. Definitely a must-watch film. Go to the theater and support the crew. This is as cinema at its best.","user":"dani-localisation","rank":[42,62]},{"title":"Gripping","rating":8,"date":"7 July 2019","review":"This movie is brutal. From second one, it grips you in its story line about politics and corruption, with a tight and breathless script and amazing acting (de la Torre has an intensity that transpires from the screen, and here gives us again a bravura performance) and doesn't let go till the last very last frame. It may be *just another movie about corrupt politicians and their love of money and power, but it is so magnificently done, so beautifully shot, and so angry, that you won't be able to take your eyes from the screen. Watch it.","user":"tenshi_ippikiookami","rank":[8,10]}]