[{"title":"Codswallop","rating":2,"date":"9 October 2018","review":"Could have been a good movie, acting in some instances is terrible, others not so bad. The story line is unusual but poorly executed.","user":"sylvie-55507","rank":[9,9]},{"title":"Was this a roleplaying game adventure?","rating":4,"date":"3 October 2018","review":"So much like a roleplaying adventure in GDW: Dark Conspiracy game. Aliens are here! At first we can't live with them... Then we have to try and learn to live with them, because, like John Carpenter's \"Thing\", you never know who is who... or what. Loads of stuff borrowed from \"Alien\", and a little from \"Arrival\". Some cringe moments when there is cardboard acting, and speech is delivered without emotion or emphasis. Omissions will leave you saying \"WHAT???\". What happens during the critical event that they cut away from. ??? Makes no sense building up suspense, only to cut AWAY from critical elements that could then affect plot! Nope. Totally omitted. Eventually it seems more like an extended pilot in a TV series, than a stand alone film.","user":"icelandknight","rank":[13,18]},{"title":"It's extinct","rating":2,"date":"12 November 2018","review":"My main reasons for seeing 'Shangri-La: Near Extinction' were an intriguing title and concept, that it was part of my low-budget film quest after being recommended to me by IMDb in my recommended for you section and as someone trying to see as many 2018 films as possible.<br><br>The good news about 'Shangri-La: Near Extinction' is that there have been worse films seen by me throughout my life and recently, ones that are even more amateurish, intelligence insulting and ones that blatantly rip off infinitely superior films more cheaply. The bad news is that that doesn't stop 'Shangri-La: Near Extinction' from being very bad.<br><br>Am trying to be a fair reviewer trying to see the good in everything viewed, as always. It is very hard to do that here with so many badly executed elements, that look as if little effort was made. The least bad asset is the scenery which did have atmosphere.<br><br>Visually, 'Shangri-La: Near Extinction' looks incredibly cheap even for something made on a low budget. It's very drably and sometimes dizzyingly shot, incoherently edited (bacon-slicer-like) with glaring and unforgivably sloppy continuity errors. Even worse are some of the most laughable and pathetic-looking special effects to be seen on celluloid, actually looking they were done as an afterthought and on the small remainder of the money they had left. Nothing menacing or threatening and there are no surprises.<br><br>Can remember little about the music, which tended to be intrusive, annoying and out of place. The script is so awkward, cheesy and improvisatory-sounding that it is enough to make the toes curl in how awful it is. The ending is very predictable and pretty contrived.<br><br>There is absolutely nothing thrilling, tense, suspenseful, emotionally investable or fun about the story. The predictability may have been forgivable if the film was actually engaging let alone exciting but it fails to be either throughout. 'Shangri-La: Near Extinction' is basically non-stop dullness and intelligence-insulting ridiculousness, with unintentional humour because of the excessive cheese, bouts of mawkish and stilted melodrama and irritating character behaviours that makes one endear to them even less in a film with not one interesting or rootable character. Hated the sister especially.<br><br>As for the acting it ranges from borderline-okay to appalling, some try to engage with their material but the worst of the acting is so embarrassing one questions whether they had any acting lessons.<br><br>In conclusion, not one of the worst films seen recently or ever but very bad. 2/10 Bethany Cox","user":"TheLittleSongbird","rank":[7,9]}]