[{"title":"A Bit Too Staged, But Good Acting and Interesting Directing Choice","rating":6,"date":"19 July 2017","review":"I appreciated this film because of my love for Zhou Xun's subtle, edgy acting style as well as the director's choice to make the 'modern-day' part of the film into a pseudo- documentary starring Tony Leung-Kar-wai. The story itself would have been more touching if the lighting and staging were less vibrant/staged. I'm not sure whether the fakeness of the dialogue and mise-en-scene are intentional, but it turned me off to a film dedicated to a nationally traumatic time for Greater China. It instantly reminded me of pro-CCP propaganda dramas... Shout out to the handsome and very talented two male actors! I had little faith in them but they proved me wrong this time around. :)","user":"wanghui138138","rank":[7,10]},{"title":"Well made film, but nothing new to offer","rating":5,"date":"1 December 2017","review":"A well made drama set during the Japanese occupation of Hong Kong focusing on the smaller moments of lives of people involved in the resistance. I have seen so many films about India's freedom struggle as well as the communist resistance during the National emergency in India that there wasn't a single thing that I wasn't familiar with in this film even though it talks about an entirely different country and situation. Still its a well-shot film with great production design which was at times a bit too theatrical that chronicles the life and struggles of the Hong Kong resistance members.","user":"Jithindurden","rank":[4,6]},{"title":"Ann Hui's historic and geopolitical masterwork","rating":8,"date":"6 July 2019","review":"After sinking her teeth in the Second Sino-Japanese War period (1937-1945) with THE GOLDEN ERA (2014), a biopic of Chinese literary writer Xiao Hong (1911-1942), Hong Kong auteur Ann Hui returns to the same time-frame to limn heroic real-life events during Japan's occupation of Hong Kong.<br><br>In OUR TIME WILL COME, the focal point is trifurcated, the central one is Fong Lan (Zhou Xun), a young girl whose kismet changes forever when she becomes an anti-Japanese guerrilla fighter; then there is Blackie Liu (Eddie Peng), a fellow comrade and lead figure who is very adept at point-blank firefight, and shares a deep camaraderie with Fong; finally, Fong's boyfriend Li Jinrong (Wallace Hua), a spiffy chef who ostensibly works for Japanese military corps, but in fact is a mole trying every possible way to get cardinal information out to the subterranean compatriot fighters. Therefore, Liu represents the external front with outright confrontation, Li the undermining internal force and they are linked together by Fong's precarious courier mission, the whole anti-Japanese coalition converges with a pellucid blueprint.<br><br>Commencing with a hefty mission of aiding 800 Chinese intellectuals to leave the occupied Hong Kong - among which there is literary dignitary Sheng Congwen and his wife (Guo Tao and Jiang Weili), who happen to be the tenants of Fong's mother (Ip), and Fang has the first brush with the guerrillas when Liu has to dispatch a fifth column squarely in her abode, OUR TIME WILL COME (whose Chinese title is borrowed from a proverbial Song Dynasty poem written by Su Shi, can be approximately translated to \"When there will be a bright moon?\") perversely goes against the grain with mainstream patriotic crowdpleasers, Hui adopts an unflinching holistic perspective to cover the three-pronged coalition with loosely connected events, effected by both the ordinary and the extraordinary folks, valiant acts are interlaced with commonplace activities: nuptial ceremony still goes on despite of privation, a close encounter with Japanese soldiers while transporting concealed arms is saved by a fortuitous ploy, and Li's uneasy rapport with a verse-conversant Japanese Colonel Yamaguchi (Nagase) is undercut by their indissoluble political schism.<br><br>However, the clincher is actualized by Ms. Fong, played by veteran actress Deannie Ip with copacetic flair of a cipher's flesh-and-blood metamorphosis from a canny busybody to an unlikely martyr, whose seemingly ingenious but ill-fated decision of hiding an important note in the hem backfires with severe repercussions. Just as we naturally expect a go-for-it rescue mission might bring about a heroic, bloodletting crossfire spectacle, Hui, pluckily opts for an unorthodox approach, by entrusting Zhou Xun to lay bare Fong Lan's profound oscillation as she has the toughest decision to make, to rescue her mother or not, and Zhou delivers a heart-rending explication that hits home the movie's emotional zenith.<br><br>Stage-managed with Hui's gracious pace of her felicitous narrative and DP Nelson Yu Lik-Wai's vibrant palette of a tumultuous era, OUR TIME WILL COME culminates with a majestic coup de maître, a panning shot that transcends time to the current Hong Kong, where we see senior Ben (Tony Leung Ka-Fai), an erstwhile Fong Lan's pupil and guerrilla fighter, whose Black-and-White faux-documentary interview snippets begin and punctuate the chronological recount, get into his taxi and drive away, pertinently brings down the curtain of Ann Hui's historic and geopolitical masterwork which bears out that she is the last (wo)man standing in Hong Kong cinema, whose artistry propitiously inhabits a niche under the overlaying climate of Chinese government's harsh censorship.","user":"lasttimeisaw","rank":[2,3]}]