[{"title":"Despite the outrageous title, a slow character study centered on loss and regret...","rating":8,"date":"10 February 2019","review":"This is not the movie you might reasonably have expected from the title - while both killings are part of the movie, they play second fiddle to the story of a man who has sacrified everything for what he believes is in service of the greater good.<br><br>Really took me by surprise, Sam Elliot really delivers a superb performance, which is pretty much what the movie hangs on.<br><br>Yes, it's a bit bizarre to have a movie where the assassination of Hitler and killing of Bigfoot - by the main character - are mere sidenotes in a slow-burn character study....<br><br>But it worked for me, I can see why it wouldn't for others, but it's genuinely a good movie and not the b-movie schlock-fest the title implies.","user":"terrorfirmer-ie","rank":[170,196]},{"title":"Allegory of america","rating":8,"date":"19 February 2019","review":"My mother gave me this insight (she's a genius). This movie is an allegory of the US and the struggle against first the nazi's and then communism. See dialog between young Barr and the Russian who shaves him. Calls him Mr. America. Says they will be cursed and do not truly know each other. Will be enemies? Gin versus vodka. He kills hitler, but does not feel he's accomplished his mission. The man killed did not kill the idea. See the rock he cannot get out of his shoe. Fast forward. Flag pin (American government) asks him to kill THE Bigfoot, not a Bigfoot. Something that will destroy the world. A virus that will spread to the whole world (communism). Must be nuked. Barr is immune (the American soldier/patriot). Others are too old or too young. His (the bigfoot's) footprint is not THAT big. He breaks a pinky and loses an ear (the curse from the Russian, but not fatal blows). The Bigfoot is not an animal. It is a zombie-like evil. He tries to show mercy (they won't get your body buddy) only to have the evil turn on him again. Evil must be met with brutality. Once he is vanquished, the American soldier feels his mission is complete (rock out of shoe). The soldier (uniform and medals) was buried. See dates on tombstone. Very close to Russian revolution then fall of Soviet Union. However, the \"box\" was dug up again for the American soldier to stand guard \"one more day\". The fight does not end. The American soldier cannot rest. So many other symbols. Just food for thought. I can't find anything to corroborate, but everything fits. Very thought provoking and enjoyable film. More there to be uncovered with the brother and girlfriend (those left at home). Sam Elliot is excellent.","user":"jerusha-77407","rank":[197,232]},{"title":"You're watching the wrong film","rating":10,"date":"18 February 2019","review":"As a 63-year-old man, I saw a very different film. This is a man at the end of his life, full of regrets, trying desperately to rewrite his life's story. One of the few\"real\" moments in this film is the opening scene in the bar. A lonely old man having a drink by himself. The bartender suggests a change. He responds he'll quit drinking--but they both know that won't happen. As a young man he was shy and ineffectual. He couldn't even propose to his girlfriend, letting more dominant personalities overwhelm him at critical moments. So he fantasizes about going off to war and being an unsung hero. But since it's a fantasy, it's ineffectual as well--killing Hitler for no good purpose (maybe a substitute for the actual death that surrounded him as a WWII infantryman?). His girlfriend moved away. All he had was a ring he kept in a box. And an imaginary pebble he his shoe that reminded him of... Fast forward to his bleak elderly life of TV dinners and solitary existence. Another fantasy develops, about Bigfoot, triggered by what he's seen on TV while dozing off. His younger brother plays along while giving him a haircut, listening to him speak ominously about a man he killed in the war. Then later his younger brother responds gently to the notion of his going on a secret mission--remember the late night park scene about \"truth\"? The truth spoken of is the truth of love in the face of harsh realities. And later, if he was dead and buried, why didn't people say anything when he shows up for the children's play? Perhaps he did go to war. Perhaps he was traumatized and the uniform in the closet was real. Be that as it may, here's what happens as you grow older: You start writing the story of your life. As time goes on you rewrite it so that whatever happens, it all makes sense and has a purpose. You justify your actions, and you become the unsung hero (or victim). Some tells: During the carjacking the thug burns the cherished picture of his girlfriend and he does nothing--passive as usual. But he responds when they try to take his car? Are the sirens responding to his injuries, not the thugs'? The biggest tell of all: the movie's title and plot line. It's screaming \"Hello viewers, this is a total, impossibly absurd fantasy. An Allegory.\" So obvious, but then there are people still trying to figure out what happened in the final scene of The Sopranos (yes, they were all shot). Now...all that said...this was a beautifully conceived and crafted film--if you know which film you're watching. Sam's best work.So in the end he finds the pebble--the universal symbol of a nagging annoyance. And with his box of memories he starts accepting life on life's terms. And it ain't so bad. He's got a dog and a brother who loves him. And that's enough.","user":"IndyTed","rank":[139,171]}]