[{"title":"A rare gem","rating":8,"date":"31 January 2020","review":"They don't make movies about classical musicians much nowadays and when they do they have been horror movies. It's refreshing to see something like this. Patrick Stewart looks like a pianist. And Katie Holmes as the journalist interviewing him looks sweet. Nice to see her looking happy in a role instead of the usual morose roles. There is some lovely scenery in Switzerland and an interesting if not overly dramatic story. The score has lots of piano pieces that are played in recitals but not often used in movies including Schumann Schubert Rachmaninov and Scriabin. Some of the time frames are confusing.<br><br>Worth a watch.","user":"phd_travel","rank":[27,34]},{"title":"Good, but not enough","rating":6,"date":"1 February 2020","review":"The actors and acting are good, and in some moments you might feel the sorrow or the sadness or uncomfortableness of the characters, but something is off.\nIt's a calm movie, and music plays on the background most of the time and it's enjoyable, also the scenary is nice, but the timings and the plot seems empty.\nI had the expectations to get inside the main character, but all I got was only some glimpses, and sentences \"I feel like...\", without actually presenting what it means for that person to say it, what it really means to lose something, to gain something. It's as if you literally are watching someone without really ever getting into their minds. And I miss the empathy, I couldn't connect, I couldn't even imagine what is means to feel \"I feel like...\".","user":"zoz1-38-318887","rank":[8,12]},{"title":"delivers on its promise of a gentle love story","rating":7,"date":"18 March 2020","review":"Henry Cole (Patrick Stewart) is a world famous concert pianist who is facing the biggest challenge in his life - stage fright. Enter Helen Morrison (Katie Holmes) a journalist who once upon a time wanted to be a concert pianist as well. She becomes Henry's only connection to the music, the sense of it Henry started to lose... But with a significant age gap between them and the shadow of Henry's previous loss, can they ever be together?<br><br>Slightly melancholic and beautifully shot, CODA is a nuanced love story that takes its time to unravel. With a classical piano soundtrack the movie switches between the Swiss alps and the streets of New York, and is inhabited by a few well fleshed out characters.<br><br>There's wonderful chemistry between Patrick Stewart and Katie Holmes and the film wouldn't have survived without it. The script has a few interesting episodes, even moments of greatness, but the deliberate slowness and tragic content of the film will turn some viewers away.<br><br>As much about love as it is about loss, CODA delivers on its promise of a gentle love story, leaving a bittersweet aftertaste and a craving for more.","user":"mjfhhh","rank":[2,3]}]