[{"title":"Inspirational story, quark acting","rating":7,"date":"25 July 2019","review":"I enjoyed the story, but towards the end, the boy got a little full of himself while showing off to the other team. Overall message was good, but good sportsmanship should be to. Would have given it a better star rating if the acting wasn't so cheesy.","user":"rwfrederick","rank":[3,3]},{"title":"A little research would go a long way","rating":2,"date":"14 June 2019","review":"Watched this last night and enjoyed the idea behind the movie, my oldest ballplayer is 13 and we went through Districts/All Stars the last couple of seasons so we thought it could be a fun watch.<br><br>However sports movies like this one amaze me in the fact that they still have to make everything so unrealistic and over the top that it becomes not enjoyable for anyone who understands the game that's being portrayed in the film.<br><br>First off, if you're going to make a kid so good that you claim he's going to be the best player on the planet, find one that can play the game. Acting is less important (see: The Dad and the Coach) in this film anyway, so why they didn't use a kid that has a good swing (his hands were in a terrible position) and finishes his throws. It shouldn't be that hard to find 12 year olds who can play baseball. When it comes to pitching, the main actor doesn't follow through, in real life he's probably throwing 35mph tops. The tall kid at states who they clocked in the upper 70's also had terrible form and wouldn't get anywhere close to that kind of speed.<br><br>A lot of the kids playing ball in the movie (I assume most were just kids with this budget) aren't anywhere near the level needed to make it to the state championship level. No pitcher at that level (that the coach would bring in with the game on the line) would perform the way the kid who pitched before Kyle did. Go watch a state championship game and they could have realized what they were putting on the field wasn't good.<br><br>Don't get me started with the college coaches scouting the little league state championship tournament. Then telling the parents the kid will get offered a 100million dollars and they can't compete with that. The top pick in this years draft caps out at 8.4 million, there's rules concerning how much they can pay him. So 100 million is completely over the top and could have been fixed by just saying \"millions of dollars\" and is still just as impressive for this situation.<br><br>On top of all that, you ruin a good story with inaccuracies that should have been super easy to not make. You talk about every kid dreaming to play in the world series and yet you get a lot of fundamental things wrong with the game and the tournament.<br><br>1. You can't lead off in little league until after the ball crosses the plate.\n2. You can't just \"get an apartment\" so you can play in a different league. I understand they probably had someone go \"you can't just play somewhere else\" and they threw the \"I got an apartment\" line into it post filming. This could have been easily solved by him getting cut by his old coach before they moved to the new house\n3. The fastest 12 year old was clocked at 81 (They researched this yeah!) but why they felt the need to make this kid throw 90mph (Translates distance wise to 115+ mph) doesn't make sense to me. He could have throw 80 and it's still over the top, but at least its a possible scenario.<br><br>There's a lot more that just lets you know the writer is writing on a subject he has no idea on. Could have been an 8/10 movie based on the story and the topic, but lack of research on their topic and not having kids that are believable to be at the state championship level knocks it down to a 2/10. In the end if you want those of us who have lived some of the movie to enjoy it, you have to be better.","user":"willkeathley","rank":[8,12]},{"title":"Great movie","rating":9,"date":"30 May 2019","review":"My 3 baseball boys love this movie, as soon as it's over they all want to go outside to practice. The overall acting is a little goofy, but the message is great and perfect for kids age 5-12. We rented in on amazon a couple times and finally just decided to buy it on prime so we can watch it whenever we want.","user":"ashleeleiber","rank":[3,4]}]