[{"title":"the novel visualized, finally","rating":6,"date":"21 February 2019","review":"Greetings again from the darkness. No one knows for sure how many times someone in Hollywood has attempted to adapt the 1966 novel for the big screen, but we do know that director Ty Roberts is the only one to succeed. The actual author of the novel, Edmund Pendleton Van Zandt, used the pen name Tom Pendleton, as he was unsure how the book would be received and wanted to avoid embarrassment for his prominent family - a family very influential in the founding and development of Fort Worth. Also part of the Van Zandt family are the beloved singer/songwriter Townes, and the author's own son Ned, who has a supporting role in the film. Since I missed the premiere at last year's Dallas International Film Festival, I was glad to catch up with it recently.<br><br>The film tells the story of Jim McNeely, a dropout dumped by his girlfriend's parents for not being good enough for their daughter. McNeely is a fictional character, but similar stories (some better, many worse) have played out in real life many times over the years. It's 1939, and the country is trying to dig out of the depression. McNeely heads to west Texas in hopes of escaping his personal life and capitalizing on the new oil boom - a boom not unlike the gold rush of California almost 100 years prior.<br><br>Frank Pickrell's Santa Rita No. 1 spewed forth boldly (in 1923) announcing the Texas Permian Basin as oil rich. Since then, the area and work have made and broken folks, and that pretty much sums up the story of Jim McNeely - played here by native Texan Zane Garrison (\"Prison Break\"). His initiation to the oil field crew is not kind, as the roughnecks don't take kindly to the city boy. Of course, McNeely holds his own until he is ready to head out - and he takes the lovely wife of a local engineer with him. McNeely and Lee Montgomery (Ali Corbin) are soon setting up house and a new business.<br><br>It's McNeely's first drill and it leads to the obligatory oil gusher shot. This initial luck or success (depending on how you view it) reconnects him with a couple of buddies from his original oil field days: Dent Paxton (Austin Nichols, \"Ray Donovan\") and scruffy oil field veteran Ort (played by familiar face Lew Temple). Dent is the dusty road philosopher while Ort is the one who understands drilling. What follows is a case study of how a person reacts to good times and bad. When dreams come true, does corruption of self follow?<br><br>Director Roberts is himself a Midland (west Texas) boy, and the excellent opening sequence of the windswept plains proves he has a feel for the area. His black and white shots slowly fade to color as we meet McNeely. Mr. Roberts not only directs, but also co-wrote the script with Gerry De Leon, produced the film, and edited it as well. Such is the life of a low budget production, and though he accurately captures the feel of oil fields, the film would have benefitted from a lead actor who could better pull off the charisma required to accomplish the fundraising and networking of the McNeely character - a man so unlikeable that we never understand why some remain loyal to him. The film does a nice job of showing the rise and crash, as well as the life lessons that prove one is never too old to come of age. It must be stated that following in the footsteps of Jett Rink (James Dean) in GIANT (directed by George Stevens), Daniel Plainview (Daniel Day-Lewis) in THERE WILL BE BLOOD (directed by Paul Thomas Anderson) and Larry McMurtry's THE LAST PICTURE SHOW (directed by Peter Bogdanovich) is a perhaps a task too tall for even a Texan.","user":"ferguson-6","rank":[11,17]},{"title":"Good character piece","rating":8,"date":"3 March 2019","review":"As a resident of Texas, it's great to see Texas on the big screen in scope 2:35 aspect ratio. Loved the use of music and intercutting, and especially liked the ending. I would have preferred fuller colors as opposed to the dried out look. But not even that could take away from the raw majesty of the Texas landscape.","user":"snapplecommand","rank":[5,12]},{"title":"Very entertaining","rating":10,"date":"27 February 2019","review":"Very well done. Great acting. Great story. Beautiful film.","user":"se-09622","rank":[5,15]}]