[{"title":"An amazing thriller","rating":9,"date":"22 February 2018","review":"Korean cinema in recent years has been ahead of many other countries on the continent, such as Japan, without giving us much time to assimilate it. \"Forgotten\" is one of the most recent examples of why this evolution has taken place and why many of us are delighted with this type of cinema.\nThe film focuses on the life of a boy who tries to discover the truth behind the kidnapping of his older brother, who returns as a different man after nineteen days of captivity, from which he claims to remember nothing.\nA film that mixes the psychological thriller with touches of atmospheric terror and plays excellently with the shadows and paranoia of the younger brother during the days of the disappearance. Jang Hang-jun, responsible for the script and direction, knows how to make us feel the anguish of the situation at all times, making the disinformation that we have as a spectator is the same as our protagonist and creating a situation where interest increases every minute that passes.\nI must also emphasize the excellent performance of both brothers, especially that of the older brother (Kim Mu-Yeol), because he manages to create an insecurity and concern that does not disappear throughout the film. What's happened to him? That is the question that will haunt us at all time, as the film progresses, because the closer we get to its end, the more disoriented and surprised we will find ourselves, making us goose bumps and hitting us with an unsuspected but tremendous outcome.\nBut not only in the script we can check quality, because if we focus on the more technical sections, we will realize that both the sound and photography sections are really well constructed, being vital in the development of many of the scenes and giving an intensity to the set that is well above average. The mastery of rhythm and the steady pulse behind the camera of the whole team make \"Forgotten\" not just a thriller, but an example of what modern cinema should be like.\nWith' Forgotten', the lovers of the best thriller are in congratulations and the South Korean country claims its good state of form, because in recent years we have seen many examples of great calibre as 'I Saw The Devil', ' New World' or 'The Wailing' among others. Those who look for a good mystery, disturbing settings and stories with ingenious plot twists, should not miss this film.","user":"fraudreizehn","rank":[75,83]},{"title":"Fantastic Unpredictable Thriller!","rating":24,"date":"24 February 2018","review":"Saw this on netflix. Saw the trailer and immediately watched it. After watching it. Wow. Did not expect this film to be this good. The film is tragic beyond words. It's hard to talk much without spoiling anything. Performances, writing, direction were all great! Definitely a must see!","user":"peruano9213","rank":[43,48]},{"title":"Great mystery thriller","rating":10,"date":"6 March 2018","review":"I would give this movie an 8 or 9, but since one reviewer here admitted to deliberately giving the movie a 1 instead of 5 or 6 because he wanted to lower the overall review score of the movie, I'm gonna counter that by giving this a 10, because unlike him I agree with most of the other people who reviewed this movie, and feel it deserves praise and a good score.<br><br>I'm not going to talk about the plot at all, because this is the kind of movie where the less you know going in, the better. So beware of spoilers in other places! Anyway, it is a great mystery, and a great thriller. It has a few very mild horror moments as well. The music and the ambience sets the mood perfectly. Acting was good. Watch this on an evening with the lights dimmed, and enjoy.","user":"Eiriksterminator","rank":[51,60]}]