[{"title":"TIFF audience stunned","rating":9,"date":"17 October 2018","review":"It was indeed quiet in the Winter Garden Theatre when the credits rolled at TIFF. This is not a movie you cheer for. It's gorgeous and brutal and humble. You exhale when it's done, and you're thankful for your different less desperate way of life.<br><br>The acting is superb, especially the brave Margaret Qualley. This deserves to be seen","user":"richyoungphd","rank":[50,68]},{"title":"Don't be fooled by the title, this is not an action movie","rating":8,"date":"16 February 2019","review":"Donnybrook it is a very dark drama, and well worth seeing.\nEx-Marine Bell has a wife who is trying to get off drugs and 2 kids (a boy &amp; a girl). His plan to improve their lot in life is to enter the Donnybrook, a bare-knuckles free-for-all fight contest where the last man standing will walk away with a $100k prize.\nThe acting is superb, particularly Margaret Qualley (daughter of Andie MacDowell), who plays the sister of Frank Grillo's violent drug dealer. The characters in this film are very poor and struggle with violence, drugs, crime, all the things that are often common in the poorer communities across America.\nThe bulk of this film is Bell's journey from his home in a trailer park to the site of the contest, and it's not an easy or straightforward path that he travels. He gets to the donnybrook, but it's the last 15 minutes of the film.","user":"bbretall-1","rank":[32,45]},{"title":"Very refreshing story","rating":9,"date":"25 February 2019","review":"You'll either love or hate this story, but it certainly is a fresh and hard-to-forget tale. The acting, in almost every case, was top-notch. The movie's pacing and flow were excellent. Even my wife, who doesn't typically care much for movie violence, remarked that this was one of the best films she's seen in a while. Donnybrook is definitely worth a view. In a world of forgettable flicks, you'll walk away remembering this one.","user":"steve-shaw-622-673526","rank":[15,27]}]