[{"title":"The king of direct to dvd release is once again playing an ex CIA, with a dyed goatee and Noel Gallagher's round-shaped","rating":3,"date":"24 October 2019","review":"Savile Row sunglasses to hide his puffy eyes.<br><br>The initial scene of the busting of the organ mafia gang is packed with sufficient action n tension but after that the film went downhill.<br><br>We have two lovely chicks for eye candy, a Clint Eastwood lookalike with staring eyeballs (Jai Day).\nWe also have a Blanche Bradbury lookalike as Seagal's business partner n some unnecessary shift of locations to create beautiful imagery (mostly footages) and a fake helicopter.\nThe climax shoot out is one of the worst to come outta recent times.<br><br>Poor Seagal, fellas r making fun of his double chin n excess fats around his face n belly but they r not aware that these r side effects of Asthma meds (corticosteroids) n alcohol.<br><br>Generous with 3 cos of Seagal's ol time sake n the hot babe Mica Javier.<br><br>Trivia : In 1998, Seagal made The Patriot, his first direct-to-video release n since then he is the reigning king.","user":"Fella_shibby","rank":[27,30]},{"title":"Take the shot.","rating":1,"date":"2 June 2019","review":"Seagal resurrects his Special Ops character Jake Alexander sometimes called John Alexander or just Alexander or just Jake. He is CIA working in South East Asia going after organ traffickers. When a member of his crew is killed (Seagal didn't take the shot) the CIA breaks up the group and wants to reassign them. Instead, a bunch of them resign and form their own private group to go after the bad guys.<br><br>This was bad, even by Seagal standards. Seagal has a bromance in real life with Putin. In this film, he spouts off about the government within the government (Deep State conspiracy theory) and that the CIA obstructs justice. His new group just so happens is armed with a bazooka, just in case the bad guys come at them with a military styled helicopter in downtown Manila. Segal had a fight scene with distorted moves. He doesn't do any high kicks but manages a knee to the groin. He b*tch slaps a guy and blood splatters out of his face. PLOT SPOILER- when he finally shoots him in the head, not only is there blood at the exit wound behind his head but a huge batch of blood where his back was located.<br><br>Casting call consisted of not being able to act better than Seagal to show him up. It was tough but they managed to get bad actors and write them horribly cliché lines with an equally bad soundtrack. What was with the Spanish guitar background music for the Philippines?<br><br>Guide: F-word. No sex or nudity. Pole dancer.","user":"nogodnomasters","rank":[17,21]},{"title":"Another trash movie","rating":1,"date":"22 October 2019","review":"Worst movie of his entire career, since 2003., this guy has become a joke and transform himself into the cookie monster, he can t run, or fight, he should retire for good. The name title is a joke.","user":"ruimichael-53784","rank":[8,9]}]