[{"title":"You might be a redneck if...","rating":6,"date":"26 February 2019","review":"...you enjoy seeing cars go around and around a track. This was a decent C-grade novice production that I'm guessing Travolta did someone a favor in starring in. The director and both writers have little experience, and it shows in this film with flimsy writing and poor directing of the cast. The acting was decent considering, and it was great to see the lovely Shania Twain in her first full length feature film, and she did quite well. Travolta nailed it as did Toby Sebastian, and the rest of the cast were all convincing in their roles, although some of the redneck Alabama accents seemed out of place. The camera work was good, the films length and pacing decent, but the story lacked anything memorable. Not a bad film if you're into this type of racing in the Alabama backwoods of Talladega. For a novice C-grade film, it wasn't great nor bad, considering some of the bigger production films that have come out lately that were garbage. It's a well deserved 6/10 from me.","user":"TheTopDawgCritic","rank":[24,33]},{"title":"Bland & Pointless","rating":2,"date":"26 February 2019","review":"If a movie doesnt draw me in by 20 minutes or so, it most likely won't. i gave this one till halfway point, which was enough for me. Travolta seems to be doing a string of pointless low standard movies, and michael madsen hasn't been in a decent one for years, that should have been an alarm bell. Thought i recognized shania twain , although i hadn't known she was in it prior. Scenes with her were lifeless to wooden, she's no lady gaga. all in all, a pointless movie, unrealistic, zero substance, uninteresting, lifeless scenes and acting...yawn give it a miss.","user":"xenafan40","rank":[21,31]},{"title":"Predictable and Boring","rating":1,"date":"28 May 2019","review":"When I saw the ratings and reviews I thought sureley it can't be that bad, so out to prove if only to myself it wasn't I rolled the tape.\nI didn't need to go far into this one to realise I was witnessing the hatching of a Turkey. Made for Television best sums up this drec of a movie, that's not saying it's a good MFT movie because it's not, but at least viewers won't feel the pain of shelling out ticket money.\nMy attention was tranfixed (this is how bad it was) on Travoltas obvious hair piece, is it a hair piece or graft I wondered, does he need to water it and add fertilizer, does he take it off at night, why does he even bother which is ironic really because why even bother just about sums up my review on Trading Paint","user":"VanBooter","rank":[7,10]}]