[{"title":"Many things to disappoint.","rating":2,"date":"4 March 2020","review":"The reason I gave this two stars is because I thought the story had potential. Perhaps a different writer, and director, with more money, and a better production could have done it justice.\nWith this production I found many things to disappoint me. The acting was wooden, and contrived, the dialogue seemed uninspired, and uninteresting. In general I found the direction ie: the story progression was too quick without barely any setup of the story plot, and the actors weren't really directed in a way to convince the audience of their feelings, and emotions. Unfortunately I was unable to bring myself to watch more than ten minutes of the film, and that is unfortunate because in general I like this kind of story.","user":"lenwenzellw","rank":[4,7]},{"title":"The Len kabasinski and Lo Blow in one movie? Light that J and pour that shot. This is going to be good.","rating":8,"date":"10 February 2020","review":"This isn't the type of movie you will ever watch by yourself. It is the type you turn on when hanging with the boys. THC and alcohol are a must but if you are watching a Len Kabasinski movie you know that already.","user":"themightykazoo-30763","rank":[2,12]},{"title":"Amazing Adventure and Quest Film","rating":10,"date":"22 June 2019","review":"I am a fan of Killer Wolf films and the writer\\director Len Kabasinski. This film is probably the finest he jas ever done. Limited CGI and beautiful sets/scenery make this a beautiful film to watch. The soundtrack is equally gorgeous. The story in a nutshell is a family has a terminally ill child that modern medicine can't help. The father is desperation finds about a legendary talisman that has healing powers and he enlists Kane Galloway an archaeologist and searcher of the truth to help him find it. Kane has to search the world and defeat 5 guardians to get the talisman. Amazing action and compeeling story makes this a standout. The film stars famed martial artist Leo Fong as Sang-Jin Kane's sensei. He was probably my favorite character at 90 years old. A great time and I highly recommend this film for fans of the questing adventure martial arts film.","user":"tcoll32","rank":[1,9]}]