[{"title":"Some good potential and actors, but messy and confusing","rating":5,"date":"9 October 2018","review":"I'm French and I just reread the chronology of the Revolution, so the names and events are pretty fresh in my mind... at least they were until I saw this movie. The main problem is that it doesn't seem able to find its genre and goal. Not focused enough to be family drama, not precise enough to be a documentary, not nervous enough to be an historical action movie, not neutral enough to be a political movie... In short, it never decides what it wants to tell and ends up not telling much. It's a succession of scenes, each quite OK but not making much sense together. The family we follow is a symbol of course, but come on, the same people being present at every single major event and political assembly of the era? Plus several things are shown in a strange way, like Robespierre being a calm and peaceful person? Marat (very well played!) as an actual friend of the people? Danton (not nearly ugly and fat enough) as a sort of enemy?\nTechnically speaking the music sometimes feels off and is too present, and many filming tricks, down to the very font of the title panels, but also the framing and lights, are cheesy and seem to be from the 90's.\nShowing the Revolution from an ordinary family point of view would have been a very good movie. Seeing it from the kings' office was nice too. Making a documentary about the Convention, yep, it could work. All at once? Sorry but nope. It ends up too messy and confusing to be enjoyable, despite very good actors and pretty decent sets and costumes.","user":"fredericjfacebook","rank":[15,19]},{"title":"Very disappointing","rating":2,"date":"3 January 2020","review":"There's no storyline, just a quick succession of random events. Big moments in the Revolution's history are misrepresented or left out entirely. The Women's March on Versailles is incorrectly portrayed, Lafayette is played by an overweight man with black hair when in reality he was tall, thin &amp; had reddish/Auburn hair, the September Massacres aren't represented..... I could go on &amp; on. It's clear to me that the writers/directors/producers had an agenda that mirrors the Lost Cause Myth of the Civil War. Conveniently leave out facts &amp; over amplify minor mistakes &amp; weaknesses to create villains out of heros &amp; muddy the waters of history.","user":"tyliter","rank":[5,6]},{"title":"LET THERE BE LIGHT","rating":8,"date":"26 September 2018","review":"Two hours for showing four years of the french bloody Revolution, Pierre Schoeller had to make some difficult choices : he decided to show the little people from the streets (having a stone in the belly) meeting and fighting the rich political figures (having how many roasts in the belly?). And most important, he shows women strongly speaking in assemblies. The casting is astounding, all the actors play with high energy and are possessed (Denis Lavant as Marat of course, and also Adèle Haenel unforgettable, and Laurent Lafitte as Louis XVI is imposing). The cinematography and editing are virtuoso (destruction of tower letting people from the streets having sun light, massacre of the Champ de Mars, execution of Louis XVI, ...). The original soundtrack is also attractive. I read in papers \"Un Peuple et son Roi\" is a failure, it's wrong, it's awful good, all the ending is gripping. Bravo, I wish success.","user":"happytrigger-64-390517","rank":[11,17]}]