[{"title":"A script that never develops its central character","rating":5,"date":"23 November 2018","review":"The acting in this movie is fine. The problem lies in the script. Near the end it gives Lee Hart, and even Donna Rice, scenes that allow us to get to know them somewhat, see what's inside them. We never get that for Gary Hart, who is far and away the most important character in this movie. We never see what made Hart so popular, especially with younger voters. We never get to see him explain important issues to the masses, though we are told that he does that very effectively. We never get scenes with him in which he gives us a hint of why he risks his career with his extra-marital affairs. He comes off as very cold, very distant, and that's problematic for a central character. As a result, we have no reason to feel anything when his career is finally destroyed.<br><br>To an extent, this is about the media's intrusion into the privacy of public officials, but that isn't examined. Nor is there any attempt to suggest a change over time to today, when a sitting president can boast about extra-marital affairs and not suffer any loss of popularity.<br><br>In the end, I was left wondering why this story was being told in 2018. It doesn't make us understand Hart, or feel sorry for him. It doesn't tell us anything either about 1988 or our own era. It doesn't make Hart a character we can feel for when he falls, because it never shows him to us as a great if flawed man. (Several characters tell us he is great, but that's not the same thing.) What was the point of filming it?","user":"richard-1787","rank":[48,58]},{"title":"An underwhelming convoluted unsatisfying dragged out film","rating":6,"date":"1 February 2019","review":"Good performances from the leads, but the screenplay was an underwhelming convoluted mess of many quick irrelevant scenes that dragged on into pointless plot issues. Although paced quite well, at the end of the 113 min length, I found myself asking \"why\" and saying \"so what\" and \"who cares\". I was left unsatisfied with this film. It's a 6/10 from me, and I'd recommend a 'pass' on watching this, unless you really need to know about Senator Gary Hart's 1988 presidential run - of which you can simply Google and read up on.","user":"TheTopDawgCritic","rank":[41,51]},{"title":"\"Scandal\" that no longer seems so scandalous.","rating":6,"date":"12 January 2019","review":"The Front Runner is based on the true-story of US presidential hopeful Gary Hart (Hugh Jackman) and if you are NOT aware of the historical background (and have not seen the trailer) then you might want to skip the rest of this review - and all other reviews - so you can see the film first and let the history come as a surprise to you.<br><br>Hart was younger than most candidates: good-looking, floppy-haired and refreshingly matter of fact in his dealings with the public and the press. Any interviews had to be about his politics: not about his family life with wife Lee (Vera Farmiga) and teenage daughter Andrea (Kaitlyn Dever).<br><br>Unfortunately, Hart has a weakness for a pretty face (or ten) and his marriage is rocky as a result: \"Just don't embarrass me\" is Lee's one requirement. His \"nothing to hide\" line to an intelligent Washington Post reporter - AJ Parker (a well cast Mamoudou Athie) - leads to a half-arsed stake-out by Miami Herald reporters and incriminating pictures linking Hart to a Miami pharmaceutical saleswoman Donna Rice (Sara Paxton). As the growing press tsunami rises, and his campaign manager (J.K. Simmons) gets more and more frustrated with him, can his candidacy survive and will his (now very much embarrassed) wife stick by him?<br><br>Hugh Jackman is perfectly cast here; very believable as the self-centred, self-righteous and stubborn politician. But this central performance is surrounded by a strong team of supporting players. Vera Farmiga is superb as the wounded wife. Sara Paxton is heartbreaking as the intelligent college girl unfairly portrayed as a \"slapper\" by the media. The scenes between her and Hart-staffer Irene (Molly Ephraim), trying desperately to support her as best she can, are very nicely done. J.K Simmons as campaign manager Bill Dixon is as reliable as ever. And Alfred Molina turns up as the latest film incarnation of The Post's Ben Bradlee - surely one of the most oft portrayed real-life journalists in film history.<br><br>One of my biggest dissatisfactions with the film is with the sound mixing. Was this a deliberate act by director Jason Reitman, to reflect the chaotic nature of political campaigning? Whether it was deliberate or not, much of the film's dialogue - particularly in the first 30 minutes of the film - is drowned out by background noise. Sometimes I just longed for subtitles!<br><br>The screenplay, by Matt Bai (from his source book), Jay Carson (a Clinton staffer) and director Jason Reitman might align with the story, but the big problem is that the story is just a little bit dull, particularly by today's levels of scandal. This suffers the same fate as \"House of Cards\" (even before the Kevin Spacey allegations) in that the shocking realities of the Trump-era have progressively neutered the shock-factor of the fiction: to the point where it starts to become boring. Here, only once or twice does the screenplay hit a winning beat: for me, it was the scenes between Donna Rice and Irene Kelly and the dramatic press conference towards the end of the film. The rest of the time, the screenplay was perfectly serviceable but nothing spectacular.<br><br>A core tenet of the film is Hart's view that politics should be about the policies and not about the personality. Looking at the subject nowadays, it's clearly a ridiculously idealistic viewpoint. Of course it matters. Politicians need to be trusted by their constituents (yeah, like that's the case in the UK and the US at the moment!) and whether or not they slap their wives around or sleep with farm animals is clearly a material factor in that relationship. But this was clearly not as much the case in the 70's as it is today, and the suggestion is that the Hart case was a turning point and a wake-up call to politicians around the world. (An interesting article by the Washington Post itself points out that this is also a simplistic view: that Hart should have been well aware of the dangerous game he was playing.)<br><br>Do you think that powerful politicos are driven to infidelity because they are powerful? Or that it is a characteristic of men who have the charisma to become political leaders in the first place? Such was the discussion my wife and I had in the car home after this film. Nature or political nurture? I'm still not sure. It's worth pointing out that to this day both Hart and Rice (interestingly, an alleged ex-girlfriend of Eagles front-man Don Henley) stick to their story that they never had sex.<br><br>The film's perfectly watchable, has great acting, but is a little bit of a non-event. The end titles came and I thought \"OK, that's that then\".... nothing more. If you're a fan of this style of historical political film then you probably won't be disappointed by it; if not, probably best to wait and catch this on the TV.<br><br>(For the full graphical review please check out One Mann's Movies on the web or Facebook. Thanks).","user":"bob-the-movie-man","rank":[33,42]}]