[{"title":"Ambitious, But Underwhelming","rating":6,"date":"1 February 2019","review":"Ever since the release of Nightcrawler back in 2014, Dan Gilroy is a director that I've wanted to keep a sharp eye on. I'll admit I wasn't a big fan of his film Roman J. Israel Esq., but I was still impressed by his talent, enough to continue watching his future projects. Velvet Buzzsaw is his latest work that he both wrote and directed and while I did enjoy some of it, this director only has one home run in my book, which still remains to be Nightcrawler. Some viewers may find this film to be pretentious and others may find it elegant, which will stir up a great conversation, but I personally found that it fell somewhere in the middle. If you're a fan of a unique premises, you may want to check this one out.<br><br>There isn't really a main character here, but it could be argued that the central focus of the film is on Jake Gyllenhaal's Morf. After the passing of an elderly man, his paintings are discovered and put on display for all to see. To their surprise, these paintings have minds of their own and they begin to seek revenge against those who study them in the wrong ways. Personally, the concept of this film intrigued me upon first glance, but after watching the film unfold, it felt like more of a way of finding viewers for the movie as a whole. The bizarre turn this film takes didn't feel earned by the time the film concludes. With a strong first act and a weird second act, this movie lost all potential throughout the third.<br><br>I must admit that this is one of the better assembled casts I've seen in a long time. From powerhouses like Jake Gyllenhaal and Toni Collette to the always outstanding performances given by both John Malkovich and Rene Russo, down to stellar newcomers like Natalia Dyer and Daveed Diggs, I found myself engaged no matter what was happening throughout an uninteresting scene, due to the fact that they're clearly all devoted. If for nothing else, this cast believed they were making something terrific and it really shows in each and every one of their performances.<br><br>Sadly, as I mentioned, this film as a very weak third act that went in many ways that felt easy for the movie to go. Aside from some very cool visuals and great cinematography throughout the entire film, the story, in retrospect, kind of went nowhere. I could see where director Dan Gilroy was trying to go and the final scene of the film definitely showcases an interesting future for the story, but I wasn't engaged in the story enough to care all that much. The characters invested me from the very beginning and the twist pulled me in even more, but the movie unravels in a way that frankly bored me.<br><br>In the end, Velvet Buzzsaw is an ambitious film in terms of the notions that it tries to explore and wow its audience with, but I was underwhelmed by it as a whole. I definitely commend the technical aspects of it and the set-up was very well done, so I can recommend it to film buffs, but I truly don't believe this film will find a home outside of that circle. I could be wrong, but I feel this movie is for a very niche audience. Velvet Buzzsaw is an impressively ambitious film that feels a little wasted by the end.","user":"kjproulx","rank":[200,239]},{"title":"It had great potential but fell short","rating":6,"date":"2 February 2019","review":"The idea in the film is fantastic but didn't seem to dive deep enough into the story and lacks impact. With most of the characters being pretenious, I was overwhelmed with the use of metaphores and foreshadowing, it became expected throughout the film but doesn't hold enough significance. An origin film on Dease would seem more interesting to me after watching this film.","user":"jeffreycarephotography","rank":[129,156]},{"title":"Interesting Premise, Uninteresting Movie","rating":3,"date":"3 February 2019","review":"Simply put Velvet Buzzsaw is a mess. It lacks any genuine horror, comedy, or drama and feels cheap and schlocky, and not in the good b-movie horror way.<br><br>This one stung because when I first heard of this film I thought it was right up my alley. The faux intellectualism and aggressive monetization that surrounds the high art world is something worthy of parody, but this movie gets so lost in its message and meanders around several poorly written characters, essentially wasting its interesting premise on a below average, generically shot bit of schlock. It brings nothing to the table and fails to live up to the standards set by its contemporaries and even the directors past work.<br><br>The characters presented here are lacking in about every respect. One of the things that really excited me about this movie was the massive amount of talent it employed, but even a lively performance from the likes of Gyllenhaal could not mask the fact that the writing was just not up to snuff. What exposition and backstory we get on this miserable bunch of narcissistic artistes is sparse and told rather than shown through slow interactions within art galleries and avant garde offices. Perhaps it was an artistic choice to paint these characters who leech of the creative works of others as banal but it prevented me from ever getting invested in them. Thus, not only were the inevitable horror scenes that followed the character introductions were completely void of any proper scares or interesting creatures, but they also lacked any proper victims.<br><br>Moreover, the editing was choppy and scenes did not always flow logically from one to the other. There was a surprising lack of interesting camera angles or dark and brooding shots that could have been used to cultivate horror in the viewer (with the exception of a scene involving a gas station and monkeys). Velvet Buzzsaw's presentation lacked a certain definitiveness and style that the directors earlier work had possessed. It ends up looking rather uninspired. There was some aggressively unappealing use of green screen too, especially apparent during a waterfront chat between an agent and a up and coming street artist (I can't even remember there names they left so little an impression). The movie looks so fake and cheap, which I suppose in a way fit the character and dialogue quality.<br><br>Apart from its blatant ant-art profiteering message the movie seems to translate nothing effectively, and the overall weight of what it tries to say is diminished by its shortcomings. The actor's do what they can here, they are the only redeemable aspect of Velvet Buzzsaw, but an artist is only as good as his or her tools, and they were given very little to work with here.<br><br>Definitely Avoid.","user":"fpcholcomb","rank":[155,202]}]