[{"title":"WORST. EDITING. EVER.","rating":5,"date":"4 March 2019","review":"The opening sequence was so beautiful done, I had hoped this would be another Wild Wild Country, in terms of pace and movement.<br><br>But I can't imagine whoever editing the opening also edited the rest of the film. This was the slowest editing I've ever seen, even for a documentary, documentaries themselves being slow by nature.<br><br>There are static shots of people that are about to be interviewed,walking towards the camera that last 1:30! Nothing else. Just them walking down the street. Sometimes there is a voice over, sometimes not. It's just painful. Which is a shame because when people do talk they offer incredible insightful views into not only American history, but it's current state of affairs.<br><br>It's worth watching for any history buff, or anyonenstill fascinated by the endless ironies of the 2016 election. But as an editor myself I could only take it in sections.","user":"bumdog","rank":[7,9]},{"title":"No Thesis = No Finish From This Viewer","rating":2,"date":"20 July 2018","review":"Like many Americans, I still struggle sometimes to fully comprehend the repercussions of the 2016 Presidential Election. As such, I have watched a number of documentaries on the subject to try and gain some further perspective. Unfortunately, \"We Blew It\" has been the worst of those experiences.<br><br>The problem with this documentary is overwhelmingly obvious: there is no central focus or thesis. It sort of just rambles on about the \"Easy Rider\" era and the current \"Trump era\" without any definition on where it was all going. Fifteen minutes into it, I thought it showed real potential. After about an hour, however, it turned so muddy and scattershot that I didn't want to even sink another hour into the proceedings.<br><br>Perhaps older viewers who lived through the 1960s/70s will find more interesting material, but this 32-year old viewer saw it primarily as a jumble of conversations that lacked anything tying it all together.","user":"zkonedog","rank":[15,25]},{"title":"Nice Try, but Boring","rating":3,"date":"6 May 2019","review":"I appreciate what the Director/Producer was trying to do, but it made the movie boring. I didn't even watch the whole thing because it's a bunch of old people, my age, whining that today is not what they expected it to be. I'm sure my parents didn't think their future was what they had planned, but WWII happened anyway. The story tellers keep reminiscing about the past, how today's generation are wanna be's, and that the Government will make things better. Nice try, but I don't need the propaganda in my life.","user":"preswalton","rank":[7,13]}]