[{"title":"A fine movie gets totally lost at the end","rating":6,"date":"26 November 2018","review":"I really liked the film, the plot as well as the actors/the casting. The story develops well, and has both fun and exciting moments during the first three quarters of the film's length. But the film totally loses it at the end, in an ending that is completely implausible and chaotic. Unfortunately the problem with many Hollywood movies: how to get a good ending.<br><br>So I will only partially recommend this title.","user":"david-626-148063","rank":[214,255]},{"title":"Was decent... until it wasn't","rating":6,"date":"28 November 2018","review":"The movie was quite enjoyable for the longest time. Well paced, well acted (mostly). Then the conclusion happened.  Like seriously what where they thinking.<br><br>Not only was it bad (I guess that's just an opinion, but still), it was also a lot worse written, paced and acted than the rest of the movie, up to the point where the only explanation is that the producers or SOMEONE wanted the ending changed to... this. The movie would have been a lot better if it just ended half an hour earlier. The ending is one of the worst I have seen in years.","user":"fabi-sp92","rank":[203,253]},{"title":"Lot better than expected","rating":8,"date":"17 September 2018","review":"I wasn't initially going to see this. I'd been let down by similar neonoir mystery dramas before. (Felt Gone Girl was just okay and Girl on a Train was disappointing.) Then I heard the positive reviews and changed my mind. I'm glad I did.<br><br>Director Paul Feig took the story from what appears to be a more serious book with very mixed reviews on Amazon and added humor and a bit of fun to the proceedings. The dark parts are appropriately lurid, but this isn't a dire slog. Witty dialogue and a game cast alleviate the proceedings.<br><br>Although Blake Lively does a great job as the mysterious woman who goes missing (and hats off to whoever designed her clothes, they are fantastic), this is Anna Kendricks' film. As the slightly oddball, mommy vlogger Stephanie Smothers, Kendricks has the part nailed down a both physically and verbally as she quirkily deals with people.<br><br>There are a couple flaws. The switch between drama and humor is a little jarring a in a few spots. The second act drags a little, and a few character decisions in the third act were rushed a bit.<br><br>Overall, I'd recommend this.","user":"jwwalrath-227-85487","rank":[221,288]}]