[{"title":"Notably terrible","rating":1,"date":"12 June 2019","review":"One of the worst movies I have seen in a long time. I won't waste many words on this review, as the poor production, camerawork, sound, and acting in this film does not warrant it.<br><br>If you are looking for an actually 'well-made', original, and actual watchable 'found-footage' movie, check out V/H/S and indeed it's sequel, they are both excellent attempts at the genre.<br><br>In summary, avoid watching this at all costs, if I could take back the time I spent watching it I still wouldn't - because I have sacrificed it for any of you who happen to read this review.","user":"Jeff_Saps","rank":[18,23]},{"title":"Do yourself a favor, dont watch this crap.","rating":1,"date":"14 June 2019","review":"A documentary about fat guys, a few strippers and a couple of stand up comedian, that's about it. Watching paint dry is more interesting. I don't know where to start the review, bad acting, bad directing, bad script, bad editing and so on.\nTerrible movie. High score rating is obviously from friends of the cast and crew. Absolute rubbish try another career honestly because this isn't for you.","user":"psxexperten","rank":[7,11]},{"title":"Quite an achievement for the budget","rating":7,"date":"12 June 2019","review":"Flesh Blanket is a weird genre mix of comedy, drama and found footage horror movie. The overall plot is reminiscent of movies like Blair Witch Movie in that a film crew tries to make a documentary that goes horribly wrong and leads somewhere unplanned and horrifying.\nThe movie is heavily referencing the standup comedy scene and delivers a real dark meditation on it. Honestly it fits in the times as lately several standup comedians have started to question their profession. The documentary in this movie is meant to show comedians pushing the boundaries in remembrance of the great Lenny Bruce and trying to reproduce an old comedy event with him today to make a point about free speech in comedy. So a weird director meets up with a bunch of standup comics and strippers to get money for the project and organise it.<br><br>The whole thing is the usual excessive green room debates, drugs, alcohol and sex and what each comic carries before him ... honesty, truth and unchallenged free speech. Before the whole thing goes downhill the movie already produces some great points about the scene and its clichees, as main character Ramsey Moore keeps pushing the honesty thing into uncomfortable territories all while his inner demons come to the surface.<br><br>Triggered by some minor events and the visit of his father to the set, things spiral out of control and Ramsey turns into \"Flesh Blanket\", the killer on the set asking the question \"Do you really want to know what i think about you?\".<br><br>After the buildup, you get a kind of found footage killer movie. The whole thing is made in the most low budget way and often making fun of itself but still it works in its approach to the standup scene and with some good editing and music choices that keep the movie interesting and moody.<br><br>This is definitly not for everyone but with for example Hannah Gadsbys recent standup and the questions it raised, Flesh Blanket pours the salt into the open wound that is also visible in todays social media culture. How much honesty and truth are bearable and how honest and true is it really beyond the self proclaimed purity? If you are into things a big different and challenging and like trashy horror movies... this might be for you. Hats off to the director.","user":"dschmeding","rank":[6,17]}]