[{"title":"Eddie was good but overall disappointing","rating":2,"date":"4 January 2020","review":"Ok, let's start with the good points...<br><br>1. Eddie Marsen - best actor in this film by a country mile\n2. Visuals and cinematography are good.<br><br>Now the bad...<br><br>1. The dialogue is absolutely awful - no sentence of more than about 5 words and each line is spoken/shouted with really strange intonations. Seems to be dubbed and/or spoken by actors who just don't know what they are saying in English.\n2. The script - a lot of the time it just does make any sense e.g. someone saying they don;t understand something when they were told it 5 minutes previously! Did anyone listen to this before it was released!!\n3. All the acting (apart from Eddie Marsen of course) was wooden: no character or personality - they just barked each line of the script at each other in pseudo English (usually in a petulant manner for no obvious reason).\n4. The story - apart from the start and end it simply lacked a clear direction for the most part.<br><br>In short, Eddie Marsen's great, visuals are good but if you speak English then this will be a painful experience.","user":"chrisst4","rank":[26,28]},{"title":"NICE VFX, WORST STORY TELLING","rating":2,"date":"1 September 2019","review":"The story telling is falling into pieces and all the points are hardly connected. Story progress are so confusing and so hard to catch up. I personally thinks that there is something wrong with the storyboard that makes the movie losing their main focus in almost every scene. Character dialogues are so clear without sufficient environment noise, makes them sound like a voice-over. The created music are good but the volume are so constant throughout the movie. However, kudos to the VFX team who tries their best to work on the film. The effects are actually quite good, but it cannot save this movie with other elements fall so behind.","user":"joon_ong","rank":[47,59]},{"title":"HUH?","rating":3,"date":"2 January 2020","review":"The horrid dubbing and voice actors ruined it for me, I would have rather read subtitles.\nI have watch all kinds of films and I really can't figure out who this was written for. The story was all over the place.\nMaybe it was just a workshop for the film/editing crew? Awesome visuals, so kudos to them!","user":"amylynnrobert","rank":[34,42]}]