[{"title":"The most frustrating film I have ever watched.","rating":5,"date":"3 February 2019","review":"I actually enjoyed this film. Loads of tense moments and fun. But it so stupid. So many plot holes, so many stupid decisions. So many time you say to yourself \"that just wouldn't happen\"<br><br>Acting solid. Score good. Some good experimental shots from the director. Just the sheer frustrating stupidity takes what could be a great horror film into a bit of a mess.","user":"addino","rank":[37,40]},{"title":"What a coincidence!","rating":3,"date":"18 December 2018","review":"The night before last, I watched Revenge (2017), in which a young woman is pushed off a cliff by her lover. She somehow survives this ordeal and crawls to safety, where she patches up her wounds. Meanwhile, the lover goes on the hunt for the missing woman, but doesn't account for her lust for life and ability to fight back.<br><br>Guess what happens in What Keeps You Alive...<br><br>One notable difference between the two films is the main characters' sexuality, the couple in What Keeps You Alive being gay women. The other big difference is that, while Revenge acknowledges its preposterousness and goes all out for excess, What Keeps You Alive fails to realise how incredibly implausible it all is, aiming for realism. The result is a film that is frustratingly dumb, with both women making unbelievably stupid decisions simply to further the plot. None of it works.<br><br>Victim Jules (Brittany Allen) does little to help her situation. Instead of using the cover of night to make her escape, she cowers behind a tree and falls asleep until morning. While trying to cross a lake in a boat, pursued by psycho wife Jackie (Hannah Emily Anderson), a neighbour on the shore asks if everything is okay; rather than shout for help, Jules invites the neighbours round for the evening. And when she finally has the upper hand, having stabbed Jackie with a tranquilliser dart, Jules doesn't finish off her attacker (or even incapacitate her): she drives to safety, but then turns around around only to discover that Jackie has woken up and isn't very happy.<br><br>After much more stuff and nonsense, the film closes with a totally contrived twist that requires Jackie to act in a very specific manner. Had she logged onto her computer before she does, Jules' posthumous plan for retribution (yes, she very deservedly dies!) would have been a complete waste of time. Had Jackie given herself her injection without watching the video, the end wouldn't have made any sense. The way things actually play out is very contrived. Revenge (2017) might be far-fetched, but at least it is fun and doesn't leave the viewer feeling like they've been taken for a fool.","user":"BA_Harrison","rank":[43,53]},{"title":"Cardinal Sins of horror","rating":4,"date":"29 October 2018","review":"It's 2018 folks. We can't do \"girl running for her life in the woods and making all the wrong moves\" anymore. I had hope for this. The trailers promised a hunt with a victim overcoming her attacker. But instead you get a very poor decision making protagonist that continues to deliver herself on a silver platter to the killer. It's a frustrating watch. The cinematography is amazing, acting is pretty solid, the writing.... was the \"Scy Fy\" team of the movie. So many different directions you could have gone and you went with a sloppy story that leaves no one satisfied.","user":"bjohn-47666","rank":[44,55]}]