[{"title":"It's official! This is one of the 2017 debuts that have expanded my Top 40 to Top 50 favorite Xmas movies.","rating":10,"date":"29 November 2017","review":"There are several reasons why. <br><br>First of all? It takes place in a big city (Philadelphia, Pennsylvania, USA) as opposed to a fictional small town. Which--let's face it-- even Hallmark can turn into a boringly overdone trope!<br><br>Secondly? The actors who play Aidan and Darcy are completely unknown to me. But, they bring enough emotional plausibility to their characters that the chemistry between them can only be described as more than good. It's superb!<br><br>Thirdly? There's the legwork in trying to solve the mystery of who Aidan really is. It's a little more light-hearted than the one surrounding Miranda Chester's paternity in last year's \"Finding Father Christmas!\" But, no less riveting, to be sure.<br><br>Fourthly (if that's even a real word); there's what might be an uncredited cameo appearance by Melissa Hill, who wrote the book this movie is based on. Don't blink, though, or you might miss her (great legs and all).<br><br>Then, there's the relative boldness in what I can only term a historic first for Hallmark Television: the blossoming romance between Luigi the Italian restaurateur and Mrs. Henley; Darcy's widowed African- American landlady. Bravo, Hallmark! It's about time that somebody other than emo(tional) Caucasians got a second chance at depicted happiness in your TV movies.<br><br>And, last but not least? Bailey. Who, in their right mind, can resist those big puppy dog eyes?<br><br>In short? Nobody should miss any of this movie's encore telecasts, this holiday season. Not even the over-worked Christmas Reviewer!","user":"Carycomic","rank":[10,10]},{"title":"Darcy finds romance with a handsome stranger with amnesia.","rating":10,"date":"21 November 2017","review":"This movie features a great performance by Ali Liebert. I have seen her in many supporting roles, and was pleased to see her in the lead role for this one. Pairing her with Peter Porte was a stroke of genius. This movie will be played again at my house. It is well worth re watching. The dog looks very much like \"Tank\" from a previous Peter Porte movie. Hallmark, please give us more Ali Liebert.","user":"ronbokirk","rank":[10,11]},{"title":"You know that old saying, give a gift, buy yourself one, too? Gift yourself this delightful movie!","rating":8,"date":"25 November 2017","review":"In a nice part of Philadelphia, Darcy (Ali Lieber) rides a bike everyday to her dream job, a book saleslady at Chaucer's private book store. When she returns home to her nice apartment a few blocks away, she reads the night away. Oh, she goes out on dates from time to time, but if the gentleman doesn't read, Darcy is not interested. As she is dressing up the store for the holidays, Darcy spies a cute man, name unknown (Peter Porte) and his sheepdog Bailey and likes what she sees. Yet, he doesn't come in the store so she can't meet him. Some days later, Darcy is running late and hops on her bike for the fastest commute she can mount. Horrors! She actually runs over \"cute guy\" and knocks him to the ground. He goes into a coma! The ambulance takes him to a nearby hospital and Darcy knows she has to take care of the pooch in the interim. This complicates things with her landlady but they work out an arrangement. Soon, the new patient awakes from coma land, but doesn't remember his name or why he is there. Darcy comes to visit and she and the medical staff try to find the missing pieces in his memory. But, two problems arise for Darcy. One, the man may have a fiancée, oh no. Two, her manager is leaving and the store is looking for a replacement. Does Darcy have the daring to apply for the job? What another fine gift from my favorite company on the planet: HALLMARK! What would rom-com lovers do without the endless string of funny love stories Hallmark bestows on its fans? I shudder to think. Lieber is cute and funny while Porte, the lookalike to Jim Caviezel, is already a great favorite of this viewer and the world. What fun to see Philadelphia in a good light and animal lovers will fall hard for Bailey, too. In short, tie a string on your finger and remember to look for this one.","user":"inkblot11","rank":[9,10]}]