[{"title":"Okay","rating":6,"date":"6 September 2018","review":"If I didn't read the book, my rating might have been higher, but there were lots of scenes from the book that I would have enjoyed in the movie. For instance, most of the book is about Nathan trying to find out who A is. I would have loved to see that, but unfortunately they cut it down to just a few scenes with Nathan. The acting was great and what was presented was good, but if I had to choose between the movie and the book, I'd pick the book. So if you get the chance, read the book. You'll really enjoy it, especially if you enjoyed this movie.","user":"tiffanytrnx","rank":[27,32]},{"title":"I was skeptical , really, really skeptical...","rating":8,"date":"10 June 2018","review":"When I read the premise, I felt it was a rip on the YouTube series, without giving credit. But I decided to watch it anyway. And, I really enjoyed it. \nSince its a teen romance type drama, something I haven't watched since my own teens back in the 80s, I watched it without that fore knowledge. \nThe only YA I watch are sci-fi or fantasy based films. <br><br>So, to watch Every Day and to still have it hold my attention and keep me captivated, without all the flash bang effects of other CGI multi-million $ productions, it did a very good job.\nTime is precious to me and taking it out to watch a film, I usually wouldn't watch and yet still enjoy as much as I did this one, was well worth it.<br><br>The portrayals were great and the lead did an awesome job.","user":"arusinghnz","rank":[46,59]},{"title":"A surprisingly good movie","rating":8,"date":"8 June 2018","review":"I had pretty low expectations going into this movie, but coming out, I can say it was a good movie. The actors playing A do a good job of convincing you they are all the same person. Rhiannon is a good lead, who has a good subplot involving her dad. The rest of the supporting cast fit their roles well, and never feel as if they take too much time, though some could have been more well fleshed out. My big gripe would have to be the ending. It just felt kind of rushed and incomplete. Other then that, it was a surprisingly enjoyable movie, considering I knew close to nothing about it going into it.","user":"connorq-22746","rank":[27,38]}]