[{"title":"If you are into medieval torture...","rating":1,"date":"20 November 2018","review":"Never wrote a review before. Never felt the need to warn my fellow humans to beware. OMG! The only way to make this movie more cheesy would be to name one of the characters \"Mac\". The ending had me groaning in pain.","user":"dianelefebvrevp","rank":[112,117]},{"title":"Is this the worst Christmas movie ever?","rating":1,"date":"16 November 2018","review":"The ending gives a solid yes to that.<br><br>What. What did I just watch? And why did I keep watching? Maybe if I'd stopped halfway through, it would have been bearable. But no, it just kept getting worse.","user":"aduro-385-849835","rank":[143,153]},{"title":"Please don't subject yourself to this torture.","rating":1,"date":"22 November 2018","review":"The one star is for Kelly Rutherford, who in all honesty should have pulled tf out of this trainwreck the moment she saw Jocelyn's acting skills. As should I, but I kept it on in the hopes that there might be a redeeming ending.<br><br>Please. Do. Not. Watch. This.<br><br>It's a 0 for the acting.\n0 for the plot.\n0 for the editing and script.\n0 for the music.\n0 for the WEIRDNESS of timing in this movie.\n0 for the string cheesiness that just becomes painful.\n0 for the PI who GIVES HIS CARD OUT TO EVERYONE.\n0 for I'M A FEARLESS WARRIOR.\n0 for spending an entire scene giggling in a van and wasting my time.\n-10 for the ending, which I will spoil here so that you do not watch this monstrosity of a movie. The lead's cousin's wedding falls through because her perfect fiancé made the maid pregnant. The lead who is incidentally planning the wedding turns this awful situation for her cousin into being about the lead's career going down the toilet because the wedding failed. So the guy who stopped the wedding and revealed the Maid in Manhattan to the entire wedding party- the cousin's EX by the way, proposes to the lead whom he's known for like TWO WEEKS.<br><br>TWO WEEKS. With the cousin's MUM'S ring because they're SO supportive that the cousin and her mum are standing IN FRONT of them as he proposes. While the cousin who's just been left at the altar in front of dozens of people and a journalist, becomes HER MAID OF HONOUR and smiles as the lead gets married at what was supposed to be THE COUSIN'S WEDDING. And then she catches the bouquet. Her bouquet. Thrown by the lead. While she, the cousin is still in her own wedding dress smiling.<br><br>Please. Do. Not. Watch. This.","user":"zahraam-18624","rank":[90,96]}]