[{"title":"Fab film!","rating":10,"date":"14 November 2018","review":"Just got back from seeing the premiere in Leeds and have to say what an utterly charming film this is. The actors playing Pogo and Trevor were the heart of the film, and held the storyline together with a sensitivity beyond their years. The two young lads were absolute scene stealers, and very well cast. A superb first film by the director. Looking forward to more from this director.","user":"kmg-64654","rank":[13,19]},{"title":"A Magical Nostalgic Experience!","rating":10,"date":"22 August 2019","review":"If you was a kid in the mid 90's, England (like I was) you'll agree this film is perfect in setting the scene! The heaps of nostalgia I got watching this was both overwhelming and astounding. I feel if you wasn't this age at them times you might not get a feel for the nostalgic premise of which the film is amazing for! What a strange and pretty much carefree time it was. A perfect piece of mid 90s culture. I hope the director makes another gem like this. Happy I found it as well due to having no advertisements that I seen.<br><br>The film does have a fishing theme but doesn't dominate it. The main story here, the setting, a day in the life of kids in the 90's. The acting is really great, especially scenes by character, Pogo!<br><br>Beautiful and brought back many amazing, odd, surreal, adolescent memories of which was attributed by such a great set designer, script and direction.<br><br>I'd recommend to anyone who wants a glimpse into the 90s council estate culture with hints of comedy, drama and heartfelt scenes.<br><br>Great film","user":"Jamie_Seaton","rank":[7,10]},{"title":"Absolutely breathtaking","rating":10,"date":"15 November 2018","review":"This film was insightful and totally enthralling to watch. It draws you in and captures a moment in time which is simple and pure. The actors are all young but amazing and completely believable. Congratulations to all concerned for giving us this superb film. Hopefully more to come.","user":"karencarey-90193","rank":[11,19]}]