[{"title":"What a Fun and Refreshing Movie!","rating":9,"date":"31 August 2017","review":"Finally a break from the relenting string of dark, gruesome, violent movies from S. Korea! Midnight Runners is a refreshing break from the genre movie of gangs and violence that we typically get from Korea. The main actors: Park Seo Joon and Kang Ha Neul have fantastic chemistry and their scenes are effortlessly outrageously hilarious. Their comic timing, delivery and the way they play off each other's lines is just amazing to watch. <br><br>The story is not the most ingenuous or complex, but it works. It's a simple story about two young police academy cadets who don't have a real strong reason or desire to become police officers and who unwittingly find themselves in a situation that requires them to demonstrate the moral fiber and courage of what one would hope to find in a future police officer. It's not fancy and that's the key. It's simple, relatable, and most importantly a whole lot of fun and funny. I was definitely glad to have watched it, and walked out having felt like all the stress of the day was laughed off during the movie.","user":"frdgrntmt","rank":[30,36]},{"title":"not a single dull second","rating":10,"date":"17 August 2018","review":"First of all , i'm not korean but i love korean cinema and movies like this are core reason .The story is so fresh that you will get a new kind of feeling that you can't explain. And between some serious nail biting scenes there were lol moments. Director even gave a emotional ending with few adorable and cute moments. Simply awesome.","user":"majgotra","rank":[8,8]},{"title":"100% recommended , one of the top three K-movies this year.","rating":8,"date":"6 May 2018","review":"The movie is just one of the best Korean movies i'v ever watched, it is funny, fiiled with action and purposeful add to that it tells a story about Human trafficking which surprisingly is not just an Asia problem but A worldwide one.<br><br>The movie plot is strong and well connected,, it started with funny, silly and witty comical jokes but then things got a bit more tense after the \"Kidnapping\" yet still it had some moments where the guys acts in a stupid silly way where you couldn't help but giggle a little .<br><br>The casting is amazing, Seo-Joon Park \"Hwang Ki-joon\" and Ha-Neul Kang \"Kang Hee-yeol\" were perfect together considering they both had a huge experience on TV before getting into the Film business ,,, Also not forgetting to mention Dong-il Sung \"Professor Yang\" i think i watched once before in Chronicle of a Blood Merchant, and he was really good.<br><br>at the end, and like all Korean movies i have watched, after all of the fun and laughs things get more tense and emotional which is exactly what i love about these type of comedy/Action movies.<br><br>Final thought, 100% Recommended , watch it now, because there's a huge possibility for a sequel ;)","user":"Aktham_Tashtush","rank":[6,6]}]