[{"title":"Not a patch on Four Lions, but you can never go too far wrong with Chris Morris","rating":7,"date":"31 October 2019","review":"It can't be easy to write effective political satire at a time when the headlines of The Onion and Waterford Whispers don't read that differently from the headlines of The New York Times and The Guardian. As we find ourselves in an epoch where many public figures have become the satirical apotheoses of themselves, it becomes more and more difficult to satirise either them or the institutions that enable them. Difficult, but not impossible, certainly not for a satirist as talented as the legendary <a href=\"/name/nm0606439/\">Christopher Morris</a>, who was pedalling 'fake news' long before Donald Trump claimed that he won the popular vote or that the people of France were chanting his name during protests against Emmanuel Macron.<br><br>Written by Morris and <a href=\"/name/nm1104036/\">Jesse Armstrong</a> and directed by Morris, The Day Shall Come is inspired by real-life cases such as the Liberty City Seven and the Newburgh Sting, and aims its satirical ire at the FBI's operating procedure regarding domestic terrorist cells. And as one would expect from Morris, it's darkly comic until it turns deadly series, a transition that drives home that, yes, what the FBI is doing is farcical and satire-worthy, but so too is it destroying lives, and that isn't especially funny. It's a very delicate balancing act, but Morris pulls it off for the most part. As the world is coming to increasingly resemble a <a href=\"/name/nm0056217/\">Harold Pinter</a> play, Morris's is a voice that deserves to be heard, and although The Day Shall Come isn't a patch on the superb <a href=\"/title/tt1341167/\">Four Lions (2010)</a>, it's still a bitingly funny study of institutionalised paranoia.<br><br>In Miami, impoverished Moses Al Shabaz (a superb <a href=\"/name/nm8463983/\">Marchánt Davis</a>) is a self-proclaimed preacher and the leader of Star of Six, a revolutionary group that aims to overthrow the \"accidental dominance of the white people\". However, there are significant problems; Moses and his wife Venus (the awesome <a href=\"/name/nm5335029/\">Danielle Brooks</a>) are close to being evicted, whilst Star of Six has no money and only four members. Moses also has mental health problems - his plan to overthrow white dominance is to call upon the dinosaurs he says are held in stasis by the CIA; he also believes he can talk to his horse; and he's convinced that both God and Satan are speaking to him through a duck. However, despite having the \"threat signature of a hot dog\", Star of Six end up on the FBI radar, monitored by Agent Kendra Glack (<a href=\"/name/nm0447695/\">Anna Kendrick</a>). With Glack's superior, Agent Andy Mudd (the always fantastic <a href=\"/name/nm0641354/\">Denis O'Hare</a>), determined to uncover \"the next 9/11\", he orders Glack to find evidence that Star of Six is engaged in terrorist activity, and if no such evidence exists, then she should fabricate some, because it's easier to manufacture a fake terrorist than it is to find a real one.<br><br>The Day Shall Come was inspired by real-life incidents such as the Liberty City Seven (where seven unemployed construction workers were convicted of terrorist activities after a sting operation in which the FBI persuaded them to begin planning for an attack on Chicago) and the Newburgh Sting (where the FBI manipulated four Muslims to agree to shoot down American aircraft flying out of Stewart Air National Guard Base in Newburgh, NY, with all four convicted of terrorist activity). After hearing about the Liberty City Seven in a British TV news piece, Morris started to do research, learning that the absurdities involved in that case were not confined to one investigation. Indeed, since 9/11 it had become standard operating procedure for FBI informants to actively encourage persons of interest to engage in terrorist activities, which, of course, strays dangerously close to entrapment.<br><br>Like most of Morris's work, The Day Shall Come is a Juvenalian satire. It's not as funny as <a href=\"/title/tt0108740/\">The Day Today (1994)</a> or <a href=\"/title/tt0118273/\">Brass Eye (1997)</a>, but then again, what is? However, there are plenty of laughs to be found here. For example, there's the terror suspect who an FBI informant is trying to get to dial a number to detonate a nearby bomb, but who refuses to press the five button, proclaiming, \"I'm scared of fives. Five is evil\", to which Mudd, who's listening in on the conversation, reacts by screaming, \"did we know he was a pentaphobe?\" Because that's a real thing.<br><br>Especially funny is the exchange between Mudd and Glack as Mudd explains that to diffuse the nuclear emergency declared by the Miami PD, she must also declare a nuclear emergency. Mudd explains, \"the emergency exists. And you can't take control of something if you're saying it doesn't exist.\" To this, she asks, \"if we say, \"Yes, it exists\", isn't that the same as declaring a nuclear emergency ourselves?\" To which he answers, \"the logic only works if you say it slowly. Keep the contradictory elements apart.\" And when she points out \"I'd look insane\", he assures her \"only if you say it fast.\" This exchange is a pretty good example of the type of comedy featured throughout the film, layering the ridiculous on top of the farcical, with a very definitive <a href=\"/name/nm0406334/\">Armando Iannucci</a> vibe, recalling some of the more irreverent conversations in <a href=\"/title/tt1226774/\">In the Loop (2009)</a> and the criminally underrated <a href=\"/title/tt4686844/\">The Death of Stalin (2017)</a>.<br><br>Elsewhere, Chief of Miami PD Settmonk (<a href=\"/name/nm1894391/\">James Adomian</a>) gives us another good example of Morris's use of absurdity when he argues, \"unarmed white man, unarmed black man. Which one is more likely to have the gun?\", a line that's hilarious on its own, but profoundly troubling when applied to a real-world context (as all good satire should be). A similar line is Mudd's argument that if they didn't go after terrorists so forcefully, the American way of life would be under threat, and \"the next thing you know, the Statue of Liberty's wearing a burqa and we've beheaded <a href=\"/name/nm0819803/\">Bruce Springsteen</a>.\" Again, a funny line, but given the irrational hysteria and baseless paranoia that forms the basis of how so many Americans feel about Muslims, once again, there's a very serious component at work here.<br><br>On the film's official website, Morris states that the film \"reflects how institutionalised paranoia corrupts our thinking.\" The line about the Statue of Liberty is a good example, but so too are the multiple references to a \"black jihad\". This is a concept that seems laughable to sane ears, but is not so far-fetched when one considers that 31% of Americans believe a race war is imminent. However, Morris never allows the film to become didactic, and again, the Statue of Liberty line is a good example; Morris is addressing hugely important issues, but without ever talking down to the audience. He's irreverent and sarcastic, but never condescending or patronising. Of course, as anyone familiar with The Day Today or Brass Eye will know, Morris has a talent for viciously critiquing social ills without sounding preachy.<br><br>Towards the end of the film (which becomes very dark), Morris distils everything down to a very simple maxim - the conduct of the FBI may be absurd, but it has a very real human cost. We can (and probably should) laugh at the bureaucratic nonsense, procedural ineptitude, and shocking amorality, but that does not imply we should laugh at the results. The FBI's operational norms may be the stuff of farce, but those norms are putting real people (who are almost exclusively poor and black or brown) in jail for a very long time. Which turns out to be a not especially funny punchline.<br><br>The Day Shall Come isn't Morris's best, but it is still Chris Morris, and so it deserves attention. Irreverent, condemnatory, and politically incendiary, the film posits that the FBI is doing more harm than good as they target poor communities in the hopes of finding someone (anyone) planning the next 9/11. And if they can't find someone, they'll create that someone themselves. All in the name of good optics. As funny as it is, the film is also bracing and, by the time the end credits roll, extremely sobering.","user":"Bertaut","rank":[12,12]},{"title":"An 8 for what could have been","rating":8,"date":"1 October 2019","review":"We often see this type of misfire in horror (an horror movie that takes itself seriously but would have done better by embracing its absurdity or the opposite, a movie that jokes which kills the much needed tension.)<br><br>I will not spoil anything, but I believe there was something in this movie, something under the absurdity and a story to tell. Anna Kendrick did a wonderful job as usual, she is just a gem. But point remains that this movie hesitated before the jump and fell in-between. A good comedy of that genre requires one of the two, someone who takes things seriously while others don't, or someone who doesn't take things seriously while others do. We need a contrast, this movie should have been more grounded.<br><br>It's funny, it's good, but it could have had an 8 out of 10. I give it the 8 out of 10 because I am pretty sure most people won't discuss the potential it had on here and just bash.<br><br>Again, there is something in this movie, it's just not fleshed out properly.","user":"stephyr-88256","rank":[18,24]},{"title":"Really good but...","rating":9,"date":"9 January 2020","review":"Heartbreaking!!! If this is truly how our government systems are going about terrorism, by creating more terrorists then actually going after them, America will no longer be United anything.","user":"rmccoy0619","rank":[3,3]}]