[{"title":"Hey, it wasn't half bad.","rating":6,"date":"11 January 2019","review":"How are you going to hate on the movie, it wasn't THAT bad. It's a B movie, but honestly, the acting is pretty good and I enjoyed the storyline. If you had some big named actors do that story and you had a more expensive production, this movie would have killed at the box office. You need to take it for what it is, a pretty good B movie, with some unknown but pretty good actors. It is a good watch if you are bored and want to watch a thriller/action/comedy, I would check this out.\n6.1","user":"tjsuf","rank":[5,5]},{"title":"Not So Terrible","rating":7,"date":"8 June 2019","review":"LOWLIFE was hyped up quite a bit for supposed similarities to PULP FICTION. It's similar on the surface only, and while it's not nearly as good as the earlier film, it's still a lot of fun.<br><br>For a low budget film, the acting and production value are very good. There are two or three very fun scenes. There's some corny stuff in here too, but nothing too bad. Feels like the filmmakers had a pretty good idea of what they were doing. Recommend.","user":"socratesadamo","rank":[4,4]},{"title":"Loved it","rating":8,"date":"1 October 2018","review":"Brutal, visceral, well acted, funny, poignant ... what's not to like.<br><br>I understand that this film is Marmite, you either love it or you hate it.<br><br>I thought of Machete while watching it, but I like this more. This is a graphic novel compared with Machete's cartooning.<br><br>I was surprised by a lot of things here. The quality of the acting, details of the characterisation, unexpected story arcs. Unexpected humour! There was some great situational comedy. The sheer WTF at times made me laugh out loud.<br><br>I think you'll know pretty quickly whether you're going to like this. If you're undecided, please wait until you see the scene at Crystal's motel from Keith and Randy's POV. If it hasn't grabbed you by then, it won't.<br><br>If you can see it, there's a great film here.<br><br>PS I gave it 8 stars, which it might not quite be worth, but it's definitely worth more than the 6.4 it's got as I write this review. F'in Blade Cash-in 2049 has 8.1 and this has twice the heart.","user":"octomancer","rank":[13,18]}]