[{"title":"Noisy, pretentious, pointless and boring","rating":1,"date":"28 March 2019","review":"Film undoubtedly directed by pretentious high school students, during an internship.<br><br>Cons: 1. Yoav runs away from Israel because Israel is, I literally quote, \"méchant, obscène, hideux, ... \" and he arrives in Paris to work within the embassy of (guess what!) Israel. Incredible! It's moronic... 2. Yoav does not speak. Yoav yells or shouts. Constantly. Unnecessarily. Sometimes, to change, Yoav screams. It's boring... 3. Yoav impregnates himself, idly and condescendingly, from the customs and traditions of the Parisian natives to fill the void of his own life. It's depressing... 4. Yoav plays music with a machine gun, on a French song interpreted by the american band Pink Martini. It's almost funny. But no, actually. 5. Yoav is sometimes filmed with a basic camera held by a person obviously suffering from epilepsy: right, left, up, down, ... quickly and randomly. I was almost seasick. 6. ... 7. ... and so on, and so on ... 8. ...<br><br>Pros: Paris, the city. However, I live there and I may see this city everyday; then, I do not need to waste my time during two (long!) hours in a movie theater, for this kind of movie. So, finally, no positive point. Definitely!<br><br>As a synthesis, in one word: no!","user":"FrenchEddieFelson","rank":[83,132]},{"title":"I FINALLY FIGURED IT OUT","rating":3,"date":"6 October 2019","review":"I saw 'Synonyms' yesterday (Oct 5, 2019) at the Mill Valley Film Festival and while watching it and for short time afterward, I had no clue about what I'd seen. In short, What was the plot? I walked to my car, began the drive home, and ... POW ... a plot-wise theory came to mind.<br><br>On its face the story is one of a gay Israeli youth, come to Paris, to reinvent himself, to begin a new life. And with the help of a French couple he meets in Paris, and despite the desires of his Israeli father to return, he seems to do just that.<br><br>But that synopsis hardly takes up the film's two hours. What does encompass the rest of the time are some pretty harrowing, vaguely interesting incidents that take place, some in Paris and others in Israel. None of these incidents are more than snippets. There are no true beginnings or endings. They are there. A seemingly insane Israeli fight-picker on the Paris Metro. An Israeli Security Chief with an unorthodox interviewing style. A rainy day at Paris' Israeli Embassy. Machine gun firing in tune to piped in music. And on. And on.<br><br>And it was as I was driving home that I realized these incidents were nothing but stories our hero was imparting to the young French Couple who'd taken him in. Now I imagine that others in the audience may have understood this. But not me. It's not as though these 'stories' are book-ended by a fade-in or out, by special music or unique photo effects. In fact our hero looks and sounds precisely as he does in 'real-life' throughout these related stories. So, again, I was in the dark. But a bigger issue is this. Suppose I did understand the story-within-story construct. Would that have made the film any better. Maybe. By one star.<br><br>One more thing. The hero's penis. It's on screen a lot. Some might say more than necessary. I mean I can imagine the film with absolutely no frontal-nudity whatsoever and I would have been just as satisfied or dissatisfied. Actors today are given to saying, I'll be nude if it advances the story. Well it's tough to know how this penis does.","user":"levybob","rank":[32,47]},{"title":"Two long hours of bad conceptual art","rating":1,"date":"19 December 2019","review":"If I had not been attending film festivals for 20 years, I might not think so harshly of this film. But all I could think is \"been there, done that, and it was much better\". Awful script - the main character would not know basic French vocabulary (like taureau) and then use common French expressions that you would not see on Advance language students. French characters were one-dimensional, and shared the same zombie-like acting of the main actor. Israeli characters were cartoon versions of Mossad-style psychos.\nThis was the film equivalent of bad conceptual art.<br><br>I wanted to leave at the 30 minute mark but did not want to disturb a whole row of senior citizens out of their seats. Avoid it if you can.","user":"anapaulacameron","rank":[11,14]}]