[{"title":"To the people calling it too cringeworthy or unrealistic","rating":9,"date":"30 April 2019","review":"I understand, that there's a lot of close minded people of the older generation here that don't find this movie to be realistic cause it's different to when they were in Eighth Grade, but the world has changed. All you need to do is go online and find some random kid with 10 subscribers making YouTube videos to understand where the cringe of 'gucci' etc. comes from. I know people somewhat akin to the main character, and honestly, her inability to express herself is realistic. The dialogue as well, I walk through the halls of my high school, and just want to cringe to death at the way the younger kids speak, and I think it's great that it is being explored through this film, something a lot of people have and will never understand. Anyway I thought it was a good film, no one's going to read this but who cares, I wrote it in 5 minutes.","user":"lukamp","rank":[153,175]},{"title":"Cringe-worthy, Honest and Deeply Empathetic","rating":9,"date":"7 August 2018","review":"'Eighth Grade' is a movie you'll be talking about for a long time. Bo Burnham, one of the O.G.'s of teen YouTube stardom, has given us an agonizingly rich and authentic look at what life is like for Kayla (Elsie Fisher), a shy 13-year-old girl in today's social media obsessed world. Burnham, directing his first feature, doesn't spare any detail and doesn't alter any truth. <br><br>This film is exceedingly honest. It doesn't depict Kayla's experiences the way we might think they should be for an eighth grader or the way we might want them to be-they're simply presented as they are. Pool parties are a source of unbearable discomfort. First sexual encounters are not always pleasant. Kids with exploding hormones and little impulse control randomly shout unfunny phrases at assemblies in the hopes of earning a laugh.<br><br>The storytelling has the feel of a nature documentary. We can almost hear the narrator describing Kayla's attempts to navigate her fascinating and frightening terrain. Playing the vulnerable character who's far from the top of the food chain, she's just trying to survive. <br><br>Kayla, like so many kids her age, is a shy girl pretending to be confident. She posts advice videos to YouTube on how to be yourself, something with which she still very much struggles. As she records one video, she slowly rolls her chair farther away from the camera, indicating a declining level of self-assurance. This mirrors her real-world peer interactions, in which she stammers and laughs halfway through sentences as she begins to doubt herself and shrink with embarrassment, not that the self-absorbed \"listener\" bothers to notice.<br><br>All the kids stare at their phones constantly. These modern mean girls barely bother to muster up the energy put others down with a passive-aggressive remark because that would involve speaking to another person. Instead, they inflict harm by neglecting to acknowledge an uncool kid's mere existence. \nAs cruel as that sounds, these popular kids aren't presented as villains. This is simply their way of handling their own insecurities. There are no villains in eighth grade-they're all just kids trying to figure out their lives and trying to figure out themselves.<br><br>And the adults don't know how to handle any of this. Kayla's dad wants to connect with her, but is met with constant rejection. He smartly gives her space and only requests her attention to remind her how much he loves her. In one scene, Kayla asks if she makes him sad, and he fervently reassures her that she makes him profoundly happy. Like Kayla, he can't always find the right words, but he successfully expresses the feeling. <br><br>That scene is a microcosm of the entire film. Its dialogue isn't readily quotable or particularly memorable, and that's okay. What is actually said isn't as important as the meaning behind it. <br><br>Parents can keep this in mind when they have conversations with their own kids, possibly directly after watching this film. Many kids and parents will likely watch it together since it carries an \"R\" rating (it's ironic that a film that accurately reflects the lives of eighth graders is deemed too adult for them to watch on their own). And parents should watch this with their kids, so they can both understand each other a little bit better. They'll both be better for doing so.","user":"Jared_Andrews","rank":[283,402]},{"title":"I'm a 60 year old man...but now I remember","rating":10,"date":"23 October 2018","review":"I was introduced to Bo Burnham by my adult children who found his stand-up specials funny. I watched and found him extremely talented with an underlying sadness.<br><br>I expected this movie to be uproarious with an undercurrent of teenage angst. Instead, it was incredibly poignant and moving. In fact, it was so painful atbpkints I found it difficult to watch.<br><br>In the scene where she drops her cell phone due to excitement of being invited to the mall by an older friend, my eyes began to well up with tears.<br><br>It is one of the most realistic movies regarding youth that I have ever seen.<br><br>A painful watch but well worth it. Burnham has a big future ahead of him.","user":"shawlawoff","rank":[217,310]}]