[{"title":"Absolutely beautiful film.","rating":8,"date":"1 February 2020","review":"I had no idea what this film was about when I started it, and had never heard of any of the lead actors.\nHowever the simple and sometimes silly story sucks you in with such simplicity and natural beauty that I remained transfixed while it played out.\nMorris wears the film like a trusted old suit and carries it effortlessly throughout, despite her lack of experience.\nIt was a much needed surprise boost of simplicity and naivety and beauty that it cheered me up no end.\nI will probably never watch it again, it's not that type of film, but I wish I could watch it for the first time many times more.\nNo sex, no violence and no intrigue: just a simple story about teenage curiosity leading to a family secret and then a clear identity.\nThis is the first time in a very, very long time I've given an 8 in a review, but it was well worth it.","user":"Boristhemoggy","rank":[4,4]},{"title":"Proof the British can make a decent Road Movie","rating":8,"date":"1 February 2020","review":"A really pleasant surprise of a movie. As a gentle comedy it is a warm, pleasing journey, with some laugh-out-loud moments. What makes the film for me though, is the perfect chemistry between the leads and the brilliant set scenes with a cast of kooky support players - the garage scene is superb. There is also an excellent performance from Philip Jackson (Poirot). If you are going to stick your neck out for a film that isn't in the public eye then do give this one a try!","user":"NeldoNelly","rank":[3,3]},{"title":"A Delight","rating":9,"date":"5 October 2018","review":"This is a new twist on the old buddy picture on the road. Cleverly done and manages the delicate balancing act of keeping the proceedings effervescent and grounded enough to allow some comfort to the viewer in going along for the ride. Naomi Morris is perfect. Particular kudos to the Director for some clever choices, (loved the map) and the writer for consistent wit that kept me smiling all the way to \"the end\".","user":"dpstucky","rank":[9,13]}]