[{"title":"An interesting look at the migration problem Europe is facing, although not heart poundingly compelling throughout, definitely worth seeing.","rating":7,"date":"2 July 2018","review":"We see the exploration of a boat accident which caused the deaths of a few hundred africans trying to land in Italy and this is juxtaposed with a Syrian family trying to get across Europe safely at the height of the Syrian conflict. there were some compelling moments for sure, atlhough it did not maintain that throughout. But it was definitely worth seeing if you are interested in this subject matter, and brings up a number of interesting points.<br><br>Solidly good, but not great documentary. Definitely worth seeing though. (there wasn't ...that much...\"chaos\"..as the title would indicate, but there were enough compelling moments to make it worthwhile.)","user":"johncg25","rank":[6,8]},{"title":"This is not flattering to the plight of migrants in Europe","rating":6,"date":"25 June 2018","review":"If this documentary does anything, it shows the horrors of accepting a wave of refugees into your nation who do not share in the nations values and customs. It also shows why and how nationalism is rising all over the globe as the disparity between \"haves\" and \"have nots\" grows wider. The average German family has one child. The migrants who are desperate to enter Germany have four. Germans are finally figuring out they are going to be outnumber by migrants in short order if this continues. When the family gets to Germany, they realize their situation is no better than their time in Turkey and they are without people like themselves to enjoy a common culture instead of becoming part of the cultural practices of Germany. I felt no pity for anyone I saw in this documentary and felt anger toward those in Europe who are not only allowing this to happen but are promoting this atrocity. This really opened my eyes to migrants roving Europe instead of fighting for freedom in their country.","user":"patricklittleton","rank":[9,17]},{"title":"The Intimate Portrait of Migration","rating":9,"date":"1 January 2019","review":"News coverage about another capsized boat of migrants or attempt to cross the border doesn't capture the depth and intimacy of what this kind of journey really demands -- not just from the migrants, but from all who come into contact with them (whether supportive or not). The film-makers worked over several years to follow several migrant stories and, in doing so, capture the texture of a massive geopolitical challenge with incredible humanity. From the mundane details of waiting for a smuggler's signal to the terrifying, It Will Be Chaos raises universal questions about boundaries, rights of belonging and acceptance. I came away with a more nuanced understanding and appreciation of all sides. This film is especially helpful for teachers and students of international affairs.","user":"mariakupcu","rank":[1,2]}]