[{"title":"Where is your faith??","rating":8,"date":"20 July 2019","review":"This movie really pulls at the heartstrings. It was a film of fear, faith, hope and love. I thought the story was well put together and that it showed how anything can happen in the blink of an eye, yet how you choose to face it is the question. For this family and community-they chose to believe in their faith. Faith that the doctor could save him and faith in a higher-power.<br><br>Some people don't believe in God or have faith of any kind, and that's fine for them, but to see such reviews that are so angry at the mere thought that such a God could exist and that a miracle could happen, is unfathomable to them. I wonder why many non-believers get so worked up and angry over the possibility...when in life there are so many instances where truly wonderful and unexplainable things happen everyday.","user":"dnbaeb","rank":[70,91]},{"title":"Good movie. Recommend for believers and non-believers alike.","rating":7,"date":"21 July 2019","review":"This movie was a pleasant surprise. Ending up watching it on a whim with my sister who loves any movie based on a true story. And, yes, while the film is very heavy-handed with the religious propaganda, it's understandable given the film's circumstances. Truly a very emotionally gripping story led by a truly outstanding performance by Chrissy Metz. Seriously, she carries the film and acts her butt off. The rest of the surprisingly all-star cast play their role well. Would definitely recommend for believers and non-believers alike.","user":"mossow92","rank":[20,28]},{"title":"I got roped into seeing this; but I was glad I did","rating":8,"date":"18 April 2019","review":"I got dragged to see this by my friend. I don't usually do sad movies. I was prepared for mediocre/cringy acting - and at first it was. But then I got caught up in the story and I forgot the acting and it was a really good story. It's not a movie I would have chosen for myself, but I'm glad I went.<br><br>I would like to remind the people giving it one star reviews or saying that some of the events or relationships are \"predictable\" that it's based on a true story and I'm told they stayed true to the basic events. In other words; sometimes life is predictable, but it's what actually happened. Someone on another review site said they found the relationship change between the pastor and the mom obvious and predictable - again, this is apparently how it happened to the actual people those characters are based on. 🤷‍♀️<br><br>If you like a good story and can overlook some not-brilliant secondary actors, it's actually a whole lot more fun than I expected to have at this movie!","user":"iid-765-637609","rank":[136,230]}]