[{"title":"A well made film on a small budget","rating":7,"date":"11 May 2019","review":"Lou (Michaela Kurimsky) and Chantal (Karena Evans) are teenagers in an unnamed small town in Ontario. As they are living lives at the lower end of the social order , they work toward a goal to move away - maybe New York, maybe western Canada. Complications happen along the way.<br><br>For a small-scale film, the characterizations are impressive. Other small roles stand out as well especially members of Lou's family including her troubled mother (Tamara Leclair) and her younger brother (Callum Thompson) who is showing early signs of being gay or transgender.<br><br>Kurimsky stands out as someone who has just had enough of her circumstances and does as much as she can to go beyond them. Even when Lou's actions go too far, it's still tempting to cheer for her regardless.<br><br>Sometimes, \"Firecrackers\" is marred by occasional mumbling. There is also an incident near the end that was just too predictable. But otherwise, writer/director Jasmin Mozaffari has created a story in which each moment (aside from the one mentioned) is unpredictable. It has a flow that is as wild as the people involved in it.","user":"proud_luddite","rank":[10,12]},{"title":"Not fun or shocking or real","rating":4,"date":"1 August 2019","review":"I love Larry Clark movies and the whole genre of 'real' teen movies, which this movie fits into. But Firecrackers is boring, the characters aren't interesting, and there's nothing disturbing about it. It's just bleh. It would look real if the actresses didn't look like actresses, but that's the best thing I can say for it.","user":"sinatrad","rank":[6,11]},{"title":"Language!","rating":8,"date":"7 October 2019","review":"Are two lead actresses (Evans, Kurimsky) have very limited acting backgrounds, but did well, perhaps because their roles as older teens not happy w/pretty much everything except each other (well, most of the time) were natural fits. An indicator of the turmoil &amp; trouble they go through w/parents, boyfriends as they try to escape town is dialogue in which four letter obscenties &amp; similar words comprise 40% of the screen time; add in others (mostly males) it jumps to about 60%. Setting was low income; low education, gritty in your face. Ending not clear, but seems that leaving doesn't remove the source of the problems.","user":"westsideschl","rank":[1,1]}]