[{"title":"Such a powerful film","rating":10,"date":"2 February 2019","review":"As a parent of a gay man, I believe that this is a must-see film for all parents. It's a stark reminder of what was once widely believed (and sadly still is by too many) about homosexuality. It is said that when a person come out about their sexuality, they risk losing everything they have - their families, their friends, their homes... When I learned this, I realized that my son went through the same horrific fears a he prepared to come out. No one should have to endure that kind of suffering. I hope this film helps people realize that we have to continue to banish the old, harmful, and false beliefs that our society held. Amazing accomplishment by Joel Edgerton.","user":"GoRangers7","rank":[199,218]},{"title":"Hard to watch but absolutely incredible","rating":10,"date":"11 November 2018","review":"As a gay man myself, this movie made me sooooo angry. Not because it wasn't made well, but it brought everything back up to the surface that I thought I was past. From growing up religious and believing that there was something wrong with him to the conversations he has with his father... It was like watching my life in a movie. Anyways, I highly recommend this movie, it's difficult to watch but it shows the reality that so many of us go through and are afraid to tell anyone.","user":"swimfreakon_a_snowboard","rank":[223,274]},{"title":"Incredible but moving","rating":7,"date":"31 March 2019","review":"Boy Erased is the adaptation of Garrard Conley's memoirs published in 2016. Jared is nineteen years old when his parents learn about his homosexuality. He is then taken, more or less voluntarily, to a conversion center as part of a therapy called 'Source' during which he is subjected to a veritable mental torture to force him to change and correct his alleged deviance, within a childish and humiliating environment.<br><br>It is overall excellent, with a small damper: throughout the movie, all adult men are systematically as religious as obtuse. Jared will be accepted and understood by only one person: his mother. This context is excessively negative and the movie probably loses some credibility. Unless it's unfortunately the reality ... That being said, it's clearly a good movie.<br><br>Moreover, the author Garrard Conley is 34 in 2019, we can legitimately deduce that the film takes place in 2004. So, very recently, almost yesterday. Personally, I was absolutely unaware of such practices. Incredible and appalling!","user":"FrenchEddieFelson","rank":[40,47]}]