[{"title":"Room for more.","rating":4,"date":"29 August 2018","review":"The Mimic was easy to anticipate and this is its biggest flaw. Had so many options, ways to scare, to intrigue and in the end to switch, yet all it did was being linear. <br><br>I would not call it abysmal, definitely not an work of art, I do believe Asian Horror cinema has much better movies out there to recommend, but if you are with some friends and all of you are bored, I guess you can give this one a try. Doesn't bring much new, execution is average, acting is ok but also it comes with all the clichees. I got bored at times, waiting for the finale and sadly that was a complete letdown.<br><br>Thus I feel like I should warn any potential viewer, The Mimic is not what you would expect, this being said, in a negative way of course. If you must, just know what to expect. Mostly disappointments.<br><br>Cheers!","user":"gothic-fiction","rank":[5,5]},{"title":"Creepy Kid, But Not Much Else","rating":3,"date":"14 September 2017","review":"This movie feels like it's been edited to the bone - there are a bunch of unrelated story elements which pop up throughout, yet go nowhere, and instead of complementing the plot, they just muddy the waters and make the story confusing. Some characters are introduced with apparently important information to reveal, but with absolutely no context as to how they know what they do, or why other characters should even listen to them. Characters affected by the mimic can experience various physical responses, one of which seems quite dire, but the experience just ends as if incomplete and leaves you wondering what happened to the character afterwards. <br><br>The most definitive element of the film is the acting of the young girl playing the mimic. She's hard not to like, making the viewer's response conflicting with the scenes that follow, and engaging you to wonder what she will do next. Unfortunately though, the constant plot holes and character actions which simply don't make sense detract from this being anything other than a forgettable horror flick.","user":"macready85","rank":[17,25]},{"title":"Uneven and drawn-out but an engaging horror flick","rating":4,"date":"21 November 2018","review":"A Korean action horror. A story based on a Korean urban legend of The Jangsan Tiger, a man-eating creature that lures people by making a sound that resembles a woman's wail. The film competently builds an emotional level around the characters arnd steadily this is amped up to add more drama to the story. However, the plot is slow and it only starts to become interesting in the second half of the movie. The atmosphere is thick with bleakness, especially with a minor with apparently nefarious intentions, which is unsettling. For all the story build up it has a drab ending, though the film resonates on the powerful theme about a bond between a mother and her child.","user":"shakercoola","rank":[3,3]}]