[{"title":"Really shouldn't have bothered","rating":1,"date":"16 June 2019","review":"Saw this film on a Showfilmfirst promotion so it was free. I feel they should have paid me to watch it!<br><br>Awful plot, ridiculous situations, weak and incoherent script and, if they were meant to be, jokes. No engagement with the two main characters, couldn't care less what happened to them and how they manage to get back home is farcical (as is how they got so far away from home in the first place).<br><br>Cannot understand how it gets such a high score, pretty much always agree with IMDB ratings but this is way off the mark.","user":"phill-cottam","rank":[17,21]},{"title":"Fragmented and emotionally lacking","rating":4,"date":"24 June 2019","review":"Whilst desperately trying to support independent British film, sadly this film left me searching for, well anything.\nThe film felt disjointed, leaping from scene to random scene and there really did not appear to be any real message or meta narrative. Maybe that was the point. Maybe I just missed it.\nI found the boat crossing a completely inappropriate scene and this made for an uncomfortable watch, especially when the two white protagonists were thrown in the sea by the black migrants. Again, maybe I'm missing some hidden metaphor or ideological message but I just don't think this is a topic for comedy.","user":"georginahanser","rank":[12,16]},{"title":"Average, far fetched but not completely terrible","rating":3,"date":"14 June 2019","review":"Went to see this film last night and I am totally shocked to see every review on here is 8,9 or 10 stars.<br><br>The movie is very unremarkable and forgettable, the plot didn't add up in a few places and there were quite a few things included in the movie that didn't add anything to the story line whatsoever.<br><br>Although, it is light-hearted and there are a few funny parts.<br><br>Kierston Wareing's character of the washed up party animal mum desperately trying to keep her son by her side to cope with her abandonment issues was the highlight for me. Although Tommy French plays the part of the exhausted son, embarrassed by his mum's flirting very well. The duo's acting almost redeemed the far-fetched plot.","user":"nicolabarclay","rank":[5,10]}]