[{"title":"A very creepy n scary horror film with solid character development n atmosphere.","rating":9,"date":"10 June 2018","review":"This is my first Indonesian horror film n what an awesome horror film it turned out to b. After reading that it is a slow burner my excitement dropped but once I played the dvd, from the settings I cud smell that it's gonna b creepy.\nA big ol house situated next to the cemetary in the rural Jakarta is sufficiently eerie.\nThe performances, from the star cast, especially the small kid n the elder sis are grounded and very convincing.\nThe director's approach to the suspense and horror is slow-building but very very creepy. He shud b given a chance to direct a part of the franchise from the Insidious, Conjuring, Annabelle series. The story is very intriguing. The stark imagery and demonic cutaways were implemented to marvelous effect. Indeed a very scary, spine-tingling n dreadful film.\nThe interior lighting and shading at the house to some of the daytime n nighttime cemetary exteriors provided some beautiful photography.\nThe old house with the many rooms, a water well inside its premise n an olden era bathroom all added an eerie feel.\nThe demons with their umbrella's in the cemetary was top notch scary stuff.\nSome solid jump scares as well as some other stylish cuts help create a sense of terror.\nThe film is full of non cliches jump scares which r creepy n terrifying. There is one very violent n detailed gruesome scene which i don't wanna spoil.","user":"Fella_shibby","rank":[38,55]},{"title":"Away from the recent horror Hollywood crap","rating":7,"date":"28 July 2019","review":"Enough to be chilling for about half of its entirety. It's not original but it is scary. Kind of went a bit off track with the zombies and a few other unnecessary things but overall it was good! Had some sort of The Ring and The Grudge feeling to it but nevertheless it's a good option if you're tired of the crap Hollywood has been offering lately in the horror category. Not the best, but decent!","user":"tiagocampos-02918","rank":[4,4]},{"title":"Flawed but really good","rating":9,"date":"13 February 2019","review":"Usually if characters \"act\" in a certain way (meaning not really smart or favourable), I tend to dislike the movie and won't have really a good time watching it. This movie walks that fine line and also walks another very difficult line masterfully: combining horror and comedy (or light moments to be more specific).<br><br>There are certain moments, that really made my skin crawl. The ideas they had at some parts were really good. It may have the trappings of most horror movies, but you can either hold this against the movie or just roll with it. I can really recommend to do the latter, even if you are a bit of a cynic. The mood the cinematography captures is riveting ...","user":"kosmasp","rank":[8,10]}]