[{"title":"A \"ghostly\" nightmare","rating":1,"date":"27 October 2018","review":"Was drawn into seeing 'Against the Night', with a cool poster/cover, a somewhat intriguing if very derivative premise and as someone with a general appreciation for the genre it fits under. That it was low-budget, which from frequent personal experience is rarely a good sign due to that there are so many poor ones out there (though there are decent to good ones as well), made me though apprehensive.<br><br>It is sadly however yet another film seen recently, hence some reiteration because the exact same strengths and flaws present in those films are here, that to me was incredibly disappointing considering its potential which it doesn't do anywhere near enough with. 'Against the Night' is really quite abominable, with so many huge flaws and doesn't do anything with any potential it had. There is nothing good here in 'Against the Night' apart from the eerie-looking setting that is wasted by the rest of the production values, just amateur hour all round.<br><br>Going on to the negatives, the story does feel over-stretched and some of it comes over as vague and under-explained in the last third where the film especially became duller, more predictable, more senseless and less unsettled and never gaining momentum. All the characters are too sketchy and with cardboard thin and colourless personalities and with nowhere near enough to make one want to endear to them. Their annoying and illogical decision making and behaviours frustrates. The chemistry is bland and unfocused.<br><br>The sound quality is obvious and utilised cheaply (being too loud in the build ups and people's reactions), the effects are laughable and all of the acting is lacking severely on the whole, that's actually an understatement as the worst of it is horrendous. There is no sense of horror or engagement with the awful predicament they're in, and no connecting with the character, it just reeks of indifference which makes the viewer not care less too.<br><br>Dialogue can be stilted and rambling while the pace and film drags on forever, apparent from the very start, never recovering that interest is lost fast. The ending has no build-up and just ends ridiculously. Found too many of the supposedly shocking moments not surprising or scary and the atmosphere dreary, due to the excessive obviousness, a lot of dumb and vague moments and explanations and the lack of tension and suspense. Thrills are none, thanks to stodginess and excessive over-familiarity, and found myself never invested in the drama, which tended to be indifferently acted, interminably paced and statically directed.<br><br>A lot of 'Against the Night' has really dull and going nowhere plot elements and often nonsensical and confusing character motivations, while too many of the things to make you shocked are far from creative or unsettling. It all feels rather tame while the threat completely lacks menace and looks terrible.<br><br>Nothing freaky or interesting with some shoddy effects, no development and too derivative, while everything is unimaginative and are more odd than scary, completely failing to show any sense of dread. There is nothing interesting or illuminating with what the film was trying to do and the drama is overwrought with no momentum and a lot of weirdness. The direction is leaden, got the sense their heart was not in it, and the music is ill-fitting. 'Against the Night' is very amateurish visually, too drearily lit and shows no care in the way it's shot, severely compromising any coherence. The editing has more continuity errors than one can count.<br><br>Altogether, irredeemably terrible. 1/10 Bethany Cox","user":"TheLittleSongbird","rank":[5,5]},{"title":"I love bad films","rating":1,"date":"5 September 2018","review":"But this film is a real stinker. Nothing redeeming whatsoever about any of the characters. Directionless. Took me multiple attempts to watch it all the way through. Don't waste your time. As the other reviewer mentioned it comes across as a terrible Grave Encounters ripoff.","user":"koholintisland","rank":[5,5]},{"title":"Just god awful","rating":1,"date":"26 August 2018","review":"From the beginning the acting was so forced and cheesy I could barely get through half of the movie. It was like a really bad graveyard encounters knock off except not scary at all.","user":"paralegalchas","rank":[10,13]}]