[{"title":"It had a potential","rating":5,"date":"11 January 2020","review":"The photography in this film is quite marvellous, as well as the atmosphere and, certainly, the music. The story is a bit lacking and it's been poorly executed. Overall, it was enjoyable, if one doesn't ask questions or even tries not to think. It had a promise of being an outstanding movie, but turned out weak.","user":"ealanaiche","rank":[10,11]},{"title":"Apparently the writer didn't know how to end it.","rating":5,"date":"12 January 2020","review":"At the time of my writing this there is at least one positively-rated review here that gives a satisfactorily detailed plot synopsis, and so I see little point in writing one of my own and thereby potentially making readers cover the same ground twice. So this review contains only criticisms, observations and compliments regarding THE SONATA.<br><br>As we devoted fans of supernatural/paranormal movies know only too well, our preferred genre is one of the most popular of all subjects in the entertainment industry today. This popularity leads to two regrettable phenomena: 1) every dweeb with a camera phone and some fishing line (for the \"special-effects\" doncha know) thinks they're qualified to make such a movie and 2) the vast majority of these (usually) low rent movies are, consequently, utterly unwatchable.<br><br>Thankfully, THE SONATA is, mostly, a welcome exception to this sad reality. It's lamentable that I had to say \"mostly\".<br><br>About 90% of THE SONATA is really very good. Many typical and recognizable ear marks of a quality movie are present: good production values, good acting, creepy and atmospheric sets and locations, high quality music, an unsettling story with mysteries and hidden, frightening secrets to discover and explore, and so on. For the majority of the picture the watching experience is enjoyable and satisfying.<br><br>And then, suddenly, apparently out of nowhere, right as we begin the denouement, THE SONATA takes this giant, precipitous nosedive and faceplants in the dirt at the level of quality of a Syfy channel \"original movie\". We get a badly done, cheesy CGI demon-thing and in the next moment we see our beautiful heroin, on stage, playing her violin with faintly glowing eyes to signal us that she is now possessed by the demon-thing. Ta-Da, The End. Ugh. Sort of like topping a beautiful Bavarian tort with a cat turd. How many times have I seen that exact ending? Ruins the whole picture. The experience is not only \"disappointing\", to use an understatement, but given how well the movie was doing right up to that point, it's actually jarring. What happened? Did the writer die just before he completed the script and his Weimaraner had to write the last two pages?<br><br>Randomly, here's a few other irritants that detracted from THE SONATA:<br><br>A noticeable chunk of the dialogue occurs in French and, when I saw the movie, there were no subtitles. Some people might suggest I struggle with English and it's for dang sure I don't speak French. Given the context of the scenes in which the French language segments occur (questioning the housekeeper to see what she knows about the mystery demonic symbols, the heroin publicly mentioning, around some local yokels, that she lives at the Castle, etc.), it's fairly obvious what's being said. Still, it was an irritant to not know the details of dialogue content in a few scenes. Might have missed an important point there.<br><br>In a strategic marketing move that I have come to view as intrinsically lowbrow, although other people might view it as a legitimate movie promotional strategy, THE SONATA features Rutger Hauer in a \"loss-leader actor\" character role (not terribly long before he died, as a matter of fact). In THE SONATA I think we see Rutger Hauer's face in a painting for more screen time than we actually see him acting. I get the whole \"working actor\" mentality (a la Nicholas Cage), but at least when Nicholas Cage does it he's usually the main character of whatever Paycheck Special movies he makes. Having Rutger Hauer's presence in the movie for 10 frames allows the producer to market the movie with a well-known name on it in the hopes of making it punch above its weight class. I don't think this is an actor selling his talent for money, which is, after all, what they do for a living; it's more of a \"prostituting my famous name for a dollar and misleading the movie watching public as to what to expect from the movie\". You might feel differently.","user":"S_Soma","rank":[11,14]},{"title":"Somewhat Lacking, but Gothic, Spooky & Infused with Music","rating":6,"date":"1 November 2019","review":"An interesting case for me - an unlikely indie I saw on the local big screen on Halloween eve, it was shown here because the movie is shot almost entirely in the country I live in (Latvia), mainly in the 19th century Cesvaine Palace, where I've also been. I was very intrigued upon hearing about it - I had no idea there was such a project. It's hard to understand how much bias I possess criticizing \"The Sonata\", but it was indeed quite enjoyable.<br><br>\"The Sonata\" starts off with a pretty cool POV style intro and the late Rutger Hauer himself, the first half of the movie we spend mostly listening to a lot of story building dialogue, getting to know the archaic but decent characters, and also enjoying decent original score that's almost a character itself. The atmosphere feels gothic, misty, at times spooky and at times like its reaching for something but not quite achieving it. All the performances are commendable, I especially enjoyed the one by Simon Abkarian. The second half is the better half, things start to escalate more, atmosphere gets more dense, there are one or two actually good jumpscares and a somewhat lacking but acceptable climax. Cinematography's fine for the most part, the main location is utilised competently &amp; effectively, even the cgi used managed to not cross the line of cheese.<br><br>The story as a whole is nothing new really, it might make you reminisce about better interpretations of the same thing, but with a pinch of occult themes, a splash of cleverly included music \"The Sonata\" offers a decent entertainment for anyone who enjoys ghost stories, paranormal horror, gothic mood pieces and classical music. As for me, the additional value was to see places &amp; nature that's very familiar to me get used in probably the biggest horror movie ever filmed in this small country. My rating: 6/10.","user":"TwistedContent","rank":[9,12]}]