[{"title":"Self-Destroyer","rating":8,"date":"17 February 2019","review":"I seriously do not get half of the reviews about this movie about it not having a plot and being slow or about the editing being confusing.\n\"Destroyer\" has a very straight forward plot that is not even using cheap twists but rather telling a straight story in a hypnotic trance way and cutting up the timeline to reveal information at the time the director considered it necessary.\nI loved Karyn Kusamas \"The Invitation\" and \"Destroyer\" is a well made movie, no matter how you look at it. Nicole Kidman carries the movie along with the perfect choice of music that sucks you in and watch the plot unfold. This is not an action movie and if you fell for that its not the directors fault. Its a slow drama about a cop that made wrong decisions and tries to right her wrongs when her past with a bank heist gone wrong gets back to her 17 years later.<br><br>I know people today have attention spans like moths but seriously... if you can't accept a slow drama for what it is, that says more about you than about the movie. And come on, its 2019... if you are confused by a non-linear timeline and can't wait till the movie clears up the confusion.... thats on you too.<br><br>Don't expect this to be a violent revenge movie... its not. Well, at least its not the focus of \"Destroyer\", although the movie does not hold back when things go down. The drama elements are well played and the ending was quite touching to me. At its core this movie is about the desperate longing for escape from a cold, grey world and its quite obvious from the choice of locations and flats that always give off a bleak, worn down feeling. Music and cinematography make this work perfectly and the editing helped spice up a rather straight forward plot. If you liked Kusamas previous movies... go for it. The key ingredients of haunting atmosphere and slow unveiling of information to the viewer are there although this is a completely different movie than \"The invitation\". So don't fall for all the moths swarming IMDB. I can't put my finger on all those silly 1star ratings but honestly, it reeks of gender insecurity.","user":"dschmeding","rank":[148,195]},{"title":"Gritty thriller","rating":8,"date":"29 May 2019","review":"This is a great film. The kind of film they just don't make anymore. Kidman looks unrecognisable and delivers her best performance in a long time! Beautiful photography and a stellar cast make this an overall great watch.","user":"mariatrocha","rank":[31,38]},{"title":"A film that paves a winding road it never reaches","rating":5,"date":"11 February 2019","review":"Too many back and forth flash-backs throughout the entire 121 min slowly paced convoluted plot does not make for a good film - regardless of Kidman's decent (not great) performance.<br><br>Director Karyn Kusama and writers Phil Hay and Matt Manfredi failed to accomplish their vision in creating a captivating film by convoluting simplicity with cliched typical underwhelming directing and writing. Had this films timeline been played out normally, it may have been somewhat entertaining - although the focus was too much on Kidman's character more than anything else. Chopping it with back and forth scenes added nothing more than an annoyance, as there was very little surprise or impact that wasn't already predictable, and the finale was very underwhelming.<br><br>The camera work/cinematography was decent, although I would've rather seen less slow-mo and long fixated shots on irrelevant scenes. Had this film's pace been picked up substantially, and edited down to about 90 mins by cutting the convoluted and unnecessary portions out (e.g. skateboarders, walking in the snow, etc), I would have enjoyed it, instead of being left unsatisfied.<br><br>A shame the producers focused more on bogus reviews instead of investing in more experienced director/writers equal to Kidman's level. You won't get an A-grade film by hiring A-list actors with B-grade TV-experienced writers and directors.<br><br>Sadly it's only a very generous 5/10 from me, and all of that goes to the actors and score which were the only aspects that were stand-out/decent.","user":"TheTopDawgCritic","rank":[173,244]}]