[{"title":"Oh the mediocraty of democracy","rating":8,"date":"9 May 2019","review":"Sometimes I wish that there was a standardized IQ test prior to leaving web reviews. Sometimes the subject of the review is the test itself.<br><br>This is a beautifully shot, wonderfully written and acted, quirky dramedy about an interesting subject. Knowing a little about Jewish culture helps but isn't necessary. Almost every line Broderick delivers is funny - he hasn't lost any of his 80s charm.<br><br>The pacing and humor will challenge those born after 1983.<br><br>\"You know what this means?... It means Harold is ahead\"","user":"maniort","rank":[18,20]},{"title":"Not For the Faint of Heart","rating":5,"date":"8 May 2019","review":"When the R rating for this film declares disturbing images they're not kidding. The movie is a dark, absurd, and morbid comedy, as a Hasidic cantor (Geza Rohrig) becomes obsessed with trying to find out how long it will take his recently deceased wife's remains to decompose into dust so that her spirit can be free.<br><br>He will eventually team up with a reluctant community college science professor (Matthew Broderick) to try and get some answers. They will employ some highly bizarre and weird techniques to try and accomplish this.<br><br>I found most of the intended deadpan humor didn't quite work here, but as the film progressed I did find some of it darkly funny, like the scene with the security guard (Natalie E. Carter) at the Tennessee body farm.<br><br>Overall, after reading so many glowing reviews from pro critics I came away disappointed with this movie. It's not an easy watch for sure, but it also was unlike anything I can recall seeing on screen before.","user":"larrys3","rank":[6,6]},{"title":"Rilliant,Touching, Effing Real","rating":12,"date":"12 May 2019","review":"Jewish or not...it doesn't matter. I'm Jewish, but not Hasidic. This grabbed me at the core as a human. Such a beautiful movie. I wish they ended it with more answers. Both Broderick and Rohrig did SUPERB jobs bringing their characters to light. If only they could do another movie together!!!","user":"larahart-613-732915","rank":[6,7]}]