[{"title":"Nothing Special","rating":6,"date":"17 October 2017","review":"BEWARE OF BOGUS REVIEWS &amp; REVIEWERS. SOME REVIEWERS HAVE ONLY ONE REVIEW. WHEN ITS A POSITIVE REVIEW THAT TELLS ME THEY WERE INVOLVED WITH THE PRODUCTION &amp; THAT IS WHAT IS GOING ON HERE FOR THIS FILM! TRUST ME THIS FILM IS TERRIBLE. NOW I HAVE REVIEWED OVER 300 Christmas MOVIES. I HAVE NO AGENDA. I AM FARE<br><br>By watching the first three minutes of this film you will know how the next 2 hours are going to go. What was nice about the film was the locations they used for the film. It was beautiful. <br><br>In this film a doctor returns home for Christmas to find that her father has decided to retire from his own practice. After reuniting with her high school sweetheart, she wonders if she should stay and take over her father's practice. <br><br>What was nice about this film was the fact this wasn't about a family that were trying to put the pieces of their lives back together. It is not about a poor widow woman who has given up on love. Mainly it is a story about many people and the choices that are making they will impact the rest of their lives.<br><br>This is not a bad movie. Its just things you have seen 100X before.","user":"Christmas-Reviewer","rank":[55,64]},{"title":"Not as much romance story as family story","rating":7,"date":"16 July 2017","review":"Vanessa is a big city trauma doctor up for promotion. She returns home for a short Christmas holiday, where her father is a small town doctor. Most of the rest of her story is about being shown that even small town doctors save the world in their own way.<br><br>The romance is with Mitch, her long-past boyfriend who she's know most of her life. There isn't much romancing, relatively speaking. The connection is obvious and goes back to childhood, but Vanessa isn't really letting it get romantic.<br><br>The things that convince her are more incremental than sudden, so there are no huge surprises. But this is where the heart-warming part of the story lies. In the end, it is the small town practice that hooks her, but big Hallmark surprise, she ends up with Mitch too.<br><br>Brooke Nevin appears to be a rising star in the Hallmark movie world. She is charming and beautiful and does this kind of story well.","user":"Jackbv123","rank":[9,11]},{"title":"a real treat of a movie - warm and kind","rating":10,"date":"28 September 2017","review":"If you are looking for a Christmas movie with a heart to enjoy - this is it! A real joy. A warm and kind sort of a film, would be complemented by a cup of coco under the duvet. Brooke Nevin is gorgeous and a flawless actress, who is a joy to watch. Plenty of snow, holly, goodwill, Christmas trees and a few miracles.","user":"anna-05141","rank":[7,15]}]