[{"title":"Starts solid, declines eventually","rating":4,"date":"15 March 2018","review":"\"Fünf Freunde und das Tal der Dinosaurier\", which means roughly Five Friends and the Dinosaur Valley, is a new German movie mostly for young audiences and already the fifth installment by writer and director for the Five Friends series. I believe that these films are occasionally among the veyr best from his career and certainly superior to pretty much everything he did before taking on Enid Blyton and also compared to his recent pretty embarrassing Fixi movie. There is a crucial difference here though because the original child actors launching the project back in 2012 have become too old, so they recast the characters, which is a bit of a pity as I liked Valeria Eisenbart in particular (the tomboy girl), but even with this change, George still stays my favorite character. Or maybe the dog too. Anyway, the movie runs for 100 minutes approximately, not longer than most other kids films and it is about the search for a priceless dinosaur skeleton with the gang in the first row of course on their way to finding it. I personally liked the first half here. The introduction to the scenario is good and the characters are fun. Yes they may be over the top like the hotel owner girl, but still they are interesting to watch. But the longer the film goes the weaker it becomes. Many plot developments were on a really unrealistic level, like George falling right into the cave basically where the skeleton is hidden. Or the bad guys' motivation. Or when they say it is the best preserved skeleton on the planet at the end etc. Or when the adult that came twith them is sick and disappears out of the film completely. And no parents call or anything. Quite a pity the film could not keep his decent standard from early on. The one scene where the dog shines was also not too memorable this time and it even feels a bit unpleasant to watch the dog hanging in the air there basically. As for the villains, Peschel early on (maybe the most known cast member) is far more memorable than the two who are eventually the bad guys. The Spanish guy I knew somehow quickly it would be the bad guy, like when the new friend of the 5 says he is a nice one while everybody else gets criticized. And I was right, even if I thought he'd be the only one. By the way the fact that the gang makes one new friend is something they kept in here from the previous movies, a recurring theme, even if the friend is a grown-up this time. I think there will probably be more Five Friends movies with the new cast and I hope they can be a bit better than this one here. With established actors like Peschel, Prager, tarrach and Heerwagen, they have a solid basis to accompany the child actors. I am not too sure how much these films still have to do with the Enid Blyton books, I assume not too much, but that's not a problem for me as long as the plot and action are on a high level overall. In this one here, they aren't unfortunately and I give this one a thumbs-down and if you are looking for a new German kids film that is actually high-quality, my suggestion would be to go for the newest version of Preußler's \"Little Witch\" starring Karoline Herfurth.","user":"Horst_In_Translation","rank":[0,1]}]