[{"title":"Deserves a higher rating.","rating":10,"date":"2 August 2018","review":"The Death of Superman is a story-line that Warner bros. And DC have over used in the last decade and a little bit, back in 2007 DC released \"Superman:Doomsday\" which is based off the same story and that was definitely a great movie. 9 years later in 2016 they adapted that story-line in live action for the first time in 2016 with the ending to Batman Vs Superman:Dawn of Justice where Doomsday shows up and spoiler alert kills Superman and that definitely was not done well. Now in 2018, DC's newest animated venture adapts that same story-line in the Death of Superman, but the fact that it's been done before doesn't hinder the movie at all,in fact it is probably the best version of the story adapted to movies. Don't get me wrong Superman:Doomsday is really good and I still think it's great but The Death of Superman has actually surpassed that movie as the best version of this movie. <br><br>One of the things this movie does so well that say ... Batman Vs Superman doesn't, is it makes you actually care about the actual death of Superman. we all know that he's gonna come back in a year but the reason it's still really emotional is because characters like lois and bibbo and his parents don't know that, and think he is dead and is never coming back. which also wouldn't matter if those relationships were not developed throughout the movie and they definitely were extremely well which makes you actually feel something when Superman dies and I gotta say It actually was a very emotional death scene when he died and I think a big reason for that is they showed how superman actually was a beacon of hope to metropolis and how metropolis loved him and on top of that Superman is a really 3-dimensional compelling character and an excellent version of the character. so much so when he died it was emotional which is insane because you know he's gonna come back,which is basically the exact thing that happens in Infinity War although to a much smaller and less emotional way but still it's very similar. But yeah I give huge props to this movie for developing everything so that when the title actually happens and Superman dies you actually feel something more so than in Superman:Doomsday and way more so than in Bvs.<br><br>This movie had a lot of set up for the sequel but not to the point where it was obnoxious,in fact it was the exact opposite whenever one of the other 4 supermen showed up like Hank Henshaw,Superboy,the eradicator and steel it was a pretty awesome how they subtly set up the sequel in the background,that's something I really liked about this movie.<br><br>Considering a big part about this story is the fight between Doomsday and Superman as well as the justice league,the action has to be great and the death of superman does not disappoint the action in this movie is bad-ass,it's amazingly animated and choreographed if that's how animated fight scenes work,i don't know. but the action and the fight scenes specifically Doomsday Vs Superman was awesome and doomsday fighting the justice league was pretty awesome as well.<br><br>So I've been praising the hell out of this movie, but there is one thing that I don't like and that is Lex Luthor. Mainly because his voice acting was straight up terrible,that voice actor just didn't fit the role at all and because of that whenever he showed up he kinda took away from the movie.<br><br>9.5/10","user":"schwartzariel10","rank":[40,48]},{"title":"One of the best DC Animated movies you will ever see","rating":10,"date":"24 July 2018","review":"Story has been done many times but this one exceeds all expectations. Story telling, choreography of fights, using rest of DC characters are pure perfection. I'm guessing next one is 'Reign of Supermen' because they did wonderful job setting it up for sequel. The creative team behind this movie should be given control over rest of the DC movies... but that is just a dream for now. I will watch this again and again, I finally got perfect Superman movie.","user":"freeskill-67340","rank":[58,73]},{"title":"Somehow this is better than BvS","rating":8,"date":"29 July 2018","review":"After watching this, you will be wondering why Batman vs Superman didn't turn out like this. The fight between Superman and Doomsday was beyond expectation. Plus this sets up the next animated movie (Reign of Supermen) a la the MCU.","user":"JohnDoe91821","rank":[36,48]}]