[{"title":"THE FORTRESS","rating":8,"date":"11 February 2020","review":"Surprisingly good Korean history flic. Very good performance by the actors. No overacting. No trash. No cringe. Characters are well drawn. The script well written, featuring the predicament of the main protagonists. But note! if u want battle action, please opt for Lord of the rings or Avengers Endgame. Sry no offense. This is more a political movie!","user":"MR_Heraclius","rank":[38,42]},{"title":"All Quiet on the Eastern Front","rating":9,"date":"18 May 2018","review":"During the winter of 1636/7, Korea was invaded by the Manchu armies. The cause of the war was the refusal of King Injo of Korea to abandon his traditional alliance with the Ming dynasty whom the Manchus were trying to supplant as rulers of China. (They were to achieve this ambition in 1644). As the film opens Injo, facing defeat by the numerically superior Manchus, has taken refuge with his court and much of his army in the fortress of Namhansanseong. <br><br>The historical Injo appears to have shared some of the character flaws, such as hot-headedness and an unwillingness to take advice, which were to get his British contemporary Charles I into such trouble. (The two monarchs were to die in the same year, 1649, although unlike Charles Injo was not deposed and was not executed but died a natural death). Here, however, he is portrayed as a man torn by a terrible dilemma- either to submit to the Manchus, a prospect which he regards as both humiliating and dishonourable, or to continue to resist them, a course of action which will inevitably lead to further bloodshed and which may possibly lead to the destruction of his kingdom. His courtiers are divided into pro-war hawkish and pro-appeasement dovish factions, both of whom argue forcefully to persuade the King towards their viewpoint. <br><br>Although this is a South Korean film and made on an epic scale, it is not a heroic, patriotic drama. The Manchu invasion ended in what the Koreans perceived to be a national humiliation, so it is not the stuff out of which patriotic dramas can easily be fashioned. It is, instead, in many ways an anti-war epic. Although there are lavishly staged battle scenes, most of the action takes place within the besieged fortress itself. The emphasis is less on the actual fighting than on the suffering caused by war, both the mental suffering of those burdened with the agonising responsibilities of command and the physical suffering of the men who do the actual fighting. Even when they are not engaged in actual combat with the enemy, these men still suffer, both from the extreme cold and from hunger. In one scene the soldiers are forced to feed their straw jackets, their only defence against the cold, to their horses. In the next scene we see the horses being slaughtered to feed the men. <br><br>Historically, the entire war took place in winter- it was over within a few weeks- and director Hwang Dong-hyuk makes good use of the wintry Korean landscapes, investing the film with a sombre beauty and using them to symbolise the suffering caused by war. There are excellent acting performances from Park Hae-il as the King, Lee Byung-hun and Kim Yoon-seok as the leaders of and spokesmen for the two rival ideological factions and Go Soo as Seo Nal-soi, a humble blacksmith who undertakes a dangerous mission to try and summon reinforcements to relieve the beleaguered fortress. This film, starring no internationally-known actors and dealing with a historical episode little-known outside Korea, is unlikely to be widely seen in Britain or elsewhere in the West, but it should be. In the masterly way in which Hwang deals with the miseries of war it is an \"All Quiet on the Western Front\" for our times. Together with the recent \"The Handmaiden\" it has persuaded me that the once-neglected South Korean cinema is now capable of producing films of the highest class. 9/10","user":"JamesHitchcock","rank":[28,34]},{"title":"The Futility of War","rating":7,"date":"19 July 2018","review":"Josean (Korean) King Injo (Park Hae-il) is being attacked by the Qing, led by the Khan. He retreats to a mountain fortress in deep winter, and listens as Interior Minister Choi (Lee Byung-hun) argues with the Prime Minister (Sung Hyun-soo) about whether to negotiate or fight. Meanwhile, the fortress villagers and soldiers, including blacksmith- turned-recruit Nal-soe (Go Soo) and his brother are slowly starving and freezing to death, and it is turning out to be a long, long winter.... This film is based on Korean history in the 17th Century, when China ruled much of the peninsula and in turn was being menaced by the Qing, the forces of Genghis Khan's empire. Overall, \"The Fortress\" points out the futility of war and, a bit unexpectedly, also that life in the end will prevail (just not for everyone). The film is quite long at about 2 1/2 hours, but it's beautifully drawn and especially interesting to see in the middle of a very hot summer; all the scenes of snowstorms made me feel a tad chilly, even!","user":"alisonc-1","rank":[20,27]}]