[{"title":"Sensitive Indie Lovestory","rating":8,"date":"7 January 2019","review":"All too realistic portrayal of passionate lovestory rekindled then sours. Beautifully and sensitively acted by talented newcomers of whom more is sure to come. Refreshing to see a new take on this theme . The music is superb as well. Enjoy !","user":"rhianblandfordjonesholmes","rank":[4,7]},{"title":"Real life in all its pain and pleasure","rating":28,"date":"28 December 2018","review":"This is a very moving and involving film showing the true pain and pleasure of a really authentic relationship. I really enjoyed how closely observed all the moments were in this drama. It was very touching and it made me reflect on my own past relationship highs and lows. Recommended.","user":"Phil_Chester","rank":[3,5]},{"title":"Moving, authentic, beautifully crafted","rating":9,"date":"21 December 2018","review":"When you think of romance or relationships depicted in film, invariably cliches pop to mind. Boy meets girl, Jennifer Aniston-cuteness, inevitable bliss. To quote the film Annie Hall, \"If only life were like this.\"<br><br>Elephants is about love, but it eschews such simplistic cliches and instead gives us a look at a relationship that feels authentic and lived in. There's such a wonderfully complicated mix of emotions between the characters in this film. That's the norm in life, but not in the movies... where we often go to avoid life's pain rather than confront it. But Elephants doesn't shirk from that complex reality but embraces it. Which makes not just for good entertainment, but makes this film art. Something one rarely finds in film.<br><br>There's joy here, laughter. But also genuine sadness. And there's real craftsmanship to the filmmaking. Beautifully shot, well acted, with great music. Writer-Director Alex Hanno is a sure hand behind the camera. With work like Elephants, we have a real artist to watch in the years ahead.<br><br>Bravo to Elephants!","user":"directortim2012","rank":[3,6]}]