[{"title":"this is the one that can make a sturdy old man break down","rating":10,"date":"9 April 2019","review":"If your having a bad day, dont watch this, if your out of oxy's dont watch this, if you are in the middle of a divorce, dont watch it. that is because this is the kind of film that should be viewed with clear senses, to be watched when you feel strong, and to be seen when all your deeds has been done in a way that you feel ready for some of the most brilliant ,toughest, heartbreaking ,mindblowing and gutwrenching acting ever done on the silverscreen.<br><br>it starts quite confusing, where this man sits in his kitchen stol, with a goatstare thinking about the recent time of his life. so do pay attention in the start,or else youll have to buy tickets to the next screening to really understand., we then experience that something bad has happened, and we take part in their grief and loss of a child. their marriage starts to crumble in the coming weeks, and the wife want to have a divorce, and the reasons and the way its acted out are so gobsmakingly well done. the man then slides downhill abusing oxycontin tablets, lend to him from his aging dad, to ease the pain of his mind. his employer comes in the picture when the man has delivered a positive urin drug test, and gets the knife on his neck,its to be or not to be.then starts a further downhill race,where his sister becomes addicted, and the downward spiral starts churning, with cynical dealers, lack of money and in the end tablets for sex. i think i will stop here,just telling that your about 1/3 into the film when actually all this has happened.<br><br>the key to this film is not so much the love in a relatinship as in a marriage, its more about the safe harbour where the storms and the waves never reaches you, and im sure that many people that has been married for 10 to 30 years will start nodding in recognition to what unfolds in the film. on the addiction, there will also be a tough ride for everyone having the same issues,or knows somebody or can relate on this due to proffesion etc.<br><br>the acting are stunningly well done, and i will be the first to declare that Josh Stuart should be nominated for an academy award next year for the role he is interpreting with bravour, with A.J. Cook and agnes Brukner as worthy candidates too..they all made me suffer through ,in a positive way, till the lump in my throat were so big and my emotional cup of tears ran over the rim and i could not stop it. so well done indeed.<br><br>productionwise, it has a kind of primitive filmography, that gives you the fly on the wall effect. there are some parts where the background noise,strangles the dialouges a bit,and the sound sync are a bit unsynced, but when you have a star spangled banner to take from it wont be a thret to my 10 star award. i also had some issues with the score chosen for this film, but that work brilliantly to. the false piano and the sounding sound of the cello and violin really drags you through the pain. im sure it is a low budget movie, but the signs are well hidden.<br><br>in the end i will also pay tribute to our beloved mr channing , david selby, fro the tv soap falcon crest, he is still in the business,and does a darn good job.<br><br>so do you believe all the rubbish ive written here? well, do take the chance on me, and watch ''back fork'', its worth more than money can buy, thinks the old grumpy man.highly recommended","user":"ops-52535","rank":[23,29]},{"title":"A must watch","rating":10,"date":"17 April 2019","review":"I recommend this movie 100%. The story line is one that many people can relate to and it could help those who are struggling with addiction or know someone who is. It will have you feeling every type of emotion from the very beginning. The acting plays a big part in that also, every single one of the cast did an amazing job.","user":"carriemiller-82145","rank":[6,7]},{"title":"Not one false note","rating":10,"date":"16 April 2019","review":"I love Josh Stewart as an actor, , so I expected to like this, and ended up being completely impressed by this film which he stars in, wrote and directed. A film about the opioid epidemic and it's effects on a West Virginia family , this movie is perfectly cast, with amazing performances from every one, gritty, realistic, and yet also understated. The Cinematography is outstanding. There is nothing phony and Hollywood about this, it draws you in and you come to care about the characters who are so much more then their drug addictions. Since in real life I also live in the south and know these people, I can say this movie is 100% real life. Josh has done an amazing job with both directing and writing this and even more impressive, where other actors turned director could have made this all about themselves, he allows the other actors to shine too, especially A.J. Cook as his wife, Agnes Bruckner as his sister, David Selby as his father and an outstanding sleazy performance by Wade Williams as a dealer. A small movie with a big impact, great cinema !","user":"hampersnow-28905","rank":[5,6]}]