[{"title":"As a psychiatrist and a film lover, I was highly disappointed.","rating":3,"date":"1 April 2018","review":"As someone who works in the mental health field, the first act of this movie excited me. The set up seemed to suggest a film that would attempt to capture the experience of a psychotic individual who finds herself involuntarily committed; to convey the confusion and desperation of such an experience for the patient, and perhaps the callousness of the staff who have become so jaded to such a presentation that they fail to meet the emotional needs of that patient. I felt genuinely uncomfortable through the first 20-30 minutes of the film as this scenario was explored, so much so that it forced me to reflect on my own experiences with psychotic patients and how important it is not to lose that level of empathy regardless of how routine the work may become. Furthermore, I was tantalized by the possibilities of the film in blurring the line between delusion and reality, expecting it to keep me questioning what was real and what wasn't.<br><br>And then the film throws all of that into a wood chipper. And burns the wood chips. Unfortunately, from here I'm really going to have to get into specifics, ie spoilers, so,<br><br>***SPOILERS***<br><br>First, I just have to mention the numerous inaccuracies here in the depiction of an inpatient psychiatric ward. The physical setup of the facility is quite odd with its communal bedroom shared by all of the patients which is locked every night without any staff member being physically present inside. Even more unlikely is that during the day the patients are allowed to wander around the rest of the facility without seemingly any security. I'll concede that I obviously haven't seen every possible inpatient setting design, but this is quite removed from anything I'm familiar with.<br><br>More problematic though are the way restraints and seclusions are portrayed in the film. Restraints and forced medication can happen if an agitated patient is unable to be calmed by any other measure and is at imminent risk of harm to themselves or others, but patients are never restrained in a communal room and then left alone for extended periods of time, unmonitored by staff, and no less surrounded by other inpatients who are often psychotic and potentially dangerous. Medication injections are also always given in a muscle rather than in a vein as depicted here, and certainly never in a neck vein. Patients placed in a seclusion room are highly monitored and there are extremely strict regulations on how long a seclusion can last. It can not be used punitively and for indefinite periods of time as portrayed here. Opiate addiction on its own is never an indication for an involuntary psychiatric hospitalization and would never be covered by insurance. Staff members would never be able to secretly move patients to remote areas in a facility and hold them hostage there - everything is video monitored and it is standard for every patient to be physically checked on by nursing staff every 15 minutes.<br><br>I could keep going, but I won't. Afterall, this is a movie. Films often can take liberties with reality, though for a film like this that is examining the mental health system and offering commentary on it, the gross inaccuracies are more problematic. Still, I did my best to see these as artistic liberties taken in the service of telling a story, entertaining an audience, and conveying a message. The problem is that the film fails on all of these levels as well.<br><br>I mentioned earlier that I was tantalized at the possibilities that the film set up in blurring the line between delusion and reality, and I was completely let down. There is absolutely no ambiguity here, no intrigue, no possible interpretation where the stalker isn't real. And while that's far less interesting to me, it at least could've worked as an entertaining B-movie. But the plot is so offensively absurd that it crumbles even with the most cursory critical analysis. How did this stalker manage to get a job as a nurse at this facility within 24 hours of our protagonist showing up there? Did he kill the real nurse and pose as him? No - because then the nursing staff obviously would recognize him as an imposter in that case. Furthermore, a co-worker specifically comments that he is one of the most dependable nurses they have which obviously indicates he has some history at the job. So then is it a coincidence that our protagonist chose this facility from her random google search and her stalker just happened to have taken a job there prior? Did I miss some explanation for this? Even if I did, it's just incredibly improbable to the point of pure contrivance.<br><br>And then our stalker is able to kidnap patients, hold them hostage, torture and kill them, all within a secured and staffed facility where patients would be monitored continuously as I previously mentioned. I had to stifle laughter when he explains to the protagonist, whom he is now indefinitely holding hostage in a seclusion room on a seemingly deserted, unstaffed floor of the hospital (which in itself is ludicrous), that the other staff members just \"assumed\" that she had been discharged and her insurance coverage had expired. A patient cannot be discharged from a hospital like this without clearance and direct orders from a psychiatrist, who then prepares all of the necessary paperwork, prescriptions, referrals to outpatient providers etc. It is a multidisciplinary process that involves the psychiatrist, nurses, and social workers. It's utterly laughable that the film asks you to believe that a patient would just be \"assumed\" discharged from a facility like these when none of this process had taken place.<br><br>***END OF SPOILERS***<br><br>Again, I could keep going but I'd be beating a dead horse. Highly disappointed with this film, and sadly it will likely perpetuate so many of the negative stigmas surrounding psychiatric hospitals. It does have some striking visuals here and there, the lead performance is quite good, and I did enjoy the raw quality of the filmmaking, but this is nowhere near enough to make up for its issues. I couldn't even recommend it to someone who has no knowledge of the mental health world as it totally fails as campy B horror/thriller too with its absurd plot and utter failure to capitalize on the potential for intrigue/ambiguity in the setup. Skip it.<br><br>1.5/5","user":"ccamp89","rank":[275,391]},{"title":"Divisive Dilemas.","rating":6,"date":"27 March 2019","review":"Have to be honest, I had no idea this was filmed on an iPhone 7 or that it was directed by Steven Soderbergh. I was stuck for something to watch on cable the other night and I liked the sound of the plot premise. So unburdened by expectation of a searing horror classic I settled in to see what unfolds.<br><br>Plot has Claire Foy as Sawyer Valentini who inadvertently commits herself to a mental health institution. Once inside things being to unravel and the threat of her one time stalker now being even close to her opens up the book of terror - but is it real?<br><br>Firstly you have to say that the mental health authorities must have had kittens when they saw this, much of what is on screen is utterly ridiculous and paints the system in a damning light. Secondly you really have to jump on board with the improbability of it all, this really is made for dramatic entertainment purpose and not as a viable horror of the real world.<br><br>As a thriller it worked for me, the constant question of what is real or not keeps things on the slow burn. Either way, real or not, it's thought provoking enough to warrant staying till pics end. The psychological angle is pungent enough to say there's some thought in the writing, though this is undone by utter nonsense as things spiral into the impossible for the final quarter of film.<br><br>Foy is good value up front and the fulcrum of it all, while elsewhere good work comes from Nate Hoffman and it's nice to see Juno Temple in a spicy role. Ultimately this is no blood letting horror picture, and certainly it's no One Flew Over The Cuckoo's Nest, Girl Interrupted etc etc.<br><br>The iPhone experiment is a gimmick that works here due to the confines of the location for story, but as a genre piece of worth it is unlikely to have legs. However, even though I enjoyed this as a one time only viewing experience, I perfectly understand why it has become divisive. So for those who haven't seen it yet then it is advised you understand this is no terrifying thrill a minute piece. It's tricky to recommend with any sort of confidence, and thus I feel the internet ratings of about 6.5/10 is just about right. 6.5/10","user":"hitchcockthelegend","rank":[21,26]},{"title":"Plenty of Promise, but is ultimately a bit Unsatisfying","rating":6,"date":"31 March 2018","review":"With most of Steven Soderberg's movies, he tells stories in a way that makes viewers unsure of what exactly is going on. Unsane is like that. The title indicates that the main character might be insane but also might not be insane. <br><br> Well, it turns out the this movie has an excellent title because that's pretty accurate summation of the movie. A bit longer summation goes like this: the main character might be insane but also might not be insane but some people think she is insane but she makes some erratic choices so she cannot convince everyone that she's not insane but maybe she does that because she actually is insane. <br><br> Sawyer Valentini (a strikingly unhinged Claire Foy) seems normal enough at first glance. She works a steady financial analyst job at a bank. She has a loving relationship with her mother. She goes on Tinder dates. But she's troubled by someone from her past, a man who has been stalking her for the past two years. She has difficulty dealing with the stress, so she turns to medication and therapy to cope. <br><br> In her conversation with a therapist, she casually mentions that she's had suicidal thoughts in the past. The therapist exploits this casual mention and tricks Sawyer into signing a waiver voluntarily committing herself to 24 hours of observation at the clinic. <br><br> Once inside, things become increasingly frustrating for Sawyer and even more so for viewers. She lashes out violently multiple times and ignores the advice of one helpful patient recovering from an opioid addiction, Nate, (Jay Pharoah showing off impressive dramatic acting chops), which subsequently gives the staff reason to extend her stay an additional week. Her inability to control her temper makes viewers wonder if she really does belong there.<br><br>That's as much as I can reveal without introducing spoilers. I can say that movie is a bit of a slow burn early on. Then the action picks up in a big way. <br><br>The story veers in a different direction, which causes some problems because we miss backstory that would have tied the story together in a neater, more affecting way. As it stands, the movie has a lot going on, but no part feels fully developed. Foy's lead performance and Soderberg's filmmaking keeps the film watchable throughout, but ultimately, it all feels a little unsatisfying.","user":"Jared_Andrews","rank":[79,116]}]