[{"title":"Cut","rating":5,"date":"20 January 2019","review":"I want to love this film and everything about it except, just about every scene is three times longer than it needs to be.","user":"harvey-abouelata","rank":[247,356]},{"title":"Beautifully shot, but emotionally languid","rating":6,"date":"4 March 2019","review":"Based on <a href=\"/name/nm0049924/\">James Baldwin</a>'s 1974 novel of the same name, If Beale Street Could Talk is really two stories in one; there's the love story at the narrative's core, giving the film much of its tonal qualities, and on the surface, there's a socio-political protest, which provides most of the main plot points. At a quick glance, this should be a masterpiece - there's the foundation of James Baldwin, arguably the most significant African-American author of all time, and this is the first English-language adaptation of one of his novels; there's writer/director <a href=\"/name/nm1503575/\">Barry Jenkins</a>, fresh off the Oscar-winning <a href=\"/title/tt4975722/\">Moonlight (2016)</a>; there's a theme that is (sadly) almost as pertinent now as it was in 1974; there's <a href=\"/name/nm0493439/\">James Laxton</a>'s extraordinarily vibrant cinematography; there's a bevvy of hugely talented actors; there's <a href=\"/name/nm1615109/\">Nicholas Britell</a>'s absorbing and melancholy score. This should have been a home run. However, although I found it aesthetically faultless, much like Moonlight, I felt the totality was considerably less than the sum of its exceptional parts. The biggest problem is the somnolent love story. Employing a <a href=\"/name/nm0000517/\">Terrence Malick</a>-esque esoteric voiceover, Jenkins lifts entire passages directly from Baldwin. However, what reads beautifully in the novel is badly out of place in the film, even in voiceover, and has the effect of rendering the two central characters completely unrealistic, with their love for one another idealised to such an extent as to become ridiculous.<br><br>New York, 1974; 19-year old Clementine \"Tish\" Rivers (<a href=\"/name/nm8460487/\">KiKi Layne</a>) and 22-year old Alonzo \"Fonny\" Hunt (<a href=\"/name/nm4150847/\">Stephan James</a>), who have known one another since they were children, have fallen in love, and are planning to get married and raise a family. Fonny has quit his job working for a furniture manufacturer, hoping instead to make it as a sculptor. However, when he is accused of rape, the victim mistakenly identifies him in a line-up, and he is charged and detained. Awaiting his trial, Tish visits him in jail, telling him she is pregnant. Ecstatic at the news, Fonny says he can't be in prison when the baby is born, and so Tish and her family determine to do anything it takes to get him out as soon as possible. With this as the central framework, the story is told in a non-linear style, jumping back and forth from one time period to another, which has an important thematic effect that I'll discuss below.<br><br>Aesthetically, much like Moonlight, If Beale Street Could Talk looks amazing. From Laxton's vibrant cinematography to <a href=\"/name/nm1000803/\">Caroline Eselin</a>'s colour coordinated costume design (just look at all the yellow in the opening scene - in both the photography and the wardrobe), everything we see rings true, like a Jack Garofalo photograph come to life. Even more visually lyrical than Moonlight, the saturated colour palette of Beale Street recalls <a href=\"/name/nm0802862/\">Douglas Sirk</a>'s Technicolour-soaked melodramas. Jenkins has been very open about his admiration for filmmakers such as Sirk, <a href=\"/name/nm0219136/\">Claire Denis</a>, and <a href=\"/name/nm0396284/\">Hsiao-Hsien Hou</a>. However, he is most clearly indebted to <a href=\"/name/nm0939182/\">Kar-Wai Wong</a>; seen in Beale Street's non-linear narrative and relatively slight plot, its poetic tone, the centrality of music, and its tendency to use visuals rather than dialogue to convey thematic points (although Jenkins is nowhere near as formally experimental as Wong).<br><br>As in both <a href=\"/title/tt1133989/\">Medicine for Melancholy (2008)</a> and Moonlight, Jenkins occasionally has characters speak directly to camera. They're not breaking the fourth wall, however. Such scenes are dialogue scenes, with two characters speaking to one another, so when one speaks directly to camera, it's as if the camera is between the two of them. It's a technique that was used most famously (and effectively) in <a href=\"/title/tt0102926/\">The Silence of the Lambs (1991)</a>, where each character looked directly into camera when speaking to Clarisse Starling (<a href=\"/name/nm0000149/\">Jodie Foster</a>), whereas she always looked just slightly off-camera, setting up a fascinating visual contrast which encourages us to identify with her. Beale Street doesn't do anything as interesting or subtle with the technique, but Jenkins's tendency to use it during moments of heightened emotion does have the effect of suturing the audience into the milieu of the film.<br><br>As mentioned above, the use of a non-linear narrative structure has an important thematic effect. We know from the second scene that Fonny is in jail, meaning that as we watch Tish and Fonny planning their future, renting an apartment, having sex for the first time etc, there's a permanent shadow over everything we see; we know that things go wrong, because we know much more than the characters do. For the most part, this contributes to the tone of the film, thus justifying itself. However, Jenkins overuses the technique. I understand why the film is told out of sequence, but I don't understand why it's told out of sequence to such an extent. Compare this with <a href=\"/name/nm0000576/\">Sean Penn</a>'s <a href=\"/title/tt0237572/\">The Pledge (2001)</a>. For the most part, it's a linear narrative, except that the first scene shows us the protagonist, Jerry Black (<a href=\"/name/nm0000197/\">Jack Nicholson</a>) as a broken-down alcoholic. The rest of the film takes place prior to this scene, so when we see Nicholson fall in love with Lori (<a href=\"/name/nm0000705/\">Robin Wright</a>) and spend a blissful Christmas with her and her daughter, we know that something terrible is coming, knowledge that casts a shadow over the entire film. Penn accomplishes this with a single scene, right at the start of the film. Beale Street, on the other hand, jumps all over the place, never settling into a standardised rhythm, with the cumulative effect becoming one of distraction rather than immersion.<br><br>Which brings me to the film's most significant problem - the love story at its centre just didn't work for me. This is partly because of the emotional distance Jenkins maintains, but it's primarily because Fonny and Tish don't seem like real people, not in the way they gaze into one another's eyes as if they are seeing each other for the first time, not in the way they speak to one another as if every syllable is of earth-shattering portentousness. They rarely speak normally; instead, they adopt the eloquence of James Baldwin. In lifting sections directly from the novel, Jenkins has failed to consider the differing demands of the medium - what works on the page, doesn't necessarily work on the screen, and the reproduction of Baldwin's rich and lugubrious prose is simply unrealistic, with the delivery sounding stilted and awkward, and, most egregiously, far beyond the lexicon of the characters. This is especially apparent in Tish, whose expressive voiceover is far beyond anything we see of her character in the film itself.<br><br>In this sense, they don't come across as people with their own interiority and psychological verisimilitude, instead functioning as cogs in the machinations of Jenkins's thematic concerns. Tish, in particular, feels like a cypher, because of her dual role as a young girl trying to get her man out of jail, and a sage-like observer of institutionalised racism. Fonny too has an important dual role - that of a young man falsely imprisoned, and that of a tragic figure standing in for the millions of African-Americans unjustly imprisoned throughout history. Jenkins doubles down on this point by intercutting the film with black-and-white photographs of Henry Smith, Jesse Washington, Will Brown, Emmett Till, and the Freedom Summer Murders. The point is clear; Fonny is a grand representative of the crimes committed against Africa-Americans in the US. However, his character never attains the kind of grandeur such a representative must, by definition, possess.<br><br>Another problem concerns the depiction of Bell (<a href=\"/name/nm4534098/\">Ed Skrein</a>), the racist cop who frames Fonny. Played as a leering pantomime villain, with bad hair, bad teeth, and bad skin, he's obviously a metaphor for the ugliness of racism, but he's so completely over the top, it rips you right out of the film. On the other hand, <a href=\"/name/nm0005093/\">Regina King</a>'s portrayal of Tish's mother, Sharon, is exceptional. If you really want to see what an acting powerhouse King can be, she's never been better than she was in the second season of <a href=\"/title/tt2699128/\">The Leftovers (2014)</a>, and she brings much of the silent depth with which she portrayed Erika Murphy in that show to Beale Street. The scene where she heads to Puerto Rico to try to persuade the rape victim, Victoria Rogers (<a href=\"/name/nm1986960/\">Emily Rios</a>), that Fonny didn't rape her is one of the most harrowing things you'll see on screen all year, with King conveying her emotional state primarily by her facial gestures.<br><br>Beale Street is an undeniably beautiful film that depicts the love between two astonishingly attractive people (it's worth noting that in the novel, Fonny's unattractiveness is emphasised). Jenkins's interpretation turns Fonny and Tish into a Ken and Barbie-esque couple, undermining Baldwin's depiction of them as existing in a realistic milieu. Taking a meditative approach to the material, Jenkins's adaptation never rings true. Whereas Baldwin's Tish and Fonny are flawed, contradictory, and relatable, Jenkins's protagonists are too-perfect-to-be-real, with every agonisingly serious pronouncement they make to one another pushing them further and further away from connecting with the audience on an emotional level.","user":"Bertaut","rank":[79,113]},{"title":"1hr of dialogue stretched out over 2hrs that felt like 3hrs","rating":2,"date":"9 January 2019","review":"I don't know how this movie is rating over 90% on RT. It was dull dull dull.\nHere's why: The director chose to make his movie as visually stylish as possible, with much of the movie filmed in portrait with bokeh backgrounds, very sluggish delivery of dialogue (the lead lady talked like she just woke from a nap), and overall just lack of substance. The film felt very artificial, it didn't feel real as well. The background music didn't help either, it sounded like it was somewhere between Taxi Driver and Film Noir. Didn't suit it at all. And then there was Tish's narration, it definitely didn't fit at all. It definitely sounded like it was ripped from the pages of the book, and not at all the words of a 19 year old girl.\nThe trailers seem to sell this as a movie about a couple going through difficulty with the fiance being in wrongfully jailed. Well, that part of the movie just doesn't really work, because of the overall lack of focus of the film - is it about the couple, is it about justice, is it about single mothers? The whole setting up of, and keeping Fonny in jail, felt overly contrived, not realistic.\nThe fight at the beginning of the film between the two sets of families is also forced. Let's just have a scene of sass talk, even though it was already hinted to the audience that there was already tension between the families. What did they expect?\nSorry, but I think you should skip Beale Street if you're looking for a film with engaging characters, good pacing, and a good story arc. Not this disjointed, snail paced mess.","user":"peeedeee-94281","rank":[172,272]}]