[{"title":"Music lovers and movie goers rejoice...","rating":9,"date":"27 July 2018","review":"Hearts Beat Loud is one of 2018's underrated feel-good movies. It's musically-driven, character-driven, and tailored by Nick Offerman's stirring performance, proving his worth as an engrossing leading man in cinema. Regardless of its familiar set-up, I was charmed and engaged throughout. It's a sweet and soulful slice of life.","user":"sirwillisiv","rank":[32,41]},{"title":"Hearts Beat by Push","rating":6,"date":"30 June 2018","review":"I managed to catch this at a screening at the Edinburgh Film Festival. It was one of those bookings I took a risk on and knew very little about it apart from the fact Nick Offerman was the lead.\nFirstly this is a family focused feel good movie with a musical theme. If that doesn't sound like your thing then its not for you. \nWe have Nick Offerman looking like an angry old owl who is a widower and has a musically talented daughter, Sam played by Kiersey Clemons. Sam is preparing to leave for medical school and her father is featuring less in her life as a result. The father and daughter make music together for fun, hence the musical content of the movie. Sam has also just started a same sex relationship with an artist, so we have a three way love tug of war centring on whether the daughter will leave her new love and father behind, just when the family band have a possibility of commercial success. That is all you need to know without giving any spoilers. \nWhat I did find interesting and authentic was the fact that they paid a fair bit of attention to the music making process, which as someone who is interested in this kind of thing is a bonus. We see them use MIDI keyboards, effects pedals on guitars and what also must be the first time Abelton Live and Push have been featured in a movie. Which is interesting in itself as the style of music played is not really the electronic kinds you would associate with Laptop driven music.\nThe weaknesses I found in the story were funnily enough around the use of the internet, the main character is savvy enough to record and supposedly master (we never see this process) then upload his music to Spotify, but hasn't cottoned on to the fact he could be selling his music stock online as well?\nThe music featured in the movie is basically Eno-esque indy pop by the family band with a bunch of other guitary indy type fodder. How much the music means to you will be down to your own tastes but music does feature heavily especially towards the finale. \nHowever as a feel good movie it definitely hits the mark and at no point during the movie did I feel a cringe or feel the story was becoming too sentimental, which is usually the case with these types of movies. \nThis is an easy to watch movie and a rare exploration of the father daughter dynamic within a mixed race family over a shared love of music.","user":"torrascotia","rank":[23,30]},{"title":"That rare feel good movie","rating":7,"date":"4 November 2018","review":"Feel good movies are pretty rare these days - you mean it isn't a comic book movie, mainstream comedy, or Oscar contender? This movie is none of those things. It is just a simple story about a dad, a daughter, and a record store. You know the whole plot just by watching the trailer, honestly...but you should watch it anyway. Offerman and Clemons absolutely shine. They manage to make this story feel real without ever becoming cliche. If you are not smiling in the closing scenes, if you are not thinking back to your own farewells, well, something might be wrong with you. It will not give you chills. It is not groundbreaking. It has some plot gaps. But it is a feel good movie. And I felt good.","user":"cliftonofun","rank":[8,9]}]