[{"title":"Don't waste your time...","rating":2,"date":"18 July 2019","review":"I love Retro Video Games and was excited to watch this movie... Unfortunatly, this movie is very slowly paced and packed with pointless interviews... so boring!","user":"flyingsaucer-854-641566","rank":[2,2]},{"title":"retro console nerds united","rating":3,"date":"2 July 2018","review":"This is a collection of interviewed collectors and retailers of consoles and their games. they go into which games that are rare, mostly nintendo nes. they go over how they collect them and how long they've collected them.<br><br>they talk about finding out other collectors which becomes their friends.<br><br>they also go by nintendo nes how many units was released and how many is left. one game was offered at 800 usd which later was as much as 5000 usd.<br><br>where this documentary fails is when it takes the steps and become biased about resellers of games. now the tight community spills their guts out telling that it's not right pricing and that they should follow the scene and have decent prices. however this is a free market buy it or shut it.<br><br>this is so bad that they go through most of them, say 98% saying it's wrong while others say it's okay and easier to find / buy.<br><br>i myself collect commdore 64 items, i paid way less than it was worth just to benefit from reselling it when / if i wanted too.<br><br>i actually know at least one guy in sweden which has a normal job but makes most of his money buying retro games and consoles and then refurbish and / or make them look nice and sell them more expensively. <br><br>+ showing that that there is a scene doing this and preserving a piece of history.\n+ some collectors have even a \"spare\" of the actual unit they already own. \n+ they enjoy the games and show other peoples and their own family.<br><br><ul><li>biased at resellers.</li><li>most \"collections\" is nintendo nes while they show most other systems as well.</li></ul><br><br>it's also in show and explained that this can be a ocd occurrence. <br><br>i'm a techie and a bit of a 8bit nerd with interest in most systems even if i don't collect everything. i do appreciate this but it could have been less biased or at least go through most systems as well not just focusing on nes.<br><br>i have seen at least 3-4 of the retro youtubers before in they're normal retro\nhabitat. it is genuine but i think at this state it will only benefit people that has played / lived prior to playstation 1.<br><br>most of them say this is more or less an addiction and that they want to hold on to it.<br><br>for anyone from 1981- with retro roots will like it.","user":"stefankarlssoncom","rank":[4,8]},{"title":"Boring and elitist","rating":2,"date":"23 February 2019","review":"Very boring talking heads documentary. You completely lost me with the \"re-sellers\".","user":"tobyfrisch41","rank":[2,5]}]