[{"title":"MISUMISO: MANGA YOUNG PSYCHOTIC LOVING!","rating":6,"date":"13 October 2018","review":"\"Liverleaf\" (2018) directed by Eisuke Naitô based this story on a teen dystopian view on \"bullying\" and angst. The film is a cinematic interpretation of the manga comic, \"Misumisô\" by Rensuke Oshikiri. The main target of the bullying is focused on \"Haruka Nozaki\" (helmed by Anna Yamada) and her family in a nondescript small town.<br><br>Naitô stays true to the type of overtop violence found in Japanese graphic novels. Most of violence was filmed in a stylish manner, even to the clothing and injuries endured onto the teen characters.<br><br>\"Liverleaf\" or \"Misumisô\" refers to a beautiful purple flower that blooms in the winter landscapes, which why many outdoor scenes were in amidst the social snowy landscape. Nozaki's revenge on her bullies starts to toil when a snowstorm appears.<br><br>Teen actors were good at delivering psychotic behavior, like the character, \"Rumi\" played by Rena Ôtsuka. Aside from the celluloid teen assaults, it is a teen love story, or stories. As the film proceeds to a dwindling number of teen survivors, there are plot discovery of a triangle appears.<br><br>I had viewed it at an international film festival where most of the viewers were starting to laugh when the violent scenes came up. I feel that their laughing was to deal with the on-screen gore; I would think that Naitô would please to see these reactions.","user":"babyjaguar","rank":[4,4]},{"title":"Blood and snow","rating":5,"date":"23 January 2019","review":"I haven't read the graphic novel on which this film is based so I am judging on its own.<br><br>The film contains the usual Japanese-style over-the-top bordering psychotically cruel bullying. Until one day the little cretins tormenting main character Nozaki cross the line and payback time comes around.<br><br>While the movie is graphic and gory enough to prevent a slip into boredom, viewers not used to Japanese cinema will have to really grit their teeth to stick with it, as the characters' reactions to violence and pain is characteristically Japanese: whether poked, prodded, or stabbed, they react with mute astonishment and passive inaction. Who stands and screams when they know they're next up on the chopping block? Answer: only people in Japanese movies. The only thing that saves it is the unrestrained gore.<br><br>But even the bloodbaths in the movie don't prevent it from testing your patience. At this running length, it really overstays its welcome. I had to repeatedly jump through snooze-inducing parts where a character is walking in the snow or reminiscing over good old times or just having a pointless conversation.","user":"Der_Schnibbler","rank":[8,12]},{"title":"A bloody revenge movie with a neighborhood twist","rating":9,"date":"13 June 2019","review":"Japan horror movies never been associated as ordinary. They came with a sense of twisting mind and often involved violence in blood, graphic, and some others in stylized way. Liverleaf follows an easy narrative that has been implemented in numerous revenge horror movies, with some twists to give some depth unlike Hollywood movies in that subgenre (ex. The Last House on the left, I Spit on Your Grave).<br><br>Liverleaf told a revenge story from a bullied teenage girl named Nazomi when her family is burned alive in their house. The story takes simplest of premise you could take, but in 2 hours of the movie, this movie also give the characters a story, something that seldom happened to a revenge film. The humanization of the characters, including the homeroom teacher's odd behavior, the silence of a girl who just witnessed the bullying, and the backstory of some bulliers, reveal much about a life full of hardships in the small town. Some of them are quite petty, but the backstory gives a sense of reason to the plot. Honestly, some of them are quite forced, because at the same time it feels weird to know that the class is filled by corrupted minds. Who must take the blame? This question probably can't be answered correctly by us, or by the characters.<br><br>In a way, this movie gives a new fresh addition to a revenge story. Sometimes it is good to have a revenge movie that only involves blood, but I never expected that gives a prolonged sequence of background gives a reality and reason that I never know needed by the subgenre.","user":"daryopeek","rank":[2,2]}]