[{"title":"an auspicious discovery of a new Japanese auteur in the vein of Hirokazu Koreeda and Naomi Kawase","rating":8,"date":"5 April 2019","review":"Emergent Japanese filmmaker Ryûsuke Hamaguchi, after his international breakthrough HAPPY HOUR (2015), is welcomed to Cannes' main competition for its follow up ASAKO I &amp; II, an adaptation of Tomoka Shibasaki's 2010 novel.<br><br>The story traces a threadbare template of a young woman Asako's (newcomer Karata in her first film) internal struggle between two men Bako and Ryohei (both played by Higashide), who look just like each other but equipped with polarized personalities. After a prologue setting in Osaka, delineates the evanescent passion between Asako and Bako, the meat of the story relocates Asako to Tokyo, two years after Bako vanishes from her life apropos of nothing, she works in a coffee shop and bumps into Ryohei, a sake company salaryman with an uncanny resemblance of Bako, only, Ryohei turns out to be a gregarious, straight-arrow type that is nothing similar to Bako's enigmatic, ethereal insouciance.<br><br>Initially shocked to her core, Asako is gradually won over by many virtues Ryohei exhibits and after a tentative consent of his courtship, their wavering commitment is significantly cemented by the Great East Japan Earthquake in 2011, 6 years later, the present day, they are still together and Asako truly grows into a deeper affection to Ryohei, but a reunion with Hayuro (Itô), her best friend in Osaka, augurs the ineluctable re-entry of Bako, now a celebrated heartthrob, into her life, just after she comes clean her relationship with Bako to Ryohei (who confesses that he has divined a thing or two in the past years) and gallantly waves adieu to that seemingly closed chapter in the life, when the crunch comes, her impulsive reaction betrays the complexity of her id, after a dreamlike nocturnal driving on the highway with her knight in shining armor, she comes to a sudden awakening, and has a daunting job to win over Ryohei's heart again, or maybe not, Hamaguchi imbues a realistic spin in their final shot, both looking right into the camera to their indeterminate future.<br><br>Conceptually and thematically evoking Ozon's DOUBLE LOVER (2017), plus as its English title reveals, ASAKO I &amp; II, Hamaguchi's conceit actually zooms in on Asako's dual oscillation (the idealized versus the realistic version of her affection) rather than on his literally doubled male protagonists, but through Karata's passive gaze, quiet performance and greenness, that oscillation is all to well buried underneath whereas Higashide lights up the screen with his compassionate incarnation of an ultimate good guy unfairly taking the short end of the stick in their lopsided relationship, thus the twofold revelations come off as a shade over-dramatic albeit Hamaguchi proves to be a superlative raconteur, it is not an easy job to weave a banal love triangle into an organic entity of compelling watching, and somehow, he manages that with great distinction, especially by conducting a tooth-comb of the narrative arc through supporting characters.<br><br>Apart from his gazing-at-the-lens MO (Asako, first meets Bako, then with Royhei in two Shigeo Gocho's SELF AND OTHERS exhibitions, tacitly carries off the parallels), Hamaguchi also struts his stuff with an aptitude with lights and scenic composition, betokened by the gradation of sunlight shadowing the rain-dappled field in the aerial shot near the end. All in all, ASAKO I &amp; II is an auspicious discovery of a new Japanese auteur in the vein of Hirokazu Koreeda and Naomi Kawase, that is something every cineaste should extol!","user":"lasttimeisaw","rank":[9,10]},{"title":"Two Jerks and One Nice Guy","rating":15,"date":"15 September 2018","review":"I thought this movie was about a selfish jerk and two nice people. Late in the movie, we learn it's about two selfish jerks, including the title character, and one nice person. One bright spot: Masahiro Higashide was wonderful.","user":"cookstevend","rank":[7,9]},{"title":"My heart is broken to see one character betrayed.","rating":7,"date":"22 November 2019","review":"Baku, Asako's ex-boyfriend, is indeed a heartbreaker.\nWho fell out of touch with his/her bf/gf for YEARS?!\nThat's unacceptable &amp; already means he/she broke up with his/her bf/gf.<br><br>I really enjoyed it when Ryohei checked how tapirs look like on his smartphone after hearing that Asako said \"Baku\" (meaning \"tapir\" / Asako's ex-boyfriend's name) to him, and angrily said: \"I don't look like them at all!\"\nI watched this part twice &amp; it cracked me up twice!<br><br>Asako &amp; Ryohei are gonna get married, but Asako dumped Ryohei right away when Baku came to take Asako away! What? So she's a heartbreaker, too. I don't like Baku &amp; Asako.<br><br>Asako seemed like she's so sure about her decision that she wouldn't regret it &amp; threw away her smartphone; however, she regretted it &amp; thought \"Baku is not Ryohei.\" Huh?<br><br>It feels so good to see that Ryohei told her to get away after she dumped him for Baku; however, he still let her get into the house at the end.\nMy heart is broken to see Ryohei betrayed.<br><br>The actor who acted as Baku &amp; Ryohei is amazing!\nHis acting made me doubt if Baku &amp; Ryohei are acted by the same actor.\nAfter I checked online, I learnt that both roles are acted by Masahiro Higashide.","user":"bleach-finish-top-250","rank":[2,3]}]