[{"title":"Awesome","rating":10,"date":"22 January 2018","review":"The story is clear and emotional. The CGI is really exciting and Jung-woo Ha did a great performances.The ending makes me want to cry. Great movie.","user":"justinc-88291","rank":[36,47]},{"title":"A touching film","rating":17,"date":"17 January 2018","review":"This film tells the story of a firefighter who dies while saving a girl in a fire in a skyscraper. He is led by three grim reapers who guide him through the seven trials in the Afterlife.<br><br>The story initially is predictable, as he breezes though the initial trials. Then the film gets increasingly engaging and captivating. The final trials are not predictable anymore, and there is much suspense. The visuals are great, and there is clearly a lot of thought going into the visuals. The ending is very touching, particularly when viewers understand the Oriental culture about filial duties. Lots of tissues were used in the cinema!","user":"Gordon-11","rank":[25,32]},{"title":"A film to make you review your own life...","rating":7,"date":"4 June 2018","review":"Hmmm, this was interesting on an entertainment, psychological and spiritual level. This is one of those films you're either going to love or hate. I loved it, and the Koreans obviously did, as well, as this film is currently the second highest grossing Korean film in history. I found the story a bit lame comedy-ish at first, but as the film progressed, it became much deeper to the point where it became very emotional. This film will make you dig deep into your inner soul, analyzing your own life in the process. I loved the underlying themes and how the protagonist's life unfolded through back flashes. Blasphemy issues will no doubt be raised by some religious people, but I found it all very relevant.<br><br>The visual effects were interesting, as well. Some scenes were very obvious blue screen imagery, while other scenes were absolutely incredible. I really enjoyed the protagonist's brother's back story, who was buried alive (believed to be dead) and then becoming a vengeful spirit. He wrecks the most amazing mayhem during the fantastic climax scene and the visuals here are simply awesome! This is a film I'll watch again and again.","user":"paulclaassen","rank":[6,6]}]