[{"title":"More like a 2nd generation Woody Allen awkward movie","rating":3,"date":"14 December 2019","review":"The non-stop blah, blah, and blah of all the characters in this movie is just like what we used to see and hear in every Woody Allen's movie. The leading role as a entry-level apprentice-like young professor in some New York college got everything mixed up, teaching career, his job security, his popularity in the class, his relationship to all of his family members and his temporary lover, his this and his that, everything related to him seems suddenly turn into a situation so embarrassed, so difficult and so hard to deal with at the same time. \"Blessings never come together, disasters always strike at the same moment\", this old Chinese saying is exactly what we see in this chaotic movie. But do we need this Woody Allen's New York episode in the 3rd kind? Why all the stories happened in Big Apple always tasted so rotten and so despair? Why anybody in this big city always has to deal with these kind no-big-deal or way-too-big-deal craps all the time. The people who claimed themselves New York proud, privileged residents are actually struggling in a harder situation like people living in San Francisco or San Jose, high rents, high living cost, everything so expensive, but does we need to see or hear more of these craps? Do we need another Woody Allen styled and formulaic movie with mouthful blabbering? The answer is NO.","user":"Bad-Good-Great","rank":[10,19]},{"title":"Confusing at best","rating":3,"date":"8 December 2019","review":"Josh, a part time writing professor, must juggle his life between; a disgruntled student, his very strange girlfriend, his estranged relationship with his father, his dying grandmother, his do nothing brother, and his odd mother.<br><br>This story jumps from one scene to another and even though Josh is the connecting character throughout, nothing seems to jell into one story. At movies end I still felt the story wasn't finished.<br><br>Plus there are some comedy scenes that just do not make it to the comedy level.","user":"cekadah","rank":[10,22]},{"title":"A master class in understated honest family drama and believable characters","rating":8,"date":"7 December 2019","review":"I was a little worried by the low score of this movie and the one positive review, but I always like Justin Long and the trailer looked good.\nThe director and or actors obviously have some people who dislike them regardless of their output as this film is an expertly written and performed piece of film making that hits on many levels. If you're rating this a 1 like 20% of the voters then you didn't watch the movie and your vote is a personal vendetta of some kind.<br><br>Anyway, on to my thoughts on the film.<br><br>This was a really moving and entertaining look into the lives of a family we can all relate to around the last days of their loved Grandmother (Mother, Great Grand Mother).<br><br>The acting was exceptional, and for anyone who hasn't yet been through the passing of a loved one passing from old age and general body failure, this is exactly how it goes. The film dealt with and touched on so many details of it, it felt real, human and heart felt. My eyes welled up a little but I think I'm just tired, or there's some dust in the air, or something.......\nBut it wasn't dealt with a some sad tear jerker of a movie, it was simply a slice of this family's life and the movie centered around well formed characters with well formed personality quirks and importantly some insights in to the difficulties of modern life.<br><br>I did really like Justin's predicament as an impassioned professor trying to engage his class in the good old 60s/70s movie way, and how that back fired because of the world we now live in.\nAnd there was humor through it all, it was always funny even when it was about the sadder moments, what a fantastically well balanced and enjoyable movie this is to slip out without any fanfare.<br><br>This movie is really a 9, but I thought if I put that in my rating you'd think I was one of the film crew hyping a rubbish movie. This movie is so not that, it's a masterfully written acted and edited work of modern film making that perfectly hits its mark for all of its 93 minute run time.<br><br>I'll be watching out for the directors next movie and it's great to see Justin is choosing his projects well. Also good to see Fran Drescher doing a great straight role. Wasn't expecting that. She was perfect. They all were.","user":"Rob-O-Cop","rank":[10,25]}]