[{"title":"Excellent Creep-Out, But You Must Understand Slavic Mythology","rating":8,"date":"24 October 2019","review":"Let's start with the badly translated title. Where's the mermaid? There isn't one. The title character is a rusalka, not a mermaid in any western understanding of the word. Rusalki are the damned souls of girls who commited suicide by drowning, typically because they were pregnant out of wedlock and abandoned or rejected by the father. Such a girl becomes a rotting half-fish, half-woman, hideous in appearance, inhabiting ponds and rivers (not the ocean), who tries to lure young men to their death. They can shape-shift to appear beautiful or take the form of a living person. They are vengeful, evil, capable of sorcery, and dangerous. Don't think Ariel in a clamshell bra. Think carp zombies.<br><br>There. Does that help?<br><br>Marina is engaged to Roma, a competitive swimmer. Roma and his sister Olga lost their mother at an early age, supposedly to drowning. But as you see in the opening scene, she was actually killed by a rusalka at their lakeside dacha (summer house). The widowed father, who has had at best a distant relationship with his children ever since, unexpectedly gifts the dacha to Roma and Marina as a wedding gift, telling them to sell it and take the money. Instead, Marina wants to fix it up and keep it. But the rusalka has not gone away, and now casts her eye on Roma...<br><br>Visually, \"The Rusalka: Lake of the Dead\" (to give it its proper translation) excels. It is rich in old-fashioned atmosphere: mist on the lake, moon through clouds, candlelight in the old banya (wooden sauna), a lush Russian forest.<br><br>Contrary to what some reviewers found, the storyline is perfectly coherent. There are a handful of cultural references that Russians will understand but are not explained for the benefit of westerners (such as a shout-out to Karamzin's \"Poor Liza\").<br><br>But these do not pose a problem as long as you understand that a rusalka is not a mermaid.","user":"mydad2","rank":[11,12]},{"title":"Great movie, sadly with some big flaws","rating":5,"date":"16 December 2018","review":"The movie is based heavily on the Rusalka, the Russian fairy-tale version of a mermaid. They often are unmarried women who commit suicide and drown their victims or tickle them to death.<br><br>Sadly no one is tickled to death in this movie, but it is very accurate in its depiction of Rusalka.<br><br>The acting is above average, and the casting choices are great. The main actress Viktoriya Agalakova, is very convincing and emotional. I also love the casting choice for the \"mermaid\". Sofia Shidlovskaya has an ethereal air to her and every time she is on the screen without some weird CG effects, she is convincing. The \"bride\" in one pivotal scene is very distracting in her bland and emotionless acting and sadly badly voiced as well.<br><br>The voice acting in general can be a little bit distracting, especially with Romas best friend Ilya, who has a stereotypical bully voice which does not fit his character in my opinion. Other than that exception the English voice acting is solid.<br><br>Now to my biggest gripe with this movie: the CG and storytelling.\nThe CG is simply terrible. It would have been much more effective to do only a bit of SFX make up reminiscent to the movie poster.<br><br>The worst mistakes are the completely unnecessary jumpscares. The movie does so well to build up tension and atmosphere through its great direction and pictures, but simply ruins it with every jumpscare thrown in your face. This movie did not need any of them to be a dark fairy-tale.<br><br>The script had a lot of potential. It has a solid ending and takes up points made throughout the movie to tie them all up in the end, like Marina jumping into the water to save Roma or hair having special powers. I however, do not like how the movie was structured. We \"beat\" the mermaid far too many times with several red herrings throughout the movie, before her curse is eventually lifted for good. It's a shame these mistakes weight so heavy while the rest of the execution of the movie is great","user":"Finfy","rank":[7,7]},{"title":"Where is the mermaid??","rating":7,"date":"1 March 2019","review":"The movie had a mythology that could be more explored, but moves on without explications, hide too much the \"mermaid\" and she don't scare as well, although, had some technics that works pretty great, the characters aren't explored and some times stay boring, the twist in end is ok, and the song of the credits is amazing!","user":"nethy-nho","rank":[5,6]}]