[{"title":"As lame as it gets","rating":3,"date":"26 February 2019","review":"I was exited for this movie for a long time, but when I finally watched it it turned out to be a great disappointment. Both actors and their characters are bland and one dimensional, you really don't care if they have their threesome or not. The storyline has no point, the characters just stumble from one scene to another and there are literally 14 scenes in the entire movie and 6 of them were in a stupid car(yes I counted).<br><br>The message that this movie wants to send to the audience is that its OK if a woman cheats on a man, he just got to suck it up and love her.","user":"Greevas","rank":[10,19]},{"title":"It Makes A Full Recovery","rating":7,"date":"15 June 2019","review":"After an awkward opening this film takes a funny turn, plot and dialogue. There's some really good laughs and poignant moments that make it worth a watch. Just be patient, and it will work itself out.","user":"EggOrChicken","rank":[3,6]},{"title":"a bit corny","rating":7,"date":"5 February 2019","review":"The unicorn really delves with an issue that many couples have considered ( as a triage when the wed is dedd in the bed) ,thought of, played with or simply not liked it at all. and i am also quite sure that many couples have had or will have or get the opportunity to have the discussion of or quarel about or even just get the chance to dive into a menage a troix or threesome or trike or triathlon or cross country or whatever. its volvo kosher avekmoi cissoir on the menu, you can choose between bbg or ggb, or ggg or bbb if your lgbtq. and then you can start deliberating, and i guess thats the worst part.<br><br>and this film gives 90% of the answers and prblematic issues connected to this bodyclustering phenomena. its not overly funny acted, but it gives a vivid insight to the term. the main actors are very truthful in the act, a less experienced actor wouldve shown all the signs of discomfort gig(-olo)ling away the dollars in repetetiv shoots of laughter, so well done.<br><br>the language spoken here are pretty rude english, the f-word are commonly used,and it sort of breaks the ice,else the writing are good,so are the plot and the cinematography. great use of deep and shallow focus,that carries the story a level higher than usual. its also very colorful in the costumes make up and props, and delivers till the end.<br><br>shall you try it out too, well then ask henry first,and thereafter do take the advice from the grumpy old man, still married even without a treesome, cause he recommends it","user":"ops-52535","rank":[9,32]}]