[{"title":"It took me a while to figure out what was missing from the film","rating":6,"date":"24 January 2018","review":"I gave it a 6 mostly for the concept of the film and the atmosphere which was really great but when the movie ended it still felt like something was really missing and I couldn't pinpoint exactly what it was until a few hours later... It was the actual detective work.<br><br>Before the film started my greatest question was how the hell is he going to solve any mysteries without his super powerful bat-computer and I was looking forward to see how it will play out. It turns out there was little to none of that detective work and the Bat figures out who the killer is by pure luck and nothing else, which is really a shame for the world's greatest detective.<br><br>I did enjoy other parts of the movie, but, I cannot tell you what without giving any spoilers. You should watch it yourself and you will know what I'm talking about just don't put your expectations too high for the general outcome, it's definitely not a 10 or a 9.","user":"totalchaos7","rank":[51,63]},{"title":"Gaslighting","rating":7,"date":"7 April 2018","review":"Batman: Gotham by Gaslight: It is Victorian times and Gotham is looking a little Londonish. There is a killer afoot named Jack the Ripper stalking the streets. Also stalking the night is a masked vigilante known only as The Bat. Can Commissioner Gordon solve the cases with the help of his prosecutor Harvey Dent and Dent's millionaire childhood chum Bruce Wayne?<br><br>The Good: The greatest thing about Gotham by Gaslight is what it doesn't do. There are no Tesla or Lovecraft cameos. Nobody invents an airplane powered by a diamond. It is a realistic (relatively) style environment with people that act like people actually did back then (Guy in Bat costume excepted).<br><br>Gotham by Gaslight also finds proper roles for Batman's Rogue gallery and his allies. Commissioner Gordon, Alfred the Butler, and Harvey Dent keep their old roles. While other's get to put on a new hat. Hugo Strange is a progressive doctor running a psychiatric hospital and Poison Ivy is a vaudeville stripper. The movie has Batman in the role of Sherlock Holmes with focus on detective work rather than Bat punching. Selina Kyle (Catwoman) takes the role similar to Sherlock's love interest Irene Adler and three Robins (Dick, Jason, and Tim) take a role similar to the Baker Street Irregulars. It is a lot of fun seeing well-known characters in their new roles. The movie handles this quite well.<br><br>The Bad: Why is this an \"R\" rated film? There are some adult themes but neither Poison Ivy nor Selina Kyle shows any nudity despite some obvious story beats where it would have been expected. The violence is muted and the camera turns away from anything possible offensive. I have to think this us more of a marketing ploy (An Adult Batman Cartoon) rather than a reflection of the material. If you are going for an \"R\" rating and your story is about a serial killer that murders prostitutes it is not as if there is no material to work with.<br><br>In Conclusion: A Sherlock Holmes mystery with a Batman dressing. It is a good mystery that will keep one guessing. Characters are well written and voiced with Selina Kyle and Harvey Dent being standouts. Overplayed Victorian elements (see above) and overplayed Batman elements (Joker) are nowhere to be found. A good family film despite the \"R\" rating and an excellent treat for fans of the bat.","user":"juliankennedy23","rank":[12,14]},{"title":"Fun Alternate Reality Batman Story","rating":7,"date":"18 May 2018","review":"I enjoyed this animated movie it was a lot darker than usual batman stuff the fight choreography was pretty good and it had good cinematography an interesting story to boot i enjoyed the twist at the end. <br><br>Watch this if you like batman and have an hour to waste 7.5 / 10.0","user":"The-Big-Smelly","rank":[7,8]}]