[{"title":"Breaking In (2018)","rating":5,"date":"12 May 2018","review":"I do like whenever we get a home invasion/survival type film so I was kind of looking forward to Breaking In. The trailer didn't really look that great but I was hoping for an enjoyable time. Add the fact that this film was directed by the same guy who made V For Vendetta and you would expect something good. Unfortunately, this film is actually quite bad on a few levels. There was certainly a better way to go about this film and although the film's premise is simple the writer and director involved missed the opportunity with their execution.<br><br>The film is about a mother and her two children who drive up to her recently deceased father's house. His house is in a fairly remote area and once there they realize that they are in the way of four criminals who want to rob the fortune in the house. The mother's kids are locked in with the men, while she is outside and must find her way in to save her children from danger. The men definitely underestimate her ability to go the distance to save her family.<br><br>Gabrielle Union is an often reliable actress who gives a solid performance in this film. She has no real fault in this and is believable as a mother who has to save her kids. Everything else is bad. We don't really know anything about the strained relationship between Union's character and her father. What went on with them? What was his connection the the robbers? Nothing is explained well and things are left badly vague. The film is short (88 minutes) yet some scenes move at a complete snails pace. We see characters just walk around and look at things for minutes on end.<br><br>The film could have even used thrilling moments but doesn't utilize that either. The villains are cookie cutter and despite the premise of the film there seems to be nothing at stake. Its a really disappointing effort all around. I wasn't expecting a masterpiece but the stale and underwritten plot really dampens a film that should have been much better. This film is a bummer that wasn't really worth the time. I do want to see Union at the center of better projects though.<br><br>5/10","user":"rockman182","rank":[40,52]},{"title":"Give it a watch.","rating":6,"date":"28 May 2018","review":"I wasnt expecting too much from this flick. I went ahead and watched it because I'm a huge Gabrielle Union fan.<br><br>I was impressed with how there were small details about the aesthetic of the film that captured my interest. The small mundane font that was used for the opening credits made it have an indie film feel, which immeadiatley caught my eye. As the film went on, I could see how the dialogue was slightly disjointed but got to the point in a timely way. Union's performance was pretty awesome, just because she has such a command of the screen. She really personified that emblem of a mother trying to protect her babies. The writing of the film wasn't the best. That did get mildly in the way of the overall effect the film could've had. In short it was an enjoyable thriller/action flick.","user":"georgedurfeeiii","rank":[48,66]},{"title":"A WASTE OF TIME","rating":4,"date":"3 February 2019","review":"Imagine a suspense movie cobbled together out of other movies, only worse than any of them.\nYouve got this supposedly clever and resourceful woman.\nHer dad is whacked, and the first time she visits his house, its obvious there are WAAY too many security systems, that is, unless he's hiding some heavy stuff she doesnt know anything about. But does she call the real estate agent back and say, \"Uh I think my dad may have been into some heavy stuff I dont know about (which could be why hes dead) so we'd better hold off on selling this place awhile'? No; shes still gonna list it next week. Riiiight.\nRobbers come.\nIs it not odd that the small town pizza place on the phone does not notify the cops about a customer apparently being attacked on the phone?\nThe mom takes one of the bad guys prisoner.\nWhy not take him out with his crow bar?\nWhy does she not use his phone to call both her husband and the cops?\nWhy in the hell would a crook wear dog tags to a crime? But since he does (idiot!) why does she not seize his wallet and dog tags immediately? This would ensure one robber is ID'ed even if he somehow gets away?\nWhy does she not make SURE the knifey dude she runs over is DEAD? Take his weapon, at the very least.\nAt the end, same mistake again. Why does she not put at least a few shots in him after stabbing him, when there is a gun just a few feet away?\nWhen she stumbles into the room with all those security monitors, and realizes theyre monitoring her moves, why does she not smash them to remove any surveillance capability from the robbers, while she maneuvers around the house to save her kids?\nWhy are the robbers so unbelievably stupid, discussing their criminal info in front of the kids?\nWhy is the kids' father character written so unbelievably lame?\nWhy doesn't the director realize that holding a lighter an inch from gas soaked material would instantly light the fumes? You don't need to touch the material if fumes are present.\nWhy would the robber not know that discharging a \"firearm\" in a room soaked in gas (ie, full of fumes) would likely start a huge fire or possibly even cause an explosion?","user":"JoeMovieWatcher","rank":[32,44]}]