[{"title":"Indie short collection","rating":1,"date":"28 September 2017","review":"THE FIRST DATE is a weird black comedy that functions as a horror film at times. It's basically a collection of indie short films that are linked together by a framing device involving a woman going on a first date with a guy obsessed with collecting and playing short movies. There's no more plot to it than that. Unfortunately, the quality is very poor, as is the case with many indies, and there's little to no talent displayed throughout.","user":"Leofwine_draca","rank":[6,6]},{"title":"don't waste your time","rating":1,"date":"3 November 2018","review":"I completely agree with both the reviewers that gave this 1 star, and I'm sure, like me, they ONLY gave this 1 star because we can't give zero.<br><br>This had to be shot on a budget of maybe 100 bucks...and it was NOT 100 bucks well spent.<br><br>This \"film\", if it can even be called that, is an absolute waste of your time, has some of the worst acting I've ever seen in my 42 years on this earth, no writing to speak of, no sense of cinematography or awareness of HOW to actually structure a film (like seriously I've seen 5th grade school projects better than this--made by 10 yr olds), and I promise you, if you somehow talk yourself into watching this, you WILL be wishing you hadn't and wanting back that time you wasted.","user":"mcouillard-61316","rank":[6,7]},{"title":"Hey, let's buy a camera and a video editing program","rating":1,"date":"5 October 2017","review":"and then have people who have absolutely no acting talent whatsoever play around like they think they can actually act, in a multi-story montage that has no redeeming storytelling whatsoever. Then we'll use every option available in our video editing program and throw a bunch of crap together and then say we made a \"movie\". For good measure we'll get some wiz to write a glowing IMDb review because that works for all the big production companies, right? People are sheep and will believe anything that is written so rather then try not to be so obvious when writing that fake review we'll have it glow like Hiroshima. No one will know any better. Right? Wrong. This is a pile of stinking dung. Good thing everything is digital these days and nothing organic was destroyed for nothing in the making of this dung heap.","user":"reviews1958","rank":[8,11]}]