[{"title":"My Review Of \"The Demonologist\"","rating":5,"date":"31 December 2018","review":"Stelly's story is a well crafted \"fate of the world\" concept, rich with nior overtures and supernatural whimsy. Part cop drama, part graphic novel, all framed in an antihero origin story. It isn't a bad movie, the movie buildstarts up a nice story arch. The problem I had with the film is the lack of substance and depth. Scenes were chewed apart with pointless, predictable banter instead of material that would fully realize the charactet's situations.<br><br>The acting was mixed, some scenes were on point, even though the characters felt more two-dimensional. At times dialog was delivered over-the-top, or came off cheesy. The consistency was slightly off. I did like the overall concept that Stelly was shooting for with \"The Demonologist\" , I just think it would have came out stronger as an 8 to 10 short episode webseries.<br><br>The special effects are the typical supernatural CGI stuff. The practical work was real nice. Overall it reminded me of some of the stuff they did on 'Charmed' and 'The Librarians'. This isn't going to be a movie that most demon cult, supernatural horror fans are gonna get into, but it has its audience. Check it out but go in lightly and have fun.","user":"ASouthernHorrorFan","rank":[19,27]},{"title":"Falls flat.","rating":3,"date":"2 January 2019","review":"Being able to achieve a modicum of suspension of disbelief is crucial when watching horror and movies with supernatural elements. Here though, the characters are just unbelievable, they do not behave like any normal human exposed to the demonic/angelic would. And a blind medium/tarot card reader? Using a white \"seeing cane\" in her own living room? good grief that was just cringe.\nEven the cop on crime scenes is silly. The main character walks around with the actual evidence instead of photos of evidence? Yeah, that would happen.\nThe characters are 1 dimensional, and it is next to impossible to feel for them, even the fiance of the hero, you just don't care when she is in danger, it's really that bad as far as characters go. The dialogue is bad and cheesy. It's a shame really, it could have been good with a better director and editor.","user":"oddjrgensen","rank":[8,10]},{"title":"Don't","rating":1,"date":"1 January 2019","review":"This looked kind of good but whoa what a disappointment. I'll be surprised if you get through the fist half hour watching such bad acting before you have to quit. Just plain awful.","user":"jamiecalstock","rank":[13,19]}]