[{"title":"Fantastic Movie - Not Big Hero 6","rating":10,"date":"10 September 2018","review":"Aside from the film involving robots with feelings this is far from Big Hero 6. I love BH6 and this film is definitely up there with it. Some reviews below were rated poorly based on the main character Mai being an angry brat but that IS her character and if she made you feel that way then her job was complete. Her actions were intended to upset you and make you disagree with them so great job with that! <br><br>Those that said the film is too violent are just being overly sensitive. Look at all the kids films/shows out there that are just as violent, if not more - Power Rangers, DragonBallZ,Tom &amp; Jerry, TMNT, The Lion King, etc - Stop being so sensitive people. I thought Momo the dog was the highlight of the show. The beeping was hilarious and we don't really know what is being said, we're just assuming it was cussing but it really added a lot of humor to the film.<br><br>I really liked how the film depicted humans as being so dependent and addicted to the robots, much like how we are so addicted to our phones and other technology now. The animation was amazing, kudos to Tangent studios for a great job! Overall the film is fantastic for both kids and adults.","user":"benwang-34237","rank":[63,89]},{"title":"Amazing animation. Netflix is in the game!","rating":8,"date":"7 September 2018","review":"Next Gen is about a girl Mai who is dealing with a lot of anger issues after her dad left (Which is hinted that he died at some point in the film). Her mother has a huge affinity for robots while Mai cannot stand them because of how they are used against her and taking away any human interaction that she craves. When Mai comes across Project 77 (no he does not get a name in the movie) she is just as unwilling to trust this robot like any other, but when he follows her home she realizes the unique aspect of his design when he blows a small robot up. They begin to create memories together but due to damage that 77 sustained earlier he can only keep so many memories and must choose which ones to delete so he will not end up going into a system reboot. Through out his time with Mai he learns mortality and the concepts of love and attachment and how much Mai really needs him and other people in her life. All of this comes crashing down when the Robots development CEO Pin comes looking for 77 and you find out that he intends to destroy all human life. A huge battle ensues and 77 must give up his memories for Mai to restore his weapons system to fight the massive robot Aries. \nThis story is sad in so many ways. It shows Mai and her distraught emotions over her father leaving (and possibly dying) and her mom trying to cope through her love of robots and ignoring the problems with her daughter. It shows humanity is something you must chose and that our memories are priceless with the people we love. Everything about this movie was a win for me. The animation style was crisp and as strong as a Pixar or Disney movie I would even say that it exceeded DreamWorks animation in a lot of aspects. There is a vague similarity to big hero 6, but for me I feel this movie touched on a lot of better subjects and that the character depth was better on the main two characters than all the supporting ones. Where as Big Hero 6 felt like it had a forgivable villain this movie was facing it's own demons by creating a robot that thought everything should be perfect when humanity itself cannot obtain any level of perfection. \nI wish that they would have made more progress in the end with 77's memories being restored. I also would have liked to have a little more backstory on Mai's father and if he died or the funeral they went to was something else entirely? My complaints aren't very many, I'm excited to see what Animation Netflix comes out with next because this was an amazing start in my book.","user":"pmsingtiger","rank":[62,91]},{"title":"There is something here, brought down by an annoying lead.","rating":7,"date":"7 September 2018","review":"There is something compelling about making a movie that observes Man's ever more reliance of machinery to find joy and meaning into their lives. Mai's mother uses it to forget about her husband, others use it to enhance their entertainment factor or as a way to impress others.<br><br>The world building is pretty good, especially how robotics weaves itself into the future USA. As a marketer, I feel bad that we are going to bombard people with branding 24/7 to get them to buy our products. <br><br>This could have been a fantastic film if it weren't for such an self centered main character, who plays a selfish, petulant child nearly throughout the whole movie, treating her \"friend\" as a machine, blaming him and throwing guilt on it when it only has good intentions. There is something rotten about her soul, as she never learns her lessons from the pain she inflicts, whether it is being mean to her mom and causing a bully to cry, through most of the movie. <br><br>The robot character, 7723, is a much more compelling (although it is a low bar) character, someone learning human emotions but is a robot, similar to the Iron Giant, but he as long as he plays subservient to it's master Mai, it's growth is limited. <br><br>The movie somewhat redeems itself at the end. It could have taken the easy, Disney ending, but it took a bit of a smarter move, in the vein of The Iron Giant. It also helped redeem the annoying Mai who has to change from the role of taker to provider. However, by the time she learns her lesson, it is too late.","user":"CaZSuede-2","rank":[83,126]}]