[{"title":"Global criticism, good Spanish action!","rating":8,"date":"12 October 2018","review":"The movie takes place in Barcelona in early 20's. The movie begins with an espectacular what-it-used-to-look-like overview of the Catalan capital. The films is beautifully shot, and details are well taken care of, such as fashion, cars, street cars, building, decorations, and even the beginning of the construction of Sagrada Familia, however the director takes too much joy into twisting the camera. By the same token, some fighting scenes are confusing by the lack of stability of the picture.<br><br>The plot keeps the audience intrigued and lets them judge who the good guys and vilants of the story are.<br><br>What the movie puts unabashedly on the table is a social denunciation: who wants war and why.","user":"genesis_friends","rank":[31,41]},{"title":"much better than I expected","rating":9,"date":"5 November 2018","review":"Considering the current political circumstances, the plot setting is quite interesting. It doesn't state the righteousness as strong as we often experience in American movies. Actually, at the end people still stayed lost and the story didn't suggest a clear way out. But it makes the characters more plausible. At least you might feel the wiser way of being part of politics, is not to get yourself easily fomented by simple words and better to check more perspectives:)","user":"zhchb","rank":[10,13]},{"title":"Worth Every Minute","rating":9,"date":"6 November 2018","review":"This is a very good movie about how complicated the political and social situations were in Spain just after WWI. It is a lengthy movie (2hrs +) but every minute is worthy to be watched.<br><br>The story is quite balanced tho, it does not have excessive conversations or any other boring parts, so the length of the movie goes quite entertaining, some of it went into well-preformed action. Some scenes had some intensive situations and the crew succeeded in bringing it with precision and professionality.<br><br>All characters played their roles perfectly. Adding this to the excellent pictures and effects make one respects the efforts of the director Dani de la Torre.<br><br>I would like to watch it again some time, definitely! 9/10.","user":"eismoc","rank":[16,23]}]