[{"title":"Feels incomplete","rating":7,"date":"15 January 2019","review":"Movie feels very incomplete, The justice league is hardly in it, Superboy seemed to have daddy issues and gets very old. Superman comes back to life and feels very non surprising. Love it but has problems.","user":"Ultra_Collectibles","rank":[15,20]},{"title":"After a great \"Death of Superman\"... this is disappointing","rating":6,"date":"23 January 2019","review":"I am a huge DC fan but I prefer to watch Young Justice over this. It is boring and we know everything that is going to happen. Darkseid is not scary AT ALL. They destroyed his character. The writing is lazy...<br><br>Do yourself a favour and watch Young Justice instead.","user":"HassantakeR","rank":[15,22]},{"title":"Perfect Companion Piece to Death","rating":8,"date":"14 January 2019","review":"I saw \"Reign of the Supermen\", starring the voices of Jerry O'Connell-Scary Movie 5, Piranha 3D; Rebecca Romijn-The Librarians_tv, The Punisher_2004; Cress Williams-Black Lightning_tv, Code Black_tv and Rainn Wilson-The Meg, My Super Ex_Girlfriend.\nThis is an animated sequel to 'The Death of Superman' from 2018 and Reign will be released in stores on January 29th 2019. There was a double feature in theaters-Reign &amp; Death-promoting the video launch, so I saw both of them together. Just to refresh your memory, Jerry/Clark Kent/Superman was killed fighting Doomsday in the previous movie-Doomsday died too-and then Superman's body went missing. About 6 months later, Rebecca/Lois Lane is still grieving when 4 individuals show up claiming to be Superman. Cress/John Henry Irons/Steel is one of the 4. Rainn/Lex Luthor is still running his schemes in the background, trying to convince people that he is a hero, instead of that alien from Krypton that everyone worships. Which one of the 4-if any of them-is the real Man of Steel? What is their connections and secrets? If you have read the original comics, then you know. There are some pretty good fight scenes-as there were in the previous Death-and a few surprises, too. It's a perfect companion piece to the 'Death of Superman' so if you enjoyed Death, then you should like Reign as well.\nIt's rated \"PG-13\" for action violence and bloody images and has a running time of 1 hour &amp; 27 minutes.\nI enjoyed it and would buy it on Blu-Ray.","user":"stevendbeard","rank":[14,21]}]