[{"title":"Not worth watching","rating":1,"date":"11 November 2017","review":"Plot holes, bad actors, bad cgi, just stay away..<br><br>Horror.. no. Just about everything you can think of was wrong in this movie.<br><br>Summer &amp; winter same say...<br><br>Dad dies, no feelings.. All family dies.. but no drama.<br><br>No alerting the others... no way.<br><br>Just spare yourself.","user":"troxx","rank":[24,29]},{"title":"Not QUITE the worst film I've ever seen.","rating":1,"date":"24 November 2017","review":"Not QUITE the worst film I've ever seen - after all, it IS in colour. But it's pretty close. It's certainly the lowest IMDb score I've given.<br><br>Firstly everyone in the film appears to have some significant physical disability or disfigurement. The lead actress is suffering from some kind of lip bloat, so her face resembles an over-inflated deep sea fish. The lead actor experiences frequent epileptic episodes which the camera rather cruelly continues filming. Either that or he's under the mistaken impression that this constitutes method acting. One of the characters who is 13 feet tall seems not to possess articulated limbs. Or a neck. Or a spine. I assume he is rotated into position by a hidden platform operated by dwarfs.<br><br>The elf of the title is a small doll approximately the size of a man's fist, who wields a miniature knife the length of a sewing needle. Using this fearsome instrument he somehow manages to dispatch most of the cast in the movie. Possibly because they are handicapped by the weight of their lips or their inability to articulate their limbs.<br><br>I'm not sure. I fast-forwarded most of the film and then abandoned it. But don't take my word for it - knock yourself out. Advisedly during the opening credits.","user":"karlsaville","rank":[25,35]},{"title":"Probably the worst film I have ever watched","rating":1,"date":"21 November 2017","review":"Please avoid this movie at all costs. What can I say terrible acting, terrible CGI and all in all the worst movie I have ever seen. Unfortunately I had to give it 1 other wise it would not even get that. Please save yourself a wasted evening and watch something else, anything else just not this.","user":"joelkirsopp-349-820907","rank":[10,13]}]