[{"title":"An awful, awful, movie","rating":1,"date":"7 September 2018","review":"I love alien movies...I love zombie movies...put them together and it should be a home run for me! Unfortunately, it was not to be. This movie is horrible. <br><br>For starters, all the cool stuff is implied. Almost all of the movie takes place in one house. Couple that with really poor acting by 6 of the most annoying characters I have seen in a movie - for the first 32 minutes, they sit around a table being annoying, then after that they mostly run around and scream at each other - and you have a really bad story and a really bad film.<br><br>Technically the cinematography is bad - the shaking camera work nearly gave me a seizure. And what was with that continuous beeping in the background? Change the battery in the smoke alarm already! <br><br>Lastly, the script was clumsy and forced. I actually felt a little embarrassed for the actors.<br><br>If you're considering watching this, don't! Do yourself a favor and watch ANYTHING else...this is the worst movie I have seen in quite a while, and I am usually more accepting of independent films than most.","user":"Hajimoto0625","rank":[26,26]},{"title":"Frustrating","rating":3,"date":"22 September 2018","review":"Wasn't all bad, but there was enough to give this a low rating. The quality was quite good as low budget films go. The acting was ok at times, though it did seem to be improvised a lot.<br><br>I was frustrated as it had potential to be better. The topic of the film was to do with human anger, I think, but the constant shouting and angry confrontations between the couples got a bit annoying.<br><br>It didn't matter who they were shouting at, it just seemed everyone was angry. Sometimes for no real reason! Which I guess is human anger, but it was just too much.<br><br>The sound was quite bad. The dialogue seemed to dip now and again (maybe distortion caused by all that shouting!). The background noise didn't make sense, with police sirens going past and crowds shouting.<br><br>The worst part for me was this constant beeping in the house. It really ended up putting me off what the actors were saying.<br><br>With the sound issues and all the shouting, I really wanted to reach for the remote. I did watch to the end, which did allow me to see what the film was trying to say, but what an anticlimax. Or maybe that is the wrong word to use, as the last 5 mins was the most exciting part of this film. <br><br>If the rest of the film was left out I probably would have enjoyed it more.","user":"wolverine34","rank":[18,18]},{"title":"Guess what's coming to dinner?","rating":1,"date":"5 July 2018","review":"CJ (Eric Swader) and Nina (Katie Maloney) are at a dinner party with other couples as two of them are off to Boston. CJ is accused of having an affair with a co-worker which he vehemently denies. This puts a damper on the party and the audience must endure 24 minutes of boring conversation. The film takes place outside of Pittsburgh, known for mall zombies, but could take place anywhere as most of the filming is done inside one house, so the neat scenes on the DVD cover are not part of the low budget film. Something is going on as it appears there is some kind of attack on major east coast cities and Boston. <br><br>Very boring. Over hyped. <br><br>Guide:F-word. No sex or nudity.","user":"nogodnomasters","rank":[20,21]}]