[{"title":"We have a winner!!!","rating":1,"date":"24 October 2018","review":"This is it folks, the Holy Grail of \"Rafts of Balls\", a film so monumentally ghastly it will make your knees weep. I have to give it credit for achieving the impossible, it starts off badly, four unlikable nuggets on a road trip (AGAIN), being warned by the crazy local to stay on the trail (AGAIN), but then it manages to nosedive like a concrete pigeon,,, all the way to the ending, which isn't an ending, the film just sort of stops!!. Between the poor start and the film sort of stopping they have shoehorned in every cliché possible, they even come across a perfectly drawn massive footprint which one of them says must have been a bear, really!!, a bear with human shaped feet the size of canoes who hops around in the woods like a demented fur covered burglar. You have to watch this film, its a genuine life experience, much like being locked in a cupboard with a miffed gorilla, everyone should try it once. Hopefully enough people will see it for them to make a sequel, where a chicken with flick-knife terrorises a summer camp.","user":"jcallender121","rank":[13,14]},{"title":"Time to get a real job!","rating":1,"date":"24 October 2018","review":"Another one of Mill's disasters.\nTime to grow up and get a real job Jason.\nSaw your video on YouTube, \"How to make a movie for $1000\".\nNow I know why this movie is so bad.","user":"freeryde-97441","rank":[11,12]},{"title":"LOW BUDGET FLOP TRYING TO CASH IN ON A CRAZE.","rating":2,"date":"13 September 2018","review":"This film is just another low buget attempt to cash in on a topic of interest - in this case Sasquatch/bigfoot.\nThe plot is boring, the characters shallow and at times annoying to the point that you wish they would just die already, and the ending makes absolutely NO SENSE!<br><br>SPOILER ALERT:\nThough there is bloodshed and death, NONE of it is committed by the creatures.\nIN SHORT, DON'T WASTE YOUR TIME OR MONEY ON THIS GARBAGE.","user":"cn_warwick","rank":[7,9]}]