[{"title":"this is a soothing marvel","rating":9,"date":"8 November 2019","review":"Of a film, not very sensational, but an unimagineable rewarding one and a half hour of auditorial and emotional featherlike sweeps on your senses.<br><br>most of all i will praise the score, it is now shuffeled into my top 10 list of filmscores, its a relaxing floating hum in the background that gives the film the bouyancy to float all the way to the end.<br><br>the story is a kind of flashback told story, about a happy childhood that abruptly changes into something bad and unended. this creates a nightmarish life to the main caracter, who seeks back to her roots to make an end to her traits of life. i will not tell how its going, but just say that its interesting .<br><br>the story is a fine one, but the plot couldve been better sewn together, especially on the major transitions of the film.i think the director and editor mustve had a rush on their shoulders to finish this product, but that is the only flaw i can come up with.<br><br>for the dramaqueens and scoreseekers this is a hit in the bullseye, the grumpy old man were totally lost , and what remains is just a higly recommend.","user":"ops-52535","rank":[11,19]},{"title":"Inventive and well crafted story, Beautiful photography","rating":9,"date":"10 November 2019","review":"The best stories are those that lead the reader, listener or viewer in a way that mimics the unpredictable nature of life. Unintended does just that. Various narratives coalesce into a thread that cathartically resolves itself in unique and suspenseful circumstances. Writing, acting, cinematography and score all well done !","user":"cporzioshoot","rank":[8,13]},{"title":"Super Slow","rating":6,"date":"17 November 2019","review":"This is a really slow paced film. The story is a bit predictable but I felt the actors did a great job and the nature settings were really appealing. Had the pace been a bit quicker I might have given it a higher score. If you are planning to watch it just be prepared for a slow film.","user":"Foutainoflife","rank":[3,4]}]