[{"title":"classic HK movie!","rating":8,"date":"29 December 2018","review":"No one can deny how Chou is important in HK movie in 80s. You cannot imagine that he is actually an unimportant role in the whole story :)<br><br>It is not that kind of traditional police and gangster movie with only boom and block buster. The process of counterfeiting cash is also new to audience, at least to me! The mystery of \"painter\" is well worth discovering as the plots goes on. It is not simply about split personality as the usual movies, which is unable to finish a complete story without it. The ending matches \"counterfeit\" pretty well, given 90% of movies is talking about how they successfully cheat and hide.<br><br>The idea of the story is awesome! However, 2 points are deducted for ending. Don't know if it is for the reason to be on publicly for all audience. The final explosion seems unnecessary.<br><br>This movie still gives us hope as Infernal Affairs: HK movie is not dying.<br><br>Looking forward to the sequel! (I believe there will be)","user":"gwunlou","rank":[11,17]},{"title":"Worth seeing","rating":8,"date":"27 January 2019","review":"Hugely invested, super casting, the movie should have been a classic action film. The acting of Chow is beyond doubt fantastic. Aaron, to me, is the first movie that showcase his best actor acting skill. All his previous movie is lawyer or police officer. This role here as a villian gives him ample chance for applying his already matured acting ability. Female lead is not first line actress in television. But she is surprisingly able to carry her role quite well together with the 2 male superstar.<br><br>The plot of the movie is not in par with the super casting. The story in the first half is ok. But towards the second half the storyline is a bit loosened, losing the excitement that the first half is carrying. Scenes of killing are excessive and unnecessary. It is as if the killing scene is added only for the purpose of showing off Chow's previous hero role in movies. It is not in line with the original plot where Chow should never be caught.<br><br>Otherwise the film is on the whole above standard and worth seeing. It is my impression wherever Chow is present in movie, the movie would be biased towards showing off his hero quality. And hence the continuity of the story is destroyed ans unnecssary scenes are added. This is the cost of seeing Chow in movie.","user":"madbird-61243","rank":[9,14]},{"title":"A promising start but disappointing the rest of the way","rating":2,"date":"2 November 2019","review":"Seldom do you see a Hong Kong film spending so much time on explaining the technicality of something as specialized as printing fake money to the point it almost feels like a true story. Well, as it turns out, it is based on a true story. The true storyof Arthur J Williams, a Chicago man who grew up in a poor neighborhood and took on counterfeiting the new 1996 bill as a challenge because his girlfriend joked that he couldn't crack the security. The movie would've been great if it kept following the story of Williams, but it didn't, maybe because HK film makers didn't want to pay him millions of dollars to make his bio pic.<br><br>The fact that this movie took on the usual suspect's plot should come as no surprise for anyone who lived in the 90s. To me, it was a case of wondering how much crap this director can put in this film before announcing that big surprise at the end? Well, I got my answers by fast forwarding most of the armor vehicle heist, the Rambo in south east Asia scenes, and the ensuing love story. At least the cops-and-robbers part was a little bit more interesting but it was still all too predictable. And when the end came, the director decided to make it politically correct and not let the bad guys walk free, maybe that's the only way it can be shown in mainland China?<br><br>I feel this movie tried to be too many things at the same time and ripped off a great true story and made it into a mainstream action film. Apparently, Arthur J Williams' is negotiating with Hollywood producers for the movie right to his story. Hopefully the Hollywood's version will be more focused and hence more watchable than this film.","user":"asdfqaz123","rank":[6,9]}]