[{"title":"If only I could give it less!","rating":1,"date":"1 July 2018","review":"1 star is way to much fir this. I would support a decision by IMDb to introduce a Negative Star Rating.","user":"harley-de","rank":[18,25]},{"title":"Very BAD.","rating":1,"date":"5 April 2018","review":"God, this movie SUCKS! Bad FX. Bad acting. Bad everything. Michael Pare had a career in the '80's so I don't know what happened to him. Just avoid this TURD.","user":"davidross1058","rank":[17,26]},{"title":"It beats the pants of any of the Asylum movies","rating":7,"date":"9 April 2018","review":"This movie is much better then the 3.5 rating it has when I write this comment. Its certainly not a blockbuster, but I thought most aspects of the movie were quite well done for the budget. If you are a die hard scifi fan like me, then you likely have sat through lots of real stinkers. This was not one of them. Its clearl a movie on a budget, but its not one of those awful stinkers like Range 15 or Tasmanian Devils, to name a couple that come to mind immediately.<br><br>The name actor of the movie Michael Pare plays a character that brings to mind the type of real danger one is likely to encounter in a widespread disaster - a ruthless survivalist. Almost always most scifi movies portray survivalists as a bunch of yahoos or hillbillies. Pare's character is much more realistic - someone who is mean, hard and has no interest in anything but their own survival with everyone else potential prey. I have no idea how he ended up in a local (Alberta) Canadian production but the character he plays is exactly the sort of person you need to be wary of in a disaster situation.<br><br>As the movie did not have a big special effects budget it kept most of that pretty grounded. The cinematography and editing were professional, as was the sound.<br><br>I have never understood the economics of making a direct to dvd movie in the first place, but i think if your a fan of the disaster genre its worth a watch. Of course it has plotholes and some absurd circumstances, but then its a movie!","user":"wwaigl","rank":[11,21]}]