[{"title":"Very Much Within a Sub-genre of Polish Celebration Films","rating":6,"date":"4 October 2018","review":"Polish cinema has a history of films based around the family shenanigans that occur during Christmas, or weddings, or other major anniversaries and celebrations. Pitor Domalewski's feature sits comfortably within this tradition, neither breaking and blurring the boundaries of the form, nor sinking like a stone. It is first and foremost a drama, but like so many of these films, a little knowledge of Polish culture and traditions would key the viewer in to an undercurrent of rather aggressively dark comedy (a film like Smarzowski's WESELE, does this most explicitly). <br><br>Dawid Ogrodnik and Tomasz Zietek star as siblings in a rural Polish family, that has made a habit of burying as many secrets as they have stolen Christmas trees from the neighbouring forest. Ogrodnik's character has returned from Holland where he has been trying to start a new life with his pregnant partner. To do this he needs to sell their grandfather's property, so that he can put this capital into a new business venture, or at least this is what he tells his mother, father, sister and brother - nothing is quite as it seems. <br><br>There is a brilliant ensemble cast at work here, with the always watchable Arkadiusz Jakubik as their broken father, a man who is weighed down with the guilt of having been an absent and failed father figure. Agnieszka Suchora is the put-upon matriarch, who for better or worse, has kept her family together, even if it seems to have done very little for the health and happiness of any of its members. <br><br>Domalewski keeps things murkily mysterious at first, keeping the audience guessing as to just how far the rot has gone in this family. Yet as the vodka begins to flow a little more freely the film lurches into full-on melodrama, with some surprising revelations and some clunkily executed metaphors and motifs (especially surrounding Poland's relationship to the rest of Europe). Everything is well made, but for keen watchers of Polish cinema it will feel a little uninspiring, especially considering the talent that is on display. I am pretty certain that Ogrodnik's passages in English are going to be a calling card for more international roles for this exciting young actor.","user":"Marc_Horrickan","rank":[3,3]},{"title":"Don't put it in the comedy genre when it isn't a comedy! Thank you!","rating":5,"date":"24 May 2018","review":"I guess I have the honor to be the first one to write a review for this movie. I have a couple questions though. Why is this movie listed in the comedy genre? Because if one thing is for sure it is that you won't laugh, not once, unless I don't get the Polish humor. It's just a drama, a story about a Polish family at Christmas, with their issues and problems. My next question would be, why did this movie won awards in Poland? Is it really that good to you and is there really no better movies in Poland than this one? Because to me Silent Night was just an average movie, nothing to be thrilled about. The acting isn't bad, but nothing special either. It's one of those movies I just watch to kill time and that I will completely forget about it the next day. Maybe at Polish standards this is a jewel, I can't really compare since I think this was my first Polish movie, but honestly it's really nothing special.","user":"deloudelouvain","rank":[15,31]},{"title":"Not exactly a holly jolly Christmas","rating":9,"date":"14 November 2018","review":"The Polish film Cicha noc (2017) was shown in the U.S. with the translated title Silent Night. It was written and directed by Piotr Domalewski.<br><br>The movie takes place in a single day--Christmas Eve in a rural Polish region.\nDawid Ogrodnik portrays Adam, a young man returning from Holland to have Christmas with his family and his pregnant fiancee, Asia. During the entire film, Adam is talking to Asia on the telephone, promising to be with her soon. This in itself lends an edginess to to the movie. Ogrodnik is a good actor, and does well in his role as protagonist.<br><br>Adam's family is almost completely dysfunctional. During the day we witness alcoholism, spouse abuse, and violence. Then things get worse.<br><br>The opening and closing scenes both show us Adam riding a bus--to home and from home. The plot is what happens in between those bus rides.<br><br>The acting is excellent throughout--especially by Tomasz Zietek, who portrays Adam's younger brother Pawel; Agnieszka Suchora who plays Teresa, Adam's mother; and Arkadiusz Jakubik, Adam's father.<br><br>I have yet to see a Polish narrative film that wasn't grim. Silent Night is no exception. It's a very powerful movie, with a solid IMDb rating of 7.2. I think it's even better than that. However, I don't think there was even one frame in the film that would bring laughter. We saw the movie on the large screen at Rochester's excellent Little Theatre. It was shown as part of the outstanding Rochester Polish Film Festival. It will work well on the small screen as well.<br><br>Fair warning: This isn't a movie for a first date, and it certainly won't replace Charlie Brown's Christmas.","user":"Red-125","rank":[2,5]}]