[{"title":"Outstanding movie","rating":10,"date":"6 August 2018","review":"Watched this last night - absolutely stunningly directed, filmed and terrific acting, I found. Struggled a bit with the Argentinian Spanish and was very thankful for the English subtitles. :)<br><br>I'd love to hear from the people who are responsible for the comparatively poor rating (if I give it 10 and it sits on 6.8 there must be a few fairly poor votes) what they didn't like about it.","user":"andrej-groups","rank":[57,75]},{"title":"Such a great argetinian movie","rating":9,"date":"18 August 2018","review":"The narrative and the musical sequences are great. Every actor do a perfect job, Peter Lanzani and Lorenzo Ferro are the best of the movie.","user":"mauriciotoso","rank":[31,45]},{"title":"Nicely set and acted well... but let's remember these were vicious criminals","rating":5,"date":"29 October 2018","review":"In early 1970s' Buenos Aires, Carlos is a baby-faced teenager with a cat-burglary hobby, a taste for danger and little consideration for anyone other than himself. At reform school he meets older boy Ramón, and the pair soon start a campaign of burglary (sometimes accompanied by Ramón's father, a career criminal). These expeditions often involve Carlos shooting someone dead.<br><br>The film portrays Carlos and Ramón as loveable rascals, which is disappointing as they were, in fact, real people (the character of Ramón being inspired by a differently-named accomplice of Carlos). Indeed, according to Wikipedia, Carlos is the longest-serving prisoner in Argentina. The film does not glamorize the murders, but it seems unlikely the friends and relatives of their victims would appreciate the slayings of their loved ones being presented in such a light-hearted manner. It is also noteworthy that some of the pair's most awful crimes - the rape and murder of a sixteen year-old girl, for instance, or the attempted murder of a baby - are not included here - perhaps because they would not fit that 'loveable rascal' narrative?<br><br>Playing Carlos, Lorenzo Ferro is a taunting psychopath who seems fascinated as he toys with others as a cat does with a mouse. As Ramón, Chino Darín effortlessly smoulders and provides a nice cheesy turn when the fame-hungry Ramón appears on a television talent show. In the supporting roles, Daniel Fanego as Ramón's old lag of a father is icy without going over the top, and Mercedes Morán gives a fine example in slovenly wantoness as Ramón's MIL who Carlos refuses to F - possibly because he is more interested in her son.<br><br>Seen at the 2018 London Film Festival.","user":"euroGary","rank":[27,39]}]