[{"title":"There Always is a New Dish on the Way","rating":8,"date":"7 October 2017","review":"Guests at the Palacio resort in Cuba are encouraged to ask for anything. Mike, a gigantic single man who is on vacation from Quebec, takes them at their word. He soaks in the sun, floats in the pool, relaxes at the ocean beach and downs immense quantities of food. When anything is possible and the world of sadness and haste is forgotten, Mike is in no hurry to leave. There always is a new dish on the way. Fellow travelers and resort employees alike begin to sense mysterious power in Mike. Little miracles multiply in his presence; an octopus is freed from a net, a depressed young woman regains her appetite for life, desires are awakened and compassion becomes widespread. However, storms appear on the horizon and many wonder what Mike's purpose is, and if it is bad or good.<br><br>This unique, surreal and complex film explores human intricacies and beliefs. It unravels gradually like a wonderful puzzle. Its main character is extremely compelling. An intriguing central theme of the film (and a belief of many people) is that demons appear from anywhere, in any form and for good or ill. The actors play their roles well. The camera-work features a lot of interesting close-ups. While large budgets certainly do not guarantee a better film, that might be the case here. Overall though, a fantastic and absorbing film. Seen at the Toronto International Film Festival.","user":"Raven-1969","rank":[15,19]},{"title":"Eat, eat, eat...and then be eaten.","rating":7,"date":"24 April 2018","review":"A movie about an obese Bodhisattva who willingly descends the food chain of human suffering. This movie needs to be experienced in its own trajectory, so I'm not going to spoil any plot or theme lines. I will say, if you are going with preconceptions about what it means to be a Buddha (and how could we not be?), prepare to have them outraged and perplexed. This is a movie about eating and being eaten: Mike the Buddha does an amazing amount of the former and pays a steep physical price. His experience may be redeemed, however, because he is willing to accept the terms when it is his turn to become food in the service of his fellow sentient beings.","user":"davidhall-53921","rank":[4,4]}]