[{"title":"Not a comedy","rating":3,"date":"13 January 2019","review":"I don't remember laughing once. Good acting, bad story.","user":"bweber6","rank":[19,30]},{"title":"Long winded and trashy","rating":4,"date":"4 February 2019","review":"If you are a fan of the American Pie movies then you may enjoy this movie, if you were not a fan, you won't enjoy this movie. A lot of sexual references throughout, quite explicit in some scenes, very cringy at times, very anti-Semitism in some scenes which I don't normally notice in movies, unnecessary and high content use of swearing where it wasn't needed.<br><br>A long winded story that didn't evolve into anything. Quite trashy. One funny scene at the end which made me laugh, didn't laugh anywhere else within the movie, and just teenage drab throughout. The story could have been made better and funnier. I wouldn't watch it again. I kept looking at the timestamp to see when it would eventually finish. Had contemplated turning it off half way through, but endured it to the end. 3 stars as acting was okay.","user":"npjy83","rank":[14,24]},{"title":"Joey King Just Got a New Fan","rating":7,"date":"7 April 2018","review":"As a movie buff, I've seen Joey King around enough to know who she was before walking into this movie. But THIS role was seemingly made for her. From beginning to end, she did a phenomenal job.... effortlessly portraying Jamie.... a 16y/o girl whose rather blunt... (or RUDE - depending on how you look at it) grandmother revealed quite a few \"family secrets\" on her deathbed. A couple of which sent this otherwise normal family spinning out of control.<br><br>Various coming of age themes were explored (love, loss, virginity, sex positivity, friendship, growth, overcoming fears, fights with parents &amp; friends, unforgettable summers, etc) with just a little more bluntness and vulgarity than you might be used to... particularly coming from a female protagonist (this was a good thing... trust me).<br><br>The entire cast was awesome... they had great chemistry and there were several scenes that you could tell they had a lot of fun filming together.\nThis was a great coming of age film that I enjoyed much more than I could've possibly imagined. Great job to writer/director Becca Gleason... she nailed this one!","user":"moviebuffchick","rank":[23,45]}]