[{"title":"Resourceful Woman and Modern China Rising","rating":10,"date":"4 October 2018","review":"Qiao is cool headed, smart, responsible and resourceful; good qualities to have when your boyfriend is a gangster. When Bin, her man, gets into trouble, Qiao gets him out of it. She fades into the background when Bin needs to take the spotlight. Qiao even takes a fall for Bin when he needs her in a pinch. And that is when he forgets her. Qiao emerges from five years in prison to cold indifference. To Bin, it is as if she did not exist. \"People should keep their emotions in check\" Bin's new woman tells Qiao. And even China seems to have forsaken her. This is a land where cities are swallowed whole by reservoirs, and the dark water is rising around Qiao. But this ingenious woman is going to get her groove back and do what is right, Bin or no Bin.<br><br>Such depth and beauty to each element of this enthralling film. The cinematography is luminous, characters are fascinating, the story is not predictable, and bits of modern China are revealed for the complex wonders that they are. Depth is everywhere. Surprises are constant. Analogies are all around; tigers lurk in cages, a volcano looms in the distance, and a street performer picks out Qiao from a crowd and sings to her \"who knew I'd ever see you again.\" He speaks to her heart but does not know it. The actor who plays Bin has one expression in his bag of tricks, so he could have been better, but otherwise the acting is quite good. North American premiere seen at the 2018 Toronto International Film Festival.","user":"Raven-1969","rank":[46,55]},{"title":"A sprawling crime drama with strong performances and visuals","rating":25,"date":"25 March 2019","review":"ASH IS PUREST WHITE - Chinese Director Zhangke Jia's (A TOUCH OF ZEN) latest is a sprawling drama about a two-bit local hood Bin (Fan Liao) and his moll Qiao (Tao Zhao; the Director's wife &amp; muse). The first part of the story about their rise and fall takes place in the early 2000s and is the most purely entertaining with verve and visual impact, even if it covers a mostly familiar trajectory. We pick up the story several years later and the couple is estranged. Clearly the years (and a forced separation) has changed the individuals (especially Bin). The final section takes place in the present (more or less).\nASH is a longish movie (136 minutes), not just in terms of time, but, also how the screenplay unfolds over the 17 year period. The acting and details are spot on (Zhao is particularly exceptional), but, the story drags after the sparkling opening section. Part of this is by design, without question, however, ASH is an example of a movie with so many apparent endings that one loses interest, rather than gains it. And, when we come to the conclusion, it is neither fully satisfying, nor, more importantly, seems worthy of the additional time spent to arrive at it.\nStill, ASH is a decent drama with some considerable merits (a long hotel sequence is deeply moving). The performances, Jia's direction and Eric Gautier's (MOTORCYCLE DIARIES) cinematography (combining 35mm with digital) are its strongest suits.","user":"gortx","rank":[16,20]},{"title":"Tao Zhao: what a revelation!","rating":6,"date":"4 March 2019","review":"We follow the evolution and the misguidance of a mafia couple for a decade. With highs (classically: money, feeling of power, ...) and lows (to be discovered!). I did not know Tao Zhao: she plays perfectly","user":"FrenchEddieFelson","rank":[20,30]}]