[{"title":"what it's like","rating":6,"date":"8 August 2018","review":"Greetings again from the darkness. Since none of us enjoy our own relationship-gone-bad, it's kind of interesting how we can be drawn to just such a movie. Nate and Melissa's romance is crumbling ... or rather has crumbled. She has accused him of cheating with a younger woman, and they are surrounded by moving boxes as they finish break-up (not make-up) intimacy in the small Brooklyn apartment they've been sharing for 5 years.<br><br>Writer-Director-Producer-Actor Darien Sill-Evans stars as Nate, a DJ slash barber, who can never quite distinguish between what he should tell Melissa and the boys at the barbershop, and what he should keep to himself. He's a pretty typical clueless dude. Melissa is angry at him for cheating, and during their argument, a flashback sheds light on what really happened that night. Conflict and emotions fill the screen whether it's Melissa and Nate bickering, or Nate getting the treatment from his co-workers at the barbershop, or even Melissa hearing it from her friend and brother. <br><br>In his first feature film as a director, Sill-Evans does a nice job of establishing the lingering doubts that accompany the dissolution of a long term relationship. Fingers are pointed, accusations are made, and feelings of guilt are predominant. He uses additional flashbacks to deliver more insight into all of these characters, especially the two leads. Much of the dialogue seems yanked directly from real life, and the best is, \"I didn't cheat, I retaliated\". So much is said with those words.<br><br>There is quite a bit of comedy mixed in, though much of the time, it's the delivery, not the setting that generates the chuckles. Mr. Sill-Evans has certainly not delivered a formulaic Rom-Com, and in fact, the dramatic moments are the most powerful - shedding light on our flaws as human beings. Supporting work is provided by Jade Johnson, John Laster, Stephen Hill, and Chester A Sims II.<br><br>Opening with a streetside rant against racism, we hear some of the stupid things white people say during the gentrification of a neighborhood. Doug Simpson's music is spot on throughout, and though this one won't reach a mass audience, for an independent directorial debut, it definitely makes a statement.","user":"ferguson-6","rank":[5,9]},{"title":"dialoges too plastic & acting too unnatural for me to watch further...","rating":2,"date":"16 July 2019","review":"...than 10 minutes. I'm sorry, I was willing and with a good expectation but my suspicions that rose in the first barber-shop scene were confirmed enough, by the second scene(Apartment), to stop watching. Chester A. Sims II was mercilessly over-acting his part, rest of the cast was either quite okay or mediocre stage-over-acting. And at least as far as I watched it, the script had no natural feel whatsoever... sorry.","user":"johannes_engel","rank":[2,4]}]