[{"title":"I really felt for her.","rating":7,"date":"24 July 2019","review":"During this movie I found myself watching this woman, doing and taking it all wrong from the start. And as I was starting to judge her I couldn't help but feel for her.\nWith that being said, I cannot understand why they describe the movie as a thriller, for if it is, it must be a very light form of it.\nSecondly, it's never proven if she was followed or stalked by anyone, and if she was, it wasn't proven by whom.\nAnyways, good movie.","user":"noelpiriz","rank":[11,14]},{"title":"A forbidden affair","rating":8,"date":"7 October 2018","review":"An affair (En affære in Norwegian) is productive film maker Henrik Martin Dalsbakken's fifth film, and his best so far. The film really show his talent as a young film maker, and should be a festival hit around the world.<br><br>We meet the middle aged newly appointed sports teacher Anita (played by Andrea Bræin Hovig), when she meets a new class af 16 year olds at her new work place. She's been married for five years with a husband who have two grown up daughters, that both has left home. He travels a lot in his work, and leaves Anita to her own fantasies.\nAlready on the meeting with the class Anita is challenged by Markus, as he at her introduction, when she asks for their name and a fun fact about themselves, he tells he is well equipped.\nSoon afterwards she gets the feeling of being watched and followed. Soon messages and flowers start turning up, and a text message is answered with a shock message. This is the start of an affair they both seem to wish. A troublesome and forbidden affair.<br><br>The film is a drama thriller about going too far with a fantasy. As such it is done well. The film is both able to be creepy, cringy, exciting, as well as funny and well made. \nThe humour serves as well put comic relief, as the film is quite graphic in both sex scenes as well as the chances they take.\nThay co,me through dialogue and questions, where Anita impossibly can answer with small little white lies.<br><br>Small, well played roles by well known Norwegian actors add to the quality of the film, and the dialogue functions well. So the script is definitely Dahlsbakken's best so far.<br><br>The production value of the film is good. So far the best of Dahlsbakken's five outings, which tells he is refining his talent. So is his brother's photography. Their joint company FilmBros are definitely going somewhere, and they also have three new films on the way.\nWell worth a watch!","user":"OJT","rank":[15,23]},{"title":"Totally worth your time","rating":10,"date":"31 March 2020","review":"Ignore reviews with titles like 'Not Worth It' ... probably written by a 12 year old. Beautiful film. Very well acted. Sensitive subject about a middle aged woman In a cold loveless marriage. As a PE teacher arriving at a new school she is seduced in a quite forward and risqué way by her underaged student. She doesn't push him away. On the contrary. His virility and passion awakens something inside her, it makes her feel alive. She doesn't shy away from risky behaviour. We learn she used to be a gymnast but she had to stop practicing this career because she broke her neck while training. This probably changed her whole life and the easiest choice was then to become a PE teacher. Her husband doesn't show lots of affection. Her and her husband's house is a grey modern building made of cold materials: glass and iron. The decoration is also dark and greyish. During a dinner evening with her husband's colleagues we learn he doesn't want them to know that she is working. He is ashamed of her. A PE teaching position probably isn't as glamorous as being a lawyer, or as being a professional athlete for that matter. It is suggested that she and her husband met via a dating app where they were first and foremost sexually attracted to each other. After 5 years of marriage this attraction died out. He has children, so she is his second of third or whatever wife. She has non. During a recital of Tchaikovsky's music for Swan Lake she sobs. This is her Swan song. The Black Swan is dying. Her marriage is dying, her youth is dying, although the youth inside her is still very much alive. She feels a real connection with the boy but the boy eventually doesn't connect with her on an emotional level. She's almost 50 in his eyes. Way too old to have a real relationship with. The woman becomes obsessed and behaves irrational, destroying her career, marriage and her social standing. Along the way we also learn she has a disturbed relationship with her mother, lacking the love we all need, since childhood. No Hollywood happy ending. She is punished but allowed to go her own way while still trying to understand herself what happened and what she has done. Her instincts were stronger than her rational abilities. All or nothing. In the end she got nothing, just sitting there with her small box of material possessions while the world around her just continuous.","user":"andredejongh","rank":[4,5]}]