[{"title":"I enjoyed this movie","rating":8,"date":"24 February 2020","review":"\"Padman,\" tells an important story in an engaging and entertaining way. I enjoyed this movie overall and really enjoyed Akshay Kumar's lead performance. His character is very likable has he only has the purest intentions to something good for society. The story was inspirational and pretty well put together. I do feel that the first half of the movie dragged mostly because it became pretty repetitive and it probably could have been cut a bit shorter. The movie does bounce back with a fast-paced and resonant second half that makes the movie worthwhile. It's a good movie with a strong message and a good heart that I enjoyed.","user":"MR_Heraclius","rank":[39,41]},{"title":"Badman to Padman","rating":10,"date":"9 March 2018","review":"First and foremost a big round of applause to every single entity (Actors ,producers,director,writer,cameraman) who are associated with this real life inspired piece of lifetime reality .\nAkshay kumar has acted flawlessly and setting another milestone for himself by acting as a rigid man who does not give up his dream even after multiple failures and malign and turns from a \"Badman to padman\".Being a woman it was more easier to connect to each and every action of the protagonist such as testing the pad on his own(by pumping animal blood) was the most touching scene which made me cry while watching.It gives me goosebumps while I think about the real hero Mr Lakshmikant.A jumbo hats off to him from the core of my heart and mind. Rest all have also played their part very responsibly and successfully. \nThis piece inspires to dream about every small and untouched but inevitable needs of life associated with human being(Irrespective of caste creed and gender).\nI will not go very far to proof this as I always wanted to write a review on movies and this is the movie which forced me to write the review right after coming back from theatre. Though this story makes more sense to developing and underdeveloped countries like India where chums is still a taboo to talk about still the movie deserves a nomination for Oscar in regional film category in the year of 2018.","user":"deepmaladubey","rank":[26,30]},{"title":"This movie will make everyone smile","rating":9,"date":"12 February 2018","review":"A beautiful movie with a strong message. Akshay Kumar hits a bullseye again and shines as a winner with his wonderful and effortless acting. He is lovable and takes the movie to the next level. The story as we all know is very inspiring but the execution is what makes it believable and entertaining. R Balki has done a good job and the movie does not bore you even a bit. Radhika Aapte as always delivers a strong performance. Sonam Kapoor is fine and has performed better than all her previous movies. \nHighly recommend everyone to watch this movie.","user":"rohankapoor-97889","rank":[30,36]}]