[{"title":"Very enjoyable buffer overflow!","rating":8,"date":"17 April 2018","review":"I saw GOBD at the Vermont International Film Festival. Loved every overbearing second of it. I'd call it a braindump on stages of disappointments with persistent political ideologies. Being embedded deeply in leftist, political nerd culture, the movie tries to address topics in depth, and as the filmmaker stated in the Q&amp;A, he couldn't have dumbed it down further. It's also a marvelous trip through film styles and packed with popcultural inside jokes. Buffer overflow!\n(Can't believe I'm giving a doc with a political agenda 8 stars. I've never done that before! I usually like films about animals!)","user":"Velocerix","rank":[40,50]},{"title":"Wunderwelt of Politics","rating":7,"date":"20 April 2018","review":"In a wild collage of puppets, pixels, stop motion and live action stock footage, Austrian auteur Johannes Grenzfurthner gives us an insight into his mind and ideology with this cinematic revue about politics.<br><br>At its core, \"Glossary Of Broken Dreams\" is a rant against society in form of a list of words and concepts. A glossary of today's issues. The why's and how's. The way it's all put together is amusing. So was I entertained? Yes. Yes I was. Even though it was a little fast for the information being presented... it was still entertaining.<br><br>Check it out. I will definitely rewatch it.","user":"D_Ogusa","rank":[37,46]},{"title":"Colorful documentary","rating":7,"date":"30 April 2018","review":"A colorful film about politics and the problems of political thinking in the age of internet culture. It is insightful and very funny. Only problem I have is that it is a bit too fast. It is almost impossible to follow all the threads, references and jokes. I'm not an English native speaker, so maybe that's part of the problem, but, very well deserved 7 stars from me.\nHope that there will German subtitles in the future....","user":"internetfreieminuten","rank":[42,53]}]