[{"title":"wretched is more like it","rating":3,"date":"23 June 2019","review":"If this was suppose to be a horror movie, it was not. I couldn't even begin to tell you what this was or even what it was about. 90% of it is melodrama, and not even interesting melodrama. A small part of it is found footage type film but most of the movie is fairly low-budget cinematography. For the most part it's only 3 actors and they're pretty good considering what they have to work with, but there's nothing more here then some mystery in the woods (how many films about wooded areas do we need ?) In an effort to make it interesting the filmmakers chose to jump around a bit in the story telling, which adds nothing. There is some atmosphere here but this really is not worth the effort to watch, and I have no idea how long it actually is, but it felt 3 hours long. Since it's not horror, there are zero scares and its just a bore, you could watch it for brief snippets of female and male nudity, but believe me, it's not worth it.","user":"hampersnow-28905","rank":[5,6]},{"title":"Quite good","rating":7,"date":"8 March 2019","review":"A demonic entity haunts a group of 3 friends and they breakdown emotionally/mentally while it's happening. Acting was solid. It's quite bleak and dark. Some intense moments throughout. Not much is revealed about the demon. It's kept mysterious and mostly talked about but the psychological harm it causes is very obvious. Human emotion is what makes a horror movie great and the director understands this.<br><br>Also, the camera work was a mixture of found footage and studio. So it had a very gritty, real world feel.","user":"boss_270","rank":[14,26]},{"title":"Mediocre but not unwatchable","rating":4,"date":"27 June 2019","review":"Wretch is a slow-burn, psychological horror movie. The whole production is low budget and average but that doesn't really ruin the film at all. The story however is a different story. While it is kind of unique, it is also rather convoluted and confusing. I honestly believe that the creators don't even fully understand the story and were just trying to make the pieces fit together when they got to the end. Even so, it does have a few good moments and it is watchable. I've seen far worse. 4/10","user":"mikedegroot","rank":[3,4]}]