[{"title":"Great acting and a good perspective on the Germany's reunification","rating":8,"date":"6 July 2019","review":"As a German born and socialized in the western part and having lived in the eastern part for more than 17years now, I feel like this is quite some masterpiece. One year after the initial theatre campaign many people seem to relate to the movie, as a concert of Gundermann's songs performerd by director Dresen and lead actor Scheer yesterday in Leipzig was sold out.<br><br>The authentic interpretation of Gerhard Gundermanns poetic and mostly deep songs is the most fascinating part of the movie, closely followed by the makeup departments stunningly exact remodeling of Gundermann's face. Even his widow has said in interviews it was spooky to look into the face of her deceased husband just as she remembered it from 15 years ago.<br><br>In fact both Dresen's singing and his looks are so close to the original that I have to listen closely when hearing a song from the movie to distinct it from one of the original works of the popular East German songwriter who as many had to find a way of dealing with the profound changes of 1990. the big turning point in Germany's most recent history.<br><br>The film also achieves an unbiased perspective leaving it to the spectator to find a point of view towards Stasi activities and SED ideology. A fascinating and totally underrepresented movie on this platform. Just see for yourself.","user":"beyer-sebastian","rank":[6,6]},{"title":"Succeeds from various perspectives","rating":6,"date":"2 September 2018","review":"\"Gundermann\" is a new German 2-hour movie from 2018 and the most recent collaboration by lauded East German director Andreas Dresen and screen writer Laila Stieler, who have been working in film together already for over 25 years. So it's now surprise really that their collaboration here results in another fruitful and high-quality outcome with \"Gundermann\". Still looking at some other works of the two, it seems more like Stieler needs Dresen than the other way around. Anyway, a lot of their success here is also due to the acting, most of all of course Alexander Scheer's lead performance, but also the make-up work as his character's looks here are at least half the way to the goal. Fittingly with Dresen's background, this is also a pretty historical movie. While I think I have more knowledge about and interest in the years of the GDR here in Germany, I must admit that I have never come across the name Gundermann before. My loss I guess because some of his music in here, or I should say Scheer's music perhaps, is really really good. It's of course entirely subjective what you will like the most, but for me it was a number of the old people (or lets say those older than the youth) having a comeback. This song is also featured in the trailer. So unsurprisingly, the music plays a vital role in this movie. But like I said, history is also dominant, or let's say dealing with history as Gundermann worked as an informer for the German secret police Stasi and this really backfires when he tries to have a career after 1989 in Germany as it gets public and he faces heavy backlash from strangers mostly, but also from new friends like his band members. But it is also a great test who will keep supporting him with what they know now. And the one who supports him the most, actually always is his beloved wife Conny played impressively by Anna Unterberger. I hope she gets some awards recognition too, not just Scheer, for whom it could turn out a career-defining performance. His character is also all about understanding what he did and that it was wrong himself. Not just that he has to inform those around him, maybe the whole country, but also that he needs to find a way to deal with the situation. One thing I found particularly interesting is that while really loving the GDR, he was never a citized who would not complain. He wanted to make the country he loves even better. The talk about Guevara and Honecker at the end is the very best example for that. You really don't see characters like this too often, which is especially impressive as there are hundreds and hundreds GDR-themed films from Germany out there.<br><br>On a side-note, but also an important point, actually, this film also delivers in terms of the set decorations and visual side from start to finish. I can see it making an impact there too. The makers here should not be too disappointed that Henckel von Donnersmarck's film got the edge to represent Germany at the Oscars next year as what we got here is still a pretty good achievement overall with hardly any weaknesses and some really great moments. The ending comes to mind immediately when he tells his fans about who he was in the 1970s and 1980s and some react in a way where they put his art above the person, while others cannot seem to forgive him and do the exact opposite. And the rotten eggs joke afterward fits Gundermann's style very well too and his humor. \"Art over artist\" is an important subject in the movie as a whole. There is also a mention on Bob Dylan in here in this context and we see him briefly on one occasion. Not the real one obviously. And aisde from these deep questions about art and politics, there is also a somewaht charming and sweet love story here. A bad movie would have depicted Conny's previous man as an unlikable antagonist, a Rosamunde Pilcher film if you want to say so. This one here depicts him as a really charming and likable guy who loves his wife and is happy to have a family with her. The \"I should hit you\" moment is the very best example. You really could not blame him. And the apartment switch felt really awkward, but well, it was maybe the best for everybody involved, even if it really must have felt strange for the young children all of a sudden that another man is there from now on all the time. So yes, a good film from all perspectives that is almost flawless (really tough to find something to criticize, maybe the editing was not always too great when they jumped in time considerably) and you can see Dresen's competence and talent in every scene really. But sadly, the truly outstanding moments are also too rare for me to give this one a really high rating and declare it among the very best films of 2018. But it's still among the better from Germany from what I have seen in 2018 without a doubt. Thanks for making Gundermann known to people again to everybody who worked on this project. He sure deserves the attention and it is tragic to see he died this early. Oh yeah, fans of (Munster) Tatort and Stromberg will also see two pretty likable familiar faces in here. But these are really not the only ones who should check this one out. I give it a thumbs-up without hesitation and recommend seeing it. I will put the song I mentioned earlier on my mp3-player now. See you later folks and enjoy this one as much as I did and everybody els ein the audience. It's been a while that I saw a room filled with almost 100 people and almost nobody got up before the closing credits were over. Says a lot positive about this film without a doubt. The imdb rating (and hopefully upcoming awards recognition) is not inaccurate. Watch \"Gundermann\", definitely the defining movie about the man and I doubt filmmakers will touch the subject anytime soon really because they just won't be able to top Dresen's effort here. Good job folks.","user":"Horst_In_Translation","rank":[7,8]},{"title":"Gunderman: Discovered & Defined","rating":9,"date":"9 August 2019","review":"I'm not German but I do appreciate this movie very much. It is a sweet story of a gifted man and musician. The writer and director should be commended for interweaving a complicated love story, of a conflicted but quiet man within an historical period that helps define Germany today. Very moving, very tender accompanied by great soundtrack of Gunderman's instantly likable music.","user":"gincain","rank":[3,3]}]