[{"title":"Entertainingly silly splatter meta movie","rating":6,"date":"24 June 2018","review":"Blood Fest is a horror-comedy which can be filed under the meta movie bracket. It unashamedly wears its influences on its sleeves and it is an unpretentious celebration of the horror genre. The man behind it is writer/director/actor Owen Egerton who plays the circus ringleader here. The story is very simple. A horror-obsessed teenager goes along to a new horror-themed festival called Blood Fest with his two pals. When there, it becomes quickly apparent that the horror is real and the attendees become the prey of the killers who run the place.<br><br>The set-up of the movie is basically a neat way to allow for the inclusion of a variety of horror tropes and situations. To this end we have chainsaw killers, killer clowns, a hillbilly psycho, sexy vampires, marauding zombies and torture sadism; with nods to all manner of movies including The Wizard of Gore (1970), The Evil Dead (1981), Ring (1998), Saw (2004), etc. It is quite a lot of silly fun and pretty amusing quite a bit of the time too with some funny lines, i.e. 'your mother was killed by horror'. What it ultimately is, though, is a gore-fest with knowing nods to the genre and as such will make for somewhat entertaining viewing for horror fans.","user":"Red-Barracuda","rank":[52,68]},{"title":"Could've Been Better!","rating":4,"date":"6 January 2019","review":"This 2018 horror comedy begins with a boy, Dax witnessing his mother's murder\nand years later he is a horror fanatic hoping to attend a horror festival, \"Blood Fest\" with his friends, Sam and Krill. Things start ok, but soon things actually get bloody when most of the fans/attendees start getting murdered for real. Dax and his friends try to survive against zombies, psychotic clowns and other obstacles. The film's director, Owen Egerton is also featured as Walsh, the diabolical host of Blood Fest who wants to make the ultimate horror film.\nThis starts off pretty good, but starts to fall a little flat and could've been better. It does have great make-up effects and pays tribute yet pokes fun at films like, \"Saw,\" \"Friday the 13th\" and \"Cabin in the Woods.\" You could give this a try if you're into the horror genre.","user":"gwnightscream","rank":[8,9]},{"title":"Kinda cheesy but it also worked ,, and least to say i didn't hate it ;)","rating":6,"date":"11 November 2018","review":"So the plot of the movie might have some originality but still wasn't as strong as i thought it would be .. and kinda lacked the element of unpredictability ,,with that been said ,, it was fun at times ,, had more than a couple of enjoyable giggly scenes and the graphics and cinematography were not bad at all ,, apparently with lots of movies being made annually these technicality are becoming affordable.<br><br>Cast wise,, it was good,, I knew Robbie Kay from ABC's Once Upon a Time ,, and he was amazing there ,, and here he did a really good job,, he got the talent indeed.. Jacob Batalon from \"Spider-Man: Homecoming\" was also funny and he delivered,, and the whole cast in general did good.<br><br>Overall,, the movie is one of these cheesy movie and probably low budgeted one ,, but i kinda different in away and i enjoyed it .. so Recommended.","user":"Aktham_Tashtush","rank":[10,12]}]