[{"title":"Embarrassing","rating":1,"date":"24 March 2018","review":"IMMORTAL FIST is one of those cheesy and embarrassing American action indies inspired by Chinese and kung fu cinema. The obvious inspirations here are the likes of CROUCHING TIGER, HIDDEN DRAGON and the IP MAN franchise. This is essentially a series of fight scenes filmed in a local park with fighters dressed up in old-fashioned cosplay-style robes and the like. There are some okay moves, but the choreography tries way too hard to be slick and in the end the inappropriate music and limited performances kill it. I found it pretty embarrassing overall.","user":"Leofwine_draca","rank":[5,5]},{"title":"A for Effort. C for Cringe","rating":2,"date":"20 April 2018","review":"An indie martial arts film typically found on Amazon Prime. The acting is fairly sub par. The wardrobes are not very pleasing in terms of aesthetics. The film essentially ends up being a bunch of cosplayers having fun doing martial arts scenes in a local park. You can tell they had fun doing it which is why I give it two stars instead of one. Seems school project quality.","user":"spiritshinobi","rank":[3,3]},{"title":"looks like highschool drama club made this","rating":1,"date":"2 June 2018","review":"Where to start, with horrible dialogue, bad cinematography (looks like a cheap handheld), horrible Wing Chun, bad acting, horrible characters, and just bad all around. They have a kid who is supposed to be an ancient spirit walking around in a robe, a Chinese deity or whatever carrying a Japanese Katana. The fight scenes are horrible! They are so badly choreographed and acted out I question if anyone had any film stunt or filming experience and even any kung fu fighting experience. The Kung-Fu is pretty obviously just stuff from in class non-realistic sparring with a lot of don't punch to the face or maybe it was how they were taught. EIther way it's insulting to WIng Chun, Kung-Fu, asian culture, and Caucasian people for being in it. Anyone who rates this above a 2 must know someone in it.","user":"desoto-22623","rank":[5,6]}]