[{"title":"Road trip for brains","rating":6,"date":"31 October 2019","review":"This is not new, but at the beginning it does feel quite fresh. Throughout there are some fine zingers and dialogue lines, but it never really achieves or reaches hights that would put thin in another league. It's a fun little movie though and if you are a fan of comedy and horror combined (I know some despise that formula), than you will be satisfied.<br><br>Having said that, do not expect any super acting or big effects (though for the budget this had, it looks at least ok). If you're down with that, just have ... fun","user":"kosmasp","rank":[18,21]},{"title":"Fun but nothing new","rating":4,"date":"16 February 2020","review":"The bad dad joke in the title tells you the level of humor to expect. Sarah Yelkin from \"Happy Death Day 2\" is the big draw here. The big problem is that this movie suffers in comparison to the films it tries to copy. \"Warm Bodies\" did the zombie romance way better. \"Ahh Zombies\" did the zombie perspective better. \"Cooties\" did schoolyard carnage better. This film sets gore at about 7 and humor at 3. It pales in comparison to it's predecessors. Still, it's not a total wash. Get drunk with your friends and you can still have fun riffing on the cheesy scenes.\nI did sit through the credits...so I knew who to blame.\nThis brings nothing new to the table.\nIt's not one to be tossed aside lightly. It should be thrown with great force.","user":"laurainmark","rank":[8,9]},{"title":"Not an outstanding zombie movie in any way...","rating":4,"date":"20 February 2020","review":"A zombie movie, check. And I am there, as I am drawn to anything even remotely zombiesque.<br><br>However, this 2019 movie titled \"Eat Brains Love\" from writers Mike Herro and David Strauss just wasn't a particularly outstanding or memorable movie when it comes to zombie movies. Sure, it was watchable, but that was also about it. I can't claim to think that director Rodman Flender really made anything worthwhile from what was readily available in form of script and characters.<br><br>The movie's storyline was straightforward, albeit rather generic. It didn't really offer much of anything extraordinary. And the thing with the characters being able to switch between human and zombie states was just downright stupid, and it was something that definitely didn't appeared to me in the least.<br><br>I will say that the acting in the movie was adequate, taking into consideration the limitations imposed from the script and storyline.<br><br>The movie did have sufficient gore to make it worthwhile to sit through, which actually counts for something, I suppose. And the special effects in the movie were adequate - but not top of the line for a zombie movie.<br><br>I managed to sit through the movie, although this is hardly a movie that I would recommend that you spend your time, money or effort upon. There are far better zombie comedies and zombie romance movies readily available.","user":"paul_haakonsen","rank":[5,6]}]