[{"title":"Every bit as fast, furious and fierce as its predecessors, this third 'SPL' installment is a great action thriller itself and a worthy addition to the series","rating":8,"date":"20 August 2017","review":"The 'SPL: Sha Po Lang' brand in Hong Kong action cinema has come to stand for brutal, bone-crunching action in such memorable duels as Donnie Yen and Wu Jing's alleyway brawl in the 2005 original, Yen and Sammo Hung's mano-a-mano on a nightclub stage in the same, and more recently Wu Jing, Tony Jaa and Zhang Jin's fight-to-the-death in the 2015 sequel.<br><br>'Paradox', the third in the 'SPL' canon, continues that grand tradition with director Wilson Yip returning at the helm and Hung as action director. Both franchise veterans ensure that the fights are just as fast, furious and fierce as their first film, but only judiciously bloody, so that the bloodletting never comes off as excessive. Among the highlights here are a daytime scuffle in an open bar that is followed by a breathless chase down Bangkok's busy streets, a close-quarter skirmish in a flat that continues into the dilapilated apartment building's corridor and onto its crowded rooftop, and last but not least a no-holds-barred showdown in a meat depot that is also a front for a mortuary of an illegal organ trafficking business. Each one of these action set-pieces are meticulously choreographed and beautifully executed, which is also credit to its stars Louis Koo, Wu Yue, Chris Collins and Jaa.<br><br>Besides Jaa, the rest are not quite as well-known for their martial arts skills, but the training, practice and hard work that each one has put in is clearly evident. In particular, Koo's months of intensive training have paid off tremendously especially in the extended climax, which sees his character turn absolutely badass on tens of baddies successively in a vengeful rampage. Yue also proves quite the revelation; better known for his roles in Mainland TV drama serials than in movies (remember him in Police Story 2013?), the actor who holds a National Martial Arts Championship grade in wushu is less showy than his predecessors Yen and Wu but is no less precise or ferocious than them. Notwithstanding, you should know that Koo and Yue's top billing here isn't misleading; whereas Jaa took centrestage alongside his Chinese stars in the last movie, his presence here is no more than a glorified cameo – and it should also be said that his absence is sorely felt, given that his one-on-one rooftop fight with Collins is arguably the most breathtaking sequence in the entire movie.<br><br>To Yip's credit, as much as the fighting is the movie's top draw, it never becomes its raison d'être but in service of the overall narrative. In that regard, all three movies have been thematically related, based upon the Chinese title's astrological reference of three individuals whose position relative to one another signified death and destruction. Here, these three are Hong Kong detective Lee Chung-chi (Koo), who has arrived in Bangkok to search for his missing teenage daughter (Hanna Chan); local Thai-Chinese cop Chui Kit (Yue), who has a six-month pregnant wife and whose father-in-law is the police commissioner Chai (Vithaya Pansringarm); and political aide Cheng Hon-Sau (Gordon Lam), who will resort to any means necessary to get an urgent heart transplant for the ailing Bangkok mayor in order to sustain the latter's re-election bid. Caught up in the ensuing melee is Chui Kit's fellow police colleagues Kit (Jaa) and Ban (Ken Low) as well as the leader of an illegal organ trafficking syndicate Sacha (Collins). <br><br>It isn't hard to guess just how the characters are connected to one another, but returning series writer Jill Leung builds the story nicely to have us empathise with Chi's desperation, grief and vengeance as a single father at the loss of his beloved daughter. Just as visceral is the sense of powerlessness he feels against the corruption of those more powerful than him, so much so that despite responding in shockingly vicious ways, our sympathies remain firmly with him and his fists. More so than the earlier two movies, the storytelling here is a lot more fluid, confident and propulsive, good enough at least for us to overlook some of the obvious coincidences (like how Chui Kit and Tak's vehicles seem to agree not to start one after another so both can end up at the same place at the same time).<br><br>So really, 'Paradox' is as solid an hard-boiled action thriller as it gets. The plotting is not just functional, endeavouring and largely succeeding to tell a story about karma, retribution and reconciliation. The acting is solid, each one of the performances a strong emotional anchor for the flawed characters whose relationships next to one another are defined by their respective choices and consequences. And perhaps most importantly to its fans, the action is as awesome as its predecessors, the fisticuffs often white-knuckle intense. This is as raw and real as it gets, set entirely against appropriately grimy backdrops in Thailand. As far as the 'SPL' canon is concerned, 'Paradox' is as fitting and satisfying an entry as it deserves, demonstrating not only that there is life yet to the series but that it is very much alive, kicking and definitive to Hong Kong action cinema itself.","user":"moviexclusive","rank":[15,26]},{"title":"Excellent Chinese action flick with a great story and amazing choreographed fight scenes","rating":9,"date":"25 December 2017","review":"This film had all the elements of a Hollywood production. The story was told well, had a lot of heart, with lots of twists and turns. The score could have been better and I would have loved to see more of Tony Jaa, but nevertheless, the directing and cinematography where on point and all the leads played their roles great. The action was not overwhelming and just right for the story being told. The pace and length of the film were perfect and the subtitles on screen at the right speed/length. Very enjoyable and a recommended viewing from me. A well deserved 9/10!","user":"TheTopDawgCritic","rank":[16,29]},{"title":"Incredible Fights","rating":9,"date":"2 July 2019","review":"When you peruse the synopsis of \"Paradox,\" your eyes may roll as the first thought to enter your mind is: not another human trafficking movie?! Wrong all of the way around! Nothing is routine about this dark-themed, high-octane, adrenalin-laced action thriller. \"IP Man\" trilogy director Wilson Yip's \"Paradox,\" a polished police procedural, charts the efforts of tenacious Hong Kong Detective Lee Chung-Chi (Louis Koo of \"League of Gods\") after he arrives in Bangkok, Thailand, to search for his missing 16-year-old daughter Lee Wing-chi (Hanna Chan of \"G Saat\") who had gone to Pattaya, Thailand, to visit her friend Jenny. After Lee has been missing without a trace for several days, Jenny (newcomer Iris Lam) contacts Lee and lets him know about Lee's absence. Indeed, backstory chronicles the separation of headstrong father and rebellious daughter. As we later learn, Lee lost his wife during a traffic collision while his daughter was riding in the same vehicle. More recently, father and daughter had clashed when she told him about her pregnancy and then introduced her boyfriend as the father to her dad. In no time flat, the detective has the boyfriend/father arrested. Furious about this whirlwind turn of events, Lee Wing-chi flees to Thailand to distance herself from her dad.<br><br>Meantime, on the eve of his bid to announce his run for re-election, the Mayor Aziz of Bangkok suffers a heart attack and requires a new one. Although the plot is not as spontaneous as \"Furie\" (2019), with which critics have recently compared it, Yip has more on his mind with multiple plots that intersect by the third act. Thailand martial arts sensation Tony Jaa has a supporting role as the friend of lead cop on the investigation, Inspector Chui Kit. Predictably, the first half-hour of this 97-minute actioneer with lots of martial arts mayhem sets up the complications surrounding the daughter's disappearance and then Lee Chung-Chi turns the city upside down as he plunges into the depths of the underworld with Inspector Kit shadowing him, until his own pregnant wife starts to bleed, fears that she may lose her baby, and goes to the hospital.\nDetective Lee Chung-Chi is indefatigable in his efforts to locate his daughter. Inspector Kit finds himself knee-deep in corruption, too. Legendary martial arts choreographer Sammo Hung staged the incredible action scenes. He mixes up mix of authentic Muay Thai talents, spectacular acrobatics, and razor-sharp meat cleaver and machete brawls that will keep you'll be flinching. These invigorating fights make John Wick look like a pussy. Writers Nick Cheuk (\"Zombiology: Enjoy Yourself Tonight\") and Lai-Yin Leung (\"Kill Zone 2\", \"Ip Man 3\") do an excellent job of setting the plot up and paying it off. Nevertheless, the final quarter hour teems with so many tragic revelations that you won't believe what you're seeing. You've got to see this one!","user":"zardoz-13","rank":[3,4]}]