[{"title":"Well written un-romcom adventuring through a night in modern Wales","rating":10,"date":"21 June 2019","review":"What a lovely film. I'm a big fan of stories set in modern Wales because it's a very different vibe to the romanticized Irish and Scottish stories aimed at American sentimentality. Characters in Welsh stories are more real, there is something more practical about them and their version of rural drugs and violence. Its more light-hearted than Twin Town a previous favorite of mine, this is a romcom where the protagonists have layers upon layers to their flaws. It's not obvious where they are going or that their story is inevitable. It pokes gently at some well-worn tropes.<br><br>Great atmosphere, feel of a declining seaside town short of jobs but where people still know how to have a good time. They mention the mainland a lot, I am don't know which island in South Wales it is, but its isolation adds to the story in the sense the rules are different here. The locals are all on the make, doing whatever is necessary, the police are inept but also probably know everyone, maybe turn a blind eye to family and neighbors. I also like the way everything changes over one night, their lives, their feelings, what the story is even about. With shifts through the landscape of night, dates gone wrong, clubs and drinking, hospitals and cells, pre-dawn roads and morning resolutions.<br><br>The writing and dialogue are excellent. I thought it was going to be a capsule film at the start, but it goes off the rails beautifully.","user":"Mark-457","rank":[2,3]},{"title":"adultery,is like a backfiring artillery","rating":7,"date":"14 June 2019","review":"Its a comedy youll either love or hate. its hilarious at moments, stupendous at others, but as an allover impression, a pretty decent ragtag british/welsh/scottich/english comedy it is.<br><br>it shows you what may happen when doing a matresspring test with a stranger at a hotel or if you take a slingshot in the wrong directioncrossing the line of matrimony, and thats when the man is the stone(-d) and the woman is the sling. adultry is cool to watch on film, because its everybodys nightmare, and even still a wish for many, to get some break from the routines.<br><br>its a film about hotels,bars,nuns,convent,police,robbers,dealers,lapdancing, swearing, shootouts, bonds, and lawyers. what may surprise the viewer is that it is an extremely sad story of personal crisis, at many levels, and from a psychiatrists standpoint it would mean cash in the wallet. for me it was quite healing and appealing so i had some good laughs here and there, and the dialouges and physical acting are good. the filmography are splendid and doesnt leave you unattended at any time. the story may well be developed into a sequel, i would have liked that, and that is because im an grumpy old man. its a recommend from me.","user":"ops-52535","rank":[5,14]},{"title":"Incredible","rating":10,"date":"6 July 2019","review":"Well well well.... If this isn't one of the best low budget light weighted comedy movie ever. If you want larger then life type of movie then this isn't for you. But if you are ok with light weighted comedy then this is surely a must pick for you. Also the acting is just above par of every actors which features in this film.","user":"shivaverma90","rank":[1,2]}]