[{"title":"Actually a good movie","rating":8,"date":"19 November 2019","review":"I'm surprised this movie practically got no attention and me being the first writing a comment.\nYes, the story isn't really that new. And the cast.. well, it's actually two actors only -both quite unknown (at least to me). Hopefully I won't be bored to death -was my thought when I started watching it. Btw. I have a rule: if movie doesn't catch my attention in first 15 minutes, it's dumped.\nI try to keep it short.. Both actors did their job excellent and made the story believable. Penny and Harris, both pleasant to look at, are natural in showing just enough emotions. Ok, maybe I'm biased because I find Penny very cute...\nStory itself maybe isn't that special. Still, it's never boring and keeps your attention all the time. As always, the end is very important for such kind of movies, as it can (and often does) ruin the whole experience. The end is different than I expected during watching the movie.. is better than I thought it will be.","user":"BogdanH","rank":[35,45]},{"title":"Melancholy little two person drama.","rating":7,"date":"20 November 2019","review":"It seems to start like Groundhog Day with the same cab 'ride' repeating and repeating, but it spirals off fairly quickly to something that you'd never guess. The ending was a little off the charts, as there were other directions it could have gone, but it didn't go Hollywood. That's a good thing. It was very melancholy at the end. Kinda almost wished for Hollywood. Two unknown actors, he was the better of the two, but she was very pleasant to look at. Whereas Groundhog Day you can watch over and over for the comedic bits, this had almost none, and for me was a one time watch - but not wasted.","user":"jayg_58","rank":[19,23]},{"title":"wow... unique movie that surprised me","rating":7,"date":"20 November 2019","review":"Great acting, great story and not as predictable as I thought it was going to be going in.\nThis kept me intrigued the whole time as I continually tried to figure out what was going on.\nBeen a while since I watched a movie like this.\nA good romantic date movie<br><br>7.6","user":"natcalgary","rank":[24,30]}]