[{"title":"2019s Book of Monsters","rating":6,"date":"1 July 2019","review":"2019s Book of Monsters<br><br>Book of Monsters stars Lyndsey Craine as Sophie, Who on her 18th birthday, has a party that goes awry. Is it spoilery if I say there are monsters? Or maybe even a Book of Monsters?<br><br>Monsters, fun kills, silly practical effects make this an enjoyable watch.<br><br>Ok, here is what I jotted down:<br><br>What kind of weirdo keeps an open pocket knife in their back pocket?\nHas a fun BBC/E4 vibe to it, and I love a lot of Brit tv and movies.\nFunny kills and monsters. Who doesn't love killer gnomes in a Evil Dead-ish scene?\nI liked the music. A mix of silly overly-dramatic music and synth.\nFun practical effect mixed with the kind of bad CGI that is funny and not just bad.\nBad sound design throughout.\nIt has a montage, complete with 80s style Jean Claude Van Damme music.\nLoved the music in the end credits how it was self aware and funny.\nThe post credit scene teases what could be a fun TV show similar to the cancelled Crazyhead.<br><br>\nAll in all, if you're looking for a fun and entertaining watch that you can toss on and not take too seriously: this is a good choice.<br><br>Have fun.<br><br>6.5/10","user":"ghettodub","rank":[14,16]},{"title":"Goodish because it's old school","rating":5,"date":"8 April 2019","review":"It follows a horror formula of the 80's slasher movies. There is the shy heroine with the mysterious past, the BBF who is overprotective, and the school bully who is just there to be mean for the sake of meanness in a High School with the world's oldest teenagers. I caught myself giggling at the cheesy but reasonably good special effects and best of all there was no CGI that I could tell of. This is one of those movies that you can't take too seriously because it's obvious that it was using a low budget. Would I watch it again? Probably not, but it was a good watch and it killed a bit of nostalgia I felt of the 80's.","user":"phoenixinvictus","rank":[18,22]},{"title":"Fun Fluff!","rating":7,"date":"12 June 2019","review":"Rubber monsters, hot girls and fun scenes where they chainsaw up a spider creature that reminded me of the Alien Queen from Aliens. Not a bad way to spend an evening. I'd watch a sequel if it had a bigger budget.","user":"bridgetgibbs-00075","rank":[15,19]}]