[{"title":"Turgid borefest","rating":3,"date":"4 March 2020","review":"I was looking forward to a Lord Of The Flies / Lost At Sea Combo but unfortunately it is a bit of an exercise in tedium.<br><br>Poor character development and a lot of very weak characters made the story overly long and rambling for me. I appreciate that this was a true story but sometimes you cannot make a silk purse out of a sows ear and there was just not enough to make an entire film or perhaps it was the director who did not know how to fill the scenes with enough good dialogue and characterization so it gets a lowly and rather depressing 3/10 from me!","user":"omendata","rank":[5,6]},{"title":"its a stingless drama","rating":5,"date":"4 March 2020","review":"About a group of boys and their adult leaders that has their brotherhood summer training camp in the canadian wilderness, doing activities that shall strengthen the boy into a man.<br><br>but accident happens underway, and the film is adrama about that and their fight to survive.<br><br>its not a filom that scares the guts out of you, its more the mental battle to overcome their hardships, and the way the plot is put together are not to overwhelming, id rather say boring., but it gives you time to think out strategies to survive, why not turn the canooe, why not use some floating device etc etc.<br><br>im grumpy and im old, and think this is a great film for the lame and slain tv viewers, its not good enough to enter the great screening theaters. the story gives opportunities, but the product are slow and motionless. a small recommend","user":"ops-52535","rank":[4,6]},{"title":"In a word - tedious","rating":4,"date":"4 April 2020","review":"Unfortunately, this is one of those movies that will have you staring at the clock, amazed that 96 minutes can seem so long. I say 'unfortunately' because there is so much material in this true story that should have resulted in a movie that is exciting, inspiring and extremely moving. In fact, the producers seem to think this movie is all of those things, but it is none of them.<br><br>There are a number of problems. Firstly, we never get to know any of the characters before they are thrown together into adversity. Consequently, it's very hard to care about what's happening to them. Secondly, the actual incident depicted here is shot so darkly (understandably since it happens at night) that it's hard to know who is who and what is happening. Thirdly, a lot of the movie is told in flashback and these back stories just aren't interesting. Fourthly, the age group of the boys who endured this tragedy was between 6 and 16. I don't think many of these actors are under 20. It would have been much more powerful if the cast were the correct age. Finally, the script really, really tries to wring as much emotion and pathos out of every moment it can and it shows. It's amazing then that this movie does not elicit any emotion at all, other than joy when it is finally over.<br><br>I really wanted to like this. I didn't. It's not going to say a bad movie, just incredibly dull.","user":"CabbageCustard","rank":[1,2]}]