[{"title":"Compelling","rating":9,"date":"2 June 2019","review":"I'm not a huge fan of religion in the movies; it usually results in something dry and unwieldy, more polemic than entertainment. However, SVAHA: THE SIXTH FINGER is something else besides. Coming across in essence as a Korean version of THE OMEN, this is compelling viewing indeed: thought-provoking, engrossing, and highly literate with it. The story in an essence is about a fraud-busting private sleuth who finds himself investigating a world-ending prophecy, hunting for an apparently dead Buddhist priest and others caught up in a life-or-death struggle against the forces of evil.<br><br>This is a gorgeous-looking movie, once more made with excellent cinematography, editing, you name it. The cast don't put a foot wrong while the detective story layers in plenty of context, subtext and exposition in a way which is never less than engaging. There are twists and turns throughout, decent character development, and only the occasional reliance on CGI spook scares. It's the kind of mature storytelling that the Koreans do so expertly.","user":"Leofwine_draca","rank":[33,39]},{"title":"Overall, a good movie","rating":7,"date":"19 May 2019","review":"Pastor Park is infamous for his debunking attitude towards religious stigma, cult belief, its bad practices and how it exploits the mind of general people of a society. It ultimately led him to a cult religious group called Deer Mount which happened to be related to lot of murders of young children who were born in 1999.<br><br>This film had \"The Wailing (2016)\" vibe from the beginning for some reason. Story focuses on specific people only. It had a huge potential to work and build some other characters. Only problem of this film is it lacks a good continuation of some characters that they introduced in the movie, completely drops them later as if they don't exist. I wanted to see police and Pastor Park working together.<br><br>Jae-hyun Jang is still young and a toddler among other veteran directors. Writers were inexperienced also. What I liked is, I saw they are hard working people; writers, directors..everyone. It shows that they tried their best to make it happen. It's not too long that there will be some good and great masterpiece from them after right amount of experience they achieve.<br><br>I have 0 complain about the actors. All did their parts professionally. This is what I like about Korean Film industry, the actors are super veteran when it comes to acting and you won't find anything to complain.<br><br>Ending was satisfying. Final 20 minutes of the film is really does the magic, it literally revived the whole film. I really like some of the symbolic messages they conveyed via Dogs, Elephant and Bird; is pure gold attached to Babylonian mythology. Kudos to director and writers for portraying it in such mysterious way.<br><br>Cinematography was average. Too many cuts and angle changes in some of the shots. In films like such as this one, it is best to keep a shot as long as possible since sudden cuts and angle change can and will kill some important momentum and it did for this movie.<br><br>Overall, really liked the film. I will give it 7. Don't know why it is so low in rating but definitely not a low six film.","user":"xianhasan","rank":[22,33]},{"title":"Good korean movie","rating":8,"date":"4 June 2019","review":"You need to have some knowledge about Buddhism to understand the movie, words like samsara,dharma,nirvana, lamaism, etc.\nOverall the movie is interesting and has a good mysterious atmosphere. Something refeshing for the genre, but this was maybe because im from west. If you are from East maybe you will be already familiarized.\nI give 7/10 but im biased so i gave it 8.","user":"divg-57-800054","rank":[14,20]}]