[{"title":"NOT FUNNY!","rating":1,"date":"20 October 2018","review":"This has got to be the most unfunny comedy of all times. Written and directed the more notorious than famous Til Schweiger (at least in Germany), who also plays the main character, it features more unfunny, stupit jokes than any other \"comedy\" I've seen. Mostly about hemorrhoids.\nEnough said. Avoid!","user":"joedante","rank":[37,43]},{"title":"One of the worst movies of the year (hopefully ...)","rating":1,"date":"3 November 2018","review":"\"Klassentreffen 1.0\" is, on the surface, a movie like a million others: Three friends get invitations to their class reunion, and go on a road trip to their hometown, overcoming their midlife crises in the process and also getting drunk and making pre-pubescent jokes. Like \"American Reunion,\" but German and twenty years later in the protagonists' lives.<br><br>As such, I was expecting some low-brow humor, a lot of sex jokes, maybe some nudity. But I was expecting those things to be fun. It's very hard to have fun when you're in the company of such unlikeable people as the main characters of this film.<br><br>The least terrible main character of the film is Thomas, played by the film's director and co-writer (among other things) Til Schweiger. Thomas is a talented, attractive and successful guy who needs to learn responsibility in order to commit to a meaningful relationship. In other words, Schweiger is the same character as in almost all of his self-written movies. What makes him the best of our three leads is the fact that the others are terrible, and nothing else.<br><br>Second best/worst is Andreas, played by Milan Peschel. Peschel was great in this year's \"Der Hauptmann\" (\"The Captain\"), and I guess he does a fine job here, given what he has to work with. His character is that his wife divorced him and now he's bitter; his ark is that he needs to be less bitter.<br><br>The worst character in the film is Nils, played by Samuel Finzi, who is also not a bad actor most of the time. He has even been good in some other Til Schweiger movies. In those, he gave his characters, which were mostly spineless betamales who can't stand up for themselves, some depth by playing up their sadness in some scenes. I guess he got tired of providing those flat characters with dignity that the script doesn't earn, so this time around, he doesn't do the audience that favor anymore. His character is that he has to learn to appreciate his family, and he also has hemorrhoids and cracks homophobic jokes a lot.<br><br>Lilli Schweiger, Til's daughter, plays the daughter of Schweiger's girlfriend who goes with the group to make sure Schweiger doesn't sleep around. The film could have some interesting dynamics between the two, but she just abandons the group at the midway point to have her own subplot, and is only shoved back into the A-story at the end of the second act. That said, her performance is fine.<br><br>Like I said, I was expecting some sexism and homophobia in the film, and it would make sense that the protagonists, even if they were well-written, would not have the most progressive and politically correct mindset. I can't fault the film for portraying disgruntled middle-aged men as somewhat chauvinistic, but I can fault it for not having any heart at all. Although all of Schweiger's movies are about family values of some sort (usually about committing to a relationship), and he even casts his daughter Lilli opposite himself (in a role named Lili, with one l), everyone in the cast, except Til Schweiger and his daughter, are written as hateful, intolerant, depressed, angry ... There is nothing redeeming about Peschel's and Finzi's characters whatsoever, which makes it very hard to find any of the jokes funny. It's hard to have a good time in a comedy where I hate every character, unless the jokes are at their expense or very well constructed. And the tearjerker finale is absolutely ridiculous, but that is spoiler territory I guess.<br><br>To wring some laughs from his audience, Schweiger resorts mostly to clichés. The teenage girl who has her life in her smartphone, the marriage counselor who seduces his female clients, the girl who is too stoned for sex -- if those character archetypes are new to you, you might have a blast, if the jokes were well-told -- which they're not, because even if there is a moderately funny joke, screenwriters Schweiger and Lo Malinke don't give you enough credit to find it for yourself. When our protagonists play the old \"Burning bag with dog poo\" prank on somebody, they go out of their way to explain to their audience that, when somebody tries to extinguish the fire, they will have to step on the bag which is, surprise surprise, filled with poop and so they will step in poop. Therefore, when that exact thing happens a few seconds later, you know that it is funny and you have to laugh. If Edgar Wright were dead, he would be rolling in his grave.<br><br>Of course, writing isn't everything when it comes to humor. Timing and sound also play large parts. As for the timing, the editing of this film is atrocious. Every scene has an amount of cuts that rivals any Michael Bay action scene, even when the characters just sit around and talk. As a result, all of the slapstick is completely butchered, because we never see somebody getting hit, falling and landing all in the same shot. These are things that happen very quickly, so our eyes can't adjust quick enough to make out what is happening if you cut around every few seconds, so we're not really seeing the joke happen.<br><br>On the other hand, the editors of the film (David Kuroc and, again, Til Schweiger) see fit to have the scene in which Nils gets his testicles stuck in a sauna bench play for ... I didn't look at the time because my phone was turned off, but every second of that joke was one too many for me. The setup is just too implausible, and it doesn't really go anywhere. They just repeat the setup over and over, and then the scene ends. However, I do have to give them props for having the guts to put close-up shots of testicles in a mainstream comedy rated 12+. At least in regards to balls on film, Schweiger is pushing boundaries.<br><br>What I also found very distracting was the choice of music in the film. There is no original score in the film, at least none that I could make out. Instead, the film music were just pop songs. They almost never fit the mood of the scene, and when they do, it's too rare to consider it anything other than a coincidence. Music supervisor Martin Todsharow apparently just put the music on the film at random. At a couple points in the film, they just let one song play through two tonally completely distinct scenes. It doesn't matter that much, because almost every song has the same mood anyway.<br><br>\"Klassentreffen 1.0\" is sloppily made, unfunny, and you might even call it hateful. That being said, in the screening I was in, everybody else seemed to disagree. Til Schweiger knows his audience, and his audience know Til Schweiger, so both don't expect the most from one another, it seems like. Or maybe there is a very specific type of humor in this movie that I just don't share. I don't know. Anyway, there are already two sequels planned for this film, so we'll probably get to see Schweiger learn responsibility and commitment again next year, and the year after that. I'm not looking forward to that.","user":"richardgeuter","rank":[20,23]},{"title":"Bad acting meets bad scripting","rating":3,"date":"12 November 2018","review":"This movie was a huge disappointment after \"Honig im Kopf\". One of the most unfunny comedy movies of all time. The comedy was never on point and always below the belt. It could be funny if your a 13 year old kid. \"Klassentreffen 1.0\" is bad scripted with even worse acting - especially by Lilly Schweiger. Her acting knew two conditions: total overacting or completely unemotional. The movie is a waste of time and money.","user":"mein-name-war-nicht-frei","rank":[11,15]}]