[{"title":"Pretty solid Greengrass movie for Netflix","rating":7,"date":"10 October 2018","review":"Ok, so looking at some of the other reviews, I've noticed that other reviewers have taken issue with the Norwegian actors' accents and their speaking English for the film. As an American, I can say without a doubt, the accents and the English speaking is terrific. No problems with the dialogue did I notice during the film.\nSo the film does a brief setup of the actions taken against the government and the teenagers camp that day. I believe Greengrass does s brief delving of the events in order to prevent glamorizing the terrorists behavior but to simply inform the movie watcher to what took place. The film really focuses on the survivors, their families and the terrorist's defense in the aftermath... \nThe terrorist's mindset is depicted through meetings with his defense lawyer. One particular young man who survived the attack, his recovery is shown to great detail. The acting is uniformly good throughout the film...\nI believe because of the tragic nature of events that took place, the gravitas of the film is a tough watch. That said, I applaud Netflix for signing a first rate director on to this project. If you have the two hours and stomach for the subject matter give the movie a chance...","user":"gallopman","rank":[158,191]},{"title":"Sad, gripping re-telling.","rating":8,"date":"18 October 2018","review":"This is a long movie but is definitely worth the 2.5 hour sitting. The movie is gripping and fast-enough paced that you don't get bored. Perhaps because the real event is still fairly recent (within the last decade), but I found it was really profound and sad. Half of the movie is the event with the other half focussing on the aftermath of this on one particular kid's life. Netflix can churn out some bad films, but this was not one of them. I'd recommend for a gripping sit-down and watch kinda movie night.","user":"emily-imdb","rank":[37,42]},{"title":"Hard on the heart","rating":9,"date":"10 October 2018","review":"This movie is strong.. Its a accurate movie about what happened this horrific day in Norway. It needed to be documented, and the making of this movie will show people and remind people of 22. July. The accents is no problem really, more people are to watch a movie with english speaking language, than norwegian with english text. And it was made for the whole world to see. You are a fool to lower the scores for this movie because of that. I felt alot of emotions during the 2 hours and 30 minutes it lasted. Seeing what these family had to go through, how scared all of the kids were, and could almost picture myself right there with them.. How horrifying it was. My parents refuse to watch any movie, made about 22. July. They are too scared to see the truth about what happened, and i must admit, its not for everyone. Its a really strong movie.","user":"maria_hansen195","rank":[107,138]}]