[{"title":"A Wise and Important Film","rating":9,"date":"15 December 2017","review":"In 1960, primatologist Jane Goodall, the twenty six-year-old secretary of paleontologist Louis Leakey, was chosen to conduct research in Africa for his study of the influence of apes on primitive man. Though she was not a scientist and never attended university, her open mind, love of animals, and the strong support she received from her mother (who accompanied her to Africa) influenced his choice, one that turned out to be a very wise one. Reconstructed from over one hundred hours of footage shot by nature photographer Hugo van Lavick, Jane Goodall's life is brought to the screen in the riveting documentary simply called Jane. <br><br>Directed by Brett Morgen(\"Cobain: Montage of Heck\"), the film, which combines recent interviews with Jane, now 83, with the archival footage only discovered in 2014, transports us to the Gombe Stream National Park in Northwestern Tanzania, shortly before the country gained its independence from Britain in 1961. As narrated by Goodall from an audio recording of her 1999 book \"Reason for Hope: A Spiritual Journey,\" we witness Jane's groundbreaking research into the behavior of chimpanzees in their natural environment, research that was initially questioned by the entrenched scientific community who said that her findings could not be taken seriously because she was a woman and lacked adequate training. <br><br>The first person to observe chimpanzees in the wild, Jane was forced to keep her distance until the animals could accept the presence of the \"white ape.\" Supported by the magnificent cinematography of Ellen Kraus and a moving score by Philip Glass, we see a silent Jane searching for observation points in the immaculate solitude of the mountains she grew to love. It was a process that required patience and fearlessness, which Jane tells us came from the fact that she did not know enough to be afraid. Her first important breakthrough occurred when she observed Greybeard, the oldest male chimp, using a twig tool to dig out termites from a brush. The discovery was contrary to the consensus opinion that only humans could use tools and was met with resistance, especially by religious groups.\n \nThough we now know that chimpanzees are among the most intelligent primates and that there is 99% identical DNA between human beings and chimpanzees, the media reported the story of Jane's accomplishments with the usual skepticism. Citing the fact that she gave the animals names instead of numbers, they asserted that it showed her tendency to anthropomorphize them and to over identify with the subjects she was researching. In spite of the critics, Jane received a grant from the National Geographic to continue her work and, though she was initially resistant to the idea, they also sent her a Dutch filmmaker, Hugo van Lavick, to record her work on film. <br><br>Developing a relationship with Hugo, they eventually married and gave birth to a son they named Grub. It was Jane's observation of the bond between Flo, an older female, and her baby Flint that provided her with some lessons in child rearing, though the bond between Flo and Flint did not end happily. In one troubling incident, after the chimpanzees began to steal bananas from their tent, Jane and Hugo began to supply them to the chimps, hoping this would prevent a more aggressive intrusion. It was a decision that had to be rethought, however, when the animals invaded their tent and stole everything they could get their hands on. <br><br>Even more distressing was an outbreak of polio among the community and the civil war that broke out between two factions of chimpanzees after the death of one of their maternal leaders, lending irony to Jane's assertion that, \"The more I learned the more I realized how much like us they were.\" Unfortunately, Jane and Hugo began to drift apart when he lost the funding for his work in Gombe and left to photograph wild animals on the Serengeti Plain in Northern Tanzania, one of the natural wonders of the world. <br><br>Now designated as an engendered species, chimpanzees have already disappeared from four African countries, and are nearing extinction in many others. Millions of chimpanzees used to live throughout equatorial Africa but today there are only 220,000 left in the world, a sad reminder of the increasing degradation of our planet. Thanks to The Jane Goodall Institute, an organization she founded that is dedicated to conservation, she has become an activist, traveling around the world talking about the need to protect endangered species, climate change, and the environment, attempting to build, in Werner Erhard's phrase, \"a world that works for everyone.\"","user":"howard.schumann","rank":[16,17]},{"title":"Delightful documentary with stellar Philip Glass soundtrack","rating":8,"date":"8 March 2018","review":"\"Jane\" (2017 release; 90 min.) is a documentary about the life and times of Jane Goodall. As the movie opens, we are reminded that in 2014 hundreds of hours of 1960s film footage was unearthed at the National Geographic archives relating to Jane Goodall. From there we go back in time, and we get to know Jane, then 26, as she is chosen by Dr. Leakey to observe and mingle with the wild chimps in Gombe, Tanzania, even though she has no training or science degree (yet). It was important to Dr. Leakey that someone with an open mind without preconceptions would do the observing. Jane can't believe her good fortune as this is a dream come true for her. She throws herself into her work. At this point we are less than 10 min. into the movie.<br><br>Couple of comments: this is the latest from documentary maker Brett Morgen, who previously brought us the excellent \"Kurt Cobain: Montage of Heck\", Chicago 10\" and \"The Kid Stay in the Picture\", among others. Here he sifts through mountains of rarely or never seen footage shot over half a century ago, showing us how a 26 year old single white woman decides to do whatever it takes to integrate herself into a community of wild chimps. Along the way we also learn a thing or two about Jane's personal life.But the primary reason to watch this is the 1960s footage of the bush and what life was like back then. There are some extraordinary scenes, and some frightening ones as well. But it always kept my attention. last, but certainly not least, Morgen was able to convince the legendary Philip Glass to write a brand new score for this movie, and that score is classic Glass, just gorgeous (available here on Amazon on CD and as a download). You can bet I will check that out shortly.<br><br>\"Jane\" opened to positive acclaim at the Toronto International Film Festival last Fall. I was quite surprised that it didn't score a Best Documentary Oscar nomination, but that doesn't diminish the movie's quality or its appeal. This recently opened for a one week run at my local art-house theater here in Cincinnati. The screening where I caught it at (on the very last day of that one week run) was attended quite nicely actually (probably other people who, like me, wanted to catch it before the end of its run). If you like nature/animal documentaries, or are simply curious to learn more about the life of this extraordinary lady, you cannot go wrong with this. \"Jane\" is a WINNER.","user":"paul-allaer","rank":[7,7]},{"title":"This brings back memories","rating":9,"date":"13 March 2018","review":"\"Jane\" is a pretty good doco; indeed, among the best I have seen. Unlike many nowadays, including some other National Geographic product, it maintains a high standard in all respects. This includes its overall construction, the near-impeccable score, the absence of hysterical and breathless dialogue and commentary, and most of all, the editing and fine mixing of archival and new moving and still imagery. The story, of course, stands on its own two feet.<br><br>So I have no quibbles. Any complaints about some fuzzy pictures ignore such realities as the quality of films made in difficult circumstances with the equipment of the day decades ago, even by professionals, and the few home movie clips which this production employs judiciously. Critics of fairly frequent footage of Goodall carrying and using binoculars, and staring into the jungled distance are a humorous reminder of my eight visits to Africa. I found many tourists (especially but not exclusively American) with such a low attention span that they complain if they don't see an amazing critter around every bush and have no patience for searching. I don't mind \"Jane\" reminding us that binoculars are among the most used and more important tools of wildlife watchers and photographers. Goodall's need for binoculars sits side by side with her discovery that chimpanzees, just like humans, make and use tools.","user":"milbankj","rank":[10,11]}]