[{"title":"ABSOLUTELY AMAZING MOVIE","rating":10,"date":"4 August 2018","review":"First of all, if you are the type of audience who wants to watch a VERY SCARY horror movie, with lots of freaking scary-looking ghost, don't watch this. Personally, I really like this movie because it is one rare out there where it can serve emotionally dramatic but also scary movie (for me it's scary enough, even tho we don't see Ib's ghost very much). It has jump scares, like any other horror movie. The thing that I particularly like is the emotional aspect of the movie. How mother and daughter struggling to help each other and so. It also shows a very modern sight of horror movie, instead of going to shamans (which ALMOST always portrayed in every Thailand horror movie, because shamans is almost like a unique aspect that is very Thai), Boum chose to fight for her daughter alone. It didn't end very well, tho. But I think the ending is quite satisfying and emotional. The thing that still bother me is, why Ib's mother didn't take any action of her daughter's murderous revenge plan for her best friend? And why Ib must involve an innocent young girl, even if the girl is her betrayer best friend's child? But no matter what, I still think that Boum's decision to cancel her suicide plan is the most correct thing she's done in her life. She indeed is at wrong for asking Ib to go on suicide together impulsively, but imagine us being in Boum's place. OF COURSE WE WOULD BE TERRIFIED AFTER WE SEE OUR FRIEND DIED. I think it is very scary and traumatizing. Boum would never have the guts to take the gun and killed herself after watching Ib died like that. \nAnyway, this movie is soooo worth watching for those Thai horror lovers. One of a gem of Thai horror movie.","user":"chelsietristany","rank":[4,6]},{"title":"Keep your promises","rating":8,"date":"5 September 2018","review":"An amazing taiwanese ghost flick! This movie is packed with action from start to finish, most importantly, not in the casual obnoxious Hollywood fashion, it's a ghost movie, but it still maintains the ellegancy of a high class drama.<br><br> The premise itself is really interesting and the movie starts out without much filler content and background info, we get briefly introduced to the relationship between these two best friends and after that it's straight into action, without spoiling the brief intro of this film, as it is important to see for yourself. Also the acting is outstanding, even from the younger cast you can expect top notch screenplay here.<br><br> Most importantly, this movie easily holds the suspense throughout, when you think you are getting let in to fully understand what's happening, the plot changes in a way making you over think what's about to happen, making the movie feel somewhat distant, if i could describe it as that <br><br> Overall, a decent taiwanese ghost story, just enough ghosts, jump scares, drama and sorrow, nothing feels over the top here perfectly balancing everything out. Worth a watch, if you are bored of the usual Hollywood thrillers!","user":"datorsiers2","rank":[8,16]},{"title":"This movie is extremely OK in everything.","rating":9,"date":"27 November 2017","review":"After watching this film, i must praise for everything it has done.<br><br>-The most thing i love of The Promise (TP) is ACTING. I cant stop giving compliments for the cast and crew. Especially the main character Boum and her daughter Bell, the two young friends Boum and Ib is also excellent at acting. Thanks to cast for showing such excellent acting skill. I want to mention the older Boum, she is the real actress. Her actions, her expressions, her voices... everything is breathtaking. And i seemed to fall in love with her from the first sight. I m telling the truth that she and young Boum is very Thailand traditionally beautiful. in addition, i love Thailand student's uniform, too. And Boum's style is also attractive. I FEEL THAILAND MUST HAVE MANY MORE TALENTED QUALIFIED ACTORS, AND GOOD NEW GENERATION ACTORS.<br><br>-About the CONTENT, as a normal watcher, i find TP not too horror or scaring. It just made people thrilled, a bit scared in some scenes. In general, for one who is mad for horror films, TP is not suitable in many ways. But, for one who doesn't want to be too scared but cares about many loving relationships in society, wants to be grossed in dramatic scenes, TP is suitable. The plot of TP is extremely OK for every1 in general. <br><br>-A bit about my feelings about TP: It is worth-watching and OK in everything, a qualified piece of art. You know, in the cinema room, not only me but also other people couldn't keeping our feelings and we really enjoyed every minutes with the movie. <br><br>--&gt; TP sometimes gives you many feelings: from scariness to sadness, deepness. It spreads many meaningful messages. You may sometimes startle, shout out loud and even burst to tears.<br><br>And one thing i don't like about TP, which makes me mark it 9/10 is the making use of actors' good acting skills which seems makes TP to become a social psychology movie in some way. But it isn't a huge problem. <br><br>I think you also should experience this new horror style movie like THE PROMISE.","user":"smtntd","rank":[8,16]}]