[{"title":"Very heavy-going, but an absolutely fascinating watch","rating":7,"date":"26 November 2017","review":"This is a very, very heavy film. It's slow, it's dark and it features some seriously unsettling sequences that will make you feel like there's nothing to live for at times. However, that doesn't mean it's an incredibly riveting and very well-executed film, featuring some really strong performances in tandem with brilliant directing and a screenplay that, although it may not move along with so much urgency, is full of fascinating twists.<br><br>Let's start off with what makes the film work so well: Vivian Qu's directing. Throughout, Angels Wear White feels a lot like watching one of the Dardennes Brothers' films, simply because it's directed in such a frank and often exhausting manner. Qu does a brilliant job to give the film its rather harrowing atmosphere by never relenting when it comes to showing some very unsettling moments, but she also manages to keep that darker, disturbing sense running at every moment throughout the film.<br><br>For one, there's very little in the way of a score here. Yes, there are a couple of scenes with a bit of background music, but for the most part, it's either total silence or a very unnerving violin playing an incredibly deep sound. Couple that with the fact that there are often lengthy periods without any dialogue, and the film becomes a truly unsettling watch, often emotionally exhausting in the fact that you have to witness people going through an incredibly tough situation while struggling to keep themselves together.<br><br>And then there are all the long takes. Much like some of the Dardennes' recent films, Qu's Angels Wear White is full of very long and again exhausting takes, following characters around in their environment with barely any cuts. Of course, it's not all in one take, but its slow pace and heavy atmosphere is further accentuated by the fact that so many scenes seem to drag on, furthering the sense of despair and frustration felt by the characters.<br><br>That may seem like a downside to some, and although it doesn't make the film any easier to watch, the cinematography is a vital part of the film's hugely affecting atmosphere, cementing it as a confidently- delivered drama that's simply very heavy-going on the emotional side.<br><br>Moving on, the plot too is full of very dark and often really disturbing events that make it just as heavy, and yet still absolutely riveting to watch. While the central plot focuses on the investigation that unfolds surrounding the abusing of two young girls, the film delves into a series of other deeper issues that many people in modern China do suffer with.<br><br>On the one hand, the story's darkest side looks at how one of the victims' life turns even worse after the incident following the fallout in her family. Assessing the fracturing nature of the modern family in a fascinating light, as well as the overbearing pressure of traditional values on young children, it's not what you'd call an inspiring story, but it is one that will give you an enthralling insight into some very deep, hidden problems.<br><br>On the other hand, the story also follows Vicky Chen's character, a teenager working in a small motel without an ID card. Although her background is left a mystery for much of the story, the film sheds light on the difficulties that those without an ID card can suffer, even if they are honest, hard-working people. As an effective necessity for almost anything in modern-day China, this one girl is forced into an awful situation that not only puts more and more pressure on her own struggling life, but also begins to affect innocent parties around her, a particularly frustrating and upsetting side to the film's story.<br><br>Finally, let's look at the performances, which are all excellent. Being a very quiet and often dialogue-light film, the cast of Angels Wear White are required to rely a lot more on their own acting talents to put across their characters' emotions, something that's very impressive to see throughout.<br><br>Above all, Vicky Chen, Zhou Meijun (who plays the young girl) and Shi Ke are the stand-outs of the film. Chen and Zhou both bring their young characters' desperation to light brilliantly through very nuanced and confident performances, showing one of the film's central themes – loss of innocence – in a terrifyingly strong light. Shi Ke, on the other hand, plays a lawyer working on the investigation on the side of the young girl, and she really makes a big impression on the film by bringing a small shred of light to proceedings, giving you a tiny morsel of hope that things in this desperate situation could turn out okay in the end.<br><br>Overall, I was very impressed by Angels Wear White. Nobody said it was going to be an easy watch, but it is a remarkably heavy-going and often harrowing story that, with very confident and effective directing, is an often emotionally exhausting and unsettling watch, furthered by dark drama and themes, and brought to life by some very impressive performances.","user":"themadmovieman","rank":[12,12]},{"title":"A riveting multidimensional depiction of the aftermath of abuse","rating":10,"date":"23 September 2017","review":"In \"Angels Wear White\", Director Vivian Qu involves viewers in a riveting, multidimensional depiction of the aftermath of a case of abuse of two young girls. The story unfolds through our observation of two key characters. One is a victim, a child of divorced parents who chooses to go live with her father rather than her mother as she struggles to move on from the trauma of her assault.<br><br>An interweaving parallel story centres on our observation of a young worker in the hotel where the incident occurs. Her moral struggle involves attempts not to involve herself in any investigations due to her own precarious situation.<br><br>We also see other female characters, including the hotel front desk clerk and the victim's divorced mother struggle in their own way to make their way in a world filled with implicit and explicit male dominance and few easy choices. We in the audience cannot help but feel as though we are similarly implicated in the events portrayed.<br><br>At several points, Qu employs an ellipsis worthy of Robert Bresson. As in life, we are left to wonder what exactly has transpired, who has problems of their own, and who is trustworthy. Qu is astute in her choices of what not to show, including incidents and threats of sexual violence. Instead Qu masterfully involves the audience in unravelling the aftermath through the experiences of the victims' families, the seemingly morally ambivalent hotel staff, a stalwart female attorney, and some dubious police investigators. One also wonders if perhaps Bresson's \"actor-model\" technique was used with some of the younger actors, if not the complex, emotionally charged performances of the parents and attorney.<br><br>The backdrop to this story is a seaside resort town's statue of Marilyn Monroe forever frozen in Monroe's famous windblown skirt pose from \"The Seven Year Itch\". This symbolic imported Hollywood goddess ultimately acts as the lead character a third parallel narrative. The statue speaks silently and ironically to what Naomi Wolf called the \"beauty myth\" as it plays out in the lives of these girls and women.<br><br>An hour or a day or a week after viewing Angels Wear White, the story will live on in your mind. The subject matter is in no way restricted to the lives of people in a Chinese resort town. The viewer will know that girls and women face similar issues with different details in Des Moines, Delhi, Dakar, etc. Feminist themes that might be routinely targeted to a particular demographic in our Hollywood commercial cinema transcend those boundaries in the film. Qu's adept storytelling is at once feminist &amp; humanist, realist &amp; figurative, and chillingly universal.","user":"angusfilmbuff","rank":[15,17]},{"title":"Vivian Qu is the Chinese Kathryn Bigelow","rating":24,"date":"24 December 2017","review":"When we talk about great female directors, we have to mention Kathryn Bigelow, who is known for her documentary-style camerawork and for her creation of an intense atmosphere. Vivian Qu, the director of this brilliant thriller \"Angels Wear White\", is just the Chinese counterpart of Kathryn Bigelow. <br><br>The scenes are realistically shot and depicted. The editing is amazing, the pace is comfortable, and the audiences always wonder what would happen next. Even in the last scene, people still wonder where Mia (Vichy Chen) is heading. The music score is light but effective. <br><br>Vivian Qu is even better than Kathryn Bigelow in terms of depth and complexity of the film. The thriller exposes the dark side of the Chinese society, where money and power control everything. <br><br>To summarize, \"Angels Wear White\" is the best Chinese-language thriller of all time.","user":"TheBigSick","rank":[7,9]}]