[{"title":"Don't do it to yourself!","rating":1,"date":"26 June 2019","review":"This is the cinematic equivalent of self harm (or overly dramatic munching on pinecones - spoiler) Horrendously bad, but at least it's inspired some of the most disingenuous and laughable reviews written by the cast and their friends.<br><br>If you want an insight into delusion, watch it and then read the reviews.","user":"ZeroRott","rank":[20,25]},{"title":"When the actress uses her real name to review the worst film of all time","rating":1,"date":"2 November 2018","review":"Never normally bother writing an actual review but I feel it is my duty to warn others how absolutely awful this film was. Anyone who claims a film other than this is the worst of all time hasn't seen this. Lacks any sense of direction, often makes no sense, half the film is fuzzy out of focus twigs although that is better than the horrific acting the only scary thing about this film was that someone actually signed this film off as more than a failed gcse project","user":"muamba_eats_toast","rank":[20,27]},{"title":"Made an account just to tell you how bad it is.","rating":1,"date":"9 November 2018","review":"Saw this film when it was making its rounds at film festivals.<br><br>Came here to see if others felt the same way and clearly some do.<br><br>One person actually credited in the film gave it a 10/10! How great.<br><br>The film is all over the place, relatively easy to follow but the pacing is just weird and not worth your time. Writing in general is clunky and obvious.<br><br>Acting is medium - some of it is a bit hammy but oh well.<br><br>Cinematography is ok, the idea is there but the use of the drone is obvious with the twitchy movements.<br><br>They go to the black forest to get to England, makes zero sense.<br><br>Also, the battle of Waterloo was not related to Waterloo until sometime after the battle, so it makes no sense that the soldiers would refer to going to 'Waterloo'. Some simple research would've helped with a lot of the film.","user":"volpusm","rank":[15,21]}]