[{"title":"Snoozefest..............","rating":1,"date":"2 March 2019","review":"Ignore anything that gives this more then 1 star as if the film is even interesting. The very words \"slow burn\" should be banned from movie reviews, when all you're watching is painfully slow and boring. This film acts as a strong tranquilizer, there isn't anything remotely interesting or realistic going on. I watched at least 30 minutes , struggling to stay awake . The cast is very small , you won't care or even be intrigued to find out what is going on. When one character had a complete non-reaction to finding something that anyone in real life would be horrified by, I gave up.","user":"hampersnow-28905","rank":[16,30]},{"title":"A bon-bon spiked with ground glass","rating":8,"date":"25 March 2019","review":"\"A stylish subversive treat, a bon-bon spiked with ground glass...\" - FilmInk\n\"Utterly, creepily convincing\" - The Australian\n\"Slick ripper...thriller\" - Jim Schembri 3AW<br><br>This film is not for everyone. It's a highly stylised genre piece, which asks the audience to think more ... to consider what if? Who can you really trust, who do you really know? Fans of \"You\" will enjoy the psycho thriller aspect, fans of \"Gotham\" will enjoy seeing Benedict Samuel (Mad Hatter) wrecking havoc. Read the critic reviews - they get the themes and discuss in an intriguing manner.","user":"AnnieKinnane","rank":[8,14]},{"title":"Get Pimped!","rating":5,"date":"8 March 2019","review":"Sarah (Ella Scott Lynch) is a young woman who is clearly dealing with personal issues and fighting with her own demons. While battling with her thoughts, she decides to get dressed and head out to her local bar where she meets a young handsome man, Lewis (Benedict Samuel). The two have a few drinks and get along nicely but little does Sarah know there is a bigger threat planned for her evening and her new lover may not be what he appears. Sarah is now trapped, with terrible consequences which she must face throughout the long night.<br><br>It should be noted that Pimped is an Australian film which has been delivered by director David Barker. This is also David's first directorial feature film.<br><br>Pimped is a film that relies on a small, strong cast and also a small location. To the director's credit, I personally enjoyed the overall look and style of this film (particularly the film's use of lighting), all of which I found to be incredibly creative and fun on screen. The film is mostly set within a home that looks old and also feels completely uncomfortable which naturally helps with creating suspense. Our Australian cast members (who honestly I was was a little unfamiliar with) also delivered great performances (in particular the actress Ella Scott Lynch) and I left the film feeling impressed with how suspenseful the film's tone actually is.<br><br>As one might expect, our film does contain twists and there are some turns. However, I feel the viewer's understanding of these twists or major plot points will in fact vary from viewer to viewer as some things are never clearly explained. I personally felt that I understood certain elements but sadly there are moments where I feel it would be very easy for an audience member to possibly think the wrong way. One could see a twist or plot point as something less or something more than what it was actually intended to be. It's a huge disappointment, considering all other factors are done well- kind of a glass is half empty or full situation. What you see and take away from the film could differ to what our director has intended (just my opinion).<br><br>As for the film's duration, Pimped is a rather quick film and I generally enjoyed the film's pacing, but sadly I did feel a slow burn at the start and once again right near the end of the film (more so towards the film's final ending prior to the credits). Once the film gets going, there is a fun experience that can be had, but it's mostly found within the centre of the film.<br><br>Overall Pimped delivers some stunning visuals and sets up a great world, particularly through the sets that we see for a good portion of the film. Our actors deliver good performances, but the sadly the film's major plot points or twists are told without any real confirmation and understanding revealed to he audience. Selected moments, particularly in the opening and closing of this film, can also feel like a slow burn. Nevertheless, for a directional debut by David Barker this is a proud achievement and I personally look forward to David's next upcoming film.<br><br>4.7/10\nWalkden Entertainment","user":"WalkdenEntertainment","rank":[7,14]}]