[{"title":"I nearly missed this gem","rating":9,"date":"30 October 2018","review":"I saw Kimi no Suizo wo Tabetai today, the second last day it was playing in my area. I had planned to see it earlier, missed it and gave up, until an opportunity came for me to see it at the last minute. I have to say, I am so glad I went.<br><br>Kimi no Suizo wo Tabetai is a romance/ slice of life that explores the life of an introvert who learns that a girl is suffering from a pancreatic illness. Of course, it's in the synopsis, but for me, I don't think the synopsis lived up to the movie. It follows an emotional journey for the two main characters that is hard to describe without spoiling. The unlikely bond between the to seemingly opposite characters is a joy to see, and genuinely makes you smile and cry at the screen throughout the film.<br><br>Some of the best anime films have been released recently, such as Kimi no Na Wa and Koe no Katachi (Your Name and a Silent Voice), and while I am unsure if I found it necessarily better than these films, I definitely found it more emotional and more real than the others. There was not a part of this movie that wasn't beautifully animated and captivating. It isn't a drag to watch, bus just a really sweet and masterful film. Kimi no Suizo wo Tabetai is one to see for sure.","user":"BillyGreg","rank":[32,35]},{"title":"A heartwarming message","rating":8,"date":"7 January 2019","review":"I was intrigued by this anime from the get-go. The title itself was eye catching as I had never seen such a bizarre name, and I sat down to watch it as soon as I got the chance. 'I want to eat your pancreas' is about a young girl named Sakura who was diagnosed with a pancreatic illness, and told she had only a little time left to live. This film not only is beautiful aesthetically but also through the story it tells the audience. The message is to live everyday like it's your last! If you liked other anime such as 'your lie in april' or 'Kimi no Na wa' this is perfect for you.","user":"Bright_eyes_17","rank":[8,8]},{"title":"What is important about a movie?","rating":9,"date":"23 January 2019","review":"I think the answer to my question is: \"the message\". As you can see from my profile I rarely give high ratings but I think this movie deserves my 9 because I left the theater richer than when I entered. This movie makes you realize that often we take for granted so many things that actually aren't and we often focus on things that are not so important. I consider myself a rather cynical individual but I deeply appreciated this movie since it delivers a pure message and is an ode to joy, life, sharing, caring, empathy and love for ourselves and for others.","user":"cuccu","rank":[16,18]}]