[{"title":"The Swindlers Review: A one-time watch!","rating":7,"date":"15 March 2018","review":"Movie: The Swindlers (15): Action/Crime - Korean<br><br>Positives:<br><br><ul><li>The performances of the lead actors are decent.</li><li>The screenplay is for the most part gripping.</li><li>The action sequences have been shot and executed quite well, most notably a terrific car chase.</li><li>The film starts to get thrilling towards the end, and the climax is quite an unexpected as well as an amazing one.</li></ul><br><br>Negatives:<br><br><ul><li>The story takes its time to set up, and in the process the writing at times turns a bit uneven.</li><li>The editing is also not without its share of flaws, as the film could've been trimmed slightly.</li><li>The dramatic aspect has not been handled very well.</li></ul><br><br>Repeat value: Low<br><br>As a whole, THE SWINDLERS is an entertaining and a decently made crime action film which is worth watching watching once, if you're interested in movies of this kind.","user":"Prashast_Singh","rank":[10,12]},{"title":"No dragging moments","rating":9,"date":"11 November 2018","review":"There are a lot of swindling and con movies but what I like about this film is that there are no dragging love/romance scene or parts.<br><br>Just pure outwitting between the antagonist and protagonist.<br><br>Plain and simple plot but how each scene is revealed is amazing.","user":"geezelle","rank":[6,7]},{"title":"Worth your time, when you got nothing to do","rating":7,"date":"6 January 2018","review":"Lately, there are movies with similar storyline and similar plot twist like this one, the difference thing about this movie is about simplicity. The storyline is made simple with an easy to follow twist. It may seem to underestimate the viewers, since some of us able to guess the storyline from the early parts of the movie.The main character is too comical, but who stole attention is an antagonist character. Personally, i recommended this movie, if you just want to killig time, and watch something without frowning","user":"pjchriz","rank":[7,12]}]