[{"title":"Deserves attention","rating":10,"date":"31 January 2019","review":"This film isn't as striking as Revenant or as thematically deep as Valhalla Rising, but it sure gets close.<br><br>I didn't choose to mention those two titles casually. Il Primo Re uses a similar range of storytelling devices: minimal dialogues, stunning visuals, a very realistic environment, metaphysical experiences. This provides the film a very immersive style, that can be perceived probably a bit slow, but that also elevates the release's quality.<br><br>The interesting part is that Il Primo Re reinterprets a well-known myth but stays faithful to its roots, and merges is with realistic historical settings. The villages, armaments, religions depicted mostly are very close to those that could've been during the pre-roman period.Obviously Il Primo Re mustn't be considered a historically accurate film, but it certainly gives the feel of that archaic period.<br><br>What I particularly appreciated was the choice of using latin as language. It is not the first time this happens, an example is Mel Gibson's The Passion, but in The Passion the pronunciation that was used was the scolastic one, which was developed in the middle ages (and I personally know that from my high-school studies of the language). In Il Primo Re they managed to use the original pronunciation of latin, and I believe probably they adopted an archaic vocabulary and sintax, which is admirable.<br><br>Criticisms can be drawn: the final climax is not that huge as the build up suggests (let's not forget italian films have a much more limited budget), it doesn't manage to be as thematically deep as the films I've mentioned earlier and sometimes it drastically shifts to being an action movie.\nI personally acknowledge these negatives, but still feel that the positive aspects outweight the negative ones. This film is so far unique in italian cinema, it definitely attempts at being something new, and therefore I think it deserves consideration","user":"t-viktor212","rank":[58,79]},{"title":"admirable","rating":21,"date":"21 July 2019","review":"A splendid film, reminding a Latin text. Not for the use of language but for the admirable precise simplicity. A film about birth of Rome. The story is familiar, at the first sigh, from school years. In fact, a profound inspired history of Rome. Level by level, event by event. Because it is a film about brotherhood and murder, about \"the others\", about gods and atheism, about power, love, sacrifice, weakness in force , about relations and, sure, about the death as seed for a great project. A film who you feel. And it is enough.","user":"Kirpianuscus","rank":[13,16]},{"title":"Such a powerful movie","rating":10,"date":"1 February 2019","review":"The Italian director Matteo Rovere, with all the crew, did an awesome job with this movie. They collaborated with some of the most prestigious universities in Italy, with the purpose of trying to make this film as realistic as possible. The cinematography is excellent, even the photography is just perfect.","user":"rickyalvarez-89650","rank":[43,65]}]