[{"title":"Visually Stunning & Just Plain Funny","rating":8,"date":"26 December 2018","review":"Rating 8.3/10\nBest acting performance by Jin Zhang , Dave Bautista and Tan Sri Michelle Yeoh !! The fighting choreographies were amazing with literally unbelievable yet beautiful moves . If you're in the right frame of mind and preferably with a bunch of friends , this film should be loads of fun !!","user":"ymyuseda","rank":[141,204]},{"title":"Effective spin-off","rating":8,"date":"3 November 2019","review":"Max Zhang returns for the lead actor role in MASTER Z: IP MAN LEGACY, a spin-off from Donnie Yen's popular IP MAN saga. Zhang played an arrogant rival in the third in that series, but here he's in retirement having opened up a grocery store with his kid. As with all martial arts films, he doesn't stay retired for long, and soon a plot involving a local gangster organisation and a drug-dealing top chef comes into play.<br><br>With direction by the acclaimed Yuen Woo Ping, MASTER Z is a brisk and efficient movie with strong production values and an excellent cast. Zhang gets to show more of his human side here, while there are fun cameos from Yuen Wah and Tony Jaa. Dave Bautista plays a role similar to the one essayed by Mike Tyson in IP MAN 3 but he's even better and more imposing. Michelle Yeoh takes what could have been a stock villain role and puts real character and strength into it.<br><br>As per usual, the emphasis of the movie is on the fight scenes and they're quite excellent here. Woo Ping can't resist turning to wirework but it's not too in your face, although the scene in which the characters jump between street signs doesn't obey the laws of gravity all that much; the climax of the Thai fight flick CHOCOLATE was much better. The multiple opponent brawls are hugely entertaining, but the real highlight is the lengthy one-on-one with Bautista at the climax, which really satisfies.","user":"Leofwine_draca","rank":[4,4]},{"title":"Wonderful enjoyment","rating":8,"date":"25 August 2019","review":"I am the biggest 'anything' IP Man fan! This was so much fun. You know, the acting at times was a just a bit unpolished but the lead actor is great and the fighting scenes... no way could they be real... but brilliant ad fun to watch. Just what I needed today! If you like to enjoy your martial arts I say watch this and be pleasantly surprised!","user":"eyeintrees","rank":[4,4]}]