[{"title":"Poor performance can't save the good idea","rating":2,"date":"10 October 2018","review":"The basic idea of a horror movie revolving around a bunch of YouTube influencer who are searching the next thrill for a couple of likes more is quite good. Even the setting is excellent, and the stories behind the sanitarium have potential. But after 10 minutes into the movie, you get sick by the lame comments and actings of those main characters. All of them are exchangeable, so they leave no impression whatsoever behind. As a matter of fact, you wish they die fast and cruelly. As much as I like setting and atmosphere - which really grows denser the longer the movie takes - at the same time I disliked all of the lead characters, which made the movie unwatchable.","user":"mrfoxx-70466","rank":[25,29]},{"title":"Haunted Hospital: Heilstätten","rating":1,"date":"24 February 2019","review":"*** This review may contain spoilers ***<br><br>*Plot analyzed*<br><br>An extremely annoying video (not a film at all) with youth culture written all over it. A bunch of morons, with no redeeming qualities except to destroy, harass and elicit juvenile emotional responses from each other, form the 'meat and bones' of what we see. They spend some time at a \"haunted hospital\". Their puerile pranks get weary after about 2 minutes. Lacking any intelligence, we really don't care what happens to them.<br><br>The setting is significantly eerie but put to bad use by the inept videographer (not a film director at all). Quick jumps, bad lightning (intended) and idiotic editing further drag this into the mud.<br><br>The ending is entirely absurd, preposterous and ludicrous. It does not deviate from the now-standard formula of \"found footage movies\" that now permeate the horror market.<br><br>Awful.","user":"osloj","rank":[8,9]},{"title":"If you watch this film as a whole, you may be in need of a cure yourself","rating":2,"date":"3 March 2019","review":"\"Heilstätten\" or \"Fear Challenge\" is a 1.5-hour German horror/thriller movie from 2018, so still relatively new and this one was directed and co-written by Michael David Pate. If you have heard the name, then you know what you are in for. He is the one who came up with the infamous Kartoffelsalat movie before that where he told a horror/zombie story involving some of Germany's most known Youtubers. And \"most known\" here means \"most ruthless\" and \"most fake\" too because the cast members were predominantly people who are known to the trained eye for product placement and tricking mostly young audiences into buying the stuff they advertize while fake-trying to convince everybody that these are the products they are really using. Their videos are scripted from beginning to end whil pretending for interesting and surprising stuff to happen, or in short these are exactly the Youtubers you don't want to watch and also you don't want your kids to watch. FreshTorge was the star in this older film and he is also in this new movie we have here, but really only very briefly early on most likely lying to people in some kind of publicity stunt to make this film more known I assume that he is really scared of/during horror movies. Some probably watched the film because of his name attached to the project, but if they were smart enough they switched the film off pretty quickly. Because all that followed afterwards was not good at all. The beginningw as already, but slightly tolerable. However, the \"scarier\" the film became, the worse it got too losing itself in infrared camera recordings that were supposed to add everything, but in fact added nothing in my opinion. Lets take a look at the cast. I must say I have no idea who the boys are if they are actual actors or more Youtube influencers. The girls are slightly more known. Gerhardt has appeared in some prestigious projects and she is somewhat the female lead. But I don't really see a lot of talent in her either, so don't think she is good only because she is better than the really weak rest. korol has been Tina in Buck's Bibi and Tina franchise, but her role here offers really nothing. I must say I was a bit surprised though about Gerhardt's looks. Don't have her as attractive in my mind, but the non-blonde hair suits her pretty well. But yeah, can you really blame her for not turning the role of a Youtube influencer/influenza into acting gold? It is an impossible challenge you could say, even if she tries her best. You can blame her though for accepting the role. Now as for the story, we have a bunch of young people travelling to Heilstätten, a location where Nazis dealt with people suffering from tuberculosis in the first half of the 20th century. So it is a dark place really, even if it sounds like a wellness town. But yeah, it is pretty disrespectful to make a garbage film like this on such a meaningful location, especially as they were taking itself really seriously making this movie here. It is never scary, it is never entertaining, it has never at least guilty pleasure potential. It is just plain bad. It is really tough to find anything positive about it. One thing you could mention is that it actually depicts influencers as fake to some extent, which did surprise me bit. There is one scene when we see her pretend to her fans that her boyfriend is her ex-boyfriend, so she seems single to them and probably attracts more male fans I don't know. There are 1 or 2 other references depicting that it is all make-believe and nothing you see is real and you will recognize them if you watch this film. But even there, Pate was far from being as bold as he could have been when elaborating on this subject. But that is no surprise obviously after shooting Kartoffelsalat and lets be honest here the irony is priceless already this way with him including stuff like that and then having FreshTorge in his cast who is probably top5 of the phonies here in Germany. Now back to the film, it is incredibly bland, uncreative and never a success. Skip it. Highly not recommended.","user":"Horst_In_Translation","rank":[9,11]}]