[{"title":"Nothing special.","rating":5,"date":"10 September 2019","review":"The good: it's grain and well-shot. Congrats for hiring a real DP and film crew with actual knowledge of camera placement, movement and lighting. Most of the cast is good. The music is rocking, and adds to the overall good atmosphere. The makeup is quite professional. The horror is adequately tense.<br><br>The bad: the guy playing the baddie is bad at acting. And his dialogue is so idiotic. It would have been much better if he was mute. And the overall film is just kinda there.","user":"Otkon","rank":[22,25]},{"title":"Brutal, intense and gnarly AF!","rating":7,"date":"19 September 2019","review":"Artik is one of the most bad-ass indie horror thrillers to surface. There is so much to absorb from this film and it continues to hit you even after it ends.\nHolton becomes an unintentional ally to pre-teen Adam an abused boy speeding down a very dark path. Their unintentional friendship will set off a dangerous chain-of-events that will leave your jaw on the floor. Adam's parents, played skillfully by Lauren Ashley Carter (Gags) and Jerry G. Angelo interact with Adam, but neither are who they present themselves to be. A bit of misdirection at the beginning is purposeful, yet effective to the progression of the story. There are a couple of areas that leave the viewer to make some assumptions of their own but it's not a huge misstep and doesn't pull you out of the film.<br><br>Watching Artik is like watching a train wreck, as in you can't look away. It's as if you are a voyeur and shouldn't be seeing any of this. It's shocking, uncomfortable and gruesome but you desperately need to see how and if the chaos will resolve. I love the psychology of this film as it explores the argument of are killers born, made or a combination of both. As well as the nature versus nurture theory. Just how much does our environment shape the person we become?","user":"quinn317","rank":[8,10]},{"title":"Pretty Cool & Quite Flawed","rating":4,"date":"11 September 2019","review":"With a nice poster from the awesome artist Christopher Shy &amp; a confusing but decent trailer \"Artik\" landed on my watchlist and, well, managed to disappoint me more than to impress.<br><br>\"Artik\" seems to have all the right ingredients for an awesome ride of horror including well done visuals (nicely done practical gore, actually great cinematography and lightining, kind of grindhouse-ish look etc.), a pretty typical but cool and fitting original score (not so great overall sound editing though), a great looking, murderous villain, rural setting and whatnot. Sounds good, but there were many faults regarding the acting, the story and the point of it all. First of all, the performance behind the character of Artik himself was... shabby. I'm not sure if it's bad acting all around or just an inability to act with voice, but something was off there. The rest of the performances were alright, with Chase Williamson on top. The biggest issue is the story - the synopsis here on IMDb sounds more interesting than it actually is. People have been praising \"Artik\" saying that \"if you like comic book movies, you'll like Artik\". I disagree, the comic book shtick plays a very small role in the plot, amounting to only visual references, without having much impact on the overall idea of this flick. Could've been anything else instead of comic books. Also, most of the characters are pretty underdeveloped and don't get a proper closure, because the last 15 minutes are a tiring edit of small scale action scenes. And then it ends. I have to say that the 69 minute runtime (without the end titles) plays in favor of \"Artik\", in favor for the viewers.<br><br>I don't regret watching \"Artik\" and I liked it just enough, but I can't call this a good movie - it's almost good. One side of the coin is shiny enough, but the other oh so rusty. My rating: 4/10.","user":"TwistedContent","rank":[8,10]}]