[{"title":"Nothing Gangster About This","rating":3,"date":"9 January 2018","review":"If you're a fan of mob movies, this will be a heavy disappointment. The storyline isnt that engaging as much as the actors try to do their best to imitate the gangsters of the 20s/30s","user":"Thugs_cry","rank":[18,21]},{"title":"A Little Too Polished","rating":5,"date":"30 January 2018","review":"I'm a sucker for a gangster film. I grew up in the days when classic films played on TV all the time on UHF channels. My film education included watching those movies made by James Cagney, Edward G. Robinson and Humphrey Bogart when they played the toughest gangsters to be found. I also have felt that THE GODFATHER is perhaps the best movie ever made. So gangster films are a genre I enjoy.<br><br>GANGSTER LAND takes a look at the Capone mob in Chicago as seen through the eyes of \"Machine Gun\" Jack McGurn (Sean Farris). McGurn's real name was Vincenzo Antonio Gibaldi, but as he explains in the film boxing promoters were more inclined to book Irish fighters than Italian. As the film opens up that is McGurn's dream, to become a professional boxer. He's good and could actually make it. But when mobsters kill his father in front of his store, McGurn sets off on a path of revenge.<br><br>Taking up with a young Al Capone (Milo Gibson), the second man under Johnny Torrio (Al Sapienza), McGurn slowly develops into an asset used to enforce the rules of the street for the gang. His abilities come in handy because this is just as a war among the Chicago mobs of Torrio and George \"Bugs\" Moran (Peter Facinelli) are coming to a head.<br><br>Mobsters are dying everywhere, shot in the streets of Chicago to the consternation of the honest police seen here as Detective Reed (Jason Patrick) and Detective Boyle (Sean Kanan) while corrupt officials continue to take payoffs in return for a blind eye to the issues at hand. This blind eye is what eventually leads to the FBI sending in Elliott Ness and his crew to take down Capone.<br><br>Jack moves up the ladder of success in the mob and picks up a steady girlfriend in the process named Lulu (Jamie Lynn-Sigler). Lulu has dreams of fame and uses her contact with Jack to help achieve that but it's not near what she wanted and while she loves Jack there is a bit of fear mixed in as well.<br><br>Eventually the infamous St. Valentine's Day Massacre makes its way into the story, mainly because many felt that McGurn was the man responsible for planning the deadly attack. Its ramifications on the mob wars in Chicago would be lead to peace for a while and eventual payback. It remains one of the most brutal killings of all time. It will also lead to the inevitable finale of the film.<br><br>While GANGSTER LAND wants to become a major player in the world of mob films the odds are against it. To begin with there are so many great films in the genre that it will never be an easy task to achieve such a lofty goal. But here we have more than one issue going against it. To begin with the film seems too pristine, too clean in both the costuming and set design. Everything is too new and doesn't have that sense of realism in it that would have made it more believable.<br><br>The story seems fine but the dialogue seems stiff at times and feels more like a parody of classic gangster films than an addition to that catalog of greats. Even the actors at times felt like they were wondering if the lines they were saying fit or not. This is not to say the acting here is sub part. As a matter of fact all involved do their best to bring life to this somewhat lifeless story.<br><br>Farris has the tough job of making us feel sympathy for McGurn while at the same time making him menacing. He falls short of the menacing portion here offering a scowling bad guy as opposed to one who feels deadly. Gibson, son of actor Mel Gibson, does a solid job here but isn't given more to do that make proclamations of anger or act as a consoling confidant of McGurn. Sigler, whose ties to the cable series THE SOPRANOS would seem to make her a perfect fit shows that her acting skills are not the greatest and odds are parts in lesser known films will be her career from here on.<br><br>All of this being said it might seem as if I'm piling on negative comments on the film which isn't quite the case. Taken on its own the film does offer an evening's worth of entertainment for crime fans or fans of the genre. But when the bar is set so high with the films that came before this one, reaching that bar is not an easy task. It might not reach that bar but at least it makes an attempt to do so.","user":"kirbylee70-599-526179","rank":[7,7]},{"title":"Nothing New or Exciting Here","rating":3,"date":"4 December 2017","review":"Unless you already know the main characters making up the various Chicago mobs of the 1920's and 30's you will most likely not understand this movie. It is mostly a collection of well-known incidents (the St. Valentines Day Massacre for example) and extreme violence along with standard \"mobster meets dance joint showgirl\" interludes.<br><br>Because the entire story of the Chicago mobs are not explored in greater detail and the actors don't look much like their real life counterparts it is often difficult to follow the action when one gang is attempting to waylay the other(s). Even the 1950's TV program \"The Untouchables\" offered a lead-in before each episode that explained a bit about the history. This movie just begins cold.<br><br>I gave the movie a 3 for the photography, sets and costumes but the storytelling leaves a lot to be desired. Anyone who knows the actual history of gangs in Chicago will wonder why they made this movie.","user":"gsfsu","rank":[24,30]}]