[{"title":"Excellent","rating":10,"date":"7 August 2019","review":"This movie was excellent! And wrongfully rated R. Was a very tasteful love story.","user":"savanahpowell","rank":[8,13]},{"title":"Went in with low expectations...ending up loving this film!","rating":9,"date":"10 August 2019","review":"Although unabashedly borrowing from \"An Affair To Remember\", this story kept me enthralled the whole way through. It's a warm and simple love story. Wait, I stand corrected. \"Simple\" doesn't sum it up. The gorgeous and authentic St. Petersburg locations and the cultural influences woven into each scene elevated the cinematography and the script out of the ordinary and into \"surprising\" film territory. If you are a true romantic with a travel bug, definitely watch this film!","user":"kim-lynn-mclean","rank":[6,9]},{"title":"A Surprisingly Heart-Deep Film You'll Enjoy","rating":10,"date":"3 January 2020","review":"The storyline of bad-boy playboy redeemed by the integrous, humble beauty is common because we appreciate stories of redemption. They make us feel redemption is possible for us; they make us hopeful, so it's no wonder we're drawn to them. While most of these archetypical storylines are predictable--even scene by scene sometimes--this one is less so. It echos An Affair to Remember (1957 Cary Grant &amp;1994 Warren Beatty), but its unique \"backdrop,\" the world of Major League Soccer (MLS), allows this film to stand on its own. Redemptive stories about professional soccer players are fewer than cliched football/baseball/basketball storylines, lending freshness to this film. We get our happily-ever after, but the climax is more complex than expected, which is emotionally engaging. Ryan and Lana must work at reuniting, but what keeps them apart is understandable and thus, forgivable. Liam McIntyre's \"broken playboy\" is effective because he portrays the pre-injury, big-headed jerk with embarrassingly cringe-worthy hubris, making his brokenness after the \"fall\" realistic. The arrogant playboy gets the sudden, overwhelming \"fall\" he needs to arrive at the clarity and perspective that makes living and striving truly satisfying and rich. At first, chemistry between McIntyre and Jenia Tenaeva, who plays Lana, feels uncertain, but once Tenaeva's Lana opens her heart to Ryan, their chemistry is beautiful--enough to make their reunification feel authentic and cheer-worthy. Whether or not romantic films are your go-to, this one will capture and delight you in fresh ways.","user":"clementinashops","rank":[3,4]}]