[{"title":"Bad Underwater Scenes","rating":4,"date":"28 August 2019","review":"Rating 4.0/10\nThe first time i've seen the trailer i thought the movie would be amazing and full of thrilling scenes, unfortunetly i was wrong. The acting in it are mediocre and falls short of satisfaction. Not only that, the storyline not as good as i hoped. Truly bad shark movie.","user":"ymyuseda","rank":[246,301]},{"title":"The masks","rating":2,"date":"26 October 2019","review":"This destroyed the movie for me: they had diving masks on, and they talked to eachother throughout the movie. BUT, the ears were outside the masks and NO ear plugs. How is it possible to hear anything then? And don't get me started on the underwater music!","user":"hegeolsen","rank":[89,110]},{"title":"Look out! Blind cave sharks who are also apparently deaf.","rating":4,"date":"27 August 2019","review":"The basic plot is a group of teenage girls go diving in a submerged Aztec city only to find it is infested with giant blind cave sharks (note the white eye on the shark on the poster). The sharks must also be deaf because they fail to home in on the noisy teens on multiple occasions.\nThis is basically a \"last girl\" slasher film with all the jump scares and stupidity, but the slasher is replaced with sharks.\nThey have full face mask scuba gear with radios so we can hear them whimper, cry, and scream throughout the last 2/3rds of the movie.\nThe characters die in a fairly predictable order and nothing particularly surprising happens until near the end when they amp up the crazy stuff in an attempt to add to the tension.\nThe very end was pretty ridiculous.... I almost wish they had ditched the \"Hollywood ending\" and gone with what would have happened to the characters had the final action events really occurred.\nHad the filmmakers just taken a step back and decided to not make the movie so formulaic with a bit more attention to not being so unrealistic as to break the suspension of disbelief it would have been a far better movie.","user":"bbretall-1","rank":[55,71]}]