[{"title":"The choking on the rock was hysterical","rating":2,"date":"30 January 2019","review":"Ok. Let's be real. There are way worse horror movies than this. If you have amazon prime believe me there are tons worse than this. This movie was bad and stupid though. I admit. But, I burst out laughing when the girl that decided to be a human ouija board started to choke on the rock. You can't weeze if your truly choking to death and watching them lay her down to do cpr with the rock still lodged. I'm sorry it was just too funny. Two stars for comedy","user":"shaneandamy-19629","rank":[12,12]},{"title":"Ouija House: The absolute pits","rating":2,"date":"27 November 2018","review":"2018 really has turned out to be one of the worst years in cinema history, at time of writing I believe it's about the 5th worst on my accounts analytics. Movies like Ouija House certainly aren't helping to rectify this.<br><br>Now when the opening credits kicked in I actually managed a little bit of a hope. Among the credits were horror veterans Dee Wallace and Tiffany Shepis alongside Tara \"Oh Dear\" Reid, Mischa Barton and Chris Mulkey. Little did I realise however that they range from small roles to mere cameo appearances so don't go in for the cast!<br><br>It's yet another ouija film but with a twist, and the twist is terrible. Not only does it bring nothing to the sub-genre but it made this movie barely followable and entirely unlikeable.<br><br>With the confusing poorly constructed plot, the questionable cast advertised and a front cover that displays a house that isn't even in the movie it's clear that little thought or effort went into Ouija House.<br><br>It was truly a chore to watch.<br><br>The Good:<br><br>It's nice seeing Mischa Barton looking healthy for a change<br><br>The Bad:<br><br>Another random clipart house on the cover<br><br>Tiffany Shepis is wasted<br><br>Some parts of the story are alarmingly stupid<br><br>Things I Learnt From This Movie:<br><br>General rule of thumb, if a movie has Ouija in it's title.....skip it<br><br>Tara Reid's career is in such a consistent spiral I'm just waiting for her to be in a new Baby Geniuses movie","user":"Platypuschow","rank":[17,18]},{"title":"As bad as it can get","rating":1,"date":"29 August 2018","review":"Worst horror I've seen and I've seen some really bad ones, terrible storyline, terrible script, terrible acting, I laughed most of the time at the ridiculousness of this movie. I fell asleep after ten minutes to wake up to the most unconvincing demonic scream I've ever heard, it was laughable. The whole movie from start to finish was awful and the ending is so ridiculous I couldn't stop laughing. I know it was made on a budget of about ten dollars, but it never fails to amaze me that a director, producer or even the actors would say \"Yeah that works. \" be ashamed of yourselves, be very ashamed and find new jobs that has nothing to do with making movies because you're talentless. Rant over.","user":"milesd-90529","rank":[21,24]}]