[{"title":"IT JUST DOESN'T MATTER","rating":8,"date":"6 November 2018","review":"Bill Murray is the Banksy of public performance art. He's a warm, wonderful oddball who just might crash your next event, however small, or insignificant, and instead of dominating the room from a celebrity perch, he just blends in. These life bombs of wedding pictures, kickball games and karaoke bars, are now the stuff of urban legend. Though with digital proof, they are just legend.<br><br>Why a Hollywood hotshot would chose to mingle with his audience, sometimes for hours, is the question documentarian Tommy Avallone tries to answer in this rather fine film. We see the famous grainy footage: Bill tending bar, Bill washing dishes at a party, Bill treating a stranger to World Series tickets, and we meet the giddy recipients of these pop-up moments.<br><br>As theories are bandied about, it becomes clear that there is something transcendently magical about these experiences, for everyone involved. Less about giving, and more about sharing, Murray's connections are real, unscripted, joyous.<br><br>Tommy spends the whole of the movie tracking down the elusive movie star, culminating in an encounter which plays true to the spirit that Murray has cultivated.<br><br>Quite a lot of fun.","user":"js-66130","rank":[29,34]},{"title":"A great capturing of a regular guy who happens to be a Super Star","rating":9,"date":"31 December 2018","review":"Several years ago, a friend told me a story about when she &amp; her husband were on a flight when she went to hand her empty glass to an airline steward. Being a stewardess herself, she quickly realized the guy who was taking up trash wasn't an airline employee - it was Bill Murray. He volunteered to help gather trash! Great story - which is repeated in different ways several times during this documentary. Such a great guy who likes to make people feel better. This is totally worth 1:10 it takes to watch this show. Highly recommend it!","user":"dano1330","rank":[14,16]},{"title":"No One Will Ever Believe You","rating":8,"date":"13 January 2019","review":"This was a surprisingly good documentary. I think that the main premise was to try to make philosophical sense out of Bill Murray, the man. It doesn't start out that way. The beginning makes you feel as if the shows premise is the phenomena of Bill Murry stories. There are some heartwarming footage of Murray at various venues having just popped up randomly. Interspersed are some movie clips; and, the theme switches there to philosophy.<br><br>If you love Bill Murray, you'll love this movie. If you don't, after watching this movie, you'll love Bill Murry... then, after you've watched the movie a second time, you'll love this movie.","user":"masercot","rank":[9,10]}]