[{"title":"Totally Recognizable Villany","rating":8,"date":"8 January 2019","review":"A terrific Spike Lee film with humor and gut wrenching truths. My first reaction was that the villains were too one dimensional, caricaturesque. It was impossible to stay with them for more than a few seconds - even that outrageous scene of connubial bliss where she expresses her willingness, in the most romantic terms, to kill Blacks. I recoiled in horror and kind of laughing nervously - what is this, a satire? And then, I realized - the real life villanis are one dimensional, they are caricaturesque, they are their own satire. John David Washinton is great and sounds just like his father. Adam Driver brings a presence that is nothing short of compelling, The final real life images are devastating, I highly recommend it.","user":"normando40","rank":[255,362]},{"title":"Based on real events in 1970s Colorado, a black police officer joins the KKK.","rating":16,"date":"16 November 2018","review":"My wife and I watched this at home on DVD from our public library. Although it runs a bit long at just over 2 hours it is such an interesting story, well-told, that it never seemed too long.<br><br>The whole story is based on the 2014 book by Ron Stallworth, of his experiences in the 1970s in Colorado Springs as a fresh police officer, and the first black man to that position in that city. The character is very well played by John David Washington. In real life Stallworth had been an achiever in high school and wanted to make a difference as a police officer.<br><br>On a whim he notices an ad which was recruiting members for a new KKK chapter in the Colorado Springs area. Having a phone voice and speaking manner not easily identified as black he successfully applied for membership, and at one point even speaking directly to David Duke in New Orleans.<br><br>Ron would not have gotten very far in his ruse without a white man to replace him in live encounters, for this he recruited the help of fellow police officer,\nAdam Driver as Flip Zimmerman who happened to be Jewish, another ethnic target of the KKK. Together they thwarted some serious KKK mischief planned.<br><br>For a very serious subject the movie director Spike Lee injects a fair share of humor, all very appropriate. Near the end the events of the 1970s are intercut with modern events and protests, showing that white supremacy activities are far from over.","user":"TxMike","rank":[132,200]},{"title":"Incredible true story comes with a lot of fictional baggage","rating":6,"date":"20 August 2018","review":"There's much good about this movie, starting with Ron Stallworth's incredible deception of the Klu Klux Klan. Racism in all its ugliness is powerfully shown. There's a lot of humor at the expense of some really dumb people. \nUnfortunately, there's a lot wrong with the movie too. Most of this is because the director embellished the true story. I'm not a big fan of directors tinkering with what really happened in order to add their own touch, and then still claim \"based on a true story\".\nThe result of the tinkering is a very uneven movie, particularly in the apparently \"easy\" parts of infiltrating the KKK and the \"hard\" parts where things go wrong. The \"easy\" parts are, remarkably, mostly the true story. Apparently this wasn't dramatic enough, so a lot of fictional \"hard\" parts were added to build tension including whole characters and situations. That's bad enough, but the added parts often made no sense, such as having no real origin (like one character's intense suspicions) and no resolution to the dilemma presented - they just seem to go away, are forgotten or have no effect on the inevitable story arc. Many seem to have been thrown in only to make already duped people look even more ridiculous. \nThe characters themselves are, with a few exceptions, just caricatures. It's not hard to figure out what's next since they do exactly what you expect.\nEventually the movie just got boring since it all moved to an inevitable and very easy to see end. Ultimately, the movie is maybe an hour of an amazing true and humorous story marred by over an hour of superfluous and poorly executed fiction.","user":"tkmcc-08780","rank":[365,588]}]