[{"title":"Goosebumps","rating":9,"date":"17 August 2018","review":"This is not an ordinary movie. In an aestetic and moody way it can be compared to \"Walhalla Rising\" by Nicolas Winding Refn. The heavy use of chiaroscuro effects give such a powerful feel and quality to the pictures. In fact the stills appear like Rembrandt paintings. The very gloomy mood is perfectly supported by the very slow pace and symbolic, shamanistic elements. <br><br>In parts it felt like an LSD Trip that made me write my first review on IMDB. Highly recommended for people who have seen it all.","user":"zorankostic","rank":[83,116]},{"title":"As good as Robert Eggers' THE VVITCH? Oh hell yeah, it's better","rating":9,"date":"25 August 2018","review":"In Germany this film is often compared to, used in the same sentence with, Robert Egger's THE VVITCH (2015). Google actually translates the title to \"Hagazussa - The Witches Curse.\"<br><br>The first thought that came to me during the opening title sequence was, if the rest of the soundtrack is like this, it's going to be amazing...and it was! Understated but dark and menacing. You won't mistake the sound score for anything but disturbing horror.<br><br>The film is divided into four parts: Shadow, Horn, Blood and Fire. At the start you can't help but feel compassion and concern for the young girl taking care of her sick mother, both isolated outcasts and thus thought of as witches. HAGAZUSSA is spooky old world horror set in 15th century Europe, beautifully eerie, with many scenes that I can only describe as CREEPY AS HELL, while other scenes are like a slow burn nightmare on 'shrooms; hypnotic and hallucinatory. Dialogue is used sparingly, only as needed, but it's enough and much else can be gained by studying the facial expressions of the characters and other plot clues providing context...the acting and all else in that regard is first rate. Yes, the movie is slow paced, but also full and rich, ripe with suggestion with moments of interpretation and realization. Also incredible scenery/cinematography with nature itself becoming a hostile mood-setting character.<br><br>As good as THE VVITCH? Oh hell yeah, and this is coming from someone who really liked THE VVITCH. HAGAZUSSA is much darker and in my opinion it exceeds that film in every way, including its historical religion-based presentation of paranoia-driven superstition and madness. And it even has its own version of Black Phillip! Okay, it's a black goat, but you can't help but make the connection within the context.<br><br>Who would I recommend it to? If you are a horror fan who doesn't always need to be spoon fed nonstop gory scenes of people being brutalized - if you liked THE VVITCH for example, and have the patience to let a slower paced film develop while you soak it all in - not only should you see this movie, you should sell your soul to find a copy. The realistic fragility of life is there anyway but it's within the scope of very dark and stark atmospheric horror.<br><br>Final impression: WOW! Mind blown.","user":"Mike_Olson","rank":[81,126]},{"title":"This movie is something very different...","rating":8,"date":"8 June 2019","review":"We live in an extremely fast paced world....overfloaded by stimuli that are all around us. Used be able to get from A to B in no time....and most movies of our time adapt this pace.<br><br>But this one is different. It is not only set in very different time, it IS this different time. This movie lets you feel the slower pacing of old times. What some critics consider painstakingly boring, is just the clash between live has been paced a long time ago and how it is now. It is menacing - and I think it is supposed to be.<br><br>There is a nearly absolut absence of dialog. There are only a few sentences spoken in the entire movie. That is another clash between days past and our time. We talk all the time, chatter about just anything. But not in this movie. There is no need to talk. Just feel it.<br><br>And this movie is a lot about FEELING it. The main character does not elaborate or think about things - she just feels...like an animal. Just be and feel.<br><br>This movie doesn´t make sense. There is no plot that has to make sense. This is just being. It is what it is.<br><br>I have to watch it again to decide if I give it an even higher rating.","user":"kathrinmaass","rank":[19,26]}]