[{"title":"What a waste of my time","rating":1,"date":"9 December 2018","review":"If i can rate this movie in negative number, i would give it - 20. It's just so bad, the reactions of every character is just so awkward? I understand that it tries to create a comedic slasher movie but the actor and actresses acted so badly???? There are differences between awkward and comedic and this movie only contains awkward actresses and bad dialogue. Not recommending this to anyone at all. What a waste of my time.","user":"akroes11","rank":[8,9]},{"title":"Painfully Bad, unambitious and unoriginal","rating":1,"date":"26 October 2018","review":"I wish I had read the description before watching (part of) this. All you need to know is that the description uses the phrase 'in a remote cabin'. So yeah, all of the cliches are done in this movie, there isn't one, single moment of tension or surprise.","user":"genious-35413","rank":[17,26]},{"title":"Weekend of life or death","rating":3,"date":"1 January 2019","review":"Actually really wanted to like 'Killer Kate'. It actually looked good from how it was advertised and the look of the film was a long way from amateurish. It looked and had real potential to be a fun and thrilling fun with a suspenseful horror vibe. As well as the premise for the film, which immediately had me gripped and interested into seeing it. It may not have been a creative one but you know a film is doing something right when the film's premise makes one root for it to be good. There was a lot of promise here.<br><br>'Killer Kate' generally failed to live up, while not completely wasting, this promise. Despite rooting for it to be good, 'Killer Kate' just wasn't. Though there are far worse films in existence. There are a few things that are done surprisingly well, things that one does not expect them to be and perhaps be the things that would be left wanting considering budget. Sadly those are outweighed by how the execution of everything else is enough to make one throw their hands up in the air in sheer frustration. And no, there is no bias against modest-or-less-budget films, have seen too many terrible ones but there are also watchable ones and even quite good ones.<br><br>Starting with the things that come off surprisingly well, was expecting somewhat the production values to be a weaker asset. Instead, for me it turned out to be the most professionally executed component. There is a very slick look to the photography, the setting has an eerie atmosphere that does leave one unnerved and the lighting is neither too dark and dim or too garish and over-saturated.<br><br>The audio has balance issues at times, but surprisingly it's not a case of it being favoured over hearing the dialogue and it's neither inappropriate, random or cheap. Also thought that, despite the poor dialogue and far from well written characters, the acting was acceptable. At least the actors seemed engaged with their situation and didn't come over as hammy or bored.<br><br>However, there is a lot to be left desired in 'Killer Kate'. The script sounds very unnatural throughout with an air of vulgarity, had to refrain from inappropriately laughing in some places because the cheese was so overwhelming. The character development is sketchy at best and relationships never get to grow, it's just a case of everything being there but with nowhere near enough motivation or explanation. Hate to be a downer, but will admit to have often had a thing about how characters behave and what decisions they make and recently it has become a bugbear with them being done badly. Didn't buy for a second a lot of the decision making, finding them frustrating and lacking in logic that would have been slightly more palatable if motivations were less vague. The character behaviours here are enough to induce eye-rolls to the extent that one's eyes feel strained after watching. The direction throughout shows signs of inexperience, and he struggles to keep things in control or breathing.<br><br>It's the story that sinks 'Killer Kate' the most. It is very irritating when a film has a promising concept and fails to make it either intriguing or engaging. The story was completely unexciting in pace and flat in atmosphere, the creepiness is nowhere near enough, things are too dreary to be fun because the film does take itself too seriously and the excessive predictability stops 'Killer Kate' to have any tension, suspense or thrills. Much of the story fails to connect or come together, with such a choppy structure, until the utter joke that was the climax, by then the film had completely run out of steam and became contrived and lacking in sense.<br><br>So overall, certainly didn't detest it but it just did nothing for me. 3/10 Bethany Cox","user":"TheLittleSongbird","rank":[4,5]}]