[{"title":"Life-affirming portrait of a resilient people dealing with dire circumstances","rating":8,"date":"26 November 2017","review":"It's hard not to like the unspoiled, friendly and proud people profiled in this documentary. The director remarkably touches bases with both common folk like the three elderly farming brothers who make up the heart of the film and Castro himself. There's a sense of resiliency and humor that is inspiring. You also get to witness an American's view of the roller coaster ride Cuba has taken from the heady days of revolution to the horror of the 90's to 2016, when life has improved immeasurably for the subjects, some of whom have gone from gaunt to almost portly. Whatever your opinion is of Castro and his autocratic tendencies, this documentary concentrates its light on the Cuban people, their relationships with each other, their country and with the cameraman. I was surprised at how open Cubans are in criticizing their leader and their predicament, especially in the horrible 90's. One gets the feeling from western media that Cubans have been silenced and jailed under Castro for their views but here, nobody seems to be intimidated at all in speaking of their anger and resentment over the way the country has been run. By the end, I felt close to each of this film's subjects to the point where I was disappointed that two Cubans who emigrated to the USA during the later stages of filming are not interviewed after their exodus to America.","user":"jimparrett","rank":[36,44]},{"title":"Story of the people","rating":9,"date":"26 November 2017","review":"I enjoyed watching this film so much, chatting away to my wife about all the familiar places and stories. My work has taken me there a lot over the years. The stories portrayed here are exactly what one sees when you develop friendships over the years in Cuba. I felt as if the three brothers were my friends too, having spent much of my time in the farming communities of Cuba. I felt emotionally attached to them as time passed and economic pressures shaped their experience. <br><br>There is so much depth and complexity to the Cuban story, and it can be incredibly confusing to go between the worlds of tourism, government lectures, and time in the homes or fields of Cubans. Add to that the sentiments of exiles and one can struggle to navigate these waters and formulate clear opinions. One is constantly meeting people in unexpected positions with extraordinary education. Ag engineers and entomologists breeding beneficial insects for organic farms in old soda bottles under palapa huts, PhD of Latin American literature checking you into your hotel, or a university professor selling peanuts on the street to make ends meet. This film also captures that phenomenon. <br><br>What is not confusing, is connecting with Cubans. This filmmaker does an excellent job of connecting the viewer with the experience of Cuban people for them to develop their own opinions based on these stories, history, geopolitics, etc. I was overly excited to provide my own supplementary narrative, translations, etc to my patient wife who has never visited the island. The footage is unique, following various people over many years. It's the first film of its kind filmed in Cuba that I'm aware of. My wife winced at some of the questions directed towards people in times of intense struggle, belaboring the narrative a bit at what was obviously a difficult situation. The people would have enjoyed telling their story though, and what a great body of unique work it has produced as a result of this filmmakers diligence.","user":"sengbranch","rank":[21,26]},{"title":"Alpert gets the gist of Cubans","rating":9,"date":"16 December 2017","review":"This gringo is loud, he keeps his eyes wide open, he's affectionate, he's direct, he's witty, and - most importantly - he connects. John Alpert's \"Cuba and the Cameraman\" is a must-see and confirmation why this country is so lovable and has a great future.","user":"johanneswerner-10938","rank":[18,22]}]