[{"title":"Nice story ,, wouldn't say a perfect family movie but it was somewhat enjoyable","rating":6,"date":"2 December 2018","review":"Not the worst dog story i'v watched ,, i mean to be honest i watched it because i like Vanessa Hudgens (side note, i wish they didn't cancel her show , Powerless ) ,, anyway ,, the movie has a nice heartwarming, Awh moment story ,, especially at the end ... I was not hilarious but it has some funny bits ,, i mean the bloopers in the credits were funny too ;)<br><br>cast wise ,, the cast were all known to me \"comedy field\" and they all were funny in their own way from Hudgens to Rob Corddry, Adam Pally, Ryan Hansen and Thomas Lennon ,,<br><br>So to wrap it up,, the movie was okay ,, and it is actually a nice family movie ,, so i'd say recommended.","user":"Aktham_Tashtush","rank":[8,8]},{"title":"A heartwarming celebration to our canine friends!","rating":10,"date":"8 August 2018","review":"I was not excited to watch this movie. However, thanks to moviepass, why not? And I am very glad I did.<br><br>The movie has 4 plots. A very energetic dog that's driving a family about to welcome babies crazy, an abandoned puppy that was found by a barista, an old man and his overweight pug and a TV host with her depressed dog after a breakup. The transitions are smooth and it does not feel overwhelming to follow all characters.<br><br>The plots are basic and not pretentious. Young kids can understand and older, jaded viewers will not be bored. The movie also puts adopting pets is such a good light that the only \"risk\" is leaving the theater wanting to adopt a four legged companion.<br><br>Dog Days is perfect for dog lovers and/or people who are looking for a light hearted comedy. This is absolutely not meant to be intellectual or a gag comedy.","user":"palepalmito","rank":[30,39]},{"title":"Laughed, cried, but most importantly related to!","rating":10,"date":"9 August 2018","review":"A friend of mine picked this movie out for a movie theater discount day - just something to see with no expectations and if it wasn't good no harm done - at least we get to see some dogs which we are both lovers of. <br><br>We were so pleasantly surprised by the down to earth positive feelings we both received from this movie that we kept saying I wasn't expecting that movie to be so good - didn't see that coming! <br><br>Everyday regular relatable life plots - first time parents having twins and feelings of being overwhelmed insisting on her brother to help out, adoption of a young girl for first time parents wanting to make an instant connection and bond of being a family, invisible geeky good hearted guy admiring a pretty woman who serves him coffee while the pretty woman is lusting over the handsome shallow veterinarian, independent female talk show host and her guest an injured self-confident ex-jock thrown into transition, and lonely isolating old guy that finds purpose because of a typical 16 year old boy who doesn't filter his comments. All incorporate man's best friend as an important part of their lives and families. <br><br>I especially enjoyed the dog therapist as I am a therapist and have had client's dogs in session. <br><br>My friend and I laughed, cried, and related to the different personalities of each of the dogs and the people that were made better by those relationships. Each story had bits and pieces of life that we related to and spoke to us. <br><br>We left the theater feeling better about life and the different paths it takes us on and how that is enriched by sharing this world with our furry friends and companions.","user":"snowdove-47377","rank":[25,34]}]