[{"title":"Recommended for Everyone","rating":10,"date":"5 January 2019","review":"I'll admit, I am fortunate to be an outsider on much of this information due to the fact that my family &amp; I have enjoyed good health for most of our lives thus far. For some context of my review I will state that I am a child of the mid 1970's. Born too late to worry much about Polio, my generation did witness the full force of the HIV/AIDS epidemic, so that one fear was replaced by another.<br><br>This documentary does well on several fronts. First it does a decent job of describing the history of prescription drugs to help the view put the current state of things into better context. The two main areas of focus in this detail are of Jonas Salk, the inventor of the Polio vaccine &amp; the discovery of insulin in 1923. Both are shown as examples of humanitarianism with the inventors refusing a patent or selling their patent for very little money so that the world could benefit. Of course this is in stark contrast as to what is happening today.<br><br>The next subject I felt the doc did well on was it's explanation of the direct to consumer drug advertising practice. Apparently only the US &amp; New Zealand allow this practice to go on. From what I saw when the first commercial was advertised on TV in 1983 government agencies were extremely far behind &amp; didn't exactly know what to do so they basically banned any ads they felt were not fully informing the consumer. Enter print ads for the remainder of the 80's - early 90's. Then legislation came about that allowed the pharma companies to side step all the hurdles by simple telling the consumer to \"talk to your doctor about...xyz drug\" Even I can remember the Claritin commercials. \"Be clear with Claritin D\" or something like that. Few things have changed since then as we are told that the last time prescription drug ads were discussed in Washington DC was back in 2007. As anyone who has tuned into evening TV can tell you, drug ads are everywhere.<br><br>A good look is shows at the exorbitant pharma CEO salaries, the manipulation of stock prices &amp; the increase of drug prices put simply because they can. The drug companies are hit with court ordered punishments and fines of course, but by then untold numbers of people have died &amp; as is stated the drug companies will recoup these losses by raising prices.<br><br>Another good section illustrates the quagmire in WA DC where the people we elect are basically being bribed not to do anything not in line with pharma companies agendas. If the politician decides to go against the pharma co's they just extend the bribe to that person's opponent.<br><br>All in all it is a pretty good documentary that includes many of the problems that are happening today. People are dying right now as I type because they cannot afford their insulin or other life saving/ life sustaining drugs. Late 2018 I saw a story of a younger person who should be in the prime of his life who died because he was trying to make his insulin last longer by taking less than the prescribed dose. This is tragic and about as real as it gets. Affluent people will survive (at least survive longer for now) than the poor people. If I could conclude anything from what I've seen it would be that if you are a poor person the pharma companies see your life as disposable.<br><br>As this is the first review I hope that others will do a better job and help fill in anything I forgot to mention. I will say that like most sociopolitical documentaries that I have seen this one is a bit alarmist (as it probably should be) and offers you all the problems with very few actual feasible solutions. I agree with the films conclusion that something has got to be done about this so I gave it a 10/10, not so much because it deserves the ten, but if my higher rating convinces anyone to give this a chance then it has been worth it.","user":"Hillius","rank":[2,2]}]