[{"title":"Just awful...","rating":1,"date":"3 November 2017","review":"This film is so bad I can't even be bothered stringing how much I hate this film into cogent sentences.<br><br>So, 97 years after the bots take over you're telling me that the windows on the shops are crystal clean? You're telling me that despite no new clothes being manufactured the human characters look like they've just got a whole new wardrobe from GAP? That nearly 100 years of neglect has seen no collapsed roofs, no weeds growing from gutters, and fields that look like they've been fallow for a couple of years? That street signs, railings, window shutters, metal roll shutters have absolutely no signs of rust? That despite the bot driven apocalypse, the main female lead still has time to obviously dye her hair? In the scenes running through forests, they follow well worn and undergrowth free paths.... worn and maintained by whom exactly? Bots? In one of the opening scenes, a shop is engulfed in ivy inside yet in one of the later scenes, a house described as 'really old' has perfectly white whitewashed walls, and inside looks pristine - photographs aren't faded, glass cabinets haven't a speck of dust on them... in fact there is no dust, not even a cob web! And given that the house hasn't been heated for 97 years, it's amazing that there is no damp whatsoever. 97 year old Polaroid film works and, it must be energizer, because the batteries are still fresh. Despite being out in the wilds for days on end the male lead is always perfectly cleanly shaven. Even when he is woken from sleep he has been mysteriously shaved - then again he is a robot - a fact that the writers are at pains to have us aware of from the outset with the laboured 'no food for me' scene - funny then that when the girl falls asleep on his chest she doesn't notice that he doesn't need to breathe (we presume) And then, when they meet some nasty humans, they are all covered in stubble, dirt and worn clothes - oh my, so original.<br><br>The male lead gets tied up in a brand spanking new rope. I mean, this thing clearly was just bought from a shop on the day... and the rope magically moves from one scene to the next... did they take lunch in the middle of shooting the 'tied up in brand new rope' scenes? Maybe they should have...<br><br>The male lead is only capable of two expressions - eyes normal and eyes bursting out of his head. There is nothing in between and the rest of his face is entirely pointless. Lucky for him that the dialogue doesn't require much else. Actually, I'm not giving him credit... he can do a variation on these two expressions above including with mouth open and with mouth shut.<br><br>The female lead should take urgent note that crying involves water coming from the eyes. You can't snivel and gasp for air, and then expect to look authentic with a perfectly dry face. <br><br>Special effects are dire - in the opening scenes burning buildings look like someone went mad with the Photoshop clone tool. Explosions don't cast any light on objects that are close by and clouds of dense smoke don't cast any shadows and dissipate in moments leaving no trace. Enormous bots appear to defy the laws of physics and move through dense forestry without causing a single tree to move. <br><br>'Whats in your chest' scene - great work on the 97 year old straw bales that look to have been made in the last week... and the plentiful fresh straw on the ground in the barn... just lazy... <br><br>Lighting.... I mean really.... what is happening with the lighting? In a dark and dingy forest, and it looks like two blazing follow spots behind the cameras.... just cheap and nasty.<br><br>The characters are so poorly developed that their behaviour is schizophrenic at best.<br><br>Continuity is a joke - in the opening scenes we see buildings burnt to to the ground, yet in later scenes, and I mean 97 years later scenes, they are visible in the background, with lights on inside. Really, 97 years after the rise of the bots, they are still using lights? Who is changing the bulbs? Bot janitor? Who even makes the bulbs?<br><br>The bots themselves. If you're looking for humans, perhaps IR might be better than visible light to detect them? I think it's utterly lazy that the main feature of the film, that drives the whole storyline, the bots, are so poor.<br><br>After leaving the 'facility' (you just know that's what they call it), they walk through a field of corn ready to be harvested. I'm feeling like a stuck record here...<br><br>John Cusack must have been desperate for the cash.","user":"rosslittle-278-657280","rank":[244,268]},{"title":"what a waste of time","rating":3,"date":"4 November 2017","review":"Such a disappointment. I am a fan of sci-fi movies, and here I was \"wow, human vs machine apocalypse!\". Boy, was I wrong. Plot has so many holes it's hard to describe, and sometimes you wonder if perhaps the editing moved scenes around (so ending scenes are in the middle of the movie etc). Lines are cliché (\"you have to let me go\" and such). Acting is sub-par (main character only uses two facial expressions - normal face and bulging eyes face). It steals ideas/images from other movies (octopus-like machines from Matrix; girl with a bow from Mockingjay series - yes, there are even birds here; the whole Terminator premise; bits of Mad Max wildlings). Also, as other mentioned, 97 years after the annihilation you still see crop fields, used rail tracks, clean paths through parks. And this student-project B-or-lower movie gets 8 out of 10 here? Don't waste your time on this one.","user":"conyo","rank":[132,144]},{"title":"false ratings","rating":1,"date":"5 November 2017","review":"After almost 20 years of using IMDb, I finally decided to register. Why? To get a chance to review Singularity? No. Just to express my anger. Somebody behind this movie (probably the studio) paid for 1000 false ratings to move Singularity up the ladder. Yesterday the overall score was 8.0!!! The best film ever made???? <br><br>If you open the detailed score, you can immediately see why. Today (11-5-17, day 3 after release) the score is still 7,3 and it is falling down. There are 40 to 100 votes in each level, except for 9 stars level. So far the movie received 9 stars 1300 times. With no explanation, no written review, there are just these 9-star ratings accumulated within 2 days out of nowhere. <br><br>Nobody with clear mind can give Singularity 9 stars. At least nobody who saw movies like Hunger Games, Terminator or Blade Runner. Maybe it deserves 3, maybe 5. I am giving 1 for this intentional deception with false ratings. As another reviewer already pointed out, the situation is similar at RottenTomatoes. <br><br>IMDb staff: please check the voters' accounts! Are all the 9-star votes from accounts created 2 days ago by some cheating software? <br><br>One personal note: The scenes in an empty village with desolated church were shot in my country and that was the only time the movie got my attention (because I tried to figure out which village it may be)...","user":"triffidCZ","rank":[239,268]}]