[{"title":"Low budget film making at its level best.","rating":9,"date":"26 August 2019","review":"I was lucky enough to catch a screening of this at Frightfest this year in London. While it wasn't what I was expecting in terms of what I imagined a festival of that name would deliver, I was very glad to have seen it. Right from the beginning we're given an interesting protagonist (Lou) to follow and shortly after an equally deep and complex supporting character named Val. Both actors do a stellar job of bringing them both to life and are well supported by the rest of the cast. The story itself is an original and interesting one and the director masterfully brings us into the world of the film with some excellent choices in terms of how the story is told. The films dark comedic aspects along with just the right character development and intrigue made this a very enjoyable watch. It doesn't look like it was made with a ton of money and one can see where the corners were cut but it only adds to the brilliance, in my view. The script is tight and does only what it needs to do and never at any point was I bored or felt like I was being hit over the head with the point. It has a very interesting theme (which I won't spoil) that actually speaks for itself with very strong attention to detail, top performances and slick direction. If you appreciate low budget independent films then you'll have no reason for enjoying this one. Quite simply a great piece of work.","user":"edwardstevens5","rank":[15,26]},{"title":"An indie gem. Dark, witty and clever.","rating":10,"date":"18 January 2020","review":"Writer, director, editor Staten Cousins-Roe has created a wonderfully dark world as seen through the eyes of Lou, a young woman trapped at home with a frightningly needy mother. Lou dreams of self improvement and a better life. Addicted to self-help guides and guru's Lou becomes beguiled by a mysterious women (Val) who seems to have it all, amazing self confidence, clear life goals and a action plan to achieve them. ASKGTL takes us on a bizzare, original, dark and funny journey in the form of a road trip to enlightenment via a number of grizzly murders. A brilliantly conceived and executed film. In like so many low budget independent films It has attitude and style in abundance thanks to Staten's sharp writing and confident directing as well as a great story together with a brilliant cast who all absolutly nail their roles. To have achieved this in just a 2 week shoot on a modest indie budget takes exceptional vision and talent so expect more gems from this excellent film making team.","user":"akta","rank":[6,10]},{"title":"Let's not forget those sandwiches!","rating":8,"date":"13 January 2020","review":"Very bizarre, very British, very funny, very good! Quintessentially British filmmaking with a heart. Beautiful shot scenery and a star making performance from Poppy Roe. May be too 'odd' for some but still highly recommended","user":"filmcriticjournalist","rank":[6,12]}]