[{"title":"It's alright if you don't think.","rating":5,"date":"10 April 2019","review":"The 1st half was pretty good, but there are some serious plot holes.<br><br>How exactly would carnivorous bats survive underground for millions of years?<br><br>The writers also seriously expect us to believe that people would be starting crazy murder cults after just a few days? I cringed when the priest said \"she is fertile\".<br><br>How is the power still on? Aren't power plants loud?<br><br>It also seems completely implausible that this would be a completely world ending event. Can't you just blast loud sirens in the cities which would prevent the bats from homing in on small noises? It's also not like the bats can get through concrete.","user":"penarozamatthew","rank":[388,447]},{"title":"Stanley Tucci versus dwarf pterodactyls","rating":5,"date":"23 May 2019","review":"The cinematic equivalent of tofu, this movie is bearable but bland; a bargain bin version of A Quiet Place with another family hunted by noise-sensitive monsters and a deaf daughter whose knowledge of sign language proves useful.<br><br>I really liked A Quiet Place, plot holes and all. The first half was a masterclass in building up suspense and dread, with phenomenal tension and great use of sound. The Silence, while not amateurish, falls really short by comparison; it's a lot more \"Oh no here come the beasties! Phew phew! Run!\".<br><br>This is a pet peeve of mine but I'm really tired of post-apocalyptic/disaster/zombie stories with a group of evil survivors replacing the monsters as the antagonists (see The Walking Dead). I understand actors are cheaper than CGI but still, I think I've had enough of \"Bwah-ha-ha!\" evil cults/gangs for a lifetime.<br><br>Thankfully, the evil survivors in The Silence do *not* actually go \"Bwah-ha-ha!\", mostly because they have cut off their own tongues. There is a truly hilarious moment where their leader sneers at the protagonists after they have refused to join his cult (a scene Tucci plays as if he is hurrying away from a smelly hobo asking for money). Tucci and his daughter leave the bad guy standing alone in the middle of the road and he opens his mouth with a disgusted grimace, like a cat who has smelled something bad. It's meant to show us he is nuts and has removed his own tongue, but I was howling with laughter.<br><br>Another funny bit comes in the middle of an otherwise decent set-piece, as Tucci's family is crawling through a tunnel and the creatures have found them. Tucci turns on a woodchipper and all the beasts just dive into it, mangled into sprays of blood within a few seconds. And these things brought mankind to the verge of extinction? Seriously?<br><br>Overall, not terrible but mediocre. If you missed A Quiet Place, watch that one instead.<br><br>5,5/10","user":"petra_ste","rank":[17,17]},{"title":"What the....","rating":2,"date":"13 April 2019","review":"What was the great Tucci doing in this film???<br><br>Just had to get off my chest - why would a house which is protected like Fort knox military compound have an obvious open tube / tunnel leading into it?\nWhy would the owner of said house, who is obviously alert to her surroundings come out screaming with a gun so she is instantly attacked by the swarms of killer vespas who react to the slightest sound?\nWhy if thousands of vespas swarm willingly into a wood chipper just because it's noisy - are these creatures not actually quite easy to kill? Use multiple massive mass vespa killing wood chipper type scenario? while shooting them and attacking with flamethrowers? God help us if completely blind stupid birds is what sends us back to the dark ages...\nWhy does the deaf girl keep the sound on while face timing her boyfriend?\nWhy that cheesy end like the girl and just morphed into Katniss and Gale???<br><br>This is the tip of the iceberg.<br><br>Utterly Woeful.","user":"cavecornershop","rank":[180,209]}]