[{"title":"See the movie and leaving feeling good. :)","rating":7,"date":"30 August 2019","review":"An inspirational feel good story about an injured army guy over coming odds. How can you not enjoy a show like that? I've seen worse acting, plots and movies on blockbuster films, so slow your roll on leaving the bad reviews. See the movie and leaving feeling good. :)","user":"jblue-11387","rank":[8,14]},{"title":"The \"Herbie fully loaded\" of motocross movies","rating":5,"date":"3 September 2019","review":"If youre a movie fan, this is pretty much what youd expect from a film like this; A story, some okay acting, and actually some heartfelt moments that make you feel for the main character. And in that sense its not so bad.<br><br>However if youre a true motocross fan, you will be disappointed. Here's why. Theres not even a mention of any current pros names. They literally call them different names and just refer to them as there number. The entire movie was shot at Glenn Helen raceway even though they try to play it off like it wasnt. There are tons of inconsistencies with the dirtbike racing scenes. From GoPro footage that goes from a Honda (red bike) to suzuki (yellow bike) and that hes actually riding a KTM (orange bike) all the way to literally photoshopping over actual pro race footage. Footage from 250 and 450 classes in whats supposed to be the same race. A two stroke at a pro national!? The only bike maintenance required is lubing your chain. And just so many shots that felt so repetitive. I get its not a youtube video, its a movie with a plot, but for a dirtbike movie, its really bad. Not much riding actually in the movie and for a movie about riding dirtbikes. I had low expectations for the acting, but it wasnt so horrible. However i had high hopes for the dirbike portions of the film, and i was disappointed. Maybe one day we'll have a well filmed motocross movie","user":"dmillwasup","rank":[5,8]},{"title":"Attempting To Cross A Different Finish Line Than Expected","rating":7,"date":"30 August 2019","review":"On a weekend before a holiday, sometimes the movies run a little dry and this weekend seems to be following that trend. Tonight's movies is about Bennett's War. Have not heard of it? Don't worry, neither had I and if it had not been for a poster in my theater this film would have escaped my attention. So what is this little advertised movie hold under the hood? That's where I come in with the hopes of giving some observations to help you decide if you want to make or break the bank seeing it. Let's get cracking as we look into:<br><br>Movie: Bennett's War (2019)<br><br>Director:\nAlex Ranarivelo\nWriter:\nAlex Ranarivelo\nStars:\nMichael Roark, Trace Adkins, Ali Afshar<br><br>\nLIKES:<br><br>Short Run Time\nDecent Acting\nInspirational\nFunny At parts\nMotocross scenes<br><br>DISLIKES:<br><br>Felt sort of like an incomplete Story\nPredictable\nTook a While To Get to Motocross Scenes\nMasked as An Army Flick\nA Little More Character Involvement needed<br><br>Summary:<br><br>A movie like this holds the potential to be an undiscovered treasure or a complete disaster. For the most part this War had some features to it that I certainly found worth their weight in proverbial gold. For one the short run time is nice, allowing for a chance to be a concise tale that was not too diluted by drama and bloated by long, drawn out moments that these unknowns sometimes take. Next up the acting to which the stuntmen themselves probably take first place, but in regards to the actors the podium is taken by Ali Afshar and Allison Paige whose characters turned out to be fun, dynamic groups that took the simplified parts and rode with it. Sure the other characters played their parts, but did not have quite the engaging personality these too did. Now these tidbits aside, the movie is another one of those inspirational flicks that are all about motivating people to face the odds and conquer their obstacles to achieve their dreams. It uses the parlor tricks of a deep soundtrack, close camera angles, and the just the right amount of writing and acting to sell the scene and try to get some goosebumps stirring up. Yet, the movie does not become a sob fest much to the chagrin of those looking for the latest religious drama. Bennett's War manages to integrate some humor into the mix, primarily through Afshar's character who like Jughead out of Archie Comics knows how to say the right thing at just the right time. The biggest selling point though is the motocross scenes that are just waiting to fill the theater with the high definition sounds of the motor bikes. The movie really harps on the dirt busting goodness of the sport and while it seems out of place, brings the excitement and bang that sports movies accomplish, especially when accompanied by some heavy rock. The montage approach may be a little limited and cutting corners, but the two biggest races manage to find the balance and stride we love to see.<br><br>However, the movie sort of shows its limitations fairly well, more so in the form of the story telling itself. For one thing it's predictable, with too many of the haphazard tricks given away to show what is coming. The writing, the foreshadowing, and the obvious overdramatized components that attempt to mislead do little to waiver one from the path. Second, the film is masked as an army story either in the form of war itself or the recovery from the battles they face. The opening uses the army as a means to explain the situation, but after that much of the army story is placed in storage for the sports path of the movie. If the false advertisement does not get you, then perhaps the character involvement will get you instead. Bennett's war both accomplishes and fails to integrate all its characters in the fact that nearly every character serves its place, yet does not have the full-on inclusion I think they were looking for. Adkins character in particular seemed to offer a lot more potential, but sort of crashed out like a second-string country song. The wife hits her moments but yet sort of beats around the bush and becomes a ploy for girl power instead of the aspect I enjoyed the most from her. And as for another character, integrated at a decent moment, but then again lost to the wind. Perhaps this is due to the motocross scenes which get a large amount of screen time than you might expect. While I do rather enjoy these moments, the film sometimes sacrifices too much to get them in there. Sometimes it was character development/story, and other times not enough heat in the races, but Bennett's War is one of those I would have liked to see expand on more and find the balance I've seen these movies accomplish. Which brings me to the final point that the movie feels almost incomplete. This war is more about the writers struggling to figure out the movie it wants to tell, patriotic pride and faith for healing or potentially a sports action movie to hopefully get bikes out into the business. It's this spin that although enjoyable could have struck a fine glance to deliver the full tale it wanted.<br><br>The VERDICT:<br><br>Overall, Bennett's War has some solidly entertaining components that should potentially rope in a few groups this labor day weekend. It's inspirational, funny without trying too hard, and filled with dirt bike goodness that caters to a broader audience and sort of capture the heart of the movie Motocrossed from the Golden Age of Disney. Yet, the film suffers from an indecisiveness of trying to cater too many, masking as a potential army ranger recovering and struggling (aka American Sniper) on poster, but delivering a sports movie instead. Again, I had fun with this movie, but this amplified version of the DCOM classic needs some more fine tuning or placement on the small screen track to maximize its potential.<br><br>My scores are:<br><br>Sport: 7.0\nMovie Overall: 6.0","user":"rgkarim","rank":[7,13]}]