[{"title":"Devastatingly honest and brutally real, this is extraordinary cinema.","rating":10,"date":"27 October 2017","review":"DJ's and music producers live a life which many wish they had. A life of private jets, money and fame. However, as Avicii: True Stories shows, that lifestyle comes at a cost, and for the man behind the biggest name in Dance music, that cost became far more damaging than any loss of money or fame. <br><br>Avicii: True Stories shows the story of Avicii from the beginning, with a superbly chronicled time-line, showing the rise of success from the early days of Tim Bergling to the worldwide chart domination of Avicii, it's all in there. <br><br>Highlighting the immense health struggles that Tim suffered over the years, it suddenly becomes so clear as to why Avicii had to stop. The machine had beaten itself, the light was no longer to outshine the darkness, the madness of it all had finally reached its peak, and it hit that peak in devastating fashion, as shown in this extraordinary up-close-and-personal telling of Tim's career as a DJ and music producer.<br><br>It's a hard-to-swallow reminder that what we hear in his music, tales of uplifting nature filled with such positivity and joy, is not at all accurate to how Avicii is as a human being, as Tim. The trailer for the documentary quoted Tim saying: \"Peoples perception of who Avicii is - isn't who Tim is\" and it is that separation between artist and human being which proves to be so damaging, \"the picture doesn't represent the painter\".<br><br>The story-line of the documentary gives a sense of depth and shows the journey in a way that isn't too long to become uninteresting or too short to not be enough, it's perfectly shot and beautifully edited. We get to see it all, from the business aspects behind Levels to the incredible production process behind some of Avicii's biggest hits, Avicii: True Stories has everything and nothing is left unexplained, it's all there.<br><br>Avicii: True Stories is an emotional roller-coaster between pure euphoria and crushing struggle, with both shown in their most raw forms. The music brought so much joy to Avicii, but the lifestyle brought so much pain to Tim, it's an important lesson that what we see isn't always a true representation. This is a very unique piece of cinema, simply put - this is compulsory viewing.","user":"MovieGuy_abc123","rank":[67,73]},{"title":"A dark story about the downside of being a famous artist in the cold music industry","rating":8,"date":"23 April 2018","review":"This documentary is a warning example to everyone who works with music and shows the non glamorous side of being a famous artist and how cold and brutal the music industry can be. Tim, an insecure, naive and introvert young guy who really didn't liked to be in the center of attention, had to fight against his anxiety night after night and pushed himself so hard that it eventually destroyed him. Add free alcohol, sleep deprivation and bad people around you, and you're in for a disaster to come. <br><br>I hope this documentary will help people to wake up and realize what's important in the music industry and that some people have to say stop when people are pushed too hard.","user":"oden-97752","rank":[32,34]},{"title":"This is a difficult watch","rating":10,"date":"1 May 2018","review":"In light of, or in spite of, recent events-this is hard to watch. I actually find this heartbreaking. This is an excellent film, a litle unnerving in that some of the narrative is in the past tense(purely due to the timing), but very good. 'Fan' or not, and I wasn't as such, we've all heard his music. <br><br>The film was really informative and really well put together. You see how he worked and the love for the music. The struggles of the guy are almost palpable though throughout. I have experienced addiction, etc and I can get, in a small way, how difficult things must have become. I don't know how he did it, there really is only so much a person can take. I just imagine him hating the drinking, the lifestyle, but having to carry on. Night after night after night...All the way through, I felt stressed out and anxious myself and that's, what, an hour and a half<br><br>There's definitely a story there and a sad one at that","user":"OohLaLlama","rank":[28,30]}]