[{"title":"Rating seems weird","rating":8,"date":"12 June 2019","review":"Did the filmmakers tick somebody off or something? It makes no sense that this movie has such a low rating, and several dismissive user reviews. (No, I am NOT affiliated with the film.) It's very well-crafted and genuinely unpredictable. Are horror fans so boring in their expectations that they actually resent a movie that doesn't provide the usual routine \"kills,\" or gore? This movie has what most don't: An original narrative. I didn't love the ending, but up to that point was fascinated. It's not that \"scary,\" but it's INTERESTING, and how often can you say that about a new horror movie? Most such are \"spoiler-proof,\" in that the plots are so predictable it really doesn't matter if someone spills the beans or not. But with this film, I wouldn't tell anyone what happens after the twenty-minute point, because it's actually surprising. If you need severed limbs or something, I guess this movie isn't for you, but I found it imaginative and impressive.","user":"ofumalow","rank":[90,125]},{"title":"Cool little indie horror","rating":8,"date":"18 July 2019","review":"If you're expecting big scares and big budget you came to the wrong place. But it's still pretty good. I enjoy a good horror indie. Most of them suck but this one was done right for what they had to use.<br><br>Unique concept and summoning ritual. Def had some good creepy moments. It's a slow burn for sure which some can't stand, but I personally like that kind of stuff if it's worth it. Acting was good. Visually good too.<br><br>Ending could have been slightly better but overall an enjoyable watch. Congrats to the filmmakers on this one.","user":"stephenherman","rank":[30,41]},{"title":"Really enjoyable.","rating":8,"date":"15 September 2019","review":"I really enjoyed this, I was expecting it to be the usual run of the mill, colourless horror, but it wasn't. More in the horror/thriller genre, this delivered some unexpected shocks, and moments of real subtlety. It does have some of the usual horror cliches, some loud shocks and obvious scares, but what it does so well is deliver some very unexpected moments, ones you need to watch closely for.<br><br>Well made, very well produced, I thought they made the best use the budget, clever use of lightning, and very well acted.<br><br>All in all, very satisfying. 8/10","user":"Sleepin_Dragon","rank":[25,36]}]