[{"title":"great dark comedy about hypermasculinity","rating":9,"date":"20 May 2019","review":"I saw this gem at a recent film festival. This is why I go to see movies - something original, something \"real,\" and something important. I didn't find it preachy at all, actually I thought it got it's point across in the best way possible - by being funny and entertaining. The movie starts off by grabbing your attention with how weak of a character Casey is, and how cruel his world is. His world is unrealistically desolate and lonely. But the way he rises out of it is why the movie goes from boring Wes Anderson fantasy to kick-ass Fight Club absurdity. Yes, there are absurd moments but they are completely consistent with the theme of the movie. A theme that needs to be shown again and again in cinema. I won't explicitly state it, but it is the reason this movie goes from average to great, albeit 45 minutes in. A little more gruesome than I'm used to, but I still enjoyed it.","user":"chndnnyk","rank":[154,247]},{"title":"The Art of Self-Defense (2019)","rating":8,"date":"17 July 2019","review":"When I first saw the trailer for this film I knew I had to see it. It looked like it was going to be a wonderful dark comedy centered around karate of all things. I've never heard of the filmmaker of this movie but the idea of Jesse Eisenberg learning karate to fend off bullies and delivering deadpan delivery is alluring in and of itself. The film manages to blend its comedy and thrills extremely well and is a really good time all around. I was unsure about the closing stages of the film but it is certainly a remarkably entertaining and unique time.<br><br>The film is about a timid accountant who one day is mugged and beaten severely by a motorcycle gang. He decides that he wants to learn how to defend himself and stumbles across a karate gym that immediately intrigues him. He meets a very bizarre Sensei and quickly tries to assimilate the skills he learns to improve all aspects of his life and become more manly. Little does he know the darkness within the underworld of this karate world.<br><br>I loved Eisenberg's character in this. To see his character progress and to watch the confidence grow, its a joy. The Sensei character is also so entertaining. The films script is so sharp in all the right places. Even the serious moments are funny because of the dark comedic writing. That makes it worthwhile. Its also refreshing to see a look into the world of karate and the growth in stature in the art, whether this film plays it to be factual or makes up stuff.<br><br>As the film was winding down you felt the twists and turns coming and also hope the film doesn't fall apart. Luckily, it doesn't and manages to stay intact with respect to the tone of the first half of the film. This may fly under a lot of people's radars but I wish for everyone to go and see this.I don't think I've actually seen anything quite like this before. Its unique in its nature and has fun with a very creative plot.<br><br>8/10","user":"rockman182","rank":[86,136]},{"title":"Underwhelming","rating":5,"date":"9 July 2019","review":"I like Eisenberg and Nivola, so I was primed to enjoy this, but what a letdown. It starts off with a decent droll tenor, even if the humor is pretty lame and the story very simplistic (fraidity-cat nerd gets mugged, then gets empowered in karate class). But rather than evolving into something more interesting, the film just gets mean-spirited without truly going \"dark,\" with improbable developments and insufficient depth to pull them off. Characters who turn out to be sorta evil remain cartoonish, so there's no punch to the revelations.<br><br>This is neither a farce or a \"black comedy,\" just some tepid compromise between, and it wastes some very good actors. You've seen Eisenberg playing a dweeb before--he's certainly good at it, but this movie doesn't bring out anything new--while Nivola, who's normally terrific, is neither very funny or sufficiently threatening in a role that calls for both. Likewise Imogen Poots and David Zellner get one-note roles. I don't know what this movie was trying for, but it didn't work for me. I would have rated it lower (because I really did wind up disliking it), but in technical and acting terms the filmmaking was competent enough to give it a medium grade.","user":"ofumalow","rank":[145,241]}]