[{"title":"Has enough fighting and fan service to keep one awake for an hour and a half","rating":5,"date":"28 October 2018","review":"The Scorpion King: Book of Souls: 5 out of 10: The Scorpion King's plan to live the simple life is ruined when a mad king (Not played by Tony Todd) with a demon possed sword threatens his idyllic farm life and it is off to find the titular Book of Souls which is the only thing that can stop The Mad Kings Demon Sword.<br><br>The Good: Well it is better than Scorpion King 2. Sand and sandal film has some decent fight scenes, keeps the camera in focus, some PG-13 fan service and a funny Golem (Jewish not Middle Earth). If you can ignore the story (I highly recommend this) there is some family-friendly action adventure waiting for you.<br><br>The Bad: If you cannot ignore the story you are in for a rough ride. For starters even trying to figure out the geography of everyone is a chore. (I know where the Nubians are historically but I have no idea where the Scorpion King is currently residing or where Not Tony Todd and his army are hailing from or where the Book of Souls is supposed to be and why they are next to the ocean unless that was the only place to film the sand scenes.<br><br>In addition, the movie suffers from the Death Star destroyed let's call this a win syndrome. Even if you destroy Not Tony Todd's magic sword he still has a fanatical army and you are still three people and a Gollum.<br><br>The Ugly: Why is this a Scorpion King movie? Seriously. The story fits a lot better as a Pg-13 Conan adventure and the lead actor looks nothing like the Scorpion King. Honestly if you called this Price of Persia and the Book of Souls it would make a lot more sense in both casting and story.<br><br>\nIn Conclusion: It moves fast enough and has enough fighting and fan service to keep one awake for an hour and a half. Family friendly and fun to tear apart while watching it is at least a somewhat enjoyable romp. That Gollum is hilarious BTW. He really needs a better movie.","user":"juliankennedy23","rank":[18,20]},{"title":"I don't quest","rating":6,"date":"26 October 2018","review":"You don't have to have watched the other four in the series to understand this one. The series has been going in the direction of comedy and camp. This film has none of that. Like the other films, it uses a loose concept and knowledge of ancient times in regard to people and geography. BTW the Sumerians wrote in cuneiforms and not hieroglyphs. The Akkadians were a Semitic people who lived basically in Iraq. I don't think there was ever a \"last one.\"<br><br>Nebserek (Peter Mensah) obtains the all-powerful sword of Anubis and wants to kill the Scorpion King. Through a long series of events, the Scorpion King (Zach McGowan) goes after Nebserek along with the Queen of the Nubians (Pearl Thusi) a half-naked Amina (Katy Louise Saunders) and her clay golem (Nathan Jones).<br><br>This is a formula action film with a climax battle which includes the two titan-like guys in a fight to the death. Decent performances for a \"B\" film. I missed the corny stuff.<br><br>Guide: No swearing, sex, or nudity. People in scanty outfits, Zach McGowan nude from the side.","user":"nogodnomasters","rank":[7,8]},{"title":"Great movie","rating":10,"date":"29 May 2019","review":"It was a great movie I have seen the difference to the old ones with the rock is much quicker with the movements and the film is more quicker but this was far better because there was more action fighting and talking together with somebody and it was in slow donation until they get fighting it's quicker is a lot more things happening and the old one and I thought this one was far much better with plenty more to say happening in this story off the new The Scorpion king: book of souls 2018 is 10 out 10 for me.","user":"neil-hawkins7","rank":[4,4]}]