[{"title":"Enjoyable guilty pleasure","rating":7,"date":"9 November 2019","review":"Not so bad. An enjoyable B movie ride.<br><br>I am a fan of both Cage and Durand. I think they both enjoyed acting in this movie. It shows. And Famke Janssen does show good chemistry with Cage while not having not much to do. But she does stand in all of her scenes.<br><br>I found myself smiling most of the time.<br><br>Just a bunch of good actors in a not so bad story enjoying each other. This is not Oscar stuff of course. But, hey, nobody was looking for high standards here.<br><br>Fun.","user":"vincentboudreau","rank":[56,68]},{"title":"Famke Jensens face job","rating":4,"date":"9 November 2019","review":"All you think of is Famke Jensens face job. Her face is like a porcelain mask. It just looks weird. She's not ugly, just... stiff. The movie itself isn't that bad if you like action movies from the 90's. Predictable from start til stop. The CGI animals are ok for this budget. You won't watch this movie twice I promise you that.","user":"davidsmejladress","rank":[51,71]},{"title":"A ridiculously fun action packed spectacle that transports you back to the 90s glory days of the genre.","rating":7,"date":"5 November 2019","review":"Now bear in mind the film is absolutely outrageous and messy at times, but overall it's executed in a fashion that takes me back to the good old days of insane action with dangerous animals running amuck wreaking havoc. As far as I'm concerned there's no better option than one of the most intensely wacky actors for the last 30 years in Nicolas Cage to front this film. We all know that he is in about 20 movies a year and that maybe one out of those 20 or even watchable because they're usually low budget VOD drivel but the man does always bring some sense of excitement to his roles. Primal is a prime example of cage returning to his 1990s action roots . The film has its many clichés but it also has some decent character intrigue and a pretty interesting setting on this ship With certain circumstances. It moves pretty consistently with bits and pieces of intensity and decent creature feature type thrills . The plot is pretty straightforward and doesn't exactly blow you away but for what it is it works . Some of the CGI is pretty shoddy but for the low budget I can let it pass. It's definitely a worthy watch for action aficionados and anyone that wants to sink their teeth into a film that belongs to the 90s glory days of the genre.","user":"JF500","rank":[53,75]}]