[{"title":"The film discusses the grey areas under Chinese drug control and the boundary between law and human feelings.","rating":9,"date":"11 July 2018","review":"This is one of the best Chinese movies in history. The film discusses the grey areas under Chinese drug control and the boundary between law and human feelings. The whole movie has promoted the Chinese society's reflection on the control of drugs for the treatment of severe diseases and the excessively high price. to some extent, it also satirizes the inadequacy of the Chinese government in related issues. in fact, after the movie hit, people enthusiastically discussed related issues on the internet, which has also prompted the Chinese government to further make more positive changes to the inadequacy of current drug control. Such movie themes are rare under the current control system of the Chinese government for movie and TV creation themes.\nI don't understand at all that one of the comments written by IMDB user thebigsick thinks that the theme of this movie is a cliche, and even thinks that this movie has won good public praise and attention purely by means of propaganda and hype. \nSorry, I can't understand why you think that way. The theme of this movie alone is worth thumbs up. Almost all Chinese movies will use a lot of online publicity before and at the beginning of their release. this is a commercial movie, there is no problem with doing so. However, not all movies will gain a good reputation because of hype. if the movie itself is very bad, and only depends on a lot of publicity and hype in the early stage. in less than three days, it will get a lot of bad reviews. Because the audience is not a fool. \nThis movie scored 8.9 points on the well-known Chinese film review website douban movie ( you can understand it as China's IMDB, douban movie is a platform with a lot of credibility in China. many people will refer to douban's score before deciding whether to spend money on a movie,only a very small number of Chinese movies can score more than 7 points on douban ).Within a week of this movie's release, it has accumulated 1.8 billion RMB ( about 27 million us dollars ) in box office. Whether you like it or not, this proves that it is a good movie. So the user thebigsick didn't understand the real meaning of this movie at all, or why Chinese people think it is a good movie.","user":"evan9103","rank":[68,71]},{"title":"Not a beautiful story","rating":9,"date":"7 July 2018","review":"Not a beautiful story, but it is one of my favourite Chinese movies so far, From what I know, this one is based on a real story with some rearrangement. Xu Zheng and Ning Hao are very creative filmers. Constrained by the influence Chinese government, a lot of themes are not allowed to be filmed in mainland China. However, this one obviously neatly sidestepped the conflicts with government.","user":"sylenas","rank":[74,83]},{"title":"India-China Movie Takes On Swiss Drug Company","rating":5,"date":"5 July 2018","review":"Dying to Survive, a 2018 Chinese drama based on the real-life story of Lu Yong, a Chinese leukemia patient who bought cheap cancer medicine from India for 1000 Chinese cancer sufferers in 2004. It's called a comedy-drama but there's just a little comic relief in an otherwise very serious movie. It's also called a noir comedy, which gives a greater idea what you're in for.\nIt's very moving and realistic. The film is loosely based on the story of Lu, who has been regarded as a hero of sorts for importing and selling less expensive anticancer drugs from India to Chinese for CML patients charged huge prices by a Swiss pharmaceutical giant.","user":"avery-12","rank":[33,38]}]