[{"title":"So, where is the end???","rating":1,"date":"30 January 2019","review":"I don't want to spoil it out! but, this movie, when you watch it till the end .. you will realize that you wish you haven't seen it! it makes you wonder why the story is written this way! a way that humiliate the viewer for watching it!!<br><br>If you don't like the kind of movies that kills of the good character and leave the criminal character unpunished .. then don't watch it .. because this describes the content exactly!<br><br>Actually, I don't know how the actresses and actors accepted a storytelling like that. It shouldn't be approved before starting the production itself!<br><br>Sorry but, I have to say it .. the movie would be acceptable if the end doesn't insult the viewer this way. It makes it the most careless movie storytelling that I have ever seen!!!","user":"ProducersGuide","rank":[9,15]},{"title":"What?!","rating":5,"date":"6 April 2020","review":"Well I'll write another review since my last one on this movie dissapeared. I rather enjoyed the movie until you get to a key point where the direction or writing took a terrible turn. The whole movie your rooting for Zoe to overcome her horrid rape and ordeal by her father whom u fig out early on it is. She finds a silver lining in a fellow drifter and all around nice soul, named Silver. They have a bumpy start at first seeing as Zoe has huge trust issues. As soon as you see her start to open up and finally think she can put her past behind her and move on, and finds the one person who helps her and doesn't want anything in return, boom....your entire world is crushed. The tragic plot twist was super un needed and I could even overlook that if it wasn't for the fact that Zoe randomly just decides after the ordeal to leave her friend in the desert, call her father, the predator and tormentor. Then takes off with him like nothing happened. Like everything is ok and she is just gonna pretend all is well. It's a bullshit cop out. She would be better off just continuing to drift around the country. The ending is terrible and just completely overrides any progress Zoe has tried to make the entire movie. And Silver? Wow what a waste of character there. I get your trying to show the cycle of abuse has a stronghold beyond what people seem to comprehend but come on! They had worked up a strong trust and bond and your going to tell me Zoe actively can't correlate bw being raped by her dad and starting to have sex with Silver? When she's the one who instigated the session? Give me a break! I understand getting ptsd from being raped and it is a tragic happening,trust me I know, but to kill the only person you trust and began to love bc in your mind you compared it to rape is rediculous. Honestly. The story was great until that point, but that's where u lost me. And like I said I could've overlooked that if you didn't insult the audience with your bs ending.","user":"Corky0705","rank":[0,0]},{"title":"very good and strange movie","rating":8,"date":"30 January 2019","review":"I liked it a lot\nit is a strange movie and a road movie too\ni was fascinated with the music the atmosphere and everything happens\nthe movie is only 1hour and 12 mn\nfor me it was good entertainment","user":"bouhanamarc","rank":[2,9]}]