[{"title":"I think everyone should watch it","rating":27,"date":"27 May 2018","review":"To preface, I rarely trust reviews that have 10/10, just because usually people who do them are biased towards genre, theme, actor, etc. in the way that they are fans of those and it automatically bumps up the score of a film for them to a few points above what it really deserves.\nIt might be the case for me here too, although I must say that I am not a huge fun of anime in general. I like certain titles a lot, but I'm not really following the genre.\nSo yesterday I felt like watching anime on a big screen, and in the city I currently reside at this anime was the only one out there. So I said to myself why not, the trailer seemed neat, and so I went.\nTo say that I was astounded by it is not to give it a fare credit. I was expecting sort of typical 'goofiness' that we all see in anime pretty often, but there was none. It was a serious film, with a philosophical connotation, beautiful visuals, on lock dialogs. Like all the check boxes for a great anime were checked for me.\nIn the end I was really close to shedding a few tears. To give you a frame of reference, the only time I did it watching a movie was thanks to Hachiko.\nJust go and watch it, there is a high chance you'll like it.","user":"maxcstyle","rank":[36,44]},{"title":"Great Debut anime movie","rating":8,"date":"8 June 2018","review":"I saw this movie during its limited theatre release in Australia. Maquia: When the Promised Flower Blooms is the directorial debut by Mari Okada. She also wrote the film. The writing, voice acting and animation is great. The main characters Maquia and Erial are realistic and convey the relationships between Children and their parents. The film also explores themes of motherhood. The film however is dragged down by some of the side characters and several flashback scenes which I thought were unnecessary.\nOverall I thought this was a great movie and it was only held back by some minor flaws.","user":"lachlan-34411","rank":[20,25]},{"title":"We all die eventually","rating":10,"date":"29 July 2018","review":"A-plot 10/10,\nB-plot 10/10,\nCharacterization 10/10,\nPacing 7/10,\nWorld Building 7/10,\nVoice Acting 9/10,\nSoundtrack 8/10,\nAnimation 10/10,<br><br>Maquia: When the Promised Flower Blooms is one of the best anime films to release in the last few years. Almost everything about this film is perfect, from the well defined characters and the compelling plot to the beautiful animation and soundtrack. The only problems I had with this film are for things that didn't really matter like the minimal world building and a few unnecessary characters. Although one real problem I think the film had was the pacing especially in the first half. There are several time jumps in the film which skips over quite a bit of time and several moments that are hinted at but skipped over that I would have liked to have seen and I think would have made the ending more impactful. Because of this I think this story would have also worked really well as a 8-12 episode series. Despite these problems, the plot and characters were more than enough to keep me invested. I highly recommend you take any opportunity you have to check out this film.","user":"ExpNoob19","rank":[22,28]}]