[{"title":"Not one mention that US gun homicide rate has HALVED in the past 25 years","rating":18,"date":"18 September 2019","review":"1) the statement that us gun homicide is higher than a generation ago is a flat out lie. The FBI and CDC statistics show gun homicide is under half the rate of 25 years ago. I realize that the makers of this film are associated with the gun control lobby but to invert the core metric is bizarre.<br><br>2) the data clearly show that over 90% (93% for example in Baltimore) of gun violence is criminal-on-criminal. Almost all people with extensive criminal records shooting other people who also have extensive criminal records. If you are not a criminal, you are SAFER in the US than Australia or the EU average.<br><br>3) another poster mentioned Australia and one mentioned Canada. I doubt they are from there, or if so that they own guns, there because they are wrong about the laws in those two countries. My home state of New Hampshire has very similar age, income, race, education level demographics to Australia; New Hampshire has virtually no gun control -- and it has a lower murder rate than Canada or Australia.<br><br>As far as Canada you get NO mental health \"evaluation\" whatsoever to buy and own a Mini-14 semi auto rifle -- which is the gun used in the largest shooting of students ever (Utoya Norway). It is not \"restricted.\" Restricted is a specific list and the mini-14 semi auto rifle is not on it in Canada.<br><br>4) One guy (from Australia) says the US right to bear arms is only \"Organized and Regulated Militia\". Where is the word \"organized\" even in the Second Amendment? (Answer: nowhere) Fact: The militia is everyone. Also \"well regulated\" never once was used by the founders to mean government regulations. Even people who don't like the Second amendment acknowledge that. Not once instance in hundreds of times around the passing of the bill of rights is the term is used to mean government regulation.<br><br>The idea the founders put the Second Amendment in the Bill of Rights to allow governments to have a military force is ludicrous. Everywhere that the constitution says' \"the people\" (which it does in the Second Amendment) it means INDIVIDUALS and their individual rights. Not in one place was the term \"the people\" used to mean either state or federal government.<br><br>The National Academy of Sciences 2013 metatstudy looked at defensive gun used, of which there are between 500,000 to 3 million crimes stopped by gun owners PER YEAR. Even the lower estimated are many many more crimes prevented by gun owners than committed with guns.<br><br>This why similar demographic same region states with less gun laws and more guns have LESS murder and violence crime. Serious demographers would not compare Hawaii to Alaska or Rhode Island to Louisiana. that is specious since those states are disparate in scores of major demographic metrics. The two most similar states in demographics in the US are Virginia and Maryland. Virginia has way less gun control, 25 TIMES as many civilian gun carriers than Maryland, Yet it is Maryland has way more gun (and knife) murder per capita.","user":"random-70778","rank":[5,9]},{"title":"Trying to preach common sense to Americans","rating":7,"date":"15 September 2019","review":"I'll begin by saying that I have owned and do own guns, including handguns, shotguns, assault rifles, and long range sniper/hunting rifles. As a Canadian I cherish my privilege to own these guns, but in order to receive the permit, I had to take classes to prove that I could safely and responsibly handle and store guns, and that I understood the comparatively restrictive laws around them. I can hunt with non-restricted weapons, but restricted weapons which include handguns, AR-15s, and any rifle with a barrel length of less than 18.5\". I had to undergo a criminal background check, and pass a fairly intense psychological evaluation to get a permit, especially with the restricted permit, as I believe it should be.<br><br>You are not allowed to use guns for home defence in Canada, which I don't entirely agree with, but if someone breaks into my home and I feel that my family is in danger, I wouldn't hesitate to use a gun, the safety of my loved ones being my primary concern, and potentially going to prison being a secondary concern - a problem for later.<br><br>I also spend a lot of time in the UK, where there's essentially no guns (farmers can get single or double barrel shotguns, no pump action, and that's about it), and things are way out of whack here. There was a case a few years ago where a man came home to find his wife and kids tied up and being tortured, the assailant tried to stab him, and he fought back and killed the guy. People were picketing this guy's house, calling him a murderer, and asserting that the home invader who was in all likelihood going to kill everyone a good man and the victim. He was exonerated in court, but had to put up with tons of harassment and threats. That's just plain wrong in my book.<br><br>Anyway, as I outlined, I'm pro gun, but only for the right people. Criminal record? No guns. Domestic abuser? No guns. Psychologically unstable/bad temper? No guns. It should be a privilege, not a right. The whole second amendment argument is utter hogwash. Like you're going to fight off a tyrannical government with an AR-15 when they can just drone strike you. I think a lot of it is still rooted in racism, just as it always has been in the USA. White folks are scared of black people. You see those \"Oath Keepers\" showing up to political events with loaded AR-15s. I wonder how long that would last if the Black Panthers showed up to those events armed in that way.<br><br>Unfortunately, it seems that the biggest abuser of firearms is the police force. They're not trained in de-escalation, they're trained that everyone is out to get them, and they'd best shoot first, which is why particularly unarmed young black men are being murdered by the police, who enjoy special .protections to be free of consequence. It's not JUST black folks either, the video of the cop unloading 5 or 6 rounds of 5.56 from his AR into a white teenage kid who's unarmed, had nothing to do with the police call, and was cooperating fully on the ground. He was trying to follow instructions but nervousness made him twitch a bit and that was it for him. Even before he gets shot, you can hear in the cops voice that he's just itching for any excuse to murder him. The police force need to be de-militarized and disarmed until they can prove that they can use firearms responsibly within the course of their duties, shooting someone only as a last resort, not unloading entire magazines into unarmed civilians because they're scared children.","user":"AntonyCrowley","rank":[5,9]},{"title":"More liberal anti 2nd Amendment BS.","rating":1,"date":"13 September 2019","review":"Mandatory government gun buy back with your tax dollars of guns the government never owned in the first place with felony prosecution for non-compliance or execution for refusal... But it isn't confiscation. Nobody is going to take your guns so relax.<br><br>you cant buy back something you never owned, so its really forced confiscation, prison or execution by the gestapo..<br><br>red flag laws aka the minority report law, execution or jail because maybe, someday, possibly you might consider breaking the law..<br><br>If you dont believe the 2nd Amendment guarantees the right of people to own firearms then you believe that the founding fathers actually wanted a police state run by the wealthy and powerful..<br><br>People that have armed security 24/7 have no business telling us we shouldn't own firearms, If they think they are safer without firearms then they should lead by example and be the first to give up their armed security, this means you celebrities and democrat politicians and your families.<br><br>What we need to do is demand that politicians and celeb's bodyguards have to be disarmed and instead carry gun free zone signs in their holsters. If it is good enough for us \"common people\" then it should be good enough for them.<br><br>There are at least a very minimum of 100 million gun owners that have never and will never kill anyone but that doesnt matter to the liberal gun banners, all they care about is power and control..<br><br>There are 195 countries in the world today. If you dont like the 2nd amendment pick one and move there..","user":"frankcastiglionethepunisher","rank":[18,50]}]