[{"title":"What I expect from a low budget flick","rating":7,"date":"6 February 2020","review":"Overall, not a bad flick. There are both pros and cons. While I feel the story moves along and has a clear intention, there are a few holes in it that leave to be desired. The acting is up and down - some people do well and there are parts that feel forced.<br><br>The scene with the party is probably the best part - it feels good overall - this is in terms of how it is acted, the story telling, as well as the cinematography.<br><br>There are a lot of generic aspects to it, but again, low budget flick, so that gets a pass from me.<br><br>I personally think people are giving it a hard run - yea, it's not a big box film with a huge budget, it's not gonna be able to fight with them in terms of all the aspects we judge amazing films by... but for a B-flick... def worth at least a watch if you are into them.<br><br>Overall - decent flick with a handful of pros that balance out the cons. If you are into post apocalyptic flicks and especially B-flicks then give it a go.","user":"caeldeth","rank":[10,12]},{"title":"Bad. Just bad","rating":2,"date":"4 February 2020","review":"There's just seem to be a lot of people out there who are just making movies just for the sake of making movies with no other purpose. The movie is devoid of explanations to the situations we are presented with. The acting varies from passable to worst. The sound editing is absolutely horrible. the cinematography is o.k. at best. Not much is happening overall and the all thing feels very very long and is more of an exercise in patience than an entertaining experience and at almost two hours running time, you better brace yourself if you are determined to go through with it. Oh... And the musical score is as generic as they come.","user":"Horror_One_O_One","rank":[17,24]},{"title":"Could have been much better in spite of the low budget","rating":3,"date":"4 February 2020","review":"This is a pretty run of the mill post apocalyptic movie, one that is actually better than many others, but that's not saying much considering how terrible the majority are.<br><br>The story is nonsense. An apocalyptic event happens and now it's a couple years later and a small family is struggling to survive while moving around, there is nothing remotely original about any of this. The father is a useless oaf who is already wounded when we're introduced to him, the daughter has no personality to speak of throughout the entire film, and the mother is one of the worst written, poorly acted, and most obnoxious characters I've seen in awhile. They meet a random \"soldier\" of some sort who is a complete piece of trash and they for some stupid reason take care of him and trust him in some hope of a bunker full of goods. That's from the movie synopsis mind you, the actual movie has nothing to do with it, you have no idea why they put up with this violent psychotic idiot.<br><br>The movie is filled with stupid decisions and absolutely horrible acting, the mother is the worst. She's the main focus of the movie but she is just plain unlikable and annoying and a terrible actress. The daughter and the \"soldier\" come in equally second as the worst and most annoying. They're all terrible. There is a little plot sequence involving a hippy commune that ties into the end of the film that isn't too terrible, but story and acting wise this movie sucked.<br><br>There was some competent broad shots and music scores here that were quite nice, it doesn't feel low budget for certain sequences, but this is not a good movie. Also much of the dialogue is clearly dubbed over the film because they were too cheap or incompetent and had to do it in post production. I wouldn't recommend spending money to watch this film and the woman who plays the mother is a horrible actress regardless of how poor the script was and would have been better without her.","user":"terrencepatrix","rank":[15,22]}]