[{"title":"Old skool horror anthology. Better than VHS 1-2 n The ABCs of Death 1-2 but below Trick or Treat.","rating":8,"date":"1 September 2019","review":"Mick Garris (known for his adaptations of Stephen King's stories n the creator of Masters of Horror) directs the sequences of the theatre where characters from all the segments eventually turn up.<br><br>The first seg - The Thing in the Woods is directed by Alejandro Brugués (Juan of the Dead) n is a homage to the slashers n alien/creature films of the 80s filled with solid gore, comedy n the scream of the final girl.<br><br>The second seg - Mirare is directed by Joe Dante (Gremlins, Howling, Piranha) n it deals with cosmetic surgery. The segment's conclusion is ridiculous and unpleasantly sarcastic. Mayb Dante feels bad for Mickey Rourke's hard luck.<br><br>The 3rd seg - Masht is directed by Ryûhei Kitamura (Midnight Meat Train) n it takes place in a Boarding School where staff and pupils are possessed by Demons. It has sex without nudity (the sex mayb offensive to some including myslef), weird demonic seizures (hyperextension of joints). I dont know y these demons r obsessed with creating deformities in the joints.\nSome scenes r spooky n the demonic face is creepy. It has lots of impalings n decapitations. Some like me may b offended with kiddies' deaths.<br><br>The 4th seg - This Way to Egress is directed by David Slade (30 days of Night). It is about a woman who loses touch with reality n is slipping into parallel universe. This one is very surrealistic n frightening at times.<br><br>The 5th seg - Dead is directed by Mick Garris n is set in a hospital where a boy fights evil spirits and a real life murderer. The acting of the boy is awesome.","user":"Fella_shibby","rank":[40,56]},{"title":"Solid Anthology Film from Great Directors","rating":8,"date":"23 June 2019","review":"This was a film that I was quite intrigued to see when I saw the beginning of the trailer at my local theater. What really caught my eye about it was the theater setting is a great one for a horror movie. Then I found out this was an anthology film from a podcast and with the directors that made shorts, I was all in. When I saw it was playing at my theater, I caught the late showing. The synopsis is five strangers converge at a haunted movie theater owned by The Projectionist (Mickey Rourke). Once inside, the audience members witness a series of screenings that shows them their deepest fears and darkest secrets over five tales.<br><br>We start this off with a woman leaving an angry voicemail; she is Samantha (Sarah Elizabeth Withers). She comes up to an old, run down theater, but when she looks up at the marquee, it is a film that is starring her and called The Thing in the Woods. She goes to the ticket booth and it prints one for her. Inside, a light leads her to a seat and the film plays.<br><br>Samantha is covered in blood, wearing the same outfit. She comes to a charred body and falls on to it. We see she's being stalked by someone called The Welder (Eric Nelsen). She hides from him and her boyfriend then shows up. They try to flee, but after some events end up back at their cabin. There's something more to what is going on here than just a killer stalking and slashing these teenagers.<br><br>Next we get a couple that goes into the theater. Their film starts and it is entitled Mirari. The woman, Anna (Zarah Mahler), is in the bathroom looking in the mirror. She has a scar on her cheek and she's self-conscious about it. She returns to the table where her boyfriend is on the phone. Jason (Kevin Fonteyne) and her are engaged to be married and he knows how she feels about her scar. He tells her that he is willing to pay for plastic surgery if that makes her happy. She goes to Dr. Mirari (Richard Chamberlain) and during the consultation, he convinces her to get so much more done. Things might not be as what they seem at this clinic and it becomes a nightmare for Anna as she learns what has happened.<br><br>There is then a priest that is outside of the theater. Father Benedict (Maurice Benard) sees his name and the title Mashit. His film starts with a boy on the roof of the church. Everyone stares up in awe as a boy is about to jump. Sister Patricia (Mariela Garriga) goes up to save him, but when she goes to take his hand, it's bent away by an unknown force. He then falls to his death. This really bothers Dani (Stephanie Cood) who was friends with him. There is some inappropriate things going on here and Sister Patricia looks into a book of demons, finding one named Mashit. Father Benedict helps her to try to save the souls of the girls staying there. It might be too late to stop the events that are in motion.<br><br>The next person to enter the theater is Helen (Elizabeth Reaser). Her film is This Way to Egress and starts with her sitting in a waiting room with her two children. They're impatient as they've been waiting for at least an hour. The receptionist (Bronwyn Morrill) keeps telling her to be patient. Things start to get weird as everything becomes dirty and the receptionist's face distorts. Is she going crazy or is something more happening here?<br><br>The final short is titled Dead and it starts with Riley (Faly Rakotohavana) entering the theater. He finds a piano on the stage and starts to play. It then transitions to him playing in an auditorium. His father shows up a bit late, but makes it in time. The trio gets in their vehicle when a man appears from the back. They're all taken outside of it and in a tussle, the father is shot. Riley tries to flee and he's shot as well. When he wakes up in the hospital, he is confused. He keeps getting visited by his mother, who he thinks is still alive. He befriends another patient, Casey (Lexy Panterra), who has the same gift as Riley and it might not be good for him.<br><br>This is an interesting anthology and I will say it definitely kept me entertained. The shorts all have some interesting ideas in them. The Thing in the Woods has a nice swerve to it. I like that it starts as a slasher, one where we start in the middle and then becomes something much more by the end of it. Mirari felt a bit predictable, but I didn't mind where it ended up either. It really plays on something that many of us have with insecurities. Mashit brings some of my favorite things in the hypocrisy and corruption of religion. I also found it interesting that Ryûhei Kitamura was the director as he incorporates the Japanese ghost story into a Spanish based religious film. I didn't catch on to This Way to Egress until reading up on it a bit, but that was a good concept. I just wished they could have conveyed it a bit better for me. Dead also has a good concept, but I personally felt it was the weakest of the bunch. None of them are bad though, I do want to make sure that is established.<br><br>Something I really wanted to touch on with it is that I thought the wraparound was a bit weak as well. I prefer my anthologies to have a strong bridge between them. I do like the idea of The Projectionist. He comes off as creepy and I think that his lines are solid. It just isn't really fleshed out which I what I would have liked. I think that even expanding the film out a bit for that would have worked.<br><br>To the pacing of the film, I think that it is actually put together well. The stories really do get to run their course and I thought they all worked pretty well. Without continuing to harp on the wraparound, I do think that the transition to start each one does actually work. The only issue is that I don't really see a lot of need for The Projectionist aside from his somewhat profound things that he says to make the characters creeped out. The ending I thought was fine for the film that we got as well.<br><br>As to the acting of the film, I actually thought for the movie it was pretty good across the board. Withers really kicks it off and she does well in her role. I definitely like the reversal for her since we start with her. She is also easy on the eyes, which never hurts as well. Mahler does a solid job in the second short. She is a beautiful woman and I like the insecurity she shows. It really made me feel for her and when plastic surgery comes up, it made my heart sink as well. Chamberlain and his nurses were also quite creepy in that one with Fonteyne coming off as a nice guy, but there is something there I didn't trust to start. Benard was good in the next segment as was Garriga and the rest of the cast. Reaser actually really impressed me in hers. The story is a bit minimal there and it is more about her performance. I got the feeling she was overwhelmed to start and when it starts to really develop, it really made sense. She did a great job. To the final short, Rakotohavana was good in his performance. I felt bad for him and what he has to deal with after that fateful night. Panterra is an actress I've known about for years as a singer and it was great seeing her here. I have such a crush on her. Riley's parents and Orson Chaplin as Jenkins were good as well. Shout-out to Rourke as well for his performance with the rest of the cast rounding out the film for what was needed.<br><br>The effects of the film were also really good. I would say that a majority of it was done practically. The slasher aspects of the The Thing in the Woods were good. There is some CGI there as well, but it didn't bother me and it worked for what was needed. The after effects in Mirari creeped me out. There was some CGI used in Mashit were great. As I've said, it felt like a Japanese ghost film and I loved that. There is body contortion that always gets me. This Way to Egress seemed to be done mostly practical and I was on board for it. The changes are so subtle that it is unnerving, almost like we are descending into madness along with her and questioning what we've been seeing. Even more though that we don't really know if we missed something, because it's not really acknowledged. Dead also was mostly practical with a bit of CGI which was also fine for me. The film is shot great even though we have some a range of directors here.<br><br>The last thing to cover would be the soundtrack. Since each short is different, the scores of each have the feel that is needed. I really thought that overall they were all good. They fit for what was needed. At the time of writing these, none of them really stuck out to me, but I really don't have any that bothered me which is much better for me as I'm not great when it comes to the music. I will give a shout out that I love the song that Riley is playing on the piano. It always creeps me out and I love it.<br><br>Now with that said, this is a good anthology. I thought it was one of the better ones to come out recently that I can remember. I really like the range of shorts that we got here and the message they are trying to convey. With how different each one is, it really does all work together, which is great. I do wish there would have been a better wraparound story, as I feel that could have tightened it and connected everything a little bit better though. It is edited together great, with is peaks and valleys as they introduce each story arch. The acting really helps to bring it to life as well. Effects for the film are mostly practical and actually the CGI we get works or just enhances what was needed. The soundtrack of the film is fitting for what they needed and doesn't hurt the film in any way. Overall I'd say that I thought this was good and would recommend giving this is a viewing.","user":"david_rudy_lee","rank":[23,34]},{"title":"Underappreciated","rating":7,"date":"13 August 2019","review":"A satisfying low-budget movie that does many things right with unexpected twists and clean choreography. There's a clear understanding of technique and an entertaining experience. The pace slows in segments, but I've seen movies with bigger budgets that tell more cliched stories.","user":"darkandstormyknight","rank":[17,24]}]