[{"title":"Lame, don't bother","rating":2,"date":"5 March 2019","review":"6 reviews before me, clearly all fake - this film being their only review. This is a low budget film with writing about as good as a 5th grader. The only redeeming quality was the decent acting and ok directing. Dumb comedy/horror we've all seen many times before, only this one is bad. Ignore the fake reviews before me and I'm sure after me, and watch something worthwhile - that doesn't require fake reviews. 2/10 from me","user":"TheTopDawgCritic","rank":[61,88]},{"title":"These are obviously fake reviews","rating":5,"date":"5 March 2019","review":"It's not saying that this is a horrible movie, but all these 10 stars reviews hailing it as \"brilliant\" and \"perfect\" are obviously fake.<br><br>First off, it's not funny at all. There is zero comedy. This is a low-key, cheesy horror movie with only a few scares. I guess that qualifies it as a thriller, but barely. The acting and cinematography are alright, but really nothing special. The story however is it's high and low points at the same time. While there is some originality here, it boils down to a confusing, convoluted mess in the final act. The suspense never hits any high octane levels of intensity and as original as it is, it's still kinda predictable.<br><br>I applaud them for trying something a little different, but ultimately it's a watered-down horror movie with a decent plot that is fairly forgettable. 5/10","user":"mikedegroot","rank":[37,57]},{"title":"Waste of time","rating":3,"date":"6 March 2019","review":"These 9 and 10 star reviews have to be from people associated with the film. Nobody else who isn't clinically insane would give it more than 5. There are a couple of good lines but overall it's not funny. The plot is so stupid that you don't care enough about the characters for it to be scary. The acting and cinematography at least aren't too bad - but it doesn't matter because the script is such a mess. Please avoid this movie, you'll hate yourself afterwards if you don't.","user":"alanfiske","rank":[38,60]}]