[{"title":"Worth Watching","rating":23,"date":"23 September 2019","review":"Vicky Knight does a good job here making you feel what it is like to literally lose your face. Screenplay and direction help her to create a character, that maintains its dark sides even when everything is ready for pure compassion. Not on the light side, but worth watching.","user":"velvet_zoo","rank":[3,3]},{"title":"Lots of squandered potential for a great movie...","rating":4,"date":"12 July 2019","review":"Admittedly, then I had somewhat expected more from a movie such as the 2019 movie \"Dirty God\" by director writer and director Sacha Polak.<br><br>\"Dirty God\" turned out to be rather slow paced, and very little was actually happening throughout the majority of the movie. And that was making it somewhat difficulty to sit through the entire movie and not have your attention on the screen start to fail and wander.<br><br>It should be said that the acting performances in the movie were quite good, and Vicky Knight - playing Jade - was actually putting on a very strong and memorable performance. It was just a shame that the movie's storyline was less than mediocre and the pacing of the movie was so monotonous.<br><br>While Vicky Knight was performing nicely, the Jade character just wasn't really fully written to a satisfactory level for me. The character seemed shallow and more of a rough draft at the character, than it was a properly fleshed out - pardon the pun - character that you could relate to.<br><br>I managed to sit through the entire movie, but I wasn't particularly entertained, nor did I find \"Dirty God\" to be an overly enjoyable movie. It was simply too mundane and slow for my liking. Hence the four out of ten star rating I am giving it.<br><br>While I did manage to sit through \"Dirty God\", this is by no means a movie that I will ever pick up and watch for a second time. The movie just simply had very little replay value to it.","user":"paul_haakonsen","rank":[12,18]},{"title":"Gritty and fly on the wall style","rating":9,"date":"28 July 2019","review":"This film really hits home as it gets inside the head of the main character and takes us on a rollercoaster emotional experience. We are never quite sure where the film is heading, it really works on a more docu-drama level than any film I have watched since \"Amores Perros\". It has a very gritty approach to British subculture and the only violence occuring has preceeded the start of the film. Casting an actual burned actress in the main roll adds a dynamic that would be hard to achieve otherwise. Acting is first class, the film never lets up and really has neither a good or bad ending, it is just what it is - a snapshot of a beautiful young girl tragically maimed and trying to come to terms with a future, any future.","user":"mickmcneill","rank":[6,8]}]