[{"title":"I expected more after the first movie ....","rating":6,"date":"9 September 2019","review":"It's been a while since I've read the book or seen the first movie; so I apologize if I get some things wrong.<br><br>TLDR; The film drags on in the middle by splitting up the crew and subjecting them to meaningless jump scares. This means little character interaction (which is part of what the first movie had going for it). By the time you get to the final confrontation with Pennywise, you're just tired of the jump scares and want it to be over because you're not really rooting for the losers. And if you are, it's mostly because of what was established in the first film.<br><br>Pros:\n<ul><li>The film starts off great. Somehow the scene at the bridge manages to match the iconic opening scene of the first.</li><li>Skarsgård is an amazing Pennywise and is creepy as hell.</li><li>Stan's speech in Richie's second flashback is great and actually funny.</li><li>Casting is, for the most part, really good. I think it was hard for some of the adult actors to find a balance between being recognizable while still showing how they've matured over time. Adult Richie is too kid-like while Bev is too mature to the point of being unrecognizable.</li></ul><br><br>Cons:\n<ul><li>Bowers is half-assed. Literally just used for three jump scares and nothing else. Either imply that he died and leave him out or fully use him like he is in the book as the epitome of the corruption in Derry.</li><li>The final form of Pennywise is unsatisfying. It's literally a clown torso on some sort of arachnid body. They needed to go full arachnid alien like it is in the book. I think this part is just difficult to translate from the book though.</li><li>Stan's letter at the end cheapens his death. Instead of him literally being unable to handle his fear of IT, his suicide is portrayed as a sacrifice to save the others.</li><li>There's next to no character development and very little meaningful interaction between characters. I blame this mostly on the middle 90 minutes where they all split up. It's totally different from the first film where they are actually a team.</li><li>Speaking of which, this part where they all go their separate ways to find their \"tokens\" is so contrived. The story literally loses all its steam due to this and makes it feel way too long.</li><li>All of the monster scenes except the ones with Pennywise have terrible CGI. They might be gross and/or startling but you can see them coming and they don't contribute much.</li><li>About 1/3 to 1/2 of the jokes just kinda fell flat.</li><li>The constant jump scenes and long running time just make this movie exhausting to watch. It was just a constant cycle of \"pan to character, give a little backstory, jump scare, repeat\".</li></ul>","user":"tyjchurchill","rank":[668,842]},{"title":"Call me \"old fashioned,\" but CGI monster overkill does nothing for me","rating":5,"date":"7 September 2019","review":"I really, realllly wanted to like this film. As a huge fan of the original mini-series (and EVERYTHING Tim Curry), I knew I'd have a challenge going into both Chapter 1 and Chapter 2 with an open mind. I had to separate. I didn't have as high of expectations as I did for Chapter 1 as Part 2 of the mini series was much weaker than the Part 1 anyway as well as Stephen King's It (Book).<br><br>The actors were great. Even the first few jump scares were decent, and then it just became overkill. And not scary whatsoever. All of the CGI monsters look ridiculous and completely take you out of the moment. I grew up watching 80s/90s horror (AND LOVING IT). The baddies were REAL and TERRIFYING. For example, Mrs. Massey, the bloated bathtub corpse in The Shining. That was a real, completely horrifying image that has stayed with me 30 years after I First saw the movie. I don't understand the obsession with CGI when there's no need for it.<br><br>Sadly, this movie was just a drawn out bore.","user":"daniellemobsby","rank":[871,1]},{"title":"Was this a comedy or a scary movie???","rating":2,"date":"14 October 2019","review":"Why they tried to add so much humor is beyond me. It ruined the entire movie.<br><br>Now the guy that plays Pennywise did a great job. Except for the CGI Pennywise (that was out of his hands).When he played the character with no CGI I was blown away.","user":"rburgz","rank":[240,300]}]