[{"title":"another winning special for a very funny comedian","rating":10,"date":"25 January 2018","review":"I don't get the whole \"thing\" about the word \"retarded\" in this special. politically correct puffed up anger is so tiresome. have a fucking sense of humor - it's a brief mention of why the use of the word is now different (along with gay and midget, btw), and nothing anywhere like the hate speech that's being portrayed as. calm down people. the hour is damn funny.","user":"davidm-14","rank":[20,27]},{"title":"Sarcasm, my kind of humor","rating":8,"date":"20 April 2018","review":"Stand up comedy is never easy. You have to have a natural talent for humor, sometimes improvising, and perfect facial expressions. Tom Segura has that. His shows are funny and Disgraceful is just what I wanted it to be. That some people think you can't laugh with some subjects is their opinion but I think, and I'm not the only one, that you can laugh with anything as long as you don't laugh with the handicap of a specific somebody. All the rest should be tolerated, as humor is the best cure for everything, even sarcasm, which in this stand-up comedy is overly represented. I had real good laughs, and even with the milder jokes I still had a smile on my face, so to me it's definitely worth watching.","user":"deloudelouvain","rank":[8,12]},{"title":"Special Comedy","rating":7,"date":"20 March 2018","review":"The special got special attention because Tom made fun of not being able to use a derogative term for special/disabled people. I'm not repeating the word that starts with a \"R\" just in case people reading this flag the review because of that, but you surely know what I mean. Now whatever your stance on the use of the word is, will kind of define if you are open to Toms comedy. Or even if you feel this is comedy.<br><br>The special in itself is funny (again eye of the beholder), but it's not classic material. I generally like Tom, have seen him on a couple of talk shows and I like that he dares to not hold back any punches. So if you are easily offended, and I know I'm stressing that point, but I just want to make sure that you are not going to watch it ... if you are for obvious reasons, if you are not, don't expect it to be disgraceful either (well at times obviously). Neat package and good jokes","user":"kosmasp","rank":[7,13]}]