[{"title":"Doesn't get into gear","rating":3,"date":"25 June 2019","review":"While a big fan of Pixar, am of the opinion that all three 'Cars' films are among their weaker feature films, particularly the third. Still don't think though that either of them are that bad, not a popular opinion with the sequels. Actually considered the first film decent, the second film tried too hard and was messy story-wise but found it better than its reputation and the third did feel tired.<br><br>'Miss Fritter's Racing Skool' is another 'Cars' feature related short film after 'Mater and the Ghostlight' (although Mater is an acquired taste to me that was much better). Of the feature related short films, 'Miss Fritter's Racing Skool' is the worst, the only one to not do anything for me being somebody who enjoyed the rest of them. Other than the setting and having some major characters from the film, it didn't feel like a 'Cars' film and it is the only feature related short film to feel completely pointless.<br><br>The best thing about it is the animation, which is outstanding and the component that never failed with Pixar. It's rich in colour, gorgeously designed and the attention to detail is incredible. The sound is thrillingly authentic and the music has the energy that was lacking elsewhere.<br><br>Voice actors do serviceably with the little they have to work with.<br><br>Conversely, 'Miss Fritter's Racing Skool' is far too short and too rushed, trying to cram in too much even with a story as thin as a wafer, not much of one at all actually. The characters are so brash in personality and obnoxious that it is very difficult to root for them, while little is done with the setting which feels just there.<br><br>Nothing here is informative, while much of the material feels very fatigued and there is no heart or charm in sight. When it's not over-the-top, it feels very empty and cold and even with a lot crammed in and a rushed pace there is no energy to the material.<br><br>On the whole, love Pixar but this was rather weak. 3/10","user":"TheLittleSongbird","rank":[3,4]},{"title":"This is where it should end","rating":4,"date":"2 December 2018","review":"\"Miss Fritter's Racing Skoool\" is an animated short film from 2017, so still relatively recent, and this one here adds slightly under 3 more minutes of action to Pixar's Cars franchise or I should say to \"Cars 3\" of course. You won't see too much of the known characters here I believe except at the very beginning and end. In the middle, we get Miss Fritter and some other loud boastful cars associated with MF's Racing School. The characters are fine, but it all feels so rushed, which fits given the speed and adrenaline of the main characters, but it really gets in the way of creating a convincing story line and depth from any kind of perspective. I still think that Cars is perhaps the very weakest Pixar came up with in the lastg 20 years and really the almost only film (series) I'd say is rather for kids than grown-up from what they did, but now after the third and with this extremely mediocre and not particularly funny add-on, it is enough and there is no real need for a 4th film. Yes we should not take the excellent animation for granted, but it feels a bit difficult given the level of animation in film right now, also outside of Pixar. Overall, only see it if you (or your kids) really really adore Cars (3). I myelf give it a thumbs-down and it did not get me curious about finally checking out (more from) the franchise at all.","user":"Horst_In_Translation","rank":[1,1]}]