[{"title":"opinions vary","rating":5,"date":"17 January 2019","review":"Greetings again from the darkness. In what would likely be more effective as a stage play than a film, director Marianna Palka (GOOD DICK, 2008) subjects us to first four, and then five adults, each participating in what is mostly a 90 minute exercise in passive-aggressive bickering. There are absolutely some moments of pure movie gold, and the premise is quite promising, but unfortunately the bulk of this movie experience is simply watching annoying people and listening to their irritating banter (courtesy of the first screenplay from Risa Mickenberg).<br><br>In defense, annoyance is the goal here. Former art school classmates Karen (Christina Hendricks) and Tina (Alysia Reiner) have arranged their first get-together in many years. Karen brings her wealthy snob husband Don (David Alan Basche, Ms. Reiner's real life husband) to Tina's bohemian loft which she shares with Wayne (Gbenga Akinnagbe). Karen is 8 months pregnant, Don is worried about his Cadillac in this neighborhood, Tina is a conceptual artist, and Wayne adamantly refuses to be defined by his work - of which he seems to have little.<br><br>Judging others seems to be the point of this little party, and as Karen calls giving birth \"one of the most beautiful things in life\", she has to stop every 5 minutes to pee and eat, and repeat the cycle - all while being unable to sit comfortably. Riffing on how decisions are made on whether to become a parent, and how contemporary gender roles are defined, an abundance of societal commentary leads to a never-ending soft core argument. The bombshell hits when Tina announces she and Wayne are having a baby via a surrogate. Things get really interesting when Kiki (Anna Camp), the surrogate, joins the group.<br><br>The wheels go flying off when Kiki reveals she has been in a 5 year relationship with a married man, and that man's wife is now pregnant with their 6th child. Kiki also talks about the 5 stages of womanhood ... each seeming to be in service to man. The conventions of motherhood, and contrasts in suburbia vs. bohemian lifestyles are a central theme here, but none of these folks are the type from which we can draw any inspiration or insight. They are self-centered, insecure types with each trying to prove their high level of enlightenment to the others.<br><br>Mostly it's 90 minutes of whiny women and whiny men, in what could have been a fascinating look at motherhood and the evolution of friendship between two women who chose different paths. There is a bitterness to the story and the characters, and uncomfortable discussions handled in such a way that the biting humor rarely hits its mark. Even the ending, which is totally believable, is unsatisfying given what we've been through with these characters.","user":"ferguson-6","rank":[32,36]},{"title":"Not a comedy","rating":9,"date":"8 August 2019","review":"I have to say this is one of the best conceived and acted films I have watched in a long time; it seems as if it might transfer very well to the stage if someone wanted to bother.\nWhat I must comment on is the classification of \"comedy\". Perhaps for singles or people that are disillusioned with relationships and parenthood, this might seem funny, but if you are a conscientious parent or in a willingly committed relationship, this was far from funny.\nEvery single one of the characters were well-acted and very believable so that I saw very close similarities from my own social circle and the subject matter was very dark.\nI would classify this as \"drama\" and remove the \"comedy\" tag.","user":"Ruffles","rank":[8,9]},{"title":"Nice little Gem","rating":6,"date":"16 June 2019","review":"Wouldn't call it brilliant but over-all it was a nice little movie.\nI was surprised at the low rating then I remembered that people tend to lie action and suspense and crazy twists and turns. Well this movie has none of that but shows how REAL life is. Coming of middle age and sacrafices people make.<br><br>Great acting..<br><br>over all<br><br>6.8","user":"natcalgary","rank":[6,7]}]