[{"title":"Moths, Souls & South African Lore","rating":5,"date":"19 October 2019","review":"This film by Harold Holcher explores the supernatural world via a story of a family encounter with a man with a curse. It does this with a good performance by Tshamano Sebe playing the character of \"Larazus\". Although this film has a good story with beautiful landscape shots, the delivery of the supernatural was not as strong.<br><br>A common theme throughout the narrative are references to the natural world: moths, worms, etc. Again the story have some interesting metaphor with insects and the afterlife, Sebe's performance holds the film together. His performance alone, deserves a looksie into this film, hopefully he will reappear in another supernatural film.<br><br>That being said this film.with the idea of South African \"Fantastic\" and \"genre\" cinema, this still a film to see. The growth of these films are growing in South Africa, like couple of years with 2017's \"Lullably\" by Darell Roodt.","user":"babyjaguar","rank":[17,19]},{"title":"Very slow moving, moody lore based Horror Story. Beautifully crafted, but somehow ultimately lacking...","rating":6,"date":"22 February 2020","review":"This is kind of a hard one to write about. If it were just the story alone and it had not been so well technically put together, I probably wouldn't have even bothered to write a review about it.<br><br>The story itself is basically pretty simple. You definitely will need subtitles for the non-English parts so you will be able to understand what the indigenous people are saying and dealing with, not to mention some important dialog between Lazarus and his, uh... companion. If you do not have subtitles, then you will not be able to follow the story very well, unless of course you happen to speak the South African language that is being spoken : )<br><br>I think one of the reviews that I read on one of the sites I normally check for films like this stated that he felt that this film had one of the best openings he had ever seen. I would agree. But, I don't feel it ever really reaches that level of intensity from that point on. And, FWIW, the cinematography, lighting, and editing are are done extremely well. The scenic shots are lovely. This is a VERY beautiful looking movie. BUT... in my lowly and wretched opinion I feel that although crafted really, really well, and the acting by the primary Lazarus was outstanding (the girl, not so much...) ultimately, to me the story was not really quite substantial enough or fully satisfying to fill it out completely. It was okay and certainly not terrible, and like I've mentioned, technically executed really well. I just don't think that it really packed the 'punch' that it could have. It kind of went in a more Metaphysical, ethereal direction as opposed to cranking up the intensity, which with this kind of Horror film I think would have worked better. The very, very ending though, not mentioning anything specific of course, but the ending at the very last moment is a little bit of a Gobsmack, but I didn't really quite understand it. As a matter of fact, I was just now kind of scouring the Internet to see if I could find some opinions or explanations about what it meant : )<br><br>Anyway, honestly not a film that I would get hugely excited about, I gave it a '6' which for me is just about at the borderline of maybe being worth a look. But, I really DID think it was a very beautiful movie and it was constructed very well, so I thought that it was at least worth a mention here...<br><br>I would say that if you truly don't mind extremely slow and fairly simply plotted films and you appreciate beautiful photography and some light but decent atmosphere AND you are not expecting a lot, then you might find this one mildly enjoyable.","user":"lathe-of-heaven","rank":[7,8]},{"title":"Interesting but fails ultimately in its goal","rating":5,"date":"29 February 2020","review":"Great performance from Tshamano Sebe, the rest are forgettable as is the story.<br><br>Great photography and landscapes and an interesting idea that toys with nature and the hereafter but that holds little water, no scares, no tension and fails to ultimately deliver anything worthwhile.<br><br>Admittedly I did not have any subtitles so perhaps I am missing something but the ending was rather confusing - where did the little girl go and why was the soul eater re-incarnated/taken over the wife of the farmer, where did his demon/soul eater/daughter go, where did Lazarus go - who knows, only the writer perhaps but it does have a certain air of mystery and dread but not enough to carry the whole movie!","user":"omendata","rank":[2,2]}]