[{"title":"A piece to help you think","rating":8,"date":"23 September 2018","review":"This movie is a fascinating collection of opinions and thoughts on the subject of the Brexit vote, delivered straight to the camera from people living in Britain, post-vote. It also adds an interesting mix of \"expert\" opinion to the end of the film.<br><br>I felt this documentary really succeeded at capturing passionate and persuasive opinions from many angles. I really liked this approach. There were people who I agreed with and disagreed with on both sides of the issue. I could also feel my own opinion shift around a bit as I watched.<br><br>The film doesn't hide from the complexity of the situation, so as a result many ideas come into play. This makes it more interesting, but it also makes it harder to come to a simple resolution of your own. (Not a bad thing in my opinion.)<br><br>The last quote in the film is really interesting. I had to watch it twice to make sure I got it. It reinforced to me the careful approach that the film took-and the priority it made of helping to generate understanding (in place of its agenda or criticisms). Definitely recommended for those interested in the nature of Brexit- and in politics as they exist today.","user":"tyboulder","rank":[4,6]},{"title":"Quite a rarity","rating":17,"date":"17 September 2018","review":"This is quite a rarity for a feature length documentary - it doesn't seem to have any clear overall message. It's just a collection of random soundbites about Britain and the Brexit vote - some for and some against. It's quite \"arty\" in its treatment and it almost feels more of an art installation than a film. On the whole, it's so confused and confusing that it's really unclear what we're supposed to make of it. Mildly entertaining in a \"je ne sais quoi\" kind of way...","user":"Phil_Chester","rank":[4,7]},{"title":"Fact checking missing","rating":1,"date":"5 January 2020","review":"So much inaccurate opinions being expressed without any challenges or clarification.","user":"paddymcrico","rank":[2,4]}]