[{"title":"Quite moving & poignant","rating":9,"date":"24 March 2018","review":"This movie is far better than your typical Bible or 'faith-based' movie; I admittedly had some low expectations going in to see it and was very surprised by a quality film with a beautiful message. Not for one second did I feel that this was preachy or 'Bible-beating'... it was more pure and authentic and humanist. \nThe acting is top notch, with Jim Caviezel, Faulkner, and Olivier Martinez really giving some nuanced and layered performances. Nobody phoned in their roles, you could sense a level of passion and commitment to the story. The music was also excellent, a gorgeous score that was paired with some nice cinematography and production design. The movie looked good and sounded, but importantly - it felt good. \nLots of films in the devotional genre tend to end up being mere dramatic recreations of the gospels, but this one, while delivering authenticity, was not as concerned with delivering a 'live-action experience of the Bible' so much as striving to express the true message of Paul. That message, the one that is basically Christ's Sermon on the Mount, is the crux of the film. This gives it an emotional heft that is quite poignant. I wasn't so moved by the characters' actions and the story in so much as what they were feeling in their hearts and what they were expressing. \nDammit this movie hit me right in the feels and I already know it will linger with me for days. That is a good sign that I just participated in some human art. \nWon't win any Oscars, and sadly probably won't light up the box office but this is a fine and beautiful movie with an important and relevant message for the world today.","user":"MovieMan1975","rank":[122,142]},{"title":"Powerful and unusual","rating":8,"date":"31 March 2018","review":"It moved slowly at times or was it simply that we expect a higher body count and more explosions in our films? I thought it gained tremendous momentum towards the end and I left feeling very satisfied, uplifted, and quite entertained. This is a very unusual film in many respects. Its very downbeat, almost like film noir...really. Many scenes are quite dark and the lighting effects are really unusual and I found the pleasing. The acting was fine and the and the movie had a very original feel despite everyone knowing about the Apostle Paul and his unique life. I got to say that Christianity has strayed radically from the vision that Paul had!! It was interesting to me how closeups were used in so many scenes. There were some rough scenes including the final ones but that was reality back then and still is in many parts of the world. I recommend this film highly for anyone looking for something deeper that offers a unique perspective on many levels. Definitely worth your time whether you are into religion or not. Good one.","user":"asinyne","rank":[51,59]},{"title":"Be prepared for a heavy movie with a great cast","rating":7,"date":"29 March 2018","review":"There's no getting around it - this movie is heavy from start to finish - not a moment of comic relief. It is a very sobering film, showing the terrible toll on lives that can occur when evil tyranny is unchecked. It was a fascinating time in history, and an interesting segment of Paul's life to explore -- rather than his 30 years of ministry and 10,000 miles of travel, we get only a focused glimpse into his final days in Nero's prison, with flashbacks to his original time of conversion.<br><br>On the upside: This movie is very well done from a production, acting &amp; cinematography aspect. It keeps you engaged; its almost like watching a mystery unfold, due to its intensity. Jim Caviezel (as Luke), Olivier Martinez (as the Roman prefect over the prison), and Joanne Whalley (as Priscilla) were all brilliant in their roles. I mean, really brilliant. (I also loved Joanne in her role of Claudia in A.D.; and Jim Caviezel became one of my favorite actors after \"Count of Monte Cristo\" and \"The Passion\". But Olivier was the real surprise - extreme talent.)<br><br>On the downside: Most of the movie feels hopeless. What ever happened to the miraculous power and intense encouragement that Paul operated in during all his years of ministry? I feel that the creators of this movie completely underplayed Paul and stripped him of all the elements that made him who he was in the kingdom of God. That was extremely frustrating, since it presented a powerless, hopeless Christianity, other than to be martyred and receive eternal life. Not very appealing. It made me dislike his character more than like it.<br><br>In conclusion, the movie is definitely worth seeing for the artistry and story, if you can handle the context, the embellished story line, and a depressing outlook through most of the movie. But if you only like \"feel good\" movies, you might want to avoid this one.","user":"naturallyrockin","rank":[64,76]}]