[{"title":"Outstanding NYC Street Conflicts Drama","rating":8,"date":"14 February 2020","review":"Living in a community shelter in the Bronx with her mother and two little sisters, teenager Goldie is running against time to gather everything she needs (including an expensive golden coat) for a promising gig. An aspiring free-style, hip-hop dancer, she runs through the streets of the borough, claiming her right to be free and young in New York City, while flirting, shoplifting, meeting associates and preparing herself to dance on a music video. When her mother is taken away by the cops, she runs away with her two little sisters trying to protect them from child services, avoiding separation and facing a harder task: responsibility. She won't give up on pursuing her dancing dreams, which will put her on the path of dangerous drug-dealers, and other unexpected obstacles, as she tries to survive and accomplish at the same time. Award-winning director Sam de Jong's sophomore feature film is a colorful, vibrant, realistic portrait of youth in the Bronx, addressing the struggles of empoverish Millennials and the incliments to criminality. Model Slick Woods gives a breakthrough performance as the protagonist, building up a charismatic, spontaneously funny and outrageously feminist character with truthful passion. The supporting cast also shines, a bunch of eccentric, modern-based youngsters whose priority in life is to have fun, especially Angela Griszell as the clueless Princess, and fully-tatooed Jose Rodriguez, as a promiscuous playboy. With the help of a brilliant redish tone cinematography capturing the warmth and heat of the streets and its people, and the pot-boiling situation, as well as a precise, animation-mixed editing, great soundtrack, director de Jong conceived a daring, engaging coming-of -age story. Nominated for the Crystal Bear Award at Berlin, he is definItely one filmmaker to watch.","user":"roger-99-171599","rank":[6,15]},{"title":"Worst visual effect movie","rating":3,"date":"18 March 2020","review":"Story is terrible and it's not the worst. It's very hard to feel comfortable with the special effect done in the movie. Back to the story line, it's just terrible to see a teen girl deal with cops, money, drug, if you looking to watch a serious topic like that, can try.","user":"ks-60500","rank":[0,3]}]