[{"title":"A Bummer of a Christmas for Jon","rating":27,"date":"27 January 2019","review":"Jon, the protagonist of \"Fall City,\" must have the worst luck of anyone on the planet! Even when he returns home to spend the holidays with his parents, the poor guy can't catch a break. While this Christmas film had an occasional uplifting moment, the overall effect on poor John was hardly a Christmas to remember!<br><br>The film makes it clear that Jon had a rough upbringing. He had a close relationship to his grandfather, whose death impacted both Jon and his absent father. Jon wasn't a stellar student, and eventually he stopped going to classes, was placed on academic probation, and finally dropped out of college in Washington. He never sustained a job and eventually spent time in prison on a felony charge. In fact the film's opening scenes shows Jon engaging in petty theft after being evicted from his apartment for failing to make rent.<br><br>He returns home for the holidays, and his parents greet him by insisting that he pay them rent! Jon gets a temporary job in the local post office, mopping floors and kowtowing to his supervisor who was his nemesis as they were growing up. Eventually, the two men will be competing for the job of assistant manager at the post office. Guess who will get the job? Eventually, the two men will be competing for a woman? Guess who will get the girl?<br><br>The highlight of Jon's Christmas is meeting a nice young hair stylist who appears to be a single mom. But, no, the divorce is not finalized, and the man to whom she is separated is Jon's rival at the post office, Derek!<br><br>John breaks bread with the young woman named Olivia and her little girl Adriel. Olivia also gives Jon a haircut that completely transforms his physical appearance. Inside, Jon is changed by the growing friendship with and attraction to Olivia. Of course, there will be major complications when Olivia considers reuniting with Derek.<br><br>In the meantime, Jon cannot avoid the long arm of the law, even when he dresses up like Santa Claus and delivers letters to children throughout the town. The little kids had written letters to Santa at the North Pole c/o the post office, and Jon took the time to write personal replies. Both Jon's father and mother may turn on a dime and become snippy and confrontational with their son. Olivia too is unpredictable in her mood swings, as she faces the pressure of financial insolvency. Sadly, the most soulful encounter for Jon is a long-distance call from his brother, who is serving in Afghanistan.<br><br>At one point in the film, Olivia joyously cried out, \"Now this is Christmas!\" as she and Jon were listening to Christmas songs. Unfortunately for Jon, he will be spending Christmas Eve sleeping under a pile of leaves as the police are hot in pursuit. And Christmas Day will not bring any more joy to this most unlucky soul. This will be a bummer of a Christmas for Jon!","user":"lavatch","rank":[3,3]},{"title":"Never Give Up","rating":7,"date":"10 March 2019","review":"Like Charlie Brown, you have to be ok with watching someone keep failing over and over to enjoy this movie. On the surface he's a pathetic looser that can't stay on the right track to save his life, but he's got a never give up spirit and that's what makes it interesting watch!","user":"EggOrChicken","rank":[2,2]},{"title":"Touching And Unpredictable Christmas Film","rating":8,"date":"30 November 2018","review":"Fall City is not a typical, predictable Christmas film. It is more nuanced and realistic in presenting characters that are neither all good or all bad, and choices that could be interpreted in different ways. Well acted and beautifully filmed. Great addition to your holiday watch list!","user":"colosmiths","rank":[4,6]}]