[{"title":"Half A Great Movie","rating":6,"date":"2 October 2019","review":"There's something admirable about taking a film about a killer dress deathly seriously. It's this sort of commitment we just don't see in movies anymore and In Fabric should be applauded for daring to take its subject matter seriously.<br><br>In Fabric does start off well with Marianne Jean-Baptiste turning in a fantastic performance as a recently divorced woman working a soul crushing job, trying to take care of her rebellious live-at-home son and his truly awful girlfriend, and making time to go on dates with a bevvy of losers. Instantly, we can relate to this woman's plight and when she finds this beautiful red dress at a mysterious department store, it seems like things are looking up...until the dress starts making bad things happen. First of all, it doesn't want to be washed, so it causes washing machines to explode and, second of all, it was last worn by a model who met a gruesome end. Will our hapless heroine be next?<br><br>In Fabric's biggest issue is that it feels like a short Tales From the Crypt episode extended to almost two full hours, which leaves the audience mostly bored after the first hour. There's a major detour the film takes mid-way through when it gets bored with its heroine and introduces a new set of characters which brings the film down, because we don't care about them nearly as much. Maybe if Jean-Baptiste hadn't been so phenomenal in the first half or they'd decided to make a film about multiple characters encountering this red dress, it wouldn't have been as jarring a switch.<br><br>It looks stunning, has atmosphere in spades, and the music score is haunting, but it goes on for far too long and ends in the most anti-climactic way imaginable. It's still worthy of your time, but it's a shame a few things get in the way of it being really excellent.","user":"angelakenney-52982","rank":[28,33]},{"title":"What's with the bleeding hairy mannequin?","rating":4,"date":"1 September 2019","review":"I watched this movie lastnight. Loved the soundtrack. I forgot to drop some LSD so didn't really understand what was going on it. Who were the sellers of the dress? Vampires? I didn't understand the whole mannequin bleeding and curly hair thing. Does anybody? I feel as though part 1 and part 2 were crammed together however it is understandable because I certainly would not watch a part 2 of this movie if ever released. Bizarre movie to say the least.","user":"dieseltech-59317","rank":[27,34]},{"title":"Half good, half overstretched","rating":4,"date":"7 June 2019","review":"I had the opportunity to watch the preview with Q&amp;A with Peter Strickland, and the useless questions from the audience, eager to show they had some knowledge and references instead of genuine questions, did not allow me to ask the director: why didn't you stop after the first half ? I enjoyed this first part, stylish, quite funny, and it could have ended like that, we had got it. The second half of the film was in my opinion un-necessary, adding nothing else to the plot and even making the movie feel too long. A bit like too little jam on too long a bread slice, it lost its taste, and became repetitive, over the top and I must say quite boring in the end. Sometimes, a short story is better than a novel. The things which are really FANTASTIC about this film are the soundtrack and music. You might want to watch it just for that!","user":"barbarahell","rank":[54,78]}]