[{"title":"The greatest movie in queer history","rating":10,"date":"26 October 2017","review":"Honestly this movie is the greatest film in queer cinema history. It has everything from romance to action to spooky ghosts and vampires. Elise Bauman and Natasha Negovanlis shine as respectively Laura and Carmilla and their romance develops and continues to thrive despite the many obstacles they face. The creators have done a fantastic job in avoiding LGBT+ tropes and the movie does a great job of being just that, an amazing movie that just happens to be hella gay. The representation in this film makes up for any past mistakes done by the media (and that is saying something!). Whether you have been a fan since the beginning, started watching more recently or have never even seen the Carmilla series. This film can be enjoyed by everyone from all walks of life.","user":"caroldanverswho","rank":[31,56]},{"title":"The little web series that did.","rating":8,"date":"26 October 2017","review":"The staff of the Carmilla web series and movie have turned the original novella into something much bigger. This movie will no doubt have an impact on the LGBTQ community and the direction of LGBTQ film.<br><br>For fans of the series, you know the story; you know the characters; you know the themes. For those who are new to the series, I would recommend watching the web series on YouTube first. The story is simple: 19-year old Laura Hollis (Elise Bauman) wants to find her missing roommate. Using the perfect amount of comedy and seriousness, we see the characters develop relationships with each other, and later on, they become so much more than just characters on the screen. Because all queer aspects in the show were normalized, the characters become relatable, especially for the LGBTQ community. They become human like us-imperfections and all. The fixed camera angle had limitations, but the staff did well to develop these characters and their stories. The main relationship is between Laura and Carmilla (Natasha Negovanlis).<br><br>Although the movie moves away from the fixed camera angle, many things are the same: the humor, the seriousness, the characters and their quirks. It was a delight seeing these characters again in a different setting.<br><br>Bauman and Negovanlis are phenomenal as Laura and Carmilla. In every scene together, their love for each other is palpable. Their lines were spoken with strong, vivid emotions. They are truly the heart of the series and gave amazing performances.<br><br>What I appreciate the most about the characters' relationship is that it avoids the common tropes found in the mainstream media's representation of lesbian relationships. This is reflected in the sex scene which is one of the best that I have seen thus far in an LGBTQ movie. By avoiding the objectification of the characters and their actresses, it avoided being pornographic. It avoided common lesbian sex tropes such as scissoring. The scene had so much intimacy and emotion. It was a realistic portrayal of two women who love each other. Most importantly, it was so normal--a step in the right direction for LGBTQ representation in film. Future film makers should take note.<br><br>The only downsides to the movie were the plot, the pacing and the supporting characters who didn't have a chance to shine.<br><br>The plot is not perfect. It has continuity issues with the web series and several plot holes. This is mostly a problem for those who are new to the series and for those who take the series' plot seriously (I imagine most people don't).<br><br>The movie starts off very quickly and then starts to drag on in the latter half. Most of the latter half of the movie involves the gang running around the house. This could have been remedied by including more character development in the beginning and slowing down the beginning of the film. I'm sure most viewers wanted to see more domestic scenes with Laura and Carmilla.<br><br>Outside of Mel (Nicole Stamp), supporting characters weren't given enough time to play a big role in the movie. Viewers of the web series will be okay with this, as they known the backstories already. However, how many viewers actually cared about the drama between LaFontaine (Kaitlyn Alexander) and Perry (Annie Briggs)? What exactly did Kirsch (Matt O' Connor) do? The writing could have addressed this portion of the movie better by deciding the focus of the film and making the supporting characters play a bigger role IF needed. I imagine the biggest draw of the Carmilla series is the relationship between Laura and Carmilla. While I loved seeing the entire cast, the supporting characters felt less involved in the movie than in the web series and ended up a little shallow.<br><br>For a web series that started in back in 2014 and later on became an international hit, I am extremely happy with this movie. <br><br>Yes, it is not a perfect movie, but its existence is so important.<br><br>Carmilla is an example of how representation matters; how good representation matters. By normalizing the queer aspects of the show, they make the characters more human. Laura and Carmilla are simply two women who love each other. For this reason, this movie is daring. It is inclusive. It is a much needed step in the right direction.<br><br>To all the staff involved in the film, amazing job and amazing performance.","user":"yeveran","rank":[11,25]},{"title":"Basically Soft Core Lesbian Porn","rating":1,"date":"13 March 2020","review":"Bad acting. Zero plot. But an abundance of young women kissing each other throughout. If that's what get you going.<br><br>I found it rather dull.<br><br>BTW, the good reviews here are clearly from the agenda folks.","user":"arfdawg-1","rank":[1,1]}]