[{"title":"King Kenny","rating":10,"date":"11 January 2018","review":"I sat down to watch this on DVD with my football mad fellow Liverpool supporting son and we were absolutely blown away. For an hour and a half we were virtually transplanted into the world of Kenny Dalglish. How this man has not received a knighthood for his services to his fellow human beings never mind his contribution to football is beyond me. He helped so many people at the time of the Heysel disaster and again more noticeably at Hillsborough and through all the years since. All ultimately to his own detriment in that he had to abandon the job he loved as manager of Liverpool FC to save his health and family. <br><br>Kenny was my hero long before this DVD and he always will be . He is a true legend. <br><br>I dare anyone to watch this and find a way to not admire him greatly. <br><br>King Kenny YNWA.","user":"arthurdaley69","rank":[11,11]},{"title":"Inspiring and well done","rating":8,"date":"7 January 2018","review":"Kenny is a very well made documentary about a football legend Kenny Dalglish. The film does not only present his life story as a player and manager but also goes quite deep to show what he was like as a man, husband, friend and a father. One other great thing that this film managed to do is to give a viewer the idea of what football really means to people, the loyalty, how it brings them together in difficult times, how it lifts spirits, gives hope, brings joy and makes everyone forget about their problems for those 90 minutes. It is truly a magnificent sport and not many sports, if any, can compare to that. Even in the darkest of times such as the Hillsborough tragedy in Sheffield which will never be erased from the memories of those who lost someone as well as football fans all around the world, you will see how people and an entire city can come together to support each other and how long the road to recovery is sometimes.<br><br>Recommended to everyone, not just football fans and Liverpool supportes but to everyone who would like to have a better understanding of what football is all about and what Kenny Dalglish is like as a character and as a man of inspiration.","user":"Lugo1989","rank":[11,11]},{"title":"Kenny, a documentary of passion for the beautiful game","rating":8,"date":"19 February 2018","review":"Liverpool FC was one of the teams I admired when I was a kid and Kenny Dalglish was one of the main reasons for that. Over time my admiration for that team faded away and I even started to hate them, I still do, but this documentary is certainly worth watching if you are a football fan. If you are a Liverpool fan or not, it doesn't matter, the movie is great to watch, with a nice history of all the legends that playend with the ultimate Liverpool legend Kenny Dalglish. It's sometimes really emotional, with the two major tragedies that hit this club, the Heysel drama in Brussels where 39 people lost their lives and the Hillsborough drama where 96 people lost their lives. Any real football fan remembers those tragedies and seeing them in this documentary and seeing what impact it had on fans and players is sad to watch. Kenny Dalglish remains one of the greatest if not the greatest player of Liverpool FC, and one of the greatest English players ever. And even if you're not a football fan it's still worth watching, just to understand the passion this game brings to the people. A must see!","user":"deloudelouvain","rank":[2,4]}]