[{"title":"Bloody, Cheesy, Fun","rating":7,"date":"25 July 2019","review":"The most important thing one should know about this film is: \"Nekrotonic\" is a truly guilty pleasure for anyone who's into gunfirghts, gore and flat jokes. Now, let's elaborate this by numbers.\nThis is a second work of Kiah Roache-Turner (\"Wyrmwood\"), and most of his style also appears here. That means - lots of action, decent amount of blood and guts, comic-style characters, and cheesy dialogues. The good news is all of this works good in this kind of movie.\nThe basic concept (Nekromancers vs. Demons) looks like \"Ghostbusters\", but with an R-rating. There's also references to horror classics (such as \"Hellraiser\" and \"Exorcist\"), but not much. The acting is not the most attractive side of this film (Monica Bellucci is clearly overacting, but I'm sure that's the point here), so just foeget about it. Enjoy the little things. Like old-fashioned SFX (less CGI, more good prosthetics), pretty girls with guns, and good soundtrack. I mean - where else you can see slime-covered badass girl killing demon-possessed people with \"Can't Take My Eyes Off You\" by wonderful Andy Williams on the background?\nYes, zero character development. Yes, really bad jokes. But if you're looking for a bloody and fast-paced mix of a horror, action and comedy - you're on the right way.","user":"Krush_Burner","rank":[62,76]},{"title":"Gem of fun","rating":8,"date":"17 September 2019","review":"A lot of people apparently have nothing better to do than write reviews of film they mostly, if you actually take the time to understand their critiques, just didn't get.\nTake Nekrotronic- almost every line, scene and take, is just that magic little bit over the top to let you know to watch it for fun, not to self-importantly have something to write pointless reviews about. And it is delicious fun!\nNo absurd, grandiose, self-gratifying crap that no amount of suspension of disbelief can make you tolerate it; no pretense to subtle moments and revelations that require mastery of acting (although it seems the actors did that one so skillfully most reviewers missed it- I explained it earlier).\nJust get the popcorn, let the pretentiousness at the door and just have fun! It is more that the Avengers, Spider-Man and X-Men delivered this year put together.","user":"messremb","rank":[13,15]},{"title":"Massive fun. Great mix of all my fave movies in one.","rating":9,"date":"15 September 2019","review":"After seeing their excellent film Wyrmwood I knew these guys knew how to make a killer fun film with a small budget. Really is one of the best zombie film of last twenty years. So when say this film was coming out I knew I'd have to own it.<br><br>So much fun. Just the right amount of sci fi nerdiness, horror and comedy to make it work.\nThink the Matrix but with demons instead of Agents. Throw in a little Ghostbusters, some An American Werewolf in London type black comedy and you have Nekrotronic. I can't wait to own it.\nIt has to have been mentioned before that lead actor Ben O'Toole bears more than a passing resemblance to a younger Robert Downey Jr. Something which was built upon (purposely I feel) with the costumes chest light and gauntlet with lights without being too blatant. An actor to watch out for.\nMonica Bellucci shines as the evil demon mother with just the right amount of camp.\nCaroline Ford is strong and so beautiful. 😍 as is Tess Haubrich as the other kick ass demon hunting sister. Great cast ......so pleased to see the amazing actor David Wenham in this also......sadly underused.<br><br>The practical effects for the demon is also very high standard. Great effects all round.<br><br>Action packed. Cool cast. Great effects. Fun and fast paced film that begs for a bigger budget sequel.<br><br>The team that brought this to us all must have worked hard to make sure every penny was on the screen. Someone give then a bigger budget and sit back and marvel at what they'd create.\nBest film ice seen in a while.","user":"Jester222","rank":[11,13]}]