[{"title":"swim","rating":9,"date":"6 April 2019","review":"This i am rating as my film of the year, it has got to be the most wonderful and well paced story i have seen this year, good pace, good acting and none of the usual plots. I recommend it to anyone wanting that little lift out of mediocrity, that something to pull them from the mundane day to day viewing. Watch it and you will come away refreshed and ready for another day on earth, i did not even know i was also watching the subtitles from halfway, and at the end the story told itself without words. Be you any nationality, you will connect with each character, wonderful and uplifting experience, oh, it's good to be alive","user":"cesspit-53505","rank":[20,22]},{"title":"Great about friendships among grown up men","rating":8,"date":"19 March 2019","review":"Friendship among men is an unusual theme in film. There are dozens of movies about women, and especially comedies. Therefore, this French film becomes a wonderful insight into men of adulthood and how a companionship develops. The film is fun, charming and engaging, but never nostalgic. Although the film is primarily a feel-good movie, it is also a serious undertone of where men's challenges in adulthood. As well as how it is for men when the role expectations they have not followed up, whether by unemployment, family problems or poorly paid jobs. But here it is primarily about how to do something about the situation and the cohesion between them. A great story and movie, this one.","user":"dakjets","rank":[13,14]},{"title":"poetic comedy","rating":10,"date":"27 June 2019","review":"Brilliant French comedy. Subtle characters, fantastic settings, the camera is amazing. Very poetic writing. Superb cast. Laughing and crying for two hours. The topic of male synchronized swimming is really secondary, this movie is extraordinary, the script is razorsharp. No wonder it was a huge hit in France. It´s genious. The people who created this piece you would just die for to have as friends.","user":"benyoo","rank":[11,13]}]