[{"title":"An entertaining film, but please question it's bias and agenda","rating":3,"date":"3 October 2019","review":"I watched the film and for all it's slickness and hollywood budget, after every sequence I found myself researching the evidence the film was claiming and was shocked that as much as the film can be correct, it can also be wrong.<br><br>I don't have an agenda against veganism or being an omnivore (people who choose meat and plant based diet) and I'm fine with people choosing a plant-based diet, but I think it's important to ask questions about the people chosen to participate in the film and the agendas they have and how the edit has been skewed to convince people into thinking that they should do this, when they haven't been asking the questions.<br><br>I'm aware this review will upset people and I'll get jumped on for calling out the truth but I recommend anyone to go out and do the research after they've watched the film to see if it matches up to what you've seen.","user":"juzzyshop","rank":[359,562]},{"title":"Must not be missed","rating":10,"date":"1 March 2018","review":"Saw a preview version (the movie is still undergoing modifications) at a private showing in late February. This will shock men whose standard mantra is \"real men must eat meat\" and those family meal planners who think that eating meat is essential for proving protein to their families, especially youngsters (both girls and boys) who have desires for improving their physical performance.. The reality is the reverse.\nIt is dramatic, powerful and amazing and should not be missed.","user":"itaylor-50665","rank":[203,337]},{"title":"Antiscientific BS","rating":1,"date":"7 November 2019","review":"I find it frightening that propaganda expanded from politics to our daily lives and those manipulators(film producers which also produce vegan products) hurt people's health to grab their money into own pockets.\nThis movie is based on personal \"experience\" of some famous athlets, which pretend their performance was increased by switching to vegan diet. But in fact many of them retired before they switched, some of them got worse performance after that.\nThey use pseudo-scientific arguments like appeal to traditions, eg. look what our ancestors ate(which lived 30 years max), and even there with tons of fake information, eg. about tooth structure and bowel length(both are fully and crearly adequate to omnivores).\nThey reference some outdated scientific papers which have been since publication rejected, eg. \"meat causes cancer\".\nThey misinterpret scientific knowledge, eg. plant proteins can fully substitute animal proteins(no normal person can do it right, because you have to combine many kinds of plant proteins every day to consume the full set of amino acids).\nThey lie about vitamin B12 deficiency among omnivores. Actually vegans mostly dont get vitamin B12 or people with specific sicknesses.\nAnd of course they won't tell you about any drawbacks of a vegan diet, which are numerous. Just ask a professional nutritionist.\nI think this kind of movies must be illegal and the producers should be punished for damaging health of uneducated people who would believe in all  they say.","user":"dieterpisarewski","rank":[215,359]}]