[{"title":"Good, weird fun","rating":7,"date":"23 September 2019","review":"Greener grass was made by two women having fun. It's whimsical, colorful and surreal. The absurdity has a lot of coherence inside the film's universe, and it will keep you laughing.\nIt reads like kids on LSD playing with barbies, and having a mid life crisis.\nThe directors are a dynamic duo well coordinated on and off screen.\nHowever it kind of feels it would be better fitted for a series of short skits. it felt like watching a 1h45m long SNL or Portlandia sketch.<br><br>Laugh, don't overthink it (or maybe do?).","user":"valemas","rank":[23,34]},{"title":"An Unusual Tragic Comedy that Hits the Nail on the Head","rating":8,"date":"16 March 2020","review":"Colorful, awkward, bizarre, dreamlike... this is one of the most unusual comedies I've seen in a long while. Taking a close look at the artificiality of suburbia and the approval-seeking desires of modern culture, Jocelyn DeBoer &amp; Dawn Luebbe turn the world sideways while keeping a sense of humor about it all. All characters are flawed in one way or another, revealing their inconsistencies and lack of permanence through a series of scenes that are as absurd as they are disturbing.<br><br>The crux of the story starts early with one mother giving away her baby to another mother out of a sense of societal guilt and a desire to please. This starts a string of events that take apart several families, as each criticizes the other in the most polite ways possible, feigning concern while making benignly vicious comments. That it all seems so colorfully happy is a testament to the writers and the overall direction of the movie. The Kafka-esque transition of a non-conforming child into the family dog is a brilliant vehicle, as the father enthuses over how much better the child is as a dog, how much better he is at sports, &amp;c.<br><br>The reflection on modern society, our values and our priorities, glares through the sunshine and perfect teeth. One commentator here suggests that the movie feels like a series of short skits, which is both accurate but missing the point: each of these moments contribute to the fractured tapestry of this neighborhood and eventually tie together; when the baby-lending mother rips her braces from her teeth while losing everything you see the real message of the movie: conform or be ostracized. Brilliant.","user":"zampino-2","rank":[6,7]},{"title":"...","rating":8,"date":"27 October 2019","review":"Weirdest movie of all-time. I have never been more sure of a claim in my entire life. FANTASTIC NONETHELESS!","user":"Gresh854","rank":[17,29]}]