[{"title":"Richard Dreyfuss Doesn't Disappoint","rating":8,"date":"12 January 2019","review":"Of course I'm going to watch a movie starring Richard Dreyfuss and Chevy Chase. And I wasn't disappointed. It was funny with a message, but not so bleak as say \"The Bucket List\". I totally enjoyed this, yet another, movie about not getting older, but being old. I never think I'm going to enjoy these movies, too close to home, but this one was outstanding to me because of Richard Dreyfus. He always excels, whether in a dramatic role or a comedic role such as Bob in \"What About Bob\". He is wonderfully believable in this as a former standup comedian. Chevy is mostly the straight guy, and good at it, but I miss his goofiness. One restaurant scene allowed him some schtck and it was hilarious. The writing was excellent; the jokes didn't fall flat except when they were supposed to. And who doesn't like a good road trip? Could have done without the lengthy musical scene - nobody sings very well in it and it felt out of place with the rest of the story. Loved the cameo appearances by some great, old, comics who are still very much relevant today. Another good, watchable flick from Netflix.","user":"cpbirdie","rank":[38,49]},{"title":"Sentimental Memory of Great Actors","rating":8,"date":"15 January 2019","review":"Past memories of stars I grew up with and how I remembered them in all the great movies they stared in. Sort of a blast from the past which I quite enjoyed seeing them act again from a long absence on the BIG SCREEN. It was great to see Andie MacDowell, Richard Dreyfuss and Chevy Chase (and many uncredited actors) in a wonderful movie that shows a people can still act and do a wonderful job at it. I hope many other viewer find it as enjoying seeing these actors make it big again an also see some amazing country side and with some pretty good jokes on the side. Great actors.... but how they have aged since I last saw them in recent movies.","user":"QuickMilt","rank":[27,35]},{"title":"Grumpy Older Men!!","rating":5,"date":"15 January 2019","review":"Richard Dreyfuss steals the show in this movie while Chevy Chase holds the clipboard. Most of the comedy is by the former. This movie is filled with dad jokes, and if you like them as much as I do then you'll enjoy this as well. Mildly entertaining with some parts that drag on a bit too long. Not as bad as I've experienced from Netflix films.","user":"vandrist","rank":[13,17]}]