[{"title":"Review from a real foster parent","rating":10,"date":"4 March 2019","review":"I almost never write reviews but after seeing some of the reviews from ppl talking about how fake it is, and how the foster system isn't like this, or they should've had their own kids, or it's all PC BS, I feel like I have to write this review. I'm a foster mom. Been licensed in 2 different counties, been through the classes and all that twice. This movie is very accurate. It is a Hollywood film and they did add some cheesy lines and jokes, but it doesn't diminish the movie. The classes are like that, they do have adoption fairs like that and the 1st few months of any new placement are SO HARD. If anything this movie doesn't make it look hard enough, but it's supposed to be entertaining. If they made the foster stuff any more real it would be a documentary. Coming from a foster parent, I really liked this movie a lot and would recommend it. To any other foster/adoptive parents reading this, you may want to view it first before you show it to your kids. *Spoiler Alert* There is a part of the movie where they talk about giving the kids back, which is totally real, I've had that talk, but it could be very upsetting to a child to hear that.","user":"sarahjanebella","rank":[358,385]},{"title":"As someone who was a foster child...","rating":10,"date":"7 March 2019","review":"I've literally NEVER reviewed anything before. I've never felt I needed to...<br><br>That being said - As I was a foster child this hit me square in the face. It was one of the hardest movies for me to watch. Its depiction of how the kids act is 100% accurate. Its one of the hardest things to see and admit now - Being that I'm older.<br><br>This movie needs more attention and I hope that my rating helps with that. It needs to be watched by all... I was laughing AND crying (I'm ex-Navy and a very stoic person).","user":"sorvis_gilneas","rank":[259,280]},{"title":"Some people are obsessed with their crazy politics!!!","rating":8,"date":"18 November 2018","review":"I just got back from seeing Instant Family with my daughter and we both really liked it. Truthfully it is a very sweet feel good move about Foster parenting and adoption. I wasn't going to write a review but I read one review particular that just blew me away with its stupidity. It claims that this film is a bunch of Pro-Trump propaganda!!!! That couldn't be further from the truth. It is a very funny endearing film. It is about a couple that decide to be Foster parents and bring home 3 kids, yes they are Hispanic. The film deals mostly comedically with situation, but also has some heartfelt drama. It is as light as feather and very enjoyable. For someone to see this film as anything but what is, a heartwarming family comedy is beyond me. BTW I am Hispanic and there is NOTHING offensive about this film.","user":"flicklover","rank":[285,332]}]