[{"title":"Kept me watching...","rating":6,"date":"4 September 2019","review":"Quite a piece of filmmaking by the director and solo actor. I found the story very interesting as a whole. Although it may only have 1 page of dialogue through out the whole film, I think the director is trying to put the viewer through the same loneliness and despair as the character. If the protagonist had narrated or spoke more it might disturb the sombre direction of the film.<br><br>The plot is very light. It's basically about a guy trapped on a boat... Not much else to say, besides the subtle instances where he might not be alone... I'll leave it at that.<br><br>Overall this isn't a great film or a film I'll give a 2nd viewing but it was intriguing and kept me glued till the very end. The film longs for some better editing though. Anyone who says it's terrible really doesn't understand the message or slow burn journey the filmmakers are taking them on.<br><br>Overall it's worth the watch if you're into something a little less mainstream.","user":"Jamie_Seaton","rank":[40,46]},{"title":"Almost a great movie","rating":6,"date":"6 October 2019","review":"The film IS engrossing and well acted but at the end was a little confusing.I think that is why it is getting a lot of low scores.<br><br>The boat in the title is named after Aelous , who in greek mythology was the keeper of the winds and king of the island of Aeolia, one of the islands close to Sicily.Aeolia was visited by Odysseus and his crew of the Odyssey.\nAeolus gave them hospitality for a month and provided them a west wind to carry them home to Ithaca. He also provided a gift of an ox-hide bag containing all winds but the west. Odysseus and his crew members traveled steadily and anxiously for several days, but with his native land in sight, Odysseus was overpowered by sleep. His men proceeded to indulge their curiosity to see the costly presents which they thought the bag contained, opened it and out burst the imprisoned winds with such a roar that the force drove the ship back to Aeolus' island. Aeolus refused to provide any further help because he believed that their short and unsuccessful voyage meant that the gods did not favour them.\nSo is this a modern retelling of the story..\nThe boat itself seems to be haunted or controlled by something ethereal , and it seems to be intent on killing the lone sailor (very much like the movie \"The Duel\") right up to the end when suddenly it decides to just drop him off on his island home.\nIf the film had a different ending that made sense I would have given it an 8 or 9.","user":"diggz-67928","rank":[11,11]},{"title":"I was totally engrossed!","rating":10,"date":"5 September 2019","review":"I don't know what people here are cribbing about but I found this movie very engrossing right from the start to the end. I literally felt myself there lost at sea and those moments of pain, confusion and delusion had me at the edge of my seat. Put it this way, I watched this movie at 02:00 am and still had my eye's wide open. The script is rare and the actor did justice to his role. What I liked most were the camerawork, background music and scenery out in the lost wild sea.<br><br>If you're a fan of survival movies, this one is for you.","user":"ajith-v-m","rank":[39,49]}]