[{"title":"Cliche after cliche after cliche...","rating":5,"date":"13 July 2019","review":"Every character in this film is a loser, in some way or another.<br><br>I chose to watch this film because of Victoria Justice but she were hardly in any scenes. She did good though. But she couldn't lift the entire movie.<br><br>All characters are in their 20's but they act like they're teenagers experiencing things for the first time and doing the worst thing possibly. Just such losers.<br><br>At least the actors were good enough to play that stupid.","user":"pediatricgrime","rank":[13,16]},{"title":"Sadly, Summer Night is Wasted Potential","rating":4,"date":"14 August 2019","review":"I'll admit the fact that I'm a sucker for films known by the term mumblecore. I find films that are all about their characters hanging out and developing them are very easy to enjoy. For that reason alone, I was very intrigued by Summer Night. Sadly, this movie is the definition of too much of a good thing. With so many talented performers who have all been a part of better things, this film chooses to exploit them, but there is simply too much dialogue, which ultimately leads to more than a few cringe-worthy lines. Here's why Summer Night just isn't worth your time, even with a few saving graces.<br><br>The first act of this film sets up the characters and where they are in life and their relationships quite well. Yes, the film has a mission to cover all the bases in terms of character, which is why I found it to be very cliche. Summer Night follows many young adults who all end up at a bar for a local concert and the majority of the film takes place here. It made for a nice setting for the age group being represented, but I felt a huge disconnect because they all seemed like heightened versions of real-life people. I never once believed I was watching two people have a real conversation.<br><br>The main premise is simple enough to make a film about great characters, but I felt the dialogue needed a lot of work. Although I said I'm a sucker for these types of films, I truly found myself becoming slightly annoyed by how much this film relies on people having conversations, while the dialogue is so bad. I'm sure the intentions were very sincere when Jordan Jolliff was penning the script, but I think it could've used a few more revisions. Being his first feature film, I can see some potential for a bright future, but Summer Night just wasn't the breakout I was hoping for.<br><br>Speaking of firsts, this is also a first for director Joseph Cross. Known for his acting career in his younger years for movies like Jack Frost and smaller roles in more recent films like Lincoln, I began to notice that he was choosing a different career path. Being his first outing, juggling this many performances isn't an easy task, so I will give him the benefit of the doubt for the future. It's nice to see Ellar Coltrane starring in more films after his Oscar-nominated film in Boyhood and I've been a fan of Justin Chatwin for a while, so their presence was a win for me.<br><br>In the end, this is a movie surrounded by a talented cast and a director that was going for something along the lines of a Richard Linklater film, but I think the execution came off as a little cringe-worthy and boring as a whole. There are redeeming qualities here and there, along with some genuinely well-done character moments, but for a movie that relies heavily on that throughout the entire duration, those moments were left in the dust for me. For the type of movie it was seeking to be, I am a little disappointed with it overall. Summer Night doesn't warrant a recommendation from me, which is too bad.","user":"kjproulx","rank":[6,7]},{"title":"Don't Waste One Summer Night - Hard Pass","rating":1,"date":"25 March 2020","review":"Watching this was purely a fluke. It was on Netflix, newly released and well, since I'm stuck inside, I thought \"Why not?\" It is so bad that I couldn't even make it through the whole movie and I usually suffer through to the end even in the worst of films. When the faux band starts playing and one of the tools is chewing gum so much it was like watching a cow chew cud, well, it rankled me so much that I had to stop the film and post my disgust here.<br><br>Do not waste your time. Unless you want a good lesson about the me, me, me, me generation with a huge chunk of patriarchy is alive and well. Big eye rolls over the weakness of the characters, their shallowness and inability to show even a little of compassion for the rest of humanity.<br><br>With everything else going on in our world right now, this film is pure torture to watch.<br><br>Hard Pass.","user":"elisaforsgren","rank":[4,5]}]