[{"title":"Not the film I was looking for, but the film I needed.","rating":7,"date":"6 August 2019","review":"When I came across a movie called Rust, it struck me as just another Brazilian movie with a poetic and highly symbolic one-word title. It was only after reading the plot summary that I decided to give it a go, and I was still as sceptic as usual about it. When it was over, I was positively surprised. The first half covers an upsetting and dramatic turning point in the life of teenager Tati. The second half covers the aftermath of those events as seen by the boy she was in love with. I didn't realise straight away that, in dividing the film like that, director Aly Muritiba was emphasizing their unique connection, a connection that transcends love. It's a way to keep them together despite their ultimate doom, and a way to contemplate the endless what ifs that led to it, which is beautiful. Those are two characters who are, for better and worse, one way or another, destined to remain connected forever.<br><br>The thrill of watching Rust is to explore why and how things went so bad. Muritiba takes his time unveiling secrets, focusing on the rich dynamic established between the characters that he and co-screenwriter Jessica Candal have vividly created. Every time we have a reason to doubt someone's actions we are eventually rewarded with their true motivations. The focus here are the humans in this story, not plot devices, and that allows it to flow naturally. That way, Aly keeps the film realistic and engaging, but also fresh and very relevant. At the end, he has allowed the whole panorama to become crystal clear: a complex maze of vanity, confusion, and insecurity - it revolves around teenagers after all - backed by generational clash, malice, deception, loneliness, complacency, and so much more that it's hard to describe. It's a dark, harsh experience, and the consequences faced by the characters are critical and life changing, which makes it all the more intense. One can say that Muritiba has painted an alternate portrait of today's youth, too accurate for his own good. In Brazil, many youngsters were taken aback - to say the least - by it.<br><br>When it comes to the pacing of the film however, Muritiba has fallen into a trap. We are viciously hooked up in the first half and abandoned to absolute sorrow in the second. The jarring transition works wonders, but the editing fails to keep up afterwards. Here, Muritiba resorts to bucolism as a storytelling device. However, as beautiful as the vistas are, they don't serve the story much. Even if there's still a lot to be revealed, the information comes in slowly, sporadically, and could have benefited from a slightly faster tempo, not only to speed things up but also to allow the cathartic ending to cause a bit more impact.<br><br>Overall, Rust got me thinking a lot about how open wounds drastically affect our lives (and, by extension, the lives of people who care most about us), to the point where everyone's in pain. Not the film I was looking for, but the film I needed.","user":"homerobsfilho","rank":[2,2]},{"title":"Annoying and empty","rating":5,"date":"9 May 2019","review":"I had great expectations about this movie, i really wanted to enjoy. But no. The movie is so annoying and boring, so much slow, with obvious connection among two parts. Empty drama, with no soul. Just watch and confirm. Good luck.","user":"binhosan","rank":[1,8]}]