[{"title":"A good, heartfelt drama","rating":8,"date":"9 August 2019","review":"Despite some of the more critical reviews on here, I thoroughly enjoyed this one. It is exactly what it's genre title suggests though. Its a drama. It follows a young man who was discharged from the military and you get a taste of how he was brought up, and what he is going to do now that he is back home. You get to know a little bit about his mother and brothers and learn that he didn't grow up in the warmest household setting. I'm not going to jump out and tell you its the absolute best movie I've seen in a long while, but its enjoyable and worth a watch if you like dramas. Theres not a bunch of action or thrilling events, so don't treat it like you're about to sit down and watch the next DCU movie or anything. All in all though, its a good movie.","user":"motionlessknight","rank":[6,9]},{"title":"Don't bother 👍","rating":1,"date":"7 July 2019","review":"The acting in this is bad, it's like they where chosen just cos of the way they looked, but non of them had many facial expressions, storyline is very weak and had lots of holes in it, the production, scenery and locations where very good, perhaps the only good thing about the film 👍👍","user":"sean-81-476473","rank":[7,11]},{"title":"An important film, in the best tradition of realistic cinema","rating":9,"date":"23 August 2019","review":"I caught this film casually on TV, I was not instantly hooked but somehow could not get myself to switch channels, and am glad I did not. What is remarkable in this film is that it did not seek to present sympathetic or likable characters, it presented characters and their relations to each other, amid hard living conditions, reminding me of Italian \"realistic\" films made in the sixties in black and white, sometimes filmed in slums near big cities, and reflecting the lives of real people, and not always offering solutions or happy endings.\n\"Breaker\" should be a good example of what independent film makers can do (I hope the crew of this film gets good recognition and future opportunities, their effort here is award stuff), and it is a relief that amid mega blockbusters, noisy action films, and CGI studded productions, we see such films.\nAnd for those who worry about happy endings, the film is not as bleak as you might think !\nWell deserved 9 stars.","user":"samerabdallah","rank":[5,8]}]