[{"title":"Ellipse","rating":3,"date":"7 November 2019","review":"These days anyone with a camera thinks he can make a movie. Of course he can try, but how good will this movie be? My opinion is if you decided to make a movie, lacking a budget and with yourself as a main actor, then at least find a good screenplay, something special, emotional, that those who watch the movie would appreciate the story, if not the acting and stunts.\nThis movie would have had some chances to become a good movie, if the writer had possessed better knowledge of physics and astronomy to make a more scientifically substantiated plot. You can't stuff your movie with nonsense, just because it's a science fiction, people won't buy it. The first thing that struck me in this movie and killed my interest was when the spaceship turned upside down and the attraction went towards the ceiling and all this in space!!! where there is no gravity.\nAll this said, I'm giving this movie 3 stars, cause of the dog, and its most natural acting.","user":"ashalisalamdanam","rank":[13,13]},{"title":"Horrible, just horrible...","rating":1,"date":"6 November 2019","review":"Do not waste your time this \"movie\" is unbelievably stupid, empty and worthless. Stay away!","user":"jayjayvis","rank":[16,18]},{"title":"Why did they have to dumb it down so much?","rating":3,"date":"17 November 2019","review":"I cannot understand why the makers had to dumb down the script so much. So many stupid lines. Why there is this belief that a movie cannot be understood by the \"average\" viewer? Half the population has an IQ above average by definition. Target them.<br><br>Such a wasted opportunity. Also, the viewer is so obviously pushed to have an emotional connection with the character, and to make that happen they decided to put a handsome actor talking half stupid, showing so long minutes of love story with the girlfriend but most importantly with the dog (a trip on a motorbike?!?).<br><br>It seems they put a bit of an effort in the last two lines of the script. What a wasted opportunity. The idea of gravity anomalies should have been explored far more without the cheesy parts. It was supposed to be a sci-fi movie!","user":"dkk9823","rank":[7,7]}]