[{"title":"Ninja","rating":6,"date":"22 February 2020","review":"Batman Ninja has quite weak plotting and terrible direction. It relies so much on action and it never becomes anything deeper than its initial concept on paper. But it's fun in well executed action scenes, the characters are solid, the score is cool and it's worth seeing for its animation alone which is absolutely impressive in its artistry, cool designs and anime style. It's literally a concept art brought to life which was intriguing to witness.","user":"MR_Heraclius","rank":[37,38]},{"title":"Beautiful Artwork - A Complete Failure of Story-Telling.","rating":24,"date":"24 April 2018","review":"I really don't have much to say about this release, and I think my review title says all you need to know; Like most artwork that comes from Japan, this was just beautiful to the eyes. Somewhere in the middle of the movie I noticed a small lapse in the artwork, as if someone was rushed or got lazy around the 40 minute mark. It lasted for just a bit and then it went right back to the clean colorful style it began with. <br><br>The story was so bad that it was laughable. Maybe someone enjoys the base plot ideas of anime television shows? The gathering of 5 to build one massive robot, or animals physically binding together to form a giant Batman? My jaw dropped ... I was left speechless, wondering whose stupid idea it was to make this part of a Batman tale. You might argue that it was instilling some sort of Japanese flair, but what I watched was a zero-effort attempt to finish the plot.<br><br>The writers don't seem to know who Batman is! This take on Batman didn't know what to do without technology - which evidentally it's a big transformation for Batman to fight without his bat-mobile, bat-wing, and bat-cycle. Seriously. The Japanese version of Batman was helpless without all his toys. He was also really stupid about basic problems; I watched him aim his grapple-gun into the air, unsure of what to do around one story buildings. <br><br>Enjoy the artwork, it's genuinely beautiful - but expect huge a waste of time.","user":"jegd-847-631407","rank":[103,125]},{"title":"Script is just So bad.","rating":2,"date":"24 April 2018","review":"Cliche after Cliche. <br><br>None of the characters have any personality including the Batman. Every line from a villain is of the \"HAHA now I'll get you All\" variety and every line from the Batman is delivered with the same dour monotone as if the Batman's \"Darkness\" exists only in his deep voice.<br><br>The artwork is good. Hard to understand why anyone would invest in million dollar artwork and then combine it with a ten dollar script.","user":"wreuven","rank":[200,252]}]