[{"title":"A Fun yet Over-hated Feature","rating":8,"date":"20 July 2018","review":"Hello everyone, DaveMan1000 here and today I went to see the premier of the latest Thomas &amp; Friends special, Big World! Big Adventures!. After the overwhelmingly positive response to Sodor's Legend of the Lost Treasure and the more polarising views on The Great Race and Journey Beyond Sodor; both of which did affect my overall opinions on those movies, I wanted a fresh take on this new entry and I didn't read or watch any \"reviews\" prior to seeing it.<br><br>And through all of that, I can personally say that Big World! Big Adventures! is a well paced, beautifully animated and overall really fun movie. Right off the bat, no, this is not as good as Sodor's Legend of the Lost Treasure; putting that debate to rest before it even starts. If you ask me, I don't think The Great Race and Journey Beyond Sodor got the amount of praise they deserved due to being unfairly compared to their vastly superior predecessor, which I'm sure many people will also do for this one, which will in turn detract it's overall quality.<br><br>First, let's talk about the elephant in the room: yes, the engines and road vehicles are now fully capable of moving their bodies around. In this movie, they went all out, as opposed to Journey Beyond Sodor and Series 21 where they sort of went half-in half-out, and got stuck in an awkward middle ground. But here, they're more dynamic than ever before, but I really don't see that as a bad thing. I believe that they should've implemented this style into the show as soon as they made the transition to full CGI back in Hero of the Rails. Just seeing the characters visibly interact and respond to the world around them brings much more life to what would otherwise be static vehicles with faces, which works in model form, but not so much in animation if you ask me.<br><br>As far the voice cast goes, it's as great as ever:<br><br>John Hasler as Thomas brings us the same innocent &amp; mischievous performance as always, though I think this could be his best role as the tank engine yet. This movie I think showcases Thomas' cheeky side much better, like one instance where he goes behind Gordon's back and tricks him without the latter even realising until it's too late, and seeing Gordon's reaction gave me a good chuckle. But when he needed to get serious, Hasler didn't disappoint; unlike his portrayal in say The Great Race, whenever Thomas was a bit grumpy or moody, I never got a spiteful or unpleasant vibe from him, which was a welcome change.<br><br>Next up is out newcomer to the Steam Team, Nia. Everyone and I mean EVERYONE hated this character before she even said a word, and don't get me wrong, I wasn't actually excited for her from the start either, but I was willing to give her a chance. And honestly... I love Nia! Yeah! In such a short amount of time, I found myself absolutely loving this character; from her bubbly attitude, to her beautiful engine design, her quirky greetings and even her supposedly \"ugly\" face model; which grew on me very quickly. Yvonne Grundy delivers a fantastic performance and can't wait to here more in Series 22.<br><br>And then there's Peter Andre as Ace, who absolutely steals the show whenever he's on screen. Ace is a character straight out of Cars in every conceivable way, from his body movements, his love for racing and Andre's fast and energetic performance. I really hope this isn't the last we've seen of Ace, he was a blast to watch.<br><br>Like with the other specials, unless a character is on the poster, they won't get much screen time and here was no different. The other engines only had small appearances in the beginning for the opening song, but in the time they had, they still gave great performances; everyone gets a few good lines in here and there and there weren't any glaring errors made by the voice actors. A standout performance for me was Keith Wickham as the Fat Controller; ever since Series 20, he's become much more comedic and energetic (maybe in response to his portrayal in SLotLT?), and here Wickham really shines, though I can't say too much without spoilers. The only mistake I heard was when Rob Rackstraw briefly slipped into his US voice for James at one point, but that was very quick and all the other times he used the correct UK voice.<br><br>Also, throughout the movie you may see some familiar faces from The Great Race...;)<br><br>Speaking of the songs, are they a step up?\n...\nNo, I don't think so, but I see them on equal grounds to the ones from TGR and JBS, which is still pretty high. Though if you ask me, the way the songs are implemented into the story is handled much better than in the last two specials. All the songs are on YouTube right now, go give them a listen, you won't be disappointed, I guarantee.<br><br>So overall, I really liked this movie and I feel it's been unfairly scrutinised both with being compared to Sodor's Legend of the Lost Treasure and from people who just won't give new things a chance to show what they've got.<br><br>Now let's see where I'd rank this special with the other ones from renaissance:\n1. Sodor's Legend of the Lost Treasure\n2. The Adventure Begins\n3. Big World! Big Adventures!\n4. Journey Beyond Sodor\n5. The Great Race\n6. Tale of the Brave\n7. King of the Railway<br><br>Now while I've ranked this below SLotLT and TAB, that doesn't mean I like this one any less or the latter two any more, this list is purely from the quality level I view these in. But, if you were to ask me which one I prefer and which one I'd probably want to watch again, I have no regrets saying it would be this one. Mostly because it was so much fun. \"Fun\", that's a word I don't like to toss around too often, as people's perception of the word does differ but that's what I see here; Big World! Big Adventures! is a fun movie, Sodor's Legend of the Lost Treasure isn't, which is why I'd watch the former again as opposed to the latter.<br><br>Now though I've stated this with how this post is written (from my POV), I feel I need to stress that this is strictly my opinion and does not reflect that of everyone and it is not my intention to sway anyone's own opinion on the product.<br><br>I'm not stating that Big World! Big Adventures! is a great movie, but I am stressing that it is, to no lesser extent a good one. After this, I'm now very excited for Series 22 and can't wait for more from this new direction the show is taking.<br><br>As always, I'm DaveMan1000 and I'll see you all next time.","user":"dfrediani1","rank":[10,13]},{"title":"The 🎥 was fun to watch!","rating":3,"date":"3 October 2018","review":"In the 🎥 I like when Nia the tank engine from the African country of Kenya and a new member of the Steam Team on Sodor. She is a real optimist with a great sense of fun. She is also driven by a strong moral compass and takes being fair and kind to others seriously. She is not afraid to speak her mind when she needs to. Nia is both thoughtful and practical and often comes up with very creative ideas. Her kind heart and infectious enthusiasm never fail to win over others in the end.<br><br>She first meets Thomas in her homeland of Kenya when he stops in her yard to collect more trucks to take to Dar es Salaam while in pursuit of Ace. Noticing how heavy his train is getting, she offers to help, but Thomas sternly refuses, stating he can handle it himself. However, she later arrives to help him over a steep hill when the trucks nearly cause him to slide back down it. She later encourages the trucks to sing to raise Thomas' mood during the journey, and to help soothe an elephant that tries to charge Thomas when it was blocking the tracks. When they reach Dar es Salaam, Nia has a chat with her friend Kwaku, but Thomas interrupts before Nia can reveal that her shed was destroyed and she was looking for a new one. After Thomas thanks her for her help, he prepares to board a ship bound for South America and the city of Rio de Janeiro in Brazil. However, Nia decides to join him, much to his chagrin, having wanted to see the world herself.<br><br>Thomas remains unfriendly with Nia throughout their journey, but begins to warm up to her after they rescue a crashed Ace and made it through the Amazon rainforest after some difficulty, continuing their journey through Central America and Mexico before reaching North America and the United States. As they make their way through the Grand Canyon, Ace is able to trick Thomas and Nia into splitting their delivery to San Francisco between them and race to see who is the faster of the two steam engines. Thanks to Ace, who wanted to get to the Bonneville Salt Flats, Nia is separated from Thomas, and as a result, thinking that Thomas was in on Ace's trick, she becomes hurt and cross, and continues on alone to China.<br><br>When Thomas catches up to her in the Himalayas, she refuses to listen to his explanations for what happened, still hurt and upset about it, but hearing his heartfelt apology, she realises he never meant to upset her and is truly sorry for it. Before she and Thomas can fully make amends, an avalanche caused by Thomas trying to get Nia's attention sweeps her off the tracks and leaves her dangling precariously over a cliff. Thomas attempts to pull her back to safety, but a rock underneath her is dislodged causing her to go over the edge and nearly pull Thomas with her until Yong Bao arrives just in time to save both of them. After Nia is lifted back onto the rails by the breakdown cranes brought by Yong Bao and The Chinese Diesel, she and Thomas prepare to return to the Island of Sodor, with Yong Bao advising they travel through Asia and Europe to get back to the Island of Sodor via The Mainland.<br><br>Together, Nia and Thomas make their way back to Sodor, unaware of a signalman in India seeing Thomas and phoning ahead to let the North Western Railway know he was coming home. When they reach the Vicarstown Bridge, Thomas realises that once he crosses it, he'll be home, but Nia will have to go home to Kenya. However, Nia reveals what she had tried to tell Kwaku back in Dar es Salaam before Thomas interrupted her, that she no longer has a home to go back to. Sympathetic to her plight, Thomas offers Nia the chance to stay and work on the North Western Railway, knowing that Sir Topham Hatt would love to have Nia working on his railway. The two engines cross the bridge, returning to Knapford to find a large group of Thomas' friends, human and engine alike, welcoming him home. After Thomas formally introduces Nia to Mr. Percival and the others, Nia prepares to enjoy her new home on the Island of Sodor","user":"nikotoyas-88187","rank":[3,5]},{"title":"STOP LOWERING THE RATING!!!","rating":10,"date":"11 January 2019","review":"This movie is great!!! no more lowering the rating!!!!!! i don't know why it's doing that! what's going on?!?!?!? i swear to god, if this rating gets to 5.7 on IMDb, i will scream my head off!","user":"olivertherobot","rank":[2,3]}]