[{"title":"Better then expected cyber thriller","rating":7,"date":"9 November 2017","review":"Like. Share. Follow was much better then I expected. The dim starts out a bit slow but picks up speed at about the 20 minute mark. Garrett is a YouTube star with his Friday night show which is about his life and antics assisted by a couple of friends.<br><br>He is very popular and has many viewers. He has a self imposed rule of not getting emotionally involved with any of his 2,000,000 viewers but one girl seems Insistent on meeting him and will do anything at any cost to do so.<br><br>Avoiding spoilers at this point, let's just say it's not an original theme and has been done before in the fashion of \"Fatal attraction\", the king of all stalker films. With that said, however, this film is better then most and keeps you interested throughout. It has some very creepy scenes and the acting is very good. The elements of the plot are simple enough but done without going over the top and without gratuitous violence.<br><br>There is a great twist at the end as well. Enough said.<br><br>I recommend this film to any fan of the thriller and stalker sub genre....7/10.","user":"stephenw-30180","rank":[18,28]},{"title":"Be afraid, of a five foot girl that apparently has the same ability to inflict fear as Michael Myers","rating":3,"date":"13 November 2018","review":"I couldn't stop laughing at the total fear in the thought of men having hand to hand combat with a petite 100 pound girl that looked more like the kid in The Bad Seed than anything very sinister. Particularly since she spent her private time crying and rolling around in agony. This story has been told before with a little spin to update it, Garrett is a YouTube 'star' with a lot of followers. I guess the moral could be beware of social media or being famous. Nice little spin at the end also a rip off of Stephen King's Misery. Nothing new here. Overall pretty much a Lifetime television movie.","user":"gustheaffen","rank":[5,6]},{"title":"Not terrible but close to it.","rating":3,"date":"14 November 2017","review":"I honestly think this could have been a much better movie. One of the major flaws is the male lead. Also the fact that his ridiculous videos could actually make him famous is just beyond stupid. The only decent thing about this movie was the new actress Ema Horvath. In my opinion i thought she did a very good job and basically carried this film on her shoulders. So for that i give it 3 stars. If it wasn't for the awful male lead and the terrible, flawed plot. This could have been a decent movie.<br><br>If you have a chance to watch this movie and its free, sure why not. But i wouldn't even bother going to a redbox to spend a dollar on this garbage.","user":"jjstfuplz","rank":[12,19]}]