[{"title":"Kept me watching...","rating":8,"date":"22 October 2019","review":"Entertaining, lots of twists and turns, never quite sure what's next or where it's going, but the ride's good, especially the 4 leads. Almost didn't rent due to some bad reviews here, I guess sometimes good to trust the positive ones","user":"tomarm-21596","rank":[77,99]},{"title":"Anna","rating":8,"date":"12 February 2020","review":"What a masterpiece! Absolutely fantastic acting. The sets are beautiful, even the clothing is so well thought out. It catches the eye and mind. The efficiency of the actress, the strong roles she plays. Sublime!","user":"MR_Heraclius","rank":[50,63]},{"title":"Anna - Movie Review","rating":7,"date":"20 January 2020","review":"I missed watching Anna when it first came out, despite the fact that it looked interesting to me. That was mainly due to the poor reviews, and the fact that Luc Besson hasn't really directed anything great since Leon in 1994.<br><br>However, Anna ended up being better than I expected it to be. Sasha Luss as the title character did an excellent job, and this was even more impressive considering that Anna was her first on-screen role in which she had any sort of notable presence. Helen Mirren, Luke Evans, and Cillian Murphy were also fantastic, but they are veteran actors and so I wasn't really surprised by this.<br><br>The narrative of Anna is told out of chronological order, which worked for the story it was trying to tell. It shows a sequence of events, and then flashes back to what happened before and it was a very creative way to tell the story. Even little details which didn't seem to matter the first time around are shown again in a different light, and this was very impressive.<br><br>\nDespite all of that, Anna never seemed to be particularly focused which was a shame. I liked the film more than expected, but it always felt like a shell of something which could have been truly great. It was also hard to follow at times because it does jump back and forth a lot, but that might not be a problem for some.<br><br>Anna was a lot of fun, with well choreographed action, and it was nice seeing a film like this with a strong female lead. Atomic Blonde and Red Sparrow came first, but this is definitely the best out of the three, and a very worthwhile watch.<br><br>SCORE: 72%","user":"alexpitt-345-971699","rank":[31,38]}]