[{"title":"Well thought out scenario and good actors","rating":8,"date":"14 February 2019","review":"This movie depicts a topical and realistic situation, with the codes of most major big-budget movie. The cast is well chosen and overall does a good job of portraying what many would expect the French navy to be like.\nBut in my opinion, the most successful trait of the movie is its storyline, stemming from contemporary stakes, which I've rarely seen in military/tactical movies, which instead tend to focus on past historical events or on more far-fetched futuristic scenarios.\nI think that's the reason the story is so compelling, and why I personally found the movie so immersive.","user":"tanguy-pocquet","rank":[127,187]},{"title":"An awesome film.","rating":26,"date":"26 February 2019","review":"As far as I know, there has never been any French movie speaking of submarines. And if there is one in the future, it will never be as excellent as this one. Impossible. This one is the first and will remain the best, whatever other features may bring. It's proudly in the line of HUNT FOR RED OCTOBER or James B Harris BEDFORD INCIDENT, starring Richard Widmark and Sidney Poitier, with also a bit of Sid Lumet's FAILSAFE. Great acting, editing, directing, with tons of details and accuracy in every domain of submarines. A riveting, breath taking movie with a very dark atmosphere and an ending that Hollywood film industry will never give us anymore. Go for it. Some errors about the casting though. But who cares?","user":"searchanddestroy-1","rank":[84,140]},{"title":"Gripping","rating":10,"date":"7 April 2019","review":"This movie was amazing ! It was fast paced and the twists were incredible. One thing I couldn't stop talking about with my Friends was the soundtrack. It made me feel like I was in the movie. This movie is so worth watching!! First I thought that a french movie couldn't be that great but I'm impressed and clearly satisfied. Everybody should see it once to see what french cinema can show.","user":"evoucozzo","rank":[85,146]}]