[{"title":"Para-what?","rating":5,"date":"26 June 2018","review":"I enjoyed the movie up until the ending.<br><br>Please, please, please explain to me, how a tour deployed paratrooper can't hit a target from 15 feet away in a doorway?<br><br>I felt like sue was going to die, I could sense that one coming, but to kill the paratrooper looking to save up money to save his gym? What sense did that actually make?<br><br>That wasn't a plot twist, it was a plot killer.<br><br>Another point I want to make as well... WHY DID THEY NOT JUST LEAVE WITH CONNOR AT THE END?????<br><br>Did they just know that he'd be perfectly safe exiting out the back way? What reason did they have to actually stay and continue fighting?<br><br>Clearly these guys don't know how real life gun fights go down, because 1 guy with an AK47 can't seem to hit slow moving targets in a 15ft room, is just silly.<br><br>Ending completely ruined the whole experience for me, for what could've been an enjoyable movie.<br><br>I also don't understand the cow slaughterhouse scenes, those were not needed in the slightest.","user":"track-53902","rank":[42,46]},{"title":"Underrated movie.","rating":8,"date":"5 June 2018","review":"It's a very good movie, good acting, great fight scenes and the chemistry between the two lead actors was outstanding. People seems unaware what the slaughter house footage ment for? It's a metaphor of their job as debt collectors. This movie is underrated and deserves better rating.","user":"dediwidiarso","rank":[40,51]},{"title":"Delivers more than promised.","rating":7,"date":"27 April 2018","review":"Was weary when starting to watch this, can't stand all action supermen or hero films. Yes there's the usual brilliant choreographed fights when martial arts enable you to beat 3 opponents ( yawn ). But then the story starts and is actually plausible, hardmen or ex - service are drawn to this type of employment. Then the leading duo take us on a ride that has some laughs, some violence, and a little insight to them. Not great, but watchable film if you've something better to do forget it, if not just waste the time well.","user":"apjc","rank":[28,35]}]