[{"title":"Incredibly Effective Low Budget Thriller","rating":9,"date":"29 February 2020","review":"\"Nesting Dolls\" is an incredibly effective low budget thriller, probably way more effective and powerful than you'd expect. It is difficult to convey the full scope and power of the film without giving away spoilers, so I will use broad strokes --<br><br>Three sorority sisters go off together for a week together. Two of them -- Tori and Britt -- seem to be getting the third one (Erica) ready for the rushing event that's coming up. They drink, play games, go boating, and generally have a fun time together. But something happens. And the reaction to that event is a series of horrible decisions that pit the girls against each other and exposes their darker sides as events just continue to spiral out of control....<br><br>This film just work on all levels. One of the things that makes the film is so effective and powerful is that although the girls make incomprehensible decisions in reaction to events, they just go so all-in on them, that we accept that, yeah, the decision was mind-blowing but maybe that's what these girls would do? Part of that is the outstanding performance of our three leads, Sydney Amanual, Ali Breneman, and especially Jenna Krasowski (in the toughest role). They are uniformly excellent and all make us believe. And this movie hit me like a brick -- I was actively worried about how it was going to turn out and was completely invested in the characters. Outstanding work from this entire crew.<br><br>My only real criticism was the ending. It was a bit of deus ex machina that doesn't really make sense and doesn't live up to the standards of the rest of the movie. But it's not terrible, just a bit of a disappointment given what had come before.<br><br>Highly recommended, but with a warning -- I was unable to really convey what this movie shows you because that would have spoiled the movie. But be forewarned, this is not a light-hearted movie. It shows the pitch black soul of some people (or some sorority girls, to be specific) and you likely feel uncomfortable during and once it's done. It will stick with you, believe me.","user":"stsinger","rank":[4,7]},{"title":"This touch your psyche in a thrilling way!","rating":10,"date":"3 March 2020","review":"Wow.<br><br>Never seen anylike this video ever before.\nBrilliant acting. My brain was 100% occupied in every second of the movie.<br><br>What a sick movie\nLoved it!<br><br>This maybe sounds ridiculous, but I think you have to really know your own and others darkside, to really get this movie.<br><br>Not a movie to see in an energetic setting.\nSee it in a quiet setting, and feel the psyche in this movie.<br><br>Amazing for the people that really get this movie! 10/10","user":"innboks","rank":[2,5]},{"title":"Review are so high","rating":5,"date":"28 March 2020","review":"It's either 9 or 10 and really doubt that. It's just a movie of someone like torturing another one with craziness inside. The storyline is quite flat and not really horrifiying for most of the time. But it does have some dark and tense moment. Can watch.","user":"ks-60500","rank":[1,2]}]