[{"title":"Tame but strong female led paranormal horror","rating":8,"date":"4 March 2020","review":"As usual with indie films the reviews here seem polarizing, so of course I wasn't sure what to expect. I'm pretty sure a handful of these are from people who illegally downloaded the movie, so I decided to give it a chance.<br><br>The Dawn begins shortly after World War 1. Rose's (Teilor Grubbs, Hawaii-Five 0, the new one) father William (Jonathan Bennett) is showing early signs of PTSD after returning from the war, which he can only relinquish by beating down a mailbox. His proverbial demons get the best of him, forcing him to kill his family sans Rose, who is sent to live in a convent with no other living family.<br><br>Flash forward ten years. Rose has grown into an adult (Devanny Pinn, who also produced). She admits in confessionals that her father's demons haunt her and she feels that because of this she cannot take her final vows to become a postulant nun (sorry if my understanding of the steps of nunnery are incorrect).<br><br>Whether during dreams or actual events, we see that Rose is also experiencing what appears to be a violent exorcism conducted by a Priest who had been assigned with watching over her as a child. Two fellow Nuns (Stacey Dash and Amanda Day) attempt to offer their advice, as does the unusually good-hearted (for these types of movies) Reverend Mother Agnes (Heather Wynters, who I'd recognized from American Horror Story) and the calm-demeanored Father Theodore (David Goryl, one of the slacker friends of Young Ben Stiller in There's Something About Mary).<br><br>Rose continues to see visions of this exorcism, as well as visions of chaos coming about in her real world. I don't want to spoil the last third of the movie, but it turns everything you've seen thus far on its head, unless you've been paying really close attention.<br><br>The Dawn has flaws, but every movie does. I don't live in the black or white land of movie reviews so many people do these days. There are some good, if subdued, performances. I can't decide if it needed to be brisker, or if it needed to be longer. However the cinematography is stylish and quite gorgeous at times and watching the movie in surround sound bore a few nice surprises.<br><br>Do yourself a favor and ignore the trollish torrent-spawned reviews and ignore the reviews of blind praise and watch it for yourself.","user":"supernovathinkitover","rank":[34,37]},{"title":"This movie was not good","rating":2,"date":"23 January 2020","review":"Terrible acting, hard to follow plot, large sections of nothing happening. At the beginning of the movie I literally thought to myself \"this must be some B movie footage that the characters in the real movie are watching. They'll cut to the actual movie soon\" ...but the cut never came. The movie remained bad for another 90 minutes. I'd avoid this one","user":"brent_maloney","rank":[43,52]},{"title":"Some reviews here seem false","rating":3,"date":"19 January 2020","review":"Um, this wasn't that great. Like not terrible, but I saw the \"reviews\"and was expecting a lot more. The timeline didn't make a lot of sense, the acting wasn't that great, no good effects. Pretty blah overall. I've seen worse, but I would recommend not wasting your time.","user":"kategrina","rank":[50,62]}]