[{"title":"Heartbreaking Story Done It Right","rating":7,"date":"15 June 2019","review":"The poster gave me the impression this maybe the UK version of \"Stand by me\", but it was nothing like it except for the story evolves around 4 boys. Davy(Noa Thomas) spends his summer days with his brother Iwan(Gruffydd Weston) and best friends, Rhys(Rowan Jones) and Robbie(Christopher Benning).<br><br>Then they witness a tragedy between Rhys and Robbie's parents. Their much older brother Kev(Steffan Cennydd) finds out the reason behind it and try to revenge a neighbor named Dai(Richard Harrington) for it while the family is falling apart.<br><br>Sensitive Davy refuses to accept the sudden change in his best friends circumstance and tries to correct it by himself. But he's too young to fully understand the situation and to powerless to do anything about it.<br><br>Growing up in a loveless household myself, I understand the parents as well as the kids what they want and why they want it. The movie climaxes when Davy confronts in hopes of turning back things the way it was, but it ends very realistic way without any tragedy. I love this movie exactly for it because life is like that.<br><br>The cinematography is beautiful and the acting is pretty solid from mostly unknown actors. Wish to see them more in the future. This is a heartbreaking story without any good or evil, because that's what we are like.","user":"mccollum26","rank":[6,7]},{"title":"Great Film","rating":10,"date":"17 October 2019","review":"Great film, strongly advise buying it. I would use it as a time capsule because it perfectly en-captures what it was like back then. Get it now","user":"joneswb-17976","rank":[2,2]},{"title":"Just gobsmacking!","rating":8,"date":"30 August 2019","review":"I am not going to ruin the impact or lessen anyone's enjoyment of this remarkable movie by giving any of the plot away. Suffice to say, this did not turn out to be the movie I thought I was going to see when I started watching it. Like some of the other reviewers here, I thought this would be a sort of ersatz 'Stand By Me', only done from a Welsh stand point. And for the first ten minutes, it looked like this movie would be exactly that before it suddenly veered off in a totally different and altogether unexpected direction. Raw and visceral, this movie is not what you would call family entertainment despite the main characters being 4 teenage boys. I read that the four boys were newcomers to acting when they made this movie and that is remarkable because they do an excellent job. They are all good, but in particular young Noa Thomas who plays Davy, the central character, shines. So much of what happens in the movie is seen through his eyes and he gives an intelligent, believable, totally sympathetic performance. Throughout the movie, his motivations are an enigma and the viewer is left to wonder if he is a hindrence or a help, a comforter or a antagonist to those around him, but at the end his motives are revealed and it touches all of us.<br><br>I don't know if you would call this a coming-of-age movie in the sense that we're used to, although there is no doubt all the characters are changed by the end. I can say though that this is a very good film and I'm looking forward to watching it again soon.","user":"CabbageCustard","rank":[2,2]}]