[{"title":"The movie should've been named disgRACE 3","rating":1,"date":"29 June 2018","review":"Even the mountain dew ad had better graphics than this piece of junk! On a scale of 1 to 10, it'll be 0!","user":"rajivsperumal","rank":[186,196]},{"title":"Salman Khan Movie directed by Remo D'Souza: Need to say more?","rating":1,"date":"27 June 2018","review":"Seems like directed by a really poorly skilled freshman's direction project. Salman Khan should now take some rest now. Daisy Shah should stop doing movies. Jacqueline can keep doing masala movies, she looks stunning as always but fails to deliver. Bobby Deol's blank expression is not his fault. Anil Kapoor - Why in this movie?","user":"nroy-35581","rank":[75,79]},{"title":"Race 3 is an insult to Bollywood. Avoid it any cost.","rating":1,"date":"16 June 2018","review":"While films like Parmanu, Padmavati, Padman, Sonu Ke Titu Ki Sweety , 102 Not Out, Hichki or even Blackmail were treat to eyes in the first half of 2018 giving hope that Bollywood movies have matured but then there comes a crap like Race 3 that will spoil your mood and you will wonder that if the makers are taking the audience for granted. <br><br>Race 3 tells the story of a dispute between a family when Shamsher Singh (Anil Kapoor) decides to give half of his wealth to the adopted son, Sikander Singh (Salman Khan) and the rest of it between his own kids, Suraj (Saqeeb Saleem) and Sanjana (Daisy Shah). <br><br>Directed by Remo D'Souza, who has made a decent film ABCD and pathetic ones like A Flying Jatt and ABCD 2, Race 3 is one hell of a journey which you wish to forget once you leave the theater. Right from the opening scene of the film to the climax, forget about logic, even the story is full of potholes. There is some breath of air when Anil Kapoor tells about his plan but again the film goes back to the loop hole and sadly does not recover. The first film Race (2008) was brilliant with solid twist and turns followed by an average Race 2 (2016). Race 3 is a nightmare which you should get over immediately with as it will haunt you, the more you think about it. <br><br>None of songs are good (surprisingly music is composed by brilliant duo Salim - Sulaiman). Action scenes , though few scenes were fine, but again gone overboard. Race 3 is high on production values and less on content. Dialogues are horrible and funny especially - Our business is our business , none of your business. Even the Bhojpuri language used in between the scenes is irritating. <br><br>Coming to the performances, none of the actors have done justice to their role. I do not understand why Salman Khan is repeating himself, even though he is in Bollywood industry for more than 25 years. The actor, who was superb in films like Dabanng and Sultan, should start experimenting with roles. Anil Kapoor is fine but could have been better. Bobby Deol makes a decent comeback but sadly not enough to leave any impact. Lesser spoken about Saqeeb Salim, Daisy Shah and Jacqueline Fernandez, the better. <br><br>Overall, Race 3 is an insult to Bollywood. Avoid it any cost.","user":"ketgup83","rank":[253,277]}]