[{"title":"Cool movie with legit science","rating":8,"date":"30 November 2019","review":"Really enjoyed the movie: cool story, good music, romance/drama but some funny moments too. (Also legit science.) It was fun to see population/evolutionary genetics in a movie like that!\nNote: I'm a researcher in genomics, so maybe a bit biased :)","user":"jeanmonlong","rank":[3,4]},{"title":"Interesting sci fi.","rating":7,"date":"26 November 2019","review":"OK, so it wasn't real, there are no such people who cannot reproduce! I mean, if they can't where did THEY come from? But it was an interesting enough movie, story, a fairy tale in some ways, but with people, an actual location.\nYeah, was not a kid's movie, but it still \"entertained\" me.\nDifferent for sure.\nHard to say who would like it or not, I could compare it something like Avatar, a people who may disappear. It's by no means as grand as Avatar, not in the slightest, however makes one think if there are any people who have or will disappear...","user":"Australian1","rank":[6,11]},{"title":"Sci-fi for science geeks","rating":10,"date":"9 December 2019","review":"The premise is straightforward. A woman named Libby with infertility problems is told by her husband Marco that the reason they can't conceive is because he's cursed. She gets pissed off and pays a visit to Seymour, a scientist friend/ex-boyfriend to help explain that curses play no role in their inability to conceive. As it happens, the husband Marco comes from a secretive community of people who are biologically different. And when Seymour mockingly takes their samples, he starts a chain of events that leads to him stumbling into a big discovery, that there is a viable second species of humans living among us. The scientist Seymour is itching to prove his hypothesis, but he needs more samples from these mysterious people. He convinces the couple to help him get more samples of these strange people -- they want to have a kid, remember? So Marco finally agrees to open himself up to the secretive people he comes from. It's an interesting, well researched story based in science that captures the feeling of how discoveries are made and explores the ethical issues around consent. I found it provocative, fast paced and well made.","user":"sarahkensington","rank":[1,2]}]