[{"title":"Smart, Witty Comedy","rating":10,"date":"11 April 2019","review":"I saw this movie during a trans-Atlantic flight. This is a German comedy-of-errors centered around a family member's desire to name their new child, \"Adolph.\" This desire causes horror and disgust in the family, but it also exposes the very fragile bonds which exist among the family members. Who says Germans have no sense of humor? The script is witty, the repartee between antagonistic members in these families is genuinely funny, and the surprises we learn about their family secrets are unexpected but do not break the audience's necessary suspension of disbelief. It is an interesting look into German middle class life which does not always receive. Much recommended.","user":"kaljic","rank":[13,14]},{"title":"Put to rest the \"Germans have no humor\" cliche","rating":9,"date":"24 April 2019","review":"This film managed to find the fine balance between social critique, a theme that German society is almost obsessed with, and humor. It gives the audience the sense of a theatrical drama, as most of the movie is shot between the living room and dinner table, albeit with varying camera angles, which is a challenge by itself as the audience can easily get bored if the conversation is not engaging enough, which is not the case with this film. You can have a good time without being interested in the underlying political discussion, although you would probably enjoy it more if you are interested in the reflection of German intelligentsia on the modern day impact of Nazi Germany's legacy on its society. The script is well-thought out, genuinely funny, and demonstrates that German cinema has the artistic skill to produce a high quality comedy. I highly recommend it.","user":"aalleekk1989","rank":[11,12]},{"title":"Well, that escalated quickly","rating":9,"date":"19 November 2019","review":"Never thought about to use this headline for a review but it fits absolutely perfect to the plot. And yeah, this was one of the funniest german movies i've ever seen so far.<br><br>Think about a usual family dinner with friends, cozy small talk, good dinner and some glasses of whine in relaxed atmosphere. At some point one couple offers the name of their unborn child and it's \"ADOLF\". Now everybody in the room is triggered, exactly like you. You can feel the moment, when the whole mood in the room is going to a complete different direction. Everything's getting a bit more aggressive but also funnier with every minute.<br><br>But no worries, this is not the complete plot, it was only the warm-up. Be prepared and listen carefully. This kind of comedy is all about the dialogues and i loved it.<br><br>Enjoy!<br><br>Cheers,\nFletcher","user":"Major_Fletcher","rank":[4,4]}]