[{"title":"Honest review: A very impressive low budget indie from an amateur filmmaker","rating":8,"date":"8 September 2019","review":"Wow, I have to say... \"amateur\" filmmaker Kevin McMullin makes his first ever full length feature film (only one prior short film) as executive producer, writer and director - and nails it. Mad props to him for putting together this little gem as well as he did - as a newbie.<br><br>Sure this film had flaws, but to present something better than some seasoned filmmakers have come out with lately, makes those flaws barely applicable, and certainly not worthy of all the 1's and 2's some of the wannabe critics on here gave this great indie film.<br><br>His directing behind the camera was great, and he directed his cast perfectly. His writing was also on point, although I did want a little more at the ending. The screenplay was very well put together, the cinematography excellent, and the score very fitting. There were however some editing issues. The casting was amazing, and all performances were exceptional and convincing. These youngsters certainly have a great future in acting ahead of them. Although I'm not a fan of slow paced films, this one was just right with its 84 min run-time.<br><br>This was a surprisingly very impressive low budget indie from an amateur filmmaker, and considering as such, is well deserving of my 8/10. If anyone questions my review as fake, click my username to see my 1000+ ratings and 700+ reviews.<br><br>I look forward to seeing more from Kevin McMullin and his young stars - perhaps a part 2?","user":"TheTopDawgCritic","rank":[35,52]},{"title":"That was fast","rating":7,"date":"4 October 2019","review":"Really tight story to tell. they succeed to maintain that itchy feeling for being chase by red and still maintain this warm summer vibe. The adventure feels really fun at the same time this story goes on. Every character seems doing a pretty good performance either.<br><br>a good fast movie after all.","user":"ariqakbar","rank":[8,12]},{"title":"Excellent little drama thriller","rating":6,"date":"6 September 2019","review":"Great acting performances from all cast members with Jaeden Martell stealing the show and a definite future box office top actor in my opinion.<br><br>Story was not that new but the photography, pacing and music all blended well to create an interesting and well directed drama come thriller!","user":"omendata","rank":[16,29]}]