[{"title":"Best Korean Blockbuster this year (No Spoilers)","rating":10,"date":"19 November 2017","review":"The ratings for this film doesn't do it any justice. The acting in this film is incredibly strong with the return of Ma Dong Seok with the lead role as a strong minded Police officer. The movie revolves around the 2004 gang conflict in Seoul, South Korea which was a conflict between a local Korean based gang and a Chinese gang known as the Heuksapa. The movie keeps you on the edge of your seat for the whole time and the atmosphere and acting really capture the mood for this movie. This is the first IMDb review I am writing as I usually don't bother but this movie made me write this. Its performance can be shown through its massive success at the Korean box office. I recommend it 100%, you will not regret it.","user":"john-yun-51277","rank":[31,34]},{"title":"The Outlaws Review: An entertaining crime action film with plenty of enjoyable moments!","rating":10,"date":"22 March 2018","review":"Movie: The Outlaws (18): Action/Crime - Korean<br><br>Positives:<br><br><ul><li>Ma Dong-seok's performance is cool, realistic and excellent. Apart from him, almost every actor, especially Yoon Kye-sang, also delivers a terrific performance.</li><li>The action scenes are very well executed and are a delight to watch.</li><li>The film uses humour surprisingly very well.</li><li>The script is watertight and the editing too is praiseworthy. Most films on this theme are slow-paced, but this one is quite fast paced and that's why it never bores.</li><li>The climax is very good and the ending is excellent.</li></ul><br><br>Negatives:<br><br><ul><li>Nil.</li></ul><br><br>Repeat value: Yes<br><br>THE OUTLAWS is another entertaining and extremely well-made South Korean crime action movie. There'a nothing more I can say, just go and watch it quick!","user":"Prashast_Singh","rank":[12,14]},{"title":"Don Lee's macho yet suitably wry lead performance is worth the price of admission alone","rating":8,"date":"29 December 2017","review":"With the real-life 'Heuksapa Incident' as backdrop, writer-director Kang Yun-sung makes an impressive feature filmmaking debut in the gritty yet colourfully entertaining crime thriller 'The Outlaws'. Like the 2007 gang turf war that took place in Seoul's notorious Garibong-dong district, Kang builds his film around the entry of ruthless Chinese gangsters who are not afraid to resort to brutal methods in order to muscle into the lucrative criminal underworld of moneylending, gambling and prostitution. Here, their leader is the pony-tailed Jang Chen (former boy-band singer Yoon Kye-sang), who in one of the opening scenes is seen demanding payment of two hundred thousand dollars upon a loan of just thirty thousand and then smashing the debtor's wrist when he pleads for leniency.<br><br>Jang is pitted against the tough but kind-hearted Ma Seok-do (Don Lee, otherwise known as Ma Dong-seok) of the Geumbong Police's Serious Crimes Unit - in contrast to Jang, Ma's introduction sees him first walk right up to two men during a knife fight on a public street in broad daylight while on his mobile phone and disarming them without even breaking a sweat. Rather than weed out the various factions of Chinese-Korean gangs who have taken root in the neighbourhood, Ma's approach has been to accommodate them by preserving the balance of power among them, even if it means getting them to sit down in the same room and hug it out as an early sequence involving two rival gangs Venom and Isu demonstrate. Obviously, Jang's entry upends that fragile peace, as the vicious former Changwon gangster takes care of the competition by either stabbing them to death (and disposing them in parts all over the district) or pitting the other gangs against one another.<br><br>Though the opening titles suggest some massive clean-up operation, what ensues is really a tactical play orchestrated by Detective Ma and his superior Captain Jeon (Choi Gwl-hwa), who are forced by their bosses to make a PR demonstration that they are in control lest cede charge of the situation to the Seoul Metropolitan Police's homicide department. Ma's plan involves getting the assistance of the local shopkeepers to collect ground intel on Jang's Black Dragon gang - although it does take some persuasion before they are willing to overcome fear of possible reprisal - culminating in a well-coordinated crackdown over the course of a single night to ensnare the entire gang, especially Jang, in one fell swoop. We might add too that viewers will get the pleasure of seeing Ma and Jang go mano-a-mano at each other, and that bruising sequence is as fierce as it is gratifying.<br><br>Not surprisingly, the storytelling largely follows the template of a procedural that sees Ma investigate the brutal murder of the Venom gang boss Ahn Sung-hee, following the latter's run-in with Jang over one of his associates' debt. In between, the narrative makes good room for character beats, such as the camaraderie between Ma and his men, the coming-of-age of the team's latest addition Hong-suk (Ha Joon), and Ma's quasi father-son relationship with a teenage boy running a snack cart along one of the district's busy pedestrian street. Through these scenes, Ma's uncompromisingly bad-ass but unmistakably sweet character rises above caricature, elevated by a textured performance by Lee of unexpected emotional heft. Compared to Ma, Jang isn't all that interesting at all, not least because the broad, flowing wig he wears comes off more an unnecessary distraction than some show of true unhinged menace.<br><br>On his part, writer-director Kang is just as deserving of credit for his grasp of authenticity. From the bar rooms to the BBQ restaurants to the back alleys and right down to the makeshift container that is Ma's office, each one of the settings feel vivid and real. Kang also eschews the usual stylized fight sequences for messy real-life brawls, and the result is satisfying old-school action that is right at home in a gritty crime picture like this. In fact, there is a lot to admire about what Kang has pulled off in his debut film, which makes up for what it somewhat lacks in narrative polish with sheer visceral realism. It also helps that Kang has a wry sense of humour, knowing exactly when to play it straight and when to inject some levity into the proceedings. Of course, through it all, Lee's larger-than-life lead role shines through, and 'The Outlaws' gets a whole lot more lively, engaging and affecting thanks to him.","user":"moviexclusive","rank":[9,10]}]