[{"title":"Juvenile and Shallow","rating":4,"date":"3 March 2019","review":"It passes beyond belief that this film has an IMDb rating of over 8 as I write this. I can only assume that this film's rating is generously bolstered by its own cast, crew, and producers voting prolifically for this dumb movie. Cliched characters, old jokes, and a few generous topless scenes of the ladies round up this movie's dim attempts at humor. Think Caddyshack, Meatballs, or American Pie only much, much worse. All of those movies are well worth watching. This one . . . not so much. You can rent it in SD on Amazon for $1.99 if you don't value either your time or your money. This movie is destined to be showcased on some future generation's Mystery Science Theater spoof show where puppets make fun of stupid movies that were only of interest to the film school dropouts that made them. I created an IMDb user account for the sole purpose of writing a review of this film in the desperate hope that my review might prevent another hapless person from wasting 90 minutes of their lives. Viewers contemplating watching this film would be better off watching Manos the Hands of Fate or Godzilla vs. Mothra. Yes, both are shallow, stupid, and poorly made. But at least they have some cultural relevance as touchstones or reference points for movies that suck.","user":"VortigernGreen","rank":[27,40]},{"title":"Horrible film. Don't waste your time","rating":1,"date":"10 March 2019","review":"Looks like a stage production with gratuitous sex scenes. Really bad.......","user":"jimkremidas","rank":[18,29]},{"title":"Beware of misleading reviews.","rating":1,"date":"18 May 2019","review":"I attempted to watch this shambolic, amateur effort because of the glowing reviews and at the time 8.5 rating here on IMDb. Don't make the same error. The reviews currently showing 10/10 are obviously uploaded by those trying to promote the movie. It's an objectively bad movie. Maybe not the 1/10 I gave it but post misleading reviews on your own movie and I'm going to mark you down. Let you work be judged on it's own merits.","user":"dhoebeck","rank":[4,8]}]