[{"title":"Don't watch!","rating":1,"date":"10 February 2019","review":"Don't watch it, except if you like CRINGE and bad acting on the highest level. I feel like I have to take a shower after viewing this...","user":"gbmeinsmann","rank":[5,5]},{"title":"I am not sure if this film wants to be taken seriously at all","rating":2,"date":"21 March 2019","review":"\"Koxa\" is a German German-language full feature film from 2017, so still relatively new. This one runs for 85 minutes approximately and was directed by Ekrem Engizek. This was his very first filmmaking credit and samek can be said about basically all the actors in here, who have (according to imdb) never been in a film before this one and for some it will probably stay their only performance. The title here is the German slang word for \"cocaine user\", or well lets say the way somebody would write this slang word if he knows nothing about spelling. Kinda fitting as seeming Engizek also knew nothing about filmmaking either here. It clearly shows. I cannot even blame the actors. Some of them are tolerable taking into account they have no experience and a lot of the time I had the impression I was actually watching real Turks in Stuttgart. This South German city is where the film is set, but that does not play a role (unless another reviewer, who was probably part of the crew or so) and the film could have been setg anywhere else really because this is not a film you will appreciate more if you are from Stuttgart. As for the story, well we have a bunch of small time crooks suddenly taking care of a big cocaine shipment, a challenger that goes clearly above their talents where you could say marijuana is probably the limit. I don't mind the film ot making a powerful anti-drug statement because then I could also be angry at Tarantino or so for promoting violence, but yeah the key is of course the artistic component. And the writing / story-telling. Nothing to be proud of for this movie in these fields. The boys constantly insult each other (occasionally in a friendly way), beat of their girls, are threatened by other criminals or just sit around all day doing nothing. It is not an interesting film by any means. If there is any reason to watch this one, then this would be perhaps from the guilty pleasure perspective. The characters are so dumb and simple-minded occasionally that itg is almost funny to watch them and what their one-dimensional minds plan next. But also from this perspective, it simply isn't fun enough and 3 or 4 of these moments that had me laugh (no idea if intentionally or unintentionally) are definitely not enough, not even for a relatively short film like this one. I hope that really everybody who worked on this movie will step things up in the future if they plan on having a longer career in the movie industry. \"Koxa\" is truly a mess from beginning to end yep I am kinda glad it was this short. What else can I say? Oh yeah the tagline making a connection to the drugs used in here \"Ein Film zum Reinziehen\" (cannot translate that properly without losing the meaning and too lazy to explain it now, German will understand) is just as cringeworthy as everything else. I am not sure what kind of longtime consumption is more dangerous to your health: this film or the drug it is about. I say about both (luckily about the latter not from personal experience: Keep your distance. Highly not recommended.","user":"Horst_In_Translation","rank":[1,1]},{"title":"Only One thing to say","rating":10,"date":"15 October 2018","review":"Im from the region the story took place. The movie shows like it really is.\nPure reality.","user":"jakob_w_de","rank":[1,4]}]