[{"title":"Enjoyable movie with appealing cast and a lot of heart","rating":8,"date":"17 April 2019","review":"This movie put a smile on my face. The characters are just the greatest bunch of lovable people (and a dog) brought together in a movie. The story, despite some familiar scenarios, was fresh and interesting. Some beautiful cinematography of the Katherine gorge and Tiwi Islands and elsewhere up north added some more interest to the movie and should have people adding the north to their \"bucket lists\". Some truly funny scenes. I thought Kerry Fox was particularly funny in her role as Miranda Tapsell's lawyer boss, she seemed to be having the time of her life playing the part. It could have been pure caricature, but she gave it some depth. The camera just loves Miranda Tapsell and Ursula Yovich, who plays her mum, and the actors who played the bridesmaids were similarly gorgeous. Huw Higginson was good as the dad, and he managed to nail an aussie accent, which not many pull off. The movie reminded me of that REM/B52s song \"shiny happy people\". Yes, there is some pathos, but overall it was just shiny happy people in a beautiful shiny happy landscape (yes, I know you can get eaten by crocs and die of heatstroke, but in the movie it was all just gorgeous) and I came out of the film having a bit of the shiny happy rubbed off onto me.\nI agree with the other reviewer about the soundtrack. I also liked it a lot.","user":"newbroom","rank":[21,24]},{"title":"Great Romantic Comedy","rating":9,"date":"31 January 2019","review":"I saw the premiere of this file at Sundance, and it's a great film. It follows a lot of the traditional Rom-Com formula, but does it very well-the right mix of funny &amp; touching, but never getting sappy. It uses a \"road trip\" plot device, that allows for some spectacular cinematography of Austraila's Northern Territories and islands. The music in the film is outstanding! (I hope the soundtrack gets released...) A really fun, well-done movie, and if it gets picked up for distribution in the US I think will perform well here. This was easily one of my favorite films so far at Sundance this year!","user":"jzarley","rank":[22,29]},{"title":"Love, love, loved it!","rating":10,"date":"12 February 2019","review":"Less than 20mins out of the theater and I had to sign up to imdb to rate this film 10/10! The first Australian screening just took place and I am so lucky to have seen it. It was heartfelt, funny, real, and lovely.\nHighly recommend it!","user":"beckfordyce","rank":[23,31]}]