[{"title":"Watch this movie Sweety","rating":8,"date":"11 March 2018","review":"Sonu Ke Titu Ki Sweety is the 4th film from the hit team of Pyaar Ka Punchama. Is it as good as the PKP films or does it fail to impress like Aakash-Vani?\nSonu Ke Titu Ki Sweety stars Luv Ranjan's regular cast of Kartik Aaryan as Sonu &amp; Nushrat Bharucha as Sweety. Sunny Nijar who has been part of 3 of the 4 films directed by Luv Ranjan is also a part of this movie. The movie stars off with Titu breaking up with his GF - Pihu, thanks to his BFF Sonu. Titu is the wealthy scion of the Ghasitaaz sweet franchise. Sonu is his BFF since childhood &amp; they live together. Sonu makes Titu realize that his GF is cheating on him &amp; doesn't deserve his love. Six months later, he meets Sweety through an arranged marriage setting. While Sonu feels there is something amiss, Titu is totally floored by Sweety. Sonu &amp; Sweety square off against each other. Both proclaim that Titu will eventually side with them. What follows is a series of funny incidents, ending with Titu choosing one over the other.\nLuv Ranjan has a flair for comedy. His PKP franchise is testament to that fact. Thankfully he doesn't disappoint us in this movie. Kartik Aaryan is fantastic as Sonu. He is the lead character &amp; he shoulders the film well. A star truly has arrived. We do hope other film makers take note of this bundle of talent. Nushrat Bharucha is fire to Kartik's ice. Their games of one upmanship will leave you in splits. Their scenes together are gripping. Sunny Nijjar is decent, but could have played his part better. Alok Nath is hilarious as the Ghasitaaz family's shrewd patriarch. His scenes with Virendra Saxena are dynamite. The movie will make people reminisce about the two PKP films &amp; its misogynistic themes. \nThe weirdest part about the movie is that the villain does nothing wrong apart from saying that she is \"chaalu\"! Yes, she does threaten the hero that she will throw him out, post her marriage to his friend. But then again, isn't that every woman? Are the makers trying to say that all women are evil? The ending too did look a a bit impractical. But hey! it's bollywood. Please don't analyze the movie too much &amp; just enjoy it.\nIt is highly recommended to watch this movie with your guy buddies &amp; not with your wife/GF who would ask you, your opinion on the dilemma the hero's friend faces - which may lead to disastrous results! It is a funny movie which shouldn't be missed.","user":"theopinionatedindian","rank":[10,12]},{"title":"It is a fun ride all the way !!! Karthik Aaryan and Alok Nath steals the show","rating":8,"date":"25 February 2018","review":"Luv Ranjan has earned a tag of using misogynistic plot for his films and Sonu Ke Tittu Ki Sweety is no different with the only difference being the introduction of Bromance Versus Romance as the main theme.<br><br>Sonu Ke Tittu Ki Sweety tells the story of two best friends Titu (Sunny Singh) and Sonu (Kartik Aaryan) where Sonu always rescues Titu from hooking up with wrong girl. Enters Sweety (Nushrat Bharucha) into the life of Titu and his world is shaken by her love. However, Sonu feels there is something wrong about Sweety and does all the things in the world to help Titu from falling into wrong hands once again.<br><br>After making hilarious films like Pyaar Ka Punchnama and its sequel, Luv Ranjan goes out of his comfortable zone this time and uses different theme to make it a fun loving film. The movie touches upon some great comic moments that is sure to bring down the house. The interaction of Sonu with Ghasite(Alok Nath), the tricks played by Sonu on the servant Babu and even war scenes between Sonu and Sweety will entertain you to the core. Luv Ranjan is known for witty and humorous dialogues and Sonu Ke Tittu Ki Sweety has some great funny ones that is sure to tickle your funny bones especially the last scene at the swimming pool. <br><br>Art direction is nice while Cinematography is cool. Editing is good but could have been better. There were few scenes which could made the film even better but I had a great time with this one. Songs are wonderful with \"Kaun Nachdi\" and \"Subhah Subhah\" pick from a lot. Coming to the performances, Karthik Aaryan steals the thunder once again with his outstanding performance. There is no seven minute monologue this time but actor has just superb dialogues to deliver and he does it with aplomb. Alok Nath will surprise you his non-sanskari dialogues. He is mind blowing and is sure to win your heart. Nushrat Bharucha looks gorgeous and does well in a different role while Sunny Singh and Virendra Saxena fit their part well.<br><br>On the whole, Sonu Ke Tittu Ki Sweety is a laugh-a-thon which will be enjoyed immensely. Amazing 4/5","user":"ketgup83","rank":[16,21]},{"title":"This gang delivers..","rating":8,"date":"23 February 2018","review":"The movie is full entertainment and masala with good punches, locations and acting. Overall a nice movie to watch with your friends.","user":"lakshaydulani","rank":[31,45]}]