[{"title":"Its complicated.","rating":6,"date":"16 September 2019","review":"Just managed to track this movie down after reading about it online last year. This is written and directed by Jessica Hynes who was one of the writers for the cult comedy Spaced on Channel 4. She is more well known as a comedy actor and writer and also features a number of other well known UK comedians such as Sally Phillips and Alice Lowe. However this is not a comedy.\nThis is real life kitchen sink type of drama which explores motives around bullying and violence from a mainly female perspective. We get to see bullying but we also get to see what may be at the root of these issues, this is not a simplistic Hollywood good girl/bad girl type of narrative. Its more complicated than that.\nWhat this film did manage to achieve was to not paint people into simplistic archetypes of character and in particular it wasn't trying to sell the story violence and abuse is a male only problem.\nIts more sympathetic to males than some writers would have been.\nThe film is beautifully shot and scored and is certainly aimed at the arthouse circuit.\nIf in depth emotional studies are your thing then this is for you, do not expect any wacky Edgar Wright style shenanigans cos that aint what this is.\nThis is a mature a accomplished directing debut and I hope its reflective of whats to come in the future from Jessica.\nAlso she managed to squeeze some drum and bass in there and I am unsure if she also had her kids in this movie? It seems like a labour of love and she was able to get support from some of her friends to make this.\nRecommended.","user":"torrascotia","rank":[6,7]},{"title":"Deflates quickly","rating":6,"date":"2 April 2019","review":"Sports movies using an activity as a metaphor for various life struggles is a bit of a cliche, and the idea of a \"fight\" is probably the worst example. Heck, we even had \"Fighting With My Family\" this year, but at least that was based on a true story (and was funny/entertaining).<br><br>Also cliched is that quintessential \"British Film\" where higher budgets are substituted for kitchens, ironing, shouting, and lingering shots of things like trees or people walking along thinking.<br><br>Its easy to forget those things - for a while - in Hynes' debut film, which focuses on bad parenting, dealing with the past, school bullies, and sort of folds a subplot over on itself to create some overlaps and parallels. There are some emotive moments, and I found myself engaged. Her acting is terrific, as are some of the supporting cast.<br><br>But afterwards, it deflates quickly. There's barely anything to remember, no striking scenes, no clear story, no real message, just nebulous ideas of things. One strangely forced subplot conclusion that comes out of nowhere. There's no vein of causality or purpose, no reference points, it all just evaporates. In a year, I don't think I'll remember a single thing about it.<br><br>I get the feeling Hynes internalised the pressure of \"making a film\" into having to deliver something sombre, lofty and heavy, when I think turning a story like this into satire or sharp comedy would have been far more effective (its impossible not to imagine with talent like Alice Lowe, Sally Phillips and Russell Brand's involvement). There's a single cheap-laugh scene against home-schooling, which feels even more forced after trying to involve us in a school bullying story. In a Q&amp;A afterwards, she confessed that the writing process was all over the place, switching around major character plot-points, working backwards from the idea of having a reason for a woman wanting to box (which was probably the least effective and most pointless aspect of the film for me). This style of writing, without a clear story to begin with, explains a lot of the films contrivances and makes it seem more like a screenwriting homework project than something worthy of a feature. Having got this out her system though, I hope her next project has more purpose and confidence.","user":"rabbitmoon","rank":[11,15]},{"title":"Splendid, beautifully played and nuanced film","rating":9,"date":"21 April 2019","review":"This film is a joy: sensitve, nuanced and thoughtful. Other reviews (not necessarily on IMDb) suggest it lacks a killer punch or clear plot line but the sum of its parts amounts to a deft slice of the human condition in all its frailties. Fine, subtle, performances and nicely unresolved. If that's not your thing, best avoided (and reviewed).","user":"andreweccles","rank":[8,18]}]