[{"title":"We still watch it","rating":5,"date":"18 October 2018","review":"This is a typical lifetime movie, but you know what? We still like to watch them. Intriguing and you get hooked despite pretty much knowing exactly what's going to happen. This was one of those. I just wish the climax at the end with the sister was more realistic.","user":"tomfsloan","rank":[3,4]},{"title":"I Like The Story","rating":9,"date":"29 September 2018","review":"I love the story ... she is like having dual personalities and the acting is good for me... Plus the dictions and dialogue are quiet good too, It is not slang or hard to understand.What I hate about the movie is the voice whenever she faces the mirror I cannot understand it , it was too loud and noisy...","user":"johnareidman","rank":[4,6]},{"title":"Well Done Story","rating":10,"date":"31 August 2018","review":"This is one of those movies where the insanity of the villain is 'deadly' obvious, except only one person actually realizes that something is not quite right.\nHelena (Brittany Underwood) is an ambitious fiance. She loves to get engaged, then kill her husbands because they \"lie\" to her. Underwood strongly embraces the unstable and too-perfect bride-to-be. An interesting twist throughout is Helena's 'other' personality, which speaks to her through a mirror, telling her that no one is trustworthy and that she must get rid of them, including her own fiance, Charlie.\nCharacter Development: Villain: consistently unbalanced. One of the notable traits she possesses is the desire for everything to be \"perfect\", which should concern those around her, especially Charlie. Where we see a real change is in the discernment of Helena's soon-to-be sister-in-law, Becca. She is the one family member that notices that something is off, that Helena is working too hard to be \"perfect\" and that her jealousy of Charlie's former girlfriend who is now married and clearly only a friend is both unfounded and strangely self-consuming. There are other clues that alerts Becca, behavior that is too rehearsed and forced to be natural or real.\nPacing/Writing Quality: Well done! There is a lot going on in Helena's head, so with each bit of dialogue, we see more and more of her psychosis. The scenes are engaging due to likeable characters (Charlie, Becca, their parents, and Charlie's pals). There is also an interesting reveal at the end, though it doesn't invade the plot as that would have created another story line and would have taken away from the main plot.\nContent (language, sex, &amp; violence): No Language, no sex (not even romantic kissing). Violence is shown, but mostly what is seen is Helena swinging at someone off screen.","user":"Kristamw","rank":[3,10]}]