[{"title":"A true Story that needed a better budget .","rating":6,"date":"8 September 2018","review":"As I have spent most of my adult life living around the Northolt area I am very aware of the debt my country owed to the brave few who protected Britain from the Luftwaffe in the summer of 1940.\n Northolt base was the home to 303 Polish squadron this film is an almost fitting tribute to those courageous men.\n Unfortunately, although a well intended film, I think it could have been so much better if given a bigger budget, This really looks like a low budget made for TV movie.\n If the makers had given a little more care and attention to the story line which was a a bit 2 dimensional as it depicts The British pilots as arrogant toffs that hated the Pols and the Pols as melancholy aggressive drunks.\n This was mostly false as the fatigued British pilots and officers were aware that they needed all the help they could get. \nMy grandfather told me that the Polish pilots were always polite and good humoured when dealing with the locals and other members of the armed forces in the area. This is represented in a small scene , but nowhere else. <br><br>Most of the performances are good and save a rather bland script that could have done with a little more spit and polish. <br><br>This could also be said for the special effects used to recreate the aerial battle sequences. The CGI went from OK to bloody awful video game graphics.\n But I could over look this as despite the films flaws as it is a fascinating true story and well worth a watch.","user":"ashwetherall1","rank":[109,115]},{"title":"A missed opportunity to make a worthwhile historical film","rating":3,"date":"9 November 2018","review":"Where to begin? This film is disappointing on so many levels.<br><br>To begin with the script must have been written by a teenager, or at best a millennial with no appreciation for how people spoke on the 1940s. Time and again words were used that brought me up with a bump and a cringe. \"Thanks for the invite\" is a horrible late 20th century replacement for \"Thanks for the invitation\". It just grates. And no one ever said \"Roger that\" in that era. There are other examples but I gave up on hoping for script authenticity after a short while.<br><br>But the absolute worst of this film was the total ignorance of aerial combat in the Second World War. Fighter pilots never EVER flew straight and level for more that 5 seconds at a time, and they were constantly swivelling their heads to scan the sky for the enemy. So to see Hurricanes and ME109s flying in a straight line with the pilots staring fixedly ahead like Sunday day-trippers in the middle lane of an empty motorway was risible in the extreme.<br><br>The combat scenes were created in CGI by kids who, again, have no clue as to how it actually took place. The Hurricane couldn't out-fly the ME109. The latter could out-climb even the more agile Spitfire, and though it couldn't out-turn a Spitfire it certainly could the Hurricane. So we were treated to scenes of 109s flying straight and level while Hurricanes picked them off and blew them out of the sky. That just didn't happen. Actually, the CGI fighter sequences in Star Wars were more akin to how it was, not the pedestrian sequences we were obliged to watch.<br><br>In fact anyone who has read anything about the Battle of Britain knows that the Hurricane was always sent to engage the slow-moving bombers. The German fighters that we're sent to protect them were taken on by the Spitfires. The high kill score for Hurricane squadrons was for bombers; hugely important because it was the bombers that did the damage on the ground. But of course that doesn't chime with the desired picture of sky-jockeys in one-on-one combat.<br><br>Oh, and the skin of the Hurricane was FABRIC not metal, so the sight of bullets spanging off the metal sides of these planes was completely incorrect. It's the Spitfire that had an aluminium monocoque fuselage.<br><br>And the women at the plotting table? The idea that one of them would countermand the instructions of the senior officer in charge of deploying the squadrons is ridiculous.<br><br>This film was a juvenile attempt at heroic storytelling that dismally failed, and made a bit of a mockery of the real Polish heroes of the RAF. The storyline was weak, the dialogue written by people with a tin ear for the period, and combat sequences that would have been acceptable if someone on the team had done just one hour's research.<br><br>And the final engagement between the hero's Hurricane and the 109? I won't deliver a spoiler but it was absolutely ridiculous.<br><br>For shame.","user":"dave_garfield-70593","rank":[78,91]},{"title":"Well intentioned, poorly executed","rating":4,"date":"4 February 2019","review":"As mentioned elsewhere, the Poles deserve better than this - many of the CGI kills were highly improbable - tailplanes don't just blow up - there's no fuel down there.<br><br>That said, it is worth a watch. A better film in this genre is Dark Blue World, but it revolves around Czech pilots with real spitfires.....","user":"electrocution_ca","rank":[24,27]}]