[{"title":"Reservoir Dogs meets the Wicker man","rating":7,"date":"20 June 2019","review":"A British Crime horror movie.\nCombining the British crime movie flavour of Snatch &amp; Lock stock , The gangster cool of Reservoir Dogs and the Pagan cult horror of the Wicker man.<br><br>What Works :\n<ul><li>A great cold open, instantly sets the status quo. Effortlessly introduces the players and the tone of the movie.</li><li>Great characters. Our protagonists our 2 gangster heavies , but the ooze charm and have great chemistry on screen . The dialogue is great and they actually come across as real people. To male friends in real life would totally break down in hysterics when a friend would get stuck in the mud, or trip down a hill. I was boought in to their characters.</li><li>Builds tension. The first act is more a crime story whilst the third shifts to cultists supernatural horror . The change is tone and building of tension is great and the supernatural threat ramps up.</li></ul><br><br>What doesn't work:\n<ul><li>The second act falls a bit flat and feels like it's treading water somewhat</li><li>Overuse of CGI blood squibs</li><li>Sadly the climax is a little weak, and doesn't make much sense , and thus is a bit of a let down. You can more or less see something like it happening, but thy take it one step further and just left me feeling perplexed.</li></ul><br><br>Overall a solid and watchable gangster horror hybrid . Well worth your time","user":"geeklegionofdoom","rank":[16,28]},{"title":"Interesting, but not alot of back story.","rating":5,"date":"24 June 2019","review":"The concept of the film is rather interesting I liked the two main mobster characters, and Greg played his role well. I feel as if some back story on 'The woods people' would of helped the viewer understand why they are there and who they are. The initial start of the film felt slow with the starting credits, it didn't grab hold me unlike most films where the actions starts from the get go, but that's personal opinion.<br><br>Overall it was still a good watch, and I couldn't predict where the story was going! Well done to all the cast and crew for creating this thriller/horror!","user":"bradhickford","rank":[9,15]},{"title":"Cracking low budget horror!","rating":7,"date":"2 July 2019","review":"Low budget horrors are usually home to one or more of the following: bad story, bad acting, bad script, bad production design. John Langridge's 13 Graves is a wonderful surprise as it contains none of those!<br><br>Quite the opposite. It's a clever, tightly-written script with brilliant cast of quirky characters. The story mixes genre seamlessly and the film is great to look at, especially as night falls (where many horrors resort to frantic 'running around in the dark').<br><br>Because it has intelligence, and a story, at its core , it manages to be both gripping along the way and satisfying at the end.<br><br>I've seen 13 Graves once, and unlike most horror films, I'd happily watch it again - and that's not something I say very often.","user":"paulchronnell-316-894842","rank":[12,23]}]