[{"title":"Zellweger gives best performance in years","rating":9,"date":"28 September 2019","review":"With Renee Zellweger as Judy Garland, you can not only feel her and see her, but you forget Zellweger is even there at all. Like many great performances, you see the character and forget that there is even an actor. Watching her performance is like watching a cosmic display. Some things are just meant to happen.<br><br>There have been many so-so bio-pics as of late, most comparably Film Stars Don't Die in Liverpool, in which another great actress, Benning, portrays the troubled last days of another great actress, Graham. Comparably, Zellweger's performance outshines the more renowned Benning. By contrast, Liverpool is also jaggedly uneven. That's not to say that Judy is perfect. Music bios are tough. Rami supposedly was great in Bohemian Rhapsody, but the film encompassed a superficial sentiment and lacked intellectual curiosity. Control, the Joy Division piece, is maybe the best in recent years... But Judy is right up there.<br><br>The story covers her last gig in London. The film uses flashbacks in order for the audience to understand her character. While most of those around her only see a washed up star, who was just forty seven.<br><br>What the story lacks in structure, it makes up with warmth. While this is a softer portrait, it still feels authentic. It finds no purpose in portraying her issues with callousness. Instead the narrative depends on Garland trying to understand herself, while making poor choice after poor choice. If you know anything about Garland, you know where she is going... But what you may not know, is she how she arrived there. It is a deeply sentimental portrait of a brilliant mind and troubled heart.<br><br>There have been some cynics saying that \"Only a fool would try to play Garland.\" Dare, I say, Zellweger just made a fool out of you.<br><br>See this movie, it will remind you of yourself.","user":"johnhandsome-32658","rank":[261,287]},{"title":"Zellweger is Oscar-worthy, the film not so much.","rating":24,"date":"24 September 2019","review":"\"I used to listen to Judy Garland all the time - I love Judy Garland and her music. But I started to realize that if you keep singing like that, singing songs of being victimized by love over and over and over again, it can't help but have a profound effect on your life.\" Diane Keaton<br><br>\"Judy\" is the saddest movie of the year, and a top contender for all time. The last year of Judy Garland's (Renee Zellweger) life before she overdosed on drugs are depicted with a surgeon's accuracy, and the days are counted in despair over her addictions and most of all the separation from her children. Nothing much is pretty, and most is desperate.<br><br>Not that I expect the docudrama should be a musical; it should at least be entertaining even in a dark way. To see this iconic entertainer holding a formidable place in the hearts of everyone who has been moved by the whimsy and hope of The Wizard of Oz is to get too much despair after almost two relentless hours of depression.<br><br>There is no wizard here, just Louis B. Mayer plying Judy with rhetoric and pills to keep her going through the many pictures she would do after her Oz triumph. She continues getting artificial help long after as she performs not for pleasure but to make enough to keep her children, ironically forcing her at the end to London, that adoring town, but without her kids.<br><br>The drama is punctuated by songs, sung expertly by Zellweger, and by her Oscar-worthy performance. But, of course, her voice is not Garland's, nor is anyone's. However, without the insight into her talent and formative years, it's just a gifted Renee imitating the tics of a diva diving to her death at 47.<br><br>Thank goodness for a subplot involving two gay fans and their evening with her. It's endearing and the best way to show how she impacted those on the margins of society. The final scene when she sings Rainbow involves the gay duo and is hokey but effectively sentimental and lyrical like the song itself.<br><br>Because most of us have grown used to idolizing Judy Garland, the film has a special mandate to show the formation of her formidable career and not just her desperate denouement so that we can enjoy her and understand her better. I propose the next Judy pic be a docudrama about the first half of her life. Now that would be only partially sad.<br><br>\"I think without a doubt there will never be a voice like Judy Garland.\" Mickey Rooney","user":"jdesando","rank":[143,165]},{"title":"Oscar Worthy Performance","rating":10,"date":"29 September 2019","review":"What a heart-wrenching performance by Renee Zellweger. At times I had to remind myself that this wasn't Judy Garland. Stardom is not always glamorous. The end scene and closing credits were so moving.","user":"djbear88","rank":[172,204]}]