[{"title":"Christianity brainwashing.","rating":1,"date":"28 May 2019","review":"What a load of crock. All they do is try to disprove the science theories by saying that the their theories are impossible to be able to be true yet they believe that all of a sudden the earth and humans were created in 1 week with absolutely NO EVIDENCE to prove this is what actually happened apart from the writings in the bible which was written by a human just like any other fictional book. They forever quote the words that God said while creating the earth but there was absolutely nobody there to hear him supposedly say these words or anybody around to write them down . All these God believers have done is twisted the facts to match what is written in the bible ( and they did this very vaguely every time they couldn't prove what was written) . The film came across as a bit of brainwashing on behalf of their non-provable bible.","user":"keithbarber-94901","rank":[28,45]},{"title":"Not that good.","rating":1,"date":"16 November 2017","review":"Genesis: Paradise Lost is a Biblical cash grab made by a few people who are nearly cult-like in how they refuse to acknowledge the physical and Biblical evidence of the age of the earth, and of evolution. I see many people praising the CGI in this movie, some even saying its as good as James Cameron's Avatar. Don't be fooled, the CGI is alright, but its honestly nothing better then your typical dinosaur documentary on BBC, I would even go as far to say as the more recent dinosaur documentaries made are of better quality, both visually and scientifically. It comes nowhere near the quality of Avatar. Most of the people who watch this movie won't have a college education and will praise it like its a masterpiece. So if you're one of those people, by all means, watch it, but if you're just an average guy don't waste your money.","user":"deronzierer","rank":[40,71]},{"title":"Contemptible drivel","rating":1,"date":"28 May 2019","review":"This movie is nothing more than theocratic piffle. Don't waste your money.","user":"franklfrost","rank":[20,33]}]