[{"title":"Beautifully acted, heart-wrenching yet heart-warming film","rating":7,"date":"10 September 2019","review":"I felt compelled to write my first review, as this film doesn't have many and totally deserves a shout out.<br><br>The actors are fantastic, the story realistic and whilst, at times quite depressing, a heartfelt tale beautifully told. Definitely worth a watch.","user":"louisacareybrown","rank":[15,20]},{"title":"The Greatest Love Story","rating":9,"date":"14 September 2019","review":"This is a beautiful love story. The on screen chemistry between Josh O'Connor (The Durrells, grew to love him in the series and very excited to watch him again) and Laia Costa is electric. Although a little slow in parts where the concentration is focused on Elena (Costa) just thinking and walking, she is so pretty to look at though. It really made me think about the many women who go through IVF treatment, it consumes your whole life! This movie is a must see!","user":"robertsclan-07091","rank":[11,14]},{"title":"I wanted to like it...","rating":3,"date":"18 January 2020","review":"What was the point of this? It starts off with two incredibly boring characters. I adore Josh O'Connor as an actor, but Jake is a complete personality sponge. The only trait he has is that he's studying a PhD (something they seem to only remember once every six months) and sometimes listens to music. Elena's personality is looking moody and lying about her age. Why anybody would trust somebody who lies about their age multiple times when they've just met is beyond me.<br><br>The two spend some time moaning at each other and occassionally having sex. There doesn't seem to be any spark, but they're both bored and then meet each other's friends. Jake sees Elena holding a baby and immediately decides to have a baby. They've been together a few months at this point, and never discuss it, except for Jake once making a vague remark. His next action is to force Elena to have unprotected sex, when she's firm in wanting to use a condom. Didn't think it needed stating, but forcing someone to do something they're not comfortable with in sex, particularly when it could result in something lifechanging is not okay!<br><br>They quickly discover they're not getting pregnant naturally, and go on a waiting list for IVF. This is all very understandable, and the fact that this causes additional stress and arguments is very believeable. This is a great middle of the film, although isn't exactly entertaining viewing. However, when it becomes apparent that Elena has an issue with her eggs and can't conceive that way, everyone in the film, including the entire medical community, seems to forget that surrogacy and adoption exist. There is a direct arrow repeatedly stated that Elena not being fertile means the couple can never have kids. The fact that they celebrate their one-year anniversary around this point draws attention to how absurd and unbelievable the timeline is.<br><br>It's completely convincing that fertility issues would cause arguments. But Elena repeatedly calls herself useless and worthless because she can't reproduce. She says she's pointless as a woman because of her ovaries. She tells her partner to leave her and find someone who can have his kids. Nobody seems to dispute what he's saying. If this film weren't written and directed by a woman, I'd assume some misogynistic meninst from Twitter had scrawled it down to make women feel bad about their bodies.<br><br>All the characters stating that they want perfection and that maybe their parents were or weren't perfect seems drawn from a book of clichés. Any screenwriter knows that it's important to show not tell, but this film seems to fail at telling the things which need to be told and all the things that could be subtle are bluntly hammered across.<br><br>Eventually the two characters are fighting and screaming and ask what they're doing together, finally getting to a point which has bothered me all the way along: what did they see in each other? It's never clear, even from the beginning. Is it just that they're both attractive and under 40?<br><br>Elena screams at Jake to leave and makes clear she doesn't like being with him, repeatedly forcing him to get out the flat. She rapidly becomes an immensely hateable figure for her irrational and selfish behaviour. Ten minutes later, however, she's sobbing at a café and demanding to know why Jake left. He insists he'll never come back. Then his dad tells him that he sometimes argued with her mum (I know he's meant to be a naïve 26-year-old, but surely everyone above the age of ten knows that sometimes parents fight?) and the two reconcile.<br><br>I really wanted to like this, but ultimately it just felt like a waste of everyone's time. Have no idea what all the critical praise and awards were about. It's not the first film to deal with this subject matter, nor is it the best.","user":"lukusclarinetist","rank":[8,12]}]