[{"title":"Slow Burner","rating":7,"date":"1 July 2019","review":"This is a mesmerizingly slow film set almost entirely in one room..... it could almost be a play. However Adrian Noble thankfully focuses on the two main actors and we are gradually sucked in to their closed little world. Both Spall and Redgrave give towering complementary performances which keep the audience completely entranced from the beginning. Redgrave especially manages to create a relentlessly critical and bitter character without the viewer ever hating her for it.. and Spall has grown into a confident and creative character actor of the highest order. Beautiful cinematography and set design make this film artistically watchable. If you like slow burning drama then this is a treat.","user":"andyge","rank":[28,31]},{"title":"How many of these are left?","rating":9,"date":"26 December 2019","review":"This is a gem, precious in every way, and makes you wonder how much longer we'll be able to invest this kind of attention and feeling into film. Half a generation more?\nI'm beginning to understand the internet, ratings, and what they mean about who we are. They point, just not in the right way.","user":"maniort","rank":[22,24]},{"title":"Superb performances with limited material","rating":6,"date":"3 September 2019","review":"Timothy spall in particular was fantastic as in fairness he always is in portraying the raw emotion of his character through with Redgrave not far off. In honesty I enjoyed this film but could not get over excited about it as it is ultimately a series of often mundane bedroom conversations between a bitter mother and loving son. The fact it kept my attention in this setting was an achievement in itself. I would personally have liked to seen more focus on the art itself in between or a larger portion of his life but for what it was the performances really maximised it's entertainment level and make it a worthwhile and interesting hour and a half despite its limitations.","user":"muamba_eats_toast","rank":[15,16]}]