[{"title":"NO REFUNDS!","rating":1,"date":"26 February 2018","review":"I feel like no one has the heart to down such a low budget movie .One: No one has watched it other than their friends and family. And, there really isn't another reason. No one watches these unless they're making fun of them (if you can watch them, that is .Their blurays don't work and their DVDs are 15$. Laughable.)\nThe cinematography is terrible .If you're using a Black Magic, it should not look like you're using an Android phone. It's grainy and not in an \"aesthetic\" way. \nThe acting is atrocious in a high school play kind of bad. The protagonist/director has no self-awareness whatsoever. I mean, it is pretty obvious the only review for this movie is from someome highly involved with the film, if not the creator himself.\nI predicted the story from the first ten minutes and my god, the werewolf. I get it. Low budget. Terrible story. Laughable acting .And cinematography so bad, it's upsetting.\n1/10. Just don't .","user":"verynicebones","rank":[21,34]},{"title":"The usual garbage","rating":1,"date":"30 May 2018","review":"Now dont' get me wrong, I love low budget films but I only love them when they try.\nThis \"film\" was just painful to watch, the acting was wooden, you could tell several of the cast were reading from a script just off screen.\nThe writing was atrocious, like Asylum movies bad - This could have been good but it felt beyond lazy.\nI would have given this tripe 2 stars but all the fake reviews on here from cast and crew soured me on that and I feel I have to give it the one star it deserves - one to avoid.","user":"spikephoenix","rank":[7,11]},{"title":"Congratulations!","rating":8,"date":"5 July 2018","review":"This film was pretty great! I don't have many complaints at all with this project. I decided to watch it after seeing a couple of reviews online that were saying this movie was a good movie and the others said it was terrible, so I had to watch it for myself and see. I think it could've been a tad bit better, but it had charm, which I wasn't expecting. \nSo love it or hate it:\nThis film seems to be getting popular because of the completely opposite reviews thats going back and forth.\nNight Howl for the win!","user":"jessicawashere-59560","rank":[4,8]}]