[{"title":"TV MOVIE VERY NICE","rating":8,"date":"25 January 2019","review":"Well i enjoy it for a tv movie so relax enjoy the ride and don ' t think too much\nit was good entertainment","user":"bouhanamarc","rank":[5,7]},{"title":"SHAME ON YOU LIFETIME! STOP KILLING ANIMALS FOR PLOT DEVICES!","rating":5,"date":"30 June 2019","review":"I am SO SICK of Lifetime using the killing of pets as plot devices. How many times do we need to see a defenseless dog or cat be murdered, so you can show someone is a nutter? It's repetitive NONSENSE, that's UNNECESSARY &amp; PREDICTABLE!\nHere's a clue, have an animal save the day, be a great companion, offer comfort, etc. and NOT get killed. Get some new material Lifetime, preferably that doesn't encourage animal cruelty.","user":"vnssyndrome89","rank":[7,12]},{"title":"Not flawless, but surprisingly good","rating":7,"date":"23 August 2019","review":"I found this movie by accident, and was very pleasantly surprised with what I'd stumbled upon. The movie was very well shot, and definitely drew you in to it's story. The acting and line delivery, while spotty in some areas, was convincing for the most part and what slightly off lines existed added to the realism of the movie rather than detracted from it. The only criticism I would add to the dialogue is at the beginning and the final scene, where exposition is delivered pretty baldly, and pulls you out of the moment a bit.<br><br>The plot, while definitely flawed in some areas, definitely has a realistic feel to it, aided by the good emoting by the two leads. While one might take different actions in real life, the general feeling the characters have can easily be empathized with by the viewer.<br><br>The pacing of the film would be my biggest criticism of the movie. It's meant to be a slow burn, and while it manages to keep the viewer engaged for the most part, the 90 minute film definitely feels a lot longer than it should be in some spots.<br><br>Overall, while not perfect, it's definitely a hidden gem that is worth the time to watch for yourself!","user":"spencerprice-95631","rank":[1,1]}]