[{"title":"I was expecting the wrong thing","rating":6,"date":"21 February 2020","review":"This is a great family movie. It has all the aspects of what makes kids smile. However, this is not the adaption of Jack London's book that I was looking for. In my opinion, in searching for that feel good vibe, it lost the character that defined the original story. Everything was made PG and the raw unforgiving reality of the book was lost in translation. Additionally, the CGI was good, but over used to the nth degree. Its worth a watch, just keep in mind that this movie is a rather loose adaptation.","user":"dylanhorne-76909","rank":[148,200]},{"title":"A classic novel well-altered... especially for the younger ones","rating":8,"date":"23 February 2020","review":"Before writing anything about the film itself let it be noted following.<br><br>(1) Screenplays are usually related to source materials (works of fiction or documentary depictions of factual events and experiences) with the phrase *based on*, which is mostly read as *copied from* (whether a fictitious depiction or reality) although fully faithful account of events and their protagonists almost never happens, so, in all fairness, it might be safer to understand such relation simply as *altered from*.<br><br>(2) Furthermore, CGI has erased strict distinction between live action and animation, introducing a new method and a whole new form of cinematography by blending realistic imagery and kinematics of existing animals (and other fantastic beasts) with anthropomorphic expressions and gestures given to their stylized representation in the world of animation, a trend probably started in 1970's by ILM servicing Star Wars saga, getting (over)exploited in recent followers of the kind, most notably Disney's The Lion King (2019).<br><br>That having been said, in the latest take on Jack London's classic novel, screenwriter Michael Green and director Chris Sanders--apparently intentionally not bound by faithfulness to the original text, particularly avoiding its darker overtones, certainly counting with receptiveness from the audience, especially from those (among us) who have read the novel--have succeeded in meeting a great deal of expectations from the film seeking to be labeled with family entertainment attribute.<br><br>The Call of the Wild is the story of Buck (as main human character, John Thornton, described it), a dog like no other, he'd been spoiled, and he'd suffered, but he could not be broken... Buck's life gets turned upside down during the gold rush of the 1890s, when he was suddenly banished from his home in California and moved, first to Yukon, and then deep into the heart of Alaska, reaching Arctic Circle. *As a newcomer to the dog team delivery service - soon their leader - Buck is having adventure of a lifetime, finally finding his rightful place in the world and becoming the master of his own destiny.*<br><br>By smoothening London's honest account and description of--pursuant to extreme conditions easily understandable--truly violent interaction between people, animals and nature, primarily by minimizing cruel dog beatings at the hands of their masters and brutal, often fatal dog fights, film makers have altered such survival seeking Darwinian world, in which dog eats dog and a man is (often) a wolf to another man, by promoting rather-friends-then-foes approach towards strangers, and, whenever possible, insisting rather on gentleness than harshness of the great wild outdoors, overhauling the classic story to an easier digestible, ergo family friendlier.<br><br>Other qualities include good acting, with Harrison Ford as a stand-out, whose husky calm voice offers narration throughout the film, providing vulnerable yet soothing, almost comforting presence in his appearance as John Thornton, seemingly a gold prospector, but in fact, after losing his loved ones, a son to a deadly fever, and a wife to subsequent collapse of his marriage, no more than a grief-stricken redemption seeker. Also, in the first half of the movie, as a far north delivery service running couple, Omar Sy and Cara Gee are joy to watch in their often, despite all difficulties, comic relief providing roles.<br><br>Film demonstrates commendable seamless integration of CG imagery of beasts and beautiful environments into spectacular cinematography provided by Janusz Kaminski.<br><br>Joyful music, scored by John Powell, is well-paced to follow the speed of onscreen action and reflect the highs and lows in the moods of characters.<br><br>All in all, it is nicely crafted film with the fast-paced story, providing enough dramatic excitement and fun, especially for the younger ones.<br><br>My rating score stops short of perfect, due to a trend described in my second opening note that I cannot easily fall in with, too.<br><br>Finally, on a lighter note, having film menagerie of animals fully CGI-ed renders monitors from American Humane Association superfluous, as even in their absence we can rest assured that *no (real) animals were harmed during the making of this film.*","user":"Davor_Blazevic_1959","rank":[88,142]},{"title":"Maybe it should have been called \"Call of the Mild\" or \"That Darn Buck!\"","rating":5,"date":"21 February 2020","review":"Very, very loosely based on one of the great adventures of literature, this movie frequently plays more like a 1970s Disney film. While I think it's awesome, using a CGI dog to put him and the others through the harsh action scenes, did they have to make him look so cartoonish in the more personal scenes? A dog's reactions should be that of a dog, not a human. About half of the names in the cast are in blink and you'll miss it cameos, and the film only really comes to life when the focus narrows down to Ford and Buck, getting in touch with nature. It's only the last half hour or so, with them, that keeps me from giving this an even lower score.","user":"iboso64","rank":[119,203]}]