[{"title":"A tale about two narcissists","rating":6,"date":"4 December 2017","review":"I have to admit, the movie was quite entertaining. But after I was done watching it I realized that this wasn't really a documentary at all. The genre classification for this movie is more of a decoy since the majority of the movie focuses on hearsay and Talese's career. So to claim that this is a documentary is a little bit far fetched.<br><br>At the end of the day there isn't much meat to this story. It's about a guy who used to perv on his customers/guests. That's it. The entire story was divulged in the first 15 minutes. From there the \"documentary\" took a sharp turn. Focusing mostly on Foos' private life and Talese's past achievements. In my humble opinion the sole intent of this movie is to normalize the kinks of Foos and Talese. They're both questionable characters. And throughout the movie they tried to justify the \"immoral\" choices that they've made by assuming the role of apologists. Foos wants us to believe that he's a pioneer of some sort. Meanwhile Talese's exploiting the documentary to tell us more about his all so illustrious career. <br><br>The way I see it both are narcissists who found each other because they're wired the same way. For reference: Talese's home is decorated with a deluge of life-sized photos of himself. I think that says it all. <br><br>Foos' motivation for the documentary was to spread the word about his upcoming book. For him it was nothing more than a PR stunt. This is the only noteworthy thing he has ever achieved in his life (which is probably the realization that he himself made at some point, hence the resilience). And the reason why Talese was so interested in this documentary/story was because he's been invested in it for almost 40 years now. He saw this as a the perfect opportunity to end his career with a big bang/story. As we later find out both got more than they bargained for. Some might say it's kismet.","user":"antoniokowatsch","rank":[58,64]},{"title":"watching and watched","rating":6,"date":"30 November 2017","review":"Greetings again from the darkness. We are watching the final product of filmmakers watching a reporter watching a man whose hobby is watching those who don't know they are being watched. Lacking a single redeeming individual, the film's creep factor slithers towards 11 on the (SPINAL TAP) scale. <br><br>It's understandable if you assume this is the story of a pathetic and disgusting Aurora, Colorado motel owner who, for many years, quietly leered at his guests from a self-constructed perch in the attic. Gerald Foos methodically documented the sexual actions of the Manor House Motel guests, which numbered 2000-3000 per year. If his actions aren't remarkable (not in a good way) enough, Mr. Foos actually married not one, but two women who were complicit in his hobby.<br><br>In 1980, renowned reporter and author (\"from age 15 to 80\") Gay Talese received a letter from Gerald Foos, kicking off a three decade relationship culminating in a controversial feature article in \"The New Yorker\" and a book entitled \"The Voyeur's Motel\". Once Mr. Foos agrees to have his name published, co-directors Myles Kane and Josh Koury jump on board to document the final steps in Mr. Talese's writing and research process. It's here that we enter the oddest man cave you'll likely see. In the basement of Talese's immaculate Manhattan brownstone is not just his writing office, but also a lifetime of research and writing  boxes and shelves of material that will surely one day be part of a museum or university collection. <br><br>The unexpected parallels between writer and subject are made clear. Both are voyeurs and both are collectors. As a journalist, Talese observes the actions of people, while Foos is quite obviously the definition of a Peeping Tom. Talese collects the years of research for his writings, while Foos shows off his extraordinary sports memorabilia collection (also in his basement). Beyond these similarities, what stands out most are the unbridled egos of these two men. Both seemed most focused on getting or keeping their names and stories in the headlines. Of course, Talese has built a career on his name and reputation, while the aging Foos simply sees this as his legacy that somehow deserves historical prominence.<br><br>The filmmakers remain more focused on Talese than Foos, and that takes us inside \"The New Yorker\" where the editors are justifiably concerned about a single-source story – one that without Talese's name attached would likely have never made it past an initial perusal. The aftermath of publication reminds us that we've seen con men before, and there is little joy in being taken on a long ride of deceit. Perhaps the best description of what we see on screen is that it's a sideshow of ego and the need to be seen (watched).","user":"ferguson-6","rank":[27,33]},{"title":"Shaky Execution Saved By Intriguing Concept","rating":8,"date":"11 December 2017","review":"Upon seeing that the documentary story of Gerald Foos was coming to Netflix, I could hardly believe it. When I read the source material book \"The Voyeur's Motel\", I thought I was maybe the only actual person to have read it (I now understand why...watch the doc to find out). Much like the book, this documentary adaptation is often a bit of a mess...but it also stumbles upon such an interesting scenario/person that it is riveting for all the right (and often very wrong) reasons all the way through.<br><br>For a basic plot summary, \"Voyeur\" recounts the story of Gerald Foos, a motel owner who spied, peeping Tom-style, on his guests for many years via a crawlspace above the rooms. Eventually, Foos began corresponding with journalist Gay Talese and the two formed a sort of \"pact of secrecy\", as Foos wanted the attention/outlet and Talese knew he was on to a story. But then, a murder takes place and culpability issues abound, and Talese even discovers that Foos may not have been 100% truthful in many of his claims/statements.<br><br>The \"star of this show\", so to speak, is easily Foos. He's such a polarizing figure that he will captivate your attention. On one hand, he seems to be a terrible human being. On the other hand, there is a \"psychology fascination\" with what he is doing (it initially started all about \"watching for sex\", but then became as much a classification of private behavior as anything). The key here, of course, is to not be turned off by the snap judgment of \"this guy is a perverted creep\", because there is absolutely no doubting that. But the scale of what he accomplished/observed is fascinating for those who are able to open their minds a bit and give the story a chance to play out.<br><br>Sadly, this entire concept (from Foos' letters to Talese, to the book, to this doc) has been basically botched from beginning to end. There is no way to verify any of Foos' claims (besides the fact that indeed the crawlspace was confirmed by one visit from Talese to Foos), Talese actually disavowed his book at one point, and this doc is kind of all over the place too. It's messy all over the place.<br><br>What carries the day and made this so fascinating to me, though, was a look into the psyche of Foos. In a lot of ways, seeing him in front of a camera makes this whole thing \"work\" a lot more than it did on the printed page. I really think, though, that one's enjoyment of this documentary will be determined by whether morals can be set aside for a bit. What Foos did was reprehensible, but at the same time fascinating (from a purely psychological and logistical perspective). If you can wait and pass judgment on him at the end, you will enjoy \"Voyeur\". If not, it's probably best you steer clear.","user":"zkonedog","rank":[14,16]}]