[{"title":"Louis & Luca: Mission to the Moon is really good!","rating":8,"date":"21 September 2018","review":"I have always been a big fan of Flåklypa Grand Prix (English title: The Pinchcliffe Grand Prix) by Ivo Caprino from 1975 and I still think it is the best Norwegian film of all time. When Qvisten Animation wanted to make new films back in 2013, I was really skeptical. <br><br>Firstly, I thought that sinse The Pinchcliffe Grand Prix is one of the most watched films in Norway in Norwegian history of film, Qvisten only wanted to make a cash grab just because The Pinchcliffe Grand Prix is so beloved. Secondly, I thought the characters of Solan and Ludvig (English names: Louis &amp; Luca) looked way different than the ones in Caprinos film. But then I looked at how the author of the Flåklypa universe, Kjell Aukrust, had drawn the characters. I suddenly realised that Qvisten tried to stay as close to how Aukrust had imagined them look like. <br><br>When I saw the first two films I was pleasently suppriesed and liked them a lot. I didn't think neither Solan og Ludvig - Jul i Flåklypa (English title: Louis &amp; Luca and the Snow Machine) which is the first film, or Solan og Ludvig: Herfra til Flåklypa (Louis &amp; Luca: The Big Cheese Race), the second film, came close to Flåklypa Grand Prix quality. But I thought they were good animation films and quite entertaining.<br><br>Then I went to the premiere of the third film Solan og Ludvig - Månelyst i Flåklypa (English title: Louis &amp; Luca: Moonlight in Flåklypa (I will call it that instead of the other English title: Mission to the Moon)), which is the final Qvisten Animation film about Flåklypa. Moonlight in Flåklypa is an adventurous experience and the best of the three films directed by Rasmus A. Sivertsen in my opinion.<br><br>We meet our famous characters in Flåklypa at the workshop at Reodor Felgen. The UN has decided that no one owns the moon. Therefore the country that plants his flag first gets ownership of it. All the great powers take on the race such as America and Russia. In Norway Reodor Felgen takes responsibility and builds a spaceship funded by the Norwegian state inspired by Gro Harlem Brundtland government of Norway back in the 1980s. At all the movie is full of references. Many of them children probably won't understand but it makes the movie equally as fun for adults as for children.<br><br>Reodor Felgen's prototype of a spacecraft is struggling with some flaws but by the good financial support of the state, represented by bureaucrat Vigfus Skonken, the funding is secured for this ruthless space adventure. The project does not make Ludvig less nervous. Even Solan have some doubt that the spaceship can fly to the moon. They also get moral support from Mayor, Countess Stengelføhn-Glad. The character Stengelføhn-Glad is probably the only thing I didn't like about this film. I thought she was an annoying new character.<br><br>And I have to talk a little bit about the humour in the film. I find in many animation movies they exaggerate the humour and make situations with characters just for laughs. But here I found the situations to make sense. They were both funny and they make sense for me.<br><br>The film is a fantastic space adventure by an original script based on Kjell Aukrust universe. Much of it goes to scriptwriter Karsten Fullu who has renewed it all, but at the same time is faithful to Aukrust. The story reminded me of The Pinchcliffe Grand Prix. In addition, it offers full references from media celebrities to Stanley Kubricks film 2001: A Space Odyssey. <br><br>I also thought the music in the film was really great. Some of the music reminded me of Christopher Nolans film Interstellar were they use organ music which is quite beautiful.<br><br>As in the previous two films, Moonlight in Flåklypa is also made using stop-motion animation. It is an expensive and time consuming way to make animated films. On the other hand, the result is much better than if they used CGI animation. Visually the movie is impressive. In particular the space scenes in the film.<br><br>Moonlight in Flåklypa is an exceptionally great film with both new and old characters. The film is a full of humour and can be enjoyed by both children and adults. I think probably Norwegians will like the film best because there are many references that you probably need to be from Norway to understand. But I also think people outside of Norway can enjoy the film. And lastly all of the Flåklypa films have the theme of friendship which is why I like the films so much. As I said before this is the third and last film in the trilogy of Flåklypa by Qvisten Animation. The series ends at the top.","user":"TheHappyLemming","rank":[11,13]},{"title":"Great, and has a backstory","rating":10,"date":"22 September 2018","review":"Ivo Caprino was very into space a child, and this is a reason to why the production team based this movie around the moon.\nDespite this, the movie was great, it was funny, heartwarming, and felt great to watch, everything that a movie should have. I would recommend that you watch this movie!","user":"pricklybotdiscord","rank":[7,9]}]