[{"title":"Here, there, everywhere","rating":5,"date":"29 January 2019","review":"Johanna Stanton goes to The Club and meets a couple whom she leaves with. The next thing she knows, she is to awaken in a room in which time does not seem to exist judging from the clocks on the wall. Here she meets various people including her captures who rape her. She has no memory of who she is or events and struggles to put the pieces together in a surreal room with \"No Exit.\"<br><br>The film seemed like an artsy Sartre theater with large plastic props. The initial captive idea grew old at about 40 minutes as the script struggled to stay fresh even with the trickle of new details.<br><br>Guide: F-word, sex, rape, nudity.","user":"nogodnomasters","rank":[4,4]},{"title":"Something different and pretty interesting","rating":7,"date":"8 December 2019","review":"Anyone who gives this less than 5 and all you idiots blasting this film... really? I doubt if you have a brain cell between you. This is no big budget hollywood horror. If that's all you watch this isn't for you. But what it IS is a well written and well acted piece of art that has an above average director at its helm. To make an engaging film set in just one room is hard enough in itself but to draw good actors into the mix on a very very very small budget is even more of a talent. The subject matter is very fetishistic, playing with themes of bondage and S+M a bit too much for it not to obviously be the directors own fantasy come to life. That said it is intriguing and entertaining enough to keep you watching for 90mins to see the outcome. Just don't watch it with your mum. Passing note to all the 1,2,3,4 star idiots, you have no Buisiness reviewing movies at all. Keep your views to FB.","user":"stevesky-39082","rank":[2,2]},{"title":"Doom room","rating":1,"date":"18 January 2019","review":"I wouldnt waste your time watching this...i tried to give it s chance bug had to switch it off...pure rubbish in my opinion","user":"dibarnes-98855","rank":[11,25]}]