[{"title":"Very Difficult Movie to Grade.","rating":6,"date":"23 September 2019","review":"On one level this movie is a success. It's an engaging, non-commercial Sci-fi film that is well acted, directed and produced. It held my attention and made me want to find out the fate of the ship and crew.<br><br>I knew nothing of the poem. I knew nothing other than what the trailer contained. It is incredibly difficult to adapt a poem which is tied more than any other literary form to the word, into a mostly visual medium. Since the screenwriter seemed to jettison the words of the poem what we are left with is an outline. That's where some problems begin. The poem was written in 1956, when space travel hadn't even started. So, it's pretty lame when a space ship the size of the Aniara doesn't have redundant power and a number of backup plans for when/if things go wrong. But hey, we're already in outer space, disbelief is suspended, so, shut the hell up. There's a bunch character driven scenes but none of character ever develop. The really all stay the same no matter what they've been through. Also Instead of a fully developed story we get inundated with a series of let downs which really come off as more of a drag than tragic. I mean would it really be that bad to be traveling through space? The filmmakers certainly seem sure it is. There's some poignant moments throughout, to be sure. The problem is it's all for a movie that just peters out. What may have had great resonance on the page doesn't make it through the translation to screen.<br><br>I think if they had stronger conclusion to what happens to the main character at the end the movie would've worked better. That way the ultimate ending would've become a post script. That didn't happen, so we're left with a movie that just stops on some sort of note about 'the vastness of space'.<br><br>All this makes 'Aniara' unsatisfying even though it's well done on many levels.","user":"jburtonprod-802-759029","rank":[50,61]},{"title":"The poem is a masterpiece of esoteric science-fiction literature; and this is an unexpectedly impressive adaptation with a chilling dénouement","rating":8,"date":"19 September 2019","review":"The transitory nature of human existence, especially when set against the infinity of space and time, has been the inspiration for countless science-fiction narratives. A theme which has only become more relevant as the years go by and we find ourselves in the midst of an increasingly certain man-made extinction event, a fine example is <a href=\"/name/nm0554167/\">Harry Martinson</a>'s poem, Aniara: en revy om människan i tid och rum [trans. Aniara: fragments of time and space] (1956), which is about the crippling contemplation of meaninglessness that consumes the passengers of a vast spaceship (the eponymous Aniara) set adrift in the void of space. An adaptation of the poem, this exceptionally well made film is the debut feature from writers/directors <a href=\"/name/nm2445423/\">Pella Kagerman</a> and <a href=\"/name/nm4420245/\">Hugo Lilja</a>, and is in the tradition of such esoteric texts as <a href=\"/title/tt0062622/\">2001: A Space Odyssey (1968)</a>, <a href=\"/title/tt0069293/\">Solyaris (1972)</a>, <a href=\"/title/tt0448134/\">Sunshine (2007)</a>, and <a href=\"/title/tt4827558/\">High Life (2018)</a>. And yes, the characters are a little underdeveloped, with only a couple getting much of an arc, and yes, the science isn't exactly kosher, but irrespective of that, this is a provocative, morally complex, and existentially challenging film that I thoroughly enjoyed.<br><br>Set at an unspecified point in the future, Earth has reached a point of irreversible decay, and humanity is making a new home on Mars. The Aniara is a massive vessel that takes passengers on the three-week trip from a lunar docking station to the red planet. As the film begins, we meet the unnamed protagonist (<a href=\"/name/nm3130490/\">Emelie Garbers</a>). An employee on the Aniara, she is in charge of MIMA, (hence her job as a Mimarobe, or MR for short), a semi-sentient holodeck-like technology, that can scan people's thoughts, and allow them to experience whatever is best suited for their psyche (for example, we see MR exploring a vibrant forest). A week into the voyage, however, Captain Chefone (<a href=\"/name/nm4523758/\">Arvin Kananian</a>) is forced to jettison the vessel's nuclear core to avoid catastrophy after a minor collision with space debris. However, the ship is now off-course, and without the core, the crew have no way of turning her around, leaving them drifting into the darkness of space. And so, as months turn into years, with no hope of rescue, and as people find themselves unable to face reality, MIMA becomes essential for their mental well-being. However, MIMA wasn't designed to be exposed to so many negative emotions for such a prolonged time, and soon she starts to show signs of failing.<br><br>As mentioned, Aniara was written in 1956 by Swedish Nobel laureate Harry Martinson (the title is derived from the Ancient Greek word meaning \"despairing\"). The poem is more allegorical than the film, and was written, at least in part, as a reaction to the bombing of Hiroshima and Nagasaki, the developing Cold War, Walter Baade's doubling of the estimated distance from the Milky Way to Andromeda in 1953, and Soviet suppression of the 1956 Hungarian revolution. The film is divided into nine chapters, which mark the passage of time. So, for example, the first three chapters are \"Hour 1: Routine Voyage\", \"Week 3: Without a Map\" and \"Year 3: The Yurg\". The titles of some of the later chapters contain pseudo-spoilers, so I won't mention them here, but when the title of the last chapter appeared on screen, I was so sure I'd misread it that I had to ask my friend for confirmation. Turned out I'd read it just fine; this last title contains all the existential dread and mind-bending contemplation of infinity that you could ever want. And it's an absolutely haunting way to end the film.<br><br>Much as is the case with the poem, the film looks at issues such as the possibility that we have already irreparably damaged the planet, the impermanence of human existence, and the sense of meaninglessness that can result when mankind is faced with the eternity of time and space. In relation to this, the film spends a good deal of time on the idea that human civilisation is essentially a construct that we use to shield us from the bleak reality that we are utterly insignificant, and when that construct is removed, we revert to barbarism. So, basically your typical multiplex stuff. The passengers on the Aniara become increasingly unable to stave off the encroaching malaise born from the hopelessness of their situation and the meaninglessness of their existence, and one of the most important lines in the film is when MR is told \"everything we do is peripheral\". Uplifting stuff.<br><br>One of the film's most interesting themes concerns MIMA, which is depicted as half-mind control, half-narcotic. As she becomes more important post-collision, it doesn't take long for people to become dependent on her, with large queues forming, and people at the back trying to bribe MR to get in early. Then, when MR hires another employee, she explains that she'll need to \"teach them to resist the images\", recalling the way people who work in pharmaceutical factories are randomly drug-tested. That's the narcotic element. At the same time, when a passenger proves unable to handle reality and becomes violent, he is forced to experience MIMA against his will and is rendered unconscious. That's the mind-control element. However, MIMA is also semi-sentient, and she soon proves reluctant to continue processing the never-ending onrush of negative emotions, with the passengers' sense of pointlessness and despair becoming overwhelming, to the point that she tells MR, in a surprisingly moving scene, \"I want peace\". HAL 9000 she is not; he'd have been able to suck it up.<br><br>Another theme, of course, is mankind's destruction of Earth. Whereas once, science fiction narratives focused on nuclear warfare as humanity's probable extinction event, in recent times, global warming and ecological disaster have become far more pervasive. Indeed, Martinson himself was something of a pioneer in this field, positing that we were destroying the planet long before climate change had entered the zeitgeist. In relation to this, the possibility that we may colonise other worlds is now seen not as something to facilitate exploration, but to facilitate survival. Of course, this is rendered all the more terrifying because it's not something only found in the realm of fiction - the planet is dying. But when you have a US president who ignores the scientific evidence of his own people, routinely rolls back environmental protections, and continually confuses weather and climate, the possibility of our changing course seems remote, just like the Aniara. This theme is never examined explicitly - we never learn the year in which the film is set, whether or not Earth has already died and is entirely uninhabitable or is simply on the way, nor what exactly it was that sent us into the cosmos - but it's touched on obliquely throughout and is a good example of how the film subtly engages with themes without necessarily foregrounding them.<br><br>Moving away from thematic concerns, the film's aesthetic is absolutely gorgeous. Made with a relatively small budget, the CGI is basic but highly effective. For the Aniara interiors, rather than building elaborate original sets, much of the film was shot in shopping malls and on ferries, which makes sense, as the Aniara is essentially a giant shopping mall/hotel, not unlike a luxury cruise ship. For the sets that were built from scratch, they are matched seamlessly to the location work, with the sleek minimalist post-modern (one might even say Ikea-like) style of <a href=\"/name/nm3410818/\">Linnéa Pettersson</a> and <a href=\"/name/nm6765952/\">Maja-Stina Åsberg</a>'s production design working well to suggest rigid functionality.<br><br>In terms of problems, perhaps the most significant is the lack of character arcs (although this is also true of the poem). This is felt most in the lack of disparate viewpoints on the Aniara where it would have been interesting to meet characters with distinct beliefs, backgrounds, and denominations (although, having said that, the poem has no such characters). Does this leave the viewer with little with which to engage and no characters with whom to empathise? Yes, to a certain extent it does, but this is by design; the film isn't asking us to fall in love with a cast of well-rounded characters, it's asking us to engage with it at an esoteric level.<br><br>I will concede, however, that the science has some issues. Why, for example, would a ship the size of the Aniara be used as a short-distance transport vessel? It's mentioned several times that she wasn't built for long-term habitation, but if so, why are there so many amenities on board, why is the life-support system self-regulating, why are the algae farms designed to produce food indefinitely? And the practical nature of her size (4,750 meters long and 891 meters wide) throws up its own problems. Mars is (on average) 140 million miles from Earth, so for the Aniara to complete the journey in three weeks, she would need to travel at an average velocity of 277,777 miles per hour. Newton's second law of motion states that \"force equals mass times acceleration\"; in short, the greater the mass and the greater the speed, the more force it takes to slow down, and the power needed to slow something this big moving at such a speed is virtually unfathomable.<br><br>Nevertheless, the surrounding film is so accomplished, I can easily forgive the scientific inconsistencies. As aesthetically impressive as it is morally complex, as esoterically fascinating as it is unrelentingly despairing, this is a hugely impressive debut film. Equal parts haunting and provocative, the picture it paints of a humanity faced with its own extinction isn't a pretty one, but it is an urgent one, as we hurtle towards our own extinction, rapidly approaching the point where, like the Aniara, we will no longer have the capacity to turn around. And when we reach that point, our collective future will consist of nothing but the indifferent darkness and deafening silence of the infinite.","user":"Bertaut","rank":[71,90]},{"title":"Spaceship Accelerating to Mars; Human Nature takes Control","rating":8,"date":"22 September 2018","review":"\"There is protection against almost everything, against fire and damage through storm and cold, but there is no protection against humanity,\" said Nobel Prize winner Harry Martinson, upon whose poem this film is based. On a spaceship accelerating to Mars from the ruined earth, people shop, eat and - with the help of virtual reality - dream as they always have done. When the ship veers off course, crew leaders try to keep the passengers from learning the truth. Power struggles ensue, fantasies and fears displace reality, and the ship starts to resemble (gasp!) a mini city on earth. Caught in the middle of the chaos and the factions is a cheerful woman who tries to make the best of the unfortunate circumstances. If only her companions would let her. <br><br>Poignant and relevant to contemporary culture, directors Kagerman and Lilja adapt the poem remarkably well to the screen. The film is wonderful for what it says about human nature. The salient moral is that technology is not fail safe, and only as good as the powers who wield it. The film is hampered by a skimpy budget, shaky camera work and bad transitions, but overall the acting is believable, and it is a fascinating glimpse at the human talent for avoiding reality, for better or worse, in whatever sphere we happen to occupy. World premiere seen at the 2018 Toronto International Film Festival.","user":"Raven-1969","rank":[78,106]}]