[{"title":"The (th)r(e)at is real, well sort of","rating":6,"date":"17 January 2019","review":"\"The Highway Rat\" is a British animated produced by and aired on BBC for the 2017 holidays, so this one is a bit over a year old now. The director is Jeroen Jaspaert and this is not his only work based on a book by Julia Donaldson. This collaboration does not result in the same awards recognition, especially at the Oscars, that Donaldson gets with the German filmmakers, but I think the two Jaspaert films are not worse by any means, maybe even better. This one is certainly less known than the other (\"Stick Man\") from two years earlier. I like both of them. But we will only talk about this one here. Rob Brydon and David Tennant are on board, known names in the UK, but I watched the German dub, so let me mention Herbert Knaup and Jürgen Vogel, also both well-known here and I think Vogel really impressed me here. Did not think he had such voice talent inside him lending his voice to the title character. Now for the story: We have a rat dressed up as Zorro here, but it is the bad guy as he keeps stealing all kidns of food from the people, even food he does not like such as leaves, nuts or clover. His horse appreciated the effort. At the end the rat ends up stuck in a big cave after being tricked by an elderly goose and that's where the rat realizes that being evil is not that amazing, especially without his beloved horse and transforms into a likable character. Also in the literal sense as he throws his robber clothes away. And gets some help by fireflies, also a statement that if you are nice, you get friendly support. Okay the transformation scene still felt a bit random, also how the rat ends in a bakery eventually, even if that reflects his hunger. But there are more than enough positive moments that make up for this underwhelming ending, like the really entertaining rabbit lady with her clover and she would have deserved her own film. The minor characters are all great fun I think. Sure you can wonder why the rat would be able to threaten woves and foxes and take their food from them, but yeah, it is not about realism and that is fine. Also this film is primarily aimed at younger audiences, or lets say families including younger audiences, as the stepping-on-ant scene shows where they made clearf immediately that nothing serious happened to the little ant. Or that the only moment when the rat is depicted really comewhat close to evil is the one during the transformation scene. When the rat commits these crimes earlier, we see it looking relatively harmless still. Overall, a pretty good watch. I also liked that the rhyming did not feel too forced here and there are even moments completely without rhymes. Who'd have guessed in a Donaldson movie. If you compare this, to the Gruffalo duology, you will see the difference. Speaking of Gruffalos, funny little bakery reference towards the end. \"The Highway Rat\" gets a thumbs-up from me. Not a great film, but certainly worth checking out, especially if you like animation. I also think the looks are fine here. A well-rounded effort. Go see it.","user":"Horst_In_Translation","rank":[1,1]},{"title":"Stop Motion Style for All Ages","rating":8,"date":"11 March 2019","review":"In the style of the old stop motion claymation animations we have the use of plasticine to build the main characters which are then digitized to produce the classic stop motion movement, and 3-D character style. Great texture, voicing, poetic dialogue &amp; music. On top of that it's a moralistic tale that stealing is not good. Some of the backgrounds were 3-D, but not all and the lack of naturalistic movement in the background kept it from a nine star.","user":"westsideschl","rank":[2,4]},{"title":"Rat on the run","rating":6,"date":"27 May 2018","review":"The BBC's Christmas animation treat is The Highway Rat. Julia Donaldson's buck toothed rodent on a horse whose life is one long feast. Younger folks will certainly like it as it follows on the footsteps of other Donaldson books that have been adapted for animation during the festive period.<br><br>With his sword The Highway Rat steals sweets, chocolates, cakes and pastries. 'Give me your sweets and your lollies! Give me your toffees and chews!'<br><br>Life is good for The Highway Rat, he even steals hay from his horse but the other animals in the forest are suffering and getting thinner as the rat gets fat.<br><br>This is another sweet animated tale narrated by Rob Brydon with David Tennant voicing the Highway Rat. It has an anti obesity message, eat in moderation.<br><br>The Highway Rat always seems to be disappointed that food that looks like confectionary turns out to be vegetables, fruits or nuts. Food that is actually good for you is a no-no but he still steals it.","user":"Prismark10","rank":[1,4]}]