[{"title":"The Empty Film","rating":6,"date":"25 December 2018","review":"The Empty Hands is a slow-paced film about an unlucky young woman who inherits the karate dojo of her deceased father that she needs to share with a former student who has just come out of prison.<br><br>The story features profound characters, the diversified story is filled wth promising ideas and the few fighting scenes are entertaining. The protagonist has lost her passion for karate after losing a fight in a tournament as a child, doesn't get along with her stubborn father before his death and has a complicated romantic relationship with a local radio celebrity who hides her from his wife and family. The student that inherits fifty-one percent of the karate dojo had ties with a crime syndicate but decided to beat his boss and two of its associates to pulp when they were planning on raping an innocent teenage girl which led to his prison sentence. When they inherit the dojo, their lifestyles, opinions and tempers clash. The former student wants to improve the dojo's reputation and save its legacy while the daughter wants to get rid of it and make it a real estate project. Since she only owns forty-nine percent of the dojo, she initially has to accept her partner's decision to continue to give karate classes but they soon make a deal: if the daughter accepts to take part in another tournament and manages to be still standing at the end of the fight, her partner is willing to retreat and give the entire property to her. The daughter accepts and the fight in the tournament is indeed the film's climax and highlight.<br><br>The biggest downside of the movie is its dull pace despite an already short running time. Static camera work, slow movements by the actresses and actors and repetitive settings try to give the film an arthouse style but end up dragging it down. The movie is sometimes advertised as an action film but it's actually a drama. The film sometimes doesn't live up to its potential as several story lines remain incomplete such as the fate of the radio celebrity. The movie only features two fighting sequences while an intriguing third one only happens off screen. The fate of a Japanese immigrant to Hongkong and later on China would have deserved a more complex story line as well.<br><br>The Empty Hands is worth to be watched if you are looking for a slow-paced drama with interesting characters. If you are intrigued by the context of a karate dojo or the fate of Japanese immigrants in China, you will find this movie boring. In the end, The Empty Hands has a quite unique style but almost as many downsides as positive elements. I don't regret watching it at all but wouldn't watch it again anytime soon.","user":"kluseba","rank":[0,0]},{"title":"Whats in the box?","rating":5,"date":"8 April 2018","review":"I've never liked art house all that much. For me its akin to taking more interest in the wrapping at the expense of whats actually in the box. <br><br>Personal introspective with a art house meets martial arts make over The Empty Hands reaffirms that reservation. Its a visually interesting film helped in in no small part, by a decent cast and story. <br><br>What muddies the waters is the obsessive use of visuals as the film draws to its conclusion. The result is a diffuse experience that leaves the viewer feeling like they have been handed a road map whilst standing in the middle of a desert. <br><br>Suffice to say, sometimes a picture is \"not\" worth a thousand words. 5/10 from me.","user":"s3276169","rank":[2,11]},{"title":"Review","rating":2,"date":"6 March 2018","review":"I would not recomend it at all. Abit slow. No much excitment.","user":"smfalhinai","rank":[2,14]}]