[{"title":"An Unshakeable, Unflinching & Unbiased Observation Of Salafi Jihadism","rating":25,"date":"25 February 2019","review":"An unbiased, unprejudiced &amp; unfiltered observation of jihadist life and how extremist ideology is passed down through generations, Of Fathers and Sons paints a brutally honest &amp; unflinching portrait of children being brainwashed into following the path of hatred &amp; violence by their own fathers, and it does so by capturing the everyday life of a radical Islamist family.<br><br>An undiluted portrayal of inherited Islamist fervour, the documentary achieves a rare first-hand access by thoroughly observing religious fundamentalism from up close &amp; with an uncompromising lens. Although it focuses on jihadist fanaticism in Syria, the mechanics of it can be applied to any extremist movement out there, for the cycle of hatred, prejudice &amp; violence always starts at home first before surfacing elsewhere.<br><br>As admirable as it is unshakeable, Of Fathers and Sons is essential viewing.","user":"CinemaClown","rank":[19,21]},{"title":"A Truly Enlightening Documentary","rating":7,"date":"15 March 2019","review":"Talal Derki's homeland is in disarray. He travels back to uncover the complex web Jihadists from ISIS and al-Nusra have spun in response to the enemies of God. Following the family of one minesweeper for the al-Nusra front, the film has a disturbing yet enlightening effect. This father passes his core fanatical beliefs onto his three sons. They are a tightly knit family, but the father's teachings play out in more consequential ways than he might have imagined.\nThe eldest son, Osama, named after the mastermind behind the 9/11 attacks, is particularly disruptive among his schoolmates. The two younger sons are fostered to think violence for the sake of violence is acceptable because God willed it so. It is very tragic to witness the path these boys are led down only to become part of a war machine that may never succeed against more technologically advanced world superpowers. I highly recommend watching this documentary if you want to take a much deeper look into the Global War on Terrorism and how Islamist extremists are cultured.","user":"unclesamsavage","rank":[9,10]},{"title":"Simply mind-blowing!","rating":9,"date":"29 January 2019","review":"I watched this film in the Pune International film Festival 2019 with a group of 16 students. And everyone was just blow away after watching it.<br><br>There are many reasons for it but the foremost reason is the sheer honesty with which it is made. The director Talal just put the facts in front of the audience without taking any sides. He has painstakingly lived with an ISIS supporter &amp; his family for two years and shown their life as it is. He is neither criticizing anyone nor praising anyone. And it leads us sympathizing with an ISIS supporter and their family. This sympathy doesn't mean we supporting ISIS &amp; it's supporters but instead we feel sorry for them.<br><br>The film presents the naked face of any extremist movement. But at the same time it shows the movements' supporter as normal human being who are as mortal as anyone else.<br><br>And to me that is the victory of this film.","user":"nimishgour","rank":[24,37]}]