[{"title":"Stupid Star Wars Rip-Off","rating":1,"date":"22 February 2020","review":"Wow, watching this film, this is basically an all-out rip off of Star Wars using cartoon animals. I mean, who thought this was a good idea? Basically, the movie is about an elephant, Nuke Tiptoes (which does not sound close to Luke Skywalker at all) hearing a voice in his head and pressing Enter to embrace his destiny (because kids' movies needs more references to The Matrix, a film the target audience won't be watching until they're older). Basically, this film caused me to lose a few brain cells trying to think about what this is. The character models are horrible, as B-52 looks like something out of someone's darkest nightmares, and the animal characters looking like generic animals. Also, the film relies too much on references to real life stuff, some which the target audience would not understand. Also, the character names sound horrible. I mean, what kind of a villain name is Boo Boo Squeal? This is one rip-off that is from the dark side.","user":"jeremycrimsonfox","rank":[0,0]},{"title":"What age is this aimed at???","rating":1,"date":"1 August 2019","review":"Thought it was a kids film but it's not.\nToo long dialogues for kids to follow and animation is really basic. Just a bunch of animals waffling whilst hitting a keyboard.\nAwful, even for an adult. Very unstimulating","user":"pickled_honey","rank":[0,0]},{"title":"Easily the best film this studio has made so far.","rating":4,"date":"13 February 2019","review":"Which, of course, is not saying anything much. The voice work is bad, the characters are ugly, and there's a lot of stolen assets; the antagonist is just Pip from Barnyarn cosplaying as Darth Vader.<br><br>That said, the creators have taken a step in the right direction by taking on a more ambitious project. By telling a story instead of going with the 'instant dance party' format they've been doing, there's actual writing and a narrative to follow. Not all that engaging of one, of course, but it got a few genuine laughs from me.","user":"cascadiarch","rank":[0,0]}]