[{"title":"Not too bad of a B-grade film, coming from a newb writer/director.","rating":8,"date":"13 July 2019","review":"This certainly isn't a film that everyone will be raving about, but hey, filmmakers have to start somewhere right? Considering that point, this film was no too bad to say the least.<br><br>This is newb filmmaker Matt Aselton's second writing credit, and third directing credit. Yes there were some flaws in the writing - plot issues and pacing, but the directing (camera work) was actually on point - aside from the few slo-mo scenes, and his inexperience in directing his cast was evident. Otherwise, mad respect for Matt Aselton's final result.<br><br>Theo James and Emily Ratajkowski worked well together, and their characters where somewhat convincing, but again, that (somewhat ) was from the lack of experience from the director. Fred Melamed was also decent in his slimy/creepy boss-man role as Dimitri.<br><br>I also feel the film could've been edited a little better, and perhaps down from the 100 min length, to about 85-90 mins, with faster pacing.<br><br>Nevertheless, for a low budget B-grade film from a newbie filmmaker, I still enjoyed it and was quite impressed with Aselton's third ever film.<br><br>It certainly is undeserving of the current low rating... people need to learn how to rate a film based on its merits, and not compare it to big budget Hollywood films with A-list cast and filmmakers. So it's a well deserving 7.5 rounded up to an 8/10 from me. Mad props for the producers to not fill IMDb with fake reviews, as most new low budget films have. And if anyone is questioning my review as being fake, click on my username to see my 600+ reviews and 1000+ ratings - and read my profile on how to properly rate a film.","user":"TheTopDawgCritic","rank":[40,66]},{"title":"Better than Expected; Could/Should Have Been Better","rating":5,"date":"15 July 2019","review":"I didn't expect anything from this and I found it watchable. The art thieving all came a little too easily. I liked the bad guy character, the tubby old guy. I've always liked him although I can't recall his name. Maybe it's better not knowing, tat way I always see him for the part he's playing--the mark of a truly good actor.<br><br>The story just sort of devolves into silliness and really doen't make much sense. His brother's character never really gets off the ground, but not from lack of trying...or screen time.<br><br>I like the whole idea of stealing from rich creeps, most of whom wouldn't know a true masterpiece from a child's painting.","user":"leftbanker-1","rank":[13,22]},{"title":"It's just awful","rating":1,"date":"16 July 2019","review":"Good actors and actress doesn't mean it gonna be a good movie.\nBoth lead cast Theo and Emily indeed beautiful but the story is disaster. Too many plot holes, unrelated scene. I'm literally hoping to be a great twist in the end not just flat but downlining.\nOkay the crime part was good but not special. Even the background story of everything about art in this movie can't safe it. Not giving me any shock moments. It stressing me out how can you make it so bad. You have a good premise about steal art stuff but yet miserably fail.\nDissatisfied.","user":"abdycook","rank":[19,39]}]