[{"title":"Powerful drama from Ireland","rating":8,"date":"13 February 2019","review":"I enjoyed this film so much. The acting was great, the cinematography was appropriately rough and off-kilter which matched the way this film grapples with perspective and memory. I really felt the story and it haunted me after viewing it. I had deep discussions about this film, because it tackles elements of emotional trauma, justice, mystery, family, and community. There is so much meat on this bone, so much to \"dig\" into. I highly recommend this film for the indie film lovers who want to see something special that reverberates in the mind for a while.<br><br>Saw this at TIFF where it received positive reviews. I will definitely seek this film out on DVD or digital release. 8/10 (not 10 only because at times the dialogue was unintelligible, but that might have been due to my American ears)","user":"coolcleangreen","rank":[9,12]},{"title":"Irish Masterpiece!","rating":10,"date":"20 August 2018","review":"This film did not fail to entertain me. When I left my seat I couldn't stop thinking about this film. Moe Dunford did an excellent job portraying intense realism. Writing was exceptionally good. Great concept.<br><br>Throughly enjoyed it. Recommend it to everyone.","user":"mcbrando-85768","rank":[15,24]},{"title":"Bleakly compelling, although the last act is weak","rating":8,"date":"11 May 2019","review":"Unfortunately released the same day as a little film called <a href=\"/title/tt4154796/\">Avengers: Endgame (2019)</a>, The Dig will most likely pass from Irish cinemas without much of an impact. And that's a real shame, as it's a fine film. Written by <a href=\"/name/nm3298957/\">Stuart Drennan</a>, and directed by <a href=\"/name/nm4002487/\">Andy Tohill</a> and <a href=\"/name/nm4633744/\">Ryan Tohill</a>, in their feature debut, the film is essentially a study of psychological breakdown, and the emotional damage that can be done by a self-appointed Sisyphean task which, by definition, can never be completed. Looking at the tendency in rural Ireland to anthropomorphise the Land, celebrating how it sustains and condemning how it betrays, the film probes the thin line between obsession and insanity, whilst also examining issues of memory, guilt, and the question of whether the guilty should be afforded an opportunity for atonement. It's bleak and oppressive (both in form and content), and doesn't feature a huge amount of (or any) laughs. Working extremely well for about three-quarters of its runtime, the script unfortunately comes undone in the last act, suddenly turning into a murder-mystery, complete with a ridiculous twist that belies the realistic minimalism employed thus far. Still though, it's beautifully shot, brilliantly acted, and very well directed, and, assuming you're finished jumping through time with Ant-Man, you could certainly do worse than checking it out.<br><br>The film begins as Ronan Callahan (the always intense <a href=\"/name/nm3974805/\">Moe Dunford</a>) returns to his hometown, having spent 15 years in jail for the murder of his girlfriend. Callahan was blind drunk the night of the murder, and remembers nothing of the incident, but as he was the last person with whom she was seen, and as her skin was found under his fingernails, he was convicted. Now tee-total, he's planning to sell his dilapidated farm and move on, but is stunned to learn that Sean McKenna (a superb <a href=\"/name/nm0186475/\">Lorcan Cranitch</a>), the dead girl's father, has spent literally every day of the last 15 years digging on the bog where her body is believed buried. Obsessed to the point of near madness, Sean refuses to stop - not for his still-living daughter, Roberta (a quietly despairing <a href=\"/name/nm3008893/\">Emily Taaffe</a>), who's seriously worried about his mental health; not for the local constable, Murphy (an intimidating <a href=\"/name/nm0535837/\">Francis Magee</a>), who has his own plans for Callahan; and certainly not for Callahan himself. However, still suffering from crippling guilt for a murder he can't remember, Callahan takes the unexpected decision to help Sean with the dig, much to both Roberta and Murphy's chagrin.<br><br>Much like recent Irish films such as <a href=\"/title/tt4399952/\">The Lodgers (2017)</a>, <a href=\"/title/tt6793280/\">The Devil's Doorway (2018)</a>, and <a href=\"/title/tt3208026/\">Black '47 (2018)</a>, The Dig works very much within genre parameters, but wherein the tropes of said genre are given a uniquely Irish thematic inflection. Whereas The Lodgers uses a haunted house story to examine issues of aristocratic legacy and the landed gentry, The Devil's Doorway uses demonic possession to explore the horrific history of the Magdalene Laundries, and Black '47 uses a revenge western as a way into the Great Famine, The Dig is essentially a Revisionist Western - it takes place primarily on a vast open bog; in the only bar in the one-horse town, whiskey is poured into shot glasses and drunk straight; local law enforcement is in the form of one formidable man, who does things his way, and even carries a gun in his belt; a local murderer returns, with the locals wanting to drive him out of town (and actually forming a posse to do so at one point); women are generally ignored, despite being far more grounded than any of the men. As in the aforementioned films, however, genre is used in The Dig not as an end in and of itself, but as a launching pad to other thematic concerns; an exploration of the importance of the Land, how time doesn't necessarily heal all wounds, and how extreme grief can drive a person to the brink of insanity.<br><br>The film opens with a sequence showing Callahan returning to the village, walking to his farm, which is now boarded up and derelict, examining the house and checking to see if the water is still working, before finding multiple bottles of alcohol secreted in various places, all of which he pours out. The scene is entirely wordless, and reminded me a little of the opening scene in <a href=\"/title/tt0469494/\">There Will Be Blood (2007)</a>. It's pure visual storytelling, and a great example of one of the most fundamental aspects of the filmic medium - show, don't tell - perfectly setting the bleak tone for what's to come, and giving us plenty of information about Callahan without the need for clunky exposition.<br><br>Aesthetically, the Tohills and cinematographer <a href=\"/name/nm0593128/\">Angus Mitchell</a> shoot the film as if clouded in a perpetually arid gloom. One of those films where you can feel the cold and damp through the screen, the palette avoids too many strong primary colours such as red or yellow, and is instead dominated by muted earth tones. The bleak wintery Waiting for Godot-style landscape through which Callahan walks in the opening scene is a bit on the nose as metaphors go, but it is effective in establishing the coldness and darkness in both his and Sean's hearts. For the scenes on the bog, from time to time, Mitchell uses high-elevation shots, showing us the sheer size of the bog in relation to the miniscule amount of land already dug up, really driving home the absolute impossibility of the task Sean has set himself. These shots also help to convey that although the characters are out in the open, the environment is their prison, much like the woods in <a href=\"/title/tt0185937/\">The Blair Witch Project (1999)</a> and the prairie in <a href=\"/title/tt8426594/\">The Wind (2018)</a>.<br><br>In terms of the acting, Cranitch plays Sean as contorted beyond recognition by grief, with not a hint of the man he must once have been anywhere to be found. Every ounce of his strength goes on the dig, which has become his only reason for living, and all that matters to him now is finding his daughter so he can give her a proper burial - in a nice unspoken irony running throughout the film, Sean needs to exhume her body so he can bury her. Dunford, for his part, is predictably intense, all silent brooding and beaten down anhedonic resignation.<br><br>Thematically, the film is at its best when examining grief, bereavement, obsession, and atonement. However, the importance of the Land remains thematically paramount at all times. Helping to establish the sense of a history and lineage, a fairy tree is featured throughout the film, whilst there is also a reference to the Old Croghan Man (Seanfhear Chruacháin), a remarkably well-preserved body dating from the Iron Age which was found in 2003, naturally mummified in a peat bog in Offaly. Another important historical reference is more subtle. Politics are noticeable by their absence, and although the film is set just across the border in Northern Ireland, there's not a single reference to the Troubles. However, anyone familiar with The Disappeared, sixteen people abducted, murdered, and secretly buried by the IRA between 1972 and 1985, will immediately see parallels with the plot. Specifically, the vast task before Sean recalls the plight of the family members of those who were disappeared, who for decades had no information whatsoever on where their loved ones had been buried (and in some cases, the bodies are yet to be located). All of this feeds into the general importance of the Land in rural Ireland, with the characters attributing to it a sentience recalling some of the Bull McCabe's proclamations in <a href=\"/name/nm0006487/\">Jim Sheridan</a>'s filmic adaptation of <a href=\"/title/tt0099566/\">The Field (1990)</a>. The Land as depicted in The Dig, however, is far from benevolent, with the sense being that if Sean's daughter is never to be found, it's because the Land has consciously made the decision not to reveal her. As Sean himself states, \"the land decides\".<br><br>However, there is a sizable problem with the film. For much of its runtime, the narrative is taut, the characters believable, the milieu oppressive. However, in the last act, the movie rather inexplicably turns a murder-mystery, with a plot twist that undermines the gravity of what has gone before. I've no idea what Drennan or the Tohills were trying to say with this, and although the actors act the hell out of it (particularly Dunford and Magee), they simply can't overcome the silly \"dun-dun-duuuun\" nature of the twist. The entire last act is also predicated on classically misogynistic male ideas about the desires of women. After so much hard-hitting realism and almost tangible existential suffering, the dénouement is rote and contrived, more akin to an episode of <a href=\"/title/tt0118401/\">Midsomer Murders (1997)</a> or <a href=\"/title/tt2396135/\">Shetland (2013)</a>, and seriously undermining the emotional build-up which has heretofore been very well handled.<br><br>That said, this is still a very impressive first feature, and another fine Irish film, coming in the wake of such strong recent work as <a href=\"/title/tt5225428/\">Kissing Candice (2017)</a>, the aforementioned Black '47, and <a href=\"/title/tt8247470/\">Rosie (2018)</a>. Equal parts bleak and oppressive, it remains mostly compelling, with a quartet of excellent performances, and a strong emotional connection with the audience.","user":"Bertaut","rank":[11,18]}]