[{"title":"Almost certainly the worst film of 2019","rating":2,"date":"16 December 2019","review":"Having seen over 125 films this year I honestly think this must be the worst of them and I love animation films.<br><br>The plot and story are flimsy at best and the characters lack virtually any empathy.<br><br>I am shocked this was even made and released,I can't see how anyone ever thought this was a good idea.","user":"coombsstephen","rank":[10,24]},{"title":"Quite enjoyable animated movie","rating":8,"date":"11 April 2020","review":"Judging this from budget point of view this is a must watch, story is indeed full of cliches but its funny and entertaining. Kids will like it for sure. Me and my wife liked it and we are in our 30's (we really enjoy anumated movies). Dont have Pixar expectations and you will enjoy it.","user":"markthepig-94874","rank":[0,0]},{"title":"I can't believe I watched it till the end","rating":6,"date":"3 April 2020","review":"I am quite critical when it comes with 3D because even the best studios lately seem to copy each other designs and ideas. So when the movie started and I realized just how tiny the budget for this had had to be, I was ready to quit in less than 5 minutes. But then, surprise, I stayed hooked till the end. Oh of course, this obviously targets a very young audience so we get all the cliches possible when it comes with subjects like dogs VS cats or human VS animals. All the reasons to wonder if a little kid is supposed to be that stupid and ignore so many plot holes or stomach so many boring dialogues. I think what kept me wanting to see how things were going to evolve, were all these little details that prove there is a team of people having fun behind the production. There are things that are surprisingly well done, rendered or developed here and there, events I couldn't predict among the sheer number of annoying cliches. Nothing revolutionary, but it was enough to keep me interested. I hope I'll see these animators get more funds in the future because there are moments where Turbocat in particular, was way more expressive than a lot of characters Disney recently animated.","user":"badendxxx","rank":[0,0]}]