[{"title":"Created a IMBD account just to make this review","rating":1,"date":"13 November 2019","review":"Worst plot Ive ever seen. Looks like a high 16 year old made it.","user":"juandilago","rank":[26,31]},{"title":"Seriously","rating":1,"date":"9 November 2019","review":"Some of the worst acting I have never seen. Even the plot is lame. Just when you think this movie has some potential, they throw some complete nonsense into the mix with complete garbage acting performances. Don't waste your time.","user":"sabitbol","rank":[26,32]},{"title":"Disappointing but it was set in Thailand!","rating":4,"date":"11 November 2019","review":"I love films set in Thailand, so when Netflix offered this flick, I jumped at the chance to watch it. And since it was also a French production, I was hoping for something better than B-movie trash produced in the U.S. I was pretty disappointed.<br><br>The plot is that Mehdi, a member of a gang that robbed a bank 15 years earlier in France who was the only one caught by cops, is released from prison and joins the rest of the gang on the Thai tourist island of Phuket. The Phuket-based members are all doing well in the businesses they set up with the 2.4 million euros they stole. The trouble starts when Mehdi, citing how he spent 15 years in prison while the rest of the gang was in paradise enjoying their loot, wants his share of the money, or 400,000 euros, so that he can go back to France. The members make various excuses on why they cannot pay him now but the member closest to Hicham, now married to a Thai woman whose brother is a police chief on Phuket, pledges to get Mehdi his money. Things go south for the gang from there as Mehdi erroneously thinks the methods he employed in France will work in Thailand.<br><br>The sets were great and reminded me of Thailand, and also got me wanting to go back. The problem is, the plot has a few unbelievable elements and twists that just don't make sense. As much as I enjoyed the film mainly because it was set in Thailand, well, I can't say it's a good movie. It didn't suck as the plot did have twists and turns that had me guessing but in the end, the ending fell flat. That said, I still enjoyed it and for those who love Thailand, this film is fun.","user":"peter07","rank":[11,12]}]