[{"title":"\"Strange Tales from a Chinese Studio\" is a collection of Classical Chinese stories by Pu Songling (played by Chan)","rating":8,"date":"5 September 2019","review":"This really is an underrated movie. If it were in English it would likely have a 6 to 7 rating I'm certain. Classic Chan with a variant on some Classic Chinese literature, \"Strange Tales from a Chinese Studio\". It is similar to some of the modern versions of \"Journey to the West\".","user":"fdc2","rank":[6,8]},{"title":"Definitely not the worst Jackie Chan movie","rating":5,"date":"26 August 2019","review":"This is an asian high-fantasy movie rather than a martial arts flick. So adrenaline junkies looking to get their fix on this are going to be disappointed.<br><br>This does have a relatively good premise and story. The characters are well-thought out and enjoyable. Unfortunately the English text translation is so extremely bad it is sometimes difficult to follow the story. Typical confusion between he / she / it, extreme mistranslation (in one spot the English is actually written out on-screen and the translation renders it otherwise).<br><br>But the romantic sub-plot is quite good, and it has a very Asian ending (avoiding spoilers). It does get to a point at near the end where the on-screen CGI is so over the top it feels more like a Transformers movie than fitting in with the rest of the film. That along with the very bad translating gives this a mere 5-star \"mediocre\" rating from me.<br><br>Those who rated this 1 star... seriously, you're putting this equal to the worst movies ever made? If you can't write better reviews than that don't bother. I'm not sure it warrants the 8 stars some give it, but given a chance and tolerating the butchered translations, it's a mildly interesting 2 hours.<br><br>I really liked the mind-altering pixie character. Cute as a button and used well throughout the film, both as plot device and emotional prodding.","user":"Snootz","rank":[9,14]},{"title":"Worst Jacky Chan movie.","rating":2,"date":"14 February 2019","review":"I really cannot see any positive aspect of this fantasy movie. The dialog is too cliche and shallow, the plot is linear and cheesy, and the whole story is boring.\nYou can get better fantasy movie like this without the big name of Jacky Chan.","user":"ferdy-skywalker","rank":[19,36]}]