[{"title":"On the fence","rating":5,"date":"30 November 2017","review":"Saw 'A Christmas Prince' with my flatmate on Netflix already in the Christmas spirit. After watching, my overall thoughts were that while 'A Christmas Prince' was watchable it left me torn as to what to make of it.<br><br>On one view we have a few performances that make the grade. The best performance as the most well-rounded character by far (the only one to get development beyond cliché) comes from Honor Kneafsey, Emily starts off as a brat initially but grows as the character that one roots for the most. Rose McIver and Ben Lamb also give charming performances and have an easy going romantic chemistry. Alice Krige brings understated dignity to the queen.<br><br>'A Christmas Prince' looks pretty good. The scenery is beautifully picturesque and has a really festive feel and the castle interiors and exteriors are enough to make one want to stay there. The photography is suitably slick. The music puts one into the festive mood and gives off a cosy nostalgia. Spotting the famous Christmas songs and carols is a delight and there is the serious temptation to sing along.<br><br>There is some charm and genuine sweetness here while Amber and Emily's chemistry is very heartfelt. Didn't find myself bored either.<br><br>However, the rest of the cast don't make much of an impression, most are bland. Then there is Theo Devaney and Emma Louise Saunders who play their stock villain characters with such broad hamminess that they make over-the-top villain characters in Christmas pantomimes more subtle in comparison.<br><br>It is hard to deny too that 'A Christmas Prince', even for trying to take it for what it is, is riddled with clichés, non-stop predictability and contrivance. One has to suspend disbelief at how long it takes for the lie to be exposed, Amber constantly narrowly escaping being caught and how things are resolved far too quickly and easily.<br><br>The script throughout is peppered with cheese (especially Simon and Sophia) and mawkish schmaltz, and of the characters although the leads are reasonably likable the only one to have any development is Emily. Simon and Sophia are plot-device material there for the sake of it and the way they're written and their antics jar tonally.<br><br>Concluding, very torn on what to think. Part of me can't be too hard on it, but the faults are pretty glaring also. 5/10 Bethany Cox","user":"TheLittleSongbird","rank":[22,27]},{"title":"Schmalzy but nice","rating":7,"date":"18 November 2017","review":"A very 'schmalzy' story, at the level of the Princess' diaries, but nicely done. Rose McIver is just enough 'innocent looking' to make this work. Nicest performance by Honor Kneafsey as the handicapped princess, gaining confidence from her non-teacher. Of course the bad guy and girl are caricatures. Ben Lamb is a prince as the story demands; Alice Krige appears the run-of-the-mill conservative, old queen, but with a few devious traits she saves the role. In short, sentimental, but just right for Christmas.","user":"bertvleeuwen-646-650832","rank":[32,42]},{"title":"Schmaltzy but good!","rating":8,"date":"8 October 2018","review":"Of COURSE it's schmaltzy! But it's what we want in a Christmas feel-good romantic movie! Makes you smile, makes you laugh, gives you hope that there are happy endings! Will watch again next year...which is the true sign of a good Christmas movie!","user":"ivorygirlever","rank":[14,19]}]