[{"title":"This movie makes no sense","rating":1,"date":"25 February 2018","review":"The entire movie is based on a flawed premise and execution from the beginning. The description of the movie says they hit another car, but they didn't even touch it. They veered out of the lane for a few seconds, while the other car drove right into a parked car in their own lane and flipped. That driver would've seen that disabled car before the veering even happened. They could've shot it from that driver's perspective to show how that happened better, I guess, but, as is, it makes no sense. Secondly, all the woman who was framed would have to do is show her seat belt bruises to prove she was in the passenger seat if they swerved hard enough to knock her out completely that she woke up in the hospital. She'd probably have a contusion on her head if she hit the window with her head on the right side. And the guy who framed her would have seat belt bruises, too. Just because you make a low budget film doesn't mean you have to make something terrible. And female leads deserve better material.","user":"velysai-46922","rank":[9,10]},{"title":"Above average Lifetime movie","rating":7,"date":"7 August 2018","review":"This movie had a more unusual plot than most. I really liked the concept of the lawyer switching his fiancé as the driver. Yes, there were a number of plot holes. But the movie did what it was intended to do. It entertained me without making me mad I wasted 2 hours. If the script was tweaked some more, and they had a real movie budget, this could have been a good legitimate movie.","user":"tomfsloan","rank":[5,5]},{"title":"Another winner from Lifetime Movies!","rating":7,"date":"3 November 2018","review":"Superior thriller which is worth watching.<br><br>A high flying lawyer about to become a judge frames his fiancé to take the blame for a car accident involving a death.\nTopical the subject of persons about to be called to the bench who are accused of crimes!<br><br>Plenty of twists and turns in the story and the \"baddie\" lawyer/judge just about steals the show with his performance.<br><br>I am quite impressed with some of these Lifetime Movies which are often as good as anything both Hollywood and Netflix can make.<br><br>6 and a half rounded up:<br><br>7/10.","user":"rbrb","rank":[3,3]}]