[{"title":"Terrible...!","rating":1,"date":"17 March 2020","review":"If the British fought the war against the Nazi Germany was like what we saw in this lame movie, I doubt even with the help of the Allied force leading by the U.S. the war would be totally lost. What a lousy try that only showed how a bad screenplay, bad directing, B-level actors would have turned a WWII movie into such a tasteless and boring one. The main purpose trying to re-glorify the British during that era was just a waste of time and money, no matter what low budget was invested in it. Viewers should not further waste their own time to watch or rent it, even it only costs $0.99.","user":"Bad-Good-Great","rank":[16,23]},{"title":"Garbage","rating":1,"date":"21 March 2020","review":"Acting is awful. Continuity is utterly wrong. Don't waste your time. This is actually worse than \"The Bruce\"","user":"ewen1957","rank":[3,4]},{"title":"Poorly made historically inaccurate","rating":2,"date":"12 April 2020","review":"The movie was very poorly made and very historically inaccurate. Please don't waste your time and money on it. There are many problems with the film, but I'll only mention a few so I don't waste your time like the movie does.\n1st, there is a beautiful squadron of fighter planes soaring through the air in the movie poster, but none are seen flying in the movie, only one in a hangar.\n2nd, in 1944, no SS unit would have been issued a machine gun MG08 from WW1, but it is used on several guard towers during the film.\n3rd, one of the SS soldiers on patrol is wearing a helmet with Heer, or army, decals on it, not SS. On top of uniforms being incorrect, the simple actions of the characters are illogical and inaccurate. In the scene where the escaping POWs must make it past a guard tower with a machine gun nest, one man runs into the gunner's sight to serve as a distraction while another man shoots the gunner in the head. The problem is that the distracting man makes it back to the group unscathed, because the gunner didn't turn his machine gun right at the enemy clearly standing before him. Instead, the gunner shot every last brick in the wall near the man as he slowly turned his machine gun in the man's direction. Instead of just turning and shooting, he shot while turning, which is plain dumb. Common, Germans lost the war, but where not stupid. Also, in the scene where Ellie accidentally shoots the soldier on patrol who nearly killed her and nothing happens. Nobody hears the shot. It's not like it was just several meters away from a building full of SS guards, of course not. Even though Ellie and John talk shortly after about why she shot him and Ellie claims it was a mistake, nobody hears the shot. It's impossible that not one soldier heard a gunshot go off right near their camp and didn't go check out what happened.\nIt's just a disgracefully bad movie, it's illogical and unfortunate for a movie that really did have some potential in the beginning. Very sad.\nPS: These critiques are written by my 13-year-old son who knows history way better than the film makers.","user":"artakphotography","rank":[1,1]}]