[{"title":"Comprehensive documentary on modern American circumcision","rating":10,"date":"17 November 2017","review":"Wow. This film really is shining a light on something hidden in plain sight here in America. Its extremely well done, in depth and concise. Highlighting the most prominent voices on both sides of this heated debate; it's thought provoking and balanced. This film is not an emotional high jacking, it's truly an education. I loved it.","user":"caswelltori","rank":[35,47]},{"title":"Outstanding Documentary","rating":10,"date":"25 December 2017","review":"'American Circumcision' begins with a beautifully filmed dramatization of a baby boy about to be cut, but stops short of the \"procedure.\" We're whisked to Washington DC, during 'Genital Integrity Awareness Week' where activists interact with the public. The film continues at a swift pace that doesn't let up for an hour and forty minutes. The wide range of scenes and interviews that follow are very compelling, Marotta's skillful editing weaves everything together seamlessly. The information flows. There are moments of profound insight, deep sorrow, a few laughs and some unexpected reveals. The audience I saw this with paid rapt attention until the credits.<br><br>The music by John Allen Graves underscores the movie perfectly contributing to the profound gravitas.<br><br>'American Circumcision' is unique, a must see, award-winning documentary for anyone who wants to be informed about this issue. It's Brendon Marotta's first full-length documentary film as director.","user":"jamesd-18","rank":[30,42]},{"title":"Somber at times, but also uplifting","rating":10,"date":"8 April 2018","review":"In the theatre I saw it in, we could hear what seemed like most of the audience sobbing at one point (not about the graphic depiction of the surgery, but rather about a person's anguish while sadly expressing their regrets about not being better informed before allowing a loved one to be cut). <br><br>But that sort of intensity is broken up by moments when those who would deny a male the right to make his own choice look positively ridiculous, and don't seem to realize how sill they sound. <br><br>The film also provides uplift by highlighting some men who have been able to undo the predictable sexual damage of circumcision to an extent. <br><br>Very well told - fair and balanced. I hope all expecting families see this before delivering.","user":"rlow1994","rank":[22,34]}]