[{"title":"I lived this story","rating":23,"date":"23 October 2018","review":"For those who gave this film a bad rating, they obviously have no emotional connection to someone who was incarcerated for a non-violent drug offense, let alone a conspiracy charge. This film was compelling, raw, &amp; authentic. It's amazing!! Grab a box of tissues!<br><br>It reminds me so much of my childhood. My mother was incarcerated when I was 8yrs old for possession of narcotics. Her &amp; my father had been using drugs since they were kids, like a lot of drug addicts, &amp; they both ended up in jail for drug use. My dad eventually left the picture, &amp; my mom was in &amp; out of prison til I was an adult. My grandparents raised my siblings &amp; I &amp; gave us a great life. My gma drove us to whatever prison my mom was at every few months. I remember how much I missed her &amp; how excited I'd get every time we'd go to see her. But, I started growing up, &amp; every time she went back to jail I'd grow more &amp; more resentful. You lose so much not having your mother there. I thought she chose drugs over us. I didn't understand that drug addiction is a disease that can't be cured by prison time. They'd lock her up for drug use &amp; posession every time, &amp; send her back out into the world after she did her time. She never got the help she really needed.\nThe last time my mom was sent to jail the judge wanted to send her away for life. My gma found an amazing long-term rehab facility called Delancey Street &amp; the judges granted her to go there instead of serving her sentence. It's a 2 yr commitment &amp; it's not like a typical rehab. It's a place for those who have tried everything to get sober &amp; nothing works. It's a non-profit &amp; costs nothing - u just have to really want to recover &amp; change your life. Delancey has a 97% success rate for those who successfully complete the 2yr program.<br><br>My mom stayed for 7yrs &amp; has been sober for 20. She just received her masters degree in professional counseling &amp; works as a professional drug counselor. She's a completely different person; an amazing mother who I respect &amp; admire, a dependable friend, a pillar of her community, &amp; a law-abiding citizen. She's better than most pple I know, &amp; she couldn't have done it without help.\nMy siblings &amp; I have all struggled at different points in our lives because my mother was never around while we grew up. It has lasting affects on the entire family. Yes, my mother actually did the crime, but it doesn't make it any easier to deal with. Non-violent drug offenses have ridiculous sentences &amp; the punishment is not valid or helpful. It doesn't help pple change their lives for the better, it makes it harder. These pple need help. To make it worse, conspiracy charges for drug offenses are insane!! I know how difficult it was for me, so I can only imagine what it was like for this family. We all do stupid things when we're young. We fall in love with the wrong guy &amp; think we can change them. We hang out with the wrong crowd. Whatever it is, it doesn't deserve a 15yr sentence!! Not for a drug offense when you're the gf!!<br><br>For the person who is upset that the film didn't talk about her charges exactly, they did! She fell into the problem that Congress has been trying to fix called \"The girlfriend problem\". The only crime she was guilty of was to be in the wrong place at the wrong time. The 1.5 million children they've left behind so far are left with overburdened friends &amp; family or in the child welfare system, where they're at increased risk of physical or sexual abuse. How is that fixing the problem??<br><br>We need more stories like this to be told! Thank you Rudy for sharing you story. I loved that it was shot like a homemade movie. It felt very real &amp; not like a production. That's how u make a documentary! Don't listen to the critics because this is your truth! I wish Cindy &amp; her girls nothing but the best!! I really hope her girls can recover from this. Stay close to them Cindy. U can do this! If my mom can, &amp; she was way worse, u can too!<br><br>Everyone needs to watch this film!!!","user":"Leeannspring-43075","rank":[23,27]},{"title":"Amazing and well-done","rating":10,"date":"22 October 2018","review":"For anyone saying she was guilty, yes, she knows that and so does her family. What she was guilty of was omission. That should not be punished with 15 years. This is a great independent film showing loyalty, love and devotion, while showing flaws in the US judicial system.","user":"elizrug","rank":[13,17]},{"title":"The husband","rating":10,"date":"21 October 2018","review":"I cannot stop thinking about the husband after watching this film. What he did for his wife and children was amazingly selfless. He took on that burden in a gentle and loving way. At the end of the movie, however, you could see that the sweet lovely caring man had become somewhat jaded. Who wouldn't? He was forced to take something on that he never signed up for. Never mind 'for better or for worse'. No matter how much he loves his wife, resentment had to rear its ugly head frequently over the years. God bless him and his family. His in-laws are heartwarmingly beautiful people-the real deal. Provocative subject matter very well done.","user":"melindaconsuelo","rank":[11,14]}]