[{"title":"I lived a version of this movie, and it hurt.","rating":10,"date":"4 January 2020","review":"I didn't expect this to mirror how my ex wife and I had to go through the stages of divorce so accurately. My son was only 2 when we were divorced and all of the ups and downs and petty fights and anger that we had for each other was exhausting but we went through it all just to fight for him, who we both love more than anything. We said horrible things to each other we can never take back but we didn't really mean and we both eventually found a way to make it work for him and to protect him from the ugliness. We made it through to the other side and have a good relationship now and work as a team to raise him with love and support but it was a long road out of hell to get there. This movie portrayed that in a way I would never have expected. It made me cry numerous times thinking of how hopeless and angry I was for so long and in that I feel like this movie deserves every accolade it gets. It felt genuine and painful but with hope at the end. It's real and powerful.","user":"fearthemcneil","rank":[358,405]},{"title":"Devastating","rating":10,"date":"20 March 2020","review":"Absolutely heartbreaking. I loved every minute of it.<br><br>Adam Driver and Scarlett Johansson give the best performances of their careers. They are so damn good here.<br><br>Great writing and direction. A beautiful and depressing film.","user":"mahmus","rank":[34,37]},{"title":"Human and delicate","rating":9,"date":"7 February 2020","review":"\"Marriage Story\" is a film about a couple which is going trough the phases of a divorce. The best thing about this movie is that the characters, the two protagonists in particular, have a very human taste and they seem like real people feeling real emotions. And thanks to the excellent performances by Adam Driver and Scarlett Johansson these emotions are able to touch the heart of the viewer with all their power and at the same time with a delicate taste. As far as the theme of the divorce the movie is a critic about the process of it, on how it makes the couple waste a lot of money but most importantly on the hate it creates. Indeed the protagonists starts the process with all the good intentions to split up peacefully but when the lawyers kicks in they found themselves in a fight they don't even want. And another aspect \"Marriage Story\" manages to get right is that both Charlie and Nicole had their faults and they also had been disrespected in different ways and so the movie conveys the idea that in these situations usually (not everytime) the blame is on both, maybe not equally but everyone had his faults.\n\"Marriage Story\" is a great movie, with excellent acting, a touching screenplay, an immersive direction and a delicate score: check this one out!","user":"Dello_","rank":[24,26]}]