[{"title":"what was the point of this film, or why was it made... for lovin you or not to be","rating":4,"date":"28 January 2020","review":"Quirky and strange one can say, free and ravishing to others.to me , the grumpy old man and his grumpy better half, do both feel we sit leftwith an empty shell of a story experience, with loads of vocalali, uncareingness, adolescent adults and a writers cramp..<br><br>its like drinking tea on the titanic at 12000 feet below waters edge, accompanieged by a self illuminating deep sea sculpin, dangling its fluorescent bait back and forth, to lure you into the belly of silver screen fun and entertainment, but what you get are just a blurry gulch of blood and gall stories of a punch and judy way of life, where the seriousness does kill the magic, and the narcisissm kills the fun.<br><br>acting, are very free but not a good way to tell the sad story.<br><br>score, some nuttyish feature songs on string instruments sung by a striving female hanging upside down with her gutters pressing againt her vocal chords, may be something for you<br><br>but not for me ,im still grumpy, and the max sum of 4 stars goes to some of the shoots at the new york streetlevel. just a small recommend","user":"ops-52535","rank":[7,9]},{"title":"Woeful crud","rating":1,"date":"29 January 2020","review":"A film so far up its own arse that it uses the uvula as a disco ball. I have no idea as how this even got funded, what is there to like? The laughable Great Expectations reference, seriously, has the writer ever read the novel? The critics will tell you how the characters are crafted and cooly delivered to the screen etc, twaddle, there is no middle to the film and you couldn't give a toss about the two lead characters.\nThe usual boohoo, nothing new, arty film where everyone concerned pats their own backs.","user":"namstonk","rank":[5,7]},{"title":"Clever, witty and kind.","rating":10,"date":"1 March 2020","review":"It always fascinates me when there is a discrepancy between 'user' ratings and the critics. I don't know why people are unimpressed by this film. It is an original and surprising sort of urban New York 'coming of age' story, with very good performances, subtle humour and Austen like irony. The plotting is brilliant, but above all else it is kind and humane; kind to its characters and really quite profound in its humanity, without ever once losing its indie lightness of touch.","user":"ajjjja","rank":[0,0]}]