[{"title":"\"He's An Amateur!!!\"","rating":6,"date":"6 December 2019","review":"In \"Her Worst Nightmare\" (a.k.a., \"Degrees of Fear\"), the best line in the film is spoken by the protagonist Dakota Haggerty at a point when she has been drugged and kidnapped by a psychopath. But she confidently asserts to another woman who is also in captivity that the mama's boy is just an \"amateur.\" That statement reveals the courage and tenacity of a protagonist using her mind and her will in order to survive.<br><br>In her past, Miss Haggerty had been kept in bondage by the deranged Kurt Weber. Along with Minda and Terri, Dakota was finally rescued and Weber sent to prison. But a copy-cat has emerged and is now stalking Dakota, who is a student at the university.<br><br>Dakota comes to suspect her psychology instructor Dr. Campbell of orchestrating a scheme to instill fear into her and perhaps repeat the horrific crimes committed by Weber. But one of the most intriguing characters turns out to be Dr. Campbell, himself a victim of trauma as a child, due to the predatory acts of a nefarious family friend known as his \"uncle.\"<br><br>The film develops a special bonding between a young journalist, Addie, who befriends Dakota. It is the connection of the two women, who combine forces to eventually get to the bottom of who has been tormenting Dakota.<br><br>A point made by Dr. Campbell in one of his lectures on trauma is the importance of \"breaking the cycle\" in order to move forward out of the horrific past. We actually see the growing strength of Dakota, as she grapples with the issues in the classroom and feeds off of the support she receives from Addie.<br><br>The film appeared to be shot at the University of Louisville, and it included an excellent cast, especially the performer playing the lead. One of the best scenes is the brief denouement in which Miss Haggerty addresses her class at the end of the course taught by Dr. Campbell. She stresses to the group the importance of feeling that \"you are not alone\" in dealing with PTSD.<br><br>The film offered an incisive depiction of the stress of a traumatic experience. By the end, it would appear that for Miss Haggerty, the worst part of her nightmare is finally over.","user":"lavatch","rank":[3,3]},{"title":"Intriguing","rating":7,"date":"4 December 2018","review":"Overall not too bad although at times it dragged a little. I thought the rescue scene was done well. Dakota was a descent character. She had to be scared and brave at the same time. The stupid things that happenen in most movies were kept at a minimum. Such as why didn't she insist on taking her purse to the women's room. That's something women just do. But she did fight back at the end. Good for her.\nI liked Kentucky as the setting. That's different.\nAs the other reviewer said, the dramatic musical sound effects were a bit much. And with all the noise and banging she does in the basement, he doesn't hear it until 5 minutes later?","user":"tomfsloan","rank":[5,6]},{"title":"Fun, Paranoid Times","rating":9,"date":"16 September 2018","review":"Highly entertaining -- the female lead is strong and sympathetic. I particularly loved the best friend character, and there's also a really creepy sequence with video footage that made my skin crawl. Urgh.","user":"evakonstantopoulos","rank":[6,9]}]