[{"title":"Lot's of plotholes","rating":5,"date":"18 December 2017","review":"I don't understand who a town with one taxi and no cell service has a college? Also - a blizzard forces people to evacuate yet a short time later the roads are clear and the weather is calm as if nothing happened?<br><br>I'm okay with some imagination but you can't expect me to suspend all of my belief.","user":"JShaft33","rank":[25,31]},{"title":"Good Start, Horrible Finish","rating":1,"date":"5 January 2018","review":"I love a good old movie full of cheesy moments, and that's exactly what I was looking for in this.<br><br>But, in my opinion, this movie is what is wrong with our society. Let me explain...<br><br>*Spoiler Alert*<br><br>First off, this woman was willing to vault a toy train in a dress at a freaking gala in order for a guy to quadruple a man's donation. And she's scolded for it and her morals are questioned because of it??? Are you freaking kidding me??? Gtfo. If I vault anything in a dress to quadruple a freaking donation, someone better be THANKING me, if anything. But if that's all there was, there wouldn't have been much of a plot so....<br><br>Cue the trip to the small town. She's dating this a**hole of a guy. Extremely gorgeous, but a complete a**. He has to stay home because...reasons. She must go to this small town alone to learn a lesson about appreciating what truly matters in life. She meets an amazing guy who is tremendously sweet and kind-hearted. He shows her around town and treats her wonderfully. She begins to do nice things for him as well and starts to truly warm up to the town. You can tell she's starting to catch feelings, but wants to remain loyal to her fiancée.<br><br>She's here under the guise of a different name, (Elle London, instead of Ellen Langford) so that she doesn't get special treatment for being an heiress. Makes sense. Her dad wants her to learn a lesson. But when this so-called knockoff 'prince charming' finds out that she has an extra letter at the end of her first name and is really the daughter of the owner of a huge toy business, he freaks out and throws a b*tch fit. Why?? WHYY???? TELL ME SOMEONE PLZ I DO NOT UNDERSTAND???? He looks her up on the internet and sees the media coverage of her VAULTING A TRAIN AT A FREAKING GALA TO RAISE MONEY FOR CHILDREN and decides she's a liar and not the same person she's been to him--which was, btw, a really nice human being. GTFO. <br><br>Here's why this is a societal issue: Think of all of the movies, TV Shows, etc. where a well-to-do or famous guy pretends to be someone he's not and then the girl either finds out he's a superstar or millionaire or whatever else. She's thrilled. Ecstatic. Should consider herself lucky to be around him. But when the genders are reversed it's not the same??? Literally, gtfo. The writer of this garbage film has to have been a guy. Because no self-respecting woman would write this trash.<br><br>So he throws his b*tch fit and continues to treat her like garbage, as if nothing had ever happened and she was now dirt beneath her feet for doing something to try to make her father happy. She apologizes a few times, still...nothing. He's mad. Why? I still don't f**king know. And then, after she has her happy moment with her uncle and dad and is elected the new CEO of the company, he comes around wanting to dance. Never even an apology. All is forgiven. And she's expected to be so grateful for him forgiving her (for what, exactly???). Just like that. She moved from one a**hole to the next. How wonderful. What a wonderful little Christmas movie.","user":"iambrittanychristian","rank":[38,50]},{"title":"Jake seems a bit... aggressive","rating":6,"date":"26 August 2018","review":"I liked the movie, HOWEVER.... did anyone else feel like Jake has violent and abusive tendencies? Kind of weird... Takes away from the movie a bit.","user":"cherbear-98244","rank":[20,27]}]