[{"title":"Lazy Hero Worship","rating":6,"date":"5 February 2019","review":"If you already adore Ruth Bader Ginsberg and want nothing more than to spend a couple of hours idolizing her, you will love this movie, as it's nothing more than hero worship. If you're looking for a more complex look at this remarkable woman, you won't find it here. The film doesn't elaborate much on the struggles Ginsberg faced, either personally or professionally, beyond quick outlines. I was left with so many questions about her that went unanswered. \"RBG\" is a lazy documentary capitalizing on anti-Trump and MeToo sentiment. It doesn't earn its stripes. RBG deserves better.<br><br>Grade: B-","user":"evanston_dad","rank":[20,31]},{"title":"Interesting person, Terrible One-Sided Propoganda Documentary","rating":5,"date":"31 January 2020","review":"If I were to rate this documentary solely on the basis of its subject, I would give it a 10. RBG is a very interesting person, who has had a profound impact on the law, and it is worth learning about her regardless of where you stand on the political spectrum. Nonetheless, this documentary is extremely one-sided and intentionally leaves out important facts, or distorts them, solely to make its point.<br><br>First, by only viewing this documentary, one would think that her husband gave up his legal career to support RBG and cook dinner for her and the kids. The truth is that he had a very successful legal career as a tax lawyer and tenured professor at Columbia Law School. He did move to DC to be with RBG, but became a law professor at Georgetown Law School, not some house husband. The documentary mentions that RBG was shy and that it was needed for her husband to sing her praises during Senate confirmation. What it doesn't tell you is that her husband was the attorney for future Presidential Candidate and billionaire Ross Perot, and that Perot lobbied hard to get her nominated, as a way to return the favor for the hundreds of millions of dollars Ginsburg was able to save him. Perot's influence on Republicans, as well as lobbying by the Jewish community, is what allowed her to be so easily confirmed. The documentary makes it seem like she was confirmed 96-3 because she was so exemplary that she overcame political partisanship. But it's important to remember that Scalia was confirmed 98-0. A more honest documentary would have mentioned that the backing of Perot, and other Republicans, by her tax lawyer husband was crucial in both the confirmation hearings.<br><br>The bias of this documentary shines when it describes Scalia as a right wing nut job, and claims Ginsburg was able to maintain a friendship with him because of nonsense like 'always be a lady.' Anyone who knows RBG or Scalia knows that they were close friends who met for dinner weekly. It's not that she was just ignoring his politics and trying to remain civil. They were actually close friends and didn't let politics affect that. I think for those blinded by partisanship, it's hard to imagine being friends with someone who is on the opposite side of the political spectrum. But for most people, it isn't. RBG's husband himself was close friends with Perot, who while running as an independent twice, was a lifelong Republican and always endorsed Republican candidates.<br><br>The third issue this documentary glosses over is that many on the left spoke out trying to have RBG step down while Obama was still President. This way the Democrats would be able to retain the seat on the Supreme Court. She could even have had some say over who her replacement would be, and perhaps have had one of her former clerks be her replacement. But she decided to stay on even though she was slowing down and the quality of her output was waning. Nonetheless she tenaciously clung to power, and now she is battling cancer for the 4th time, and has no choice but to remain on the Court until we have a Democratic President. This documentary quickly addresses these criticisms (from the Left, mind you) by saying she would stay on until she couldn't \"go full steam.\" The problem is that she hasn't been going full steam for nearly a decade now, and there is a good chance Trump will be able to place another Justice on the Court because of her. Yet this whole contentious issue is downplayed by repeatedly showing excerpts of her in the gym working out to some energetic music. Those of us who follow the Court are fully aware that she has slowed down considerably, and perhaps isn't all mentally there anymore (given her extremely poor choice of wading into the election by publicly criticizing a Presidential candidate). Some energetic workout music isn't going convince knowledgeable people otherwise.<br><br>There are many other issues that the documentary should have addressed; such as the lack of diversity in her clerks (a paucity of African-American and Hispanic clerks, as well as less women than would be expected), as well as a more thorough examination of her jurisprudence. Instead we get a one-sided propaganda piece that is making RBG out to be some sort of God, and not what she is, an impressive but human figure. Even those who tend to be on the Left, like myself, are a bit dissatisfied with the childish one-sided view of RBG.","user":"samoanui","rank":[3,3]},{"title":"Not only inspires you, but motivates you to change the world like she did","rating":10,"date":"11 May 2018","review":"I have been a fan of Justice Ginsburg since she first came into focus in the 70s, as an advocate of women's rights. This documentary about her life offers insight into her personal history and the people around her who supported her for so many years. She is an inspiration in so many ways. Shy and somewhat introverted, she never let that keep her from pursuing a career path that was unique for woman at the time. She entered Harvard Law School in 1956, one of 9 women in a class of 500 men. I resonated with her story about the Dean reportedly asking the female law students, \"How do you justify taking a spot from a qualified man?\" <br><br>Justice Ginsburg proudly speaks about being born and bred in Brooklyn. In the 70s she co-founded the Women's Rights Project at the ACLU. We listen to Gloria Steinem and Nina Totenberg reveal tales of her past that make you realize how pivotal her involvement in the women's movement was. Filmmakers Julie Cohen and Betsy West dig into the substance of this woman with a judicious zeal usually reserved for our deceased heroes. As a staunch feminist, her nomination to the Supreme Court could have been way-laid had not President Clinton been wowed by her in the first 15 minutes of her interview with him. Then, he knew that he had to put her on the Court. <br><br>The love story between Ruth and Martin Ginsburg is nothing less than awe-inspiring. I love how she tells about her undergraduate years at Cornell where there was a four to one ratio of boys to girls. \"Every mother wanted to send their daughter there because, if you couldn't find a husband there, you were hopeless.\" She reveals that during her freshman year, she never dated the same boy twice. That is, until she met Marty, who was the first guy that recognized she had a brain. When President Carter brought her to the federal bench, Marty gave up his success career as a tax attorney in New York to move to DC to support her. He recognized Ruth for the super star that she is and later, when she was nominated to the Supreme Court, rallied on her behalf with endless enthusiasm. Also noted is that he was the cook in the family. Her children tell how they had to keep her out of the kitchen. <br><br>One thing I really like about this film is that it focuses on Justice Ginsburg's life long fight against gender discrimination. She experienced it first hand as a fresh law school graduate that could not get a job in any law office in New York City because \"they didn't hire women.\" She has never given up the fight, and there have been many - for women in the military who were discriminated against for pay and benefits, for widowed men who couldn't get survivor benefits. She chose her plaintiffs carefully, picking a male to show that gender discrimination worked against both men and women. <br><br>Although this film may lack verve in terms of groundbreaking filmmaking, it is stunning beautiful in telling the story of a contemporary hero. 84-year-old Justice Ginsburg is an icon of our times. A woman who has weathered extremely difficult conditions and sits on the highest court in the country as someone dedicated to equality - for women, for people of different races and cultures - for all of us. She is a modern heroine and, as shy and quiet as she is - carries a big stick! I have been touting this film to all the young women and men in my universe and sending them to it. Most walk away stunned. My 20-year-old friends never even knew who she was before going to see the film. Many weep as they watch it. Now, that's something. That's important. If this film manages to get one young person's attention and give them the courage to stand up for what they believe, then these filmmakers have something to be outrageously proud of. I believe they have. <br><br>Reviewed by Ranny L., KIDS FIRST! Juror.","user":"rannynm","rank":[48,93]}]