[{"title":"Big build up for little pay off","rating":7,"date":"30 October 2019","review":"The trailer for this film is what sold it for me. It appeared to me to be a psychological thriller set in an American high school, centred around the relationship between a Black student and his teacher. And I wasn't exactly wrong...but I wasn't exactly right either.<br><br>So Luce is a young Black student, praised by all his teachers and in line to be class valedictorian. But one of his teachers is worried that he is involved in some illegal activity and gets his parents involved. As the web of lies gets more tangled and the tension rises, we start to find that we don't know who to believe.<br><br>So lets start by talking about the spectacular performances of all the actors. There are some really seasoned actors and actresses in this film, and they of course give the kind of performances tat you would expect of some of these household names. However, what Is amazing is that the breakout performances by virtually unknown actors are just as good. Kelvin Harrison Jr.'s performance as Luce was truly spectacular and it is his amazing portrayal of the character is what makes the whole thing work. The whole reveal at the end would never work if his performance wasn't as excellent as it was.<br><br>Now we need to talk about the ending. But to that we need to look at the pacing of the whole film. So it is a very VERY slow build, as all psychological thrillers are. And you can feel the film building towards a huge climax...and was is the most disappointing thing is that I don't feel like that amazing climax ever really arrives. It was quite unclear at the end what the scheme actually was or what the motivations were, and for me, that is the most important thing in a psychological thriller. Instead I felt unsatisfied. Not a good feeling for the end of a thriller.<br><br>Not the best thriller I have seen so far this year and not one that I will remember in a few weeks from now. Enjoyable to watch once, but not one I will be returning too.","user":"trailer_trashed89","rank":[79,90]},{"title":"Luce","rating":8,"date":"11 February 2020","review":"I loved this movie, it was amazing. The message is deep. Amazing writing, the story was incredible. Powerful message which many might not understand, however I did. I am so glad I got to see this movie, it was so well done.","user":"MR_Heraclius","rank":[42,50]},{"title":"Well-meaning, but, ulitmately frustrating","rating":4,"date":"4 August 2019","review":"LUCE may have it's heart in the right place, but, it so bumbles the execution that it comes off like the worst kind of cinema provocation.<br><br>Luce (Kelvin Harrison Jr) is a high school senior who was a refugee from a war torn African country and has been adopted and brought up by upper middle class white parents Peter and Amy (Tim Roth and Naomi Watts). By all appearances, Luce is a model student (he's even referred to, sneeringly, as another \"Obama\" by one of the other black students). Scholarships, speech engagements and accolades flow his way. That is, until he rubs one of his teachers, Ms. Wilson (Octavia Spencer), the wrong way. Before you know it, all kinds of hints and outright accusations of everything from harassment, to violence to sexual assault are being bandied about.<br><br>Co-Writer (with J.C. Lee) and Director Julius Onah broach some interesting themes about what it's like to be a minority with high expectations. Unfortunately, it's handled in such an awkward ham-fisted manner that whatever point the movie is trying to make gets buried in the worst level of 'woke' theatrics. It's the kind of movie that teases the viewer with hints, clues and scenes cut off just before a crucial story point is delivered. It's supposed to lure the viewer in and make it more suspenseful, but, the tact gets tiresome quickly. Worse, the deception creates a feeling it's all artificial. A ruse to keep the viewer interested, without having the dramatic goods to make it pay off with anything meaningful.<br><br>The performances are fine, with Harrison delivering even while he's ultimately let down by the material. Spencer is a solid actress but her poorly written character takes the brunt of the poorly constructed screenplay (a subplot about her troubled sister is particularly odious). The dialogue (when it's allowed to fully play out) has some snap and vigor and Onah's staging shows promise. It's unfortunate that LUCE's filmmakers felt that by keeping the viewer in the dark for as long as possible, that it was the route to greater significance or to shining a light on the issues it raises. It isn't.","user":"gortx","rank":[84,110]}]