[{"title":"A poignant and poetic evocation of childhood","rating":7,"date":"23 June 2019","review":"A remarkably contained and intimate story featuring only five main cast members and around ten locations, We the Animals is about a young boy awakening to the fact that he's homosexual. Equal parts disassociated lyricism and warts-and-all grittiness, the film looks at how the crystallising of one's perception of the world goes hand-in-hand with a loss of innocence. Less concerned with narrative beats and character arcs than with tone and impressionistic visual poetry, the film operates in a similar magical realist key as <a href=\"/name/nm1022455/\">Benh Zeitlin</a>'s masterful <a href=\"/title/tt2125435/\">Beasts of the Southern Wild (2012)</a>, whilst also calling to mind the Texas scenes of <a href=\"/name/nm0000517/\">Terrence Malick</a>'s opus <a href=\"/title/tt0478304/\">The Tree of Life (2011)</a>, especially in the whispery pronouncements of the voiceover narration. Mixing nostalgia, idealism, recrimination, anger, personal freedom, and the constant conflict between optimism and experience into a potent whole, whilst the narrative could be accused of being a little insubstantial, We the Animals is an effective and poignant evocation of the modulations of childhood.<br><br>Set in upstate New York in the 1990s, the film tells the story of nine-year-old Jonah (<a href=\"/name/nm9449041/\">Evan Rosado</a>), who lives with his Ma (<a href=\"/name/nm2611074/\">Sheila Vand</a>) and Paps (<a href=\"/name/nm1950004/\">Raúl Castillo</a>), and two slightly older brothers, Manny (<a href=\"/name/nm9449042/\">Isaiah Kristian</a>) and Joel (<a href=\"/name/nm9449043/\">Josiah Gabriel</a>). Existing just above the poverty line, the family is tightly-knit but dysfunctional, with Ma and Jonah especially close. Married when they were still teenagers, both Ma and Paps possess violent tempers, which often leads to arguments that become physical. As time passes, Jonah begins to notice how much more contemplative and wistful he is than his siblings. When a neighbouring boy shows the brothers a porn movie, Jonah is taken aback when he reacts more strongly to a brief clip of two men having sex than anything else in the video. And so he must attempt to navigate something he doesn't understand and can't articulate, in a milieu built on rugged heterosexual masculinity.<br><br>We the Animals is the fiction film debut of documentarian <a href=\"/name/nm1476102/\">Jeremiah Zagar</a>, and was written for the screen by Zagar and <a href=\"/name/nm2921777/\">Daniel Kitrosser</a>, from <a href=\"/name/nm10132348/\">Justin Torres</a>'s semi-autobiographical 2011 novel of the same name. And although the film changes some aspects (the three brothers are unnamed in the novel, for example, whilst the protagonist's first homosexual experienced is far more graphic than in the film), it remains a remarkably authentic adaptation, capturing both the tone and texture of Torres's prose. And much like the novel, rather than presenting a classically structured plot with forward momentum, the film is instead composed of vignettes presented in a broadly chronological manner. Essentially a bildungsroman, in its depiction of a young boy struggling to understand why he feels so different to those around him, it covers some of the same thematic ground as <a href=\"/title/tt4975722/\">Moonlight (2016)</a>, albeit with a more esoteric tone. In a similar manner, although its depiction of the three brothers' mischief recalls <a href=\"/title/tt5649144/\">The Florida Project (2017)</a>, We the Animals is far more lyrical and existentialist.<br><br>Aesthetically, there's a lot to admire here. Zagar's documentarian background is especially noticeable in his use of the techniques of cinéma vérité; scenes of the brothers chasing one another through long grass, for example, weren't blocked, but were improvised on location by the performers, with cinematographer <a href=\"/name/nm1862511/\">Zak Mulligan</a> simply following along behind the actors with a Steadicam, reacting to their spontaneous movement, and giving the film a sense of being unmediated. In another stylistic choice, the film initially presents the boys as relatively indistinguishable from one another. However, at about the half-way point, this begins to change, as Jonah starts to become aware that he isn't like his brothers, and so begins to withdraw from them, first ideologically, then physically.<br><br>In tandem with this, the voiceover narration becomes less and less frequent. Tied into this are Jonah's crayon pictures. As he struggles to process the realities of sex, violence, and his increasingly fraught family life, the nature of the images begins to change; from relatively innocent doodling to images that are far more sexualised and violent. Also important here is how well Zagar uses the mise en scène to suggest psychology. In the early parts of the film, equal screentime is given to shots of Jonah under his bed drawing and shots of him huddled with his brothers in a blanket fashioned like a tent. However, as the film progresses, we see less and less of him in the tent, and more under the bed, something which carries huge thematic importance for the penultimate scene.<br><br>In terms of focalisation, the film is tied rigidly to Jonah's perspective throughout, never allowing the audience access to anything that he himself doesn't explicitly see or hear. In a general sense, this can be seen in the frequency with which Mulligan places his camera at Jonah's eye level. A more specific example involves a scene when Paps is arguing with another man off-camera. We can hear the voices and make out the odd word, but we can't clearly hear all that is said, because neither can Jonah. It's an extremely effective use of off-screen space. Also important in this sense is that the film is shot on very grainy Super 16, predominately with wide lenses and a shallow depth of field, robbing the images of sheen and depth, and thus foregrounding the impreciseness of memory; it is as if we are looking at events through gauze, half-remembered and half-embellished, a formalism that doesn't distinguish between past and present, reminding me a little of <a href=\"/name/nm0001789/\">Andrei Tarkovsky</a>'s <a href=\"/title/tt0072443/\">Zerkalo (1975)</a> and <a href=\"/name/nm0203993/\">Terence Davies</a>'s <a href=\"/title/tt0095037/\">Distant Voices, Still Lives (1988)</a> (for my money, the best representations of memory ever put on film).<br><br>Thematically, although the story would seem to lend itself to socio-political commentary, Zagar is relatively uninterested in anything beyond Jonah's immediate experience; so if Jonah is unaware of how homosexuals are perceived in the country at large, then such information cannot be presented in the film. However, there are some undeniable thematic undercurrents. For example, when we are first introduced to Ma and Paps, they seem blissfully in love, but this image is shattered shortly afterwards when we see Paps's temper. However, it soon becomes apparent that he isn't the sole purveyor of violence - when he arrives home with a truck of which Ma disapproves, she slaps him several times and verbally berates him. We also see her snap at the children on several occasions, something we never see Paps doing. However, none of this is to excuse his violence or his attempts to downplay it; after splitting her lip during one argument, he tells the boys that he'd been \"punching on her a little\".<br><br>Some of the dialogue is also achingly beautiful, but underneath the poetry, there are darker implications. When Jonah sees a light bulb in a metal cage, he asks Pa \"why is that light in a cage?\", to which Pa answers, \"so it doesn't fly away.\" Another example sees Ma tell Jonah that when children are 10, they leave their parents, asking him, \"promise me you'll stay mine forever.\" When he asks \"how,\" she states, \"simple; you're not 10, you're 9+1\". There's a beauty to this sentiment, but so too is there something unhealthy about it; in one sense she's denying him agency, and in another, she's making him feel guilt for something in his future. Either way, it's not great parenting.<br><br>In terms of problems, for all its lyricism, the film never really says anything new, and it suffers in comparison to masterworks such as Tree of Life and Beasts of the Southern Wild. Another issue is that whilst the sense of place is magnificently handled, there is a sense that we are never really allowed into the characters' cores, even Jonah, with Zagar more interested in lyricism that emotion; in trying to convey Jonah's interiority through abstract visual poetry, Zagar neglects the issue of emotional realism. This should be a heartbreaking film, but it isn't, mainly because the characters exist primarily to facilitate philosophical musing, rather than as unique entities in themselves.<br><br>That aside, however, We the Animals is a superbly realised film and an impressive debut. Dealing with issues of masculinity, domestic violence, homosexuality, and the discovery of self in a milieu not predisposed to accepting a self which deviates from normative societal doctrine, it's very much focused on the impressionistic and chaotic nature of memory. Depicting a young life yet to be fully formed, the film's inconclusive ending is vital - life doesn't have a three-act structure that simply ends with the closing credits. Things are far more complicated than that. And this might be the film's crowning achievement; in a story ostensibly about the past and how we access it, the final impression with which it leaves us is that we can never know what lies in our future.","user":"Bertaut","rank":[15,15]},{"title":"We Animals: Beautiful and Disturbing","rating":8,"date":"28 September 2018","review":"We meet the \"Animals\" early on -- three Puerto Rican brothers living with their parents in upstate New York in the 1980s. Manny, Joel and Jonah feel almost as though they are one being, with shared skin and six arms and legs. The film focuses on nine-year-old Jonah, played by Evan Rosado (all three of the boys offer up terrific performances). We also meet their parents: Paps (played by Raul Castillo), who dances while he cooks, and Ma (Sheila Vand). These early family scenes unfold with all the magic of a contemporary fairy tale. The movie itself could have opened with the words \"Once Upon A Time.\"<br><br>But as is often the case in fairy tales, things aren't quite what they seem to be, and danger is often lurking right around the corner. A trip to the lake turns into a traumatizing swimming lesson for Jonah. Parents who seem to love each other one day can suddenly seem to stop doing so.<br><br>And when things go bad, look out. Paps and Ma have it out one night, and Paps says his goodbyes to his three boys. Their mother takes to bed for days, leaving the brothers to search the house and neighborhood for food.\nAs the boys gobble down stolen candy and leftover soy sauce packets, the phone keeps ringing. The boys wonder if it might be their missing father, but they decide against answering it. It's here where one may question the film's narrative. How much time is passing? Are these kids in school? Do they have friends? Does the mother? Is there extended family nearby? The film doesn't answer any of these questions.<br><br>Ma recovers, Paps returns, and things get back to what passes for normal for this young family. The boys have front row seats to their parents unpredictable marriage, of course, and the film stays with Jonah as he draws in his notebook and tries to make sense of all this (the drawings come to life in some nice animation by Mark Samsonovich). There is chaos here, but there is also love, and the film raises an interesting question about good enough parenting. How good do parents have to be to make sure their child is going to be okay?<br><br>In perhaps the film's best scene, we see the boys and the parents sharing a bathroom. The boys finish washing their feet and then slip behind the shower curtain. This is clearly part of an often-played game; the boys vanish, and the parents call out to them, search the bathroom, and then find them. But that is not what happens on this occasion. The parents -- who clearly have a strong sexual draw to each other -- get caught up in an erotic moment with each other. Ma and Paps realize too late that they have missed their entrance, so to speak, and blown the game. They try and save the moment, and some easy family roughhousing suddenly turns violent. \"You were supposed to find us,\" one of the boys yells and slaps his father hard on the back, and then the other boys each take their turns. \"Why didn't you find us?\" The slaps get harder, and the words more insistent.<br><br>These kids are angry about a lot more than a missed moment of play, of course. There are all sorts of spoken and unspoken agreements between a parent and a child: I will feed you; I will clothe you; I will protect you. Your needs will come before my own. What is really fascinating in this scene, however, is that both parents accept the blows. They know they screwed up; they know they must take their punishment. How many children raised by alcoholic, unpredictable parents never feel safe enough to take up their parents' failings with them?<br><br>There is something else Jonah is trying to figure out: sex. While the brothers are out searching for food, they meet a kindly farmer and his son, who invites the boys into his room and later shows them a pornographic video. Jonah keeps returning to this house to see this boy. It's clear Jonah is drawn to this boy, that we know a name for these feelings even if he does not.<br><br>Dealing with preteen sexuality is always dicey, and I give the film points for going there. The book on which this movie is based takes place over a handful of years, and this gives Jonah's exploration of his sexuality more of a chance to breathe. The movie takes place over a period of months. What we get is really Jonah's first step on a journey. But that is okay. When the kiss comes, it is brief and tastefully handled, and has all the sweetness that a first kiss should.<br><br>Late in the film, after a series of disappointments, Paps moans to Ma that they will never escape this world, this cycle of just getting by in life. He gestures to the boys. \"They will never escape it either.\"<br><br>The film's lovely final scene suggest that Jonah will.","user":"lazich01","rank":[27,35]},{"title":"Best I've seen this year","rating":9,"date":"25 August 2018","review":"I really hope this film gets the audience and recognition it deserves. I was so blown away by the cinematography and score that I had to really think afterwards about just how good the acting was too. Flawless performances by all, not least of which the three boys who you would assume are brothers in real life (they're not).<br><br>Bravo, well done!","user":"tysookochoff","rank":[24,34]}]