[{"title":"A rather enjoyable classic Who romp with Tom Baker in full flow.","rating":5,"date":"5 January 2018","review":"Firstly, this is a big update on the previously available version of this great lost 'masterpiece', including new model work, subtly polished effects, and a few newly filmed live action scenes, all joined together by pleasing digitally animated 'comic' style sections that fill in all the missing acted bits, which also serve to open up the settings far more than I'm sure the BBC would have been capable of achieving originally.<br><br>If we're being honest, the story itself isn't exactly the best ever, it plods a teeny bit in places and gets rather too silly in others, but overall it works and the dialogue is typical Douglas Adams in that there are many fun to and fros between the characters which keeps you entertained regardless, and there are lots of enjoyable moments that carry it along quite adequately with a twist and a turn at the end.<br><br>I enjoyed it tremendously, but any new classic Who is good Who when you're a fan, and it's worth it just for the delightful newly added live action scene right at the very end that will both delight and leave a lump in the throat of every whovian on the planet. It certainly did me.<br><br>Between that and the most campily dressed villain ever brought to screen (seriously, it's jaw dropping), I highly recommend a viewing.","user":"DoctorThotcer","rank":[32,34]},{"title":"This updated Shada is a bit of a classic.","rating":8,"date":"12 April 2018","review":"Shada is quite a complicated story to follow, doesn't matter how many times I watched the VHS or blu ray I never quite got it. Having the gaps in the production made it nigh on impossible to follow. However the production team have worked wonders, putting Shada together with a mix of old and new material, and doing it in an almost seamless way.<br><br>City of Death apart, I wasn't really a fan of the Douglas Adams era, I always thought Tom got away with a little too much, too many laughs, too much nonsense, the balance in City of Death was spot on, and for the most part the balance is spot on in Shada too. Watching it in this new format it now feels like Shada could have been somewhat of a classic, ultimately superior to Creature from the Pit, Horns of Nimon etc, it has so much going for it, Cambridge, Time Lords, a giant killer ball and of course the excellent Skagra, a villain way before his time.<br><br>Christopher Neame is great as Skagra, he is a clever, matter of fact villain, he's not laughing maniacally or over the top in a silly manner, he's clear, single minded and sinister, a great foe.<br><br>I am also stunned at the Blu ray transfer, the original material looks fantastic, it bodes well for the classic series releases on BD.<br><br>It's still a confusing plot, but I enjoyed this updated version enormously.","user":"Sleepin_Dragon","rank":[16,16]},{"title":"SHADA!","rating":10,"date":"29 April 2018","review":"Excellent Blu Ray version of Tom Baker's story.\nThe animation is fantastic and the picture quality is brilliant. Loved all the extras and the story presented as a complete story in one programme. Mark Ayres 70's styled incidential music is a nice homage to Dudley Simpson.","user":"umutcevik","rank":[9,9]}]