[{"title":"(Re)tired (?)","rating":6,"date":"26 June 2019","review":"With a title like that you can expect that people will be interested in it. And it may be good to make people realize that there are also human beings doing this stuff. Jenna Jameson may be the one name almost everyone knows (if you don't count in celebrities like Pamela Anderson, Paris Hilton, Kim Kardashian and others - who you could argue got a career out of \"porn\" - not that some of them needed that but ... here they go.<br><br>Herschell Savage - now that is a name you probably don't know. But he makes a compelling case and is a cute weirdo - sort of. And also a romantic as it seems. If that is even possible. But in his example some may think, I'd have loved to hear more from him. But there are so many other ex-stars(?) that there is just no time for that ... plus all the currently working ones who throw in their two cents from segment to segment.<br><br>Since there are so many, I'm pretty certain more sequels are about to ... come (yes I had to do at least one pun didn't I?)","user":"kosmasp","rank":[4,5]},{"title":"Just OK - does not take a realistically critical look and focuses on those with a positive experience","rating":6,"date":"31 January 2020","review":"I liked the original After Porn Ends, and the 2nd one was OK, and this one..was about the same as the 2nd, or maybe even a little worse, as it was a bit slow at times, but still somewhat interesting, if you like to hear about the history of porn performers during their careers and such.<br><br>Mainly, the film isn't even talking about post-porn as much as the film is just talking about each performer talking about their careers and the \"good old days\" mostly. Probably 60% of the film, a majority..is just talking about their past times during their careers. Which is definitely interesting if you are a fan of porn history, or of learning about performers lives. But it never actually spends much time looking at performers lives present day. Just a sit down interview with each, where they mostly talk about the good times they had. Only 1 of the 6 or so performers even really had a negative experience overall, and still ends their story in a positive. There are undoubtedly many girls who had negative experiences from porn, who are now broke, or regret it, or worse (dead/overdose etc.) and the film never explores a full scope of peoples lives after porn, pretty much just putting a too-positive spin on it.<br><br>Beyond that, as it doesn't delve into anything that deep, or troubling, it gets somewhat boring as people are just reminiscing again, on good times they had. As I enjoy this genre and subject, I found it watchable and somewhat interesting, but..is not a good film per se, as it is directed by a former/current performer themselves, so the director is likely too close to the subjects, and does not take a critical unbiased look at the industry really. If you enjoyed the first two films in the serious though, it is worth seeing, if you specifically like learning about the state of porn and performers in the 80's/90's/2000's.","user":"johncg25","rank":[2,2]},{"title":"More of the same - continuation of APE 1 & 2 - Brief portraits of ex adult industry performers post their industry careers","rating":6,"date":"19 January 2020","review":"Interesting but not as impactful as APE 1 &amp; 2 - Which had BIG names from the golden age 80s and 90s that are still famous - Seka, Janine, Asia Carrara et al\nOne big name that APE 3 has is Christy Canyon (and maybe Tera Patrick but she definitely not in that same league)\nNow that adult industry and stars have been a regular hohum commodity and mindgeek (owner of Pornhub and zillion other tube sites) has almost killed the classic Adult Industry this is more of a look at the final crop of the old industry stars post their industry careers.\nGiven 100s of tube sites playing millions and millions of clips of performers from 60s to now - not to mention the 10s of thousands of cam models - most of the names unknowns- the golden era of the industry with big-name stars is gone for ever.\nThis serves as a a goodbye note and final hurrah to the closing actors from that age which btw was not so long ago - the early 2000s<br><br>For adult industry aficionados only giving them a fond look back to an age of dvd and vhs now gone for ever.","user":"srirammeera","rank":[2,2]}]