[{"title":"A strong story for women, young and old.","rating":9,"date":"27 September 2019","review":"Despite being from Melbourne and feeling I knew all about the Michelle Payne story, I was presented with a much deeper exploration of this amazing, young woman's life. The story ensures laughter, tears, joy and bewilderment. Great casting in Sam Neill as Michelle's father, Paddy Payne. Teresa Palmer as Michelle Payne, does not disappoint and Stevie Payne is perfectly cast as his infectious self. Many well known Australian faces in the supporting cast, which adds to the strength of this brilliant story. Beautiful cinematography and a musical score which takes you on an epic rollercoaster ride. I needed tissues even though I knew the outcome. This Australian gem shouldn't be missed. See it on the big screen if you can.","user":"bamco-50158","rank":[24,47]},{"title":"Easy to watch","rating":7,"date":"23 September 2019","review":"Rachel Griffiths makes her debut as a Director. The story is based on Michelle Payne who was the first woman jockey to win the Melbourne Cup. You would have to be living under a rock not to know who she is if you are Australian. It is a big deal to win the Melbourne Cup in OZ and for this reason alone the story is interesting to watch. Michelle Payne's story is inspirational and a tribute to her determination to be the top of her field. Stevie Payne played himself and he was given so many witty lines. There is a brilliant line when Michelle Payne asks Stevie if she is good enough to win before she mounts Prince of Penzance. Stevie replies \"I don't know if you are, but he is. He's a champion.\" And the rest is history. Michelle Payne's story is one of remarkable determination.<br><br>From a filmmaking point of view there were a few minor issues such as skirting over the death of Michelle's sister Bridget in a riding accident, trying to go for charm over substance and at times obvious exposition. I think the story could have benefited from more fleshing out instead of just focusing on the known facts.<br><br>There were some problems with the choice of shots. I felt like some of the shots created a lack of atmosphere. The audience was often shown close shots when there could have been mid or wide shots. I would have liked to see more wide shots of the Australian landscape and experience more of what it was actually like for Michelle to participate in a male dominated sport or to actually ride a horse in the event. What we saw was quite limited. There is also the elephant in the room. The lack of exploration about the treatment of horses in the film. Even if it is too difficult to address the abuse of animals by the filmmakers I would have liked to have seen more about horses.<br><br>Anyway making a film is never easy and the team should be congratulated. Worth seeing.","user":"SafChaleur","rank":[17,32]},{"title":"You don't have to like horse racing to enjoy this film.","rating":8,"date":"25 September 2019","review":"Thoroughly enjoyable film. Great storytelling. I know only know a little about horse racing but it is focused more on the human story. Good way to spend an hour and a half.","user":"davidamcdonald","rank":[20,42]}]