[{"title":"Be warned: although \"inspired by a true story\" it is very far from the truth.","rating":5,"date":"2 May 2019","review":"Having researched the life of Melita Norwood - the real name of the fictional \"Joan\" played by Judi Dench in this film - it is obvious that this film has moved far from the truth of the deception that Joan carried out. Norwood came from a fervently communist/socialist household and NEVER went to Cambridge university. She studied Latin and logic at Southampton University for a year before dropping out. There was no love affair with a Russian sympathiser and she worked at British Non-Ferrous Metals Research Association. She had already married a communist sympathiser before she was recruited by the NVKD because she was secretary to the research director at \"Tube Alloys\" a codename for atomic research facilities. She had ZERO understanding of the science and wouldn't have known one end of a pipette from another but she did have access to the research papers which she meticulously photographed and handed over to her Russian handler. History has deemed her deceptions as more damaging to British security than the infamous Cambridge Five.\nThus the film plays fast and loose with the real history and rather cynically tries to entice the viewer into sympathising with \"Red Joan\" (who didn't have a barrister son in real life either). As a total fiction I would have given the film a guarded thumbs up as it is grips the imagination of the viewer but the \"inspired by a true story\" claim at the opening credits is very misleading. Joan/Melita was a traitor as much as Lord Haw Haw and she continued to support the Russian communist cause even when it was slaughtering millions of its own population.","user":"postmortem-books","rank":[130,154]},{"title":"interresting","rating":7,"date":"18 June 2019","review":"If you think you know all there is to know about the spy history since 1945, you will find this film pretty interesting and revealing. i have not heard about the ''granny spy'' until now and its a good melodramatic, historic flick, made for the newest generations.<br><br>judi dench does a remarkable appearance in this drama that jumps back and forth in history, the present is spun around police interrogation, and dialouges with her gobsmacked lawyer son, and the past where we follow the main from studies at cambridge into advancing into assistant at the nuclear research institute.<br><br>its has some romantic interludes here and there, the way they are made weakens the production, because its not profound enough . the score is classic style british drama series style of music, and gives a nice float to the motion.<br><br>its worth a glance thinks the grumpy old man if youre into the war and cold war history, and the keywords are like in many other features to forgive , bow and forget. recommended","user":"ops-52535","rank":[26,30]},{"title":"based - very loosely - on a true story","rating":6,"date":"30 August 2019","review":"Red Joan purports to tell the story of Melita Norwood, a Communist who handed British secrets over to the Russians.<br><br>Dame Judi Dench is the star, but she doesn't have a great deal to do since the story is told in flashback. The workhorse role is Sophie Cookson as the young Joan.<br><br>Joan is depicted as a smart woman working at an atomic research facility. She falls in love with a young man (Tom Galich). Though she continues to refuse his requests, she gradually gives in and hands the atom bomb plans over to the Russians.<br><br>As an elderly woman, she is arrested. It is then she tels her story to authorities and has a confrontation with her son.<br><br>In real life, the character was not seduced into Communism by love; she was a card-carrying Communist from the beginning and never had the boyfriend depicted. Nor was she smart enough to really know the ins and outs of the bomb. Here she is depicted as a talented scientist.<br><br>The Dench character insists that she was trying to help England, thinking that if both sides had the bomb, neither one would use it.<br><br>Melita Norwood stated: \"I did what I did, not to make money, but to help prevent the defeat of a new system which had, at great cost, given ordinary people food and fares which they could afford, a good education and a health service.\"<br><br>While she said she did not generally \"agree with spying against one's country\", she had hoped her actions would help \"Russia to keep abreast of Britain, America and Germany\".<br><br>Dench is always wonderful. All of the acting is on a very high level. The real story of Melita Norwood is interesting. Hopefully, the good thing about this type of film is it encourages people to read the real story.","user":"blanche-2","rank":[14,15]}]