[{"title":"Another remake which simple insults the original.","rating":1,"date":"20 July 2018","review":"Same old story, nothing new, \"two lovers have biggest possible obstacles, and there's nothing important than love in life\".","user":"nikhilraj1990","rank":[136,195]},{"title":"Ignore the haters, it's a great watch!","rating":8,"date":"4 October 2018","review":"I'm actually stunned by the low ratings this movie has received, though it has rightly proven to be a box office success. First of all, I will state I haven't seen Sairat. Maybe Sairat is much greater than this, but that doesn't undermine this movie! Furthermore, Sairat is a regional movie, it can't appeal to all audiences alike, like the way this does. \nDhadak is a fantastic movie in it's own right. You feel for the characters right throughout. The film starts like a normal bollywood romance, a boy meets a girl, they fall in love....romance pursues. But it is the second half, where reality kicks in, is where the film soars. This movie required debutants, who are raw and unpolished. Even Sairat did that. Dhadak does that too. Jahnvi Kapoor and Ishan Khatter are not pros at acting, but thier raw unpolished performances make you believe in the characters. People are silly at making a fuss about nepotism as if they would've done it better than them. We celebrate the likes of Ranbir Kapoor, Hrithik Roshan, and suddenly now we scream about nepotism! Just watch the movie, and enjoy it guys! \nAnother plus point of the film is great music and Cinematography. Udaipur and Kolkata are beautifully captured in the two halves.\nOverall I definitely recommend Dhadak. Ignore the haters. These days it's simply cool to bash bollywood, and go gaga over anything hollywood. It's a trend. Everyone judges movie even before watching them. \nRating- 8/10","user":"mukherjeesubham93","rank":[57,80]},{"title":"Just Horrible","rating":1,"date":"20 July 2018","review":"Both of these stars are just an excuse to work in Bollywood, looks like a c-grade movie with third-class acting.","user":"ARKspeed","rank":[103,155]}]