[{"title":"What a Shame","rating":25,"date":"25 September 2018","review":"I know this isn't Vivian Bang's story, per se, but the director's notes at Sundance indicated that White Rabbit is heavily influenced by her life as an LA performance artist. I wish it was even more specifically her story, cause what we have here is, unfortunately, a film that unfolds in a very predictable fashion. A complaint I often level at \"historical\" films---why am I able to predict what's going to happen next in what should be a wildly unique tale? I shouldn't. The same applies here. Ms. Bang is undeniably talented but she deserves better. She will do better. She is far and away the best thing about this movie. Everything else seems hackneyed and familiar and bargain basement, even by indie standards. The rest of the cast seems like friends of the director or friends of Vivian or random people who were grabbed off the street. I didn't find that charming. I'm ready for a nuanced film about \"the other\" experience. The hammer to the head and the over-the-top obviousness of the oppression render the criticism toothless. It's a shame, cause the problem is real. Nothing new is illuminated here.","user":"SeatontheAisle","rank":[8,9]},{"title":"Amateur Hour","rating":2,"date":"16 August 2018","review":"The lead actor clearly has talent, but everything else about this production screams amateur. Constant issues with focus, machine gun repetition of the word like, and woeful casting (are we really meant to believe he's her boyfriend?) places left this unwatchable. The first 5 minutes should really let us know what the protagonist has to overcome, but this fell short of even that. This was a thankfully shorter film that in essence amounted to watching a woman on her phone and go about her daily life. A filmed blog. The lead actor should go far, she has an abundance of talent, the soundtrack was also first rate but misplaced more often than not.","user":"neilprivate","rank":[6,7]},{"title":"Seems to me like this film had been greatly misunderstood","rating":7,"date":"19 January 2019","review":"After reading some user reviews, it appears people were expecting a full on comedy? A sweet ingénue? Perhaps they were misled by a trailer I did not watch?<br><br>Either way, this is an intimate slice of life type of film, where we follow our main character as she struggles to find her place as an artist and person, making authentic connections, and her lack of direction in her life. There's no narrative structure per se and that works well enough.<br><br>The lead actress had a magnetic presence which made me connect with the story. This might not be everyone's cup of tea but it certainly worked for me.","user":"greensky2783","rank":[2,2]}]