[{"title":"A dull no budget action movie","rating":2,"date":"19 November 2018","review":"The title \"Babes with Blades\" is obviously movie \"clickbait\", but I hoped for at least some fun, but cheesy action scenes and some strong, beautiful women wielding swords. There were women, though I'd only count one of them as beautiful (The striking Yennis Cheung). And only one or two more as attractive. The lead actress, Cecily Fay, had a few good moves, but nothing particularly interesting. The fact that she is apparently a fight coordinator and stunt actor is pretty surprising considering how uninspired and dull the fight scenes are. The script was worse than I expected, but again not surprising once I realized that the Fay wrote it as well as directed. All in all it seems like a vanity project that she somehow managed to rope other people into with promises of beer money I assume. Only giving it a \"2\" because the absolutely outrageous overacting of the character \"Sef\" had me rolling. Even watching it \"free\" on Amazon Prime I felt robbed. Do yourself a favor and stay far away.","user":"bachemar","rank":[14,15]},{"title":"A very poor vanity project","rating":2,"date":"8 February 2019","review":"Where to start.<br><br>OK - so - I wasn't expecting too much of this film apart from being watchable - but it wasn't even that.<br><br>Just about every aspect of this is AWFUL! I appreciate there wasn't much of a budget, but that is no excuse for the lack of attention to detail or making good use of what you do have. The lighting was awful (which was obviously there because it seems the concept of diffusing light to create atmosphere had gone over the head of the production team) as was the rest of the technical side.<br><br>This film has the atmosphere of a bad 1980s VHS corporate training video.<br><br>Then there is the 'action'. Bad. It has more in common with watching kids in a play ground than a professionally choreographed stunt team and the camera angles certainly didn't help.<br><br>It is like NO thought has gone in to producing something that is actually watchable - let alone engaging for the viewer.<br><br>All in all one to watch unless you are in the mood for some seriously bad cheese.","user":"mjsreg","rank":[3,3]},{"title":"It delivers on the title.","rating":6,"date":"7 February 2019","review":"There were babes and there were blades so it delivers on its title. I found the babes to be babely and the blades to be bladey. The acting is what you'd for a low budget film called Babes with Blades but the fight scenes were fun and I liked that it actually shows you the action unlike big budget productions that always do tight shots with quick shaky cuts so you can't tell the actors aren't actually doing any choreography.<br><br>It makes me wish stunt women like Zoe Bell or even Cecily Fay would be the new Captain Marvel or leading female superhero in the next big budget Marvel schlockfests so that at least the action scenes wouldn't have to be pure CGI and stunt performers, Anyway, if you're looking for a movie to have a few drinks to with your geeky friends than this movie will serve you with some silly fun and cool fight scenes while people cosplay.","user":"curtismenne","rank":[6,11]}]