[{"title":"She is not afraid to be herself,","rating":10,"date":"1 October 2018","review":"The documentary let us know her: her honesty, grit, and courage to accept her shadows. Fonda is, for me, a teacher and her course is life.","user":"leamek","rank":[17,26]},{"title":"My new role model.. that's why Jane made those workout videos? for activism funding? who knew!","rating":10,"date":"29 September 2018","review":"Wow..in tears now. this biography narrated by Jane Fonda re-introduced me to her. Who knew she's such a role model? She seemed to have it all, but all the time struggling with confidence and self-identity. She grew slowly and morphed with the 3 husbands, acting roles, and changing the world around her.\n<ul><li>if you have issues with your father/mother, watch this movie. she will empower you.</li><li>if you have issues with an eating disorder, watch this movie. she will empower you.</li><li>if you have issues finding meaning in your life, watch this movie. she will empower you.</li><li>if you have issues with men trying to shape and confine your growth, watch this movie. she will empower you.</li></ul><br><br>Jane Fonda in 5 acts.","user":"ruthshen","rank":[20,32]},{"title":"Jane Fonda: Enter Stage Left","rating":8,"date":"1 October 2018","review":"GRADE: B <br><br>THIS FILM IS RECOMMENDED.<br><br>IN BRIEF: A meditative documentary on the life of Jane Fonda: actress, activist, health guru, and entrepreneur.<br><br>JIM'S REVIEW: Talented documentarian Susan Lacy (Spielberg) has once again set her sights on a show biz icon. With her most recent film, she captures Jane Fonda's complex and mercurial life: Jane Fonda: In Five Acts. She structures her film into five stages in Ms. Fonda's life. With title cards titled Henry, her childhood and early times with her father; Vadim (Roger), Tom (Hayden), and Ted (Turner), life with her ex-husbands, and the final chapter named Jane, her later years, the film explores her life as actress, activist, health guru and entrepreneur.<br><br>There is much to learn about Ms. Fonda's career by hearing some surprising details about her backstory: her fractured relationship with her unloving father and troubled bonding with her mother, her early start on Broadway and film, her romances with the men in her life who molded her into various roles, her rise to activist causes, her interest in wellness, and her subsequent ventures into producing and mass-marketing herself. Interviews, archival photos and videos, and film clips fill out her story very well.<br><br>The film is well researched and the actress is open and honest with her facts and opinions. (\"I grew up in the shadows of a national monument...my dad!\") But at times, some scenes seem manipulative and staged for empathic effect. Later portions of the film are a direct mea culpa to her neglected daughter, Vanessa, and a plea for forgiveness for some (not all) of her statements and behavior during the Vietnam War when many Americans considered her to be a traitor and nicknaming her \"Hanoi Jane\". One also wishes more film clips of her earlier films were shown.<br><br>What we see on the screen is a larger-than-life profile of a woman fulfilling her life journey...waiting for Act 6 to begin. An insightful film worthy of your time.","user":"jadepietro","rank":[13,23]}]