[{"title":"Why Is This A Documentary About Women?","rating":1,"date":"25 March 2019","review":"There really is so little that this documentary does right, and so much that it does wrong, but namely, I find myself absolutely forced to give it a 1 star rating because it fails to live up to it's title, or examine its premise properly, and thus lacks any degree of insight in regards to the question. The title, and subject is not \"A woman's sex drive.\" It's \"Do women have a higher sex drive?\" Higher than who? Higher than men. That means, in order to properly explore the question, you need to examine the sex drive of both men and women, more or less equally, because whether or not the question is true is completely dependent on the nature of a man's sex drive. That being said, I do not have a problem WHATSOEVER with a documentary which exclusively explores female sexuality and completely ignores male sexuality; however that's not the stated objective here, and the constant question being posed to each interview subject \"Do women have a higher sex drive?\" to which, by the way, there is no clear consensus given in the documentary.<br><br>Instead you have one blanket statement/assumption after another being made here, particularly in regards to male sexuality. \"Men only care about seeing raw sex or a naked woman in porn; women are looking for a very special and developed aesthetic.\" That of course is the stereotype. It doesn't describe me though. I have a very particular aesthetic, and every male friend I know has a very particular aesthetic. I post videos/pictures of women and porn to my friends all the time, and everybody has very particular preferences. In the end, I'm perfectly willing to accept the possibility that I'm wrong or abnormal, but if that's the case, you better present me with some empirical proof. That being said, when we look at the like bars on porn streams, that is a form of empirical proof, and quite consistently the videos that get higher ratings within the categories that I like, are visually, thematically, and contextually much more developed, and those are the videos I like the most as a man, which other men seem to agree with. In light of this, I can't confidently say that men are more prone to scrape the bottom of the barrel when masturbating to porn, and neither can you.<br><br>This movie was one example after another of people running their mouths when they don't know what they're talking about. This one lady, for example, was trying to make the point that women have a higher sex drive than men, because the annual sale of female sex toys is higher than the annual sale of pornography. Ever heard of porn streaming, love? The vast vast majority of men masturbate to porn without paying for it, so it's very clear to me that you're trying to paint a picture based on what you personally want to believe, and you're willingly ignoring any data that disproves it. This one lady in particular, (the one with the horrendous lisp) I don't even think she knows what a sex drive is. She cites women being obsessed with male performers like Justin Bieber on a level that men typically don't obsess over female performers, as proof that women have a higher sex drive, for example. That's called infatuation. I know what that feeling is, because I myself have felt deeply deeply in love with people, and It's not the same thing as sexual arousal. If you think it's the same thing, it's because you have a low sex drive, have never been able to clearly identify both things separately in your mind, and are trying to reconcile the fact.<br><br>The lady who worked as the editor of Playgirl made a lot of really biased blanket statements as well. Supposedly what made the magazine unique is that it was catering to a female aesthetic. In her view, EVERY single porn entrepreneur who disagreed with her aesthetic, rather than simply wanting to cater to an existing market demand, were instead trying to suppress a growing market demand, and that eventually playgirl went bust, not because of her own failings, but because it began catering to the existing market. She couldn't CONCEIVE of the idea that there really never was a huge market demand for her own personal aesthetic. You can really take this at face value for what it is... The fact is, if you're any good as a businessman, you can actually do both: cater to an existing market, as well as tap into a new audience (if it exists in the first place). According to her, tapping into the gay market is partly what killed the magazine. Interestingly, the porn director who was interviewed later seems to directly contradict this idea, saying that women often prefer gay porn, because of the way it shows off the male body. Again, this speaks to how poor a documentary this is, because the film makers did absolutely nothing to fact check this discrepancy, or explore the subject further.<br><br>The editor of Playgirl also takes credit (by proxy) for inventing the CFNM subgenre, and characterizes it as a female oriented subgenre. There's a lot to consider there, but from what I've observed, CFNM is a very male oriented subgenre, especially if you take into account the fact that one of the most successful CFNM sites on the internet was DancingBear, and it garnered an almost strictly male audience. In fact, it was so successful in this regard, that the parent company \"MorallyCorrupt\" ended up producing a gay oriented spin-off to it. Why is CFNM popular amongst males though? This is common knowledge by now: because it familiarizes the female performers to the male audience (they look like the girl next door). Again, the film makers have zero insight to offer here.<br><br>One question I have is why the hell are we focusing on playgirl in the first place, and not the infinitely more successful and universal playboy, which the former is directly trying to emulate? Playboy can tell us a lot more about what ordinary people actually wanted to see, and by periphery, can do a great deal more in terms of exploring the issue of the human sex drive, be it male or female, and which one is higher. Playgirl tells us about what nobody cared about, male or female, and that's why it went bust. The subgenre she was pushing, (men being portrayed as submissive and subservient) appears to be very unpopular, and only exists in extremely niche areas on the internet today. In other words, yes there's a market for it, but it never became big. By Interviewing someone like her, all you can expect is exactly what you got, someone who's desperately trying to save face in light of her failed project. She was out of touch then, and she's out of touch now. Who cares what she has to say, especially if you're not going to cross-examine ANYTHING she says?<br><br>Another example, You have this one feminist who starts off by saying \"One big historical claim is that prostitution is the world's oldest profession, but if we listen to 'herstory' it's actually widwives, and the Church principally charged midwives as witches because they had a lot of power.\" Ok great. First of all, why should I take your word for it, and secondly, I have no idea how you think you can prove that prostitution is not older. Also let's not ignore her entire premise that history as it's taught is biased, and that what she's saying is the objective truth, even though she cites zero historical sources. The fact is, when you use a made up word like \"herstory\" it directly denotes a built in bias despite the fact that you're accusing others of bias. Why can't you be objective? I don't need your stupid revisionist history if it's going to be emphatically and unapologetically biased with no evidence to back it up, thanks.<br><br>Really, What this documentary should have been titled is \"Female Oriented Women Pontificating About Sexuality In An Echo Chamber,\" because that's all it is. A lot of blanket statements are made with very very little empirical data or statistics used to back up anything said. That's ok in the context of an individual interview (I don't necessarily expect every interview subject to come with stacks of research studies in what appears to be a casual conversation). The problem is, this film is almost entirely based on interview footage, and there comes a point where the film makers really do have to do some backup research, if they expect the audience to get anything out of this. Instead, you have these back and forth interviews where the questions and answers are clearly filmed separately and edited together very awkwardly afterwards.<br><br>Typically in documentaries like this, the interview subjects are directed to speak in a lot of full sentences, and the interviewer is cut out altogether. This works well because the answers often are then used to lead into informational backdrops, which is what this film severely lacks. Instead, what you have is a really naive looking girl asking a bunch of dopey rhetorical questions where she's repeating back what the interview subject is saying half the time, as a question. Nothing is challenged, and nothing is added by a single thing she says, and she appears to have no education whatsoever on ANY subject mentioned in this video, and not a single thought in her head about human sexuality. Hilariously at one point, she even expresses being confused at whether she does or does not have lesbian urges, to which the porn director, pretty much the only person interviewed who I actually liked, gives her this facial expression \"Well I dunno. I guess you better sort yourself out.\" Sadly, speaking completely honestly, I get the impression that the interviewer is the director's girlfriend, who had this horrible idea for a film, and he got pressured into doing it for her. If that's the case it's a shame, because I thought his 2013 documentary was very interesting and insightful, which is the only reason why I bothered to see this documentary, but I don't think I will bother with any of his future projects after having seen this complete and utter mess of a film.","user":"Brakathor","rank":[22,23]},{"title":"Millennial cluelessness","rating":1,"date":"10 September 2018","review":"Don't waste your time with it. Lots of opinions, little facts, a lot of false information. Like describing Jennifer Lyon Bell as \"multi award-winning director\".","user":"w-bogdan","rank":[45,53]},{"title":"poisoning","rating":1,"date":"4 October 2018","review":"A good documentary about this topic would be how men and women are complementary in their differences...","user":"kdws3","rank":[32,37]}]