[{"title":"A Slow, Riveting Drama","rating":8,"date":"14 September 2018","review":"There are far too many films that go unnoticed each year and fall by the wayside, being remembered as a little gem of the year that it was released. While Monsters and Men probably won't make any of my must-see lists, it's a shame that this particular movie probably won't find a large audience. It's stories like these that explore the issues we face on a day-to-day basis that never get seen. People ask for movies that they can sympathize with or relate to, but they hardly ever turn out to see them. It's sad to say, but most independent movies don't receive the box office return that they deserve. If you notice Monsters and Men playing in your city and are ready to sit down and witness something raw and true, then here's why I definitely recommend checking this one out.<br><br>After resisting arrest, a young man is unarmed but gunned down by the officer anyway. Monsters and Men follows characters during the aftermath of this police shooting and how it affects the lives of others, regardless of whether or not they had been related. The core story revolves around the teenager who filmed the shooting and how it affects him on an emotional level, a police officer who is ridiculed for the way that he chooses to look at the event, and a young baseball prospect, who happens to have a policeman as a father. The way these stories sort of intertwine will either work for you or it won't, but I found this particular story to be incredibly engaging.<br><br>Many viewers may be thrown off by the slow pace and long scenes of self-reflection, but I personally found these moments to non-verbally give depth to each of these characters. For instance, the opening sequence of the movie showcases an off-duty cop being pulled over, simply because the colour of his skin didn't sit well with the police officer who pulled him over. This sequence sets the overall message of the movie in motion and his police officer easily became my favourite portion of the film, delivering one of the best speeches I've heard all year. It's quite eye-opening and really makes you think twice about the way news and media manipulate stories on a daily basis.<br><br>Where this film started to lose me, however, was in its final few moments. Once the first two acts conclude and every message the film wanted to give has been given, you can clearly see where the film will probably end its run, and it does nothing to deviate from that. The story is the strongest when it's following these characters, but it becomes a very simplistic film by the end. I found myself wondering why the filmmakers chose to end on such an easy note, but it also doesn't hurt the movie in any way either. I was frustrated, solely due to the fact that the performances were terrific and the story progressed so nicely, but it chose to play it safe (possibly to not offend or manipulate any of its viewers).<br><br>In the end, Monsters and Men is an upcoming feature film that I don't believe is receiving anywhere near the marketing that it deserves, which is a real shame, due to the fact that it's quite a good film all around. From the quiet moments that build character, to the score that almost becomes its own character, to the continuous messages placed throughout the film, I was engaged from start to finish. There are surely some moments that play it too safe, but this is a very well-crafted story that deserves to be seen by many. I recommend checking it out if it's playing in your area, or even on demand eventually.","user":"kjproulx","rank":[30,41]},{"title":"\"Monsters and Men\" vs. \"The Hate U Give\", and the winner is...","rating":7,"date":"13 October 2018","review":"\"Monsters and Men\" (2018 release; 05 min.) brings the story of three black men. As the movie opens, a black guy (we later learn his name is Dennis) in his car is pulled over for no apparent reason. After the cops check his driver's license, they tell him \"sorry to bother you, you are good to go\", but what the cops don't know is that Dennis is a copy himself (off duty at that time). We then get to know Manny, who is filling out a job application to become a building security guard. After coming back home in Brooklyn, he notices a commotion, and comes close, filming the whole thing. A black guy in a store is surrounded by 6 or 7 cops. At some point a shot is fired and the black guy is killed. Later on, Manny struggles whether to release the footage. At this point we're 10 min. into the movie. In the third story line much later in the movie, we get to know Zyrich, a high school baseball phenom. To tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this is the feature-length debut from writer/director Reinaldo Marcus Green. Here he tackles an all too familiar topic these days: police brutality, in particular white cop against unarmed black man. It is very easy to fall in the trap of stereotypes (all cops are bad!!!), which this film thankfully avoids (unlike another recent movie--more on that later) hence credit must go to Green for providing a more nuanced perspective. In that sense, Dennis (the black cop) plays the most important role in the movie, and the casting of John David Washington is a stroke of genius, as he is outstanding, just as he was in \"BlackkKlansman\" earlier this year. Washington brings Dennis as an earnest guy who tries his best in a difficult environment. The story line of Manny is also top notch. So far, so good. Alas, the last third of the movie, centering around HS baseball phenom Zyrich falters badly. I see what Green is trying to do but it simple does not feel authentic or credible. But overall I still quite liked the film. This is in stark contrast to that other recent \"white cop brutality against unarmed black man\" themed movie, \"The Hate U Give\", in which there literally isn't a single decent white person (let alone a cop) in the movie and all African-Americans are 'good' (but for the token black drug king). By all means stay far away from \"The Hate U Give\".<br><br>\"Monsters and Men\" premiered at this year's Sundance film festival to good acclaim. It recently opened at my local art-house theater here in Cincinnati. The early evening screening where I saw this at turned out to be a private screening as in: I was literally the only person in the theater. Hopefully this movie will garner a wider audience when it becomes available on more platforms. If you are interested in important social issues that are brought in a nuanced manner, I'd readily suggest you check out \"Monsters and Men\", be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion.","user":"paul-allaer","rank":[15,22]},{"title":"Realistic","rating":9,"date":"8 March 2019","review":"There are no stereotyped villains or good guys in this film, only different people reacting in different ways to the same event, which we never actually see. In that it resembles what we usually learn from what we regard as \"news.\" This film is seriously under-rated and is one of the most realistic cop films I've ever seen.","user":"jrwygant","rank":[10,14]}]