[{"title":"The main characters suck.","rating":6,"date":"11 February 2019","review":"I'm just going to be blunt here: The main characters suck. The main protagonists, a brother and a sister, are depthless and one dimensional. The sister literally spends 90% of her lines crying or shouting for someone to save her. The brother is arrogant and apparently a \"genius\", yet seems to have no redeeming qualities. Overall, the story and CGI are decent, but the characters leave much to be desired.","user":"jasonshuhezhang","rank":[404,512]},{"title":"Really misses the mark when trying to deliver a majestic and moving sci-fi experience","rating":6,"date":"30 April 2019","review":"Having raked in over $600m at the box office, The Wandering Earth is yet another massive blockbuster from China. However, like so many enormous Chinese blockbusters in recent years, it's all style and no substance, with excessive emphasis on special effects and incoherent fantasy that really impedes any attempts to craft a more elegant or majestic space opera.<br><br>And that's where I want to start, because from the beginning of this movie, you'll likely be reminded of a number of other films that go about telling sci-fi stories in a rather different way. The Wandering Earth is based on a novel of its own, so it's not in any way a Chinese remake, but the premise and key ideas explored in the film, particularly in the opening act, are hugely reminiscent of both Christopher Nolan's Interstellar and Stanley Kubrick's 2001: A Space Odyssey.<br><br>Now, both Interstellar and 2001 are absolute masterpieces of modern sci-fi, because they tell a fantasy story with a stunning sense of grandeur and majesty that can't be achieved in any other genre. In that, while both movies have a plot and characters of their own, it's almost as if space itself is their main component, with astonishing visual effects playing into an eye-opening and almost spiritual depiction of the final frontier.<br><br>The Wandering Earth, on the other hand, takes a far more simplistic and unfortunately dull approach to telling a sci-fi story. It does have the special effects to dazzle (although I talk more about that in a moment), but it feels so much more like a formulaic space adventure movie, rather than the majestic space opera that it's so desperately trying to be.<br><br>Its opening sequence depicts the ever-intensifying threat of celestial destruction, and throughout, the film relates personal difficulties and tragedies in tandem with the danger of space travel and colonisation. And yet, while all of those ingredients make the film ripe for the sort of emotionally hard-hitting and elegant watch that is a great space opera, it's all overwhelmed by its more basic blockbuster tendencies.<br><br>In that, the film's quartet of young leads takes a little of the grandeur out of the story, bringing it closer to something reminiscent of the YA genre, while the special effects are often totally over the top, with an excessively brash and chaotic depiction of the dangers and threats present in space, something that really isn't necessary, as proved by better films such as Interstellar and Gravity.<br><br>On top of that, its near future setting, although only in the late 2050s, feels light years away from the present we know today. Unlike Interstellar, whose near future is almost identical to the present day, The Wandering Earth is full of fantasy and sci-fi gibberish about the Earth of the future that's both fairly incomprehensible and difficult to relate to, further taking away from your ability to emotionally engross yourself in the story and feel the real power of what this story has to offer.<br><br>And I say that because, despite not thinking much of the movie, there are moments where the film really tries hard to be something more majestic and elegant than just another space adventure. Its fantasy and excessive special effects often make it feel more like Jupiter Ascending than Interstellar, but there are a few moments of emotional intrigue and pathos that do indicate its intentions, and briefly provide an engrossing and impressive respite from an otherwise both chaotic and formulaic movie.<br><br>Overall, then, I wasn't particularly taken by The Wandering Earth. Its ambition is clear from the start, and with a premise that's reminiscent of real greats of modern sci-fi, it should have been an elegant, moving and majestic watch. However, with a generic plot that's far heavier on brash special effects, fantasy mumbo jumbo and chaotic action, it really misses the mark when delivering a sci-fi that's a little more special to the normal fare.","user":"themadmovieman","rank":[199,267]},{"title":"Incredible effects, unlikable characters, confusing story line","rating":5,"date":"8 February 2019","review":"Went in with big expectations as a fan of Liu Cixin's Three Body Problem. Have not read Wandering Earth, so can't compare, but perhaps reading it would have made the movie easier to follow. Outside of Wu Jing, the main characters in general were hard to like, especially his son Liu Qi and adopted daughter, Duoduo, both acting like petulant children. Expected high levels of cheesiness, but the jokes fell flat and the emotional tear jerking scenes were milked dry. While you should go into a sci-fi with an open-mind, temporarily suspending reality, this had hole after hole and jumped all over the place. At one point, one of the special force team members suddenly fell on his face - he froze to death for no apparent reason. Kind of summed up the movie. While I am sure the novel is as unique as anything Liu Cixin has written, the movie is a lesser version of Armegeddon, lacking the fun, character building (I know, I am talking about a Michael Bay movie) and star power. Did enjoy seeing a Chinese perspective and wasn't overly nationalistic like Wu Jing's former Wolf Warrior. Living in Shanghai, was also fun seeing the city and the rest of the country highlighted as it fell beneath natural disasters, joining NYC, Paris, London and the rest of the major cities that regularly are destroyed for popcorn munching sake. China continues to head in the right direction when it comes to great movie making and hope it continues. If anything, this has me heading out tomorrow to buy Wandering Earth, the novel.","user":"kmsmith-61353","rank":[203,286]}]