[{"title":"So Many Questions","rating":10,"date":"1 July 2018","review":"It begins in 1980, when a new student at an upstate college is greeted by returning students. How was your summer? Good to see you! He thinks it's weird until one guy stares at him. \"Were you adopted? What's your birthday?\" It turns out he has an unknown identical twin. When the story hits the newspaper another one pops up. They bond. Everything is wonderful, except that each set of parents is outraged. Why weren't they told? They would have adopted all three!<br><br>At this point I was starting to lose interest, as it looked like it was turning into a story about lawsuits and people declaring what they would have done versus a well-meaning charity's understandable policy -- people may want to adopt a baby, but who needs the expent and tsuris of three? However, the story took a turn with a interview with an investigative reporter and a report of identical twins being deliberately separated for cold-blooded study... and by the end the trail had led to a powerful Jewish charity and an archive in Yale that's sealed for almost half a century more.<br><br>I'm a great fan of the ability of movies to tell a story, but I have rarely seen a documentary that told such a disturbing, heart-breaking factual story. I thought myself inured to the cruelty of people, but I left the theater asking how could these people, of all people, have thought to have done these things? It's also an investigation into the character of three people, the question of nature versus nurture, and the issue of free will. Quite simply, it's one of the best documentaries I have ever seen.","user":"boblipton","rank":[89,117]},{"title":"Brilliant - proof positive of that old adage that real life is stranger than fiction","rating":9,"date":"27 April 2018","review":"Incredible well constructed and very well written, beautifully paced and staged.\nHonest heart moving testimonials underlined with stunning analysis and shocking revelations.<br><br>One of those documentaries that very carefully balances the emotional temperatures of the subjects discussed.<br><br>Very honest directing and as perfect an editing job as I can imagine.<br><br>These guys are at the top or their profession.<br><br>Thank you both the director and editor for coming to Hot Docs 2018","user":"michaeljtrubic","rank":[86,114]},{"title":"Three Identical Strangers (2018)","rating":7,"date":"1 July 2018","review":"Normally, I'm not super into documentaries unless the subject matter is something I have a heightened interest in. I watched Won't You Be My Neighbor? earlier this year and thought it was actually excellent. So was hoping for a similar type of reaction with Three Identical Strangers. The trailer did a job of garnering interest because it seemed like a rather incredible set of circumstances. Overall, this documentary absolutely delivers, and is surprisingly quite dark.<br><br>The film is about the real life events of three men finding each other and realizing that they are in fact identical triplets. What's more crazy, is the fact that each of them have the same mannerisms and many of the same tastes in everything. Of course, questions arose as to why the triplets were separated at birth and not adopted together. The dark secrets of the adoption center are revealed in this documentary and questions arise as to the ethical nature as to what happened to these triplets.<br><br>From beginning to closing credits, this is an enthralling story. I have never even heard about this case, despite the brothers being located in New York. Its super hard to talk about the film without the twist that comes halfway through the film. It actually is crazy and makes you consider how dark and twisted human nature can be when they feel their actions is considered important and necessary. Its super hard not to talk about it, all I can say is you need to see this film.<br><br>Its a film about an event that is extremely joyous in the beginning. But as the film goes on you realize that the lives of these separated triplets is marred by tragedy and controversy. Its a documentary that will get you to think and wonder and talk. Its an important film for its social context and its psychology. There are some good stuff out this summer and this is something I hope people see.<br><br>7.5/10","user":"rockman182","rank":[51,69]}]