[{"title":"\"there's a good film in here\"","rating":6,"date":"13 November 2019","review":"This would appear to be the same film as Speckles: The Tarbosaurus (2012), the animation is really nice, but the voice acting and dialogue is to be desired. There's one use of 'crap', they also reference to 'god' 'chickens' and some of other modern vernaculars that I didn't think really fitted with the prehistoric setting. It is scary, a little unsettling and dark in places, with death scenes, and the final scenes feature a beast which is quite terrifying for smaller children. That being said, it is almost entirely Finding Nemo x The Lion King x The Land Before Time. Good for a one time watch family movie night for dinosaur fans age 6+","user":"stronglook","rank":[6,6]},{"title":"A good mindless Dino adventure I didn't know I needed","rating":7,"date":"27 December 2019","review":"As someone who loved the 1st film, I was quite glad to see a sequel to that film.\nAfter watching the film, I would say it may not be as good as the last film, but still an entertaining time none the less\nI would say there are many similarities to classic Disney films like finding nemo, the lion king and even Disney Dinosaur and I don't mind, even with the basic story, bad eng dub, decent animation and speckles being a completely different character (which makes sense seen as he doesn't really know how to be a good father and he reminds me of my own dad in some ways), it's still a fun ride and a decent sequal to an underrated film.\nIf you liked the first film, then you'll find something good about this one and if they make a sequal to this one, I would like to see where they go with it","user":"brayluvspriz","rank":[4,4]},{"title":"Very good movie, like Disney's \"Lion King\", but for Dinosaurs","rating":10,"date":"27 March 2019","review":"I saw this title on Google Play Movies one week ago. The movie is very good, my five-year-old son loved it. The movie very much resembles Disney's original \"Lion King\", but the time is prehistoric and the main characters are a Tarbosaurus family, when only the little one survives and the movie follows his adventure trough the ages to become the king of the jungle.<br><br>Very good movie, the story is good, very good visual effects, great dinosaur computer models and animation. First dinosaur movie I see from South Korea, but I hope they make more like this one!<br><br>Some dinosaur fight scenes might scare some kids, so I would say tell in advance your kids something to prepare them. My son is now 5 and he is used to watch dinosaurs, so he was fine with this.","user":"StrayFeral","rank":[14,20]}]