[{"title":"A real treat","rating":10,"date":"29 January 2019","review":"Got to see this at the premiere at Sundance and the crowd loved it. Brittany is a character you want to root for. The story and acting are spot on. Avoids some of the cliches of feel good rom-com films, and is genuinely funny and touching.","user":"chris-938-4571","rank":[71,99]},{"title":"Fantastic","rating":10,"date":"31 January 2019","review":"Just saw this movie at Sundance premier. Went in knowing nothing about it . Came out feeling absolutely high. Don't want to set it up for a fall, because one never knows what the capricious world will deal a movie, but I hope it finds the huge audience it deserves.<br><br>Actors were all unknown to me, but apparently products of the NY stand up and improv scene, and every one of them-- from the incredible lead who plays Brittany, to her sort-of, kind-of, love interest, and all the supporting players in between-- deliver hilarious, authentic, and heart-felt performances.<br><br>The plot will sound a little well-worn, but like any journey, the details and specifics are where it finds its foothold-- it is about a drifting early-30s single woman in NYC, dealing with lack of self esteem, weight issues, and general absence of motivation and employment.<br><br>As she slowly works her way towards a lost or missing sense of self worth, she discovers running, and sets her sights on running the NY Marathon.\nShe also manages to strike up a fledgling relationship with a fellow drifting 30 something who shares a dog-sitting job with her, in which they both ridiculously and hysterically abuse their job of essentially watching a dog, by deciding that the town house it lives in actually belongs to them.<br><br>There are countless obstacles on Brittany's road to self worth, from friends who aren't really friends, to substances, to dates gone wrong, but again-- the biggest obstacle she faces is herself.<br><br>It culminates in her running of the NYC marathon, and the footage all appears to be clearly from the actual event, adding to the feeling of authenticity that permeates the whole endeavor.<br><br>There is also a wonderful element of diversity in the film-- socioeconomic, racial, sexuality-- that is wonderful, in part, because I really only thought about it after it was all over. Nothing about it felt token, or as if it was there to make a statement. It was simply part of the fabric of the life of these characters and their relationships.<br><br>Again, elements of this will sound like they might be similar to other comedies of recent years (\"Trainwreck\" may share a few strands of DNA), but this inhabits rare real estate-- it is hysterically funny without going for cheap or easy laughs; it has pathos without being maudlin; and has at its core a beating heart without an ounce of saccharine. It is about a journey that almost anyone can recognize-- kind of the only journey worth taking-- the struggle to love oneself, and in the process, love others, and let others love and care for us. I was among the countless people in the audience who were crying at the end while laughing (what't the word for that? slaughobbering? blaphering?).<br><br>I hope every person involved in this endeavor, from the writer-director, to the entire cast, finds great success in the future, but that is trite to say-- they already have a huge success in \"Brittany Runs a Marathon\", and if they did nothing else (which WON\"T be the case), they should take tremendous pride in this gem.<br><br>I can't wait to see it again. And probably again after that. See it whenever you can.","user":"jnatale-27498","rank":[66,99]},{"title":"Inspiring, Funny and Real","rating":7,"date":"5 December 2019","review":"Jillian Bell has been stealing scenes as a bit character since her turn as the acid-tongued roommate in \"22 Jump Street.\" Now finally receiving her chance to shine in a starring role, she brings the same energy and proves herself more than capable of leading a movie.<br><br>Bell plays the titular character, Brittany, who has a weight problem. But that's far from the most significant problem she faces in her life. Her other issues are far heavier and more complicated. Brittany doesn't like herself. She glances at the mirror, doesn't like what she sees, and equates that image to her self-worth, which leads to her making hapless life decisions, including choosing the worst type of relationships. Her skinny roommate treats her like a lower lifeform, and all the men Brittany meets behave even worse.<br><br>To address her weight issue, she takes up running around the city streets of New York after realizing she is too broke to afford the absurdly high city gym prices. Her first run plays out like a scene in Vertigo, as she is terrified to step outside her apartment building but eventually jostles toward the corner of her seemingly endless street, striving to run just one block. As her bravery and stamina increase, Brittany dares to join a running group with her upstairs neighbor and experienced runner, Catherine. There she meets fellow jogging struggle buddy, Seth, and the three of them form a friendship.<br><br>Brittany started running to tackle her weight problem without realizing that she was also helping cure her other issues as well. By spending time with people who treat her with decency - \"they're called friends\" - as one character points out, Brittany's self-esteem slowly grows. She even meets a nice guy, who she claims she will \"never date.\" You can probably guess what happens.<br><br>Sure, running the marathon is an amazing accomplishment, but learning to value herself has a much more significant impact on her life.<br><br>I give the filmmakers credit for avoiding the sappy, manipulative story the movie easily could have become. Instead, the movie remains consistently respectful of the audience's intelligence, at times even sprinkling in semi-subtle commentary on the destructive force of social media.<br><br>Ultimately the movie manages to be inspiring in a believable way that is completely unforced. Give a lot of credit to Bell and writer/director Paul Downs Colaizzo on this one. They make Brittany a character worth rooting for and her journey a compelling one.","user":"Jared_Andrews","rank":[17,22]}]