[{"title":"This film isn't that great, but it's not as bad as they make it out to be either..","rating":6,"date":"20 June 2019","review":"Daughter of the Wolf is a new action-thriller film, that stars Gina Carano and Richard Dreyfuss.<br><br>Now i didn't have any problem with the movie and it's story, and scenery and cinematography and all that, i thought it was all great.\nSo i don't understand all the negative reviews with all these people, i don't think they have anything better to do with themselves but be negative.<br><br>But anyway the only problem i had is that there simply isn't enough action as a whole. With a former Mixed Martial Arts star in the lead role, you would expect the movie to be action-packed from start to finish. Instead, there is much more drama and story line which is okay too. Now this film's biggest crime isn't that it is boring - it's that it just doesn't take full advantage of the situation it's in.<br><br>Richard Dreyfuss's performance - is the movie's biggest highlight. Dreyfuss, really hams it up in his role here. Additionally, the film looks very impressive on a technical level, so it would have been a major disappointment had the movie not at least looked nice<br><br>And starring Gina Carano, you would think that there would have been plenty of great fight scenes but there isn't anything great. Still i like Gina Carano, and with her presence, and her fist-fighting credentials, hopefully she will land some good action film roles soon.<br><br>Overall, Daughter of the Wolf isn't that great, Apart from a crazy wacky performance from Richard Dreyfuss as the villain, but it's not as bad as these negative reviewers make it out to be either..<br><br>Conclusion - If your a fan of Gina Carano like i am, then i suggest you watch the movie anyway!<br><br>Rated this 6/10","user":"HarryLags","rank":[32,43]},{"title":"The wolf","rating":4,"date":"5 July 2019","review":"This whole movie the best acting was done by wolf..\nGood one wolf..","user":"drhajermohdd","rank":[22,32]},{"title":"Deserved a Better Screenplay","rating":6,"date":"12 August 2019","review":"\"Daughter of the Wolf\" is a film that deserved a better screenplay. The landscape and scenery are magnificent and the viewer sees the film expecting a better resolution of the story of a skilled military woman that has her teenage son abducted by criminals. Unfortunately the screenplay is very weak and confused, with poor character and situation development. Anyway it is not as bad as many reviews indicate and may be watched with low expectations. My vote is six.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[17,24]}]