[{"title":"103 Miniuts of my Life wasted","rating":1,"date":"29 September 2018","review":"103 minutes of my life I will never get back watching this crap movie, £25 spent on Pop corn, drinks, petrol I will never get back, poor story line, rubbish acting","user":"ozzie187","rank":[13,13]},{"title":"I really wanted to like it...","rating":2,"date":"5 October 2018","review":"I really wanted to support the cause and I did make it through to the end credits. \nBUT it really was bad. It reminded me of one of those really bad soap dramas on terrestrial TV when you're abroad. In fact that's pushing it, at least those soaps have a plot you can understand even if you can't understand what they're saying! <br><br>It felt like different parts of the film were made by different people with different skill levels, different budgets, different visions and different scripts. \nLike they all went off and made their bit independently, then someone else tried their best to stick all the pieces together and make sense of it all. <br><br>Some good scenes, music and even 'some' good acting. But so far and few between. So much of it was that bad it was almost painful to watch. A real shame especially after the first one. \nTwo stars because I feel bad it was that bad.","user":"Soris23","rank":[14,15]},{"title":"Don't bother watching this shambles","rating":1,"date":"27 September 2018","review":"One of the worst films I've ever seen. I had high expectations after watching the first one and I was extremely disappointed the acting was shocking (you couldn't even understand what the jamaican characters were saying) the camera angle was odd it looked like something from YouTube, some of the scenes were too prolonged that it took out the authtenticiy of crime in london and last the story was tedious it was hard to interpret what was going on. It looked like they focused more on spending their money extravagantly on wild locations or making parties look lavish than actually working on the movies story. Some scenes were ruthless like the ones in the first film that made it look gritty. Not good enough to make it a watchable film though don't waste your money like i did","user":"bomia4","rank":[9,9]}]