[{"title":"\"Superfly\" is Harmless Pulp in a Serious World","rating":4,"date":"14 June 2018","review":"If you walk into Superfly with the intention of not taking it seriously....it's actually pretty fun for all the wrong reasons. What makes Superfly work is its jaded views on street credibility and several of the lead actors to bring some much needed levity to what is a rip-off of every crime drama that came before it.<br><br>The plot is all you have heard a million times before. The whole \"one big score to end it all\" after a traumatic moment, corrupt cops, navigating through a Mexican drug cartel, all wrapped into a copy and paste style script. What makes it a little more worth while is the rival gang Snow Patrol, which is gloriously over the top in literally all white everything and filled with actors overacting in ways I haven't seen in a movie in a long time. So it's sad to say that there is a long period where they aren't the focus and the film reverts into familiar cartel territory, which is not investing at all.<br><br>Trevor Jackson is okay in the lead role, but is clearly outstaged by his co-star Jason Mitchell, who is having more fun in the role than he is. He plays it pretty straight, but doesn't stretch his range out enough to make him captivating. Also the film runs 20 minutes too long and could have sliced a large amount of the ending to keep it more focused and internal.<br><br>Superfly is simply harmless pulp that was close to being a guilty pleasure. In a post-Black Panther world, films like Superfly will have to beef up their reasons for existing by either going all the way absurd, or just asking new questions these characteristics. It's crime isn't its influence, but instead it lacks wings to truly fly.<br><br>Rating: 4.5 / 10","user":"travishouze","rank":[64,80]},{"title":"Watched the original","rating":3,"date":"13 September 2018","review":"Trash, What's the point , just watch the original that's how to make a great \"blacksplotation\" film not this , why make a sequel that is so inferior to the original ? Don't bother !","user":"deanstevencallan","rank":[23,28]},{"title":"When Worldstar meets The Chappelle show","rating":2,"date":"18 June 2018","review":"I went in with an open mind but that quickly changed. Seeing how relevant the original was to the times.(although it was also panned by the NAACP as glorifying street life). The lead in the original at least had the viewer understanding his angst as he wanted out. This version , I don't even know or care why he's disillusioned. The females representations are embarrassing .The Snow Patrol was straight out of a cartoon..(cleaning bill must be a mother). New Jack City was a better story on a drug dealer. You loved or hated Nino, but you had an opinion.. I particularly hated the gun play and Car chases.. In the original, I don't remember anybody getting shot.. This was just a way to get the shoot-em up fans and the Fast and Furious fans together.. I just think this was a story that didn't need to be remade..","user":"kbrown760","rank":[50,66]}]