[{"title":"Very Disappointing","rating":1,"date":"9 February 2019","review":"My girlfriend and I were looking forward to seeing this. We walked away very disappointed. Teraji P Henson's is a favorite of ours but we found ourselves not even wanting to root for her character.<br><br>I like slapstick or over the top humor in measured doses as much as the next guy, but the way her character was portrayed felt more like a mixture of over acting, completely unbelievable behavior in the workplace, and borderline psychotic behavior.<br><br>In fact, it was a near perfect portrayal of a psychotic disorder. Through most of the movie she almost completely lacked guilt or remorse, was narcissistic and severely lacked empathy. She was dishonest and manipulative and superficial and reckless.<br><br>There's a scene with her father, played by Richard Roundtree, where he attempts to explain her behavior as an unintentional side effect of him not trusting people after his wife left. It just doesn't wash.<br><br>We could have forgiven some of this but other issues abounded. For example, the majority of the cast came off as hugely unintelligent. And the affection and loving reaction of her would be love interest, portrayed by Aldis Hodge, to her unfeeling, unloving, selfish behavior, makes no sense at all, unless you fancy imagining a man with no self esteem.l whatsoever.<br><br>What happened to movies with believable, identifiable, and lovable characters? Why couldn't her character be portrayed as someone you can honestly believe is real? Or decent, for that mater? Someone who is having real life problems, not just that she's crazy?<br><br>We felt insulted just watching the various scenes with her. Also, why did 90% of the men have to be portrayed as dogs, completely unfaithful to their ladies? It's one thing for a man to have thoughts about another woman, like noticing her features, but it's quite another thing to consciously plan adultery or cheating.<br><br>The movie makes fun of straight men and homosexuals, but often does it in a demeaning way.<br><br>There was just nothing endearing about most of the characters. This movie was painful to watch. We barely made it through it.<br><br>She repeatedly demonstrates a complete lack of empathy. She shamelessly uses people. It's clear from the beginning that she is unstable. Her work relationships are unrealistic. She's unprofessional. My girlfriend and so actually felt embarrassed for her.<br><br>Look, if you love her like my girlfriend and I do, you will forgive some of these problems and laugh and enjoy some of the movie, but it will test your loyalty to her. It's a horrible movie. She should be ashamed.","user":"brian-mcintire","rank":[180,238]},{"title":"Both Men and Women want the same thing - a decent film !","rating":2,"date":"25 March 2019","review":"Honestly this was rubbish<br><br>I can't think of one redeeming feature of it ?<br><br>The script was awful full of stereotypes and cliches . Full of thinly disguised racism , homophobia , sexism and misogyny<br><br>This was no female version of Jerry McGuire yet it could have been - it could have been a film about female empowerment against a backdrop of male dominated sports agencies .<br><br>The sex scenes were embarrassing and diabolical . There was little of any humour and as soon as she received her inevitable knock on the head you wished you'd also been knocked out and woke up in a different film !<br><br>If this was television , netflix or Prime you'd stop it or switch channels - unfortunately it's cinema so you feel compelled to stay to the end , sadly I couldn't I tried but in the end I had to walk out . I tried to stay till the end but it was just so flat .<br><br>It's so sad that films like this get distributed when there are so many other worthy films out there that never the exposure .<br><br>You have been warned !<br><br>Rubbish 2/10 Pad.A","user":"Padreviews","rank":[86,110]},{"title":"Nothin' like Mel Gibson's great movie \"What Women Want\"","rating":2,"date":"1 March 2019","review":"Flat out this movie was too gross to appreciate the infrequent funny lines. This is about a nasty female in corporate America. I was surprised and disappointed in Taraji taking on this kind of low-class role. For me there was nothing at all entertaining about this movie and it ticked me off seeing another portrayal of this type of woman. I'm trying to think of something to say about the movie, but I can't. It had nothing in it to make it stand out. It was silly and portrayed the ugly, nasty side of some women today. Ultra formula comedy and a waste of film, imo. Gosh, I really dislike it when they put out trash like this...as you can probably tell.","user":"coastdaze","rank":[111,144]}]