[{"title":"Three Months of April","rating":8,"date":"21 April 2019","review":"This is a good movie about two teenage girls developing what could become one of the important friendships of their lives. But there is a major wrinkle which could blow up this budding relationship. Clara is dating Nick, April's ex and April still has strong feelings for him. The best and most convincing stretch of the movie is the segment in which April's feelings of jealous rage slowly and unwillingly morph into the realization that Clara is really cool and nice and has more in common with April than anyone else she has ever met. So the girls become best friends and try to keep this secret from Nick. This seems unlikely to work at all in the age of social media, but at the director's Q&amp;A, he said that the film, written by Hannah Marks, who plays April, was in fact semi-autobiographical.","user":"reidandgenene","rank":[13,18]},{"title":"'Banana Split' and 'Booksmart' - 2 great teen dramadies","rating":8,"date":"5 April 2020","review":"A nice charmer around a surprising bonding experience that develops between two high school girls in a love triangle with a common boyfriend - Nick - where ultimately their love and kinship for each other wins out.<br><br>They both bring hilarity to most of their life events and the challenges of their new relationship - offering dining etiquette advice to movie house patrons, maintaining their clandestine but 'rule based' friendship, and mixing in and out of other usual high school social scenes.<br><br>Other characters that include April's meddling, precocious little sister with an advanced vocabulary, her grounded mother, her kooky less inhibited friends and the sympathetic but wary guy pal all add to the humor set to some nice sun-drenched CA backdrops.<br><br>The moves and paths of high school to college are pretty familiar, lost jobs, driving tests finally passed, acceptance to distance separated colleges but lovable characters, their relationships and witty dialogue always makes each journey especially unique and entertaining.<br><br>The shared relationship eventually comes to a strained reckoning but the reconciliation is overcoming and the resulting love/friendship heart warming resolution even better.<br><br>Just another in a series of superbly written, witty and entertaining teen dramedies that should give 'Booksmart' a run for its money this year.","user":"jgm-55786","rank":[3,3]},{"title":"A sizzling flirty comedy.","rating":7,"date":"7 April 2020","review":"This is not a chick flick. This is a seriously witty, flirty, sexy observation of teenage years.\nThe chemistry between Marks and Liberato actually sizzles off screen and makes your toes tingle. I could 100% imagine these two as a couple. It's down to nothing other than fabulous acting.\nI put it on to watch Liberato who I've not seen for some time, and ended up a big fan of the film and the 2 leads.\nBeautifully done film","user":"Boristhemoggy","rank":[1,1]}]