[{"title":"An enjoyable and funny movie","rating":8,"date":"16 March 2019","review":"PLEASE pay no attention to the first reviewer here. Watch the movie and decide for yourself whether you enjoyed it or not. I found this movie to be quite good. I am keeping it as will watch again in future.<br><br>The movie has several funny parts and I mean I had several lol chuckles throughout watching it. You can't help but laugh at the \"Never heard of it\" line used frequently. And the one guy during the last shootout that was so fast, you never saw him draw. That was hilarious.<br><br>If you do like westerns, at least give this one a chance and you may end up having an enjoyable evening.","user":"hifrmny","rank":[32,41]},{"title":"A pretty cool 2018 B Western. Go with the flow and have some fun.","rating":7,"date":"15 March 2019","review":"After reading a number of reviews on IMDB, I hesitated to obtain and watch Big Kill. Since I really like Westerns and they seem to be a dying breed, I threw caution to the wind and decided to watch it anyway. Bottom line: It's a very decent example of the genre, which is a throw back John Ford camera stylish modern western (with some overhead shots Coach couldn't film). It has some problems related to over saturated color, semi-bizarre costumes (over the top) and HD camera style which keeps the homage from ringing too true but it is sui generis and as such, is interesting. I think they carried off their homage well enough that you can enjoy it as an pseudo old fashion, modern filmed western and it deserves an audience. Good actors, fun story, a sense of humor and great shoot-outs. It isn't exactly a classic but it is as good or better than most of these B style westerns in the past few years because it dares to be different but also classic enough to be a genuine western. I definitely recommend it, especially if you are an aficionado of the genre. ie: If you like westerns, in general, you shouldn't miss this stylish update of the classic form.","user":"michaelseither","rank":[23,31]},{"title":"Fun, But Don't Expect an 'Open Range'","rating":5,"date":"21 June 2019","review":"Actually liked this film, but you need to drop preconceived expectations that it is a serious western. I definitely felt a chemistry among the actors...it seemed most were actually enjoying their characters. A few good laughs and general entertainment value is what I got out of the film, and frankly, that's what I was looking for when I hit \"play\".","user":"paradiseimp-39245","rank":[11,14]}]