[{"title":"A very simple idea that feels thoroughly authentic","rating":6,"date":"16 December 2018","review":"\"Rückenwind von vorn\" or \"Away You Go\" is a new German 2018 movie, premiered in theaters in March here. It is a fairly short film at 75 minutes only without credits, but this certainly helps in keeping the film essential and is exactly right this way. The writer and director is Philipp Eichholtz, still a relatively young filmmaker and this is his third full feature film. It takes us into the life of Charlie, a young teacher, and we find out about her struggling love relationship with her boyfriend as well as other relationships with family members and colleagues. That's a very basic summary. You could say it is a coming-of-age story if the protagonist wasn't slightly too old for that already. She is not a teenager obviously. But she is all about finding out who she is, where and with whom she belongs and what makes her happy too. I enjoyed this film. A lot at times. It is slightly funny occasionally despite never trying to be a comedy. Also the characters are very well-written and also portrayed in my opinion. There is really a whole lot attention to detail I must say. This film has some nice heart that makes it easy to cheer for the main character and to feel that you want her to be happy. Obviously, for me as a straight male, her looks aren't hurting either, but lets not go into detail about that. Lead actress Victoria Schulz carried the film nicely, also the scenes when she was on her own basically, like with the school children. And maybe it is eventually about being on one's own. None of the kids know at the very end she was about to leave the city, the country even minutes ago before making another decision. Before making the right decision you could say as this is about her finding happiness herself, independent from men, independent from other humans you could actually say. I am a bit surprised she even got in the car herself, but yeah she finally made the only right decision for sure. It's a touching film, tough to categorize as it is not really a family drama, maybe a relationship drama? I don't know. There are several memorable scenes though like the one when she is dancing with her colleague after her boyfriend does not want to go with her. Or when we see her boyfriend play some multiplayer online game and she is talking and metaphorically shooting herself with the fake gun. And these are just some. Still the film does not try to tell us it was all lost. There were moments between her and her man when they seemed very much at peace and in harmony with each other and everything else would have been unrealistic because they are a couple for a reason and otherwise they would have split before the film. Okay like i said, this is a very simple plot and this film is a good example how such a plot executed with precision and understanding about human relationships can turn into a really good film. I think you should check it out. Certainly one of the better German movies from this year, maybe even on the extended list of best German films of 2018.","user":"Horst_In_Translation","rank":[1,1]}]