[{"title":"Brilliant old school revenge","rating":8,"date":"13 January 2020","review":"I have to say that this was a brilliant film. With the UK the way it is, the law being taken into your own hands seems ever more real than ever. An unforgiving killer against the drug dealing scum of London whilst the police have to work out the reason for it. It is Death Wish with twists and turns you only find on a corkscrew.<br><br>Some good humour and references to other films and TV, I personally loved the Simpsons bit, it was a refreshing change from half of the rubbish that is released nowadays.<br><br>If you want a good film with a nice little twist, then watch this film.","user":"uzach","rank":[18,20]},{"title":"This director gets better and better","rating":7,"date":"13 January 2020","review":"This kind of movie borders in the genres I love but is not my usual view but had to check out this one because of the director. I saw his last film and this one is even better.<br><br>The standard of the film is really good, with some great shoots and beautiful frames. There is a whole variety in how the story line is delivered, with the past and events overlapping, so you can get the full insight into events played out. Actors done a really good job with being naturalistic and believable.<br><br>Most importantly the film conveys that lines can get blurred. It's a film worth seeing!","user":"craventodd","rank":[18,20]},{"title":"Some weaknesses but still huge fun","rating":7,"date":"4 February 2020","review":"Some weaknesses but still huge fun It's distinctly slow to get going but worth hanging in there for. The opening 20 minutes is story set up and character introduction but when that mid-point kicks in so does the fun and action. It really becomes something else, not like many of its counterparts.\nThe plot may go over the heads of the basic fisty cuff, T&amp;A lovers of lo budget indie flix but for those with an IQ over 10 you will dig the effort made by the story and by the acting to.\nIt aint perfect but for all its flaws, theres not many, it still is tremendously enjoyable, entertaining and with a feel good factor by the ending.<br><br>Worth the watch.","user":"annieringading","rank":[16,18]}]