[{"title":"\"I'm a writer from the paper\"","rating":1,"date":"15 March 2018","review":"The heading for this review is an actual line from the movie, it's how a reporter introduces themselves before asking someone for an interview, \"I'm a writer from the paper\", brilliant, just brilliant.<br><br>This movie is from The Asylum and if you haven't heard of The Asylum they make knockoffs of big budget movies using as little money as possible, when Transformers came out they released Transmorphers, when Pacific Rim was released they released Atlantic Rim, and now with the release of Tomb Raider we have Tomb Invader.<br><br>All the usual suspects that you'd expect from an Asylum production are present in this movie, a cast of nobodies who can't act, cgi that would have looked bad in the 90's, terrible directing and a lousy script, it's just your typical terribly bad Asylum film.","user":"freqeteq","rank":[47,56]},{"title":"Far from badass","rating":2,"date":"2 May 2018","review":"Have made no secret in the past of intensely disliking, and even outright hating a lot, a vast majority of The Asylum's (near-universally maligned for good reason) output, though there is curiosity as to whether they are capable of making something good and compulsive about their output's badness. Admittedly, The Asylum do have a small group of watchable films and the occasional (big emphasis on that word) above average one, unfortunately outweighed by the lacklustre at best and often dreadful films they churn out.<br><br>'Tomb Invader' is not one of The Asylum's all time worst, they've definitely done worse that have been more amateurish and insulted the intelligence more. With that being said, even when taking it for what it was, and from watching other films from The Asylum it is abundantly clear it shouldn't be taken seriously, it was a very poorly executed film, compensated only by the lead performances being reasonably competent. 'Tomb Invader' believe it or not is not a blatant rip off of 'Tomb Raider', instead it was made to capitalise on that film's release. <br><br>Regardless of what people's stance is on 'Tomb Raider', despite the critical reception being fairly lukewarm, those who hated it will find themselves appreciating it after watching 'Tomb Invader'. 'Tomb Raider' was not a perfect film, far from it, and was not exactly great, but count me in as somebody who found it a quite entertaining watch.<br><br>Visually, 'Tomb Invader' looks incredibly cheap even for something made on a low budget. It's very drably and sometimes dizzyingly shot, incoherently edited (bacon-slicer-like) with glaring and unforgivably sloppy continuity errors and even the scenery doesn't make much impression despite being actually the least bad aspect of the film. There are worse special effects in other Asylum films, they still look very cheap though and like they were an afterthought and made in haste. Am aware of the film being low-budget, but there are examples of low-budget films that still don't look awful and manage to be pretty good.<br><br>Can remember little about the music, which tended to be intrusive, annoying and out of place. The script makes little sense, sounds awkward constantly and on the wrong side of camp throughout.<br><br>There is absolutely nothing thrilling, tense, suspenseful, emotionally investable or fun about the story. The predictability may have been forgivable if the film was actually engaging let alone exciting but it fails to be either throughout. 'Tomb Invader' is basically non-stop dullness, and intelligence-insulting ridiculousness, with unintentional humour because of the excessive cheese, numerous illogical moments, bouts of mawkish drama (couldn't get behind the whole derivative and over-sentimental mother gone missing stuff) and irritating character behaviours that makes one endear to them even less in a film with not one interesting or rootable character.<br><br>Although there are worse-acted The Asylum films, the acting generally is not good at all. Actually the leads are not bad, and the reason why 'Tomb Invader' hasn't been rated a 1, particularly Gina Vitori. The supporting cast however all round are shambolic, with lots of over-compensating and an equal amount of sleepwalking, and one of the film's biggest failures. The direction is not worth mentioning, due to being a large part of the film's failure. <br><br>Overall, very poor and far from badass. 2/10 Bethany Cox","user":"TheLittleSongbird","rank":[9,9]},{"title":"It's Asylum people!","rating":4,"date":"16 March 2018","review":"Anyone who watches an Asylum film expecting anything more than absolute schlock (the un-funny kind) really has been hiding under a rock for the past 20 years. Tomb Invader doesn't disappoint when it comes to low-budget, poorly-scripted, minimally-produced Asylum footage.<br><br>It's surprisingly not the worst of their films. It's almost halfway nearly decent. The script is terrible, but the acting isn't bad (in fact Samantha Bowling does an unexpectedly good job of it). The CGI is awful and the running around endless caverns is ridiculously time-wasting. The jokes fall as flat as a body that's been stone-rolled, and the ending is as un-brilliant as ever. But it's not actually \"Asylum\" bad... which is unexpectedly not absolutely terrible. It is a waste of time and has no redeeming factors, but it's not dead skunk. Better than most Asylum films, but It's still a \"watch when you've got absolutely nothing better to do\" brain-veg film.","user":"Snootz","rank":[16,21]}]