[{"title":"My Review Of \"Carga\"","rating":6,"date":"16 March 2019","review":"Gaston's story hangs precariously between respectful storytelling and sensationalized thriller. The subject matter is horrific in and of itself. Human-trafficking and exploitation of women and children is an ongoing plague within society. Gaston highlights just one of those stories. It is dark, inherently disturbing and heartbreaking. At times \"Carga\" expresses the horror perfectly- in a cringe worthy manner, and at other times the film seems insincere, or unnecessarily over-exaggerated.<br><br>As good as the acting is, and the cast really are committed, the choice to lean more into thriller territory, as opposed to a more psychological drama telling, does deminish the depth of the characters a bit. Still \"Carga\" is a compelling story and the commitment of the cast shows throughout. The depressing scenes that contrast a perverted, almost mimicry of compassion from the victimizers, against harsh cruelty in the victimization is a little hard to watch, as they peirce at the heart and mind of the viewer.<br><br>Overall Bruno Gaston's \"Carga\" is film worth watching. The subject and the events that transpire in this nightmare could be plucked from any country and exist as a harsh reality regardless of nationality. It could be you, as the film jabs starkly into our psyches, more to the point - what if it was your, or your neighbor. In the end this is an act of violation to us all, aso a society we are all complicit and victims of Human-trafficking. \"Carga is worth checking out.","user":"ASouthernHorrorFan","rank":[9,10]},{"title":"Depressing, interesting, but missing something","rating":6,"date":"17 March 2019","review":"Slick well dressed Russian dudes forcing girls into a dirty lifestyle abducting them and prostituting them. That's what you'll get here. A lot of liberties taken (obviously, it's a movie so there has to be an aspect of entertainment) otherwise the subject matter would literally make the movie unwatchable (watch \"Lilya 4-Ever\" if that's what your into, though).\nAll the stuff about the sex trafficking is pretty interesting but hard to watch. It's not going to leave you feeling good, that's for sure. It may have the opposite effect, watching girls covered in dirt and cuts gets raped while they scream bloody murder, not exactly for everyone.\nDefinitely not a great movie (a bit confused why the baddies are Russian: not sure why it's necessary we sympathize with the evil characters so much: for sure it's focus drops and stops having the punch it started with).\nWould have given it 5 stars but since it actually tries to spread some awareness gave it a little higher.\nIf you can stomach it watch this instead of some easily digested Hollywood movie, feels more rewarding.","user":"colinwohlrab","rank":[3,3]},{"title":"too slow","rating":5,"date":"26 March 2019","review":"Too slow too slow boring\nit is a pity because it could be a great hard movie to watch but i repeat it is too slow","user":"bouhanamarc","rank":[5,7]}]