[{"title":"Interesting concept hurt by poor execution","rating":6,"date":"30 May 2019","review":"This felt like a stripped down, summarized version of this story. No time is really invested into characters, so you don't really feel anything for them. The concept, while fascinating, is never fully explored. The actors all do their best though and are solid throughout. The film is also surprisingly gore-filled and there were some genuinely queasy moments. Everything just chugs along at a breakneck pace and it plays out as you'd expect. There was an opportunity to take a lot of chances with this story, but it decides to settle for being a mildly entertaining flick.","user":"cardsrock","rank":[321,421]},{"title":"Wasted potential","rating":4,"date":"25 May 2019","review":"This film pitched a very simple question - 'What if Superman was evil?'. After watching it, I feel like this was a marketing ploy used to sell the script and bring audiences to the door. Honestly, if you take the Superman aspect out of it, this is really just your generic low-budget horror flick. The gist of it is a kid wants to be evil one day and just goes ahead killing people. That's really it.<br><br>This is one of those rare stories,that I feel could really benefit from an additional 30 minutes. The fact that the runtime is limited to 90 minutes, results in a lot of rushed scenes, which are consequenced by my biggest complaint, the editing. It feels like they shot all the scenes individually,but had no idea how to transition, so they stitched them together. You're just bouncing from scene-to-scene-to-scene and it's incredibly jarring. There are several moments when I thought, yes, this is interesting,but please slow down so I can marinate in it. Nope,next scene.<br><br>There are,however, a few redeeming aspects. The actors do a really good job, and I really wish they had more time to sell us on the material. The gore,is actually quite good; there are some really brutal, bloody moments that I enjoyed. And finally, the creative decision to add Billie Eillish' 'bad guy' was genius.<br><br>Overall,I don't really know what you're looking for in this story. If it's a dark Superman twist, you won't get it. If it's horror, it's mediocre. As a slasher gore film, not bad at all. I'd classify this as wasted potential.","user":"deandsouza15892","rank":[327,455]},{"title":"Wasted potential","rating":5,"date":"8 December 2019","review":"Brightburn stars Elizabeth Banks who is trying to have a child with her husband, but when an alien spaceship crashes in Kansas, they adopt the child and raise him as one of their own. What if Superman became evil is what I would sum up Brightburn in a nutshell. And it does have an interesting concept, it's just poorly executed. This is produced by James Gunn, the same man who gave us two Guardians of the Galaxy. And what I think is that James Gunn had this interesting concept for this character and all the pieces were there. But instead of coming up with an intellectual script, the script writers took the pieces, threw it into the trash, and turned it into a generic horror film. It's as if almost everyone took a different approach, and decided to turn this concept to what if Superman was evil? to What if Jason Vorhees or Michael Meyers had superpowers? But even Jackson A. Dunn who plays Brandon Beyer has zero character development and is annoying from start to finish. There's no character development anywhere. No questions as too where he came from? Who are his parents? How'd he get his superpowers? There's no explanation. They just turn him into a psychopath and he starts killing innocent people who didn't deserve to die just because he didn't get his way. And to me that feels lazy and the entire movie feels half baked. So in the end, while it does have an interesting concept, it just left me disappointed, cause they had so much material they could've worked with, but they took the easy way out.","user":"andrewmerritt-31652","rank":[34,46]}]