[{"title":"PUNCH ME IN THE FACE FOR WATCHING THIS","rating":2,"date":"29 January 2020","review":"Let's make a really really low budget movie with a terrible script, terrible acting, worse plot that has an over the top message that violence against women is bad, the masses are ignorant and.... Who the hell knows.<br><br>What a waste of time!!!","user":"me-389-325519","rank":[36,55]},{"title":"That's almost the way to do it.","rating":6,"date":"23 November 2019","review":"'Judy &amp; Punch (2019)' is a reimagining of the long-standing, problematic 'Punch and Judy' puppet show, ostensibly from Judy's perspective. The concept is, I suppose, rather interesting; it's a feminine (no rape) revenge movie with the possibility of pointing out its source-material's numerous narrative flaws. Sadly, the piece never quite seems sure what it wants to be, delivering on the set-up but struggling through the pay-off. Its tone fluctuates wildly; it's unsure if it wants to be humorous or horrific. It's quirky, for sure. One of the main problems is just how much time we spend with Punch. The flick clearly wants to be Judy's story, empowering and unconventional; it ends up relegating her to the sidelines for quite a while, though. It doesn't live up to its potential, especially in this regard. Basically, the thing just never clicks. It feels rather awkward, in a way, and it's somewhat lacking in confidence. It isn't all that engaging, really. It also isn't particularly affecting and, frankly, it ought to be. Still, it isn't without its merits. Its conceit is, as I mentioned, intriguing and its message is solid. It's also reasonably entertaining, never even threatening to become dull. It's generally well-made and makes some distinct decisions, standing out from its peers in several aspects. It's a decent film, don't get me wrong; it's just not a great one. It doesn't quite connect the way it should and, ultimately, that's what lets it down. It still beats the puppets, though. 6/10","user":"Pjtaylor-96-138044","rank":[18,26]},{"title":"Sadly, not quite the way to do it...","rating":6,"date":"29 November 2019","review":"The quirkiness of this film starts in the town of \"Seaside\" that is nowhere near the sea, but doesn't really extend much beyond that. It reminded me a little, in style at any rate, of \"Sleepy Hollow\" but without any of the fun or vigour. The \"Punch and Judy\" theme is of a peripheral relevance that seemed more designed to tweak the interest of the audience to go and see the film than add anything significant to the plot. \"Judy\" is pretty much sidelined from early on and thereafter, this is a bit of a hotchpotch of themes that meanders about quite a bit before coming to a rather unfulfilling conclusion. I'd wait until it hits the small screen, if I were you...","user":"CelluRob","rank":[9,16]}]