[{"title":"Boring Ugly Film with HORRENDOUS Animation","rating":1,"date":"6 September 2018","review":"OK, first of all this is based on a comic book series of the same name. Now there difference is that while the comic book contains fantastic illustrations and art-style, this film opts to uses horrendous CGI that looks like a series of cut scenes stitched together from a bargain bin Playstation game in the 90s. There are barely any textures or proper lighting used in the animation and the characters move very awkwardly, and to be honest, even the character designs themselves are ridiculously ugly. I get that they tried to make this cuter than the comic book so that it attracts a younger audience but it reflects no artistic skills, attention to detail, or even creativity and imagination. It's like they just slapped this project together with the goal of making money. It looks and feels so uninspired. It's quite sad and pathetic. Even the storyline is boring and uneventful. The saddest part is that this film was produced by Arcana Studio, the company that makes the comics...and the writers and artists were totally on board for it. How they agreed to release this abomination is beyond me. In conclusion: Sit this one out; it's not worth your precious time.","user":"MinistryofDoom","rank":[9,11]},{"title":"Worst animation EVER","rating":1,"date":"26 February 2019","review":"Even the worst zombie movie I was forced to watch had more life in it.\nBrain dead and simply a waste of time.\nThere are not enough words to express how bad this dribble is.","user":"wimgielenglas","rank":[4,5]},{"title":"Below mediocre","rating":4,"date":"23 September 2018","review":"As mentioned in other reviews, amateurish animation, but not so nearly amateurish as the script. The saving grace of the film was making the point \"War is not the solution to our problems\". Beyond that the concept was bland, characters cliche, and voice acting only as good as the script allowed. It's not a \"bad\" movie, just not good enough to call tolerable. Not even good as a children's film, as much of the morality-play aspect will be beyond their understanding. The ending (just after the credits start to roll) is incomprehensible and without point.<br><br>Basically, this is an unbelievable tale that really seems to make no point other than \"Don't be the bad guy\". Yeah, we get that much. How about the point, \"If you're going to make a movie, make a good one\"?","user":"Snootz","rank":[2,3]}]