[{"title":"Great fun gem of a movie","rating":8,"date":"24 November 2019","review":"People rating this movie a 1 or 2 are simply just wrong. Your reasons for a low rating like that is just ridiculous. It's a comedy horror and clearly states that and the trailer clearly shows you that. Sooooo why moan about it having comedic moments in the movie? Just plain dumb.<br><br>This is a comedy horror done right, it's dark humour breaks up the gore and violence up perfectly. The characters are perfect from the creepy over the top aunt to the leading protagonist Samara weaving. Acting is on point and the movie never slows up(dig to the crazy person saying it's boring)<br><br>The movie actually has an ending, and what a great ending too. The movie delivers on everything they intended to give you and more.<br><br>Sooo don't listen to the non constructive low critics and make your own decision and go watch","user":"scottliddle76","rank":[243,328]},{"title":"Lots of gore and laughs","rating":8,"date":"31 October 2019","review":"Yes, it is a horror. Yes, it is a comedy. Yes, it is a great watch.<br><br>I laughed a lot watching this movie. I also cringed a few times from the gorey horror. I didn't know much about it going in. I honestly couldn't pick how it would end which means I was interested the whole way through.<br><br>I liked all of the performances, especially those of Samara Weaving and Adam Brody. They had interesting characters. Andie MacDowell and Henry Czerny were great too. Everyone was. No one let the team down.<br><br>I really enjoyed this movie. I honestly don't understand all the 1 and 2 ratings. Even if you didn't like it, it doesn't deserve that low of a rating. It was just a really fun movie to watch. Give it a chance.","user":"TreasureHunterGirl","rank":[168,244]},{"title":"Can't understand the low ratings","rating":7,"date":"23 November 2019","review":"It is a great thriller with a good dose of comedy. It doesn't set out to be taken seriously, it is just a great hour and a half of fun. Just a great watch. Give it a chance; I would love to watch more titles like this one.<br><br>It doesn't waste time with useless background, we all know what we need right from the start and that's it. After that, it's just a fun ride.<br><br>Samara Weaving is the absolute best, she mixes fear, irony, humor and toughness like no one else. Loved her in The Babysitter and in this one.<br><br>Just go for it.","user":"alfredocardoso","rank":[135,203]}]