[{"title":"Powerful Inspiration","rating":10,"date":"18 October 2018","review":"No, I'm not inspired to free climb El Capitan or any slope. I'm an 84 year old retired businessman still trying to figure out how to best live my life, and I left the theater last night in awe of Alex Honnald's achievement -- climbing an almost vertical granite wall in a little over three hours when, in any second, the slightest mistake would result in death.<br><br>Watching Alex do it -- watching the joy in his face when he got beyond some of the most difficult challenges as well as on the top,\\; watching the intense focus and concentration as he sought safe holds; watching what I read as his quiet determination and confidence when he approached the wall for his solo climb -- these images will be with me for the balance of my life.<br><br>They will return to me when I need focus and concentration in the moment to achieve something. They will return to me when I need to build confidence and determination to achieve a goal. They will return to me as I examine and release thoughts of fear that I conjure up (but I'm not blessed, as Alex is, with an amygdala that does not respond to fear inducing visions).<br><br>Thank you, Alex, for the powerful inspiration.","user":"doron-87394","rank":[459,476]},{"title":"Great bio-pic / climbing movie","rating":10,"date":"6 October 2018","review":"I've wanted to see this film since I first heard it was being made. Reading about the soloing of El Cap in the summer of 2017, I was riveted. The film is just as, if not more, powerful than the best articles at the time.<br><br>Alex Honnold is, well, a bit of a weirdo, but I would not expect less from someone who has achieved something no other human being has. As he says at one point in the movie, \"No one who is comfortable and cozy has ever achieved anything great.\"<br><br>The sequences of him climbing are extraordinary, terrifying, emotional, moving and awe-inspiring. Not just the sequences of El Cap, but all around the world.<br><br>But, there is so much more: his relationship with his family, his friends, and girlfriend are ... complicated. His recipe for potato-spinach-chili is sublime, and the method by which he consumes his food ... unique.<br><br>Go see this movie now! Why don't distribution companies release movies like this wider? I had to drive 30 miles to see it instead of 2 miles to my local cinema. Not everyone wants to see CGI-heavy superhero movies, especially when real superheroes exist.","user":"mtlott","rank":[198,219]},{"title":"Absolute horror","rating":10,"date":"13 February 2019","review":"By far one of the best horror films I have ever seen.","user":"joninimaki","rank":[273,309]}]