[{"title":"This is why independent film exists.","rating":9,"date":"25 October 2018","review":"If you have read the other reviews, then you will know that this movie is being judged for all the wrong reasons. Jim Cummings put his heart and soul into this film and because it is listed as a comedy and a drama, some have decided to deride this film because of it. It is what most would call a Black Comedy. I saw the official trailer for it, and anyone that saw the trailer would know that this is more drama/tragedy with dark comedic elements, but there are pedants here in internet land that wish to harp on about this film not being properly categorized. Get over it and watch the movie, because it is brilliant!\nIf you have ever experienced loss, then you will connect to the main character's myriad emotions. Jim Cummings does an excellent job as the beleaguered protagonist, and the film moves along at a stride that fits his circumstance, culminating in a third act that is a bit surprising, but fitting. I also loved Macon Blair (Blue Ruin), as Crystal's teacher. Independent films are not for everybody, and many of them are poorly executed, cast, or directed, but Thunder Road is the reason why I watch them, because, otherwise, all we would be presented with are big studio, unoriginal bombastic gunfight and explosion filled sensory overload. I like those movies too, but sometimes, it is a treasure to see a finely crafted and emotional character study.","user":"mb-cunningham","rank":[94,117]},{"title":"Unexpected excellence.","rating":10,"date":"24 October 2018","review":"A wonderful film that I certainly wouldn't say is a comedy. The film's moving as it's devoted to the human will, what it can endure, what it can overcome in the most dire of circumstances when need be. I feel as though it's a testament to the human experience. Life can hit you hard, over and over again, and you have to get back up, that's the message I gleaned. Cummings portrays his character with masterful skill, at no point did I think I was watching a film, I was all in and I truly hope we see more of him. This is a story of hope even though at times it is hard to see it.","user":"thegermanhermit","rank":[62,90]},{"title":"Is Jim Cummings the next can do it all rising star???","rating":9,"date":"2 October 2018","review":"Saw this a Hell's Half Mile Film fest in Bay City, Michigan and Jim Cummings wrote, directed and gave a stunning lead performance in this festival gem, which I believe is his first full feature after bouncing around doing short films and a little TV work. He has the acting chops to pull off his own written vision of this unstable police officer who can slip from calm, deranged and sorrowful multiple times within one scene. Impressive for he must do this most if not all of this 90 minute film carrying off this complicated character through losing his mother, wife in divorce, his job and every thing he holds dear as he sinks into despair. I hope this propels his movie making skills to new wide release films in the future.","user":"yooper365","rank":[77,115]}]