[{"title":"waste time!","rating":1,"date":"31 January 2019","review":"Don't watch! Totally waste of my time!\nit totaly SUCKS!!","user":"kevintbk","rank":[3,5]},{"title":"Burlesque of Bond","rating":5,"date":"24 February 2018","review":"It begins with a marriage, but it's not a tragedy, it's a burlesque. Lawrence Cheng is about to get married to Ada Choi, but it's all a ploy to steal her godfather's nuclear bomb. He's a spy you see, just like James Bond -- even the music cues are similar. When he wrecks the bomb before handing it over to his agency, in the interest of world peace, he is fired and loses all his gadgets and Aston-Martin. He becomes the lowest form of private eye and gigolo, while Miss Choi joins the police force and rises to become commissioner, while writing him thousands of jaywalking tickets. Then one day her uncle does something crazy and she can't investigate without looking like she's usng public resources for private interests, so she must call on Mr. Cheng.<br><br>The jokes in this one wobble a bit between making fun of the Bond franchise for its sexism, but there are occasional jabs at other aspects of pop culture that make some people users and others losers: Japanese girl bands that prey on socially awkward youngsters are just one of the scattergun targets. Eventually it comes together in a plot of sort, but it has too many targets to be really good. Even so, it keep me smiling throughout.","user":"boblipton","rank":[5,11]},{"title":"A Hong Kong nod to the \"James Bond\" franchise...","rating":5,"date":"21 September 2018","review":"\"Agent Mr. Chan\" (aka \"Dong du te gong\") was not an outstanding movie, but still it proved to be entertaining enough for a single viewing. When I found this movie and got the chance to sit down to watch it, of course I did so out of my fondness for the Asian cinema.<br><br>There were sporadic moments of fun and enjoyment to be had throughout the course of this movie. But the overall impression was, sadly, a very mediocre end product. Which was a shame, because the movie definitely had potential to be much more than it turned out to be.<br><br>\"Agent Mr. Chan\" is definitely borrowing heavily from the \"James Bond\" movie franchise, for better or worse. And it is done in a way that I can only believe as done in tribute or homage.<br><br>This is the type of movie that once watched it is very likely that you will never returning to watch a second time.","user":"paul_haakonsen","rank":[2,3]}]