[{"title":"Powerhouse acting!","rating":8,"date":"21 February 2018","review":"A very emotional and strong mother-daughter drama. One of the best acted films I have seen on the Berlinale so far. Its a moving story of a woman who returns into the life of her former friend and slowly trying to claim back the love of her estranged daughter, who is risen by her friend. The italian film is simply shot but with a great touch for emotionality. Valeria Golino has a great comeback role. Such great emotional strength as the woman who fights for her adopted daughter but still tries not to risk the friendship of the woman who is causing the trouble. Alba Roherwachter plays that woman and delivers a raw and very honest performance. Its hard to dislike her, even with all the mistakes she is doing. The true star however is Sara Casu who blew me away with such a wonderful performance. She really is able to embody every emotion. She is real and you really feel sorry for her every time she is on screen. It feels like she is a part of YOUR family that you have the desire to protect her from all of that. Great direction bx Laura Bisquri. The film is surrounded by a fantastic soundtrack. The screenplay is wonderfully written, without any pathos or melodramatic elements. A truly great family drama and a showcase of great performances.","user":"Alexander_Blanchett","rank":[14,16]},{"title":"Solid and authentic","rating":6,"date":"12 June 2018","review":"\"Figlia mia\" or \"Daughter of Mine\" is a new co-production between Italy, Switzerland and Germany and the outcome is this 100-minute movie in the Italian language. It is the most recent work by writer and director Laura Bispuri and looking at the awards attention it received already, she may be in for a good time, maybe with this turning into her most known effort at this point even that will establish her further as one of the defining filmmakers of her country. The plot can be summarized fairly easily: It is the tale of a young girl who struggles with where she belonges, her real mother who neglected her for her entire life basically or the woman who adopted her and always cared for her deeply, maybe too much eventually even. Typical indie stuff really and you get what you expect, a family drama set in sun-struck Italy where abysses really only exist in human souls. Every character has their flaws. Besides the girl maybe, but she will too when she is grown-up. Bispuri once more worked together with Alba Rohrwacher here and it seems to be another fruitful collaboration. There were moments that I did not get entirely like the meaning of the hole scene near the end, but that's just me most likely and the fact that i am not really that well-informed about certain customs and traditions in this particular region in Italy. Oh yeah, one personal note: It is always nice to see Udo Kier in films, even if it's just minor roles as basically every time. I read he'd be in this one before, but i forgot about it and it was still surprising. Most intense scene of the movie was probably the one where the adopted mother takes the girl to see her real mother performing oral sex on a stranger. And it really did backfire that this event made the daughter feel even stronger for her biological mother. Interesting moment indeed. Also the quotes by the real mother about these men being her fiancés basically offered great value for discussion that she did not want her daughter to be confronted with her world of sleaze and lack of money and wants her to lead a different life, at best the life she had with the other woman, but selfishness and motherly love gets in the way of letting that happen. And of course she just cannot sort her real life out. It's also good that they did not wait until the very end for the girl to find out about who the real mother is, maybe make it unclear how long she knew, but that they were really obvious with this component early on and it's all about the girl and the two women dealing with this situation. I cannot deny that I enjoyed the watch here. I also liked the ways in terms of how differently the two women treated the girls, but still loving, maybe related to how they were brought up themselves. The ways in which the biological mother treats the dog and uses swear words there and on other occasions are a perfect example for a parallel to how she brings or would bring up her daughter. The rougher type, not necessarily less caring, let alone worse. I would not say it was really great or spectacular, but it's a solid watch for everybody who likes indie films with focus on family drama. You get exactly what to expect here and the outcome is a really authentic (broken) family portrayal with strong performances from start to finish and a convincing script that felt way shorter than over 1.5 hours. The Italian component (also in terms of la dolce vita) here was negligible I'd say. The film could also have played in any other area of the world where people are white and the climate is warm probably. Nonetheless, if you like the Italian language, make sure you get your hands on a non-dubbed version like the one that was showing in my theater. A thumbs-up for this little film. I am somewhere in-between the other two reviewers who really loved or hated the film. It's okay.","user":"Horst_In_Translation","rank":[8,9]},{"title":"One of my worst cinematic experiences","rating":1,"date":"6 June 2018","review":"First I must admit that I only watched only one hour of the film before I just had to leave the cinema in order to enjoy life again. I have never had a touch for Italian films and this one clearly answers why (but at least I gave it another shot). Everything is wrong. Dialogues, scenes, acting, filming. Latter is on such a low level that, like the rest of the movie, it physically hurts to watch it. And why bother to watch so much misery? Why bother to watch grownups screw up their lives like this? I often find movies from my home country (Norway) being slow in terms of dialogue and action, but this film even topped that. The action is so easy to predict; no, this was really, really bad. \nI saw the film within the program of the Oslo pix festival in June 2018.","user":"david-626-148063","rank":[1,41]}]