[{"title":"Trivialization of child abuse","rating":2,"date":"22 March 2019","review":"I watched this movie on the worldwide opening night in Warsaw. It started as an interesting, but quirky dark fantasy film with hints of horror. Not my cup of tea, but it could still be an entertaining evening.<br><br>However, soon enough the movie turned into a mess. The plot is a trivialization of child abuse that despite using fairy tales tropes is as explicit as it can get, like the screenwriter never learned about metaphors. The dialog, mostly delivered as drawn out monologues, never made much sense and failed to keep anyone's attention. The numerous characters whose lives were interwoven in complicated relationships as you would expect of a soap opera on its 20th consecutive running year. The sound was OK, though the adult screams were ridiculous at times. The only redeeming factor was the photography, which did a great job capturing the forest where the film was filmed and many of the aged interiors.<br><br>The movie could have easily been 30 to 45 minutes shorter. Each of the two or three epilogues after the mystery had been solved made people in the audience ask whether the movie was finally ending that time.<br><br>Ironically, when the producer introduced the movie, he criticized the same film institutes that financed 100% of this movie for not funding movies that aren't romantic comedies or war movies. And that's why we can't have nice things.","user":"jkohen-1","rank":[12,20]},{"title":"Good at core","rating":5,"date":"15 January 2020","review":"The movie has flaws, quite a few of them. The pacing should be one of them. Then again the movie has the right sentiment overall. Quite dark, quite slow, this will not be a favorite. That doesn't mean it won't find an audience overall, especially because it tries to be compelling.<br><br>Sometimes trying alone isn't enough though. I would recommend you watch the trailer, you'll get a feeling about it and will be able to tell if this is something you want to watch","user":"kosmasp","rank":[2,2]},{"title":"Gut-wrenching, astonishing ride through vulgar, dirty reality","rating":9,"date":"6 April 2019","review":"I left the cinema astonished, able only to mutter a \"wow\" under my breath. This movie starts as an extremely vague and almost mystical journey, and, as the plot unveils, finishes as a solid, strong crime novel, where every piece fits together as it should.\nIf I were to compare it to internationaly recognized movies/series, I would strongly lean towards True Detective. The vibe is similiar, yet different in its own, brutal way - with much more depth.\nThe camera work is short of a masterpiece. The landscapes captures are akin to works of art, the shots are wonderfully done. I'm still in awe.\nHighly recommended to anyone with a strong stomach and penchant for a solid, cruel crime story with an ending, that will certainly not leave you unsatisfied.","user":"aleksypotocki","rank":[8,15]}]