[{"title":"Funny and Watchable","rating":6,"date":"14 February 2018","review":"One of the better Rom Coms to come out of India. It has a breezy feel and the lead pair is very believable. The actress, Angira Dhar deserves a special mention - not only is she easy on the eyes but she gets the diction of the Bombay Catholics right. The supporting cast (like the Pathak sisters) is filled with excellent character actors and most of them could play these roles in their sleep. Most rom coms have predictable endings, so a special mention to the writer and director who keep the viewer engaged through funny dialogues and a largely even pace. Speaking of pace, the movie could have been chopped though and seemed a little stretched toward the end. And most viewers will be able to see the twist from a mile away. It's a minor quibble, though - it largely an enjoyable movie. Look out for a cameo from an A-lister at the end.","user":"Kavikulaguru","rank":[20,21]},{"title":"Bollywood should learn something from this.","rating":7,"date":"29 April 2018","review":"Typical Bollywood film makers who makes typical/ordinary movies should learn something from this and here's why:<br><br><ul><li>Anyone can relate to this movie, especially here in India as it deals with the most common problems we middle class Indians have to face.</li><li>It makes sense and it connects with you.</li><li>No forced humor. comedy in this film is a plus point. It's natural and will make you laugh.</li><li>You wont get bored at any given point in this movie. It will keep you hooked.</li><li>Strong and natural performances by all the actors and the direction is also done very well.</li></ul><br><br>Yes, the movie is quite lengthy but the story is quite simple, the characters are relatable, the romance is cute, and the movie is worth watching.","user":"Divine_Dev","rank":[18,19]},{"title":"beautiful film to watch","rating":9,"date":"17 February 2018","review":"Romantic film , beautifully taken with powerful dialogues, modern and yet with values. hero and heroine were superb. supporting actresses makes you cry with their touching action. Overall- a very good film- well done to the new director.","user":"gw-47428","rank":[14,15]}]