[{"title":"Stylish, but No Heart","rating":5,"date":"2 January 2020","review":"The visual look of Luz is out of this world and has a vibe all its own. If you just happened upon this film on cable one night, you could easily think someone like Dario Argento had a hand in producing this at some point in the mid or late 80's. It has a gritty, 16mm aesthetic that's hypnotizing and makes the film hard to shake once its over. I only wish I could say the same about the threadbare story that does anything but linger with the viewer.<br><br>Acting is strong across the board with everyone giving convincingly wild and bizarre performances and there are some great images that will stick with you, but Luz could have used a few more drafts of the script before it went into production. Also, at barely 70 minutes, there are moments of the film that seem endless. It's pretty lightweight in terms of story, but it's a great exercise in style and mood.","user":"ericritter-01765","rank":[10,12]},{"title":"Entertaining disjointed mess.","rating":6,"date":"6 November 2019","review":"Not the easiest film to find, I'd wanted to watch this for a while after the trailer did what all good trailers should do. I'm hooked to start, with a opening shot that's held uncomfortably long, ambitious considering the overall thrifty run time. It's stark with a retro grade and worn VHS look. The minimal aesthetic really appeals, but there's something missing, there's very little warmth or investment in the characters, with a palatable dirt on screen that permeates everything. For all the tension being ramped, the grime, the editing, the hyper scripted dialogue, it all slowly pulls apart. Despite it's stunted plot of a devilish nature and generally undesirable characters, there are some pluses. The score being one, reminiscent of an 80s slasher flick, it's definitely the films strongest asset. The European art house feel makes it feel cinematic, intentionally confusing in nature. Scenes built around slow creeping shots, almost entirely on one set, with often inactive people, waiting. Director Tillman Singer clearly has a thing for Lynch. As things progress it does manage to find its feet, with a second act reminiscent of a small theatre play, time frames overlapping, lines twisting through their own narrative into others, it's wonderfully bonkers, albeit a tad overplayed. It's all precursor to a truly off the wall finale, that although ambitious, really just doesn't work and ends in a bit of a disjointed mess. It really doesn't live up to its trailer, but I'm still pleased I gave it a go.","user":"garethcrook","rank":[11,16]},{"title":"Near Perfect Film for the Right Audience","rating":9,"date":"2 April 2020","review":"I see how this film could be a near perfect little film, or a complete bore, depending on the viewer, so to qualify my comments let me make two observations right up front: this is a film about the supernatural - not the ghostly or the horrifying or the bloody, but the mystery and menace of something that is beyond the natural as we know it. That moment when you realize you might be part of something you never thought was \"real\" as opposed to being chased by monsters (although there is some blood, and some violence to be fair).\nAnd if you are not a viewer who is attuned to the sense of disquiet, or who can find suspense in seeing something not quite right and wondering why or where it may lead, then this movie will not resonate. Do not bother. You'll get impatient or be bored. But if you find yourself intrigued and captivated when, say, someone's behavior in a bar seems weirdly unnatural, then drop everything and gives this film a chance! It is like the best of the early David Lynch before he become a terrible parody of himself; when he could imbue a doorway or a radiator with menace by the intensity of his gaze and the music and sound that accompanies it. In this film, more often then not, it is in the eyes of the characters and how long they stare before they speak. If you are attuned to such nuance this movie will creep you out from the very first shot.<br><br>A comment by another reviewer perfectly sums up the difference between potential viewers: they said that one scene was a man \"pointlessly\" setting up chairs; however if you are the kind of viewer who would immediately notice he is arranging the chairs like a taxi cab for some sort of re-enactment, and start wondering how any role-playing is going to tie in and where will it lead, then this is definitely your kind of movie.<br><br>I loved every minute of it and I was greatly impressed by the increasingly clever manner in which a simple set-up was being developed. I don't want to spoil any surprises by even hinting at what I mean by that statement; for the right audience the best way to experience this film is in complete ignorance of where it is going and how its going to get there. I had heard only that it was frightening, but it is more of the disturbing uneasy variety as opposed to the jump-scare traditional fashion and I, for one, found it legitimately suspenseful throughout (and that even includes the lengthy single take set-up at the very beginning). Excellent performances, assured direction, effective use of limited locations - this film has everything going for it in addition to a familiar concept developed in a completely original and stimulating fashion.<br><br>For the right audience, that is.","user":"seriouscritic-42569","rank":[3,3]}]