[{"title":"Anti Isis fighters","rating":9,"date":"9 October 2019","review":"Last year, we had on the big screen LES FILLES DU SOLEIL, another feature speaking of the same topic, women soldiers fighting against the barbary of ISIS. I prefered the other one, especially for the end, In this film, the ending is too lousy, too smotth, in the pure Hollywood tradition; for the sissies. I prefered the other film, also made by a female director. It was more dark, brutal and compelling. But in this one, acting and directing are more than OK, the cast awesome. I won't say this film is too simplist, manichean. IT MUST BE. How could it be other, with such ISIS garbage, and barbary. Even if we had seen the female fighters torturing ISIS prisoners, behaving in the same manner as those criminals, how could we see ISIS other than the bad guys, the evil plague which the earth should be got rid of? I would also say this movie is too didactic, but it must be, to explain how these ISIS monster proceed to spread terror. This film is too simplistic but deserves to be seen.","user":"searchanddestroy-1","rank":[23,33]},{"title":"Magic","rating":10,"date":"18 October 2019","review":"While Trump decided to abandon the Kurds, it is vital to help them. This film reminds us how the won the war for us.\nFirst real feminist war movie.\nGod it is so good to see powerful women","user":"ariyajaila","rank":[24,38]},{"title":"moving war film","rating":10,"date":"19 October 2019","review":"It is a very moving that pays a well-deserved homage to all Kurdish and Yezidi fighters and resistance fighters. It also shows us the barbarism and extremism of some and of course it does not help everyone ... There are always some who want to get off a movie because some truths annoy them, do not listen to them.\nFor her first film, Caroline Fourest gets away with honors. A project initiated in the aftermath of the Charlie Hebdo attacks, Fourest has had the time to refine his remarks and if one ignores his feminist projections combined with his dubious amalgamations on monotheism, one obtains a visceral and necessary cinematographic work. On the casting side, Amira Casar is an imperial Kurdish leader surrounded by combatants of various ethnicities, religions and nationalities. We will appreciate the very symbolic and moving friendship between the French Kenza (Arab Muslim of Algerian origin) and Yaël Cohen, respectively performed by Camélia Jordana and Esther Garrel. Zara (Fragile and sublime Dilan Gwyn), the Yezidi whose people were genocided by the Islamists. The American black sniper, incarnated by a super credible Nanna Blondell. Overall actresses / actors are fully invested, in accordance with the dramatic issues of the subject Photography is successful. A favorite for managing the music and more generally the sound that perfectly nourish the intensity of the film. I can only advise you to go to see this film for 2 reasons - Because it is very successful from a technical point of view - For the duty of memory towards these fighters who gave their lives to go to disillusion these ISIS fightere","user":"alinaalondra","rank":[18,32]}]