[{"title":"Meh","rating":5,"date":"3 October 2019","review":"I didn't hate it but I didn't love it either dragged especially towards the last quarter of the film but did have its moments. Wouldn't go out of your way to see it but passes the time.","user":"muamba_eats_toast","rank":[13,20]},{"title":"Beautiful and tender","rating":10,"date":"31 August 2019","review":"I saw this at the SOUL film fest BFI. Its beautifully shot, and tells a unique story in a really gripping and gorgeous way. The characters are really powerful. I came away inspired. The rest of the audience seemed really moved.","user":"hailewarner","rank":[9,20]},{"title":"The Last Tree - becoming a product of your environment","rating":9,"date":"30 September 2019","review":"Powerful coming of age drama about the early life of a Nigerian immigrant who returns to his birth mother after a childhood with a caring foster mother.<br><br>Act1.\nAt the beginning of the film 'Femi' is a young black child to a very caring white foster mother, he seems happy and happy at school, his friends are mostly white as well. He learns that his birth mother is visiting, but we soon discover that her intension is to return to London with him.<br><br>We see that his new home is in a squalid tower block and he's struggling to fit into the environment and his new school. His 'new' mother is stern and has very little time for him. Femi resents the move, and the atmosphere between them is continuously tense.<br><br>Act2.\nThe child is now a much older teenager, most of the film focuses on this part of his life. He's in his final year and his exams are fast approaching. He fits into the environment, he has a circle of mainly undesirable friends, and has caught the attention of the local king-pin drug dealer, who begins to groom him into his operation. Femi is struggling with what appears to be an unfamiliar black culture.<br><br>Act3.\nFemi visits Nigeria with his mother, his father is a wealthy pastor. He has several servants, his home is a palace. We see that he has a new family. So there is no reconciliation or reunion. Unfortunately Femi is emotionally rejected for a second time.<br><br>This has been compared with 'Moonlight', but I can't see why. The only similarity is that the plot is split into 3 acts, but that is where the likeness ends. The Last Tree is a much grittier drama with some very strong emotional performances.<br><br>Highly recommended.","user":"brankovranjkovic","rank":[8,18]}]