[{"title":"A third-rate production I surprisingly actually enjoyed.","rating":6,"date":"21 March 2019","review":"Let's face it, we don't expect much from these type of B-grade action flicks, but oddly enough I enjoyed the martial-arts-meets-sci-fi cross-genre. Sure the plot had issues (e.g. why the stutter? comedy? fail), and the screenplay was amateurish writing to go with the sub-par directing, but the fight choreography and story premise was enjoyable and thus a 6/10 from me.","user":"TheTopDawgCritic","rank":[21,27]},{"title":"What was this movie about?","rating":4,"date":"22 April 2019","review":"From the trailer looked like an action movie however in reality it is not clear what this movie actually is. The storyline is confused to say the least and till the end you are waiting for it to make sense but... You wait for nothing.<br><br>The acting is laughable but not in a good way, none of the actors pass the mark<br><br>I am trying to find somwthing positive to say but i just cant find a single reason to recommend this movie. Please watch something else","user":"stetuveri","rank":[10,12]},{"title":"Good, but Could Have Been Great","rating":6,"date":"14 April 2019","review":"In Vietnam, the British citizen Quinn (Scott Adkins) goes outside a fountain in a park stuttering and with no recollection of his life seeking out the British Embassy. He is sent to a psychiatric hospital by the police and intrigues Dr. Anna (Truong Ngoc Anh) with his memories. Meanwhile the professional hitman Conner (Andy On) sees his beloved wife Maya (Lily Ji) be kidnapped during the night by mysterious men with hood. His investigation brings him to the mysterious fountain, where he stumbles upon Anna that is checking what Quinn said. They see that the physic laws do not work at the spot. She brings Conner to the hospital where they have to fight with Quinn to save their lives. What is the secret of the weird men?<br><br>\"Abduction\" is a good film, with a story with great potential that could have been great. The story of people from another dimension is intriguing but is partially wasted with a poor screenplay and low-budget. Despite the flaws, it entertains and is prepared for a sequel. My vote is six.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[10,12]}]