[{"title":"Not for kids","rating":1,"date":"20 October 2019","review":"S movie should pick a lane. It's too childish, slow and predictable for adults, it's too confusing and some characters are too downright evil for kids.\nNevermind the picture of the cat getting hit on the head with a brick thrown by children within the first 5 minutes, nevermind all the angst and depression associated with one of the protagonists, but it is so sullen and depressing, with barely any comic relief to speak of.\nThe end tries (and fails) to be a little more upbeat, but it falls flat and feels alien to the rest of the movie. my 6 year old was inconsolable when they main antagonist made sure to say \"make sure he suffers before you kill him\" when speaking of the little kitten.\nsub-sub-sub par","user":"bondesousa","rank":[15,18]},{"title":"Slow and terrible English voice over","rating":2,"date":"7 December 2018","review":"The animation is nice, and that's about the only positive thing.\nThe dialogues and English voice overs are dreadful. It almost sounds like a computer generated narration, no passion or emotion whatsoever in the voices.\nThe plot is slow and predictable.\nVery dramatic for small children and no humour at all.","user":"Argosy74","rank":[15,20]},{"title":"English dubbed version is an absolute disaster","rating":1,"date":"27 October 2019","review":"Hoyts is showing this in the cinemas at the moment. We took the kids because it \"looked like secret life of pets\" and they like cats. We soon discovered it looks like secret life of pets because it is just a cheap, bad ripoff of secret life of pets.<br><br>It sounds like the English dub was done by some students who used Google Translate. The story is incoherent and the dubbing completely wooden.<br><br>They used the same poorly recorded and voiced \"huh?\" sound five or six times in a row when the little orange cat discovers the... glass blowing factory of doom?<br><br>In any case our 3 and 7 year olds refused to stay after the first 40 minutes or so. And these kids will watch hours and hours of poorly made, incoherent, low production value cartoons in a netflix binge session if you let them. That's how bad this was.<br><br>Don't see this movie. If it ever appears on your streaming subscription, email them a complaint for it existing. Easily the worst animated movie I've ever paid money to watch.","user":"the_jai_master","rank":[11,14]}]