[{"title":"The Dark Ages, we missed you","rating":9,"date":"8 September 2018","review":"Its not a great scripts, its good and its ok. And its not hollywood acting and surpreme VFX art and CGI. But it is gritty, dirty and violent with a beautifull setting, with actors who really are doing their best to tell a good story. \nIts is like watching Conan again, and I loved it. If you are a film snob and only love movies for their what ever hidden agenda, its not a movie for you. <br><br>This is a dirty, small budgettet, B movie with half naked ladies, violent men in a setting that leaves nothing but a raw taste of blood in your mouth.","user":"alschiller","rank":[23,27]},{"title":"Solid dark ages style action flick.","rating":7,"date":"23 August 2018","review":"There are only two negative reviews for this film. It's a shame really to have any but you will always get one person moved to write a review who thinks every movie has to be high art. Then yet another paranoid soul who is convinced every good review of a B grade independent movie must be associated with the production. <br><br>Thankfully neither of these things is true and if you want a solid Conan style action flick set in a dark ages type period this lives up to that wish. <br><br>The movie has a good feel and moves along nicely after the first twenty minutes. It takes a while to fit all the players into there places but once the action starts you will know who's who and enjoy watching their story arcs play out. <br><br>I also see other reviews criticising the costuming, weaponry etc used. I thought they did a good job but I guess there is no accounting for taste.","user":"prendj01","rank":[15,17]},{"title":"The Russians do Crank","rating":8,"date":"11 February 2019","review":"This movie is great for one reason, the action.\nCamera movement is really good, minimum amounts of quick cuts, and amazing action. The choreography is some of the best I've seen, with really smooth fighting without having to use doubles or cgi. The story is ok, doesnt really pull you in, but it works for what the movie is trying to focus on it.","user":"akpapasmurf","rank":[7,7]}]