[{"title":"It's OK","rating":5,"date":"1 July 2019","review":"Although this is well produced and the acting is superb, there is something missing that made this a bit of a tedious film to watch for me.<br><br>I had the feeling that the story could have been told just as effectively in half the time.<br><br>it's an OK watch if you happen to come across it, but I am not sure I would specifically seek it out to watch.","user":"mjsreg","rank":[16,25]},{"title":"Very Decent.","rating":6,"date":"2 July 2019","review":"For an entire film to be shot in one location, you need two things, a great cast, and good story to reel you in from to start it to finish. Let me just say that Feedback has them both. Wow, what a very decent film, A story about getting to bottom of the truth about a sexual assault, and murder in a hotel room, and the whole account being aired on lived radio with some very colorful characters looking to get even. In the end it wasn't the \"feedback\" that they were looking for. A little gory and bloody, but executed properly with the right proportion. A definite must watch for anyone who likes dark suspense/thriller films.","user":"whitemanfromtowne","rank":[10,19]},{"title":"You want feedback, you got it.","rating":3,"date":"25 August 2019","review":"Jarvis Dolan (Eddie Marsan), a thoroughly irritating talk-radio DJ with zero charisma, spouts his socialist agenda to loyal listeners (apparently, his show is so popular with the masses, he even has groupies). During one of his mind-numbingly dull broadcasts, the radio station is taken over by masked intruders who hold the technicians hostage, threatening bloody consequences if Dolan doesn't comply with their wishes: wring a dreadful confession from his co-host Andrew (Paul Anderson).<br><br>Combining social commentary (the film touching on such topical subjects such as Brexit, pro-abortion and the me-too movement) with brutal violence, Feedback is clearly intended to be an edgy, uncompromising survivalist/revenge horror/thriller, but simply comes off as dumb and tedious, with a lead character whose personality immediately had my back up.<br><br>The first half of the film is unbearably slow and uneventful, as Dolan pollutes the airwaves with his diatribe; the second half of the film picks up the pace a little but becomes incredibly daft in the process: are radio studios so isolated that no-one outside would realise what is happening?; is security so lax that a group of strangers can smuggle in a sledgehammer, a shotgun and a handy-dandy acetylene blow-torch (you know, just in case they need to bust open a sealed door)?; is a fight scene inside a cramped cavity wall anyone's idea of exciting?; and what the hell is up with those furry costumes?<br><br>The final message - that those in power are getting away with murder - is hardly revelationary and provides an unsatisfactory conclusion to an already disappointing movie.","user":"BA_Harrison","rank":[17,38]}]