[{"title":"Instead of using medicine, rather fast a day. - Plutarch.","rating":10,"date":"12 September 2018","review":"As a gym instructor and nutritionist, i totally endorse fasting under supervision. There is a thin line between fasting and starvation.\nStarvation leads to atrophy n wasting but fasting has been shown to induce autophagy, a process by which cells \"clean up\" cellular \"garbage\". Autophagy protects cells from excessive oxidative stress. Autophagy prevents cancerous growths, metabolic dysfunctions like obesity and diabetes.\nThe three ways to Autophagy is fasting, low carb and exercise.\nRegarding the film, there was no need to show the Donner party. \nStarvation leads to low potassium thereby causing psychosis, whereas fasting prevents dementia.\nIn fact, more emphasis shud have been on autophagy.\nMore talks shud have been on the difference between starvation n fasting. Also important is that after fasting n weight loss regime one shud never forget to excrete the toxins with the use of high fiber foods.","user":"Fella_shibby","rank":[29,31]},{"title":"Good topic, bad coverage, confusing and irrelevant information","rating":1,"date":"8 May 2018","review":"First, I was hoping to find something that spoke more clearly about the science of fasting. Instead you get a few testimonials from doctors who had some of their patients turn their health around, and a lot of time is spent on that. Autophagy isn't even mentioned until nearly the end. I also was totally thrown by the section about the Donner Party, which seems completely out of place. I skipped half of it as it was repulsing me and not why I was watching a documentary about fasting. There are not seven methods discussed, it is more anecdotes about different people who used fasting in different ways. The information feels incomplete, and scattered. This documentary is awful.","user":"gwenhaven-87190","rank":[22,30]},{"title":"Oh. The confusion was total. Do not watch!","rating":1,"date":"18 April 2018","review":"Looking for a good movie about fasting? Do not watch/pay for this one. <br><br>All in all it is just a mess of bad moviemaking mixed with a strange back and forth message about fasting. it surprises me that they got Walter and Jason onboard this project at all. <br><br>And what also truck me is the long sweeping bodyshoots that where alsmost he whole time. <br><br>Wanna know about fasting in detail? Search for Jason Fung on Youtube and watch the longer talks. There you will really learn a thing or two.","user":"daniel-45574","rank":[18,25]}]