[{"title":"Great movie, just don't take It seriously","rating":7,"date":"31 March 2018","review":"This movie was a blast. I loved seeing my favorite super hero in LEGO form, which were my favorite toys growing up. I absolutely love how the movie tries to be somewhat dramatic and complex, while still obviously being directed towards kids. This movie is likely to show really young kids why all of us fell in in love with this character to begin with. Only reason I am giving It a 7 is because I obviously can't take It very seriously as It is for kids. Also, why does Dr. Fate sound EXACTLY like the principle from American Dad?","user":"mwvoss-35464","rank":[5,5]},{"title":"Lego DC Comics Super Heroes The Flash: About what you'd expect","rating":4,"date":"13 September 2018","review":"These straight to DVD lego DC movies actually impress me somewhat. I'm not saying they're really good, but the fact they're pounding them out at the rate they are and the quality of the animation is very impressive.<br><br>In this little tale the focus is on Flash as he's tricked by Reverse Flash with plot to take down the Justice League once and for all.<br><br>All your usual favourite voice talent are present including veteran Troy Baker and as mentioned it all looks great and the voice acting knocks it up to the next level.<br><br>The story though, the young demographic, the goofiness of it all without actually managing to be funny the majority of the time..........unforgivable.<br><br>One for the kids absolutely, DC fans maybe just about, everyone else not so much.<br><br>The Good:<br><br>Looks and sounds great<br><br>The Bad:<br><br>Musical segment<br><br>Fate.........really?<br><br>Things I Learnt From This Movie:<br><br>Its common to have people in your phone book complete with photo.............that you don't even know","user":"Platypuschow","rank":[12,15]},{"title":"Flashpoint - for the whole family! (with some nice speed-force visuals)!","rating":9,"date":"21 April 2018","review":"Easily my favourite Lego DC DtV movie (I've seen them all). The makers are doing a grand job of expanding their universe; as well as the usual Lego Justice League, here we get Atom, Firestorm, Zatanna, Dr Fate, Plastic Man, and B'dg. Plus Reverse Flash, Krypto, and Ace the Bat-hound! <br><br>Incidentally, it's interesting that despite featuring the League prominently, this is only the second Lego DC DtV to have been released under a single character's name (the first was Lego Batman: The Movie - DC Super Heroes Unite back in 2013); the rest have all been released as JL movies (even the Flashpoint DCUAOM was released as Justice League: The Flashpoint Paradox). That's possibly a result of the poor reception of the live-action JL and a desire to get audiences more used to the Flash as a solo brand ready for his live-action solo movie. <br><br>Anyhow, as usual there are various nods to DC lore tucked away for the finding. Much as I love the 'serious', darker toned DC comics/films, it's perfectly possible to enjoy these movies too. If you like the Lego DC movies I wholeheartedly recommend this one. Easily 9/10","user":"Milk_Tray_Guy","rank":[5,6]}]