[{"title":"Death Wish vibes, including an actor that clsoely resembles Charles Bronson","rating":5,"date":"26 December 2018","review":"The score of 4.6 overall is dead on. I had already decided to give it a 5 before seeing the other scores.<br><br>There is a decent amount of killing. Not much of a plot or plot development. Not any real tension in the movie to keep you riveted to the screen. The movie just moseys along from scene to scene with very little development of anything.<br><br>Like Death Wish there is a vigilante that kills criminals and low life types. But he has no problem robbing their belongings once he does. And is not worried about collateral damage to those people being abused or threatened as he takes out the bad guys.<br><br>A movie like this is only as good as the villain. This is why Avengers hit a home run with Thanos and DC failed miserable with Steppenwolf in Justice League. The main villain in this movie is a joke. Our man is never in any real danger. This makes the ending kind of flat and boring.<br><br>I would not recommend this movie unless you have nothing else to watch or do. A walk in the park would be a better time investment.<br><br>Oh, and there is some rule in this movie that all female actresses in the movie must bare their chest at least once for no good reason. I kid you not.","user":"tony-146-695626","rank":[14,16]},{"title":"Bronson would probably smile","rating":7,"date":"17 October 2018","review":"I've never seen this actor before this movie and I will admit that I was drawn to it by its poster. I thought that I was seeing Charles Bronson. but I saw the date 2018 and frowned. I love Charles Bronson especially the 70's and 80's movies so I assumed that this was a documentary.\nRobert Kovacs resemblance with the late actor is uncanny and pays a great homage to the Bronson legacy of vigilante/dark justice movies. Not only does he look like him he acts like him as well. I enjoyed it and made me remember the Bronson movies.","user":"phoenixinvictus","rank":[28,37]},{"title":"Cheap rip off of Death Wish","rating":3,"date":"22 April 2019","review":"Truly a cheaper Death Wish. Lead actor looks like Bronson. All acting on mediocre side. Filming style on cheap side....","user":"greggicca","rank":[5,5]}]