[{"title":"When someone calls in that favor?","rating":2,"date":"5 April 2020","review":"The ONLY thing that drew my attention to this film was Chazz. The film is barely tolerable for background noise like AM talk radio. This had to be one of those favors someone called in or like a call out of the blue to help someone move because they helped you out, 30 years ago, and you have to keep your word.\nChazz's anger in the movie is genuine - he's stuck in a piece of crap film he had to do because he's that guy that promised a favor to someone like I mention above.\nIf you're a fan of Chazz you'll be sorry wasting your time on this one, if your a fan of Perlman - well you're just effed and probably like Eric Roberts too (why they didn't stick that ass-hat in here too is beyond me).\nThe film is rubbish, camera work is student quality at best, writing pee-poor, score is flat, transitions don't transition, scenes are better unseen.\nI wanted to like the film - had hoped that maybe after a lifetime of crap work, Perlman might learn something from a class act like Palminteri, but that didn't happen. The best part about the film was when I quit watching it.","user":"payupyou","rank":[4,8]},{"title":"Chazz chewing","rating":6,"date":"3 April 2020","review":"Greetings again from the darkness. These days, B-movies don't get the respect they deserve. In the age of massive, hundred million dollar (and more) budget blockbusters, the low-budget movies produced purely for entertainment purposes get brushed off as being undeserving of screen time. The truth is, the best ones are easy to watch ... and can be a fun way to while away the hours if, say, one is forced to stay in their home for an extended period of time. Writer-director-actor Jon Abrahams' movie fills this role just fine.<br><br>Mr. Abrahams (MEET THE PARENTS) and Mark Webber (GREEN ROOM) star as the Callahan brothers, Mickey and Jackie, respectively. These are the type of Irish brothers who only stop bickering long enough to wrestle each other to the ground. While most of their spats may be typical brother stuff, this latest involves Jackie's inept card playing, and the subsequent loss of the money they needed to pay back a mob loan shark. Missing this payment means Tony (Chazz Palminteri) assumes ownership of the Irish bar their late father opened, and it could mean even worse news for the brothers.<br><br>I would pay triple ticket price just to watch Chazz Palminteri chew scenery like he does here as Tony. When he makes the boys an offer they can't refuse, they end up in the basement of a house with Tony's son Joey (Michael Godere) telling them to shoot the man tied to a chair (another of Tony's loan customers). Ba-da-bing, ba-da-boom, and the next thing we know Mickey and Jackie are on the run with 13 year old Clover (Nicole Elizabeth Berger), dodging Tony's men, in addition to the 2 female assassins (Erika Christensen, TRAFFIC) and Julia Jones (WIND RIVER) they aren't even aware of!<br><br>As a quasi-framing device, we find Ron Perlman holed up in a fabulous mansion that we view with the film's opening aerial shot. Mr. Perlman is afforded his own chance to 'let loose' and emote like he's participating in an acting seminar ... while play-calling the wolf video running simultaneously. Other characters that cross paths with the brothers and Clover include Jackie's ex-girlfriend Angie (Jessica Szhor), a befuddling rescue 'scientist' played by Jake Weber, and a bar owner played by Tichina Arnold, who like Perlman and Palminteri, was clearly directed that it's not possible to go \"too big\" in a scene.<br><br>Humor, most of it pretty dark, is around every corner. A bowling pin has a use outside the lane, the lady assassins drive a car with a fitting sign, we are treated to a good old fashioned death scene, and there's a shootout accompanied by melodic jazz. As a cherry on top, the bar patron that the brothers leave in charge is Larry, played by the director's dad, Martin Abrahams. There is a definite 1970's vibe to the story and film, and we can't help but be a little disappointed when the conclusion does in fact, \"end the chaos.\"","user":"ferguson-6","rank":[4,8]},{"title":"a little tale of the unexpected","rating":6,"date":"3 April 2020","review":"Many will turn this off quuite fast, but the fascination of fast shifting and surprising moves made me hang on till the end. its a quasi mafia, beavis and butthead caracters that leads the line, and loosers borrowing money to loose, from a loanshark who cant loose.<br><br>its frantic and at times extremely confusing, the violence are pretty raw and the shootouts are merely in the bulls eye.<br><br>what differs are some lame and mediocre dialouges , and you will have a ''studio''feeling here and there. that is a director and sound&amp;film editors fault.but if you like jazz in the background then youre a pearl in an oyster<br><br>the story do have a twisted end i cannot tell what, just use your third eye instinct and view the backgrounds. that is why the grumpy old man recommends a try","user":"ops-52535","rank":[6,14]}]