[{"title":"Had potential","rating":4,"date":"13 August 2018","review":"This movie could have been a great thriller if not for the bad editing and confusing plot twists.<br><br>Five teenage friends go on a trip but only four return. One of the girls becomes a cop and tries to reopen the case.\nSo far a somewhat interesting plot, turns into a confusing mess later on.\nHow was cornelia abducted when Ariel was the only guy there? Perhaps his parents were part of the ring but it is never explained.\nWhat's the connection between Ariel and the Egyptian? Again no explanation.\nWhy did that bald guy help Cornelia when he was supposed to kill her?\nHow was Pipa's boss involved?<br><br>Too many loose ends to make this a good watch. It's a pity because the acting and cinematography was very good.","user":"sidz79","rank":[23,27]},{"title":"Strong yet fragile","rating":7,"date":"27 December 2018","review":"Just from the outgo and before I was ready to give up on the main character for maybe not being smart in the way she handles things, the movie made the right choice. A strong female character, but not one without flaws. It doesn't happen that often that you get female characters drawn out like that. I admire that about this movie.<br><br>On top of that you get a decent thriller, with a good enough story. It may have its flaws at places and the story may not move along without hiccups, but there is more good here than bad in my humble opinion. The acting is good, if you engage in it, you probably will be on the edge of your seat too.","user":"kosmasp","rank":[10,11]},{"title":"Worst Thing About This Movie Are The Crybaby Low IMDb Reviews","rating":10,"date":"22 November 2018","review":"11/21/2018 Apparently the fractured time frame (back &amp; forth) confused some of the viewers? I found this movie to be really decent and the acting (foreign) was better than alot of the American movies that I get to watch. It's really about a 7-8 star movie but I'm giving it 10 stars to hopefully offset the reviewers who are always hypercritical with their negatives in every movie review. Maybe some regular viewer like myself will hopefully give it a try and enjoy it? I know that I did. Bon Appetit","user":"fredgfinklemeyer","rank":[23,33]}]