[{"title":"We have all been there!","rating":1,"date":"4 December 2019","review":"I'm sure we have all looked at the famous actors and thought that acting is easy and we could all do it. Well, the totally atrocious 'acting' by every cast member puts paid to that idea. Watching somebody really bad at something makes one realise how difficult it really is. To add insult to injury, the script is naff as well as the story. This has no redeaming features and really deserves no stars.","user":"DrTeeth007","rank":[25,38]},{"title":"An Entertaining Labor of Love","rating":8,"date":"23 December 2019","review":"This is a really fun B-movie that knows exactly what it wants to be. The cast and crew were obviously having a great time making it, and it's easy to join them. Are there a few logic gaps and some cheesy effects? Sure, but it also features a number of cool moments and a very satisfying ending, which puts it way ahead of most films made on this kind of budget.<br><br>I saw Rise of Skywalker in IMAX on the same day that I watched Automation at home, and I enjoyed both. One took hundreds of people several years to make on a nine-figure budget, and the other was shot in 12 days with a cast of about a dozen and a budget that wouldn't buy a decent used car. It seems like some people are dissing this movie because it isn't a major Hollywood feature. If you don't like this kind of thing, that's fine, but as far as low-budget indie flicks go, Automation is really well done. And, frankly, I've seen plenty of movies that did a lot less with a lot more money.","user":"aaronsilverman","rank":[8,11]},{"title":"A good robot performance","rating":8,"date":"20 December 2019","review":"AUTOMATION is a B movie with a heart. That element separates it from low budget sci-fi that has to resort to more exploitive means that vie for your attention. My favorite performance comes from the robot, but that's okay. This movie is about that robot. The voice and mannerisms are well done.<br><br>From the human performers, Elissa Dowling stands out. There is nothing from her that feels forced. She is believable and this roots the movie as she is the main protagonist.<br><br>The story is decent and so is the pace. While obviously an indie production, that fact didn't hamper my enjoyment of the movie.<br><br>The setting is the near future. There are just enough visuals to convey a familiar city setting with some sci-fi enhancements, but they aren't over the top. Most of the movie transpires in a warehouse and its offices.<br><br>There was obviously not a lot to work with, in terms of budget and production, but I appreciate that the filmmakers properly presented the story and the robot. I give it high marks for doing a lot with a little.","user":"mjconway1","rank":[8,11]}]