[{"title":"Slow but rewarding ride","rating":7,"date":"3 August 2019","review":"If you're old, life isn't over. That's the crux of the story. It has a big heart and it eventually wins you over.<br><br>Sure it's slow. Yes it's pretty unrealistic. And it can be cheesy at times, but for the most part, it's a touching story of trying to fulfill your dream at any age.<br><br>Richard Dreyfuss, as always, is great. His performance holds it all together, though there are some other good performances too.<br><br>Leading a fulfilling life is important but it's not all about your dreams. It's those who surround us who make it truly worthwhile. Ultimately, it's about family.","user":"anthonyjlangford","rank":[6,6]},{"title":"a movie of substance, quality, and dreams","rating":9,"date":"1 August 2019","review":"Saw this movie last week....and was surprised to see that it has not been in the regular theaters...it went STRAIGHT to the budget theater. Then when I saw at the end that it was put out by an INDEPENDENT company in Ontario....and one of the companies involved is calls itself....\"The Competition\"..I thought..BUT OF COURSE. This movie is touching, heart warming, speaks of the strength of family, of pursuing your dreams no matter what age you are.....and gives indication into the commercial space flight push. Of course Richard Dreyfuss has become the consummate UN-conventional actor....and even has the audacity to speak up...along with his son..about lil things like, THE CONSTITUTION. So...I guess he truly has been black-balled. But if you are TIRED of the nonsense that is being put out lately in the theaters...and want some substance, thought provoking viewing...and some heartwarming viewing....THIS....is the film for you. I WILL be purchasing it for my video library. It's not all about bells and whistles...it's about heart.....dreams that are AGELESS.....and all the things we would want to see for ourselves and loved ones.....chasing our dreams like there is no tomorrow......LOVED it","user":"musicmade","rank":[9,10]},{"title":"A warmhearted tale that will entertain the entire family","rating":8,"date":"29 July 2019","review":"Actor, turned writer/director Shelagh McLeod, makes her full-length feature film directorial/writing debut in Astronaut.<br><br>Her camera work was that of a seasoned director, but some of the scenes certainly needed some editing/cutting down. Although a great story, her inexperience shows in her screenplay with some plot and technical issues. At 97 min long, the slow pacing made the film feel much longer. Had the pace been faster or the length edited down, the story would have shined.<br><br>The cinematography was great, and the music/score perfect. Performances were good, but with a little more experienced direction, could have been great. Richard Dreyfus played his character well.<br><br>I'm surprised at the current low IMDb rating. Overall for a low-budget B-grade film - coming from a newbie writer and director, it was a thoroughly enjoyable warmhearted tale that will entertain the entire family. Thus it's a well deserved 8/10 from me. And if anyone thinks my review is fake, click on my username to see my 1000+ ratings and 600+ reviews, and read my bio on how to properly review/rate a film based on it's merits and production value.","user":"TheTopDawgCritic","rank":[21,30]}]