[{"title":"Solid Production Values, Questionable Editing for this Drama/Horror","rating":6,"date":"24 July 2018","review":"I just watched Family Blood on Netflix, knowing that it hadn't been favorably reviewed so my expectations were lowered. I'm still a bit surprised by the low rating on here (currently a 4.3), the film has a lot going for it, but also has it's share of issues. \nFirst off, the production values on this one are excellent, especially assuming this was likely a lower budgeted film. But a great looking and sound film does not make a film great. The story is pretty interesting, if nothing totally new. A mother of two teenagers who is trying to overcome a drug addiction becomes a vampire (via another vampire) and then begins to deal with her new addiction to blood. The blood addiction being compared to drugs is very heavy handed, but that's where this one redeems itself a bit. It focuses more on drama than horror, and so if you're looking for straight up horror this one is not for you, however if you like some drama in the mix, you might want to give it a shot. I enjoyed the slow pace, as I mentioned before, my expectations were that it was heavily focused on drama and so I didn't feel disappointed in the lack of horror on screen.\nHowever there are numerous unnecessary \"jump\" scares (that didn't make me jump) where they are just too forced. \nAlso how many times are people going to call out a character's name? Holy! Half the dialogue in this was just saying the a name of a character, often multiple times over.\nThe biggest issue to me though was the editing. I don't mean every cut, but most scene transitions were handled clumsily. It seemed like they needed to fill a gap in between scenes and transitions were awkward. Characters felt like they just appeared and disappeared as the the filmmakers needed at any moment during a scene. They'd wander down a hallway for no real reason and then they'd be somewhere else entirely a couple of shots later. It was strange. <br><br>Overall the story is decent, if maybe sometimes a bit slow, and it gets bogged down by some odd editing choices. The actors do a commendable job, and the cinematography is great. If you're looking for horror then skip it, if you are looking for something more about the drama with horror elements then it might be worth a shot.","user":"5amTunaSandwhich","rank":[9,9]},{"title":"Family Blood: Vampire tale with no bite","rating":2,"date":"26 December 2018","review":"Remember Vinessa Shaw? She was the lead female (Excluding the witches) in cult favorite Hocus Pocus (1993). Since then she's done.........and then there was.........and who could forget? Erm, stuff?<br><br>Here she leads as a former drug addict turned vampire and the affect it has on her and her two children. I can't help but feel like the whole movie was one big metaphor for addiction.<br><br>There is a problem though and it's a big one. The movie is unforgivably boring, so boring in fact I fell asleep about 1/3 of the way through and had to watch the thing from scratch again the next day.<br><br>It's SO lifeless, the characters simply aren't likeable and honestly until the last few minutes nothing happens. On top of that I see people claiming this is a new spin on the tired vampire formula, my question is how? How is this a new spin? This has been done before, the whole thing is devoid of originality.<br><br>Not one for fans of vampire cinema or for that matter cinema period.<br><br>The Good:<br><br>.......nope<br><br>The Bad:<br><br>I actually fell asleep and had to watch it again<br><br>So boring<br><br>Lifeless nonsense<br><br>Things I Learnt From This Movie:<br><br>Vinessa Shaw has nothing to contribute to the industry<br><br>Regular vampires &gt; Twilight Vampires &gt; These vampires","user":"Platypuschow","rank":[18,24]},{"title":"It wasn't as bad as some reviews would have you believe....","rating":6,"date":"26 May 2018","review":"This movie wasn't bad at all. Was it slow paced? Yes. But it was a decent movie as long as you don't go in expecting a hollywood blockbuster loaded with CGI and special effects. Bottom line...if you like movies about vampires this is a slow paced movie about an addict mother being turned into a vampire and the effect on her kids. It's not a complex movie so just watch it and enjoy it for what it is.","user":"mmundoiii","rank":[14,19]}]