[{"title":"What does it say? What does it say?","rating":8,"date":"9 August 2019","review":"Midway through this film, a woman explains to the main character, Andy (Tye Sheridan), that her daughter is at a state hospital. \"She gets it from her father,\" the mother explains, before clarifying, \"I have it, too, but I know how to exist in the world with it.\"<br><br>Like many things in this film, the pronoun \"it\" has no definite antecedent. \"Insanity\" as an outright word is studiously avoided throughout the film, just like \"pregnancy\" was once unspeakable on American television. One could safely assume that the woman is referring to \"mental illness,\" but this is the 1950s, and what would qualify as mental illness is even vaguer than it is today. In the twenty-first century, there is still debate over the exact meaning of a \"schizophrenia\" diagnosis. Talk about \"hearing voices\" suggests that this might be a movie about schizophrenia--perhaps the apotheosis of mental illnesses in our culture.<br><br>Yet, in the 1950s, having sexual attraction to people of the same sex would have also justified institutionalization, electroshock therapy, and a possible lobotomy. For large stretches of this film, the \"itness\" of its meaning seems to have something to do with sexuality and/or gender, but even that is nebulous. When Andy explain to his father (Udo Kier) that he had a dream in which a man and a woman were fighting with each other in such a tangle that he couldn't tell them apart, the father angrily snaps, \"When you were a child, I thought you would never stop growing. Now look at you. Just like your mother\" before abruptly leaving. Is that a jab at Andy's masculinity? His naive sexuality? His possible queerness? Is that what this film is about?<br><br>My grandmother resided at a state hospital for a while in 1957-8 and received several rounds of shock therapy. What was wrong with her? Today we would call it postpartum depression. My mother had just been born. My grandmother's previous child had died tragically in infancy. Jolting her brain was a perceived solution to my grandmother's ambivalent feelings about bringing another life into the world. The first several minutes of this movie--and perhaps all of it--seem to be about the listlessness, isolation, and untraceable oppressiveness of depression.<br><br>Then again, the \"it\" could be something as mundane as alcohol abuse. The mother is intoxicated as she says this line, and her heavy drinking is the only thing we see that seems to constitute any kind of \"abnormality.\" There are certainly plenty of scenes of characters drinking to excess in this film--including so-called \"healthy\" characters. But is drinking a symptom or a solution? Or is it simply something normal? \"Alcohol Use Disorder\" did not become a psychiatric diagnosis until 1994.<br><br>There's even a suggestion that the \"it\" could be something like an irrepressible desire to create art. The filmmakers are certainly aware of the long-standing romantic trope that associates artistic expression with suffering and insanity, and a character played by Denis Levant straddles that line beautifully.<br><br>And then there's the possibility that the \"it\" is merely an unwillingness to exist within society's norms. Early in the film, the traveling lobotomist Dr. Wally Fiennes (Jeff Goldblum) dictates to Andy that \"sometimes the best solution for the family is to render the patient innocuous.\" He pauses to spell out this bit of doublespeak for his young secretary--I-N-N-O-C-U-O-U-S--assuming that this euphemistic medicalese will be unknown to him. We must make them harmless and controllable, Fiennes explains. That is, essentially, the only justification he gives for his brutal profession in the entire film. Otherwise, he seems to have no more opinion or philosophy about what he does than Andy had about being a Zamboni driver at an ice skating rink.<br><br>All we know about the institutionalized daughter is that she kisses a man she should probably not be kissing, yet she only does so as a last resort at maintaining her autonomy. Is her willingness to deploy her sexuality in order to protect herself evidence that she needs to be made \"innocuous\" in order to exist in the stifling world of 1950s America?<br><br>Ultimately, I think this film wants us to consider to what extent we are all \"insane.\" I would say there's only a fine line between how the \"sane\" and the \"insane\" characters are depicted in this film, but in fact I think there's no line at all. A \"twist\" in the third act, in which a presumably sane character is suddenly revealed to be insane, solidifies that fact.<br><br>There's a lot of nonsense and ambiguity in this film. At one point Andy ponders the slip of paper in his fortune cookie. Dr. Fiennes eagerly asks him, twice, \"What does it say?\" The film cuts away before we learn what it says, and it's never mentioned again. Perhaps it says nothing. Even though Dr. Fiennes's own fortune was utter garbage--\"You will one day see the Great Pyramids of Egypt\"--as viewers we're conditioned to believe that something featured in a film will be meaningful. If Andy had had the same fortune about the pyramids, then perhaps we would assume that meant their destinies were intertwined (there are no coincidences, after all, Freud supposedly believed). If he had no fortune at all, perhaps we'd consider that ominous. Symbolism in art is often overdetermined.<br><br>But I think it's wrong to try to overanalyze this film, and I think that message is--somewhat paradoxically--the point of this movie. Some films beg to have every shot and symbol deciphered and interpreted, but I think THE MOUNTAIN--the very title of which refers to an intriguing yet nonsensical diatribe about the interpretation of art--wants us to still that impulse. Overanalyzing a movie is one thing, but the same impulse also drives us to overanalyze people, to interpret everything they say and do within narrowly confined concepts, and once we've learned how to read them, we can then diagnose them, box them, confine them, and render them innocuous.<br><br>After that twist I mentioned happens, a disturbing catechism occurs in which moments and images of the film that were previously ambiguous and evocative are reduced to the simple binary of yes/no questions, which are together piled up into an inventory of evidence of insanity. We know this is as unscientific and wrong as a Buzzfeed \"Which Disney villain are you?\" quiz. We know that these simple questions are pointing towards things that are far more intricate and complicated. Yet the very tangible result of this psychoanalytic oversimplification is something that is clean-cut and devastating.<br><br>THE MOUNTAIN is a gorgeous film. The cinematography is stifling, with a monochromatic beige color palette and a confining box frame aspect ratio. This is a road trip movie, essentially, and Andy and Dr. Fiennes are traveling from one hospital to another, but they may as well have shot all the scenes at the same location. Every hospital room is identically barren. All the patients--though their ages, genders, and races may fluctuate--wear the same brown socks and anesthetized facial expressions. Tye Sheridan, who I don't normally consider an exceptionally good actor, does an excellent job here. With limited lines, he embodies the physicality of a depressed and confused young man of the 1950s. Similar to Joaquin Phoenix's performance in THE MASTER, Sheridan seems to be inhabiting the physical bearing of a previous generation's ideas about masculinity. He evokes layers and is fascinating to watch, as are all the actors in this film.<br><br>THE MOUNTAIN is certainly not a pleasant film, a riveting one, or even one that I can easily recommend, but I do think it merits much more than the dismissiveness with which many viewers seem to be regarding it.","user":"nehpetstephen","rank":[26,32]},{"title":"I mean... I guess?","rating":6,"date":"30 January 2019","review":"(i'm going to structure this review so that you have the same feeling that I did while watching this movie)<br><br><br><br>The mountain is great at<br><br>times?<br><br>(inconsistent inconsistent)<br><br>It struggles to maintain a consistent theme, often<br><br>rambling rambling thematically?<br><br>\nI understand the value of \"show don't tell\" don't get me wrong?<br><br>(Depressing psyclops)<br><br>But, there is a science to the abstract.<br><br>(Kauf Kauf)<br><br>Charlie Kaufman's work is a great example. (Eternal Sunshine, Adaptation, Being John Malcovitch) He gets pretty WEIRD and abstract, sure. But<br><br>(HELP HELP I'M FALLING?)<br><br>He makes sure to lay down a simple groundwork first, so the viewer doesn't get too lost in his interpretation interpretation.<br><br>THE MOUNTAIN DOESN'T HAVE ANY GROUNDWORK, UNFORTUNATELY. NOTHING IS SET IN STONE. THERe isn't one set theme that you can latch on to. Because of this, the whole film feels wrong<br><br>WRONG WRONG KRONK<br><br>It's hard to tell what was an intentional choice from the director, and what was just an inconsistent detail.<br><br>It's a shame, because the movie was great at times. And I did understand some of<br><br>END OF REVIEW","user":"samemckee","rank":[61,85]},{"title":"home on the range","rating":5,"date":"8 June 2019","review":"Greetings again from the darkness. It's happened before and it'll likely happen a few more times. A movie ends and I'm at a loss as to how to explain it. What should I tell potential viewers? Is it even possible to \"spoil\" a movie that is so purposefully downbeat - one that relishes its inability to be analyzed by conventional methods? Filmmaker Rick Alverson has previously knocked us off-kilter with THE COMEDY (2012) and ENTERTAINMENT (2015), and this time seems intent on ensuring our misery.<br><br>Tye Sheridan (MUD, 2012) stars as Andy, a functionally catatonic, sexually-confused Zamboni driver at the local ice rink where his dad Frederick (a quite grumpy Udo Kier) trains figure skaters. When dad drops dead on the ice, an aimless Andy is taken under the wing of an enigmatic Dr. Wallace \"Wally\" Fiennes (a toned-down Jeff Goldblum). Wally previously treated Andy's mother, which isn't really a good thing since he specializes in lobotomies and electric shock therapy. Andy hits the road with the doctor, carrying his equipment and taking before and after photos with the Polaroid Land Camera. Oh yeah, the setting is 1950's Pacific Northwest.<br><br>Goldblum's character is based on a real life doctor, and he runs up against an industry that is transitioning to drug treatments, leaving Wally searching for patients. He clearly believes in his treatments, and that leads to Jack, an eccentric whose daughter Susan (Hannah Gross, \"Mindhunter\") is in need of Wally's treatment. Jack is played by French acting veteran Denis Lavant, and his tirades and wild speeches blend French and English to the point that we lose the point - if there ever was one.<br><br>Goldblum's doctor enjoys a drink and the company of women while on the road, and Sheridan's Andy is so ultra-quiet he often becomes nearly invisible in social settings. If there is a narrative foundation to the film, I do wish Andy's Ouija board device had spelled it out for me. Instead, the haunting music contrasted with the use of \"Home on the Range\" left me understanding that the few words spoken carry little meaning, and we are meant to be disrupted by feelings. My hopeless feeling mostly left me asking \"why?\", and a bizarre post film Q&amp;A with co-writer Dustin Guy Defa added little context. Actually, that was likely the perfect ending to this film.","user":"ferguson-6","rank":[13,17]}]