[{"title":"Trust me: even if you hate it at first, watch the whole thing","rating":8,"date":"28 August 2019","review":"My husband and I watched this quite coincidentally a few days after seeing VICTORIA, the 140-minute true single take drama that is one of the most extraordinary accomplishments ever committed to film. After seeing what they had pulled off in that film (powerful performances, action scenes, no less than half a dozen distinct settings, a moving story), we were very underwhelmed by the single take zombie story at the beginning of ONE CUT OF THE DEAD. Thirty minutes in, my husband gave up and went upstairs to do other things. I trusted the glowing reviews I had seen and stuck with it.<br><br>The film has three acts. They're all fairly amateurish, which is to be expected considering the entire film was made for roughly the same cost as a new car. The first act--the single take zombie action sequence--is especially bad. Really weird pacing, an extremely corny story, and jarring errors that come across as cheap and unprofessional. The second act flashes back six months, showing us how the film-within-a-film we've just watched (i.e. Act I) was originally conceived and produced. This act isn't much better. The acting feels more natural and the story is a little more interesting, with some more meaningful character development, but there's also an extremely awful score and some really poor jokes, so it seems like a wash. Then the third act comes--a behind-the-scenes glimpse of the filming of the film-within-a-film that was Act I.<br><br>I don't want to spoil anything, but trust me that the third act redeems everything, not only evoking some genuine gut-busting laughter but also pulling off the miraculous feat of teaching you to appreciate the first act--the one you were probably just harshly judging half an hour ago--on its very own terms. Sure, you'll find the first act hilarious having seen it from a new perspective, but what makes this film quite special is that you might also chide yourself for having been so critical of it the first time around. The film-within-a-film has flaws, but even so, it's a pretty impressive achievement. By the time the credits roll (at which point we're treated to actual behind-the-scenes footage, which is just meta upon meta), you'll be cheering the filmmakers (fictional as well as real) for having pulled off the very thing that at first glance seemed unremarkable.<br><br>Even the corniest B-movie is a small miracle of teamwork, so the film ultimately becomes a celebration of filmmaking and an invitation to step off one's high horse and appreciate smaller acts of triumph. This movie is a very surprising joy.","user":"nehpetstephen","rank":[60,66]},{"title":"Amazing","rating":9,"date":"4 January 2020","review":"So at first you just cringe and laugh at the silliness of the movie. Then you are confused. And then you laugh at how amazing the movie is. The last 30minutes were one of my best movie watching experience.","user":"koerajupp","rank":[21,22]},{"title":"VERY FUNNY AND FUN FILM ABOUT FILMMAKING","rating":10,"date":"11 December 2019","review":"Funniest film I've watched all year. Awesome cinematography. Simple plot but it's fun to see how a film shooting went, how problems are handled and tackled, how some things goes out the window, and the sacrifices it takes to make it work. You could say it's a love letter to all the behind the scene crews and filmmakers all over the world. Anyone who's have experience on being one would definitely appreciate and enjoy this film. Highly recommended.","user":"nizzambaharuddin","rank":[9,10]}]