[{"title":"Potential is there. Sound ruins it","rating":6,"date":"4 January 2020","review":"This movie could be compelling if you could hear the dialogue. Not sure why the background sound is louder than the dialog, but it essentially makes it hard to follow. In one scene you hear the leaking water more than anything else. I wanted to like this movie more.","user":"jillgradwohl","rank":[11,12]},{"title":"The 80's and 90's Punk Rock Boiled Down To Sweaty Backstage Antics","rating":7,"date":"9 February 2020","review":"If you've survived the 90's era punk rock scene, a lot of this will ring true. Drawing from the misbehaviors of Axl Rose and (I presume) Courtney Love, Elizabeth Ross plays Becky Something, the front woman for the underground success band Something She. When we first come across the fried out Fraggle, she is backstage with the rest of her trio, bassist Marielle Hell (Agyness Deyn) and Ali van der Wolff (Gayle Rankin). Obviously success has gone to Becky's head, which causes her to vamp about all the inequities she's faced in life and all the miseries she insists to burden others with. They aren't all angels, but Becky goes beyond the party lifestyle into stretching the bounds of tolerance. Especially to a rival Zelda E. Zekiel (Amber Heard) who recognizes Becky's talents and wishes they'd tour together. Instead, she's met with the acid tongue of Becky. And so it repeats itself.\n\"Her Smell\" isn't necessarily a cautionary tale of the rock business, as that's long dead. But it makes you wonder why it was made. My only guess is that it is a glimpse at a bygone era when a rock star life will catch up to you. And we have never really seen this from a female perspective. In most cases, Hollywood uses an established band and makes it a biopic. As in \"The Runaways\". In this case, the essence of bands like Hole or Bikini Kill is enough to elicit the response.\nIt's not anything new you haven't heard about poor behavior of damaged people BUT Elizabeth Moss absolutely owns the role and it's impressive how deep she got into this truly unlikeable person. Kudos to writer/director Alex Ross Perry. If you aren't familiar with his work, \"Queen of Earth\" is a very odd, inaccessible actor's exercise. Hard to watch, so I was very happy that this does have more accessibility when it comes to the story. Also, the dialogue is pretty solid. The cruelty a degenerate rock band inflicts on each other seemed real.","user":"statuskuo","rank":[6,6]},{"title":"Very few movies can sustain 2hr 14 mins of interest -- this is not one of them","rating":5,"date":"8 November 2019","review":"I kind of liked this movie. The realistic footage and acting were compelling. But ultimately there is just not enough interesting material to sustain such a long movie. What was the director/producer thinking? The same story, the same vibe, the same message, etc. could have easily been told as a 1:30 or 1:40 moved -- a good 40 minuted of filler less. At some point I just got bored, which is a shame as there was a good movie (still nothing amazing, but a 6.5 I want to say) in here somewhere. In the end it rates as just average.","user":"goods116","rank":[13,17]}]