[{"title":"DRAGON BALL","rating":9,"date":"20 February 2020","review":"One of the best dragon ball movies i had the pleasure of seeing from the art atyle to the fighting it is breathtaking the story of planet vegetas downfall to the backstory of Broly which now makes sence it was amazing.","user":"MR_Heraclius","rank":[39,40]},{"title":"Just Epic","rating":10,"date":"14 December 2018","review":"A must watch film for every anime lover's who watched DB.","user":"sudharsan-sudha12","rank":[180,213]},{"title":"\" A+++ MOVIE \"","rating":10,"date":"14 December 2018","review":"\" THIS IS A NON SPOILER REVIEW\"\nReview:-\nThis is an absolute gem of a movie. Modern Dragon ball can't get any better than this. It was really phenomenol.\nHere a few key features of the movie\n(i) PLOT :\nThe movie is divided into 2 phases. The \"Past&amp;The Present\". The start of the movie is all about the history of the saiyans. The movie does a half an hour long depiction of the history of the saiyans. The past is mostly based off \"DB MINUS\" with a few tid bits from the \"Bardock: The Father of Goku\".\nThe movie is more about broly. Broly was a saiyan with really high potential. King vegeta being jealous of broly's latent potential decided to send away baby broly to a far away planet \"Vampa\". Paragus(Father of broly) being betrayed by The King, vowed to find his son and one day get revenge on the king.\nThe movie explains about the ties of fate between Goku, Vegeta and Broly.\nThe present section of the movie takes place after \"THE TOURNAMENT OF POWER\". Its about the encounter of the 3 fated saiyans with each other.\nPretty simple plot not too complex or anythig but is really well written and executed pretty well!<br><br>(ii) ANIMATION:\nThe animation of this movie is out of this world. Toriyama and Toei Animation decided to change the animation supervisor and character designer \"Tadayoshi Yamamuro\" to \"Nahiro Shinatni\". His animation is more fluid and gives a refreshing feel to the movie.\nThere is a use of CG as well. In short this is the best anime movie of 2018 when it comes to animation.\nHaving animators from My hero academia, one punch man etc working on it. Also got Toei's best staff with the likes of Naotoshi Shida, Yuya Takahashi, Naoki tate and other great animators.\nThe movie is a one hour and fourty minutes of pure \" SAGAKA\".<br><br>(iii) MUSIC AND DIRECTION\nMovie director is \"Nagamine\" who produced one of the best episodes of super like episode 95 or the introduction of Ultra Instinct etc.\nThe movie is directed really well by him. His story boards were really amazing.\nThe music is composed by \" Sumitomo\" who had his fair share of criticism from the fans because of his music in the beginning of super. His music in battle of gods was pretty good but in this movie its so emotional and captivating.\n(iv) FIGHT SCENES:<br><br>Dragon Ball is known for producing some of the best fights in all of anime. And this movie is no exception. With the likes of takahashi and Naotoshi shida handling the main action parts of the film, the fight scenes are absolutely mind blowing. Especially the final section of the movie where Shida brings his A game to the movie, shida mixed with Shinatni sheets produced some of the best fights in all of anime.<br><br>(v) PROBLEMS:\nNothing is perfect and Dragon ball Super broly also had some tiny problems as well.\n1. RUSHING: Sometimes the movie felt a bit rushed. Mainly because the original script of the movie was actually 3hours long so they had to narrow it down to 1 hour 40 minutes.That is why some sections are abit rushed but its not that big of a deal.\n2.Lack of Tension : THE movie lacked tension as compared to the days of dbz. But still its just a tiny problem not that big of deal to ruin a movie.\n3.Retcons :\nThere were a few retcons here and there. but i can ignore such retcons as they don't seem that big to me.<br><br>(VI) CONCLUSION:\nYou should absolutely watch this movie.\nNot only its animated really well ,it show case some of the best fights of 2018, and it has great music too. Please go and watching this movie in the theatres. Its theatrical experience will blow your mind.\nOverall its a pretty solid movie.\n9/10 for me !!!","user":"saimazaidi","rank":[100,127]}]