[{"title":"Depressingly Predicatable","rating":3,"date":"23 February 2020","review":"\"True Fiction\" is one of those maddening movies that makes you want to bang your head against a wall. Including some spoilers in order to let people know what they're in for. It begins with a tantalizing and fascinating story line, and then abandons it in order to be politically correct.<br><br>The film starts with aspiring writer Avery Malone (well played by Sara Garcia) getting a once in a lifetime job to be an assistant to her favorite writer, Caleb Conrad. When she gets to his house, Caleb (also well played by John Cassini) tells her that the two of them are locked in, and has her sign a contract telling her that they will be playing a \"game\" where they try to have her face her fears. The result is that the two of them will write his new novel based on the events of what happens between them. During the \"games,\" she gets terrified and starts to experience paranoia and starts to question Conrad's motives and, indeed, if that really *is* Caleb Conrad...<br><br>The setup and the first 45 minutes or so are fascinating. The performances are great and believable. But if you're like me, or like anybody who has watched any movies for the past five year, you're probably saying to yourself, \"A man does mean things to a woman? I'll bet that the 'twist' is that he ends up chained up while the woman - all covered in blood - tortures him, far worse than anything he ever did to her.\" And yup, that's exactly what happens. It was maddeningly frustrating that the entire setup, and what is actually a pretty unique plot, was thrown out the window so it could end up a \"Me Too -- the woman ends up taking violent revenge on a man who was mean to her\" saga.<br><br>Part of me wants to say to watch it for the first 45 minutes, appreciate the clever plot and the outstanding work by Sara Garcia and John Cassini, and then turn it off and make up your own ending. But it so totally falls apart at the end, so totally abandons the characters in order to be PC and woke that I just can't.","user":"stsinger","rank":[14,26]},{"title":"True fiction","rating":7,"date":"23 February 2020","review":"Movie has you guessing from the beginning.\nA littlw confusing at times. But a good movie\n. Deserves rating higher than a 1 that's for sure.","user":"sroldan-39218","rank":[8,14]},{"title":"Starts off great but lost the plot","rating":5,"date":"7 March 2020","review":"Had no idea where this film was going, and i was hooked. Until it got past the midway point and it sort of lost track.<br><br>The ending was trash which is why i give it 5 stars<br><br>Not a terrible film","user":"aucottjohn","rank":[3,4]}]