[{"title":"An interesting history of the rise and fall of House Targaryen","rating":8,"date":"3 January 2019","review":"This animated feature, which came bundled with Season Seven of 'Game of Thrones' serves to tell the viewer of how House Targaryen came to conquer then lose the Seven Kingdom of Westeros. Starting in ancient Valyria, the greatest city this world has known, they leave for Dragonstone with their dragons. A cataclysm destroys Valyria and later Aegon Targaryen eyes the continent to the west: Westeros. With his dragons he defeats the various local kings; some houses disappear while others ally with him and prosper. Ultimately though House Targaryen is doomed as its decedents, prone to madness, cause the 'Mad King' to be assassinated and the last of their line to flee to the continent of Essos.<br><br>This should be of interest to fans of 'Game of Thrones' as it tells us the history that led up to the Seven Kingdoms we've come to know in the series. It is described as animated but most of the story is illustrated by a series of still images with only limited animation. That wasn't a problem for me though is it still effectively illustrated what was happening. Obviously it can't go into a great deal of depth but it touches on many things mentioned but not really explained in the main series. The story is mostly narrated Harry Lloyd as Viserys Targaryen but also features the voices of several major cast members as the story moves on to their houses. As the narration ends before the events of the main series there are no spoilers to speak of but I suspect it wouldn't be of much interest to anybody who isn't already invested in the series... if you have enjoyed the series so far I'd definitely say this is something to watch.","user":"Tweekums","rank":[16,17]},{"title":"An entertaining way of providing some backstory.","rating":8,"date":"4 February 2019","review":"This DVD came with my boxed set of season 7. It's short but fills in a lot of the events that are often referenced on Game of Thrones. It doesn't go too in depth, but given that there are planned prequel spin-offs, it's understandable that they don't want to tell the whole story. It explains the main points of the events that led up to the political situation of Game of Thrones (Robert's Rebellion for example).\nThe animation is much more stylised than we might be used to, but for me, that is part of its charm. It is more like looking at a storybook than watching Disney style traditional animation.","user":"halcyonbear","rank":[9,9]},{"title":"A lot of interesting information","rating":10,"date":"15 May 2019","review":"I think any one who is interesting on Game of thrones should watch this short movie","user":"fffrrr-16096","rank":[4,6]}]