[{"title":"Animal World: Fantastic, but not for the reasons you'd think","rating":8,"date":"25 March 2019","review":"Animal World got some great publicity because of the train scene that went viral across social media, a martial arts clown battling monsters through train carriages! Memorable stuff. For this reason that's what I assumed Animal World would basically be, I was mistaken and in a good way.<br><br>It tells the story of a young man who finds himself in tremendous debt and forced to play an elaborate game of rock paper scissors hosted by Michael Douglas to save himself.<br><br>Okay fine the premise sounds a bit ropey but in fact it's the concept that makes this such a remarkable film. It looks like a AAA Hollywood film not the Chinese movie it is, it's well cast, very cleverly written and I was gripped more than I have been by a film in quite sometime.<br><br>So the clown? the cgi monsters? the incredible over the top fight scenes? Well they're the weakest part of the film! Not because they're bad, in fact quite the opposite they're incredible stuff. No the problem with them is that they're entirely unnecessary, they detract from the movie rather than contribute to it. Instead of seeing more (Because there isn't much) I'd rather they had not included that at all, maybe make a separate movie altogether for that stuff.<br><br>Such a clever well constructed film with entirely forgivable flaws.<br><br>The Good:<br><br>Some incredible visuals<br><br>Solid soundtrack<br><br>Michael Douglas<br><br>Fantastic concept<br><br>The Bad:<br><br>Side concept is unnecessary<br><br>Unfinished story with no assurance of a sequel","user":"Platypuschow","rank":[13,14]},{"title":"Surprisingly entertaining and engaging","rating":7,"date":"5 July 2018","review":"Animal World is the Chinese adaptation of the Japanese film Kaiji Ultimate Gambler. <br><br>The effects in this film are extremely good. It's used in a way which highlights impact moments and helps the film explain its logic based obstacles. Not everyone will be able to follow the logic unfortunately. The film does it's best to explain to the audience but does not slow down. My partner who is a native mandarin speaker said she got lost at times, so it wasn't really the language that was the problem. I really enjoyed the puzzle / riddle type thinking exercises the movie places in front of you. <br><br>The characters aren't built up or developed and lack substance. The film isn't focused on that. It uses that as a background to set the stage for the main part of the film. Once it starts though, the film managed to me engaged and excited looking forward to what happens next. Through clever use of special effects and camera work, you get to enjoy some well executed cinematography. <br><br>I would actually recommend this to some of my family and friends who I know enjoy these kinds of films. I would watch it again once it comes out on my devices.<br><br>In conclusion, those who enjoy fast paced, straight into the action that requires a bit of thinking will enjoy this movie. It was definitely executed well for the type of movie it is trying to be. 7 / 10","user":"linkus-88363","rank":[29,40]},{"title":"Visually strong","rating":8,"date":"30 June 2018","review":"This isn't the first film to have a grossly misleading trailer. it skews the audience by attracting an audience to the expectations driven by the trailer, and keeping away those who would actually enjoy the real story. <br><br>It is a dark, dystopian semi-fantasy with interesting, well-played characters and a terrific visual style. I largely based my 8-stars on its appearance, which let me forgive the weakness of the mostly wasted clown scenes and the plot holes. <br><br>The lead is a disturbed (for good reason) young man with a highly stressful life. Top level production design. The plot twists and betrayals are well done, and plausible, under the dark fantasy circumstances. <br><br>I hope there is a sequel, and if so, maybe the clown aspect will be important. If not, then it is largely a waste of screen time. <br><br>Film fans who are also mathematicians will have an extra dimension to enjoy.","user":"wraggj-09324","rank":[24,36]}]