[{"title":"Good Movie, A must See!","rating":8,"date":"8 January 2019","review":"The plot was authentic. The characters were real and relatable. The suspense will keep you on the edge of your seat. Can't wait for part 2.","user":"dprtty","rank":[10,13]},{"title":"Awful Movie","rating":1,"date":"14 January 2019","review":"I'm very, very easy to please when it comes to movies. I've seen tons of movies, and I usually like all of them. People rated it 3.8? I enjoy it usually. It takes a rare kind of movie for me not to like it.<br><br>This is it. Don't believe the other reviewers. If you've watched more then 15 movies in your lifetime, this movie will bother you. The storyline is fine, but the acting is the worst I've ever seen in a movie not made by high school kids. There's a little girl in this movie that literally just reads the script, the lead actress is terrible, and most of the side characters actors are pretty bad too.<br><br>The sound quality is the worst I've ever heard. As the scenes roll you can hear the differences in wind/traffic/noise between the different angles shot within the same scene. The music isn't en enough of the movie and dies out in certain parts. There's canned voices for certain scenes, which could've easily been fixed in editing.<br><br>This movie watches like it was shot in one day, and with only one take for every scene. It's honestly the worst movie I've ever watched and I've seen a good 2,000 movies. I'm very easy to please and man this one sucked bad.<br><br>Honestly this is a really badly shot movie, and the storyline does not save it. It's just bad.","user":"thejudge-30426","rank":[7,10]},{"title":"Terrible acting. Terrible audio","rating":3,"date":"5 May 2019","review":"The acting in this is AWFUL. Let me list a handful of the things that got on my last nerve.<br><br>-From the first scene on. The moment it started I was annoyed with Jim smacking his gum. Who chews their gum like a cow chewing cud in a movie scene. He's not even the only one that does it. There's multiple ppl.<br><br>-Then the audio was horrible. There are scenes that look like they shot it and forgot to turn the audio on so they had to add voice over for that 10 min scene.<br><br>-One scene Hoopz opens the screen and front door on a house. It was so obv the sound of the door was edited in it was ridiculous. It was like the sounds they use on a haunted house. The screeching door sound.<br><br>-The dude Patrick she goes on a date with, him trying to act all smooth is hard to watch. It doesn't look natural, at all.<br><br>-The closed captioning on this movie says *ngger isn't stead of *ngga. How do u not catch that?<br><br>I will say the longer the movie goes on the better job Hoopz does. Like she's getting more comfortable. But she def needs some more acting classes to not seem so stiff and like she's acting.","user":"micah-39739","rank":[2,2]}]