[{"title":"Humans Are Monsters in Larry Fessenden's Best Work So Far","rating":7,"date":"13 September 2019","review":"Early reviews, particulary the one from Bloody Disgusting intrigued me a lot, and I've always had a lot of respect for Larry Fessenden and the work he does on indie horror scene, from directing to producing to acting. I'm happy to say this is my favorite work of his.<br><br>\"Depraved\" is the good old Frankenstein tale, put into a modern setting with modern problems. Henry, an army veteran and a field medic who's suffering from PTSD has teamed up with his life-long friend, the rich, greedy and egocentrical John to create a new life - Adam. All three of the main characters are more than one dimensional, brought on to screen by good performances, with the most pleasantly surprising being that by Alex Breaux who portrays Adam or the created life, the monster. Unexpectedly great portrayal, perhaps the main reason I'm recommending this. \"Depraved\" runs for 110 minutes which was concerning at first, but the pacing endured and boredom can be avoided (can, of course, also means there's a can't). Make no mistake, it's a drama before it's a horror, but it flows nicely and evenly, the dialogue is enjoyable and there's enough thought provoking material to filter. The FX is good and believable, cinematography is crafty and diverse though I noticed a few seemingly unintentionally out-of-focus shots.<br><br>I generally don't like Frankenstein tales much, there have been a lot of painfully average examples, even the one with Daniel Radcliffe and James McAvoy was worse than this. \"Depraved\" might not be the freshest or richest one of them, but it feels steady, heartful and entertaining. I've seen almost every directional feature of Fessenden (the ones that've come out since 2000) and I do think I can objectivly conclude that this is his best. My rating: 7/10.","user":"TwistedContent","rank":[22,27]},{"title":"Bad title for a good movie","rating":8,"date":"5 October 2019","review":"I nearly didn't watch this because of the title and the poster artwork. I just presumed it would be a cheap and nasty horror flick. But it's a really good reworking of the Frankenstein story and quite poignant in parts. The characters are well rounded and you actually do care about them. It has a good script though there are parts that seem rushed or out of character towards the end. I thoroughly enjoyed it and was glad I took the trouble to give it a go.","user":"MikeWright75","rank":[11,15]},{"title":"Terrific Frankenstein movie","rating":9,"date":"27 August 2019","review":"I saw this at Frightfest and was really entertained by it. it nods to Karloff and Lee etc as well as the novel. it also references the wickedness and venality of american drug companies, capitalism etc. the acting especially the monster is great. it even nods to the novels snowbound ending. it delivers on gore and violence pleasingly. The monster has great pathos as it should.<br><br>Larry Fessenden's best movie in my estimation","user":"danthsmith-75606","rank":[16,27]}]