[{"title":"Get into the head of tennis's \"superbrat.\" One of the best docs ever.","rating":11,"date":"11 September 2018","review":"\"When I walk out there on court, I become a maniac... Something comes over me, man.\" John McEnroe<br><br>John McEnroe: In the Realm of Perfection is the documentary we have waited a lifetime for: The titular tennis titan was photographed decades ago by cinematographer Gil de Kermadec but never so well displayed as in this perfect documentary by Julien Faraut using Kermadec's footage. Call it a \"found footage\" doc if you will.<br><br>Faraut's engaging approach is to have minimal but incisive voiceover while using often the ¾ view to concentrate on McEnroe's body and language to understand the range and passion of his perfectionism. Few documentaries are able to get inside the artist's head the way Faraut does.<br><br>Along the way is a good portion of entertainment as McEnroe berates line judges, chair referees, cameramen, and spectators, all of whom he probably believed couldn't know the sport as well as he.<br><br>His petulant \"superbrat\" mien makes engaging sports viewing, and Faraut's doc is equally so but with a deeper desire to understand the tennis bad boy's motivations. Although seeing this film brings us closer to McEnroe's demons, it doesn't completely explain them. <br><br>Faraut seems to believe that McEnroe's constant competitor is himself with the understanding that everyone should know that the forces of competitiveness and perfectionism account for his eccentric and erratic behavior. Given Serena Williams' recent outburst, this remarkable doc helps us understand better our gifted athletes.<br><br>\"What is the single most important quality in a tennis champion? I would have to say desire, staying in there and winning matches when you are not playing that well.\" McEnroe","user":"jdesando","rank":[6,7]},{"title":"Missing magic","rating":5,"date":"27 February 2019","review":"I have to say that the team did a great job of reviewing thousands of minutes of John McEnroe game footage shot for coaching analysis purposes and making a movie of it. That said, this is the sort of thing I'd enjoy watching on tv on a lazy Saturday afternoon perhaps but when it was presented as a movie, in a cinema, about one of tennis's game changers and precocious characters, it was disappointing. I've read the glowing critics reviews and have to say these people must be devotees of the great man to be so entranced by this doco. I wanted so much more than this was ever able to deliver, given its origins. To be fair, I didn't read the reviews or the synopsis in enough detail I guess to realize what I was in for. I fell for the poster and the log line and my own wish for the inside story rather than what this really was. It's a love letter from a coaching analyst that few outside that narrow realm will really get into. It's as French as a Citroen. The film celebrates his uniqueness, his unpredictability. But I wish it was a lot more entertaining and insightful than I found it to be.","user":"ian-39125","rank":[2,2]},{"title":"Not a biographical nor a standard sports Doc on the famed Tennis champion","rating":20,"date":"20 September 2018","review":"Released just as the Serena Williams controversy broke out over her confrontation with a court-side umpire at the U.S. Open (and McEnroe was directly cited by Serena defenders as an example of how male tennis players get away with similar behavior) McENROE: IN THE REALM OF PERFECTION would have seemed like a perfect time to debut a Documentary on the infamous bad-boy of 80s tennis: John McEnroe. But, REALM isn't a biographical Doc. Nor, is it a standard Sports Doc (despite ending with the 'big game/match'). Indeed, REALM is more of a deconstruction than anything else (complete with quotes from Jean Luc Godard).<br><br>Renowned French Documentarian Gil de Kermadec made a series of films in the 70s and 80s on tennis. He and his team shot hours and hours of footage, including for a 'portrait' movie on John McEnroe that was released in 1985. REALM Director Julien Faraut dug into the vaults and created this movie largely out of that unused footage. But, Faraut isn't primarily focused on creating a movie about McEnroe or the sport, rather, he explores how cinema can be used to cover those topics. <br><br>For the first half hour or so, REALM is a heady exercise. We see how raw footage can be molded with editing, sound, narration and other manipulations. It's a fascinating, if academic, exercise. About half-way through the relative shapelessness of the Documentary can get a bit wearying. The Narration by actor Mathieu Amalric isn't there to 'explain' as much as it becomes another tool for Faraut to dissect the form. Some of the music and sound effects are more distancing than illuminating. And, we don't truly learn the meaning of the title until the very end of picture. Some of this is inherent in the footage Faraut 'inherited' from de Kermandec, for, he was also not interested in giving his viewers a full picture of McEnroe (indeed, much of the what was shot in the 80s focuses on only on McEnroe's half of the court. By design, of course). <br><br>Still, for all the arty techniques, a portrait does emerge of the prickly McEnroe (Faraut 'cheats' a bit here by including enough outside footage to bring some narrative meaning to the enterprise). Were his rants and outbursts just tools for him to not only let off steam, but, also to manipulate and otherwise intimidate his opponents, and, yes, tennis officials? REALM does climax with a fairly straight-forward (by comparison) depiction of the 1984 French Grand Slam final between McEnroe and Ivan Lendl. The tension of the match gives the viewer not so much pleasure, as relief that one is able to follow the Documentary is a conventional manner and not feel that they are watching an scholarly exercise. But, it is the rigorously examination of form that marks REALM as one of the year's most fascinating, if, at times, frustrating Documentaries.","user":"gortx","rank":[3,4]}]