[{"title":"Recommended! (But obviously polarising)","rating":8,"date":"7 February 2019","review":"As you can see by the reviews posted so far, this little gem polarises the audience.<br><br>One share of the Reviews is 7-10, the other 1-3. Almost nothing in between.<br><br>Probably this his to to with the expections.<br><br>Well, if you're looking for some fast-paced space battle pew pew laser action this isn't the movie you want to watch.\nThis isn't a movie about aliens or about high-tech spacecraft.\nIt's a movie about a few people in a difficult situation.<br><br>Made using simple means but with love to the detail. Retro in the best sense. Slow but thrilling. Good acting.<br><br>To give away too much of the plot would be a shame. So just watch and enjoy.\n(Or don't watch if you only like movies with tons of explosions and lengthy chases.)","user":"bOOnish","rank":[173,219]},{"title":"A rare treat: real sci-fi without pretension or the usual stupidities","rating":9,"date":"29 July 2019","review":"I thoroughly enjoyed this movie. It tells a fairly simple but very engaging proper sci-fi story in a way that makes it refreshingly easy to suspend disbelief: no really stupid bad science or cheesy overblown SFX, and very little clunky exposition (apart perhaps from a little by the dad early on).<br><br>Others have alluded to a \"space western\" vibe, and perhaps this is somewhat valid in a good way- it would arguably fit quite comfortably in the Firefly/Serenity universe. It's not full of highly conceptual artifice but the attention to detail is very impressive, bringing to life a believably gritty reality that reminded me of Ridley Scott's thinking about the future not being shiny-new, but old and worn.<br><br>The main characters are nicely understated but relatable, the pace is great, and unlike a lot of sci-fi movies that treat the viewer as an utter moron, this one doesn't over-explain or create spurious tensions and conflict for cheap 'drama'.<br><br>As a kid I hoovered up EE Doc Smith and old mags like Fantasy &amp; Science Fiction, Analog, Amazing SF et al, still love the stories and novels of Asimov, Heinlein, Clarke, Simak, Poul Anderson, LeGuinn, Ellison etc and would still rather watch Bladerunner again than yet another trashy superhero 'blockbuster'. Bearing all that in mind, I highly recommend this movie.","user":"bogusmcnuts","rank":[74,91]},{"title":"A side story from a greater universe","rating":13,"date":"13 December 2018","review":"Prospect, directed by Zeek Earl and Chris Caldwell, is a tale you could see on the fringes of a larger story. It tells about a young teenage girl, played by Sophie Thatcher, who lands on a distant planet with her dad (Jay Duplass), to hunt and harvest precious gemstones that might be their ticket to better life and prosperity. But, on the outer planets, you run into all sorts of danger.<br><br>Prospect is not a large story. Its about a single life, single girl, trying to survive a horrible situation. This story could be told in many ways. It could be a three page short story in a pulp magazine focusing on westerns. It could be a side plot on a TV series. It could be a whole novel, if you padded it and fleshed it out, but even then there's not that much to bite on.<br><br>And that's exactly why the film is so refreshing. Because it is such a rare piece, because it chooses to focus on a smaller story. And because it such a well-told narrative, it manages to make such a story feel grander than it is.<br><br>It helps that the film is brilliantly made. You can very easily see the limitations of the budget, but fortunately modern effects are so good that you can tell a science fiction story, set on a distant planet, and make it seem real even if you don't have the budget for huge sets and elaborate props.<br><br>The acting is also surprisingly good. Thatcher plays her character very mellow, very low-key, but it works. Pedro Pascal as Ezra, a mercenary harvester, is also brilliant. Just the right amount of quirk mixed with world-weariness.<br><br>Prospect is an easy recommendation if you're a fan of the science fiction genre. Beautiful visuals, interesting scenarios, great world-building and off-beat story moments. What's not to like?","user":"Vartiainen","rank":[116,149]}]