[{"title":"Just die, will you!","rating":1,"date":"3 April 2018","review":"Stop making these pointless crappy CGI garbage sequels! <br><br>Nothing new is added and no character development is intended in these too far-fetched sequels which make no sense other than trying to grab what tiny amount of money non-critical parents will spend to distract their toddlers! <br><br>The original was no masterpiece, but all this crappy sequels made me appreciate it so much more! The beyond awful, lazy and ugly Swan Princess Christmas made no sense whatsoever, because it contradicted the original and added nonsensical pop-culture elements which didn't fit the medieval setting. <br><br>And it just keeps on doing it! This one has submarines and electricity and heck if I know more, I've only watched the trailer and will by no means torture myself by watching this dragged out cash grab of a franchise! <br><br>And if you want a Swan Princess movie with just a little effort put into it, go watch the original 1994 movie. The first two sequels are passable, but not recommendable.","user":"Animany94","rank":[7,9]},{"title":"Hilarious but all for the wrong reasons","rating":1,"date":"28 September 2019","review":"I haven't seen the prequels, but my mom and I found this and since we were bored, we tried it out.<br><br>And oh man. That was something.\nThe animation is horrid, the plot makes no sense and the characters have no depth.<br><br>Despite all this, the movie was very entertaining! If you're looking for a clearly low budget movie, 10/10 much wow would recommend.<br><br>Otherwise, I seriously don't suggest watching this.","user":"fluffykitcat","rank":[1,1]},{"title":"Good Installment from The Swan Princess Volumes","rating":10,"date":"5 November 2018","review":"Before I start my Review.<br><br>Next Year, It will mark the 25th Anniversary of The Swan Princess (Animated Movie Series).<br><br>This is the Eighth Installment of The Swan Princess.<br><br>It started with Queen U was planning to start a book club, that the fans of Queen U (who were younger Children and Grown-Ups) has attended this event. When Queen U left this event, she dreaming about Antonio, The Next Morning, Queen U was left horrified that the book she's gotten was marked with the Letter \"Z\". Everywhere they looked they found many residents in the Palace were had marked of the hidden \"Z\". It's up to Princess Odette and her friends to search for clues on following the rats, to find the Man in Black. Things became very dark and confusing to find Person in a Dark Mask to duguise himself.<br><br>My thoughts, It very thought out, It does have a great storyline on what was going on, during through many scenes.<br><br>I know many people didn't like it, and there some people that really enjoyed watching this movie. For Lovers and Haters, I respect your Opinion.<br><br>One Thing, that I will like to Point out is the CGI Graphics were better than The Swan Princess Christmas (4th Swan). Though I don't mind the voices, The voices were Okay.<br><br>As for the Actors and Actresses they did a Good Job acting their roles, For Nina Herzog (She's no Michelle Nicastro) who was the 3rd Actress voiced Princess Odette does a Marvelous Job, while doing her Acting Role and Singing.<br><br>For the songs I do like were \"Man Up\" and After All\"<br><br>For Man Up, Princess Odette helps Number 9 (Cat) to be brave to scare the rats out of the trashy Junkyard.<br><br>After All, I Love this Song, After All sounded like Bubblegum Girly Pop, that makes dance during the End Credits.<br><br>Also, the funny part in this movie when Hunch took Scully in Bogg's Island, where they later named as Bogg's Court, Where Nums was given his full as \"Numsy Wumsy\".<br><br>I don't feel like spoiling the Rest, I really had a Fun time watching this, I do recommend to people who really went into this Animated Movie Series. :)<br><br>My Rating: 10/10","user":"c1990","rank":[1,2]}]