[{"title":"BAD","rating":1,"date":"11 March 2020","review":"....but then again, did you expect an award winner here? Your better off staring at the sun rather than watching this. Your eyes will thank you.","user":"todddaco","rank":[19,20]},{"title":"8 out of 10 because you deserve it!","rating":8,"date":"15 March 2020","review":"Milko Davis gives us an outstanding literary masterpiece in Jurassic Thunder.\nFollowing thru on his dream by directing, his thrilling story gives us plenty of reasons to buy beer.\nTell all your friends to join you for a special screening and make sure they bring plenty of Steel Reserve. Post it on Facebook.\nHeath C. Heine nails Trump to a tee.\nAny idiot drunk enough can not help but to cheer for the weaponized dinosaurs!\nYou should certainly watch this film and contemplate the toilet paper rush due to the Coronavirus. You will need it after watching.\nWe all need to support these companies that believe in giving us these masterworks because they think so much of us.\nI mean, dinosaurs are people too!\nJust remember people, when talking about the movies that really matter, Jurassic Thunder is one to be proud of seeing. Tell all your friends.\nI mean think about it, if you are able to watch this past 5 minutes, you are my hero. Idiots are people too. As evidenced by the cast and the sponsors and the great minds who greenlighted this.\nWe should feel 'special' that the producers and studios think so highly of us.\nNo matter how much beer you drank, drink all you want, we'll make more.\nThis review is sponsored by the world brewing federation.","user":"tmcmahanclan","rank":[3,5]},{"title":"Pretty fun.","rating":4,"date":"5 March 2020","review":"A covert desert base manned by an elite group of commandos and weaponized dinosaurs are all that stand between us and World War III. You have no idea how much I loved every single second of this ridiculous movie. If I was 7, I would be driving my family insane talking about it incessantly. As it is, I'm 47 and plan on doing the same.<br><br>This movie comes from Milko Davis and Thomas Martwick, who were also behind the films The Jurassic Dead, Curse of the Black Lagoon and Tsunambee.<br><br>Between an opening joke that refers to their audio as ZHX - Zombie instead of the T in THX - and a comic book opening that makes fun od probably everyone that's watching this movie, this is a down and dirty blast of fun.","user":"BandSAboutMovies","rank":[4,15]}]