[{"title":"An Unexpected and Nuanced Film about Women and Sexuality","rating":9,"date":"13 March 2018","review":"Daughters of the Sexual Revolution was very well-received at Austin's SXSW Film Festival. Honestly, I expected a film about the somewhat silly institution of cheerleading and it's connection to football. This film, from the acclaimed director of Murderball, was not at all what the audience was expecting. It had much more depth as it explored the early years (1970s/1980s) of the Dallas Cowboy Cheerleaders at the cultural collision point of the sexual revolution and the feminist movement. The film explores how these women were using their sex appeal, but also behaving in a dignified and respectful manner under the watchful eye of their beloved director, Suzanne Mitchell.\nThe film focused on interviews with former DCC members and Mitchell (who passed away in 2016 not long after the interviews with her for the film). She was a disciplinarian with strict rules while at the same time protective and nurturing environment for these young women in a dangerous environment. The interviews reveal a much more complex picture than one would initially expect. While many may have looked at them as women whose sexuality was being exploited, Mitchell really made sure that they were using their beauty and skills for their own benefit. She helped shape these young women into strong confident independent women.\nThe film is both highly enjoyable and very informative. Highly recommended for those who are looking for a different take on a national institution.","user":"JustCuriosity","rank":[17,22]},{"title":"Suzanne does Dallas (proud)","rating":8,"date":"1 November 2018","review":"Greetings again from the darkness. The story kicks off (at least according to legend), at a 1967 Dallas Cowboys home game, with adult entertainer Bubbles Cash walking down the aisle holding her cotton candy and catching the eye of many at the game ... including team president Tex Schramm. This was a mere 4 years after the assassination of President Kennedy made Dallas the most hated city in America. Ever the opportunistic salesman and promoter, Schramm took note and decided a shift from high school and college cheerleaders might prove beneficial.<br><br>Director Dana Adam Shapiro was nominated for an Oscar for his 2005 documentary MURDERBALL, and here he provides a multi-faceted film: a biopic of Suzanne Mitchell, a forum for former cheerleaders to tell their story, and a socio-political look at a bygone era - one with some connective tissue to the modern day world.<br><br>Suzanne Mitchell was Tex Schramm's secretary, and the director of the Dallas Cowboys Cheerleaders (DCC) from 1976-1989. She has been described as a den mother and dictator, one who ran a tight (almost militaristic) ship and also cared very much for the ladies in her organization. Although she has passed away, we get many clips of her interviews over the years. By the end, we believe we know just who this woman was and what she stood for. She was committed to making sure the DCC were proper ambassadors for the Dallas Cowboys organization, while also making sure they were on the right path as people.<br><br>This was the ultimate blend of sex appeal and feminism. Every former cheerleader interviewed here makes it clear they were proud of their time with DCC, and that the team and Ms. Mitchell had been a positive influence on their lives. What makes this so fascinating is we are also provided recollections of the pushback the team received from religious groups (it is the bible belt after all) and feminists ... claiming exploitation and degradation. It's not so different than today where so many try to thrust their opinions and beliefs on others - jumping to conclusions about what harm is being done either to the individual or society as a whole.<br><br>In addition to the interviews with Ms. Mitchell and the cheerleaders, two knowledgeable writers provide more insight: Mary Candace Evans, author of \"A Decade of Dreams: Dallas Cowboys Cheerleaders, and Joe Nick Patoski, author of \"The Dallas Cowboys: The Outrageous History of the Biggest, Loudest, Most Hated, Best Loved Football Team in America\". These two share much of the research for their books, and also provide perspective on the era, and just what an impact DCC had on the team, the league and TV entertainment in general. Also interviewed is long time local sportscaster and former Dallas Cowboys announcer Dale Hansen. He provides the local flavor, as well as a personal story about crossing Ms. Mitchell, known as \"The Iron Butterfly\".<br><br>We learn that CBS made the conscious decision to feature the cheerleaders during the Super Bowl X telecast, and the infamous on screen \"wink\" is credited with creating the explosion of interest in DCC. What followed were TV appearances (including \"The Love Boat\"), charity events, other promotional events, USO tours, and many hospital visits to the bedsides of sick children. All of this occurred under the burden of numerous rules created and enforced by Ms. Mitchell. She and Tex Schramm were committed to ensuring this was an inclusive and diverse organization for women of all backgrounds and race. At the same time, the rules regarding weight and body shape were tough and challenging, and the pay was minimal.<br><br>TV shows, magazine covers, posters, and calendars all contributed to the mystique and popularity of the cheerleaders - the perfect mixture of innocence and sex appeal. Perfect that is, until the organization was exploited by the porn industry (DEBBIE DOES DALLAS) and Playboy magazine. Lawsuits became prevalent.<br><br>Ms. Mitchell's ability to hold steadfast to her beliefs and standards for what the DCC represent is quite impressive and easy to respect ... a respect that grows even stronger when we learn she walked out only 4 months after Jerry Jones bought the team. A new culture arrived and it was one she, and a number of cheerleaders, refused to be a part of. You may think you know the story ... you may think you know the cheerleader \"types\" ... but director Shapiro's film is likely to teach you a few things. But whatever you do, don't chew gum!","user":"ferguson-6","rank":[12,16]},{"title":"More Left Wing Agenda Pushing Politics","rating":1,"date":"20 February 2019","review":"It stared out as a documentary about the Dallas Cowboys and was just OK.<br><br>But soon it took a far left turn and became more propaganda from the far left.<br><br>What is wrong with the entertainment business today? Can't make ONE movie where your agenda isnt shoved in our collective faces?","user":"arfdawg-1","rank":[8,17]}]