[{"title":"A fun film that explores what is meant to be an Asian American","rating":8,"date":"10 April 2019","review":"In the last few years we have seen unprecedented focus and interest for films featuring diverse actors with narratives that are deeply grounded in their ethnic cultures. Despite this trend, the stories that spoke to the Asian American experience were lacking. As it may seem exaggerated at parts, this film provides a much needed perspective into the life of an \"Almost-Crazy Rich Asian\".<br><br>The general formula that this story follows is not novel. The movie starts with Sasha, a spoiled and entitled international student, facing a typical recently graduated student problem - finding a job. Anna Akana does a great job of conveying her character as it made me feel both empathetic and schadenfreude. Finding a job sucks, but damn you deserve it for being so wasteful!<br><br>What follows, as you may expect from the title, Sasha goes back to China.\nAlthough at times the writing relies on cliché and rather hollow devices to demonstrate the complexity of its characters, for example, that there is more to Sasha than being a brat, the characters felt authentic.<br><br>Perhaps intended by the director, or simply decades of acting experience demonstrated by Lynn Chen's nuanced expressions, I definitely felt more attached to Carol (Lynn's character) than Sasha.<br><br>What felt unique about the film was its execution. It told a convincing coming-of-age story through the lense of an Asian American. Its contrast and blend of both American and Asian experiences felt real. Watching the roller coaster of Sasha and Carol's relationship, caused by the differences of their values - Asian Americans aren't all alike, was satisfying.<br><br>I was disappointed by how the movie chose to expose the root of Richard Ng's character, Teddy, the father. Somethings must be demonstrated rather than discussed over lunch.<br><br>Despite its flaws, the movie had plenty of heartwarming moments and twists that kept me entertained and invested. As an Asian Canadian, it was refreshing to see a story that sought to tackle the intricacies of our culture and familial conflicts. I left the theater wanting more. 95 minutes is short!","user":"jimmierocks","rank":[18,26]},{"title":"a princess learns about life","rating":6,"date":"5 March 2020","review":"Greetings again from the darkness. Seeing Chinese films reach mainstream status is a nice development in a cinematic industry that too often segments by nationality. Jon M Chu's CRAZY RICH ASIANS was a huge hit in 2018, and then last year Lulu Wang's brilliant THE FAREWELL was a favorite. Now comes a semi-autobiographical tale from writer-director-producer Emily Ting. All three films revolve around Americanized young adults revisiting their Chinese roots, though each for different reasons.<br><br>Anna Akana stars as Sasha Li, a twenty-something one year removed from fashion school. We first see her on her birthday botching a job interview and running up a monster bar tab with her posse of friends at the club that night. Having ignored calls from her father in China, she is shocked and humiliated when she discovers her dad has cut her off from the trust fund she has been blowing through living the high life in Los Angeles. As viewers, we are immediately turned off by Sasha's immaturity and spoiled self. When her dad offers her a deal ... come back to China and work in his toy factory for a year in order to get her trust fund back, we (and her friends) see it as a no-brainer. But it's not until she gets an eviction notice and discovers her mother (Kelly Hu) is also being cut off, that she makes the decision to head back to the homeland.<br><br>Once Sasha is back in China, all of the pieces to the puzzle are present. It's a dysfunctional family headed by the father Teddy (Richard Ng) who seems dedicated to being a successful businessman, while proclaiming he's doing it all for the family ... a family that consists of multiple offspring from multiple women. His oldest daughter Carol (Lynn Chen) is Sasha's half-sister, though they barely know each other. Carol has been a dutiful loyal soldier to dad's toy company, and a bit envious of Sasha's free-wheeling lifestyle. Carol believes she has paid her dues, and it's now time for Sasha to pay hers. Sasha also meets two younger half-siblings, as well as a particularly young Lulu (Kendy Cheung), whose role Teddy describes as \"she takes care of me.\" Yuck.<br><br>What happens next is relatively predictable. Sasha's fashion design skills prove valuable to dad's stale line of toys, so her ideas bring new life to the company and the employees. The latter are impacted by Sasha's insistence on better working conditions. Of course, Sasha being Sasha, her lack of business savvy leads to problems and a fallout. The film's wrap up is a bit too clean for the real world, but Ms. Akana has managed to win us over by this point, so we are apt to overlook the script and story issues.<br><br>Richard Ng seems a bit too old for his role as Teddy, but he excels in the business scenes where frustrations boil over. Teddy fails miserably as a father or relationship partner, but his instincts with Sasha seem sincere. Filmmaker Ting includes some commentary on social and cultural issues in China, including the 'One Child Policy', and the labor practices and family pressures. The film is part 'coming of age', part 'coming home', and part 'coming to grips'. The life lessons for Sasha are quite clear as she transitions from spoiled princess to reality-based citizen. Her family may still be packed with dysfunction, but then, whose isn't? Part of maturity is learning to deal with it, and understand that family does matter.","user":"ferguson-6","rank":[8,12]},{"title":"ZZZZZZZZZzzzzzzzzzzzzz","rating":1,"date":"6 March 2020","review":"Not worth a watch. No good parts, no bad parts, no highs, no lows, just the same unexciting inexpressive drone through the whole film. If you are more twelve years old you should probably give it a miss.","user":"Opinate","rank":[13,23]}]