[{"title":"I Realy Wanted to Love this Film, but.......","rating":4,"date":"27 July 2019","review":"I waited a while to submit this review in order to give the cast members and others related to or having a financial interest in the film's success a chance to post their 8-10 star reviews, which seems to be the trend with low budget films, though it is hard to understand why they believe their \"B\" movie should be higher rated than say, The Searchers, Gone with the Wind, Star Wars, and Forrest Gump. With that out of the way, it's time for an honest, unbiased review. After learning about this film back in 2018 I eagerly awaited its release. I so much wanted to love this film, because like some many others out their I really crave a resurgence in the Western film genre, but with Bill Tilghman and the Outlaws I was only left with disappointment. On the positive side, I did really enjoy the opening titles and credits. I like how they used black and white camera stills to introduce the characters and identify the actors by name. For the most part, the music in the soundtrack is very entertaining, and I really enjoyed the songs performed by the Walker Avenue Gang. Their lead singer is definitely worthy of a top C&amp;W career in Nashville. My favorite character during the entire film would have to be John Buttram, who is the nephew of Pat Burttram who ages ago played Gene Autry's sidekick and starred as Mr. Haney in the old Green Acres TV series. John Buttram's voice is marvelously as similiar and entertaining as was his uncle Pat's. The concept and storyline for this film is brilliant and whoever came up with it deserves a big pat on the back. However, the film suffers from four primary failures in that of direction, casting, special effects, pacing that is the equivalent of watching a slow dripping faucet. As for casting, very competent performances were turned in by Ken Arnold, Brian St. August, Robert Neal Marshall, Darby Hinton, Barry, Cantor, John Buttram, Matthew Greer and Dan Collier. Cute little Christine Nelson, has previously shown herself to be a compentent actor and should have a promising career ahead of her, thus I can only attribute her performance to that of mediocre direction. Otherwise, except for the child actors, performances by the remainder of the cast were mostly lackluster or wooden. It was really difficult to watch the formerly beautiful Lana Wood in this film as a lifetime of booze, cigarettes and pork chops have really taken their toll. Concerning special effects, you'll find notthing really special about them. In fact, the cgi'd puff's of smoke representing bullets hitting dirt and wooden boards on buildings is simply embarrassing, as were the cgi'd cannon ball impacts. Overall, the film is worth watch, if for nothing less than its appeal as a nostalgic novelty...and if you can somehow mentally prepare yourself to have the absolute lowest of expectations, I think you will be able to watch the entire movie from beginning to end and may even find yourself enjoying at least some of it.","user":"buckm-27789","rank":[8,12]},{"title":"Great Family Western","rating":9,"date":"18 February 2019","review":"Ken Arnold played the role of Bill Tilghman PERFECT.. He was amazing and held to the true life character with a great acting ability.. The surporting cast was great, as well as the writing and the directing was great.. The over all movie was filled with something for everyone.","user":"flying_s_charters","rank":[10,27]},{"title":"Great family thrill ride.","rating":8,"date":"15 March 2019","review":"I grew up on old westerns. This is a great throwback film with lots of great characters, gun fights, fist fights, a love story and really cool western sets. This was shot right in WV. Check it out with your family.","user":"patrickwilliamboyerjr","rank":[8,23]}]