[{"title":"Couldn't Be Less Original","rating":3,"date":"17 September 2019","review":"We've seen this before...many, many times. What was it called? My best friend's pasty-white runaway Opie-looking bride? Something like that. The dialogue seemed to have been entirely ad-libbed with zinger lines like \"This is a messed-up situation\" and \"I'm carpe dieming.\" Someone really said that.<br><br>Even the guy's house was insipid. It looked like a cheap motel room that they rented by the hour. And I realize this is a low-budget affair, but buy a few lights next time. The entire movie was shot in his dumpy hotel room, at night, in the dark.<br><br>The only thing they got right about this is that it wasn't very long, but deeply boring people talking for 82 minutes is an eternity that I couldn't endure. I had to fast-forward through the trailer on YouTube, no kidding.<br><br>Once again, this movie page has been bombed by people who have only written a single review.","user":"leftbanker-1","rank":[10,18]},{"title":"Save yourself the time and stare at a wall!","rating":1,"date":"21 September 2019","review":"I've NEVER seen a film where I hated every character. Except Rachel, she started strong and then had her balls cut off. Speaking of which, the two \"guys\" have NONE! I literally, term used correctly, wanted to see them all doused with gasoline and set on fire. THAT'S how much each character sucked. I kept hoping it'd turn into a horror flick. I had no problem with the ending, but you can't feel bad for anyone when you want to slap the sh#t out of them. Steer clear of watching this dumpster fire from Uranus. And you're thinking, at least there's Rachel. Nope. The polar vortex that is the suckatude of all the characters eventually brings her down as well. It was like in Freaks. Gooble Gobble, One of us, One of us. Once she joined, it was a downward spiral. I took 3 days after watching it to write this. And I still can't stop hating those characters. I mean, I REALLY hate them all. Except early Rachel.","user":"zanicdu","rank":[4,6]},{"title":"Making a story out of nothing","rating":10,"date":"10 March 2020","review":"I am just not a fan of this type of single location argument film. This kind of film should have just finished by one of them walking out of the room. Instead, everyone just stays and argues, making the situation worse. It is a story out of nothing.","user":"Gordon-11","rank":[0,0]}]