[{"title":"Thoroughly Entertaining sequel!","rating":8,"date":"4 December 2019","review":"I saw the movie on December 4, Indonesian premiere.<br><br>The whole story is a good follow up from the \"Welcome to the Jungle\" Jumanji-2 film, with some added actors (Danny DeVito and Danny Glover as a good choice.<br><br>While I was confused in the beginning, who was who once they were back in the game, the script itself allowed the avators to be exchanged so that they went back to the \"Welcome to the Jungle\" avators and the people who were in those (I hope you understand what I mean).<br><br>The story is simply a new adventure, and so much different from the previous instalment that it is not boring at all, and while it is rated PG13, I found that in general, it is a very good family movie.<br><br>All in all, and in all honesty, I already look forward to Jumanji 4 (Xmas 2020 or Xmas 2021 would do just fine.<br><br>Thumbs up for the movie, 8/10!","user":"presic","rank":[710,880]},{"title":"Still amazing, more silly jokes and chaos on the screen!","rating":8,"date":"6 December 2019","review":"Before going to the cinema to see «The Next Level» of Jumanji, I rewatched the first movie, just to refresh my memory. And after watching the new one, I must say - it wasn't underwhelming at all!<br><br>In addition to what the first film brought, new «Jumanji» has:\n<ul><li>more jokes;</li><li>a whole lot of new characters;</li><li>a fresh look at the existing characters;</li><li>plenty of new locations and thus, much more adventures;</li><li>an absolute muddle of what's happening on the screen;</li><li>and yes, even more jokes!</li></ul><br><br>Given the above, it's time to wrap it up - «Jumanji: The Next Level» is a solid following of a 2017's movie. It's all about laughter, fun, amusement and adventures, of course. In case if you seen «Jumanji: Welcome to the Jungle» and enjoyed it, the new «Next Level» won't let you down.","user":"aninspiration","rank":[621,793]},{"title":"Great sequel and laugh fest, the new Jumanji knows what its doing","rating":8,"date":"6 December 2019","review":"Mild, mild spoilers ahead....<br><br>I was scared they'd somehow screw up the sequel to the \"reboot\" they did, but I was greatly surprise at the new elements they added: the grandpa's subplot and the way it was executed and their contribution to the jumanji gaming experience (they were both hilarious); and all the new additions felt exactly how a sequel to a 90s sequel game would feel like: new abilities and weapons and scenery (or the would-be \"levels\" of the game) they still felt like they'd actually be levels of a game! It's exactly what I hoped they'd add on because that's the kind of thing the first movie did, it tried to work with the stereotypes and elements found in those good old adventure games like Tomb Raider.<br><br>I also liked that they brought back the WHOLE gang, the reason why movies like this where the most logical thing would be to make it anthologic, that is, with different kids experiencing the game; so when they try to use the same characters that supposedly learned something from their past experience in it, is a recipe for disaster because it's hard to bring all the gang together without it being forced. But i liked the way they did it, it felt controlled and fulfilling in the end.<br><br>In conclusion, it was a funny, entertaining and creative action adventure movie, it's not gonna win any Oscars but it's so wrll thought of that it's a delight to watch and I feel it never grows old, you can rewatch it and enjoy it all over again","user":"quiqueperezsoler","rank":[564,727]}]