[{"title":"love it","rating":10,"date":"28 October 2018","review":"It is one of the best movies I've ever watched. It is a very realistic love story, it touched my heart. I teared up a couple of times while watching this. The characters for this movie are incredible; I loved the girl she was so cute and her personality was amazing. Really portrays an average high school/college girl and I like that. The guy was also perfect; they both went through hardships that people face in real life. Many cute and funny scenes, the ending made me very sad and I didn't want it to be sad but I understand why it ended that way. I will watch this 10,00 more times.","user":"lalyg-63289","rank":[17,19]},{"title":"a must watch Korean Movie ( one of the best korean movie )","rating":10,"date":"31 October 2018","review":"I Iiterally just Watched OnYourWeddingDay and I can't describe how much I Ioved it. I laughed and cried throughout the whole movie! Well done, guys( park bo young and kim young kwang )! This movie really a masterpiece to me. And yes, it's all about right timing. Thank you for your amazing acting skills. such a great movie !💯❇ ( 10 /10 )","user":"vafahamidi","rank":[11,13]},{"title":"very romcomend,so funny, great , wonderful, I love it ❤","rating":10,"date":"29 October 2018","review":"On your wedding day is first movie I went to south korean for it and watched it without subtitble cause I understand korean language .very light movie and duper realtable. it was beauitful written and realized movie this movie changed mylife .yes really got me reflecting on life , realtionships, pains and happiness .movie was so wonderful and amazing and warm and funny ( on most parts ) also realistic . thanks to effective punchlines and phasing is great. park boyoung is wonderful as alwayz and she plyed character seung hee very excllent and for kimyoung kwang It 's first time I saw him he's great and handsome. and also acted excllent too. parkboyoung and kimyoung kwang have great and amazing chemistry . theirchemistry is undeniable.this movie teached manythings : importantlife and love lessons without being too chessy or unrealistic. it's a movie based on reality. that was really wroth to watch.\nOn your Wedding day. Commitments that show their respective ideals and love. A commitment that becomes a valuable lesson in establishing \"..\". At least everything starts with \"Life Experience\" fav movie.","user":"nhamidi","rank":[11,13]}]