[{"title":"A Silly Girl at Brighton Rock","rating":3,"date":"27 April 2019","review":"When all the yelling and arm waving is over and the dust has cleared, BODY AT BRIGHTON PARK is a very simple movie. A very young and inexperienced girl, who is little more than a tourist greeter at a state park, gets herself lost and in over her head out in the wilds of the park. Though the weather is rather mild and the scale of hardship she faces is minimal, her behavior borders on the criminally incompetent relative to the mild challenges she faces.<br><br>Out in the dark woods, alone except for the dead body she has stumbled across and is now tasked to watch over until more competent people arrive in the morning, she spends most of the night hallucinating frightening experiences. If she's not imagining the cadaver rising up as a zombie then she's squirting herself in the face with bear repellent.<br><br>Derp.<br><br>Towards the end of the movie we viewers have been so repeatedly sucked into her imagination-driven hallucinations that turn out to be nothing that when a REAL threat shows up, a large bear who wonders what a girly forest ranger might taste like, it takes us a while before we even believe that it's an actual threat THIS time.<br><br>At the very end of the picture, when the, ahem, \"adults\" have finally arrived to everybody's relief, including us viewers, we're given the \"twist\" that the random hiker she met a few times the previous evening and earlier that morning was actually the ghost of the dead man she'd been watching over all night. Ooo... Scary.<br><br>Given the fact that the meat of the movie is this girl's incompetence and runaway imagination, there isn't much to recommend the plot. The primary character is made so incompetent, an intentional character decision, that she becomes irritating. The repeated incarnations of every scary situation turning out to be \"only a dream\" gets boring.<br><br>Stylistically, while the scenery is beautiful, the movie is carried off with amateurish detail work. The beginning and ending credits look like a flashback nightmare out of the 70s. The spray coming out of the bear repellent can looks like somebody watched a 3 minute tutorial from YouTube on Adobe After Effects and then did a bad job of it. And so on.<br><br>While it's definitely not the worst movie you'll ever see, if you insist on watching it you should probably have some vacuuming or dishes or something productive to do at the same time so you don't come away feeling you've COMPLETELY wasted your time.","user":"S_Soma","rank":[46,48]},{"title":"Body and Brighton Rock: a Redbox flick at its finest.","rating":2,"date":"24 April 2019","review":"Despite a Giallo aesthetic that doesn't suit the premise or setting, a one-dimensional and incompetent protagonist who's inexplicably superhuman when the plot requires her to be, abrupt shifts in tone and pacing, ongoing jump scares that are always telegraphed by the score (with only one that garnered any response in the theatre: uproarious laughter), a predictable third act, unresolved plot points that masquerade as red herrings, and a pointless twist ending with no setup, Body and Brighton Rock is actually a very fascinating film: it provides scientific proof of the theory of time dilation. At a mere 87 minutes, it feels like it's four hours long.<br><br>I get the sense that the screenplay was little more than a shot list. This is unfortunate, because there's no denying that director Roxanne Benjamin is a competent filmmaker. She attempts to establish her own style by recycling tried-and-true horror tropes, and there's some good ideas here. But technical aptitude is not the same as meaningful storytelling. The film is incredibly thin and would have worked best as a 20min short.","user":"ogilvieds","rank":[41,50]},{"title":"Spending Time with an Irritating Half-wit","rating":3,"date":"23 September 2019","review":"If you're going to have a movie with one character off by themselves for the majority of the run-time then there must be a lot of interesting things happening for the character to deal with, or the character must be particularly interesting. And it doesn't hurt if the actor is charismatic. This movie avoids all three of those options as if they were the plague. They make it clear (in fact it's necessary) that the main character is incompetent and stupid and all her actions will be thoughtless at best, and reckless at worst. But she's not interesting or involving or appealing to make time spent with her tolerable. And actually very little happens until the obvious dream sequences (not very inventive or gripping) and all of it is downright boring. It's a wasted hour and a half in the company of an irritating half-wit. If that's your idea of a good time, watch this film.","user":"zandertowne","rank":[10,11]}]