[{"title":"Sabrina: Not even remotely what you'll expect guaranteed","rating":6,"date":"17 December 2018","review":"Sabrina is a neat little film ruined by a number of flaws that prevent it from being something really special.<br><br>This Indonesian made Netflix original at first glimpse you'd assume is a killer doll-esque movie, but that couldn't be further from the truth. If you're looking for Chucky or Robert the doll you'll be sorely disappointed, this is more your possession type film.<br><br>Now regarding the possession sub-genre I generally don't like them, the tropes they hold tend to bore me but thankfully they throw most of them out the window here and go for something somewhat more exciting.<br><br>Now I can't say much about the plot without giving something away so I'll not bother. I will however say that when the story is finally laid out in front of you I think you'll be pleasantly surprised, it's well constructed and very much not predictable.<br><br>Again as mentioned sadly the film does have its flaws, a couple regard the story and one near the end took this down from a potential 7 to 6. Another is the lack of consistency, it plays out like a serious horror yet has moments of ultra cheesiness that ruin the atmosphere altogether.<br><br>Regardless this is a very fun, exciting and oddly scary in places little film that is not what you'd expect it to be. Despite my underwhelming rating I would recommend this.<br><br>The Good:<br><br>Surprisingly well constructed plot<br><br>Some genuinely creepy moments<br><br>The Bad:<br><br>Some poor camerawork<br><br>Bizarre soundtrack choices<br><br>Oddly cheesy in places<br><br>Silly finale<br><br>I struggled to tell the two leading ladies apart<br><br>Things I Learnt From This Movie:<br><br>I'm left wondering if the casting director specifically sought out the sickest looking girl they could for the role<br><br>Demonic possession causes nose growth","user":"Platypuschow","rank":[17,18]},{"title":"Good Acting By Luna Maya And Sara Wijayanto","rating":8,"date":"23 October 2018","review":"Rating 8.3/10\nBest horror movie in Malaysian cinema right now. Good storyline &amp; full of thrilling action. This film make me heart attack. Good acting performance by Luna Maya and Sara Wijayanto.","user":"ymyuseda","rank":[124,167]},{"title":"Annabelle's Sister From Another Mister","rating":7,"date":"13 January 2019","review":"Sabrina (Beware there may be spoilers)\nIn this Indonesian take on Annabelle, a toy maker and his family become haunted by a disturbing Weird Al Yankovic look-alike Sabrina doll. Living with her aunt and uncle, Vanya is still grieving over the loss of her mother (apparently not her mother AND father). She plays a game of Charlie, Charlie to summon the spirit of her passed mom. Charlie, Charlie is a rendition of the Ouija Board where a pencil (yup, neck pencil strikes again) turns on its own to answer questions with a \"yes\" or \"no\". Well surprise, the game is real and summons an evil spirit. Vanya thinks she's getting lost time with her mother (who of course only she can see) but as time passes and a few wicked events occur, even her aunt and uncle begin to catch on. They hire Laras and Raynard; the demon ridding team - spoiler, they were hired to help with Vanya's mother as well! This all would have been avoided if only they noticed the creep factor of the Sabrina doll right away!\nMost downloaded app: Spirit Detector. How many spirits have you detected?? Can we get this app please!? Best trickery: Closing the doors on entities. You can't get in!! Haha just kidding you're a spirit that can go anywhere. Why does this only work sometimes?\nBest use of English: The whole movie is in Indonesian, so reading subtitles was a must. However, there were words spoken in English randomly thrown in throughout the movie. #didijustlearnindonisian?? Overall Grade: B(een spending most our lives, living in an Amish Paradise)","user":"thewakenarrative","rank":[6,6]}]