[{"title":"Dull","rating":1,"date":"8 April 2018","review":"Amatuer film, acting staged. Could have been much better","user":"tolgauk","rank":[9,16]},{"title":"A Plot That Plods","rating":5,"date":"15 December 2018","review":"A woman investigated her mother's murder and uncovers a mysterious birth certificate. This is a rather slow moving movie that plods along nicely if you like slow moving movies. I have no complaints about the actors other than they are all so solemn and drab. Officer Sanchez is as good as asleep. Why does Sonya look like she's wearing a wig? When she parks at the detectives office building, she gets the front spot. But in the next scene it is a no parking zone. This happens twice.\nThe climactic ending is rather dull too. This movie is really not that bad, just slow. But it's a very nice movie if you need to go to sleep.","user":"tomfsloan","rank":[5,9]},{"title":"The Importance of Being Heather","rating":3,"date":"3 April 2020","review":"Sonia Daniels must have one of the most complex ancestries of anyone on the planet. This taut drama unfolds the secrets of her legacy and how as an infant she was handed off like a football from parent to church to nanny to adoption lawyer to new parents. It is up to Sonia and her handsome private investigator to track her DNA and learn the true story of birthright.<br><br>One of the keys to unlocking Sonia's stolen past is the mysterious figure of Mark Green, who was to serve as little Heather's godfather, prior to an \"accident\" in which he tumbled down the stair to his death. But it turns out that Mark was much more than a godfather to little Sonia. He was the childhood sweetheart of Olivia, who was set to inherit the rights to a large corporation.<br><br>Olivia's husband Don and her adopted son Grayson become suspects in the killing of Sonia's adopted mother Janet. But in the transaction that took place in a church adoption and the sale of the child through an adoption attorney, a birth certificate was inadvertently left behind in a handbag, recalling the mix-ups in Oscar Wilde's comedy \"The Importance of Being Earnest.\"<br><br>A romantic bond forms between Sonia and her private investigatory Brandon Hayes. The sparks start to fly during their investigation. It seems only right that a romantic union will form between the two characters. But first, the truth must come out about Sonia heritage, wherein she will discover the vital importance of being Heather.","user":"lavatch","rank":[0,0]}]