[{"title":"Neil Young was great, the rest - not so much","rating":3,"date":"28 March 2018","review":"3/26/18. Not for everybody. I like Neil Young, so the music part was great, not so much the disparity between the music and the background scenery (that had very little to do with the music). Watch this (or, maybe just listen to it) for Neil Young.","user":"bettycjung","rank":[11,13]},{"title":"For the fans","rating":6,"date":"28 March 2018","review":"You really have to know what to expect with this one. If you're not already a fan, this is not going to make you one, so just walk on. Otherwise, crack open a cold one and roll another number - you're still definitely gonna need it if you want to make it all the way through this ride. Chances are you'll fall asleep halfway through and won't wake up till the morning comes.<br><br>Neil Young wanted to make a movie with his band buddies where they all hang out on Neil's ranch dressed up in old-timey clothes, spouting all sorts of cryptic nonsense. Sometimes they take dumps, stylishly filmed with a super-8 or some other analog film camera. On occasion, they rock out. Neil mostly sits in a chair, remarking on the moon, playing a lick here and there, generally looking old. He does this with the usual poise and dignity inherent in his loner persona. He is at his most aged and lonesome when he's singing a solo rendition of Pocahontas, backing himself with a big pipe organ.<br><br>The camerawork is terrible (they clearly had tripods and all that stuff, they just chose not to use them). The acting doesn't really qualify as acting, since these dudes are not really pretending to be or do anything other than what you'd imagine them to be doing on any given weekend. The writing? I guess they had some ideas... <br><br>The soundtrack has cool moments, except the part where they overdrive the hell out of the harmonica track. Horrible production choice!<br><br>Honestly though, I'd still much rather waste an hour of my life hanging out with Neil over here in ranchland than waste even a minute of my life looking at a TV screen. And no, I'm not talking about motion pictures...you know what I mean.","user":"crownofsprats","rank":[13,16]},{"title":"Should have just been an album.","rating":2,"date":"25 March 2018","review":"Ten minutes in and so far HUGELY disappointed. Awful directing and cinematography awful acting (apparently they're Young's band so they're not actors) the soundtrack from Young sounds great but I think maybe it could have just been an album and we could have imagined the movie ourselves.<br><br>It doesn't improve. Feed like a student film... and not a great one.","user":"ronsmonkeys","rank":[12,16]}]