[{"title":"How were 3 of these made??","rating":1,"date":"19 November 2018","review":"Absolutely unwatchable.\nWorse than a high school film project, if that's even possible.","user":"enigma-947-339467","rank":[8,10]},{"title":"I escaped","rating":1,"date":"10 October 2018","review":"This film takes place in Granbury, Texas and \"Lake Fear 2\" took place in South Florida. They are not related, like \"Halloween 3\" had nothing to do with the series. Remington (Joshua Winch) escapes hell. We get the brief backstory at about 45 minutes. There are two babes (KateLynn E. Newberry/Shanon Snedden) looking for their sister who has been missing for two years (Maybe they should be looking in Florida?) They come across a TV medium (Devi Khajishvili) who helps them because he needs the money. While the film doesn't state he is gay, he swishes more than Senator Lindsey Graham.<br><br>Just about everything about the film was bad...okay soundtrack not too bad. The acting wasn't there and it appears the production was going for the early 80's Super VHS look. <br><br>Guide: No sex or nudity. Don't recall any F-words in the parts I didn't use the fast forward.","user":"nogodnomasters","rank":[5,6]},{"title":"Just Awful","rating":1,"date":"15 January 2019","review":"Lake Fear 3:\nDirected by Michael Crum and written by Gerald Crum<br><br>What the hell was this mess?!! What were they trying to do? I assume they were going for an Evil Dead thing with the cabin in the woods, man who survives the demons who possess people, the only way to stop the demons is complete and total dismemberment. It seemed like it wanted to have its statue of a lead character utter the occasional one liner. They're terrible. He's one of the worst actors I've seen in quite some time. He's joined by a plethora of amazingly awful actors. We have the blonde girl wearing shorts way too small and her friend who complains the entire time. They seek out help from the host of a ghost hunting show. He's a doofus. They're all doofuses.<br><br>This movie has just 20 minutes of story that they then proceed to drag out agonizingly for 79 minutes. Every action taken by every single character every single time was done in slow motion. They move so slowly while making the most idiotic decision imaginably. It was painful to watch such a blatant example of padding I've ever seen in a movie.<br><br>At the hour mark, I was pulling my hair out. I mean this happens naturally due to my longer hair but this movie was also responsible for the hair shedding. This was not my idea. I swear it. Normally this sort of stupid crap would be right up my alley. No this was my daughter's idea. She thought it would be funny if we watched the third film in the series after not seeing either of the previous two. Oh how confused we would be. While yes there did seem to be elements from the previous movies that maybe had I subjected myself to them, I might understand better. But I highly doubt that.<br><br>This was painful. It drug my enjoyment through the dirt and stomped on it. They wanted to be like Evil Dead. They failed miserably. It had some of the worst acting I've seen in a long time. The sound was atrocious. They could have spent just a tiny bit of money for some good sound equipment. Good sound makes a movie. Bad sound can ruin it. It helps to ruin this mess of a film. I give this movie an F.","user":"getconedproductions09","rank":[3,4]}]