[{"title":"Hell is here","rating":5,"date":"31 October 2019","review":"Low budget shenanigans on full display here. If that sounds like your cup of tea (no british pun intended), than you could do far worse. Talking of cliches, this is filled with them, starting with the American gun loving character up to each and every other guest/character in this movie. However you feel about this and most of the jokes you see coming from a mile, will determine if you think I rated to high or too low.<br><br>Black and white is also either giving this a special touch or just put on. As you can see I am a bit on the fence. I do like low budget movies and this does tick quite a few boxes of it and it really encourages you to have fun with it. On the other hand there are certain things that could have been handled way better. But there is always time (and hopefully more money next time) to get better results in the future. Story wise there is not much to tell and will not be the main reason you'll be watching this (or not)","user":"kosmasp","rank":[11,15]},{"title":"Classically campy, fun and gore","rating":6,"date":"11 November 2019","review":"I wanted to give it a 7/10, as it really marveled from being recognized as a low budget film, and I grew up watching classic monochromatic thrillers and horrors, yes a few musical dance movies as well.<br><br>It dropped to a 6 due to the sound editing, my goodness - it was all over the place from ear piercing volumes to near whispered. I am not sure if that was intentional or not, but it was not great at all.<br><br>The story was nothing new, but was actually rather fun and enjoyable to watch, less a few weak moments that really could have be played up and capture the excessive drama portrayed in a classic film style genre.","user":"info-33728-30040","rank":[6,10]},{"title":"Brilliantly British horror.","rating":7,"date":"14 November 2019","review":"Really enjoyable nod to the 1960's horror films but with a kind of black and white 'Evil Dead' vibe.<br><br>Beautifully heightened RP, class roles and gorgeous script make this a load of fun.","user":"future_release","rank":[4,11]}]