[{"title":"Solid Low Budget Effort","rating":7,"date":"7 May 2018","review":"This is clearly a low budget indie film, so don't go in expecting Band of Brothers or Saving Private Ryan. Having said that, if you're able to look past a few sparse battlefields, and decent, but not perfect VFX, then you'll find a pretty good movie.<br><br>The first 30 minutes or so are a bit slow, but once you're past that and you get into battle scenes and the rhythm of the non-linear the it really starts to pick up. It's also really more of a drama about the effects of PTSD than a straight forward war film. But of course the distributors want to push the action to sell DVDs.<br><br>Even with its flaws this was a surprisingly interesting movie to watch. The non-linear structure was well done and different than what you'd find in this genre. And as a film buff, I'd love to know more about the behind the scenes of the production to see how they pulled off what they did on a limited budget. <br><br>In conclusion, don't look down on a movie because it didn't have a hundred million dollars. There's serious merit in new voices outside Hollywood.","user":"jeffperryparty","rank":[28,37]},{"title":"Underrated","rating":10,"date":"26 September 2018","review":"If you have ptsd, you will relate completely to the protagonist. <br><br>Survivors guilt, inability to reconcile the chances that led to survival and descent to dispair. <br><br>Inability to connect to loved ones, regular life and suicidal ideation / action. <br><br>Is it perfect? No. But those complaining about back and forth...., you are fine then trauma occurs and you relive things. That's why the film is created that way. <br><br>Only accepting what happened and confronting it helped. <br><br>Watching the journey of the protagonist was excruciating. Particularly when he was going to meet his wife and stopped for a drink. <br><br>This wasn't a large budget blockbuster but it does a better job of depicting trauma than most films to date.","user":"pmansellpers","rank":[9,14]},{"title":"Indie Flick","rating":9,"date":"11 November 2018","review":"Not a big budget and clearly working with limited resources. But solid nonetheless.","user":"rachelswade","rank":[7,12]}]