[{"title":"A grass half empty","rating":6,"date":"13 November 2019","review":"With a Hong Sang-soo film, you know what you're going to get: drunken conversations shot in long takes in a critique of human interactions; an older male artist/academic trying to seduce a younger female; a character's sense of worthlessness at it all; and a post-modern quirk to magnify it all. But that's all for the audience. The characters themselves typically seem to have no idea as to what is going on in their lives, unaware as to their role in Hong's puppet show.<br><br>\"Grass\", however, may be a little different in that respect, given that Ah-reum (increasing Hong muse Kim Min-hee) is very much in on our observations of the rest of the cast and is quick to put her own interpretations on what is being discussed.<br><br>Our setting, much like any Hong film, is a cafe (or bar, if you sneak in alcohol). A young couple discuss a deceased female friend - a death neither seems to have particularly come to terms with - and blame is laid at each other's feet. Their conversation coming to an end, we pan to the corner surveillance of Ah-reum, typing away on her MacBook as to the nature of the conversation we have just witnessed. It would appear she is a writer, observing those around her and fictionalising the reality.<br><br>But she is accosted by fellow cafe rat Kyung-soo (Jung Jin-young), an actor and writer, eager to know what she is up to. He suspects she has been writing about what she observes. But she puts him straight that she is no writer, merely a young lady keeping a \"diary, that is not quite a diary.\" His rather brash offer of putting work her way is brushed aside as she leaves to meet her brother and his girlfriend for lunch.<br><br>But her family get-together doesn't end well, Ah-reum overly critical of the young couple and their choices, though seemingly far from one to comment herself. Midway, we are distracted by a conversation between a pair at the next table. We only ever see the back of the male involved, as is Ah-reum's perspective.<br><br>Having alienated herself from her brother, she returns to the cafe once more to listen in, but is instead invited to join the table of her elders, including Kyung-soo, and at last is brought into the conversation.<br><br>So, let's play a bit of Hong Sang-soo bingo: Conversations over a table in which drinks are involved; zoom-in close-ups to draw on the character's level of comfort; older men trying to seduce younger women; a quirk that allows for an insight into the nature of human interactions. \"Grass\" has got all of this. A bedroom is perhaps the most notable absentee from a full house, but you certainly know you have watched a Hong film.<br><br>As is increasingly becoming the case with his works, however, the focus is more on the deficiencies of a female here, as opposed to men in much of his work. Ah-reum seems to have difficulty in dealing with human interactions, stating that she, like her unseen boyfriend, is shy. Rather than feel happy for her brother at his potential engagement, she criticises both for not yet being ready for the real world and being unable to handle the situation. Her frustrations at her brother seem more aimed at herself.<br><br>But, as is the way, she is more than happy to observe and comment (to herself) on the interactions of others, with poetic descriptions as to the emotions both are feeling. With Ah-reum playing the role of audience to all other conversations, Hong is directing us to analyse her behaviour and how she chooses to observe rather than join in; eavesdropping on the lives of others and creating her own stories.<br><br>With the bland sets and long takes, like many Hong films, this is one you feel can easily be transferred to the stage, with emphasis always placed on the dialogue. The black and white film noir is typical of Hong, with his usual simple but stylish filmmaking.<br><br>But, as my neighbour in the audience commented as we left: \"So short.\" Much like \"Hill of Freedom\" before it, \"Grass\" is more of a fleeting, chance meeting in a bar in which an enjoyable, and at times insightful, conversation is struck up. But there is no second round, and the night is cut short just as it got going, leaving you to wonder what might have been. The initial young couple and her brother and his girlfriend both suggest going on for a drink. But, unusually for Hong, the film never asks this of us, and we are given only a short snippet of life, much like one of Ah-reum's brief observations in her mind.<br><br>politic1983.home.blog","user":"politic1983","rank":[2,3]}]