[{"title":"A Truly Unique Film","rating":7,"date":"18 July 2019","review":"Potrykus is one of the most talented and well known directors to come out of the West Michigan film scene. I haven't had a chance to see his first film \"Ape\" yet but his sophomore offering of \"Buzzard\" is a delightfully funny and rebellious workplace punk rock anthem for the everyman. \"The Alchemist Cookbook\" certainly caught some off guard with its change in tone from his previous work but it is a decent horror film with some really special moments in it.<br><br>Having seen both of these films, I was really primed to see some thing more than unique when I got to go to a special screening of \"Relaxer,\" in conjunction with this years ArtPrize.<br><br>I didn't know anything about this film going in but within a minute the premise is being set coyly with a wink and a nod. Sure the challenges that Cam throws at Abbie are extreme and cruel but the idea that Abbie, or Joshua Burge, would take the ludicrous challenge to sit in one spot on the couch for six months seriously is even extreme enough that you can almost feel the director winking into the camera saying, \"That's right. We ain't movin' and we ain't gonna cheat. We are doing' this.\"<br><br>The entire movie, one of the characters never moves their butt off their seat. This really impressed me. On the one hand, as a film maker I know that the grind of moving locations every day can really wear a crew down. Being at one set the whole time would sure be nice. But then again, I can imagine it might start dragging a bit after a while. Day after day in the same place. Clocking in and clocking out. I mean, half of us in this business do it because we dream of breaking out of that kind of routine.<br><br>That's where the movie is subtly brilliant, probably unintentionally, but if not, Kudos to you, Joel. Even the way that it gets made is a sort of commitment to break out of the normal, the thing that is holding us back. I have never gotten a chance to talk to Joel but I bet that even like the smallest of us film guys, he lament's that we can't work on the scale we want, for the rates we want, and with all the time we want.<br><br>We make sacrifices and before you know it we are back on the couch. Wasting the days into the new millennia. At the very least, watching this film made me want to fight the things that keep me down. They may not be as gross, or funny, or outlandish as in \"Relaxer,\" but they still need to be taken down.","user":"truemythmedia","rank":[5,8]},{"title":"Relaxer","rating":7,"date":"20 July 2018","review":"I caught this film at Fantasia Festival this summer (July 2018). I had no idea what to expect and found myself pleasantly surprised by what I saw. I found Relaxer to be captivating of my attention throughout the entire film. I'm glad I checked this out.","user":"jflaherty131","rank":[7,14]},{"title":"Mythologizes our dire lives","rating":10,"date":"30 November 2019","review":"This achieves a transcendence on the couch. It is the same mythos of the heroes journey, a trip through hell returning with enlightenment with various challengers along the way. It peaks as the archangel suddenly sees the world through new eyes, and smites wickedness. Eerie as he reaches there, we are suddenly viewing this film no different than Lord of the Rings or The Odyssey. It delves into Y2K, and we get that once in a while, the Mayan Prophecy, etc; so this transcendence creates this association between now with primitivism. A labyrinthic heart of darkness. Comedically, this is the natural escalation of post-irony: we go so far into self-reference, the illusion would be breached. The mystery of those 8-bit games is they are so much larger than the screen because they exclusively operate in our imaginations due to limited graphics and technology. The thing is, this sort of thing is very popular and common: I often wondered there must be untold secrets in those 8bit worlds, and I was not alone...new secrets are being found, new records achieved. It's as if the mathematical limitations of the code are constantly tested in our attempts to meet the limitations before us. It is a challenge to our very humanity to best the gods. The thing is Nietzschean as it explores the human impulse to break the code, same as the filmmakers impulse to go somewhere that might seem obvious yet few do with means, and that is to push the limits of irony--this is not for its own sake, nor is it an indulgence, rather the challenge there to breach is a challenge history asked of us, as this is the frame that preceded us. So by pioneering and stretching the spectrum further, one is constantly surprised to find there are outcomes. It challenges Warhol that everything has been done, and how wrong he was--nothing has been done. Evolution is a constant burden. The film operates like the 8-bit in itself. It barely ever shows the game, it doesn't delve into the challenge. It isn't interested in the science fiction of it. The film is everything but the film. It just shows him on the couch. It is entirely an abstraction. A theater of the slacker, where even the genX slacker is now an archetype from history, we show him in his environment where he is not even active but zoned out. The cliche was we wasted our lives away, here, no: the immersion was the journey itself. Interesting the effect of frames and how it operates mythically is why the running time never drags. Burge is the west on collapse. He is the mercy of the world. We read the world through his eyes, and the film offers this very Klaus Kinski, or Kurtz Brando for him at the end. He plays the journey somehow. Then in the process of finding the secrets of the game, he becomes the game. The One. That it culminates on Y2K shows a parallel reality that he has changed the course of history by cracking the 1s and 0s. This is the Y2K that happened. The post-irony often lands at changing history because this is the current day digital frame that accommodates us-anywhere we take it, it accommodates-our narcissism has become the world entire. In indulging this, it somehow grants millennials and post-millennials outcomes, saying whatever is the economic, cultural, or societal collapse, everything is going according to plan.","user":"ReadingFilm","rank":[6,12]}]