[{"title":"A fragment of life with the $3,500 price tag.","rating":8,"date":"23 February 2019","review":"A fragment of life. No past or future, just a fragment. Almost like a documentary. Predictable? Yes, but it still made me cry. The movie is not about what happens in the end , it is about a journey and that person who walks that last path with you with you.\n\"Why did we have to buy this? Any 100 pills would give you the same result\".","user":"myotherpetisdog","rank":[80,81]},{"title":"Ordinary, honest, and worth your time","rating":7,"date":"23 February 2019","review":"Paddleton is a simple movie. The story is contained, the cinematography plain, and the premise unoriginal. This is all clearly by design. The two main characters, played by Mark Duplass and Ray Romano, are weird, awkward people and they are always presented as they are, ordinary. They live in small apartments one on top of the other. They are single and work simple jobs. They have terrible diets and watch terrible movies. And one of them happens to be very ill.<br><br>While it may seem like a criticism for me to call this movie plain and unoriginal, it really is not. Paddleton is not a canvas for some artsy filmmaker to paint with. It is not excessively dramatized or colorful or whimsical. It is what it is, an honest character study of two people. Often the silver screen is reserved for the interesting and the bold, the odd and sometimes depraved, people that seem to merit attention. These two characters are not like that. They are tiny, seemingly insignificant, and each actor melts into their respective personalities. The relationship between the two feels honest and they come across as true friends on the screen. Not to take anything away from Mark Duplass, but Ray Romano really steals most of the scenes they have together. He plays an aging, banal, and single man scarily well.<br><br>There are some things I did not like, the music was a bit twee and contained mostly ethereal melodies and simple keys that did not always fit the tone of the accompanying scene. Some of the dialogue felt stilted. But really everything besides the two performances is just window dressing. This is a film about their relationship and the circumstance they must face together. The low budget feel works to focus the viewers attention on these two people, it makes it feel real.\nWe all have to face death in our lives, but we have each other to depend on.<br><br>Friendship is such a precious commodity that we often take for granted. It's the little things, like seeing each other on a commute to work, that become noticeable once gone. Paddleton pays homage to the beauty of ordinary life, and reminds us that this finite bit of time we have been given will eventually come to an end. It does not try to prescribe meaning it cannot possible know, it does not romanticize the process, it just is what it is, and in that way it becomes a worthwhile experience.","user":"fpcholcomb","rank":[76,79]},{"title":"What a refreshing film","rating":9,"date":"24 February 2019","review":"The movie spells out its plot right in the beginning which I'll touch on. But don't worry, even if you do read spoilers, it wouldn't change the experience. The filming was great, and everything served its purpose.<br><br>So right off the bat Michael (Mark Duplass) is diagnosed with terminal cancer, and Andy (Romano), his best friend is gonna help him see it through.<br><br>I knew what would happen for the rest of the film, but I wanted to watch it anyway, and see it to the end.<br><br>The film was simple in many ways, but one that really captured a true male friendship. Not a lot needed to be said, but everything was said. Not a lot really happened, but a lot happened. I felt like I was watching two people who had been together their whole lives. There was excellent chemistry, with some really casually funny moments. I didn't even realize that I was seeing the film through Andy's eyes. That I was thinking what he was thinking, and by the end I was feeling sad, but ultimately I was happy that Michael got to live how he wanted to.<br><br>So in summary:\nIf you want to watch an easy film that somehow magnifies the true importance of each day with the people you truly love spending time with. Then you should watch Paddleton.","user":"finnlife1","rank":[27,27]}]