[{"title":"far better then being given credit for","rating":8,"date":"20 July 2018","review":"I watched Godzilla 1985 when i was 5 years old, i have been a BIG G fan ever since, i am 36 now. i even forced myself through the 1998 american dung heap. and i am american. i have watched both animated Godzilla movies so far. both are far better then they should have been. in many ways, far better in story then any Godzilla movie ever made. i normally hate it when Godzilla is the bad guy. but not in these, it is done so well. i wonder what the people were expecting who have written the negative reviews... just a mash up of monsters? it has good stories, logical flow, drama, action, charter development. i cant wait for the third, excellent way to fill the gap for the new live action. i hope they do many more.","user":"onthebounce-55555","rank":[35,48]},{"title":"Godzilla Fans: 8-9/10. Standard Viewers: 5-6/10","rating":8,"date":"18 July 2018","review":"What people need to remember walking into any Godzilla movie is that the first 45-60 minutes involves talking. The last 30+ are solely dedicated to utterly amazing, feet-flailing excitement. If you consider this, the movie is fantastic: Here's my breakdown.<br><br>The art of storytelling is not lost in Japan. They understand the need to lay sufficient groundwork to build your story on. They also understand that conflict drives a story. While it may seem like the story lags, even I had a moment where I had to be reminded of this, it serves a purpose. They could have easily have just presented things to you without offering explanations, but that's a half-hearted story. In Horizon: Zero Dawn, they give you explanations to everything you're witnessing despite its seemingly insane scenario.<br><br>The tensions within the first one bubble over now in the second iteration of this three part series. The ideals of each group now reach their critical mass as they begin to question what exactly it is they're willing to sacrifice in order to defeat Godzilla. Not only that, but what it is that they're fighting; the monster, or the idea of it. If it is conflict that drives stories then this truly is a story. Seemingly each scene grasps this concept and seeks to convey it to us. <br><br>I'll probably come back and edit this later but this is the best I can offer after just watching it today and without any spoilers. I can say with surety that the efforts of the writers to give us a well-rounded story were felt. If you rate this a 4, I can see that. Much below that and I might call it unfair, even if you don't like the genre. One thing that bothers me is when people toss up a 2* rating with a review that basically says they don't like Godzilla, monster movies, or action in general. If you accept that it is a Godzilla film when you walk into it, at the very least, it won't be a waste of your time.","user":"zackplog","rank":[31,44]},{"title":"Great movie series","rating":8,"date":"31 July 2018","review":"I am not sure about these negative reviews. The movie set has some great philosophical points. I have loved both on netflix so far. I referred a few friends to watch, they also felt the same. I don't usually watch anime, so maybe that is the difference. As a story, the writing is solid.","user":"godlovesufriend","rank":[13,18]}]