[{"title":"Unrealistic story - Tyler Perry at his worst","rating":2,"date":"17 March 2019","review":"This movie was supposed to be about a successful, but confused black woman's journey as she discovers that her relentless pursuit for what she always though a \"perfect\" man should be has made it impossible for her to find happiness.<br><br>In steps a rare but imperfect man named Frank (portrayed by Omari Hardwick) with wonderful qualities, Frank has made mistakes and he has learned from them. He's a caring and loving person who works hard to help others who have struggled in similar ways. .<br><br>Danica, played by Tika Sumpter, is torn between her growing attraction to Frank and the seemingly \"perfect\" man she has been chatting with for a year, that she has never met. We are meant to believe she is a successful ad executive. Unfortunately, all of her work scenes portray her as someone who is somewhat disconnected.<br><br>We can appreciate this and even forgive it to some extent. However, we have to wait until the very end of the movie to even see a glimpse of the hard working intelligent woman we were led to believe she was. Meanwhile, what we are left with is a woman who seemingly can't compartmentalize the pain she is going through in her personal life. We want to forgive this. We can identify with how difficult it can be to be successful at work when our personal life is a mess, but successful people do it all the time. Instead, we are left with a completely dysfunctional woman who seemingly only works when she is forced to go to a meeting.<br><br>I wanted to enjoy the story. I wanted to see her grow and become the woman she was always meant to be. Unfortunately, the journey is muddied with ridiculous way over the top acting and writing of multiple characters who are meant to bring comedy relief as our heroine compleye's her journey.<br><br>Tiffany Haddish plays Tanya, Danica's sister. She was funny at times but her over-acting often made me cringe. Whoopi Goldberg, who played their mother, was almost always high. Chris Rock was ridiculous, and Charlie, played by Mechad Brooks, was completely unbelievable as Danica's so- called \"perfect man.\" She had been talking to him for a year! They meet once and any shred of credibility for his character or Danica's is lost. She's supposedly head over heels in love with him but there is no chemistry. Charlie is thoughtless, inattentive and ridiculous, and the sudden revelation that his penis got stabbed by a pencil is pointless. It's not funny. It's not useful in any way. After a short interaction we are left wondering how this so-called intelligent woman could have ever believed this man was even close to who she thought he was. We all make mistakes. Sometimes it takes a life to learn what's important, but not seeing who this man was would've made her completely clueless. A woman of nearly 40 years would have to have at least a small clue. It just made no sense at all.<br><br>As she continues to flip back-and-forth and disrespect Frank we are left feeling sorry for Frank. No matter how much she hurts him he keeps coming back for more. We can't help who we love but we are led to believe that Frank is a man who knows who he is and is proud of it.. A man with self esteem. It's impossible to believe a man like this would so easily forgive her deplorable behavior.<br><br>In my opinion their final reconciliation should've happened years later after a well deserved break up. This would have given credit to the strong man we are led to believe Frank is. It would have also given time for Danica to reconcile all of her thoughts and feelings and to truly discover who she is.<br><br>Ultimately the timeline is unrealistic. Danica's acting is weak but the writing and direction was ultimately what killed this movie. It's clear Tyler Perry has either lost his ability to connect with people or no longer cares. He's made over half a billion on low budget high profit films. Unfortunately, we keep rewarding him by spending our hard earned money to see his increasingly insulting and less and less funny movies.<br><br>Tyler Perry is an intelligent and very talented person who has the resources to make a truly inspiring movie that we would be as proud to watch as the actors and actresses are to play their roles. What happened to smart comedy? Why do we keep having to see black women portrayed so unrealistically?<br><br>Ask yourself, why does he keep churning out nonsensical garbage. It's lazy. Tyler Perry seems to be far more concerned with quantity than to take the time to write a realistically livable and funny movie that we know he's capable of.","user":"brian-mcintire","rank":[19,24]},{"title":"Wasted Millions to make this trash","rating":1,"date":"8 November 2018","review":"Its hardly funny. Nobodys fool just became everybody's fool for watching this.<br><br>The only spoiler I have for you is the time you'll be wasting.","user":"miketanu-50421","rank":[44,64]},{"title":"Train wreck from the start","rating":1,"date":"4 November 2018","review":"Waste of the talented TH and WG.....playing horrible stereotypical characters. What is this film about? 2 sisters from different worlds trying to find middle ground? A romantic comedy? Catfishing? It's a mess.....should have gone str8 to video.....","user":"Neoman1962","rank":[46,69]}]