[{"title":"Thanks, Burn.","rating":8,"date":"25 August 2019","review":"Thanks for not being every other movie. Thanks for giving me a protagonist who isn't a cardboard cut out of a cardboard cut out. Somebody so far outside the politically correct Hollywood norm that I had to question my own morality a few times when rooting for her. In the dessert of superheroes, remakes, and pointless sequels Burn is a refreshing glass of. . . something different.<br><br>Praise aside, this movie's weaknesses all lie late in the third act. Minor restructuring, and capitalizing on things established could have made this a perfect 10.","user":"chunkiefroth","rank":[44,54]},{"title":"Surprisingly Decent Oddball Indie Thriller","rating":6,"date":"23 August 2019","review":"I wasn't expecting anything from \"Burn\", I picked it up as soon as it came out, hadn't heard any opinions and even disliked Josh Hutcherson before watching this. Much to my pleasure, \"Burn\" turned out to be a cool little indie gem.<br><br>\"Burn\" has many good things working for it, as well as some flaws. Things like simple, but vividly colored and crisp cinematography, subtle but well placed original score pieces &amp; cool characters brought on screen by decent performances made this movie rise on the slightly-above-average level. Pretty much all of the characters are sort of one-dimensional &amp; some don't get the journey we would want for them, but, nevertheless, they were fun. The main character (anti-hero?) really excelled, maybe by simply just being so weird. The pacing was mostly very even, maybe \"Burn\" burned for 5 minutes too long, but it's not a fatal flaw. The 1st half of the movie went by faster &amp; seemed more substantial than the 2nd half. \"Burn\" is set in and around (mostly in) just one location, which makes me even more impressed, given the results. Many could ask \"What's the point of this movie?\" and, sadly, I can't answer that, but it sure was entertaining and pleasantly odd for 88 minutes straight.<br><br>\"Burn\" is a decent albeit forgettable expierence which I recommed to everyone who's enjoying his indie thrillers, dramas and horror flicks &amp; loves a good 6/10 every now and then.","user":"TwistedContent","rank":[30,37]},{"title":"weirdly satisfying","rating":7,"date":"3 September 2019","review":"Yes, it is weird, a look at a girl living on the edge, just barely hanging onto her sanity. She is desperate to escape, to feel something, anything. Then a good looking robber gives her that spark. It lagged in places and you wanted to step in and fix it but overall, a cool ride.","user":"iamjamalwhite","rank":[15,20]}]