[{"title":"Can't believe I watched it","rating":2,"date":"11 March 2018","review":"This movie is so stupid. The man is stalking a young girl. Her mom and the police don't believe her because she lied. BUT, she is able to call him... Here's a thought... Show your mom you have his number. Text him, and get him to respond. Call him, and put it on speaker while your mom or the police are there. Everyone is tech savvy, but not smart enough to try to set the guy up using texts or emails or phone calls. I thought it would be a different movie, but then I just got more and more frustrated at the inanity of the plot. I stopped watching.","user":"eelynnej","rank":[11,15]},{"title":"Worth Watching","rating":9,"date":"10 April 2018","review":"Kendra, a high school student, and her mother, a nurse, spend their Thursday nights watching a bachelor type show. The star of the show is Brad, a very good looking man who is in search of the perfect woman to spend the rest of his life with.<br><br>Misha, Kendra's friend, has tickets and fake ID's for them to get into the hottest party in town where producers and agents will be attending. And with both Misha and especially Kendra, wanting to be actresses, this is the perfect opportunity for them to meet some of the powers that be. The only problem is, the party is on a Thursday, and Kendra is already in trouble with her mother for sneaking out the house before. In addition, it's their TV watching night. With Kendra being in trouble with her mother, she will be unable to attend the party.<br><br>It's now Thursday. Kendra and her mother are watching their show when they get into an argument. The argument sends Kenda dashing to her room where she texts Misha to say she wants to go to the party. Misha said she'll pick Kendra up in 30 minutes.<br><br>Misha and Kendra arrive at the party with fake ID's in hand and hit the bar immediately to order a dirty martini. I'm not sure who thought a dirty martini would scream classy when writing the script, but it screamed desperation. Moving on.<br><br>Misha goes to talk to a producer, leaving Kendra at the bar alone, but not for long. Soon Brad, from her favorite reality show, shows up and she doesn't know what to do with herself. While they are talking Brad's manager gets him to mingle with some people she feels will help his career. When he leaves, Kendra is feeling guilty about sneaking out the house and wants to go home, but she can't find Misha. It's during her search that Brad catches up to her and they begin talking again. It's not long afterward that Brad offers to take her home. What Brad doesn't know is that Kendra is really a 17-year-old high school student.<br><br>Brad and Kendra go on their first date and his true colors start coming out. Being the cautious person she is, Kendra takes note and keeps it filed in the back of her head. After dinner, Brad takes Kendra backs to his place where he begins to come on strong to her. The more she asks him to stop the more he doesn't stop. Kendra is finally able to break free and leave but not before she blurts out she's really 17. Her age doesn't seem to faze Brad and he comes to her even stronger. Kendra is finally able to break free and leave and this is the beginning of the stalking by Brad.<br><br>I really enjoyed this movie. This was the second good Lifetime Movie Network movie I saw on Saturday. The first being Her Dark Past, which I will do a review on. The acting by both Emily Bader as Kendra and Robert Scott Wilson as Brad were very believable. Asia Jackson as Misha annoyed me a little and as did Zach played by Jordan Doww. With latter two mentioned aside, the movie was well put together. Wilson's portrayal of someone not playing with a full desk was scary. He had some menacing looks that were believable and definitely didn't seemed forced. I hope to see this guy in more movies in these type of roles. I feel the same way about Bader. I hope to see her in more Lifetime movies, for just as with Ashley Scott, Jason-Shane Scott, and Dina Meyer (to name a few), she would be the reason I watch the movie.<br><br>Here's something I noticed. As mentioned, Kendra and her mother watched a bachelor type reality show on Thursday nights. On LifetimeTV (a kin to Lifetime Movie Network) there's a show called UnREAL which is a drama about what goes on behind the scenes of these bachelor reality shows. One of the main characters in the show is Rachel, played by Shiri Appleby. What I found odd is Bader (Kendra) looks a lot like Appleby (Rachel from UnREAL).","user":"Reel_Reviews","rank":[5,7]},{"title":"Really bad ... but I would watch this again","rating":3,"date":"31 May 2019","review":"Let's make it adequately clear that I enjoy a movie with a line or scene so stupid that I have to backtrack to watch it over in utter amazement that I had just witnessed something so shockingly and hilariously dumb, and I was able to do that a few times with this one.\nRobert Scott Wilson does a very effective job in his reality star/stalker character but the good news stops there. The mother's character comes across as more bipolar than the stalker ... that crazy kind of bi-polar where was genuinely concerned for everyone around her because I was certain she'd change into an axe murderess or a werewolf at any moment, even though her character isn't bi-polar, nor written to be all that intimidating, or a werewolf. The daughter mostly repeats the same line over and over again --- \"I'm not lying! Everyone else is lying!\" --- giving Emily Bader a chance to really show off her range (seriously, she seemed to be a competent TV actress, this role was just horridly written). Angela Lieb as the stalker's mother really stole the show by playing her role like she was fresh out of a 1940s mobster serial.\nThe story arcs around the notion that a girl who has been seeing --- and calling and texting --- with a man has no way to prove she's ever had contact with the man even though he still answers calls and texts super-creepily.\nI am not actually spoiling anything here. That simple, adequate evidence of their phone contact is never sought. Amazingly, the daughter, the mother, and an entire team of investigators just never seem to think of it. This movie could have been over in 30 minutes.\nThe whole thing lands with a resounding collective thud ... but, you know, it's the kind of trainwreck I'd sit through another time.\nI should probably seek counseling.","user":"MyFriendsCallMeDirt","rank":[2,2]}]