[{"title":"Back to the roots","rating":9,"date":"16 December 2018","review":"As a guy who grew up on Asterix comics, and I'm still buying new editions for my kid, I can say that quality of episodes declined with couple of last Uderso's episodes. New team has made last 3 novels, and they had their hits and misses, but it was good for the future of Asterix that new ideas came in.\nIt was the same with this movie. Completely new story, romans are not the main oponents, and the story is more about druid Panoramix (Getafix), than Asterix and Obelix. It was a risk, but in my opinion it payed off. The whole story was fun, with beautiful animation, and lots of stuff that even grown-ups can laugh to. I felt as happy as when I was as a kid watching my first Asterix animated movie. We also got the origin story of one of the most loved characters - druid Panoramix.\nVery good addition to Asterix collection. A must watch for every true fan - young or old.","user":"crejk","rank":[48,53]},{"title":"Wonderful Entertainment","rating":7,"date":"24 April 2019","review":"When the Druid Panoramix falls from a tree on the floor, he breaks his foot and decides to find a young successor to teach the secret of the magic potion to keep the village protected. He travels through Gaul with Astérix, Obélix and his young apprentice Pectine seeking out a good druid to learn his secret. Meanwhile the evil Sulfurix becomes the advisor of the ambitious Teleferix expecting to learn the secret of the magic potion to negotiate with Cesar while the Roman troops attack the village that is protected only by the Gallic women.<br><br>\"Astérix: Le secret de la potion magique\" is a wonderful family entertainment. The stubborn Panoramix has a great participation in the film looking for an apprentice. The result is the usual, with the Romans helping the Gallic heroes against a greater evil. My vote is seven.<br><br>Title (Brazil): \"Astérix e o Segredo da Poção Mágica\" (\"Astérix nd the Secret of the Magic Potion\")","user":"claudio_carvalho","rank":[12,14]},{"title":"These druids are crazy","rating":8,"date":"5 April 2019","review":"As a huge Astérix fan, I believe this is a good follow-up to the hilarious Le Domaine Des Dieux by the same writing/directing team. Unlike the former cartoon, this is an original story not based on any existing Astérix comic book.<br><br>Characterization is on target, jokes amusing. Druid Getafix (Panoramix in the original) has his own day in the limelight and for the first time is arguably the main character. After an accident where he breaks a leg, Getafix starts worrying about getting old; the plot revolves around his attempts to find a successor to pass on the secret of the magic potion, much to the dismay of Astérix, while a rival druid tries to steal it.<br><br>Like in Le Domaine des Dieux, the ending goes a little overboard with a battle/action set-piece which could have been a few minutes shorter, but it's a minor issue. Overall very enjoyable.<br><br>7,5/10","user":"petra_ste","rank":[12,14]}]