[{"title":"Really not as bad as other reviews say.","rating":7,"date":"17 May 2018","review":"Yes it wasn't amazing, but it was easy watching and entertaining. The characters mostly looked like they would in the game, and while the acting was far from Oscar worthy, it wasn't bad. Kudos to the makers of this, I feel it was quite low budget and it was decent and worth watching.","user":"DanBarraclough04","rank":[6,11]},{"title":"Not too bad, but never captivating either","rating":4,"date":"14 March 2018","review":"\"Far Cry 5: Inside Eden's Gate\" is an American half-hour live action short film that was released in 2018, very recently, and this one is of course closely linked to the video game(s) of the same title. And that's also the reason why it makes some waves now that it is out on Amazon video, perhaps almost the only reason. The actors and writer and director are not particularly known to be honest. It is about a group of young men trying to find out more about a dubious cult and how dangerous or harmless it may be. I must say those scenes where we actually see the cult members that are about the undercover mission if you want to call it like that are where the film is at its best. Sadly the protagonists are not half as interesting as the cult really and that hurts the overall movie. It's even tough to cheer for them as a consequence. Overall, in terms of tone, but also in terms of the characters' looks, this reminded me a bit of The Walking Dead atmosphere-wise, without the \"undead\" aspect of course, but maybe with the \"dead\" aspect? Watch for yourself. or don#t as I found it a really mediocre product as a whole. There is an okay moment here and there, but even for 30 minutes it is just not enough and story- and acting-wise it leftg me unimpressed, so it was fairly forgettable as a whole. I don't know if Amazon plan to make a series of it, but at this point I don't think I would watch more episodes of this project unless the quality improves a bit. It's not a failure, but maybe only worth seeing for genre fans. I give it a thumbs-down.","user":"Horst_In_Translation","rank":[5,9]},{"title":"Great set up for the game","rating":9,"date":"29 March 2018","review":"After playing the game for 18 hours in 3 days i watched this \"movie\" enjoying how it set up the story for the game. It shows the father brain washes the people of hope Montana and ,how with his messed up family and followers, creates his militia. In the beginning scene of the games, the police come to farm with an arrest warrant for the father and this \"movie\" shows the sequence of events leading up to that. If your looking for a resolution to this story you will be disappointed. Your going to have to play the game for that but for what it is (a live action set up to the game) i would say its well worth watching.","user":"lukassarrett","rank":[5,10]}]