[{"title":"Subtle Hidden Message Makes This Worth Watching","rating":7,"date":"27 November 2018","review":"I Have Reviewed OVER 500 \"Christmas Films and Specials\". Please BEWARE Of films and specials with just one review! For instance When \"It's a POSITIVE\" chances are that the reviewer was involved with the production. \"If its Negative\" then they may have a grudge against the film for whatever reason. I am fare about these films.<br><br>What I like about this film was that this is the third film (maybe there will be a fourth) in a series of films in this Hallmark Christmas Movie. The first two films were \"Finding Father Christmas\" and \"Engaging Father Christmas\". Now this one is called \"Marrying Father Christmas\" and the message this film cleverly does makes this film one that you will long remember in the years to come.<br><br>In this film Erin Krakow once again stars as Miranda Chester. She runs the emotional range here from \"a-b\" but it works! In this Miranda is about to get married. She is closing up her shop in Boston for the holidays and is about to get married on Christmas. At the last minute a man wants to hire her services but she politely declines because of her \"Time Restraints\".<br><br>A day later she sees the man in Vermont (And he looks like Dru for Despicable Me) and she is puzzled. The thing is this man might throw a money wrench into her plans.","user":"Christmas-Reviewer","rank":[10,12]},{"title":"Marrying Father Christmas","rating":10,"date":"14 November 2018","review":"This was a great sequel. I don't know why it received a 6.2 rating. It was a joy to watch. It had an element of mystery to it and there was romance and love. The acting by Matter and Krakow was great.","user":"legalsecretary-03930","rank":[7,8]},{"title":"One of the BEST Holidays series I have ever seen!","rating":10,"date":"5 November 2018","review":"This movie has everything. Love, mystery, romance, and is filled with Joy. This series filled my Heart to overflowing. I could watch these movies over and over and still love them. They are at the Top of my favorite Christmas Movies.","user":"ilovealoha","rank":[9,11]}]