[{"title":"Shakepeare would be jealous of how much of a tragedy this \"movie\" is.","rating":1,"date":"2 December 2018","review":"\"Watch If You Dare\" is a pathetic excuse of a horror movie that neither comes off as taking itself seriously or self-aware. What it does in its terrible 4 stories is showcase gore and pass it off as horror while completely missing the mark on what horror actually is. I felt so offended by this trash I felt inclined to write a review about it.<br><br>The first story is called 'The Stylist' and makes absolutely no sense. It doesn't explain anything about anyone or the scenario and falls into replacing any sort of suspense or intrigue with blood, rubbing into the face of the audience screaming \"ISN'T THIS SCARY?!\"<br><br>The second story 'Ink' is somehow even more bland, boring and nonsensical making you ask questions (if you've somehow stayed awake), but not the good kind. It makes you think who decided this was good enough not only to write, but to pitch, produce, direct and release. It doesn't tell you a story before throwing you into their cheap gore special effects that would take you out of the movie even though this doesn't have you in it in the first place.<br><br>The third story 'Foodies' is PAINFULLY long and one of the worst of the already utterly terrible anthology. The characters are painful to watch creating a boring viewing experience without gripping its viewers or creating any product worth watching. Frankly I can't think of anything more to say about this boring, boring short. It's BORING.<br><br>Finally 'Knob Goblins' felt like 4 seconds which is a refreshing change of pace because it meant this nightmare was over quickly. I actually have no idea what I watched but I thought it was funny in an extremely awkward way. This has no purpose of anything.<br><br>Overall \"Watch If You Dare\" is only called this because it challenges you to sit through too many minutes of terrible storytelling, directing and acting. Watch if you hate yourself.","user":"Futures_End","rank":[35,38]},{"title":"Oh Myyyyyy","rating":1,"date":"13 January 2019","review":"You can travel far and wide.\nYou can attend every obscure film event. Every movie conference. Every screening of every movie ever made on this planet and planets yet to be discovered.\nBut honestly, you will not find a worse movie ever made.\nHonestly.","user":"arfdawg-1","rank":[36,40]},{"title":"What a terrible movie","rating":2,"date":"28 April 2019","review":"I can now say that I have truly watched the worst movie ever made.","user":"aidansmama77","rank":[11,11]}]