[{"title":"Are people seriously trying to write a serious review.","rating":7,"date":"20 August 2018","review":"Yes it's a terrible film. Yes that's what it's supposed to be. And yes that's why it's so ridiculously good fun. Let's be fair it's not for everyone. But if your not one of them people. Why did you start watching a film called sharknado in the first place.","user":"jamiekressinger","rank":[92,107]},{"title":"Insightful film raising questions about multi-temporal displacement and humanity","rating":10,"date":"20 August 2018","review":"Superficially, one may view this cinematic experience as a hodgepodge of clichés, parody, cameo star power, and of course the gratuitous blasting or slashing of Selachimorpha. While yes the movie contains all these things, delving into a level deeper, one can explore the wonders of the paradoxal nature of temporal shifting. Ponderous questions arise such as, \"what happens when you leave your robotic wife's head in the bottom of the ocean for twenty thousand years?\" and \"can a son save his father before his father can save his son with the help of his grandfather when his grandfather was his father's age?\" Despite these profound queries, one theme surpasses them all, that the human spirit forges on in order to create a world of peace with one's family. Ultimately this is a goal we all seek, one that is well worth fighting all sharks throughout history to achieve. Just as a shark would tumble helplessly in the winds of a tornado, so does the struggle for loving comfort within the vortex of our lives.","user":"saintgod-736-406376","rank":[77,92]},{"title":"Hilariously BAD","rating":10,"date":"20 August 2018","review":"I've been with Sharknado since the beginning. The ridiculousness never ends, which is what makes them so great! If you've been watching this series for anything other than crazy, dumb plots, acting, and special effects then you're watching for the wrong reasons. I've enjoyed every single one.","user":"lvnvrcd","rank":[54,69]}]