[{"title":"A Raw and Beautiful Love Story","rating":9,"date":"23 July 2018","review":"This tale of love encompasses only the entire world immmediately surrounding Jing Boran and Zhou Dongyu and it is a tale that is raw, honest and so real. Woven around this story however is a Beijing so beautiful it will enrapture you. All its surrounding nature however only emphasises how lonely one can be in a big city. The story flits back and forth over about 8 years and as much as you see the couple as they are currently, their story from a few years ago seems to always have you rooting for them to succeed and embrace the love that so palpable you can reach out and touch it. It is a tough tale to tell and it is both personal and seemingly perpetually painful. There is a line in a letter that is read towards the end that says it is very difficult for two people to live together forever. If only it were not so often true.","user":"nicklaus-463-394773","rank":[12,13]},{"title":"Best Romance Movie Ever - prepare tissue for your tears.","rating":10,"date":"7 July 2018","review":"I suppose many people living in big cities could relate to the movie. <br><br>The initial bitterlove was sweet. Despite the financial difficulties, the fact that the two genuinely love and care for each other and that they share the aim of pursuing better future is comforting. But it doesn't last long when the reality hits, especially when the boy is still a boy. He is lost. He forgets what the girl really wants. She doesn't really want a house. She just wants a home. <br><br>This movie also tells about parents' perspective as regards their son's relationship. The father part is extremely touching and emotional. That makes this movie stand out from other typical romance movie. A must watch.","user":"tanzuhao","rank":[19,23]},{"title":"Such a great love story","rating":10,"date":"4 October 2018","review":"The movie is something that we all have experienced before / can relate, where relationship fails because love alone is not enough. Watched this with no expectation on netflix, rate it 10/10 after watching it. Cried a lot too :P This is a must watch for everyone!","user":"lina-hafizah","rank":[5,5]}]