[{"title":"AS THOUGH EVERYONE WERE READING THEIR LINES","rating":4,"date":"6 October 2019","review":"I saw 'Frankie' today (Oct. 6, 2019) at the Mill Valley Film Festival. A more slow-moving, uninteresting film would be hard to find. Other critics of the film have done a good job of laying out the plot, so I won't take up your time. My low rating is based on the low (lowest) energy that this film puts out. It is as though no one has the energy to show emotion. As though the Portugal heat has had its effect on everyone. But more than anything else the film runs as though it were a table-read; actors with script in hand, doing a first read at a table. The camera work is leisurely at best. This could be a TV soap-opera episode as easily as a theatrical film.<br><br>And for that there's no excuse.<br><br>Then why, you might ask, the four stars. For Ms. Tomei and Mrs. Hupert, that's why.","user":"levybob","rank":[14,16]},{"title":"Waste of A Fantastic Cast","rating":4,"date":"21 January 2020","review":"I watched this last year and it left very little impression on me.<br><br>The film, according to director Ira Sachs, is based on a 1962 Indian (Bollywood) film by director Satyajit Ray called Kanchenjungha.<br><br>This film is based on a family vacation in Sintra (Portugal), where a family gathers to learn about the life-altering event in Frankie's life. She's a famous French actress facing her own mortality, while surrounded (at her request) by family, friends, lovers, ex-lovers, and so forth.<br><br>With a wonderful cast from several countries (English, French, and American), the film is a slow meander through the streets of Sintra, while we meet and learn a bit about each character, their life challenges, and how they relate to Frankie. It's just that it doesn't flesh out the supporting characters' roles, because there are too many of them and not enough time in a feature film, so we get a taste of what's going on, but really fail to connect with anyone, including Frankie.<br><br>Isabelle Huppert is a marvel and a gifted actress, but even she seems disconnected from her own character, almost as if she's phoning it in. Case in point, a scene in the forest between her and Marissa Tomei, where Frankie has a seizure seemed like amateur hour. Surprising from an Oscar nominated (and robbed!) actress of her caliber, but I blame the writing/direction.<br><br>Overall, the cast is wonderful, but the film fails to deliver. That's why an average rating of 5/10 on here is not shocking.<br><br>See it for the cast and the scenery, but don't expect much as far as a truly moving story is concerned.","user":"holly-4ever","rank":[5,5]},{"title":"A melancholic chronicle of an expected mourning","rating":5,"date":"30 August 2019","review":"Frankie (<a href=\"/name/nm0001376/\">Isabelle Huppert</a>) is a dying French star. She organizes a family stay in Sintra, a sumptuous Portuguese seaside resort near Lisbon, the main purpose being an opportunity for all the remaining relatives to get closer and learn how to live together ... without her. I loved how she makes believe that she orchestrated a highly unlikely rapprochement between her son Paul (<a href=\"/name/nm0753737/\">Jérémie Renier</a>)) and her friend Irene (<a href=\"/name/nm0000673/\">Marisa Tomei</a>) while her objective is undoubtedly with other ones.<br><br>The making is probably excessively contemplative and the result is not as accomplished as <a href=\"/title/tt4919484/\">Little Men (2016)</a> also directed by <a href=\"/name/nm0755158/\">Ira Sachs</a>, all the characters suffering from an understandable but excessive temporal acedia. 5/6 of 10","user":"FrenchEddieFelson","rank":[11,14]}]