[{"title":"Boring, Scatterbrained, Cheap Zootopia Knock-Off","rating":1,"date":"17 February 2020","review":"It's been said before but this movie is just a Zootopia knock-off. It's boring and has horribly dry dialogue. I don't recommend this to ANYONE, not even anyone with kids.","user":"noro-46107","rank":[8,13]},{"title":"Chinese Zootopia Rip-Off","rating":2,"date":"15 February 2020","review":"Spycies is another anthromorphic animal movie trying to bank off the success of Zootopia. A tale about a secret agent cat named Vladamir Willis who is set to an off-site platform security as discipline after a mission causes destruction, he meets a rat name Hector, a hacker who made the place messy. However, their future with the agency ends up on the line when the platform is broken into by henchmen of an evil genius and steal a substance from the area while they argue about a soap opera.<br><br>Yeah, so basically what we have here is a Chinese film that is basically rips off elements from Zootopia. The relationship between Vladamir and Hector is basically more uneasy than Judy Hopps and Nick Wilde's, as they basically bicker and argue about anything. Also, the story is messed up, with a third wheel, a bee girl name Mia, an actress who forces herself on the mission to help her learn about being a spy for an upcoming role, using her title of princess as an excuse to make them bring her, which is horrible, as she is only there to be annoying as she acts like a diva. The story is boring, and the film lacks the heart that Zootopia had. Also, there is some swearing in this.","user":"jeremycrimsonfox","rank":[6,9]},{"title":"The Cheap Chinese Knock-Off of Zootopia","rating":1,"date":"13 February 2020","review":"I guess it was inevitable but jeeze. I was really hoping it'd have better writing and production values than this. From the characters to the world itself, there's absolutely nothing to connect with if you've already seen better films that do everything it's trying to do.","user":"cascadiarch","rank":[7,12]}]