[{"title":"Half sports documentary, half spy novel","rating":9,"date":"26 March 2019","review":"It's not unusual for a sports documentary to allude to the values or politics of a community, but it is rare for one to explore both global political themes as thoroughly as it immerses itself in the local tribalism of sports. This film unfolds a specific corner of the picture of the Cold War through the journeys of five men who left the Soviet Union to play hockey in North America. We find out about the risks they each took and the people who risked political and professional threats to bring them to the other side of the Iron Curtain<br><br>The producers of this film have a great deal of access to the players themselves and the American team officials that brought them to the US, so we get the story told in their own words as well as views of contemporary news coverage and the players' North American team mates. We get to see the events and recall the emotions of the era and we have the perspective of history to see their lasting impact on the game of hockey.<br><br>This movie has a lot for fans of the Detroit Red Wings, but any fan of the NHL or international hockey will likely find the story riveting","user":"EpeeBill","rank":[11,11]},{"title":"A great 1980's to1990's NHL time capsule for the true hockey fan.","rating":10,"date":"25 March 2019","review":"This movie was amazing. It captured the feeling of 1990's NHL hockey. The documentary was well put together and reminded you of the political climate of the 80's/90's as well as the extreme physical nature of the NHL at this time period. Red Wings fans should love it. Avalanche fans ought to respect it. NHL fans should never forget it.\nIt was extremely interesting learning the actual stories of how Russian players had to drastically change their lives to leave their home country to play in the NHL.\nWe brought a friend who is a physician in the United States, was born in Russia, and knew very little about hockey. She loved the movie and cheered hard for the Russian players.","user":"ilpoints","rank":[11,11]},{"title":"Very well done!","rating":10,"date":"22 March 2019","review":"This movie was great! Telling the whole story of getting the Russians to defect and how stealthy they had to be was brilliant. I got to learn things I didn't know and feel those experiences all over again. Loved it.","user":"eddievenom2002","rank":[8,8]}]