[{"title":"Enjoyable but ultimately exasperating","rating":7,"date":"6 April 2019","review":"There was so much to praise in \"Daffodils\" - most of the music (oh, the nostalgia!), the production values and period detail, the costuming, the acting; all were impressive. But the crucial scene of confrontation, even if it was one of the scenes that were true to real events, in film terms just did not work, and so the rest of the film fell quite flat. To have the man just stand there, dumb as a stunned mullet, while his \"film self\" warbled eloquently that he \"didn't have the words\"? Yeah....nah. Such a pity.","user":"jendus","rank":[8,9]},{"title":"Parts of brilliance, parts disappointing","rating":6,"date":"22 March 2019","review":"A very unusual combination of things in this film.<br><br>It really was a film of two halfs. The first part of the film set in the 1960s was charming and beautiful with two engaging characters and songs. Rose McIver shines even if her character could be frustrating at times.<br><br>In its second half the film doesn't work well and there were some horrible music choices and the singing by the lead male character was not up to par. Also I found Kimbra's voice pretty average right through.<br><br>Great to see Kiwi landscape and songs on screen but there were some songs which didn't work or were just kind of horrible and some great Kiwi songs were missed out (Be mine tonight or why does love do this to me would have been great additions).<br><br>It's worthwhile seeing for the first half of the movie which has moments of pure charm and brilliance, just wish some of the second half had been better executed.","user":"sophie-86354","rank":[8,11]},{"title":"Could be a solid \"6\" (spoilers on 3rd paragraph)","rating":4,"date":"12 January 2020","review":"IF it didnt have a plot blunder towards the end. I guess they wanted to provide a twist to the movie, and they did, but it ended exactly the oppsite way. The particular scene throws the viewer completely out of the movie and what was supposed to be the climax was actually disappointing, a big let down.<br><br>Could be a solid 6 maaaybe 6,5 (if there was an option) but no, the ending part messes an otherwise \"ok\" movie. I fail to follow the thinking of whoever is responsible for that scene, i am surprised it made it to the final cut.<br><br>Spoilers: For those wondering if its worth it, short answer is \"No\", keep on reading for the explanation. The movie is a typical boy meets girl, blah blah, they grow up blah blah, they make a family, blah blah, then the father of the boy dies at the appartment of his affair. Thats something boy has to keep a secret from his mother (although his mother already knows that her husband was unfaithful). Boy's wife smells the perfume (of dad's affair) and thinks that he cheats on her, she also sees them together in dad's funeral where the dad's affair went to give his watch to the boy (how bad plot is that, i'll let you decide, worse is coming).<br><br>Tension between boy-girl builds up until girl decides to split, the supposed climax is a few minutes of girl accusing boy and boys says nothing. No, really, thats it, they were a beautiful family but boy says nothing about being innocent and they end up in separate ways, for - practically - no - reason. Major dissapointment, i'd prefer them splitting over wrong babys milk temperature rather than that. There you have it, i hope i'll save someones time.","user":"geostoios","rank":[2,2]}]