[{"title":"This is not just a movie","rating":10,"date":"20 November 2018","review":"I cannot comprehend how this movie can be so beautifully shot, staged and acted, while on the other hand depicting the ugliest but so true to life experiences a human could ever possibly encounter.\nNot a single spark of hope ever comes up during the entire film, every character experiences his own version of hell while trying to find meaning in their appently meaningless lifes. Nobody smiles, everyone wears a thick winter coat.. even inside as if they need an extra shell to protect them from other humans. And yet, after four hours you are left with the urge to tell the world that there is still something worth living for. This movie is a plea for more kindness and humanity, although it is almost never showing either of them itself.\nA movie has never affected me so deeply like this one. I will never forget this experience and I am sorry for the directors relatives.. they, the Chinese Cinema and we all have lost a true filmmaking genius.","user":"paulmfm","rank":[68,79]},{"title":"Deeply Human","rating":10,"date":"24 February 2018","review":"Few debuts are this good. Throughout four hours, Hu Bei creates an overwhelminly human and sensitive film, creating characters to which we deeply sympathise and connect with. The more the film moves long, the more impactful it becomes, and soon enough even the smallest actions, the most simple scenes become huge, due to the sheer emotional investment the spectator has. This works mostly for these reasons: Bei's camera, which is always close to the characters, following them in long, some times astonishing shots; the actors, all of them astounding; the long running time, which gives time not just to explore each character, but also for the viewer to just spend time with these people, who we love to care about so deeply. Melancholic but not sad, deeply moving but never sentimental, An Elephant Sitting Still doesn't feel bigger than life: it feels like life, period. To call it a masterpiece would be an understatement.","user":"gonch-68899","rank":[62,80]},{"title":"Honest and true cinema","rating":9,"date":"3 May 2019","review":"\"An Elephant Sitting Still\" is a Chinese film crafted by Bo Hu, a new and impressively clever director, which chose to leave our dark and lonely world. And after watching his 4 hour film, which focus on one intense day in the lives of 4 individuals, who are living in a \"wasteland\" where crime and sadness and a constant dimness have the upper hand and they are searching for a way to escape from their troubles and the noises and the past. But will things change if we just go to another place or will confusion and lonelyness and animosity keep to exist in every step we make?<br><br>This film is astounding for many reasons. Firstly, despite its huge runtime of 230 minutes, the film is never of zero interest and has a immersive tone that lets you to grow with the characters and feel their emotions. The first hour may feel kind of slow beacause we do not get a lot of interactions and we basically meet our characters, their tragic lives and their hideous world they are struggling to live in. But, after they interact with each other and their stories crush onto one another, the film beacomes a true tour de force but it still remains delicate and quiet.<br><br>Also, the way the creator has built this enviroment is stylisticly satisfying and meanwhile it works well for the movies theme and for the characters. We are introduced to a dull, meaningless and dangerous pile of houses and desperate souls. We barely see a glanse of colour. Everything is grey, lifeless, moody and light only enters the frame from small windows or from cloudy skies. You probably thinking that this film is the most pessimistic thing on earth, but as it turns out, it isn't. Hu Bo is trying to be realistic and not a pessimist. Showing a dark dark world does not mean you are a pessimist, but instead it is a statement of how lowwe have fallen and of the tragedy of it all. It is what it is.\nThe world is cruel and blunt, a bunch of kids bulling another one, students posting mean twits for a girl, an old man looking out of the window, a broken couple walking inside a train-tunnel. All of this helps us get into the characters emotions and understand them.<br><br>The acting is superb. Every actor feels like a real person.The characters are human and they are striking for salvation, but do not accept that these are their lives and they have to move on with reality even if it is bad. Each one of them is trappedi in their own heads. A man of guilt searching for forgiveness and love. A teenager trying to deal with an incient which brings danger to his life. A girl wanting to find a place to feel happy, but when she does everybody is judjing her. An elder man suffering from loss and trying to copmerhend that he is aging and decay, like all of us. In their eyes we see the same pain, the same sadness and the same grand desire of a better life, another situation, a small place to forget and rest, an elephant sitting still. They talk and play and observe and ache and get hurt and laugh and there is a beauty and intrigue to their lives.<br><br>The soundtrack is really one of a kind. At first, I really did not get it and it sounded really \"off\", but soon I started to understand it's purpose and I can actually say that it is a really distinct music and whenever I connect it to the film. The band is actualy is called Hualun and I heard some of other tracks and theyare actually pretty good.<br><br>And funally, the one and only reason why this film is so signicant in the world of art and also the reason to why I wrote this review is the fact that this film- is deeply honest. For me, honesty is the key to an enjoyable and meaningful film. Nowadays, every film feels like the same, uninteresting and repetative selling product. Every production company adds something for the fans to \"Marvel\" at, we get millions of toys and marchendise of dolls and clothes and they get more than a billion of money... but where is the soul, the authenticityc of the creators? To me , when I see a film want to \"meet\" the person behind it and take a look at his emotions and thoughts. The director must BE the film and the film MUST be the director. Cinema is made for people who want to speak, but use their films and not words, in order to express themselves. Hu Bo isa true director and artist and human.<br><br>He was a man who felt that the truly precious tihng are hidden in the cracks of the world and emphasizes that thisi is not pesimistic and if people leave their texts and fake happy realities behind and understand this, they may feel awe in front of the principles that define life.<br><br>He managed to use his experiences and create a story which purely portrays his inner self. It is like we met him and then he left.\nI have seen a lot of movies and only two directors have proven that they can make a film which shows their inner nature. The one is Charlie Kaufman, one of the best flmmakers working today, known for his work in \"Synedoche, New Work\" and \"Eternal Sunshine of the Spotless Mind\", two of my favourite films. He once said that he feels sad because most directors do the smae job with politicans, trying to sell their works with saying and compaigns and they become pretenders and their films feel like a bunch of nothing. He is a filmmaking genius and you better check all of the iflms he had written and directed. The other one is Hu Bo. He is true and honest.<br><br>He is an ARTIST and he made a unique trumph for every person who walks on this world. It is beautiful and dark and sad and strange and complex and emotional and raw and honest and...<br><br>Thank you, Hu Bo.","user":"nikxatz","rank":[16,19]}]