[{"title":"Quite good","rating":6,"date":"11 November 2019","review":"This is one of the better straight forward horror movies of recent times. It is what it is and doesn't pretend to be anything else.<br><br>The story and production are solid and the acting superb.<br><br>Well worth watching if you are a horror fan.","user":"mjsreg","rank":[9,10]},{"title":"Most definitely above the curve","rating":8,"date":"24 November 2019","review":"You have to give this one points for originality. I think with a slightly larger budget this could have been a 10 out of 10 but damn it didnt stop me from enjoying this movie. Acting was outstanding and the story that pacing was perfect. There's a million possession films that have been done to death but this breathes some new life in a way that I havent seen since Emily Rose. I will definitely be recommending this one to other horror enthusiasts. God damn you gotta give a round of applause to the director and cast. I was really worried this one was gonna get real campy and the cliches would start rolling but once it gets going it doesn't let go of you.","user":"sicbassman","rank":[9,11]},{"title":"A great movie with an amazing ending! Highly recommended!","rating":9,"date":"11 November 2019","review":"This movie was a complete and total surprise. While the trailer was pretty well done and set the scene for the entire film, the end product was so well done, I really am shocked to see movies like this relegated to streaming. Everything from the direction to the acting was top notch, but it was the special effects took the stage and really brought this movie to the next level. Using a mix of CGI and practical effects, the film really does an amazing job of creating an effective and well realized universe.<br><br>I haven't been entertained by a possession film in years. This is the first one in a long time that was so expertly executed, that it deserves to reach as wide and audience as possible. If you enjoy well done films that are visually striking, then this is the movie for you! Plus, the ending is one of the best endings I have seen in a Western film in a long time. Truly masterful work, everyone involved should be commended on doing an amazing job!<br><br>A truly entertaining and well made film in every respect. It deserves high praise and any horror fan should give it a watch.","user":"manuelasaez","rank":[10,13]}]