[{"title":"If at first you don't succeed","rating":7,"date":"3 July 2019","review":"I had the privilege of seeing this in Edinburgh at a small screening, film was introduced by the main star and director.\nThis is clearly a labour of love and small budget dealing with The Bruce on the run and giving up on himself. Being hunted by other Scots who are after some coin, he has to hide out through winter.\nFilmed mostly in Montana with a bit of Scotland at the end, seems a bit of a shame but this sort of thing happens a lot.\nThe film itself is a slow burner and a bit of a come down on the back Brave Heart, this is a beaten King giving up and hiding out, wounded he is taken in by a family who've lost their Husband/father to the battles with the English army. Some mixed feelings towards him but they come to terms in the end he is a good King and wants what's best for Scotland.<br><br>Bits of the film reminded me of old westerns like High Noon or 3:10 to Yuma, there's a showdown coming and the odds are against you but you have to fight regardless. It was good to see Angus back in the role of Bruce seems fitting and if they ever do a Bannockburn movie I'd want him back in the role.","user":"semaj1968","rank":[14,19]},{"title":"So disappointing","rating":2,"date":"14 August 2019","review":"Given the title of the film and how interesting the subject is, I was so disappointed that the film chose this story line - it is ..... boring!\nI looked at my watch several times during this film, as did others in the cinema.\nI wouldn't recommend it.","user":"Anothercarol","rank":[26,39]},{"title":"Phenomenal new Robert The Bruce Film","rating":9,"date":"30 June 2019","review":"A poignant portrayal of Bruce at his lowest ebb\nWe see the King as a vulnerable fragile endangered character with a price on his head\nThis is not the traditional portrayal of the warrior king in battle mode as we have seen in so many other films recounting Bruce's life\nInstead we are drawn into another side of Bruce's character as we see him portrayed as defeated &amp; broken after he has hit rock bottom &amp; all seems lost\nThe story gradually unfolds &amp; we watch how Bruce overcomes adversity and regains a strength &amp; renewed invigorated determination\nHigh quality of acting\nEspecially in the roles portrayed by the children","user":"sheilamckenzie","rank":[52,87]}]