[{"title":"Koreeda at the top of his game","rating":10,"date":"9 June 2018","review":"On the day I watched Shoplifters, the news in Japan was dominated by the story of a 5-year-old girl, beaten and starved by her parents, writing messages in her notebook begging for love. An eerily similar storyline is threaded through Shoplifters, but Koreeda's prescience is no accident - he engaged with similar stories in his 2004 film Nobody Knows. Family, in various degrees of warping, is the focus of Koreeda's opus.<br><br>Shoplifters concerns a three-generation family living on the fringes of society. Dad apprentices his son in the art of shoplifting, telling him things on a store shelf do not actually belong to anyone. He also tells the boy that only stupid kids have to go to school, which is why he doesn't. The older daughter performs in a seedy red-light peep show, and Mum works in a low-paid laundry job, searching pockets for any stuff she can pilfer. They live with granny, though any time a visitor comes they all have to hide themselves.<br><br>This warm but abnormal family is slowly revealed to be conjoined in ways we did not expect. The catalyst for this is Dad and son bringing home a neglected 5-year-old girl they come across abandoned on an apartment balcony on a freezing winter night. The girl comes home with them, and slots into the family, a pattern, we slowly realise, that has been repeated in the past. Granny was 'picked up,' and the son seems to have arrived by similar means. Their warmth and humanity is at odds with the illegality and disregard for social mores. Society judges such people, but by allowing us intimacy with them, Koreeda shows how society is also judged by them - and found wanting.<br><br>The slow revelation of the family's background, the naturalistic interactions, the judicious spacing of shocks and surprises, are all evidence of a master filmmaker in perfect sync with his material. The performances are sublime. Franky Lily and Kirin Kiki are Koreeda regulars and both are tonally perfect here. Koreeda shows that he still has a deft touch with child actors, first seen in Nobody Knows, a film that garnered a Cannes acting award for 12-year-old Yuya Yagira. Jyo Kairi has resonances of Yagira, both in his physical characteristics and his mannerisms. The maturity of his performance is stunning. Sakura Ando is outstanding as the mother-figure, made wise by bitter experience but also upbeat in her approach to life. Her threat to kill a minor character is chilling. One scene, where she performs straight to camera, answering a question on what her 'children' called her, rips your heart out.<br><br>There are many set pieces to enjoy here. A sharing of noodles on a humid summer day was one favourite; listening to, but not seeing, a firework display was another (what a metaphor for this family's peripheral status!). But the joy comes from the way the whole thing gels and shimmers, and provides steely insight on contemporary Japanese society, and the human condition. These are flawed individuals and Koreeda does not avert a critical gaze from their individual responsibility. The film explores big questions on living a good life and taking responsibility in an uncaring society. A simply stunning film.","user":"CountZero313","rank":[270,334]},{"title":"Subtle and nuanced","rating":4,"date":"4 August 2018","review":"For this stunning masterpiece Shoplifters, Hirokazu Koreeda should win the Academy Award for Best Director. It is unbelievable that the rather complicated characters and their relationships are depicted in just two hours. The approach is mild, understated, low-profile, subtle and nuanced. Much room, space and thought are left to the viewers. The direction is simply super smart. <br><br>The cinematography is extraordinary, with some surprising long shots, close-ups and beautiful shots from tight angles. The editing is speechless, connecting numerous scenes just seamlessly. Not a single minute is wasted, and the film is largely intense and arresting. Together with the brilliant performances from the ensemble cast, the result is a satisfying and deeply affecting drama on lower class in Japan.","user":"TheBigSick","rank":[142,198]},{"title":"Koreeda's empathy is displayed in the beauty of small moments","rating":9,"date":"8 October 2018","review":"The great Japanese director Hiorkazu Koreeda (\"The Third Murderer\") continues his exploration of the true meaning of family In Shoplifters (Manbiki kazoku), a quest he began in his award-winning 2013 film, \"Like Father, Like Son.\" Winner of the Palme d'Or award at the 2018 Cannes Film Festival and the first Japanese film to win the award since Shohei Imamura's \"The Eel\" in 1997, the film is focused on marginalized people existing on the fringes of Japanese society who barely eke out a living by engaging in activities that skirt the letter of the law. It is the story of flawed people who have patched together a working \"family\" of outcasts who believe that the impulse to survive and create a nurturing environment is more important than strict adherence to society's norms.<br><br>The film opens in a supermarket where Osamu Shibata (Lily Franky, \"After the Storm\"), a middle-aged, part-time construction worker, is seen exchanging strange hand signals with a pre-teenage boy, Shota (Jyo Kairi), who seems to regard what is going on as a family outing. It quickly becomes apparent that this is no ordinary family shopping spree but an exercise in shoplifting, as we watch Shota casually throw items from the shelves into his shopping bag when no one is looking. Justifying their flouting of the law, Osamu says that if the goods are in the store, it means that they do not belong to anyone, and tells Shota that they are stealing the items only as a means of helping the family.<br><br>Much later when questioned about stealing by the authorities, sadly he says that shoplifting was the only skill he had to teach the boy. Osamu, as it is gradually revealed, is the head of a household consisting of husband (Franky) and wife Noboyu (Sakura Andô, \"Destiny: The Tale of Kamakura\"), teenage daughter Aki (Mayu Matsuoka, \"Tremble All You Want\"), her younger brother Shota (Kairi), and grandma Hatsue (the late Kirin Kiki, \"I Wish\"), all living in a small, cluttered apartment outside of Tokyo, scattered toys and knick-knacks everywhere, barely providing the family with enough room to eat and sleep.<br><br>The family, as it turns out, is one in name only, consisting of those who have been \"picked up along the way,\" and brought together as a means of mutual support. We discover that it is not only Osamu and Shota that are engaged in dubious activity but the others as well. Noboyu works as an attendant in a laundry and pockets things people leave in their pockets. Aki contributes by working in a porn shop, performing sex acts for men who are hidden from her view, while grandma is a conniver who plays the pachinko slot machines, claims her deceased husband's pension, and collects money from his son from another marriage.<br><br>The family's lives change drastically when Osamu and Shota find Yuri (Miyu Sasaki), a shivering little girl of four or five alone in the streets, seemingly abandoned. With her protection in mind, Osamu, who renames her Rin, brings the little girl home and discovers bruises on her arms that indicate she has been physically abused. Later, they see a news story on television about a child who is missing and how authorities are conducting an extensive search for her. Justifying their decision to hide the girl from the authorities, Osamu tells the others that it is not kidnapping unless you ask for ransom.<br><br>Osamu claims that they fear for her safety if she is returned to an abusive situation, yet he is not above using her as a decoy in markets as he and Shota engage in shoplifting. Through it all, Koreeda does not stand in judgment of his characters but simply observes the trajectory of their life in the tradition of Ozu and Naruse. When he moves into darker territory in the film's last section, its main focus remains on the humanity of the characters. When Nobuyo disposes of an item that is a painful reminder for Yuri about the family that abused her, she gives her a big hug, explaining that when people love each other, they give them hugs and do not hit them. In an exquisite moment, Yuri places her hand on Nobuyo's face who lets it remain there for a few minutes.<br><br>While Shoplifters contains elements that are painful to watch, what we take with us is Koreeda's empathy displayed in the beauty of small moments: The joy of trips to the beach, the sexual intimacy between partners that has been long repressed, and the expression on the faces of young children aware, perhaps for the first time, that they are loved.","user":"howard.schumann","rank":[106,164]}]