[{"title":"People Who Judge Based On The 10/10 Ratings Should Actually Watch The Movie.","rating":6,"date":"16 November 2019","review":"6/10 Definitely worth your time!! This movie has a great story with great actors and will keep your interest. I love the small town setting with the woodsy mountainous back drops. The cinematography definitely shines in this area. It took me back to when I used to visit my grandparents. One major critique though. The opening scene where \"Jack\" walks into the retail store and is forced to trade his jacket for a phone charger from the over the top \"I don't give a crap millennial\" character, made absolutely no since and almost forced me to ditch right then and there, but I'm glad I didn't. The stunningly beautiful and talented actress Claudia Doumit who played the part of \"Tina\", I believe, was completely miscast. The throwback 90's grunge toboggan wearing \"Clerks\" type character just didn't fit in any way. Sorry :(...","user":"bob_james9397","rank":[4,5]},{"title":"wow","rating":8,"date":"19 November 2019","review":"Thoroughly enjoyed the film...loved the characters and the location. It portrayed a deeply mysterious story line which drew you in and made you deeply care for each character. Cudos to each actor especially Zoe Kanters. Thank you for such a wonderful film!","user":"emjg-24157","rank":[4,6]},{"title":"Does it have a raison d'etre ??","rating":3,"date":"15 November 2019","review":"The 10/10 ratings are rather suspicious. The cast and crew presumably had fun making the movie and it's technically sound. The lead players (Zoe Canters and Daniel Weingarten) have some comic ability, but the other actors are very uneven. Canters and the Director push the \" quirkiness \" of her role to the extreme. The story involves an awkward romance which culminates in some surprise outcomes. There's a bit of local color involving small town characters, but they don't get much of a look-in. Whether there is a raison d'etre for the movie depends on personal taste.","user":"biljao258","rank":[5,9]}]