[{"title":"Disgraceful","rating":2,"date":"15 December 2019","review":"I need to complain. Film makers need to learn this lesson once and for all. Making a really sad story is not the same thing as making a great story. This happens every year. A film comes out which is mediocre at best, but, the content is tragic enough that it gets showered with awards anyway. It could be a film about the Holocaust or slavery. That seems to be all you really need to do. Choose a dark topic and show lots of terrible things happening for two hours until the movie just sort of ends. This is not a good movie. It is actually the worst I have seen in years. Alt Right is in fashion right now. So they just created the most pathetic character they possibly could and occasionally made him say a few buzzwords like cuck or red pill. I won't give spoilers, but, you can basically figure out the entire plot from watching the trailer. I really resent anyone who thinks this is at all clever. This was extremely lazy story telling. It has no depth or substance. It is just empty trash. There is nothing to learn or think about. I can't really continue this review without getting angry. This is a terrible movie. If you want to watch it then that is on you. If you are looking for something similar that is actually good then watch American History X or The Believer.  May god have mercy on their souls.","user":"dougmacdonaldburr","rank":[41,51]},{"title":"Not funny, not witty, not profound in it's observations, and kind of petty.","rating":3,"date":"7 October 2019","review":"Whoever said this movie was funny has a twisted sense of humor because this is one of the more depressing movies of 2019 I've seen. I enjoy dark comedies and would have preferred Cuck to be that, it is not.<br><br>\nI don't feel like this movie is as profound as it leads itself to believe as it was most likely written through the lens of someone who is an outsider to many of the ideologies they are trying to portray. Sometimes it comes off as petty with how bad the movie wants you to react to Ronnie's character and certain scenes feel more convenient to the narrative the film is trying to spin as opposed to plausible (a date Ronnie has in the film and a scene were Ronnie is washing a parking lot come to mind.)<br><br>\nThat being said, this movie isn't completely terrible; the cinematography, performances, and soundtrack are all satisfactory. However, once you scratch beneath the surface this movie feels empty and it's themes are there for shock purposes. The formula of Cuck is very similar to films like Taxi Driver or Falling Down except with the obvious political twist, which they milk hard. I feel like the intention of this movie is to further divide people instead of trying to create civil discussion.","user":"Arthurrs_Curse","rank":[109,159]},{"title":"A \"propaganda\" film that tries to show \"reality\", and yet fails at even being that in the first place","rating":1,"date":"8 October 2019","review":"What can i say? I fear the director watched Taxi Driver and tried to create a new version of it while keeping with the current world themes, but the sheer lack of competence and pure stupidity makes this one of the most painful movie experiences i've ever had.<br><br>The cinematography was amateurish and confusing at times, the score was... well, i can't even remember the score just to also show how forgetable it is, the plot is a pathetic attemp at creating a caricature of an \"Right White Extremist male\" that fails to draw even a drop of sympathy for the viewer and fails to show any facet of reality because he is, well, a caricature, and that's without even mentioning the cringy, horrible dialogue that seems to have been written by a 14 year old. All and all, the movie fails at even being \"So bad it's Good\". Avoid at all costs and go watch Taxi Driver or The Ruling Class instead.","user":"lalapolpolpol","rank":[83,129]}]