[{"title":"Rabbit or Duck? Ending Explained.","rating":10,"date":"22 December 2018","review":"Many have reviewed Andhadhun and rated it highly and I am no different. I found it pretty damn entertaining myself. Following is just a review of the ending and how enriching that experience was for me as an audience. Hope you all like it.<br><br>Watched Adhadhun again today. I never made a post about its ending the first time because I liked the Director's version of the open ending and leaving it up to the audience's interpretation.<br><br>However, when I watched it again today, I realized that the film does not have any open ending if you carefully observe it.<br><br>Before I go into the meaning of the ending we have to understand the phenomena of Rabbit or Duck illusion. Google \"Rabbit or duck\" for the image and the reference for rest of my review.<br><br>For decades now, the Rabbit or Duck illusion has been presented as a test for level of creativity. What you notice in the image determines what part in your brain is more active. A lot of people look at Duck only, Some people see Rabbit only and some see both.<br><br>Of course you can see both if you know that it's an illusion and you pay way too much attention to it and if you try to look for it.<br><br>However, the real trick is (and this is the next level - not part of the original illusion but something that Raghavan has done here), that what if there is no illusion? But being used to the concept of illusion, we are forced to look for both Rabbit and the Duck.<br><br>Andhadhun - There is no duck. It's only a rabbit.<br><br>In the last scene of the movie, the waitress from the Restaurant comes outside and gives Ayushman his cane back. This Cane has a Rabbit at its handle (Raghavan starts his Rabbit/Duck illusion here)<br><br>The movie begins with Ayushman's voice telling Radhika - \"bahut lambi kahaani hai....Coffee? - It's a very long story...Coffee?\" (This line is repeated towards the end and that's how the audience know, that Ayushman is telling the story of his life to Radhika)<br><br>But interestingly, the story telling takes a pause right towards the climax (when Ayushman and Doctor in the story are driving off)...the scene cuts to London and Radhika says - \"Aur phir? (and then?)\"<br><br>This is sort of the writer's way of writing an Epilogue solely to \"create the illusion of creating an illusion\". In the Epilogue story, where Ayushman tells the story of Tabu's accident and how the rabbit jumped and caused the accident - there are only 2 souls that can know about the Rabbit. 1- Tabu (who was distracted) and 2- Rabbit (because it caused the distraction)...Even Ayushman won't know because he was blind. So very clearly, Raghavan tells you that Ayushman is simply bluffing in this final piece.<br><br>Now some may say that the shooter also saw the rabbit and he could have come and told Ayushmaan (blah, blah) - but I am basing my explanation on what is shown. Not on, what is not shown and is pure conjecture.<br><br>Here is one more thing - Tabu dying would have been a bigger piece of Info which Radhika would already be aware of since the case was such a high profile one, but she seems to get all this info first hand from Ayushman, completely oblivious of Tabu's whereabouts until that moment.<br><br>So Raghavan very cleverly tells the truth, but by that time- we the audience are so trapped in this brilliant tale of our hearts wanting to continue in the suspense, that we want to believe there is an illusion for sure.<br><br>Raghavan even more clearly tells it very loud and clear that there is no illusion- by having Ayushman's cane with a Rabbit(or duck) handle, clearly saying- that Ayushman is selling the illusion because he has no way of validating the presence of Rabbit but he is telling that in his story.<br><br>It is absolutely a delightful way of gripping your audience by having them look for things that they invent as they go.<br><br>Adhadhundh (the original word not the movie title - notice the spelling difference) - basically means, something that happens extremely fast and recklessly without any validation or thought - Exactly what the ending is.<br><br>Fantastic!","user":"suprabh","rank":[288,324]},{"title":"Pure Brilliance","rating":10,"date":"5 October 2018","review":"Just do yourself a favour and watch it, it's unmissable. Just let it hit you raw, won't say a thing about the movie, it's best if you don't know much about it and just watch it and be blown away.","user":"xchintu","rank":[269,308]},{"title":"Like a Soap Opera Directed by Quentin Tarantino","rating":8,"date":"5 June 2019","review":"I'm honestly not even sure how to begin reviewing this movie. The best way I can describe it is a fantasy-mystery-black comedy-musical-adventure-epic. Does that sound like something absolutely ridiculously insane? Well it is. Andhadhun focuses on a *blind* pianist who *witnesses* a deadly crime and is forced to report it to authorities, and things go awry after several reveals/double crosses that lead to a third act so extravagantly convoluted that it's actually quite awesome. Am I being vague enough for you? This is like a soap opera, in the vein of Pulp Fiction, with a dash of La La Land &amp; Seven Pounds, inspired by Fargo, and directed by Quentin Tarantino. If that doesn't sell you then I don't know what will. Seriously, just watch it.<br><br>8.7/10","user":"ThomasDrufke","rank":[24,25]}]