[{"title":"It's Good","rating":8,"date":"2 September 2018","review":"I happen to know all of what's in the movie because 1) I'm retired and retired farts like me have time to read. 2) I lived in Manhattan for 20 years &amp; am well acquainted with who and what Donald Trump is. 3) I studied Russian in college in NYC in the 1990s and know the type of people who poured into Brooklyn thanks to glasnost &amp; perestroika. When it comes to this topic, it's kind of right up my alley.<br><br>But most people don't know the real Donald Trump or have the time to do all the reading I've done . They've got jobs, young kids, car trouble, bills, a million things to deal with. So I recommend they watch this film. It's fast moving and it's an overview. It doesn't bog down in minute details, which means it's not boring. It quickly &amp; easily explains money laundering (something the Trump Organization has pled guilty to in the past), so that's a relief because some people's eyes glaze over and think \"I don't want to have to take a class in finance.\" <br><br>So you've got an overview of what's going on and most people need that in order to be informed voters. The reason I gave it 8 and not 10 stars is because the closed captioning is crappy. Sometimes the film sounds fuzzy, so I needed captions but they blended into the background too many times to be effective. I also didn't like the music interfering with the story. It's a bit loud &amp; urgent sounding, and we can do without that. But in this film you will find out who the major players are and what has gone on for the last 30 or so years. <br><br>You don't have to listen to me - you can take Don Trump Jr's word for it. In 2008 he said, \"\"Russians make up a pretty disproportionate cross section of a lot of our assets. We see a lot of money pouring in from Russia.\" Or take the word of Erik Trump who said in 2014 \"We don't rely on American banks. We have all the funding we need out of Russia .\" Meanwhile their father says, \"I have nothing to do with Russia.\" Reallly? He'd better talk to his sons, because they've been withholding vital info from him for years, lol.","user":"bthwaithe","rank":[274,353]},{"title":"Great and important movie","rating":10,"date":"3 September 2018","review":"I've known bits and pieces of the Russia / brexit / trump story, but never been able to connect all the dots. They took a very complicated story and told it in a clear and meaningful way. Well researched and th interviews were amazing. Everyone should watch!","user":"llwilliams-94921","rank":[210,290]},{"title":"Must see movie","rating":10,"date":"3 September 2018","review":"All citizens of the US and the world need to see this documentary.","user":"kgbeasley","rank":[174,248]}]