[{"title":"A unique story with great fight scenes","rating":8,"date":"15 February 2019","review":"I really didn't expect much when I started watching the movie but I was pleasantly surprised. The action scenes really pack a punch and I haven't seen that kind of choreography in a long time. You get to see everything that's going on and they don't feel jarring or disorienting. There were a couple fight scenes in there that reminded me of movies like The Raid or Undisputed 2. The music in those scenes is awesome too.<br><br>I liked the characters, especially the lead and the angel, and the story has a surprising depth to it. It's got a unique concept going for it and I wanted to see more of this world.<br><br>The visual effects look very real too. But like the story, I wish there were more of them.<br><br>There's a couple scenes that just look plain empty, and the set design is really inconsistent. But considering that the movie had such a low budget, these were probably business related choices and not necessarily artistic ones.<br><br>All in all, I found the movie entertaining and I hope they get a chance to expand this world with a sequel.","user":"Famas_GunSlinger","rank":[86,107]},{"title":"New cult classic?","rating":10,"date":"10 February 2019","review":"Imagine Jean-Claude Van Damme in the movie Constantine. It's got mystery, magic, action, angels, demons, guns and badass spin kicks. Fight scenes are great and there's a couple beautiful women in there as well. What else do you really need to make 2019s new cult classic?","user":"blaketravis-36567","rank":[106,141]},{"title":"If you love SuperHeros, ComicCon, and Fighting","rating":10,"date":"10 February 2019","review":"Let me start off by saying that I'm a huge comic book fan. Ok, with that being said. This could be an amazing comic book. The possibilities that the world created in Soul Hunters are endless. Yes, low budget feel, but the acting and screen presence of the actors were top notch quality. Not to mention the fight scenes were some of the coolest I have seen in a long time and they were not over done like you see in today's big box office action sequences. Soul Hunters kept it short and sweet but packs a punch. I was rooting for Marcus every inch of the way. And lead Actor Zach Scheerer is to die for. Mark my words, that man will be going places. He sucked me into the screen in every scene. As did Eli, wow. Every time they were on screen I could feel the energy and wanted them to start scrapping. And with the ending I am certain this world that was created will be coming back with vengeance and hopefully a theatrical big box office potential. Way to go Acevedo-Smith Brothers! I am excited for more.","user":"TDCAA","rank":[95,126]}]