[{"title":"Great eye opener, even working in the medical field!","rating":10,"date":"29 July 2018","review":"I have been a Registered Nurse for over 18 years, and I agree this is a HUGE problem we are facing! I will also say (as a medical professional), that until this film, I was not aware there were \"loopholes\" allowing medical devices to piggyback off of studies that frankly do not apply, and even those studies that were completed lacking in actual data. We are trained that medications and devices go through stringent testing to be considered \"safe\", and sadly that appears to no longer be the case. \n I will be encouraging everyone I know to watch this film, but wholeheartedly agree with the \"safety warnings\" at the end of the film:<br><br>Know what is being placed in your body, and how long it's been available on the market\nAsk for second or even third opinions\nAsk your surgeon how many times they've performed the specific operation you're undergoing, and \nHave a family member or friend act as your advocate while incapacitated by surgery.","user":"hkbateman228","rank":[28,30]},{"title":"When Capitalism Meets Medicine Watchdogs become Lapdogs","rating":9,"date":"27 July 2018","review":"Sit back and prepare to be angry. The government has gone and done what we told those no good, pencil pushing, paper shuffling bureaucrats to do. That's right. They've cut costs, regulations, and in some cases even federal jobs. Say it's not so! Oh, but it is so. For 35 years I've had a ringside seat to the privatization of government. I've watched and may have even participated in this devolution of regulation and contracting out not only Federal jobs but actual Federal responsibilities. The Bleeding Edge is the story of the chickens coming home to roost.<br><br>When I see the well dressed, cleancut, all American Scott Whitaker, CEO Advanced Medical Technology Association sing the praises of the FDA's newly crowned Commissioner, Scott Gottlieb and refer to the FDA's regulatory function as \"robust, thorough, and very effective.\" I actually see an extremely overpaid and overfunded lobbyist claiming victory over his natural foe: The FDA Regulator. This once feared and vigilant patient advocating watchdog is now no more than an industry lap dog.\nMy mind's eye immediately serves up images of Ajit pai drinking out of his freakishly oversized Reese's Peanut Butter Cup Coffee Mug as he gleefully announces the end of the Internet consumer protection; a.k.a net neutrality Title II Utility regulations , December 14, 2017.\nI suppose the big difference is that Mr. Pai's subservience to the all mighty dollar will likely only kill new innovation from internet startup competitors. That's not the case with Whitaker and Gottlieb. It can be argued that their dollar driven, regulation slashing mission actually ensures medical device innovation. That innovation comes at a cost but hey, what's a little pain, suffering and death against a 300 billion dollar industry?<br><br>This 100 minute documentary packs each one of 'em with well produced and well edited dense content that is sure to hold your interest. So sit back on that sofa and prepare to not only get a little mad, but a lot informed.<br><br>Rated NH (No Hypochondriacs)","user":"jonfolz-588-691082","rank":[35,42]},{"title":"Concern About the FDA and the Medical Industry","rating":9,"date":"27 July 2018","review":"If this documentary doesn't cause concern about the FDA and the medical industry, then nothing will.","user":"rdg45","rank":[28,33]}]