[{"title":"A mesmerizing plot aided with top notch acting.","rating":7,"date":"28 June 2019","review":"A narcotics officer Kim is contacted by a convicted murderer Kang from prison n confesses murdering six other people. He claims that the homicide officers fabricated evidence against him to have him imprisoned. Kim agrees to find the real evidence in exchange for information on the remaining six bodies. Kim uncovers the actual evidence with Kang's information, proving the homicide detectives fabricated his case. As a result Kang's sentence is reduced.\nKim's mentor advises Kim to stop pursuing Kang's case since the murderer is trying to make himself appear innocent in other crimes to overturn the sentencing for the crime he is serving time for at present.<br><br>Fellas looking for a fast paced thriller will be disappointed as this film is more like an investigative drama aided by top notch acting n direction. Some may find the climax very convenient but the entire plot is very mesmerizing. Fans of David Fincher's Zodiac will definitely enjoy this.","user":"Fella_shibby","rank":[29,29]},{"title":"Nostalgic Detective & Killers Movies from South Korea","rating":7,"date":"26 November 2018","review":"Claimed as a film based on a true story about a detective who investigates the case of a killer in the city of Busan, South Korea.<br><br>Without further ado, from the start the film immediately directs us to a series of murder cases that have been committed by the killer based on his confession to the detective. Cunningly, the killer tried to play with the detective with confusing statements. Until a bright spot where his actions can be proven by the police and increase the weight of the murderer's punishment.<br><br>Typical of South Korean films where police and killers are always in touch. Even though we rarely find iconic films like Memories of Murder (2003) and The Chaser (2008), but 'Dark Figure of Crime' can provide an interesting spectacle. Moreover, the film stars South Korean veteran Kim Yoon-seok (The Chaser, The Yellow Sea, Hwayi: The Monster Boy, Fog Sea and other famous titles) with the opposite of a rising actor Ju Ji-hoon.","user":"bertanyariviu","rank":[6,7]},{"title":"Great Korean crime movie","rating":10,"date":"6 January 2019","review":"Without camshaken fighting and fast chasing scene, Dark Figure of Crime did more than enough to keep me on the edge.","user":"altairlegend","rank":[6,8]}]