[{"title":"Why Do Folks Hate On Lifetime Movies So Much?","rating":7,"date":"26 May 2019","review":"A mother and teenage daughter move to a small town where the mother has landed a position as an assistant principal for the local high school. When the daughter makes the basketball team and sets out to spend an evening with the team members, she never returns home.<br><br>This is a Lifetime flick and while a lot of folks hate on these films, I actually like them and appreciate that a lot of them are based on actual events like this one. It isn't a hollywood masterpiece but I thought it was a decent film.<br><br>Can I just say this? It is amazing that some people lack empathy. It is also amazing that kids who are raised by these folks can struggle with their sense of morality, yet find the courage to do what is right. Even if it takes a while for them to do it, considering who is raising them and the fact that they are still merely children, they deserve some credit for developing more integrity than their parents.<br><br>This isn't an awful film and I enjoyed it for what it was.","user":"Foutainoflife","rank":[25,28]},{"title":"Top-notch Lifetime movie.","rating":8,"date":"14 April 2019","review":"\"Secrets in a Small Town\" is a solid movie by any standard. By Lifetime movie standards, it's excellent. That's not a knock on Lifetime movies. I watch them all the time but you know what I mean. This movie was suspenseful and heartbreaking at the same time. Kate Drummond gives an excellent performance. The rest of the cast is good as well. The only demerit I give this movie is that it uses the old \"true story\" thing. I'm not so sure it is. But that doesn't really matter, \"Secrets in a Small Town\" is a very good watch.","user":"pmtelefon","rank":[29,36]},{"title":"perfect and realistic beginning, bad usual ending","rating":8,"date":"19 April 2019","review":"This is one of those movies where ending is so typical in form of shooting, killing, arrest, and twist. Also explanation and details are not enough clear and not well explained and not realistic. Explanation is one of those happened first, explained later with holes in the story. But beginning is perfect. We can see very realistic life, behaviors, talk, meetings, and emotions. In fact, this is one of the best and most honest beginnings in all the lifetimes movies I've seen. Only beginning keeps you motivated to watch the whole movie. But everything else is so low quality and usual and boring. Not complete and not good enough. Acting of victim was also too fake and not explained. Unrealistic.","user":"asocialis","rank":[14,21]}]