[{"title":"Beautifully done","rating":9,"date":"23 August 2018","review":"One of my acquaintance told me that the second movie is not as good as the first one. I.. disagree.\nIt was heavy, yes. the story was great, a bit predictable but great. \nthe first movie was like a fresh new idea for this kind of genre, but the second movie was like.. WOW\nIf you love the first movie, you'll absolutely wanna watch the second one. \nBecause this movie is the reason, the whole background story for the first movie.\nyou wanna know how it happened, why and who is who.\nthe 'who is who' part was a bit shocking for me :D \nwow.. it's been 2 hours since I watched the movie, I still have this.. heavy feeling. \ncan't describe how much I love and adore the movies, and how great the story was. It's a must watch.\n*I knew it all along.. Yeomra*","user":"snsh-69473","rank":[15,21]},{"title":"epic sequel to epic korean blockbuster!","rating":9,"date":"15 August 2018","review":"#AlongWithTheGodsTheLast49Days it's much much more than we imagine or predict on this epic sequel, the story developed into something 'bigger' and you'll love the sequel more if you love the first one 9/10 #alongwiththegods2 #alongwiththegods #koreanmovie #movie #Dtkreview #moviereview","user":"davidthekira","rank":[15,24]},{"title":"Captain Ganglim and his crew have one more soul to reincarnate before achieving their reincarnation","rating":8,"date":"27 August 2018","review":"A wonderful follow up to its predecessor, the movie picks up directly after the first. While I was doubtful on how they could make the story as compelling as the first one, this sequel delivers by focusing on the backstories of Ganglim and his crew. It also slowly builds around the previous story without retreading on the old plot. Furthermore, it also provides closure to the first part by seeing the aftermath of the events of the first movie. In fact, there are three layers of stories, the conclusion of the first part, Ganglim and his crew's backstories, and a new mission for the team while Ganglim is occupied. Jung-woo Ha returns as Ganglim and is every relatable while maintain a charismatic performance. Ji-Hoon Ju's character is given another side the audience has not seen, while the ever-likable Hyang-gi Kim's still shines. Dong Soek Ma's portrayal as the benevolent kitchen god is an great addition to the series, and his talent is not wasted. Plot-wise there are many twists and though some could be predicted, others are not. There are great after credit scenes too, and something that looks like the starting of a franchise. But the storytelling is still good, and most of the protagonists get to shine.","user":"pal05052003","rank":[9,14]}]