[{"title":"Authentic depiction of Tokyo in the late 80's","rating":7,"date":"19 November 2019","review":"First of all, as a 50 something Japanese who experienced what is was like living in Tokyo back in the late 80's, I was really surprised the authenticity of the depiction of the period. They recreated the era so perfectly, it was easy for me to get into the story and take them seriously. That's not always happens when hollywood pictures try to portay my country. Good start.<br><br>And yes, as other reviewers points out, the story goes very slow, and they reveal the bare bones much much later, so sometimes it's a little difficult to follow and understand what's happening. But we will come to know the loneliness and anxiety of this caucasian woman from Sweden who lives in Tokyo bit by bit, and what happened to her life in the past, our patience will be nicely rewarded. This film is like a kind of psycological charachter study which disguises as a murder mystery. Maybe not for everyone's taste but I'm sure some people may find it interesting and fascinating.<br><br>Alicia Vikander's performance is wonderful as always and she speaks Japanese language maybe not so perfectly but beautifully. Naoki Kobayashi also did a fine job considering his low experiences as an actor which I'm looking forward more to come.<br><br>And nice surprise was a brief appearance of Yoshiko Sakuma who was one of the most popular beauty queens from the golden age of Japanese cinema and also one of the two divas (the other was Junko Fuji) of Toei Studio in the 60's.","user":"nakachan","rank":[107,111]},{"title":"Engrossing, but you need to concentrate to stay with it.","rating":7,"date":"17 November 2019","review":"Earthquake Bird is a very different film, it's not exactly what I was expecting having seen a trailer, but I enjoyed it. You will question events and reality as you watch Lucy plunged into a series of bizarre events, as you watch you'll ask if events were real, and if those around her did indeed exist. Alicia Vikander is absolutely terrific in the lead, so convincing. Naoki Kobayashi and Riley Keough also impress in supporting roles. The first forty minutes or so were a bit of a challenge, it took a long time to open up, but when it does it becomes a very absorbing watch. The pace won't suit everyone, some may find it a little slow, but I enjoy this type of psychological thriller.<br><br>A thumbs up from me, just stick with it, it's worth it.","user":"Sleepin_Dragon","rank":[86,92]},{"title":"Unusual and captivating","rating":8,"date":"16 November 2019","review":"Unusual and captivating movie, very original. I slowly immersed myself in the atmosphere and really enjoyed it.","user":"carmelie-poulaine","rank":[75,88]}]