[{"title":"Ignore all the negative reviews...it's decent enough","rating":6,"date":"18 May 2019","review":"Maybe because I'm not a professional firefighter or maybe because when I watch dramas like this, I'm willing to suspend my expectations of 100% accuracy in exchange for entertainment, I enjoyed this movie. I enjoyed Donald Sutherland's portrayal of total creepiness. He nailed creepy, deranged old man. There were a few extraneous characters, like the girlfriend, but she was needed for one scene in particular (no spoilers from me!) Sean is a flawed person. It's his motivation. A few loose ends, like the connection between the Tuckers &amp; the bad guys, but no big deal. I didn't care enough to get all wound up about it. I probably won't watch it again, but it was okay for a one-off","user":"kimbpaul","rank":[21,25]},{"title":"Don't burn this film JUST yet...","rating":5,"date":"20 May 2019","review":"When \"Backdraft\" came out in 1991, massive success that it was, it wasn't particularly prime sequel material. And while it has stood up well over time, the demand has certainly not increased. Alas, here we are, 28 years later and we have been given a sequel, \"Backdraft II\".<br><br>This sequel was made with less money, less talent, less care, less quality, and as a result- the product is inferior in virtually every way. What else would one expect from a straight-to-DVD movie? But don't let the dismal shortcomings to the original turn you off completely. Take away the shadow of it's big brother and judge it by itself- we have a halfway decent film that is not without it's bright spots.<br><br>Taking place in the present day, we follow a now grownup Sean McCaffrey, (Kurt Russell's son from the original, played by future star Joe Anderson) who is now an arson investigator in the Chicago Fire Department (Canada subbing for Chi Town this time.) Anderson's performance is the highlight of the film, he plays Sean like a prototypical street detective. Massive chip on his shoulder, goes by his own rules, and is an ace sleuth. His character is given some subtlety and depth (mostly due to his interactions with a stray dog) but Anderson really gives it his best (dodgy accent aside) and it shows even with an uneven script- penned by Greg Widen, who also wrote the script for the original film.<br><br>The original is not an evenly written piece either, but this screenplay's weaknesses are more glaring. The plot revolves around the death of a group of kids, killed by a backdraft explosion while trick-or-treating. This shocking scene should make for a storyline that makes one eager to catch the culprit, but we're soon drawn into a somewhat complicated and rather pointless story involving defense contractors and espionage that feels out of place and more like an episode of \"24\".<br><br>Along the way we have a supporting cast consisting of an able partner (and underdeveloped character) Sean has forced upon him, played by Alisha Bailey, a rather forced love-interest played by Jessamine-Bliss Bell, and Sean's uncle Brian, which features the return of William Baldwin reprising his role from the original with about as much enthusiasm and vigor as a pine cone. Baldwin is no great actor and Brian was never a very interesting character to begin with, but this lifeless performance was one of the most disappointing things about this movie.<br><br>Not alone however was the dull Mr. Baldwin in his return, we are also treated to Donald Sutherland again as Ronald. Sutherland is still a consummate professional and treats this role with a little more fun and less of a sinister nature than he did in the original. He is a joy to behold in this film, hamming it up just enough for you to still take him seriously as this sort of Hannibal Lector of arson.<br><br>The real failing of this movie is it's very rushed, uneven pacing. For a runtime of 1 hour and 41 mins, it sometimes feels like they treated it as if it were 45 mins, with messy scenes featuring piles of exposition blurted out all at once, but the next we're given a slower moment of Sean in deep thought or dramatic build up towards action scenes with weak payoffs. I feel this falls on the director, Gonzalo Lopez-Gallego (known mostly for the abysmal found footage piece \"Apollo 18\") and harder still is it to believe that Ron Howard was an Executive Producer on this. Maybe he just got a check to put his name on it to attract fans of the original and went about his duties with the same enthusiasm as William Baldwin went about his...<br><br>I know this sounds pretty bad, but it almost feels like a backdoor pilot episode to a \"Backdraft\" series. It keeps your attention well enough and even has some very decent action and fire scenes that actually had me on edge a bit. I think this film gets judged too harshly by some. But, I think they did okay. Despite the uneven nature of the script, Greg Widen still achieves some good dialogue throughout and the actors who gave a damn really raise the quality of the film overall. I give 5/10. Good for killing 2 hours on Netflix. Enjoy or at least try to.","user":"jon_carlson-28953","rank":[12,16]},{"title":"not bad","rating":6,"date":"19 May 2019","review":"I enjoyed the movie didn't expect it to grab my attention cause im a vintage person i love the first backdraft it did creep me out a little to see how much william baldwin looks alot like alec these days lol....donald's character just as creepy as ever works thou and sean's past haunts him to a point but all around not terrible to watch i loved the references to the first one throughout ignore all the lame asses that cant grasp at what they filmed if you loved the first one give this on a try and ignore all the others and watch it for yourself!","user":"spnatural-85893","rank":[12,16]}]