[{"title":"Decent Microbudget Action/Thriller","rating":6,"date":"17 August 2018","review":"At a glance, HITMAN AGENCY looks to be a film that would've been found in the Cannon Group roster back in the 1980s with Michael Dudikoff, Reb Brown, or another Cannon young action staple in the younger, co-male lead and then probably Charles Bronson in the older male lead. Instead, the film plays more to Cannon's modern descendant Millenium Films; if HITMAN had more of a budget I could see the film being apart of Millenium's line of STV/VOD action/thriller films. <br><br>The film plays out with a mixture of modern time as Lucas (Aponte) interrogating Joseph (Hansen) who turns out to be one of the finest hitmen to walk the earth. Joseph worked for the titular agency Lucas works for now and the young buck has to try and find what incriminating evidence Joseph has on his former employer. We jump back in time to see when Joseph first became a hitman and his journey to the present. It becomes obvious there's some power struggle at the Agency and there's more going on than Lucas knows. <br><br>Comparing this film to a major studio production is ridiculous; looking at it on its terms HITMAN is entertaining and director Dominik Starck pulls as he can to dig as much drama and tension of limited resources he has. Looking past technical limitations; for me, microbudget films can make up in the acting department. Lead Aponte and Hansen are both very solid in their roles and service the material well; the pair has chemistry and I wish more of the film was these two men verbally sparring with each other. The other actors don't fare so well, on the whole many of them are stiff and don't feel fully real or relaxed in their scenes. <br><br>Probably the biggest name in the film, kickboxing legend Don \"The Dragon\" Wilson has a rather inexplicable cameo that never clicks with the rest of the plot. He shows up, says a few lines, gets to kick an 'assassin' before he gets another scene during the credits. His cameo feels very tacked on last minute or is a move at teasing a sequel. <br><br>The action, which is why I guarantee most rented this, is for the most part hand-to-hand with very, very limited gunplay. Aponte's opening fist-fight with a bodyguard gave me a bit of an eyeopener as director Starck doesn't succumb to rapid cuts and thrashing camera that numerous STV films do. Because of this, I was scratching my head if the actors were really kicking and punching each other in numerous shots or if they're that skilled at pulling punches/kicks. The rest of the action doesn't quite live up to the punch of the first fight, but this film is more interested in trying for thriller aspects and the psychology of violent people. <br><br>It's not a perfect film; but on the slate of VOD microbudget films, HITMAN AGENCY tries to be more than generic action. For a $4 rental, it's worthwhile for 87min.","user":"GoldenSimatar","rank":[4,7]},{"title":"Worst movie I ever seen in my life and not just saying it","rating":12,"date":"12 April 2020","review":"Three words bad, bad, and bad!!! Serious garbage and shouldn't been made. I hated everything about it.","user":"michaelvibes","rank":[0,0]},{"title":"Give it a watch if you have 90 mins spare","rating":3,"date":"2 September 2018","review":"A watchable independent film. The story is intruiging with a good twist","user":"razamallal","rank":[2,5]}]