[{"title":"Nope","rating":3,"date":"28 December 2019","review":"God this breaks my heart. What an awful movie and such a sad way of killing some of my favorite characters of the horror genre. This sequel says absolutely nothing. It is as unnecessary as it is stupid. Well, movies like Halloween, Child's Play and Friday the 13th have numerous unnecessary sequels so what's the difference? The firefly family are humans. Humans die. Specially after being shot 20 times. It was a fine ending to Devil's Rejects and should've been left alone. Well, for some unexplained reason they're back to do absolutely nothing. Zombie has no idea what to do with the characters or the story. He undid everything he accomplished in Devil's by stripping these amazing characters of their purpose and turning them into pointless, unimportant killing machines. I felt such a connection to them on Devil's and this time around I couldn't care less what happened to them, I just wanted this whole thing to be over.\nI'm glad Captain Spaulding wasn't on this film or else his essence would've been butchered as well. Oh, and Sheri Moon Zombie keeps getting worse. The woman can't act to save her life.","user":"alexaserra","rank":[36,40]},{"title":"Zombie really needs to start directing other people's scripts","rating":5,"date":"17 September 2019","review":"Zombie is a very talented person and I'm a extremely big horror buff but I can't say many good things about this movie.\nLet's start with the good.\nTheres a lot of Blood and profanity BUT no matter how much of that you toss into a movie it doesn't make it any better.\nThis is by far one of his worst movies ( and that's coming from someone who found enjoyment in 31 and lords of Salem )\nHere's the bad. The plot has little to no meat on it, the zoomed in angles makes it hard to enjoy the violence cause all you see at times is a cheekbone, then blood, palm, then blood and so on. The characters you want to see more of have little to no screen time, and everything is so exaggerated that you really have to suspend ALL DISBELIEF while watching.<br><br>Save your money and rent it in a couple of weeks cause yes......this is a straight to DVD kinda movie that stole people's money for a 3 day release.","user":"ramo701","rank":[118,154]},{"title":"Of course I wanted to love this movie...","rating":5,"date":"17 September 2019","review":"I guess you just can't go back and re-capture that magic and honesty of House of 1,000 Corpses and the superior The Devil's Rejects. I give kudos to Rob for giving it a go but this movie just plain fell flat. All the ingredients were there...Gore, blood, guts, filth, profanity, humor, revenge. I just was not able to get excited scared or involved with the film. It wasn't slow, it was just meh. Granted, I have never been a fan of Sheri Moon and I think she has taken every movie down a notch or two that Rob insists on including her in. Verily, her scenes are like some sort of music video with her prancing around all \"evil\" and cutesy in slow motion. She's clearly the centerpiece here and that's a shame because Bill Moseley is the king of horror and although he does his best with the material at hand, he can't salvage the script and the overall \"story\". New guy, Richard Brake the \"brother in law\" does a decent job filling the gap left by Sid Haig (who does have a brief appearance in the film), but it all feels very forced and lacks overall conviction. It's just \"meh\" and I really wanted it to be Rejects part 2.<br><br>I realize we aren't dissecting the works of Shakespeare here. It's a Rob Zombie horror film. Those that love everything he does, will love it. I personally think he got it right with House of 1,000 Corpses and The Devil's Rejects, but ever since then...he's been trying to recapture that glory and has failed to do so.","user":"continual-one","rank":[110,151]}]