[{"title":"Shia LaBeouf deserves an Oscar.","rating":9,"date":"7 February 2020","review":"He deserves an Oscar for writing it let alone for the acting. He truly is the most underrated actor out there now and the best of my generation. Noah Jupe is a tour de force. Lucas Hedges nails his portrayal of Shia LaBeouf.<br><br>D","user":"soldadodechristos","rank":[81,94]},{"title":"\"Honey Boy\" is powerful. A brave, bold portrayal of Shia Labeouf's real life trauma","rating":8,"date":"6 February 2019","review":"\"Honey Boy\" is an honest, intense, bold, and powerful look at actor Shia Labeouf's problems which developed because of his abusive father, who was also his manager. Although Shia has given the name Otis to the movie's central character, there are more than enough clues and hints (given by him also as the movie's storywriter) to confirm the fact that it is Shia's story that is being portrayed in \"Honey Boy\".<br><br>There is even a scene where the main character is seen by viewers on the sets of an action movie, a movie that clearly parallels the Transformers movie (s). In \"Honey Boy\", Shia himself plays the role of his own abusive father. Perhaps, bringing out his story in front of everyone will help him to fully heal, and move on and move ahead in his personal and professional life. Shia is definitely still very much capable of doing further memorable and brilliant roles as an actor. I hope all producers and directors realize this fact about him. Meanwhile, I encourage everyone to go and watch \"Honey Boy\" ; the reason is simple - it is a hard-hitting, realistic story and has powerful performances by Shia, Jupe, and all the other actors involved.","user":"svhot","rank":[111,142]},{"title":"Hit close to home","rating":10,"date":"9 February 2020","review":"Let me start by saying I am not an emotional person by any stretch. I dont think I have ever cried in front of my wife in the 15 years we have been together. This movie utterly destroyed me emotionally. I had to put up a blanket barrier between my head and my wife's as she slept for fear she would catch me sobbing like a little girl while watching this movie. This movie sucked me into a paradox of memories and emotions relating to the dynamic between me, my father, and my 3 children. It allowed me to put myself into the shoes of my children...and made me see very clearly for the first time in many years one thing. LOVE THOSE LITTLE ONES. HUG THEM, KISS THEM, LOOK THEM IN THE EYES AND TELL THEM HOW VERY MUCH YOU LOVE THEM. The years pass and before you know it, it's too late to make up for lost time. I wish I could thank Shaia for making this movie. It helped me more than any therapy session ever could.","user":"beckakins","rank":[53,69]}]