[{"title":"How was this shown at a multiplex?!","rating":1,"date":"18 September 2019","review":"Let's start with the positives: there was a very clear shot of the moon - a crisp, clear image, the score had musical instruments in it and the beards looked real. It's not very long.<br><br>Other than that....every thing about this was just plain bad. Awful. If an infinite number of monkeys etc could blah blah Shakespeare, one monkey with half a crayon and a piece of cardboard and a hangover would be embarrassed to have written this. And the director may not even have been an animal. A houseplant, perhaps? Each actor said their monkey-written lines in turn, then a pause, then the next actor says something daft. This wasn't even so bad it's quite funny. I can't say anymore because writing this is making me remember the film which is making me feel tired and cold inside.<br><br>If you're at home and looking for a way to pass some time and the choice is this or unblocking a septic tank with your bare hands, good luck and wear safety glasses...","user":"lordweffington","rank":[57,63]},{"title":"How did this make it beyond YouTube?","rating":1,"date":"20 September 2019","review":"Firstly, I have to confess that I got so fed up with this film that I left after 1hr, so if anything good happens beyond the 60min point then, dang it, I missed it!! But I based on what I DID see it's pretty unlikely.<br><br>The premise of a Werewolf in Roman Briton was very appealing. Indeed, the legend of the lycanthrope is referenced in Gaius Petronius Arbiter's 'Satyricon' written in AD60 - so there is even some historical relevance. But that's where the interesting stuff ends.<br><br>The acting is wooden, the costumes are too bright and shiny and the \"hey, my buddy just bought a drone, let's use that for every shot\" cinematography was a real drag. Sadly, it wasn't even bad enough to be charming. The only positive thing I can say is that some of the lighting was dramatic. As for everything else, Poorly executes families tropes from a bygone era.","user":"tobycross","rank":[31,34]},{"title":"I never walk out , but","rating":1,"date":"19 September 2019","review":"85 minites of this utter dross tested my patience! Zero acting, talking head script and special effects makeup that kids wouldn't use on their Halloween costumes. Avold in the cinema, dvd or the streaming platforms. Save the 85 mintites for something else - bathing the dog, cleaning the toilet , spending time with the in- laws, anything but wasting it on this dross.","user":"Tillbrooke","rank":[29,32]}]