[{"title":"Awesome movie!","rating":1,"date":"4 May 2018","review":"This is truly a awesome movie, the only things it misses before I rate it as a 10 is;\nA proper script.\nA casting crew that's not sleeping.\nA director that know what directing means.\nActors that can act.\nActually its faster to list whats good with the movie, not that I can think of anything at the moment.\nAfter watching the first movie I was sure its was impossible to make a follow up that could be worse, but I was wrong. If you liked the first you SHOULD watch this one too. But you should look for a cinema with \"Full satisfaction or get your money back!\" warranty, you will thank me later...","user":"SpecialWeirdo101","rank":[37,48]},{"title":"One loud word: CRAP!","rating":1,"date":"12 July 2018","review":"1 star rating for the sound effects, nice cover photo and clear picture. Nothing went well for this movie. From drab fight scenes, to incoherent time travel scene switches, to transitions, to (barely noticeable if you can finally find some) acting, this movie oozes crap. My eyes are definitely not going to forgive me for making them go through this ever again!!!","user":"acerslim","rank":[9,13]},{"title":"What in the actual f...","rating":1,"date":"6 May 2018","review":"How can something be THIS horrible... seriously.... the CGI looks like it was made before someone decided to get into CGI. the choreography and realism of fight-scenes are WORSE than a bar brawl in Real-Life. and the acting..what in the actual f... is this crew coming straight from a porn and trying to make a movie? please... stick to directing 30 seconds clips of \"deliveryguy walks up with pizza...cue music...get naked.. ACTION!\" ....and how in the world could the evil villain of Atlantis, who charms people with her beauty... be ugly AF! holy crap! even Snowwhite looks like a worn out ragdoll from a eighties porn.... these actors are not ugly per-say, they could be made beautiful... ever heard of MAKE-UP!","user":"megablah-91936","rank":[17,29]}]