[{"title":"Rim of the Toilet","rating":2,"date":"25 May 2019","review":"After reading reviews promising a throwback to 70s/80s Spielberg films I was eager to watch this movie with my family. We were very disappointed. I couldn't believe the inane dialogue, Not clever or funny. All of the characters were so over-the-top stereotyed based on their various ethnicities. None of the kids were likeable. Crudeness for crudeness sake (adult female camp counsler ordering 13 YO boy to \"stick it (his phone) in my box\"). The plot was so poorly formulated that it is still making my head hurt the morning after. No one is stupid enough to accept the leaps that had to be made to get these kids from Point A to Point B. Insulting the intelligence of the audience. Sad, lazy writing. Zero heart. Not even close to approaching the Spielberg classics or well done homages like \"Stranger Things\". Beyond disappointing.","user":"btmckeever-71537","rank":[442,556]},{"title":"Meah ,... just don't","rating":3,"date":"26 May 2019","review":"This was the longest adidas commercial I've seen so far...","user":"raduculus-68820","rank":[281,354]},{"title":"Kill It With Fire","rating":3,"date":"30 July 2019","review":"I decided to watch \"Rim of the World\" as I heard the writer on Kevin Smith's podcast recently and though he seemed like a lovely guy, with good ideas, I was really disappointed with the film.<br><br>Alex (Jack Gore) is an intelligent insular child suffering from bouts of anxiety since the death of this father. He's forced by his mother to attend summer camp, at \"The Rim of the World\" mountain range above Los Angeles. Though struggling to make friends, he's forced into a bond with three other children when an Alien invasion happens. With the location of the mothership in their possession, they must avoid perils both extra-terrestrial and human to deliver this information to the military.<br><br>You could forgive a lot, in this sort of film, if the child stars were charming or endearing, but unfortunately this is not the case. I'm not going to be too harsh on the actors themselves as the faults lie mostly in the way they are written. I'll use a word you're going to hear a lot in this review \"Cliché\". The characters, particularly Miya Chen as Zehn Zehn and Benjamin Flores Jnr as Dariush are pure cliché. She is stoic, largely mute and ever capable - he is wisecracking, cowardly, and oddly sexual, given that he's supposed to be 12. Away from the tropes that tonal issue is one that plagues the film, it should be a family friendly action adventure, but time and again the boundaries are pushed in terms of language and violence - the film has a 15 certificate in the UK. Thematically, it's too basic for adults, but content wise is too much for most younger children.<br><br>But it's the plot that really ruins the film. I feel like they were going for \"homage\" but in practice they just steal liberally from other films, there's a sequence lifted entirely from Jurassic Park. There's so much stolen, so many clichés that I was convinced that this was going to be part of the plot. I thought that the kids were going to be involved in some sort of virtual reality video game, maybe even some sort of way for Alex to deal with the trauma caused by the death of his father, hence the stolen plot and cliché characters would be justified by the lazy \"in film\" game writers. I thought my theory was further validated when his late father's car appeared out of nowhere. I don't suppose this is a spoiler, as it was just my theory, but none of this is the case.<br><br>I know that product placement offends some people, though usually I am pretty oblivious to it. However, the 5 minute Adidas advert that sits in the middle of the film is perhaps the most egregious example I've ever seen of it. Literally the film stops for an advert, and then starts again once they've pranced around in the clothes.<br><br>The film is both badly made and lacking in a target audience and even if you consider it a \"Netflix Freebie\" it's not worth your time investment.","user":"southdavid","rank":[14,15]}]