[{"title":"Anything but \"bland\"... \"Sandy should be here\"","rating":8,"date":"5 December 2018","review":"\"Say Her Name - The Life and Death of Sandra Bland\" (2018 release; 103 min.) is a documentary about the July, 2015 arrest and subsequent in-custody death in Waller Country, TX (near Houston) of Sandra \"Sandy\" Bland, a 28 yr. old African-American woman, for failing to signal a lane change (!). As the documentary opens, we are addressed by Sandy in one of her \"Sandy Speaks\" posted videos: \"It's hard to be black\", she exasperates. It's one of many videos she posts addressed to her fellow \"queens and kings\" dealing with racial issues including police brutality. We then go to the arrest and its aftermath. The police car's dashboard camera footage is as surreal as it is sickening. What should've been a routine matter (if one can call getting pulled over for \"failing to signal a lane change\" routine), quickly spirals out of control, to the point where Sandy is arrested and taken to jail, where 3 days later she is found dead, and it is ruled a suicide. But was it? At this point we are 10 min. into the documentary.<br><br>Couple of comments: this is the latest documentary from the Oscar-nominated (and husband and wife) team of Kate Davis and David Heilbroner. Here they look back at the suspect circumstances of Sandy Bland's arrest and subsequent death while in the Waller County Jail. Sandy Bland was anything but \"bland\": she was outspoken about racism and police brutality, and it all makes it even more remarkable to see what happened to her. It is perhaps difficult to distinguish between the events covered by the documentary, and the documentary itself: can the documentary deliver on all of the questions that it poses? The answer to that for me is, yes, mostly... It is clear that, had the arresting officer been given proper de-escalating training, none of this would have happened. Instead, we see a white armed male escalating tensions against a black unarmed woman, and then lying about what happened to justify the arrest, with a \"good ol' boys\" network in Waller County, TX quickly circling the wagons. The makers of this documentary do a fine job digging into the details, and allowing both sides to give their perspective. But honestly, the images speak for themselves. \"Sandy should be here\", sighs her mother, and she is absolutely right of course.<br><br>\"Say Her Name - The Life and Death of Sandra Bland\" is the latest to be released in HBO's documentary series. I continue to be impressed with the excellence of many of those HBO documentaries. If you have any interest in the racial divide that exists in this country, I'd readily suggest you check this out (it's now available at HBO on Demand, among other platforms), and draw your own conclusion.","user":"paul-allaer","rank":[29,41]},{"title":"This story is worth your time.","rating":10,"date":"7 December 2018","review":"I'd like to send my condolences to the family and friends of Sandra Bland. I pray the so called officer has been removed from his job and is locked up for the battery. And I pray that someone is being held responsible for Ms. Bland's life.","user":"am121165","rank":[20,29]},{"title":"Brilliant direction!","rating":10,"date":"3 August 2018","review":"Kate Davis and David Heilbroner allowed us to show this magnificent documentary at the DOC WEEK Film Festival at the Martha's Vineyard Film Center in August 2018.<br><br>Kate's direction brilliantly incorporates Sandra Bland's video messages, placing them purposefully as bookends for the entire 100-minute documentary as well as scattered within the narrative of the film. Beautifully paced and elegantly edited, Sandra's story is revealed as a combination of mystery and biography. <br><br>You'll be thinking about this one for a long time after. In the future, every time you see a protest about police brutality, wrongful death or racial tensions in America, you mind will come back to this one.","user":"ActOne","rank":[25,44]}]