[{"title":"You have to watch this movie... seriously... it is a masterpiece!","rating":10,"date":"9 December 2018","review":"Awesome movie! One of the all-time best Pokémon movies right next to Movie 19. They have truly changed things up in a good way. And this movie was a great example of what to do to make a good reboot Pokemon Movie. The previous Pokémon movie (I Choose You!) from last year was so disappointing. Rushed plot, unlikable characters, Team Rocket had no purpose of being in that movie at all, and it was extremely predictable and boring.<br><br>However, I cannot say the same for this amazing movie. I loved almost EVERYTHING about it.<br><br>Characters: My favorite characters have to be Lisa, Torren, and Margo. I don't want to describe every character cause it'll be too difficult for me to. But all I can really say, I think Margo was definitely the most interesting character imo. And every character in this movie had a fair share of screen time and got a fair amount of time to develop. The only complaint I had with this movie was that Lugia didn't get enough screen time and he (spoiler alert) showed up at the end of the movie. But I let that slide cause at least the main focus of the movie was actually shown on screen unlike (cough) Movie 20 I Choose You!<br><br>Animation: OLM, you guys are smart for hiring Wit Studio to animate this movie. This movie easily IMO has better animation than last years movie, and better animation than Sun &amp; Moon and even XYZ and that's saying something. The way Pikachu was moving on screen while they were trying to rescue Tyranitar and that battle with Zeroara. Everything just looked awesome! The colors... all of it was just awesome. Wit Studio, you guys are geniuses. What more could we want from the Attack on Titan animators?<br><br>Dubbing and Music: Okay, let me just say this. I am SO glad the English dub did NOT do another dub soundtrack for this movie. I was a bit disappointed with the dub music in Movie 17, 18, and 20. All the music was amazing and I didn't hear any boring and goofy sounding music during any of the scenes and all the scenes that were silent didn't even have dub music in them either. Zeroara's Theme has to be my favorite from this movie. I hope they do this for Movie 22 Mewtwo Strikes Back Evolution. I don't have an opinion on \"The Power of Us\" ending theme yet cause this review is based off me seeing it on Disney XD as they played the credits for 30 seconds over a black screen. Makes me regret not seeing this movie in the theaters even more. And I liked everyone's voices too. I liked Lisa, Torren, Callahan, Margo, etc. dub voices. All of theirs did a great job voicing their respective characters in the film. Also, if you guys see any 4Kids fanboys or sub etilists hating on the dub of this movie. Just IGNORE them! Okay? They're not worth your time. There are these trolls named Dwatch Says (aka dwatchren on this site) and The Common Sense Man on youtube who will complain about the dub and bash it no matter how much effort and love they put into it. This movie was the best English dubbed Pokémon movie in my opinion and nothing can change that. Heck, even the Japanese Director of this movie,Tetsuo Yajima HIMSELF said the English dub of this movie was pretty good. If you see \"dwatchren\" on this site writing a negative 1/10 review about the dub of this movie, just pay no attention to him.<br><br>Anyway, go see this movie! It is the best! Pretty much the best Pokémon movie we've ever had in a LONG time and that's saying something. You won't be disappointed, trust me.","user":"Matthew5000","rank":[11,13]},{"title":"Back to what it was","rating":8,"date":"1 December 2018","review":"After years of not so good Pokemon movies, this one is up there with how good the first few movies were, loved it, plus was great to see my favorite Pokemon Lugia on the big screen again. If you're a big Pokemon fan like me, you won't be disappointed.","user":"beyondj","rank":[13,16]},{"title":"New big step for Pokemon, in movies!","rating":9,"date":"27 December 2018","review":"Pokemon: The Power of Us - is second best Pokemon movie ever! Each main of character 6 have good writing and balance with screen time. Which Sun and Moon still don't do great with local characters, and even previous movie with 2 new characters. Of course there are some stamps, but all decided the better is one thing - feeding. This movie re creat formula for Pokemon movies, and raises on new high level! And I hope - this new level be same, and even be more high, if director Tetsuo Yajima (director of XY(Z) Saga) stay on post for next movies (next if - one more Mewtwo movie). And for whole anime series, if he takes post of chief director after 8 generation.<br><br>9/10","user":"nelly-65619","rank":[6,7]}]