[{"title":"A spot for declining influencers","rating":3,"date":"15 December 2018","review":"This documentary Is somehow an Inception thing. There are a bunch of influencers complaining about the struggle to became famous on Instagram and Vine, and then the fear to Lost popolarity.\nThere Is Paris Hilton crying cause this Life Is hard... Come on, SRSLY?!\nThere Is a a guy that It has calling himself the fat jews that literally live to lick Paris Hilton butt, Just in the Hope to stay on the rich's train, eventually.\nThe documentary itself Is nothing special, automatic pilot and some Easy rethotical skit, in order to try ti make things emotional and Deep, but well, not even a nice try.","user":"ganzierozzi","rank":[16,19]},{"title":"The American dream rebranded the American Desperation","rating":7,"date":"14 December 2018","review":"This film encapsulates the mindset of fame in the modern age by letting 4 figures speak on how they conceptualize it. A sickness spreading through all of us. Sad but this is the new normal.","user":"iainoconnor","rank":[12,17]},{"title":"Pure Narcissism","rating":4,"date":"12 December 2018","review":"I could not make it past 20 minutes of this documentary. I know, it's not good to review anything unless you've seen the entirety of it. But this is one of those rare exceptions.<br><br>First of all, I doubt there's anything really wrong with how the documentary is made. The problem I have with this was the soul crushing feeling I had watching these pure narcissists at work. It started with American Idol and people wanting to get-famous-quick without putting in any legwork, and has mutated itself into the social media landscape.<br><br>Quite a few years ago I started to remove myself from mainstream media. I started watching the Joe Rogan Podcast, and eventually went on to take in most of my information from what would later be described as the \"Intellectual Dark Web\". What I found was, the longer and further removed from mainstream media I was, the more ridiculous and outlandishly egotistical it was revealed to be. Everything was dripping with self-absorption and the need to sell-sell-sell, no matter the depravity of the message.<br><br>I'm not willing to make a thorough review for people so detestable, so if you can actually sit through 98 minutes of watching these kinds of people, I hope you see the light at the end of Dante's Fourth Circle of Hell. Remove yourself from this idiocy.<br><br>4/10- P.S. These people are not memes.","user":"grahamvandyke","rank":[36,66]}]