[{"title":"more like fantasy plot holes and ultimately christian allegory","rating":2,"date":"10 October 2019","review":"Summary: little indication that this is not just an indie fantasy animation, that it's a Christian tale. This movie does a good job at being a Christian production with a Christian message but it fails on the promise of fantasy or adventure.\nwriting (assuming all indications that it's fantasy for kids): 2/10.\nwriting (target audience being Christian-interested families and children): 9/10.\nwriting (as a person who cares about plots, structures, details that make good fiction): 0/10\nart and animation: really not a fan 4/10.\nmusic and voice talent: great job 9/10.\nkid friendly: 10/10 if you tell your kids this movie is about God/Christ and Satan first.<br><br>The plot is thinly veiled Judeo-Christian allegory to the dragon being Satan and if the people don't keep faith in their hearts, somehow that gives power to the ice dragon. I gave this a watch because it seemed like it could be some good fantasy, even if meant for children, but it reads to me as content meant to predispose children to evangelical ideologies. There is basically no fantasy here either, it's just a skin for the allegory.<br><br>I was about to give the allegory the benefit of the doubt (no pun intended), as the old man Nicolai tells the male protagonist Leif when he says he still has doubts: \"that's excellent! A man without a doubt never had a thought. Faith always begins with questions.\" But instead of making the vocabulary about said questions, the script centered its verbiage around faith and belief. If this movie had actually labeled itself as religious or Christian-related media, I feel that is fine, redressing Christian stories in alternative settings such as fantasy can be creative and fun. Sure, I should have known if I looked into the director and seen that the one critic review in English was made by somebody from a Christian film website. But kids or parents or the layman (like me) aren't going to research that much into a movie - so please at least indicate there is religious content in the summary or anywhere else that is obvious.<br><br>So, basically, I came here for possible fantasy and was disappointed to only find... there's a dragon, unexplained people with wings (hmmmmmmmm can't be angels right), and a magic sword. There's absolutely no world-building or anything essential to fantasy... like, where do these characters come from? Does Nicolai and Melody have a heritage (in their family) for the song? Who built the sanctuary (church) or created the murals on the wall? How did they know what would happen? How do the humans on the ground have any knowledge or contact with the gift-giver(s)? Why do some of the people have wings and live in the sky? What do they have to do with the characters in the story who live in a village on the ground? Is there any social strata or political network (no kingdom, just a town)? The last bit of the movie mentions other villages, like they suddenly exist? Why would villages further away have to care about singing the dragon underground if this village is the one closest to the dragon and keeping him at bay? Does their village have a name? Well-written fantasy with Christian values or cores exist, but this isn't it.<br><br>As for the art and animation style, the animation is somewhat stiff and reminiscent of flash animation of the early 2000s -- not that having such an animation style prevents you from being popular with the children (like many Chinese animations for kids such as Pleasant Sheep and Big Big Wolf). I found that I wished the art director used flat shading or no shading at all instead of the strange and sometimes pillow-shaded gradient shading. And lastly, I'm just not a fan of the strange cartooning decision to enunciate human nose bridge and eyebrow area.<br><br>That said, the voice talent is pretty good and the songs are well made.","user":"nougatthechocolatecat","rank":[0,0]},{"title":"Nice songs and good family movie","rating":8,"date":"1 February 2019","review":"I would say that this movie is better than it seems. The animation and story is all right, good story for a family show, but I really liked the songs in the movie. I think the music is quite good.","user":"saviomyles","rank":[2,7]}]