[{"title":"Worst movie of its kind and fake reviews from cast/crew","rating":1,"date":"24 May 2019","review":"This movie looks like a college film class project. The plot is far-fetched and completely unrealistic. There are no \"professional hitmen\" with noble causes floating around especially the goofy, undisciplined multi-racial group represented in this movie. Serial killings do not go unaddressed by the Police ever!<br><br>In this movie, a \"hitman\" drives around in a high visibility car, parks directly in front of his contract's homes and kills with impunity. No sirens heard or police invention ever. No law enforcement seen, despite sloppy, frequent murders. Complete fantasy. We're asked to believe that a buffed out, high profile urban Rambo-type is operating in a big city, adopts a child he made an orphan, and lives with a woman whose parents he killed. Plus, we're asked to believe that the hitman has some moral compass.<br><br>I gave this film a \"1 star review\" because the story is full of holes and the acting is flat. Its completely unrealistic.<br><br>In addition, My rating will serve to balance the fake industry insider/crew/cast member reviews that popped up almost immediately. People are aware now of the fake reviews by people attached to the films!","user":"salmon62","rank":[167,204]},{"title":"So where are the top 1000 voters? This is a scam","rating":2,"date":"25 May 2019","review":"I am so confused as to how this has a high score? It is clear to me that its all made up as this was a very bad film. It is student style quality with poor editing and very poor sound in places that made the film a terrible watch.","user":"jimking-03363","rank":[142,176]},{"title":"This is a C movie deserving of an actual 3 star rating","rating":1,"date":"11 June 2019","review":"However since the title is full of obviously fake reviews, I had to give it a 1 star.<br><br>I wouldn't have disliked the movie so much if I wasn't going into it thinking it received an 8.9 rating. Couldn't even finish it due to the poor writing and acting. Visual effects were good enough to be immersed.","user":"trevorareeves","rank":[70,85]}]