[{"title":"Powerful poetic portrait of an island","rating":20,"date":"20 December 2018","review":"ISLAND OF THE HUNGRY GHOSTS confronts the impossible situation of the refugee detention centre set up by the Australian government on Christmas Island. It is illegal for any employee of the centre to talk about or report anything about the conditions there. So rather than reportage about all the facts and all the horrors, the filmmaker has chosen instead to make a portrait of the island itself, using metaphor to convey the reality of the detention centre.<br><br>It is migration time for the island's red crabs and they are everywhere, most inconveniently on the road, and roadblocks must be set up to protect the crabs from being squashed. I suppose it is natural for beings to migrate in certain conditions.<br><br>The local Chinese people, who were the first humans to arrive in the Island 100 years ago, believe there are ghosts on the island who are in between worlds, people who have died but not yet passed on. They burn regular offerings to the ghosts to placate them and help them pass on.<br><br>The main character of the film is a sensitive and sympathetic woman who works on the Island as a trauma councilor, guiding the patients gently through the immense pain and confusion of what they have experienced and what they are being forced to live. The sessions with her patients are very moving and her love for them bleeds through into her family life, as the realisation of her powerlessness overwhelms her against the secrecy and bureaucracy of the institution that has no interest in helping these people.<br><br>Somehow all this is not depressing. It's delicacy and integrity is such that we must have hope that those concerned will realise that humans are as important as crabs and ghosts.","user":"Chris_Kirk","rank":[15,22]},{"title":"Most boring movie (of many) I have seen this year.","rating":2,"date":"15 August 2019","review":"Most boring movie (of many) I have seen this year. No wonder it got nominations at Tribeca: the more insignificant, unappealing, lacking of direction, acting, photography and of everything normally contributes to the architecture of a good movie, the more acclaimed by self appointed intellectuals that need to distinguish themselves by so called common mainstream movie audience. The message is: I highly reward this (insignificant ugly) movie because I am an expert, you don't because you're a bumpkin. Migrations of people in modern era is not like crab walkabout. Modern States have rules, laws, cultures that need to be respected. Australia gave a great lesson to other cults and cultures immigrates who wanted to enter the Country and set up new rules based on their specific needs. Multiculturalism is b...sht. You enter a Country, you accept the rules, you don't like them , you're free to leave. Right winged intellectuals (Tribeca to name first that comes to my mind) speak of freedom and love, since speaking is easy and free. No frontiers. no restrictions...free immigration (also because exclusive housing compounds have strict entry checkpoints). This movie is a waste of audience's time. It is not a documentary, it is not a movie, it is not poetical, it is jus bloody boring. Only nice part is Poppy!","user":"info-39300","rank":[11,38]},{"title":"Island of Hungry Ghosts (2019) - 7.3","rating":7,"date":"16 January 2020","review":"Act 1 - 6.8<br><br>Act 2 - 7.2<br><br>Act 3 - 7.9<br><br>\nFilm is about the treatment of asylum seekers and a therapist who wants to help them but isn't allowed to<br><br>Side plots of crab migration and hungry ghosts gel into the main story beautifully with a cohesive and symbolic message<br><br>Crab migration about people moving from one place to another trying to reach their destination<br><br>Hungry ghosts about being trapped in between worlds and living in uncertainty which applies directly to the detainees<br><br>Film is relaxed, powerful, emotional and thoughtful<br><br>Film lets you sit with the moments and holds on shots for a longer period of time<br><br>Let's you digest and take in the beautiful scenery<br><br>Shot very well and the filmmakers doesn't insert themselves into this world and just let it play out naturally<br><br>Film focuses on the stories of the asylum seekers and the struggles they have been through and continue to go through in the detention centers, powerful and emotional<br><br>Emotional and powerful film with a potent message for the time<br><br>Would recommend to any documentary fan<br><br><br><br>\nCompelling opening with running and screaming through woods<br><br>About asylum seekers in the Christmas Islands<br><br>Follow a therapist in the detainee center working with the asylum seekers<br><br>Film likes to be still and let the audience feel the moments wether it be nature or human interaction<br><br>See the crab migration starting and people working with the animals and migration<br><br>Film is so relaxed and laid back<br><br>Relaxed conversations with the therapist and the detainees who are trapped there and uses sand to connect with people and let them feel and tell their stories<br><br>Can be emotional seeing the detainees talk about their struggles that they are leaving behind but are now stuck here<br><br>See real life playing out in front of the camera naturally with no outside interference from the filmmakers<br><br>Moments with therapists family too<br><br>Learn about hungry ghosts Chinese tradition, letting spirits be freed that are trapped<br><br>See how the job affects the therapist, peoples stories are powerful<br><br>People on the island really care about the crabs and their safety<br><br>Detainees feel like they are being punished for trying to find safety which isn't right, emotional seeing real struggles<br><br>Powerful story with the figures from the therapists room for the sandbox, the problems with the asylum seeking system that separates families and treats them like illegals even though they are seeking asylum which is by law legal<br><br>Subdued, relaxed, elegant and thoughtful film that cares about emotion<br><br>Ridiculous law trying to shut the mouths of people who work at detentions centers from speaking up about what they see, get 2 years in prison<br><br>Beautiful scenery and nature on this island<br><br>The hungry ghosts play into the main theme of the detainee problem as the ghosts fave uncertainty as they are trapped just like the asylum seekers<br><br>Crab migration also connect because the asylum seekers migrated here for help but aren't gettin the help they need<br><br>Everything weaves together quite nicely<br><br>Really nice shot overlooking the detention facility from the woods<br><br>Really sad story about young man being separated from his mom by the officers, traumatic experience heartbreaking<br><br>Crazy all the crabs that are migrating, awesome shot in the road<br><br>Island goes out of the way to help these crabs get to where they are going but can't do the same for their fellow humans in suffering<br><br>One of the people the therapists worked with self harmed, terrible<br><br>Therapist knows how awful this all is for her patients, the uncertainty is excruciating for these people and breaks them down mentally and physically<br><br>Very deep film and very artfully done<br><br>Really enjoy the moments with the family, keeps her grounded<br><br>Therapist realizes she can't do the job anymore as she isn't being allowed to help these people in the way she should<br><br>Family is moving<br><br>Therapist returns the sand back to the beach she got it from, moving on<br><br>Very timely film for what is going on in the USA<br><br>People want to help but aren't allowed to because of the governments rules and politics<br><br>Score is used very well through the film, impactful<br><br>See the crabs reach their destination to end the film, very symbolic<br><br><br><br>.","user":"bradeybonnell","rank":[2,4]}]