[{"title":"Diddley diddley dee, ol skool leprechaun is back. The frontal/coronal plane body slicing scene is gory n not for the squeamish.","rating":7,"date":"28 March 2019","review":"This film takes place 25 years after the event of the first film n therefore this is the original sequel. It also explains the whereabouts of the gold n how the Leprechaun returns. Makes more sense than all the other sequels.\nA group of students decide to spend their summer vacation turning the house (into some eco friendly project) of Tory Reding (Jennifer Aniston), now dead. One of the student is Tory's daughter.\nThe small boy, his elder brother n Tory's father ain't present in this sequel but we hav Ozzie (the guy who swallowed the coin in the original). The sequels never explained what happened to him n the missing coin.<br><br>This is no doubt a worthy sequel n much much better than the awful 2014's Leprechaun Origins.\nThe guy who played the leprechaun in this film did a nice job but Warwick Davis will always be remembered.<br><br>The rhyming jokes r back, the kills r gory n once again the film is set in proper daylight, shaky stuff n darkly shot scenes r avoided.\nTher is one frontal/coronal plane body slicing scene, two decapitations, one decapitation with head smashing, tap rod mouth blasting scene, etc.","user":"Fella_shibby","rank":[27,29]},{"title":"Worth a Watch!","rating":6,"date":"14 December 2018","review":"This movie was not bad at all. Obviously, don't watch it if your expecting to see an Oscar worthy film but if you are a fan of horror and cool ways to see people die, then give it a go!\nThe director did a great job in taking this movie back to the original in the way of comedy. You won't get scared watching this film but you have a laugh or two. The return of Ozzy was really cool and they did a great job trying in the original film.\nI think what I enjoyed the most about this movie was the Leprechaun. Trying to fill the shoes of someone like Warwick Davis is pretty darn impossible but Pondo did an excellent job! He was hilarious and brutal just like the leprechaun should be.","user":"jerrodbriggs","rank":[20,24]},{"title":"THIS MOVIE IS ACTUALLY GOOD!!!","rating":7,"date":"12 December 2018","review":"I was going in to this movie just like every other reboot or sequel from the 90s horror era that they decided to make now....but for a syfy movie this movie is good and it's funny. The new guy who played the leprechaun did good....Ossie from the original is good in this movie it's worth the watch.....and it's better then tales from the hood 2 and jeepers creepers 3","user":"marijenks","rank":[35,45]}]