[{"title":"Way Better Than I Expected","rating":8,"date":"27 February 2019","review":"Rating 8.4/10\nSurprisingly entertaining !! It definitely worth a watch. This film isn't perfect and is possibly quite unoriginal but it's still tons of fun and puts a fresh twist on the concept. The characters are likable and the humour is brilliant at times. It's just lots of fun and excitement. Very enjoyable !!","user":"ymyuseda","rank":[210,274]},{"title":"Sometimes it's better not knowing how the sausage is made...","rating":6,"date":"14 February 2019","review":"Sometimes it's better not knowing how the sausage is made. The first Happy Death Day was a fun little slasher flick that never took itself too seriously and was thoroughly entertaining for what it was. The sequel, Happy Death Day 2U, tried to provide explanation to the phenomenon that befell Tree in the first film. It all involves a science project gone wrong and a bunch of time-looping sci-fi mumbo jumbo that isn't nearly as smart as the movie thinks it is. This should be a franchise where you can just turn your brain off and have a good time. Instead, 2U wants the audience to think. That's the big mistake. Most of the \"science\" stuff makes little to no sense, and making us think about it only makes us realize how convoluted a mess this story is. I won't even get into the eye-roll worthy plot conveniences that have to exist for the film to even move forward in some spots.<br><br>Another issue is this isn't a horror movie. There may be a couple short scenes that lend themselves to horror, but this is much more so a sci-fi story, a far cry from what we started with in the first movie. Also, the movie reaches a satisfying ending place, but then decides to not end there and throws in a ridiculous \"heist\" movie at the end. Why not? We're already watching a horror-comedy-scifi-romcom?<br><br>Now, it's not all bad. The movie does keep moving at a steady pace and most of the characters are entertaining (even if they aren't particularly engaging). The sub-plot about Tree's mom feels genuinely heart-felt and gives the movie a little emotional weight. There's plenty of decent laughs throughout. And, as in the first film, Jessica Rothe seems to be having a ball in the lead role. There's also a mid-credits scene to suggest we're gonna expand this universe even more. And while I'll welcome a third movie in this fun franchise, I wish the writers would understand that more isn't necessarily better. Sometimes keeping it simple is best. 6/10","user":"KingKongKyle","rank":[146,198]},{"title":"An Impressive Sequel, Magnificent Work From Landon, Rothe and the Crew","rating":9,"date":"16 February 2019","review":"Happy Death Day wasn't my favourite movie from 2017 but it was in my top 10 and it qualified as the biggest surprise of that year for me. It was a solid slasher movie with a lot of funny material and a unique take on the time loop concept. The trailers for Happy Death Day 2U didn't deter me from seeing it but it looked like they could be repeating the successful formula from the first one. What may be the most surprising part of Happy Death Day 2U is the fact that other than providing a recap of the first movie, so little of it is recycled. This isn't a horror movie, its a science fiction/comedy mashup with horror and romance elements thrown in. It not only works but it works so well that it rivals the first one in execution for me. They broaden the scope of the movie and it switches genres. I can't think of another sequel (I'm sure there has been somewhere, I just can't think of one off the top of my head) that boldly chooses to go in a completely different direction. It not only makes that choice but it succeeds at it completely. The best part is that 2U is that while it is inventive, it retains a lot of what worked previously. The sense of humour carries over and there's more than enough funny material to go around. I laughed a lot throughout it was key that they kept things light to keep the pace up.<br><br>The movie choosing to change things up was the biggest surprise but the wonderful development of the characters was just as impressive. Tree's development into being a better person was a highlight of the original Happy Death Day, it added an interesting dynamic to the story. Tree continues to grow (no pun intended) and I have to hand it to writer/director Christopher Landon for developing the characters further with new aspects without just repeating the same arc. With Tree facing the same scenario but with many changes, the characters are the same yet completely different and it keeps things intriguing. While 2U was funny there were also some emotional moments that were very heartfelt. I liked how the original included the evolution of Tree's relationship with her dad, they double down on that in this one with the surprise inclusion of someone from Tree's past. The genuine joy that comes out of that realization for Tree and the pain that it causes later had a lot of pathos that you wouldn't expect from this type of movie<br><br>Jessica Rothe's second performance as Tree is a fantastic work. 2U requires so much varied work from her doing physical comedy to involving drama and she pulls it off handily. She's outstanding here and I really hope she's on her way to bigger things because this is a great follow up performance. Almost the entire supporting cast returns and they all perform capably. Rothe and Israel Broussard still have a lot of chemistry as Tree and Carter, and their relationship has some sweet moments scattered throughout. I liked that they gave both Rachel Matthews and Ruby Modine different things to do as Danielle and Lori. They both were fun to watch. I also thought Phi Vu was better utilized in this movie as Ryan, it was cool that they took a minor character from the first one and expanded on his part. Vu's performance helped make that a solid choice.<br><br>I'm sure plenty of people will be complaining about the genre shift and tonal change from the first entry in this potential franchise and while I did have to adjust but it didn't bother me. I only had a few complaints when it comes to this movie. Just like the first one, they border on having too many twists when they're wrapping up. I liked all of them but the movie wants to bring a lot of new elements in at the end and the final 15 minutes feels a little overstuffed. They also jam some of the more juvenile bits of humour in the very beginning and the very end of the movie that can feel a little out of place tonally.<br><br>I was a huge fan of the first Happy Death Day and if you made me pick I still think the first one is a better stand alone film. But Happy Death Day 2U is wildly creative, the script is really sharp and Jessica Rothe proves how wonderfully versatile she is in another great lead performance. People always complain about sequels just being carbon copies of the original or that the plot is recycled or how originality in movies is dead. I was blown away by how Landon and his team were unafraid to blaze a different path with the continuation of this potential franchise and give the audience something fresh to chew on. If you're stuck on having another slasher movie, this might not be your cup of tea but I can't recommend this highly enough. If you enjoyed the first one and can keep an open mind, go see Happy Death Day 2U.","user":"CANpatbuck3664","rank":[141,196]}]