[{"title":"The most Micheal Bay movie Micheal Bay ever Micheal Bayed","rating":7,"date":"13 December 2019","review":"The title is just a quote from Ryan :D The movie is a chaos. And i mean in a good way. I think platforms like Netflix and so on is just a place for people like Micheal Bay so they can go do their thing so freely. There is so many to talk about actually. The great crazy action opening sequence right away, really weird song choices including the internet meme one(RUN) and so on... I liked the way the mood changes and kinda turns into a political fight. Also, the good about it is that it's not a stupid American provocative movie. Not the best time i had but definetely it was different and fun.","user":"hsarikayaa","rank":[466,632]},{"title":"It's a Friday night movie","rating":8,"date":"13 December 2019","review":"So you have had a long tough week at work.\nIt's Friday, and you want to escape your work life.\nYou open a bottle of wine, pour a glass and put a movie on.\nYou have escaped the dire reality of 9-5.\nThis film is a perfect release, it has action, it has Ryan Reynolds based humour. It will never be an Oscar nominee for best picture, but hey, it's Friday night, you have a glass of wine in your hand and you want to release the week.\nAt times it felt like a film\nBy numbers but nowadays it is extremely rare not too.\nSo please, enjoy the film for what it is. It's action. It's fun. It's Friday night so enjoy.","user":"mdroddis","rank":[890,1]},{"title":"This isn't Scorsese or Mann.... It's Bay! Just have fun.","rating":8,"date":"13 December 2019","review":"These reviewers who watch a Michael Bay movie and review it as if they were expecting Shakespeare need to stop reviewing. Seriously. The only reason to watch his flicks are so you can leave your brain at the door, turn off the lights, turn up the surround sound to 100 and sit back and watch $hit blow up. You want a thinking person's movie? Go see something else. You want your brain mushed then watch this! Was awesome, funny, action filled, fast cars, explosions, I was blowing bubbles out of my ears. Such fun.","user":"Markyajv","rank":[707,1]}]