[{"title":"Never give up on your Dreams","rating":6,"date":"15 June 2018","review":"I think this movie is aimed at kids under 13, even though it has a story for everyone, most of the actors would not be classed as A list, but the enthusiasm of the younger actors is refreshing. They do a much better job than most of the adult actors.<br><br>Alex Morgan should stick to soccer, she is obviously a pretty good player. <br><br>Siena Agudong is very good throughout the movie and has a bright future.<br><br>James Moses Black overacts as the opposition coach and is obnoxious, but again he is supposed to be and does a pretty good job.<br><br>I stayed the distance and watched this all the way through, but it is definitely not aimed at adults and many would turn off very early on.<br><br>Most younger children would love it and some adults might, I found it good enough to watch once, but wouldn't watch it again.<br><br>A family movie with no violence or foul language.","user":"nowego","rank":[8,11]},{"title":"Fantasy Tale is Surprisingly Funny & Enjoyable","rating":7,"date":"22 June 2018","review":"This is a fantasy tale so naturally some of the plot elements are just that--fantasy. However, I was pleasantly surprised at the humor and feel-good aspects of the movie, but it also can be a little too sugary sweet and predictable for my tastes.<br><br>Siena Agudong gives a most natural performance here as thirteen-year-old Reagan, who idolizes the soccer great Alex Morgan. When Reagan hits her head on a piece of furniture, one of Reagan's posters of Morgan comes to life and begins to mentor Reagan in her dreams of becoming a really good player. I might mention that Morgan is supremely gorgeous and a great athlete but her acting is a little stiff at this point.<br><br>Overall, if you take this movie, written and directed by Eric Champnella, for what it is, it can be funny and a feel-good flick that I would think the whole family could enjoy.","user":"larrys3","rank":[6,9]},{"title":"A feeble piece of filmmaking, but a rare look at a girls' sports team, and fun entertainment for an undemanding audience","rating":4,"date":"18 November 2019","review":"Reagan, 13 (played by Siena Adugong) a talented footballer (soccer player for readers in USA and Canada) gets no encouragement from parents or coaches, joins the usual team of rejects and misfits and helps them succeed. That's all there is. No attempt is ever made to vary this entirely standard plot and it's obvious what will happen at every stage. It's a carelessly made, patchy film but I did quite enjoy it. I'll run though what's good and the worst of what's bad.<br><br>Gaining it an extra rating point, the reason I watched this in the first place and most of the reason I kept on watching: this is a rare look at a girls' team, by contrast to the zillion sports underdog films about boys' or men's teams (Bad News Bears, Mighty Ducks, etc, etc.) which may or may not have a token girl. Adugong, onscreen almost every minute, does a decent acting job, and her character, as well as determined, is sweet-natured and generally adorable, helping me engage with the feel-good factor. Others may find her cloying in a Disney-TV type way. The good idea, which should set this apart from similar films, is the inclusion of a real sports star. Sadly Alex Morgan never develops much of a personality, isn't allowed to show off her skills, and mostly just stands there spouting stock advice like 'train hard' and 'use both feet'. Some of the humour based around the rubbish team and its 'English' coach is pretty funny.<br><br>On the negative side, apart from the wholly unoriginal plot, the acting is patchy and the script uninspiring. The depictions of actual play are particularly poor. Adugong herself looks a decent player, but the other girls, even the non-speaking extras, don't seem to have been chosen for footballing ability. This is fine for the rejects, but they're meant to be playing against the best teams in the state and these are no better. An example of the crude attempts to demonstrate improvement. The goalie is never shown making a save, and simply stands, watching the ball go past her, until the moment comes when she faces a penalty. On this occasion she lies down (rather than making any kind of athletic dive) and someone off-screen rolls the ball gently into her hands. Just pathetic. Maybe these film-makers know nothing about football and didn't take advantage of having Morgan on the payroll to find out. Or maybe they just don't care.<br><br>What annoyed me more than anything. In the USA, most boys, like Reagan's brother, play strictly local sports (and get very excited about them) possibly because they've never been able to cut it at the world's favourite. By contrast the US women's team is the best in the world, winners at the last World Cup and Olympics. Thus football is considered mainly a girls' game and that world-beating US national team has long had a female coach. This film seems to think girls' teams are always coached by men. When Reagan has to produce a parent to take over as coach, she chooses Dad, who has no knowledge of the game and never displays the least athletic ability. How come Mum, who couldn't have been any more useless, wasn't even considered?","user":"freydis-e","rank":[2,2]}]