[{"title":"Ok, Well This Was FANTASTIC! Solid Martial Arts Action Flick","rating":9,"date":"9 July 2018","review":"Ok, this movie is fantastic. It's beyond solid in my opinion. It's pretty good action movie.<br><br>This might be the best action flick I have seen in 2018. It feels very small budgeted yet, this was very action packed, well choreographed and well shot. The music was actually pretty decent...<br><br>On the Ropes is a pretty good martial arts filmed wrapped up in a gang war scenario. Two brothers on the wrong path and one ends up double crossing the other in a quest to garner power. That's the plot essentially and all you need to know to enjoy the movie.<br><br>There is no CGI and that's a positive in an era overdone with CGI. It was very commendable and enjoyable. If you are a guy who loves action flicks, and wants to see something refreshing, give it a shot. It's not your cookie cutter action flick, but that's why it works. Yeah it's low budget, but so what?<br><br>Highly recommended for guys who are fans of action movies and martial arts. 9 out of 10. Some actors are better than others, but at no point is this movie boring. <br><br>Well done production and camera work, along with fast moving plot makes this a must see.","user":"Dark_Lord_Mark","rank":[6,8]},{"title":"Prototype of \"How not to do a movie\"","rating":1,"date":"21 August 2018","review":"Well, at least I think the main characters are good at fighting. But dude, you need to act, that is what it takes to make a film. Probably this is one of the worst acting I ever seen!! You remmember those bollywood movies.... yeah that's it!\nYou wasted enough time reading this review, now go find another movie to watch, but not this one.<br><br>Sorry movie makers, next time you should try better","user":"dardani-99761","rank":[1,2]},{"title":"You don't rat on family","rating":3,"date":"23 August 2018","review":"Crime boss Angelo (Peter Frangella ) raises two boys as his sons and he also has a boxing ring. He supplies guns and drugs to Bruno (Joseph Di Mambro). Recently there was a rat and now everyone is pointing the finger at each other which has consequences. Oh yea, then there is also a powers struggle thing between the \"brothers.\" <br><br>Jon (Can Aydin), one of the brothers, as a very quiet and dry delivery, like comedian Steve Wright, except he was never funny. The film has some fighting and kick boxing type of scenes and a little gun play. Not that great acting or plot line. <br><br>Guide: F-word. No sex or nudity.","user":"nogodnomasters","rank":[0,1]}]