[{"title":"Cute but no chemistry","rating":6,"date":"9 November 2018","review":"It's a cheesy Netflix Christmas film so you know what the ending will be five minutes in. And that's fine for the most part - grandpa is wise but sharper and more knowing than people think, there's a comic relief friend who laments his lack of a love life, and the kindly town mayor gives our heroine the break she needs. Hell, even chisel-jawed perfect on paper but not the right guy grandson of Gregory Peck really only makes a safe error to show us that although he's nice he isn't the right guy.\nThe problem is when the two main characters get together at the end there's nothing believable about the romance. As best friends their chemistry was excellent, but their kiss just seemed like two awkward strangers at a failed audition. Grandson Peck might not be the one, but I doubt the best friend would be if they were that lifeless.","user":"pee_bee","rank":[24,26]},{"title":"Okay..","rating":4,"date":"26 November 2018","review":"The concept of the movie and the calendar gifts were unique but the rest of the movie was average.\nFirst off they act like this girl is some struggling artist with her brand new car and her giant apartment. She's more like the daughter of a wealthy lawyer so she can be a photographer all she wants.\nThen the male lead has braids and a unibrow going on where it makes you root for the other guy.\nThe meet cute with that other guy was pretty cute so the movie gets points there.","user":"cthompson-89640","rank":[15,16]},{"title":"Genius","rating":9,"date":"4 November 2018","review":"If we're rating according to how well the movie accomplished its goals, I have to give this a rave review. Somehow Netflix noticed that people love watching bad holiday TV movies, so they made their own perfect versions, taking every gloriously terrible detail into account. The Holiday Calendar combines a ridiculous plot, adorably unrealistic characters, incredibly cheesy writing, over-the top scoring, and the perfect amount of cliche, both of the Christmas variety and of the bad movie variety. It's a perfected version of your average Hallmark movie, but without the soulless blonde leads. I have to take off one point because it's neither a \"good\" movie nor an official satire, but it certainly impressed me. Netflix understands TV watchers better than any television network.","user":"gracieliz95","rank":[30,40]}]