[{"title":"Power for the oppressors","rating":8,"date":"15 February 2020","review":"Being the country where the movie industry thrives the most, it's only natural that a lot of the scripts, are actually about that same country's history<br><br>I've seen a lot of american movies, based on true political events that have continuously shocked me to my core, on how powerful law enforcement and government institutions keep getting away with the most inhuman actions, and even worse, these actions being completely ignored or supported by the people<br><br>I get it, the political climate in the US will make people dislike the movie if they tend to support a specific political color, given the interventionists, however as a non-american I appeal everyone to look away on political ideology and really absorb the message, as being ignorant is no longer an excuse. It's not about politics, race or whatever other topic that keeps dividing people, it's about the total lost of humanity<br><br>As a movie is well executed and conveys the event's story line in a concise and organized fashion. Adam Driver delivers, and the high score goes for the message and awareness!","user":"blackoutH","rank":[17,17]},{"title":"Americans tortured people for nothing then tried to cover it up from their own people","rating":8,"date":"20 March 2020","review":"...and they did it with such gusto and in such a fluid manner that it is obvious these things happen all the time. The made the movie of the one reveal that actually got public, but it must be just the tip of the iceberg. After the unintentional hilarity of the first minute of the film, where Driver's voice over fits a little bit too closely to the plot of the latest Star Wars trilogy in which he is also starring, the movie just relentlessly throws fact after fact, proof after proof, tense moment after tense moment, torture after torture until all you can feel is outrage. And Burns and Soderbergh have this way of making you feel strong feelings in a rather cold way. They are not pointing fingers as much as remove curtains. They don't over dramatize things as much as they reveal simple, bland events. And yet, in the end, the picture they oh so slowly portray is evoking strong feelings while keeping the viewer informed. They did the same with Contagion in 2011, a movie very apropos at this time and also very good.<br><br>So, this young guy is tasked with writing a report, alone with a small team, inside a basement, isolated from the world, sleep deprived, debased and humiliated... about how the CIA tortured prisoners by hiding them in basements, isolated, sleep deprived, debased and humiliated in order to teach them \"learned helplessness\". The parallel is not subtle at all. To be able to survive in the political world while compiling a report damning US politicians and security institutions is akin to resisting torture. A reporter tells the guy: \"They had you build a boat that they never intended to sail\" or something to that effect. There is a small moment when he almost went Snowden, but then reconsidered because he wanted to do the thing \"the right way\"... and he almost failed.<br><br>Bottom line: this is not an anti-American movie, it's a little partizan, though. It shows the evil corrupt side of the political system most than all. Prepare to see how incompetent people are paid millions to make others miserable, then are protected by any ill effects. If you just want the ending, no, there were no prosecutions for any of the things in the report: not the torture, not the cover up, not the lying to legislators.","user":"siderite","rank":[10,10]},{"title":"Important lesson in recent history","rating":8,"date":"30 November 2019","review":"A very interesting and shocking lesson in history. It does not disclose anything we did not know before but it is shocking to see how much it was tried to be hidden. We got a lot of disclosure movies like this in the part and this is one of those that can be perfectly put in line with many classics off its kind. The acting was great. Adam Driver put so much energy into his role. It really shows. And even though not much back ground information or special character traits were developed for his role, he portrayed it on such a human and realistic way. Hands down one of the best best lead performances of the year so far. Annette Being was similar powerful. What made her performance was so special was the subtleness of it... not one of Bening's specialities as she is a very theatrical actress, but here she showed her calmer side and shows the same intensity as usual. I also enjoyed Jon Hamm and many of the other supporting players, there was not one weak performance. The screenplay was great, I only had some issues with the different time lines all the time, but it was effetely solved by working with colors.\nA really good lesson in recent history. Not dry at all, although it looks like it. Recommended.","user":"Alexander_Blanchett","rank":[79,101]}]