[{"title":"Gee you'd think the mother is cold","rating":4,"date":"23 November 2019","review":"Like the other reviewers sad this is just a poor copy of home alone. Not bad for background noise but that's about it, it's a cute little story and at least no ones a brat.\nApparently all the mother can do is constantly complain about how cold she is. So if you're stuck watching this have a drink every singe time she mentions how cold she is. You'll either be buzzed enough to find this funny or pass out","user":"lindsay12866","rank":[16,18]},{"title":"A Very Poor Man's Home Alone","rating":3,"date":"15 November 2019","review":"Christmas Break-In (2019) U Netflix<br><br>Oh wow. Boy, oh boy, oh boy. When I coined the term 'Christmas Crapola Movie' it was meant to mean festive films that were lame but, hopefully, enjoyably so. There is nothing enjoyable about this pile of poopola.<br><br>Christmas Break-In is a desperately poor man's Home Alone, right down to:<br><br>The plot (A kid is left in a school on their own and has to defend it from baddie thieves)\nThe baddies being called 'The Ice Cream Truck Bandits'\nThe parents realising they've forgotten their kid and yelling in unison 'We did it again!'\nThe kid running screaming down the corridors yelling as they go nuts when they realise they're on their own\nThe kid setting home made traps to catch the baddies\nA 'traps being prepared by the kid' montage\nBefriending a lonely old man at the denouement<br><br>Despite its lack of originality, Christmas Break-In could have been fun knockabout nonsense. It isn't. It's horrifically poor on every level. The biggest question is, despite the presence of actual actors you've heard of (Danny Glover and Denise Richards):\nWHY CAN NO ONE IN THIS FILM ACT? AT ALL? IT'S YOUR JOB, DAMMIT!<br><br>Christmas Cheese Rating: 6/10. They've made a token attempt with the decor and odd bits here and there, but it doesn't even feel very Christmassy.<br><br>Snow Rating: 9/10. The backdrop is a big winter storm blowing in, so they've gone somewhere snowy to actually film this. No scenes where you can tell they've just sprayed a fire extinguisher around, thankfully.<br><br>Actually Any Good Rating: 3/10. This is just embarrassingly bad. I only watched it to the end so I could tell you how terrible it was. You don't need to bother. Even your kids will be bored. Just rewatch Home Alone instead.","user":"barnandkaren","rank":[13,15]},{"title":"Denise Richards is abysmal","rating":1,"date":"15 November 2019","review":"The kid's didn't like how careless the parents are and make up for abandoning their daughter by buying her things. Not a good lesson in this one. (Danny Glover was way too good for this)","user":"mauri-verdugo","rank":[11,13]}]