[{"title":"Looking through a two-way mirror","rating":30,"date":"30 September 2019","review":"Explore the artistic process behind what is likely to become a very strong album for PJ Harvey. We witness Harvey visit character-rich, and resource-lacking places. Here are jams with locals, grave tales from the street and visible effects on a post-war country. Meanwhile home in London, Harvey sets up a recording studio made into an art exhibit that lets the audience peer into her recording process. We as the audience are similarly given this same experience.<br><br>For someone deeply interested in music and songwriting, it's a relevatory documentary that shows how inspiration in the real world translates to an auditory experience in the studio (with the help of outstanding musicians).","user":"hjart6","rank":[10,11]},{"title":"Portrait of not just an artist, but the artist inside everyone....","rating":9,"date":"9 November 2019","review":"With the bold decision of abruptly ending the film with no tacked on answer, or roundabout way of explicitly surmising the state of the world, the viewer is left to both peer into the empathetic and ponderous nature of Harvey's creative process regarding this album, and to reflect on their own life experiences. We are all lost spectators, and this film reminds us of the enriching but harrowing nature of finding ourselves, by listening to and finding a human connection with others.","user":"mikeyboy-lol","rank":[5,6]},{"title":"Portrait of an Album","rating":7,"date":"5 March 2020","review":"PJ Harvey seems to be an awesomely weird chick, and I like to watch movies that explore an artist's creative process. PJ Harvey accompanies a photographer Seamus Murphy on his reporting trips over the four years. They visit Afganistan, Kosovo, and Washington. The footages from the recording session switch with footage from their trips with voice over by Harvey herself. She doesn't tell us straight what she sees or feels, but she gives her emotions forward in poetry.<br><br>It was beautiful and at the same time a sad movie - to see how this world is torn apart by corporate greed, politics, and war, and yet there are all these people trying to go on with their lives, and some even trying to create something beautiful. I didn't like how the film that just observed still took a political stance (quite a strong one, I might add), towards the end, where they showed images from Trump's inauguration. I'm not much fond off the guy, but I'm getting tired of all this anti-Trump thing by now.<br><br>A beautiful movie that shows the beautiful artist in making a gift to the world. Not particularly informative documentary and most definitely not the best rockumentary out there, but I enjoyed the general vibe of the movie.","user":"abc4d3e2f1","rank":[1,1]}]