[{"title":"Many people misunderstood the role of Miharu! My analysis of the movie.","rating":9,"date":"8 April 2020","review":"I think this movie was very interesting and full of interesting symbolism. I definitely recommend watching this movie.<br><br>I have read a lot of different understandings of this movie, but I think that a lot of people maybe misunderstood the role of Miharu. So this is my analysis of the movie:<br><br>In general, the facility represents society. The levels represent society classes and hierarchies. The protagonist, Goreng, represents a resistance movement who is ready to use threats and violence to secure that there is enough food for everybody. The old man, Trimagasi, represents a supporter of the system. The woman from the administration, Imoguiri, represents a peaceful movement that wants change but is unable to do so. Miharu who rides down the platform actually represents the upper class (se explanation further below).<br><br>The cellmates believe that the change of levels each month is random. However, the administration does not randomly choose the levels for all prisoners each month. The administration choses if each prisoner should go up or down the levels each month based on whether they have eaten their cellmates or not. If a prisoner is willing to kill his or her cellmate and eat of them then he or she is secured a higher level the next month. This is evidenced a couple of times in the movie: At first Goreng starts on level 48 with Trimagasi and they live peacefully. Then they move down to level 171 the following month where Goreng ends up killing Trimagasi and eats of him to survive. Then Goreng moves up to level 33 the next month where he meets Imoguiri and they live peacefully. Then they move down to level 202 where Goreng is forced to eat of Imoguiri who has killed herself. Then Goreng finally moves up to level 6 where he meets Baharat.<br><br>The woman Miharu who rides down the platform actually represents the upper class of society because she knows how to exploit the system. Notice that she always rides down the platform and comes from the top floors and she is always bloodied and emotionless. That is because she always makes sure to kill and eat her cellmates every month, and that's why she always ends on the top floors. Miharu rides down the platform to make sure that there is food for the little girl (which we assume is her daughter) on the bottom floor. The girl is always on the bottom floor month after month, because she has never killed and eaten her cellmate. Miharu rides down the platform once a month so she has to make sure that there is enough food for the girl because she cannot get up again until the month is over (the platform only travels back up to level zero, which prisoners presumably are not allowed to enter). That's why she killed so many prisoners on her way down. Miharu must have a good reason to ride down the platform every month and that was to take care of the little girl. Miharu has managed to stay on top and alive for long because she knows the system. However, even she succumbs to the system when she is killed in a fight with the prisoners.<br><br>Notice that we learn from Imoguiri that she selected Miharu to enter the facility 10 months ago, that she entered alone, and that nobody under 16 years is allowed in the facility. However, we cannot trust Imoguiri's information because she also said that there are 200 levels, which turned out to be false, and the prohibition against under 16 year olds to enter the facility also turned out to be false. So the question of how the little girl ended in the facility remains unanswered. Perhaps the little girl was born in the facility or she was thrown in there with her mother.<br><br>The movie hints that there is actually enough food for everybody on all floors because the administration puts every prisoner's requested food on the table. This is evidenced when the protagonist is interviewed by the administration official about his favorite food (snails) and that it will be served while he is imprisoned. We also see that the protagonist sees his requested food for the first time when he is on floor no. 6 because none from the upper floors has touched it yet (but he doesn't eat it). He did not get to see his requested food before because those on the upper floors always ate it before it arrived to him. If every prisoner in the facility kept his or her requested food when it arrived at his or her floor, the floor will not turn hot or cold. This is evidenced by one of the last scenes when the protagonist keeps the Panna Cotta when he is at the girl's floor, which must be the favorite food of the girl. All the prisoners had to do was to take their requested food, and not eat the others' food, so the food would be equally distributed all the way to floor no. 333. However, the prisoners from the upper floors greedily ate more than their favorite food leaving less to the ones on the lower levels. So the main message of the movie is that people are very greedy and are ready to take more than they need, and not so much that the system is flawed. We see that the alternative system that the protagonist tries to enforce by distributing little food to everybody also leads to violence and deaths and is not much better.<br><br>The end of the movie is quite vague, but it does have a meaning. At the end, we don't see what happens to the protagonist, but it is hinted that the protagonist probably dies. Notice that he was heavily injured and barely got on the platform with the girl, when they reached the bottom, then he suddenly he gets off and walks normally when he sees the ghost of Trimagasi. The girl transports upwards to the top floor at the end of the movie. The protagonist is trying to send a message to the administration by transporting the girl to the top. Perhaps the message is to show that despite that most people are greedy, there are also some people who are willing to show benevolence and generosity to save others.<br><br>I think this movie was very interesting. The movie is open to interpretation, and this is of course my point of view and I hope you found this helpful.","user":"TheKing87","rank":[488,505]},{"title":"Just stick to your favourite food","rating":9,"date":"25 March 2020","review":"First of all, I would have never expect to enjoy this movie as much as I did. It starts slow, with some basic (and easy to guess) details. A prison, food every day, don't starve. The characters were not very complex and it will not be until, but are the little things the one that will truly play with your feelings.<br><br>The movie begins with a very strong social statement. 'They are above you, they won't listen to you.' and 'They are below you, don't talk to them.'<br><br>First of all, with every new floor you will pity them more and more. First you hear a number...132 (and most people will try to guess that there are only 150 floors). But then they are taken to 171 and so on until they reach the very end.<br><br>The second thing that made me wonder was the fact that the protagonist never discovered the truth. The kid was not the message, the cake was not the message...the message was hidden in the question most of them received...What is your favorite food? The main character try to avoid this question but the woman insisted upon an answer. He said \"Snails\"...what does he see on the table? Snails. The feast was composed from all the favorite foods of everyone locked in there. If each prisoner would have eat only his favorite food, he would have survived and the food would have been enough for everyone. But is the human greed and the savage feeling of hunger that made them eat everything.","user":"danielconstantinescu","rank":[917,985]},{"title":"My interpretation of the movie","rating":8,"date":"22 March 2020","review":"I think rather than focusing on a plot, the movie depicts different edges and human profiles in life. The platform is our world, and the administration are the governments, and the levels are the social classes that are created. The administration (government) works with care, but due to flaws in the capitalist system, there are people suffering/dying.<br><br>The main character Goreng has norms. However, it doesn't take too much until he loses his mind in a corrupt world. He wakes up in the platform with an old man, who is completely aware about the system, and has already completely adapted. When he is up, he eats as much as he can and abuses it. When he's down, he does everything needed to stay alive. The woman that formerly worked for the administration regrets her earlier duties of sending people in to the platform, as she 'didn't know' - depicting similar people that work for governments nowadays. She regrets it, hence sends herself in and tries to change the system by speaking up to the lower level everyday. However, the tone of her message is not enough in the cruel world; Goreng's tone that includes threatening seems to work though.<br><br>Goreng tries to change the entire system with Baharat. I think, that ultimately they failed, and that starting from some part of going down (I am not sure from where), Goreng starts to hallucinate. Initially, they are trying to send a message to the administration by sending back untouched clean food - which is normally impossible in their system. They fail in this, but Goreng, imagines a bigger message: in the lower levels, no one is interested in food from the table anyways; they are eating each other. A child that survives the bottom floor would serve as a bigger message, as she is a metaphor to our social norms and ties.\nBaharat tried to go up several times, but going up does not have anything to do with willingness. There are always people that are going to stop you. It is a matter of luck, just like in the movie. One day you wake up in a horrific situation, the other day you are happier. When you are happy (or of higher class), you seem to forget about the bad days and lose your emphaty as a human being and exaggerate in every act that you do.<br><br>The woman that worked for the administration thought that there were 200 levels. The movie describes that there is always worse and way more people suffering than they seem to observe - so bad that the world and the governments (the woman) do not realize (or tend to ignore) while being part of the system.<br><br>Overall, I think it was a great movie. I like open endings so that I can draw one myself.","user":"zaferdc","rank":[972,1]}]