[{"title":"Had potential","rating":2,"date":"16 December 2019","review":"A disappointment. The storyline had potential but unfortunately fell short.","user":"ben-matters","rank":[5,5]},{"title":"Well...?","rating":3,"date":"1 November 2019","review":"The cast was virtually flawless...The plot? Hard to find one. Who were the main characters? What was the story? When you get to the end of the movie you're left thinking, \"So what?\"","user":"dustinbarr","rank":[10,13]},{"title":"Just another awful Christmas with the fam","rating":5,"date":"14 November 2019","review":"English family hosts Christmas and it goes badly but then everything ends perfectly because of course.<br><br>Here's the part that is infuriating...the sisters in this film get an inheritance but there wasn't as much money as they thought. The one boring ugly sister and her Marky Mark Wahlberg look alike husband sink every last penny into her childhood home fully expecting that she will inherit the home free and clear while pretty and vain movie star sister will inherit investment money but oops turns out the investments aren't there anymore so now they both have to split the house which means selling it. Both sisters are friendly until this happens and then the claws come out. They spend the rest of the movie furious with one another UNTIL movie star sister finds out her TV show is renewed and she will be making a ton of money so now she won't be needing her share of the inheritance. They are all happy and hugging and acting like two seconds ago they weren't about to come to fisticuffs and write each other out of their lives. RIDICULOUS! How is that genuine?! So stupid!<br><br>One last thing-I chose this film because Joely Richardson was in it so I thought that would give it a little more credibility but nope she's just acting in anything anymore apparently. She's found herself in the place every movie star eventually finds themselves-too old for main character or starlet parts but too young to give up completely and settle for old person roles so they take on drivel like this. She was totally out of place in this and it was embarrassing.<br><br>This wasn't the worst film I've ever seen but I certainly don't recommend it. This is just another terrible Christmas film.<br><br>For the love of God people! Christmas films are a huge industry so why can't someone come up with something original and not totally stupid or lame?! Stop churning out crap we don't want to see! Such a waste!","user":"apryla-58795","rank":[7,9]}]