[{"title":"An African Classic","rating":10,"date":"11 May 2018","review":"Lets remember this is an African production so look beyond the occasional lack of big budget filming. This film has a great story and keeps you watching until the end which is more than can be said for many Hollywood movies. Kudos to all involved and the fact Kenyan authorities have chosen to ban it suggests they fear how good this films moral lessons actually is.","user":"uaejon","rank":[43,48]},{"title":"Open your heart or not?","rating":8,"date":"26 June 2019","review":"When your community and your family are against what you truly are, do you conform to their demands or do you fight for what you truly believe?<br><br>This is the question that Rafiki asks - the first Kenyan film to openly portray a same sex relationship. These things have been seen in other films around the globe before. But every society has a story to tell.<br><br>The film is colourful, well acted, thoughtful and sympathetic to its subject matter, despite it still being a crime in Kenya. Top marks for everyone involved in making such a brilliant movie. And making it available everywhere in the world.","user":"Avwillfan89","rank":[9,9]},{"title":"An audacity for hope","rating":7,"date":"7 September 2018","review":"In Kenya, not only is homosexuality illegal, the clergy routinely preaches against it, and the general population is against it. So things get tricky when 2 young women become friends (Rafiki, apparently, means friend), and then lovers. One complication is that their fathers are running for political office against each other. Meanwhile, the dress-allergic Kena's divorced mother's big dream is to see Kena marry a doctor, while Ziki points out that Kena has good enough marks to become a doctor herself.<br><br>Seen at the Toronto International Film Festival, the director pointed out that Rafiki was banned in Kenya for being \"too hopeful\". The camerawork and music gives a good feel for some section of Nairobi, but the leads (even with an acting coach) do show their inexperience.","user":"chong_an","rank":[18,23]}]