[{"title":"interesting, informative, entertaining","rating":8,"date":"14 October 2019","review":"Greetings again from the darkness. Why did the mushroom get invited to the party? Because he's a fun guy (fungi)! That joke works better when spoken rather than read, but it made me laugh as a kid, even though it wasn't enough to keep me (and half my classmates) awake during those dull science films in junior high. Documentarian Louie Schwartzberg obviously stayed awake in class, and now he's showing us how those films should be made ... interesting, informative and entertaining.<br><br>\"We brought life to Earth. You can't see us. We are mushrooms!\" Narrator Brie Larson (yes, Captain Marvel herself) introduces fungus, or more accurately, fungi ... since we are told there are 1.5 million species - 20,000 of which produce mushrooms. Despite the presence of Ms. Larson, this isn't a superhero movie. No, it's much more important. In fact, the real star of the documentary - other than fungi - is an amateur mycologist named Paul Stamets. That's right, this informative project devotes much of its time to some guy who just likes science (oh my, does he like it); specifically, the study of fungus and mushrooms. He even tells us some of his personal story, allowing us to connect with a guy who is proud to be known as a mushroom nerd.<br><br>Director Schwartzberg is an accomplished documentarian, and noted time-lapse photographer and visual artist. He even uses impressive digital animation periodically to guide us along. He's also smart enough to complement Mr. Stamets' observations with input from real life scientists, as well as authors and researchers. Admittedly, it's not really fair to classify Stamets as an amateur. He has written books and his research has been invaluable to some of the world's foremost experts.<br><br>You may wonder why you should care about fungi. Heck, it's described as something between vegetable and animal. We hear that it's been around since the beginning, and that it plays a role in rebirth, reincarnation, and regeneration. This is shown via a memorable time-lapse segment, and with the bold proclamation that Mycelium is \"the mother of us all.\" We learn how fungi is such a vital part of our existence through medical research, penicillin (and chees), antibiotics, bio-terrorism, psychedelics, and now even the treatment of depression and cancer. Fungi can feed you (it's good on pizza), heal you, and even kill you. The film is quite a fascinating and educational treat ... and a lesson in biological resilience. And I never once fell asleep - my junior high teacher wouldn't believe it.","user":"ferguson-6","rank":[16,21]},{"title":"I've been told by many, that I too, am a fantastic fungi","rating":7,"date":"7 April 2020","review":"So I decided to watch this documentary. It was very informative and interesting - well put together, but I feel I'm less of a fungi now.","user":"TheTopDawgCritic","rank":[6,8]},{"title":"Maui Film Festival Celestial Cinema 2019 Premiere","rating":9,"date":"14 June 2019","review":"Fantastic Fungi premiered June 12, 2019 at Maui Film Festival's Celestial Cinema in Wailea, Hawaii.<br><br>Really loved Louie Schwartzberg's film Fantastic Fungi.<br><br>Louie Schwartzberg was on hand to receive The Maui Film Festivals's 2019 Visionary Award.<br><br>\"The Visionary Award honors the beauty, surprise, amazement and awe that your extraordinary time lapse cinematography reveals about the extraordinary planet that Humanity and all life calls Home\"<br><br>As a festival volunteer I felt deeply moved watching the premier of Fantastic Fungi.<br><br>I was pleased to see several cast members interviewed who are world renowned experts in their respective fields of science &amp; medicine.<br><br>The innovative use computer graphics helped to visualize and understand concepts of extremely complex science.\nThe time-lapse cinematography was other worldly.<br><br>So if you are interested in a broad based adventure traversing nature, biosciences, ecology, environmental conservation, business development, &amp; human psychology research consider watching Fascinating Fungi on the largest screen available.<br><br>Excellent choice selecting Brie Larson for narration her words are clear and heart warming<br><br>Fasten your seatbelts and hope you enjoy this stunning visual educational wild ride.","user":"paul-86963","rank":[9,14]}]