[{"title":"A Good Family Movie","rating":6,"date":"13 January 2019","review":"This film is divided into estentailly four parts: three short films and an interview by one of the directors/producers.<br><br>The first two short films were good and the last short was great. The films seemed to be set up from the worst to the best.<br><br>The first short film, \"Kanini &amp; Kanino\" was my least favorite out of the bunch. It revolves around two humanoid water creatures going on a dangerous journey to save their father. Now in this film, the use of CGI looked a bit odd with the 2D animation and the story felt a little inconsequential, mainly due to the short run time. This short wants to be a full length film and feels like a promo for one. Besides the negatives, the audio is done pretty nicely and the lack of verbal dialogue between characters makes for an interesting viewing experience.<br><br>The second short film, \"Life Ain't Gonna Lose\" is my second favorite short. It revolves around a mother and her son trying to live with the son's deadly food allergy. This film, like the previous, wanted to be a full length film. Also, some of the foreshadowing was a bit odd (pidgeon scene). Besides that, the short was good. The characters are really empathetic and the visuals are fantastic with a nice water color look to them.<br><br>The last film \"Invisible\" was fantastic. This film is about a lonely man, who is possibly invisible and weightless that must find a way to get out of that lonely state. Unlike the other shorts, it felt like it was made to be a short film. The visuals, cinematography, and animation were fantastic. The story was by far the most interesting out of the bunch as well.<br><br>The last segment of the film was a interview with one of the directors/producers. He discussed the creation, themes, length, and reason for making these shorts. Even though this was a bit odd compared to the rest of the film, it was rather insitful.<br><br>The only other issue and the main issue with the film is the length. It's only 53 minutes long! What you have to consider is if only three shorts are worth a full ticket price? It is sad because the prestigious Isao Takahata was going to direct a fourth short, but due to his passing they were limited to three shorts.<br><br>I had an all around good experience. I recommend watching and buying these short films. The general lack of recognition compared to their full length counterparts is really saddening. To buy this film is to not just support the foreign film and anime industry, but to also support the short film medium.","user":"Bobby_Diesel","rank":[20,21]},{"title":"Nice animation, awful plots","rating":3,"date":"14 February 2020","review":"I have to say that I had no expectations about this one, so my mind was open more or less to everything. But it didn't work: boring boring boring and with an unnecessary anxiety. The characters were supposed to be heroes but you never really love them. You feel unconfortable all the time and the plots are totally \"blank\".","user":"alessandropetrini","rank":[3,4]},{"title":"A 3 segmented mini movie","rating":7,"date":"27 March 2020","review":"This movie consistices of 3 segments<br><br>The first short is about a brother and a sister who go fishing and they encounter so big large fish. The second segment is about a kid called shun who is allergic to eggs. The third segment is about a guy who is always invisible for some reason.<br><br>I personally find it a good watch on Netflix especially if you are looking for something which is short.","user":"WeAreLive","rank":[0,0]}]