[{"title":"Reviews by cast","rating":1,"date":"9 March 2019","review":"Why members of the cast think they can get away with fudging the reviews is beyond me. They haven't put any effort into concealing their identity. hayleybentertainments? which is a stripper for hire company, and, hayley b in the cast, who stars as a polish stripper, or others signing up and the day later leaving their one and only review.<br><br>Here's a 1 star for the cheek. Remove the reviews and I may give this dreadfully paced, rather bland but generally inoffensive film the 3 stars it deserves..","user":"gerbilstunts","rank":[26,33]},{"title":"nonsense, psychic crime drama","rating":2,"date":"27 April 2019","review":"Neo-noir, pre noir or pernoir, its definately not fitting in anywhere, but the moral is simple. the last laugh,is the best laugh, or redneckmidlandians vs. psychic chick its doomed from the beginning. its about a stash of non certified diamonds that are flown into england from somewhere, the mafia that expects it,are fooled around by several other tribes, and the mains, aka the loosers, uses the psy-fi to sniff up the money meant as payment and of course the diamonds.<br><br>the story are at the level of a 13 yrs old written english exam, with a horrible language, and implosive use of violence. the acting are a c-level, and so are also the filmo and edit. the pace are like flyfishing, its on turbodrive,then it drifts slowly and so it repeats itself over and over.<br><br>in the end the crooks get crooked and the beast is gone, and the grumpy old man thinks the best one won. can i recommend it .no definately not","user":"ops-52535","rank":[10,14]},{"title":"Beware Fake Reviews","rating":6,"date":"27 April 2019","review":"Rather like the recent \"revelation\" that Amazon is full of fake reviews, we find a similar ghostly phenomenon here. There are a number of glowing reviews for this title, created by persons who joined IMDB in 2018, and have submitted a single review (for this movie). One would almost suspect a master plan to promote their own movie...<br><br>Anyway, I actually enjoyed this movie. It's a great idea (reminds me a bit of \"Cleaver\", the movie within The Sopranos. It's not great, and the cast (I note an Emmerdale actress) have limited talent on display, but it made me chuckle, and I do enjoy bungled heist movies.","user":"ian1000","rank":[8,11]}]