[{"title":"For all the family","rating":7,"date":"14 March 2019","review":"A poetic tale in Lapland in which we may observe a reindeer within its wild environment, from birth to its first anniversary.","user":"FrenchEddieFelson","rank":[14,16]},{"title":"Visually this film rei(g)ns surpreme, but struggling from very poor narration","rating":6,"date":"17 February 2019","review":"\"Aïlo: Une odyssée en Laponie\" is a French co-production with Finland (obviously because this is where it is set) and the most recent filmmaking effort by director Guillaume Maidatchevsky. It runs for slightly under 1.5 hours and takes us into the life and world of Ailo, or lets say into his life from before he was born all the way through his very first year. And yes, even if there are informative parts at times, you need to understand this is not a documentary, but a fictitious adventure. A lot of what you see here may seem the way it was presennted to you, but it just wasn't like that. It is fiction for the most part. That per definition is not a problem, but the actual presentation is. I must say I have no idea who Adalbert is, the narrator from the French original version, but the German dub I watched was narrated by Anke Engelke, a longtime comedian and actress here in Germany, very prolific and very successful and I usually like her. Actually, I think she did an okay job here too with what she was given. The problem is that really wasn't much. Problems already start with the audio. Honestly, her narrating volume was far too high and took considerable attention away from the movie in its entirety. Second problem is what she said in detail on many occasions. There were some fun moments that were okay like when she describes a small predator in the snow by saying there are creatures moving as slowly and calmingly like clouds and this one here is the exact opposite. You could see it coming, but it was still fun to hear and and also to see you were right of course. But there are many moments when basically all she says for minutes adds nothing of value or information. It is really only exactly what you see, maybe one percent more background information, but you could clearly feel they were trying all they could to make it adequate for younger audiences. Well, lets say simple younger audiences. But there is no need to. Those kids aren't any stupid. At least on a high note, they weren't scared of showing us that violence and death are constant companion in the wilderness. We see the other young reindeer that died early. We see the wolf gang managing to kill one from the reindeer group. We see the wolverine (yeah had to look that one up, shame on me) get one of the domesticated reindeer. By the way I was really surprised how much of a predator this wolverine was. Would not expect the species despite their obviously sharp teeth to be able to tear down big reindeer and even drag them away. They are like little bears. So now you already heard about other animals and rightfully so. There are many. So it was a good decision to keep this film relatively short because the material just wasn't there for a 100 minutes apprently and there are 15 minutes roughly about wolves, rabbits, wolverines, foxes, birds, squirrels and several other animals I may have forgotten now that do not involve reindeer at all. Also some love stories about these other animals indeed that were a bit over-the-top maybe, but still cute. But yeah, the narration not how Engelke says it, but what she had to say was so bad that it was almost a negative deal breaker. The best example is one factual error, probably not the only one. I am talking about a reference when they say a polar fox is looking for the love of his life and that these animals stay with their partner for a lifetime and then we hear something along the lines that this does not apply to reindeer and we will find out later about that in detail. Well, we did not. I don't know if they just forgot it or if the (German) version was edited in a way where it was left out. But the reason is not important honestly. Such a promise resulting in such an omission should simply not happen to a film with such a wide release. By the way, this premiered in December 2018, so now less than 2 months later it is here in Germany, not too long and I guess it make sense because they only had to wrk with voiceovers here, not with dubbing 20 or more characters. Of course, the original is in French, so make sure you get a good set of subtitles if you want to watch. I still recommend the film all in all, mostly because of its visual side and also because there is not one single animal in here basically which is not cute or at least somewhat fascinating. And you will fall in love immediately with the young reindeer (and other young animals). I just wish the audio could have been only half as good as the visual side, also those mesmerizing Finnish landscapes full of snow. A really good watch, maybe mute it and have some chilly instrumental music play with the scenes. That way it could actually be a watch worth a rating of 4 stars out of 5.","user":"Horst_In_Translation","rank":[3,4]},{"title":"Wonderful documentary/movie for the family","rating":8,"date":"28 February 2019","review":"Plot:\nThe first year of Ailo is shown, a reindeer that is learning its place in the world.\nWhile experiencing the harsh weather and life conditions in lapland, i.e. northern scandinavia, Ailo also meets the other animals living there, like squirrels, foxes, wolverines etc. and, of course, other reindeer.<br><br>\nThis movie is more like a documentary as it is very informative to the viewer about the flora and fauna. Cute animals and beautiful scenic views of landscapes are concomittantly paired with finnish orchestral music, and both add to a very special cinema experience.","user":"mawiraven","rank":[3,5]}]