[{"title":"Gutwrenching","rating":8,"date":"16 June 2019","review":"I see a lot of gender prejudice here from folks who demand that others not be so prejudiced about gender. It doesn't matter whether young Victor Poster is cisgendered, transgendered, or androgynous, the performance in this role is nuanced, vulnerable, and entirely believable. I am shocked that people would criticize either Victor's sexuality or gender identification in their evaluation of the film. Victor is not a poster-child... victor is acting. And doing it beautifully.<br><br>Others seem concerned that the film oversimplifies a complex issue. But when you are a 15 year old girl in the wrong body, it is kind of simple. It's one girl's story and experience and pain and fear, not a testament to the entire world of being transgendered. You simply cannot try to cover all issues in one person's story. This is not a story about the general \"truth\" of being transgendered, it is the story, as titled, of a girl. One girl. One girl's experience.<br><br>I felt extremely moved by the end. I hope others appreciate this as a film... a story... and not try to judge it as some sort of manifesto or expect something more of it than it should be.<br><br>If we want to normalize all human experience, we need to stop demanding more from projects like this than we would of any other story of personal trauma or tragedy. Every person is unique, every person's life is their own and should stand on its own merits rather than being obligated to represent an entire diverse group.","user":"kay_rock","rank":[40,45]},{"title":"This is true cinematic brilliance","rating":8,"date":"16 March 2019","review":"Girl is the type of movie that will hopefully open your eyes and heart to the little known challenges that face someone caught in the wrong body. I fell in love with Lana almost immediately because of her sensitive, kind, passionate character. She brings you deep into her world of the pain it takes to hide her unwanted features with such elegance and composure. Even when egged on by fellow dancers she holds in her pain in hope of acceptance. Victor Polster is brilliant as the graceful and beautiful Lana. The determination, blood, sweat and tears it takes to be a ballerina is mind boggling but for Lara it is a passion she is not willing to give up on no matter what it takes.","user":"moveebuff1953","rank":[39,56]},{"title":"A poignant tale of a young transgender woman that could have benefited from a broader scope.","rating":7,"date":"6 September 2019","review":"It is difficult to review this film without referring to the performance and casting of Victor Polster as the Girl the title refers to. Both appear to be quite polarising. There seem to be many reviewers who feel his portrayal was brave, emotive and mature as an adolescent ballet dancer going through a transitionary period in her life in more ways than one: moving to a new school and meeting new people, moving to a different apartment, and, of course, the crux of the film, taking the next step in confirming her gender identity by taking hormones with a view to having gender reassignment surgery in the future. There also appear to be many people, mostly people who identify as either transgender themselves or part of the wider LGBT+ community, who think that the performance and casting is offensive and lacks the nuance that only a real-life transgender actor could bring to the role. Personally, I cannot believe I watched the same film as anyone who thinks that his performance was anything less than exceptional.<br><br>Ballet as an art-form creates beauty out of pain, patience and practice, and Lara's journey to become a better dancer runs in parallel with her journey to physically become the woman she believes she is. The routine physical exhaustion and bleeding toes she experiences whilst dancing provide a visceral contrast with the emotional challenges of day-to-day living she has to face, such as showering or going to the toilet, whilst living in a body that just doesn't fit. Victor Polster manages to convey these experiences and emotions, showing an intense determination and underlying vulnerability that never spills over into melodrama. The question of whether or not he should have been cast in the role in the first place is moot as it is evident that he was up to the task. Morally I do not see any reason why a non-trans actor cannot play a trans role if they have the ability to do so, in the same way that an actor does not need to have kids to play the role of a father or mother. I believe that he got the role on merit, in the same way that Daniela Vega got the lead role in A Fantastic Woman, because they were the best person for the job.<br><br>Where the film falls slightly flat, however, is that there are no other fully fleshed out characters apart from Lara, and although the film focuses around Lara's pain and experiences in the here and now, there isn't always a clear motivation for her actions. It isn't even clear why she is so keen on becoming a dancer in the first place. I'd like to have seen more of the father and younger brother and how their lives were affected by Lara's situation.<br><br>Ultimately it is a painful portrait of a young woman fighting to be who she wants to be that could have benefited from widening the scope and delving into the lives of other characters more in order to give more weight to the situations Lara found herself in. I also feel that the ending, although earned and wincingly effective from an emotional standpoint, didn't provide much closure and left the film feeling unresolved. Having said that, I have a suspicion that this was intentional as stories such as these do not have a cut-off point where the transformation is complete and the only resolution is the acceptance that there is none and that the fight must go on.<br><br>Definitely would recommend it.","user":"Doctor_Mongoose","rank":[8,9]}]