[{"title":"Best Movie Of The Year Thus Far....","rating":10,"date":"19 August 2019","review":"Let me first start off by saying I'm not gay and don't typically watch movies with gay images or titles. With that being said, I'm glad I didn't pass this one up. Definitely my favorite movie thus far this year.<br><br>We all grieve in different ways, but this one hit home. I mean how many of us try to open a new door without closing the existing one.<br><br>The acting was superb. The Mexican (Ernesto) reminds me of my uncles and grandparents in his work ethic and conscious of what they're being paid for.","user":"sidewaysintraffic","rank":[15,16]},{"title":"Indie Gem","rating":10,"date":"13 October 2018","review":"I was lucky enough to see the European premiere of 'Papi Chulo' at the London Film Festival. And what a wonderful movie this is. On its face, the tale of a lonely weatherman and the connection he develops with the Latino day laborer he hires to do some painting, on a deeper level it is a moving exploration of loneliness. Do not let that put you off, however. This is not a depressing movie; it has moments of true, laugh-out-loud comedy as well as moments of real tragedy that lead finally to a warm, hopeful ending.<br><br>All the performances work. Alejandro Patiño is very good as a man of basic decency and honesty who finds himself in some awkward situations and reacts in the best way he knows how - or, frankly, anyone could be expected to. But the movie hangs on Bomer's performance - he is in almost every scene - and he delivers and then some. Everything about the performance hits the mark, from heartwarming comedy to heartbreaking tragedy, Bomer clearly went all in, but avoids histrionics to bring to the screen a visceral, moving, touching portrayal of a man struggling to deal with grief and immense loss the best way he knows how. In a more mainstream movie (and a fairer world), I honestly believe this performance would garner awards attention.<br><br>John Butler's writing and direction are all thoroughly accomplished, exploring big themes via his main character's contained, personal story. The screenplay is beautifully paced, never rushing but never slow. There are highlight scenes both at the comedic end of the spectrum (the 'singing Madonna in the taxi' scene manages to be both moving and funny) and at the tragic (some of Bomer's finest moments in the film).<br><br>There is nothing showy about this movie - there's no big budget or effects - but it does what it sets out to do perfectly. I very rarely give a 10 to anything, but I give one to this because I honestly can't think of anything that could be improved within the scope of this film's ambitions. It is a thoroughly satisfying movie-going experience: it provides laughter and tears, gives food for thought on multiple fronts, and finds its way to a satisfying, but not trite, ending.<br><br>Congratulations to all involved. I hope this movie finds distribution deals that allow as many people as possible to see it in theatres, and fingers crossed for streaming distribution that will allow the millions of people to see it that it deserves.","user":"Sacotra","rank":[35,41]},{"title":"Adorable film","rating":10,"date":"16 October 2018","review":"This film is beautiful in so many ways.<br><br>Well acted and shows what happens when you lose a partner and how crazy you can become.<br><br>When he meets and has a friendship with the migrant worker it's so real. He doesn't want a Grindr hook up he wants a hug. A human that cares for him. <br><br>What I like about this film also is it's not all about being gay. The gay thing is just a trait. The friendship relationship with the married man is sweet and believable.<br><br>Some good laughs . A great film. Original.<br><br>Wonderful. Couldn't better it. Hence a ten.","user":"rolandcat","rank":[23,29]}]