[{"title":"A film every Irish person should see","rating":8,"date":"25 October 2018","review":"Tackling the current homeless crisis in Ireland, specifically in the capital city of Dublin, Rosie is as relevant and timely a film as you're ever likely to see. Directed by <a href=\"/name/nm0106456/\">Paddy Breathnach</a>, and written by <a href=\"/name/nm0236486/\">Roddy Doyle</a>, the film is an intimate character drama rather than an angry piece of protest cinema. Not concerned with pointing fingers at who may be responsible for this situation, examining why it is getting worse rather than better, engaging with the economic complexities, or analysing the wider socio-political implications, Doyle is instead more interested in imparting to the audience that homelessness could happen to almost anyone. Rather than evoke ire, he wants to evoke empathy, something that is, sadly, often lacking in our inured social media-obsessed society. For whatever reason, Irish society in general, and Dublin in particular, has become one of great bitterness, void of empathy for those struggling on the margins, and this film tries to go some way to addressing that. Unfortunately, the lack of major stars, the almost non-existent advertising campaign, and the grim subject matter will hamper its commercial prospects, and whilst I'd love to say this is going to be the Irish <a href=\"/title/tt0059020/\">Cathy Come Home (1966)</a>, enacting change on a grand scale, the chances are it will pass from cinema screens without much of an impact.<br><br>Set on Dublin's Northside over the course of roughly 36 hours, the film tells the story of the Davis family; mother Rosie (<a href=\"/name/nm2497366/\">Sarah Greene</a>), father John Paul (<a href=\"/name/nm3974805/\">Moe Dunford</a>), and four children - thirteen-year-old Kayleigh (<a href=\"/name/nm10157498/\">Ellie O'Halloran</a>), eight-year-old Millie (<a href=\"/name/nm9756236/\">Ruby Dunne</a>), six-year-old Alfie (<a href=\"/name/nm9758490/\">Darragh Mckenzie</a>), and four-year-old Madison (<a href=\"/name/nm9450235/\">Molly McCann</a>). Several days previously, the family were forced to leave their rented private home of seven years when the landlord decided to sell the property, and they are now effectively living out of their car. As John Paul works every hour he can washing dishes in an up-market organic restaurant, Rosie spends the day looking after the kids and trying to arrange temporary alternative accommodation by calling the numbers provided to her by Housing Welfare. However it soon becomes apparent that finding somewhere in the stretched-to-bursting system is not going to be an easy task.<br><br>Doyle began writing Rosie two years ago after listening to an interview with a woman who explained that although her husband worked full-time, the family were living out of their car, finding themselves with literally nowhere to go after being evicted from their rented accommodation. The woman emphasised that she never imagined such a situation for herself or her family, explaining that ordinary people don't realise how easily this can happen to them. And this is precisely the theme Doyle emphasises in the film. The Davis family are a completely normal working-class family, meeting none of the commonly held (mis)conceptions about the homeless, and the film challenges at every turn the stereotypical images we have of such people. In this sense, the film explores the extent to which the housing crisis has begun to cross class borders.<br><br>Rosie is a piece of social realist drama in the tradition of <a href=\"/name/nm0516360/\">Ken Loach</a> or <a href=\"/name/nm0201094/\">Jean-Pierre Dardenne</a> and <a href=\"/name/nm0201095/\">Luc Dardenne</a>. However, it is much less concerned with constructing a left-wing world-view than the French brothers, and far less melodramatic than recent Loach output. As with all social realist cinema, Rosie speaks to the privations of the working class, and voices a critique of prevailing social structures. However, the nature and target of that critique is less conspicuous than we often find in the work of Loach, <a href=\"/name/nm0005139/\">Mike Leigh</a>, or <a href=\"/name/nm0000944/\">Antonia Bird</a>, with the film placing more emphasis on private character beats than synecdochical situations.<br><br>One of the strengths of Doyle's script is that he has been able to transmute emotionless news headlines and dry statistics concerning the rising tide of homelessness into a deeply effective and emotional story which does, by all means, work as a call-to-action, but which is much more forcefully a call-to-care. Doyle is not interested in sermonising about the failings of the State, concerning himself much more with what the housing crisis means to real people in practical terms. Avoiding overarching socio-political protest, he focuses on eliciting empathy and compassion for a situation about which the majority of people simply don't care. In exploring this issue, his script is remarkable for its sense of restraint, avoiding condescension, cliché, predictability, and melodrama. Rather than the characters speechifying about their plight and the state of the country, they devote all their energies to simply getting through the day, dealing with each on-the-spot challenge as it arises.<br><br>However, this is not to say that the film avoids looking at how this kind of situation can exist in such a relatively wealthy country. For example, when John Paul attends an open-viewing for a house he and Rosie are thinking of buying, he finds the house crawling with people obviously more wealthy than himself, John Paul asks the real estate agent to put his name down, only to be told the house \"isn't really suitable for a family.\" The real meaning behind this remark is left unsaid, but the critique of gentrification is unmistakable. An extremely important scene in this respect is when Rosie visits her brother-in-law and his wife. When he refers to the family being homeless, she quickly chastises him, telling him \"don't use that word\", which speaks volumes as to cultural stigma and social labelling.<br><br>From an aesthetic point of view, Breathnach's direction is utilitarian, wisely avoiding any kind of directorial gymnastics which would draw attention away from the story. Which is not, however, to say that the film is visually uninteresting. One particularly well-blocked scene sees Rosie talking to a school principal, with the sequence shot in such a way that the two-shot is demarcated by a computer monitor, literally cutting Rosie off from the well-to-do world represented by the principal. The scenes in the family's car (which comprise a sizable portion of the film) are suitably cramped and claustrophobic, with a palpable sense of unrest growing ever more prominent as the film continues. In contrast, however, many of the exterior scenes are shot in such a way as to feel disconcertingly empty, with Rosie and her family often dwarfed within the frame, creating a real sense of hopelessness and swimming-against-the-tide. Additionally, almost the entire film is shot with handheld cameras, with a lot of the exteriors consisting of long single-take Steadicam shots which create a sense of urgency, as well as depriving the characters of any sense of the control with which they could be imbued by editing. Much of this works to enhance the film's prevailing aesthetic style, which is a kind of pseudo-cinéma vérité documentarian approach, with the on-screen milieu feeling completely authentic.<br><br>One especially well managed aspect of the film is how it deals with the task of ringing around the various hotels trying to find a room, going through the exact same conversation over and over and over again. Before we see any images, we hear a radio report talking about the homeless crisis, followed by Rosie ringing the first number on her list. Then the image fades in. This conversation becomes a refrain, and is continued throughout the film.<br><br>As for the performances, Greene is outstanding as Rosie, carrying the bulk of the film, and most of the emotional weight (a good 70-80% has her front and centre). Her attempts to remain calm in front of the kids, never losing her temper or chastising them for being frustrated with their situation, and her sorrow and regret on the few occasions when she does, are utterly heart-breaking. Her brave face slips a couple of times, and when it does, there is no sense of catharsis, no feeling of pressure being released. There is just sadness, and acknowledgement of her suffering. It's an extraordinarily subtle and layered performance of just a few emotional registers, but it's completely effective and rings completely true. The ever-reliable <a href=\"/name/nm3974805/\">Moe Dunford</a> is also excellent in the slightly under-written role of John Paul, imbuing the character with a warmth and fragility, especially noticeable in a heart-breaking scene in which he reveals to Rosie his shame at not being able to adequately provide for or protect his family.<br><br>Although Rosie is about a national crisis, it is also intensely personal. Doyle may not be outwardly concerned with the politics, but his sense of anger is unmistakable as he attempts to show that the ordinary and decent people of this country are being humiliated and degraded on a daily basis. In this sense, Rosie should make audiences angry. And it probably will. The problem is that it will have a very small audience. This is not Cathy Come Home being watched by 12 million people on the BBC. This is a small independent film playing on a few screens across the country, a film of which the vast majority of the cinema-going public have never heard. In the end, despite the fact that it's exceptionally well made, deeply affecting, and flawlessly acted, Rosie won't make much of a difference or have much of an impact. And that's a crying shame.","user":"Bertaut","rank":[43,53]},{"title":"this should be compulsary learning for every sosiology student in the world","rating":10,"date":"30 April 2019","review":"Oh, my god, what a wonderful, depressing movie, that really hurt every inch of my body to watch. it is neo social realism from ireland this time at top level. its about a family of 6, having been evicted from their rented home, and we follow them for a few days in their frantic search to get a roof over their heads. you shouldnt believe that this happens in these days in this part of our modern world.but after curious searching, i have come to know that in ireland only there are about 10000- 25000 people that are categorized as family that are somehow homeless or without a fixed adress. this number excludes single people,addicts,alcoholics,hobo's and whatever, its pure families, mum, dad, and children without the warmth and safety of home dear home.....<br><br>there are factors in the story, such as shame,angst to seek help from velfare offices in case the children being taken away, lots of pride, and most of all the need to feel like a normal average succesfull human being. they could have used family for help, but bad realations are here a hinder for a solution like that....nevertheless, its a major problem, and they must never be forgotten. i am not rich and have striven financially when kids were small, but weve been careful, and sober on what weve spent money on, and i learnt to hammer an 3 inch nail in a plank of wood when i was 23, because i had to. the big shame for ireland is the vast amount of ghost residencies ,empty houses and apartment that are not used . they can expropriate milions of hectars for road development,making car parks,or building paths for bikes and pedestrians, why not expropriate houses and apartments as well.??extreme,but i ask??? the saying'' living in a box'' has got a new explonaion for me, namely living in a aluminum box with 4 round rubber wheels under....<br><br>acting....extremely well done both the adults and all the children. i just wanda what deadly said stories were told to make them children look so supersad and depressed.the dialouges and symmetry and dynamics of the acting a trully brilliant, i can only wish that this should be the candiate from the irish film board for the next academy awards 2020.<br><br>the grumpy old man are nearly exploding of mixed emotion after watching such a darn well made movie, and should have shared so much more, but the language barriere are to big and mjy fingertips are qiute numb at the moment, so have a look at this flick yourself,and please forget your besserwisser part of yourself and place yourself under the excact same emotional way the characters does.. its tough and it is an eyeopener en masse'..highly reccomended.","user":"ops-52535","rank":[24,35]},{"title":"Sharp and blistering indictment of social and economic inequality: desperate times in Dublin","rating":7,"date":"3 August 2019","review":"\"Rosie\" (2018 release from Ireland; 86 min.) brings the story of Rosie and her family: 4 kids ages 3 to 13, and her partner John Paul. As the movie opens, we hear in voice-over TV clips about the shortage of affordable living in Dublin, with lease rates skyrocketing. We then see Rosie and her 4 kids in a car, as Rosie calls around to various cheap hotels for a room, but to no avail. Meanwhile, Jean Paul is working as a dish washer. Just as the situation looks to be really bleak, Rosie manages to find a hotel room for one night. The whole family crashes in the hotel room, and from the looks of the hotel, they are not the only family staying there... At this point we are 10 min. into the movie but to tell you of the plot more would spoil your viewing experience, you'll just have to see for yourself how it all plays out.<br><br>Couple of comments: this movie is directed by Irish director Paddy Breathnach. Here he brings the story of one fictional family whose lease was terminated by a landlord looking to sell and cash in on the red hot real estate market in Dublin. With a shortage of affordable housing, Rosie and her family are unable to find another place to rent, and now rely on government assistance to stay in cheap hotels, assuming they can find a vacancy. This is truly a family that is barely, but just barely, hanging on by the skin of their teeth. Along the way the family encounters social issues, such as the kids that go to school, where it is quickly noticed that something isn't quite right. At one point the school's head mistress asks Rosie point blank: \"Are you living in your car?\", to which Rosie with indignity responds \"we are not homeless! we're just lost for a bit\". As much of the film plays out in the car, Breathnach does a great job giving us a sense how difficult and cramped everything is. Sarah Greene as Rosie is nothing short of masterful as she conveys the frustration, anger, shame and love for her family. Please note that the acting performances are in full-blown Irish accents, and there were a number of conversational exchanges that went completely over my head.<br><br>\"Rosie\" premiered to great acclaim at last year's Toronto International Film Festival, yes almost a year ago. The movie popped up out of the blue at my local art-house theater here in Cincinnati, and I couldn't wait to see it. The Friday early evening performance turned out to be a private screening: I was literally the only one in the theater. Given the bleak nature of this movie (there is, literally and figuratively, not a ray of sunshine in this movie), I cannot imagine this can last more than a week in the theater. That said, there is a reason why this movie is currently rated 97% certified fresh on Rotten Tomatoes. I found it a challenging movie, in the best possible way, and about as far away as possible from this summer's never-ending wave of super-hero movie, sequel, prequels, Disney re-imaginations, and on and on. \"Rosie\" is HIGHLY RECOMMENDED.","user":"paul-allaer","rank":[10,14]}]