[{"title":"The torment behind the genius","rating":9,"date":"24 March 2019","review":"As Salvador (exquisitely played by Antonio Banderas) says in the movie \"A great actor is not the one who cries, but the one who knows how to contain the tears\" and I think that describes the movie perfectly, you feel the pain in every scene but never get the chance to let that emotion overcome, it's a beautiful and raw portrayal of life in a way we've never seen Almodóvar do before, the film breathes a diaphanous simplicity and spontaneity, far from what we're used to see from the filmmaker. Every aspect of this movie felt very personal and intimate, almost like reading someone's diary while it's being written or someone sharing a part of their soul, i'm sure this movie wasn't easy to make.<br><br>This is a story about pain, sadness, solitude, self discovery, forgiveness and regret but most of all, it's a movie about overcoming and I honestly feel this is one of his best works in recent years.","user":"LenaKrones","rank":[259,304]},{"title":"He couldn't pick the better name for this work.","rating":10,"date":"31 March 2019","review":"The story about the artistic crisis and depression. Once the noise of the glory goes away, there's nothing but emptiness and pain inside.\nAlmodóvar has created this autobiographical masterpiece during his darkest and the most lonely moments in his life. It's different from everything that the genius had shared with the world before.\nFeeling of loneliness and pain in every scene, that makes a glory so unimportant and empty, when you have no one to share it with. The director made the audience hold the breath while he was speaking and sharing his most intimate secrets, his memories and regrets about the past.<br><br>Endless respect for Almodóvar for making this autobiographical movie so personal and sincere.","user":"ulzhana-32986","rank":[149,189]},{"title":"Almodovar is back to his best form.","rating":10,"date":"31 August 2019","review":"With this gorgeous and unashamedly autobiographical memory piece, Pedro Almodóvar returns to his very best form and certainly gives us his best film in over a decade. \"Pain and Glory\" finds director Salvador Mallo, (Antonio Banderas in a career-best performance and clearly modelled on Almodóvar), looking back over his life and loves as he deals with his addictions, his chronic pain and a newfound appreciation of his work. It's a film that is both honest and deeply moving but one that is often very funny, too. Almodóvar wouldn't be who he is without that wicked sense of humour that made his early films so enjoyable but this is an altogether deeper and more profound film than anything he's done in years.<br><br>Cross-cutting between his childhood with a loving mother, (Penelope Cruz, wonderful), and a largely absent father and his present as he revisits his past in the form of the men in his life, the actor who once let him down and to whom he hasn't spoken in 30 years and the former lover who comes to visit. Salvador is a man determined to lay his ghosts to rest as I am sure Almodóvar wants to here. Banderas, as I said, has never been better and as the men in his life, Asier Etxeandia (the actor), Leonardo Sbaraglia, (the lover) and Cesar Vicente, (the boy who becomes Salvador's 'First Desire') are all outstanding while both Cruz and Julieta Serrano perfectly capture his mother at different stages in his life. This is a remarkable film from a great director too long absent from our screens and one we thought long past his best. This is proof he's home and hopefully, home for good.","user":"MOscarbradley","rank":[54,65]}]