[{"title":"A good time and worth seeing.","rating":3,"date":"3 July 2019","review":"What a shame almost no one on this planet saw this movie as of now.\nIt didn't get a proper release, but it should have. Peel is a low-budget indie film with a bunch of heart and very good performances, and it doesn't try too hard to be emotional. Emile Hirsch is great in this.<br><br>Overall there was potential here for an even better story but it's worth seeing still and I definitely recommend it to anyone who likes a cute and fun flick with something to say. It's a good time.","user":"CitizenDevi","rank":[4,4]},{"title":"A movie that you should persevere with","rating":10,"date":"19 May 2019","review":"I see there are reviews that rate this movie 10/10 and other that rate it 3/10. So it was lucky that I decided to give it a chance and I am glad I did, I guess that those who complained about the movie's tempo were watching the first half and switched off. Which is a shame because the beautiful part of the story only kicks in during the second half. For those who stuck it out, it could be because they could relate to Peel's character. Retard, not grown up, innocent...whatever you want to call him. I have met those like him and that's why I immediately formed a bond with him. The scenes after his Mother's departure really broke my heart. And when he was being taken advantage of, I was feeling pity for him. During the time, he somes up with the idea of finding his two brothers, whom he has not seen in 25 years.<br><br>The second half of the film sees Peel finding and meeting his oldest brother William, who is now married with two kids, living a suburban life. We immediately see that Peel is still, more or less, the same child when his Brothers were taken away. And this made my heart ache. Even though he tries to hide it, you could see William being brought back to his childhood emotionally.<br><br>The scene that really steals the show is the meeting between Peel and his second brother, Sam. There was one line from Peel that highlighted the movie's core message. This was when he said, \"I'm happy you're still alive\".<br><br>For those of you who haven't caught on yet, this movie is all about family. We see a family that is suddenly broken up at the start of the movie. And yet, Peel, with his limited IQ, is the one who reunites the family again. How many broken families remain broken in this world due to each other's sense of pride? How many families fail to reunite due to members having passed away untimely? It is precisely because of Peel's immature state of mind that he is the one who lacks any kind of adult-associated pride and is able to just go and open his heart to his brothers.<br><br>The end scene sees Peel writing a letter to his Father whom he last saw when he was just 5 years old. In it, he says:<br><br>As for you and Mum...\nEven though you guys didnt work out, I know she loved you, at least the young you\nShe used to say she loved the man she married, but not the man she lived with\nShe always said it with a smile but I knew it made her sad<br><br>\nAnd these few words sum up very nicely the feelings that so many of the world's married couples feel about each other.<br><br>I am glad I watched this movie because it carries so much more weight and poignancy that some of the reviews give it credit for.","user":"mchan-29405","rank":[8,10]},{"title":"A subtle, nuanced coming-of-age story","rating":9,"date":"7 May 2019","review":"Think \"Being There\" with a dose of \"Napoleon Dynamite\", this beautiful film is an homage to the human condition and our struggle to belong. The performances are nuanced and restrained while managing to deliver a powerful emotional punch. I was left with the undeniable feeling that we are all truly \"enough\"; that it is okay to come as we are. That we can be loved regardless of our idiosyncrasies and weaknesses. If you are open to its subtle messages and quiet, teachable moments you too will be astounded by its impact.","user":"julieaglassman","rank":[11,15]}]