[{"title":"Oops","rating":1,"date":"10 September 2018","review":"I mistakenly watched this because I thought this was The Meg, dumb I know, but it is based on a similar premise. I should have realised when I noticed Michael Madsen was in it, he is usually only in bad movies and this was bad, with a capital B.<br><br>This is so bad that I would have turned it off after 10 minutes, but my partner was liking it, so, regretfully I had to endure the whole thing.<br><br>I love shark movies, but this one is not worth watching at all. Everything about it was just wrong.<br><br>Avoid like the plague.","user":"nowego","rank":[29,31]},{"title":"Waste of film footage","rating":3,"date":"7 September 2018","review":"This was such a bad movie from the acting down to the ridiculous storyline. \nEven Michael Madsen gave a poor performance. It was like he didn't want to be in the movie at all. I got a little better than 2/3 of the way through and I gave up...couldn't bear to watch a single more scene.","user":"Bugsy_b","rank":[13,13]},{"title":"Steamy pile of crap","rating":1,"date":"14 August 2018","review":"I couldn't get past the first scene. Not because the CGI looked like it was made by a highschool kid learning digital video production. \nBecause it starts with a bunch of Naval personnel on the deck of a boat in formation, no hats on, some at attention some in something between attention and parade rest. Then the commander Michael Madsen walks out and holy shit he looks like he just rolled onto the set after a 4 day bender in Vegas. This supposed naval ship commander's mullet is showing from under hit head gear. Which has a giant bird shaped emblem on it that was stolen from a 1950s car hood. Hes got rings on like a pump and his uniform looks like he just pulled it out a hamper and threw it on. I got as far as the next scene where everyone is saluting in doors and nearly threw my remote through my TV.\nIf they couldnt pay for good graphics or a decent plot, They could have at least spent 100 bucks on some naval veteran at the very least to help look an actual military service FFS.","user":"ninaarrastia","rank":[47,54]}]