[{"title":"It gets too many things wrong","rating":4,"date":"20 August 2018","review":"The vitamin \"B9\" that is added to bread is not folate, it's folic acid. Most people can convert this to folate which is the usable form of B9, but there are many mutations )(collectively called MTHFR mutations) that impair this process and make folic acid do more harm than good. <br><br>The same is true to some extent for the conversion of beta-carotene to vitamin A. The best source of vitamin A is liver.<br><br>Same idea again for vitamin K. Plant-based K1 needs to be converted to K2 in your body. Some bodies are better than others at doing this. Fermented foods and pastured animals are the best sources for the two types of vitamin K2 - MK4 and MK7. You probably need both for optimal health.<br><br>Same idea once more with Vitamin D. Some people are better than others at converting cholesterol to Vitamin D in their skin - if they even spend enough time outdoors mid-day.<br><br>The one thing the film gets right is that vitamins should be consumed in their natural context. Supplements might prevent the most severe deficiencies but it's a gamble.","user":"alex-curpas","rank":[18,23]},{"title":"Low on actionable conclusions, high on silly child songs","rating":2,"date":"18 August 2018","review":"15% childish songs and animations\n70% personal stories about how too much of a vitamin or too little was either good or bad\n10% travel to locations to see fish/sheep/ice\n5% facts and science and conclusions and actionable info<br><br>I wish the movie was more serious and shorter, much like the Veritasium videos the host makes. Unfortunately it isn't. It has several multi minute long made up \"children's songs\" along with horribly childish animations. It's almost like the producers were afraid to put too many facts or conclusions or opinions into it.<br><br>It started out by stating how many people take multivitamins and then asked the question, \"should you take them, how do you know?\" But it never really answered this question and ended with \"If you take them, take them seriously... fade to credits.\". Sigh.","user":"Sembiance","rank":[21,32]},{"title":"Well paced, unpretentious and informative","rating":8,"date":"19 August 2018","review":"I found this documentary refeshingly unbiased and unmanipulative, showing what we do and don't know about vitamins without pushing an interpretation on the viewer. I highly enjoyed the playful instances of song and colorful, but unintrusive, animations. The anectodal stories are made relevant by statistics and add an engaging dimension to facts instead of just playing on feelings to convince the audience of a pushed viewpoint. I found the whole narration very NVC and trustworthy and the information well-packaged and pedagogical. \nI appreaciated this documentary enough to go and pay for it after having watched a pirated copy, and it was good enough to actually make me think about my life choices and multivitamin consumption.","user":"Dmtafra","rank":[8,12]}]