[{"title":"Better than Some","rating":5,"date":"16 November 2019","review":"I found some of the other reviews on here a bit harsh. I actually quite enjoyed this one. It certainly had a bit of a retro feel to it and was tongue in cheek at times. At times sit brought to mind the Lost Boys and Fright Night, just don't over analyse too much and enjoy the ride.","user":"fatfil-414-451797","rank":[19,25]},{"title":"Kinda cool","rating":5,"date":"19 November 2019","review":"This one screened at some cool film festivals and had some cool people involved so my expectations were a little high but I was not entirely disapointed with the film. Some of it felt amateuish but other parts were quite interesting. I liked the kinda fresh take on vampire movies but felt that the bullying themes were a little on the nose and annoying.","user":"Teddy-Bear-Picnic","rank":[10,14]},{"title":"It's Vampires","rating":5,"date":"16 November 2019","review":"This is basically a worse version of Fright Night. The production on this isn't all that bad, admittedly. The people behind this, the actors in general, they're not terrible. It's just that the idea is...far fetched, to say the least.<br><br>The film starts off with a random guy in the woods, being hunted by a vampire. He's bitten, then it IMMEDIATELY turns from night to day, vamp dies in the sun. Guy is stuck out in the sun, sees said shed, makes a run for it. All the while blatantly ignoring that many parts of his body are in bright, broad daylight, which is shown to cause severe burning and turned said first vampire into dust on the spot moments earlier.<br><br>From there, it's just basically story tropes designed to explain why the vamp stays in the shed, his eventual release from the shed, multiple vamps being created, leading to a showdown in the house one night against said vamps.<br><br>And the vamps are both fast, intelligent, and shown to be more than strong enough to break through wood and what not, but it seems to keep slowing them down regardless, and of course, said shed is made entirely of wood yet holds the main one in there just fine.<br><br>The actors in this, imo, are all quite good. They could definitely have bright futures ahead of them. They just need to stay away from productions like this.","user":"roughdom","rank":[11,16]}]