[{"title":"Close Encounter of the Worst Kind.","rating":3,"date":"16 March 2020","review":"After a year of having their 8 Years old daughter gone missing, a family is hunted by an alien abduction experience the same night their kid went missing, by knowing this you can easily skip the first boring pointless 15 mins of the movie without affecting the story in anyway.<br><br>The film feels stretched out for no reason without a story to hold this stretch together...very slow shots, slow actors movement to force the film it into a 1h 37min full feature, I believe it'd have been a much better experience if it was summed into a short film. The acting felt cold according to what the characters are going through.<br><br>The main disaster of the film is the cinematography lighting techniques which makes it lose all its credibility! The film is meant to take its most main events night time, yet the amount of ridiculous lights inside and outside the house \"even during the blackouts\" is least to say laughable, not to mention the fog, the colorful lights and the \"extremely\" loud noise of the alien vehicles. It's like the director and writer didn't even care to spend any time studying or at least reading about any real abduction or encounter experiences.<br><br>The ending although unexpected, it feels unrealistic, uncalled for and mainly not what the audience are looking for when approaching a \"Dark Encounter\" film to end up being just a dramatic based crap.","user":"Impartial-Critic","rank":[33,43]},{"title":"Excellent until it fails at the 3/4 mark","rating":4,"date":"23 October 2019","review":"This is what you get when the writer of the story is the editor of the story and the director and the producer. There's no one to tell him, \"hey, this is not good. You need to fix that.\"<br><br>All around the movie is surprisingly good. The acting was believable, the characters and characterizations are good, the sets are good, the continuity was accurate, the music was extremely good, and the special effects were adequate to the job. Many bits and pieces are lifted from movies like Close Encounters and Signs, but that's ok too.<br><br>The first 3/4s of the movie are edge of the seat chills and thrills, but then the story shifts in a totally unexpected direction. This is considered \"the unique twist.\" The 'twist' is something that modern scriptwriters seem desperate to pull off and almost none of them actually do it. The Sixth Sense may be the last movie where it really worked. In this particular movie, the writer/editor/director/producer throws in the monkey wrench without the slightest attempt to justify it except to offer a lame, \"I don't know. We don't understand it. We may never understand it.\" It's Aliens, so sure, how could we understand it? But that's just not good enough. The motivation fails. Why the Aliens do what they do makes no sense unless you just accept \"well, they are aliens, so their motivation is alien.\" That may be fine for people who shut off their brain to \"enjoy the movie,\" but for people who enjoy the movie by thinking about it, it doesn't work.<br><br>The plot twist does not ruin the movie but it leaves an unsatisfied feeling that a good storyteller would not leave. If you don't mind being let down by the ending and being left scratching your head trying to make the nonsensical reasoning, it's worth a watch. There are a lot worse movies out there.","user":"jmstettner-83145","rank":[30,45]},{"title":"Close Encounters of the Third Kind meets the Polly Klaas Murder","rating":7,"date":"23 October 2019","review":"This review is marked as containing spoilers and I'd like to underscore that here. DO NOT READ this review if you want to avoid spoilers. You have been warned.<br><br>DARK ENCOUNTER is probably the strangest movie I've ever seen.<br><br>In 1980s Pennsylvania an 8-year-old girl, named Maisie, disappears from her family home while her parents are out. She isn't found.<br><br>On the first year anniversary of her disappearance, the remaining members of her family consisting of her father, mother and brother together with several aunts and uncles, return to the family home after a small anniversary ceremony. That evening, Maisie's father Ray sees some lights a little ways away and assumes its troublesome neighbor boys playing with flares again and begins to set out to have a \"pleasant talk\" with them. Since Ray has a reputation of interacting with people in unproductive ways and therefore needs constant chaperoning, every single male family member/relation pile into Ray's truck to make sure things proceed \"pleasantly\".<br><br>As soon the country truck full of guys arrives in the area where the supposed flares were observed, weird, alien-related things start to happen and people begin disappearing in the de rigueur, alien-abduction sort of way.<br><br>Meanwhile, back at the ranch, literally, the stuck-at-home women begin having peculiar experiences of their own, frightening though less dramatic.<br><br>The remaining male members soon return home and a regulation alien siege sets in.<br><br>When the alien festivities begin to wind down, there's only 3 family members left un-abducted and they're picked up by the local police whilst trotting down a local road. Just tryin' to get away.<br><br>The police return the 3 remainders back home and get a description of the night's events from them. The police then leave making a promise to return within an hour more prepared to deal with the situation. Not long after they leave, during broad daylight, the alien-driven party activities recommence, only this time the alien's motivation is revealed.<br><br>Super spoiler alert: the aliens have come to bear witness and give testimony against the perpetrator of the disappearance and murder of little Maisie. As it turns out, it's one of the uncles. Ah, well. There's an uncle like that in every family.<br><br>On the positive side, DARK ENCOUNTER is a spectacularly well-executed movie. Production values are top-flight, the cinematography simply could not be better, the ambience of alien-ness, the spooky music and so on are all excellent.<br><br>What REALLY didn't work for me is the bizarre story. We're supposed to buy into the notion that an ultimately-advanced alien race apparently makes an epic larger-than-the-scale-of-the-universe journey (depicted in the movie as a 1977 POWERS OF TEN--esque sequence) to drop dime on a human child killer.<br><br>But first, rooroo. The aliens only reveal their altruistic motives AFTER hot rodding around in their space hot rods and torturing the dumb-animal humans for a night and a day in their inimitable, straight-out-of-CLOSE-ENCOUNTERS-OF-THE-THIRD-KIND space-alien custom. Appliances freaking out, toys going on walk about, all sorts of blinding, purty lights blazing in through windows, kidnappings and so on. Why, the space aliens are so clever and advanced that in one scene a woodblock-full of knives, pointy end first, go streaking across the kitchen to embed themselves half-way to haft into a wall. The only reason they didn't bury themselves to the hilt in the youngest family member is somebody else pushed the kid out of the way just in time. THWACK ning-ning-ning-ning-ning-ning!<br><br>All this bizarre stuff with good music and stunning cinematography makes pretty entertaining viewing but as a story it makes no sense at all. It's very similar to CLOSE ENCOUNTERS OF THE THIRD KIND in this respect. In fact, the only salient difference between CLOSE ENCOUNTERS and DARK ENCOUNTER (yes, even their names overlap) is that in CLOSE ENCOUNTERS, the space aliens went on a human-hazing spree as a lead up to puttin' on a formal meet-and-greet, while in DARK ENCOUNTER the aliens went on a human-hazing spree as a lead up to ratting out a child killer. Space-alien shenanigans are very entertaining and I enjoyed them for their own sake because they're scary and creepy. From a story perspective, it makes no sense at all unless you're down with viewing super-advanced space aliens as nothing more than highly evolved and technically proficient juvenile delinquents. Maybe with tentacles. If human beings engaged in the same kind of behavior as the space aliens they'd end up doing some sincere jail time.<br><br>It is however such a well-made movie that, while it can be a little slow at times, I still recommend it.","user":"S_Soma","rank":[24,36]}]