[{"title":"my true review","rating":1,"date":"4 February 2020","review":"Fantasy none, Mystery is why did they make it, a lot of irrelevant Drama 100%, I skipped through the boring crap, weak storyline which has been used many times before, very drawn out slow going, total garbage from all unknown actors, its like watching cement/paint dry<br><br>Let me explain why I use a lot of irrelevant Drama for reference with my other reviews.<br><br>Good films/movie's spend a lot a money making these films. It appears the film/movie makers set the genre considering they are making it.<br><br>They must make the storyline if no one has watched it. Therefore there are loads of genre's I like. Action, Crime, Fantasy, Horror and Sci Fi.<br><br>I rate all my films from the genre given.<br><br>When I watch them if they don't meet that genre then the rating can drop to 1 as you can't rate 0.<br><br>I also like a good Comedy. To me a comedy is supposed to make you laugh or the low point smile a lot.<br><br>Every Comedy film I've watched some are Comedy only which makes even more of an insult. You don't even smile, that's US Comedy for you when they laugh at anything.<br><br>That's why the get a lot of irrelevant Drama %. to me irrelevant Drama is when they talk about anything useless of storyline that has no interest what so ever. So the more irrelevant Drama there is means they are reading a bad script or the storyline has no good foundation, they are just filling in in time.<br><br>The other factor is the play time for the film. The average play time is around 90 minutes 1:30. To 1:30 is a good time to watch a film. There are plenty of films with play times of 2 hours or more, they use irrelevant Drama just to pad it out.<br><br>I saw a new film listed on here its was Drama only for 2:30 hours with no god storyline. So who in there right mind want to site a cinema for 2:30 watch crap?<br><br>This site is good for making reviews if no one has made a review. You have to get all the text you want to say correct the first time before it goes for checking.<br><br>If it is accepted then that's find, but there is no edit option to add additional info you may have missed.<br><br>The bad thing if someone has made a review which is totally wrong to the same film I've watched you can only click yes or no was this useful.<br><br>You can't post the good review which again is bad for any site. If there was 2 reviews then you click which one was useful. No just read the only one posted and make your mind up.<br><br>I post my review for SEAL Team as there wasn't one. it shows good, now its disappeared because someone post their review 13/01/18 so my true review is missing. There wasn't a review that's why I posted mine, so how come this 2 year old review no shows?","user":"keithstanier","rank":[1,2]}]