[{"title":"It's not electrical","rating":4,"date":"22 June 2018","review":"The film opens with a serial killer of women and then jumps to an airplane flight. Our job is to figure out the connection without reading the by-line. The flight is in a permanent storm that follows them from LA to NYC. We are introduced to several of the characters on this very small flight, a plane that appears to be smaller on than inside than what the plane model would indicate. Quickly a passenger sees a strange \"Dutchman\" and his name is not Bob Wilson. The passengers have visions and start to put together clues. <br><br>This is an Asylum film. Not the worst horror film. Something slightly different, but still with a feeling of going nowhere. Not as good as \"Airplane vs Volcano\" but not as silly either. <br><br>Guide: No swearing, sex, or nudity.","user":"nogodnomasters","rank":[10,11]},{"title":"Tech advisor where are you? Biggest oops of all time!","rating":4,"date":"7 December 2018","review":"I have to admit even though for a \"B\" movie it was entertaining. If there is a lower catagory then it belongs there. Definitely seemed like it was a college student making this flick for a class project or something.<br><br>I do give them credit for showing the correct plane and cockpit set up but that's where it ends and the technical gaffs abound. For one that plane needs 3 pilots to fly it. They were missing their Flight engineer. Many smaller gaffs in the script for the actual flying and procedures but the biggest gaff of all, the biggest movie mistake of all time that I have ever come across is that the whole time while they were flying.....the cockpit sliding windows were open !!!!!! Tech advisor where are you????? All of the interior cockpit scenes where shot with the windows open. Initially this was probably done for the pilot close ups but then someone was supposed to close them.","user":"theperaltateam","rank":[6,6]},{"title":"The CIA's newest enhanced interrogation technique","rating":1,"date":"5 June 2018","review":"The scariest part of this film: knowing that investors will not see a return on their money. I believe that the director of this film has never been on a flight in his life. There is wayyyy too much space between the seats. There's a bunch of open seats. All the internal lights are on throughout the entire flight even though it's supposed to be a red eye flight. The captain and first officer somehow wear the same rank on their uniforms. And, there's a sequence in which the plane loses power, stalls, and spins for 30+ seconds, and when the pilot regains control of the aircraft, they are still somehow surprisingly at cloud level. Furthermore, the O2 masks do not drop from the ceiling. I'm pretty sure a 13 year old did all the research for this film and wrote the storyline. Watch only if you have 90 minutes of your life to waste.","user":"michaelreschke-56978","rank":[15,18]}]