[{"title":"OK considering the budget.","rating":4,"date":"19 December 2018","review":"I actually liked the new take on Krampus as more of a human entity, and enjoyed the fact it wasn't just a slasher. Even though it was low budget they managed to cast a couple of decent actors with some credits behind them (Maria Olsen and Anna Harr). The rest of the actors ranged from adequate, to over the top bad. The bad consisted of actors trying to pull off dialects and accents that were beyond their ability, to the supremely annoying and over acted stuttering character of Bram.\nTo sum it up worth a watch if you don't expect too much given the budget, also if you're a gore fan you will definitely be disappointed.","user":"lordofthewrenches","rank":[5,5]},{"title":"Rather dull and low-budget Krampus feature","rating":5,"date":"27 December 2018","review":"At the end of WW I, the new teacher at an orphanage finds that a lost trinket sent by her husband from the war has been used by the curious children living there to summon the mystic demon Krampus who begins a deadly rampage at the location forcing them to band together to stop the creature.<br><br>While it does have some flaws, there are some positives here. The most likable element present is the rather nice backstory throughout here, which manages to include some intriguing real-life connections. The opening in WW I, with the soldiers shown infiltrating the German bunker to stop the creation of the creature as the scientist attempts to bring it to life, gives this a solid lead-in to the scenes at the orphanage where the same materials infiltrate their grounds starting up the creature's return. This is all handled rather nicely here as the build-up of the life at the orphanage as well as how the introduction of the summoning artifact to the building takes place provides a pretty intriguing start to this one. Once the introduction has been handled, this one does pick up rather nicely as the terror of their newfound visitor carries a lot of weight. With all sorts of strange maladies and physical interactions caused by his presence while in human form introduced at first, there's a nice setup present here that gives way to the creatures' attacks in the final half of the film. As the creature starts to get more involved with chasing down the kids and the other staff members, the darker lighting and mystic fog that sprouts up offer somewhat creepy images as the creature walks through the dark corridors trying to stop it while the occasional flashes to the group preparing their own vigils against it. These here are what hold it up over its flaws. The main flaw in the film is that the low-budget nature of this one shines through rather prominently, giving off a pretty overwhelming tone throughout here. The few soldiers used to denote the war taking place, the singular location of the orphanage and the utterly awful CGI used for the Krampus which looks like cut-scenes from a video game all come off truly apparent of what it's like here. The bland pacing and overly cheesy storyline don't help much, and there's a pretty blatant series of simple sets where it's placed at just hamper this one down as well. The other problem here is the sloppy and utterly underwhelming finale, which has no real bearing on the storyline brought up previously as the inclusion of mysticism and spell-casting is just lame, and the flat-out abrupt ending is simply jarring with the way it's handled. These here are what hold this one back.<br><br>Rated Unrated/R: Graphic Violence and Language.","user":"kannibalcorpsegrinder","rank":[2,2]},{"title":"Wrong from the get go.","rating":8,"date":"8 November 2018","review":"The movie's introduction states that the action commences in December 1918. However by that time actual WW1 hostilities had ended on November 11, 1918.","user":"iantom-33158","rank":[6,12]}]