[{"title":"I'm The Writer and Director of Witnesses - Christopher Burgart / NO SPOILERS","rating":10,"date":"11 September 2019","review":"Hi,<br><br>If you're reading this you've watched, or have some interest in watching Witnesses - either way, thank you!<br><br>When watching or reviewing, keep a few things in mind:<br><br>Yes, Witnesses is a THRILLER that bleeds into the horror genre, shot in the found footage style.<br><br>Found footage is such a polarizing shooting style - you either embrace the sub-genre, or despise it. Taking that into consideration, we eliminated from Witnesses many of the elements people hate. First, we gave the characters a plausible reason for filming. Sure, you're going to find some shaky camera and smash cut transitions, but very minimally. They are only included as a nod to the genre and not found throughout the movie.<br><br>All that said, I went in realizing that you cannot please everyone. Pick any movie and you're inevitably going to get your haters. But those that have watched it without preconceived notions, or certain expectations, generally like it.<br><br>Of course you're entitled to your opinion. Your taste in a movie is completely subjective, but I am presenting this message for your consideration when thinking about what you watched, or what you will watch.<br><br>We did not go in expecting an Oscar win. This is a movie, not a film. It was our intention from the start to make an entertaining VOD movie and we think that was accomplished.<br><br>I hope you enjoy(ed) it!<br><br>P.S. Yeah, I gave it 10 out of 10 Stars, because it's mine, and I'm biased.","user":"christopherburgart","rank":[36,60]},{"title":"Found(in a garbage) footage","rating":1,"date":"16 September 2019","review":"One of the worst movies I watched. Poorly made with awfull dialogues and bad effects. Just a bad experience overrall.","user":"zanellasguilherme","rank":[7,9]},{"title":"Nothing happens until 1h mark","rating":1,"date":"29 September 2019","review":"Seriously nothing happens just some Chad acting like an asshat creep to his friend and the actors interviews. Nothing suspenseful, just nothing.<br><br>\nDon't lose an hour of your time and just skip until they get into the warehouse at the 50-60 minutes mark until the cartel guys show up you will miss nothing of substence.<br><br>\nSo i went and finished the movie. The only thing worth watching are the last 20 minutes but at this point why bother. Absolute garbage of a movie.<br><br>\nBad script, bad actors especially the lead girl, the cartel guys are awful, little to no suspense, kills are unsatifying, ending is awful. Seriously this is a warning to everybody listen to this review and please don't waste your precious life watching this probably in my top 5 of the worse movies i've even seen, it feels like a youtube movie made with 500$.","user":"rarepeperonis","rank":[5,6]}]