[{"title":"Annabelle wastes $10","rating":4,"date":"28 June 2019","review":"Maybe I've seen too many of The Conjuring films now - seven in total with several more on the way, such as a sequel to the excoriable The Nun and The Crooked Man. I even sat through the barely connected The Curse of La Llorona. It's co-written and directed by Gary Dauberman, who wrote the remake of It, as well as Annabelle, Annabelle: Creation and The Nun. Original creator James Wan is the other writer as well as the producer.<br><br>Back in 1971. demonologists Ed and Lorraine Warren - back again at least for a brief cameo to drag you into the theater - are bringing the possessed Annabelle back to their home. Before they even get it there, it brings all manner of hell after them in a pre-title sequence that really has nothing to do with the rest of the movie.<br><br>After Father Gordon - coming back in another call back to the first two The Conjuring movies - blesses a box for the evil doll, we fast-forward a year to the Warrens bringing in Mary Ellen (Madison Iseman, Jumanji: Welcome to the Jungle) to watch their daughter Judy (McKenna Grace, who has made something of a career of playing the young versions of characters - she was young Captain Marvel, as well as the child versions of Sabrina on the new Netflix series and Theodora Crain in The Haunting of Hill House).<br><br>Judy is able to see all manner of ghosts and spirits, like a priest that keeps following her and later protecting her. He's Father Michael Morrisey, playing by Gary-7, who will probably get involved in a later The Conjuring movie. Or maybe not. Sadly, I'll probably be there the first night with the vague hope that this will finally be the one that equals the original.<br><br>Mary Ellen's friend Daniela decides to visit the Warren house, as she wants to speak to the dead, specifically her father, who recently died after a car crash. She was the driver and blames herself, which brings her into the Warren's hidden sanctum of the scariest and most sinister of all occult objects. She ends up touching everything and leaving Annabelle's container wide open, showing that not only is she a moron, but she also has no idea how to read. Finally, she uses an artifact called the Mourner's Bracelet, which certainly will play a part in another film. That's all these movies have become, a kickoff to the next film which introduces the next character which tells us all about the next character for the next one. I get it. I've been paying for it ever since the second one.<br><br>Anyways, this dumb teenage girl is like, maybe my dad will talk to me through something in this room, which means that Annabella is able to gather all of the other spirits and attack, spirits who I will eventually pay to see their own movies and buy their DVD's, like a ferryman, a bride, a samurai, a hellhound called the Black Shuck - no, not the song by The Darkness - and, of course, a copy of Milton Bradley's Feeley Meeley game.<br><br>Actually, the Black Shuck is based on a famous Warren case - which is the same as me saying that I have cases when all I'm doing is lying about ghosts - where a werewolf was killing local livestock. Kinda like the chicken that gets it here.<br><br>Everybody gets attacked by different spirits, like Bob dealing with the hellhound, Mary Ellen getting dragged away by Charon the boatman or whatever we want to call the ferryman with coins on his eyes and Judy has to deal with Annabelle herself, who just up and got in bed with her. Daniela? Well, she's trapped in the artifact room and being terrorized by a monkey that plays drums. Whoever sold those things and who bought them? Maniacs, that's who. Every adult that I ever knew that had one continually used them to torture children. It's like they had an underground network of mean grown-ups who thought it was funny to give kids nightmares.<br><br>There's one great scene in the middle of all of this, as Daniela watches an old television that shows a mute vision of a few seconds in the future where she'll be screaming and covered in blood. It's the most frightening thing in the movie - hell, in the last couple of these films - and it's a total throwaway. The same with the scene where the kids try to call Lorraine for help and a demon is on the other end. These bring forth primal childhood fears unlike the rest of the storyline.<br><br>It all ends with Daniela possessed by The Bride, but the priest and Judy play a movie of the original exorcism over the girl, freeing her, while Mary Ellen tries to lock Annabelle back in her cabinet. Of course the next day, the parents come home and every kid ends up coming to a birthday party and Ed plays guitar while Lorraine has a psychic talk with Daniela. You didn't expect a happy ending?<br><br>I kinda love - or totally hate to be honest - that this movie is being called an intraquel, as it is set during the opening and main plot of the first film. This renders it meaningless, a film that has no true bearing on anything that has come before or since.<br><br>I guess the only thing we learn here is that the demon inside Annabelle<br><br>The identity of the demon primarily attached to the Annabelle doll is called the Ram, which makes sense, as the cult group in the 1960's that Janice \"Annabelle\" Higgins belonged to was the Disciples of the Ram. The fact that I know this much - and didn't need any reference to call that up - means that for some reason, I know more about the Conjuring universe than my own family.\nSomeone please help me.","user":"BandSAboutMovies","rank":[242,333]},{"title":"Don't waste your time","rating":1,"date":"26 July 2019","review":"SPOILER ALERT ... this film is c**p !! There you go. An insult to the genre and the franchise, but more importantly, to my intelligence. There was a werewolf, yes a werewolf! Even if you could justify its appearance you couldn't explain it. Avoid. Hang on to the memories of the first two movies and the conjuring series. You have been warned.","user":"jezwood-93498","rank":[153,222]},{"title":"They missed the mark on this one","rating":5,"date":"29 June 2019","review":"I'm a fan of The Conjuring and the other Annabelle movies but this one was disappointing. The acting was fine but the story a as weak and the ending was horrible. At least they kept the time period feeling. I expected more from this series.","user":"dereckromero","rank":[142,208]}]