[{"title":"Interesting and engaging, except for the disappointing ending","rating":6,"date":"17 November 2018","review":"The ending just left everything hanging. There were too many loose ends and no explanations. I'm fine with films that maybe don't explicitly explain everything, but where the viewer can figure it out on its own based on the clues given. But this wasn't like that. There were no clues or hints or anything<br><br>It seemed more like the creators just came up with the main idea (a cam girl getting her identity stolen), but couldn't figure out a way to tie everything together, and couldn't come up with a rhyme or reason for anything. And so the creators just vaguely blamed it on this nondescript \"it\"--that the viewer never learns anything about--that for no reason makes copies of cam girls, with slightly altered personalities<br><br>It had potential, but it didn't follow through. It was like a murder mystery that in the end has some unsatisfying \"it was this random homeless guy all along who had no motive\" type of ending. What was the entity? Why did it do this? What happened to all the other girls it did this to? It was just anticlimactic<br><br>The film could have gone with at least an extra half hour to its runtime and at least twice as much thought / planning on the part of the creators into the actual story to help sum everything up in a coherent fashion. As it stands, I enjoyed how much of it there was (the characters were interesting and engaging, the acting was good, the build-up was well executed), but it felt incomplete, like only the first fragment of a full idea","user":"jrmeretis","rank":[308,350]},{"title":"Disappointing ending","rating":4,"date":"24 December 2018","review":"Most of the movie was interesting, bu everything goes down at the end. Nothing is explained, and you end up feeling that you wasted your time","user":"ramonvm-296-803998","rank":[62,70]},{"title":"Good with missed potential","rating":6,"date":"20 November 2018","review":"Cam (2018) follows a camgirl who awakes one day to discover she's been replaced on her show with an exact replica of herself. This horror film introduces a haunting and highly intriguing scenario. Although the mystery itself is captivating, the conclusion is underwhelming as the film avoids any delivery of answers. The direction and cinematography were surprisingly fantastic, with the aesthetic of the cam rooms making for some beautiful shots and sets. I also really enjoyed the social commentary on how online sex workers are viewed and how they're forced to lead dual lives due to the stigma associated with the profession. Some better writing and a more solid third act could really change this film from good to great.","user":"ryansalamence","rank":[57,66]}]