[{"title":"Darn...it was almost good....","rating":6,"date":"9 December 2019","review":"The movie starts alright, after 20-30 minutes it becomes quite good, after 40 it becomes interesting, and then around an hour or so, it does complete 180 and turns into....Nick Cage movie :)<br><br>It seems as if they had no money to pay the original writer to the fullest, so after 75% completion of screenplay, they fired the original writer, and then gave it to their children to do the rest.<br><br>All in all very tense, very interesting....and very typical and pointless in the end.","user":"milan_kovacevic-04","rank":[20,22]},{"title":"Nic Cage in a 90s erotic thriller esque.","rating":6,"date":"8 December 2019","review":"The plot is like titillating a man's fantasy. A guy goes to repair some fence in an isolated house on Grand Isle. He is sex deprived for six months due to his wife's post delivery depression.\nIn the bungalow, he meets a couple, a hot lady n her alcoholic impotent husband. The lady seduces the guy,......something happens but I dont want to spoil, he has sex with her but we dont get to c any nudity except for her glutes for few secs.<br><br>The plot is heavily lifted from the 90s erotic thrillers n Out of Time (2003).\nThe budget is low n the space is confined. Ther is some hand held cam stuff n unnecessary darkly lit scenes.\nWhat can I say about our Nic. This time he is sporting his long locks like the one from Con Air but those muscles r missing.\n2019 has been very busy for him.","user":"Fella_shibby","rank":[36,44]},{"title":"Nicolas Cage-ing Around Could'nt Save the Weak Script","rating":4,"date":"6 December 2019","review":"Old pal Nic Cage rarely disappoints me - I don't need much from him, but some movies he just cannot save with his usual cage-ing around, if I might put it so. \"Grand Isle\" was particularly disappointing, because what originally intrigued me was the trailer. It turned out it's just one of those cases where the trailer is superior to the movie.<br><br>So we got Nicolas Cage as the top-billed star with his character actually being somewhere between the lead and supporting role, we also got 10 minutes of an unimpressive but more than okay Kelsey Grammer, also an average KaDee Strickland as the seductive wife of Nicolas Cage &amp; Luke Benward as the lead character. All of them did an arguably decent job, for the bad things I mostly blame the script. All of the characters are text-book type and just plainly uninspiring, with only Nic Cage channeling a bit of that awesome Cage energy into his character (as he does with any character nowadays). The script, yes, the script is a the major flaw of \"Grand Isle\". If the visual &amp; technical side of it is fine, average, sure, but fine, then the writing is what truly makes this a cheap B thriller. I'm not even sure if the script was too full of stuff of too void of it - on the surface there are many themes involved, but they're poorly stitched together, nothing surprises, nothing really has an impact &amp; the pacing is, at times, extremely dragging. Boredom is a risk you have to be willing to take if you're watching \"Grand Isle\".<br><br>You know, there's not a whole lot I can say or even want to say about \"Grand Isle\" - It's an underwhelming, unfocused and unoriginal piece of filmmaking, the only redeeming value is bits and pieces of that Cage I really like, but that might just me. Bottom point being - this goes out as a recommendation to only the most hardcore Nic Cage fans. Otherwise don't torture yourself. My rating: 4/10","user":"TwistedContent","rank":[16,18]}]