[{"title":"Only they can do it...","rating":10,"date":"30 July 2019","review":"It amazes me every time I watch another anime movie...the simplicity and modesty, that are one of the few but most important examples we should see in every anime movie, and in movies in general...as an educative example for kids mostly. Himura Kenshin would be a good example.<br><br>I think that the importance of such things, is being omitted in many reviews...and as such the awareness bar is being kept very low.<br><br>The natural dialog and the unique feeling of entertainment, is not only for the mind but for the heart too...and is something that cannot be taken lightly.<br><br>Images and graphics are nothing without the soul/heart of the picture.\nDepicting the/a story meaningfully in a way that helps you be a better child/teen and even a mature man or woman.<br><br>I guess that's why they are the best:)","user":"eduardvimard","rank":[6,7]},{"title":"\"Harunoya Springs rejects no one.\"","rating":10,"date":"23 April 2019","review":"OKKO'S INN, a disarmingly charming, instantly likable Japanese animated feature, is the sort of family-friendly movie rarely seen from a lot of western productions of this type nowadays. While most kiddie flicks I've seen these days tend to go for loud, noisy, in-your-face schtick and disgusting scatalogical humor for the heck of it, this one instead aims to be a more gentle, down-to-earth sort of tale. Whatever humor we get is thankfully brief and of the clean and clever kind. More importantly, it's a film with a lot of heart. It's only weakness may be that it may fall somewhat short of the standards often set by, say, Studio Ghibli, but director Kitaro Kosaka (himself, incidentally, a Ghibli veteran) still manages to make this a delight for kids and adults while emerging as a beautiful work in its own right.<br><br>The main character of this tale is Oriko Seki (aka Okko), a 12-year-old girl who is tragically orphaned within the first five minutes when her parents' car crashes into a derailed truck while traveling home from a performance. Miraculously surviving this incident, Okko is subsequently sent to stay with her grandmother, who happens to be the proprietor of an inn in the countryside. The inn in question, which doubles as a hot springs house, goes by the name of Harunoya, with a philosophy that all are welcome.<br><br>Naturally, it does take Okko some time to get settled into this new establishment. She is befriended by three ghosts -- two of which are children who passed away years ago: the spunky but friendly Uribo, and the sassy, mischievous Miyo -- and a pesky \"demon\" known as Suzuki. With encouragement from these three (invisible to all but the little girl), Okko aspires to be a \"junior innkeeper\". Predictably, she starts off on the clumsy side and makes some poor calls of judgment, but gradually gets better, learning lessons about selflessness and valuing life. Over the course of Okko's coming of age journey, we meet a variety of other characters, among them a sullen teenage boy, a friendly fortune teller called Glory Suriyo (who takes her on a memorable shopping trip), and a bratty rival junior innkeeper named Matsuki, who treats Okko contemptuously at every opportunity. Of course, at the major core of the story is Okko coming to terms with the fact that her mother and father are no longer with her.<br><br>A lot of this movie's subject feels strikingly similar to Hiroyuki Okiura's A LETTER TO MOMO, as well as numerous other animated tearjerkers such as MY NEIGHBOR TOTORO, COCO, and KUBO AND THE TWO STRINGS, but OKKO'S INN manages to carve out its own niche thanks primarily to its plucky cast of characters. Okko is an easily relatable protagonist, and her similarly likable ghost buddies provide moments of gentle humor without treading into \"annoying\" territory. Only Matsuki comes across as downright unsympathetic -- at least for a good majority of the film -- until we find out that she, too, has troubles of her own. (As you might expect, the ending is a bit of a tearjerker, but not so much that it makes the movie downright depressing.)<br><br>In lesser hands, this tale could potentially tread into draggy territory. Thankfully, Kosaka keeps an energetic pace throughout all 96 minutes, making even the more quieter, slower moments flow without draining interest. That said, there are a couple of moments when the development of some moments feels a bit hasty, notably in the handling of Matsuki's character. Some additional scenes where we get to see her being nicer would have been welcomed, but that's honestly my only complaint.<br><br>Despite being directed by a Ghibli veteran, OKKO'S INN was animated at Madhouse Studios, whose output has ranged from gritty productions like NINJA SCROLL and PERFECT BLUE, to somber, friendlier stuff such as THE GIRL WHO LEAPT THROUGH TIME. If you're not familiar with this studio, these works you may have been fortunate to see. OKKO'S INN, naturally, being among the more softer offerings of this studio, has a predictably sunny, beautiful look to it. There is a digital sort of look to the animation, but it still offers the sort of warmth that hand-drawn craft is usually known for. On occasion there are uses of computer images, but thankfully they don't stand out in all the wrong ways.<br><br>I went to see the dubbed version, provided by NYAV Post. It's yet another quality effort, with terrific performances by all involved. Madigan Kacmar does an outstanding job as Okko, providing the character with just the right amount of warmth, spunk, and heart. She has terrific chemistry with K.J. Aikens' somewhat smart-alecky but lovable Uribo as well as her other co-stars. Carly Williams' Matsuki is as snarky and prissy as you'd expect, while Tessa Frascogna's Miyo and Colleen O'Shaughnessy's Suzuki complete the trio of ghost companions for Okko. Glynis Eliis is also great as Okko's grandmother. NYAV Post has turned out excellent work lately, notably in the form of of big hitters such as A SILENT VOICE, MIRAI, and even the flawed, forgettable FIREWORKS. It's gratifying to see them continue to live up to their standards here.<br><br>There have been a lot of great contenders for emotionally resonant animated features from Japan lately. OKKO'S INN may be among the lesser known of them, but it certainly deserves a following. If you ever decide to check out this charmer, I highly would recommend doing so.","user":"JTurner82","rank":[7,9]},{"title":"A very mellow and tear jerker movie","rating":10,"date":"25 August 2019","review":"I really love to watch anime movies like this, it moves your heart and soul, so much that it leaves you happy and relieved or relaxed at the end.","user":"jhimzter","rank":[3,3]}]