[{"title":"A few nice moments can't save a failed and boring roast.","rating":5,"date":"31 July 2018","review":"The formula used to be about a group of friends who roast each other but also love each other and share some background story. That changed into a group of random people who frequently admit that they don't know why they're there.<br><br>Joseph Gordon-Levitt is the weakest host so far. Not every great actor can be funny, and his bits can't generate general interest. Dennis Rodman was obviously the \"why the heck is HE there?\" guest, and wow......did he bomb. Not a single funny moment, from a person who shouldn't even be there. I don't even blame Rodman, but the producers who asked him.<br><br>Of course Jeff Ross is funny, but no surprises and his star power can't save the below mediocre mess. Only Edward Norton was surpringly funny and entertaining. His jokes weren't predictable one liners, but a coherent story with a heart.<br><br>But besides Norton and Ross, this roast offers nothing. Most jokes were one liners and you could guess the predictable punch line at any moment. This means the time of the roast with a charismatic cast that really had fun being there, is probably over.","user":"CountJonnie","rank":[19,22]},{"title":"When non-comedians try to be funny :(","rating":1,"date":"1 August 2018","review":"When non-comedians try to be funny :( \nYou could literally when it was a writers joke being performed. It was the weakest roast of all. Kevin Pollak with his 30 years old impressions. Jeff Ross reduced to 3 minutes. Nothing shocking from fear to be fired or #tagged. It was terrible.","user":"iix-31422","rank":[18,23]},{"title":"Joseph Gordon Levitt is to this show what James Franco was to Oscars","rating":5,"date":"1 August 2018","review":"Right from the start, Levitt sets the (unfunny) tone for the show. He can be summed up with just one line. \"Joseph Gordon Levitt is to this show what James Franco was to the Oscars.\"<br><br>Most of the roasters are not funny at all. Everyone wonders why are they there and I was wondering why am I wasting my time watching this? They don't even know what a \"roast\" is, some mediocre random jokes is NOT roasting someone.<br><br>The hour is saved by Edward Norton who does a great job at roasting Willis in a very sarcastic way. His jab at MCU movies and specially The Incredible Hulk may rub some (a lot of) people the wrong way but it was part of roasting Bruce Willis and fit perfectly.<br><br>Jeff Ross, while being funnier than everyone else, was actually just OK when you think how bad everyone else besides Norton was. If everyone else sucks, then of course you gonna have some OK jokes look great too.<br><br>All in all, I gave it 5 / 10, thanks to Norton and Ross for saving this otherwise train wreck of a \"roast\" show. If you are watching on a streaming service, save your time to avoid clingiest jokes and moments and just skip to Edward Norton and Jeff Ross parts.","user":"lovelywaz","rank":[15,19]}]