[{"title":"Poor production and no real or firsthand information","rating":1,"date":"21 September 2018","review":"I was so looking forward to this. There has been so much hype around this ranch and a sort of mystical secrecy.\nThe movie was 75% too long, presented in an unscientific way and lacked any real information. It was all third hand information and hearsay.\nConsidering that top scientists (PhD level), spent 10 years studying things, there was a distinct lack of data of any kind.\nThe production was so slow and boring, I was waiting for it to finish.","user":"qamanatssg","rank":[39,44]},{"title":"Hard to watch","rating":1,"date":"21 September 2018","review":"Some of the worst filmmaking I have seen recently. Endless b-roll with terrible exposure, music, bad audio and color intertwined with jarring titles and quotes. In the new interviews next to nothing interesting is said. The only redeemable parts of this documentary are the old footage that the director and writer got from someone else. Don't waste your time or money.","user":"spencertwede","rank":[33,39]},{"title":"The Archive Footage Makes It Worth Seeing","rating":4,"date":"17 September 2018","review":"Skinwalker Ranch is an incredibly interesting topic worthy of a feature documentary. Unfortunately Hunt For The Skinwalker is a very disappointing, disjointed, and flawed attempt.<br><br>The archive footage and interviews with George Knapp are, for the most part, excellent. Anyone familiar with Knapp's work should know what to expect, and it is incredibly disappointing that relatively little of this film is made up of the video footage.<br><br>Outside of this? The director has a fascination with the most mundane aspects of the area surrounding Skinwalker Ranch: UFOs. And while UFOs may be of interest to a lot of people, the fact there are much more interesting and strange recorded aspects entirely ignored in the newer footage really lets it down.<br><br>Another thing that lets the film down is the direction and editing. The simple lack of awareness to even consider a better mic on his camera is the least of his problems. He is overstated in wanting to present himself as more than he is when he could have shown himself as a better director if he simply constructed an 80 minute film from the aforementioned archive footage. Reiterating the points made by Knapp and the archive footage repeatedly after every scene made an already badly paced and poorly edited documentary into an outright slog.<br><br>Also, Robbie Williams turns up. So there's that for anyone who wants to change some lyrics to reflect the sinister occurences, because seeing Stoke's own Robbie as a possible skinwalker is...great. 'It's time to move cows' bodies' etc.","user":"BountyOfVoles","rank":[27,32]}]