[{"title":"it's not what I expected","rating":2,"date":"2 September 2019","review":"I thought I would be thrilled with this movie, but it's very boring.\nI'm really a sensitive girl that can be scared easily but nah, It was all normal, I was disappointed.<br><br>I only watched this movie because of CORBIN!","user":"mahaborhan","rank":[11,12]},{"title":"Morons in the Woods","rating":3,"date":"2 September 2019","review":"I don't know what it is about movies with \"witch\" in the title, but it makes suburban kids act like idiots as soon as there are trees around. In this instance, these dumbasses manage to get lost in western Massachusetts, which is really difficult to do. Sure, these folks choose to go along a closed logging road, but they also (a) don't bother to check their position against a map and obvious landmarks like the mountains, or (b) don't bother to say something like \"Check the odometer. If we don't see the place in a mile, we turn back.\" Instead, they drive for hours (!) before Dude with Rage Issues crashes the car because, well, he's an idiot in a witch movie who's driven for hours in western Mass without managing to cross a major road.<br><br>I'll also point out that Dude with Rage Issues doesn't know jack about driving in snow. He gets stuck and immediately gives up. No tries at rocking the car, nothing about putting branches under the wheels for traction, no bags of kitty litter in the back. But he yells a lot, and has his hair slicked back to signify his douchitude, so he's got that going for him. Dude with Rage Issues carries the action by being an idiot in every possible way, from running his car out of gas, shoving people, and stabbing Competent Guy because Spaz Chick gives him a scare. His trademark acting move is to yell like a bleating goat at every setback.<br><br>Then, of course, once the car is stuck, everyone does the dumbest thing they can. Look for people but don't bother to, y'know, follow their tracks in the snow? Check. Go off in the woods alone? Sure. Oh, and meanwhile, Smart Chick didn't feel it was worth mentioning to anyone that there were bear traps in the woods because, well, this is a witch movie. When someone inevitably steps in one (looking for someone who disappeared with no explanation what happened to him), he spends his remaining time trying to break a chain with a rock instead of opening the trap. Probably too complex to figure out.<br><br>Add in Spaz Chick, who may or may not have been gang raped by the Jock Team, and observed by Dude with Rage Issues. Everyone seems to hate Spaz Chick and it makes you wonder (a) why they invited her, and (b) why she came, other than to act all spooky and mumbly and stuff.<br><br>Spaz Chick kills Mall Chick, who you wonder why she's on this trip, since she doesn't appear to get along with anyone. Happily, she gets a ski pole in the throat to shut her up. How that happened doesn't make a whole lot of sense, but hey, witches, right?<br><br>The scenery is beautiful, and the woods are gorgeous and peaceful. You can't help but notice there is a ton of standing deadwood, which would have made a lovely campfire and shelter if these dumbasses had ever thought to build one. But witch movie, so of course they're all morons and will die, probably a two-minute walk from a Friendly's.","user":"imdb-2920","rank":[11,12]},{"title":"Don't waste your time","rating":2,"date":"29 August 2019","review":"This movie was unfortunately boring. The acting was awful and storyline predictable. The characters were so unlikable which led to me welcoming their deaths. I highly recommend that you don't waste your time and energy on this movie. Stay clear of this one.","user":"Lionessroaring","rank":[10,12]}]