[{"title":"Sports drama with passionate depth","rating":10,"date":"22 May 2018","review":"Champion is an emotional South Korean sports drama. It tells the story of Korean-born arm wrestler Mark who lives a solitary life in America where he has grown up in a foster family. He isn't allowed to practice the sport he likes professionally and has to do odd jobs as security guard in filthy discotheques. He comes across shady promoter Jin-Ki who is determined to pay off his father's debts by making money with Mark. He lures him back to South Korea but Mark realizes that he neither feels at home in the United States of America where he has faced racism nor in South Korea where people find his American manners awkward. Things don't get better when Jin-Ki gets involved with criminal promoters who want him to manipulate the outcome of several duels as Mark doesn't cooperate and puts himself and Jin-Ki in a dangerous position. On his quest for peace of mind, Mark wants to meet his biological mother but learns that she has died of cancer. However, he learns that he has a sister who lives at her house with a curious daughter and an honest son. For the first time of his life, Mark seems to have found a family but he soon realizes that things are much more complicated than they seem. Soon, he has to not only compete professionally in a national tournament against manipulative criminals but to find meaning in his personal life.<br><br>There are many elements that make Champion an absolutely outstanding movie. The story which openly references Over the Top with Sylvester Stallone might not be the most original one but it is performed with such genuine intensity, passion and talent that it doesn't matter. Sylvester Stallone is a quite wooden actor and the hollow performances by Dwayne Johnson are even worse. Ma Dong-seok shows how a gifted actor can play a tough guy with emotive depth without any shallow stereotypes. His performance is absolutely stunning because he becomes one with his role and will make viewers sympathize very easily.<br><br>Aside of just focusing on the profound main character, the film offers several side stories that are truly intriguing. Promoter Jin-Ki seems to be a superficial manipulator at first sight but turns out to be a concerned son who wants to pay off his father's debts. Soo-Jin seems to be an unsuccessful shop owner who doesn't give her children the attention they need but she turns out being a gentle woman in search for compassion. Every single side character in this movie is interesting and developed with much thought.<br><br>Champion is a film that might make you cry because it's heart-breaking to see a person who has faced as much hardship as Mark face important personal and professional challenges but the movie keeps things diversified from start to finish. The movie includes intelligent humor as it compares American and Korean cultures as well as childhood and adulthood and adds plenty of situation comedy that will put a big smile upon your face. If compared to numerous other Asian movies, this type of comedy never gets exaggerated or drifts into slapstick territory and contrasts and supports the movie's realistic tone surprisingly well.<br><br>The movie also offers a lot of action and tension. Arm wrestling never seemed as intense, strategic and technical as in this movie and the competitions will put you on the edge of your seat. The physical fights involving criminal promoters and their associates are brief but vivid and never drift into martial arts to keep the film's realistic spirit.<br><br>I had the chance to experience this film at a cinema with five other viewers while hollow effect-ridden action movies like Rampage attract millions of viewers. If you look for an emotional, intelligent and profound sports drama with sympathetic characters, you won't be satisfied with shallow Hollywood cinema but should give this passionate movie a fair chance. I hope to see more foreign movies like this one in North American cinemas but if you want to make this happen too, you have to actively support hidden gems like this one. In my opinion, Champion is already a solid candidate for movie of the year.","user":"kluseba","rank":[9,12]},{"title":"Funny and charming family comedy","rating":7,"date":"29 December 2018","review":"The only people who hate on this are jaded cynics and Americans with tunnel vision who compare it to \"Over The Top\", as if it were just a cheap knock-off of that. But it clearly isn't. It's more like a hommage that doesn't take itself too seriously. I would describe it as a wholesome, charming, light-hearted comedy with some emotional elements and a bunch of funny characters. If you want some light entertainment, you can definitely give it a watch.","user":"mstr_bond","rank":[5,7]},{"title":"Not bad, not bad at all","rating":7,"date":"25 December 2019","review":"Dong-seok is a great actor in Korea, he's very talented and extremely versatile to play any role in any kind of genre movie. His performances so far never disappointed me. This time he played Ma Mark, a nobody bouncer, security guard in US, but later he was fooled by Jin-Ki, played by Kwon Yul (an actor his face looked pathetically reformed by plastic surgeries), who fooled him to return to Korean to compete arm wrestling, but mostly for Jin-Ki's own illegal gambling bets.<br><br>Dong-seok did a great job to play that superior arm wrestling guy. His natural performance was absolutely realistically believable, while Kwon Yul was forced to play a clown-like con-artist. Kwon Yul looked pretty cool when he wore dark sun glasses, but once he took it off, his bloated plastic surgery puffy face was so obviously starting to coming apart. His performance in this movie's early half was extremely overacted, sometimes more like a jerk, but luckily, the later half part changed him into a normal person with a heart.<br><br>Korean movies, even they actually were serious dramas, used to put many clown-like cartoon characters to turned them into what they thought as Comedy, but most of the time, they just turned into disgusting Farce, and ruined everything. It's a very stupid Korean movie-making habitual irresistible syndrome, unnecessarily made lot of characters look like stupid jerks, ridiculous clowns and pathetic morons. They always thought \"Farce\" is \"Comedy\", they just couldn't distinguish the differences.<br><br>There're many violent scenes in this movie, but they were neutralized by two cute kids. They both looked pretty normal and likable, I really wish they would not need plastic surgeries like most Koreans when they grow up.","user":"Bad-Good-Great","rank":[2,2]}]