[{"title":"Heartbreaking but needs to be told.","rating":10,"date":"2 November 2019","review":"Another critical analysis of life in England in 2019. Has English society changed at all since Ken Loach' first films in the 60s? It seems not. Heartbreaking, shameful, relatable and tragically so true. We can all relate to the characters,they are our friends and neighbours and think, there but for the grace of god......\nThe film reminded me of On the Waterfront, with the corrupt 1950s dockside gang masters. How can these working practices have been allowed in England, in the C21st? A decade of capitalist government lade bare, just as the UK decides it's future yet again.\nOther \"reviews\" suggest the acting is suspect in places, but I feel this is the film's and LoachKs skill in making the film appear to be so real , so natural, so tragically real.\nEvery scene and every prop had meaning, from the dreadful state of the rented house - why aren't landlords forced to maintain a decent level of decoration and repair. To the fast food of the van dash board- so what is the social and health cost of forcing drivers to work long hours, with no breaks eating sugar filled snacks. To the school who excluded a young man for 2 weeks with no support or, understanding of the causes or support needed.\nA true essay of English life in 2019. Tragic.","user":"mhardingyoung","rank":[69,79]},{"title":"Powerful...and quite painful to watch.","rating":9,"date":"22 October 2019","review":"\"Sorry We Missed You\" is an exceptional film from British director Ken Loach that I recently saw at the Philadelphia Film Festival. It's amazingly realistic and powerful....as well as incredibly sad and depressing. This is NOT a criticism...more just to let you know that it's anything but a 'feel good' sort of movie.<br><br>The story is about a working class family in crisis. The father worked 90 hour weeks as a delivery man. His boss is completely unsympathetic and hard...like a rock. The wife is also working 12-14 hour days and together they barely get by. But, because they are barely home, it's taking a huge emotional and physical toll on them as well as the family. Through the course of the film, you see these decent people fall apart....and there doesn't seem to be any answer for their predicament.<br><br>This movie was brilliant in that the actors seemed nothing like conventional actors....they were REAL. But, unlike non-professional actors, they were convincing and extremely effective. I applaud them and Loach for delivering a film that makes you think and feel....and challenges your preconceptions about the fairness and decency in the modern economy. A film not to be missed...unless you are depressed. If you do suffer from clinical depression or your life has been hard lately....maybe you might want to skip this one.","user":"MartinHafer","rank":[51,59]},{"title":"The film's tragedy is that no amount of love and goodwill can save us when the cards are so horribly stacked against us.","rating":8,"date":"8 October 2019","review":"It was only ten years ago, with 2009's larky 'Looking for Eric', that Ken Loach was able to show us a man delivering letters and parcels whose workplace was a refuge for him - a place of camaraderie and solidarity in an otherwise troubled life. It's almost the reverse in his latest, a damning and far darker film. Whenever family life in Newcastle looks to be coming together for Ricky (Kris Hitchen), a Salford-born delivery driver for a private parcels firm, and his wife, Abby (Debbie Honeywood), a carer, it's the world of work that crushes them and pushes them ever closer to breaking point.<br><br>For both Ricky and Abby, but especially for Ricky, work is rarely rewarding or empowering. It's degrading and damaging, especially when it comes to their relationships with each other and their school-age kids, glass-half-full daughter Lisa (Katie Proctor) and vulnerable son Seb (Rhys Stone) - and the mental health of them all. The film begins with Ricky signing up to a new job - dropping off parcels at breakneck speed around the city. But it's an app-driven posting - a gig-economy non-job - that comes with next to zero benefits: no contract, no confirmed earnings and, worst of all, a series of penalties that kick in if you don't toe the line or meet targets.<br><br>'Sorry We Missed You' returns us to the same modern Newcastle of 'I, Daniel Blake'. You can imagine glancing at the characters from that earlier film in the wing mirror of the gleaming white van that Ricky drives all over the city. It feels like a companion piece to that 2016 film. It's the same world, with a different story, and there are specific ways, too, in which the films talk to each other: the work-world jargon spoken over the blacked-out opening credits; an interest in the drama of graffiti; and a key scene in which a main character is pushed to a dehumanising breaking point in public. What's different is the detail with which Loach and his collaborators examine the effects of work and society on the nuclear family. The film's tragedy is that no amount of love and goodwill can save us when the cards are so horribly stacked against us.<br><br>And that title, 'Sorry We Missed You': of course it's the faux-friendly message left on doorsteps everywhere by parcel delivery firms. But here it also nods to the left behind, to the overlooked, to the forgotten. Loach and his team, including the writer Paul Laverty, demonstrated a new urgency in their work with 2016's 'I, Daniel Blake'. You can feel it again with this powerful, bleak film that feels acutely of the moment but also carries within it the same question that Loach has been asking for more than 50 years: does life really have to be like this?","user":"eminkl","rank":[51,60]}]