[{"title":"So tired of the \"Too slow\" reviews lately....","rating":7,"date":"22 July 2019","review":"We are living in a world that is so fast paced and so many people want some sort of super instant gratification from everything. If something on the screen isn't super action oriented it gets called \"Slow and Boring\" Everyone just \"Slow down!\" Enjoy a movie that tells a story, has character development, teaches you some things about other cultures, religions, and their differences. Not just cheesy jump scares and stupid dialog.<br><br>I really liked this movie. The acting was very good from people I have never seen before, and if you give yourself time to breathe and enjoy it you will be rewarded with a good story with an evil protagonist and some super gory outcomes for the people in the story. The scenery is great as well as the photography.<br><br>I don't want to spoil anything. I'll just say leave the world for 90 minutes and immerse yourself and concentrate and you'll realize some movies are slow for a reason.<br><br>If I listened to reviewers I'd miss out on many great movies.","user":"Markyajv","rank":[38,44]},{"title":"not bad","rating":6,"date":"9 February 2019","review":"The movie was a bit slow, but the acting was great, and the sets and cinematography were spot on. there was nothing new as far as horror tropes go, but i enjoyed watching!","user":"ryansiath","rank":[29,37]},{"title":"pretty original","rating":8,"date":"6 February 2019","review":"Actually i would rather have genred it as a mystery drama.(horror) film , just to lower the expectations from the nerdiest of the horror nerds.<br><br>the film is taking place in the 1600's lithuania, were the plague are racing its razorblade through the population, and a jewish village where all the inhabitants are sound and healthy. they are accused for cursing the plague over the others and the battle is on.to defend oneself. the lead actress makes a golem to take revenge and seek protection for what has been done to them.<br><br><br><br>there are slash and gore, and the golem takes the job wholeheartedly aka with hearts in his hand. the story about golem is not good enough explained in the script, and i think the film are slowpaced at some spots, and there are a few editor glitches inbetween , but overall it does the job good enough to make a grumpy old man look away from the screen at its worst slashermoments. the visual product are brilliant, also the decor and settings. and we have all got a new ''spittin image'' of Liv Ullmann in Hani Furstemberg. do watch out for her acting, it is good. this is a film i recommend very much.","user":"ops-52535","rank":[27,37]}]