[{"title":"A disgusting, morally reprehensible piece of insane genius","rating":9,"date":"8 October 2018","review":"Climax, the latest film from Argentinian-French provocateur <a href=\"/name/nm0637615/\">Gaspar Noé</a>, is a disturbing, depraved, disgusting, and debauched piece of absolute insane genius that I thoroughly adored from beginning to end, and which I never, ever, want to see again. Lord of the Flies by way of Heronimus Bosch or Zdzislaw Beksinski, Climax is what you might get if you mashed-up <a href=\"/title/tt0073650/\">Salò o le 120 giornate di Sodoma (1975)</a>, <a href=\"/title/tt5109784/\">Mother! (2017)</a>, and <a href=\"/title/tt0462590/\">Step Up (2006)</a>; a dance movie that morphs into a horror film, which then attempts to show the audience a literal hell on Earth. With Climax, Noe takes the audience and characters further than ever before. Granted, there's nothing here to rival The Butcher's sickening attack on his pregnant wife from <a href=\"/title/tt0157016/\">Seul contre tous (1998)</a>, or the near-unwatchable rape and fire extinguisher scenes from <a href=\"/title/tt0290673/\">Irréversible (2002)</a>. However, whereas those films feature sudden moments of barbaric violence punctuating (relatively) quotidian narratives, in Climax, the oppressive feeling of dread is unrelenting. So even though the acts of violence are not, in themselves, as extreme as some of those in Noé's back-catalogue, the cumulative effect is far worse. Obviously, this makes the film something of an endurance test, even at only 96 minutes, but this is precisely the point - Noé wants the audience to be utterly exhausted by the end, and he employs numerous confrontational and disorientating techniques to achieve such.<br><br>Set in the winter of 1996, and allegedly based on a real incident in France that year, the film focuses on a dance troupe putting the finishing touches to a performance before embarking on a national tour, to be followed by a series of dates in the US. Apart from the opening shot, and a couple of quick shots towards the end, the entire film is set in the rehearsal space; an isolated and unoccupied hall. Upon finishing rehearsals, the troupe starts to party, as we primarily follow Selva (Sofia Boutella), the group's choreographer. As the night wears on, it becomes apparent that one of their members has spiked the sangria with powerful LSD, with each of the troupe descending into their own personal Hades of paranoia, aggression, and/or uninhibited sexuality.<br><br>In lieu of any kind of title card or opening credits, Climax begins with an abstract and non-descript shot of pure white. So visually indeterminate is the image (it could literally be anything) that at the screening I attended, most people (myself included) didn't even realise the film had begun. It is only as a girl staggers into shot from the top of the frame that it becomes apparent we are looking directly downwards onto a snowfield. The girl is in great distress, leaving a trail of blood in her wake. After a moment, she collapses onto the snow, her body convulsing, unable to go any further. The camera then revolves upwards along the vertical-axis through 360 degrees, a shot anyone familiar with Noé's work will immediately recognise. Revealing the bare branches of a few nearby threadbare trees, the movement immediately establishes that we are in an isolated location in the dead of winter. By the time the frame returns to its starting position, the girl's struggles have fashioned a hideously disproportioned and asymmetrical red-tinted snow angel. Theoretically, this could be the cliched opening scene to any generic slasher movie. However, the striking composition and the economy with which the shot conveys so much information serve to betray the fact that this is not the work of an anonymous journeyman for hire, but is instead the meticulously composed opening salvo of an auteur who knows precisely what he's doing.<br><br>A moment later, the entire closing credits roll (upwards, obviously), right to the copyright information. With no closing credits at the end, the audience is allowed no transition from the film to reality. As the film ended, the lights immediately popped on, with no music to play us out, no darkened theatre to recompose ourselves. Indeed, to enhance the sense of discombobulation for which Noé is obviously striving, the last 15 minutes or so of the film are literally upside-down. The audience is thus placed in the same position as the characters - the absence of closing credits and the inverted image create a sense of confusion and discomfort, just as the film is depicting the surviving dancers coming out of their drug-induced mania and back to the real world. As he attempts to do throughout the film, Noé places the audience directly into the psychological reality of the characters.<br><br>After the opening scene, the film then cuts to a TV screen showing the dancers' audition interviews, which do a terrific job of establishing the differing characters, as do the dialogue scenes after the rehearsal but before the LSD has kicked in. The third scene is the dance number, which is easily the best dance sequence I've ever seen on film. Shot in a continuous 20 minute take, this grants the scene a sense of real-time immediacy and in-camera verisimilitude which one can usually only acquire from a live performance - this isn't something constructed by an editor from a series of individual set-ups, this is something literally happening before our eyes.<br><br>Thus ends the first section of the film. The second, and much shorter, section is the dancers engaged in conversation with one another (and, in contrast to the first section, is made up of a multitude of edits eschewing any sense of match-cutting). The third, and longest, section sees them realise the sangria is spiked, attempt to find out who did it, and the chaos that ensues when the drugs take hold. These three sections (dance, conversations, and drugs) roughly correspond to the three books of the Divina Commedia - Paradiso, Purgatorio, and Inferno. However, in the poem, the order is Inferno, Purgatorio, and Paradiso, charting the ascension of the soul from the Inferno of Hades to the Paradiso of heaven. In the film, the movement is in the opposite direction, as the Paradiso of the harmonious and unified perfection in the dance sequence gives way to the calm Purgatorio after the consumption of the LSD, but before it has taken over their reason. Finally, they descend to the Inferno. In charting this allegorical journey, one of the most immediately interesting things is the obvious visual contrast to the dance sequence. Whilst the dance sees the group acting in unison, all of a single mind, the third section of the film shows them fragmented and in disarray, each individual driving towards their own purpose, whether it be paranoia, hedonism, or what they believe they need to do to survive. The harmony of the troupe has given way to the horror of individualised disintegration and psychological collapse.<br><br>We then witness a girl's head being set on fire, a pregnant girl being kicked repeatedly in the stomach, a girl slashing her own arm and face, a contortionist contorting to the point where he literally splinters his own bones, a child locked in a room full of cockroaches, a man scratching his chest to the point that it turns into four red bloody streaks, public urination, lesbian rape, incest, and suicide. As the veneer of civilisation is stripped away, the characters devolve before our eyes; some become concerned only with sex, others with violence.<br><br>It would certainly be easy to dismiss Climax as thematically empty, arguing that the brilliant camerawork and pumping soundtrack serve only to cover up the vapidity at its core, to argue that the depravity and excess is not in the service of any grand universal point, but simply to show attractive young people tearing one another apart. However, there is some kind of political point buried beneath the carnage; the dance sequence takes place in front of a massive French flag, whilst the credits declare, \"A French Film. And proud of it.\" Perhaps related to this, the troupe is made up of a cross-section of Europeans, and in the explosion of excess hedonism and hysterical mayhem, does this cross-section of ethnicities, genders, and sexual orientations come to represent European multiculturalism tearing itself apart? Is Noé saying that if France continues to accommodate such a diversity of disparate cultures, chaos will ensue?<br><br>In relation to this, perhaps tellingly, Omar (<a href=\"/name/nm8273855/\">Adrien Sissoko</a>), the person who is initially blamed for spiking the sangria, is Muslim. So, is Noé saying that in such a multicultural milieu, with fear of Islam at a high, it's very easy to blame everything on the Islamic \"Other\". Additionally, Noé depicts the dance scene with such reverence and awe that this kind of social critique, barely straddling the line between patriotism and xenophobia, doesn't seem to sit especially comfortably. Not to mention that Noé himself is an immigrant - he was born in Argentina, moving to France when he was 13.<br><br>The fact is, I don't have a clue what Climax is about. Nor do I care. Nor is it important. I take it for what it appears on the surface; an incredibly technically proficient depiction of a contemporary Inferno, as aesthetically impressive as it is morally questionable, as enthralling as it is disturbing, a film of unparalleled barbarism, that also stands as one of the most extraordinary cinematic achievements in recent years. It's a work of genius. Twisted, sick, depraved genius, but genius nonetheless. It disturbed me like no film in at least a decade, and I couldn't get it out of my head for days afterwards. I absolutely loved every single crazy minute of it. And I don't ever wish to see it again.","user":"Bertaut","rank":[422,545]},{"title":"This is not a movie to watch, this is an experience to have","rating":9,"date":"6 November 2018","review":"Well, if you are going to watch a gaspar noe movie you should know what you are going to experience; search Gaspar Noe. But this movie will probably be the most popular Noe movie among popular culture or social media or whatever. So, this is a warning for those who hasn't watched a noe flm before. This is not a familiar movie for you, do not expect to see a convenient work of art.<br><br>Yet, this is an experience for you to must have. Perfect side of \"cinema\" to create different perspective. Do not care about plot, do not care about subtle messages. Just use your eyes, try not the think about what you see. What you are going to see is an experience through the eyes of a phantom among dancers. Phantom is there, phantom sees what they see, feels what they feel, even drinks what they drink. So, you are going to completely involve in, engage in the movie.<br><br>After the movie you may like it or not, you may even hate it. But the \"ride\" you will have will be a lifetime experience from movies you have watched or will possibly watch.","user":"baba-jo","rank":[180,266]},{"title":"Was hoping for much more","rating":3,"date":"30 November 2018","review":"CLIMAX or how long can you stand watching boring dancers and average at best actors pretend to be on drugs? Zero story, lots of screaming, no surprises. I'd even say this film is pretty tame (for Noé). And it's neither radical nor inventive anymore to simply turn the camera upside down or to show the end credits first. Apart from big respect for some well done one-shot moments, I'm quite disappointed.","user":"rocco-881-459726","rank":[274,444]}]