[{"title":"Wow. Horrible movie.","rating":1,"date":"2 August 2018","review":"I had the misfortune of watching this movie with some friends, it's really really bad. From looking at the picture, title, and description I knew it was trash before watching it and I was absolutely correct. Don't waste your time or money, there are a lot of other 'bad' films that are better than this, if that's your thing. This movie was so bad that I kept thinking about how humanity could've done something- ANYTHING- else with the funding for this project and come out ahead in a multitude of ways. Like, we could just make a video of a lady in a bikini throwing that money into a bonfire and it would've done more for culture and art than this, certainly it would've been more entertaining for everyone and would've been closer to the truth about what was actually done with the funds SoCal paid to make this. At least we could feel good about life afterwards, not like the shame for the human race I felt after watching Horndogs Beach Party. This movie would've been greatly improved with the addition of brain eating zombies or a chain saw murderer. I felt sorry for everyone involved in it's making, like, incredible pity that they were so hungry this film was the best they could do to earn a living. I'm imagining these artists (actors, crew etc) have a dream to work in film, and this is what they had to do to get themselves to a place where they can actually create something someday that would be at the very least entertaining. That makes me incredibly sad.","user":"virtualjupiter","rank":[15,20]},{"title":"Deliberately goes out of its way to be a bad movie and succeeds all too well","rating":2,"date":"24 September 2019","review":"This purposeful attempt at making a schlocky retro-80's style horny teen romp alas succeeds much too well at its lousy goal. The limp (non)direction, terrible acting by a lame no-name cast, a meandering and uneventful narrative that unfolds at a painfully sluggish pace, a numbing surplus of tedious talk, the hopelessly witless humor (the all-time worst gag features a guy pooping his guts out on the toilet), an annoying bunch of insufferable characters, and the cruddy cinematography all make this turkey a total chore to endure. Worse yet, the titular bash mostly happens offscreen and what little occurs onscreen barely lasts three minutes tops. Only Troy Fromin as the raucous Horndog and J. Anna Lupo as snarky dominatrix trash film show hostess Sister Sadie Safewood bring any vitality to their parts while Brinke Stevens is wasted in a nothing bit role. In addition, while there are plenty of hot babes in bikinis the gratuitous nudity quotient is nowhere near as substantial as it could and should have been considering the premise. A real clunker.","user":"Woodyanders","rank":[5,6]}]