[{"title":"Generic stand up set with some laughs","rating":4,"date":"11 June 2018","review":"My review may be biased because I'm not really a fan of Kevin James' TV or movie career, but I love stand up and figured I'd give this a shot. The jokes were pretty unoriginal, run-of-the-mill material I'd hear at any local dive comedy club. He jokes about being fat, men with food allergies needing to \"man up\" and (...honestly, I don't even remember much of the rest of his set) were all pretty boring and outdated. It was just generic. I did find the jokes about his kids to be pretty funny. I also enjoyed his crowd work (the bits about tattoos made me chuckle). However, I'm pretty sure his joke about his kid sneezing into his mouth was ripped off of Louis CK's bit about his daughter coughing into his mouth. If you're looking for some mildly amusing background noise, go ahead and put this on. Nothing special though.","user":"columbiahunny22","rank":[7,9]},{"title":"not a 'classic', but a pleasant sit through","rating":6,"date":"25 April 2018","review":"This is kevin's first stand up special in 17 years, since his first, and only, 'sweat the small stuff' in 2001. whilst not as energetic or memorable, 'never don't give up' covers a wider variety of topics.<br><br>the title is a reference to one of the jokes. though it doesn't serve as a crucial focal point. the best material post 'sweat the small stuff' is compiled into an hour. this format works well as nothing drags, and it keeps things at a fast pace. yet enough time was spent fleshing out each bit, so it doesn't feel rushed. the trailer honestly doesn't do it justice.<br><br>the purple backdrop is a nice touch. kevin isn't camouflaged in black this time around. presentation is kept very simple; no need for cut scenes or intermissions as this isn't a television broadcast, or home media.<br><br>the audience doesn't seem to be as lively, and I even suspect that some of the laughter may be canned - due to it sometimes not matching their body language. of course there are plenty of laughs, but they were all even levelled across the board. none of the bits stood out above others in terms of their reactions.<br><br>kevin is still animated; his stories are peppered with facial expressions and mimes.<br><br>much of his act throughout the years has been based on frustration. however, this marks the first time that it has been directed towards certain groups of people. his age is starting to show, and that is reflected in the way he sees the world. he knows what he knows and isn't interested in learning anything new. there's an 'intolerance' that is worrisome, though not alarming...<br><br>clean humour has also been long associated with kevin's brand. he was never one to use any 'major' profanities or lewdness. here is no exception, in fact, this seems cleaner than 'sweat..' in that respect. however, there are some 'gross out' jokes and references to adult life that are not 'family friendly' as advertised, or suitable for the squeamish.<br><br>this may not have been exactly the sequel I was waiting for, but it's a nice addition nonetheless. stand up comedy is kevin's foundation. it's what he does best. in fact, it would be nice if he could focus on this medium exclusively, and develop a series of specials. just like his peers brian regan and jim gaffigan have.","user":"jlonesoldier","rank":[5,10]},{"title":"Ugh","rating":2,"date":"2 May 2019","review":"Terrible. This just consited of joked that were so old that even 40+ yrs already posted them as minion memes on facebook.\nI broke up after a while, I skipped ahead to see if it would get better, but nah.","user":"nick-833-569563","rank":[2,3]}]