[{"title":"Average, so please overlook the 1 and 10 reviews !","rating":5,"date":"24 December 2019","review":"\"One Must Fall\" is a combination of horror and black comedy but doesn't succeed in both genres. Reviews are either a 10 or a 1 but the truth is somewhere inbetween.<br><br>The story has an interesting premise: 2 friends in need of a new job both start at a crime scene clean up company. Soon they fall into the hands of a serial killer. Set in the '80's with fun references (posters of \"Jaws\" and \"The Goonies\", Janet Jackson, Reagan, house telephones and old computers) doesn't make it a comedy.<br><br>It also isn't scary, disturbing or creepy for a horror film. Mostly bloody crime scenes with body parts. The second half is where the story fails to keep you entertained. Especially when the unconvincing killer is introduced who talks so much that he'll put you to sleep of boredom. Some gore and a couple of brutal killlings can't save this even with the actors trying. The last half hour is basically a non scary \"Hostel\" where you check your watch several times.<br><br>It's not the worst out there, but not recommended either.","user":"homecoming8","rank":[9,10]},{"title":"It's not great, but why?","rating":4,"date":"1 January 2020","review":"First and foremost, I respect the filmmakers for their dedication to this film. I do feel someone actually cared behind it. And because of this, I will share my true thoughts on the film and really take the time to say my take on it. The first act opens to a cartoony creepy boss and our main character Sarah getting fired and is hysterically thrown out of her job. The boss character stands out because he is the most unrealistic and over-the-top character in this entire story while the other characters remain a bit toned down and almost dull at times. Though it has a rough start, the first act does set up an interesting premise and possible character moments. We meet Dorian who's onscreen presence is welcoming and charming. He is one of the better things about this film. Also the music stands out as well, though it's generic 80's synth that shows like Stranger Things brought back. We do care about Sarah and Dorian and are rooting for them, especially once we learn more about these characters. It's unfortunate that these character moments have no pay off, and this clever premise is really used in the least clever of ways. The second act moves along and that's really where the story lost its footing. We get a lot of \"did you hear that?\" And cheap kills that clumsily move the plot along. The third act is nearly excruciating to watch. We have a very monotone and dull villain saying he is God and his victims pleading for their lives and asking why he's doing this. Sound familiar? Yes there's at least 20 other films like this. Many of the characters we've cared about are killed before we can really bond with them, and I believe the shortened runtime may be the reason to push things along. The acting at times is unwatchable and hysterical in moments when it's not meant to be. The characters make really dumb decisions that make you sigh. Unfortunately in the end it was another forgettable \"please don't hurt me\" gore-fest. It mostly reminded me of the film TERRIFIER but with a lot less interesting of a villain or clever kills. The killer is also a character and many tend to forget that. This killer was a hollow figure with a collection of weapons. We only know his motive is \"he likes to kill\" we really don't get to see him really be human. Even when he proves to be vulnerable and is stabbed in the foot it seems to have no effect on him and he laughs about it. The film stumbles along and we have more pleading, the last hope for the film is an exciting fight between our main character and the killer. The film sets this up only to quickly have her become just another victim and pleading for her life and asking the repetitive questions to the killer that just makes the viewers sigh. The end of the film is laughable and absurd and ultimately leaves you dissatisfied and sighing as the credits roll. Really I was disappointed that a clever premise turned into your usual  kill film. It was not great, but why? Well in the end It's a clever idea that needed an even more clever writer and it just fell flat. I wish these filmmakers the best and hope they improve in the future.","user":"Bloodysquite","rank":[7,8]},{"title":"Not very good","rating":4,"date":"19 January 2020","review":"As horror it's subpar, as comedy it's poorly written. The acting is below average except for the main girl, she's okay. Concept is pretty good...just the script wasn't very good. The comedy is VERY generic, and due to the writing lacking, that means the comedy is weak as well.<br><br>The only thing that could've saved this was to be full horror or full comedy.<br><br>As I find myself saying so often lately, this would've been a great concept for a TV show.","user":"mvike","rank":[4,4]}]