[{"title":"Spoiler indeed","rating":1,"date":"17 October 2018","review":"Out of compassion for other imdb viewers, I decided to write this warning.:<br><br>This film will spoil 1h30m of your life. The best that can be said about it is that the robotic lady in spandex is attractive. Special effects are bad, continuity is full of flaws, the acting is...what am I saying, there is no acting here. You keep watching, madly hoping that the ridiculous plot will make any sense, till the very ending, only to find out there is NO ending, the last scene does not make any sense, you feel like the movie has been cut short abruptly.<br><br>Stay away from this meaningless and instantly forgettable waste of time.","user":"profdanrod","rank":[14,14]},{"title":"1:35 minutes of my life I will never get back","rating":2,"date":"15 October 2018","review":"A Robot who screams and limps when it gets a shard of Rock is its thigh, then grits its teeth when it puts a bandage around it, One minute her uniform is covered in blood the next minute its spotless the the next shot its full of blood again, The Commander has a gun that fires forever and ever and ever, AND just a team of 4 people to go down onto a planet to check out if it habitable.. They fly down to the planet in something like a flying Caravan. once on the ground it looks like a Portacabin. IF you want to enjoy just 1:35 minutes of your life, DO NOT bother watching this film, I wish I had watched something else, like a recording of Grass growing..","user":"chieftainmk","rank":[24,29]},{"title":"Ludicrous, but not enough to be funny. Avoid.","rating":1,"date":"1 October 2018","review":"So cheesy it could have been shot in West Germany in 1988. I think they wanted to make some kind of revival of eh eighties. The CGI are awful. The costumes and make up are cheap. The music is unbearable. The voice of the human-like robot is... a robot voice.<br><br>The story ? The crew lands on a desert planet to assess for any malicious lifeforms. So they walk in the desert without any space/hazmat suit, just to catch any airborne bacteria or virus, but they must not touch the plants, no no no. then someone has a nosebleed but no quarantine, because \"Don't f... drink that water\".\n \nIt is ludicrous, but not enough to be funny. Avoid.","user":"permaculture-45885","rank":[9,10]}]