[{"title":"once again, an independent film outshines mainstream cinema","rating":7,"date":"24 May 2018","review":"I really enjoyed the movie. Very tragic story, but a very real story. The only problem I had was the fact that I know the movie doesn't even begin to scrape the real horrors of the underbelly of Los Angeles. However, most of the cast clearly acted their butts off for their roles. Great movie, well made, but it just doesn't touch the tip of the iceberg of how dangerous the life path for these young girls are. American child sex traffic is a real problem in the United States, but the sad part is is that a huge percentage of these girls are forced into this kind of lifestyle. No child should ever have to go through this, and no female should be a victim of life itself. My heart and prayers go out to the unfortunate who are experiencing all this as we speak.","user":"tdrish","rank":[42,54]},{"title":"How sad to know that there are so many like her in the world","rating":20,"date":"20 May 2018","review":"Something that hit me was the way in which the little girl was just bounced around from place to place. She had no stability in her life and no reason to believe that she was able to choose any other path other than the one she saw her own mother take. How sad to know that there are so many like her in the world. The nudity and stuff didn't bother me because I felt it wasn't gratuitous in nature. It felt very natural and like what would happen in reality.","user":"chokdee1","rank":[44,57]},{"title":"Almost Unbearable (Potential Spoilers)","rating":10,"date":"22 May 2018","review":"Girl Lost shows you the reality of these children's lives, and the filmmakers weren't afraid to show that a silver lining or happy ending isn't what happens to most of them. There's desperation, loss, betrayal, hopelessness, pain... all on a very real and believable scale. There are no moments of clarity or unexpected good fortunes to turn the characters lives around. It's harsh and bleak and relentless and utterly heartbreaking.","user":"kallavu","rank":[38,51]}]