[{"title":"Really Netflix","rating":1,"date":"25 January 2019","review":"I can't believe I made it through the whole thing. It was really bad. It just didn't make sense. Was Camilla hiding at the sisters the whole time? Was Kevin in on this with Monica? Ok so dad made a deal with Monica for her freedom but was the mom aware or was she just truly nuts? If Zelda actually helped Camilla then why was she so rude the first time she met Ana? Wouldn't she have known what was going down? Why was Camilla ok with kidnapping, when this whole thing was crazy? Lastly, they were supposed to be identical but they weren't. They both had red hair. A more identical look would have been if Tori Spelling was a character.","user":"jenniferlynn-49555","rank":[27,34]},{"title":"So bad it's almost good (but not quite)","rating":1,"date":"28 January 2019","review":"One of the worst movies I've ever seen, so terrible it's almost funny at some points. The random jump cuts to musical montages, the still shots for no apparent reason, and the best - when one character says \"we should go shopping!\", while they're shopping?<br><br>The storyline makes next to no sense, the acting is pretty atrocious, and the pacing is astonishingly bad. It's kind of like 'Get Out', expect terrible, and seemingly written by a teenager who watched Get Out and then thought \"I could do something like that\".<br><br>Great movie to watch if you need to kill some time, otherwise, don't bother.","user":"freya-gravel","rank":[21,26]},{"title":"Where does Netflix find this crap?","rating":2,"date":"17 January 2019","review":"First of all they can't even agree on the title of this train wreck. It's hard to know who is to blame for such an inept film as - whatever it is called. I guess we should hold the director responsible. Somehow she managed to cast actors with no acting ability or even personalities. The lead does have great eyes, so perhaps that's what was important. But with a screenplay this contrived I don't think she had much to work with in the first place. Truly horrid.","user":"rcreekmur","rank":[22,32]}]