[{"title":"Something Better Change... and not only the name of the Epoch","rating":8,"date":"17 May 2019","review":"In the opening titles of Canadian documentary \"Anthropocene: The Human Epoch\" (2018), directed by Jennifer Baichwal (who also wrote all the comments, sparingly provided, whether as onscreen titles, or as Alicia Vikander's occasionally didactically delivered narration), Edward Burtynsky and Nicholas de Pencier, a proposal which has been already a long-standing one in responsible scientific circles, is getting repeated, a need to change the name of the current geological epoch from the Holocen, which is, literally, the \"wholly recent\" period of geological time, to the Anthropocene, which would be, literally, the \"humanly recent\" period of geological time.<br><br>What follows is a photographic evidence, collected on camera over the last four years from six continents, all except for Antarctica, showing results of numerous examples of human activities proving that exactly humans are the primary cause of permanent planetary changes, most noticeably pronounced since the middle of 20th century, but extensively evident even in the last two and a half centuries, marked with the advancement of industrial revolutions, from the first one in the second half of 18th century, to the fourth one which is building up right now. Humans more than any other forces of nature, even more than all other natural phenomena combined, most notably including erosion, sedimentation, weather (temperature and precipitation activities), thunders, winds and tornadoes, tidal flow, and natural disasters such as volcanic eruptions and earthquakes.<br><br>In an almost unique successful diverge from otherwise mostly gravely thought and dead serious subjects, in Russia's potash mines in Ural, two miners are sitting and having a tee right in front of the camera, guessing the comments of future spectators of the scene, something like: \"Oh, those Russians, that's how they work, sit and drink a tee\". While still speculating whether camera, which records the moment, takes only a video, or an audio as well, one of the tee-drinkers exclaims \"I love my job!\" Well, who wouldn't... sitting, having a tee, and getting paid for it!<br><br>The filmmakers have circumnavigated the globe to visualize the strength and demonstrate the extent, henceforth simplify the grasp and facilitate the perception of human planetary footprint and, if it continues to be abused, domination which might lead to damnation.<br><br>Sometimes in awe, more often in mind-blowing disbelief we're witnessing: gigantic open pit nickel-copper-cobalt-palladium mine and all-direction underground corridors in Norilsk, Siberia, the most polluted city in Russia, and among the ten most polluted in the world... concrete seawalls in China that by now protect from maritime erosion 60% of the mainland coast... mind-altering potash mines in Russia's Ural mountains, contrasting on two levels, emotional and intellectual, attraction and disruption... lithium evaporation ponds in Chile's Atacama desert, surreal in appearance while photographed from drone perspective... East Africa's largest garbage dump, Dandora landfill in Kenya, constantly searched by poor people and marabou storks, hoping to get lucky and find things of value amidst all the trash... a bucket-wheel excavators (Bagger 288 and 293) at the open pit coal mine in Hambach in Germany, as if they came out of an SF movie, the biggest terrestrial machines ever built... the world's longest and deepest rail tunnel in Switzerland, the 57.5 km long, 2.3 km under the surface at its deepest point, twin-bore Gotthard base tunnel, providing a high-speed rail link under the Swiss Alps between northern and southern Europe... incredible vistas of Carrara marble quarries in the Apuan Alps of northern Tuscany, Italy... massive cutting at breakneck speed, causing destruction of Canada's finest and grandest, last remaining, ergo rare and endangered old-growth rainforests on Vancouver Island...<br><br>Presented scenes, like those from conservation sanctuaries in Kenya, from the London Zoo... deal also with the ever so alarmingly growing issue of species extinction...<br><br>Images captured in this documentary are impressive, often aggressive, sounds are seldom pleasant, almost always unnatural, expressing how we have transformed (malformed) the planet, exactly reflecting on how human activity alters our earthly landscapes and habitats: forcefully and abnormally. But strangely, results are more than once rather artistic, and even though contradicting the rational disturbance they cause, and therefore intellectually being rightfully repulsive, a good number of these fabricated vistas aesthetically appear quite appealing. But, content-wise, that's all what's good in this documentary. So, if we want to continue carving and digging, tunneling and bridging, spanning and rigging, engineering and painting our earthly canvas and within, no matter how artistic it turns out to be, basically ripping off this planet, replacing its natural versatility with techno uniformity, making it devoid of its self-sustainable habitats, thus bringing more and more other species to extinction, let us serve ourselves, until we're the last ones, and then be extinct we surely will. But if we want to regain the harmonious existence of all living beings inhabiting this earthly abode we've been given, we better change, change for better and change a lot.","user":"Davor_Blazevic_1959","rank":[39,44]},{"title":"Disturbingly Beautiful","rating":8,"date":"2 October 2018","review":"With 12,000 ton and ten story high machines on the move in German forests, pools of lithium gleaming in the Atacama Desert sun, 10,000 elephant tusks on fire in Kenya, furnaces glowing in the world's largest heavy metal smelter in Norilsk and Lagos growing to 20 million inhabitants, we tipped the balance of the earth. The Holocene Epoch is done and the age of mass extinction, planet altering industry and swift climate change gaining momentum.<br><br>This astonishing, mesmerizing and disturbingly beautiful documentary presents stunning images and commentary from around the world with the hope that human tenacity and ingenuity might assume a new direction. It is not accusatory but grounded in humility and open-mindedness (what humanity needs for any shift in consciousness). It is not a vision or rumination on the future but what is real and already here. What a wakeup call! Grounding moments of humor and insight, such as when Russian women talking about little flowers blooming in barren rock and Russian men joking about their work, brighten the film. I wish there was more depth in places, but overall Anthropocene is insightful, revelatory and compelling. Seen at the 2018 Toronto International Film Festival with the directors in attendance and providing input for this review. They recorded 300 hours per one hour of film.","user":"Raven-1969","rank":[35,44]},{"title":"Unique and timely","rating":7,"date":"11 November 2018","review":"Continuing in a series of Canadian documentaries (preceded by \"Manufacturing Landscapes\" and \"Watermark\"), \"Anthropocene\" travels to many regions of the world to show the impact of humans on the planet and the planet's adjustments to such changes.<br><br>There are a variety of places and situations covered in this fine film. Many include factories as well as outdoor excavations. The movie's success lies in its \"less is more\" approach where narration is minimal as it allows the brilliant camerawork to let the viewers reach their own conclusions as quietly as possible.<br><br>Some visuals stand out: the sidewalks and restaurants of Venice during a flood; people scavenging a landfill site in Kenya; a massive collection of elephant tusks in designed piles, also in Kenya; the partial destruction of a forest in British Columbia; and, most shocking, watching the destruction of a beautiful, old, historical church in a small German town. (In a strange way, it was a relief to know that my home city of Toronto is not the only place dedicated to destroying its architectural heritage.)<br><br>Near the end, the minimalist style starts to wear a bit thin but this does not in any way diminish the film's important and timely message. It is both educating and moving.","user":"proud_luddite","rank":[19,26]}]