[{"title":"The Search for Love Continues","rating":7,"date":"9 April 2019","review":"I was not drawn to see Sauvage, but did so because a friend asked me. I won't outline the story because that's already been addressed, but I will say that I found Sauvage interesting, moreso perhaps because the director was present for a post-screening Q&amp;A when I saw it as part of MoMA's New Directors Festival. One of the things this film expresses for me is that even though the world seems to group gay people and the gay existence as some kind of collective, group experience, it's really a very individual journey that each person confronts, deals with, and ultimately goes through on their own. The main character in Sauvage certainly has a unique perspective on life and living, and one that I doubt even has anything to do with the fact that he is gay. There's plenty of nudity, sex, and drug use, but none of it feel gratuitous or cheap. This film will be a bit too raw for many, but if you have even an ankling to check it out I suggest you do so.","user":"daoldiges","rank":[17,18]},{"title":"Wonderful drama","rating":10,"date":"20 September 2018","review":"A cruel, brutal and honest depiction of life as a young male prostitute in Paris. Leo lives in a very destructive existence. The movie takes us straight into life and does not hold back for how tough this life is. Felix Maritaud is fantastic in the role of Leo, and is able to express the despair he often experiences. But he also produces a protagonist who may not be able to change his existence (for reasons we do not know). Although the film is both brutal and intense, it also has warmth and shows friendship in a credible way. I also want to draw the effort to Eric Bernad in the role of Ahd. The relationship between him and Leo is one of the film's best scenes, but also the most demanding to be able to relate to. Frankly, I think the movie shows a harsh reality, perhaps in a closed world for most of us. The director will be praised for making a film that really manages to depict a human being in a merciless world. But the movie is also about that despite a tough situation, it's always the choice we take that has consequences. That way, the film does not produce these people as victims, but as living individuals who choose to live their lives, different from most of us. A strong movie, on many levels. Highly recommended.","user":"dakjets","rank":[46,54]},{"title":"Looking for love in all the wrong places.","rating":8,"date":"17 April 2019","review":"In 2008, United Artists released Francois Truffaut's 'The Wild Child'; a film about a child, around 12, roaming the forests in 1789, untamed and wild, unable to speak any human tongue, as though he emerged from the dawn of time.\nCamille Vidal-Naquet' 'Sauvage' or 'Wild' brought back to mind the Truffaut film.\nIn Vidal-Naquet's protagonist Leo, 22, is a male prostitute, poorly educated, who lives by his wits in the street, on the highways, the bridge selling his body.\nHis 'love' is Abd, a boxer of sorts, bi-sexual who protects hims; nonetheless Abd is looking for a port in a storm, an older man, who can pleasure him and make life comfortable for him.\nLeo is by inclination homosexual, who looks to please and to be coddled. His trysts are graphic, described in strikingly vivid colors rarely seen out of porno picture house, be oral or anal intercourse, or submitting to a giant dildo until he bleeds or a sadomasochistic trick. Or being beaten; eating poorly...a vagabond life, relieved by sex for money.\nLiving on the street, with other male prostitutes, he smokes crack, marijuana, drops meth. He tags team with others for a menage-a-trois, goes along with\npetty thievery.\nHis health suffers: from asthma, early signs of TB, decaying teeth. With a touch of irony, 'Sauvage' opens with a man we take for a doctor examining a naked Leo., and suddenly he is masturbating him; we are witnessing play acting for money.\nSaying this, thanks to a good health care system that does take good care of Leo when his health suffer.\nAnd then Leo finds an older man, in his 50s, who offers him a stable life, a home and no money worries in St. Jerome, Canada. A safe haven in a stormy life.\nAnd just as they are at the airport, Leo bolts and make his way back to the forest, and as the sunlight filters through the leafy grren shade of the trees, mother earth receives her body as he drifts off to sleep, as he finds\nVidal-Naquet uses her camera as an voyeur, an eye that records and espy the second oldest trade of the world. as Leo finds refuge to his feral nature.\nWe are in a dog-eat-dog world, where the so-called straight world find refuge in kinky sex, degradation and living out fantasy.\n'Sauvage' skates on the edge off 'cinema verite'. It's not a film forthe faint of heart. Yet, Vidal-Naquet deserves praise for treating a slice of life that deserves treatment.","user":"jakob13","rank":[10,10]}]