[{"title":"A Painfully Average Stretch of a Sketch that Never Quite Hits the Mark","rating":5,"date":"20 September 2019","review":"I was very interested in seeing what Patrick Brice does next (Creep &amp; Creep 2 are, in my opinion, awesome genre movies) and I'm not happy to say that \"Corporate Animals\" feels like a flop in each and every way.<br><br>Many reviews state the very same flaws and I can't find any better words, because they're right - it feels like a stretched out character sketch with a very shallow plot, uninventive sitatuations, most of the humor is based on archaic social stereotypes &amp; all the social commentary in the script is old and tiring already, which is also the case regarding the characters. You've seen all this or close variations of all this somewhere before. Nevertheless, the actors seemed to do their best with the script they've been given &amp; there are a few crank-out-a-smile moments. The plot never really takes off, never builds up to anything, eventually feeling repeatitive. In other words, there are some pacing issues. In the light of all the negative aspects it's hard to compliment anything else, what we've still left is the visual side of the movie, and, well, it's simply alright. There are a few tiny, cool surprises, one in a form of an animated dream.<br><br>\"Corporate Animals\" is a painfully average 90 minute comedy sketch &amp; the kind of a horror comedy that You can pass on while not missing anything. I recommend it for those who like the cast, comedy on the corporate themes or to those who want to see how Patrick Brice underwhelms You after the Creep duology. My rating: 5/10","user":"TwistedContent","rank":[20,30]},{"title":"Grossly Misunderstood and Underrated","rating":8,"date":"21 September 2019","review":"It's a very honest satire about our current world and a human psyche and how people still remain animals when conditions force them to. Beware it's not a light comedy, it's a comedy horror. This movie borrows some features from Tucker and Dale vs Evil (2010) and the Invention of Lying (2009) and I cannot say anything else to avoid spoilering the movie.<br><br>The trailer doesn't do the movie too much justice. The film is a hundred times darker than the trailer could lead you to believe.<br><br>There are some logic issues and a little unnecessary departure close to the end but otherwise I enjoyed the movie quite a lot.<br><br>Do not watch this movie with kids though older teenagers might be allowed.","user":"arriva","rank":[21,37]},{"title":"Very offbeat and unusually funny","rating":6,"date":"27 September 2019","review":"It starts off a bit slow but if you can get through the first 15min, what you'll get is a dark comedy about what happens when a bunch of employees have to pull together to survive being trapped in a cave with their a-hole boss.<br><br>It's an offbeat, unusually funny movie filled with a couple one liners that'll make you chuckle. For a quiet night in with nothing else to watch, give this movie a bash.<br><br>Don't believe all the poor reviews you see of this film. This will become a cult classic like Office Space in a couple years time","user":"callmelum","rank":[9,14]}]