[{"title":"Major spoilers and something that may have been missed","rating":7,"date":"23 March 2020","review":"If you want to know about the movie and the plot holes and all the could have, would have, should have's above. This is strictly something I think a lot of people misconstrued at the end.<br><br>At the end, it shows her reading a pregnancy test that was positive. I'm pretty sure the baby would be Shane's, by the way that her reaction to the test was. And to clarify, how could the baby live outside of the room? The creator, Shane, has died, therefore, the baby can live.","user":"abusby-06048","rank":[14,15]},{"title":"Very well constructed speculative fiction - or is it a moral tale?","rating":8,"date":"16 April 2019","review":"When I went to see that movie (among 50 others) in a fantasy film festival, I had absolutely zero expectation - which is probably the best mindset to watch it. I haven't seen RENAISSANCE (the director's previous theatrical feature film, from 2006), and this kind of mid-budget international production with funds from Luxemburg, Belgian and France rarely surprises.<br><br>Among the many definitions of the SF genre, one says it's a fiction based on ideas and strong internal consistency. In that respect, THE ROOM is both Speculative Fiction (with a single powerful underlying hypothesis) and a mean little moral tale (that goes far beyond \"be careful what you wish for\", but certainly includes it).<br><br>The ideas are nicely developed - characters and settings are convincing. Internal consistency feels a little forced at times (the aging process is a little too convenient), but the fictional world remains claustrophobically coherent, with two particularly inspired themes:<br><br>* the strange partly organic electric system (or is it a circulatory or nervous system) of the house is visually striking\n* the film draws a difference (which I won't reveal) between what adults always dream of and what children may dream. It's extremely clever, central to the plot and very depressing (if you're an adult)<br><br>All in all, an unassuming but intelligent and entertaining movie, somewhat thought-provoking.","user":"phil-35-898411","rank":[60,87]},{"title":"Interesting Idea, Terrible Characters","rating":4,"date":"2 February 2020","review":"In a world of sequels and remakes, it's nice to have a new idea, and the premise reminded me a little bit of the James Herbert novel, \"The Magic Cottage\".<br><br>Unfortunately the film is let down by terrible acting, and characters behaving and conversing in ways that made absolutely no sense.<br><br>Time and time again you find yourself groaning and losing patience with them making one stupid decision after the next, or having half a conversation that doesn't make sense.<br><br>Case in point: the husband goes to see John Doe who states he did what he did as it was \"the only way\". The natural response would be \"the only way to do what?\". Does he ask that? Of course not, that would make far too much sense.<br><br>Another example: the wife goes to leave the house with the baby and the husband knows it'll destroy the baby. Does he tell his wife? No, that would make far too much sense. He just asks her not to go and says to \"trust him\" as to why not.<br><br>And this stuff happens scene after scene after scene.<br><br>Also, the entire movie is entirely predictable, even down to the pregnancy ending. Speaking of which let's not forget to ask why the wife would mourn the death of the \"son\" who just raped her a few moments before and tried to kill her husband. Yes, very touching, pass the tissues.<br><br>Still, for effects, trying to be original, and an interesting idea, it still gets a generous 4/10.","user":"ManchesterMatthew","rank":[20,26]}]