[{"title":"Exhaustingly overdone, but still sweet enough.","rating":6,"date":"16 July 2018","review":"Even though this movie is not going to win anyone any academy awards, I am a bit surprised by how harshly people have rated it! Hallmark has been hammering in the royal movies (definitely in an attempt to capitalize on the royal wedding craze) and this movie is no different from any that have come prior---as a matter of fact, it is nearly a carbon copy of Hallmark's \"A Royal Christmas,\" minus the Christmas themes and some of the charm that Lacey Chabert brings to every movie she is part of. That being said, I do think it was a rather sweet film.<br><br>The two leads, Fiona Gubelmann as Sarah and Torrance Coombs as Daniel, were adorable together. We are told more about the development of their relationship than we actually see it, especially at the beginning, which is a shame, but this is understandably done to make room for the oodles of drama the movie has to cram in later. The two of them had nice chemistry, and I found a few of their scenes quite sweet, like when they dance together on the palace's patio.<br><br>That being said, this movie falls into its own cliches a little bit too hard. Fiona overacts like crazy on multiple occasions, and whether this is bad direction or a bad script or just bad acting, it's hard to tell. Sarah's awkwardness when meeting her prince boyfriend's family is so overdone that it instantly reminded me of the scene from Friends when Phoebe, after meeting Mike's bouegie parents, says, \"I'm sorry, I've never met a boyfriend's parents before!\" to which Mike replies, \"But you have met people before, right?\" Sarah does successfully charm all the non-high society people though, such as the employees at the castle, all in a transparent attempt to get us, the viewers, to adore her. She can't seem to win over the stuffy family, though, which is a common denominator for all of these royal movies---the family, usually just the queen, are so deeply ingrained in their own traditions and prejudices that they cannot learn to love their son's girlfriend until they have learned a valuable lesson. In this case, this valuable lesson is learned rather abruptly about three quarters of the way through the film, at which point the parents are suddenly quite fond of Sarah.<br><br>Not so easily won over is Daniel's sister Fiona, who is in line for the throne and will become queen should Daniel forfeit his princehood by marrying a commoner, and thus, a plan is born. I will say, the scheming sister is a new one for these movies---it's usually a regal acquaintance of the family/former flame of the prince desperate to hold a crown who is vying for this position of Evil Stock Character. Fiona, however, has a face absolutely meant for nefarious plans, and plays her role convincingly enough.<br><br>My main complaint (which is unfortunately a rather large one) is that this movie has been done so many times before that the entire idea of it seems tired. I don't think surprise princes is a plot that's been worn out yet, but the way Hallmark is executing it is always a cookie cutter of its previous royal film that they are slightly boring to watch. How about a conflict that doesn't resolve around disapproving parents? How about the man is the commoner and the woman is the princess (I have only seen this iteration done once by Hallmark, in Once Upon A Holiday)? These are the sorts of films that we will never see sequels for, because as far as Hallmark is concerned, now that the family is won over and the throne's integrity is still intact, there is absolutely nothing left to do. I would love to see these sorts of movies shake things up a bit.<br><br>Lastly, as a bit of a nitpick: can Hallmark please find formal gowns that don't look like they came straight out of the bargain bin at a prom store? That blue dress was just atrocious!","user":"savethewatchmaker","rank":[5,5]},{"title":"Wow.","rating":2,"date":"17 August 2018","review":"Why make movies that make the American \"commoner\" seem so dumb and the \"English\" like they have broomsticks up them?<br><br>Coffee? Yes we have it in UK.","user":"pauldevall-27436","rank":[10,12]},{"title":"I really wanted to love this movie","rating":1,"date":"21 May 2018","review":"I love Hallmark movies! But this movie could have been better with another lead actress. I lost interest after 33 mins.","user":"amycate","rank":[14,18]}]