[{"title":"Could have been edited down a bit and focused","rating":6,"date":"19 March 2019","review":"Like others, I followed the Theranos/Elizabeth Holmes story and in addition read the excellent book that investigative journalist John Carreyrou authored and published last year (Bad Blood).<br><br>It felt that the first part of this documentary was a hagiography rather than an incisive investigative documentary - the focus on the \"female Steve Jobs\" perspective dominated and she certainly seemed to have the same \"reality distortion field\" powers he had. However, having read the book my perspective was that she, and her boyfriend/COO Sunny Balwani were bullies (via lawyer David Boies, security guards and others) to their staff , associates and others and who benefited by manipulating otherwise smart, powerful people and taking advantage of their wishful thinking. Eventually the documentary got to the reality but it felt like a long time and frankly I found some of the interviews (eg with the respected behavioral economist Dan Ariely) to be somewhat ethereal and did not add value to the story.<br><br>I have been around start-ups and understand the notion of \"faking it a bit\" to get to the final \"vision\". However, to compare her to an Edison, a Jobs or a Musk was inappropriate. in terms of her ability to manipulate, tell brazen lies and intimidate I feel a much more appropriate comparison would have been Bernie Madoff.","user":"PeterSp1","rank":[73,76]},{"title":"An oddly light approach to some scary, terrible people","rating":5,"date":"21 March 2019","review":"Having read the book, Bad Blood, written by the journalist who broke the Wall Street Journal story, and having been shocked and absolutely disgusted by Holmes and Sunny, I found this to be oddly lighthearted and unfocused. It skipped so much of what made the story truly horrifying and would have benefited from being extended in a format such as Wild Wild Country. Maybe not quite to that length, but a deeper look would have been so fascinating, especially with the addition of the film. I would still encourage you to view it, though, if you are not well read on the case. Not horrible, but I was disappointed.","user":"katekoster-97668","rank":[56,58]},{"title":"Way to too flattering to M. Holmes","rating":5,"date":"22 March 2019","review":"Having absorbed every piece of information about this topic, I come to the conclusion that this documentary just scratches the surface, and unfortunately does not touch the hot potatoes.<br><br>Running a company 15 years, without anything working, and putting people's life at risk would expect me to believe they would dig deep down on how they operated this scam, and what's wrong with M. Holmes.<br><br>Nearly no profiling is done, nearly no dissection of the company 's internal power dynamics has been done.<br><br>They didn't even ask any of the employees if they ever believed, that they were up to something, or if it was an intentional scam all along.<br><br>Bothering me most is the portrayal of M. Holmes. Half of the documentary she is spewing here Steve Jobs Speeches, and in the end they even quote somebody, saying that she never intentionally went that route.<br><br>Come on, 15 years without anything working, faking voice, lying, deceiving, risking patients in cold blood for fame or money. This should have gone deeper, and not portray here as the naive kid which didn't get it done, but was well intention-ed.","user":"p_imdb-238-926380","rank":[54,56]}]