[{"title":"Lose Focus","rating":6,"date":"13 July 2018","review":"As usual, Jiang Wen served as the director, screenwriter, and actor of the film, but this time he seems to have lost focus.\nOccasionally, the aura is reminding the audience from time to time that the movie is relatively safe and relatively interesting. The lantern-style character rushed to show the world view to the audience, so Jiang Wen's quick editing with full tension turned into a rush in the film.\nSeeing the end, I feel that it is a sloppy ending in the sense of reason, and the sensibility feels \"finally over.\"","user":"e-70733","rank":[9,10]},{"title":"Total garbage","rating":1,"date":"1 February 2019","review":"Movie is complete mess. Incoherent scenes, tempo, editing, and dialogues. But I guess the director couldn't be criticized due to his presence in China. Such a waste of all the talents in the movie.","user":"MoebiusNu","rank":[6,8]},{"title":"I like this movie","rating":10,"date":"24 September 2018","review":"I have watched this for 8 times, and it's really enjoyable. For me,a native Chinese audience, the pace of dialogue may be a little fast, but not difficult to follow. \nI think it just says something about \"what should the youth of China do\" at that historic time when \"devil on the doorstep\". Hesitation and delaying seems ridiculous. And it's unnecessary as well as dangerous for our youth to get involved in CARDS PLAYING of those \"marvelous people\". Those people are silly indeed, and even failed to do such simple bad things. \nThe hero Li Tianran had been educated in both Eastern and Western, but he still didn't know how to revenge until he met the tailor Qiaohong. Love made this miracle turning a boy into a man. The scene on the roof is so romantic.\nAnother key point for this movie is the Peking City (or Peping at that time). Director Jiang Wen hides his love for the city behind lots of weird people and things. I had almost ignored the man sweeping floor in hospital, the man selling meat,and another one burning coal at street corner. Together with those opium abusers, followers of Japanese invaders, and spies of different forces, they all mixed in this city, drawing a strange, weird, but somehow \"harmony\" picture. Maybe it's not too weird to describe Peking or China at that time, as the director said \"the truth of life can be stranger than your imagination\".\nI have found some people might be offended by this movie, for its criticizing on Chinese,Japanese,Westerners, and movie-critics. That was rather more funny for me than just watch a movie. I watched a real social reaction...lol","user":"b-40945","rank":[3,4]}]