[{"title":"Entertaining investigative thriller by the numbers","rating":7,"date":"10 August 2019","review":"Jai mat ze moon, internationally known as The Leakers, is an entertaining mixture of a family drama and an investigative thriller. When a dangerous virus is released and threatens the entire population of South-East Asia, a pharmaceutical tycoon quickly develops a vaccine and even donates parts of it to the population. A mysterious group of hackers known as The Leakers however kidnaps the tycoon's son and menaces to expose the truth about the tycoon's sinsiter intentions and shady past if the hefty ransom isn't paid. Two completely different cops from two different countries start Investigating and soon uncover a gigantic conspiracy with numerous twists and turns.<br><br>To be honest, the main idea of this movie is predictable and copies numerous similar movies made in Hollywood decades ago. The acting performances aren't too memorable either and it's hard to empathize with the characters. However, the film convinces with solid pace, diversified locations and some creative plot twists towards the end. The creative mixture of dynamic action scenes, sinister crime scenes and tense family drama is intertwined with some mildly humorous and romantic elements as in so many Asian films which makes The Leakers an interesting experience for the whole family.<br><br>In the end, The Leakers doesn't reinvent the investigative thriller genre and lacks tension at times but it's diversified, fast-paced and entertaining until the very end. If you like disaster films, investigative thrillers or action-comedy movies when two completely different cops need to cooperate to solve a crime, you can give The Leakers a try. However, the movie didn't leave a deeper impression and I wouldn't purchase or watch it again.","user":"kluseba","rank":[1,1]},{"title":"Asian take on Mr. Robot","rating":5,"date":"30 June 2018","review":"Watching The Leakers reminded me so much of the ever popular TV Series Mr. Robot. With a corporate conspiracy being the basis with civil vigilantes taking matters into their own hands with different individuals dragged into the case.<br><br>Action-packed, decently paced and situations that made you question the very fabric of righteousness. For example, is it wrong to let a criminal go when the criminal's doing it for the greater good?<br><br>As intriguing as the plot may seem, I personally felt the movie suffered in terms of character development. People from different backgrounds were dragged into this case, being entangled in all these but yet you're supposed to care for them...unfortunately I don't. If anything, it felt like drama and action serves as the star of this movie with dialogues and characters are thrown into the mix. <br><br>With that said, isn't a disastrous movie. Actions were done in a very practical sense with almost very minimum CGI and all. A pretty decent movie to kill time with, just...don't get too invested into the characters...oh wait, you won't. Perhaps The Leakers would have worked MUCH better as a TV series where characters were given more than 10 minutes of development and back stories. <br><br>A great attempt but underwhelming, unfortunately.","user":"viclym","rank":[1,7]},{"title":"As entertaining and flawed as the typical Hong Kong action thriller, Herman Yau's cops-versus-robbers tale with a vigilante twist is perfectly disposable entertainme","rating":6,"date":"16 June 2018","review":"Continuing their director-screenwriter partnership that started some seven films ago, Herman Yau and Erica Lee concoct a cops-versus-robbers thriller with a vigilante twist. As the title suggests, somewhere between the good guys and the bad guys lies an organisation who claims to be on a mission of social justice. They want the public to know the truth behind the corrupt practices of a pharmaceutical company named Amanah and its founder Teo Jit Sun (Kent Cheng), who are at the centre of a viral epidemic sweeping through Malaysia, Singapore, Vietnam, Hong Kong and Thailand. And to prove their point, they have kidnapped Jit Sun's younger son Jun Yan (Wilfred Lau), demanding that his father not only make public the formula behind the antidote to the virus, but also release RM$1million worth of the antidote to the health authorities around the world.<br><br>It's an ambitious and intriguing concept all right - ambitious because few Hong Kong filmmakers have tried to portray a real-life pandemic in their territory, let alone Southeast Asia; and intriguing because there is within potential for a compelling moral drama about the circumstances under which we need to choose whether to break the law in order to uphold it. On both counts though, 'The Leakers' comes out somewhat short. Despite a promising setup that portends a conspiracy stretching across Malaysia, Hong Kong and Australia, Lee's script opts for a predictable and easy finish which makes you wonder why it was even necessary to go through so much trouble just to get the truth out. That also means the dilemma at the heart of the organisation's criminal practices is barely sufficiently fleshed out, though we'd be frank to admit that its target audience may not be bothered.<br><br>Indeed, Yau's film has been billed as a true-blue Hong Kong action thriller, and on that account, it does satisfy. As he demonstrated with last year's big-budget blockbuster 'Shock Wave', Yau is a perfectly competent director of taut and tense thrillers, and this one is no different. The pacing is tight and gripping from start to finish, and even when the script starts showing more and more of its loopholes in the second hour, Yau keeps the wheels turning on the picture so quickly that you won't have time on your mind to dwell on them. The action too, while not particularly memorable, is cleanly and nicely staged, especially an extended car chase that takes place along the streets and highways around Penang. It's been a while since we've had the pleasure of enjoying such Hong Kong-styled police action, and that nostalgia certainly makes what 'The Leakers' has to offer a lot more attractive.<br><br>Ditto for the ensemble that Yau has assembled for this film. As thinly drawn as the characters in Lee's script are, it is the sheer charisma of these actors that make their roles so watchable. Chief among them is Francis Ng, who brings his usual brand of rumpled coolness to the role of the about-to-be-divorced Hong Kong detective David Wong. On the other hand, Julian Cheung is his typical dapper and serious self as the Malaysian police officer Lee Weng Kan, and Ng and Cheung complement each other beautifully as 'buddy cops'. Charmaine Sheh's lauded news reporter Carly Yuan plays second fiddle to both men, but she, Cheng, Chrissie Chau, Louis Cheung and Sam Lee add some authentically Hong Kong star power to the film.<br><br>Lest we forget, the Hong Kong film industry was built not just on standouts like 'Infernal Affairs' but also on hundreds of effortlessly entertaining films like this one. We won't deny that there could be a much better film within had Lee and her co-writer Li Sheng bothered to develop a less straightforward story and given more flesh to the characters, but with Yau's steady direction, 'The Leakers' is a completely agreeable way to spend one-and-a-half hours of your time. It's a production full of genuine 'Hong Kong' feel for better and for worse, from its relentless pacing, to its action, and of course to its actors. As long as you have your expectations right, 'The Leakers' will keep you hooked like a good disposable Hong Kong movie should.","user":"moviexclusive","rank":[1,8]}]