[{"title":"Boring, Slow, Religious Rhetoric","rating":3,"date":"11 January 2019","review":"Yawn. I knew I should have turned it off after 5 minutes. Its just that the other 2 were pretty good so this one was surely going to get better. The religion of the aliens is finding peace in knowing that they are going to die..SO they spend the whole movie converting people and to convince the main character to kill himself....JEEZ...And there is nothing more to the story than that.<br><br>And...Spoilers.<br><br>\nAfter spending the whole movie defiant, and hopeful, suddenly out of nowhere, the main character just gives up and kills himself...OMG...that was lame...\n....And how is it that a group that can see the future and call monsters from another universe and yet still have no hope for surviving the end of the universe...There are other universes.!!!!","user":"garabedian123","rank":[28,37]},{"title":"Disappointing trilogy","rating":1,"date":"10 January 2019","review":"Out of the trilogy this is the worst one and the other 2 aren't even very good to begin with.","user":"mig-47718","rank":[35,48]},{"title":"So bad it makes the first two seem good","rating":1,"date":"10 January 2019","review":"I genuinely enjoyed some aspects of the first two movies. The animation, audio, art direction overall all were really well done. But none of that can save this trilogy or series from itself. I could deal with the lack of actual Godzilla action in the first two. Like many others, I assumed it was all build up for the third part. This third part just had to have action and engaging human drama... or at least more than before. But no, all we get is extended lazy exposition and mindless technobabble. Some SPOILERS: The scene where the glowing bright yellow body-less space snake (doesn't sound like a description for Ghidorah does it? Nope!) attack the space ship is one of the most unwatchable sequences I've ever had the displeasure of seeing. Having some whining shrieking bride crew member (or whatever she was) scream out exactly what we were watching for what felt like 20 minutes was unbearable. I never rooted for a human character's destruction more than I did watching her. And when the snake thing finally \"fights\" Godzilla? Godzilla literally stands there the whole time (in the same spot the entire movie actually). Ever make a potato clock? You know where you take a potato and attach thin wires that have little clips to the potato? That's pretty much the fight between the two most powerful \"monsters\" in this movie. Oh sorry - the wire/clips are actually from another universe and have no physical form except when its attaching to the potato - I mean biting Godzilla. And the only way to defeat this yellow snake thing is to poke some tall religious fanatic douche in the eye. (Someone actually got paid for coming up with this crap?)<br><br>I could go on and on more than I already have (geez I'm doing what this movie did to me!!) about how bad this movie is. Bottom line: thank God we have King of Monsters coming out in a few months to clear our palettes of this crap.","user":"trey39","rank":[25,36]}]