[{"title":"Funny, Goofy, Hunky!","rating":9,"date":"20 October 2019","review":"This movie was hilarious and actually really sweet. I like these types of fun popcorn movies and watching it with a bunch friends made it even better.\nFavorite Scene: Baking cookies\nFavorite Character: Beau\nFavorite Line: The eggs came from CHEECKENS!","user":"sbates-92060","rank":[4,5]},{"title":"I love JC Calciano's films","rating":10,"date":"17 September 2019","review":"I've been a fan of JC for some time, because he takes rom com staples and converts them into LGBTQ friendly stories. And with Steam Room Stories the movie, he's done it again. I think it's so important because it brings an audience in who may never go and see an LGBTQ film and makes it accessible to them, much like Love Simon did. How many times have we seen this kind of humor reserved only for an Adam Sandler type film and the audience that would normally watch them? Yes it's absurdist, but that's the point. It's got the spirit of Cry Baby or Revenge of the nerds and it knows what it is. Which makes it so much fun. We aren't watching this for Oscar award winning material. We are watching it to escape and have fun and smile, and I did just that while watching the film. It appeals to the masses while giving you a few good laughs, John Waters style!","user":"scoobdoonla","rank":[5,10]},{"title":"Inane fun","rating":8,"date":"13 October 2019","review":"The movie is purely for laffs and frivolity!<br><br>The plot is thread thin. Six very attractive dudes spend their days together hanging out in a steam room. Unfortunately one of the 'dudes' is there for an ulterior motive. As the story progresses we see 'ulterior motive guy' accepted into the steam room coterie. But this dude falls for 'big muscle dude' and being a member of 'the group'. Thus the twist in the plot. It isn't until the end of the movie we find out why the steam room dudes are always there.<br><br>This is a silly light entertainment movie. Why so many uncomplimentary reviews is beyond mee!","user":"cekadah","rank":[2,3]}]