[{"title":"As an American, this film tore my guts out.","rating":8,"date":"9 January 2019","review":"I'm also an ad guy who's spent his share of time in offices beating up strategy on white boards, so I was sucked right in and saw a bit of myself. The lead character Dominic was like most of the folks in media industries that serve some great big unseen master. We put our noses to the grindstone, put our hearts on the paper for the elusive \"win\", yet we overlook the damage we potentially could be causing to the world. And what damage they have done. I found out things I hadn't known before, like the role of the Mercers being behind both big data companies, thus guaranteeing their influence on the referendum. And that is where I started to pull on my guts. That they had not only done it to England but had done it to America; manipulated politics, empowering an element of society that we should be leaving in the dark cellar of the 20th century. The fear of the other on an ever shrinking world controlled by ever more powerful and terrible titans is a regression. But the story is still being told and we will know the conclusion... maybe.\nI highly recommend this film and leave one thought: In this ever more loud and volatile world, we must listen more than we talk.","user":"pjames10","rank":[178,278]},{"title":"The downside of ubiquitous communication devices and platforms..","rating":9,"date":"20 January 2019","review":"... in that your social media data can not just be harvested to sell you hats and hamburgers, but sell you misinformation literally tailored to you for political campaigns as well.<br><br>This is the tale of the 2016 referendum on Brexit- the vote in the UK to leave the European Union. Specifically it is a portrait of one man, Dominic Cummings (Benedict Cumberbatch), the director of the \"Leave\" campaign, or the campaign to exit the EU. I wasn't sure why the side story of the Cummings marriage and pregnancy was included at first, but later it becomes clear that Cummings would have come across as a statistician/political version of House, M.D. if that humanizing story was not present.<br><br>Cummings enlists the help of a tiny Canadian IT company - Aggregate IQ - to do data mining of social media for the \"Leave\" campaign, and they come up with three million potential Brexit voters that the \"Remain\" campaign (campaign to remain in the EU) knows nothing about. Cummings' strategy involves tenets of Sun Tzu's \"Art of War\" , specifically forcing the \"Remain\" campaign to \"fight in the darkness\", or wherever the \"Leave\" campaign chose them to fight. Specifically Britain has an equal time policy when it comes to political messages. So the Remain campaign would have a Nobel prize winning economist explaining the downside to leaving the EU in complex terms, and then the Leave side would talk about millions of Turks possibly emigrating to the UK, forcing the Remain side to waste time on trying to debunk that message.<br><br>It is up the viewer as to whether this tale is humorous or frightening, I think it is a little bit of both. On the frightening side you have political campaigns becoming the equivalent of the evil presence in the 1982 film Poltergeist - it knows what scares you. On the humorous side you see the frustration of the Remain side as the Leave side will simply not play by the rules. And kudos to the guy playing Boris Johnson. He looked just like him.<br><br>I'm only knocking one point off this almost perfect film because it had quite a bit of stuff that the viewer was just assumed to know. For example it kept talking about \"MPs\". In the US that is \"Military Police\". In the UK it is \"Members of Parliament\". I should not have to search Wikipedia in order to completely understand a film, but overall that is a minor complaint.<br><br>Highly recommended,and this is NOT a piece of propaganda.","user":"AlsExGal","rank":[78,123]},{"title":"Terrifying","rating":8,"date":"12 January 2019","review":"In the run-up to the 2016 referendum, nobody in the UK - or elsewhere, for that matter - genuinely believed that Vote Leave would win (similarly to the 2016 U.S. Presidential Election result). It seemed more or less incomprehensible that Remain would be defeated. This is arguably evidenced by the fact that there were no rules set out for the referendum and the meaning of its outcome (e.g. that it should require more than a measly 2% majority to invoke such major Constitutional upheaval) and that David Cameron resigned almost immediately thereafter.<br><br>This energetic and witty film explores just how the rug was swept out from under us all, and highlights how dangerous social media can be when used as a weapon. Unsurprisingly, Benedict Cumberbatch gives yet another engrossing performance, with an impressive and entertaining ensemble as well.<br><br>Whether you were politically-engaged in relation to the referendum or completely overwhelmed by all the jargon (and utter lies), this is an insightful drama well worth a watch. Although, don't expect it to outline what is certain to happen next in the Brexit saga: that'll be down to the fool at the helm of the ship, and her band of dim-witted and utterly divided crew.","user":"LiamCullen6","rank":[115,201]}]