[{"title":"Awful, Awful, Awful!","rating":1,"date":"22 September 2018","review":"Has to be the worst animated film for many a year. <br><br>A plot so flimsy the least breath of wind would blow it away, a 'fire breathing dragon' that is never seen to breath fire, animation that's so bad it gives the world of animation a bad name and voice 'characters' that are so awful most sound like the 'actors' are trying to replicate characters with speech impediments.<br><br>Avoid this like the plague, sometimes some movies can be so bad they turn out to be quite good (usually on a comedic scale) but honestly this really is so bad it's bad.","user":"mac-hawk","rank":[9,12]},{"title":"disappointed a 3 year old!","rating":1,"date":"30 September 2018","review":"With that title, any kid is going to expect something along the lines of Trolls. You know... great animation and music with an exciting storyline. Trolls was awesome and all the kids love it. I guess the makes of this knew that.<br><br>Trolled. Well, I think we've all been trolled with this garbage. Most kids could do better themselves. Most TV adverts are better animated. The lip syncing... they didn't even try! How did this ever get into production? Who thought it was a good idea to put money into this?<br><br>My 3 year old was gutted watching this. She chose to watch an old Disney movie from the 50s instead. Its quality was better!","user":"maximovlE","rank":[4,7]},{"title":"Poor Quality","rating":1,"date":"5 October 2018","review":"Character words didn't often match mouth movements - a no-no in animation. A mix of English dialects (e.g. British, Irish, New York) with the same voice actor often doing more than one character which was obvious and cheaply distracting. Backdrop animation was often static, and worse still it often didn't fit with the characters. Character animation looked as if created with different software than the background - characters looked like little plastic dolls in an 18th century painting. When walking didn't quite match the ground so looked like they were floating. Storyline, dialogue - dumb even for a fifth grader.","user":"westsideschl","rank":[3,5]}]