[{"title":"Amazing writing, amazing performances, incredible movie","rating":10,"date":"24 December 2019","review":"I'm not a Catholic, and this movie is very, very Catholic. But beyond that, it's one of the deepest cinematic examinations of faith I've ever seen. Sir Anthony Hopkins and Jonathan Pryce, playing Pope Benedict XVI and Cardinal Jorge Bergoglio (who later becomes Pope Francis) respectively, both deliver brilliant, finely crafted lines with stellar performances. (It's somewhat ironic that two Welsh actors are playing a German and an Argentenian, but most of the film is spoken in English, so it works out in some strange way.) I really didn't follow the most recent transition between Popes, so I had not expected to be so deeply involved with this movie, but I am very glad to have watched it. Highly recommended for its insightful look into the human condition and the underpinnings of faith with its sometimes wavering texture, even for the most religious of us. Beautifully filmed on location in Argentina and the Vatican. If you subscribe to Netflix, then I suggest you watch this movie tonight.","user":"steven-leibson","rank":[325,344]},{"title":"I love it, and I'm an atheist","rating":9,"date":"22 December 2019","review":"I've never felt compelled to write a review, but this time I felt I had to.<br><br>You see, this is a movie about two old guys, that believe in something I don't. The whole thing is pretty much just the two of them waking (slowly) and talking. No action, no beautiful woman, no explosions, no cursing. All the things I like in a movie and yet, I loved it.<br><br>It's well directed, planned, written and interpreted.<br><br>Thanks for making it, Netflix!","user":"ivo-g-andreotti","rank":[427,464]},{"title":"Four artists at the peak of their power.","rating":10,"date":"26 December 2019","review":"Much has been made of the brilliance of the two title performers, and deservedly so. Both Hopkins and Pryce are absolutely convincing as German and Argentinean pontiffs who converse in English (conveniently for viewers) as their common language. Each actor is so fresh and alive within the personality of his \"character\" that I was easily persuaded they may be truer to the souls of these men than the living originals.\nNot enough credit has been paid to Anthony McCarten, the writer of this complex, layered conversation. It is the kind of dialogue great men wish they had spoken. What courage and skill it takes to undertake such a verbal tour de force.\n(Imagine if world leaders couldn't hire speech writers. Could Shakespeare's kings and queens really speak as well as he wrote for them?)\nMcCarten has written the scripts for three Oscar-winning actors; isn't it time he was recognized?\nAnd Fernando Meirelles is the masterful director who brought all the elements together. This is a renaissance man, adept in many fields, from architecture to cinema--and organic farming as well. He has been nominated for one directing Oscar (for \"City of God\"), and here he shows his ability to maintain both visual interest and intellectual fascination through two hours of what amounts to an intense, extended talk.\nThat the movie never felt \"talky\" is a tribute to all four great artists.","user":"keithfranklinfowler","rank":[151,164]}]