[{"title":"TRASH","rating":2,"date":"26 December 2019","review":"Completely fictional, trash. Bad acting. Bad directing. I bet if you did some digging you would find OJ was the financial backer. Calling this movie trash is actually an insult to trash.","user":"bjp249249","rank":[48,54]},{"title":"1 star movie but +1 star for the \"spectacle\" of the subject.","rating":2,"date":"26 December 2019","review":"As a follower of this case, I regretted watching this.<br><br>A film which will get views based upon the doubts it will try to stir up. Such sensationalism is a well worn Hollywood movie practice including many of the \"controversial\" Michael Douglas movies, but this lands more like William Castle.<br><br>The premise as is detailed in the trailer, is that the famous murders that took place June 12, 2004 were in fact committed by a serial killer, not OJ Simpson. This possibility of what this film shows was previously raised on CNN but it simply has never been taken seriously elsewhere.<br><br>IMO, this film would have been best done as some kind of \"documentary\" with licensed images, period TV news video and headlines of the time to pose the possibilities that this presents.<br><br>The \"docudrama\" format, esp THIS one, IMO, fails to engage the viewer while presenting at times what appears to be at times a low budget slasher film. Either the director doesn't seem to want the audience to emphasize with the victims or is unable to.<br><br>Mena Suvari's performance lacks depth between simply switching from twitchy to vapid. It was real missed opportunity for Suvari who has managed to deliver in other roles. But Nick Stahl rises above expectations. My biggest disappointment in any of these portrayals was the superficial portrayal of Ron Goldman. OJ's character is shown only briefly and the movie does not make any effort of showing him as empathic, however, the detached portrait of the victims left a bad taste in my mouth.<br><br>MAJOR PROBLEMS.<br><br>Because the things I will list below aren't in the movie they are not \"spoilers\".<br><br>My biggest problem is that the film makes no effort in addressing the elephants in the room. For the premise of this film to be true, then one has to accept a whole list of things.<br><br>I'll start with the big one. During the trial the Simpson defense searched for every possible alternative.<br><br>If even PART of the information presented in this film were known at the time, Simpson's defense team would have been all over it. They were not. There was ZERO mention of it at or away from the trial (on the media).<br><br>To me, it is unbelievable that the \"dream team\" would have ignored the information presented in this film had it stood up to any scrutiny. I'm *sure* the house *next door* was checked out at the time.<br><br>Both OJ and the \"dream team\" *did* mention drug dealers along with graphic descriptions of their methods both during the trial and on camera.<br><br>But that theory is not what *this* film is about. OJ Simpson frequently referred to drug dealers after the trial but no one until now was there ever a extended mention of the things that this movie shows.<br><br>Then... OJ wrote a book \"If I Did It\" (sic). *That* would have been a good place to have presented what's in his movie... only it was not.<br><br>Then there is, well, practically everything else that one must ask, \"so if this is what happened, then why....?\"<br><br>Like the timing of the attack with OJ's departure to Chicago. Was that just coincidence? That's not proof of his guilt but that was some coincidence if this movie was true. Then there's the bloody finger. Then the finding of bloody glove, the loud banging on Kato's air conditioner (which remains a mystery of logic to me), the trail of victims blood through his house. Were all these things just coincidences?<br><br>I'm not even talking about OJ's history of violence. I will agree that there is a big difference between being a moody wife beater and a premeditated murderer but it's not as if this was out of the blue.<br><br>The forensic dept in LA may have been sloppy, but could the gang that couldn't handle their samples as the textbook says really pull off such a conspiracy?<br><br>Then the famous Bronco chase. Everyone has something to hide and I could see him panicking, however, let's remember that to most people, he was going to kill himself when that truck stopped. But if not that, then you have a disguise and a failed getaway.<br><br>There is no doubt that questions remain unanswered, but this is just too \"out there\" for this \"trial of the century\" viewer to be satisfied with.<br><br>The ESPN documentary \"Made in America\" to me is definitive and for a docu-drama mini-series, \"The People v. O. J. Simpson\" offered a high level of accuracy and surprisingly good performances.<br><br>I've seen other presentations proposing others (ones suggesting Al Cowlings, Jason Simpson and Ron Shipp being the real murderers), but among all of these, this ranks the lowest.","user":"Charlesc-5","rank":[14,16]},{"title":"Already my worst movie of 2020!","rating":1,"date":"3 January 2020","review":"Well, let's put it this way. I won't have to go much further to find the worst movie I've seen this year.<br><br>Somehow, David Farrands went from writing Halloween: The Curse of Michael Myers and documentaries on things like Amityville and Crystal Lake Memories: The Complete History of Friday the 13th and directing Never Sleep Again: The Elm Street Legacy to basically creating - to quote my friend Don Guarisco - \"appalling fan-fiction movies inspired by real murders.\" This follows up his 2019 film The Haunting of Sharon Tate, which had Hilary Duff as Sharon.<br><br>Here, Nicole Brown is played by Mena Suvari. Yes, Mena Suvari, who was once in films like American Pie, American Beauty and, umm, The Rage: Carrie 2. Even that last film is better than this. Imagine that sentence. Read it over again. Let that wash over you.<br><br>Taryn Manning, yes the same one who was in the band Boomkat and 8 Mile, she's Faye Resnick who spends most of the movie doing blow and trying to make out with Nicole, as if no one is still alive and can sue everyone involved with this movie.<br><br>Agnes Bruckner, who was Anna Nicole in the movie called Anna Nicole, is Kris Kardashian. There's also a guy - Trent Walker if you care - who plays Bruce Jenner and he looks nothing like him. His absence in one scene is referred to as \"such a drag.\" That's the level of this film.<br><br>At one point, Nick Stahl was John Connor and the Yellow Bard in Sin City, but here he's Glen Rogers, the Casanova Killer and the Cross Country Killer who was rumored to have killed Nicole in the 2012 documentary My Brother the Serial Killer. Rogers' brother Clay claimed that the suspect had met Nicole and was ready to take her down, claiming he was hired by O.J. Simpson to break into her home and steal everything he could, before telling her that, \"You may have to kill the (word for a female dog so I can get this past Amazon filters when I post the review).\"<br><br>Drew Roy, who was Jessie on Hannah Montana, is Ron Goldman. Bianca Brigitte VanDamme (yes, it's his daughter) is Detective Leigh. Larry Zerner - yes, Shelly from Friday the 13th: Part III is here. And Gene Freeman, who was in Crossbreed, is O.J., who is mainly a ghost hovering over the film.<br><br>Speaking of ghosts, there's an entire section of the film where Nicole is raised from her bed and begins getting tossed all over it like she's Barbara Hershey in The Entity. I'm not making any of this up. This fact alone made me love what I had been hating up until this point.<br><br>I mean, how did this actually get made? How did Mena Suvari even get the gumption to ask for an executive producer credit on this mess? Why did I watch it? Why am I spending so much time writing about it now instead of going to bed?<br><br>So many questions!<br><br>O.J. note 1: The night of the Bronco chase, I was at a bar called Robert's Roadside Inn and I've never heard such a rowdy bar get so quiet so fast. Seriously, some generations get the Kennedy Assassination and mine got O.J. and Al Cowlings in a slow-motion chase.<br><br>O.J. note 2: My theory is that Nicole and Ron were killed by a Predator, which are real creatures and our government created the movies as disinformation so that we wouldn't know the terrors that exist in space. As out TV signals move slower into deep space, the Predators were looking for the ultimate human to hunt. And if you watched mid-70's football, the perfect human male was probably O.J. Simpson. By the time they got to his house, he was long moved out and Nicole and Ron played the price. My theory, by the way, is not as insane as this movie.","user":"BandSAboutMovies","rank":[13,16]}]