[{"title":"I liked the cat","rating":1,"date":"16 April 2019","review":"There is nothing worth noting. I am literally here to say that I liked the cat. 1 star for the cat. It was the best actor.","user":"TheSchinppenSchnaff","rank":[24,24]},{"title":"This isn't an Asylum production?! Are we sure?","rating":1,"date":"1 August 2019","review":"So you've written a bad script and you know a bunch of wannabe actors who aren't good at acting but they'll work for free plus one of them has a car you can use to transport your gear in and a sister you want to get to know a bit better, so you make a film and it's bad, so very very bad, the type of film that makes celebrity hidden sex tapes look like they were something filmed by Martin Scorsese, but you've learned a few things in your years working the graveyard shift on the drive through at Big Bills Burgers &amp; Ribs, and one of those things is how to sell terrible products, so you call your film Pet Graveyard in the hope that people will mistake it for the new Pet Sematary because you know that that's the only way that you will get anyone to watch or buy your terrible film, I mean how hard can it be it's been working for The Asylum productions for years, and you've got to do something to get your $80 production costs back on this film because rent is due on Tuesday and your Mom/landlord is not a patient person.<br><br>Well it probably tricked some people, not me though, I torrented it because that's what films like this deserve. And after downloading my free copy of the film and suffering through its 90 minute runtime I then decided to do something to give back to society. First I burned the movie to disk and put it in a DVD case using a cover that my daughter specially designed for it that was covered in emojis of what looked like little brown blobs of icecream? It might have been something else I'll have to ask her, anyway, I then I went deep into the forest with just the movie and a shovel and dug the deepest darkest hole you could imagine, then I threw that dvd case and movie into the hole with all the satisfaction of a man who has just thrown a burnt dvd copy of a terrible movie he'd torrented into a hole he'd just dug, and proceeded to fill the hole in with a mixture of dirt and due to a weak bladder about a liter of bodily fluids, and I'm happy to report to you here and now that after 3 weeks and 7 hours 34 minutes the movie has not risen from its grave to haunt me or anyone else.<br><br>Worth 10 stars but I only gave it one star because I'm a contrary non conformist.","user":"freqeteq","rank":[16,16]},{"title":"Completely flatlines and worth burying","rating":1,"date":"30 May 2019","review":"The name The Asylum is enough to fill anybody with dread, the odd surprisingly watchable one aside much of their films are mediocre at best and most are dreadful to an intelligence insulting degree. A vast majority of their output is cheap looking, badly written and acted and basically looks like little effort was put into the film in question. When they rip off films too (a vast majority of them good or more ones), which is the case often, they strip away everything that made those films in question work and produces something the completely opposite in quality.<br><br>Capitalising upon the release of 'Pet Semetary' with a concept that borrows a lot from 'Flatliners', 'Pet Graveyard' is not one of The Asylum's worst (of which there is a large group of) and is not even the worst film of theirs released this year. Every flaw that is seen in much of their output is here though and as a film in its own right it has next to nothing to recommend it. Anybody expecting to be scared or intrigued are best looking elsewhere, as both are nowhere in sight in 'Pet Graveyard'. The recent 'Pet Semetary', which has yet to be seen but do want to see it having fond memories of the older version (that needs a re-watch though), has to be really terrible to be as bad or worse than this.<br><br>Visually, 'Pet Graveyard' is poorly made. Drably and less than stylishly shot, less than tightly edited and too drearily lit, with effects that look like they were made as an afterthought and with next to no money left. The music when it appears has no atmosphere and always used inappropriately. The inexperience does show in the direction but hopefully that will improve over-time with the right budget and resources.<br><br>What particularly sinks 'Pet Graveyard' is the script and especially the story. The script is as flat as a soggy pancake, has no natural flow and is quite cheesy. The pace is dull throughout, with a story that has far too little going on or at least takes too long to get going. What should have been intriguing with the experiments instead bores and perplexes as well as looking distractingly cheap. There is nothing scary or suspenseful, and when there are any attempts the execution is too obvious and occasionally camp.<br><br>Found nothing interesting or investable about the dull or irritating characters with vague motivations. The acting is very poor at best, not being able to do anything with the poorly written characters and having practically nothing to work with.<br><br>Have to agree that the least bad thing about 'Pet Graveyard' is the cat, but sadly not enough to save the film.<br><br>The cat aside, a waste of time. 1/10","user":"TheLittleSongbird","rank":[10,10]}]