[{"title":"A Better Ending Would Have Made This Truly Great","rating":6,"date":"11 April 2019","review":"When I first saw a trailer for \"The Wind\", I was intrigued by the mix of the western and horror genres. While that mixture does indeed produce a tense, foreboding atmosphere where a great story is set up, the final act really lets all the air out of the balloon by providing an ending that is disappointing no matter which way one looks at it.<br><br>For a basic plot summary, \"The Wind\" tells the story of Lizzy Maclin (Caitlin Gerard), who lives with husband Isaac (Ashley Zukerman) on the untamed western U.S. prairie of the late 1800s. Their only neighbors for miles are Emma (Julia Goldani Telles) and Gideon (Dylan McTee), and the two couples form a sort of uneasy truce with each other: they both \"want their space\" but at the same time are comforted that they are not completely alone. When both women begin to experience strange haunting-like scenarios (and blame demonic possession) and then a pregnancy-issue scenario accelerates the timetable, the isolated and windy open prairie may be as much to blame as anything else. Who knows what may reside in its theretofor uncharted depths.<br><br>All the setup and atmosphere in \"The Wind\" is actually very strong. It takes a non-linear approach to time (which really sucks the viewer into the proceedings) and despite being only about 90 minutes still manages to take its time and develop the characters. It is creepy in spots, thoughtful in others, and really sets up a scenario in which most viewers will be genuinely curious about how it will all shake out.<br><br>Only helping matters is Gerard, who pretty much steals the show here. If she is still a relative unknown now, that could change based on a performance like this. She is integral to nearly every scene and is the character viewers really empathize with. If \"The Wind\" would have been better overall, this could have been an award-winning acting job.<br><br>Unfortunately, the ending of this film is an enormous letdown. I don't mind the ambiguity of interpretation one bit (is it actually a demon or Lizzy's mind playing tricks on her?), but the cardinal sin here is that only one side of that coin is presented all along (i.e. the supposed \"twist\" doesn't work). The entire film, we are treated to a story in which it seems pretty straightforward what is happening (or at least could be happening). Then, the filmmakers pull a bait-and-switch by interjecting this \"maybe she is just lonely/crazy\" supposition right under the wire. Had this been a theme throughout it may have worked, but as it was it just felt like a way to end the flick when the writers didn't have a great plan to do so.<br><br>Thus, as much as I enjoyed the buildup, atmosphere, and acting in \"The Wind\", a better ending cold have upped my rating as much as two whole stars, I believe. Sadly, this ending feels tacked-on rather then anything really well thought-out. A missed opportunity, for sure.","user":"zkonedog","rank":[37,42]},{"title":"Well shot n well acted, creepy at times but too slow n the incoherent flashbacks n lousy editing makes this a time waster.","rating":4,"date":"20 December 2019","review":"I saw this without watching the trailer, without reading any reviews n I paid the price. The idea of a western n horror genre pulled me into seeing this.\nOne reviewer pointed out that this is like Vvitch n Hereditary. Well the moment these two names crop up, one can expect slow n boring horror.\nThe main lead actor looks a lil similar like Jared Leto.\nThe concept of various demons were not at all explored and unnecessary time was spent on incoherent flashbacks n still imagery n that is the biggest fault.","user":"Fella_shibby","rank":[35,44]},{"title":"Far too muddled for its own good. The time-lines are a mess.","rating":7,"date":"7 December 2019","review":"A depressing horror drama that is slow, confusing and leaves way too many unknowns in its flimsy equation.<br><br>The slow pace isn't much of an issue because the direction is moody and stylish enough to justify it. The real issue here for half the scenes is the uniquely muddled time-lines. I have never come across a movie that so often refuses to share with us WHEN something is happening. We have three basic time-settings: during Lizzy's pregnancy, during Emma's stay, and after Emma's murder - in that chronological order. That is a lot to mesh together, even when you allow the audiences to understand which is which, let alone when you don't. The plot hops and jumps freely and constantly from one to the other without taking the audiences into consideration. We are meant to guess half the time which scene belongs to which period. It becomes exasperating. I want to follow the PLOT and the characters, not have to guess the times.<br><br>So should movies be guessing games? Isn't that what mysteries are all about? Well... no, of course not. There ARE basic rules to story-telling that one needs to abide by, even in mysteries, otherwise the story isn't mysterious - it's incoherent: huge difference. A whole bunch of reviews mention this time confusion, so clearly the movie has failed in its \"experimentation\" with time. Unless annoying most people was the intentional aim here.<br><br>What's next? Will they soon add masks to the main characters so we can't even distinguish them from each other? Why not just delete the audio track too so we are forced to lip-read? Hell, turn the entire movie into a confusing puzzle-mess!<br><br>The time shifts double the already growing confusion regarding what is happening. The film opens with a very confusing sequence that it takes ages for us to decipher. Is Lizzy insane? Are both women insane? If both are insane, wouldn't that imply a demonic presence that is polluting their minds - as Lizzy claims? If there are demons, why do they so conveniently circumvent Isaac? Is it because he is mentally too strong for the demons to usurp? (Emma at one point says that Lizzy and Isaac are tougher than she and her husband Gideon.) Why is Isaac constantly absent? Where the hell can he go? Shouldn't he be working on his farm? How the hell did he manage to cheat on his wife with only four people co-existing on a large field? When Isaac visited Emma for the ol' in-out, where was Gideon? Did they arrange their clandestine meetings via mobile phones?<br><br>Is the preacher a victim or a demon summoner? Lizzy had met him earlier when she first arrived to the desolate farm, yet she finds him dead after his visit years later. Or was that just a hallucination?<br><br>Too many questions. I really like ambiguous horror flicks, especially slow moody ones, so I should love this film, right? I don't, because for one thing, it's way too glum, and secondly it leaves too many loose ends. The fun in a riddle is getting hints and figuring out how to make sense out of them. For that you need ENOUGH hints. This movie offers far too few. The script is too hint-poor to justify being a thinking-man's horror. It offers too many possible conclusions along with too few solid facts - along with a multiple-time-line story that only exacerbates all of this. An equation with 50 unknowns isn't an equation: it's a mess.<br><br>We are given too little information about the characters as well as the other basics. Aside from the fact Lizzy is German we know nothing about either her or the others. So what fighting chance have we even got in figuring out this riddle?","user":"fedor8","rank":[7,7]}]