[{"title":"BEAUTIFUL, FUNNY, INSPIRING !","rating":8,"date":"4 July 2019","review":"STILL HUMAN\nHong Kong newcomer director Oliver Siu Kuen Chan proves to be a natural master of storytelling with his award-winning debut, a dramedy about the cultural clash between a cranky man confined to a wheelchair and his Filipina maid. Named Best New Director at both Asian and Hong Kong Film Awards, the director brilliantly exercises precise levels of entertainment, with a delicate, humorous and heartfelt story of humanitarian values. Pointing to immigration issues, loneliness, unsolved family matters, struggles of the minority and the motivational power of oneself's dreams, it delivers top-notch performances from the entire cast, in a special blend of good laughs and heartbreaking moments.","user":"roger-99-171599","rank":[7,8]},{"title":"HK film industry turning a corner","rating":8,"date":"14 October 2019","review":"I was surprised by this film. It's a little overdone and cheesy but the great acting by Anthony Chau-Sang Wong helps carry the film along. Crises Consunji does well as a newcomer. She has a difficult role to represent the hopes and dreams of domestic helpers in Hong Kong. I've been disappointed by HK film for the last decade or so but there's some signs of a new beginning in the emotional intimate film. It doesn't have a big budget, and it looks to be shot on video but the colour grading and scenes are very lively and interesting. The sets help carry the viewer deep into Hong Kong subculture. It's important that these smaller films get made to show to international audiences. Things are looking up for HK film industry","user":"ben-snooks","rank":[3,3]},{"title":"Extraordinary and astounding","rating":10,"date":"21 June 2019","review":"Saw this film today with my daughter and absolutely loved it. Poignant yet uplifting in a manner and style reminiscent of Éric Rohmer. Astounding big screen debut for both Crisel Consunji and young female director Oliver Chan Siu Kuen. Oliver has given dignity to two groups of people rarely accorded such in society. And for Hong Kong superstar Anthony Wong with a career spanning over 30 years, having played gangsters, good cop, bad cop and serial-killers, I think this portrayal is one he will forever be proud of. You get so much \"rubbish\" (as lead character Cheong-Wing would put it) at the cinemas these days but occasionally an absolute gem appears. This film is certainly one of those gems.","user":"johanrazak","rank":[5,6]}]