[{"title":"listen to them","rating":7,"date":"13 September 2018","review":"Greetings again from the darkness. Politics in the United States is an embarrassment to any citizen who is paying attention these days. And by \"these days\", I'm referring to at least a couple of generations, if not even more. The bickering between and within political parties is more closely related to playground arguments than debates among statesmen. The most effective wall being built is the one between the two sides - it's a wall that has little to do with reason or \"the greater good\", and everything to do with standing steadfast in one's belief that an opinion is a fact that should be shared by all. Enter stage and film producer Jim Stern ... a self-described political junkie.<br><br>Mr. Stern grew up in a house of \"Kennedy Democrats\" and all but worships former President Barack Obama. He opens his film with clips of past Presidents, dating back to Theodore Roosevelt, and states his purpose as a desire to understand how so many Americans could vote for Donald Trump. It's an admirable mission, and Mr. Stern is to be commended as one of the few extremists (on either side) willing to listen to what the other side is saying. It's 9 weeks after the election, and Stern is in the audience for Obama's farewell speech. He (Stern) has tears in his eyes, as the man he so admires is being replaced by one who inspires little faith or respect.<br><br>We now flashback to 6 months prior to the election. Stern paraphrases Atticus Finch from TO KILL A MOCKINGBIRD, and pledges to try and understand the other side by getting to know their point of view. His road trip takes him from Florida to Cleveland to West Virginia to Arizona. Stern's approach is to present himself as a neutral interviewer so that folks don't get defensive, and instead just open up about their views. He speaks to a man who is a legal immigrant from Cuba, a Midwest Pastor who is every bit as adamant in his beliefs as Stern is in his own, a conservative radio talk show host in Arizona who eloquently states her case, and folks in West Virginia who just want the coal mines back up and running so that they might escape poverty. One of the men he speaks with is part of the infamous Hatfields and McCoys feud, and he admits to voting for Obama twice - but is now convinced Trump is the best hope for rescuing the state's economy. <br><br>Stern uses the ongoing campaign as the structure for his road trip and story, and doesn't shy away from admitting Hillary Clinton's \"basket of deplorables\" speech was a turning point ... as was the last minute renewing of the FBI investigation into her actions. But since we know all of that, what is most fascinating here is listening to regular folks ... voters ... providing insight into their viewpoints. These mid-America citizens are tired of politicians being bought and sold. Trump was saying what these people were thinking - he was reaching out to (mostly white) disaffected voters. Stern is stunned at the ovation Trump receives at the Republican convention in Cleveland. He is surrounded by tens of thousands of Americans who don't believe what he believes. It's a powerful moment for him and the film.<br><br>\"They hate her (Hillary) and they hate Obama too.\" Stern is hit with the harsh reality that his idol is not idolized by all. His most accurate statement is that blue state voters and red state voters simply do not understand each other. With so many of one group clustered in California and the northeast, while the others are spread across the middle of the country, it's really no surprise that these citizens have different views and needs. It's also not surprising that since the \"mainstream media\" is equally clustered in those two geographic areas, that information distributed is skewed towards those views and issues. Abortion and gay rights appear to be non-factors in his discussions, while jobs, corruption and illegal immigration are what matter.<br><br>Again, Mr. Stern is to be commended for letting these citizens speak their mind. It's a nice contrast to another high profile documentarian renowned for editing to prove his own well-publicized views. Stern's brother was a key negotiator in the Paris Accord, so he certainly has a personal stake in the drastic political change. In fact, we often see his true emotions despite his ability to remain impartial to those speaking on camera. Election night with violin music is a bit too much, but for the most part, Jim Stern and Atticus Finch work together here to enlighten the \"other\" side.","user":"ferguson-6","rank":[50,81]},{"title":"A film documenting liberals journey through the 2016 election, a slice in time, as flawed as it is.","rating":24,"date":"24 October 2018","review":"Starts off with the myth, the Kennedy lie, a man he worshiped, but who would have been ripped to shreds by the very left he believes today. The Kennedy's were in reality the first beneficiaries of the modern lefts propaganda machine having gained total control of the media system, \"Camelot\", when the reality drove Marilyn Monroe to suicide. Ted Kennedy even skated by when a woman mysterious drowned in his car, and these were the naifs who were responsible for the reckless 1965 immigration act which changed the country with no consideration to the consequences, and these considerations go unexamined by the left to this day, because its about pure faith, not reason, but pure faith.<br><br>And this documentary is testament to that, its value is in documenting the derangement of the left during this time. He's clearly distraught, but doesn't actually know why, because at the end of the day, Trump is to the left of both Kennedy or even Bill Clinton. A man who was pro LGBT before it was politically convenient, a man with Jewish grand children but is still called \"racist\" and \"xenophobic\" because the truth is the only thing that has changed is how far the left have lost the plot, they won too much, they gained too much cultural power, and it made them lazy, and corrupt, close minded and frankly intolerant. Questions are now hate speech because of how fragile their ideology has become. Everything is racist, everything is xenophobia, because the reality is that they have become so extreme that they don't believe in enforcing borders at all. Consequences be damned, its not about reason, but faith, so it doesn't matter.<br><br>And so they talk endlessly about empathy, but this is simply re-branded virtue signalling at fashionable causes. In one breath \"black lives matter\", and in the next pushing to divert resources instead to people who shouldn't be here in the first place. How many homeless are in Chicago? Thousands, but the left will walk over their bodies to find fresher \"victims\" to raise up, because its not about real change, its about appearing virtuous. The left have patted themselves on the back for so long that they just assume they are correct now, always pushing the line about being on the right side of history. But are they really, they speak of sustainability but they can't even sustain their own fertility rates, they don't even care about something as fundamental as the next generation for the continuance of their society, never mind their ideas. So when an alternate narrative comes along pointing out the flaws of the left, they simply cannot deal with it.<br><br>And its notable the cost of this virtue is never to be paid by themselves, the demand is always that others be forced to pay for their charity. No one is stopping these billionaire liberals from investing in the inner cities, its very telling that they instead only focus on politics instead.<br><br>The lefts fixation on credentialism is highlighted by this films fixation on Hillary Clinton's CV, which was the result of nepotism and objectively unimpressive in accomplishments outside her ability to rack up titles. On the night of her defeat, she abandoned her followers in their moment of confusion and grief, proving just how unqualified for leadership she was, and how flawed the judgement of the left has become. A fact not readily admitted to this very day.<br><br>While I give him credit for showing some of the other side of the story, the techniques of propaganda are still evident in this film, the selectiveness of what they show, especially the clips of Trump say it all, but I guess its also the only side the left would see, which makes it accurate in a strange way. Assertions are always made and never questioned, just repeating political talking points with no self reflection.\nThe second amendment is the final guarantor of liberty, the left attacks this while wailing about fascism. The Paris Accords were meant to divert hundreds of billions of dollars at the drop of hat over measures their very own data claimed would do effectively nothing, believing in climate change is irrelevant when you have no viable solution, and the lefts conflating political agendas with science is as dishonest as it gets. People are being mindlessly railroaded into vast expenditures of public money with no actual consideration for the opportunity costs. Everything is inevitable based on their assumptions, which are just presumptions, from outsourcing jobs to whether certain industries were viable when the left were busy rigging the game with subsidies and penalties.<br><br>We now live in a world where the \"good liberals\" of google fired a man over science, and now look to quietly emulate the totalitarian internet censorship of the chinese. They believe themselves to be so right that dissent can only be \"hate speech\" and \"fake news\", their arrogance is the real danger, and this documentary documents a slice of the delusion. The left killed religion, the party became their new church, and the the results, the behavior we see are predictable. I say this as a former democrat, the left isn't what they imagine themselves to be. They don't understand the other, because we live in their world, they don't live in ours.","user":"tetrahex","rank":[25,51]},{"title":"Clueless Liberals","rating":7,"date":"20 February 2019","review":"James Stern, to his credit, displays what a clueless liberal looks like. He is totally detached from the realities that most Americans face and the values they hold across the greater part of this country. He attempts to educate himself, but rather than \"listen\" as he claim, he cops a condescending attitude toward the religious hard working middle Americans that make up much of America. I though he actually had an \"ah ha\" moment when he talked to the rancher on Arizona border about the illegal immigration crisis and the realities of illegal border crossing but then defends those who would open American to those not invited or welcome here. People watching this video can, unexpectedlly, reaffirm that America made the right decision in 2016.","user":"jmiller21","rank":[12,23]}]