[{"title":"Who paid the critics off?","rating":1,"date":"3 September 2019","review":"This movie honestly doesn't deliver any laughs within the first 45 minutes. I can laugh at just about anything, but it's a try hard movie that takes a loose \"oh, I could see where that COULD be funny\" and ends up delivering this steaming pile of diarrhea. If you read any other review, you see the only real reason someone would watch this is because of Marc Maron and their love of his podcast or what have you.","user":"bpmullane","rank":[15,27]},{"title":"Not a comic book movie, thank goodness!","rating":8,"date":"20 July 2019","review":"If you ever listen to Marc Maron's podcast, WTF, this is a movie you won't want to miss. Also for fans of the Netflix series Glow, you're already familiar with Marc's accessible, honest work on the little screen. Don't believe any of the negative reviews for this film. Marc's performance is a tour-de-force, just check out the New York Times review of this original masterpiece. It's a quirky comedy, perfect for summer. Expertly directed with a wonderful tone, the film is worth watching twice, at least. Come on people, do we all just need to keep seeing pre-awareness content out of the Marvel universe which is sucking the life force and brain cells from us all? Rally around original movies that feature real talent and genuine craftsmanship. Also Marc plays all the guitar on the soundtrack and it's nice to hear.","user":"andykadison-875-760306","rank":[20,38]},{"title":"offbeat sword play","rating":7,"date":"11 July 2019","review":"Greetings again from the darkness. Lynn Shelton has put together a very successful career that began with her contributions to the early days of mumblecore (Andrew Bujalski, the Duplass brothers, et al). Along with her filmmaking, she has mixed in some fine TV work, including multiple episodes of \"GLOW\", \"Fresh Off the Boat\", and \"New Girl\". This time out, with a script she co-wrote with Mike O'Brien, she stays true to her offbeat roots and love of characters with character.<br><br>There is a story here, and in fact, it was the synopsis that contributed to me agreeing to review this one ... well that, and the previous work of Ms. Shelton. Cynthia (Jillian Bell) and her partner Mary (Michaela Watkins) have returned to Alabama with the expectation of inheriting Cynthia's grandfather's house. Instead of the house, Cynthia instead walks away with an antique sword, whose accompanying drawing and handwritten letter supposedly prove that the South won the Civil War.<br><br>A visit to Mel's Pawn Shop begins the process of finding a buyer for the sword. Cranky Mel is played by Marc Maron, best known for his stand-up comedy. As a shop owner, he seems constantly annoyed by his dim bulb employee Nathaniel (Jon Bass). The two couldn't be more different, as Nathaniel spends his work days plugged into conspiracy podcasts (including one run by the film's co-writer Mike O'Brien in a quick cameo). However, it's Nathaniel that discovers the \"truthers\" who believe the 'South won the war', and are the best possible fit as buyers for Cynthia's sword.<br><br>Director Shelton makes an appearance as Deirdre, Mel's former lover. As a couple, their rocky history includes significant drug use and little contribution to society. Also appearing is Toby Huss as Hog Jaws, the oddball middleman involved with the sword transaction. \"Seinfeld\" fans will recall Mr. Huss as \"The Wiz\" from that popular show.<br><br>This is a deep cut indie, and the humor will either appeal to you or you'll find it absolutely absurd (or maybe both). The entertainment is derived from the 'little' moments and the manner in which the characters interact. It appears many scenes were improvised, a trait of early Shelton projects, and with such talented comedy actors, it's no wonder. The offbeat story simply exists to give these actors a reason to be funny ... something they do quite well.","user":"ferguson-6","rank":[17,33]}]