[{"title":"Fantastic performances of the two main characters!","rating":9,"date":"18 May 2018","review":"Not only the nearly perfect performances of the two main characters in this film attrated me, but also the very \"spirit beauty\" of actress Tong truly fascinated me! Support them and try to watch ASAP!!!","user":"ethan-21472","rank":[13,14]},{"title":"Romance versus wealth","rating":7,"date":"4 June 2018","review":"How Long Will I Love U is a romantic comedy movie with supernatural elements and a few gloomy sequences. It tells the story of a real estate shark who plans on traveling nineteen years into the future to use this knowledge in order to expand his empire. However, the shift in the space-time continuum fails and opens a portal nineteen years in the past instead. It turns out that this portal is in the small apartment where the loan shark lived when he didn't have any investors and was about to lose his job. In present-day, a young woman who works in a jewelry store and dreams of getting married to a rich man lives in the same flat. One morning, she wakes up and is shocked to realize she shares her apartment with the unsuccessful property designer. In the beginning, she is distant to him and wants to get rid of him but their curiosity makes them bond as friendship soon becomes love interest. The young woman realizes she can't alter the past and the young man can't alter the future and attempting to meet their former or futures selves would lead to chaos. The young woman still travels back to the past to see herself as a child playing with her rich father who would soon die in a traffic accident. The property designer is curious about his future and stunned to see he has become a rich real estate shark. In present-day, the pitiless real estate shark realizes the past is about to shift and tries to convince the young woman to leave his former self and offers her the life she has always dreamed of. However, the young woman realizes the emotionless real estate shark is nothing like the sympathetic property designer but she has to make a choice that could alter past, present and future.<br><br>Let's start with the few negative elements about this good movie. First of all, the background story about time travelling is poorly explained as the script is lacking details in this part. The introduction of the young woman is somewhat confusing as one isn't quite sure what her real job is as she is mostly about to scam older men into marrying her in the beginning. Some parts of the movie are unnecessarily overacted, especially by lead actress Tong Liya who offers too many fake smiles and tears.<br><br>On the other side, the story is quite original and every loose end is solved and every question answered in the end. The movie's romantic side isn't too exaggerated and has a clumsy, juvenile, and sympathetic note. The film offers lots of situation comedy, especially when the property designer discovers the future and is amazed by food delivery services, mobile phones and virtual reality. The movie also has a gloomy touch related to corruption, greed and murder which obviously involves the mysterious death of the young woman's father. The film also has the message that money doesn't make you happy and shows how people in China are obsessed with fame, influence and money and leaving their communist culture behind for a world of steel, plastic and glass.<br><br>In the end, How Long Will I Love U is an entertaining movie that mixes romantic, humorous and dark elements in a balanced and unique way. Younger audiences in a relationship might even find this film even better than just good. If you can catch the film at a local cinema, don't hesitate to go for it.","user":"kluseba","rank":[6,7]},{"title":"Very interesting movie and the main characters performed well","rating":10,"date":"17 June 2018","review":"I don't speak or read Chinese, only fluent English, it was great movie and I had to read subtitles. Maybe one reason is its refreshing to see a movie not made by US Hollywood and roles you wouldn't see an Asian character have but its made by a country that doesn't have that issue :^)\nReally though very touching and moving at times, dramatic, charming, romantic comedy, as good if not better than anything US Hollywood makes in this genre. Chinese movies are getting pretty good these days and only getting better, hope to be able to see more movies and not the same ole that is US Hollywood.","user":"emperoryad","rank":[8,11]}]