[{"title":"Must Watch! Educate yourself USA!","rating":10,"date":"27 July 2018","review":"This documentary was so incredible. It shed light on so much of the true root of this terrible \"opioid epidemic\" we are facing today. Chris Bell interviews members of all sides of the Kratom argument and as a result is frankly, one of the least biased documentaries I have ever had the fortune of viewing. <br><br>As a chronic pain sufferer myself, I have tried every prescribed opiate known to man with a wide range of results. However, in the end, when the doctors cut me off of my pain medication, I was lead down a dark path to suffering and yes, suicide. I can't count the times I have spent in psychiatric hospitals as a result of my endless suffering that I very simply -WANTED TO END! <br><br>I have recently been diagnosed with Multiple Sclerosis, along with scoliosis, herniated disk, sciatica, severe hip and also knee pain. I have been forced to go back to Suboxone clinics in order to somewhat alleviate the pain I was in, as no doctors were willing to hear me about my pain since around the 2013 mark. I have walked the line of suboxone clinics, expensive treatment, and feeling like I'll never get the relief I need. <br><br>Thanks to this documentary, I recently tried Kratom for myself, and can I just tell you that I have been off of the soul-draining suboxone medication for 72 hours now? That alone is mind boggling to me. It looks like a leaf, smells like a leaf and frankly tastes like a leaf. To me, therefore I'm calling it a LEAF! And what a reLEAF (haha) it has been to me and my poor husband who has had to care for his 32 year old sick wife for the past 3 years? Thank God for this medicine. This plant. This natural remedy. <br><br>I don't feel high, I don't feel edgy or irritable as I did whilst on Rx opiates. I feel calm, happy, content, and pain FREE! I can hold my dear son and laugh with him! I even went to the pool and swam today after not getting out of bed for weeks. <br><br>Please watch this documentary and educate yourselves. This documentary can and will save the lives of people you love. It can't hurt, so give it a try. Don't let big pharma and our government sway you!","user":"musicandglamour","rank":[28,33]},{"title":"Trust plants more than DR's","rating":10,"date":"28 August 2018","review":"For 20 yrs was on a bad rollercoaster and finally went AMA with my Dr. During detox off opioids a friend told me about kratom. After some research and finding a local supplier the universe has answered my ? Doing more now than ever and personally with weed and kratom along with a great diet, no Dr needed. Great film it covers the on going battle for a plant that could help millions.","user":"stevenbyrd","rank":[13,17]},{"title":"Amazing unbiased documentary","rating":10,"date":"10 September 2018","review":"Gives the facts, straight and to the point. This is a conversation that needs to be brought to the for front. Thank you Chris bell for doing your part to end this epidemic!","user":"courtdeancd","rank":[10,13]}]