[{"title":"Surprisingly not bad","rating":5,"date":"23 January 2019","review":"If I had to describe every aspect of this movie in three words it would be 'surprisingly not bad'. I'm not saying that it's good, I'm just saying that it's surprisingly not bad. The acting, sound, cinematography, and effects are all better than what you would expect. The story itself isn't great, but it's a decent setup to what is essentially an excuse for cheesy jokes and bloody kills. I really could have done without the handful of pointless freeze-frame scenes. I'm not sure if they were trying to be stylish here but it just doesn't work.<br><br>Overall, it's very mediocre. But for a SyFy original, you could certainly do much worse. If you feel like turning your brain off for a little while and enjoy some cheesy practical effect horror, with copious amounts of fake blood, it's a decent watch. Just don't expect too much. 5/10","user":"mikedegroot","rank":[11,13]},{"title":"Dumb, cheeky, gory and fun","rating":7,"date":"21 October 2018","review":"If you're in the mood for over the top, gory fun, this movie delivers the goods. It's colorful, the actors are all game, especially the lead (Sabrina), and the creature (a sort of giant Razorback puppet in most scenes) is grotesque enough to be impressive. I had fun watching it, and as long as you're cognizant of what you're going to get from a movie with this title, you won't be disappointed. Special mention goes to the lady in the wheelchair. In fact, everyone on camera is giving it their all, and that elevates this movie to a higher level than expected. The movie involves teens and a cursed high school. The body count is astronomical. The backstory is ridiculous and inexplicable. What more do you need to know? Nothing, really. Just enjoy the zany ride.","user":"camvillarmarketing","rank":[21,30]},{"title":"Not bad, but very cheesy","rating":5,"date":"24 January 2019","review":"Cheesy, campy low budget flick. Entertaining enough but doesn't get the humour right.\nEnjoyable for a late night movie when you don't want anything serious but ultimately nothing special.","user":"Lost_Highway","rank":[7,10]}]