[{"title":"Disappointed is an understatement","rating":1,"date":"22 October 2018","review":"Tales from the Hood the original will always be one of my favorite movies....but what I just watched doesn't even deserve the same title. I didn't even know a part 2 was made. I just happened to catch a preview on Netflix and couldn't wait to watch it. Why would you make us wait all these years for a part 2 and this is what you give us??? It almost seemed like a comedy... where part 1 was full of excitement and horror. I struggled to watch it. My fiancé who didn't see the first one gave up on it before it ended. Come on man!!!","user":"monireh-47933","rank":[15,17]},{"title":"Not entirely sure these tales were worth telling...","rating":3,"date":"12 October 2018","review":"In 1995, Rusty Cundieff graced us horror fans with an interesting anthology film that was horrifying, fun, and provided very outspoken social commentary. Twenty years later, he announced a sequel was going to be made. I was overwhelmed with excitement, and followed the production as I awaited to hear what that devil Simms had to offer us in a second trip to 'The Hood.'<br><br>Unfortunately, my eagerness to go on this campy adventure came to a screeching halt during the first story, and never quite resumed. While the original was by no means a masterpiece, this one felt as if it was made of stories that should have been rejected as duds from the original. While anthology films should have a dose of humor to them, it should be balanced with horror, and there's none of that here. Just poorly attempted humor that fails to be humorous, in favor of being over the top zany. <br><br>Keith David does a fine job taking over the roll of Simms, originally played by Clarence Williams, who wisely chose not to return for the sequel. That's about as much praise as I can award this follow-up. It both looked and felt less like the work of Rusty Cundieff and more along the lines of a cheap and lost sequel of one of the Wayans brothers \"Scary Movie\" series. I'd vote to skip this one, if not for checking it out purely out of morbid curiosity. But even the very worst and cheesy Tales from the Crypt episodes were more enjoyable than anything this movie had to offer, and that's pretty disappointing.","user":"OccuIt_Detective","rank":[18,21]},{"title":"HORRIBLE!!!","rating":1,"date":"4 October 2018","review":"Oh my goodness, I could not wait for the sequel. I could not believe that the sequel was finally made. I wanted to see this film because the first movie was so good! The film had potential, but it fell flat as a tire. The writing is so terrible and the acting is so unbelievable. Stupid and more stupid! The Sacrifice was chilling with the actual newspaper clipping of slain teen, Emmett Till. I find the ending stupid because the man, who was married to a white woman, had to sacrifice himself to save his child and so Emmett could perish. I did not enjoy the hidden messages with interracial marriage and such. Emmett was lied on and his mother sacrificed and allowed his mutilated body to be seen, to let the world know the ugliness and brutality of hate had caused his death. I enjoyed the young actor that played the teen and I hope he is in other movies, plays, etc. The ending had the KKK in trucks that resembled WW2 trucks and it was awful. I will never watch the film again. I expected more from Spike and Rusty, big letdown!","user":"dollheaven","rank":[29,37]}]