[{"title":"No, ignore the 5+ reviews, they're the troll clowns.","rating":2,"date":"30 September 2019","review":"Just take a look at how many producers this movie has, and know that everyone of them has an account here praising this god awful movie,and have obviously called in a lot of favours to vote this up as a 7 at the time being. They are lies. This film has the worst acting of the year vote, with a plot that makes it sound like it might be for fans of \"Bubba Ho-Tep\", but it's far from it. It's like every actor that could do a bad 1930's Brooklyn accent was cast to see who could do it the worst. Mix that with cheap effects and gore effects that have been done better, mix it up with demonic clowns who can't seem to be killed and you have this sorry excuse for a waste of time. I've seen better acting in 70's porno films. Don't waste your time on this. And remember to come back and change your \"unhelpful\" vote if you clicked it because you where convinced by the lying reviews, then went and watched it, and realise I warned you not to bother.","user":"MikeHunt1075","rank":[32,40]},{"title":"Truly Terrible in Every Way - Not One Redeeming Feature","rating":1,"date":"14 September 2019","review":"Now, I'm a sucker for any film ending in -nado but this was so appalling on so many levels that the Asylum boys should sue. Script was non-existent, acting was so bad (and not in a funny way), and the gore was just pointless, and I'm a big fan of anything with 'zombie' in the title too.<br><br>Don't waste your time, even if you are desperate - you'd have more fun disabling your wifi and playing that dumb jumping dinosaur game on Google Chrome.","user":"GilesEnsor","rank":[25,31]},{"title":"I'd literally do anything but watch this ever again","rating":1,"date":"27 September 2019","review":"Waste of time. Way too gory for what it is, although I'm pretty sure they use jam for some scenes. I would rather have my cat wake me up at 3am for food than watch this movie. I would rather wear my glasses while wearing contacts than watch this movie. I would rather eat bologna than watch this movie. I would rather eat tuna than watch this movie. Give me back those 93 minutes.","user":"asafko-96168","rank":[21,28]}]