[{"title":"LEGO DC Comics Super Heroes Aquaman - Rage of Atlantis: Actually above par","rating":6,"date":"1 September 2018","review":"At this stage based on analytics (#nerd) 2018 needs every bit of help it can get and is shaping up to be one of the worst years in cinematic history.<br><br>A Lego DC movie is not going to be the thing that saves it however this particular one isn't actually all that bad.<br><br>Telling the story of Aquaman who has lost his mojo, no longer respected, humiliated on national television and incapable of defeating his foes he finds himself the lame duck of the Justice League.<br><br>Rage of Atlantis is a tad goofier than the average Lego movie, it's silly and doesn't try to hide this. That works both in it's favour and it's detriment, depends how you look at it.<br><br>The humour is mostly childish thus making it family friendly but there are plenty of jokes for the parents too.<br><br>Visually it looks fantastic, almost on par with the cinematic Lego outings such as The Lego Movie (2014).<br><br>One thing I can't get my head around however is the use of comic book Aquaman. I mean don't get me wrong that is preferential for me but the fact his appearance is so dramatically different in the cinematic universe they're trying to establish it seems like a strange choice.<br><br>Watchable stuff for fans of both Lego and DC.<br><br>The Good:<br><br>Looks great<br><br>Strong voice cast<br><br>The Bad:<br><br>More than slightly silly in places<br><br>Things I Learnt From This Movie:<br><br>Seagate is a highly original concept and I'm sure no lawyers gave this film the stinkeye at all!","user":"Platypuschow","rank":[8,9]},{"title":"The LEGO mass production spews out a half-hearted adventure...","rating":4,"date":"18 November 2018","review":"So why is it that I sat down to watch \"LEGO DC Comics Super Heroes: Aquaman - Rage of Atlantis\"? Well, on the sole reason that I have an 8 year old son who wanted to watch it.<br><br>This LEGO superhero movie didn't fare quite as well as some of the previous ones did.<br><br>Why? Well, first of all, Aquaman is sort of a bland superhero as superheroes go. And the storyline just wasn't particularly solidly crafted or constructed.<br><br>Sure it was nice to see Lobo here, but he could only do so much to salvage the movie.<br><br>The animation was top notch of course, as it always is in a LEGO produced animated movie. And the voice acting was great as well.<br><br>Even my 8 year old son whom loves both LEGO and superheroes actually fell asleep during the movie, so it just didn't have that magic touch to it.<br><br>I am tempted to say that this particular LEGO animated movie was build using the wrong bricks, or maybe even missing a brick or two to make it complete. I am sure that \"LEGO DC Comics Super Heroes: Aquaman - Rage of Atlantis\" will find appeal with some in the audience.","user":"paul_haakonsen","rank":[2,3]},{"title":"Reign of aquaman","rating":10,"date":"21 October 2018","review":"Pretty soon we are going to get Aquaman in James Wan movie and we saw the animation Throne of Atlantis . this here movie is more suited for kids however , cause it is a bit childish . other than that , it is quite entertaining .","user":"thisanant","rank":[1,1]}]