[{"title":"Review from a combat veteran.","rating":10,"date":"13 December 2019","review":"Last night COL Ferry and I (COL Coldwell, both USA) were able to watch the new WWI film, 1917, before it has national release. It is a cinematographic feast for the eyes, long expansive shots that follow the protagonists as they execute their mission. It does not hide the horrors that existed in trench warfare, it shows them for their brutality and abundance. (My great uncle died as a consequence of his service fighting in the trenches, mustard gas poisoning). In many ways it reminded me of Saving Private Ryan.<br><br>For those who have served in combat (I have deployments to Iraq and Afghanistan), I cannot tell you if the film will be too difficult to watch, it might well be, especially if incoming artillery is a trigger. For me, as the camera travels a few inches above the dirt advancing slowly up a berm, my response was visceral. I was taken back to the patrols we walked in Afghanistan, not knowing what was around the corner; not relaxing heightened vigilance, not knowing if there would be an IED, a child wearing a suicide vest, a sniper taking aim. For the protagonists in this film (as for all who served and are serving) surviving the climb up the berm, there is no sigh of relief, no respite from the fear of uncertainty. They (we) survive to move forward to face more uncertainty.<br><br>Watching allowed me to pay homage to my great uncle, and the approximate 800,000 other Brits who were killed or died as a consequence of their service. (Germany lost over 2 million soldiers in the war). Estimates put the total casualty numbers for both military and civilians at 40 million, half killed or died from wounds/infection.<br><br>I rate this film as 10/10, for many reasons. Directing, acting, set design, cinematography, musical score, the raw emotion it invokes. Some critics have said they never felt a connection with the characters, I suspect they never served in combat. While the brotherhood (including female War Fighters) is strong, there is also a common characteristic possessed by all War Fighters, the ability to focus on a mission and suppress emotion, even as those around the Fighter fall. This was the quality I recognized in the actors and why the viewer doesn't \"bond\" with the main protagonists; we, the viewer, were on the mission with them, we grieve as we can and move on.<br><br>Watch if you will, but know there is no pleasure in watching and the film will grab you and the beginning and not let you go. Even though we know the outcome of WWI, there is no joy, there is no peace. Watch because it will allow you a glimpse at the horror and brutality of war; reflect on their service and sacrifice. Note, as we (the viewer) are \"walking\" through the trenches, glancing shots of the young soldiers shows them with flat affect, isolation, almost apathy; this is the face of \"shell shock,\" what we know call post-traumatic stress disorder.<br><br>For original WW1 footage, watch \"They Shall Never Grow Old,\" an exceptional documentary.","user":"dr-peter-coldwell","rank":[1,2]},{"title":"I Wanted to Hate This Hauntingly Beautiful Gift of a Movie","rating":10,"date":"5 January 2020","review":"I sat in a packed yet silent theater this morning and watched, what I believe to be, the next Academy Award winner for the Best Picture. I'm not at all a fan of war movies but I am a fan of great movies....and 1917 is a great movie.\nI have never been so mesmerized by set design and direction, the mass human emotion of this film is astonishingly captured and embedded magically in the audience. It keeps running through my mind...the poetry and beauty intertwined with the raw misery of war.\nTreat yourself....see this movie!","user":"tgrafflin","rank":[720,957]},{"title":"Words fail me","rating":10,"date":"4 January 2020","review":"This film is overwhelming. I have nothing further to add, other than the compelling need for eternal remembrance to those who sacrificed their lives in any way, we can not fathom. We, citizens of any country, today, should feel ourselves lucky and blessed to exist. A Happy New Year to all. George from Hellas. NB: do not give it a second thought; watch it; even if this genre is not your cup of tea. After all, it is much more than a feature film. It's a massive dedication to unselfishness. Do yourself a favour and watch it. And then watch it once more.","user":"gkdidaxi","rank":[566,773]}]