[{"title":"Sweet sappy movie with sappy ending","rating":9,"date":"29 December 2018","review":"Life is hard and for much of this movie, that was the story for the three women. But as they declared as teens, these three unrelated women are family and good family trumps everything.<br><br>If you don't like sappy, pie-in=the-sky, I don't think you will like this movie. Like most movies produced for UPTV and Hallmark, realism has no place, at least not at the end. At least two people do complete personality 180's instantly, which usually drives me nuts, but in this case I just went with it.<br><br>There are many very sweet moments.<br><br>(BTW, I really would have like to have seen the chauvinist boss get more clearly brought down for his blatant sexual-harassing behavior. It's not clear whether that was a factor or not.)","user":"Jackbv123","rank":[4,4]},{"title":"Tis the season to be jolly","rating":7,"date":"28 December 2019","review":"Whether it is easy to not take 'Christmas on Holly Lane' and similar films seriously is dependent on whether the good things outweigh the bad and vice. Dependent on how many flaws there are and how big they are. And dependent on how well the film executed its good things. In some cases it is easy to not take it too seriously. In other cases it is very distracting when there are so many annoyances and done to an incompetent level.<br><br>'Christmas on Holly Lane' is not one of those films. It does have things wrong with it, then again when has a Hallmark, UPTV or Lifetime festive film (or similar) been perfect, and the flaws are a few of the usual ones. 'Christmas on Holly Lane' does achieve its aims though at being undemanding light-hearted entertainment that has charm and heart, not quite a jolly good time but not a folly, and one of the best recent festive film viewings.<br><br>Not every event and every character felt necessary, two of the boyfriend characters are quite sketchy and seemed thrown in for plot device reasons when the conflicts of Cat and Sarah were strong and identifiable enough already without them. They were fairly blandly played too.<br><br>Like a lot of this type of film, there are moments in the dialogue that is likely to make one groan (did with me) and had a forced feel. The ending felt too over-sentimental and tacked on.<br><br>However, regardless of any questions of the authenticity of the location 'Christmas on Holly Lane' looks good. Especially the scenery. The soundtrack is lovely to listen to and quite infectious, a good fit in placement. Of the recent Christmas film viewings from the likes of Hallmark, Lifetime etc. 'Christmas on Holly Lane' is one of the best written, namely because Sarah summing up the flaws of her husband and Riley's talk with Cat's daughter are quite poignant scenes that have degrees of truth.<br><br>Although the story is fairly typical and is not perfect, it is charming and heart-warming with conversations and situations that may not be innovative but are more real than most films in my recent festive films quest. The characters have more depth than most with the three leads particularly coming over like real people in situations that are relevant and easy to relate with for many. All three female leads are strong, especially Sarah Lancaster as the most interesting and well developed character of the three. Jaime M. Callica also does quite well, though the male cast are not as consistent due to their characters not being as compelling.<br><br>In summary, nice film if not a great one. 7/10","user":"TheLittleSongbird","rank":[2,2]},{"title":"Excellent!","rating":9,"date":"22 December 2018","review":"What a nice movie!Not the usual Christmass movie, it's more like how 3 long time friends change their lives for better.Just watch this movie and i am sure you will like it.","user":"ChrisStavroulis","rank":[3,4]}]