[{"title":"This was actually decent and I'm shocked","rating":6,"date":"20 October 2019","review":"So Nicholas Cage won an Oscar and pretty soon after his career plummeted. His films in the last few years are quite terrible and I'm actually a fan of his. I was pleasantly surprised by Kill Chain. The story, acting, direction and production value are all worthy of an Oscar winner. So great work Nick! I hope this is the start of a turn around and back into higher quality films.","user":"calicut110","rank":[51,66]},{"title":"Why is everyone bagging on this film?","rating":8,"date":"2 November 2019","review":"I went ahead and watched anyway and I really liked it. I have learned that if Rotten Tomatoes gives a movie 5 stars, it's probably terrible and in this case most critics disliked it. I thought it was one of Cage's better movies in a long time. I got into it right off the bat. I also say that as a picky person on films. This movie was very good.","user":"richtygart","rank":[36,46]},{"title":"Gets better as it goes along","rating":6,"date":"20 October 2019","review":"'Kill Chain' is going to lose some audience members in the first 15 minutes. It gets off to a very sloppy start. After the opening scene, a bizarre opening credits and then another awkward scene I thought I was in for a very long 90 minutes. But then the film found its rhythm and things began to click. Ryan Kwanten entered the film, in possible the best segment of the movie, and suddenly the movie wasn't seeming so bad. It's far from a masterpiece but it is a film that gets better and better as it goes along.<br><br>This movie takes itself very seriously. There isn't a single occasion in the entire movie I can remember where they try to make you laugh. Nicolas Cage, who is becoming synonymous with ultra violent revenge flicks it seems, is still a very watchable actor. He slips on the occasional line, but for the most part he's a stand-out in any scene he's in and he's not phoning it in.<br><br>The film turned out to be smarter than I expected it to be. Everything wraps itself together in quite a clever and creative way. If you don't need your films to be beautifully shot or have impeccable dialogue, and you're willing to get down and gritty in the seedy underbelly of a film, then this could just be the one for you. It won't be for everyone, but it is certainly watchable enough for a pass mark.","user":"jtindahouse","rank":[33,42]}]