[{"title":"A tense atmosphere","rating":7,"date":"5 September 2019","review":"The low budget nature of the movie taking place mostly in one cabin gives this a claustrophobic tense atmosphere. But the best part of the movie is the killers being played as normal convicts rather than indestructible slasher movie bogey men. One of them is not as enthusiastic about the chaos as the other one who is a sexual deviant and there's as much tension between them as there is between the killers and family members. That was an interesting way to go and makes it a little less predictable than the usual home invasion stuff. The movie takes a while to get going but once it does it becomes compelling but very uncomfortable viewing as the men taunt and murder family members. The acting by the cast playing the family in the hostage scenes is top notch and it makes for a disturbing experience. Can't say I enjoy seeing people suffer but as drama it was effective.","user":"brucenolan-26404","rank":[13,18]},{"title":"Terrible","rating":1,"date":"8 September 2019","review":"The acting was comical, no sense of threat despite the horrific circumstances, it's almost like a school production....one of the most amateur films I've seen in a very very long time","user":"scarlettimogen","rank":[9,13]},{"title":"Last house on the left in a cabin","rating":6,"date":"5 September 2019","review":"The movie reminded of last house on the left with its plot escaped convicts terrorising two girls in horrible ways as two cops hunt them down. Although thankfully they didn't put in the goofy comedy that's in that movie and played it serious. There are some shocks as characters who would normally survive these kinds of movies bite the dust until only the girls are left to face the lead villain who is probably one of the sleaziest characters you ever wish to meet. Its every bit as cheaply made as last house but some scenes are just as unsettling and even more so when you realise it actually happened in real life. Not a bad effort.","user":"dannyross-45402","rank":[10,15]}]