[{"title":"its like a hammerblow to the head","rating":2,"date":"19 February 2020","review":"'its a film about mean clowns(again), thats good enough, but the bad thing is that these sort of films had its heydays back in the feral and utterly raw early 1980's, thats 40 years ago, and its for sure a rotten tomatoe by all means and at all levels of acting and production. for those meany beanies loving gory clowns in a socalled horror setup , you do get some satisfaction, for the rest of us , ill just say stay away from this clown town og doomed deadly mockup of a clown feast.<br><br>the intro says its a runaway bride, but its a setup bride that got the nay from the groom, because she had a one night fling with a stipper, so off they go ,driving a car that doesnt move at all, till out of nowhere they enter clown town and straddles the clown town inn for a bridal suite, to sleep away the glomy thoughts. but its an erie place, and so its game on.... this was just a teaser, because the re lots of stripteasin in this flick<br><br>the acting are truly bad, the main sounds like shes had a real bachelorette partythe previous night, her voice sounds like a cow with a hangover and a heavy mastitis, her bridemaids not far behind. the clowns are indescribable dumbheads, the makeup crew couldve made some effort making them look like clowns. the extras on the set seems like theyve been caught with a net, and seems like theyve gotr a death sentence behind their ear, its so stiff and uninspired, just terrible. filmographicly its a mess, the lightsetting awful, the soundworkfraudulent, make up is a mockup, its badly edited, and the oneman on a keyboard score sounds like a humongous hippopotamus on a love spree.<br><br>there are just bright side in this production, and that is the interior design of the clown inn, theyve collected quite a few clown remedies, that makes a pretty good outfit for the story.<br><br>but its a 2 minus at best, and the grumpy old man are done with clowns, its my 700th review, so it should have been celebrated, so this was a great let down for sure. it a no recommend","user":"ops-52535","rank":[9,14]},{"title":"Not Too Bad","rating":7,"date":"13 March 2020","review":"I think some of these people just hate EVERYTHING. LOL. It's full of BORING female nudity, but, if that's what you like, you'll get to see some.<br><br>What *I* liked about it, was the rank humour! I laughed quite a bit. The acting was decent, as was the writing, cinematography, and directing. The female nudity is boring, but the MOVIE is not.<br><br>I really don't need to give you an in-depth synopsis: it's about KILLER CLOWNS, so you WILL see blood, gore, and guts.","user":"films_r_me-1","rank":[2,2]},{"title":"Bad!","rating":1,"date":"19 February 2020","review":"I dont want to say more about this.\nI literally felt asleep while watching this \"movie\", please dont watch if you dont like horrors. For your own safety.","user":"alexander-33622","rank":[4,11]}]