[{"title":"A little of this and a little bit of that...","rating":4,"date":"6 August 2019","review":"I must admit that I had my doubts when I sat down to watch the 2019 movie \"Xenophobia\" from directors Joe Castro, Thomas J. Churchill and Steven J. Escobar. Why? Well, because I was about to embark on a sci-fi anthology with alien abductions.<br><br>While the movie's cover/poster does seem interesting, it just doesn't really have that convincing touch to it, given the synopsis of the movie. But still, I sat down to watch it, as I believe in giving each movie a chance.<br><br>\"Xenophobia\" wasn't exactly a masterpiece in movie history, nor was it really as bad as I had initially expected it could turn out to be. The movie and the different segments were definitely watchable, but not likely a movie that you will be watching more than once.<br><br>The segments were of very various quality and contents, I will say that much. Of course you need to watch them yourselves to pick which one you like the best.<br><br>As for the special effects, well let's just say that \"Xenophobia\" was coming off as being a very ambitious low budget project with the filmmakers having their hearts and intentions in the right place. I actually think the special effects worked out well enough for the movie. Sure, they were not overly great and even had be breaking out in chuckles from time to time, but it just added that low budget and classic sci-fi feel to the movie.<br><br>All in all, your life is not going to be incomplete if you miss out on watching \"Xenophobia\". But if you have an unhealthy interest in sci-fi, alien abductions, and what not, then you might actually find something enjoyable in this 2019 alien abduction anthology.","user":"paul_haakonsen","rank":[8,13]},{"title":"Practical Aliens that take you back to 50's and 80's Sci-Fi films","rating":10,"date":"6 August 2019","review":"You won't find any CGI aliens in this film. Directed by 3 directors, with different stories that all come together to describe what the title really means, \"The fear of aliens\". You will be entertained from the alien abductees as they describe their stories of encounters and fears.","user":"jescofilm-1","rank":[11,21]},{"title":"The title is as bad as the movie","rating":3,"date":"6 August 2019","review":"If the title of this movie didn't turn you off, just wait until you being watching it.\nReminds me of a student thesis film school project.\nTo be honest, I gave it one star, just because I know how much work and time everyone who works on a movie puts into it.\nIts up to the director, cinematographer and editor to make everything work.\nOne star, for how much I enjoyed it. One star for being able to create a movie that's an hour long and actually convince the cast and crew they wouldn't be wasting their time. For a total of 3 Stars.\nIt was obvious the second the movie title popped up at the beginning, this was going to be a scary ride, not because its a scary movie, I am speaking metaphorically, as in, this is going to be a painful watch.\nI am certain there are probably some Alien Conspiracy movie fans who will love this B-film, and it will probably make it someday on to a film site like Roku, Pop Corn, etc. Maybe even on to a middle of the night antenna T.V. slot, for people with insomnia to watch.\nIt certainly ranks up their with many to The Asylum movies.\nSo lets rap this up: Predictable, poorly scripted, nonsensical, quality-phobic, with cheesy aliens.","user":"Randy_Dreammaker","rank":[11,23]}]