[{"title":"A family of supermodels suffer a family tragedy","rating":16,"date":"16 August 2019","review":"Everybody in this movie looks like they are supermodels and it became a bit difficult to focus on the story. I kept thinking about why nobody was this gorgeous when I was going to high school? I was suffering from acne and bad hairdos. The dad is a stud who looks like he works at a gym for twelve hours a day (no wonder he suffers a heart attack), the mom is a total babe and the kids look like that they could do Colgate commercials on their free time (so yeah). This family is so beautiful that they just can't be real. Oh yes, about the movie! Once you get past the supermodel shock you get to the story. It has a poor start, relying on the usual cliché of dad dies and mom has to provide for her children who are almost adults (I'd shed a tear if the kids didn't look like supermodels but that is probably just my jealousy talking). It struggles hard to be decent but eventually catches the attention and it gets reasonably better. It has probably two good actors involved like Olivia d'Abo and Kristanna Loken who make this film bearable to watch. I won't rate this movie (because of my jealousy of how beautiful they are) but it's ok to watch at least once.","user":"phoenixinvictus","rank":[13,15]},{"title":"Painful to watch","rating":2,"date":"23 September 2019","review":"Soap opera style plot and really bad acting. Only worth watching for the eye candy","user":"lorena-43339","rank":[9,10]},{"title":"Entertaining role reversal","rating":8,"date":"21 July 2019","review":"Usually the girl is exploited for sex and has to be rescued. Here the guy is the victim. After losing their Father a family moves to Purity Falls. The 18 year old son gets roped into becoming a prostitute by his neighbourhood madam.<br><br>The acting is quite good. Kristanna Loken as mom is slim and fun to watch. Should see more of her. Olivia d'abo is suitably madam like. Trevor Stines of Riverdale is the hapless boy.<br><br>Worth a watch.","user":"phd_travel","rank":[11,19]}]