[{"title":"Perfectly mimicking reality tv... maybe too closely","rating":4,"date":"17 May 2019","review":"All credit to the cast and crew they put their all into it....\nIt feels like one long introduction to maybe something... a bit like the shows it's a parody of. However just like the shows it's taking the pxss out of it never succeeds in creating the pay off that the everlasting build up sort of promises.....\nMaybe seek out the classic scam tv event from uk Ghostwatch... I want to say great things about this movie because it's so close to nailing it.... so I will finish with ambiguity.... see for yourselves.... temper your expectations","user":"shaneloveszombies","rank":[9,12]},{"title":"very funny but not as horror","rating":5,"date":"29 May 2019","review":"This was a very funny and strange movie, i love the faux hoarders show which is so accurate and i love every second. The jokes are quite funny despite the bathroom jokes which are always just cringy. I was thinking it was a zombie flick but its a evil dead possessed zombie thing, and i found it quite fun only if we get it in the last 20 mins or so. The special effects were quite good for such a low budget movie. Overall its a quite fun, and funny movie, with a few flaws of course, but for a low budget horror movie it was enjoyable and didnt spot major issuses.","user":"thebadatgaming","rank":[4,5]},{"title":"Dr. Phil and This old haunted hoarder's house.","rating":8,"date":"27 May 2019","review":"The picture takes place in Redford, Ohio (filmed in Canada). The economic turndown has caused the folks in town to be hoarders. This causes paranormal activity as the items were once owned by dead people. Our reality TV crew is going to focus on Murph Evans (Barry More) who owns multiple condemned properties where he stores items. The city is going to shut them down unless the crew can repair and restore them over the weekend.<br><br>The film is a spoof of reality TV shows. It includes the swagger walk, the cross armed poses, the faux drama sound track, and idiotic asides. At about an hour the film changed gears into a spoof of other films following the Delta House Belushi speech.<br><br>I fell in love with Elma Begovic who was excellent in her role. Good funny characters.<br><br>Guide: F-word. Brief partial nudity. No sex.","user":"nogodnomasters","rank":[3,7]}]