[{"title":"Cut short","rating":7,"date":"31 October 2019","review":"Not the running time in any sense, but this seems like it could have so much more. Or could have been more and could have been even more fun. Even so there is a lot of good ingredients in this, beginning with Rebecca Romijin. She really cherishes in her role as is her on screen husband (whom you may know from other stuff) ... also there will be bunnies (if you are into them).<br><br>But don't let the bunnies distract you (or maybe they will but there is a long way to go for them to appear), there are a lot of things happening to our main character, things that she might not deserve, but that she has to endure ... how will she cope? You'll have to watch to find out","user":"kosmasp","rank":[4,4]},{"title":"A fun ride","rating":7,"date":"24 August 2019","review":"I got to go to the premiere of this low budget horror flick called SATANIC PANIC. Honestly, I had no idea what this movie was about. The only thing I knew was that Chelsea Stardust directed it. If you don't know who Chelsea is, she directed an episode called 'All That We Destroy' on Hulu's Into the Dark series. I didn't like that episode but I liked the way she presented that episode.<br><br>This movie at core is a satanic horror comedy which works so well because of the writing. The jokes are genuinely funny and there's some commentary about class. But what works in this movie is the practical effects. The effects are so  amazing! It's gory and fun to watch.<br><br>The cinematography in this movie is nothing new, but what is really good is the soundtrack. In the Q/A, Chelsea described it as a mix between Goblin and John Carpenter and I whole heartedly agree.<br><br>What I didn't like in this movie is the editing, certain parts feel too choppy and certain parts feels slow. Nothing drastic. Another factor that worked was Chelsea's homage to horror films. From Halloween to Drag Me to Hell, she takes inspiration and builds on them. You can see a horror fan made this. When I make horror films in the future, hopefully, this is what it's gonna look like. A movie that tells it's own story but effectively pays homage to the ones that came before.<br><br>The acting is also really good: Hayley Griffith in her debutant performance essentially holds the flick, Ruby Modine really has some good lines and Rebecca Romjin is kind of okay. The scene stealer however was the character of Gypsy played by Arden Myrin.<br><br>I highly recommend everyone to watch this movie when it drops on September 6. It will be overshadowed by It Chapter 2 but whenever y'all get a chance, do watch it. It's a fun ride.<br><br>I give it a 7/10.","user":"hungry_nirupam","rank":[27,41]},{"title":"Could have gone so much further, but...","rating":5,"date":"25 September 2019","review":"Satanic panic had its moments. Few pretty funny/well made/well acted, and so many absolutely cringey bad or boring to death. Clearly the movie got worse the longer it went.<br><br>One thing I wonder: where did the flying vulva demon disappear and why didn't it come back?","user":"IdaBarracuda","rank":[12,16]}]