[{"title":"Alien Overlords: How did this cost a million dollars?!","rating":3,"date":"17 January 2019","review":"Looking at the cover of Alien Overlords you'd likely make some assumptions right? Alien invasion movie? Space ships? Lasers? Aliens? etc etc. Let me start right off the bat saying that it's not and it's one of the most deceptive movie covers I've seen in months.<br><br>Alien Overlords is filmed in a faux documentary format following a conspiracy theorist who claims to have evidence of government conspiracies and the infamous men in black. Is he a crazy old man or is there something to his claims?<br><br>The film has no action, it's essentially a \"Talkie\" and therefore very niche and certainly not what you'd likely expect. It follows the wacky conspiracy theory spouting man around as he begins to question everything and everyone around him.<br><br>The rants and conspiracies that you will hear are generally the classics from chemtrails to the government poisoning the water for population control, all head scratchingly silly stuff that scarily countless people believe. One of the other reviews on here is simply \"If you cannot handle the truth, do not watch that docu-movie and continue to live your life sleeping\" which I could say so much about but kind of demonstrates the theme of the movie perfectly.<br><br>I see the appeal of this, for those who adore real documentaries about similar themes and those who enjoy the X-files. For me however this was a bit of a drag, I guess I'm \"Sleeping\".<br><br>The Good:<br><br>Couple of interesting ideas<br><br>Nice monologue<br><br>The Bad:<br><br>Ultimately about themes that people in real life take too seriously<br><br>Hardly engaging stuff<br><br>Documentarian get's really annoying","user":"Platypuschow","rank":[8,10]},{"title":"Watching someone tell a story","rating":3,"date":"1 December 2018","review":"A sort of 'found footage' style film - although it presents itself as a re-enactment of actual events instead of being found footage, it is all still filmed through a hand held camera. The acting actually isn't so bad but it's just really slow for the most part as we are largely just watching someone tell a story about what is going on in their life with regard to the conspiracy he is trying to expose rather than watching the events unfold ourselves. Saved from a 1 star by the final 30 minutes which manages to bring some mystery and tension to it but it's too little and too late and the twist at the end was seen coming halfway through.\nAlso, don't be fooled by the poster - it has no bearing on the film at all!","user":"bomopu-54573","rank":[5,7]},{"title":"Cringe","rating":2,"date":"3 January 2019","review":"I usually like these conspiracy films, but the way it was shot and the charecters were real flimsy and I found myself hating the main charecter. Watched about 15 minutes before swearing and turning it off. It's the sort of thing someone would make that wanted to underhandedly ridicule conspiracy movies..","user":"jaye72","rank":[4,6]}]