[{"title":"Scarecrow's revenge on the audience","rating":3,"date":"21 December 2019","review":"A couple points for the concept, which appeals to my cheesy B-movie loving heart. On paper, it sounds great: vikings VS scarecrows! What's not to love? Mixing genres and giving slasher movies a new setting could've been a real plus.<br><br>One extra point for the witch lady, whose \"acting\" makes her seem like she could really use an exorcism.<br><br>Otherwise, this is pretty dull, with an elongated and frankly boring opening stalk-a-thon that evaporated my hopes for this being any fun right away.<br><br>What were have here is a movie that looks like a bunch of friends were trying to find uses for their ren faire costumes, but also happened to have a scarecrow getup lying around that they didn't want to go to waste.<br><br>The result is a movie about a group of unconvincing \"vikings\" being picked off slasher-style by a shambling scarecrow. Kinda makes you wonder how these guys managed to do any conquering when a really slow dude in rags can take out them out so easily, but hey.<br><br>Nowhere near as amusing as the silly premise made me hope.","user":"C_Jags","rank":[8,9]},{"title":"Vikings??","rating":2,"date":"24 December 2019","review":"So this was about vikings fighting scarecrow....well thats the only thing good about it. If you love cheesy actors and alot of cheesy dialogs, cuts and filming angles that really gets you to explore things as nosehairs fake screams and a few bloody bits....then this is for you.<br><br>Now to the goofy failed historic accuracies or lack of. The first thing you notice is a cornfield with \"modern\" scarecrows. Scarecrows didnt look like anything with straws in it up until perhaps 1800. Not to mention CORNFIELDS. Corn originate from the american continent which was discovered end of 1400 AD. \"Vikings\" or more accurate wording \"norsemen\" stopped being vikings in late 1000 AD some even earlier than that due to them being converted to christianity and after that forbidden to raid.<br><br>Then the clothes are all wrong if they would be \"vikings\" there would be more hides and curated skin.","user":"pofransson","rank":[4,4]},{"title":"Is it 2019","rating":1,"date":"28 December 2019","review":"WTF is it with the trend of releasing crap movies. There has been no effort put into this garbage, even the blood isn't the right colour - oh, I'm sorry, was that considered a spoiler. Seriously upset at the level of film making these days, can't even class this a B grade, more like S grade, and you know what the S is short for.","user":"staunton-gary","rank":[6,7]}]