[{"title":"No no no, and it could have been so good.","rating":6,"date":"10 December 2018","review":"Beautifully acted, Alison Steadman's portrayal of a dementia sufferer was faultless to the smallest detail - the small mewling noises she made to express herself broke my heart every time, gosh I know those... and Sheridan Smiths role was played equally well, you could feel her inner guilt when she coped less than perfectly, beautifully understated.<br><br>I made myself sit through this knowing how deeply it could affect me thinking it may be healthy for me to revisit, to open those dark cupboards you stuff full of the pain you go through being a carer for a parent with dementia, and for a while it was every bit as good as I would expect from Jimmy McGovern and this cast. Then towards the end it fell flat on its face.<br><br>The viewer is outrageously cheated with a happy ending when there ARE no happy endings with parental care because you don't just find the perfect care home like that, and the shoddy care homes are not revealed on the first day your parent moves in - they just aren't, and the staff don't suddenly come clean with you in reality, mistakes are hidden and remain hidden.. and - most outrageously of all - you don't find a sudden untapped source of financial support so you can put your loved one in the care home from heaven. The story just broke and then the realism became absurd and misplaced.<br><br>What a shame, this could have been absolute dynamite, but instead it feels like the greatest cop out I've ever seen from a drama with such a distinguished pedigree. I cant mark it as low as I feel it deserves in respect of the two main actors who did a grand job with what they had, but I feel like I've been sidelined, robbed and cheated, and so will all the many struggling family carers who go through to the bitter end. This drama portrays the 1% lottery winners. It tries to be real but it fails miserably, the handsome Prince comes along and sweeps Cinderella off her feet. We aren't children and this subject matter shouldn't be served up like a fairy story, its just plain wrong. Steadman and Smith's performances are wasted and in my opinion lead you to invest more than you really should.","user":"vicky-51523","rank":[12,18]},{"title":"Highlights the many failings caused by Tory Faux Austerity","rating":10,"date":"10 December 2018","review":"Having just spent half of the last month in the excellent Princess Royal Hospital, which serves the London Borough of Bromley I was in a position to witness their inability, due to funding inadequacies, to fully cater for the needs of geriatric patients.<br><br>Luckily at the age of 66 I was considered worth saving but I was left wondering how I would have been cared for if I had been five years older.<br><br>British voters need to realise that this is a snapshot of the current regime that is running our NHS into the ground.<br><br>Well done to the BBC.","user":"eddie-earl-99-521675","rank":[10,19]},{"title":"Incredible acting","rating":10,"date":"1 January 2019","review":"Two incredible actresses with a heart wrenching and compassionate script which they deliver brilliantly. I cried throughout and felt the pain Sheridan Smith portrayed. Superb drama from the BBC.","user":"tecs-569-995210","rank":[5,9]}]