[{"title":"Familiar Formula, Cheap and Lousy Execution","rating":3,"date":"13 December 2019","review":"Despite the obvious b-grade quality, Ron Perlman, Frank Grillo and the genre of western was enough for me to give it a try - I do occasionally enjoy the little movies with good ol' actors just having a fun time. Well, \"Hell on the Border\" is probably the lousiest western I've seen so far, but, thankfully, not entirely without a heart.<br><br>In the most aspects of filmmaking, \"Hell on the Border\" is weak and painfully cliché. The plot, based on the true story of Bass Reeves, the first black U.S. marshall, is stitched together from arcs that we've seen a hundred times before &amp; in a hundred better movies. I mean, there's literally not one hint of originality in \"Hell on the Border\". Same applies to the characters, though the duo of David Gyasi and Ron Perlman was at least mildly entertaining to watch. Frank Grillo, the villain, did a fine job. In portraying a mostly boring character. A pacing that drags constantly &amp; a high predictability factor - these are a few additional \"qualities\" this movie possesses. Most frustratingly, \"Hell on the Border\" is also a mess regarding all technical and aesthetical means - the cinematography is boring, even sketchy, the lighting &amp; color grading's effortless and way too amateur, the whole movie has a drab, grey-ish, even ugly look. Some random shots are extra grainy. To make it all worse, the original score was massively overused &amp; it was as cheap as everything else in this flick. Most of the action sequences were wack and unrealistic. For a 2019 movie with such actors, even for the usual b-movie, \"Hell on the Border\" is technically embarrassing.<br><br>When I said it has a heart, I meant only the aforementioned acting duo of David Gyasi and Ron Perlman, plus the extremely conventional story line - yes, conventional, not entirely useless. Nevertheless, I recommend \"Hell on the Water\" to absolutely no one, except if you're sold on the same things I was. You have been warned though. My rating: 3/10.","user":"TwistedContent","rank":[22,31]},{"title":"The real Lone Ranger.","rating":5,"date":"22 December 2019","review":"Seemed more like a made for TV western. Obviously not a high grade production. It is a story of Bass Reeves and the outlaws are real. Glad I watched, but probably not again.","user":"cwstrgzr","rank":[8,10]},{"title":"Lame amateurish production unworthy of the true story","rating":3,"date":"12 January 2020","review":"Where to start with the issues? Buildings with beautifully fresh and smoothly sawn walls, houses with aluminium roofs, six shooters that didn't need reloading, disjointed action sequences moving at glacial speeds......\nCamerawork was crude, used jerkiness and lens flare etc to no benefit.\nOne of the worst films I've seen in the last year, this was inconsistent, uneven, unrealistic and frankly has nothing to commend it except that it chose a story that should be told. Avoid.","user":"daithiosioradain","rank":[7,9]}]