[{"title":"Terrible","rating":1,"date":"5 October 2019","review":"I had low expectations for this movie but hoped that it was somewhat Goose Bumps inspired but no. This is just another cheap shot at far superior writing material and an attempt to cover the damage with pretty woman and softcore nudity. My advice, don't waste your time on the awful script and the even worse acting of this movie.","user":"skye-richards","rank":[5,6]},{"title":"Not even Bill Moseley or Bill Objects Jr could save his one!","rating":2,"date":"6 October 2019","review":"I know those 2 are both decent actors yet this movie was awful.... I did watch it till the end, though I did almost turn it off within the first 5mins as it was so obviously amateurish. But I went ahead and stuck it out as I was folding laundry and didn't feel like stopping to find something else to watch. The acting is the most horrifying thing about this one, other than that there isn't much to say... Saying it fell flat is an understatement, even saying that it was boring is not quite enough... I had a very hard time actually watching it and not just tuning it out and ignoring it. The overall concept has promise, but the end result was beyond mediocre. Film school project quality.","user":"Wikkid_Gamez","rank":[4,6]},{"title":"I've seen better performances from dolls from watching my little sister play with her Barbies","rating":2,"date":"7 October 2019","review":"Step right up folks, and see how bad a film can be when your casting director wouldn't know talent if it rented space up their #$%.<br><br>Never heard of any of these actors? Suprise, suprise. They're all terrible. They're being out-acted by the terrible un-entertaining puppets of the film. Got a phobia of killer dolls? This film might cure it! if you can sit through the god awful, unrealistic acting performances of all the human characters in this.<br><br>The plot is about a group of friends who .... ah, WHO CARES. Don't bother with this movie that should win the 'worst performances by an entire ensemble cast' award for 2019. Don't even bother checking this out if it's free to watch.","user":"MikeHunt1075","rank":[4,7]}]