[{"title":"Bad movie with paid reviews.","rating":1,"date":"11 February 2019","review":"There is some serious shilling going on here with this movie. 74% give this garbage 10/10. Another 15% award it 9 Stars which gets this movie a 7.9 rating overall. And there's a glowing review from an account with the directors name. Go figure.<br><br>This is a slow moving, uninspired horror movie without any redeeming qualities. There is no real story. The director bought some Halloween props, hired a few college Students and an old lady with bad makeup who likes to lick fake dismembered body part props.<br><br>You dont care about anyone on the screen and if you value your life time you shouldn't care about about this movie either.<br><br>Avoid at all costs. Watch out for the shills.","user":"Starantai","rank":[52,57]},{"title":"You might want to spend your Halloween at another relative...","rating":3,"date":"7 June 2019","review":"Alright, well I had no idea what I was getting myself into here when I sat down to watch \"Halloween at Aunt Ethel's\", except I had an anticipation of it being a horror movie.<br><br>Well, horror and horror might be stretching it a bit too far. At least it had elements of horror to it, but it seemed more of a low budget spoof than it did of being an actual horror movie.<br><br>I can't really claim to have been overly amused by the movie, as it definitely incorporated elements of comedy into the script as well. Perhaps I was just not in the target audience. Or perhaps it was the fact that everything just dripped with that particular amateurish, low budget feel to it. And that wasn't really something I had expected to be in for, so it was a slap in the face with a cold, dead fish for me.<br><br>It should be said that some of the acting performances were actually good and definitely helped make the movie bearable to watch and sit through. And I did manage to endure the entire movie, oddly enough. The likes of Stephanie Town ensured that there was some enjoyment to the movie, because she carried the movie quite a long way with her performance, in comparison to many others in the movie.<br><br>As for the \"villain\" of the movie... Seriously? Not only was that Aunt Ethel character laughable and just seemed more of a demented old lady than someone to be scared of. And the actress hired to portray this character wasn't particularly memorable.<br><br>This was not a bright moment in the history of horror movies, not by a long shot. And it is definitely not a movie that I will be returning to watch a second time.","user":"paul_haakonsen","rank":[21,22]},{"title":"When the cast and crew publicly humiliate themselves","rating":1,"date":"5 July 2019","review":"No, not *just* by taking part in this nonsense but by shamelessly (not to mention eponymously) reviewing this nonsense as the Citizen Kane of comedy horror -- or, in this case, more like horrific comedy.<br><br>\"Hilarious!!!! Sexy!!!! Fun!!!! Quirky!!!! Fast paced!!!! A Must See!!!!\", reviewed the director himself; if you must see for yourself, please, do scroll down and enjoy the second-hand embarrassment.<br><br>Needless to say, this is not only steaming garbage, but a boring heap at that.","user":"pauliecorleone-72628","rank":[29,32]}]