[{"title":"Why doesnt this have a higher rating?!","rating":10,"date":"8 November 2019","review":"I was almost not going to see this movie because of the rating! I'm so glad I decided to give it a go because I would've regretted it. This movie is great and I dont even like Christmas romance comedies! It wasnt overly sappy and filled with sex scenes like the regular theater movies and even with people spoiling the \"plot twist\" it was still well worth the watch! The storyline is very simple but nothing wrong with a little simplicity. Not all movies should be unpredictable. Predictable doesn't mean unsatisfying. I find the more UNpredictable the movie, the less satisfying because who wants to watch a whole bunch of random scenarios happen in one movie? Not this girl. That would be wAY too much.","user":"tomboysaid","rank":[363,479]},{"title":"Unexpected surprise of a film","rating":8,"date":"9 November 2019","review":"Saw this last night with my wife, who needed some cheering up after a tough week. This wouldn't have been my pick, but once I saw the cast and the Christmas vibe I thought 'why not?'<br><br>Another draw was that Paul Feig directed it. Who doesn't love Bridesmaids?!<br><br>It follows a down and out type character played by Emilia Clarke, who plays it pretty much to perfection. I'm not that familiar with her, but she really bears her soul here.<br><br>The film balances comedy and drama skillfully, I won't go into too much detail, but the audience here in Australia was laughing out loud throughout and my wife and I had tears by the end.<br><br>This is what I go to the movies for.<br><br>The good:\n<ul><li>script is funny and touching where it needs to be</li><li>cinematography</li><li>music by George Michael - really flows well with the visuals</li><li>the pacing</li></ul><br><br>Not so good:\n<ul><li>a few moments are a bit cliche</li><li>some characters are a bit one dimensional</li><li>political correctness in some scenes</li></ul><br><br>My advice would be to leave your cynicism at the door for this one, I am recommending my family and friends to watch it for sure!","user":"timbosssss","rank":[211,281]},{"title":"Christmas \"heartfull\" film","rating":7,"date":"8 November 2019","review":"Surprisingly good was expecting a cheesy rom/com holiday film. But instead the Movie make you look up and appreciate what you have in life 😊","user":"jwftoestand","rank":[148,206]}]