[{"title":"This Film Tore My Heart Out","rating":10,"date":"13 September 2019","review":"I've said this before, but I will also never be tired of saying it; A24 is easily the best studio out there today, in terms of releasing quality content. Their endless devotion to finding original and exciting projects has always been an admiration of mine. Each year, they seem to be building a bigger catalogue of movies. Waves is one of their latest films to be produced and will hit theatres this November. Here's why, even though it may be a tough pill to swallow at times, you should absolutely be seeking it out.<br><br>I will start off and say that I'm going to keep the premise very brief, because it's the type of film that consistently surprises its audience, becoming a completely different film by the end. For this reason alone, I'll simply say that Waves is a film about a relationship and a family who slowly falls apart in unexpected ways. I was incredibly invested in the set-up for this film and all of the characters in it, so when a certain moment occurs, I was floored. This movie moved me to tears in ways that I never thought it would.<br><br>Written and directed by Trey Edward Shultz (It Comes at Night, Krisha), he very carefully crafts this story in a way that feels true to life, while also having levity in times of crisis or grief. On top of the stellar writing and direction, the cinematography by Drew Daniels, who happens to have worked with this director for years, is out of this world. From the way the camera spins to tell a story or frames things perfectly for an aspect ratio change, I would be shocked if Daniels isn't talked about for his work here.<br><br>It goes without saying that Sterling K. Brown has deliver an amazing performance, and his work here is nothing short of that word. I believe he will be recognized for awards this coming season, but I would like to mention Taylor Russell as well. Playing sort of the backbone of this family, her character has a lot on her shoulders and there are a few scenes where she absolutely steals the show. Alexa Demie, Kelin Harrison Jr., and Renée Elise Goldsberry are all terrific as well, but there was just something I couldn't put my finger on when watching Waves unfold.<br><br>135 minutes doesn't seem too long for a film in hindsight, but the way this story plays out will probably make some audiences impatient. There are a couple of instances when this movie feels like it ends, but there's still a lot left to explore. Looking back on this possible negative though, I feel that a rewatch may have me forgiving that aspect, and that has everything to do with the score. Even in the moments where a movie like this would seem to drag, Trent Reznor and Atticus Ross provide a pulse-pounding score that will keep you invested, even during the slow moments in this family's life.<br><br>In the end, for what Waves sets out to be, it's nearly perfect. The route this film takes toward the end will probably not sit well with some viewers, but that aspect is what impacted me the most and took the film from great to incredible. It can be quite upsetting and depressing at times, so if you're not into that, I would suggest looking for a different film. With that said, this is easily one of the best movies I've seen in 2019 and I can't see myself changing my mind on that. This movie is a human drama that just goes for it and it tore a hole in my heart by the end. Waves is stellar.","user":"kjproulx","rank":[103,138]},{"title":"How does this have a 7.1?!?!?!?","rating":10,"date":"11 September 2019","review":"Just saw this movie at TIFF.... wow what a film. Incredibly unique, this is the next Moonlight without being anything like Moonlight at all. The whole cast is amazing and Trey Edward Shults puts it all together perfectly. Incredible score to boot. See you at the Oscars Waves.","user":"ncrd","rank":[71,115]},{"title":"Bleak, but never despondent; audacious and confidant filmmaking","rating":8,"date":"7 February 2020","review":"Writer/director <a href=\"/name/nm4099092/\">Trey Edward Shults</a>'s previous films, the unconventional Thanksgiving drama <a href=\"/title/tt4266638/\">Krisha (2015)</a> and the brilliant but poorly marketed post-apocalyptic thriller <a href=\"/title/tt4695012/\">It Comes at Night (2017)</a> would seem to have little in common with the more social realist concerns of Waves. However, all three share the same thematic DNA, focusing as they do on a family under intense pressure. And as with those films, if you're into formalism, you'll find plenty here to keep you happy; elaborate camera moves, varying aspect ratios, unusual colour correction, striking shot composition, a sound design which bleeds into the soundtrack/score (and vice versa), a quite audacious shift in focalisation at the half-way point, and a stunningly concise closing shot. On the other hand, it's emotionally bruising and takes its sweet time getting anywhere. It also asks much more of the viewer than your average Marvel movie, and some simply won't want to put in the legwork. Nothing wrong with that, of course, but if you consider cinema as entertainment only, I'd imagine Waves will leave you bored and frustrated. However, if you have the patience and are willing to take the journey on which the film wants to bring you, the cathartic rewards are many.<br><br>In a middle-class suburb in Florida, Tyler Williams (a brilliant <a href=\"/name/nm5123156/\">Kelvin Harrison Jr.</a>) is a popular high school senior and skilled wrestler, who is deeply in love with his girlfriend Alexis Lopez (<a href=\"/name/nm7051533/\">Alexa Demie</a>). At home, he has a good relationship with his sister Emily (a heartbreakingly sweet <a href=\"/name/nm5347988/\">Taylor Russell</a>) and stepmother Catherine (<a href=\"/name/nm0325989/\">Renée Elise Goldsberry</a>). However, his relationship with his domineering father Ronald (a sternly intimidating <a href=\"/name/nm1250791/\">Sterling K. Brown</a> in full-on stare mode) is somewhat strained due to Ronald, himself a former athlete who was forced to retire due to a knee injury, constantly pushing him to succeed. As the film begins, Tyler's shoulder is causing him problems, and although he keeps it a secret, he soon learns he has a Level 5 SLAP tear, with his doctor telling him he'll need surgery and a few months off from wrestling, or the damage will become permanent. However, he ignores the doctor's advice, continuing to wrestle and starting to self-medicate with Ronald's painkillers. Meanwhile, he becomes increasingly acerbic and starts drinking heavily. At around the half-way point of the film, the focalisation then shifts to the shy and socially awkward Emily, looking at her burgeoning romance with Tyler's wrestling teammate Luke (a passive and pensive <a href=\"/name/nm2348627/\">Lucas Hedges</a>). Meanwhile, the Williams family must try to come to terms with a horrific act of violence that could change all of their lives.<br><br>The most noticeable thing about Waves is the aesthetic audaciousness. What's especially interesting about the narrative bifurcation is that Emily barely appears in the first half and Tyler barely appears in the second, forcing the audience to completely recalibrate themselves vis-à-vis the film's milieu. However, for all its narrative gymnastics, it's Waves's visuals that really pop. Working with his regular cinematographer <a href=\"/name/nm2588703/\">Drew Daniels</a>, no matter how elaborate Shults's use of form becomes, it's always in service of the story, with the camera being used thematically rather than as a passive tool of observation. For example, the opening shot is inside a car occupied by Tyler and Alexis, but rather than shoot the scene in a shot/counter-shot format, Shults positions the camera between the duo, spinning in circles, and completing multiple 360-degree rotations. This immediately inculcates us into their sense of abandonment and exuberance. Before a single line of dialogue has been spoken, Shults has already started telling us who these people are. It's pure visual storytelling, showing rather telling.<br><br>This kind of form/content correlation occurs throughout the film. For example, in the first half, which is focalised by the restless and propulsive Tyler, the handheld camera rarely stops moving, reflecting his frenetic energy. However, when we shift to the quieter and more withdrawn Emily, Shults uses more static tripod shots and a much slower editing rhythm, which reflects Emily's calmer disposition. He also has the palette reflect this shift - whereas the first half is awash in garish blues, reds, and greens, the second has a more naturalistic look. A crucial part of the film's visual identity is the very unusual use of aspect ratio(s). Beginning in 1.85:1, the frame gradually reduces in width until it gets to 1.33:1, which is how Tyler's section ends. Then, at the start of Emily's section, it starts to widen again, eventually reaching 2.35:1. The narrowing ratio of the first half reflects how Tyler feels he's being progressively trapped as things continue to go wrong, whilst the widening ratio of the second half reflects Emily's determination to recover from tragedy and reconcile her family. In short, the first half symbolises an ever-increasing restriction, the second half a gradually discovered freedom.<br><br>And all of this is to say nothing of the diegetic lighting, the shot compositions and camera blocking, or the blending of <a href=\"/name/nm1908855/\">Johnnie Burn</a>'s immersive sound design, <a href=\"/name/nm0722153/\">Trent Reznor</a> and <a href=\"/name/nm1589604/\">Atticus Ross</a>'s discordant score, and the exceptional 32-song soundtrack.<br><br>Thematically, the film looks at the pressure to succeed, particularly in men. Ronald equates masculinity with strength, mocks Catherine's job, and barely acknowledges Emily. Instead, he pours all his effort into Tyler, through whom he's trying to live vicariously, pushing him to be the successful athlete that he himself could have been before injury ended his career. He's also acutely aware that as an African-American man, things won't come easy to his son, telling Tyler, \"we are not afforded the luxury of being average.\" However, Ronald is by no means the villain of the piece. He seems to genuinely feel that raising Tyler in this manner is the best thing, telling him, \"I don't push you because I want to, I push you because I have to\". The problem with all of this is that neither Tyler nor Ronald have a backup plan, so when things start to go wrong, Tyler immediately falls apart. And as things get worse and worse, he becomes a pseudo-Job figure, with the big difference being that Job was self-aware and understood his suffering.<br><br>In terms of problems, there are a few blatantly expositionary scenes. An especially egregious example is the scene where Ronald outlines how hard it is for a black man to get ahead in the US, using that as justification for why he pushes Tyler so hard. Whilst the sentiments are fine, it doesn't ring true that this is the first time Ronald has said this to Tyler. Surely he would have given him this talk in his youth? It's a well-acted scene in isolation, but in the context of the overall script, it's too literal and seems out of place. Additionally, Shults tends to use the stuff of daytime soap to propel the plot - the end of a sports career, the prospect of having a child at such a young age, a family tragedy. The performers make the material work, but the film does come close to melodrama on occasion.<br><br>Nevertheless, although it's initially bleak, looking at loss and disintegration, Waves ultimately reveals itself to be about the ability of love to conquer despair, about how life can persist no matter the circumstances, about the importance and restorative power of family. Shults uses this framework to build a quite audacious monument that celebrates the ordinary without ever overshadowing it.","user":"Bertaut","rank":[14,19]}]