[{"title":"Generally Light Hearted Movie","rating":4,"date":"18 January 2019","review":"The theme and the story of the movie stands out more than the actors and characters themselves. It is a movie that weaves in a solid emphasis on the importance of girl child education without being overly preachy. Its a fun, popcorn, lighthearted movie and you leave the cinema understanding just a little bit better the importance of people being educated particular girls.<br><br>For a movie that places such an emphasis on empowering girls, it is very odd that one of the main recurring characters in the film, Zainab, Sadiq's love interest is more or less MUTE throughout the movie. She doesn't say a single word and simply resorts to childlike coy glances and fluttering of eyelashes throughout her multiple appearances in the film. She is extremely docile and is portrayed as someone who is married off by who her father decides is best for her rather than her own personal choice. Her father is the one that decides Sadiq is a better suitor for her. She is given no opinion and even the teenage Aisha seems to have more spunk and fire than her. Zainab is portrayed as coming from a well to do family, and as someone who grew up in the North, currently lives in the North, I know that as of 2018, northern women from rich or upper middle class homes have more of a voice, choice or say in their daily lives and partners, from that aspect the film fed into a negative stereotype in a lazy manner and the producers missed an opportunity to tell a more nuanced and richer portrayal of northern women. Zainab could have been more fleshed out rather than being a pretty prop.<br><br>The music in the film is just right and does a great job in boosting the scenes. you almost don't want the scene to end because of the music. One of the first Nigerian films that had me looking out for the soundtrack details. The cinematography matches the film, its colorful and bright and the props and costumes were all of a good quality. Some nice tourism shots.<br><br>What happened to Bassey's initial girlfriend and Tony? Where they necessary? didn't add or take anything from the movie....The continuous social media aspect also diltued the film for me....<br><br>The characters are mostly forgettable..there wasn't much meat to work with..nothing quite memorable. Overall, its quite a fair effort, but one of those movies you watch on a free afternoon, smile but soon forget...","user":"Kigundu","rank":[9,10]},{"title":"Up North the Movie was superb","rating":9,"date":"30 December 2018","review":"This film shows off beautiful aspects of Northern Nigeria particularly Bauchi state. I can't wait to visit with my friends. Thank you for telling a beautiful story!","user":"jadeonblock","rank":[5,8]},{"title":"Suitable for 14 year olds","rating":3,"date":"28 March 2020","review":"Performed like a very clean Disney story. Limp and vacuous.","user":"craig-battison","rank":[3,4]}]