[{"title":"A great family Christmas movie.","rating":10,"date":"25 November 2018","review":"We're not professional movie critics. We don't watch much television and, as far as I know, this is the first time I've ever watched anything on Lifetime. However, we do have a special perspective to share about The Christmas Contract.<br><br>This was a movie about family and Christmas...and they nailed it.<br><br>My wife and I watched the movie with our daughters and their families. We all watched each scene in breathless anticipation. With every chair and sofa spot occupied, the little ones were spread out on the floor with blankets and pillows. We paused, replayed and paused again to point out specific details; even the 6-year olds were focused and engaged.<br><br>This unusual behavior is explained by the fact that we were watching the movie in the same living room where Jolie showed Jack the Christmas tree ornaments. As our youngest granddaughter (whose middle name is Jolie) cried out when Tim, Jolie, and Jack first drove up to the Guidry family home, \"That's Nana and Poppy's house!\"<br><br>Like most people, we had never anticipated anything like this. Our home was taken over by strangers, lots of them. We were simultaneously excited and dreadful; we built this home with meticulous attention to detail, and now someone was rearranging furniture and taking pictures off the walls. We weren't as much concerned about physical damage as we were about how our home was to be portrayed and the quality of the movie in which it was to be featured.<br><br>The outcome could not be more pleasant. Monika Mitchell (director) did a fantastic job molding the actors and the settings to represent a credible reality. We could see ourselves in every situation including playing games on the back porch, making breakfast for visitors, and sharing meals with extended family and friends at the dining room table. Seeing Cheryl Ladd and Bruce Boxleitner with their movie family in our home seemed perfectly natural. The actors were all amazingly approachable and engaging. Hilarie Burton is as genuine as you might hope, and as far as I could tell, there was no difference between the character and the person. Our only regret is that, as hosts, we weren't able to visit and get to know all of them properly.<br><br>As natives to Lafayette and the surrounding area, we're also wary of fake accents and hokey stereotypes. Nothing was exaggerated. Downtown Lafayette has quiet streets, cafés, a cathedral, and a courthouse. Joel Robideaux is really the mayor and his accent is 100% Lafayette. Acadian Village is a real treat and we encourage all of our visiting friends to check it out. Rocky's accent was a little heavy, but I know lots of guys with the same.<br><br>And to address a prior reviewer's comment; yes, the cicadas are really that loud and this isn't \"the South\", it's Lafayette.<br><br>Biased as it may be, our opinion is that the movie is a home run. This is a Christmas event our family will share for years to come and we sincerely hope you will too.<br><br>Roy and Vickie Couvillion<br><br>P.S. Sincere thanks to the producer, Daniel Lewis, for the opportunity to share our home with the Lifetime audience, and to the crew members and staff for their professionalism, their respect and their camaraderie.","user":"royjcouvillion","rank":[45,52]},{"title":"A plot we all know with a special touch from real life friends.","rating":8,"date":"23 November 2018","review":"Jolie (Hilarie Burton) is going home for the holidays and she finds out that her ex-boyfriend, who she has a long history with, is taking home his new girlfriend. So her best friend Naomi (Danneel Ackles) suggest taking her brother Jack (Robert Buckley) with her back to Louisiana to pretend they have a relationship.<br><br>I love One Tree Hill so I was looking forward to this. 5 people from the cast coming together for a Lifetime movie was everything (one was a surprise to me, even if he was only a couple of minutes).<br><br>The movie was good. The secondary characters were amazing. The chemistry was off the charts (of course, they are friends off screen). The plot was nothing special: we have seen this thousands of times. But Hilarie and Robert (Tyler, Danneel and Antwon) made it special for me.<br><br>My only complain was the loud music during certain scenes and the lack of scenes with Danneel and Antwon. I'm pretty sure any Hallmark/Lifetime fan will enjoy it. But One Tree Hills fans will love it.<br><br>(now give us a Joy and James movie please!)","user":"MIssM19","rank":[17,23]},{"title":"Give Hillarie Burton the Christmas Movie Queen Contract","rating":10,"date":"2 January 2019","review":"One of my favorite Christmas movies is Naughty and Nice (2012) starring Hillarie Burton. The opening joke of this movie made reference to Hillarie's character Jolie and the Naughty and Nice list. This one exceeded Naughty and Nice so I guess Christmas Contract is a 10+. We have an All-Star cast with Cheryl Ladd, Brian Boxleitner and remember Jason London from 7th Heaven, all in supporting roles. Not a dull moment in this one. I did not want the movie to end. So well done. Thank you.<br><br>They did a great job providing the detail on how Jolie and Jack unexpectedly fall in love. They each admire things about the other. He listens to her and knows her favorite tea. By doing so we are able to share in the emotion of the story. In so many movies they just tell us it is happening. In this movie we experience it. So much detail to the little things. The nickname \"Jo-Bear\", the fish bowl game. Wonderful touch with the notes on the Christmas tree at the end. The movie takes place in Lafayette, Louisiana and I know Christmas is sometimes warm there, but it looked a little too green to me. Hillarie also starred in Christmas on the Bayou (2013) which was also Louisiana. Look out Alicia and Candace, Hillarie is back.","user":"gehewe","rank":[4,5]}]