[{"title":"Body of Christ is made of human flesh","rating":9,"date":"11 October 2019","review":"The movie tells a story of a young man Daniel who wants to become a priest but he isn't allowed to be one due to his criminal past. However, as a result of the unexpected turn of events, Daniel replaces the main priest in a small community of a secluded mountain village. As he slowly gets acquainted with the lives of the locals, a tragedy that divided the community comes to the surface. Daniel does everything within his powers to reunite the villagers, as well as to discover his own path in life. The story touches upon difficult subjects connected with not only spirituality, but also with morality, laying judgement, hypocrisy and the true sense of forgiveness. Despite the fact that Daniel is\na criminal and he doesn't give up on the urges and temptations that make him human when he becomes a priest, he is able to look past the stereotypes and prejudices that the so-called \"morally perfect\" and religious community succumbs to. It is a universal story of doing what's right despite fear, social stigma, ridiculous rules and limitations coming from human nature.\nThe acting is fabulous and the scenery is both haunting and beautiful. It's a story worth a watch, perhaps it will be worth the Oscar award it was nominated to?","user":"princessnimfie","rank":[46,54]},{"title":"The God, the Bad and the Ugliness","rating":9,"date":"22 September 2019","review":"This film could easily slide into an anecdote about a disguise that causes real change. However, it is a perfectly told film that asks important questions about the place of spirituality in a person's life, and about the chance to make amends. Contrary to being embedded in the reality of the Catholic Church in Poland, it is a universal challenge for viewers who are not afraid to check whether a bad person can do good things and what is the value of spiritual transformation committed for low motives. Greatly played by a couple of young, yet experienced actors Eliza Rycembel and Bartosz Bielenia, while the rest of the cast creates a perfect background for the small-town world, which, although on the outskirts, is not a province.","user":"come_xxx","rank":[34,43]},{"title":"Often moving but also worrying and even intermittently funny, this drama unfurls a spiritual parabola that is uniquely Polish but accessible to everyone.","rating":8,"date":"26 October 2019","review":"Always disturbing but also worrying and even intermittently amusing, this drama unfurls a religious parabola that is distinctly Polish but open to everyone. Bartosz Bielenia, an actor with blazing blue eyes and the ability to be so still, it's as if he can freeze the frame on his own, stars like Daniel, a young ne'er from Warsaw who is in juvenile detention for crimes only later revealed. He was first seen watching the gate as some teenagers in a metalwork class brutalize a boy while the guard is out, but sheer luck opens another door for him. Drawn to religion but not allowed to join a seminary due to his criminal record, he travels to a rural town once he has been paroled in a sawmill to take up work. A little gray lie allows him to take the identity of the young new priest, Tomasz, that the city expects, and soon Daniel will perform mass and hear confessions, while the old resident curate will drip out in rehabilitation for a while. Around this midpoint, the movie risks sounding like an episode of Father Ted as directed by Robert Bresson, as Daniel / Tomasz gets used to being looked after by bossy matron Lidia (Aleksandra Konieczna) in luxurious new digs and gets to know the city folk. The plot takes an interesting turn when Daniel learns that the family has been traumatized by a horrific road accident and discovers an uncommon pastoral ability when he tries to help restore the battered psyches of the bereaved-many of them barely younger than himself, including the pretty teenage daughter of Lidia, Eliza (Eliza Rycembel). All the above may lead you to expect some sort of soppy redemptive course, but that's not where this film ends up, landing on a much darker, reflective note instead. The blue-tone cinematography of Piotr Sobocinski enhances the rapturous atmosphere and enhances suspense in a smartly written, disturbing job.","user":"eminkl","rank":[27,34]}]