[{"title":"Fun and creepy slasher film","rating":8,"date":"23 June 2019","review":"I think this movie works best if you go into it watching it on it's own terms, as it's own thing and not thinking of it as a Child's play remake because if you're a Chucky purist you probably will hate this movie because it takes so much of what you love about the Child's play movies and totally tosses it out and replaces it with something totally different. But for me, I could watch it on it's own terms and I enyojed what this movie had to give by making Chucky AI that actually does want to be Andy's friend but it is deeply broken on the inside. It's able to explore some very different things like friendship, jealousy and it takes things in a very different direction. For me it's not as good as the original, but I can still have a lot of fun with it.","user":"Sabaher","rank":[201,312]},{"title":"a fun, different take on the original","rating":7,"date":"24 August 2019","review":"We all thought this would probably suck and tbh the buddy doll still looks really off and unfortunately he's nowhere near as great as the original chucky but other than that this movie is pretty good.<br><br>the chemistry between andy and her mom, the relationship between him and chucky (which we never saw in the original) their all fleshed out great, at some points you really feel sorry for the doll because all he does though sadistic at times is to make andy happy and mark hamill did a fairly good job at making the dull sound innocent enough.<br><br>people often say this remake is completely unnecessary because the original series is still going but if you look at what they've done it seems to be a very tired franchise that doesn't know where else to go so this one can start a freshly new take on the series and hopefully we'll get a sequel out of this.","user":"iamparsa","rank":[101,161]},{"title":"Tired of fake \"9 & 10\" reviews for bad movies.","rating":1,"date":"29 June 2019","review":"This movie is 100% garbage.<br><br>I was willing to watch it even though the doll looked terrible and the trailer was so-so. I knew not to expect \"Chucky\" but more of an AI gone wrong. I also had seen plenty of negative reviews, so my standards were pretty low.<br><br>I thought that guaranteed at least somewhat of a good time. When you expect nothing you can't be disappointed, right? Wrong.<br><br>The movie is everything I hate about bad horror movies:<br><br>1. Gore replaces originality. You get over the top scenes of gore that are so tonally off with the rest of the movie.<br><br>2. Dialogue was written by a toddler. It's so generic and amateurish even for a kid's movie it would insult the kid's intelligence. That's how low it is.<br><br>3. Character act unrealistically. They find dead bodies and just move on like nothing happened. No real reaction. No trauma. No long term effects.<br><br>4. Another movie that needlessly adds a \"cast of kids\" to ride the wave of Stranger Things. Only these kids are generic, flat, and have zero story or any kind of objective want/need to drive their stories. They are just tools. Boring ones.<br><br>5. Chucky is a mess. He sounds ridiculous. He's not funny. He's not cute. He's certainly not threatening.<br><br>6. Humor is bad. Oh, plenty of laughs, but mostly at how absurd and ridiculous it was. The actual jokes rarely landed.<br><br>7. The storyline is just bad. It's a paint-by-numbers story that is still off. I'm used to barely there plotlines as a horror lover. But when it's barely there, and still patchy, I can't stand it. How do you ruin \"generic\". It's generic for a reason.<br><br>8. Chucky has no personality. None whatsoever. He just repeats and mimics and then randomly kills to be Andy's friend.<br><br>9. Andy and Chucky share very few scenes prior to the killing, yet andy act very emotional when chucky needs to be put down. It was just so emotionally unrealistic. He seemed more disturbed by shutting down a doll he had for 2 seconds than finding the ripped off face of a human being.<br><br>I don't mind bad horror movies. I do mind stupid ones that don't make sense. That are generic, and still inconsistent, and pointless.<br><br>I can't think of a single positive thing about this movie. Even the acting as very basic, and not at all good.","user":"fandomly","rank":[266,451]}]