[{"title":"Not bad I guess!","rating":7,"date":"21 November 2019","review":"The film was a pleasant surprise. Nothing new here but the camera work and action scenes were marvelous. Although the plot is not original the story was fine with good editing. Interesting take on \"Manhattan island\", however the script could have been better and acting was average at times. Nice Friday night flick!","user":"timucin_savas","rank":[107,128]},{"title":"Solid old school cop thriller","rating":8,"date":"23 November 2019","review":"Good old fashioned cops and robbers movie,solid acting and great shootouts.Wish there was more of this type of movie!","user":"trakev-61852","rank":[117,141]},{"title":"One hell of a tight script","rating":22,"date":"22 November 2019","review":"Many may have come just to see Chadwick Boseman and they shouldn't be disappointed. But there are other good things about this movie. It has one hell of a tight script. Throughout the 100 minutes runtime, there is not a single wasted, idle shot (no pun intended). There is also a good supporting cast, which I'll come to later.<br><br>The movie is almost real-time, starting from a midnight robbery gone wrong, resulting in the killing of eight offices of the NYPD. Manhattan is sealed off (hence \"21 bridges\" plus all other access routes) and the NYPD is given just a few hours to dawn to apprehend the perpetrators, before the FBI takes it off their hands. Running almost like real-time, the movie immediately kicks into high gear.<br><br>Paring up on this mission-almost-impossible are detective Andre Davis (Chadwick Boseman), \"the guy who kills cop-killers\" and narcotics officer Frankie Burns (Sienna Miller), tough as a bone, with a will of her own (thanks, W.S. Gilbert, of \"Gilbert and Sullivan\"). This co-lead billing notwithstanding, his is clearly a lead role and hers a strong support. Police Captain McKenna (J.K. Simmons), shaken by the loss of eight of his family-like officers, hints to Davis to live up to his reputation and take no prisoners. Despite such reputation, however, Davis has never shot a criminal without just cause. Burns, impeccably professional, has a little daughter waiting for her at home, under the care of a babysitter. The two criminals who blundered into this unexpected disaster are Ray (Taylor Kitsch) and Michael (Stephan James), both war veterans. Ray is the typical villain while Michael, although loyal to him, has more sense and compassion.<br><br>I am not going into the detail plot which, needless to say, has twists and turns. With good character development (albeit within the real time of a few hours), running parallel are a police procedural and a crime story from the POV of the criminals. Excellent script, direction and acting together make sure that your attention is focused during the entire duration of the movie.<br><br>Boseman is pitch perfect, indisputably demonstrating that he has a lot to offer beyond Black Panther. Miller, unlike the glamour support in \"Stardust\" (2007), is all character-acting here. Kitsch, in his first (I think) crack at a key villain role, delivers. Matching him scene for scene, and then more, is James. Ever reliable, Simmons handles his not-so-simple role effortlessly.<br><br>This is an exceptionally good crime and action drama.","user":"harry_tk_yung","rank":[72,92]}]