[{"title":"Beautiful an Heartbreaking","rating":8,"date":"13 November 2019","review":"When a Chinese family finds out that the family's matriarch is dying of lung cancer, complications arise. In Chinese culture, there is a saying that when you get cancer, you die. This actually boils down to the belief that it's not the cancer that leads to the person's death, but rather the fear of dying. As such, the family orchestrates an elaborate ruse to get everyone together for a wedding, but in reality the gathering is for everyone to be able to say goodbye to the grandmother without actually letting her know the truth.<br><br>It's a fascinating premise and based on a true story (or based on an actual lie, as the film puts it). Showing aspects of Chinese culture we rarely get to see, the film takes us on a journey to China as we see modern life and urban development. How accurate it really is, I can't attest to, and there are times that it feels like there should be more or that something is more complex and we're being given the fortune cookie version, so to speak. The film does steer clear of politics, so that is not a factor here.<br><br>This is a beautiful film not just through visual aesthetics but also on a character level. We see how each character faces the impending death of the grandmother differently, such as the daughter-in-law being very matter of fact about it while her husband (the grandmother's son) is being torn up inside, all while the wise and experienced grandmother continues to dispense advice, oblivious to her diagnosis. It details the variety of relationships we can develop in our life as no two relationships are the same, but they all still love each other despite some distance between certain relatives. There's something that, despite the comedic premise (it's sort of a comedy that's not particularly funny), is very grounded and very real. I couldn't help but see some of my own relationships reflected on the screen.<br><br>Beautiful, heartbreaking, and at the same time somewhat hopeful, \"The Farewell\" comes highly recommended.","user":"sheldonnylander","rank":[47,54]},{"title":"Spend as much time with your loved ones as you can while you can","rating":8,"date":"5 September 2019","review":"The Farewell is a bittersweet Chinese tragicomedy that has the potential to become an Academy Award winner for Best International Feature Film. The movie revolves around an elderly Chinese lady who suffers from an incurable cancer. Her sister however hides this information from her and instead tries to bring all the family together for one last time. A hastily arranged wedding between a grandson and his Japanese girlfriend serves as purpose for the family members abroad to come back to Changchun. However, the burden of this lie is heavy and conflicts, confusion and misunderstandings soon occur.<br><br>The most interesting question about this movie is how you would deal with a situation such as the one portrayed in this film if someone close to you were concerned and how you would like to be treated if you were in a similar situation yourself. The family members in this film try to carry the burden together and decide to not tell the aged grandmother that she is dying. There is no right way to deal with such a difficult decision. If you hide the truth, you might prevent the other person to live every day as if it were the last day and to say farewell. If you tell the truth, you will cause an immense emotional burden to the concerned person who will live in fear of dying every single day. The Farewell offers much food for thought and also shows how differently Western and Eastern cultures approach such a scenario.<br><br>The acting performances in this film are outstanding. Every character has its own identity from the drunk war veteran who was in love with the elderly lady over the chubby grandchild who is addicted to technology to the deaf housemate who is the only one to mind his own business. Lead actress Nora Lum convinces as concerned granddaughter who disagrees with her family's strategy of hiding the truth from her grandmother and who also has some financial and social problems of her own. Shuzhen Zhao steals the show in her very first movie as headstrong elderly lady with a heart of gold.<br><br>The movie portrays the differences between Western and Eastern cultures cleverly and also portrays how the Chinese society is changing. People have become greedy capitalists looking for financial opportunities abroad but also try to embrace their ethnic heritage at the same time. Changchun has developed from a rather small city with less than a million citizens to a gigantic city with close to eight million citizens in only fifty years. The movie shows how gigantic buildings and monuments have replaced small houses and gardens.<br><br>The Farewell also has alight-hearted side and manages to cheer its audience up despite numerous heartbreaking moments. The subtle humour works very well and includes drunk war veterans declaring their romantic feelings, hilarious karaoke performances during the wedding and several running jokes in form of the careless deaf housemate and the disconnected overweight grandson.<br><br>In the end, The Farewell is an emotional tragicomedy with a profound message: to spend as much time with your loved ones as you can while you can. As someone who is living abroad and far away from his family, I can truly empathize with the movie's meaningful message. Give this movie the chance to inspire your brain and warm your heart.","user":"kluseba","rank":[57,72]},{"title":"The Long Goodbye.","rating":10,"date":"19 September 2019","review":"Billi (Awkwafina) is a young Chinese New Yorker struggling to make her way in the world. She has a place of her own to distance herself from her parents - Haiyan (\"Arrival\"'s Tzi Ma) and Lu Jian (Diana Lin) - but is struggling to fund it. But despite a typically spiky teenage relationship with her parents, family is important to her.<br><br>There's a big shock then when her beloved \"Nai Nai\" (Shuzhen Zhao) is diagnosed back in China with terminal cancer. The slight complication is that no-one has told her. Her younger sister (Hong Lu) has taken the decision to keep the news from her. This is in line with the Chinese saying \"When people get Cancer they die\". (Based on the rationale that it is not necessarily the disease that kills you, but the fear that destroys your useful life).<br><br>The whole extended family sign up - reluctantly - to the decision. They stage a final get together back in China around the pretence of a trumped-up wedding. This is between the comically reluctant grandson Hao Hao (Han Chen) and his new Japanese girlfriend Aiko (Aoi Mizuhara).<br><br>Faced with seeing Nai Nai face-to-face, and being forced to \"celebrate\" together, can the family - and the emotionally attached Billi in particular - hold it together and keep the secret?<br><br>You might naturally assume that given the subject matter that this was going to be SERIOUSLY heavy going. And in many ways you would be right. Most of us over 50 will have lost an elderly relative. And, unless it was a sudden event, you have probably been through the mental pain of having to drive away from a nursing home certain that that will be the final time you will see your loved one alive. If you are therefore not affected by this film, you are not human.<br><br>However, the film is so beautifully put together, and the comedy - albeit some of it very dark - so brilliantly inserted that the film is an UTTER DELIGHT from start to end. There are truly insightful scenes that get under the skin of the well-developed social approach in China to family. (Like my wife they love big family dinners around a round-table!) Although there is always the teen - Bau (Jinhang Liu) in this case - with his face permanently in his phone!<br><br>There are also scenes familiar to anyone who's visited China. The gaggle of \"helpful\" taxi drivers outside the airport made me laugh out loud.<br><br>Also (unintentionally) funny are the multiple company logos at the start of the film. (This is reminiscent of a classic \"Family Guy\" scene).<br><br>For such a 'small' film, the scale is sometimes truly cinematic. Director and writer, Lulu Wang, achieves some gloriously memorable movie moments. A stony-faced, determined march of the key players towards the camera - which could be subtitled \"The Magnificent Eight\" - is slo-mo'd for about 30 seconds and is utterly mesmeric. And a scene at a cemetery is a comic masterpiece of Chinese tradition. Bau of course still has his face in his phone throughout!<br><br>This is only Lulu Wang's second feature, but it makes me now want to check out her first film (\"Posthumous\").<br><br>What I found particularly interesting is that the film is truly multi-cultural. It's not an American film with some local content crudely inserted to cater for the Far East markets. The film is an almost equal blend of American language and Mandarin language with subtitles.<br><br>Lulu Wang is also not afraid to upset officials in either country. Which is better: US or China? The question keeps getting posed to Billi and discussed among the family. And - as you might expect - there are positives and negatives on each side. The film doesn't really take sides. It's a really balanced position to take.<br><br>The music is by Alex Weston, and its one of the stars of the film. It's truly quirky with everything as diverse as a vocalised version of Beethoven's Sonata No. 8 \"Pathetique\"; a karaoke version of \"Killing Me Softly\"; and a hugely entertaining Chinese version of Niilson's \"Without You\" over the end titles.<br><br>It's a brilliant ensemble cast (SAG awards, are you listening?), and everyone pulls their weight. Even the minor members of the cast are superb: Aoi Mizuhara in particular displays acute awkwardness brilliantly!<br><br>But leading the charge is Awkwafina. She was in the disappointing \"Ocean's 8\" but much more memorable in \"Crazy Rich Asians\" as Rachel's wacky Singapore friend. Here it's a bravado performance that is genuinely moving. She IS the slightly sulky but emotionally crushed teen.<br><br>\"Sub-titles? I don't do sub-titles\" - Get a grip! Yes, this is a film that has sub-titles. But it uses them when required (unless you happen to be fluent in Mandarin that is!). There is also a large percentage of the film that is in English. It's all eminently watchable, even for \"sub-title-phobes\".<br><br>This is a feelgood film about a tough subject. The ending of the film pulls off the trick of being both devastating and uplifting at the same time.<br><br>So get yourself to the cinema and see this film! Without question, it gets my \"highly recommended\" tag. It's also firmly placed itself very high up in my \"Films of the Year\" list.<br><br>And it's all \"based on a true lie\"!<br><br>(For the full graphical review, please go to One Mann's Movies on the web or Facebook. Thanks).","user":"bob-the-movie-man","rank":[60,80]}]