[{"title":"Every frame a painting","rating":9,"date":"6 April 2020","review":"This film's cinematography is beyond perfect. Every scene appears as though it was taken out of a masterpiece painting. The only other work I recall even close to its visual poetry is Barry Lyndon.<br><br>Every actor, especially the two leads, have done their job amazingly. Watch it if you haven't. This movie is art at its finest.","user":"sarthak889","rank":[15,16]},{"title":"An example of what cinema should be","rating":9,"date":"18 September 2019","review":"This film is an example of what cinema should be.<br><br>Yes, the plot isn't so \"thick\", it's a rather slow film.<br><br>Why I say this is what cinema should be, is because it has as it's base images. Its images speak louder than word ; you see what you have to know.<br><br>Everyone involved with this picture seems to have done an astounding job - may it be through directing, the actresses, the set, the photography, the costumes - everything is astounding and very well done.<br><br>When we saw this in theatres with my colleagues - mostly male -, we came out speechless. At the end of the film, there was a girl crying in the same row as I - the first time I see anyone crying to a movie (really crying from bing moved). With my colleagues, we walked out, and none of us spoke or said anything for at least 5-10 minutes, as we all obviously were affected by the nostalgic beauty that the picture captures. Finally someone broke the silence with the only thing that could break the spell - a banal exclamation \"it was well done\", as the only thing to be done after such a film is \"a return to banality\". This is a film I will gladly see again.","user":"raidatlanta","rank":[171,222]},{"title":"Review from a Lady on Fire","rating":10,"date":"19 October 2019","review":"The ending of this film left me in tears, but the good kind where you simply emote from the pleasure of seeing a work of art.<br><br>I had to figure out how to log back into my IMDb account, just to express my humble opinion for a moment.<br><br>I had to give it a 10/10 because it filled me with the emotion described above -- the entire movie was pure, honest art. The acting was excellent, as well as the entire direction of the film, visually and otherwise.<br><br>The film accomplished what it set out to do --share a love story worth remembering. In this case, a special romance that was expressed in the most succinct and captivating way.<br><br>What may have cost this movie a star for others (looking at you, 9/10 people), I do not know. I just know that special feeling only certain movies give me after the first watch and this one had it.","user":"grab-it-gee","rank":[116,161]}]