[{"title":"4 movies!!??","rating":8,"date":"22 July 2018","review":"I'm amazed that this relatively simple found footage story idea has now expanded to 4 movies. each one is unique and funny/scary in their own way. i will admit that i was hooked by the time the 1st movie ended. this is the story of a guy (who pretty much carries every movie himself) who buys a house to flip but then discovers whomever lived there before had ties to something satanic. he uses the cameras (and his take-no-nonsense attitude!) to figure out what's going on.<br><br>the first bad ben was the basic story, the 2nd one (steelmanville road) was a backstory of the prior family, the third (badder ben) was about a supernatural investigative team checking out the house (special appearance by nigel bach), and now, this one, which posits that similar events are taking place on different parallel worlds, or maybe just over and over again on the same one.<br><br>it somewhat replays the events of the first movie, but coming at the original story from a few different angles - and using some slightly different and more over-the-top character additions. the result seems to always be the same - poor tom - stop going in the basement!","user":"davidm-14","rank":[10,15]},{"title":"Deja Vu","rating":6,"date":"20 February 2019","review":"In this film we see Tom, a man who has just acquired a house by way of a sheriff's auction, finding himself in different paranormal scenarios. The way this happens is that while Tom feels a sense of deja vu each time he encounters the house, it is actually the first time he has been there in what I can only describe as different levels of reality. The house, Tom, the sheriff's auction and the moment in time are always consistent but each encounter is in another tier or dimension of reality.<br><br>I didn't think it was a bad film but I did like the first best. Creative in that the approach and types of paranormal activity are different, it also shows ways that each dimension could have reacted with one another. In the first film the basement scene has a moment with a chain and in this film we can see a different aspect of the chain.<br><br>These films are simple. Not a lot of special effects or a lot of characters. Just a man finding out that his investment came with a bit more than he was expecting. It's a sorta goofy film at times but that's just because it is fun. It is clear that this isn't really meant to scare. It tries to be creepy but never scary.<br><br>I'll probably never watch this again but I give props to this fella for taking such a simple film and turning that into multiple movies. If you like comedy horror you may like this. If you are wanting to be scared, you may want to look for something else.","user":"Foutainoflife","rank":[4,5]},{"title":"Maybe it's time to quit whilst ahead","rating":11,"date":"11 August 2018","review":"Nigel Bach shouldn't have watched the Blair Witch, Annabelle, Butterfly Effect and the Paranormal Activity franchises whilst medicated and then documented himself on film playing with the same dolls from his shed (Steelmanville Rd: Shed scene right top shelf) \nI really wanted to like it but Bad Ben just jumped the shark on this one.","user":"floydianever","rank":[6,11]}]