[{"title":"Why oh why didn't I read the reviews first! DON'T DO IT!!!!","rating":1,"date":"21 November 2018","review":"I was so excited to see a new iteration in the Stargate franchise (and hoped it would take the bad taste left in my mouth from Universe) that I didn't bother to check for reviews before buying it on sale on Vudu. Having purchased it, I can't believe the Stargate franchise would allow such drivel to be associated with the name!<br><br>1. Seriously? Rewriting the whole story line about Earnest being the first one through the Stargate? Having Catherine go through the gate along with Nazi's? Did they watch Indiana Jones the night before starting writing and thought it was a good idea to throw them in?\n2. Couldn't you find actors who can actually act? And what on earth was Connor Trineer thinking? He is a great actor but in the first hour, he is on screen very little. I turned it off at that point.\n3. Couldn't you find writers who actually know something about the series? A reboot is one thing but this is just nonsense!\n4. Couldn't you find set designers that could do more than put up curtains and a few set pieces?<br><br>Instead of making me happy to have more Stargate to watch, less than 10 minutes in I was beyond annoyed that I was even watching it. It started out promising, with the actual clip showing Catherine as a child at the excavation site. I had hopes that the rest would have the same production value. That promptly went away as the show dissolved into a petty soap opera.<br><br>I love the original film. I love the Stargate SG-1 and Atlantis series. I love the 2 movies that spun off from SG-1. As I mentioned, I disliked Universe mostly because it seemed like everything good about the previous series was lacking and I couldn't get invested in 99% of the characters - just didn't care if they ran out of air! NOT a good sign. Well, I kept pushing through Universe, hoping it would get better. I couldn't even force myself to do that with this.<br><br>Anyone know how to delete a purchased movie on Vudu?","user":"scubafiend","rank":[37,47]},{"title":"What a disaster!","rating":1,"date":"24 September 2018","review":"I've seen everything Stargate until end of SG Atlantis. It was fun, quirky and scifi drama comedy. Then came the ship and series went dark. And with Origin it just goes beyond dark to horrible. Tortured myself to watch it and cryed afterwards fir wasting the time.","user":"stefan-921-979564","rank":[41,54]},{"title":"I can't believe they got an ok for this script","rating":3,"date":"26 February 2019","review":"Despite the bad reviews I still gave it a shot because I love Stargate and Connor Trinneer ( ST Enterprise )\nIt sure is low budget but that isn't really the issue here. The trouble is that the script is so bad it gets painful to watch. You can see they wanted to make this movie in line with the rest of the franchise but the \"humor\" is so bad it resembles amateur theater and the story is so full with stuff done far better in other movies. I really can't believe they got permission to put the Stargate name on this. Nothing new, nothing added to the story and this certainly will not be the start of a reboot. I think many fans will be disgusted by this and I highly doubt this flick will introduce a new generation to the franchise.","user":"dhooghesven","rank":[16,20]}]