[{"title":"Below Average Convoluted Sci Thriller","rating":4,"date":"7 September 2019","review":"This is a low budget film but I don't give extra or less marks based on this I try and judge every film within the same criteria.<br><br>The premise is fairly simple revolving around a mega pharma corp, a woman with a conscience who needs to be silenced and 2 unlikely heroes.<br><br>Overall the premise is fine, nothing new and pretty generic for this type of thriller. I guess the selling point is the 2 unlikely heroes of a homeless guy and a prostitute.<br><br>Cool concept, sure, convoluted, absolutely.<br><br>It does however in a strange way pass if you don't think about it too much.<br><br>The photography is decent enough and captures that sterile corporate sci fi setting switching to more real gritty texture \" On the streets \".<br><br>This is where it gets jarring and falls down, the acting is all over the place. Some of the wooden acting passes as it suits the environment i.e wooden scientist.<br><br>If this followed through consistently it would have worked, however the performances cross from wooden acting to over acting to strange character acting which is often at the wrong times, this becomes jarring and uncomfortable to watch.<br><br>I know its low budget but this is where some can make it work and others try to achieve too much under the limitations.<br><br>There is also a plethora of different characters that are pointless and unnecessary, This takes away the focus from the \" better characters \".<br><br>There is a few times when it feels like it's coming together but then, bosh it Jarrs you out of it all.<br><br>So we end up with a pretty generic plot with a slight hero twist with average to god awful acting, Good cinematography on the whole but with Jarring and convoluted moments.<br><br>You can't make a low budget blockbuster all the bells and whistles type film without it looking weak.<br><br>Ive seen many brilliant Indy low budget films and the brilliance tends to be in the simplicity of which this is the antithesis to that concept<br><br>\n4/10\nI'd pass unless you want to check out a low budget film because its a low budget film.","user":"eve_dolluk","rank":[39,51]},{"title":"Total waste of time","rating":3,"date":"14 September 2019","review":"Weak dialogue, weak filming, cast isn't good, low budget film","user":"hkhodair","rank":[27,35]},{"title":"How on earth did this get a 6.1 review","rating":1,"date":"14 September 2019","review":"I will watch almost anything to the end to get it a chance to get better. This doesn't. Awful film.","user":"nigelstack","rank":[32,43]}]