[{"title":"Feel Good, Not So Feel Good Movie That Feels Very Familiar...","rating":8,"date":"15 February 2020","review":"This movie is not a masterpiece but it makes you think. It hits so close to home, to our patterns, to our beliefs, to our own mistakes. So I actually watched it all in one sitting not because they're the best actors or it was the best made movie - but because I could relate.<br><br>The ending was a bit strange and anti-climatic for me but I get it. I've been there (minus the nuclear war thing). I've made the same mistakes. I've blew it the same way. And when someone makes a movie that almost \"understands\" you, it deserves a high score.","user":"razvan-rogoz","rank":[5,5]},{"title":"It takes a major event in our lives to get us all out of our comfortable ruts...","rating":6,"date":"15 February 2020","review":"This movie was a realistic take on every relationship that has gotten too comfortable. It takes 1 mistake, or 1 natural disaster, or 1 death or any big lifetime struggle to force 2 people to see what they have or what they want.\nTo see that they might already be with the person they not only want to live with but also would die for and with.<br><br>This movie was unique from the start and as it reached its conclusion I was about to write it off as just another movie. Then the last 5 minutes happened and my score went from a 5.1 to a 6.1.<br><br>Good date night movie.<br><br>6.1","user":"natcalgary","rank":[4,4]},{"title":"a fusionative fisjonarian tale of life","rating":7,"date":"12 February 2020","review":"Ask yourself this... how would you and your partner spend the loast 10 minutes of your life, because you are in the core zone of an incoming nuclear missile attack? well this film just describes one couples frantic choices, for good or bad, making this quite a humble piece of houmoristic salsa, enjoying eachother at its best and its worst.<br><br>its a comedy, but also a realitycheck for us all, to make some recheck on your own life. its a verbalistic voyage of love and hate, and touches quite a few emotional strings. the acting are very nice, actually sweet, and the production are far above average, though a bit slow at moments<br><br>the grumpy old man had a some monkey laughs here and there and will therefore recommend you all to have a look too","user":"ops-52535","rank":[5,6]}]