[{"title":"A Tourism NSW video","rating":2,"date":"20 August 2019","review":"I really wanted to like this. Some of the great Australian actors, including the luminous Jacqueline McKenzie, together in the one movie. Shame they wasted such talent on such a mediocre script. Richard Grant was tired, the scenarios, relationships and dialogue not believable. On a level with a Home and Away episode, but with better scenery.<br><br>This was clearly made as some sort of tourism video; pity that revelation doesn't come till the closing credits. None of the talent shines to their capability, save for the cameraman.","user":"peter-outdoorliving","rank":[11,16]},{"title":"a slow-moving predictable portrayal of middle-class privilege","rating":6,"date":"21 August 2019","review":"Nobody expects originality in the 'old buddy life-audit' genre. Ask any baby-boomer to name their favourite and it is likely that The Big Chill (1983) will pop up as the benchmark film. The structure is always the same: long-time friends reconnect around a milestone event which slowly descends into sub-plots of secrets and discontent, flavoured by a soundtrack evocative of youth and unfulfilled promise. Palm Beach (2019) follows this format exactly. However, instead of reflecting on the youthful idealism of the 1960s, it is set in a modern context of insatiable white middle-class privilege for an ageing group of malcontents, especially of the male variety.<br><br>The single impressive feature of the film is the spectacular panoramic Palm Beach setting on Sydney's Northern Beaches, filmed beautifully with lingering shots of every lovely lighting angle the wealthy can afford. The views are complemented by a stellar local ensemble that includes Bryan Brown, Richard E. Grant, Sam Neill and Greta Scacchi, all of whom play such evenly predictable parts that there may be arguments over whether anybody actually stars in this production. The sourness of this ageing cohort (nobody is seen happy) is given light relief with a few young offspring and a couple of sight gags.<br><br>The film's entertainment value rests on comic tropes, blended into a potpourri of indignities familiar to the seniors' demographic. These include nostalgia over failed careers and unresolved affairs, depression, drug abuse, sexual impotence, disappearing libido, disputed parentage, wealth envy, sagging bottoms, and even a breast prosthetic thrown to the floor with a rubbery flump. The flat tension curve is given an upward blip with a psychotic episode where the host becomes so incensed that his panoramic views are blighted by a neighbour's chimney that he attacks it with a sledgehammer. The only other moment where viewers' pulse rate might rise is a boating accident that rudely interrupts the enjoyment of views and fine wine. Given the spoilt misery amongst the group, it is laughable when one of the wives suddenly tries to leave her hapless husband but relents feebly with \"just promise me that the next ten years will be the best time of our lives\".<br><br>Palm Beach is pretty to look at, light-hearted and mildly entertaining. It is also slow moving, over-acted, and lightweight. It will probably have a short shelf life and struggle to find audiences beyond the well-off suburbs around Sydney. It could have been so much better.<br><br>Director: Rachel Ward\nStars: Bryan Brown, Richard E. Grant, Sam Neill, Greta Scacchi","user":"CineMuseFilms","rank":[15,24]},{"title":"Can't relate.","rating":4,"date":"6 August 2019","review":"Palm Beach, which premiered as the opening film of this year's Sydney Film Festival, tells the story of a group of good friends who have a few secrets. Those secrets are bound to surface at some point. Why not do it while celebrating a birthday?<br><br>Director Rachel Ward co-wrote the story with Joanna Murray-Smith, which tackles some ethical predicaments and feelings that get repressed with (expected) catastrophic consequences. Every year we get a similar scenario presented to us on television or even on the big screen, so why do we keep making these films? The difference with Palm Beach, is that I couldn't sympathise with any of these characters. Rich white people having rich white people problems - can't relate.<br><br>That doesn't mean these stories aren't allowed to have a platform to be told, everyone wants to escape their daily life at some point and peek through a window to see what happens behind closed doors. The film takes place in the titular Sydney suburb - blue skies and crystal clear waves everywhere you look. Three members of our group of friends (Bryan Brown, Sam Neil and Richard E. Grant), used to form the band Pacific Sideburns. Their partners and children are also present and ready for a weekend of beachy tranquility.<br><br>The evening our friends arrive at Frank (Brown) and his wife Charlotte's (Greta Scacchi) house, Leo (Neill) mentions to Charlotte the pact they formed a very long time ago. Not entirely clear why he recalls this pact so suddenly, this causes the amicable vibe in the house to rise with a few degrees and everyone seems to be feeling this tension. This secretive pact lingers in the background while everyone passes their days behind luscious cheese boards and champagne by the crate, in and around Frank and Charlotte's lush hilltop habitat with panoramic view. A panoramic view ruined by a chimney, which becomes a daily discussion topic that drives Frank to his boiling point.<br><br>Cinematographer Bonnie Elliott does a great job showing off the beautiful beaches of Sydney and the nighttime scenes, but when it comes to garden gatherings it all looks a little bit too much like a commercial of some kind. The glossiness makes it look like as if some scenes were shot on an indoor-set, while I'm pretty sure this wasn't her intention. Nonetheless, a great effort that lifted the film to a higher level.<br><br>The problems these characters face are nothing but drama on the surface while being comfortable in their day-to-day life - shallow and smug. But like I said before, why tell a story that has been told in different forms many times before, if there isn't a character to relate with or feel sympathy for? The cast does a great job though. There wasn't a single person that I could point out as being a bad actor, neither was there a performance considered to be scene-stealing.<br><br>Going in with low expectations, I thought the first half was more interesting than the second. Clocking in at 100 minutes, the film feels a lot longer and without any real stakes, there's no satisfying ending to look forward to. Palm Beach is a film without a purpose and could easily be dropped on a streaming platform, to attract a bigger audience or people wanting to check it out without paying extra for it.","user":"eelen-seth","rank":[17,29]}]