[{"title":"An unsatisfying origin story","rating":5,"date":"7 April 2019","review":"Unlike its recent days predecessor movies of the DCAU, this movie appears more related to the Justice League series of our childhood. If that movie came out in their era, no doubt it would be a satisfying feature-length film. Being produced in a time post the Doomsday film, its criticism might seem more harsh.<br><br>*** Then on, potential spoilers ahead ***<br><br>CHARACTERS: Let's face it, though the title of this movie is \"Justice League vs the Fatal Five\", its main role was to introduce Jessica Cruz as part of the Green Lantern Corps. As such, using the JL in this plot only served to make them a reference for her power and shies the attention away from her.<br><br>Star-Boy was really a useless character after-all, lame, no real lessons to take from. The story of his ring wasn't really clarified either and his obsession over Limelight really didn't live up to the expectation.<br><br>Jessica Cruz had poor character development and follows the standard evolution of any new hero: Being afraid, then needing to overcome their fear, then messing up, and finally becoming a hero. Though this can sometimes be well plotted, her character was poorly scripted to be admired as more than 90% of the movie she's just terrified and all over the place.<br><br>The Fatal Five were unfortunately the most unappealing villains to ever reach the animated screen. Their superpowers seemed too imaginative and not well elaborated. Their plan as well was too short-sighted and rash.<br><br>PLOT: As mentioned earlier, the plot pertaining to Jessica Cruz/Limelight's development was pretty cliché and uninteresting. With regards to the entire movie, the plot was similarly lame: rarely were we excited to see what happens next and whenever a building or mountain or planet collapsed (and yes there were many of these), the heroes just happen to miss the debris and walk out untouched and minimally injured.<br><br>ANIMATION: The animation was JL animated series style. Though my personal preference has evolved to the current DCAU style, I will not hold any bad marks on this. It remains satisfying and the PG13 counterpart of nowadays' DC animated films.<br><br>*** End of Spoilers ***<br><br>SUMMARY: All in all, the movie is no doubt separate from the DCAU universe we have grown passionate of in recent years. Although the title and movie includes our most desired members of the JL (e.g. Wonder Woman, Batman and Superman), it is really far from being a JL movie. A more accurate title would probably be: \"Jessica Cruz: First Flight.\"","user":"kmchahine","rank":[28,37]},{"title":"A continuation of fatal five episode in the JLU","rating":31,"date":"31 March 2019","review":"Only real JLU and DCAU fans will appreciate this movie. This will bring you a lot of nostalgia it even has the old music score from the JLU. This movie felt more like a JLU episode than an actual movie . The only thing i wanted more in this movie was the original 7 members of the JLU sure batman wonder woman and superman were great but it needed john stewart GL , martian manhunter, the flash , hawkgirl. Thank you bruce timm for making this for the JLU fans and i hope there will be another one like this . Maybe a contiuation of the epilogue episode with batman beyond terry mcginnis would be great too","user":"bwanabeast91","rank":[32,45]},{"title":"Nostalgic train ride","rating":8,"date":"31 March 2019","review":"Plot writing was great. For those who's not familiar with the animated series,you still gonna enjoy it. This movie include three new main character which is very likeable and feel connected to audience. This movie is more to PG13 style so don't expect it to be another episode from the animated series. The animation was great. Bruce Timm's animation style still flawless after all these years. Overall, it's a great and enjoyable DC animated movie","user":"amerulaidil","rank":[39,60]}]