[{"title":"Fiction...","rating":2,"date":"24 June 2019","review":"While the feel is documentary, with dates and times, this production is pure fiction, centred around Camp Hero on Long Island and the legends of mind control experiments that may have took place there. If you like Blair Witch Project style low budget films, with shaky night vision footage running through the woods, this may appeal. The producers ask you to research further the mysterious past of the area, but it's dubious that any alien conspiracy or shadow government stuff is currently going on there!","user":"spock-301-790513","rank":[9,15]},{"title":"This is creepy and more than good for only 7K$","rating":8,"date":"24 February 2020","review":"I wanted to see this \"short\" movie although I thought it would be terrible.\nBecause a lot of nowadays sf movies have such bad endings.\nFrom the start I was caught by it's creepiness. Think you have to watch it with a big screen and surrounding. The build up made me curious and I even start to skip parts so I would know where it would start horrorfying... I don't have that a lot.\nThe end was excellent because the runtime of the movie was \"only\" one hour and that was for me what made it creepy. Not overdone by too much footage etc.\nThis was \"for me\"definitely worth an eight !\nI also read the review headline \"if you have suicidal thoughts please don't watch this\". I'm definitely no suicidal and as Clint Eastwood once said in one of his movies \"opinions are like assh*les, every body has one\"....\nGosh would I love to have an autograph of Owen Mulligan on a movie-poster (small one). Just go on making this type of movies. It's a good and pleasant add-on in this world of many strange movies with bad endings (also my opinion).","user":"apoe-1","rank":[3,4]},{"title":"Success of the legacy over special effects","rating":7,"date":"23 July 2019","review":"The rating doesn't give it what it deserves, The movie is pretty good for a low budget movie, it's one of the rare films that cares for the Montauk project and what really happened there. I believe it's very daring for the cast to choose such a project to work on. Yet I expected to see more and to encounter more in the story line but I still appreciate the try and the time people put in this one, quite an interesting experience.","user":"indie-55193","rank":[9,19]}]