[{"title":"Great movie and teaches Gods values","rating":10,"date":"17 April 2020","review":"Excellent movie showing what freshmen life involves.. in addition the do's and don't as a freshman in college!","user":"mwhillsr-03214","rank":[0,0]},{"title":"A good College boy Fighting Temptation","rating":7,"date":"10 April 2020","review":"9 April 2020: Not a bad film. Acting is fair, but I really liked the message from the African actor, Benjamin Onyango whom I saw in the film \"God's Not Dead\". He and his wife instill good family values in their children to follow God's {Adonai, Elohim} way, but that is very hard to do for a young man in college surrounded by an atheist professor, actor, Greg Williams and in a world of young boys in college and the temptation of a sweet young pretty Latina nicely played by Hispanic actress, Natalie Dominguez in the role of Marcella. I Love the fact of the Interracial Love story between them because God does Not see skin color, but sadly too many people who only see skin color and prejudge other races. Love comes in all races and skin tone and sadly so does hate. Diallo in the role of \"CJ\" does a fairly good acting job as a young do right nerd who always wants to do what is right and Biblical, but his roommate and buddies make it hard for him with drinking and partying. I like that he is a young Black man who does the right thing by his pregnant girlfriend. Good acting by Ed Moreno as \"Hector\". I know in the world that we live in, it's girl's or woman's right to have an abortion, but my personal feelings are abortions should Never be done unless a woman is raped because she did Not ask for that to happen to her. Overall, it is worth the Matinee price of admission.","user":"KATO-SUBZERO","rank":[0,0]},{"title":"Well","rating":5,"date":"6 April 2020","review":"It was ok. Gave 5 stars because of the message. I do believe God is a God of second chances. They messed up but they chose to do the right thing. Actors not showing a lot of emotions, they should've put more in it.","user":"ayal627","rank":[0,0]}]