[{"title":"Hey, you look a little old to be in high school","rating":3,"date":"2 November 2019","review":"For a B movie I think this film is brightly lit, professionally shot, and moves at a fairly swift pace. The audio wasn't great, I had to turn my sound up to hear the dialogue clearly. The premise is timely, we are all increasingly dependent on our phones and AI is slowly taking over all of our lives. Ok, enough of the compliments, folks.<br><br>The dialogue is dumb and very thin. The lead actress, Debs Howard (Cassie) is an attractive woman but looks wayyyy too old to be in high school. Her performance is wooden and that's a problem because she is in virtually every scene and has to carry the movie. We don't get enough story on the her character to really care about her. We don't know learn enough about her illness, her relationship to her mother, her bond to her best friend and alleged boyfriend to really care about how things end up. I wound up cheering more for the creepy boyfriend, Liam, just because he was so over the top in his creepishness.<br><br>What we get is the usual revenge fantasy deaths of a bunch of unlikable people. I kept watching out of amusement. How dumb are things going to get? Answer, very dumb. If you are into the one-by-one killing off thing you might find this film entertaining. There are attempts to at humor in some of the death scenes.<br><br>The bottom line is that this film is not scary and not deep on any psychological level. It might have been better if they played things totally for laughs, like in the amusing last scene, but taken as a straight horror movie, bleh!<br><br>If by chance your phone ever starts telling you to kill people it's time to get a new phone.","user":"themick-88033","rank":[12,14]},{"title":"Full of irony, but it misses the mark.","rating":5,"date":"17 November 2019","review":"It's an interesting story, get on a bus or walk into a coffee shop, and everyone has their heads buried in their phones, somewhat obsessional, this film tries to tap into that idea, and for some bits of the film it does. Let's be clear this isn't a horror, it lacks thrills or scares, it's pretty slow paced. It's well acted, although every single character is pretty loathsome, so there's nobody you can warm to, or empathize with, frankly you won't care less what happens to any of them. It filled a bored hour and a bit, I wouldn't watch it again, but the concept is a decent one. 5/10","user":"Sleepin_Dragon","rank":[5,5]},{"title":"Love","rating":5,"date":"8 October 2019","review":"Corny phone thrillers are my thing. However, she's only supposed to be 17??!!! She's clearly like 30.","user":"missbestworst","rank":[24,33]}]