[{"title":"Okay Movie, But Has Flaws","rating":6,"date":"23 October 2019","review":"So, with Wonder Woman: Bloodlines, they decided to ignore the events of the 2009 animated film and give Wonder Woman a new origin while adding a new story. This movie actually fixes some problems I had in the 2009 film (like fixing Steve Trevor so he isn't a womanizer who doesn't make comments about the size of Hippolyta's breasts), and it makes Wonder Woman a lot closer to her DCEU counterpart (a strong female who is capable of fighting evil without anyone helping her). The story after the origin is five years later, Wonder Woman is visited by an old friend to help save her daughter Vanessa from going to jail after she steals an artifact that she plans to give to Doctor Poison, but the mother dies in a shootout while Wonder Woman is busy with Doctor Poison's enforcer, Giganta. Blaming the amazon for her mother's murder, she is recruited into Villainy Inc. as Silver Swan, with the mission to invade Themyscira.<br><br>Yeah, story suffers from the typical \"bad guy is born because hero failed to save parent\" cliché, and some of the dialogue is cheesy, but it has some good action and the voice actors are okay in my book.","user":"jeremycrimsonfox","rank":[14,16]},{"title":"10 years for this?","rating":2,"date":"8 October 2019","review":"It's a Total disappointment.\nThey just changed her personality from previous movies, making her more like in the live action movie (wich I loved) but she is not what they have been giving us in the animated movies.\nBesides that, the writing is lazy, boring and animation is not great.<br><br>I am stick to the 2009 animated movie until they give us something better.","user":"optimuscarlos","rank":[40,57]},{"title":"Trips and falls short of both its live action and animated predecessors","rating":2,"date":"8 October 2019","review":"I've waited (as have other WW fans) for about ten years for another Wonder Woman solo movie after the amazing 2009 version. Unfortunately I cannot recommend this over its predecessor. The movie falls short on count of animation, engaging characters and plot development.<br><br>The animation is an unfortunate departure from the animation style that we have come to know and love in the more recent movies such as Death of Superman/ Reign of the Supermen and certainly doesn't hold a candle to the 2009 Wonder Woman movie.<br><br>Characters feel like they have been forced into moulds just to tick off agendas. Steve Trevor for example seems out of his league at most times. As a woman, I yearn for a movie where the empowerment of one group does not come at the expense of making another seem incompetent. Other characters as well have been shoehorned in to fit agendas just for the sake of it.<br><br>Summing up: If you're looking for a Wonder Woman animated movie to watch, I recommend watching/re-watching the 2009 movie instead.","user":"BalanaroftheNight","rank":[38,55]}]