[{"title":"Movie I was waiting for","rating":10,"date":"17 March 2019","review":"I would give 8 stars to that movie just for a choice of topic - allies cowardly betrayal of Poland in WWII.<br><br>Finally public institutions DID made marketable movie showing real bare history. Not to much pathos, great action with shotouts and cutthroats, intrique, no akward actors.<br><br>I just regret that in the end they didnt show full extent of consequences of allies betrayal.<br><br>I hope that IPN and other will continue to make such a movies.","user":"mateuszblaszczyk","rank":[22,30]},{"title":"An overall excellent historical movie....","rating":9,"date":"7 August 2019","review":"I was born and lived in Poland until I was 22. Then, in 1989 I left just before the fall of the Berlin wall. This movie presented me with a part of Polish WWII history that was never taught to me by either the socialist state or here in the West, our \"allies\". This movie makes you think \"what if..\" and presents a part of history which could be considered by some taboo, something we should not speak of.<br><br>The truth is Poland was used as pawn in WWI, promised alliance by the West (twice) and then, abandoned to Soviets when the Polish problem became inconvenient to deal with Stalin. As I said, many \"what ifs\" were brought by this film in my mind and I would certainly recommend it to anyone who wants to know more beyond the established \"history\".","user":"bmynars","rank":[11,17]},{"title":"A necessary reminder of the way the Poles were treated by the Germans, Russians and British","rating":7,"date":"2 January 2020","review":"We had a treaty with Poland, we went to war due to that treaty. We then deserted them due to the agreement with Stalin.<br><br>We could at least have supplied some arms ammunition and a little support. The Russians waited outside Warsaw until the Germans killed the poles, then subjected them to decades of subjugation. I visited Gdansk once, the lady on the cheap card table inside the Cathedral collecting small donations for candles said what the germans didn't take, the Russians took. The cathedral was bare.\nThe reviewer here says why pour salt on old wounds. Never Forgive, Never Forget !! Let others forgive, we must constantly remind the Germans of their actions - not \"Nazis\" but Germans<br><br>The Japanese rewrote history despite the US ruling presence. Dont let Europe forget the Germans evil acts.<br><br>an excellent film.","user":"banjofred-414-79873","rank":[2,2]}]