[{"title":"Every Human Being Wants to be Loved","rating":8,"date":"1 October 2019","review":"I saw 90% of Hong Sang-Soo's films. I love them all, some more than others, but the overall is pretty up there to me. Honest film-making and unmistakable.<br><br>This film is somewhat different from the others on his filmography. In many ways, the camera is closer, and for some reason I felt the Hong Sang-Soo I found on his first film, \"The Day a Pig Fell Into the Well\" (1996), in many ways the style is similar, but of course, with more experience and awareness. Grass (2017) seemed like the zenith of a certain period, major work on synthesis, if we can compare films, Grass was the sum of 20 years of film-making in a certain style.\nBut like I said, this film is different, it looks like he restarted in a certain way, like every brave artist does from time to time.<br><br>The story takes place in a Hotel near river where a father (a famous) writer receives his sons and then there is another story about a woman, who was left by her partner for another woman, that spends time in another apartment with her friend.\nI don't want to spoil anything, but the major theme seemed to be about love, the necessity, to be love, to be loved and how people strive so much to cope with their notion of love, how it affects them, what makes them do, etc...<br><br>Every human being wants to be loved, this is what I felt in the end. A very good film, a necessary film. Thank you Hong Sang-Soo.","user":"paulovmota","rank":[5,7]},{"title":"Some Positives & Negatives","rating":6,"date":"11 January 2020","review":"I've seen some of Hong Sang-Soo's films and from the ones I've viewed this one has many of the same characteristics. Very deliberately paced, with often enigmatic and awkward dialogue and characters. But there is a certain fascination and honesty about his movies which I find difficult to put into words.<br><br>This film is shot in black and white and mostly keeps the male and female characters separated except for some interactions. There's some humor interspersed among the dramatic moments and some of life's truisms are offered up as well. However, I didn't like the ambiguous ending here at all.","user":"larrys3","rank":[2,2]},{"title":"Tedium by the river","rating":4,"date":"13 November 2018","review":"This film is unfortunately the nadir (to date) in Hang's decline into tedium and pointlessness. Audiences tend to either love or hate Hang Sang So. Personally I am a fan but his work in recent years has become increasingly dull. This film looks beautiful but that's the only thing going for it. Unlike most Hang films, the male and female characters are largely separated. While, in the early Power of Kangwon Province, Hang used a complex time shift to tell the story from separate male and female viewpoints, here the two sets of characters are crudely filmed in different parts of the same building (at adjacent restaurant tables in one shot). Unlike most Hang films, there is no time shifting or viewing of the same scene from different perspectives. Instead we have characters who are unable to find each other in an almost deserted small hotel. If there is supposed to be a deeper message in this, it is not obvious.\nThe story takes place in small hotel where Kim Min Hee has come to get over a broken relationship and is joined by a friend. There is the potential for an interesting story here but Hang seems largely apathetic. He focusses instead on an ageing poet who has been invited to stay in the hotel by the admiring owner (or so he says). Fearing death (with some justification given his alcohol intake) he invites his two sons to the hotel. Unfortunately one character is less interesting than the next and the dialogue is less interesting than the characters. Like the hotel owner, one may quickly tire of the tedious poet.\nShown at the excellent London Korean Film Festival, an introductory speaker commented on Hang's prodigious current output and the fact that he wakes up every morning of shooting at 6 am to write the dialogue for the day. This film (like several before it) suggests that these working methods are suffering from the law of declining returns.","user":"mcousi11","rank":[9,21]}]