[{"title":"Jesus, the review bombing","rating":7,"date":"20 November 2019","review":"I don't even want to review this movie, but it hasn't even come out and somehow half of the ratings are one star. The movie itself is pretty great and I'd highly recommend you go see it when it comes out. The acting is very strong, the directing feels very fresh/unique, and you really grow to care about the film's romance. The political statements this movie makes are secondary to the story of these well-fleshed out characters and their struggles, which makes the commentary resonate stronger than many other movies like this. It ain't perfect --it's a bit long, especially when considering the repetitive structure of the story, and the shot composition is a bit boring  but this is a movie that everyone should go and see. And jesus, I don't know how it would be possible, butcan you not find a way to weed out the people who review-bomb movies with strong political messages/that have minorities or women in the leading roles? Christ.","user":"buckbeak-solo12","rank":[435,600]},{"title":"Needs a better edit","rating":4,"date":"27 November 2019","review":"This movie is infuriating because it has so much potential. The setup is promising and both actors have enough pull to take you along for the ride. Daniel Kaluuya is a great actor of our times, he carries the screen so well with his eyes and expression. For me, the movie fails in it's editing and pacing, especially past the halfway point. The movie feels about 40 minutes too long. In the beginning, the characters' decision to go on the run feels very haphazard, especially considering Queen's profession. Some of the main character decisions are remarkably dumb and certain other side characters take decisions that are unlike them. Without going into spoilers, all I can say is that this movie is just too slow paced and does not fulfil a promise of what could have been a great fugitive movie with a strong social message.","user":"spotboyfilms","rank":[168,256]},{"title":"A farcical fugitive film.","rating":5,"date":"3 December 2019","review":"A Tinder date goes awry when Angela and Ernest (striking beauty Jodie Turner-Smith and Get Out's Daniel Kaluuya) are pulled over by a racist cop and wind up shooting him in self-defence. Realising they're in deep trouble, the couple go on the run, making a desperate bid for Florida, and then Cuba, before they are apprehended by the law.<br><br>African American drama Queen &amp; Slim would have us all believe that the bond between black people is so strong that they will happily harbour fugitives from the law simply because they share the same skin colour (reward money be damned). Hell, even a black police officer is willing to risk his career to allow the armed-and-dangerous couple to slip away unnoticed, even though they're wanted for cop-killing. To be honest, it borders on the farcical at times. Still, no wonder Angela and Ernest (they're never actually called Queen and Slim in the film) blindly trust the decidedly dodgy looking guy with the gold teeth at the end; he's black as well, so based on previous experience he should be on the level too, right? Or maybe, just maybe, he's the exception that proves the rule.<br><br>The script for this black Thelma &amp; Louise/Bonnie &amp; Clyde fugitive flick is chock full of hard-to-swallow happenings, the couple making stops on their flight to freedom to partake in a burger, have a dance, ride a horse, visit a cemetery, make love, recklessly leap from a high window (as opposed to lowering themselves as far as possible and then letting go), hand their only firearm to a flaky looking gas station attendant, and lean out of the car window as they drive along (not the most inconspicuous behaviour for people on the lam!). Somehow they evade capture the whole way, even popping in at a service garage to have the radiator on their car fixed (luckily for them, the establishment is owned by yet another black man unwilling to inform the law).<br><br>As the couple continue their journey, they become folk heroes for the African American community, who rise up against police brutality and racism, which results in the film's most unlikely moment: a young black lad (the mechanic's son) joins a protest and shoots a black policeman in the face for absolutely no reason whatsoever. Still, it's no more perplexing than the many poor decisions made by Angela and Ernest, the last of which costs them their lives.<br><br>It might sound like I'm being unjustly harsh on this film, but I wanted to like Queen &amp; Slim a lot more, I really did. It looks great and both lead actors put in solid performances, but the script requires much 'tightening up' for it to work, not least because, in it's present state, the film runs at a way-too-long 131 minutes.<br><br>4.5/10, rounded up to 5 for IMDb. It had bags of potential, but the flaws are many.","user":"BA_Harrison","rank":[85,132]}]