[{"title":"Indonesian evil dead! N its quite scary! Worth give a try!","rating":8,"date":"15 November 2018","review":"Damn scary as i thought! Watched it on netflix alone and i felt it really very scary! I wished i shouldn't have been watching it alone! Alot of frightening parts! Hence its a good flick for a horror lovers! Worth giving it a try!","user":"mohammadirfan274","rank":[30,38]},{"title":"A genuinely terrifying film plagued by stupid characters and bad acting.","rating":7,"date":"17 November 2018","review":"This is a terrifying film. It doesn't pull its punches. It hits hard from the start. It has genuine moments of horror that is missing from most films these days that just rely on cheap jump scares with sudden loud noises and ghosts jumping from out of screen.<br><br>Having said that, it does not transcend the usual horror tropes with characters making bad mistakes and acting downright stupid at times. The brother character, in particular, is frustratingly stupid. The movie also suffers from poor acting by the child actor who just isn't convincing that she is frightened. Any human being would be terrified in the circumstances of the film but her expressions are just robotic and she does not seem to be in the same movie as the rest of the actors.<br><br>All in all I recommend this movie to all horror movie geeks a 100% but do not expect an exceptional film like the likes of Hereditary (2018) or IT (2017).","user":"sagir-khan","rank":[25,32]},{"title":"Honest review","rating":2,"date":"25 November 2018","review":"I could watch this film alone, in the dark, in a morgue, under a ladder whilst breaking mirrors with one hand and using a ouija board with the other AND still not be frightened. I'm a huge fan of Asian horror and this one truly disappoints. The acting was okay, the actors who played the stepbrother and stepsister were really the only believable ones. The first apparition looked like the Corpse Bride with hair. The director included all the typical overused cliches from other horror movies (and much better horror movies) no originality. On the plus side, the atmosphere and cinematography was good. I saw this on Netflix which is living up to its newfound reputation of touting mediocre horror films as To Scary To Watch.","user":"vmalast","rank":[33,54]}]