[{"title":"Heartwarming, very moving & brilliant set design & props","rating":8,"date":"23 January 2020","review":"I loved this movie. Really good if you want a light hearted, simple &amp; feel good movie to watch.\n***FEW SPOILERS PRESENT***\nImo, this movie explores good luck and chance. The story beautifully narrates how goodness of nature, simplicity and doing our best to be right in life helps favor good luck. Simplicity in nature &amp; authenticity helps people who are best for us to move into our lives. The kind of people wrong for us will eventually move out of our lives.\nI loved the cinematography, set design &amp; props. Every prop was so carefully chosen and totally made every frame stand out.\nI'm an Indian &amp; I've actually known about people whom chance favored so much that they became multi millionaires overnight only out of the goodness of their character. So the movie &amp; character imho are very realistic.\nAs for Actors and acting, every actor worked very sincerely &amp; fit the part beautifully.","user":"aarinnkumarmishra","rank":[3,5]},{"title":"There should be more Ernesto's in the world","rating":10,"date":"18 January 2020","review":"What can I say? I'm a sucker for feel-good movies. This is the role Fernando Hidalgo was meant to play. Enjoyed Amy Davidson (\"8 Simple Rules\"), too. After watching this film, it made me want to be a better person. Couldn't help falling in love with this movie, and inevitably falling in love with Ernesto.","user":"Vertcoin","rank":[3,5]},{"title":"Poorly acted, Poorly scripted - Yet a still Fantastic, upbeat movie!","rating":8,"date":"19 January 2020","review":"The overall acting was below par - with absolutely none of the actors standing out.\nThe script is diabolically simple... way too simple.<br><br>..BUT... the end result is a success!<br><br>This, obviously, limited budget Movie has REAL character. It's one of the best - if not THE best - Low cost productions - I've ever watched.<br><br>I simply cannot disparage any main part of it - except, perhaps, the scripting (which is way, way too simplistic ) - and have to say that the main actors did their best... without any major experience... but with TONS of talent.<br><br>I'm not going to go into individual performances here for the reason previously stated... but I will mark 'Fernando Hidalgo' and 'Tabitha Caulfield' as people to watch. Talent will shine through.","user":"brianp-47-339568","rank":[1,4]}]