[{"title":"wasted my money buying this dvd..","rating":1,"date":"8 September 2019","review":"The worst acting i think ive ever seen..Was it filmed in a garden shed..Managed about 20 minutes before putting it in the recycle bin,,,,","user":"philsampson-16524","rank":[18,20]},{"title":"War is awful, this film is worse.","rating":1,"date":"15 August 2019","review":"The best films are tailored to play upon your emotions. Tragedies such as Macbeth evoke sympathy for the tragic hero, and a cathartic element upon its dénouement. Films of conflict immerse you into the horrors of war and the emotions of desperation and helplessness. Amongst this number of emotion-wrenching films is the Angel of Auschwitz, but I regret to inform you for all the wrong reasons.<br><br>Firstly, you are subjected to its soundtrack, perhaps unnerving at times (and deliberately so, because of the film topic.) However, what irradiates from the music is how it is so abysmally composed. The \"music,\" often merely composing of two notes in a loop, serves as a nuisance rather than a contribution to the emotional value of the film, bringing all the grace and purpose of a wasp at a picnic. Instantly, you're annoyed and uncomfortable. The music does little to draw you into the claustrophobic, suffocating environment, rather detaches you from it, rendering you a slave to the timer on the DVD box. You will watch it often, if you decide to go the distance.<br><br>The actors' depictions of historical characters are often verging on offensive. Whilst the protagonist admittedly has a slither of character depth about her, the other actors look like they have won a \"be an actor for the day\" competition in a magazine. Josef Mengele embodies this: \"The Angel of Death,\" one of the most sadistic figures of the Holocaust, is transformed into a character designed for comedic value. His German accent is so insulting it appears deliberately poor, and his dialogue will leave the viewer chortling - \"Curiosity killed ze cat, that is why I'm not verking with felines\" stands out as a particular highlight. The viewer is left questioning their moral fabric - why did I just laugh at a film about the Holocaust? The existential questions about your existence that this film makes you ask - am I a sociopath? Do I deserve to go to prison for laughing at mass-genocide? Are not appreciated, and are by-products of the amateurish production quality.<br><br>Speaking of which, the attempts to mask the modest production value of this film are mediocre. You'll realise that that time you left the garden gate open before you left to go shopping was a major oversight, when you recognise they're using your shed as Auschwitz concentration camp. Did you not notice merry Mengele and his crew in the bushes before you left? They could all probably fit in that bush comfortably mind you, seen as throughout the entire film the protagonist only encounters three Nazi officials. No wonder the entire film comprises of trivial close-ups - zoom out any closer of the scenes inside \"Auschwitz\" and you'll see your lawnmower, power tools and inflatable paddling pool.<br><br>Finally, this film is incredibly misleading. By the end of the movie, you will question why you spent your time watching this film. You would have done so for a number of reasons. Perhaps you are interested in Second World War history, and were hence drawn to the film because of its 1) Rave reviews on the front cover and 2) Respectable score of 6.7 on IMDb. Those who are considering watching this film, do not be deceived. The reviews on the DVD are all by the same woman, probably related by some description to the director, which also explains the commendable IMDb score. The fact that there are under 20 reviews also means the score is far from representative. This film is intrinsically poor, irreconcilable with the genuine Holocaust experience, and verges unintentionally on a stand up comedy. It is the worst film I have ever had the pleasure of viewing.","user":"bader40-616-95439","rank":[37,54]},{"title":"One of the slowest, most boring films I've tried to watch","rating":1,"date":"4 September 2019","review":"I only managed to watch about fifteen minutes of this film. I turned it off, watched something else, then thought I'd give it another go, thinking maybe I just hadn't been in the right frame of mind for it the first time. Nope - still unwatchable and I could only stomach another five minutes, in which the film had gotten nowhere. It jumped about in different time lines, the actors sleepwalked through modern-style moral preaching sermons disguised as dialogue which probably wouldn't have happened during that time as prisoners would have been too scared to say anything negative to their captors.<br><br>As a previous reviewer mentioned, the music is annoying and kind of adds to the droning mind numbing-ness of the film. The female actors were so nondescript I couldn't tell them apart. The 'actor' who played Mengeles was DREADFUL. It was like watching a really bad amateur theater production you have to stick out because your kid is in it. Maybe it got better after twenty minutes - I don't know, but I HAVE managed to stick out a boring film until it got better before, but this one was just unwatchable - and I did try. What a shame because it is such an important topic, particularly in this day and age.","user":"ynot500","rank":[18,24]}]