[{"title":"Simple but it's a kind animation that everyone should watch.","rating":7,"date":"31 July 2019","review":"Sheep and Wolves: Pig Deal is a kind of short animation that has only an hour and 15 minutes long. As for standard, it was too short. So, when I saw this animation, I didn't have that much high hope. According to the poster, I thought it was just a fine animation. In fact, it has the word sheep. So, I thought it might be lovely. So, I watched.<br><br>When the animation started, I was so surprised to see that this animation is from Russia. I'm not saying that their products are not good. But compared with those animation produced by US, they are quite inferior to them. Stories and animation quality are also lower than theirs. Hence, I thought it wouldn't be that good when I saw it's from Russia.<br><br>As the animation went minutes by minutes, I kept continued to amaze. The story is so simple but because the animation is quite good (although there are some sketches), the animation somehow turned out to be good.<br><br>This animation shows the nature can be changed. Wolves are supposed to hurt sheep, but in this animation, that nature is changed. It's something different to see, but in someway, it's kind of cute. It shows the peace that we should keep and we must have peace. Like in this animation, if we have peace between us, wouldn't this world better?<br><br>Bad thing about this animation is that the running time is too short. But they deliberately made it short to let the audience think the rest of it. And I really want to know what that portion they all drank does, rather than changing back to normal. Too bad that they didn't show.<br><br>The other thing that made me wondered is that what if that crocodile turned back to normal? What would they do? And what would that crocodile do? Will he drink that same portion to turn back to sheep? If he does, it would be so lovely. 😁<br><br>And I love Grey's wife. She's so talented, supportive and she can give strength when her husband needed it. She's so cute. 😍😘<br><br>Anyway, this animation has a message that nothing is impossible. Like wolves and sheep have peace and live together, we can also have the same peace like them. Everyone should watch this animation, so that we could all have peace and make the world better and better.","user":"silvermistvio","rank":[11,11]},{"title":"The sequel about the friendship of wolves and sheeps","rating":6,"date":"24 March 2019","review":"I will not say that I liked the cartoon, but in no case will I say less that I did not like it. If the prequel showed something original, then the sequel turns into a flat comedy, in which all the plot moves are predictable, and the final is repeated, only the villain is defeated without the method of death.\nBut the cartoon has so far managed to turn out quite good, and will be able to interest some viewers who like anthropomorphism. Especially in the Russian animation industry, there are cartoons much worse.","user":"soto350","rank":[20,22]},{"title":"Improved animaion in this sequel","rating":7,"date":"4 August 2019","review":"Good for a family that wants more than Hollywood animation. Be sure to sit through the end credits.","user":"rbn_lrk-1","rank":[7,8]}]