[{"title":"See It On The Biggest Screen You Can","rating":10,"date":"24 March 2019","review":"A half-century ago, Neil Armstrong stepped off the ladder of the Lunar Module Eagle and into the history books. In the decades since, that moment and the flights of NASA's Apollo program have been chronicled in seemingly countless documentaries. At the top of that list remains 1989's For All Mankind from the late Al Reinert and 2007's In The Shadow Of The Moon from British filmmakers David Sington and Christopher Riley. Up there with them now is 2019's Apollo 11, an exciting new film from Todd Douglas Miller that is begging for you to see it on the biggest screen possible.<br><br>Why?<br><br>In part because of Miller who, like those other great filmmakers of Apollo before him, wasn't content to merely do a rehash of what had come before. Miller's Apollo 11 is in part a deep dive into the NASA archives, uncovering things that even the most seasoned space enthusiast has likely never seen before. There's a wealth of pre-launch footage, for example, tracing the preparations from the rollout of the massive Saturn V rocket to the launch pad to multiple perspectives of the launch itself. Even when events move into space, there's still a wealth of rare material to experience including conversations between the astronauts themselves as well as between them and Mission Control in Houston. Even where footage that has become synonymous with the mission and the era such as the stage separations of the rocket or the Lunar Module's descent to the surface of the Moon, it's presented with clarity and scale rarely seen elsewhere. For that alone, the film renders excellent service.<br><br>It does so in other ways, as well. Unlike those two documentaries I mentioned at the top of this review, Miller doesn't use astronaut interviews (either aural or visual) to help tell the story. Instead, Apollo 11 unfolds entirely through archival sources ranging from the transmissions to the voice of NASA's public affairs or well-known TV commentators like Walter Cronkite. To help aid visually for parts of the mission where there isn't much or anything to show, the film employees simple animation alongside such commentaries. The film also makes effective use of split-screen and captions to portray mission control or to show events such as the actual walk on the Moon from multiple perspectives. As much as the footage itself on a cinema screen does, it presents the sheer scale of the endeavor but without losing the viewer in the technicalities involved in spaceflight.<br><br>In some ways, that's the greatest triumph of Apollo 11 the documentary. It's a film keen to present Apollo 11 the mission in awe-inspiring yet understandable terms, one that emphasizes how incredible in scope and achievement that flight five decades ago this July was. It's also a reminder, at a time when cinema screens find themselves increasingly dominated by would-be blockbusters and superhero flicks, of the raw power of cinema to present stories. Both of those are things we need reminding of, it seems, and the film does a superb job of both.","user":"timdalton007","rank":[100,103]},{"title":"Best footage yet.","rating":9,"date":"1 March 2019","review":"Saw the Apollo 11 IMAX film last night. Highly recommend. No narration just the NASA announcer, communications between ship and ground plus a few other bits added such as Walter and JFK now and then. Images are amazing, esp in IMAX. It moves well, no slow moments, no soap opera, no agenda, lots of unseen footage and some new stories, pure documentary, the trip is the whole story. PDI is great, TLI is great, LM separation, footage of the crowd is great. Go see, you wont be disappointed. 90 minutes long.","user":"pismo10","rank":[149,157]},{"title":"Truly Amazing film","rating":10,"date":"1 March 2019","review":"Should be mandatory watching for all the folks that have lost the feeling of global humanity. I remember it from 50 years ago and I feel proud of the world as it looked then and the can do attitudes. The grace and humility of Neil Armstrong and crew was amazing. I was excited at each event and the music was marvelous. You know they make it but the tension was intense. so much could have gone wrong. What was error 202 !!!","user":"alanhstanley","rank":[127,137]}]