[{"title":"You're my BFF!","rating":7,"date":"22 August 2019","review":"I went into this movie knowing nothing about it except that John and Blythe were starring in it. This is a slow family drama. It's about the obstacles and complications of dating later in life.\nI really enjoyed this movie. It's quiet and simple. Ole fashion romance movie that lifts the heart.","user":"FIoret","rank":[20,21]},{"title":"A peaceful & enjoyable storyline!","rating":7,"date":"23 August 2019","review":"The movie starts with some scenes showing us the boring life of an old man. Ed (John Lithgow) is one of those old men in his wrong side of his 60s as he claims it who are proud of themselves for knowing how to use the technology &amp; internet. He lives alone &amp; he watches tv news everyday for a particular reason which we'll understand later in the movie. In the intro we see Ed talking on the phone with his son Brian (Derek Cecil) &amp; complaining to him about how he always wastes his time &amp; that he should be prepared for the unknown future.<br><br>As the story goes on he starts to like an old lady. He finds a way to make her notice him &amp; he's as clingy as a teenager in his way. Ronnie (Blythe Danner) had a hard time in which she had lost her young daughter because of a rare disease &amp; also her husband died of a cancer. They start liking &amp; trusting each other &amp; they both have a secret which later they reveal those to each other.<br><br>Ed is a man in control of everything &amp; he knows what to do next but as the relationship progresses, he begins to feel the vicissitudes. Noble Jones did an impeccable job in writing &amp; the screenplay seems so interesting. I highly recommend this movie if you wanna see a peaceful movie.","user":"alibayati-18914","rank":[13,13]},{"title":"enjoyable","rating":8,"date":"21 August 2019","review":"I really liked this movie. it explores the personalities really well. it is relaxing and a feel good movie. some people don't like the ending but i thought it was a nice touch. the acting is excellent. story line very good. time well spent.","user":"incredingo-37769","rank":[15,16]}]