[{"title":"Man is a social animal","rating":30,"date":"30 November 2019","review":"\"Man is a social animal\" - a quote that is attributed to Aristotle and a line from the movie, holds an important truth and is probably the core message. We need connections with others for many reasons. Connect reminds us of this and shows us some uncomplicated ways of doing so. As well as some other good points to keep on living and how we can choose to think about things.\nIt seems dull at moments. But this is it's power. Once the nature of this movie is understood it can be appreciated for what it is.<br><br>SPOILER - about the ending:<br><br>There is some suspense/mystery/foreboding as an recurring element which was successful in drawing me in and it kept me wondering what certain things meant and how it would all end. First i thought the final scene is only there to shock us and keep us thinking/talking about the movie and it's subject. I wanted a happy positive ending you see.<br><br>But the more sinister and logical explanation is that Brian's story ended when he sees a certain hoodie and a rope. What follows is another life that he could never experience. Perhaps that fantasy flashes before his eyes in his last moments and we get to see it. Reminds me of something that some 'jump survivors' have mentioned about what they wanted after they jumped. That they suddenly wished they had not done it but could keep on living and change their life. And some have indeed changed their lives for the better and are now even helping others.","user":"Heisenb","rank":[2,2]},{"title":"Serious topic but good execution","rating":6,"date":"28 January 2020","review":"For the mental illness or disability to connect really a serious topic, I think it's one of the few films did that. The theme kinda serious but the way they tell us is not bad. It's kinda good indeed. Just don't treat this movie as a romance but treat as a patient way of life.","user":"ks-60500","rank":[0,0]},{"title":"A very creditable debut","rating":7,"date":"4 November 2019","review":"I used to holiday in North Berwick as a child so was drawn to this more for sentimental reasons than for any great interest in the film itself. The setting and solid performances from Kevin Guthrie and Siobhan Reilly make for an interesting, if somewhat predictable effort. I found the last 20 minutes of the film a little too formulaic. That said, the cinematography shows off this lovely East Lothian town to good effect and all in all it is a well worth watching - perhaps on telly, though?","user":"CelluRob","rank":[3,8]}]