[{"title":"Enough w the fake reviews already, its a 4 to a 5.","rating":5,"date":"5 February 2020","review":"Not a bad movie, but seriously folks, can't people involved w/ the production STOP giving 10's to their movies just to bump up the aggregate score?\n1) you can just tell when someone's making up a review, you don't need ESP.\nAnd\n2) even those admitting to involvement, a 10?, seriously? If you truly love great movies then stop insulting movies like Casablanca, Psycho, Gone w the Wind, even Night of the Living Dead, etc, by giving your movie better ratings than the classics, it's embarassing. Show a LITTLE objectivity and SOME restraint by giving it what it is, a 4 to a 6.","user":"bobkuhl","rank":[27,34]},{"title":"Aspirational thriller","rating":4,"date":"8 February 2020","review":"The lead antagonist is not the only one suffering from delusions in this film. Adonis, like its Imperfect Host, has a little bit of an identity crisis. The film is unsure if it is a black comedy, a thriller, or a slasher. It never fully commits itself to any of these genres, and instead chooses to slowly oscillate between these three centres of gravity, managing an uneasy orbit through this trinary system of pathos and despair.<br><br>Somehow, this works. The acting is lumpy, and the pacing is a little deranged, yet it is watchable from start to finish. There are attempts at obfuscation, of layered narrative and meanings within meanings; all of this is fairly trite, but not so malodorous that I was compelled to rage-quit the movie.<br><br>There is little originality in this film, but that really isn't what this melange of genres is about. It does manage to engender feelings of unease and tension, and this is what counts. Watchable, if you have the time to give to an imperfect, but adequate, low-budget attempt.","user":"troy-boulton","rank":[2,2]},{"title":"Enjoyed this movie very much!","rating":7,"date":"6 February 2020","review":"So many things I liked about this movie. I love thrillers, I love comedy's, and this blended those two really well. It's actually very fun/thrilling to watch, beautifully and uniquely shot. You don't see movies shot like this everyday and I loved that about it. I really enjoyed the dialogue, it had me laughing and the characters are fun to watch. In a way you can relate with the characters, we've all had a weird airbnb experience at some point! Overall thought this was very well done.","user":"ericaadenny","rank":[4,13]}]