[{"title":"Mixed bag","rating":4,"date":"26 May 2019","review":"Wow... this film is a must-see for musicologists familiar with the Laurel Canyon scene of the '60s. Terrific interviews w/key players during that time. But... I think a bit less Jakob Dylan and newbies would have done. I suppose his being Exec Producer on the film necessitated his being in too many scenes, annoyingly nodding knowingly at comments.... that is, one supposes, the curse of being the offspring of the Great One. I am also wondering why Mama Cass barely got mentioned and Joni Mitchell was completely omitted. Was it due to disparaging remarks Joni made about pere Dylan a few years ago? Would that this film had been an eight-part comprehensive series on Netflix.","user":"markanthonyparra","rank":[66,75]},{"title":"Go where you wanna go","rating":7,"date":"7 June 2019","review":"Greetings again from the darkness. \"Go Where You Wanna Go\", a catchy pop song by The Mamas and the Papas, always seemed a quintessential 1960's song, but now, thanks to an insightful interview with singer Michelle Phillips in this new documentary, it's a reminder that even the era's free love carried a price. Director Andrew Slater, the former President of Capital Records, combines the nostalgia associated with the California Sound with the contemporary staying power of the songs and the musicians.<br><br>Jakob Dylan of The Wallflowers (and Bob's son) is really the face of the film. Not only does he conduct most of the (many) interviews, he's also the driving force behind the 2015 concert at the Orpheum Theatre celebrating the 50th anniversary of The Byrds debut album ... an album we are told kicked off the fusion of folk and rock. Dylan's first interview is with the legendary Tom Petty (in one of his final interviews before suddenly passing away in 2017). The two are sitting in a guitar shop with Petty regaling the brilliance of a Rickenback, and how the music of 1965-67 influenced him as a songwriter and musician.<br><br>An aerial view of Laurel Canyon accompanies its description as the antithesis of the plastic TV world of the 1960's. It was an area that attracted bohemians - musicians, artists, and actors - and collaboration and community were the calling. Jackson Browne and Tom Petty both mention \"cross-pollination\" ... the \"borrowing\" of ideas from each other, as it's contrasted with outright theft.\nThe concert at the Orpheum acts a bit as a framing device, and Jakob Dylan takes the lead and performs with other modern day acts such as Regina Spektor, Beck, Jade, Fiona Apple, Cat Power and Norah Jones. We cut to modern versions of the 60's classics after an interview with the original artist or clip of the original band is played. It's a way to connect the dots and show how the music still stands today.<br><br>Those interviewed include: Jackson Browne, music producer Lou Adler, David Crosby, Roger McGuinn, Michelle Phillips, Eric Clapton, Graham Nash, Stephen Stills, John Sebastian, and Ringo Starr. Each of these musical luminaries serves up a story or two, and takes a stab at defining the era and its influence. Roger McGuinn tells us how The Beatles influenced The Byrds, how The Beach Boys \"Pet Sounds\" influenced \"Sgt Pepper\", and how so many songs and bands are interlinked. Brian Wilson is compared to both Mozart and Bach, and Eric Clapton admits to taking a bit from Buffalo Springfield.<br><br>We see and hear Brian in the studio with Jakob, as well as Clapton riffing with Stills. It's fascinating to listen as Brian explains 4 different local studios were used to cut \"Good Vibrations\" because of the various sounds needed. A bit of artistic lunacy? Perhaps. But it makes for a great tale. It's a bit odd to have clips of Jacques Demy's MODEL SHOP, starring Gary Lockwood and Anouk Aimee, interspersed throughout, but Dylan explains how the film inspired the concert and film. Lastly, we can't help but chuckle since even Jakob couldn't coax his notoriously reclusive father into providing even a touch of recollection for the project. \"Expecting to Fly\" is offered as the end of the era.","user":"ferguson-6","rank":[26,28]},{"title":"Needed more of the actual artists less of 2nd generation Dylan","rating":5,"date":"6 November 2019","review":"Unless you really want to see Jakob Dylan's monotonous voice singing all the classic 60's songs, then you're better off fast forwarding every time he's on screen and just watching the archival stuff. Better yet, find someone else to make this movie about the scene and not have a lame concert of knock offs. It has some merit though, it'll make you go back and re-listen to all that great music by the original artists!","user":"jellopuke","rank":[8,8]}]