[{"title":"Real Action, Great Thriller!","rating":9,"date":"23 April 2019","review":"I don't know why people haven't reviewed this movie yet. Like other South Korean movies I've seen, this one didn't disappoint.<br><br>The movie starts with Sang-Hoon coming home from having some drinks with his work colleages, when he gets home he hears a woman's scream, when he looks put of the window he sees a man hitting a woman with a hammer. He is shocked and doesn't know how to react when the murderer makes eye contact with him.<br><br>The next day the woman is found dead and the police is investigating the case. Since he might be the only witness that night, he decides not to tell the police anything, but the murderer saw him and is now after him. Now Sang-Hoon will have to protect his family from the murderer.<br><br>The movie is packed with action and suspense moments. The actors are great, did an excellent job. The murderer's character is a bit undeveloped what we know is that he likes to kill. But well, it's nice to find a movie that uses different ideas, hammer instead of guns, storms, snow.<br><br>The movie was overall really good, entertaining, nice way to want to spend 2 hours.","user":"anibeli","rank":[16,17]},{"title":"More than just a crime movie","rating":7,"date":"12 May 2019","review":"With a killer on the loose and The Witness paralyzed by fear this movie is as much an indictment on the false security and anonymity of modern living as it is a crime thriller. This is a crime movie, but it is more than that as a man discovers that everything he aimed for and wanted to protect was taking away his humanity.\nWith a killer easily evading what seem to be efficient but disconnected cops the story seems a bit contrived but overall worth the time to watch and the action continues from start to finish.","user":"vovers1","rank":[4,4]},{"title":"One of the best suspenseful korean thrillers","rating":10,"date":"15 September 2019","review":"I loved this movie. The acting is flawless and the storyline gripping from beginnng to end. It even has a very important message at the end about helping each other when something is not right. Would totally recommend","user":"florenciaalf","rank":[3,3]}]