[{"title":"You too can find love, if you dare...","rating":10,"date":"30 November 2019","review":"Angelfish is a dynamic love story that highlights the beauty and strength in overcoming both the external and internal conflicts of wanting pure and supportive love while navigating the often times painful realities of life.<br><br>Craving love is a universal theme that speaks to the imperfections of human nature. So many of us desire love, through understanding and support, to redirect a past where that was not offered or to compliment the maximum potential we hope to aspire to. Angelfish depicts this through its respectful admiration for the Bronx and its diverse population.<br><br>Princess Nokia, a Bronx native of Afro-Latina descendant herself, delivers an authentic representation of a first generation immigrant's struggle to honor their family's sacrifices while being true to themselves. More over, it shines a light on how caregiving roles impact ones ability to put themselves first in a lovingly real manner. Nokia's character, Eva, showcases this long term journey in finding balance between showing up for the cards you were dealt and the privilege of family.<br><br>Jimi Stanton's character, Brendan, reminds us that there is always more than meet's the eye in his portrayal of a different side of the same coin of self-sacrifice. Rising up to assume his absent father's role for both his mother and brother, he is often misjudged as having a much more stable life than he actually does. Despite his hardships and lack of guidance, Brendan courageously attempts to cultivate the life he desires rather than becoming defeated.<br><br>This film rewinds the year to 1993, a time before social media clout clouded love with paranoia, surveillance and FOMO. There is a comforting simplicity in this film's ability to remind us that getting to know a stranger through sharing vulnerable and genuine experiences that build trust is precious, possible, and most importantly worth it.","user":"monteirosamf","rank":[3,4]},{"title":"A sweet love story","rating":10,"date":"24 November 2019","review":"There's something about the innocence of true love which was wonderfully captured here. Jimi Stanton delivers a gripping performance.","user":"janegron","rank":[3,4]},{"title":"Terrific","rating":8,"date":"30 November 2019","review":"Classic story, beautifully told.\nThe lead actors have great chemistry.","user":"lgillian-71905","rank":[2,3]}]