[{"title":"homemade thril","rating":1,"date":"22 June 2019","review":"Gather your family to shoot a movie is a popular thing to do in todays hd cam era. its no more than that and its not a recommend.<br><br>the grumpy old man recall from his childhood days when we had family getogethers some of the most entertaining business was to watch homerecorded 8 mm family holiday memories or while my cousines where bashing the pool in the garden, the small with blowup walls. that wasw good stuff ,but it became even better at the end when the reel where spooled backwards and doing the stuff the wrong way at high speed. thats good cinema.","user":"ops-52535","rank":[5,5]},{"title":"What is Felonious?","rating":1,"date":"12 August 2019","review":"The film centers on an illegal immigrant from Nigeria (Jolina Jean-Paul) Viveca. She works for crime boss Mr. Duncan who is involved in insurance fraud. People are killed for insurance money and Viveca delivers money in cash in a briefcase because State Farm doesn't do anything electronically. She decides to blow the whistle but does so in a haphazard manner that threatens herself.<br><br>In the first 5 minutes, you can tell that the film oozes with bad acting, tinny sound, miserable soundtrack, poor dialogue, ugly plot, and a bunch of folks who shouldn't be in the country, let alone in a film.<br><br>Paul Okon Roberts needs to get a real job and stop listening to his family and close friends that he can be a filmmaker.","user":"nogodnomasters","rank":[0,0]},{"title":"oof","rating":1,"date":"24 June 2019","review":"This was almost as bad as the room. Could not finish. Script was bad. Actors were bad. Over the top editing in between scenes. And then the background music lol. One scene was so long and dumb. They kept coming back to the same room where dude would pull out his gun and shoot these guys after a long dumb conversation. It was like they ran out of music so they started looping the same track over and over and over. What a pile of garbage. There are some chicks in the film as well that might not even speak English. It was like someone just taught them the words and they were reciting it without even knowing what they were saying. I would rate this lower but 1 star seems like its the lowest. Hope this helps anyone else thats thinking about watching it.","user":"DinosaurBlex","rank":[0,0]}]