[{"title":"A Must See","rating":9,"date":"11 October 2018","review":"Growing up with such an Aussie icon blasting through the radio to peeling back the layers of what and who made him JIMMY BARNES.<br><br>Absolutely loved it and recommend it to all❗","user":"simmy11","rank":[5,5]},{"title":"A gripping story well told","rating":9,"date":"25 August 2018","review":"This documentary centres on a live show in Jimmy Barnes's hometown of Glasgow with additional interviews and archival images. It's filmed in a simple way but any embellishments would've run the risk of distracting from the core message Jimmy brilliantly conveys through words and music alone. It came across not as film to stroke the ego of the director nor to appease hardcore fans of Cold Chisel, but as an honest account of a human life, which is exactly what it needed to be. Jimmy didn't shy aware from sharing the darkest moments of his life but managed to convey them with an overall purpose of advancing a dialogue about deep societal issues. I admire his bravery in sharing his story and his skill in presenting it not as a 'sob story', but as a holistic account of struggle. Indeed, the trauma is balanced by quite a lot of humour and live music is beautifully integrated throughout. I hope this documentary will encourage frank conversations about how we can break the cycle of poverty, addiction, and violence.<br><br>This documentary had my attention the whole time and now I desperately want to read the book.","user":"lc_1996","rank":[8,9]},{"title":"The true background story - not pretty, but totally the real deal","rating":7,"date":"2 September 2018","review":"This is a fine documentary style film that tells Jimmy Barnes' background life story. It does it really well, using recent footage shot with all the people involved that are around to tell their versions. It is interspliced with historic footage, including amateur home video, promotional material and professional TV and film sections. There's a lot from Glasgow, and I reckon we Aussies should be really thankful that Jimmy and family made the journey - not only that we have his substantial contribution to our lives, but they must have had better opportunities and weather here too.<br><br>There is a fair bit of music, mostly light folk soul rock style. If you're after serious Barnes rock'n'roll, you'll be disappointed. If you are a Cold Chisel fan hoping for lots of head splittingly loud rock, don't bother.<br><br>I found it readily engaging, and probably easier going than Jimmy's book of the same title which I enjoyed reading, but which took a bit more effort. I'd say the film got the level of detail I was interested in right: the book, while well written and edited, I found a bit long on detail I didn't quite need.","user":"manders_steve","rank":[3,3]}]