[{"title":"It's a Low Budget Story. Lighten Up.","rating":6,"date":"7 December 2019","review":"You need to approach watching this movie from the standpoint of knowing it's a low-budget movie, made by a bunch of people who just wanted to make a movie. Don't expect Hollywood talent, costumes, locations, sound, photography. They're not there. What is there is some occasionally very funny lines and campy humor, along with bad audio, inconsistent lighting, and questionable acting. It's fun to put yourself in the place of these actors, doing this for the love of film rather than having expectations of greatness. It reminds me of stuff we I did in high school.","user":"imdb-16829","rank":[2,2]},{"title":"Low budget gentle comedy","rating":7,"date":"31 August 2018","review":"This is a low budget movie. In this world there is no costume department: the actors get asked to bring something suitable to wear. The scenery is ok and sometimes very good. Camera shots are deliberately tight but a couple of long shots are really nice. Editing is ok. Audio is ok but does jump in level on occasion.<br><br>Our hero works at a night club where he side-lines as a very bad stand-up comic. The story starts as a very simple domestic problem to get the guy a new girlfriend and mostly that is what it concentrates on. Other elements get added for interest; first an investigative journalist and then a spy. In my opinion it would have been improved if these elements could have been foreshadowed earlier.<br><br>The girls in the Christmas hats on the poster are not in this movie. The actors are young, inexperienced and vary in talent. There are mild sexual references and the female cast often strips off to their bra but that's as \"raunchy\" as it gets. You won't find any swearing, there is very mild violence.<br><br>In a couple of places the dialogue hinted at a religious background so maybe some of the cast or crew were escapees from a Christian group. Maybe they were having a dig at their past.<br><br>I did laugh in places and all the cast delivered at least some line that made me smile. I enjoyed the pee-pee story. It's never difficult for me to spend an hour or two in the company of folk who make films for the love of it. This is no \"Bad Santa\" but for the budget it gets a 7 from me. However; if you expect Hollywood production values then look elsewhere.","user":"Fudge-3","rank":[10,20]},{"title":"Don't waste your time!","rating":1,"date":"18 December 2018","review":"I felt like this movie was a bunch of teenagers who got ahold of their parents' camera. I kept watching in hopes it would get better and now all I can think is what a waste of time!","user":"claudiafairbanks","rank":[2,3]}]