[{"title":"Uplifting, Inspiring , Amazing !!!","rating":10,"date":"30 October 2019","review":"In short this documentary was amazing. The struggles and suffering that these men and women endure daily from having spinal cord injuries is heart breaking , but at the same time inspiring. This documentary travels various people, from athletes to regular people on their journeys of trying everything and anything to try and get their range of motion and feeling back into their extremities. Eventually they except that their lives will be changed forever, but they do not give up. They push on to start wheelchair dancing companies or invent other things that will not only help them regain some normalcy in life but others in the same position.\nThere are so many different treatments to help people with spinal cord injuries but no real cure which makes this documentary particularly frustrating while watching. Basically what I have learned is that everyone's body recovers differently and that each injury has a different degree of severity . In time these amazing people get better physically and emotionally.\nI was blown away at how brave these people are, and truly inspired by their incredible stories. Another great documentary from HBO Sports, and one I will not soon forget. Must see for all people !!!","user":"mpboylanjr-54038","rank":[8,10]},{"title":"Scary but inspiring.","rating":8,"date":"2 November 2019","review":"This follows a professional BMX'er in his journey from a bad high profile accident...to possibly getting some degree of recovery. Some of the best footage is go-pro footage when he is struggling with various things, but then it is also inspiring to see his progress. It also talks to a bunch of other affected people, who were injured in a variety of ways..to give you a more full perspective of conditions people may also find themselves in.<br><br>Overall, a very good documentary, and definitely recommended.","user":"johncg25","rank":[3,3]},{"title":"Self inflicted?","rating":7,"date":"30 October 2019","review":"Although I feel sorry for the people who have been injured in a car or other accidents, I found it hard to sympathize with others who performed dangerous sports where they knew the risks and then had to have loved ones take care of them indefinitely. A lot of these caregivers are young with the rest of their lives in front of them and all I could think is how a selfish hobby of a loved one gave them this lot in life. Sorry but all it made me think is people should think of others when you want live on the edge, it's not only your life that gets impacted if something happens onto you. Epitome of selfishness","user":"sbari2004","rank":[18,42]}]