[{"title":"Definitely should break out but probably won't","rating":9,"date":"30 May 2019","review":"Both Jesse V Johnson and Scott Adkins should be making bigger budgeted films than this by now. Their body of work together alone deserves it. That said, if they continue to make such polished B movie fare as this then long may their reign continue!! This is how you take a small budget and make a big statement!! Adkins has turned in his best performance to date by far!! Johnson has created a genre piece for the ages although alot of credit goes to Lorentz in the editing. The fight scenes in this absolutely nailed the tone of the story, they weren't flash spin kicks or any over the top Tae Kwon Do, Luke Lafontaine was spot on in this respect, just brutal on screen carnage!! I like Tim Man's choreography in previous Johnson/Adkins efforts but it would have been unrealistic in this. All the actors involved were solid, Fairbrass included, which I never thought I would say. In summary this film both cracks bones and should allow Adkins and Johnson to crack on to bigger and better things","user":"studleymoore2027-177-110186","rank":[73,80]},{"title":"Better than expected","rating":7,"date":"31 May 2019","review":"A better than average fight movie. I was pleasantly surprised to find that it has a decent story and is played out nicely being interspersed by brutal but realistic fight scenes. The tension is kept up by some good storytelling without you having to think too hard. Definitely worth a watch and will have me curious to see if Mr. Adkins and co can reproduce it again, maybe next time with a few more twists.","user":"kme-194-438558","rank":[38,43]},{"title":"Superb British gangster movie from Scott freaking Adkins","rating":9,"date":"27 May 2019","review":"Out of all the movies Scott Adkins has done in 2019 for me Avengement takes the cake as the best one so far and it also another reason why I think he needs to stick with director Jesse V. Johnson and writer Stu Mall as long as possible in the low budget action movie scene. I heard many people on the Internet praise the hell out of Scott for delivering the best performance of his life in the role of Cain Burgess an escaped convict on the way to return all the disgusting stuff his life throws at him and they were right because I hope he keeps testing his acting range like this because Avengement is one hard-ass movie with some of the bloodiest action scene I saw from Scott since Universal Soldier: Day of Reckoning. Seriously I love watching Scott chew the hell out of every scenery he in and once the movie got to the climax fight it even more beautiful than I thought but one tiny thing that holds back the movie from perfection is how Cain let that Bez chick alive after what she did to him","user":"phanthinga","rank":[65,80]}]