[{"title":"An interesting concept, but the central figure was appallingly handled.","rating":3,"date":"16 October 2019","review":"This move has some interesting elements, but there were some very poor decisions made in the writing.<br><br>The movie is largely a one woman show for Anna Schlegel, and she carries off the part wonderfully.<br><br>However, and this a big however, the character she plays is at her core a largely unpleasant character. At 36 years of age she is a real woman-child, intensely focused on herself and largely oblivious to the needs of those her around. While I wanted to like her, partly because large ladies are rarely given such prominence in the media, I really struggled to connect to her. She is aggresively belligerent, she yells conversations, she's emotionally entitled, she makes a vast range of frankly stupid life choices and seems to have no idea what people other than her want in the world. There is zero personal arc in this movie either, she ends it the same person she starts it as, this is just Chapter 174 in her miserable life.<br><br>In one scene she cries like a baby, she spits out the sandwich she was eating and lets it rest on her shoulder while she cries and cries. I get that she's probably deeply sad, but this movie finds no way of showing you how or why or what about the sadness. It justs plain self pity. Somewhere in here they could have made me care, cos I wanted to, but I just didnt.<br><br>If one of my buddies went out with Jodie (and the move is all about Jodies need for a partner to solve all her problems) I would advise him with all the vigour I have about the massive red flags she waves at full mast. She does have one brief encounter in the movie and very wisely the man heads for the hills the first chance he gets. It was a smart move, nothing convinces me that he would have been sensible to pursue this. Her interaction in a partnership would be emotionally greedy and intensely juvenile in nature. What, didnt look at your phone for 30mins and answer her 5 texts? Well theres gonna be a screaming match the moment you see her next.<br><br>She just isnt worth it, the movie shows us that, all relationships require a certain quid-pro-quo to work, she would be all quo and no pro (yeah yeah.. i know, but you get the point).<br><br>So ultimately, what was the point the writer was trying to make?<br><br>That unpleasant and unappealing personalities deserve love? Cos once you reach adulthood they dont, no one really 'deserves' it, you earn it in some way.<br><br>And I struggled to see how poor Jodie could earn it.<br><br>Interesting idea, interesting filming, very poorly executed in my opinion.<br><br>Its like the insult Pig Hag was taken literally by the people writing about her. Which is sad.","user":"paulhfromthedeep","rank":[18,22]},{"title":"Are you all blind?!","rating":1,"date":"16 March 2019","review":"The film has no storyline. My friends and I saw this at SXSW and we left the theater feeling like it was a massive waste of time when we could be enjoying other things.\nAllow me to explain my distain. In the film the main character is no more than a whiny and needy child with no morals and a talent for pushing everyone away. The character doesn't really have an arc and stays rather stagnant throughout the course of the film. Although she's the main character of the writers seem to make her character an afterthought. What was the point of the whole Guns N' Roses thing other than to introduce a romantic interest only to have him scared off by the main characters clinginess and general insanity? What was the point of having all of the freaking text messages from no one?<br><br>On a technical side note: the sound was off when she was going through her epic freak out. It when from a full sound to her voice echoing. And the sound of the condom wrappers sounded like half full bags of chips at times.","user":"kenleighwatkinsfilmcreative","rank":[39,56]},{"title":"Refreshinging unpleasant","rating":9,"date":"10 March 2020","review":"I liked this movie a lot because it was raw and real and didn't gloss over a painful life. It tells is own story and does not follow the usual Hollywood formula for a movie.<br><br>The main character is clearly disturbed and is quite unpleasant, but she has her moments of likeability. But I could feel her sadness and desperation. It was really interesting to me to see a female character like her in a movie like this.<br><br>I have been thinking about it a lot since I watched it and found it worth watching. I am glad I watched it alone. I don't think it is everyone's cup of tea.","user":"bredaoreilly","rank":[6,7]}]