[{"title":"Pokémon Mewtwo Strikes Back Evolution ironically clones the original to create an inferior remake.","rating":4,"date":"1 March 2020","review":"\"Where am I? What am I? Who am I?\". Existential conundrums that plague Mewtwo's, the most powerful Pokémon in existence (at that time...), telepathic mind. Facing an identity crisis as he produces copies of beloved Pokémon in an attempt to create a superior race unbounded by the restraints of human training. No Pokéball prison. A cruel irony that was beset upon Yuyama, the director of the original and, on a personal note, beloved anime feature of the franchise. His return to this similar shot-for-shot CGI remake begs the fundamental question. Why?<br><br>The criticism that Favreau's last year's identical remake of 'The Lion King' received can instantly be applied here. Emotionless 3D character models unable to express visible emotive responses, relinquishing all personality that emanated from the hand-drawn animation. Ash, in particular, resembled an empty shell, resulting in the infamous final tear-jerking scene to be nothing more than vacuous void. Due to the personal attachment for the original, Yuyama and his team were constantly at battle with my nostalgia. Slight differences in the script and character actions consequently inserted a yearning to watch the original instead. Team Rocket's English dub? No! That is not James! Not my James. My ears were bleeding! The dialogue was surprisingly more basic, feeding every plot detail with excessive explanations that the visual commentary already provided. Having said that, the upgraded animation style levelled up the smaller details. Pokémon models looked exceptional, especially Vulpix, with appropriate scaling and textures. Effects such as weathering and raging waters were some of the best examples within animation.<br><br>Objectively speaking, it was beautiful. But why? The argument that this remake will introduce the original story to a new audience is futile, considering the anime style has rarely aged. If anything, it's manipulating nostalgia for some easy yen. Doesn't work for me. Mewtwo should've asked himself \"why am I doing this again?\"...press B to cancel!","user":"TheMovieDiorama","rank":[11,12]},{"title":"Original will always be the better one","rating":5,"date":"27 February 2020","review":"I'm going to list my pro's and cons of this movie, but to summarise my opinion: This movie has a few good new scenes, but other than that, its quite average and fails in a few places too.\nAlso, before we move on I should let you know, before I saw this movie, I had decided to watch the original movie, so the pro's and cons will be based on the differences, anyway, lets start with the Pro's:\nPros:\n. The scenery looks beautiful\n. Vulpix gets some more screentime\n. Golem being replaced by Drowzee\n. Miranda's redesign\n. Charizard's anger at Dragonite\n. Misty's reaction to Fergus's Water Types\n. Mew\n. Seeing Wingull in the credits and Misty reacting to it\nAnd now for the cons:\n. The expressions, they have really freaky smiles\n. The way Ash &amp; Brock run\n. Brock is really creepy in this movie, and they even add a creepy scene of him flirting with Neesha\n. Raymond's redesign\n. Giovanni's suit\n. The song \"Brother\" not playing in the background, that scene felt very off for me\n. Its weird hearing the modern dub voices compared to the 4Kids dub, I did get used to it, but I had a hard time getting used to Misty's voice\n. Some of the charm &amp; humor feels like its missing, also, its weird listening to the fixed errors in this movie compared to the original, I'm so used to Meowth calling Sandslash, Sandshrew and Team Rocket calling Scyther, Alakazam\nOther Notes (these don't really affect my score of the movie):\n. Also, its not really a bad thing, but I did notice that Magneton &amp; Alakazam were cut, while Alakazam is understandable due to that stupid lawsuit, Magneton is the confusing one\n. As much as I would of loved to have the 4Kids dub return, I understand why as one of the actresses from then, Maddie Blaustein (who voiced Meowth) has since passed away in 2008","user":"wackohoward","rank":[24,31]},{"title":"Reliving my childhood!","rating":8,"date":"28 February 2020","review":"Was this a necessary remake? No. Was it enjoyable? Yes. Did I watch it with a smile on my face? Absolutely.<br><br>It stays true to the original Mewtwo Strikes Back from my early childhood, which I remember going to see in the cinema when I was about five. While not really deviating from the original story, there are extra bits that weave in beautifully and pad out the movie a little, giving it a fresh feel.\nThe animation isn't amazing but it isn't bad either. It is what it is. Either way I'm reliving a childhood favourite of mine, and I'd recommend that any Pokemon fans at least give this one watch!","user":"opheliac306","rank":[16,20]}]