[{"title":"This is made for Television Greatness","rating":6,"date":"23 March 2019","review":"Before you go any further, make sure you read all the other reviews, because it's all true. This movie was made for people like me. It's friday evening, open some beers, eat some cheesy poofs, and BANG! This makes for entertainment, either way, too. Weather or not it's good or bad. I watch movies to be entertained, and this entertains. Sy Fy makes watching television entertaining sometimes I guess.","user":"lorddrewsus","rank":[6,6]},{"title":"Not a bad ride","rating":5,"date":"14 November 2019","review":"This had a fair amount of atmosphere for the first hour and was well crafted with the budget. Reviews  are very skewed and unfair these days with people rating this a 1 which means it is the worst movie you have ever seen...really?<br><br>No to be fair this is at least a 5/10 as I always try and base my reviews on the acting and budget as well as all the other things that make up a movie and to be fair the acting was not that bad and the atmosphere, model ship and wave effects were pretty convincing apart from when they were actually on the ship and it was obvious someone was spraying with a hose lol but that is something one should be used to with low budget horror films and unlike most Scifi channel productions this one comes out on top of the usual dross.<br><br>The only part where it was let down was with the creature itself although i did like the use of THE STRAIN wispy tendril effects used on many other movies like THE SAND and other horrors as it does have a rather sinister and scary vibe going on. It fails mostly on the lack of tension towards the last half of the film and like most low budgeters these days it seems to run out of steam mid way to the end.<br><br>All in all a decent nights viewing and much better than most of the nonsense I have watched lately so gets a fair slightly above average 5.5/10 from me!","user":"omendata","rank":[5,5]},{"title":"A crew of women stuck on the high seas with some... thing","rating":5,"date":"28 October 2018","review":"An icebreaker vessel in the far Pacific with an all-female crew rescue a stranger from the ocean and are then forced to fight for their lives against an unknown enemy while a massive storm looms.<br><br>\"Dead in the Water\" (2018) is a TV thriller/horror that combines \"Dead Calm\" (1989) with \"Alien/Aliens\" (1979/1986) and maybe a little bit o' \"Ghost Ship\" (2002). While it's not as good as any of those flicks, it's not bad. The movie was shot on an actual vessel, a small one, but the surrounding sea is cartoonish CGI and it's too obvious.<br><br>If you can get past that, the actresses are all convincing and the script builds some suspense as the truth about what's really going on is slowly unveiled. I liked the tie-in to the Marianas Trench, the deepest natural point in the world located in the Western Pacific, and the F/X concerning the corresponding component (I'm trying to be vague) are quite good, unlike the fake-looking waters around the ship.<br><br>To be expected in a situation like this, none of the women are made out to be alluring sirens. It's a research vessel amidst a storm and they're all appareled with work clothes. Nevertheless, they're a diverse group with most of them being appealing, one way or another. My favorite is Sparks (Christia Visser).<br><br>The movie runs 1 hour, 30 minutes. REST OF CAST: Nikohl Boosheri (Dana), Nicole Fortuin (Kat), Bianca Simone Mannie (Gwen), Skye Russell (Rusty), Tanya van Graan (Erika), Amy Louise Wilson (Michelle) and Brandon Auret (Stranger).<br><br>GRADE: C+/B-","user":"Wuchakk","rank":[17,24]}]