[{"title":"Any Pets?","rating":5,"date":"1 April 2019","review":"This is an anthology of horror shorts, most of which have an ironic or comic element to them. The episodes all give the location and date of the event to add an element of realism. Not much in gore, some have a little blood. Most of the horror is simply jump scares. The twins on the cover are not in the film. The clown and the babysitter were done before in an anthology. I thought I was watching something I had seen before under a different title. I was hoping for a connecting item, but there was none.<br><br>Guide: F-word. No sex or nudity.","user":"nogodnomasters","rank":[2,2]},{"title":"Liked the first this was not a horror movie","rating":3,"date":"20 July 2019","review":"First story mildly entertaining slightly scary. Second story rehashed urban myth done a million times before. Third story was the only time in history a child suicide on film seems justified because of a horrible mother not saying an actual child should ever kill them selves but I would understand why these fictional kids would and that was the end of me watching this absolutely not scary not entertaining pice of crap","user":"berg-74532","rank":[1,1]},{"title":"Even more boring things...","rating":2,"date":"29 June 2019","review":"Just when you think that the 2017 \"Strange Events\" was bad, then 2 years later comes \"Strange Events 2\".<br><br>Indeed, I wasn't impressed with the 2017 movie \"Strange Events\", so why did I bother to sit down and watch the 2019 \"Strange Events 2\"? Well, solely because I was given the chance, and also because I believe in watching anything at least once - or at the very least give it a chance.<br><br>And I gave \"Strange Events 2\" a chance, I honestly did. I managed to endure 23 staggering minutes of pure self-inflicted torture before I gave up on this tedious pile of boredom. Actually, they ought to have changed the name to \"Boring Things\" already.<br><br>This was so unfathomably unappealing and lacked anything that would even resemble having anything interesting to offer.<br><br>I have absolutely zero interest in returning to watch the rest of \"Strange Events 2\", because I was bored out of my mind with the 23 minutes that I managed to suffer through.<br><br>But hey, on the upside, if you have problems sleeping, then \"Strange Events 2\" might just be the solution to your sleeping problems...","user":"paul_haakonsen","rank":[0,0]}]