[{"title":"THIS PART ruined Pup Star!!!","rating":1,"date":"30 July 2019","review":"I love the first 3 parts. But this...is Completely bad to be honest","user":"antibaa","rank":[2,2]},{"title":"Last Resort Holiday Flick","rating":5,"date":"15 December 2019","review":"This is not a good movie. But that doesn't mean you shouldn't watch. If you've exhausted the classics and already seen this years crop of streamable Christmas flicks then it may be worth a view. It's a talking dog movie. You know the drill. No surprises here. Pretty cool special effects depicting Iceland's Northern Lights, a train, Santa's Sled as well as a \"Best Christmas \" song/dance scene. Would have been really good at 45 minutes. Dragged. But if your family's getting desperate for a \"Christmas\" movie, it may be worth a shot.","user":"bobbyd61074","rank":[1,1]},{"title":"Touching Delivery of a Very Special Message About The Meaning of Christmas","rating":10,"date":"23 November 2018","review":"\"It is Christmas in the heart, that puts Christmas in the air!\" once said W.T Ellis. Jingle bells, Jingle bells, Jingle all the way. Yup, it's Christmas time - presents, cookies, family and vacation time. This astonishing, touching, intriguing, heart-warming, well-intentioned and adorable movie is directed by Robert Vince and written by Pier Rae and Robert Vince.<br><br>This film follows Tiny and P.U.P whose four new pups take a trip into the dark night sky with a special guest named Santa Claus. Trouble comes with they find themselves with the evil dog Bark and trapped at the North Pole. The pups get saved, but you'll have to see the movie to know how. This song-filled new Air Bud \"Pup Star\" movie will have you enjoying the Christmas spirit.<br><br>The lead characters in this film are Tiny (voiced by Kaitlyn Maher), P.U.P (voiced by Mackenzie Sol), Lou (Mackenzie Moss), Santa Claus (Richard Riehle), Rosie (voiced by Vivienne Rutherford) and complimented by many more<br><br>My absolute favorite part of this film, without giving anything away, is when the Christmas spirit is saved. I love how the four pups set on a quest to find Santa Claus and recover the true meaning of Christmas with the help of their family. I think this part of the film will charm many because of the huge heart the little pups have!<br><br>This film delivers a very special message. It's not about the gifts; it is about being with family. The pups show that meaning in this film. This touching movie will have you singing Christmas songs on your way to school, work and perhaps your Christmas recital.<br><br>I give this film a 5 out of 5 stars and recommend it for ages 7 to 14, as well as adults. This film will release exclusively on NETFLIX on November 20, 2018. Make sure to check it out!<br><br>Reviewed by Nathalia J., KIDS FIRST! Film Critic. For more reviews of kid and family friendly films, visit kidsfirst dot org.","user":"rannynm","rank":[1,4]}]