[{"title":"Its a play","rating":2,"date":"19 January 2020","review":"It's told in the style of a play. Feels cheaply done, the acting is fine...but the format I feel is awful. Maybe it's an attempt at more art than film making, but I couldn't get into it at all. I like film that makes you think and I felt this movie thought it was way smarter than it really was, which ends up looking bad...<br><br>This is a big time niche film, it's only going to appeal to a VERY select few.","user":"mvike","rank":[3,3]},{"title":"An insider's view.","rating":10,"date":"17 December 2019","review":"First of all, I must declare an interest, as I am in this movie, so obviously I am very partial; but that doesn't mean to say that I have nothing useful to say about it.\nHere goes:\nIf you judge this film against the standards of the usual product of Hollywood or Netflicks, etc., it has to be admitted that it looks odd by comparison. But then this is not your average movie: not by any means. It has a narrative - two if you count the framing story where Steven Berkoff as Dr Goodfellow tells the story of Faust to the artificial man Homunculus - and it encompasses the whole arc of Goethe's massive two part play version. But it is scrunched down to emblematic mini-scenes. Why? Because the progenitor of this film, Philipp Humm, is a painter/sculptor, and his sensibility is primarily visual, so, as in his static art, he is trying to convey his vision in condensed visual form.\nThat is not to say that we have some kind of dull animated tableaux here. There are two things that principally keep this film alive and kicking. The first is the sheer fertility of Philipp Humm's imagination. It is hard to keep up with the wealth and variety of the imagery on display here, and the layered meanings that that are intended. You have to watch it expecting to be challenged.\nThe second enlivening thing is the humour. It is ironic and bone-dry. If, watching it, you find yourself thinking: \"Is that meant to be funny\", the answer will always be yes.\nYet it can also be harrowing. There is, yes, a Brechtian thing going on here. You are meant to examine and interpret and judge. Does it matter that when Faust and Mephisto fly (which was uncomfortable but fun, by the way) you can see the strings? It was intended all along. I was present when it was discussed. Why? Well, if God exists, and he appears as a character here, aren't we all puppets?\nAnd, once you get the hang of it, it is quite easy to work out what s being said here. The sun as a a naked breast? An incidental comment on society's ongoing fetishising of breasts. The devil as a hedge-fund manager? The \"root of all evil\" laid bare.\nPhilipp has said he wants to \"democratise\" Goethe, so he wants his references easily accessible, and they are. It is a glorious game for him. He has hijacked Goethe, perhaps, but out of love for him and belief in what he has to say, and so has offered this new view as if through a kaleidoscope.\nAs for me, I had a blast making it, and it will always be an experience that I look back on with pleasure.\nOne other thing: mad as this film may seem, Philipp Humm is very far from the stereotype of the crazy artist. He is quiet, humane, modest and very sane. So, like it or not, there is nothing accidental here. Take this film on its own terms, if you care to take it at all. And it is intended as a warning, so it is worth listening to for that alone.","user":"glyndilley","rank":[3,3]},{"title":"A total artwork","rating":8,"date":"15 December 2019","review":"Besides the exceptional acting of Steven Berkoff and Glyn Dilley, the coherence to Goethe's Faust, the quality of the image and sound, the merge of postmodern and classical were pretty impressive.\nEqually intriguing was the political cue, especially in the scene with the video walls showing news of all around the world. The discussion -which was indeed a self-reference- and the tense between utopia and dystopia combined to this political aspect, opens a new interpretation on faustian intertextuality.\nIn addition, the idea of setting the scenes theatrically like vivid artworks indicates successfully P. Humm's personal style and artwork and at the same time manages to show an achronical presence in faustian intertext, which differentiates this particular movie in both its point of view and its directing.\nMaybe this movie addresses more to an audience familiar to the book or to scholars but it could be an example of how we can see a complex text nowadays.","user":"neni90","rank":[2,2]}]