[{"title":"AVOID!!!!!!!!","rating":1,"date":"28 September 2019","review":"The acting in this film is awful, it's like everyone is reading from teleprompter. The \"main\" woman in it has had so much botox you can't actually tell what emotion she's supposed to be having, and her acting is that bad it's anyones guess. Avoid!!!!","user":"thadunno","rank":[77,85]},{"title":"Subpar Action Movie Riddled With Clichés","rating":4,"date":"28 September 2019","review":"The only reason I gave this movie a chance is because I insist on seeing every movie with Bruce Willis. Love most of this work. But this is one he clearly did for the paycheck, because he put no effort into this role and had a total of maybe 10 minutes of screen time. Just a big name meant to pull in poor saps like me.<br><br>There is nothing original or inspiring about this C-movie action flick. Michael Chiklis plays a veteran bank robber who in the opening minutes of a \"perfectly planned\" heist gone wrong, gets knocked to the ground. When he awakens 10 minutes later (with no bruising to account for the head trauma), the loot is gone and his brother is dead. The rest of the movie is him trying to figure out how it all went wrong.<br><br>The dialogue is probably the worst thing about this movie. Wooden, unoriginal, poorly written, will make you laugh out loud at the \"serious\" parts. Second worst is Meadow Williams, whose utter lack of acting talent is exacerbated by the amount of botox in her forehead, the combination of which makes her utterly incapable of expressing any emotion convincingly whatsoever. The choice of Lydia Hull as the badass fixer-upper/cleaner was equally poor casting, though thankfully she's barely in the movie.<br><br>And then all the cliches. Guys with machine guns who couldn't hit the ground if they tried, shooting guns with one hand, walking toward the camera in sunglasses in slow motion with an explosion behind you, the \"surprise\" villain at the end monologuing and providing exposition for the viewers who fell asleep for the first 80 minutes. As for the \"plot twist\" reveal of the villain, it would have been surprising had I not been able to call it about 15 minutes into the movie.<br><br>This is a good movie to have on in the background while you're doing other things. If you lower your expectations to ground level, you will be barely disappointed.","user":"maximusthemerciful","rank":[55,64]},{"title":"Oh Bruce...what happened?","rating":1,"date":"29 September 2019","review":"I am not sure what was going through the mind of Bruce Willis when he agreed to do this film, but I know one thing that wasn't: acting. Stumbling through his lines with a smirk that seemed to say \"he he they are actually paying me for this...and paying me a LOT\"<br><br>Perhaps he only gave them one day so there was no time to rehearse or perhaps he could not take the horribly conceived story seriously enough to do the job right, but either way, it may well be the worst performance of his career.<br><br>All the blame cannot go to Bruce alone, the other actors were equally unprepared and with the possible exception of performance of Michael Chiklis, the whole disaster resembled a poorly directed high school play. Even the props were ridiculous, like a single old desktop computer on a shelf running the whole security system for a bank, and a five and dime tin cash box that \"is no good without the key\"...come on.<br><br>The weakness surely started with a sophomoric script most probably written by a first year film school student or maybe a grammar school kid without an imagination.<br><br>The filmography was much better than the acting, dialog or the plot, so there is that, but if this is what qualifies as a Bruce Willis film today, then it is a sad day for the action movie genre.","user":"julian-640-544058","rank":[38,44]}]