[{"title":"Well acted, hilarious n brutal at times. Well, a pen is indeed mightier than the sword.","rating":7,"date":"15 March 2020","review":"A musician from Beverly Hills receives a letter from his estranged father asking him to come and visit him in his secluded cabin overlooking a lake n surrounded by woods.\nAs audience we suspect that something is not right after the phone calls, but trust me the film is not at all predictable. It is very hilarious n well acted. Elijah Wood gave a good performance and Michael Smiley is hilarious with his ultimate weapons, a pen n a crossbow.\nThe film is a bit slow in the beginning but picks up n then doesn't let go. I was laughing my guts out.\nI didn't like the director's Greasy Strangler. Found it gross n offensive. But this movie is less gross n more comedic.","user":"Fella_shibby","rank":[33,39]},{"title":"Incredibly Strange","rating":9,"date":"10 August 2019","review":"(The Wellington premiere with Ant Timpson and Emma Slade giving Q&amp;A)<br><br>O.M.G. That was, as expected, an Incredibly Strange movie. (Ant Timpson is best known in New Zealand for the Incredibly Strange film festival, which began in 1994 with the likes of Plan Nine from Outer Space.)<br><br>Elijah Wood's character, Norval, is aptly named. He is an innocent nerd, called to visit his estranged-since-childhood father at a remote and beauiful house on the shore of Vancouver Island. The father (Stephen McHattie) is creepy from the get-go (think Jack Nicholson in The Shining). I'll say no more but nothing is as it seems and the movie is a roller coaster ride of extreme tension and release, extreme violence, and a generous slab of (black, of course) comedy. Just suspend your belief enough to erase the words \"We've got to get you to hospital\" from your memory.<br><br>I didn't stay for all the Q&amp;A because they talked at length about technical details, but Timson based the movie on his own experience with the death of his father, which was Pretty Strange.<br><br>It'll never be a blockbuster, but it'll be a cult favourite for years to come.","user":"Shuggy","rank":[47,73]},{"title":"Disturbingly Funny","rating":8,"date":"26 July 2019","review":"What a Directorial Debut from our own Ant Timpson! Dark, irreverent, downright laugh out loud hilarious and some superb characterisation.<br><br>What starts innocently enough, takes twisted turn after twisted turn in a journey that had me enthralled after a steady opening.<br><br>This film certainly left an impression. Elijah Wood perfectly cast and Michael Smiley, one of my favourite actor's (The Lobster) almost unrecognisable and with some of the most hilarious dialogue I've ever heard.<br><br>This will create conversation for sure and I hope Timpson enjoys the success this film deserves. Just a shame it wasn't shot on these shores.<br><br>Can't wait for feature Director credit number two, Mr T.","user":"oconnors2nz","rank":[41,66]}]