[{"title":"Pleasantly Surprised...","rating":8,"date":"13 April 2019","review":"Guava Island could have been a lavish vanity project. Instead it's a little movie with a big heart. Full of musicality, beautiful locations, cinematography and people. Charming performances and a message to boot. It's also old school in the best possible way. Don't miss it! 8/10","user":"KingKongKyle","rank":[63,86]},{"title":"Perhaps it's a movie, a music video, a short film, a commercial, an art-piece or some sort of visual album. Undeniably, it's an experiment.","rating":6,"date":"16 April 2019","review":"In some ways, 'Guava Island (2019)' is a feature film, albeit a very short one. In other, arguably more, ways, it simply isn't. Trying to categorise this surprise release is no easy task. It straddles the line between movie, music video, short film, commercial, art-piece, visual album and parable. Essentially, it's all of these things. Undeniably, it's a bit of an experiment. It's also, no matter which way you cut it, a story. This is a relief, regardless of the narrative's simplicity, because it allows the piece to pretty much fly by, telling a tale that actually feels quite purposeful, if well-worn, in the process. It's framed as a mother's story, which is fitting considering its fleeting and somewhat 'faded' nature, and it certainly plays out more as a kind of 'moral' than anything else. It isn't ineffective but it is, as I mentioned, rather broad, culminating in a bitter-sweet finale that doesn't necessarily hold up to all that much scrutiny. There isn't all that much emotional resonance, either. The bare-bones beats hold weight, of course, and there is some threat that causes adequate tension, but the piece seems to try every check-list trick in the book to get your tear-ducts working to no real result. Some of the themes are quite powerful but they hit the head more than the heart, which is fine but doesn't feel intentional and makes for quite cold viewing. It does feel like Glover wants to say something with this. Its actual construction is a bit bizarre, as it bounces from being a fairly serious drama to an incredibly off-beat musical from scene to scene. This causes a lack of cohesion, as does the choice to often layer the actual Gambino songs, non-diegetically, above the lead character's diegetic singing - which creates a seriously strange effect that I can't quite explain. It's also slightly strange that the music is, from what I could tell, exclusively pre-existing Gambino, but I guess that just adds to the affair's overall intangible nature. In any case, when 'This Is America' starts playing it's very distracting. Despite all this, the flick does exude a rather strong sense of atmosphere and conveys a decent amount of character, too. It isn't groundbreaking, though: the story isn't great and I wouldn't even say it's the best way to listen to the music. Still, it's an interesting quirk that's fun enough while it lasts. 6/10","user":"Pjtaylor-96-138044","rank":[29,39]},{"title":"Guava Island's narrative style is a copy of the film \"The God of Small Things (2017).\"","rating":5,"date":"26 August 2019","review":"Guava Island's (2019) narrative style is a copy of the film \"The God of Small Things (2017).\" The film's duration, aspect ratio, editing style, cinematography is almost exactly the same except the story of Guava Island is really weak compared to strong plot and visuals of \"The God of Small Things\". The scene where the music festival takes place and followed by later scenes are almost exactly the same. Both films are available on Prime. One should watch them both and judge on their own.","user":"Paglababa20","rank":[10,13]}]