[{"title":"Sweet, slow emotional movie","rating":8,"date":"2 November 2019","review":"Basically about father and son but this isn't apparent from start. Made me cry a bit. It is slowly revolving, building the character of a lost soul, good hearted ex convict Russ. He is trying to find something to hold, to anchor his life to. It is also movie about injustice of the system and life. Probably not for everyone to watch but if you know feeling of being lost and lonesome, feeling of being disconnected from parents, work and hyper motivated world then...","user":"pancolart","rank":[38,44]},{"title":"A melancholic and endearing film.","rating":8,"date":"3 November 2019","review":"When you commit a third violent crime,\nyou will be put away and put away for good.\nThree strikes and you are out.<br><br>Every now and then you come across such an unknown, idiosyncratic film, which was probably made with a modest budget and for which no huge marketing budgets have been made available. A film you don't really expect too much from. That's \"Adopt a Highway\". It's not a cheerful or action-rich film. I really expected a depressing drama. And even though there's a moving moral in it, you can say there's also another hidden message in this film. A message of hope, compassion, and modesty.<br><br>The introduction shows how Russell Millings (Ethan Hawke) leaves prison after being imprisoned for 21 years. Reluctantly. Somewhat anxious and timid. A man who's alienated from society and who struggles to keep up with the contemporary pace. Someone who has never used a mobile phone, the internet or e-mail. And all thanks to a short-sighted policy in which someone is sentenced to a heavy sentence when he gets involved in something for the third time. No matter how small the criminal offense is. The so-called \"three strikes\" legislation. In Russell's case, it is about owning a few grams of marijuana in the state of California. Something that has become virtually legal after those 21 years. An unreasonable punishment that ensured that he wasn't given the opportunity to develop into a decent citizen.<br><br>Ethan Hawke probably demonstrates his best acting performance here. The way he plays Russell is simply breathtaking. He's in the spotlight almost constantly. And his clumsy way of conversing and interacting with others is simply sad and pitiful. It's not clear whether Russell used to be mentally deficient from a young age already or if he got numb from the years of imprisonment. In any case, he's treated by the official authorities as insignificant and is left to himself a bit. He tries to live an honest life and tries to avoid following the wrong path again. A simple life where he earns a living as a dishwasher in a fast-food chain and sleeps in a motel. Until he discovers the adorable Ella (Savannah Sucher) in a garbage container.<br><br>Even though from the outset he realizes that it's almost impossible for him to take care of a baby, he still hesitates to hand over the lovely baby to the authorities. What follows are touching moments that he experiences with the few-month-old Ella. His ignorance about taking care of a baby and the sense of responsibility that he suddenly experiences, take away the attention of the depressing life that he led until then. Even though Ella's discovery brings a turning point in Russell's life, this wasn't the central theme for me. This helpless and innocent little girl shows gratitude in a spontaneous way. No disinterest, impatience or incomprehension as adults treat him. The most emotional scene is the one on the beach where Russell tells a part of his life story.<br><br>\"Adopt a Highway\" is a melancholic and endearing film that will touch a sensitive nerve with many viewers. Well, in my case it did. Some will call it a corny ending. I thought it was a logical conclusion. An example of humanity. It's also a film about getting a second chance in life. I was surprised by the Blumhouse logo and I already assumed that this would be a very sinister movie. That's certainly not the case. The explanation for the Blumhouse connection lies with the director Logan Marshall-Green who appeared last year in the Blumhouse production \"Upgrade\". \"Adopt a Highway\" is, therefore, his debut as a director. And as far as I'm concerned he can certainly direct such a gem again. I'm ready for it.","user":"peterp-450-298716","rank":[28,33]},{"title":"Loved it :)","rating":9,"date":"4 November 2019","review":"Great acting of Ethan Hawke ! Like always haha, Movie is very touching &amp; I understand it's stressfull that this character his \"slow\" but I think we can see here how 20 years in prison (and for a minor crime) can break someone.","user":"julienm-78705","rank":[22,27]}]