[{"title":"Harsh Realities of NCAA","rating":10,"date":"28 October 2018","review":"This documentary should be a requirement for everyone entering the NCAA. It sheds light on the harsh realities many college athletes face and exposes the industry's practices that perpetuate a cycle of poverty for those that pursue this dream. Excellent job!!!!","user":"anderson-nelson1","rank":[7,8]},{"title":"The Real Stuff That Dreams Are Made Of","rating":8,"date":"16 March 2019","review":"This a very disturbing indictment of the values of the NCAA, our vaunted institutions of higher learning and, by extension, our values as a nation as we watch the cynical mining of raw athletic talent in underprivileged, low income communities populated primarily by minorities (in this case African American) using the not-so-subtle carrot and stick of success in professional sports. What young athlete coming from these depressed places doesn't dream of professional sports as a career where it is revealed that 56% and 66% of players in the NFL and NBA are African American? What these young men (primarily) aren't reminded of is that only approximately 3% of undergraduates at any of these institutions are African American and only .003% of players are drafted by professional teams, let alone make the cut. It's made quite clear that their primary purpose in being on campus is to enrich that particular university's profile and bottom line. If the individual's performance is sub-par, is injured or is in violation of one of the NCAA's myriad self-serving rules then the Exit door appears quickly and decisively in favor of the next recruit to fill the slot. It's a shameful waste of the aspirations of youth. These Universities are making millions upon millions of dollars on the backs of these athletes. They hire (recruit, train and play) and fire, or un-subsidize, through injury, sub-par performance or self-serving rule violation at will. They should pay these kids as in any employer/employee enterprise.","user":"rebinger-1","rank":[3,4]},{"title":"Decent watch, pointless argument","rating":7,"date":"4 October 2018","review":"These athletes expect to get paid while they go to school? Free tuition to prestigious schools that most of them probably wouldn't get into academically isn't enough? The rest of us need to do internships and fellowships, but they want to get paid for basically going through the same thing?","user":"kevinjwang","rank":[5,32]}]