[{"title":"Not really worth the effort...","rating":3,"date":"17 August 2019","review":"Right, well let's me just start out by saying that \"The Witches of Dumpling Farm\" wasn't exactly what I had hoped it would be. I sat down to watch this 2019 movie from writers Mark Pickering and Martin J Pickering with the understanding that this was going to be a horror movie.<br><br>While \"The Witches of Dumpling Farm\" did have some horror elements to it, it was quite far from being an actual scary horror movie. Quite far indeed.<br><br>This is not a very long movie, but it felt like I was sitting through a 3 hour long movie. Why? Well, because the pacing of the storyline was just atrociously slow. It took forever to go from A to B, and very little of any interest happened along the way.<br><br>Most of the movie was just close ups of people looking at each other awkwardly, and it felt like 90% of the movie was just filler to make it become a feature length movie.<br><br>The storyline was too simplistic to provide proper entertainment, and there weren't any surprises along the way. It was just a straight forward monotonous ride.<br><br>The acting in the movie was adequate, taking into consideration the extreme limitations that was enforced on the actors and actresses in terms of a lousy script and storyline, and having essentially pointless characters to work with.<br><br>All in all, \"The Witches of Dumpling Farm\" wasn't a particularly entertaining or enjoyable movie, nor was it a particularly memorable movie. I managed to sit through it, but was hard pressed to keeping my focus, and I will never return to watch it a second time around.<br><br>My rating of \"The Witches of Dumpling Farm\" is a mere three out of ten stars.","user":"paul_haakonsen","rank":[13,14]},{"title":"I got a surprise for you","rating":3,"date":"18 August 2019","review":"Mark (Duncan Casey) gets tossed out by his wife for an affair. He now lives with Ian (Justin Marosa) on Dumpling Farm. Here they throw a party or rather have a festival. Mark has been suffering from nightmares which now come true. The paper is filled with stories of local sinkholes and screams.<br><br>The film is low budget. I liked the props. I wasn't keen on the soundtrack. The production had a lot of filler material such as the festival and wondering in the cavern scenes. This film could have been better utilized as background material and character build.<br><br>It is odd when running in the forest, the witches can't catch up to Mark. But can catch up to him in a speeding car.<br><br>Guide: F-word. sex?. No nudity.","user":"nogodnomasters","rank":[9,10]},{"title":"One of the biggest piles of ---- out there...","rating":2,"date":"17 August 2019","review":"One of the biggest piles of ---- out there...\nThe effects are laughable ,at one point thrown on the ground thorn out hand was bouncing up and down,clearly cheapest Halloween prop...the rest is not much better.If you want to learn,how not to make horror films,please,watch it.\nGave it a 2 just for some atmospheric camera angles...Who the hell paying to produce this refuse???","user":"tchitouniaram","rank":[12,16]}]