[{"title":"A societal phenomenon","rating":6,"date":"12 May 2019","review":"An agnostic review of a rather well-done documentary about a societal phenomenon: Lourdes, in southern France, is a catholic pilgrimage center since the apparitions of 1858, with Bernadette Soubirou who declared to have attended eighteen appearances of a woman posing as the Immaculate Conception. Thus, each year, Lourdes welcomes six million pilgrims or visitors from all over the world.<br><br>In this documentary, there is suffering, direct or indirect. But also faith and hope. A lot of hope! Even after ten or even fifteen journeys in Lourdes. Not to mention the manifold encounters between these people. This documentary is very factual and, in a way, commemorates the 70th miracle, according to the International Medical Committee of Lourdes.","user":"FrenchEddieFelson","rank":[19,23]},{"title":"A profound mystery","rating":10,"date":"1 January 2020","review":"A profound meditation on faith and suffering that takes you behind the scenes at Lourdes to witness the process of carring for the many ill and diisabled who come to Lourdes, hoping to be cured. The film itself does not take a position on the veracity of cures reported, it simply shows you a long line of suffering beings and the complicated procedures the many nurses and workers must go through to care for the sick - procedures that are quite complicated when it comes to bathing the sick, caring for their bathroom needs (and accidents), transporting them to the grotto and the processions. If there is a mracle of faith here it lies partly in the great dedication of these workers, who number in the hundreds. The filmmakers have chosen to focus on four parrtiular individuals and their life stories, as a way of personalizing the throng of thousands who come to Lourdes. Deeply moving film that surprised me by this look behind the scenes at Lourdes. There is so much that we healthy individuals take for granted. The faith on display here is truly astonishing.","user":"demma52","rank":[7,8]},{"title":"Sad Film","rating":7,"date":"31 December 2019","review":"I guess the viewers reaction to this film will depend on their background. I was raised Catholic but I describe myself as RC(retired Catholic) so my perspective is as a non-believer. The cameras follow desperate pilgrims seeking miraculous interventions by the Virgin Mary. The stories are heartbreaking as the disabled, mostly in wheelchairs, pray for cures, and at one point are bathed in Lourdes water hoping for salvation. Like George Carlin, I have tried to believe, but the older I get, the less I believe in an afterlife or divine intervention. Even with this caveat, I can recommend this beautiful film.","user":"billcr12","rank":[3,4]}]