[{"title":"Let me explain the End of this movie","rating":9,"date":"4 June 2019","review":"To everybody that Is confused on how the movie ended and how she got all the cash, let me explain. That was a flashback of Joy when she was still in Nigeria (before she travelled to Austria). She was working as a fake cash seller. So in Nigeria parties/weddings or events you see a lot of the guest spreading fake cash as a form of celebration. So you saw that the lady at the party was buying the cash from Joy. so at the end, Joy gave some of her earnings to a connection guy to get her to Europe","user":"lavolteria","rank":[30,36]},{"title":"Good watch","rating":9,"date":"16 June 2019","review":"Pro_Viewer, hopefully for you and others who may not understand the end of this film. I do. I am not just Nigerian but I was born and grew up in Benin City.\nBasically, Joy returns home, of course she does not find a viable job so we see her at a party. Now she is holding some money along with other people. These sort of people in parties, usually change high denomination of naira notes for lower ones. The party goer then gets to spray this lower denomination notes to the celebrants. It is a Nigerian thing to spray guests/hosts at their parties. Typically someone like Joy will get some money for this sort of service. Nevertheless, it should be noted that such gain is little or nothing.\nJoy knows this and realizes her existence back at home will be fraught with continued hardship, not forgetting her daughter is still in Austria.\nShe approaches a man spraying money at the party (obviously someone connected and rich) and pleads with him to remember her. The man promises to sponsor her next trip to Europe but reminds her it will be done in 2 days time but she needs to swear to an oath again.\nHence the same cycle of prostitution is about to repeat itself again in Joy's life.\nSad tale.","user":"stonecoldcafe","rank":[14,16]},{"title":"It was riveting","rating":10,"date":"27 May 2019","review":"Please watch this story. It impacted me. I find myself thinking about the characters days after i watched it. I wont look at this situation the same way again.","user":"enyiomeruah","rank":[10,13]}]