[{"title":"Tale as old as time","rating":8,"date":"24 January 2020","review":"This story has been told many times in different situations. Like Broken Arrow before it, and others, a group of disenfranchised young people with challenging backgrounds take on an elite minority sport to build their confidence and give discipline.<br><br>The lead character disconnected from their family with other opportunites to escape. The experienced old time come mentor. The group of characterful unrelated young people who band together to support each other.<br><br>The story is cliched, the script standard, the acting is good across the board, the filmography is Saturday matinee.<br><br>However, why do we have to have special effects and gun fights when we can have something wholesome and feel good. RUGBY!<br><br>There are the usual lessons in this movie but they are told around a sport which prides itself on community, respect and inclusivity.<br><br>I enjoyed it for what it is and not for what I wanted it to be.","user":"j.p.mcgrath","rank":[4,7]},{"title":"Underdog Philly Sports film brings the goods.","rating":8,"date":"24 January 2020","review":"Joining the team of Philly underdog sports films with Rocky-Invincible-Creed-Pride appeal comes an independent film called 'The Nomads', based on a true story of a North Philly school that faces cutbacks across the board. Sporting teams are cut due to budget restrictions and the students are without hope of grants and scholarships to advance them to college. The idealistic young teacher named Cassie McNamara takes a bold leap to keep her students from dropping out, forms a rugby team with no money. The team consists of the usual characters, a learning disabled young man, the ex-con hothead, the tubby joker, and a lightning fast trickster. Of course it's always setbacks, and melodramatic moments that bring the team together with the moral support of good people. Cliches and formula plot lines are all here to either like or dismiss. I accepted the flaws and went with the premise, a decent sports drama has to brings the goods, 'The Nomands' really does just that.<br><br>Tika Sumpter (a regular in the Tyler Perry movies) produced and stars in this small but heartfelt sports drama, and she is a very likable lead. Director Brandon Eric Kamin and writer Tara Miele work with a restricted budget, so this is not the typical high school sports movie. The 'big game' finale doesn't come, but the road to the final act is still engaging. Being a fan of John G. Avildsen films (Karate Kid, Rocky), the characters drive the story and the road to victory is not the fanfare or the cheers from the crowd, it's about friendship and guidance. Like David Anspaugh's 'Rudy' and 'Hoosiers', this movie follows the team to a small victory, a personal triumph for the teacher and the students.<br><br>The supporting cast is key to the victory, with fellow Jersey actor Tate Donavan (Argo, Manchester By the Sea) as Cassie's assistant coach and supporter. Philly actor Christopher Mann as our good natured principal sheds the cliche of the antagonistic 'no way' character, making him a guy who wants it all to work out for the students and the school. All in all, the young cast members are pretty good, with Andy Riddle as O'Brien giving a good comic relief performance. I recommend this movie highly! Great use of Philadelphia as a backdrop... Underdogs Rule!","user":"btjohnny","rank":[2,4]},{"title":"This film is so Weak","rating":1,"date":"25 March 2020","review":"That there should be a 10k to raise money for a non-predictable script. Made the money that is wasted on these stereotypical films could be put into inner city and rural schools.<br><br>Or better yet, what about a film that did not use the same tired, cliché films about inner city schools.<br><br>But then again, that would take all of the sport (pun intended) out of these useless movies that feed into the image being projected of all inner city youth of color only have sports, not grades or determination to better life.<br><br>Oh yea, I forgot.<br><br>There is Love and Dumb Ish, Real Housewives of Dumb Ish, Ink Ish. And every stupid dumb<br><br>And since you have seen the ended of these predictable movies, the spoiler alert is the movie is going to end as you would expect.<br><br>Now the bio-pic of Madame CJ Walker on Netflix. I am on my 10th viewing and it only gets BETTER!!!","user":"briandbrown-39554","rank":[1,4]}]