[{"title":"Sing Out! This will be a monster UK hit.","rating":8,"date":"24 February 2020","review":"I must admit that I was a bit of a drag-along to this one. The trailer excited me not.... one.... bit. Sentimental film. Dull story. Wrong demographic. No, no, no. But... in this case I am very happy to be proved wrong, wrong, wrong.<br><br>True that I didn't sit in the ideal demographic for this movie. 90% of the audience at the UK premiere showing I attended last night were female and older that me. This is a movie to turn the blue-rinse crowd out in DROVES! Because the - inherently British - story is engaging and rewarding from start to finish.<br><br>Loosely based on the true story, it's 2010 and a regiment of husbands (and at least one wife.... nice to see an all female marriage featured) are dispatched from the fictional \"Flitcroft Barracks\" to Afghanistan on a tour of duty. Thereafter every ring at the door by a friend spells mild panic ; every thoughtless call from an accident-chaser induces hypertension.<br><br>Trying to take their minds off their loved ones, Colonel's wife Kate (Kristin Scott Thomas) muscles in on the insipid entertainment plans of Lisa (Sharon Horgan) in organising a singing group. Lisa thinks \"girls just wanna have fun\"; Kate thinks they should be training as a proper choir. Sparks fly.<br><br>But against all the odds, the women progressively improve until they get the chance to present their talents to an unaware nation.<br><br>My wife summed up in one word why this movie is so good...... \"balance\". The movie covers topics of fear, grief, social conflict, family conflict and uplifting joy. One step off the tightrope could have spelled disaster. But director Peter Cattaneo, of \"Full Monty\" fame, through the expert script of Roseanne Flynn and Rachel Tunnard, walks that line with perfect balance. It never feels overly melodramatic; never feels a light piece of superficial fluff either.<br><br>And when \"the performance\" happens, you will be hard pushed not to need a tissue or two..... I certainly succumbed to the emotion of the moment.<br><br>At the core of the story are the perfectly cast duo of Kristin Scott Thomas and Sharon Horgan. With just a handful of introductory lines, you quickly get the measure of Kate's character, without ever knowing the story behind the icy and brittle facade. The conflict between her and the fun-loving egalitarian Lisa is writ large. What's nice here is that you are never totally sure who's side of the argument you are on. It is easy to side with Lisa at the start of the film, but as you learn more and particularly after a particularly careless act by Lisa towards the end of the film, your sympathies change.<br><br>The rest of the excellent ensemble cast also work naturally together, with Emma Lowndes as Annie and Amy James-Kelly as the newly married Sarah being particularly impressive.This feels like a group of actors who were brought together to film a story and bonded as friends in the process. You end up caring a great deal for what happens to them<br><br>Although the script is based on the true story of the military wives it diverges significantly from what actually happens in the interests of an engaging story. Choirmaster Gareth Malone was, of course, actively involved in the true story as a part of a TV programme, but none of that is referenced in the movie. But that doesn't remotely impinge on your enjoyment of the movie for one second.<br><br>In particular, a sub-story about the long-term effects of grief is particularly well handled, with 'Dave' turning from being a passive to an active participant in the story at a key moment.<br><br>It's that depressing time of the year when everyone is fed up of rain, wind and dripping noses. It's a time of year when you look for some uplifting entertainment.... people surely watch \"Death in Paradise\" for the sun rather than the stories? Ladies - and the odd gentleman - I give you \"Military Wives\". It's not bloody Shakespeare. But if this doesn't make you feel uplifted and better about the world, then I will dutifully kiss the regimental goat.<br><br>(For the full graphical review, please check out One Mann's Movies on the web and Facebook. Thanks).","user":"bob-the-movie-man","rank":[14,16]},{"title":"Amazing and Moving","rating":10,"date":"4 March 2020","review":"As a military wife and one who is in the military wives choir I was unsure of how they would actually manage to portray our thoughts feelings etc in to film when they have no idea what our lives are like and I was amazed at how well these cast managed to get our lifestyle on screen! The choir that is formed is exactly like most choirs with such a range of people but that is the whole point.<br><br>I laughed, I cried, I sang and I would 100% see this countless times again","user":"katie_miller-57992","rank":[10,12]},{"title":"Utterly brilliant","rating":10,"date":"8 September 2019","review":"Attended the world premiere at the Toronto International Film Festival on Friday. Honestly one of top 10 best films I've ever seen. Perfect mix of pathos (not sure I've ever cried more in a film 😳), laugh out loud humour and great music.","user":"daveheez","rank":[18,25]}]