[{"title":"I loved this film!","rating":10,"date":"20 December 2018","review":"I loved this film! The animation is beautiful, the characters are clever and the theme \"brains wins over liars\" is timely. It is a film enjoyed by children, their parents and grandparents. It is unfortunate that local theatres are not keeping it around for the Christmas holidays as a family activity. Given that it is a Quebec/Canadian film, it holds an important message for our friends to the south of us. I hope that the film gets American distribution. Go see it, the whole family will enjoy this \"feel good\" animated film.","user":"sharonroserozen","rank":[13,24]},{"title":"Brains beat budget.","rating":10,"date":"20 March 2019","review":"I'll never cease to be amazed how the smaller the budget, the better the animation could be. What do we know of the big title animations? Propagantopia? Cars? Frozen? All the budgets, all the animation in the world - can not rival actual creativity. How many people know Nut Job? Hell, at least some people could remember Ice Age when it was still a work of art.<br><br>This movie is the same - it's not pretentious, it's not filled with any agenda or messages, it's not big budget for big profits. It's just an honest creative work of art. It may not seem like much at start, especially when the whole world is used to \"Hollywood animation\" - but you quickly get sucked in and it becomes one thrilling ride. Of course, you may sometimes feel... uneasy or cringy, but... it's not the cringe when a bunny knocks down a rhino, it's not a cringe when a gangster rabbit makes a poop joke. It's a cringe that you blushingly accept - it makes you remember your childhood. There is no pretense(well, maybe just a tad bit of exaggeration), there is only the honest childhood spirit, when you acted lamer, weren't as sharp, weren't as \"down to earth\" or materialistic. This movie is about children, and somehow it manages to blend 3 various ages and deliver the emotions you feel in each. Sure, the plot may seem stretched out, a bit forced to an adult eye, but there are no moments when you feel \"shocked as to how the hell could that character do that\". And such movies are a dying breed nowadays, in any genre.<br><br>There are no primary characters, at least no really primary characters. Again, somehow the movie just dashes there and back and manages to get everyone into the picture, you end up if not remembering, then definitely noticing every character and their role. And why is that? Because each and everyone has a dramatic role. Nowadays most movies have secondary characters, support characters that mostly serve a toilet humor joke or otherwise a bad joke. That's why nobody remembers them. But here - every character has a role that you can feel something about, you can relate to. The sense of community is even greater than in many other popular movies with the same premise \"united we stand\".<br><br>And, of course, the music. There are good musical animations. There are bad musical animations. There are Disney musical animations, an acquired taste similar to slightly boiled octopus tentacle as an appetizer. This movie definitely belongs to the first group. The musical numbers don't ring in your head like a parasite, they don't cringe your ears, they don't distract from the picture. Sure, you can hear that the voice \"doesn't match\", but... duh. And they are, most importantly, ultimately pleasant and complement the pacing very well. There is no messed up \"jumping into a musical\" circus, if a song plays - it has a purpose. And as for the plot - it's simple, there are no great twists, nothing is pulled by the nose, as an adult you can know how it ends after the first 10 minutes or so. But your child doesn't. And it, first and foremost, is a cartoon for children. Hell, there are fart jokes, yes, but somehow... they aren't bad. Because when there is a fart joke out of place - you know it, when a Shrek farts - well, it's called gag humor. But... it's quite hilarious to see a fart joke and realize that... yeah - that's it. You wouldn't have it any other way. Because they are children, it \"is\" natural to laugh at it and not feel any conflicted feelings. Again, adults might shed a tear - this movie really makes you miss your childhood. Back, when there were no issues of gender, color, religion, politics, finances and privileges... Ahem, I digress. Then again, like I said - this movie doesn't have anything like that.<br><br>I rarely ever give something 10 stars. Most people rate movies on very weird principles. \"Looks good? That's 75% of the rate pool. Feels good? 20%. \"Thinks good?\" Bah, 5%, if it doesn't - no biggie\". For me it's the opposite. The looks play the least important role, a role I could ignore depending on the quality. Well, there isn't much to ignore here. It's not 200$ million budget, but there isn't anything to scoff at. It's still modern animation and it has its own touch to it. Pretty sure I've already covered the \"feels\" part. And as for the \"thinking\" - I love movies with a moral center. This movie's slogan is simple, perhaps not very true to life(yes, as it stands, cheating is the only way to get ahead in life), but it very much reminded me of the honesty of Ender's Game - \"Winning doesn't matter. The way you win matters\". Spiritually this movie really resembles Rise of the Guardians. Also a great movie... but... ultimately forgettable. Bigger budget across the board, but it clearly lacked that spirit that Racetime has. It had everything right, except for its, ironically - core. It had to pull too many strings, and it did so well. Racetime doesn't have to pull the strings, and that's why it manages to be a similar spirited genre, but the one that actually makes strikes home.<br><br>I wanted to pass time watching some animation, but I ended up with a movie( which apparently has a prequel, Snowtime) that I'd be glad to add to my collection, a movie that's worth showing to your children, something that feels right and has nothing wrong with it. So if you wonder if it's a good enough movie - chances are you'll like it. And your kids will. Support them and support this movie, we need jewels like that to make our lives a bit brighter.","user":"Wirxaw","rank":[4,8]},{"title":"Brains Vs. Cheats - Set Somewhere I Wish I Grew Up","rating":7,"date":"19 February 2020","review":"Brains Beats Cheats...As It Should<br><br>A really good by the book kids flick that's safe for any of your shorties (age 2-10). A bunch of snowy tikes spend their days sleigh racing each other with zero adult supervision. Just like I remember it. There's good kids who are brainy and some not so good kids who cheat. Tremendous race scenes. A few good songs performed by one of the racerss...dancing, a cute dog, a couple of tears, and one awesome barn/clubhouse that they're all competing for.<br><br>My 9 yr old son loved it! Me...not so much. That's ok. Thank God for Steve Jobs so I can inconspicuously read the news while we watch.<br><br>A brief comment to a reviewer referencing their southern neighbors. Let's assume we're talking about Canada and the US. Please allow me to make this analogy. Our (The US) relationship with Canada is very similar to co-parenting. Just like we both want prosperity and happiness for our nations...we want equal and more for our children. To achieve this amazing outcome one of the parents (can be either) must be an enforcer to some degree. Not talking corporal punishment rather when the parent says it's time to do X....child does X. This is usually reserved for one parent and the other parent (also extremely necessary in achieving said parenting goal) should be more of the softie type. The one who a child may lean on more at times. The one who says yes not no. The one who buys that toy even though their kid doesn't deserve it..... I'd love for my country to be that parent but the reality is one of us must stand guard if all is to be right in the world tomorrow morning. It's the price you and I pay so we can watch cute little movies like this on cold winter nights in our comfy living rooms with our children who sometimes deserve the toy...sometimes not. Being a parent would be so easy if I always said \"yes\" not \"no\". My country feels the same.","user":"bobbyd61074","rank":[0,0]}]