[{"title":"Great!","rating":8,"date":"13 December 2019","review":"A very rare thing, a great indi film with great acting! Well done!","user":"ricardo-30995","rank":[2,2]},{"title":"Great supporting cast and music!","rating":7,"date":"29 September 2019","review":"Great effort from this shoestring budget indie film about a New York transplant trying to break into Hollywood as an actor. The main character (Sean) fumbles his way through the entertainment business while his BFF catches all the breaks and to make matters worse - Sean seems inept in the ways of female relationships! The biggest highlight for me was the supporting cast who enhanced every scene they were in - especially the drama teacher and Mindy Sterling who played Sean's mother. Another big reason to watch this movie is for the fantastic original songs sprinkled throughout the movie which give the film a moody somber tone.","user":"pennyman","rank":[4,7]},{"title":"We Hate It When Our Friends Become Successful","rating":9,"date":"5 November 2019","review":"In the 1990's, singer/songwriter Morrissey ripped the mask off a stone cold truism with his song, \"We Hate It When Our Friends Become Successful.\" A quarter century later, the surprising and slightly wonderful \"My Best Friend's Famous\" converts similar observational sentiments into a highly engrossing comedic gem.<br><br>Sean Reilly (played by co-writer Nick Psinakis) is the quintessential working actor (see: more working than acting). Fresh off the boat to L.A. by way of New York, his is a de facto day job hustle, living the grind as he awaits a big break. It's an existence made more palatable by the safety-in-numbers axiom: His best friend Freddy (Darryl Gudmundson) is there by his side -- swimming in Sean's same hapless ocean until (you guessed it) Freddy's thrown the lifesaver of a recurring role on TV. Verily, Sean's fragile artist psyche forces him to take account of his own life as a self-assessed non-starter. And with that, we're officially out of the gates on \"My Best Friend's Famous.\"<br><br>This film is a wonderful iteration of the bad luck, loser guy comedy -- a vehicle that seemingly never gets old if it's done right, and \"My Best Friend's Famous\" surely is that. Psinakis elevates the role of Sean through commendable self-deprecation as the storytelling arc plunges him into his own little abyss, only to then elevate in a way sure to resonate with those in pursuit of their own life's passions. \"My Best Friend's Famous\" displays a warming light-heartedness and presents an enduring hope that a grander scheme of things might one day surface for us all. Highly recommended. - (Was this review of use to you? If so, let me know by clicking \"Helpful.\" Cheers!)","user":"TheAll-SeeingI","rank":[3,5]}]