[{"title":"Pretty bad movie","rating":2,"date":"8 December 2019","review":"Convoluted storyline, many scenes just didn't make sense, obvious use of cliches, etc.","user":"geshupenst","rank":[3,5]},{"title":"Monsters on three continents","rating":7,"date":"18 December 2019","review":"The Whistleblower is an Australian-Chinese coproduction that has been given limited international release. This conspiracy thriller is centered on an Australian mining company that tries to cover up a deadly accident in Malawi as an earthquake. An ambitious, arrogant and dynamic Chinese expatriate comes too close to the truth and his execution is staged as a suicide. His colleague and concurrent starts investigating and is helped by a former lover who faked her own death to start a new life in Australia. Soon enough, the duo faces family issues, media attention and menaces from the influential company as they try to work out a plan to let the world know the truth.<br><br>This dynamic thriller convinces on several levels. The locations in Australia, China and Malawi are truly diversified and show the viewers something different than the usual tourist hotspots. The camera work is flawless and the sound effects work very well in a movie theatre as well. The few actions scenes are refreshingly realistic. The movie gets more and more dramatic and tense as it ends on a high note.<br><br>There are also a few elements that could be improved. The plot is quite predictable which lessens the tension. The actors and actresses don't leave lasting impressions and deliver their lines like routine jobs most of the time. The two protagonists are difficult to empathize with as we have to deal with an absent family father who cheats on his wife and a woman who faked her own death, lied on many occasions and is only interested in material prosperity.<br><br>Still, the film's locations, pace and overall quality make for an entertaining experience. One has to point out that the movie draws a flawed portrait of society which offers some welcome food for thought. There are no good guys here, only characters who aren't as terrible as others. If you like investigative thrillers with a realistic touch, you can certainly watch this movie without any regrets. It's on the same level as most contemporary Hollywood films of the same type and deserves its international release.","user":"kluseba","rank":[2,7]}]