[{"title":"A documentary into the work of investigative journalists more than on the Panama Papers themselves","rating":7,"date":"15 February 2019","review":"The Panama Papers is a documentary that portrays the history of the global leak that involved a now infamous legal services company based in Panama, and its activities involved in setting up offshore shell companies to help celebrities, politicians and powerful figures from around the globe, in avoiding taxes, money laundering, and other financial crimes. This issue, of global relevance since it involves sistemic corruption in the global financial system and most countries around the world, was, however, poorly explained in this movie.<br><br>Being from Argentina, I was interested in this documentary because our President was one of the many figures in Western politics mentioned in this scandal. However, as in the other cases mentioned on the movie, the movie barely makes a passing mention of the case and doesn't bother to explain it in detail. Instead of explaining, step by step, how the process of setting up an offshore company works, exactly what each politician mentioned was involved in, and what the evidence against them was (which could have helped bring transparency into this important issue), the movie wastes time (more than an hour to be precise) talking about the journalists involved, how their investigation took place, and describing their collaborative international process in combing through the evidence, in what feels like a self-congratulatory exercise. While in itself interesting, I believe me and most of the audience were more interested in the actual contents of the Panama Papers itself and not on the journalistic process which made it happen. The documentary, in my opinion, gives an undue weight on this aspect of the story. The second part, on which the arrests made in Panama are described, is more interesting, but this extends for only 20 minutes, before we are back to the journalistic side of the story again.<br><br>I also did not appreciate the cheap emotional appeals introduced in the movie from the very beginning, on which faces of ordinary people from around the world are shown, intersped with images of global wealth inequality, and with a voiceover of the manifest of \"John Doe\" - the leaker of the Panama Papers - describing his motivations. Some of these images are meant to tug at your heartstrings, but they extend for too long, and detract from the actual figures involved in the Papers. In some cases I found them downright misleading and manipulative, like at the very beginning, while an Argentinian journalist is talking and describes inequality in her country as one of her motivations in working as an investigative journalist, the movie shows us images of favelas in Sao Pablo, Brazil, without saying where the photos are from. (Maybe Buenos Aires was too \"pretty\" for the emotional appeal they were trying to convey?). I found this, describing a country while showing another, a form of emotional manipulation and it put me off the movie from the very beginning. This was also more wasted time that could have been used in doing actual journalism and informing the public on how these financial operations were carried out.<br><br>Overall, I am giving this movie a 7/10 because this is a very important global issue, and this movie is trying to raise awareness of it, so I believe it is a well-intentioned movie. Many of the points raised and the descriptions of the activities of offshore funds shown in the movie are indeed informative and relevant. But my advice is that if you are interested in the Panama Papers themselves, you will have to go to the newspapers and the databases which are publically accesible and do your own research. Sadly, an opportunity to describe and summarize properly this scandal to global audiences is somewhat lost between self-congratulatory interviews to journalists and retellings of depressing economic statistics of the world interlaced with emotionally charged pictures, that add very little to the story itself.<br><br>The Panama Papers is a very interesting movie for journalism students since it describes the process of how one of the largest global leaks in history came to be, but as a documentary on the activities of tax evasion itself, I found it a bit lacking.","user":"Salem_Saberhagen_","rank":[30,32]},{"title":"An Exposé more about the journalists than the results","rating":7,"date":"27 February 2019","review":"The Panama Papers is an exposé of the financial underworld and named much like \"The Pentagon Papers\" exposé of 1971. It's a mostly interesting account of the lengths the super rich will go to hide their wealth - many times illegally acquired - from taxing authorities. And these are not your banana republic dictators but First World leaders, celebrities, and sports figures. However, the account dwells a lot on the investigative efforts of journalists worldwide and the risks to them, and though that's of some interest, it seems to be more the focus of the film. I wasn't quite satisfied with this approach, nor the way it concluded. Sure, many govt leaders were forced to resign but why not prosecuted/jailed? The film could've delved into that, too, but didn't.","user":"GerryofNorVA","rank":[9,9]},{"title":"Extremely relevant documentary about tax evasion, without neglecting dangers involved in revealing those secrets. Difficult topic to find appropriate visuals for","rating":8,"date":"22 December 2018","review":"Saw this at IDFA 2018, the International Documentary Festival in Amsterdam. The movie makes abundantly clear that corruption in the broadest sense of the word, is not confined to countries far away. Politicians in Europe and USA, as well as \"fellow\" citizens with more money than they can spend in a life time, go at any length to hide their assets. They do that mainly for tax evasion purposes. That observation is extra painful, given that richness and poverty are very unevenly distributed. By refusing to pay their fair share of taxes, they also avoid contributing to the solution of these problems.<br><br>This movie presents a very relevant overview of the situation as it is nowadays. However, as a movie it has its problems, because it is a difficult story to find appropriate visuals with. Talking heads are inevitable around topics like this, but what can be shown in the background, next to what they tell us?? The subjects are relevant, so that is not the issue here. But showing documents in passing, thereby highlighting text fragments and signatures, totally out of context, does not work for me. This form of presentation is not attractive in any way.<br><br>There are relevant remarks about the risks for the journalists involved. Ditto for the whistle blowers who provide the ground work for the published articles. The movie mentions some earlier whistle blowers, Manning and Snowden, despite having played their role in a very different context. Their names are explicitly mentioned here, if only to emphasize that their lives drastically changed after they went public. We know what happened to these two, which might work as a deterrent for followers in their footsteps. And the one journalist involved in the Panama papers, who lately became the victim of a car bomb, is also a frightening perspective. Their adversaries are powerful, their pockets are deep enough to pay any straw man, or assembling an army of sollicitors, and thus can easily get away with it.<br><br>All in all, despite some minor limitations in presenting the dry subject at hand, due to a lack of appealing visuals, the underlying issues are relevant enough to accept the lack of vividness as a fact of life, given the nature of the material.","user":"JvH48","rank":[18,21]}]