[{"title":"A draft of a film about a society in full depravity","rating":4,"date":"25 June 2019","review":"Yesterday evening, I took advantage of a French premiere within UGC Les Halles, in Paris, in the presence of the Argentine director <a href=\"/name/nm3028737/\">Benjamín Naishtat</a> who fluently spoke French with an almost-irreproachable accent. He confided us he was inspired by the detective movies (« polar » in French) of the 70's.<br><br>The film generally seems to be the mixture of two films from two distinct directors. The duels (all those involving <a href=\"/name/nm0334882/\">Darío Grandinetti</a> and / or <a href=\"/name/nm0998846/\">Alfredo Castro</a>) highlight an obvious cinematographic maturity based on an irreproachable photography and well-built dialogues. These scenes remind me of the excellent film <a href=\"/title/tt4411504/\">El Clan (2015)</a> which takes place a few years later, at the beginning of the 80's. Conversely, others scenes such as the rehearsal of the dance show are almost annoying and weirdly seem to come from another movie and from another director.<br><br>In summary, I'm rather disappointed with this slightly-muddleheaded movie, despite some excellent scenes. I'm nevertheless convinced that the next movie realized by <a href=\"/name/nm3028737/\">Benjamín Naishtat</a> will be better built. 4/5 of 10.","user":"FrenchEddieFelson","rank":[24,30]},{"title":"********Late Developing","rating":15,"date":"15 July 2019","review":"Summer movie season has arrived in NYC. I can always tell by the higher quality of the foreign films that come to town (you can bet none of the Hollywood films are of high quality). \"Rojo\" is the best film I've seen since at least the winter and I can't remember which one that was. This one features good acting and camera work and with some thought-provoking allegory and symbolism.<br><br>Nutshell: An influential lawyer is slowly losing his ethical footing after a confrontation with an unbalanced patron at a restaurant, leading to a visit from an amateur detective investigating the disappearance of the patron. Give it a chance, because it is slow to get underway. But if you appreciate superior filmmaking there is always a reward with a good motion picture, and this is one example.<br><br>******** 8/10 - Website no longer prints my star rating.","user":"GManfred","rank":[8,10]},{"title":"Don't waste your time","rating":9,"date":"9 February 2020","review":"A bad, boring film which wastes the talent of Grandinetti. Make better use of your time by watching another film . This is total nonsense and includes a very gratuitous and grotesque scene where a bull is castrated, which is not in any way essential to the film's plot. Also included is a scene where a\nrecord with an A&amp;M label plays on a record player while Camilo Sesto's Quieres Ser Mi Amante is heard. Camilo Sesto's music was never released on A&amp;M. He recorded for Ariola, which later became part of the BMG conglomerate. A&amp;M Records was an American record label that had absolutely no connection with Ariola or BMG, and is now part of the Universal Music Group. Por favor!","user":"bailadorafina","rank":[6,9]}]