[{"title":"Presenting 'Cinematic Universe' in Indonesia","rating":9,"date":"21 February 2019","review":"To be honest, 114 mins is too short, for me, Indian Movie audience, which they tend to have movie for 140++mins more or less. Haven't seen the trailer, haven't seen the synopsis. I found 'F6' in Twitterland, which from unknown account replying Oka's reply 'Foxtrot Six'.<br><br>Randy Korompis. Sulawesi, I guess. He is fan of Metal Gear Solid fan. --Okay, irrelevant.\nIt was a nuisance to have Indonesian movie with full English dialogue. Maybe they have their reason, but it is showing we are capable to speak English, making Hollywood-like movies, and one more thing to be achieved, a successful movie.<br><br>Sorry if I am blabber about Indonesian Movies Industry. It was random and unpredictable.<br><br>What is good from this movie?\nCGI and VFX. It was a fun ride to watch made in Indonesia and has good CGI, although not better or as good as Hollywood, but we're making progress here.\nCharacters. Oka Antara successfully portrayed Angga in his best. No background except his devoted love for Sari (Julie Estelle). Tino is the most bright and has sexy accent among all. Mysterious character like 'Spec' (Chicco Jerikho) supposed to be a key player, but with all mystery made it 'perfect'.<br><br>What need more elaboration or explanation?\nStory. Having 80 script over 3 years in the making was not easy role for Korompis, but to make it better, he needs to make a better detailed story or working together with screenplay or scriptwriter. It feels like 'Frankenstein'--if you get what I meant.\nFoxtrot. There is no explanation about the symbol--either a miss or a clue like Marvel Cinematic Universe.\nMarketing. Having MD as distributor and marketer surely escalating the chance and game, but it needs improvements, but kudos to F6, the sequel/prequel/spin-off will be easier to reach audiences.<br><br>What I like in this movie?\nJust Angga's grand introduction in dystopian setting. Having advanced technology like Stark in each movies.\nA melodramatic over 'found the lost one' and surprising fact.\nAwesome hunks. Well, who can resist if there is Arifin Putra, Oka Antara, Mike Lewis, Rio Dewanto and Chicco Jerikho in one screen and together pursuit one goal.<br><br>I can give 2 points for CGI and VFX. One for every main character, Oka have a plus. And one for Korompis. This is not a neutral judgement, I just feel proud that my country is capable of making such movie.<br><br>Can't wait for another.","user":"annisasafanta","rank":[23,38]},{"title":"Missed opportunity","rating":2,"date":"22 February 2019","review":"I was hoping this movie will open up its doors to new era for Indonesian action movies.<br><br>Boy I was so wrong.<br><br>The incoherent storytelling continuously distract viewers from immersing into the narrative. There were so many scenes which I didnt understand the reason its happening or some scenes are just way too incoherent that made me laugh due to script's absurdity.<br><br>At the same time the horrendous dialogues and one liners, seems it was written by a 7th grade action movie fanatic who just copied and pasted all those cliched dialogues from 80s action movies.<br><br>At one point one character expresses his emption in three random words 'How?' 'Why?' and 'Nevermind!'. That terrible line made the actor to perform worst acting in his career.<br><br>At least I was expecting some decent action set pieces. But then again what I got was uninspired action set pieces one after another. Just few scenes with anime wanna be actions with terrible stunt choreographies.<br><br>And then there is this SOUND MIXING...<br><br>The sound in this movie is just unbearable for your ears. From awkward dialogues I mentioned earlier to terrible voice over. The worst part of sound mixing is during action scenes where sound engineers just amped up the volume so high as if the pistol is firing a canon. The sound effects just scream in your ear over and over again til your eardrum gets numb.<br><br>If this movie was released on Youtube instead, as \"Fan Made Call of Duty Movie! \" it might've caught high school fanboys' attention.<br><br>Sorry Indonesia, this is not the future of your cinema","user":"Zguin","rank":[26,49]},{"title":"Best Indo film I've seen, especially considering...","rating":8,"date":"8 March 2020","review":"...this is amateur/newb producer, writer and director Randy Korompis' first film ever! Stellar production with outstanding cinematography, and directing better than some seasoned pro filmmakers films I've seen lately. Excellent casting and performances, and I'm happy it was made in English. The S/VFX were Hollywood blockbuster quality. Film length and pacing were spot on. The score was a little overbearing in some scenes, and the writing had some plot and technical issues, but nevertheless, shocked at how great this film was coming from a new filmmaker! Mad props and respect to Randy Korompis. A well deserved 8/10 from me","user":"TheTopDawgCritic","rank":[8,12]}]