[{"title":"Another remake by a different country yet again......","rating":5,"date":"17 May 2019","review":"The original movie was done by the Italian, which in my opinion is the best. The Spanish then did a remake a year later &amp; then this Korean version came out, yet another year later. I actually prefer the Korean version to the Spanish version, as I feel that the chemistry between the Korean actors are much better. My verdict being the Original Italian version being the best, followed by this Korean version &amp; lastly the Spanish version. Go check out the other two versions of the movie, if you haven't done so.<br><br>1) Italian version - Perfetti sconosciuti (2016)\n2) Spanish version - Perfectos desconocidos (2017)","user":"hollandvillage","rank":[8,8]},{"title":"Hilariously Darkly Comedic and Deeply Personal","rating":10,"date":"11 November 2018","review":"Darkly comedic and deeply personal Korean movie about 4 couples where the guys have been best friends since grade school and with their wives they decide to play a game at a dinner party where everyone shares each other's calls and texts for the evening. You can imagine how that spirals out of control. Phenomenal acting and truly well worth the watch. The film finishes off with the saying \"People live three lives. A public life, a private life, and a secret life.\" And I've never seen that so beautifully portrayed.","user":"rajgopalmuralidharbackup","rank":[13,16]},{"title":"Thoroughly entertaining, but doesn't match the heights of Italy's original","rating":7,"date":"2 June 2019","review":"As part of my ongoing quest to watch every remake of Italy's Perfect Strangers - a film that has been remade no less than 10 times in the last few years - we find ourselves with one of the closest adaptations to the original, South Korea's Intimate Strangers.<br><br>Now, while this film succeeds in replicating the intensity and awkwardness of this dinner gone so, so wrong, furthered by entertaining performances and strong humour, it doesn't quite have that sense of unbridled chaos that made the original so good, missing out on delivering the peak potential of this fantastic story.<br><br>First things first, though, I will say that this is a really fun watch. It's not perfect, and doesn't hold a candle to the Italian original, but it effectively combines a great sense of dark humour with riveting drama throughout, keeping you entirely engrossed in the many twists and turns over the course of the evening.<br><br>One thing that the film does well is stick close to the atmosphere that was created in the original, and while it has a few details here and there that set it slightly apart, it's certainly the closest version in terms of atmosphere and entertainment value to the original movie. As a result, Intimate Strangers grabs you with the no-holds-barred forwardness when things start to go wrong, one of the greatest suits of the Italian film, but also plays it up in a darkly comic fashion that makes it a thoroughly enjoyable watch.<br><br>That excellent blend of dark comedy with the drama at hand comes together well thanks to Lee Jae-kyoo's directing, which retains that sleek vibe which made the Italian original so memorable. In contrast, the French version was a little all over the place, the Spanish moved along at a lightning pace, and the Chinese took a very different tack, but Lee prioritises that sleekness throughout, and that makes South Korea's Intimate Strangers great fun throughout, even when it doesn't quite hit the heights of what its story can achieve.<br><br>And that is, rather unfortunately, where my biggest problem with Intimate Strangers comes in. It always seem slightly unfair to judge a film based on how it compares to an original, but when it's a remake that deliberately sticks as close to the original as possible, it's difficult not to contrast and compare, and in this case, feel a little disappointed.<br><br>In and of its own, Intimate Strangers is a great watch, and I thoroughly recommend it, but it unfortunately fails to deliver a heart-stopping thrill factor as the dinner party gets totally out of control, something that took the Italian original, and to an extent the Spanish remake as well, up to a whole different level.<br><br>While it's a sleek, darkly comic watch that intrigues and entertains throughout, I didn't feel like I finished this movie catching my breath, like I did in both the Italian and Spanish films, and I feel that there was a whole lot more that the film could have done to really ramp up the tension and awkwardness of the situation.<br><br>In part, the pace could have been faster - this is probably the most slow-moving version of the story I've seen - while the actors could have dialled up the intensity of their performances a little more over the course of the night, rather than staying at a more middling level that takes away from the potential of the chaos that develops through the story.<br><br>Having said all that, I still liked Intimate Strangers a lot. An entertaining, engaging and sleek film that sticks closely to its inspiration's style and story, it has everything to keep you engrossed from beginning to end, coupled with good humour and riveting drama as part of the excellent screenplay, even if it doesn't quite hit the heights that this story can definitely provide.","user":"themadmovieman","rank":[3,3]}]