[{"title":"Raw Modern Poetry","rating":8,"date":"5 September 2019","review":"Street smart, uncompromising, sexy, bitter, funny, feminist and beyond all else, raw, Low Low is an indie film that strives to say so much, often through nothing but subtext and casual banter alone. It's a beautiful and honest piece that depicts the rough slice of life four woman have carved out for themselves in a tired, suburban world, managing to do so with genuine finesse. Patient writing and gut wrenching performances from all the leading women (special mentions go to Ali Richey and Kacie Rogers) help lure the viewer into the story and get them thoroughly invested in the nuanced conflicts that threaten to tear any happiness these girls have found clean in two. It's not a perfect film per se, and it doesn't intend to be. It's messy, it has cracks, it's dirty... just like the lives of its four leads, and these \"imperfections\" ultimately yield truth and empathy that so many indie films today genuinely lack. It isn't an easy watch, for the girls have a tough go of it throughout, but that's life, and that's what I appreciated the most. This movie is a breath of fresh air, and even if it's cold, biting air that comes along in the dead of winter and stings just a bit, it's hugely refreshing nonetheless.","user":"alexanderhanno","rank":[6,8]},{"title":"Lower","rating":3,"date":"24 October 2019","review":"Reminded me of \"American Woman\" as in 90% profanity, fake sex (i.e. scenes designed to give the idea w/out exposing much), parties, alcohol in abundance of course. Females searching for love using the hooks they have, but advantage falls to the guys. Script tries to convey the importance of dedication to education, but comes across as weak.","user":"westsideschl","rank":[2,2]},{"title":"Brutally honest","rating":10,"date":"8 September 2019","review":"I was blown away by the characters in this film! The intensity of the lives they lived, and the brokenness of their life circumstances was heartbreaking and raw. The complexity of life lived by those raised in addiction and poverty is overwhelming and this film beautifully captures those moments.","user":"tdrock-78067","rank":[4,6]}]