[{"title":"Quite funny. Totally love it!","rating":9,"date":"17 December 2018","review":"After watching the Incredibles 2, I always wonder how Edna took care of Jack-Jack. Finally, they showed about it. The film is too short. But it's very cute and funny, especially it explains the words Edna said to Bob, \"As I learned quite painfully last night\". That scene becomes funnier after watching this short film.<br><br>All in all, The Incredibles is one of the best animations.","user":"silvermistvio","rank":[6,6]},{"title":"Filler to a genuinely interesting plot hole","rating":8,"date":"1 April 2020","review":"That is a good reason to make a short film: fill a plot hole that is huge but that raises some questions whatsoever. No need of 2 hour long rogue one movies to do so!","user":"pintaxandre","rank":[0,0]},{"title":"Babysitter blues","rating":7,"date":"14 June 2019","review":"Love Pixar, feature films, really like to love most of their feature films, and short films, don't dislike any of them. Their best are masterpieces and even lesser efforts, my least favourite overall being 'Cars 3', are never below mediocre and have at least four good things. Best asset having always been the animation. Whether that is popular opinion is uncertain as most of the post-'Toy Story 3' films have had their fair share of hate.<br><br>Have always gotten a lot of enjoyment out of 'The Incredibles', one of those things that gets better with every viewing. It is not among my favourites from Pixar, but it is so exceptionally well made (as always with Pixar) and written (as most of the time with Pixar, the rare exceptions being the character designs in 'The Good Dinosaur', my opinion) apart from a slightly rushed final act. While the sequel was not as good and disappointed a bit in the story and villain departments, a large part of me enjoyed it with the animation, Jack-Jack and Holly Hunter's voice acting being the best assets.<br><br>It was great to have a short film centred around two of the best characters from 'The Incredibles', Edna and Jack-Jack. 'Auntie Edna' was colourful, cute and fun enough, but could have been better too considering how good these characters are.<br><br>'Auntie Edna' is one of the shortest Pixar shorts, and is one of the very few to feel too short. It is never dull and does engage, but with a longer length (even if it was just five minutes longer) the pace would have slowed down as it did feel manic at times.<br><br>Of the characters, Jack-Jack is by far the more interesting and funniest of the two main characters and a great job is done with him, he is also adorable. Edna's fun too and true to character, with a few cool lines, but would have liked her to have a little more to do.<br><br>However, the animation is typically terrific. Very colourful with meticulous attention to detail in both the backgrounds and character designs, especially the former. Jack-Jack's powers are particularly well done. The music more than serves its purpose well, with the right amount of energy and charming orchestration.<br><br>Regarding the humour, the physical and visual comedy really shine here, more so than the spoken dialogue. Do remember Jack-Jack's literally-laugh-a-second hilarious and very imaginatively animated powers more than anything spoken by Edna, who is still funny, don't get me wrong and that line she says to Bob does raise a big laugh. It is very cute and has a lot of charm, though can understand if anybody says that more emotion and heart was needed, a consequence of the too short length. Brad Bird's voice acting is a large part of why Edna is as memorable a character that she is.<br><br>In conclusion, good but not great. 7/10","user":"TheLittleSongbird","rank":[1,3]}]