[{"title":"Still waiting for something to happen.....","rating":1,"date":"1 January 2020","review":"Ridiculous waste of time. Little to no plot. Terrible acting. Nothing \"thrilling\" about the movie at all. What was the purpose of this nonsense??","user":"akkachi","rank":[10,11]},{"title":"Left me disappointed","rating":5,"date":"16 December 2019","review":"Great acting and plot that kept me guessing until the end. The filming was a bit distracting and sometimes all over the place. There were a few confusing and sometimes irritating moments. All in all I did find it ok and sat through the whole movie, even to the disappointing ending.<br><br>*******SPOILER ALERT*********<br><br><br><br>\nFor the life of me I don't understand why the mother never called anyone after each terrifying episode- not a friend, the police, or even her husband. She goes on with life as if she's just had a bad dream.<br><br>Finding terrifying videos of her daughter speaking to a dark figure with a demonic voice would have sent a mother running to the church, police, or therapy. This mother accepts her 9 year old daughter swearing at her for looking at her phone yelling 'I don't know who I was talking to!' Well. Okay?<br><br>And it's never explained how the figure (who turns out to be hired to scare the wits out of the mom and kid) happens to casually stroll into the daughter's room at night and HAVE the conversation with her. Did he drug her first? Even a 9 year old with a sleep disorder doesn't just wake up and find it normal to have a conversation with the boogeyman about killing their mother.<br><br>The ending is why I rated the movie a 5. Are we supposed to now think that the mother dreamt the whole thing?<br><br>Unoriginal.","user":"saucygurl","rank":[10,11]},{"title":"DO NOT BELIEVE THE POSITIVE REVIEWS! THIS MOVIE IS TRASH!","rating":1,"date":"21 December 2019","review":"THIS MOVIE SUCKS! Do not waste your time! All the positive reviews are accounts made days ago, just to give a garbage movie like this a 10 star rating? What a joke! Obviously they were written by people who were involved in the production of this stupid lame movie! They are just trying to bring the rating up so people will waste their time watching this piece of garbage, so I am here to expose the truth and tell you what a lousy movie this really is! And that the fake reviews are all fake accounts made probably by the same person, who have not reviewed ANYTHING other than this movie! So obviously that's suspicious!\nThe whole movie is stupid, lame, boring, slow, makes no sense and is just boring and a total snooze fest and not even worth watching. If I could give it zero stars, I would. It doesn't deserve a ten star rating, let alone even one star, it's that bad!","user":"teekieteekybirdie","rank":[16,21]}]