[{"title":"Thanks And Good Luck","rating":10,"date":"30 November 2019","review":"For half a decade, people have been astonished at Richard Linklater's BOYHOOD, a movie shot over the course of more than a decade, using the same cast.... as if Michael Apted had not been doing the same thing as a documentary for more than half a century since, as a researcher at ITV, he had been a part of the landmark SEVEN UP (1964) and ever since writer, interviewer, director and occasionally the object of his subjects' scorn for his old-fashioned attitudes.<br><br>The first one took the quote \"Give me a child for seven years, and I will show you the man\" and offered to check in every seven years to review the result. Now, as the subjects face retirement, one has died, and others are looking forward to the endings of their lives, they are called on for review. Is that seven-year-old still with them? What have they learned from the 'program' and is it of any value? Is the class system so evident a lifetime ago still in place? How do they feel about Brexit?<br><br>I think the series has been a remarkable achievement, and as a survey of the Baby Boomers, fascinating. It's a pleasure and an education to watch these people show up, grow up, and become, slowly and eventually, themselves, typical and unique.<br><br>Apted has called the situation for 70 UP (2026?) \"fluid\". He himself will be 85 if it comes out, along with many death notices for such of the original subjects that yet survive. It's possible, I suppose, but I'm a couple of years older than these people, and there is, therefore, some doubt I will be around to hear from my old friends from Britain. I wish them all well. They have not been easy friends, but they have been far more honest about who they are than most people I know.... or me.","user":"boblipton","rank":[35,35]},{"title":"63 Up","rating":7,"date":"8 June 2019","review":"The Up series has been unique in television history. It started in 1964 where it looked at a cross section of 7 years old. Granada television have followed them every seven years from childhood and now to old age. All of the shows were shown on ITV apart from 42 Up which was broadcast on the BBC.<br><br>I have only watched it from 28 Up when it was shown in 1985. I was a teenager then, being 28 years old felt some time away for me.<br><br>Now the participants are 63 years old. I feel it is only a few short years to go before I am 63.<br><br>One participant Lynn Johnson has died since 56 Up was shown. Nicholas Hitchon the Yorkshire farmer's boy who grew up to be a nuclear physicist in America sadly has throat cancer. I always found Nick to be one of the more interesting people in the Up series. He had an abrasive relationship with the show, at times he felt the snippets broadcast misrepresented him. However he continued to appear because of some sense of duty.<br><br>This is likely to be his final appearance. Nick mentioned he was at Oxford University at the same time as the British Prime Minister Theresa May who stepped down a Tory leader when this program was initially broadcast. Nick mentions how easy it was for a strata of society from the right public schools continue to run the country. It is questionable if they are actually fit run the country. Even from America, Nick could observe the incompetence of the ruling elite.<br><br>Cheeky cockney Tony Walker wanted to be a jockey and ended up as a black cab taxi driver, a bit part actor and a budding entrepreneur. His business ideas never came to much and his cab business has been hit by Uber. Tony had a holiday home in Spain and planned to develop property in Spain as well. So not much of a surprise that he voted for Brexit. In 56 Up he can be heard having a rant at immigrants in London but he himself was happy to partly reside in Spain.<br><br>Bruce Balden was a public schoolboy who really hated his time there. He ended up as a teacher in a deprived part of London and even went to teach in a poorer country. Although not mentioned in any of the Up shows, it was Bruce who reached out to another participant Neil Hughes when he hit a rough patch.<br><br>John Brigsby was another public schoolboy and the poshest of the lot. He does like to add that he is more Bulgarian than British. He also adds that after his father died when he was a child, his mother had to struggle to make ends meet but managed to pay the public school fees. John became a successful barrister, he has been a part time judge and continues his charitable endeavors in Bulgaria. He does think that Britain has become more egalitarian but even his fellow public schoolboys are hard pushed to agree with him. Andrew Brackfield thinks fame or money is now regarded as more important.<br><br>The women in the series have always been short changed. Something Jacqueline Bassett raised with the interviewer Michael Apted as he always asked them about family and relationship questions rather than the state of the world. In 63 Up one female contributor decided not to take part and as mentioned one has died. So it appears even more male dominated.<br><br>Neil Hughes was the ebullient boy from Liverpool who wanted to be an astronaut at 7 years of age. By the age of 21 he was living in a squat and working on a building site. At the age of 28 Neil was in a bad place, homeless and mentally unstable. The program always keeps him till last knowing the audience wants to know what has happened to him.<br><br>Over time life has gone better for Neil, he has been a Liberal Democratic councillor, a lay preacher, he has married but since separated from his wife. He still gets regular visits by the black dog. Mental illness is also touched on by Tony whose daughter suffers from it.<br><br>This might be the last time Michael Apted takes part in this series as he has been involved with it since 7 Up. I have no doubts that if 70 Up is broadcast a few less people will participate as old age takes it toll. It is still a fascinating series.","user":"Prismark10","rank":[43,47]},{"title":"Nature and nurture at 63","rating":9,"date":"10 January 2020","review":"What do a bricklayer, barrister, solicitor, cabbie, politician, forklift operator, astrophysicist, and a few housewives all share in common? Outside of this ongoing documentary series, and other than their being human, perhaps not a whole lot. Then again, maybe not all that much here as well, other than the fact that the majority of them have confessed on camera as to their continued reluctance in being a part of this longitudinal study. This I have never understood. Thanks to the magic of filmmaking, this has, in a manner of speaking, made them all immortal -- their being captured on film for countless future generations to behold and appreciate is something that you would think would fill them with a sense of wonder. What lucky souls these people are to have been a part of this essentially numinous film project.<br><br>I was saddened to learn of one of the participants having passed on. Another one's health isn't in the best of shape.<br><br>As one who has followed this series since his early twenties (I'm about in my mid-40s as of this writing), I like many others have in a sense grown up with these people, whether they would care to know this or not.<br><br>Yes, the included factor of senescence has taken its toll, but here's one loyal viewer who would like to see the director take this project of his to the next level: to \"70\" if not \"77.\" Not only would either one of these titles make for an apt phonetical finish and bring a full-circle-sense of closure to the series (in their use of the number 7), but anything beyond that, I feel, would not be the dignified thing to do. No one would want to see these beloved subjects in their eighties, at an age when for many octogenarians senility and incontinence begin to enter the picture.<br><br>One quibble I have always had with these \"Up\" features is that their segments take up too much time with flashback footage of earlier clips of interviews. We viewers only get to spend so much time with these people after not having seen them for seven years, and excited we are to learn what's new in their lives. In my opinion, we don't require any time-consuming backstory, as most of us have seen every previous instalment.<br><br>I would here like to conclude by way of a relevant memory of my own. A few years back, I went and watched the first seven instalments of this series over the span of a two-week period. What this rather surreal experience impressed upon me the most, was just how short our lives are and how unsettling it was to see how quickly a seven-year-old could turn into a forty-nine year-old in a single fortnight. Not to get too maudlin, but it also got me to thinking how striving after anything in this world, be it a family or a career or higher education, is rather insignificant in the grand cosmic scheme of things. And that we are who we are, in large part, based on forces beyond our control: namely, nature and nurture ... and for some of us, a filmmaker's time constraints.","user":"take2docs","rank":[5,5]}]