[{"title":"Bravo!","rating":9,"date":"8 December 2019","review":"Nothing was typical about this. Everything was beautifully done in this movie, the story, the flow, the scenario, everything.\nI highly recommend it for mystery lovers, for anyone who wants to watch a good movie!","user":"kamalhasnaa","rank":[546,714]},{"title":"Bringing back the classic whoddunit in amazingly entertaining fashion - 8/10 ⭐","rating":8,"date":"29 November 2019","review":"What an excellent film by <a href=\"/name/nm0426059/\">Rian Johnson</a>; definitely feels like the film he was destined to make. Writing that is slick as hell, sublime performances (most notably Daniel Craig who brings his A-game in a wonderfully charismatic turn), superb editing and wonderfully atmospheric music - all tied together by masterful direction. Will probably be among the most fun you have at a theatre this year and fans of Agatha Christie and old murder mystery stories will have plenty to love here - a nostalgically entertaining time!","user":"pere-25366","rank":[544,721]},{"title":"Knives out","rating":9,"date":"8 February 2020","review":"Knives Out is really a classic story of it's kind set in modern day with Daniel Craig even playing a very clear Hercule Poirot type character. There's a bit more humor and self-awareness than a lot of those classic stories, but never to the degree that it takes away from the twists and the mysteries. And there are some good twists. In fact one of the biggest mysteries is revealed midway through the movie which actually led me to check the time thinking \"damn, are we near the end already?\" but nope, they were just taking the movie on a left turn to Albuquerque that I did not anticipate and changed the course of the whole thing. Johnson has constructed a great mystery in the spirit of the classics. The fun of it too is how many twists there are without it ever feeling overdone. In that way also you can predict a few twists, but not another, so have fun feeling smart and still feel surprised by the others. It's just a classic fun film of its type.","user":"MR_Heraclius","rank":[75,96]}]