[{"title":"I thought we the audience deserve this movie","rating":6,"date":"8 February 2019","review":"\"Womit haben wir das verdient?\", which means something along the lines of \"How on Earth did we deserve this\" is a new Austrian 2018 movie that runs for pretty much exactly 90 minutes and was written and directed by Eva Spreitzhofer around her 50th birthday, so yes she is a fairly experienced filmmaker for quite a while, even if in terms of being the director, the person in charge she is not as prolific. Anyway, she got a decent cast here, you can read the names yourself. My favorite was definitely Simon Schwarz, who was an absolute scene stealer in my opinion, but yeah I am a bit biased towards him as I quite like him in general. Shame he didn't have more screen time. Caroline Peters has also received some strong awards attention recently, so good to see her on board as well and she played the part well without going over the top and basically hit all the right notes. The problem is that the young actress really struggled to hold her own against these experienced actors, especially Peters. I must say they should have cast somebody else for the role of the girl converting to Islam. She did not feel particularly authentic and there was nothing behind her character except her moaning, complaining and objecting unfortunately. But even with this major flaw, it was still a pretty good watch overall. Because Austrians have a completely different approach to this subject. Had this movie been made here in Germany, I am sure it would have turned into a complete failure with everybody being so careful and focused to be entirely politically correct and not offend a single Muslim. This one not so much. For example the very brief part of Kida Khodr Ramadan was very memorable because of how absurd and against women it was and sadly this is the reality in Islam, in the original countries even more than here or in Austria. Or the bizarre marriage plot that also could have happened this way and that he would have been perfectly fine with her giving birth to his children despite not one of the two loving the other. But it is of course not completely against Islam. There are many good and sincere parts in favor of it and as a consequencee the film works because it fakes nothing, but isn't too harsh either. It just feels real. And the fact that almost every performance is the way it should be is also fine. It is a funny movie at times, but if you let it to it can also get close enough to you, so that you think about it a bit. And that sure is a success. But with all the positive I am writing I mustg also mention a negative aspect, namely the ending and this was not just one moment, but a really long scene when they have muslims, right-wingers and feminists clash and that sure was bizarre, like a very clumsy attempt to get out of the film by the filmmaker without really offending anybody. Quite a shame they messed the film up this much there and by the way even if the young woman is confident, are we really supposed to believe she is the head and speaker on a presentation that she barely was a part of or lets say joined very recently? I cannot agree with that. But for every weak moment I can also think of 2 good ones like the fact that the mother is definitely not really anti-Muslim, but is much more against extremist violence from the right side of the political scale. Or how she virtually agrees with everything the mother of the Muslim girl says despite the two in theory wanting the exact opposite. That was an interesting moment and really well-written. As most other scenes from this 1.5-hour film too. I recommend checking it out. Thumbs up and another brave and good-quality effort from Austria. Go see it if you get the chance.","user":"Horst_In_Translation","rank":[3,5]},{"title":"Not much of Comedy","rating":3,"date":"17 February 2020","review":"This film tries to sell as a comedy film but fails to do so.\nThe 1st half of the movie is like a slow paced TV episode and watching the 2nd half is like skipping through.\nBut this film does not disappoint everyone.\nIt reasonably portrays it's Feminist theme.\nAnd you want to see a girl being free from an \"evil ideology\" and \"hijab oppression\"...?! Yeah ,you got that.\nAlthough the cast and scoring was decent enough.","user":"arnobrafi","rank":[0,0]}]