[{"title":"Solid, informative, fun","rating":8,"date":"29 August 2019","review":"The makers of this documentary have struck a fine balance between their various tools -- fuzzy historic stills and video clips of the band's earlier incarnations (Hill and Beard based in Dallas with Lady Wilde and the Warlocks; Gibbons with The Moving Sidewalks down in Houston), brief animations of key early moments (especially those involving their late manager Bill Ham), very short concert clips in their early prime, and memorable footage from their first music videos directed by Tim Newman for MTV in the early Eighties.<br><br>There are also testimonials from fans such as Billy Bob Thornton, Steve Miller, Josh Homme of Queens of the Stone Age, Dan Auerbach of The Black Keys, and others.<br><br>But the strongest two elements are the interviews with the individual members throughout -- recalling their origins, early choices, war stories (the best involve opening for Hendrix, the Rolling Stones in Hawaii, an early Memphis Blues Festival, Beard's dissection of his substance abuse problems in the late Seventies) -- and footage of the band \"today\" (that is, 2018) playing some favorite, signature tunes at historic Gruene Hall expressly for this film as they closed in on an astonishing 50 years as a working unit with no personnel changes.<br><br>What comes across clearly -- especially if, like me, you were not a rabid fan and follower of this band's career -- is that there was more to ZZ Top than met the eye. Though they had a distinct and unmistakable sound (a brand, if you will), this band also were both smart and lucky enough to hire very good people to handle their promotion, sound production, video work -- everything that was ancillary to the actual music, but crucial to helping it find the massive audience it eventually did.<br><br>That, and the fact that the band managed to absorb interesting currents from the larger music industry as it evolved, such as disco and punk, and were sharp enough to plunge immediately into MTV to promote their work.<br><br>The ZZ Top \"mystique\" was largely cultivated by their manager. They would have liked to appear on Johnny Carson and do interviews, but Ham nixed all of that. Do your music, and make everybody come to you, he said. (Other than Beard's brief mentions of leaving Dallas with a wife and a kid, and destroying a relationship with his substance abuse, there isn't a whiff of a mention of their personal lives otherwise. You get no idea whether Gibbons or Hill ever married or have any children.)<br><br>The story pretty much ends with 1983's _Eliminator_ album and the \"Gimme All Your Lovin'\" and \"Legs\" videos. That's all that's essential to tell the story of the band's origins and success; the rest is disposed of in two sentences on a black screen.<br><br>But the movie goes on to finish with a live performance of \"Blue Jean Blues\" (going all the way back to 1975), intercut with each of the band members talking about why they think they stuck together so long. It's nicely done.","user":"dloft59","rank":[6,6]},{"title":"If you've ever wondered about the TRUE history of ZZ Top, you should watch it","rating":10,"date":"26 July 2019","review":"Had the chance to watch a release of this on a Norweigan site while the boyZZ were touring Europe. QUITE entertaining! These guys are the single, longest-lasting band together with the original members, for 50 years now and are still touring strong. Always mysterious, you'll learn things behind the beards (and the Beard) you probably never knew. It's very well done and extremely entertaining. They're Hall of Famers, \"Official Heroes for the State of Texas\" and three really nice guys. They're ZZ Top. Nuff' said!","user":"DoogieHowdy","rank":[17,23]},{"title":"Nice Documentary But Falls Short","rating":7,"date":"9 March 2020","review":"Like many, we've longed for a detailed documentary of ZZ Top. Now after 50 + years of existence, we finally have one. Banger Films(Metal Evolution, Rush: Beyond The Lighted Stage, Iron Maiden: Flight 666, etc.)have a great track record for doing these kind of documentaries, so we were looking forward to seeing this film. We thoroughly enjoyed this film for the most part and learned a lot about the band's early days. It gives the audience a look at the band's history before all three members come together and what each member were doing prior to the birth of ZZ Top. The documentary also touches on their first album, production, the MTV days, etc. Where this falls short is it discusses nothing after their \"Eliminator\" album. Nor does it touch on their personal life, ie-family, hobbies.There is so much to be told after their Eliminator days, yet nothing was mentioned. It really starts out incredibly well but finished with a whimper.If you're a fan like we are, you'll enjoy it, but you won't know a whole lot more than what we already know for the most part. We expected more from director Sam Dunn, he has never let the audience down, until now.","user":"SaintedSons","rank":[3,3]}]