[{"title":"The remodel that dripped goo.","rating":2,"date":"26 October 2019","review":"Horror is my preferred genre. That having been said, GIRL ON THE THIRD FLOOR did absolutely nothing for me.<br><br>An ex-con by the name of Don Koch, the main character, with a very pregnant wife (who's off somewhere working to support her ex-con husband) is single-handedly renovating a very old house which, as we come to learn, used to be a whorehouse. The catch, of course, is that the house is haunted.<br><br>These story foundations aren't bad. One might imagine an especially tough and resourceful main character fighting the good fight against some difficult and recalcitrant ghosts. Might be pretty good.<br><br>Turns out not.<br><br>Don couldn't be more of an (that word that begins with an \"a\" and ends with \"hole\") with no redeeming or even vaguely likable characteristics. If he's not needlessly isolating his poor dog or paying so little attention to it that it's free to run off and lick up God knows what then he's shutting it out of his room to sleep at night. Unsurprisingly, in the context of a movie like this, the dog doesn't last long.<br><br>When a sexy young thing shows up in a see-through frock, Don can't wait to hop in the sack with her, nevermind his very pregnant wife. Only when the girl becomes inconvenient does he think to call a halt to the festivities.<br><br>In short, the character who plays our \"protagonist\" is probably the most unlikable character in the show.<br><br>Large tracts of the story don't make any sense at all. As Don goes around discovering and repairing various issues with the house, his behavior is unrealistic and unbelievable. Most of the things he repairs seem to involve a large variety of colors and textures of non-specific, dripping, oozing goo. I have to say that, involved in real estate as I am, I've never encountered a house oozing goo of any color, grade or texture. Trust me: if I had it would've been the cause of some concern and might have led to the involvement of a hazmat team. Vaguely oozing goo is simply not typically involved in house renovation projects.<br><br>And how does Don react to goo oozing from every nook, cranny and appliance? Does he investigate it to see what's causing it? Does he make a point of cleaning it all out whenever he encounters it?<br><br>Oh no. He just slops it up with a dirty rag, cuts out an area of drywall, makes a fast patch and gives it a lick of paint and calls it good. What a complete &amp;#$@! presenting a totally unrealistic reaction to a situation.<br><br>The story was unenjoyable and there was no suspension of disbelief, willing or otherwise. The protagonist was incredibly unlikable and unsympathetic. On a personal note, the music Don listened to while working put the irritating, nauseating cherry on top of the whole mess.<br><br>I went to the trouble of growing an extra hand so I could give THIS movie 3 thumbs down.","user":"S_Soma","rank":[98,131]},{"title":"The dog was the best actor in this","rating":1,"date":"10 March 2020","review":"That was genuinely one of the worst films I've ever seen. C.M Punk can't act for toffee but to be fair neither can anyone else in the film. It made absolutely no sense. What the hell was the point of the marbles and why the hell did He randomly just swallow one of them. There was literally nothing good about this film. The camera work was lazy and sloppy. The fact this is even a film is ridiculous who in the right mind signed off on this. I don't get how anyone could rate this higher then a 1","user":"nathanmanson","rank":[27,33]},{"title":"Inconsistent and Flawed Conclusion","rating":3,"date":"10 January 2020","review":"Donald Koch (Phil Brooks), a.k.a. \"Don\", \"King Don\" and \"Tiger\", moves from Chicago to the suburbs since his wife Liz (Trieste Kelly Dunn) is pregnant and they believe the location is adequate to raise a family with children. Liz buys an old house and Don, who is unemployed, goes with his dog Cooper first to renovate the house. Soon he learns from his neighbor Ellie Mueller (Karen Woditsch) that the house was a brothel many years ago. Then he meets another neighbor, the sexy Sarah Yates (Sarah Brooks), and they have sex in the house. When Sarah returns to visit him, he says that their affair was a mistake since he is married and asks her to not come back again. On the weekend, his friend Milo Stone (Travis Delgado) comes to help Don in the renovation. But soon the house shows supernatural events and Milo, Don and Liz learn that the place is haunted with a sordid past.<br><br>\"Girl on the Third Floor\" is little horror film with an intriguing beginning and development and a disappointing conclusion with an inconsistent and flawed ending. What sane person would live with her baby in a haunted house after everything that happened? Does not make any sense the illogical conclusion. My vote is three.<br><br>Title (Brazil): Not Available","user":"claudio_carvalho","rank":[35,49]}]