[{"title":"This Film Will Made You Cry","rating":8,"date":"17 October 2018","review":"Rating 8.5/10\nGood storyline and good acting. A mother's sacrifice. Never disrespect your mother, don't ignore and under estimate their sacrifices.","user":"ymyuseda","rank":[121,156]},{"title":"Scary But Doesn't Make Sense","rating":7,"date":"12 October 2018","review":"Movie is a bit slow but very eerie and scary. Jumped out of my seat a couple of times with the jump scares haha. The ending part was quite touching. The plot was confusing as it doesn't make sense on the ending part when his mom is very much alive. If his mom is alive, then who is the scary ghost(supposedly his mom's spirit) which came to haunt them but also chased away a demon(very fake and badly done CGI effect) from attacking her son? Nevertheless, the play of ambience lighting was very well executed in order to portray eerie and creepy feelings to audience. The makeup(from young to old) on the lead cast worth applauding too.","user":"jeymatt","rank":[2,3]},{"title":"An incoherent scramble of a movie...","rating":3,"date":"20 January 2019","review":"With my fondness for the Asian cinema and Hong Kong cinema in particular, of course I jumped at the chance to get to sit down and watch \"The Lingering\". As if there ever was any doubt.<br><br>What directors Ho Pong Mak and Derrick Tao thought made an effective horror movie, was apparently using loud and sudden noises constantly. But 90% of the times there was nothing following these loud sudden scare sounds, which meant that it became a nuisance to bear witness to, and it didn't work in favor of the movie.<br><br>I don't know what kind of stale tea writers Edmond Wong and Dong Zheng were drinking while writing the storyline, because the storyline and plot was just ludicrous. Towards the end of the movie, when it was revealed what was actually going on, nothing up to that point made any sense - the strange happenings, the apparitions, and so forth. It was all just a random mess of nonsense.<br><br>They had an adequate cast ensemble to perform in the movie, just a shame that they had next to nothing to work with in terms of script, storyline and plot.<br><br>There was nothing scary about \"The Lingering\", aside from the fact that it all felt like it was just made up as directors Ho Pong Mak and Derrick Tao went along.<br><br>If you enjoy Hong Kong horror movies, then there are far, far better choices readily available, and I can't really think of a single reason of recommending this movie.","user":"paul_haakonsen","rank":[0,0]}]