[{"title":"THEY GOT IT ABOUT HALF RIGHT","rating":4,"date":"4 August 2019","review":"In his autobiography, Willard Bean wrote: \"When people tell my story they usually get it about half right.\" This movie is an example of that; the screenwriter got it about half right. The sad thing is the parts he got wrong were deliberately wrong because the writer thought it would make a better story. The real, accurate story would have made a much better movie. Sadder still is that in interviews the writer presented his altered version as true and accurate.\nVisually this movie is beautiful. Mr. Christensen is one of the best cinematopraphers working today. David McConnell does a very good job portraying Willard Bean, but unfortunately, he received some bad direction which made some of his scenes silly and eye-rolling.\nIf you like \"Mormon movies\", you'll love this one. It has some touching moments and some good lessons, and even a thinly disguised Three Nephites Story (which is so poorly put together it leaves the audience wondering what just happened). One of the ways the writer changed the true story was to create an a-little-child-shall-lead-them storyline. This is always good for a few tears whether it's true or not. Adding this storyline feels like an insult to Willard Bean's life and his true character, but it's a guaranteed Kleenex moment in any \"Mormon movie\".\nVisually, I would give this movie 8 out of 10 stars. Unfortunately, Mr Christensen insists on being a one-man band who writes, directs, shoots and produces and I can't give the final product more than 4 out of 10 stars. Had this been a team effort with a good writer who stuck to the true story, and good director working with one of the industries great cinematographers, this could have been an outstanding movie.\nOne final note. Before you lump me in the category of Mormon hater, or disgruntled Latter-day Saint with a chip on his shoulder, I am neither of these. I am a devout Latter-day Saint with no ax to grind. I am simply giving an honest assessment of the movie.","user":"mlh-58","rank":[33,38]},{"title":"Thoroughly enjoyable and uplifting story.","rating":8,"date":"10 March 2020","review":"What a great story! There are not very many films that tell a really good story well, but this is one of them! Treated with love and kindness it fills you with love. This is not really a religious story but one of belief. Great family watch!","user":"tocanepauli","rank":[2,2]},{"title":"An inspiring film that reminds us to simply be kind and show respect to everyone","rating":9,"date":"4 August 2019","review":"Remember films presents a family-friendly movie based on the true story of Williard &amp; Rebecca Bean who served a 24-year mission in Palmyra, New York. The movie takes place 80 years after the \"Mormons\" living there had fled for their lives due to persecution. The leaders of the Church of Jesus Christ of Latter-day Saints asked the Beans to serve a very unique mission there to heal old wounds and attempt to purchase the Hill Cumorah, a site very sacred to members of the church.<br><br>I watched this movie soon after I had just taken a trip to Palmyra for the first time a couple of weeks ago, so it was especially meaningful and touching to me. Today, the church hosts an outdoor pageant on the Hill Cumorah for thousands of audience members in the summertime. The message of the pageant and this movie is that Jesus Christ is the redeemer of the world and to love others as He taught us.<br><br>Directed by T.C. Christensen, the film is geared toward current members of the church, yet offers a universal message of love and faith that everyone can enjoy. He calls this movie \"the greatest story in church history that you've never heard of.\" I hadn't! It was fascinating to learn more about the miracles that occurred at the Smith home. The movie also attempts to point out that Mormons do not worship Joseph Smith but strive to be true followers of Jesus Christ.<br><br>TIPS FOR PARENTS:\nThere is a cute scene when a Palmyra man yells profanities at Mr. Bean but a cow nearby moos to bleep out the bad words.\nSome fighting in and out of the boxing ring\nBullying\nName-calling<br><br>THEMES:\nPure love\nService to others\n\"Maybe sometimes the best way to fight is with love.\" - Rebecca Bean (Cassidy Hubert)\n\"Warm friendship, like the setting sun shines light on everyone.\" - q saying on the wall that someone had cross-stiched as a decoration.\nRebecca quotes a scripture in the Book of Mormon (Jacob 7:26) that says, \"the time passed away with us, and also our lives passed away like as it were unto us a dream.\" The older I get, the more I can definitely relate to that sentiment. Life sure flies by.\nJust keep swinging.\nRespect for others, even if they have different beliefs.<br><br>THINGS I LIKED:<br><br>David McConnell plays Willard Bean, the fighting preacher. He's certainly likable and carries the film very well. I wanted to make him a pie. He actually broke a rib in one of the boxing scenes.\nDavid's chemistry with Cassidy Hubert (who plays his wife) is believable. She is lovely and seemed noticeably younger than him, but that's how it was in real life too.<br><br>Scarlett Hazen plays their daughter Palmyra and is totally adorable. She did a fantastic job and I hope to see her in more films. It's both strange and sweet that they named their daughter Palmyra. She takes some missionaries to the Sacred Grove. This is a picture I took of it when I was recently there! It's beautiful, peaceful, and compels you to look up to heaven.<br><br>I loved learning about some of the miracles that occurred at the Smith house during that time.\nDirector T. C. Christensen has often told epic stories of faith amidst challenges. In this movie, he dives inward into the soul of a man and his spiritual journey to connect with his fellow man and God.\nTrue facts, photos, and video clips are shown at the end of the movie. I always love that.\nMembers of the Latter-day Saint church will get a kick out of seeing a young Gordon B. Hinckley as a missionary. He later became the beloved 15th president of the church.\nSome will say that the movie is saccharine sweet, but many parents will be thrilled to find a family-friendly film that is uplifting and reminds us to be kind to others.<br><br>THINGS I DIDN'T LIKE:<br><br>Some of the dialogue is very clunky.\nIf you're not a member of the Church of Jesus Christ of Latter-day Saints, you won't quite understand the significance of several things that happen in the film. It's helpful to know a little bit about \"Mormon\" history before watching the movie.\nDid it really take the Beans 6 years to figure out that they should just love and serve their neighbors?\nNot all of the humor works.\nSurprisingly, the movie was filmed in Utah! These are some pictures I took of the real Smith house in Palmyra on my recent trip.<br><br>You can read the rest of my movie review and see photos of the real Smith house in Palmyra that I took when I visited there 2 weeks ago at Movie Review Mom!","user":"trinaboice","rank":[7,22]}]