[{"title":"The makers should consider their audience","rating":1,"date":"22 October 2018","review":"When my 3 year old Grandson watched this film he burst into tears when Fireman Sam was told that he couldn't be a fireman anymore. He was upset for the rest of the film. This is not a film for adults, its for toddlers and the makers should realise the affect that it has.\nMy Grandson loves Fireman Sam and would watch it all day but even after the film finished and Sam was re-instated it still left him unsure whether he would see Sam again. No matter how much we tried to explain that Sam would be ok, we couldn't placate him","user":"pprichardsoningol","rank":[7,10]},{"title":"Terrible for small children","rating":7,"date":"26 February 2019","review":"I understand why they have done what they have done but when you have granddaughters who live watching the show suddenly burst into tears because there hero character, (yes even at 3&amp;5 years old) is not going to be a fireman anymore. I then have to spend ages trying to tell them that it's just a film and he will be a fireman again then I think you need to look at the wider picture there are probably thousands of people had the same problem. Yes I understand why it was made that way but come on its a small children's animated program. They don't understand sabotage and I don't really want to be explaining it to a 3yr old","user":"duncanquirke","rank":[3,5]},{"title":"If your kids love Sam don't let them watch this","rating":2,"date":"4 January 2020","review":"My 4.5 year old son broke into tears after Sam had to quit being a fireman and shouted that he doesn't want to watch it anymore. Who in their right mind would write such a script for a movie for preschoolers? After this scene we had to make him sit to the end to see that everything turned out ok. But it hit him so hard that even when Sam was made a fireman again, he was very upset. Also the ending is VERY intense and really inappropriate for young children.\nSo if your kids love Sam then don't let them watch this.","user":"glootech-1","rank":[1,1]}]