[{"title":"Sometimes, I feel he gets it wrong...","rating":9,"date":"19 October 2018","review":"And although this show was mighty close to crossing the line, the empathy I had for Phil during the show was tremendous. I feel like I've just watched a miracle happen. Really good show, always been a fan of Derren Brown and this is one of his best experiments by far!<br><br>Bravo 👏","user":"barmybramgaming","rank":[24,38]},{"title":"Not his best","rating":7,"date":"22 October 2018","review":"I am a big fan of Derren Brown, through the years he has made me laugh, think, and be struck with awe.\nThis, however, felt a little too staged at times. I get that they have to edit it down to a length and pace that don't scare people away, but it would have benefitted from 10-15 minutes more.\nI was entertained, though.<br><br>What baffles me the most, is the other reviewers here who bash it for its \"political agenda\".\nTo you I will just say, that when you write stuff like this, it looks like you're okay with people hating, and killing, others for no good reason.\nAlso, you obviously didn't pay attention, as Derren ended the show with talking about how both extremes could come together to find a solution. But maybe you had already turned out, because you were hurt that they told you that killing is bad.\nSeeing this as a political agenda doesn't reflect well on you.\nNot killing shouldn't be a left or right issue, it should be a human issue.","user":"DannX68","rank":[17,26]},{"title":"Forced","rating":5,"date":"22 October 2018","review":"Huge Derren fan but his latest release felt very forced and over politicised. Although the main protagonist wasn't an actor it had the feeling that he was in the way he was so forthrite in his views, yet showed a huge amount of compassion when these beliefs were challenged with very basic tasks. Just didn't have that usual uniqueness you come to expect with Derren. It feels like he may almost have some sort of writers block and new releases are now just rehashed versions of older projects. This had the feel of other stuff he's done just in a political guise but despite all that I was still entertained.","user":"tinohann","rank":[16,29]}]