[{"title":"More people need to see this","rating":9,"date":"21 December 2019","review":"It feels like this movie is being swept under the rug. I won't say by whom, but I will remove my tin foil hat now. Fantastic fantastic film. This movie really rocked my world. It took me a few days to calm down I was so enraged at the subject matter. Unbelievable crimes against humanity. But because Dupont makes 75 billion dollars a year nobody can touch them. Not even the government. Evvryone should see this. Very thrilling and well made. Mark Rufallo can go fly a kite though. He's the same as he always is","user":"branflakes4547","rank":[272,295]},{"title":"Scary as hell when I learned what the movie was about","rating":1,"date":"1 December 2019","review":"This is one scary movie because it's something that stretched into recent times ... and really happened. It's about self-regulation, big-business, medical disasters and cover-ups on a scale that just doesn't seem possible in today's world.<br><br>I had no idea this movie was about one of the most well-known brands in the world (that DuPont owns) ... and the terrible secret behind it. Since the name is not advertised in the previews, I won't spoil it here ... but everyone has heard of it and ... ugh ... been somewhat contaminated by it.<br><br>This is not really an \"action\" movie ... it's a bit of a slow-burn as developments take place over stretches of time. Mark Ruffalo's performance is fine ... though it's fair to say there are other actors who could have put in more compelling and watchable performances.<br><br>I'd have to admit that if the movie wasn't about real events, it would be so-so. However, because it is based on actual events ... you can't help but want to know how the movie unfolds.<br><br>While there are some unexplained issues relating to the main character's law firm and boss (who inexplicably seem to side with an underdog case) ... it's not enough to derail the story ... because the main plot really did transpire.<br><br>It's a good movie to remind us that we're not as protected by our systems, institutions and government as we'd like to think.","user":"Vic_max","rank":[221,245]},{"title":"EVERYONE should see this movie.","rating":9,"date":"6 December 2019","review":"EVERYONE needs to see this movie. These chemicals are in all of us, especially C8 (PFOA). Derived from The Manhattan Project, DuPont used one of the most toxic \"forever chemicals\" in everything from cooking products to paint. 99% of all humans have it in their systems.<br><br>Before you dismiss this as \"hyperbole\" or exaggerated for artistic license, don't. This is based on decades of documented and well known civll and criminal cases, countless deaths, DuPont's own records they tried to hide, and on and on. This isn't another \"liberal agenda\" film as some often state as a means of dismissal - this is about all of us and knows no political bounds. Please, I sincerely implore you, watch this movie and do your own research if you doubt any of it - and prepare to be gutted (warning: not an uplifting film).","user":"StarkerMann","rank":[224,250]}]