[{"title":"A heartfelt and honest indictment of war.....","rating":10,"date":"30 January 2020","review":"There's a real sense of tragedy and loss inherent in Korean made war films. Like their Russian counterparts, they don't glorify war but show it for what it is, the senseless and wasteful loss of mostly, young life.<br><br>Battle of Jangsari is no exception. Its genuinely hard watching bright, young, hopeful lives, wiped away by the efficient industrialised ugliness, of modern warfare. What is also to this films credit is its treatment of soldiers on both sides of the conflict, as human beings. Ordinary people, afraid to die, who only want to return home to their parents and loved ones.<br><br>The acting is, in short, mostly excellent, the cinematography outstanding and the approach to telling the story of these young people heartfelt, honest and reverential.<br><br>10/10 from me.","user":"s3276169","rank":[6,6]},{"title":"raw","rating":6,"date":"18 November 2019","review":"Its the korean war spun out in the story of the battle of jangsari-beach. its a bittersweet film with extremely lots of death and misery, and droppings of sentimentalia and heart grieving emotions of angst and fear.<br><br>its a classic war movie, made the korean way and style, there are the usual problem differing a south from a north soldier especially in the dark surroundings takes, but all the killings do give some clues which side youre on.<br><br>the warbattles are a ravaging kill a kill nonstop, some vfx and cgi are used especially in the naval shoots, and some are good and some not that good. in the end it feels like these men and woman where the forgotten soldiers and left there because the un-forces were far too toothless and badly organized at that front.<br><br>if youre keen on war history its a film must see, it felt like a hammerblow to me, therefore recommended","user":"ops-52535","rank":[9,12]},{"title":"Far better than many big budget Hollywood war movies","rating":10,"date":"19 January 2020","review":"On a relatively small budget South Korea managed to make a war movie that is both exciting well filmed and based on a true signifcant story. All the different action sequences are very well filmed. The landing scene is exciting terrifying and very well filmed. Better than Saving Private Ryan which was so gory that the bigger picture was sacrificed and you didn't know who was being shot. The hand to hand combat in the trenches and going up the hill is very real. The cast really can act combat convincingly. The tank in the tunnel is tense. For the grand finale the escape at the beach is so much better than that terrible Dunkirk movie by far because you are emotionally invested in the characters and know them so you are rooting for them to make it. Terrifying and frustrating. No exaggerated slow motion like in Chinese War movies.<br><br>The human element is well integrated in the middle of the movie. Surprisingly moving back stories. The problem of those caught between North and South is well brought to life by the North Korean defector and his cousin. The only thing I didn't like is the self sacrifice at the end of the two on the beach. They might as well have left since it was a lost cause by then. The lovely Megan Fox does a surprisingly good job in a serious historical role of a composite war reporter voicing the underdog position of the suicide mission.<br><br>More involving and enjoyable than 1917, Saving Private Ryan and Dunkirk.","user":"phd_travel","rank":[7,9]}]