[{"title":"Just buy the album, and skip this trash.","rating":3,"date":"1 August 2019","review":"The film has issues from the offset. The director likes to linger on boring shots, and many of the other scenes are choppy montages set to the songs written for this film by Biffy Clyro.\nThe soundtrack itself is pretty great, but its implementation in the film is rather jarring. The songs will sometimes appear suddenly, and clash with the mood. Sometimes, the songs appear to be diegetic, but seem to have been added later, as the actors aren't reacting to how it sounds. Or they just have no rhythm.\nThe acting in general ranges from poor, to fine; nothing special. I can't tell if some of Laura Harrier's smiling during her scenes is a character choice, or her screwing up.\nThe plot of this film is very thin, and it has serious pacing issues. Any conflict the film has is shallow, and easily solved within minutes. Combined with the basic dialogue, underwhelming acting, and the cinematography, it makes the film an incredibly tedious experience. I didn't even notice when the film was reaching its end, because it never seemed to be building to anything.\nThe only part that remotely captured my interest was the segment set to the song \"Tunnels And Trees\"; one of many scenes consisting of a kind of montage to one of the songs, but the only one which I actually found compelling.\nTL;DR: Just buy the album, and skip this trash.","user":"nshaw2311","rank":[13,14]},{"title":"Umm. What can I say really?","rating":4,"date":"4 December 2019","review":"Pretty bad movie. Didn't really understand it. I thought the ending was really abrupt and didn't explain the ending well. Really unsatisfying and anticlimactic. Only bit I enjoyed was the soundtrack from my favourite band of all time, good ol' Biffy Clyro. Seriously, don't bother watching the film. Not even for the soundtrack like I did. Really not worth it. Just buy the album on vinyl because it's a really nice vinyl with a killer soundtrack and then you'll be all set. Forget the movie even existed. Just erase it from your memory. A huge flop in my opinion.","user":"simonneil","rank":[1,1]},{"title":"Great soundtrack, dull film.","rating":5,"date":"2 January 2020","review":"The soundtrack is awesome so I'd definitely recommend just getting that tbh. The film however, is very dull. It doesn't really do anything or go anywhere.","user":"cpmtg6","rank":[0,0]}]