[{"title":"Metal AF","rating":8,"date":"1 October 2019","review":"Look, there's not really a lot that happens in Bliss. There's a lot of setup, especially for a horror movie, and you have to wait a while for it to pay off. At times reminiscent of Starry Eyes, Bliss is three-quarters drama-- but then, aren't us horror fans always telling our judgmental friends that drama and horror aren't that different? Horror is just tragedy written all-caps.<br><br>But this isn't anything you'd call slow burn. It's not understated. It's loud. It's in your face. There's a lot of blood. There are a lot of boobs. There are a lot of bloody boobs. And there's no apology for any of that, not in Bliss-- there's exultation.<br><br>Eventually, I guess, Bliss is supernatural horror, playing around a popular enough trope, adding it's own fresh take on the (frankly tired) canon. I'd tell you more, except maybe you don't want to be spoiled. But really, it doesn't matter, not for this film. It's not about the plot, not about any kind of twist. It's about the character and the imagery.<br><br>There are a few reasons why Bliss really works. First, the lead is perfect. \"Angsty,\" yes, but not to the point of parody. Madison takes us along for the ride in a way that few could. Second, the visuals are stunning. Part of this is filming. Part of it is editing. Most of it is just having the guts to follow the vision. If Bliss is part Starry Eyes, it's equally part Beyond the Black Rainbow: style above all.","user":"vasiln","rank":[20,31]},{"title":"Most Annoying Main Character Ever","rating":25,"date":"25 December 2019","review":"The actresses' mediocre performance doesn't help, but jesus, could they have written this girl to be more obnoxious, annoying, and a piece of crap? Ruins what is an otherwise a great job behind the camera.","user":"mmachuteboxe","rank":[17,27]},{"title":"What a crappy movie","rating":3,"date":"22 January 2020","review":"This was a waste of time! The main character is just so annoying but well played. But then she just becomes stupidly underwritten and badly played.\nThe horror is juste gore all over and the interesting parts are lost in over-stylish shots... The characters from intriguing become a parody of horror characters. And the abuse of the  word doesn't give an edge to the situations but empties all the dialogue of any meaning. It was a waste of time for everyone. Watch The Devil's candy instead it is about better painting and excellent horror with loads of good heavy music.","user":"cathyisa","rank":[12,18]}]