[{"title":"Badly Executed Tree Sap Posing As Something Important","rating":3,"date":"11 March 2020","review":"This movie is actually dreadful.<br><br>It's sprawling shallowness shows a desperation to be liked, yet my take away is that it sloppily reveals itself as a \"we're just being quirky, accept we really really believe what we're spoon-feeding, yet let's put a few things here and there to try and win everyone over, while truly condescending to the viewer with consistently unbelievable human behavior (i.e.: terrible acting)\" movie.<br><br>It will be hyped, probably artificially, and a lot of people will defend it because they believe in what it attempted, or that it tried to say important stuff. It's as bad as a bad sitcom's lowest episodes. An ultimately cookie cutter story put in a blender and trying so hard to check every social box to try to win everyone's love (while slyly hinting at blame or guilt if you disagree with the narratives).\nIt comes off as simply juvenile filmmaking posing as supposed big ideas, but, oh, yeah, \"we're just a sweet little comedy-drama though\".\nA lead actress who wrote the script should be far better at delivering their lines and emotions believably, and the heavy-handed situations just fall flat again, and again, and again, until it finally ends.<br><br>Lemmings will call it brave, I'm sure.","user":"mrdirector16","rank":[17,32]},{"title":"Delightful","rating":9,"date":"7 August 2019","review":"\"Frances\" deals with a lot of hot issues, like abortion, acceptance no matter gender, orientation,and past mistakes and it tackles them all with immense heart, exploring other personal themes, such as depression and life's crisis, all with such a human touch that it's hard not to connect to these characters. Kelly O Sullivan is so natural in this role that it's almost feels like a biography. Her writing is just as impressive as her acting, and I'm excited to see what the future holds for her in the world of cinema, because I think she's gonna turn some heads. The moms are both immensely talented as well as the daughter. At the end of this movie I couldn't help but smile and nod along with the music, relishing the time I got to spend with these characters. My only real quip is that it does longer a bit towards the end, and there is one scene that is a bit too on the nose, but the rest of the film is just too good and done with too good of intentions to really knock it too much.\nOverall Saint Frances is a stunningly delightful film, one that I recommend to anyone and everyone no matter personal beliefs. You may come out changed, you may come out even stronger in your beliefs, you may come out not changed at, all which is fine. One thing is for sure, you'll have a great time with these characters. There's plenty of laughs, tears and morals, and by the end you'll be sure to be rooting for Bridgette and her future.","user":"truemythmedia","rank":[13,27]},{"title":"From a guys perspective....","rating":7,"date":"29 March 2020","review":"I found this film enjoyable - a real slice of life type of film and very well fimed in a very casual but real way. Bridget was very real and likeable (although the wife didn't like her!). Real world issues treated in s real world way. Great Sunday afternoon film...","user":"tocanepauli","rank":[2,3]}]