[{"title":"Missed the Miss Fisher mark","rating":5,"date":"11 March 2020","review":"I love the Miss Fisher TV series. I binge watched it. I found it quirky, whimsical and refreshing. With the TV show, I find it a different kind of suspense as to \"whodunnit\"<br><br>Whilst the movie tried to incorporate all the above, and they were present, they didn't feel the same. It all felt forced.<br><br>Was it because the actors felt pressure to deliver a product for a larger, more global demographic? Was it because it was set in so many locations? The whole \"global\" storyline just feels like it's been done to death in previous movies, especially revolving around Middle Eastern lore &amp; curses. it almost had an Indiana Jones feel to it.<br><br>To me, the whole movie felt a bit garbled and rushed. You couldn't really relate to, or immerse yourself, with what was being shown. I just found it didn't feel \"true\" to the Miss Fisher TV style, even though all the attributes were present.<br><br>I liked the movie, probably because of the nostalgia of loving the original characters from the TV show, but I definitely wouldn't be in a hurry to watch it again.","user":"leese-27271","rank":[32,38]},{"title":"Disappointing!","rating":5,"date":"9 March 2020","review":"I find it surprising that a company that made such a brilliant TV series, was unable to make a good film. There were some bright bits and the acting was good, but the photography was poor and the story disjointed. We briefly re-met the rest of the regulars from the TV series, but they were quickly discarded! I would have preferred to keep the Melbourne setting and stories. I suppose they were trying to interest a wider audience, but it would surprise me if they succeeded.","user":"mannbarbara","rank":[33,40]},{"title":"Love Miss Fisher but the film missed the mark!!","rating":5,"date":"1 March 2020","review":"Love the series and a huge fan, all the glitz and glamour, fun and frivolity that we want and expect.<br><br>But the film fell short on two fronts. Where were the rest of the gang, missing for all of the film but about one minute. Such a shame. It was like bacon and egg without the bacon!!<br><br>And the story line was weird, hard to follow and elusive. After all it is an Aussie show. Lets fundamentally keep it that way.<br><br>Hope for more in the next film.","user":"graham-69851","rank":[22,29]}]