[{"title":"This is not an action film, it's a comedy - aka joke.","rating":2,"date":"25 December 2018","review":"Wow, I couldn't even get past the 35 min mark of the 77 min length.<br><br>Writer and director Rene Perez has a bunch of films on his resume (most look like knock-offs from popular films), and all rated pretty much below a 3. I get these are all D-grade low budget independent films, but how about sitting out a few films and taking that money to go to film school. I've seen better writing and directing from a 5th grade drama class.<br><br>Right from the start, the outdoor scenes were all truncated from the suns flares. There's a thing called a lens cup, and it has an obvious use. Plus I'm pretty sure the lens needed a good spit and clean lol.<br><br>The scenes were all dragged out, mainly pointless, and the plot a huge mess. Way too obvious scene to scene, or jumping into a new scene out of nowhere. Bad editing. The fight (if I can even call it that) scenes' choreography was a joke. The slow motion was lame. The dialogue was even lamer. The acting was just terrible.<br><br>I'm giving this film a very generous 2/10 instead of a 1/10 only because I couldn't stop laughing at how bad it was, and because Emily Sweet was looking, well, sweet. Also because I do admire Rene's tenaciousness to keep making films even though they suck. Seriously, please Rene, no more films; save up the money and go to film school.","user":"TheTopDawgCritic","rank":[22,25]},{"title":"Film is too good a term to use for this garbage.","rating":1,"date":"9 January 2019","review":"Ok I guess it happened to be caught on film, however, I think the actual film is worth more than this garbage that you call a movie. John Schneider must be absolutely desperate to take this role let alone have his name in the credits.<br><br>Pathetic to put it mildly!","user":"piratejimbo","rank":[7,8]},{"title":"Worst Film I've seen in years","rating":1,"date":"8 June 2019","review":"Did 29 minutes thinking it's got to get better. Rated one as can't rate any lower.","user":"ecclestn","rank":[3,3]}]