[{"title":"Froot Loops !","rating":5,"date":"31 January 2020","review":"This story is what is referred to, as a \"guilty pleasure\", or a guilty waste of time. It's a silly, emotionally-manipulative waste of time, which starts out fairly good and degenerates into more and more \"wacko\", as it goes along. The crazy plot keeps your inner \"bad news junkie\" salivating, even though you know, you're being taken for a ride,\"over the top\". Near the end, I actually thought, that it was going to go off formula, which surprised me, but it was just a tease. It actually went back to the expected script, amazingly, in a most awkward and unexplained manner.","user":"terrazygotes-30881","rank":[2,2]},{"title":"Effortful but Underplayed","rating":5,"date":"25 January 2020","review":"Lucky McKee (\"May\", \"Red\", \"The Woman\"), an arguably underappreciated filmmaker, is tearing a family apart in his newest feature \"Kindred Spirits\". It's not as impressive or dig-deep as \"May\" or \"The Woman\", but threads along nicely, offering a neat albeit familiar feeling story. I gotta say one thing though - I don't feel like the movie's poster is very beneficial, the surprisingly cheap looking result doesn't sell it at all.<br><br>Sadie (Caitlin Stasey) resurfaces to visit her childhood home after years of absence, to be together with her sister Chloe (Thora Birch) who's a single mother, and her daughter Nicole (Sasha Frolova) whose life Sadie saved 10 years before. Soon enough we discover that Sadie's past and traumas has affected her badly &amp; she starts manipulating her family and everybody around them to achieve her ill minded goal. The story flows evenly, takes frequent turns, makes you feel some effort behind it and the surrounding atmosphere. The problem, however, is that despite the fact that all of the elements work at least on a decent level, the very same elements also feel familiar, rehashed and rather uninspiring. Messed up child/mother/sister/daughter/lover dynamics, dysfunctional family themes, dangers of obsession, little bit of that Hitchcockian feel, but not much originality. The most underwhelming part is the ending, the filmmakers optioned for the one I easily predicted during the first half an hour, the one that probably most did. A little awkward, the ending was. Nevertheless, \"Kindred Spirits\" also offer up decent performances by all the lead ladies &amp; certain indie scene fans will appreciate seeing Macon Blair. Visually the considerably low budget can be seen clearly and often, in cinematography, editing and in the lack of action or creative camera work, but McKee still successfully manages to make it all worthwhile. The original score was decent, I can't say that about all horror movies on the same budget level.<br><br>\"Kindred Spirits\" most definitely isn't a bad movie, but it also feels underplayed, as if the potential has not been fully realised. That, plus the familiar story &amp; characters along with the low budget makes up an average suburban thriller that's less than a sum of its good parts. Recommended to the fans of the cast &amp; Lucky McKee. My rating: 5/10.","user":"TwistedContent","rank":[2,2]},{"title":"An entertaining ride","rating":7,"date":"5 November 2019","review":"Sadie moves back in with her estranged sister, Chloe and her teenage daughter Nicole. Nicole is a troubled teenage girl, but she has one true fried, Shay. Derek is her boyfriend, and he seems to make Nicole a happy girl again.<br><br>The movie really focuses on Sadie as we see how unhinged she becomes, as she starts to tear the entire family apart. Nothing will stop her to get what she wants, even if that means hurting the people she supposedly loves.<br><br>The actress that plays Sadie is the entire reason to spend the time to watch. She chews up the scenery every time she is on screen. Especially as we ride along with her, in her descent to madness.","user":"metfan412","rank":[6,12]}]