[{"title":"\"They will be called to account for their sin.\"","rating":7,"date":"2 February 2020","review":"This is a bit of an anomaly compared to your traditional Western. There really aren't any good guys here, except maybe for the black mute who gives kidnapped teenager Ruth (Anna Harr) the high sign to make a break away from the Tullis gang. Even U.S. Marshal Quincy Hollis Foster has a tarnished reputation for killing women and children during his Civil War years, and it's a toss up as to whether he's any better than the outlaws he's tracking. And as for the religious community at Eminence Hill, well, they could just as well been from Eminence Hell. I thought the elements in the story were rather creative, like the drugging of the Tullis bunch and Foster's low key profile that exploded like fury during that confrontation with the four bounty hunters. The casting of Owen Conway as Marshal Foster made it appear like he was a poor excuse for a lawman, but his reputation revealed in the story portrayed him as a heartless, stone cold killer. So that was a good bit of misdirection.<br><br>However the film is guilty of a little bait and switch, at least the DVD cover is, in as much as Lance Henriksen is given prominence there, along with third billing for only about five minutes in the picture. Just long enough to call out Foster for his checkered past and take a knife to the gut for his trouble. Man, did he look awful here, though make-up might have been responsible for looking even older than his seventy nine years. Barry Corbin approaching the same age looked just about as ancient in the role of Eminence community patriarch Noah.<br><br>The story takes on some grimmer aspects in the later going when the Eminence folks deal with gang member Cyrus (Louie Iaccarino) via the slasher/gore route, and when Noah's cook Wilhelmina (Brinke Stevens) decides to deal with Ruth with some well aimed stones to the head. You sure didn't want to get on the wrong side of these pious, church folk. Just about everyone in the story is dealt with harshly, with Carson Garret (Charlie Motley) the only one coming out unscathed. And Ruth, of course, although the closing scene had it appear like she would be preparing herself to look for trouble. The only thing left wanting for this viewer after all the red herring references - where the heck was Blood Feathers?","user":"classicsoncall","rank":[3,3]},{"title":"Well - I liked it !","rating":6,"date":"7 November 2019","review":"No other User Reviews yet. Twisty little western, obviously shot on a budget. My favorite bit was the way all the characters, obviously not well read in western history, talked like they were reading cue cards from a stage play. The clothes were too clean, the teeth too straight. To me it translated to \"surreal\". My kind of film. The sociopathic Marshall, the all to clean old cowpoke, the Hollywood hair bad guy, and the parody of religious fanatics (although unfortunately I think you could find them in real life). It was utterly entertaining to me. A cross between a TV western, a Shakespearean play, and a slasher. Wheee! I do kind of object to Lance Henriksen getting a top billing spot. He had less than 5 minutes and was obviously just there for his name. Collect that check. He did his part well. A number of characters were introduced and thrown away, but again, it wasn't trying to be historical or realistic. I'd watch it again someday.","user":"jayg_58","rank":[9,16]},{"title":"B movie","rating":1,"date":"28 February 2020","review":"So bad movie, bad acting, bad everything. So sad the story is ok but the acting is so bad.","user":"kramforsbo","rank":[3,6]}]