[{"title":"Ol skool slasher is back with a nice twist n what a lovely coincidence that I saw this on Halloween.","rating":7,"date":"30 October 2019","review":"I was not keen on watching it after reading some bad reviews on IMDb but Patrick Lussier's name gave me assurance that this film shud be checked by horror/slasher/Halloween fans.\nThe guy has got some very good experience in horror films as director, writer n editor.\nThe best part of this film is the fast paced brutal stabbings.\nFound the film a bit lengthy but the twists n turns kept me hooked.<br><br>Can someone explain me why the chap in the wheelchair was in inmate's clothes.\nThe scene at 1hr 36th min is so picturesque.\nOpen sitting place for coffee near a pond.<br><br>I trust BA_Harrison's reviews n I skipped Scary Stories to Tell in the Dark and saw Trick n Trick which turned out to be a solid slasher.","user":"Fella_shibby","rank":[35,42]},{"title":"Goofy but kinda fun","rating":6,"date":"20 October 2019","review":"Maybe one or 2 scares. A bit thrilling. A bit goofy. Not too bad. Kinda an okay slasher film. Moderate twist in here! We enjoyed it. It's fun even if it's not the greatest","user":"saphira_dragon-80270","rank":[17,22]},{"title":"Acceptable Halloween Slice and Dicer","rating":6,"date":"12 January 2020","review":"Trick won't win any awards anytime soon, but it's far from the disaster many people have been making it out to be. I walked in expecting the worst, but the first 20 minutes genuinely gripped me and even made me jump once. As the film continues, it mostly becomes a Dr. Loomis vs. Michael Myers storyline with Omar Epps' frazzled detective trying to make sense of how a seemingly normal teenage male could survive a few gunshots and a fall off a hospital roof and still continue to kill people every Halloween for a number of years. Could it be a copycat killer? You'll have to stick with Trick to find out and, once you do, you'll most likely be let down.<br><br>While most of the film plays out like a supernatural-tinged slasher, the last 15 minutes of the movie, where the film finally reveals what's really been going on, is likely to inspire many groans and rolling eyes. There's a piece of an interesting idea in there, but it's not as well-executed as it could have been. There's a final twist at the end that's really a groaner and makes no sense whatsoever.<br><br>The acting is at least passable for most of the film and it's nice to see genre icon Tom Atkins getting something to do every now and then. It also might be one of the better of the recent \"the corpses in this haunted house are real\" movies that seem to be coming out all the time. There's some good suspense here and there, too, so Trick is far from a complete waste of time.","user":"carolinephillips-47427","rank":[5,5]}]