[{"title":"All over the place - no consistent tone","rating":5,"date":"3 December 2019","review":"While rich in material, footage and commentary, this documentary about the classic wushia action films from Hong Kong is so badly connected, a narrative that goes everywhere and nowhere, thus making it inaccessible for general audiences unfamiliar with the genre. It starts very abruptly, talking about Shaw Bros without a proper context of what was the scenario and how these movies came out to be - it starts in the middle, then it goes back briefly, then it goes forward again. It doesn't get too deep into the production, it goes back and forth in the timeline, misses some key moments and mostly sticks with the american perspective, particularly of sleazy movie theaters in uptown NYC in the 70s. That is all fine, but, how about a little international perspective? Or from the HK/Chinese market?<br><br>I give it 5 stars for the subject matter, the footage and some of the interviews; I give it 0 stars for the HORRIBLE editing and directing.","user":"Ricardo-36","rank":[24,30]},{"title":"Should have been SOOOO much more","rating":7,"date":"22 December 2019","review":"There's some good stuff here, but it's undone by the lack of consistency and scattershot nature of the timeline. Jumping back and forth and all over the place, many times lacking context and making some logical leaps that maybe don't work. But you'll probably get a few watch ideas, so it's still worth a look.","user":"jellopuke","rank":[3,3]},{"title":"functional surface work","rating":7,"date":"27 December 2019","review":"It's a documentary of the Hong Kong Kung Fu movies and their influences to today. It starts with the Shaw brothers in the 60's, then Golden Harvest with the explosion that is Bruce Lee, then the Bruce-ploitation period after his death, early success in America especially in the black community and its influence in breakdancing, new stars in Jackie Chan and Sammo Hung, move to America after the 1997 Asian financial crisis, and YouTube &amp; beyond. It's less than two hours and can really only be surface level examination. It's a functional recounting of events. It could do well to compare the early HK action movies with their cohorts in America and Japan. It doesn't arise in isolation or solely from Chinese opera. Mostly, I wish for more details in every section except the last one. This is good shorthand notes for all cinephiles and action lovers.","user":"SnoopyStyle","rank":[1,1]}]