[{"title":"Well done","rating":8,"date":"27 October 2018","review":"I don't know much about the Constantine character apart from the old Keanu Reeves movie which I saw a long time ago (and liked) and an appearance in Justice League Dark. I never watched the TV show or animated series.<br><br>Having said that, I thought this movie was good. It is adult themed, which fits the story, and apart from one odd way of sharing memories between Constantine and another character, I don't think the adult nature was over done.<br><br>It was well paced, had interesting characters and stakes, and surprisingly carried emotional weight at the end and showed what a toll this life takes on the titular character.<br><br>All in all, I was impressed. DC continues its record of well made animated features.","user":"spmact","rank":[25,26]},{"title":"Do yourself a favour mate and watch this movie over the mini series.","rating":9,"date":"31 January 2019","review":"I have just watched this movie and I enjoyed it.<br><br>If you watched the the mini series this movie adapts on too it and goes further on with the story.<br><br>Animation wise it is definitely high quality.<br><br>It is funny that Damian O Hare the voice of John Constantine is work with Matt Ryan the true John Constantine actor. With the great recurring voice talents Laura Bailey as Ash the Heeler and Emily O'Brien as Chas Chandler's wife makes it even. The rest of the voice cast was good.<br><br>If you want explore more about John Constantine and his life then this series is worth the watch. I would highly recommend this movie and on that note this movie is not for children.<br><br>See also Freedom Fighters the Ray and Vixen for more animated DC projects from the CW network.","user":"WeAreLive","rank":[7,7]},{"title":"Most faithful adaption of Constantine yet","rating":9,"date":"25 May 2019","review":"That's a mini review about the movie, not the tv show (even if the show is part of the movie). I watched the film yesterday which contained the first 5 episodes of the animated show and took them further into a full, completed story.<br><br>I don't blame people who didn't like the show since the episodes were ridiculously short (only 5 minutes each) but the film is a different story. Matt Ryan shines once again as Constantine with good support from the rest of the cast. The story is probably the darkest story I've seen in an animated film and there are many shocking scenes and surprises. As I mentioned in the title, this is undoubtedly the best adaption of John Constantine. The character is actually a damaged character, haunted from his past, trying to find some purpose in life (at least that's how the original Hellblazer presented him to us) and the film captures that perfectly.<br><br>I liked the live action series, I loved the Justice League Dark film but City of Demons goes even deeper and gives us the darkest and more mature animated film/series in the DC Universe. Highly recommended.","user":"JMichaletos","rank":[5,6]}]