[{"title":"A nightmare","rating":6,"date":"17 October 2019","review":"This surreal and unique film is a literal trek through a teenage boy's nightmare. There's _very_ little to no dialogue until about an hour into the film, when the situation is finally explained, and even then, the dialogue is pretty minimal. The gist is: a comatose victim of kidnapping has been brought to a doctor specializing in PTSD, who also (prepare for nonsense in 3, 2, ...) has the ability to view the boy's dreams and speak to him via microphone. But if you can manage to get your mind past that silliness, the rest of the film is actually really interesting. In fact, I think it would have fared better without any dialogue at all.<br><br>I'd love to only have good things to say about it, as I really did enjoy it, but the ending (which acts as a very short epilogue) _does_ leave much to be desired.","user":"queeroid","rank":[5,6]},{"title":"Good story","rating":8,"date":"10 April 2020","review":"I came into this without knowing anything about the movie. What little they give you at the beginning helps you to realize what is going on; then we learn a little more. I thought it was very well acted and well done.","user":"vacox","rank":[0,0]},{"title":"Inside the brain","rating":3,"date":"8 January 2020","review":"A boy is found in a coma deep in the woods several months after his kidnapping. His kidnapper is still on the loose and he's the only person who has survived an encounter with this killer. To escape his coma and catch the man who committed these crimes, a doctor who specializes in PTSD is going to help him face his fears.<br><br>The 11th Patient was directed by Derek Cole, who has done effects work on Rampage and Aquaman. He also created the 2012 movie An American Ghost Story.<br><br>The film is similar to The Cell in that they have to go into someone's mind to stop a criminal. While this film has a great look, keep in mind that its budget was nowhere near the amount of money that film had to work with.","user":"BandSAboutMovies","rank":[0,0]}]