[{"title":"Great production from a grass-roots team","rating":8,"date":"15 July 2019","review":"My wife and I really enjoyed this - touching, heartfelt and funny, and it showed the devotion of Ruth very well. Special mention for Naomi.","user":"nick-k-smith","rank":[3,3]},{"title":"Genuine and Original musical showcasing great talent","rating":7,"date":"13 July 2019","review":"A new, contemporary take on the story of The Book of Ruth, this version was filmed in North Yorkshire and stars some of the region's best talent in music and film making. Adapted, directed and starring Jay Moussa-Mann and calling on local production teams, Ruth - The Musical is a modern step into biblical history.<br><br>The story is of Ruth, the Moabite woman who, after being widowed, returned to Bethlehem with her mother in law and began to rebuild her life. Along the way she faces prejudice, racism, sexism and yet has the strength and resolve to remain true to her choice - that of accepting the Israelites as her religion and their God as her own and by doing so she receives redemption<br><br>Now, I will be honest, I am not a religious person so whilst I am aware of the Book of Ruth, I have not explored its themes or messages. Even at Sunday school the old testament and the intricacies of the different races confused me however this new musical version brings clarity and purpose to the teachings and highlights themes which remain true in the modern world - tolerance, understanding, acceptance and integration.<br><br>Ruth The Musical is not a ' Jesus Christ Superstar' or a 'Joseph' - the musical numbers support the story, they don't tell it - likewise, being shot in North Yorkshire doesn't detract at all from the feeling of the film. It has a very Turkish/Syrian feel both in the music and the cinematography, and refreshingly avoids portraying the landscape as just rocky deserts.<br><br>Well worth watching and a credit to the team who have produced it on a shoestring budget","user":"lameduck9-192-207750","rank":[3,3]},{"title":"Beautiful story, original music, well shot.","rating":9,"date":"1 July 2019","review":"The story of Ruth is well told and the performances are great around from a young cast, special mention for the Ami character who made me laugh through out.<br><br>The songs stick in my head for days after, the film is family friendly. It may not have anywhere near the budget of something like The Greatest Showman or Lalaland but when you temper your expectations in the context of budget it stands up.","user":"Kevmann16","rank":[4,5]}]