[{"title":"Award for most fake ratings on IMDB?","rating":15,"date":"15 January 2020","review":"In early Sept, within one day of first screening of this film at Toronto, it had 1,400 IMDB nine and ten star ratings which is more people than saw it at the festival.At this point exactly 11 of the 1,400 votes are from accounts which have rated another film. In other words this is &gt;99% fake uprating.\nAt Toronto most of the audience was fidgeting throughout, and look simply fatigued at the end of the film. Forget the few gushing reviews on the 'critics reviews\" section here from reviewers who give everything a ten in hopes of getting free festival junkets. The legit outlets like Variety and Ebert panned this turgid nonsense.\nVariety: \"its convoluted narrative rigging not leading to any particular sense of meaning\" (the rigging and artificiality of the plot is cringeworthy)\nEbert: \"'Human Capital' is the type of middling, middlebrow mediocrity that strives to be about capital-I Ideas but approaches them with the savoir-faire of a toddler.\"<br><br>My take: 1) Can someone tell Marisa Tomei that she cannot act her way out of a paper bag? She was jarringly distracting evidence of overacting in \"Frankie\" and this is worse. The other actors in this, Schreiber, Betty Gabriel, Maya Hawke do OK. 2) what is the point of talking down to the audience and banging them over the head as if they are idiots?<br><br>skip this mess.","user":"random-70778","rank":[296,322]},{"title":"When the 43 producers...","rating":5,"date":"20 March 2020","review":"...and the rest of their film crew - and their family and friends, ridiculously up-vote their film. No way of the current 1,616 ratings this film is even close to a 8.8/10.<br><br>Film critic Noel Murray from the L.A. Times nailed it: \"Frankly, the payoff to the movie's mystery is unsatisfying after all the buildup. None of these three stories really works as a short film on its own.\"<br><br>There's no excuse for this mess considering director Marc Meyers and writer Oren Moverman are not inexperienced film-makers.<br><br>A 5th grader could've written, directed and edited this film better! Think 3-4 different films put in a shredder, then random pieces taped together to make one film.<br><br>There is terrible plot transition between what you'd think is the key story, another one pops up, then a mish-mash of back and forth timelines, then an entirely new focus on another plot, etc. Add to this the terrible pacing, and the 95 min run-time felt like 3 hours of a convoluted mess.<br><br>Meyers also failed miserably in directing his cast - Schreiber and Tomei seemed barely awake, and you couldn't quite place Hawke's personality... one minute she's an introvert, then an extrovert.<br><br>This film had a lot of potential, but missed the mark big time. Maybe too many producers pulling at each other with the direction this film needed to go. Then again, with that many, the phony up-votes were easily achieved.<br><br>Skip this mess or read the novel instead. It's a very generous 5/10 from me.","user":"TheTopDawgCritic","rank":[42,51]},{"title":"I only watched this movie because of it's rating","rating":3,"date":"22 March 2020","review":"I watched this entire movie with great anticipation waiting for a storyline to emerge, Unfortunately, by the end of the movie, I was trying to figure out how it could possibly get such a high  rating. I found nothing interesting about the storyline because it was way too fragmented with too many characters with their own boring stories to tell. By the end of the film, I was very confused about what the exact point it was trying to tell. I wished I hadn't wasted so much of my time watching it.","user":"mwillis-07699","rank":[11,12]}]