[{"title":"Bad Movie, Potro","rating":1,"date":"20 November 2019","review":"The strongest aspect about Club de Cuervos is their leading characters, Isabella and Chava Iglesias are messy but likeable, you comprehend the reason why they do the things they do, and even if they messed it up, they however try to arrange things or do something good in their perspectives.<br><br>La Balada de Hugo Sanchez included a little bit weaker lead character but at least the cast were more extent so they compensate this with the more sympathetic characters and their dynamics.<br><br>\nBut Yo, Potro, doesn't have any of this. His leading character is a good comic relief and a charming  in the context within Club de Cuervos. Outside the original show and in his own movie, Potro is just a terrible person who mess things up and it doesn't care about anything except for himself. The story is boring, the fact that is a Mockumentary makes it worse and the rest of the cast is so forgettable that basically you forget their names after you watch the movie.<br><br>The moral of this movie is... Not because you character is beloved in your show it means he will be a good protagonist for a movie.","user":"edicionccq","rank":[1,1]},{"title":"Don't understand the purpose of the film","rating":3,"date":"26 August 2019","review":"I only watched the first few episodes of Club de Cuervos so maybe I don't know the entire context in which to appreciate this film.  But I watched the film because it featured Argentinean Spanish which I was quite interested in. However, I do not exactly understand what I just watched. It was based off of probably one of the most obnoxious, rude, unlikeable protagonists I had ever seen, and unfortunately, the protagonist never comes around. It is just him causing one trouble after another, from the very beginning to the show till the end. In fact, the actor plays the obnoxious character so well that you kind of start to dislike the actor (The mocumentary format did not help the case). Probably the only redeeming factor of the protagonist is that he has a somewhat hot body, which the film exploits to the fullest. But I don't think it salvages the film as much as the producers might think it does.<br><br>Production-wise, the film follows the mocumentary format pretty closely and even cleverly here and there, and there are some genuinely lol-worthy moments at the very beginning of the film. But soon thereafter the film starts trying to achieve its comedy by means of racist remarks on indigenous Latinos (vs European Latinos) and other rude, obnoxious behavior and remarks of the protagonist that is only somewhat funny and for the most part just downright off-putting. It is like having to spend 2 hours of your day with a hot yet incredibly obnoxious frat boy. I really hoped there would be some character development or even a plot twist but the film pretty much concludes with Porto trolling the after-party of his brother's wedding and giving his newly wed bride a strip show in a thong, who honestly seems like the only character who seems to lowkey like Porto.","user":"haydentk","rank":[1,1]},{"title":"A Far Cry from Club de Cuervos","rating":5,"date":"26 March 2020","review":"Being a fan of \"Club de Cuervos,\" I was highly disappointed in this spin-off. For those of you familiar with the film, this short film revolves around Argentinian goalie Potro. While he makes for an interesting and likable character in \"Club de Cuervos,\" his role as protagonist in \"Yo, Potro\" quickly grows stale. I am not even sure why this movie was made, for it does little to expand upon the foundation built in the original show.<br><br>The plot revolves around Potro returning to his homeland of Argentina to crash his younger brother's wedding (who is a comparably more-famous soccer star) after being fired from Mexican soccer team the Pumas. Along the way, he not only struggles to be accepted by his family, but also struggles with his self-identity as an Argentinian, having spent the last several years of his life in Mexico and having built his soccer career there.<br><br>Right off the bat, some of the most likable characters from the original show (namely Luis Gerardo Méndez's character Chava Iglesias) are completely absent. The \"mockumentary\" format is unoriginal and unjustifiable. There are several off-color and even racist remarks made by Potro which are supposed to be funny. Worst of all, Potro makes a number of bad decisions throughout the film, and, despite what ominous music in the background may lead us to believe, never has to face the consequences of his actions.<br><br>Unless you are a die-hard fan of \"Club de Cuervos\" as I consider myself, do yourself a favor and do not watch this. It literally adds nothing to the original series, unlike the other spin-off, \"The Ballad of Hugo Sanchez.\" The ending of this movie was highly disappointing and left me feeling ripped-off, despite it having been on Netflix. There were some funny moments (Potro's sketchy, scruffy chauffeur/talent agent who lives in his car makes for an entertaining character), but overall, there were no stand-out moments that had me genuinely laughing. There were also some heartwarming moments which lead us to believe that Potro and his brother weren't such bad people after all. Still though, I am not sure what message the makers of this movie were trying to convey. Go watch the \"Ballad of Hugo Chavez\" instead of wasting your time with this one, and if you haven't already, watch \"Club de Cuervos\"!","user":"robertrutledge","rank":[0,0]}]