[{"title":"Disappointed, Janice","rating":9,"date":"15 January 2019","review":"This is a show by youtubers designed FOR THEIR AUDIENCE. It is filled with insider jokes that only make sense if you actually know their content. If you watch this without knowing who they are, in all probability, most of it won't make any sense to you.<br><br>I suppose, if you have no idea who the creators are, you could still watch it, and possibly enjoy it, but please, be aware that this film is filled with referential jokes. If you watch it and don't understand any of it, please, spare us a review where you're whining about how you didn't get any of the jokes. It's like starting a book from the 115th page, then calling it stupid because you're confused by what's happening.","user":"alkazoid","rank":[39,39]},{"title":"Fantastic memory","rating":10,"date":"9 January 2019","review":"Brilliant DVD, especially for those of us who went to the tour and (a) want to revisit it and (b) want to see how the videoed show differs from the one we went to.<br><br>For the record, I'm a 44yo who'd never watched one of their videos on YouTube before taking my daughter to the show, but I came out a massive fan.<br><br>If you've never seen a video, you'll either get it or you won't. I'm not sure though why someone who's not already a fan would buy and watch this dvd then leave a negative review because they don't understand the in-jokes. It takes all sorts I guess...","user":"carolyne-92421","rank":[29,30]},{"title":"For the Fans, regardless of age","rating":10,"date":"15 January 2019","review":"I'm laughing at all the salty amateur film critics who are snubbing this film. Why did you even buy it?<br><br>Interactive Introverts is a recording of Dan and Phil's stage show. This is not a film that should be purchased by non-fans, as they will not understand the humour. However, I disagree with the opinion that this film is strictly for tweens. I'm in my late 20s and enjoyed both the show and the film immensely.<br><br>Dan and Phil have a fantastic dynamic that truly shines in this show. They hold their audience captive for the entire duration, and as a fan, I laughed many times during Interactive Introverts. It's a wonderful opportunity to revisit one of my favourite memories and I would spend twice as much on this film if I had to.<br><br>If you're a fan, you will love it. If you're a random person with no intention to watch Dan and Phil on YouTube, don't buy this and then leave bad reviews, because you are NOT the target audience for this title.","user":"eternal_bliss","rank":[17,17]}]