[{"title":"I fell.","rating":2,"date":"31 December 2018","review":"An \"Arnold\" sounding special ops/hitman (Robert Amstler) takes a little girl to the park. Oh yea, he finds a lost necklace...PLOT SPOILER!.<br><br>This is another horribly written and choreographed Rene Perez film. Amstler has played in some other Perez films, and in a limited talking role. Also like Perez films, Leia Perez is in the film. Nicole Stark has graduated to a speaking role where she keeps her top on. In fact, there is no swearing that I recall, no nudity, and no one who looks like Charles Bronson. That is atypical Perez. In spite of all these differences, the film was still a joke.<br><br>Poor attempt at feel-good random acts of kindness film.","user":"nogodnomasters","rank":[2,3]},{"title":"Better story than acting.","rating":7,"date":"27 July 2019","review":"I really enjoyed the story, and the acting was passable , but fit the story.\nIf you can set aside your selfish need for stelar acting in every movie, you can sit back and enjoy a great story that is memorable and touching\nThe values presented were also in keeping with the highest traditions of American values, except maybe the revenge.\nMusic was marginal.","user":"jamalking15","rank":[1,2]},{"title":"An Honest Review","rating":1,"date":"9 July 2019","review":"Rene Perez...ouch.<br><br>He does this thing where--in his more entertaining movies--when someone gets shot there's an enormous blast of watery blood that you would expect to find in a video game. This one does that. So from the get-go it's off to a good start.<br><br>It's a Rene Perez trope. People don't bleed in his movies, they explode blood-water.<br><br>Unfortunately what is also a trope is that no one seems to know how to handle a gun, so how they hit anything is beyond on. My fiance and her friends had the unfortunate curse of growing up in the suburbs near Chicago, and even on video games that use toy guns, they can't seem to hit anything. The people in Perez movies handle firearms the same way... like people that have never handled a firearm before.<br><br>That is an unfortunate fact given that this is a film that was intended to me a Marvel's Punisher knock-off.<br><br>But a knock-off with little action, a horrible script that is delivered atrociously, with a cardboard cast. It's painful.<br><br>In other words, it really, REALLY stinks. Most of the time when movies like this know they are bad they up the gore, up the comedy, up the nudity, do something, anything to make the film watchable... but not Perez, he'll make a bad movie and not try to salvage it in any way.","user":"generationofswine","rank":[0,1]}]