[{"title":"The story, dialogue and acting are pretty bad, but the other reviewer who said it full of stereotypes on Italy, themselves doesn't know Italy or Europe.","rating":5,"date":"5 June 2019","review":"Seriously the film is terrible.<br><br>But I would like to address the childishness of the other reviewer who says that stereotypical view sof Italy are \"typical American mindset.\"<br><br>Actually this is a typical EUROPEAN mindset. I've lived and worked half my life in Europe and Europeans engage in stereotypes about other European countries and their peoples ALL the time, and do so especially in film<br><br>There are BAFTA winning, and other European award winning films where a British writer writes about France, a German writer sets a film in Spain, or a Greek film maker sets a film in Stockholm, or a French filmmaker sets a film in the USA or with American characters that are FULL of stereotypes. Moreover if you know Italy, northern Italians hold profoundly stereotyped views of southern Italy and visa versa. The stereotypes are part of the humor.<br><br>So stop the culture of complaint and stop being offended at everything. The problem with this film is not stereotypes about Italy and Italians, but poor writing and poor acting.","user":"random-70778","rank":[12,16]},{"title":"Darren Criss is charming and he has a modern day Sofia-Loren-looking leading lady","rating":3,"date":"8 July 2019","review":"The rest of the movie doesn't amount to much - the writing is banal at best. Tyler and Rosalia have the best connection, flirty and romantic, in spite of the dialogue. The others were so boring I fast-forwarded through their plots, in spite of the hunky young gay male. Tyler is a pretty badly written character but Darren makes him better than he is. Tyler's father is a reliable actor I liked in Sex and the City who is always very watchable. If you're a huge Darren Criss fan you'll appreciate his charm and curls but other than and the gorgeous visuals of the countryside, there isn't much more. I had it on in the background while online.","user":"leevanhornfamily","rank":[2,2]},{"title":"All The money in the world","rating":2,"date":"9 June 2019","review":"Good production values, average actors, juvenile plot.\nI wonder how do things like this get made???? Yes it was bad on so many levels. But it was not terrible. I doubt I could do better if given 'all the money in the world' , but back to my question, HOW DO THINGS LIKE THIS GET MADE?? Or more importantly why did I watch it, and why did I write a review. ??? I have to assume it is due to the 'Italian tax credit law No. 244 of December 24th 2007'","user":"ashustonstuff","rank":[3,4]}]