[{"title":"A nags head (long dyed blonde mane) narrating her narrow view of a very violent family","rating":5,"date":"5 March 2019","review":"The life styles of the rich and infamous of the various Gotti family as outlined by the convicted (life in prison without parole) New York city crime lord John Gotti's daughter Victoria Gotti may all be true but the audience may come away thinking that this poor little \"daddy's girl\" was duped by both her father and her own husband of their evil ways and violent life of crime.<br><br>Make no mistake the Gotti's may have lived a wealthy lifestyle in luxurious mansions and wore expensive clothes adorned in expensive jewlery (as flagrantly displayed by Victoria Gotti as she narrates her point of view), but what Victoria Gotti neglected to tell her audience is how feared most everyday people were of just simply even hearing the Gotti name.<br><br>I am really not sure what the message was that Victoria Gotti was trying to convey in this supposed autobiographic Lifetime movie. I found it hard to listen to what was coming out of Victoria's mouth (oh, poor me I had no idea both my father and my husband were violent law breaking convicted criminals) because I couldn't get past that huge mop of a (dyed blonde) hairdo she was wearing that reminded me of a horse's mane.<br><br>We are left with the impression that John Gotti the father/huband was a loving man and always there for his family and especially for his daughter Victoria and that their relationship as father/daughter was special. But John Gotti the man spent the better part of his life behind bars for crimes that included cold blooded murders, so ask yourself if you could be satisfied with this type of family life if it allowed you to live a somewhat privileged lifestyle?","user":"Ed-Shullivan","rank":[7,9]},{"title":"Production value could have been better","rating":5,"date":"11 March 2019","review":"I never liked John Gotti because I disagreed with what he did for a living. I grew up in Queens and didn't like people worshiping a criminal. Having said that, like all mafia movies, it's fascinating to know what went on behind the curtains. Thank you Victoria for making this movie. I only wish it was a little longer with more detail such as Sammy the bull, but I guess there are time limits on Lifetime movies.<br><br>For all the haters out there, I don't think condemning this movie based on her looks or hair color is a basis for judgement. Just look at the value of someone presenting their own perspective of what life was like growing up under the Teflon Don's rules. Also, mentioning how Victoria neglected to mention how people feared her father is absurd. Did you not see the scene with the road test? Or buying groceries? Or mentioning that Victoria made it seem like he was a loving man and always there for his family? That's exactly what she was showing.\nHe took her award and left her there, he was never home... what movie did you watch?","user":"comblitz","rank":[3,4]},{"title":"8 stars for realistic PERFECT acting by Soap Star Maurice Benard.","rating":8,"date":"20 February 2019","review":"This man can play a mob guy easy, with his eyes closed, or any scene/movie that is, #LoveMauriceBenard + whoever called this movie trash/horrible is either a.)jealous and or b.) a loser and that is how i feel because this movie was a good one and worthy of 7 to 10 star rating by movie/tv watcher's etc.,al.,<br><br>Loved it!\nLOVE Maurice Benard as #johngotti...<br><br>i love his portrayal as the infamous handsome, (never to snitch)on anyone, John Gotti. RIP I am seeing parts of John Gotti, i never would've known. He was truly in his own way a great dad, wonderful father to his little girl, and a real family man. IMO(in my opinion) as Victoria says, \"When not with his other family.\" (the streets)i gather.\n-\nThe actress starring as VICTORIA GOTTI was ok in it, i give her a solid seven,\nthe younger little girl was perfect, so realistic too!(i give her an eight.<br><br>But the real one is much more cooler and i always liked and was fascinated by the entire JOHN GOTTI family, and glad to see the daughter is fine in life,and her family. I didn't know JOHN calls his wife, or used to call her, \"butch.\"\n-\nThe tall lovely woman who played gotti wife, was lovely in the movie,\nand a real natural(actress) in it. She was good in it.<br><br>The DOMESTIC violence scenes were so realistic,and i was sad watching it, as i envision poor victoria going through it, and i am happy to learn she is no longer with him, with CARMINE.\n-<br><br>Angel(the older sibling)was good in this too.\nEntire movie was great!\nWell done Victoria.\nWell done,LIFETIME.\nTrue stories are the best since you made Betty Broderick true story part 1 and the conclusion...<br><br>\"You only get so many tears in life.\"\nDon't waste em all up, says John to his precious daughter, Victoria.\"<br><br>My father says similar to me since born in 1970s. and my younger brother\nborn late 80s. Thank you for making this true story, and i will be re-watching\nmany times, over and over.\" A story i believe as many needed to be told.\"\nIn summary,\ni gave actors a solid eight to nine actually, who starred as the parents of Vic...\ni shall rate the movie as a whole, premised on true story etc., a solid 10...<br><br>From:\nAmanda Bauer,\nCalifornia.","user":"amandahockeymom","rank":[8,16]}]