[{"title":"A highly entertaining wrap-up to the weakest Scooby-Doo show","rating":9,"date":"9 February 2019","review":"Who's seriously giving this anywhere near a ONE out of ten? LOL pathetic.<br><br>Anyway, thanks to the always-winning combo of the modern day Scooby-Doo animation style + quality, the incredible (possibly franchise greatest) voice acting cast, and the infinitely enjoyable fourth wall-breaking comedy writing, this very easily ends up being yet another top quality WB Animation Scooby film.","user":"aponx","rank":[108,133]},{"title":"Scooby-Doo is getting back on track...","rating":7,"date":"9 February 2019","review":"With the overwhelming amount of animated Scooby-Doo movies being essentially copy-paste products, then it is progressive getting more and more difficult to find the will to invest time and money into sitting down to watching them.<br><br>But alas, my son wanted to watch this 2019 addition to the Scooby-Doo franchise, so of course I indulged him and went along with him to watch it. And I must say that it was actually one of the better and more interesting of animated Scooby-Doo movies I have seen in a while.<br><br>Sure, it still follows the traditional run-of-the-mill blueprint of how to make a proper Scooby-Doo movie, which it should also do, by all means. After all, it is part of the charm and what we love about the Scooby-Doo franchise, isn't it? But at the same time, the people at Hanna-Barberra managed to keep it fresh and adding just that addition twist and spice to it, to make it outstanding and interesting.<br><br>For me it was the wonderful nod towards Vincent Price in the character named Vincent van Ghoul. Not only did it look like the late Vincent Price, but also sounded much like him, and the dialogue of this particular character was just loaded with nods and references to the old horror movies that Vincent Price was in.<br><br>The animation style and the art style was loveable and wonderful, as it always is in these animated Scooby-Doo movies, and that is also one of the things that I love about the franchise. No matter how many years have passed, it remains the same. Sure they have opted for some questionable movies and such, but I always find comfort in returning to the cartoons and animated movies that look and feel like they did when I was a child watching Scooby-Doo every Saturday and Sunday morning.<br><br>For an animated movie, then a proper cast for the voice acting is a must. And as always, then they nailed it right on the head with \"Scooby-Doo! and the Curse of the 13th Ghost\". They always do. You, of course, have the wonderful talents of returning voice actors Frank Welker, Grey Griffin, Matthew Lillard and Kate Micucci, which pretty much sums up the entire thing that is the Mystery Gang. But then you throw a voice like Maurice LaMarche into the soup and he nails it spot on with his impression of Vincent Price.<br><br>\"Scooby-Doo! and the Curse of the 13th Ghost\" is a much needed and much welcomed addition to the Scooby-Doo franchise, and hopefully it will set a new standard of what to expect from forthcoming movies in the franchise. This is definitely well worth a watch for old-time fans of Scooby-Doo as well as newcoming fans.","user":"paul_haakonsen","rank":[50,62]},{"title":"A fun follow-up to the show and a change of formula","rating":8,"date":"7 February 2019","review":"Back in the 80's there was a short-lived Scooby-Doo show called \"The Thirteen Ghosts of Scooby-Doo,\" in which the titular dog and friends hunted down thirteen evil apparitions that had escaped a magic chest. The show differentiated itself from other installments by being more humor-oriented and breaking the fourth wall, outfit changes, and new characters young con-artist Flim Flam and warlock Vincent Van Ghoul, voiced by the late great Vincent Price. Though short lived and not the best remembered show it has its fans. In a ranking of SD shows, this'd probably be in the middle.<br><br>Thing is: the show ended with only 11 ghosts being captured. Well someone at Warner Bros. Animation must be fond of this. Besides references to Flim Flam and Van Ghoul, we now, approximately 30 years, later have a conclusion to the show where the Scooby gang hunts down the final ghost. (Sort of a conclusion anyway. It's in its own continuity.) I was entertained and thought it was one of the better recent Scooby-Doo movies.<br><br>The creators were clearly having fun with this. The movie remains upbeat and there are a couple of pretty humorous lines. Fred and Velma weren't in the original show, so the film really runs with them trying to wrap their heads around the off-formula goings-ons of the whole thing. Daphne was the leader in the show, and she resumes it here. She does a good job in the lead having a sort of determined ability to roll with all the punches. Van Ghoul, who could've been a sixth-wheel to the group, surprisingly fits in. He has sort of a campy melodramatic backstory and resoluteness to himself that just works. Plus I love his childish obsession with bad horror puns.<br><br>The movie does lose some steam by the middle and the ending is a little underwhelming. Plus, the gang has a crisis at the beginning that isn't properly resolved. The movie stays within the tone of the recent SB made-for-DVD movies and not the show so not fourth-wall breaking jokes or Scrappy-Doo. Personally, I haven't liked Scooby's nephew, even when I was a kid, but I can see how fans of Scrappy would be upset that they do so much now-a-days to throw Scrappy to the side.<br><br>Animation remains bright and colorful with strong line work. There is one flashback scene that is really well animated. However, some of the action scenes seem a little weak compared to past movies. There are several nods to the unique looks of the characters during the 13 Ghosts. Though Daphne's hair and outfit and the Mystery Machine's appearance were too dated to use, we do get some impressive updates with Daphne in a leather jacket and the Mystery Machine designed to be more of a sleeker high-tech van.<br><br>Overall, your kids probably won't care about the backstory and this is self-contained enough that they won't be bothered. I think they'll like Vincent's puns.","user":"jwwalrath-227-85487","rank":[44,56]}]