[{"title":"Interesting idea; well executed","rating":8,"date":"13 February 2020","review":"Good performances, particularly by the male lead, but the supporting cast does a good job as well. While the one other reviewer here suggests it is difficult to distinguish between the two worlds being shown, I only thought that initially - I was looking for some obvious visual cue (Memento's use of B&amp;W vs color to indicate which timeline you are viewing being an excellent example). I fairly shortly realized I was thinking about it too hard. it really is pretty easy to follow if you pay attention to which characters are in which scenes.<br><br>I think the main thing to recommend this film is the basic idea of it and the slow burn unfolding of it. I am glad the film doesn't make it immediately obvious what is going on. It creates some tension as one tries to understand the relationship between the two worlds and what causes the change in circumstances. The production itself is modest. I was somewhat reminded of the movie \"Primer\" in terms of a modest production that does a great job with the story.<br><br>I would love to write a couple of other comments, but I personally think a film like this is better to watch cold, so I have been deliberately vague in a couple of areas and will leave unmentioned a 2004 film which I was strongly reminded of by the end of this movie.","user":"BarryJ","rank":[1,1]},{"title":"Good Enough","rating":4,"date":"23 January 2020","review":"\" Parallel world : Love Story \" was a bit confusing.<br><br>My main concern was that it was difficult to distinguish which world was when, if they weren't in the appartment or work. Also, the movie didn't make it clear about the concept until halfway through, so it was confusing if you haven't read the synopsis. Also, overall, the movie lacked intensity, until the ending scenes, when the drama finally got more thrilling and dramatic. The performances were top notch too, especially from the male lead, who was amazing.<br><br>So, overall, four out of ten.","user":"pennyelenabooks","rank":[1,1]}]