[{"title":"Kind of a Twilight Zone episode, not movie-worthy","rating":3,"date":"31 October 2019","review":"Unfortunately not very good as a movie. These Netflix originals are really hit or miss stuff and I think I can see a pattern already. In many cases they are something that would work better as an episode of an anthology series and don't really benefit from movie length. There simply isn't enough substance to carry a full movie.<br><br>We have a mother and a child who for whatever reason are moving by car and decide to take a short cut through a small desert road. Tyre goes flat and a rattlesnake bites the kid while the mother is changing the tyre. Mysteriously a trailer appears nearby where they go to seek help (cell phone naturally does not work). Kid is cured, but the cure comes with a price that puts the mother in a difficult situation. While kind of interesting setup, there is zero beef to the story, nothing is explained or based on anything. And this is often the case with these \"direct-to-Netflix\" movies, things just happen. When there is no story to base the plot on, it's not very interesting. Just so many why's .. And the ending is fittingly unsatisfying.<br><br>The direction - while not exactly bad - definitely does not add any artistic value to the movie. A movie either needs to be artistically interesting or tell a proper story, this one did neither. Why a rattlesnake? Who was the lady? What was the movie all about? Is there some folklore about a rattlesnake bite and cure that I as a European don't know? I mean the movie is even titled \"Rattlesnake\" and not \"The Curse of The Desert Lady\", which it probably would have been called had it been made in the 50s. It kind of has the same b-movie quality to it.<br><br>The acting is ranging from ok (Ejogo) to bad (Rossi).","user":"rlaine","rank":[34,35]},{"title":"Long on patience, short on bite","rating":4,"date":"26 October 2019","review":"A lot of low budget horror movies end up just like RATTLESNAKE. They stretch the story and the viewer's patience as best they can to reach that full feature length when they really should have remained a leaner 30-minute short in a horror anthology of sorts. There's a pretty good set-up that winds up spinning its wheels for 50 minutes or so until it reaches its underwhelming finale. You barely get to know the main characters or the evil behind the driving force of the story.\nHildiitch's adaptation of SK's 1922 for Netflix got a boost from an almost unrecognizable Thomas Jane in the lead. Ejogo's performance feels, for lack of a better work, lacking. While I didn't hate what I was viewing, I sure didn't like checking my watch every 5 minutes either.","user":"refeahcs","rank":[25,27]},{"title":"Not terrible, but unsatisfying at the end","rating":4,"date":"25 October 2019","review":"I'm not sure why Netflix decided to pick up (and make a Netflix exclusive) this low budget thriller. It's not a terrible effort, but I could see much more wasted potential than what the movie actually grabbed on and used. It gets to an okay start, having a little atmosphere and not taking too long to set up the situation the female heroine finds herself in. However, after that point, the movie quickly gets bogged down. Though the heroine is racing against time, I couldn't get that feeling at all - there is no feeling of tension or speed, and the heroine seems to be taking the situation more calmly than I think anyone else in her shoes would be feeling. The situation also feels too stretched out for its own good, even though the movie only has a running time of 85 minutes. As for the ending, I won't spoil what happens in the climax or conclusion, but I will say that I had a strong feeling of dissatisfaction from these final few minutes; there are a number of unanswered questions as well as future potential problems for the heroine that simply are not resolved. I guessed the movie is fairly well produced for its very low budget, but I would have accepted a less slick look for a stronger atmosphere and more suspense.","user":"Wizard-8","rank":[47,54]}]