[{"title":"Stop cutting them onions.","rating":10,"date":"23 November 2018","review":"Before I start, I feel obliged to mention that I have created my account specifically for this review. I am a Liverpool fan from Romania since I was about 8, and I have identified Liverpool with Steven Gerrard from basically the beginning.<br><br>Subjectivity aside, this is not a documentary about a football player. This is a documentary about a man that somehow refused everything for what he loved.<br><br>Obviously this is going to start straight away with probably the most hurtful and significant moment of the man's life: that slip. A simple secaond; a mere second for many, a moment that broke the hearts of so, so many. I remember I waas devastated that day. I was actually crying matches later when Stevie G. was picking up a demolished Suarez, crying, off of the grass. I knew it was all over then and there. Suarez was surely leaving, Sterling as well, perhaps Sturridge too... but most importantly, Gerrard was done. You could see it on his face. On your face. On every Liverpudlian face... and I'm Romanian. I could only imagine what generations of loyal, fierce local supporters were feeling.<br><br>If you felt this, it is the doco for you. It will twist you, make you happy, make you cry... but in the end love the man even man.<br><br>Steven Gerrard. The man who single footedly (of that's even a word) pulled a whole team that was stuck beneath the crushing weight of tragedy and it's own glory to one of the best football matches in the history of the beautiful game... not for himself, but for those he loved. His neighbours, his relatives and his friends. The local boy who gone done it all, except for that heartbreaking and elusive Premier League title. People still belittle him for the slip, they joke and hate, but none, not one single of them would have given up what our Captain has given for us... for love.<br><br>And in the end, that is the beautiful game, is it not?<br><br>TLDR: If you love football, watch this.","user":"irjabba","rank":[30,39]},{"title":"What a beauty!!!","rating":9,"date":"23 November 2018","review":"This was a wonderful football/biography for any football fan and enthusiast, but also a sincere character study... Of people, community, culture and of a rare relationship between a city/Liverpool F.C and one of it's greatest representatives.\nHe is of one of the most gifted and unique players of all time, with a passion that shines on and off the pitch/camera.<br><br>Make Us Dream did made me think of some of the ugly side of human nature, some of the duality, the thin line between love and hate. How thin it is in some, sain/insane and how these fractions of moments effect life.\nThe uglyand beautiful side of of humanity it brings out. How it connects us from strangers. Could walk into a bar anywhere in the world and instantly connect with someone watching your team play.<br><br>There is pressure in each of our lives, from ourselves and from others. Then there is the pressure that only few people in our modern world ever get to experience, which is constant, intence and practically unimaginable.\nThough many moments are missed, essence of the man and his career are captured and it is an honest and emotional journey. \"A player like him comes only along once in every 40-50 years, once in a lifetime\".\nShame that we did not get to see more of his great moments for club and suprisingly nothing for country, but that is not what this was meant to focus on and there simple are too many of those to include, but that is what we have Youtube for...\nHe is (almost?) to Liverpool what Maradona is to Napoli. But there is only one Maradona...but there also is also only one Steven Gerrad.\nA very, very worthy watch of a special, special player.<br><br>Y.N.W.A","user":"unwhosearmy","rank":[25,32]},{"title":"Emotional roller-coaster","rating":10,"date":"2 December 2018","review":"You'll be taken on a emotional ride with possibly one of the most inspirational, respected and loved footballer of the world. Even if you're not a Liverpool supporter you'll enjoy it","user":"zak_8","rank":[17,25]}]