[{"title":"worthy of being watched but don't expect too much","rating":5,"date":"18 September 2019","review":"I don't know why some people who rated and wrote comments before me made too much bad words without them even finishing watching the movie. Vivian did a great acting in this movie. The other two related movies of this series(They also theme with The Little Girl Wearing Ref Dress) , like this one does, feature themselves with the plot \"fighting with the devils from their hearts\". What might be disappointing is that you would be let down if you're a fan of CG effects cuz they seem not to have spent too much on doing their CG. But it's sort of entertaining if you have some free time to kill.","user":"chaunceyz","rank":[1,1]},{"title":"WTF","rating":2,"date":"13 May 2019","review":"I was reading Hilaryswan2011 review and it was not a review but a rant about stuff that has nothing to do with the movie. Who is this person and what are they talking about. They never mention the plot, nor the story, nor the characters and etc. They admit they left the theater within first 5 minutes. Just barely enough to see the opening credits and yet they gave the movie a 1 star. How is that possible without seeing the entire movie. This review is bogus and written by someone who cares less about the movie and more about respect for writers and irrelevant stuff about Gala Television and how other countries like Japan, France, and USA plagiarize their moview from Taiwan and China.\nAnyway, I have seen the movie and although it is not great with cheap CGI and bad dialogue, and worse acting. It is ok to watch. It does seem like it was a movie made for TV with it's limited budget though so beware of the cheapness. It is very low grade and poor quality and not worthy being liked to the other 2 tag along movies. I just saw it because I liked the other 2. This one was kind of a waste of time. Over all, I would not bother seeing this movie. Everything is just bad.","user":"justinwadebkk","rank":[3,9]},{"title":"Crazy","rating":3,"date":"11 September 2019","review":"This movie is crazy even by crazy standards. I love Korean horror but this was too out there for me. Might be someone else's cup of tea.","user":"restlinens-64389","rank":[0,1]}]