[{"title":"Really bad","rating":1,"date":"27 December 2019","review":"I was excited to see a film featuring diverse cast and I love Christmas movies but this was awful.","user":"HannahS44","rank":[2,2]},{"title":"Uplifting Christmas film reminds us to be grateful and live in the moment.","rating":10,"date":"15 December 2019","review":"An uplifting Christmas film which reminds us to appreciate what life has bestowed upon us and not live in the future or the past. Be in the moment and recognize the gifts before us such as the angelic stranger who arrives to remind the protagonist of the glorious life which surrounds him - which he is ignoring. A first-time New York City visitor from Kenya inspires the grieving main character to get his life back on track. Actress Grace Wacuka plays the Kenyan tourist and she lights up the screen with her performance; her character's vivaciousness and megawatt smile cannot be suppressed no matter what twists come her way. She reminds us that main components of wellbeing and a happy life are appreciation and gratefulness. A moving party scene will leave the audience teary-eyed as the film reflects those goose-bumpy moments of such Christmas classics as \"A Miracle on 34th Street\" and \"It's a Wonderful Life\". In addition to its uplifting message, the photography is wonderful too, interspersed with terrific aerial scenes which make even the outlying suburban neighborhoods as inviting as holiday-festooned Manhattan itself.","user":"patcar-00156","rank":[3,7]},{"title":"ACCENT NAILED!","rating":7,"date":"27 December 2019","review":"I must say, i love the fact that they got Kioni's accent right in this movie. I hate it when they cast a black person for a character that originates from Africa and regardless of their African origins East, West, Central or North give them a Southern African accent. Kudos to Grace for representing East Africa so well. Everything about her was so Kenyan. From her Maasai market earrings down to the little mannerisms and of course her accent! If she'd have added \"ME, I.....\" somewhere in her speech that would have just made my day. But all in all, loved the movie, the plot was simple yet touching and almost relatable.","user":"carolkwambz","rank":[1,2]}]