[{"title":"This was downright horrible...","rating":3,"date":"27 November 2019","review":"Oh dear lord... That is essentially all that is needed to summarize this 2019 'action' movie starring Mark Dacascos from writer and director Wych Kaosayananda.<br><br>When I sat down to watch this movie it was solely because of it having Mark Dacascos in the lead role. But it didn't take me long into the movie to realize that this was going to be a suckfest. And it was. Oh, how it was.<br><br>Now, the movie is listed as action. No, this isn't really an action movie. It is sort of a movie that tries to accommodate a heap of genres, which included action, horror, drama and thriller, but ultimately failed to deliver on any of them. And the movie turned out to be a scrambled heap of a muddled mess that didn't prove to be overly entertaining or enjoyable.<br><br>Initially I was a little bit thrilled when I saw zombies, but then I noticed the make-up on the zombies and the way that they were moving, and my excitement quickly vanished. This movie may have zombies in it, but I wouldn't really characterize the movie as being a zombie movie per se.<br><br>The storyline in \"The Driver\" was, and pardon me for being perfectly blunt here, pointless. It was ridiculously slow paced and it served next to no purpose, which meant that the movie trotted on in an atrocious pace and offered very, very little for the audience to enjoy.<br><br>And the characters in the movie were mundane, one-dimensional cardboard cutouts with no personalities or features. And you didn't even invest an ounce of interest in the characters or what happened to them.<br><br>The scene where Dacascos was sitting alone in the car towards the end was so painstakingly prolonged, and it became cringeworthy to watch. Especially because it seemed to drag on forever and ever.<br><br>This movie is bad, quite bad. And even the title serves the actual storyline or plot no purpose.<br><br>I am rating \"The Driver\" three out of ten stars solely based on the production level of the movie and because it did have Mark Dacascos in it after all.<br><br>But do yourself a favor, even if you are a fan of Dacascos, and stay well clear of this stinker. It simply just isn't worth your time, money or effort.","user":"paul_haakonsen","rank":[12,14]},{"title":"Horrible all around","rating":1,"date":"26 November 2019","review":"Dialogue must've been written by a five-year-old... they clearly also made the set and props. It's a disaster. It's boring. It's delivered by robots. Camera is oddly constantly doing closeups of MC's chin, ears, and the wife's spider mascara lashes. There's no reason for the catalyst to the MCs moving.... like the \"bad guys\" break in to the homemade fort to just let the zombies run amuck, not steal or takeover... just so they can all be ate by said zombies. Nonsense.","user":"ashleyoliverrowell","rank":[13,19]},{"title":"Fooled by fake reviews","rating":1,"date":"4 January 2020","review":"What feels like 1 hour in due to the slow movement and horrible directing and acting , and cheesy dialog, I still see opening credits going, I knew this was gonna be bad, waited another agonizing 10 minutes which felt like 14 hours, yes park the car and clean it, I can assume bmw funded this or provided free car, but after that still no driving hmm, boring slow motion shots of him walking down hall for 10 minutes, super closeups I mean wtf is the camera man obsessed with him or just doesn't know how to use the zoom.<br><br>fast forwarded it even gets worse, driving scenes are projector types (you know what they used in old movies), daughter cant act.... shut it off<br><br>waste of time. avoid.","user":"pipo-","rank":[4,5]}]