[{"title":"Interesting enough to me.","rating":7,"date":"14 January 2019","review":"I was a bit disappointed by the fact that there were not much images from space nor from the red planet Mars but all in all it's an interesting documentary for anyone who is interested in space technology. Are there better documentaries about space exploration and planet colonization? Yes, there are much better documentaries about that subject, but MARS: Inside SpaceX shows you technical things about what they are capable of now and that's the interesting part of this documentary. We're still at the beginning of an era that will be dominated by space technology so there's still alot to learn. At the rate we're destroying our planet it's vital to continue this research as moving to another planet to prevent human extinsion will be the only solution.","user":"deloudelouvain","rank":[7,7]},{"title":"Great Documentary","rating":8,"date":"6 January 2019","review":"This is a great documentary (nearly 9 or 10)..However, seems Generation Y and Generation Z have forgotten The National Aeronautics and Space Administration's (N.A.S.A.'s) previous Science as depicted with N.A.S.A.'s unprecedented 100% cooperation and collaboration making the 1968 Movie 2001: A Space Odyssey, so rating of 8.<br><br>The National Aeronautics and Space Administration's (N.A.S.A.'s) Steps<br><br>Build a Space Station between The Earth and The Moon, with Centrifugal Gravity.<br><br>Build a Underground Moon Base. Underground to protect from Solar Radiation of X-Rays, Gamma Radiation, Ultra Violet, etc., same reasoning and Science why Must Build a Mars Base Underground.<br><br>Robert A. Heinlein, 1966, idea of Mining the Moon, The Moon Is a Harsh Mistress, and catapults using technology like 21st Century Magnetic \"Rail Guns\" to get the mined materials to Earth. Mentions effects of long term low gravity.<br><br>Duncan Jones, 2009 Movie Moon, the Mining of fuel helium-3.<br><br>Author of 2001: A Space Odyssey, Arthur C. Clarke later added a \"Space Elevator\", 1979, The Fountains of Paradise, as safer than \"spectacular\" deadly missile launches, as The Earth starts to run out of materials to use as fuel for Missiles, Missile Motors (Please stop saying uneducated \"Rockets\", rockets are put on a launcher at a certain elevation, direction and launched they have no guidance navigation and controls (GNCs) that Missiles, Spacecraft have.).<br><br>1985 \"It (Space Elevator) could carry people to facilities in geosynchronous orbit without the enormous expense of energy entailed by, say, a moon launch. Or, acting as a kind of sling, it could hurl space vehicles beyond the reach of gravity for long voyages. Clarke predicts that the space elevator will be built \"about fifty years after everyone stops laughing.\"\"<br><br>A Space Shipyard to manufacturer an Actual Interplanetary Spacecraft without the limitations of gravity. Materials from the Moon sent to an Orbiting Space Materials Processing Plants and or Factories, and The Earth by Space Elevator. The actual science of omni directional molecular (no gravity) materials versus weaker unidirectional (due to gravity) materials.<br><br>Nuclear Propulsion to achieve near light speeds. The idea of nuclear explosions fired one after another, also known as the Impulse Engine (Star Trek).<br><br>Directed Energy propulsion, Laser propulsion, Beam powered propulsion. thermal missile motors, photonic thrusters, light sails, ablative thrusters, pulse detonation engines, interplanetary \"Beam Rider\" Spacecraft. Renewable Energy produces an energy beam, beamed between stations in space to destination that the Beam Rider spacecraft rides the beam, see \"Solar sailer\" 1982 movie Tron.<br><br>Gravity. Proven detrimental effects of low gravity effects on humans from International Space Station. After months of space travel to Mars if No Gravity is created, the first human Explorers, later Colonists would be crushed by Mars lesser than Earth Gravity by their own body mass. Colonists of the Moon, Mars would have to be continually be exposed to Earth Gravity or they will never be able to return to Earth's Higher Gravity.<br><br>Radiation. Spacecraft do not have the Earth's Ozone Layer, Magnetosphere, atmosphere to shield humans from constant Solar Radiation of X-Rays, Gamma Radiation, Ultra Violet, etc.. Costly Density of materials is one method for protection, so is humans inside of a atmospheric tank inside the huge main supply of water. The idea of a \"Force Field\" is good, just not invented yet as \"effective\" or inexpensive.<br><br>Before any of you say I don't know, Scientia ad Justitiam, the U.S. Military Officer crest I wore, \"Knowledge For Righteousness\", including during my involvements with NASA's Marshall Space Flight Center, Alabama.","user":"dncorp","rank":[10,17]},{"title":"A horribly outdated and fallacious documentary.","rating":1,"date":"7 January 2019","review":"The documentary says it was made for 3 years but looks like it was made more than 3 years ago and as a result does not contain anything about spaceX plans for Mars.<br><br>So what's in there you ask?\n-footage about the falcon heavy launch (I remind you that this launcher has no plans for Mars, or outside of earth orbit for that matter)\n-talks praising elon musk bravery for renewable rockets (that was 2010)\n-the same tour of the facilities that was given to the press.\n-very very broad PR talk about the idead of going to mars from space X brass, no concept plans.\n-the spaceX employees interviewed are people in charge of rocket launches, so they're totally unrelated to any deep space matter.\n-to make the documentary more objective, outsiders are interviewed, such as the writer of the martian or the \"mars society\" founder...<br><br>There is only one actual scientist being interviewed during the whole documentary and she warns that the idea of colonizing mars borders science fiction.<br><br>But when you start to think that the documentary is only biased and misleading, it just lets people MAKE THINGS UP to spice up the mars story. That's right, the documentary shamelessly relays that Von Braun designed the saturn V rocket to go to Mars, just... wow.","user":"pro_toueur","rank":[4,16]}]