[{"title":"Not that bad, not too informative either though, never makes it beyond the surface","rating":4,"date":"30 December 2018","review":"\"Out of Many, One\" is an American documentary from 2018, actually the day I am writing this review from very very recently as this premiered on Netflix in December I believe. It was made by Emmy winner John Hoffman and Nanfu wang, so the multi-cultural component that plays a vital role in the film itself is also reflected in who made this movie. If you read the three-line summary here on imdb, you have all the information this is about. It is about people from other countries coming to America and we see some of the processes they have to get through in terms of questions they need to ask correctly in order to be awarded American citizenship, about history for example. Aside from these immigrants, there is an instructor, an immigrant herself, who came from the Netherlands a long time ago and is now in charge of getting the new immigrants ready for the upcoming challenges. I must say I am a bit skeptical too looking at the rating and seeing only 10 out of 10 reviews basically. I read another reviewer post that some reviewers had their contributions deleted if they were not in favor of this 35-minute documentary quality-wise. I have not witnessed that as this is the first time I am visiting this title page here on imdb, but I will keep my eyes open, also about what happens with my review here. It's tough for me to say if it is really a contrversial film. I honestly wouldn't call it that. It's not propaganda or anything, but it is very one-sided yes because really it only focuses on the role model immigrants. There is no mention of those who get in illegally, no mention of those who may not have the best intentions coming to America and with that I don't mean terrorists or anything. I also include those who want to stay within their circle of culture and people and have no intentions to adjust whatsoever. On a completely objective note here, there is a lot of talk in other languages like Spanish mostly, but also immigrants from Asia are interviewed, so chances are basically zero you may wanna watch this one without subtitles unless you are a huge linguistic talent. Now back to the subject again: Liberals will love this little documentary for sure, Conservatives probably not so much, but that's not so surprising as not only Hollywood is very liberal these days, has been for a while, but also the small screen landscape. It's not offensive or anything in the sense of positive discrimination that I am not a fan of by any means at all, but it could have been more informative and insightful I think. Or at least maybe made more of an emotional impact. The one scene I really did not like at all was when the immigrants are show a picture of a wall that included several mean words (lets call them that) because yes this was clearly done to offer criticisms about PotUS' plans to build a wall and I don't think from any perspective it is right or understandable to seed hatred in those new American citizens. Sadly, there is not a scene at the other end of the scale that I liked or loved as much as I disliked that one. I also think that's why it should not be shown in schools, even if the running time is somewhat fitting for a teacher's plan. Overall, I don't really think it is worth seeing this little movie as honestly it offered very little that felt new or truly interesting, let alone in-depth, and will have you on the edge of your seat in my opinion. And I am saying this as somebody who is far from an expert on the subject of American immigration. So yeah, I'd say go watch something else instead.","user":"Horst_In_Translation","rank":[5,7]},{"title":"E Pluribus Unum","rating":8,"date":"16 December 2018","review":"Documentary short that looks at American immigration through the lens of a citizenship classes instructor and students. For viewers whove never set foot in a citizenship course, these fillmakers take you inside the classroom. While all classes in all fifty states are pretty much the same, filmmakers appear to use a CUNY classrioom here. Condensed version, rather than weekly classes, in about a half hour the viewer is a guest visitor from the classes first day through its final citizenship oaths. Filmed in 2018, a year when America attempts closing its southern border, students reflect on changing times and thier individual paths to citizenship. A slice of life film, well editied well filmed.","user":"indiapaige","rank":[5,11]},{"title":"The truth will set us free...","rating":10,"date":"29 December 2018","review":"Beautiful stories of struggle, faith and hope. Immigrants made the US the great Nation it once was and can still be. Take 30 minutes out of your life and watch this, maybe it will help you understand this volitile issue better. Maybe it will help shine a brighter light on other human beings just trying to find a better life, much like our ancestors. The great promise of America doesn't end because the faces change, because the languages change, because the color of the people changes. It becomes stronger, more powerful and more important then ever to protect. May the gods have mercy on all of us, for we know not what we do. The choice is ours. What say you?","user":"olivierpratt","rank":[3,10]}]