[{"title":"Solid documentary","rating":9,"date":"14 July 2019","review":"A solid documentary\nNice to see family home video and frank interviews.\nVery nice film. Well worth watching or buying.","user":"michaelholt-69869","rank":[20,22]},{"title":"In this documentary, we learn the unique characteristics of Neil Armstrong.","rating":10,"date":"5 October 2019","review":"Even apart from being the first man on the moon, Neil Armstrong was a rather unique astronaut. This excellent documentary is unique in that it is the story of a man, rather than the Apollo program. Many fine documentaries have been done about the Apollo program to land a man on the moon. In this documentary, we learn the unique characteristics of Neil Armstrong.<br><br>I was a teenager when Apollo 11 landed on the moon, and as a certified \"Space Cadet\", I have read and seen just about everything there is about NASA's history, especially the Apollo program. I did learn new and interesting things about Neil Armstrong in this film.<br><br>This would be an excellent documentary to show children ages 8 to 18. As a role model, Neil is vastly superior to sports figures or entertainers. All of the astronauts possessed exceptional abilities. In this documentary, we learn interesting and special attributes of Neil Armstrong's character that made him a top-notch engineer, pilot and astronaut. You'll see a man that walked on the moon and later in life volunteered to teach high school algebra to students for there GED.<br><br>Obviously, much of what happens to people is by chance, but Neil always worked hard so he was as fully prepared as possible. This documentary shows that Neil had many brushes with death in his flying career. He demonstrated his ability to remain cool, calculating, and resourceful. Whenever he was in a group with other astronauts he talked the least, and listened the most.<br><br>This documentary showed me many video clips I had never seen before. When the film was over, I felt as though I finally understood the man.<br><br>As long as there are history books, Neil Armstrong will be included in them, remembered for taking Man's first step on a world beyond our own. Neil carried himself with a grace and humility that was an example to us all. When President Kennedy challenged the nation to send a man to the Moon, Neil Armstrong accepted without reservation<br><br>Armstrong, features the people who knew him best. Buzz is there, but to a lesser degree. Remember, Neil and Buzz never became close friends, they worked together professionally as a team. We hear more from Mike Collins who was more of a \"regular guy\" and has a lot of interesting commentary about spaceflight, and life in general.<br><br>My only SLIGHT criticism of the documentary was the choice of Harrison Ford. Throughout the documentary Harrison reads some of the things that Neil Armstrong has written. No criticism of Harrison Ford's fine acting ability. However, he just did not come across as a voice for Neil Armstrong. As most know, politically, Neil was right of center, Harrison, is left of center. Possessing this knowledge caused me not to completely except Harrison as the audio conscious of Neil. Moreover, Harrison's voice is low and gruff sounding, Neil Armstrong's voice is the exact opposite. I would've chosen someone who sounded more like Neil.<br><br>I will leave out the obvious one, here are some Armstrong quotes from the film. \"I think we're going to the moon because it's in the nature of the human being to face challenges. It's by the nature of his deep inner soul ... we're required to do these things just as salmon swim upstream.\" \"Houston, Tranquility Base here. The Eagle has landed.\"<br><br>\"Some question why Americans should return to the Moon. \"After all,\" they say \"we have already been there.\" I find that mystifying. It would be as if 16th century monarchs proclaimed that \"we need not go to the New World, we have already been there.\" Or as if President Thomas Jefferson announced in 1803 that Americans \"need not go west of the Mississippi, the Lewis and Clark Expedition has already been there.\" Americans have visited and examined 6 locations on Luna, varying in size from a suburban lot to a small township. That leaves more than 14 million square miles yet to explore.<br><br>Movies are all about storytelling. In the Armstrong documentary you will see a well-done film, cleverly and accurately documenting one of the greatest men in aviation as well as world history.<br><br>The Blu-ray disc contains many extras. These are extras that could have been included in the main film. I strongly recommend you watch all of them. Do NOT stream this movie. You want to buy and OWN the Blu-ray, and possess it in your library.","user":"rlymzv","rank":[3,3]},{"title":"A good documentary","rating":6,"date":"23 July 2019","review":"Solid, warm and emotional documentary which i recommend for anyone that have any interest in space.<br><br>This would most likely been a 8/10, but because they for some reason intentionally ignored Buzz Aldrin I remove 2 points making it a 6/10<br><br>I don't understand how they could not get Buzz on board to talk about Neil Armstrong and the mission to the moon, he is alive and it was such a waste for future generation that might watch this 50-100 years from now....they should have utilized Buzz no matter what....<br><br>but it is still a good documentary, even if I waited the whole movie to hear from Buzz, lol","user":"Belnick","rank":[10,19]}]