[{"title":"Rehash of older movies","rating":1,"date":"5 January 2019","review":"This movie answers the eternal question;<br><br>How do I make a movie without making a movie?<br><br>Answer: You make a movie by combining clips from older movies.<br><br>The movie clips are mostly from 1970's and 80's horror movies and the clips include more sex than actual horror.<br><br>You can watch those old movies instead of this trash.","user":"RothmanMax","rank":[8,9]},{"title":"Unwatchable and incomprehensible dreck.","rating":1,"date":"20 April 2019","review":"This \"film\" is nothing but clips of various clips from older \"B\" and 80's.<br><br>And they are spliced together in a way that does not even try to make a cogent story.<br><br>It is almost like the makers of the film said \"Let's show a few bum and booby scenes from a 70's flick and call it a movie\"<br><br>Look up the list of films that are used and watch them. Although they were never great to begin with.","user":"michael-e-wasson","rank":[4,4]},{"title":"Well, there's over an hour and a half I can't have back.","rating":1,"date":"8 January 2020","review":"I thought this felt a little 70s/80s-ish. The acting, camera work, and everything else was pretty bad. I actually saw the trade towers in NYC at one point and this came out in 2018.<br><br>But then little made sense about this movie. Even the scenes in this supposed horror anthology. And that, in itself, makes complete sense once you find out that this isn't actually an original film. Rather, it's a collection of scenes from a bunch of 70s/80s movies, spliced in between very short -assumed to actually be- original scenes, with campy title cards. I'm not even sure that's legal, but who would even WANT to do this?<br><br>Every story, or \"dose\" in this anthology, by the way, has gratuitous nudity or sex scenes with lots of nudity. Every. Single. One. I'm no prude, but after the third one, it gets kind of ridiculous. I'm thinking, oh, someone's taking their clothes off again. Is this porn? It's as though some perv just jumbled together the naked scenes from his 70s/80s fap collection, added a few little scenes of his own and some title cards, and tried to call it something else. Again, is this legal? Some of them didn't even resemble horror.<br><br>I'd rate it zero, but then I couldn't leave this glowing review. Because 0 wasn't an option. Anyway, I'd suggest leaving this one off your list. Unless, of course, horror is NOT what you're looking for. Or you're actually looking for a mix tape of bizarre 70s/80s soft core. Not judging. Maybe it would get better reviews if it were labeled \"Doses of bizzare 70s/80s softcore.\" But then I guess that doesn't quite have the same ring to it.","user":"oliviamteller","rank":[3,3]}]