[{"title":"Terrible reviews but had me LOL","rating":7,"date":"30 December 2019","review":"This film is being massacred by critics. It's honestly not that bad of a movie. I wouldn't pay $20 to see it in theaters, but it's definitely worth watching at home. Whoever wrote Rose Bryne's lines was hilarious. JEXI had me cracking up and Michael Pena was awesome as usual. Adam Levine held it down but the cell phone stole the show. Check it out.","user":"Draysan-Jennings","rank":[59,73]},{"title":"This movie made me write my first review.","rating":9,"date":"4 January 2020","review":"Some reviewers or critics might say we hate this movie because of the tech and the bad language i say they are prude and can't relate to the movie and understand it so they attack it, from my experience and point of view the movie was KING hilarious LOVED Jexi the AI how funny she was and the chemistry between her and the main character the the main character being a nerd not having a life can't talk to girls and Jexi the AI helping him through all that was amazing and funny i relate to this movie and i definitely recommend it was an amazing watch.","user":"zhiargaming","rank":[32,41]},{"title":"Not as terrible as the 1/10 reviews make it out as","rating":5,"date":"24 December 2019","review":"I loathe the newish trend of reviewers giving anything they didn't enjoy with a 1/10 rating. It's making IMDb ratings less and less meaningful I think, and less reliable.<br><br>But anyways, when I finished watching this I wasn't sure whether I enjoyed it or not (a strange feeling). I think it wasn't a complete trainwreck, and the actors did as much as they could with a weak script. The direction and technical aspects were fine for a low-budget comedy.<br><br>The voice of the OS definitely got nerve-gratingly annoying very quickly, which was a big distraction. There was no comedic timing, and it sounded very dated, like the voice of the computer on the original Star Trek series. But, again, this wasn't the worst movie ever made. I got a few very genuine laughs watching this (a very few laughs, but still). At worst this is a nice meaningless &amp; mindless piece of fluff that doesn't ask much investment of the viewer, or give a whole lot back in return, but I don't feel like I wasted any big part of my life watching it.","user":"greg-goremykin","rank":[55,76]}]