[{"title":"See this film!","rating":9,"date":"2 February 2019","review":"Powerful story of love, commitment, sacrifice and forgiveness. A film that all should see.","user":"rlbcompany","rank":[27,31]},{"title":"a story worth telling","rating":6,"date":"3 February 2019","review":"Greetings again from the darkness. The story of Graham Staines certainly deserves to be told, as his impact is lasting and his kindness and devotion to the cause are quite extraordinary. In fact he paid the ultimate price ... actually even greater than that ... for his efforts, simply because he bucked tradition and offered an alternative to folks who previously had none.<br><br>Director Aneesh Daniel and writer Andrew E Matthews present Mr. Staines' story (based on true events), and even shot on location in India despite a limited budget. Sharman Joshi plays ambitious young journalist Manav Banerjee, who in the late 1990's packs up his pregnant wife Shanti (Aditi Chengappa) and heads to the remote Indian town of Orissa in hopes of securing a writing job for the local newspaper. Once there, he finds no guarantees - only an editor who assigns him the nearly impossible task of procuring evidence that a local missionary is illegally converting Hindus to Christianity.<br><br>The missionary is Australian Graham Staines who, along with his wife (Shari Rigby) and 3 kids, run a camp for locals afflicted with leprosy. Staines is played by Stephen Baldwin, the youngest of the Baldwin brothers, and best known for his turn in THE USUAL SUSPECTS (1995). Baldwin and his whispered Aussie accent plays Staines as a near-Saint; one who could only be doubted by the most ferocious traditionalists (of which there are many).<br><br>Mr. Joshi plays Banerjee as a bit of creepy-stalking guy who spends a little too much time staring at others. He's conflicted with fulfilling his assignment and discovering the truth about Staines. Banerjee's own moment of self-preservation likely inspired the horrific event by a mob of Hindu fundamentalists that, combined with some insider information, set Banerjee straight with how to proceed and what to report. In the process, he exposes the corruption and self-interest of rural India driven by the many minds closed by religious traditions.<br><br>Director Daniel opens the film with actual footage and archival clips of unrest and turmoil from those times. As you would expect, these clips are more disturbing and provide more intense reaction than anything the movie could produce (except for maybe the horrific event noted above). The overblown and overly-dramatic music doesn't help the presentation, yet somehow the message of kindness and forgiven is not lost.","user":"ferguson-6","rank":[16,18]},{"title":"True story","rating":10,"date":"23 March 2019","review":"When I was young School boy, I first come across about this news about him,the terrible death and work. After many years,the movies clearly states why he had to go through this terrible death. And how much he is done for the people of India. Amazing movie !","user":"dastapash-77012","rank":[15,19]}]