[{"title":"Boring and Slow","rating":3,"date":"15 February 2020","review":"I sat through the whole film waiting for something to happen...and finally something happened and 10 minutes later the film was over.<br><br>LJ's character came across as cringy and painful to watch.<br><br>Felt rushed and didn't have the same charm as the first film.","user":"chloeohare","rank":[54,56]},{"title":"Horrible sequel","rating":2,"date":"15 February 2020","review":"This sequel was extremely hyped up and poorly executed. Within the first 5 minutes LJ says some corny nonsense that you would find on wattpad. Somewhere along the lines of being a good gf and then turning into a cringy and annoying one throughout the movie. The film also felt very rushed and had no sort of explanation for the emotions the characters felt for one another. One minute she's head-over-heels for Peter and promising not to break his heart and then the next she's hiding that she has a bf to a guy she hasn't seen in years and gets all flirty and dumb? The script was just ...sad. Had high hopes for this since I enjoyed the first movie. Netflix just keeps on making hot garbage teen movies that get worse each time.","user":"katerates","rank":[50,52]},{"title":"It takes a moment to sink in","rating":4,"date":"13 February 2020","review":"I read all three books before watching these movies and absolutely loved the books. Then the movie came around, and boy was I disappointed. The acting was okay for the most part but the romance was NOT there. Now, this movie comes around and I'm thinking, great another one to ruin. I'll talk about the good points of the movie first. Jordan Fisher was so cute as John Ambrose. I personally loved what he brought to the character and thought he should have ended up with Lara Jean. Also, the soundtrack for the movie was great. Now, to the bad. Peter was a complete jerk the whole freaking movie. I couldn't believe how rude and terrible he was. His acting was even pretty bad for this movie. He didn't seem to care. Lara Jean and him were not given justice this movie. I cringed every single time they were together. I loved Peter in the books but now I honestly hate what they did to his character. Once the movie ended, I sat there and thought wow... that was awful.","user":"brookenichole-98054","rank":[50,55]}]