[{"title":"So much better then expected.","rating":9,"date":"24 December 2018","review":"When I heard the premise, and heard that it wasn't endorsed by Agatha Christie's family, or indeed the estate, I feared the worst, so in truth I watched it with exceedingly low expectations, and is so often the case, I really enjoyed it. I thought the plot, direction, acting, and general vibe were all terrific.<br><br>The last time I watched something which tried to explain away Agatha's disappearance it involved The Doctor, Catherine Tate, and a giant wasp, this proposed a slightly more Earthly solution, but was equally as entertaining and witty.<br><br>Great acting, I loved Ruth Bradley's interpretation of the great writer, Samantha Spiro and Pippa Haywood were excellent also.<br><br>Bravo to those involved, a great Agatha Christie fix, ahead of The ABC Murders.<br><br>9/10","user":"Sleepin_Dragon","rank":[56,68]},{"title":"Unexpectly good","rating":8,"date":"23 December 2018","review":"For a made for Tv drama this was very good. understated, simple, but well executed.\nI never would have guessed the whole plot, but perhaps I enjoyed it more because I really wasn't expecting much!?","user":"RichardBJ-1","rank":[39,49]},{"title":"A fictional idea about what happened during Agatha Christie's real disappearance","rating":9,"date":"25 December 2018","review":"In 1926 the authoress Agatha Christie famously disappeared for eleven days then reappeared claiming no knowledge of what happened; this story imagines what might have happened. Agatha is suffering writer's block and her husband is seeking a divorce; then she is approached to solve a real murder. Initially unenthusiastic she later agrees and starts investigating. Pretending to be a lawyer named Mary Westmacott she assembles the suspects, with the lure of a large inheritance and starts questioning them. She quickly realises that real mysteries and works of fiction are quite different.<br><br>I confess I was a little unsure about the premise of putting a real person in an obviously fictional situation... but surprisingly it really works if you can suspend your disbelief somewhat. The story nicely combines known facts about her life at the time with an interesting fiction. The mystery she investigates has the feel of one of her stories, perhaps somewhat helped by the way the time period is captured. There are a good number of suspects, each with their own motives, as well as one or two red herrings. The cast are really good; most notably Ruth Bradley as Agatha Christie, Pippa Haywood, as the woman who brought the mystery to her and Tim McInnerny as one of the suspects. As stated before it is necessary to suspends one's disbelief at times; noticeably towards the end when a local policeman recognises our protagonist but does tell the authorities despite it being made clear that there is a nationwide manhunt for her. Overall though this was a fine murder mystery that could easily have come from the pen of the great women herself.","user":"Tweekums","rank":[37,47]}]