[{"title":"Who keeps funding Justin Lee's garbage films??","rating":3,"date":"10 March 2020","review":"Note to self: Check to see who directed, produced and wrote a film before you see it, and if it's Justin Lee, just don't!<br><br>This is the 3rd or 4th Justin Lee mess I've seen, and it's slightly better than the previous, mainly for the silly comedic attempts he made in this one, not to mention casting some bad-ass actors, albeit for a few minutes at a time.<br><br>What Lee improved on from his previous messes, was hiring a good cinematographer that I'm sure did his best with Lee's terrible directing and screenplay. The score was actually bearable in this film. But having Ed Morrone spew out the stupidest dialogue, and act like he was on speed trying to crack jokes, was a huge fail. Either make this a drama/thriller, or a comedy. Had it been a comedy, casting Keegan-Michael Key instead of Monroe would've made this film a hit, because that's who I thought of when I heard every lame joke that would've been jokes if delivered by Key - plus they have a similar look. The writing was so predictable full of plot and technical issues. The girl kicks his ass more than anyone else, whilst trowing vases and pans back and forth? Really smh? And what personal protection service would send, let alone hire an obnoxious loud annoying moron like Morrone's character?<br><br>Not sure if Lee's has rich parents that don't mind throwing away money on his flop films, but maybe he should take some of that and go to a professional film school. A generous 3/10 for the cinematography and bloopers in the end","user":"TheTopDawgCritic","rank":[11,16]},{"title":"This Is Silly","rating":1,"date":"7 March 2020","review":"If you're a smart person and you see the movie cover or poster, you're not even reading this. If you're a dumb person and a movie cover or poster showing one, two or even three guys pointing a gun and it makes you tink it's a good movie, you're not reading this because, simply put, you're not a reader. If you're in the middle of the pack and have enough common sense to know that you don't want to waste your time on garbage movies for garbage people, you MIGHT read this review.\nGo with your gut. Your gut said this movie is likely another slapped together mess with lots of loud music to mask the poor scene setting and occasional quips by tough guys - all stolen from movies like Die Hard... or Die Harder.. Or Die Hardest... Or Die Harder Most Deadly... Your gut is right: This movie isn't worth your time. It's not even worth your time reading this stupid review. It's time to stop churning out garbage like this. It's a waste of resources and the only way to stop this is by NOT giving it a chance to begin with. DO NOT SEE THIS MOVIE! Do not encourage producers to make this stuff. This is why theaters only show Star Wars, Comic Book Movies and Fast and Furious movies.","user":"genious-35413","rank":[14,30]},{"title":"Mediocre action movie, but what else did you expect?","rating":3,"date":"12 April 2020","review":"I give it 3 stars because it is actually entertaining, if you want to kill an hour. Main character is so obnoxious and the whole plot is so silly that it is actually funny.","user":"carlos-pires","rank":[1,1]}]