[{"title":"Infomercial, Non neutral documentary","rating":1,"date":"20 February 2019","review":"I originally expected a well informed documentary on the causes and effects, both psychologically and physiologically, of stress. And granted while the beginning is a rather brief and an almost incomplete summary of stress it later turns into a fully focused infomercial for the NET 'system' with the majority of the content being testimonials and personal recaps of how NET 'really helped' the individuals.<br><br>In the beginning the film attempts to summarise the origin and prior scientific studies which founded our current understanding of stress. However it leaves a lot of statements seeming rather unnecessary and unimportant, which felt like an attempt to add scientific substance to boost the film's validity. An example being stating Isaac Newton's 3 laws of physics but then never returning to correlate it to anything else besides its prior statement about a scientist who used the term 'stress' in structural engineering. While there was some interesting more relevant history, again it was never properly explained or explored, more just stated.<br><br>At first I was also rather confused as to why pretty much all the academics discussing the subject had the title 'D.C', one I had never came across before, unlike the usual MD or Psy.D. However after a quick Google search I discovered that it was for doctors of chiropractic. While chiropractor's are well informed I definitely would have expected a wider range of inputs from different fields to give a bigger and more complete picture, especially on the subject of stress.<br><br>After a small bit of reasonably informative 'chats' about stress it then cuts to this certain doctor who you then discover was the inventor of this system NET, which again is never explained or described initially, and from there the subject never seems to stray. A constant flow of personal experiences and 'studies'/Doctors that give pro-evidence to the ideals of NET follows and at this point it is no longer a documentary about stress but one about NET.<br><br>At one point it even begins to say that mental resolution of trauma is useless and how affirmation and positive thinking doesn't help and how stress is ALL really just physiological and not that much psychological.<br><br>It's really disappointing to sit down to watch a documentary about such a relevant topic to only be spammed with biased views and have very superficial scientific information. And to then realise halfway through that the big 'we couldn't have made this film without help from......XXXX' you get in the intro is really just saying that this documentary was funded by the association that uses NET. So it's self funded. NET funded a documentary about stress that says how good NET is.<br><br>In the end I only made it half way through before I began to skip through hoping it would go back to actual 'stress'. But it didn't so I turned it off. I actually felt so disappointed I created an IMDB account just to review it.<br><br>And it's crap.","user":"PoPoNZ","rank":[15,15]},{"title":"This video is an Ad for a specific therapy for sale called N.E.T.","rating":2,"date":"6 January 2019","review":"This video is an Ad for a specific therapy for sale called N.E.T.\nIts not so much a documentary about stress as an ad for a specific therapy to stress. They say N.E.T. a thousand times in the video. They are selling something. They never tell you what N.E.T. is or how it works. I am not saying N.E.T. does or doesnt work. I am just saying this video is a sales pitch.","user":"stacymovieland","rank":[43,61]},{"title":"New territory in healthcare","rating":10,"date":"23 January 2019","review":"This documentary is excellent. We are at a time when the mind-body connection can finally be researched scientifically. New models for psychological and natural healthcare are now here to help so many people. This movie explains how these models work and show the ground breaking research that should pave the way for big change.","user":"cip-55391","rank":[16,21]}]