[{"title":"WWE Royal Rumble: Above par but with glaring flaws","rating":6,"date":"28 January 2019","review":"I'm not going to do a big breakdown, it always encroaches too much on spoiler territory and it's very hard to review these things without doing so.<br><br>I also haven't acknowledged the pre-show, if WWE gives it no credibility then why should I?<br><br>To rate these things I use an average.<br><br>The breakdown was 8, 5, 7,8, 6, 2, 6 which brings it out as a median 6/10.<br><br>Now out of every ppv I tend to enjoy the Royal Rumble the most, I adore the title match and now we have a women's one as well it's doubled the appeal.<br><br>With both world titles on the line, both women's and one tag to support the rumbles it on paper was actually looking quite good. Sadly it also looked very predictable and truth be told I was right about every single match bar one, and the one I was incorrect about there is a very justified reason but I can't go into why.<br><br>Mostly logical outcomes, some high quality in ring performances and a few surprises (Though nothing truly unexpected) Royal Rumble 2019 is above par compared to recent WWE ppv's so credit where credit is due. Sadly a couple of mediocre parts and one bafflingly stupid booking decision damaged it for me.<br><br>The Good:<br><br>Some awesome entrants into the women's rumble<br><br>One amazing outcome<br><br>The Bad:<br><br>Lacey Evans repeated botches in her debut<br><br>Very predictable<br><br>One outstandingly stupid outcome","user":"Platypuschow","rank":[26,32]},{"title":"2019 Royal Rumble did stumble a little bit at parts. Nevertheless, the show was semi watchable. It was not a royal pain in the butt.","rating":7,"date":"25 March 2019","review":"Held at Chase Field in Phoenix, AZ. The 37th Royal Rumble was a very interesting show. However, the lack of stage entrance was kinda lamed. The dugout just didn't work for me. Regardless, ten matches were contested at the event, including three on the pre-show. Most were decent. Some of them were not. One such example was the strange bedfellow match between tag champions, Chad Gable &amp; Bobby Roode versus Rezor &amp; Scott Dawson. The buildup to this match didn't make any sense. Look, I understand a little bit, where they were going with the idea of having two members of rival teams join forces, in order to receive a Raw Tag Team Championship match on a later date. However, one of those teams has an injured member that isn't going to come back, anytime soon. So, why don't you just book the Revival Versus Gable &amp; Roode instead of this mess of a concept!? It would be a lot better than what we got. That match was slobby &amp; unfocused. The only highlight of that contest, was seeing the camera man fall down during the entrances. That was funny! Another laughable moment in the preshow, was the Daniel Bryan's promo with the Chase Field Burger. That fatty food looks like a heart attack ready to go! In the end, it was awesome to see Bryan really badmouth the venue. It fits with his preachy eco-friendly gimmick, so well. That brings us to the United States Championship match between champion, Rusev and challenger, Shinsuke Nakamura. That bout was alright, even if the climax to the match, has been done before and much better. The only loser here is Lana, whom is made out to look like a very weak wrestler. The next contest on the preshow was the fatal four way for the 205 cruiserweight championship. Like the previous match, this was also decent. While, the fight did make Akira Tozawa, Kallisto and champion, Buddy Murphy look good. It really didn't help Hideo Itami whom this match was his last, within the company. He can barely move now, due to his recent run of injuries. Hopefully, he can find success, back in the Japanese Indies. That brings us to the opening of the show. Becky Lynch versus the champion, Asuka. What an amazing match for the Smackdown Women Championship. Probably the best one of the whole night. Love how equally match, they were, move by move. As for the next contest on the card, the WWE Smackdown Tag Team Championship were on the line, as champions, Cesaro &amp; Sheamus try to defend their titles, against the challengers, Shane McMahon &amp; The Miz. I like the build up to this fight, but the bout was generic. Regardless, it was nice to see George Mizanin at ringside. There is a certain amount of charm, when he's around. Sasha Banks versus RAW women champion, Ronda Rousey was next. That championship match was fun to watch, even if the outcome is highly predictable, due to the WWE Tag Team Women Championship announcement a few weeks earlier and the continue twitter war with Becky Lynch. Despite, a few awkward &amp; sloppy ill-timed moves, I still like majority how both women told the story of each of them, trying to break or force a submission by bending their rival's arm. Banks was marvelous as always. Rousey is very impressive for somebody who been wrestling for only one year. She's a breakout rookie. Can't wait until this four horsewoman feud leads to something somewhat amazing. Nevertheless, the Women Royal Rumble match was next, and it was a lot better than the 1st one, last year, even with the awkward spots involving a hat, a little person, and Kofi Kingston rip off spot with Naomi. I just like how they focus more on the next generation of superstars, rather than bringing back the legends. As for the finish, I found it funny that Dave Finlay has more of a say, than any of the McMahon family, on who and who can't join this contest. Regardless, they made the right decision with the winner. Anyways, following this bout, was the WWE Championship Match between title holder, Daniel Bryan and challenger, AJ Styles. While, I do love the build up to this fight. The match was not that good. It was highly disappointing. The finish didn't really made sense. Why would a heavy metal thrasher, who wants to see the world burn, help the righteous good doer save the planet? It just doesn't add up. That man didn't even had a gimmick change to match Daniel Bryan, within the next several weeks after this show. In the end, it was a wasted opportunity. This brings us to the Universal Championship match, between the champion, Brock Lesnar and challenger, Finn Balor. Once again, I love the build up to this match. While, Braun Strowman was originally schedule to fight Lesnar. I kinda like how WWE replace him, in order to have Balor fight for the title, before Brock's ends up leaving for the UFC. This made the match seem fresh, rather than old. After all, we seen Strowman and Lesnar go at each other for the last several years. This replacement choice, gave us, something unique and new. The in-ring work from both performers didn't suck. It was an outstanding bout. They made Balor, really look like, he had an underdog chance of winning. Anyways, the main event follow this, and the Men Royal Rumble match was very entertaining. Not as good as the women one, but enjoyable. It just had way too many over complicated Kofi spots. However, in the end, it's still worth watching. Overall: This year's show was decent. I like how slowly, each year, the pay per view has gotta better, after a long drought of below average events. It was nearly a crowning achievement. So check it out!","user":"ironhorse_iv","rank":[4,6]},{"title":"GREATER THAN NXT TAKEOVER PHOENIX AND THE ACTION WAS EXHILARATING AT THE RUMBLE IN THE VALLEY OF THE SUN!","rating":9,"date":"28 January 2019","review":"I Would like to state that I can understand the dissatisfaction with wanting huge superstar names in this year's Rumble match for the women and men's. However do you realize that those stars such as Lita, Trish Stratus or even perhaps Sable and for the men's: Hulk Hogan, Ric Flair, Batista or The Rock would debase the current man and woman's roster whom are underutilized and not pushed at all even more. So just maybe it was a good call to not have any shocking or surprise entrants to the Rumble matches that have not been seen in a while or with the main team. I must say that the Royal Rumble was very much enjoyable and despite a couple of booking decisions with the order of matchups to the conclusion I believe this is in the top five to ten of the Rumble events.<br><br>Matches I loved: Asuka vs Becky Lynch Smackdown Woman's Championship and the Woman's Royal Rumble Match( Maryse and Melina and Victoria should have been in it) and even though it was short Brock Lesnar vs Finn Balor WWE UNIVERSAL CHAMPIONSHIP AND ON THE KICKOFF THE CRUISERWEIGHT CHAMPIONSHIP WITH BUDDY MURPHY, AKIRA TOZAWA, HIDEO ITAMI AND KALISTO<br><br>Matches that were great and surprised even if not thoroughly interested or booked wrongly: The BAR VS Shane McMahon and The Miz WWE Smackdown Tag Team Titles #1 Was very stunned at how great the four put on an excellent contest\nRonda Rousey vs Sasha Banks #2 Great fight just was concerned at how it was going 2 go but Sasha did her best and Ronda wins for the first time with her signature Piper's Pit not her famous finisher The Arm-breaker<br><br>Matches that were disappointing(botches or a bad start/middle or end or boring) or maybe at fair: #1THE NEW DANIEL BRYAN VS THE PHENOMENAL AJ STYLES\nWHY DO THIS TO AJ STYLES OR EVEN HAVE THE MATCH? THESE TWO HAVE FOUGHT FOR THE FOURTH TIME FOR THE TITLE IN FOUR MONTHS SO IT DID NO FAVORS TO HAVE THIS ESPECIALLY AFTER THE WOMEN'S RUMBLE TO BORE THE CROWD-THEY DID, IT WAS SO DEAD YOU COULD HEAR THE NEXT GUY WIPE HIS OR HER EYES(TEARS) I ALSO BELIEVE IT WAS ENTIRELY TOO LONG SHOULD HAVE BEEN OVER IN 12 MINUTES INSTEAD IT LASTED SLIGHTLY OVER 25 MINUTES JUST FOR AJ TO LOSE TO DANIEL WITH HELP FROM A RETURNING ERICK ROWAN- THE MATCH SHOULD HAVE BEEN WITH MUSTAFA ALI CHALLENGING DB ANYWAY HE PINNED THE CHAMP IN A TAG TEAM MATCH\n#2 The Men's Rumble Match: Even though they somewhat attempted the actual Men's Rumble match fell short of outstanding a quite bit there were no huge surprise appearances but I was not to devastated by that it was the order of entrants, the order of eliminations and who the superstars were eliminated by and the horrible booking for Drew Mcintyre and Braun Strowman both deserve more and preferably should have won. I am not to enthused by the suspected ME OF WRESTLEMANIA 35 BEING BROCK LESNAR VS SETH ROLLINS FOR WWE UNIVERSAL TITLE- WE HAVE SEEN THESE 2 COMPETE BEFORE AND I JUST DONT THINK IT IS WORTHY OF WM MATERIAL PLEASE GIVE IT TO STROWMAN AND MCINTYRE AND LET SETH CHOOSE DANIEL BRYAN OR AJ STYLES , IF HE CAN WIN BACK HIS TITLE PLEASE! The Men's match had a bit of entertaining offense but it still just either started and then died and picked up and then died again and got momentum because of anticipation to number 30 and died for the Final Time<br><br>Matches that completely sucked and had terrible or unexpected outcomes:\nKickoff show matches: Bobby Roode and Chad Gable vs Rezar and Scott Dawson WWE Raw Tag Titles Break Time or Wait I didn't even know this match was going to happen because it was impromptu and just sucked\nRusev vs Shinsuke Nakumara WWE United States Championship Lana should not have got on the apron to begin with- what did she think Shinsuke was going to do to her? and because of her stupidity we saw a quick US Title change in a match that was lackluster and boring. Poor Rusev it took him forever to get a belt back and he lost it in a month time now he might turn on his wife Lana soon!<br><br>WWE Royal Rumble 2019 could have been marvelous and I did enjoy it for the most part even though I believe a lot of calls should have been different but I liked my view in attendance in Section 220 Live at Chase Field","user":"jamontjohnson-83319","rank":[7,14]}]