[{"title":"Tits and Gore Couldn't Redeem the All-around Awful Amateur Execution","rating":2,"date":"25 February 2020","review":"The Misfits is a great band, and so is Danzig. Glenn Danzig is an icon, a legacy, a talented musician, and also the main \"Verotika's\" selling point for me. Sadly, after 90 minutes of considerably excruciating movie watching experience I have to conclude that Glenn doesn't know much about making movies. Tits and gore alone couldn't redeem the all-around undoubtedly objective mess that \"Verotika\" is.<br><br>\"Verotika\" is littered with a variety of filmmaking errors, bad or questionable creative decisions, sub-par or just plain bad acting, awful accents, awkward editing and cinematography solutions, drab lighting, bland score &amp; the list goes on. There are multiple scene continuity issues already in the first of the three stories, corpses with flinching eyes (and even a moving hand) and other basic mistakes. Even though distracting, those problems could be brushed off if everything else was on a decent level. It's not though, far from it. Most of the performances are stale, emotionless, the dialogue is amateur-hour and the quite often used accents are very questionable. The stories have zero depth and end up nowhere before repeating their respective shticks five times in a row - all three of them (stories) are structurally pretty much the same and equally flawed. The Framing segment eventually turns out pointless, empty and repeatitive. The production values are low, the gore doesn't impress and neither do the naked bodies. Wherever cgi or green screen is used, it can be noticed fast and easily. In the second story there are at least 10 to 15 minutes worth of striptease scenes, in theory you may not think so, but it turns into a bore fest fast. \"Verotika\", having no twists, turns or layers, stretches out big-time and ultimately is the exact opposite of what we call a \"rewarding experience\". Cinematography's hit &amp; miss, the bad parts are either bland and uninspiring or present, once again, minor errors. Maybe it's the editing, likely both. Glenn Danzing fails in directing, writing &amp; cinematography, so it's even more disappointing that the original score is also underwhelming.<br><br>They say that \"Verotika\" could become a cult midnighter and is the horror equivalent to \"The Room\". Even though I'm a horror buff myself, I have to admit I enjoyed \"The Room\" more. It'd help a lot if the viewer could tell if the awfulness and hilarity of \"Verotika\" was intentional or not. To sum it up, it's, well, very bad, with a few laughs. My rating: 2/10.","user":"TwistedContent","rank":[34,37]},{"title":"There are bad movies, and then there's \"Verotika.\"","rating":1,"date":"26 February 2020","review":"As a lifelong fan of Danzig's music, I was looking forward to his first time behind the camera, but it becomes pretty evident pretty quickly that the man can write a song, but he can't write or direct a movie. At many intervals, I had the urge to let loose a series of patented Danzig \"Whoa's!\" to assuage the pain of the nonsense I was seeing unfold before me. I only stuck around for the whole thing to properly review it and to see if there was anything redeeming about it. There wasn't.<br><br>This is listed as having a $1 million dollar budget, and I'm still trying to figure out where it all went, because I see none of it reflected on the screen. All of the sets look very, very cheap, like those you'd find in a high school play. The visual fx, which most of the time, should be any horror movie/anthology's bread and butter, are laughably awful. A cg spider that looks like it crawled out of the early 90s, static eyeballs slapped on to a pair of equally horrible with what look like silly putty, and a six armed monster whose crotch seam has broken and the open gape is clearly visible in one scene are just some of the ones that got the loudest laugh from me.<br><br>In several interviews, Danzig has spoken of his love for the genre; what he likes, what he's influenced by, and that's what I was hoping to see, but had I not watched those clips, \"Verotika\" would have led me to believe that he had never seen a movie in his life or had the slightest understanding of the process of how to make one.\nHe has a lot, and I mean A LOT to learn about directing, writing, continuity, lighting, staging, pacing, and editing if he ever wants to make something watchable, let alone enjoyable.<br><br>\"Verotika\" is an amateur bore, not worth the hour and a half of your life that you can't get back. Comparisons to \"The Room\" are apt as this is equally inept, even more so I feel. It clearly shows Danzig had no one telling him it was a sh.t show as production moved along, but he's got his defenders that will gladly die on the Hill of Danzig, praising everything he does with no discernment while enabling him to continue making terrible things.\nHiring Ashley Wisdom to be the lead in the first of the three things he calls stories was a huge mistake. Her fish lips are grotesque and extremely distracting. I guess Glenn didn't want to take the time to find any talented actors or actresses for this. While everyone here does a poor job, she does a REALLY poor job, showing no range, ability, or understanding of the craft of acting.<br><br>Yes, I know horror movies by and large are plagued by these very things I'm criticizing, but the great ones always have something memorable in them; something that people take with them even if it's just a cool concept, piece of makeup, character, or character in a mask. This has none of those things, and if I could give it a zero on here, I would.<br><br>It's online for free if you know where to look. That's how i saw it, and I still feel ripped off.","user":"grey-73357","rank":[20,22]},{"title":"D Movie Garbage","rating":1,"date":"25 February 2020","review":"I have 0 doubt in my mind the '10 star reviews' are from people involved with this movie in some way. There is no way any person on earth enjoyed this movie; let alone thought it was a 10 star film.\nThe acting is utterly atrocious, the 'special efx' highlight was a guy in a rubber suit, the lines oh my gosh the lines. It is some of the worst drivel Ive ever heard. And its not one of those movies so bad you laugh; its just BAD.","user":"IKnowGoodFilms","rank":[31,36]}]