[{"title":"Taylor Swift slithers her way to the top again!","rating":10,"date":"1 January 2019","review":"Taylor Swift has always been a perfectionist. She never leaves a single stone unturned and this tour is a marvelous example of the same. Performing hits after hits mashed up along with the songs off her latest album which was the highest selling album of 2018 in US, Taylor Swift really showed why she's a force to be reckoned with. From captivating visuals to firecrackers to ginormous stages to intricate details to amazing choreography to live instruments and vocals (something we rarely see in pop culture anymore), Taylor Swift impressed the millions she played to on this tour and now she's impressing millions more with the new netflix movie. Watch this 2 hour movie and get lost in its marvel!","user":"Shivam_Murari","rank":[48,61]},{"title":"STUNNING!","rating":10,"date":"1 January 2019","review":"The biggest pop artist of the decade once again proved that she is THE MUSIC INDUSTRY by playing 53 STADIUM shows with almost 3 Million tickets sold across 4 continents.","user":"delacruzpeter","rank":[34,48]},{"title":"Taylor Swift's best tour and one of the best tour movies of all time","rating":10,"date":"2 January 2019","review":"Paul Dugdale brings Taylor Swift's impeccable \"reputation Stadium Tour\" to the small screen so wondrously. Despite having a cold, Taylor was still able to hit every note and ever move. But the quality of this film and overall concert doesn't come from the vocals or the chereo, it comes from Swift's effortless ability to make EVERY fan feel like they are right in front of her face. Not many artists can make a 2 hour concert film fun to watch, but Taylor changes that by her ability to simply own a stage, but remain humble. Swift shines vocally in \"I Did Something Bad\" and \"Don't Blame Me\" while she makes bold statements with \"...Ready For It?\" and \"Look What You Made Me Do\". She also shows how vulnerable she really is with \"Delicate,\" \"Dancing With Our Hands Tied,\" \"Getaway Car,\" and \"Call It What You Want\". The overall concert film was a ride that I want to ride over and over again.","user":"jerryswift479","rank":[15,20]}]