[{"title":"Just Awful","rating":1,"date":"26 July 2019","review":"85 minutes of my life that I will never get back!Really can't get over how poor it was and how I actually got to the end of the film!","user":"Mister-Wonderful","rank":[8,9]},{"title":"Killer Dolls - that you don't see moving at all...","rating":3,"date":"10 July 2019","review":"Stuart Gordon's \"Dolls\" (1987) is still one of the best \"Killer Doll\" films and came out before succesful franchises like \"Child's Play\" and \"Puppet Master\".<br><br>This year's \"Dolls\" just happens to have the same title and subject because it certainly isnt a remake of the classic 1987 version.<br><br>The problem is that the simple screenplay is way too short for a feature film length. That's why most scenes are prolonged en seems to go on forever. Half of it's running time should haven ended up on the cutting room floor. The pace is too slow, endless scenes of boring dialogue.<br><br>The saddest part is that the Attic Dolls are only seen standing still, they're not seen in action, due to budgettary reasons I guess..<br><br>The cast in mediocre at best and this feels way to much like a made for TV film. The only real scare is why genre favorite Dee Wallace (The Howlling, E.T, Halloween 2007) is mixed up in this cheap mess.<br><br>There ar worse horror films out there but this is another disappointing attempt at making a scary film. Because it simply isn't.","user":"homecoming8","rank":[14,18]},{"title":"Dolls of death","rating":2,"date":"4 August 2019","review":"The cover looked very cool and freaky and the idea was a pretty decent one. Dee Wallace is a more than capable actress who keeps landing in mediocre or worse projects that she is better than. The idea was not an original one but the potential for it to work was there, because with the right resources 'Dolls' could have been agreeably creepy. Have made it clear in the past that there is appreciation for and not bias against the horror genre.<br><br>'Dolls' just fails to deliver. Wallace and an eerie setting keep it from being something without redeeming features, other than that it is a mess. It is the complete opposite of what the cover promised, being dull and cheap rather than freaky and any coolness is restricted solely to the cover. There is just very little to the film in atmosphere or in how the content is executed, instead of at least decent execution of an unoriginal but still intriguing idea, 'Dolls' is just so routine and with little momentum.<br><br>Wallace and the setting are the only good things.<br><br>Everything else in 'Dolls' however is a mess. There is nothing remotely unsettling about the dolls, the only scary thing about them is their lack of expression and they are used poorly, underused and when featured they don't really do much if anything. Didn't really get much horror, both in that there is too little of it and what there is is executed with no suspense or even with much effort or attempt to do anything fresh (very seen it all before). The far too thin story, which felt like a thinly plotted short film stretched with a lot of padding and non-stop sluggishness to feature film, and deadeningly dull pace drag 'Dolls' down significantly. In fact, they single-handedly spoil the film.<br><br>Furthermore, the script sounds very tired and cheesy, a big problem when there is far too much dialogue that makes many scenes drag, and the characters are both bland and annoying, motivations being poorly explored or not ringing true (both even). Other than Wallace, the cast fail to do anything with what they are given and seem stifled.<br><br>All in all, weak. 2/10","user":"TheLittleSongbird","rank":[6,7]}]