[{"title":"Just terrible!","rating":1,"date":"2 October 2019","review":"I thought some entertainment could've been found here, but no!\nAn absurd script beyond stupid, poor directing, unlikable characters you don't care for, utterly cheap special effects and backwoods locations make this a complete waste of time.\nWilliam Shatner was kinda funny playing the over the top soldier-dad, and it was nice to see Jeri Ryan aka Seven of Nine again.\nAlthough I like Star Trek and appreciated to see 2 of it's characters in a totally different production, there isn't anything else Devil's Revenge has to offer.","user":"LoremIpsum321","rank":[15,15]},{"title":"What?","rating":1,"date":"3 October 2019","review":"A terrible movie by any measure. Direction and editing created immense stretches of shots that add to the already far too long play time. Although probably meant to give the illusion of a long travel, it rather cemented in reality how terribly far Devil's Revenge had to travel to be a good movie.<br><br>Extremely irritating plot holes that are left to fester for the entire movie, and plot pieces that seemingly had nothing to do with the main plot at all.<br><br>People are disappear and people just appear in the movie without any explanation whatsoever. We have time to explore caves and rivers, but no time to explore rationality. I suppose maybe transporters were used? Why not, if it is up to our imaginations and does not have to be rational: so be it.<br><br>Shatner has a strange rant that I replayed several times... and I still have no idea what he was going on about. He was passionate, and Kirk swears, which I thought was very funny! Other than that; I gave up trying to figure it out. I simply didn't actually care what his character was trying to convey with his fathers heirloom shotgun... that he keeps in a dirty stable.<br><br>Very flimsy plot pieces with flimsy connections throughout. White actors playing Aztecs? Aztecs with a shrine in a Kentucky cave system. Conquistadores... really?<br><br>Direction: I am not sure their was any direction. Yes, we did realize Jeri Ryan was driving in circles in a parking lot for an entire scene. Rather easily actually.<br><br>The best actor in this movie was the Recreational Vehicle. RV played such a convincing filthy and dilapidated Southwind that I nearly wept.<br><br>Even \"Riff Trax\" will probably pass on this movie... Shatner or not. You should too.","user":"profsmichael","rank":[10,10]},{"title":"This is just insulting!","rating":1,"date":"2 October 2019","review":"What a pointless load of crap. This is like a textbook example of how not make movies. I feel like someone drilled a hole in my head. I cannot even express how stupid this movie is. I mean, at one point you say, ok, if you had few friends over and you want to laugh at a bunch of dumb scenes and basically just trash-talk this movie, and it's a dumpsite, you could still have some fun. But, then the movie ends and you realize that they made this pointless movie into a whole new level of pointless, it's now a huge middle finger to anyone who wasted their time watching it. And you get the feeling it goes on for like 3h. And anyone telling you this movie is worth watching has sold his soul for few dollars.","user":"bilismit","rank":[9,10]}]