[{"title":"Missed opportunity","rating":5,"date":"23 November 2019","review":"It had a lot of potential but was wasted on stupid plot decisions.<br><br>The premise was great, the actors were great, the potential was there, and they basically blew it. They tried to recoup it by making it mainly about the man and the woman getting back together after all that time, that really it is about relationships, but it was ultimately a big let down. On the most simplistic level, we did not even get to see them hug or cry together or anything, just the looks of shock, apparently to be artsy. Come on!<br><br>Instead of making the situation with the additional 3 crew into the usual story of the battle to decide who will die - so predictable - they could have made the rest of the film about the journey to Europa and getting there and finding out that other crew had survived from other places, etc.<br><br>I think there was a major flaw in the plot and that it must have been changed midway through, since the story starts with the idea of the creation of a habitable world on Europa and then retracts to just Pangea Station and no one ever even sees Europa. It sounds like they felt they couldn't manage the story of going to Europa, somehow, and cut it off - I suppose its cheaper set wise to never leave the station. But they sacrificed the film ultimately then, for the small amount of creativity to have had the characters move past just the two people and their own relationship, which was never fathomable anyway.<br><br>Finally, I have more faith in humanity that if faced with an inevitable end of the human race, not everyone will melt down into a monster except for 2 people. The stupid predictable ploy of the haunted house space station where everyone has to kill everyone else really tanks films at this point. We've seen that so many times and it's so 2nd grade to just retreat to that. I'd rather they never had the other 3 appear if they have to turn it into that.","user":"victronix01-180-707110","rank":[49,58]},{"title":"Not worth watching","rating":1,"date":"22 December 2019","review":"Right from the beginning. Plagued with bad writing throughout a lame story, it is (probably) supposed to be a \"study of the effects of long term deep space exposure on the human psyche\" or some such nonsense.<br><br>The long, silent opening sequence was meant to fast-forward the viewers through the first 5 years.\nIn 2190, a 4 person crew start a 10 year mission on a space station in deep space near a colony that is on one of Jupiter's moons (Europa). The station is supposed to be some kind of \"refuelling\" stop for people travelling between Earth and the colony (though they don't explain that or show anyone coming anywhere near them in the first 5 years).<br><br>5 years later the captain is losing his marbles and the crew doctor is ready to scrub the mission and have them all sent home for psychological reasons.\nThen the \"event\" happens (conveniently of course).<br><br>The station is (mysteriously) damaged and a crew member dies. Then the doctor decides to take a one way space walk. The remaining (2) crew try to save him by extending a mechanical arm towards him. Naturally, just as its within reach the Doc decides he wants to live - and as he reaches to grab the mechanical arm, the last section of it - just - falls - off, drifting off into space along with the Doc.<br><br>Then, just as the last 2 crew members are about to take some kind of suicide pill - literally about to put them in their mouths - miraculously they spot a shuttle drifting outside the station.\nInside they find 3 crew who had been on the International Space Station orbiting Earth and find out that the \"event\" was actually the Earth exploding for some unknown reason.\nDespite being right next to it, apparently they weren't as damaged as the space station that was hundreds of millions of miles away from the explosion. Their shuttle was damaged but still somehow made it to the station.<br><br>(More plot holes. The shuttle crew are revived and told that there was enough life support to keep them all alive until the shuttle can be repaired and they can fly to Europa. So what do they do ?\nHave a party. Smoking and drinking.\nWithout explaining what had happened until the next day (because of course, why would you bother mentioning some trivial detail like how you watched the Earth explode from 400(ish) kms away).<br><br>Then they find out that the station, which had enough life support to keep 4(+) people going for 10(+) years, will only support 2 people for 3 years.\nOr 5 people for 1 month.\n(But apparently there's enough cigarettes to keep everyone going forever !)\nAnd supposedly the shuttle (now) can't be fixed at all !<br><br>One thing leads to another and the damaged station ends up broken into 2 parts and apparently each half has enough life support to last 1 person indefinitely. Good thing too as each of the last 2 from the original station crew are in different parts of the station and the 3 from the shuttle are dead.<br><br>And somehow, despite the \"unfixable\" shuttle being damaged even further in the explosion that broke the station apart, the captain is able to repair it and - roughly 22 years after the station broke apart - in the year 3022 he is able to pilot it and literally fly straight to the other half of the station (despite not having any communication with it the entire time and no way to calculate where it may have drifted to in the preceding 22+ years).\nAnd, naturally, his partner is still alive.<br><br>The movie ends with the 2 crew members reunited on the one half of the station, drifting off into space. The same 2 who, 27 years earlier, were going to kill themselves back when things seemed hopeless.\nSomehow I don't think there'll be a sequel where some intrepid explorer finds them still drifting through space - and still alive.<br><br>(Did I mention that during this whole time - they had NO communication with the colony on Europa who apparently couldn't be bothered to check on them or try to figure out why they couldn't communicate with Earth either.)<br><br>The entire movie was poorly lit (perhaps to disguise cheap sets).\nThe plot holes were big enough to fly planets through.\nThe story line was lame.<br><br>The acting was OK. I only watched it to the end to see what they'd do with the last 2 (you knew he'd find her, somehow, and that she'd still be alive, somehow, but I wanted to see what happened after that).\nNothing.<br><br>And literally everyone smokes ! On space ships/stations in deep space 180+ years in the future !<br><br>I mean WTF ! Why is it that half the space movies I see these days have crews smoking like chimneys ?\nNOBODY SMOKES IN SPACE morons !\nNot now and sure as **** not 170 years from now (let alone even further in the future for some movies).<br><br>Blame that on the poor scripting and directing as well..<br><br>I would not recommend this to anyone unless you are on a very long flight where you can't sleep and there are no other choices. Even then I'd suggest watching something else. Or reading the in-flight magazine. Or the Emergency card. Or count the hairs on the back of the head of the person sitting in front of you.","user":"kerrydunn","rank":[45,60]},{"title":"Not too shabby","rating":6,"date":"22 November 2019","review":"Different than your usual space thrill fest. It's simple a 'lost at see/last man standing' kind of plot but it moves along well. The acting is above average and the camera, lighting &amp; sound are all solid. This isn't a multi-million dollar Hollywood blockbuster but it is an enjoyable piece of independent cinema with a sci-fi flavour.","user":"prcook-01758","rank":[57,81]}]