[{"title":"An epilogue worthy of Unicorn","rating":5,"date":"4 June 2019","review":"Gundam NT takes place a year after the ending of Gundam Unicorn. And let me remind you that Unicorn was a very perplexed and heavy story, with a tone of references and fan service to Universal Century stories. It had great fights, interesting mecha designs and decent to shallow characters.<br><br>In Gundam NT we have a tone of references, a lot of fan service to UC, some great fights, ridiculous overpowered mechas (although I loved \"Phoenix\") and decent to shallow characters, in a story incredibly thin.<br><br>It can be watched alone, too, but the best way to watch it, is as an aftermath movie to Unicorn. And then forget both of them and move on.","user":"Oneirosophos","rank":[1,1]},{"title":"A Sequel For The Fans","rating":6,"date":"13 March 2020","review":"A really good movie, BUT you have to be a long time fan to appreciate it.\nIf you're just a casual audience who didn't know the history of the Gundam Universal Century timeline, this movie will get confusing really fast, as tou won't understand which faction is which and who you want to root for. And the movie really just assumes you already know who's who.<br><br>For a long time fan like me, this is perfect because the story just continued from where last we left UC timeline in the Unicorn Gundam series.\nBut for newcomers, I would understand if you don't like it because there's very little exposition on the state of the world the story takes place, and hence the character motivation becomes \"blurry\"<br><br>The main plot in itself, in the most basic form is a triangle love story, boy likes girl, the other girl gets jealous, but in a midst of war, jealousy can lead to some dire consequences.<br><br>The story is nice, but again, you NEED to know the history of Gundam to appreciate the story.\nMy suggestion, watch other Gundam shows from the Universal Century timeline, at the very minimum watch the Unicorn Gundam series BEFORE WATCHING THIS MOVIE.<br><br>But if what you're looking for here is only mecha on Mecha action, then you're in for a treat, because this movie has PLENTY! The animation is fluid and really capture the movement of the battle, while the OST perfectly accompanying the dynamics of the battle, I personally LOVED the first action sequence where Phenex first shown on screen.<br><br>Mecha design is also cool, although it only refurbished previous mecha design. The only new mecha design I see is only Gundam Narrative, but even then you can see that it's just a mash up of Unicorn and Nu. Other mechas are just previous design with some new add on to sell new toys.<br><br>Overall a superb movie, with a HUGE CAVEAT that you have to know the history of the world the story took place.\nThat is why I only give it a 6/10, because in the end, this movie cannot stand on its own.","user":"leeozz-01336","rank":[0,0]},{"title":"Worthy successor to the Unicorn Gundam story and for those new to Gundam","rating":7,"date":"17 June 2019","review":"This movie starts off a little slow and confusing but eventually slowly revealed and quickly made sense for those who watched Unicorn Gundam. Animation overall is pretty good with some really good animation sequence in the first main Gundam fight. It lacks Gundam mecha visuals, there aren't that many variety of Gundams in this movie and features mainly 5 mobile suits. The main protagonists seems very disconnected even though they were made out to be some kind of love triangle but never evolved to anything more than their own connection with each other.<br><br>The story overall feels very light in terms of the scope of what the actual plot was supposed to be really about for Gundam fans. For non-Gundam fans the story seems very bitterly sweet.","user":"koh18999","rank":[0,0]}]