[{"title":"Family friendly","rating":9,"date":"28 March 2020","review":"I was excited for this movie to come out because my children were extras. I was pleasantly surprised at how enjoyable it was to watch. The whole family can get a great laugh and lesson watching the film. Kudos!!","user":"teeshia-mcroberts","rank":[1,1]},{"title":"This one can be watched mulitple times","rating":10,"date":"16 March 2020","review":"Very impressive production quality and the main characters are very believable in their roles! My kids (nieces and nephews) loved this and so did I.","user":"johnraleigh-18484","rank":[2,4]},{"title":"Barely enough to fill a trailer.","rating":3,"date":"9 April 2020","review":"Kudos to the marketing department and editor - Worth the $5.99 rental? Sure, only because and the amount of work that went into making , finishing &amp; marketing.<br><br>Who is this movie is made for ? I watched with my 11 year old who commented how bad some of the effects looked. I rated 3 stars because of major flaws. #1, #4, #5 and especially #8. When it comes to being a Family Movie.<br><br>1) The Robot Friend was simply to big to fit into that Backpack.\n2) IF the Robot's power life is based on the amount used - Why waist on - un\nnecessary activities.\n3) The Robot knows he has USB port , but not how to charge himself.\n4) Flying cars, and Unlimited power, yet these are not discovered or used.\n5) The Robot suit ( a rip off of Ironman ) way to small with to many wires to fit Josh.\n6) Josh instantly knows how to operate the suit.\n7) The bully scene - So many things wrong with it. It is a good thing that the actor\nknew where a perfectly good tomato is. Josh seemed to have done nothing to\ncause the 1 bully and not so bully run off.\n8) It is OK to not do your assignment, steal, and blackmail your brother who sneaks\nout at night. That's a good Kids movie.\n9) The urgency? As my 11 yr. son pointed out - if your phone battery\ndies - You simply recharge and turn it back on.\n10) Two Microwaves? - not sure why the restaurant was the only place. AND not\nsure what the doctor ( Robot's dad) was going to do if an Employee didn't have\n2.5 glasses.<br><br>Hope the movie makes enough money to make another - AND more thought goes into the writing.","user":"wdoug95608","rank":[0,0]}]