[{"title":"fine short","rating":6,"date":"22 August 2019","review":"Three Minions try to ship themselves to a Miami vacation. Instead, they are accidentally dropped in the North Pole where they find Santa's workshop. They try to join the work force but chaos ensues. The concept of this short is to bring the Minions to the original Minions. I can think of a funnier way to get them to Santa. They could be dumped along with the coal delivery. It doesn't really make sense that they are allowed to work at the workshop. The easiest solution is them disguising themselves as elves. I do like the crazy Minions antics. This is fine.","user":"SnoopyStyle","rank":[0,0]},{"title":"More Minion mayhem mediocrity","rating":4,"date":"23 April 2019","review":"\"Santa's Little Helpers\" is an American animated short film that runs for under 5 minutes and maybe a look at the picture and the production company Illumination Entertainment are already enough to tell you that this is the newest Minion short film. There have been really many by now already and the quality is not exactly increasing. I will spare you the names of the writers and directors here, but it is definitely more than you would expect for such a short film. And as always the Minions are voiced by the fully grown men that made them popular. Another thing that needs to be said is that this seemingly was released in February, but it makes little sense with the Christmas spirit to it. Oh well, I guess elves are busy all year long. Now, the usual 3 Minions end up at the North Pole here. They initially planned on making a sunny vacation in Miami, but the transport company screwed up. Strange route though that takes them over the Antarctica to Miami. Oh well, there they end up near Santa's headquarters and cause mayhem right away. By now, they really rely just on the Minions being Minions and this and the good animation are enoigh to keep this from being a failure, but not enough to call it a good movie. The electric shock scene near the end, the gingerbread house with a Minion inside and the high-profile elf's pink beard are not enough. The released reindeer scene also adds nothing and felt just rushed in for the sake of it. I did like the Minions' reaction and face expression early on when they (do not yet) realize they aren't in Florida. And the Minions' take on Jingle Bell that comes with the closing credits isn't too shabby either. But all in all, it is not enough for a positive recommendation. Watch something else instead.","user":"Horst_In_Translation","rank":[1,3]}]