[{"title":"This ain't it","rating":2,"date":"2 March 2020","review":"At the time of writing this, there are only two other reviews for this film on IMDb. Both accounts praise the film; one account was only created to review this one film, and the other has only reviewed a few indie films and gives 10/10 to all of them. I'm here to represent you-<br><br>This movie kind of sucks. The production quality is similar to that of a made for BBC TV series or movie...looking and feeling very drab and stale. The first 10 minutes will tell you all you need to know about what this movie offers visually. Story is pretty much nothing, with a universally generic and obnoxious cast, from the strippers to the fraternity style corporate jerks to the stereotypical saint-like 'final girl'. Some could argue that the pay-off of seeing them picked off one by one is worth suffering through the scenes of the characters being just generally awful people, except the lines are badly written and delivered like soggy french fries. Did anyone really care? The cinematography makes it seem like an amateur effort, and the cast convinces me that it really is. Not the worst film I've seen so far in 2020, but I can't recommend it to anyone who I take seriously as a fan of good movies. 2.4/10","user":"umimelectric","rank":[26,38]},{"title":"It's Really, Really, REALLY Bad!","rating":1,"date":"10 March 2020","review":"I thought that I'd give it a chance, but the movie wasn't even funny in the slightest. Not even B grade, so bad it's funny.<br><br>None of the characters are likeable in the slightest, even the supposed good girl (Final Girl). I was hoping that every single person would die.<br><br>Not even the killer was interesting.<br><br>Every word spoken was some kind of cliche and the chanters did really stupid things that a normal person wouldn't.<br><br>The strippers were attractive or could even dance at all.<br><br>There wasn't much of a plot to think of.<br><br>Don't watch this! Save your sanity.","user":"Aurelia_Destiny","rank":[6,7]},{"title":"you should probably pass on this","rating":3,"date":"4 March 2020","review":"Production value is ok acting kind of weak and story lines blah.<br><br>The description makes it sound good..... but alas very bad movie<br><br>3.1","user":"natcalgary","rank":[7,11]}]