[{"title":"A dark, slow-burning film about racial tensions in today's Copenhagen.","rating":7,"date":"25 February 2020","review":"The problem of massive immigration from countries like Afghanistan, Syria, Iraq, and Iran in Europe in the last decade has become one of the most prominent problems for the continent and has caused multiple frictions between the native populations and the Muslim immigrants. Furthermore, the rise in terrorist attacks made the people all the more suspicious towards the Muslim immigrants and new political parties preaching nationalism and xenophobia have gained immense power in the last few years throughout Europe. This film is the debut feature film by Ulaa Salim, who has only shot short films so far, and it focuses on the lives of two immigrants in Copenhagen, Zakaria (Mohammed Ismail Mohammed) and Malik (Zaki Youssef). Zakaria is a young man who watches the newly founded Danish nationalist party ready to govern the country and a far-right extremist group called \"Sons of Denmark\" spreading fear and panic by committing vicious attacks to random immigrants in the city. The European audience is certainly familiar with that kind of rhetoric and action from far-right politicians as they exist in almost every single country today. Malik is a bit older and also the right-hand of Hassan, a kind of mentor for all Muslim extremists and the mastermind behind many terrorist attacks in Denmark. The movie's first scene is a terrorist attack in the Nørrebro station, in central Copenhagen where a young Danish man sees his girlfriend die due to a bomb explosion. Then the film cuts to Zakaria and we watch the first half of the story unravel through his point of view. In the second half, Malik becomes the sole protagonist until the shattering climax in the final minutes of the film's runtime.<br><br>Salim attempts to delve into the personal universe of Zakaria who is easily radicalized by Hassan and focuses on the relationship between Zakaria and his family, his mother and little brother. Moreover, the director highlights the feelings of insecurity that torment Zakaria and the fear of what will happen to his family. Hassan is a cruel agitator who exploits the misfortune of his fellow countrymen in order to turn young children into brutal terrorists and executioners. Parallel with Zakaria's story, we are watching some short snippets by the TV news that establish the rapid growth of the Danish nationalist party and the expanding popularity of its leader, Martin Nordahl (Rasmus Bjerg). Nordahl's rhetoric is dangerously close to that of the Nazis in the Second World War, always stressing the need to deport all immigrants from Denmark, and he justifies his views on the Islamist terrorist activity which cost the lives of 24 people in the Nørrebro attack. As a result \"Sons of Denmark\" commit many atrocities against Muslims in the neighborhoods of Copenhagen and the level of violence is escalating as time passes. Hassan tells to Zakaria: \"They call themselves Sons of Denmark. To me, they are the filth of Denmark\". He succeeds in growing Zakaria into a fanatic, ready to do anything, even if that includes murder. Ali (Zaki Youssef) is Hassan's sidekick and he is the one that trains Zakaria for him to kill Nordahl in his own house. But, when Zakaria gets into Nordahl's house and attempts to kill him, he finds out that he has been set up by Ali who called the cops to arrest him. With Zakaria in prison, the director shifts his focus to Ali, whose real name is Malik, an undercover cop who infiltrated Hassan's group in order to collect information for the authorities and prevent possible terrorist acts. Malik, a Muslim himself, has his own family, a wife and a small kid, and he is struggling with feelings of shame emanating from his deceit and betrayal of his fellow countrymen. His boss in the police force, Jon (Olaf Johannessen), trusts him and respects him despite his frequent bursts of anger. Jon will keep Malik in the surveillance but this time he will be investigating the Sons of Denmark group which is ready to launch a series of attacks in the election night.<br><br>The racism theme has been explored in several Danish films like Bleeder, Pusher, R, Journal 64 and others, though not fully. That means that the above pictures included racism in their plot, but it was not their main motif. Sons of Denmark is a dark, violent movie that is shot masterfully with the prominent use of red and black colors which adds to the overall gloominess and sense of impending doom that the audience feels during the two hours of the film's runtime. The pacing is slow, though never becomes tiresome for the viewer who absorbs the gritty mood that the movie exudes and identified with both the protagonists, especially with Malik who is a great character. Zaki Youssef is a rising star in Danish cinema and it should be noted that he will portray Assad in the new \"Department Q\" movie series also starring Ulrich Thomsen. Mohammed Ismail Mohammed leaves his mark in his first feature film and I sincerely hope that we will see more of him in the near future. I read some reviews that denounce Sons of Denmark as a preaching propaganda film trying to make a political point. I disagree with that notion and I believe that the director wanted to emphasize on the characters as individual persons, to portray their everyday life and its struggles in a hostile environment. I didn't feel that the target was to manipulate the audience in order to establish an ideologically charged political perspective. It is a film about people and it is addressed to everyone regardless of their nationality or political views. That's a very promising debut by Ulaa Salim who is now added to the ever-expanding map of notable Scandinavian auteurs, and a film that I recommend to everyone who enjoys quality political thrillers. Keep in mind that this is a violent film and some scenes are downright disturbing.","user":"DimitrisPassas-TapTheLine","rank":[6,9]},{"title":"a big preachy yawner","rating":1,"date":"22 February 2020","review":"Go to church...it will be much more entertaining and maybe you'll ever get a bit of positive energy, whereas this movie only gave me \"the nods\". YAWN.","user":"ferdmalenfant","rank":[8,16]},{"title":"One of the worst viewing experiences of my life","rating":1,"date":"20 February 2020","review":"The amount of political bias, and general bias purported in this movie is staggering, I really can't write a full review of this except to warn people to NOT WATCH THIS MOVIE. It's a complete waste of time, full of very bias political and religious ideology with only one purposes, to create a further divide among people.<br><br>Do not support or watch this if you are a normal caring human being who do not wish harm upon others. If you're someone who believes that religion is the supreme decider of all human beings, and that religion should decide every aspect of your life and triumph above human civilization and democracy, then this is the movie for you.<br><br>To add, the cinematography is terrible, the direction is terrible, the script is terrible, the dialogue is juvenile and immature, the sound editing is beyond atrocious with stock audio being used several times without even the slightest editing.","user":"RomeoQQ","rank":[17,41]}]