[{"title":"Subtle but mesmerizing film that will stick in your head","rating":9,"date":"21 January 2020","review":"Black and white is back....'Bait' is a fine piece of visually stunning filmwork.....a bloody work of art. It also includes a cast of many first timers that pulled their weight like big Hollywood stars.<br><br>A subtle story with a huge message. As a coastal Floridian USA, I know exactly what this film is talking about, only this film says it much better. I'm not even sure I have the intellect or the vocabulary to offer a satisfactory review or critique of this film.<br><br>A simple story with complex characters. Dialog is sparse but adequate and spoken visually with few words. The old time black and white ambiance is the perfect foil to portray the flawed nature of character.<br><br>A love story shown from many perspectives. A one time fishing village now in flux and weathering out the new reality. A fisherman unwavering and unwilling to change with the times. I widowed father doing what he needs to survive for his son. The city folk looking for peace and quiet weekend. The Inn keepers building a summer business. Teenagers coming to age and looking for relationships and purpose. The bar, and owner at the center of town serving her patrons and trying to stay afloat. They all revolve each other as each character reaches for what they believe is most important. Tragedy strikes and we see what's truly the most important.<br><br>This is a must see film and direction, location, content, casting, script, audio, visual, media, production, editing, etc, etc....were all well defined and executed. I rated a 9, excellent, although this type of film might not be everyone's cup of tea.","user":"safsurfer","rank":[17,23]},{"title":"Made with love","rating":7,"date":"5 September 2019","review":"Bait is a pretty remarkable film. Saw it at the excellent BFI Southbank. It's set in the present day but filmed using techniques from the old silent film era - with sound - including audio - added afterwards. No moving camera. Shot as if the person being spoken to is holding said camera (think Peep Show). Beautiful black and white. It's an extension of the dogme filmmaking mantra. The director is basically sticking two fingers up at CGI and digital technology. And the result is mesmerising. However, would the drama stand up on its own two feet if it were filmed 'conventionally'? To be honest, I doubt it. But I don't think that matters.","user":"michael-kerrigan-526-124974","rank":[24,37]},{"title":"Original and refreshingly menacing....","rating":8,"date":"22 January 2020","review":"I don't review many films on IMDB but was moved enough by BAIT to write something. The visuals are always interesting, shot in black and white it reminded me of some of the British WW2 propaganda films, especially with some of the performances that are by their nature very realistic and not showy. The performance of Edward Rowe is mesmerising as a tortured man, his livelihood threatened, his culture undermined, his sheer frustration with what life has dealt him. I really didn't know what to expect from his character with each twist and turn. I also really appreciated the non-romantic view of Cornwall, it wasn't idolised and showed the impact of the decline of traditional industry with the growth in tourism. I hope a lot of viewers won't be put off by it being in black and white as it deserves to be seen widely","user":"JBLOSS","rank":[8,11]}]