[{"title":"its a debut","rating":1,"date":"23 March 2019","review":"This is nothing more than a camera lurking behind the perputrators back, with unclear closeups shaded by changing light and dark, with an amateurish acting like an homemade bondage web cam video,where you can almost hear the breathing of the cameraman, and start to wonder how they could afford to buy a smokemachine and not being suffocated in the dense smoke in the prison dungeon. this is homemade stuff with not so much horror than violence that seems dense and painfull, and if you can avoid it, dont look at it, its pure newbie trash thinks the grumpy old man","user":"ops-52535","rank":[23,39]},{"title":"I Give Up","rating":1,"date":"25 March 2019","review":"This film has nothing to say and nothing to see of any interest whatsoever. I think it's the worst film I've ever seen,in just about every way,to be honest.","user":"andrewfowler-37028","rank":[15,24]},{"title":"Utterly awful attempt with a few solid ideas","rating":1,"date":"24 March 2019","review":"Heading out to find a new victim, a serial killer finds a young girl and brings her back to his lair in order to torture her for a legion of followers online only to have his hands full with trying to ensure he can stay focused on the task at hand.<br><br>Overall, this was quite the decidedly awful serial killer effort. One of the few enjoyable elements to be had here is the fact that the found footage creation manages to work decidedly well for the film's overall point. The simplistic nature of what's going on, with the initial scenes of the guy preparing to go out and then following her for several blocks before striking and taking her, sets up a rather intriguing setup that plays out involving the live-streaming and the torture that's inflicted there. With everything that's shown here of the barbaric and brutal manners of torture that inflicts for the live streaming patrons that he continually interactions As well, the final revenge here is completely worthwhile and earned from the start, which is about all that works here. There's a lot to dislike here, starting with the absolutely primitive setup that really does this one no favors. The one-setting location of the entire effort means the camera never changes from the same static shot of her in the background tied up while he interacts sporadically with her and turns the entire affair into a bland, drawn-out repetitive effort. It's all pretty much the same thing for the entire time as they just sit around either talking about what the purpose of his tormenting and torturing her is all about or featuring some utterly banal and weak torture scenes where the camera angle makes it obvious he's not making contact with her which lowers the intensity significantly. The scenes of the two engaging in the revelation of his rampage are just laughable and cringe-inducing, really making this one really lame and bland.<br><br>Rated Unrated/R: Intense Violence and Graphic Language.","user":"kannibalcorpsegrinder","rank":[18,32]}]