[{"title":"WHERE LEGENDS ARE FOUND","rating":9,"date":"26 March 2020","review":"I've never been a huge fan of country music. A lot of that may come from growing up in a household where it was seldom if ever played. My dad did like Hank Williams and my grandmother Jim Reeves but it wasn't something that we listened to on a regular basis. I began liking more of it when I got older.<br><br>But country music has changed quite a bit in recent years as well. Where the once twangy guitars and semi-yodeling style of music reigned supreme a more up-tempo and rock influence has crept in. A circular influence of country into rock with groups like the Eagles has found its way back full circle into country. You can hear it in the songs of Keith Urban and Garth Brooks. But at its heart it's still country.<br><br>What you may not realize is that it's not always the performer who makes it country music. In many cases it's the songwriter who does so. There are a vast number of those in the home of country, Nashville. So what's a good way to get discovered among that mass? The Bluebird Café.<br><br>The movie BLUEBIRD gives you the history of the tiny café that became the mecca for songwriters and performers in Nashville. Opening in June of 1982 in a small strip mall next to a beauty parlor and dry cleaners, the café fed people but eventually began adding music as well. But even that changed over time. In 1984 they had their first Writer's Night and songwriters began showing up offering their latest songs. Some of these led to being discovered. The same held true for performers as well.<br><br>A number of these songwriters and performers show up to be a part of this film, proclaiming their love of the location and helping to create it into a place for fans to seek out. Performers like Garth Brooks is on hand and we hear how after being turned down by nearly everyone seeing him perform here led to his being signed. The same for Taylor Swift who is also on hand. Vince Gill performs too as well as several others.<br><br>Owner Amy Kurland kept the place running from its opening until she decided to sell in 2008. Not wanting it to fall into the hands of developers who would have just town down the site for a new office building she made sure it fell into the right hands, the Nashville Songwriters Association International. The location is still running in the same spot and still has the same Writer's Night going strong.<br><br>The movie is a collection of photos, recollections and reflections on the place and what it means to those who rose there or who were inspired by what took place there. The film became a backdrop for the series NASHVILLE and people involved with that series discuss its influence as well. And through it all you get the chance to hear some great music from the people it meant to most to, those who wrote the songs that we've all become familiar with.<br><br>You may not be a fan of country music but if you love music at all you'll know the importance of those who write the songs. You'll recognize that the tradition of telling a story in song is still alive and well in spite of the pop tarts who rack up downloads that will be long forgotten in years to come. But at some point songs like \"The Gambler\" and \"Where've You Been\", both performed here by their writers, will still be remembered and played.<br><br>The movie pays tribute to what came before and what will follow. It shows you the inside of the location and how it is still thriving. It provides you the history and shows the love of the place. And it does so while entertaining at the same time. This one is worth a watch for any and all music fans.","user":"kirbylee70-599-526179","rank":[0,0]},{"title":"Excellent Nostalgic Nashville","rating":9,"date":"24 February 2020","review":"Across the street on Hillsboro Pike from The Bluebird Cafe, there was a full service Exxon gas station. I was a college student in my early twenties during the day and pump jockey nights and weekends, that was 1984-85. This documentary talks about The Bluebird Cafe originally being more of a mixed venue for up and coming new wave rock music artists but also some jazz and country entertainers. Because of the location, I was fortunate to meet and get autographs from those already well known. Back then, The Bluebird was not as overcrowded as shown in current modern times. It was easier to get in and one evening I got to see Don Everly play many of the hits he and his brother Phil were know for from the 50s and 60s.<br><br>What I liked the most in this documentary was how The Bluebird Cafe evolved into a place for singer song writers. All of the staff becoming like a family who were dedicated to the initiative of helping unknown artists an opportunity to realize their dreams. Besides seeing the artists who have gone on to be famous, there are many others. From a musicians point of view, I liked the fact that the performers were always part of the audience.<br><br>You will get to hear tons of clean acoustic guitar with a deep, warm and rich tones. The vocals with artistic emotional bends, highs and lows, that will make you feel the passion as it flows from their soul. Rated 9/10.","user":"wyldeone2","rank":[0,0]},{"title":"Worth a Watch","rating":9,"date":"19 November 2019","review":"It's history no matter how you look at it. A great behind the scenes view of one of Nashville's best listening rooms. Seeing the artists and the staff behind the venue made it all worth it.","user":"hook0331","rank":[1,2]}]