[{"title":"This is about as exciting as it is possible to make a pothole.","rating":6,"date":"27 January 2019","review":"The documentary centers on the repair of potholes, mostly in rural and suburban roads in the U.K. Of course the producers had to throw in their climate change ante (without anything to back it up), but the material and participants were about as entertaining and engaging as the subject allows.<br><br>This attributes potholes to one cause, freezing and expansion, when there are several. The piece downplays long-term negligence and road bed settling from increased traffic volume and insufficient compaction to begin with. It is otherwise fairly comprehensive, including efforts to encourage (force) property owners to bear the cost directly, and shows many tools and methods used to try to fill potholes quickly.","user":"hughhemington","rank":[1,1]},{"title":"Climate Change Global Warming The End of Earth.","rating":2,"date":"28 January 2019","review":"They ruined the movie by including climate change as the reason for more potholes. We have had potholes since we started making roads and the climate has changed during every season since the beginning of Earth. Climate change is real but it only changes with the climate of the seasons not that the temperature is going up or down or the water levels are rising because of the melting of the glaciers. First it was global warming then they had to change global warming to climate change because Al Gore said 25 years ago that in the next 15 years all coastal areas will be flooded and all those cities will be gone. It has been 25 years since Al Gore has predicted this and all the cities are still here so they had to change it to climate change because the climate always changes. Al Gore also said that the polar bears would be extinct and at that time there were five thousand polar bears now there are over 30,000 polar bears you do the math. All this was done just to make money so sad and it's still going on.","user":"capasso67","rank":[0,5]}]