[{"title":"Please read this before you judge","rating":9,"date":"15 February 2020","review":"Five reviews prior to mine, and sadly, the four 10's are fake, and that is a huge mistake the producers keep making. IMDb users are not dumb, and can see that those are first time reviewers, and are clearly fake, it annoys us, we decide not to watch the film and angrily give it a 1 to offset the fake 10's. What's worse, is that this film will be judged and rated inaccurately, and that sucks, because this film is more worthy than the current 6.4/10 rating.<br><br>Yes, I gave this film a 9/10, and my review is honest and real - click on my username to see my 1000+ ratings and 800+ reviews... and I DID watch it. The only reason I did was because the trailer intrigued me, plus it's 100% fresh on Rotten Tomatoes with praise from EVERY real film critic. I'm glad I gave this film a chance, and I hope you do too.<br><br>I can't stand slow paced films, but this one kept me sucked in until the end. The 88 min runtime is perfect for its pacing, and there's more than enough context in the writing that time flies by, especially from the outstanding performance by newbie actress (and model and Al Pacino's stepdaughter) Camila Morrone. Clearly Pacino gave her great acting tips because I felt her pain and frustration throughout the entire film. James Badge Dale's performance was so stellar, I wanted to reach in and punch him out, and at other times give him an understanding hug. For that matter, all other casting and performances were on point.<br><br>Actress turned writer and director Annabelle Attanasio makes her first full length feature film debut with this little gem. I agree with the only real review out of the five by user lor_ (weird there is no rating attached) that this film is a \"depressing slice of life film that injects numerous topical themes, ranging from the fate of damaged war vets, the nation's addiction crisis, to problems of caregivers\", but disagree on \"failing to develop them fully\". This film isn't about those issues, but instead about how a young girl deals with her life whilst caring for her ill dad and the failed system. Myself as a father with a daughter of the same ages, this film was gut-wrenching. Sadly, this film can easily be a biopic for many American vets alone with a single child caregiver. They are either abandoned, or ruin their child's life, and this reality in my opinion needed to be told on the big screen.<br><br>Attanasio created a realistic atmosphere without all the typical Hollywood fluff with her near perfect writing and directing - and she's a noob! Mad props for pulling it off so real and well in creating this little gem.<br><br>The cinematography was excellent and the small town setting really set the tone, especially some of the stills. The score was just right at the right moments. In all, this gem was artful as it was unforced, and rich with authenticity. It's been a few hours, and I still feel the uneasiness this film created, and that's a huge win. A must see imo and a well deserved and honest 9/10 from me.","user":"TheTopDawgCritic","rank":[24,29]},{"title":"Zero degrees of freedom","rating":5,"date":"5 October 2019","review":"First-time feature director Annabelle Attanasio gets excellent performances from her cast, led by the talented Camila Morrone and James Badge Dale, but her original screenplay fails to make the grade.<br><br>This is a real downer, a depressing slice of life film that injects numerous topical themes, ranging from the fate of damaged war vets, the nation's addiction crisis to problems of caregivers, while failing to develop them fully. Instead we have Morrone as an 18-year-old heroine faced with the difficult choice of staying to care for her hopelessly destructive father or escape to a new life away from him, but by the end of the movie the choice is virtually made for her by taking away all her other options.<br><br>Many red herrings are employed by Attanasio in this grim saga, which produces quite a bit of tension, never released for the viewer. There is an element of escapism in that the audience can feel relieved they are not suffering such awful circumstances as the characters endure, but that hardly makes for a recommendation.<br><br>As with so many other \"film festival fodder\" movies, it's designed for consumption by an elite audience of cinephiles. As a card carrying member of that unfortunate group, I wasn't pleased with the blatant visual reference to Truffaut's \"400 Blows\", not advisable if one wants his or her work to be taken seriously.","user":"lor_","rank":[13,22]},{"title":"The bear","rating":10,"date":"3 March 2020","review":"In this a bear is shown lit up by a full moon The bear falls in love in this and undergoes torcher.","user":"catpantry","rank":[3,7]}]