[{"title":"Good for families with older children","rating":7,"date":"7 February 2020","review":"Good family movie (for those with older kids)\nSlapstick type violence but also heavy at times.\nLighthearted humour all the way through but also contains mild adult humour.\nA decent film. I sat through it and I get easily distracted with my phone, I left my phone alone so I must have enjoyed it.\nNo swearing. No sexuality.\nOverall a decent watchable movie.","user":"aliciazoe","rank":[14,17]},{"title":"After the first one, the one that more feels ''Dragonheart''","rating":7,"date":"11 February 2020","review":"I must admit, I didn't have any hope for this movie. The second one to forth one had horrible CGI with horrible story. This one doesn't have a breaking story, nor is it go so big like the first one about a rebellion against a tyranical king, but the story and charachters still \"feels\" Dragonheart. There are several points through the film that goes deep into the dragons lore, and that is always good. It has a very decent CGI, the charachters, although not awesome, ar well played, and the dragoness looks nice!\nLet's remember that the original Dragonheart didn't have awesome CGI, and this one compares to that level and I dare to say that tops it. Above avarage,","user":"alejandroyava","rank":[10,12]},{"title":"Best of the Prequels","rating":8,"date":"13 February 2020","review":"I really loved the first film. It was different, fun, and a good story. After Dragonheart there was one sequel, which was basically terrible... and multiple prequels that were equally (if not moreso) terrible. CGI lacked, storyline felt repeated, and I'd seen better acting at high school musicals.<br><br>Then came Vengeance. Will it get oscars? No. Was the CGI worthy of a big screen? Not quiet, BUT, out of the prequels, the dragon looked loads better then the prior films and believable. It had a more original storyline, as they pulled further back from the whole heart share thing (though still relevant) being the driving plot, which was beaten down our throats in the other films.<br><br>Joseph (Darius) and Hannah (Sivith) were fun characters and the acting was decent enough to not let it get in the way. I thought Sivith had the most \"Draco like\" persona... and it felt nostalgic to the original.<br><br>The plot was kinda predictable, but straight to DVD/Stream is kinda expected.<br><br>It has a happy fluff ending. Don't expect a blockbuster, but if you take it for just the fun film it is, it's a good watch.","user":"sarahnewcomer","rank":[12,15]}]