[{"title":"Very nice animation and great voice actors.","rating":8,"date":"15 May 2019","review":"Very interesting and some funny, most because of michaelangelo.\nBut, what surprised me, was the same voice from batman and the joker. I really thought it was joker's Mark Hamill!\nAwesome!","user":"patero2012","rank":[44,47]},{"title":"This crazy crossover actually works out pretty well.","rating":8,"date":"21 May 2019","review":"I am a fan of both Batman and the Ninja Turtles, but my initial thoughts on this crossover was that it would take a lot to make it work, because of how tonally different the tv adaptations of these comic book characters are from one another.<br><br>But it actually works out pretty well. Sure, we get to see how the turtles' personalities mix with Batman and co., and the jokey nature can be a little forced at times, but I was satisfied with the outcome and the surprisingly high entertainment value. Leo and Bats work out well together and Raph and Robin as well.<br><br>It also delivers a lot of awesome fight scenes between a wide range of Batman villains, because aside from the Shredder and his Foot Clan including Baxter Stockman there are no Turtles' villains. And to be honest, while Shredder is awesome, he is under used in the movie not doing very much.<br><br>The voice cast was good. Troy Baker does a very convincing Mark Hamil impression on the Joker and a take on Bats that's more his own. Those two really stood out. Not that the others didn't do well, it's just not as intimidating as earlier portrayals. The Turtles themselves delivered what you'd expect, so no comment there.<br><br>The overall look of the film can be summed up like this: if the characters are mostly from the Batman catalog, the look of the film is more like the turtles' comics and it works out okay. Some of the character design were a little weird like Donnie, Joker and Mr. Freeze, but aside from those it's well done with pretty backgrounds and more colours used than the usual dark colour scheme from the Batman movies.<br><br>To sum up, this seemingly weird crossover offers a lot of good fight scenes and a good mix of the two comic book universes in an enjoyable superhero cartoon.","user":"Animany94","rank":[24,25]},{"title":"Come on man","rating":9,"date":"29 May 2019","review":"How in the world is this movie rated a 7.2 ? That's ridiculous lol I thought this movie was great . I absolutely loved this movie . 9/10 easily","user":"espn-43672","rank":[21,22]}]