[{"title":"From dusk till dawn Geriatric version","rating":6,"date":"18 March 2020","review":"First, here we have a non pretentious movie with a great cast and 80's style gore-action.\nSecond, looks like the director was inspired by movies like From Dusk Till Dawn or Hobo with a shotgun and Carpenter's Vampires.\nLast, I really appreciate the effort of creating something decent here and in some ways it accomplished.\nTo add, decent performances and great 80's stylish music. So, overall a great B-movie entertainment.","user":"dr_bonone","rank":[9,10]},{"title":"Beathes fresh air into the Grindhouse genre. Solid gory thriller with some bad lighting n cinematography.","rating":9,"date":"14 February 2020","review":"Saw this without watching the trailer n was pleasantly surprised.\nThe poster with the old fellas with various weapons in their hands were sufficient to entice me into seeing this film.<br><br>We have Martin Kove, Stephen Lang, William Sadler, David Patrick Kelly, Fred Williamson n George Wendt.<br><br>The plot has been done umpteenth no of times but that shud not deter u from seeing this transgressively violent n deeply '70s style thriller.<br><br>The film's pacing is taut, performances r good, the gore is over the top and the only drawback is the film's lighting and cinematography, maybe the budget, but then again this shud not deter u from seeing this film.<br><br>Some of the scenes r purposely grimy with a worn-out look.\nFew attack scenes r shot in a very fast forward way with bad lighting which makes it hard to distinguish what's happening.\nThe gore effects, the camaraderie between the oldies, taut pacing n the action compensates the minor flaws.<br><br>Fans of Rio Bravo, Night Of The Living Dead, Assault On Precinct 13, Straw Dogs, Cyborg n Mulberry St. will definitely enjoy this low budget gem.<br><br>P.S. Watch out for the antlers kill scene n the knee to face smashing one.\nBy the way William Sadler needs to lose some weight n his puffy face but it was good to see him in a major role, that too with a chainsaw n driving Deuce and a Half straight into the enemy's face.","user":"Fella_shibby","rank":[36,53]},{"title":"A Man's Recipe - True Grindhouse Fun","rating":7,"date":"14 February 2020","review":"With \"Bliss\", Joe Begos shot right up to the top of my favorite horror directors, and \"VFW\" continues his wildly fun reign successfully. While it's not without its faults, \"VFW\" raises true grindhouse hell, soaked in neon, coated in the grainy 16mm aesthetic, full of gory delights &amp; led by a truly amazing, in-for-it-all veteran cast. What else could a man want?<br><br>\"VFW\" is a much too rare type of movie in our era, which is not saying much, it being universally acknowledged as an 80's throwback midnight flick, but we need more movies like this. I do. \"VFW\" is highly and undeniably entertaining from start to finish, full of splatterhouse action, practical FX mayhem, various kills and thrills - all the goodies a horror fan needs. The real attraction, however, is the movie's core cast, the 80's stars in an 80's kind of movie. Stephen Lang, Fred Williamson, Martin Kove, William Sadler and more provide snappy, relatable and just plain awesome characters having fun together and killing punks. A simple siege scenario, a classic good guys vs. bad guys idea, no twists, just a straight-forward, easily digestible fun. From a critical point of view, \"VFW\" lacks depth, feels a little disposable, has a high enough predictability factor &amp; doesn't have all that much to say, but, frankly, throughout the 90 minutes, I couldn't care less. The script by Brallier and McArdle doesn't always hit the spot, not the entirety of the grizzled, old-school me-and-the-boys dialogues come off as organic &amp; the narrative is shallow enough, but Joe Begos knows exactly how to treat it. Taking \"VFW\" on its own terms, nothing can go wrong, it's kinda like a grindhouse-indie \"The Expendables\", just cooler and with a lot more sauce.<br><br>\"VFW\", however flawed, will (and has) find its place in the heart of genre fans for it can't really fail, only in the hands of those who despise violence, old-school shenanigans &amp; everything's that awesome. Joe Begos is, without a doubt, one of the best directors working the indie scene right now &amp; I'm eager to hear what's next in store for us. My rating: 7/10","user":"TwistedContent","rank":[26,37]}]