[{"title":"So-so","rating":6,"date":"29 September 2019","review":"Nine year old Harley is celebrating his birthday. He's going to a taping of the Banana Splits TV show with his mom, stepdad, older brother and friend Zoe. The Banana Splits are actually robots under their costumes. Then, during the course of the show, they find out they're going to be canceled. They malfunction, go crazy and start attacking and killing people. Can Harley and his family escape?<br><br>It's basically a one-joke film. The premise is great but they don't let totally loose with it. It was never funny or scary enough to totally succeed. There's plenty of graphic gore and they (thankfully) use practical effects. With one exception the acting is good even by the kids. Only Steve Lund disappoints as the stepdad. He has this I-don't-want-to-be-here look on his face throughout And yes--there's room for a sequel. So not a total washout but no great movie either.","user":"preppy-3","rank":[9,9]},{"title":"What insanity! What genius!","rating":6,"date":"30 August 2019","review":"The Banana Splits\nDirected by Danishka Esterhazy. Written by Scott Thomas and Jed Elinoff<br><br>Whose idea was this? I want to be a fly on the wall during this meeting. I want to hear what transpired during the green lighting process. It must have been magical. This show hasn't been on the air in over 50 years. We're going to take it and turn it into a horror movie. This is brilliant. Not a bunch of money brilliant but genius enough to throw out there.<br><br>It was way more cynical than that. They really wanted to make a Five Nights at Freddy's movie but lost the rights to Blumhouse. Warner Brothers said to hell with it. We're going to do something similar but we will use an obscure\nHanna-Barbera show from the 60s in its place. What?! Usually when an idea like this comes down the turnpike, cocaine is to blame. Now I'm not so sure.<br><br>This is quite the oddity. It takes some time to get into the groove of it. It is also not trying to be scary in any way. It is goofy and over the top. But of course it's goofy and over the top. It's a killer kiddie show. It has to embrace it's wild roots. Silly cartoon voices for the robot characters. Glowing red eyes to indicate when they've switched to the dark side.<br><br>The gore set pieces are cartoonish in exaggeration. We've got them making use of a giant lollipop. We got the good old fashioned saw someone in half magic trick. They run the obstacle course. Death in the ball pit. They are supposed to be robots but they basically move like people in costumes. The weapons are flimsy. You laugh at it. You have to laugh at it at least a little bit.<br><br>The best part is the last twenty minutes or so. The movie takes the entire Banana Splits show and starts to make it grungy and dirty and nasty. They descend into the bowels of the studio into a hidden theater to uncover the robots have taken over everything and are unleashing gory hell. It is a magical moment. Those last twenty minutes really helped this movie get over the lack of atmosphere that permeates the beginning of the film. It is a flat looking movie until then but you can tell they made this movie quickly and for cheap. No problems here.<br><br>The acting is atrocious. The concept is goofy and laughable right from the get go. It bears all the tell tale hallmarks of a rip off. But once the Banana Splits start killing off members of the audience and the crew, it becomes a good time. The show at the end with the producer who is canceling them enacting their namesake is a treat to behold. I give this movie a C. It is worth checking out if you like your horror on the comedic side.","user":"getconedproductions09","rank":[18,20]},{"title":"Not Bad But Not Really Good Either","rating":18,"date":"18 August 2019","review":"I don't know for sure that this movie was a repurposed script for a Five Nights at Freddy's movie, but it certainly seems like it. You've got to admire the tenacity of the producer's to make a gory indie horror film based on a 60s kid show, though.<br><br>All I knew of the series had been the song, memorably covered by The Dickies, and some spot they used to show on the Boomerang network. Every once in a while you hear about an idea to make an R-Rated movie based on a kids property (like the original idea for James Gunn's Scooby Doo) but these guys actually did it. Despite the novel idea, it's more-or-less your average made-for-cable slasher movie with few exceptions.<br><br>First, the sets and costumes have a certain novelty. The juxtaposition of cartoon imagery with gory death and dismemberment has a certain charm. It's not unlike a 90s Full Moon Pictures movie in a lot of way.<br><br>And second, the performances are surprisingly good almost across the board. The script is sort of lackluster and obvious but the actors do a credible job of bringing their characters to life. For me, Dani Kind as Beth, Richard White as Stevie and Naledi Majola as Paige were all exceptional and I'd like to see them in more genre work.<br><br>Otherwise it's just OK, watchable but gets a bit tiresome after a while. I probably enjoyed the first half before the robots went berserk more than the second and that's something.","user":"jonathancupp66","rank":[23,28]}]