[{"title":"Weak character work and a too-subdued performance by Charlene Choi, however bold by her tame standards, makes this drama about sexual liberation feel impotent","rating":5,"date":"27 March 2019","review":"Much has been said about Charlene Choi's bold performance in 'The Lady Improper', which not only sees her show more skin than you would expect from someone who used to pride herself on her squeaky-clean teenage idol image, but also has her engage in a passionate love-making scene on a kitchen table-top with her Taiwanese co-star Wu Kang-jen. Yet all that hype may end up working against Choi and the movie's favour by setting up somewhat unrealistic expectations of her performance, which while certainly audacious by the actress's own tame standards, will likely come off a lot milder than what her character as well as the movie needs it to be.<br><br>Chiefly, the movie demands that we believe in the character transformation of Siu Man (played by Choi), who starts off as a sexually repressed woman unable to consuumate her marriage to her ex-husband Kuen (Deep Ng), but whose psychological inhibitions gradually dissipate after she meets the free-spirited chef Jiahao (played by Wu). Neither state is however portrayed compellingly enough in the film, such that we never fully buy into why she was so uptight in the first place, and/or therefore how her interactions with Jiahao would set her on the path to sexual liberation, even with say some pole dancing added into the mix.<br><br>A significant part of why we can never invest completely in Siu Man is due to the imperfect script (co-written by director Tsang Tsui-shan and Link Sng), which fails to find a clear raison d'etre to Siu Man's state of mind in the first place. There are late hints to how she had a very strict upbringing by her father Ping (veteran martial arts actor Lau Wing) after losing her mother at a young age, but not quite enough texture to their father-daughter relationship for us to be convinced how that has led her to be so high-strung. Similarly, it isn't clear why she seems unable to fully give herself to Kuen despite being in love with him, especially given how she seems to want him back badly enough at the start to beg him for a second chance with a mechanical dildo.<br><br>On the other hand, Siu Man's relationship with Jiahao comes off muddled, leaving us unsure just why he will be the one to unleash her passions. Is it because she is physically attracted to him? Or because she outwardly mocks, but inwardly admires, his happy-go-lucky attitude? Or is she grateful to him for rescuing her father's 'cha chaan teng' business by whipping up the restaurant's former signature dishes of Hakka-style pork belly and traditional steamed tofu? Or perhaps she is also jealous of the attractive lady (Ashina Kwok) selling ginger at the local market whom Jiahao flirts with, and whom she observes Jiahao having sex with on the kitchen stove? Whether it is one or a combination of these reasons, their relationship needs sharper definition, in order for us to be persuaded why Jiahao is her sexual elixir.<br><br>It doesn't help that the story introduces an unnecessary supporting character next to Siu Man and Jiahao in Ah Him (Alex Lam), a regular at the 'cha chaan teng' restaurant who has a big crush on Siu Man and whom she agrees to go out. Not only is Ah Him a clumsily sketched caricature, it is more than a little cruel that she seems to hook up with him just to spite Jiahao, and breaks up with him after he proves too conservative to accept her pole dancing routine. Oh yes, the movie would have been much better served simply focusing on the attraction between Siu Man and Jiahao, so as to give some much-needed clarity just what each means to the other.<br><br>To make up for the narrative deficiencies would have needed an out-and-out candid performance by the lead actress, and it is in this regard that Choi's acting, however audacious by her own standards, is still not daring enough to save the movie. Indeed, Choi is not only too restrained in displaying Siu Man's repressions at the start, but also too muted to convince us that she is both physically and emotionally liberated by the end. At the risk of sounding lewd, Choi would need to really let go for us to be captivated by her character transformation, and her discomfort at going all out both physically and emotionally (which she herself has said in numerous media interviews) dulls what should be a gripping portrait of female emancipation.<br><br>So as much as she has been the selling point of 'The Lady Improper', Choi is also the reason why the movie with its flaws and all isn't as compelling as it should be. Like we said, such a character-driven story needs tighter and sharper scripting, in order to define the central characters better as well as their focal relationship. But equally, Choi should either have chosen to strip away her own inhibitions completely or stepped away from the role, rather than end up in a 'middle ground' that is too subdued for the film's good. As it is, both the movie and her character come off less improper than impotent, and will leave you unmoved, unconvinced and unsatisfied.","user":"moviexclusive","rank":[7,9]},{"title":"A new level of bad","rating":2,"date":"30 August 2019","review":"The story is indeed nonsense in many aspects. A French cook come to hk and work in a Chinese Macdonald? The main actress character is no way she will do table dance. The appearance of the actress customer aims to express what? When I found out the actress is nominated as one of the best leading actress in hK movie award. OMG.... her acting skill is attain a highest unreasonably level of sxxking. The rating I give is credited to the French cook for his acting. Sorry, I'm mean but its so true.","user":"ks-60500","rank":[1,1]},{"title":"The Lady Improper","rating":3,"date":"18 August 2019","review":"Very much a character study on Charlene Choi's character, but the motives and desires displayed by her feels muddled and incongruent. Her character and the movie itself just isn't constructed in a way that is able to drive the film forward. While her relationship with all three male characters are different, but none of them is really significant enough to make us feel her transformation as natural. The film in the end just feels completely forgettable and the only reason the film is semi-interesting is that it is Charlene's first attempt as a character like this and plain old sexual tension. The motifs and secondary character development also feels mundane at best.","user":"jackson_ro","rank":[0,0]}]