[{"title":"Not all that original, but it's funny, somewhat relatable, has a lot of charm.","rating":7,"date":"21 March 2020","review":"I enjoyed it. It's pretty straightforward, has some great bits, and takes the A Lot Like Love approach to the romcom. The title more than indicates that. The true value is the two leads. They carry the load well.<br><br>Sam Richardson is an absolute joy to watch no matter the project so if the only thing you take from this movie is \"I gotta watch more of this guy\" then it's a success. He made Detroiters, he was in Mike and Dave need Wedding Dates, and probably best known for Veep, but he pops up Spy and The Office too. He's hilarious, so even in this movie where it could be a by-the-book rom-com road trip movie, he's elevating the script.<br><br>Brittany Snow is far more well-known at this point because of the Pitch Perfect series, but she's a little against type here, in my opinion. The movie starts playing Sam's character as a more redeemable guy with a few flaws, and Brittany's characters as an irredeemable girl with a few likeable traits and moves toward the center a bit with both. She probably has the most character development in the movie and she does a great job pulling it off.<br><br>As I said, it won't blow you away with originality, but it's got some humor, the two leads work well together, and of course has the lesson at the end. I'd watch it again with some friends no question.<br><br>PS - The racist posts about interracial relationships are pretty obviously stuck in the early 90s. Update your complaints, kids.","user":"thebumm-1","rank":[12,21]},{"title":"Great story that needs to be told more","rating":7,"date":"26 March 2020","review":"It was cute and funny. The casting was out of the box which made the ending less predictable. I love the humanness of the story and the desire of the characters to change, grow, and become better people. This was a heartfelt story told in a cute, entertaining way. Worth watching and reflecting on.\nI love the brutal honesty about addiction, support groups, and recovery. Don't see enough honesty about this stuff in movies, but when it's shown, I believe it can create a pathway for lost people to find hope and healing from what culture so often condones and promotes as happiness and fulfillment. I greatly appreciated that aspect of it.\nGreat job to everyone who worked on this film.","user":"brookecaccavale","rank":[4,6]},{"title":"Unwatchable","rating":3,"date":"20 March 2020","review":"A torture to watch,apart for Brittany's scene.\nHoped there was love.","user":"madhater1313","rank":[9,18]}]