[{"title":"surprisingly good????","rating":8,"date":"16 February 2020","review":"This movie was surprisingly entertaining. it's light and charming and the leads were adorable!!! definitely watch this if you're feeling bored and in need of some cliche romcom<br><br>PS: definitely better than 'to all the boys 2'","user":"olgameidelina","rank":[46,50]},{"title":"Light and Surprisingly Entertaining","rating":8,"date":"16 February 2020","review":"I was bored so I took the chance. I tried to watch To all the boys I loved before part 2 the other night and that was a DNF for me, maybe because there were too many unnecessary scenes that made me give up on it halfway. But this.... this was something that I needed fast paced, just right and even if the trope is a very well used trope for romance the movie still surprised me every turn. The trailer didn't reveal too much which was great, also the acting was Brill and it all felt like it was made with much love from everyone. I would definitely recommend if you wanted to watch a cheer-me-up movie.","user":"kysollesta","rank":[34,39]},{"title":"Immensely hilarious and timely.","rating":14,"date":"14 February 2020","review":"Isi &amp; Ossi was one hell of an odd experience for me. In the first minutes I really wasn't sure whether I hate it or not. In my opinion it's  hilarious for the absolute most part, and the characters somehow actually worked. The two leads in particular are perfect in here, and the dialogue as well as many of the lines are delightfully ridiculous. Also, it was pretty nice to see a movie set in a city I know, for a change. Heidelberg. That was cool. I think they did a solid job of making as much fun of it as possible. This, by the way, is the first German film to be greenlit by Netflix, and although I am sure many will dislike it, I surely had a ball watching it. I haven't laughed like that since Long Shot. Isi &amp; Ossi is a rom-com and satire as well, much like it in that regard, yet very different. But it too is about two unlikely people maybe falling in love with each other. There's certainly some elements that if taken too seriously, or even literally, will ruin the movie for you. I never did and therefore enjoyed myself tremendously. The flick isn't perfect, some things could've been handled differently, but overall I'm a fan of it. And miraculously so, because I can understand some of the problems people will have. I'm sure I'll rewatch this thing sometime next year.","user":"CitizenDevi","rank":[19,21]}]