[{"title":"Amateur Hour","rating":3,"date":"9 October 2019","review":"It didn't work for me. It seemed much more like a student film than something you'd see in a commercial theater. Not much charisma or chemistry between the actors and maybe two different sets to distract you from that. Some will probably be interested enough in the story to compensate for its shortcomings but I think for most, this will be a disappointment.","user":"jimlambrick","rank":[27,31]},{"title":"This was a religious prison drama at best, not a western movie...","rating":3,"date":"3 December 2019","review":"Right, well I was expecting to see a proper western movie here, but instead I was served a movie about a group of imprisoned mormons and the hardships of the people that want to see them brought to justice.<br><br>Yeah, not really exactly what I had imagined this movie to be. And I managed to endure 40 minutes of the ordeal that is \"Out of Liberty\" before I was Out of Patience, and simply called it quits. And there is no chance of me returning to finish the rest of this movie.<br><br>Now, it should be said that the movie does have a good production value to it, and it definitely has the era feel to it, being gritty and somewhat rough. But the movie just failed utterly on its script and storyline. I was far from being entertained by what transpired on the screen, both in terms of what took place and the characters participating in said boring events.<br><br>I am sure that there is an audience out there for a movie such as this. I just wasn't in that group. Sure, the movie may be set within the confines of what constitutes a western movie, but this was hardly a western movie in the classic (or generic) meaning of the word \"western\".<br><br>And the whole aspect of religion that simmered beneath the surface of the movie didn't really do an ounce of helping to win me over either.<br><br>My rating of \"Out of Liberty\" is a mere three out of ten stars. This was a massive swing and a miss from director Garrett Batty as in managing to entertain me. I had expected this to be a western movie, not a slow paced and rather mundane prison drama.","user":"paul_haakonsen","rank":[10,12]},{"title":"Misses the mark","rating":5,"date":"23 September 2019","review":"Not all LDS historic movies should be embraced equally. The writers claim their script is based on history, but they severely minimize or outright ignore the most significant events and treasured outcomes of this crucible of growth for the prophet of the restoration. Joseph Smith is poorly cast and is without any significant leadership, spiritual or otherwise. There is a complete absence of spiritual comradery or priesthood dignity amongst those who are supposed to portray the leadership of the church. Where is the signing of hymns? Where is the power of the significant revelations between the Lord and his prophet? Where is Joseph rising in mighty authority to rebuke the guards? Instead, the entire storyline reduces these men to average prisoners who are obsessed to digging or strategizing their escape. In spite of some excellent acting by Corbin Allred as Porter Rockwell, Jason wade as jailer Sam Tillery and Brock Roberts as Sidney Rigdon, this movie misses the mark or is downright misleading about the significance of Liberty Jail in our history.","user":"DAYStar3","rank":[20,30]}]